{
  "id": "xc_2YWYBTlTomsSBITnz",
  "document": {
    "title": "Cooney v. Park County",
    "full_title": "THOMAS RUSSELL COONEY AND LORA JOHN COONEY (PLAINTIFFS), v. PARK COUNTY, WYOMING; THE STATE OF WYOMING; THE WYOMING DEPARTMENT OF PROBATION AND PAROLE; CHRIS J. WHITE; AND ROBERT MAYOR (DEFENDANTS).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1990-04-18T00:00:00.000Z",
    "docket": "No. 88-174.",
    "body": "Appellants Thomas Russell Cooney and Lora John Cooney (Cooneys) appeal from the district court's W.R.C.P. 12(b)(6) dismissal of their complaint against appellees Deputy Park County Attorney Chris J. White, the State of Wyoming, the Wyoming Department of Probation and Parole (Department), and probation officer Robert Mayor, (appellees) alleging a civil rights claim under 42 U.S.C. § 1983 (1982), and various state claims under the Wyoming Governmental Claims Act, W.S. 1-39-101 through 1-39-108 (Cum.Supp. 1985) (Claims Act) \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e, arising out of probation revocation proceedings. The trial court dismissed all counts in the Cooneys' complaint against White on the basis that he, as a deputy county attorney, had absolute prosecutorial immunity from civil liability. It further dismissed the Cooneys' counts alleging liability under the Claims Act against the State of Wyoming, the Wyoming Department of Probation and Parole, and Robert Mayor, because it found no waiver of immunity under the Claims Act as to those parties.\n\nThe Cooneys challenge both of these rulings. We are asked to decide (1) what level of immunity under 42 U.S.C. § 1983 will we extend to a deputy county attorney who performs activities associated with those proceedings and (2) whether under the Claims Act there has been a specific waiver of sovereign immunity as to the state claims.\n\nWe affirm.\n\nI. FACTS\n\nIn 1985, Thomas Cooney pled guilty to writing bad checks in Park County, Wyoming. The district court accepted his guilty plea and sentenced him to five years of supervised probation, which required him to stay in regular contact with officers of the Wyoming Department of Probation and Parole. When sentenced, Mr. Cooney lived in Riverton, Wyoming, where his parole officer was Cindy Johnson. In September 1985, Mr. Cooney requested permission from the Department to move with his wife and child to Baroil because of a change in his job. Johnson granted Mr. Cooney permission to move and told him that he would be contacted by a Department officer in Rawlins for continued supervision under the terms of his sentence.\n\nThe Cooneys moved to Baroil in October 1985, and Johnson forwarded Thomas Cooney's file to Tracy Reinke, a Department officer in Rawlins. Unknown to the Cooneys, however, Johnson erroneously advised Reinke that Thomas Cooney and his family were now living in La Barge, Wyoming, instead of Baroil. Because of this erroneous advice, Reinke returned the Cooney file to Johnson in Riverton and instructed Johnson to forward it to the Department office in Evanston, Wyoming, the Department office with jurisdiction over probationers living in La Barge. On October 21, 1985, Johnson mailed the Cooney file to the Department office in Evanston where it was assigned to appellee Robert Mayor. After receiving the file, Mayor made unsuccessful attempts to locate Mr. Cooney in La Barge because the Cooneys were in Baroil.\n\nIn the meantime, Mr. Cooney, still unaware of the Department's foul-ups, contacted Johnson several times by telephone inquiring about the contact he expected to receive from a Department officer in Rawlins. Based on those calls, Johnson filed reports verifying Mr. Cooney's compliance with the terms of his probation in October and November of 1985. During December 1985, Mr. Cooney telephoned the Department office in Rawlins to contact Reinke about his probation.\n\nIn mid-January, 1986, Mayor contacted Johnson to inform her that he could not locate Mr. Cooney in his area. Unexplainably, Johnson told Mayor that Mr. Cooney had relocated to La Barge, Wyoming, in October 1985, and that she had not heard from him since his move. This incorrect information prompted Mayor on January 24, 1986, to call appellee Chris White, who was then deputy county attorney for Park County, Wyoming; Mayor told White that Mr. Cooney had not been in contact with his probation officers as required by the terms of his sentence and that he had moved from Riverton without Department permission. White asked Mayor to prepare a petition revoking Mr. Cooney's probation.\n\nOn January 29, 1986, Johnson telephoned Mayor and told him that the Cooneys lived in Baroil, had permission from the Department to be there, and that Mr. Cooney had been in contact with her office during October and November 1985. Mayor then telephoned White and relayed those facts to him. Despite this information, White reiterated his request that Mayor draft the petition to revoke Mr. Cooney's probation. Mayor followed White's instructions and prepared a document entitled \"Petition for Revocation of Probation and Bench Warrant\" dated January 29, 1986. In that document, and despite his contrary knowledge, Mayor swore under oath that Mr. Cooney changed his address without the Department's permission and failed to maintain contact with the Department after he moved. Mayor then forwarded the petition to White who presented it to the district court. Based on the petition, the district court issued a bench warrant for Mr. Cooney's arrest on February 7, 1986.\n\nOn February 10, 1986, Mr. Cooney sent a letter to Reinke in an effort to comply with the terms of his probation. Similar contacts between Mr. Cooney and Reinke occurred during February and March 1986. In early March, Mr. Cooney requested permission from Reinke to move to Glasgow, Montana, to accept permanent employment. On March 11, 1986, Reinke sent Mr. Cooney written permission to move. Having received this permission, the Cooneys packed their belongings and prepared to move to Montana. On March 15, 1986, a highway patrol officer stopped Mr. Cooney, his wife, and child and arrested him pursuant to the bench warrant issued because of the information provided to the district court by Mayor and White. Mr. Cooney was taken to the Park County jail; Mrs. Cooney and their child were left stranded in Baroil with all of their belongings.\n\nMr. Cooney remained in the Park County jail until April 21, 1986, when the district court released him after denying the petition to revoke his probation. During his incarceration White and Mayor did nothing to inform the district court of their knowledge concerning Mr. Cooney's compliance with the terms of his probation. They also did nothing to help get Mr. Cooney out of jail. In fact, during the time that Mr. Cooney was incarcerated, an attorney with the Park County Public Defender's office requested that Mr. Cooney be released from jail until a hearing could be held to determine the accuracy of the information underlying the arrest warrant. White refused to honor that request.\n\nAfter the Cooneys filed the necessary claim \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e under the Claims Act, they filed suit. The defendants responded with motions to dismiss under W.R.C.P. 12(b)(6). The district court granted the motions. The Cooneys appealed.\n\nII. ANALYSIS\n\nA. Standard of Review\n\nWhen reviewing a W.R.C.P. 12(b)(6) dismissal, we accept the facts alleged in the complaint as true and view them more favorably toward the party opposing the motion below. Mummery v. Polk, 770 P.2d 241, 243 (Wyo. 1989). A motion under this rule tests the legal sufficiency of the complaint, should be granted sparingly by the district courts and generally is not favored on appeal. Id. We recognize that a § 1983 action should not be dismissed upon the pleadings \"unless it appears beyond doubt that plaintiff can prove no set of facts in support of his claim which would entitle him to relief.\" Joseph v. Patterson, 795 F.2d 549, 551 (6th Cir. 1986) (citing Conley v. Gibson, 355 U.S. 41, 45-46, 78 S.Ct. 99, 1001-02, 2 L.Ed.2d 80, 84 (1957)).\n\nB. Absolute Immunity for White\n\n1. Imbler and Blake\n\nThe district court dismissed the § 1983 claim against White under W.R.C.P. 12(b)(6) after ruling that White's status as a prosecuting attorney made him absolutely immune from suit, regardless of whether his actions actually deprived Mr. Cooney of a constitutional right, privilege, or immunity. The district court relied on Imbler v. Pachtman, 424 U.S. 409, 96 S.Ct. 984, 47 L.Ed.2d 128 (1976) and this court's application of Imbler in Blake v. Rupe, 651 P.2d 1096 (Wyo. 1982), cert. denied, 459 U.S. 1208, 103 S.Ct. 1199, 75 L.Ed.2d 442 (1983). It interpreted both of those cases as granting prosecutor White absolute immunity from civil liability under 42 U.S.C. § 1983 for public policy reasons. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe plain language of 42 U.S.C. § 1983 is deceptively simple because it makes no mention of immunity from liability. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The appellate history of the provision, however, reveals that its application necessarily invokes traditional common-law defenses of official immunity which extend absolute immunity to prosecutors in certain situations. Imbler, 424 U.S. at 418, 96 S.Ct. at 989, 47 L.Ed.2d at 136 (citing Tenney v. Brandhove, 341 U.S. 367, 71 S.Ct. 783, 95 L.Ed. 1019 (1951)). See also Yaselli v. Goff, 275 U.S. 503, 48 S.Ct. 155, 72 L.Ed. 395 (1927).\n\nImbler involved a § 1983 action in which Imbler, an exonerated criminal defendant, sought damages against a prosecuting attorney for the prosecutor's alleged knowing use of false testimony and suppression of material evidence to obtain an illegal conviction. Imbler, 424 U.S. at 415-16, 96 S.Ct. at 987-88, 47 L.Ed.2d at 134-35. The prosecutor successfully moved for dismissal under F.R.C.P. 12(b)(6) on the ground that he was absolutely immune from civil liability and the Ninth Circuit affirmed. Id., 424 U.S. at 416, 96 S.Ct. at 988, 47 L.Ed.2d at 135. On certiorari review of that dismissal, the United States Supreme Court addressed the issue of whether a prosecutor is absolutely immune from civil liability under § 1983 by focusing on the various functions that a prosecutor serves in society and the balance which must exist between protecting the integrity of those functions and protecting private citizens from prosecutorial abuse. Id., 424 U.S. at 421-24, 96 S.Ct. at 990-92, 47 L.Ed.2d at 138-40. After completing this review, the Court held:\n\nIt remains to delineate the boundaries of our holding. As noted, the Court of Appeals emphasized that each of respondent's challenged activities was an \"integral part of the judicial process.\" The purpose of the Court of Appeals' focus upon the functional nature of the activities rather than respondent's status was to distinguish and leave standing those cases, in its Circuit and in some others, which hold that a prosecutor engaged in certain investigative activities enjoys, not the absolute immunity associated with the judicial process, but only good-faith defense comparable to the policeman's. We agree with the Court of Appeals that respondent's activities were intimately associated with the judicial phase of the criminal process, and thus were functions to which the reasons for absolute immunity apply with full force. We have no occasion to consider whether like or similar reasons require immunity for those aspects of the prosecutor's responsibility that cast him in the role of an administrator or investigative officer rather than that of advocate. We hold only that in initiating a prosecution and in presenting the State's case, the prosecutor is immune from a civil suit for damages under § 1983.\n\nId., 424 U.S. at 430-31, 96 S.Ct. at 994-95, 47 L.Ed.2d at 143-44 (citations and footnotes omitted).\n\nCourts and commentators generally agree that this holding structured a functional analysis. Cleavinger v. Saxner, 474 U.S. 193, 201, 106 S.Ct. 496, 501, 88 L.Ed.2d 507, 514 (1985). This court adopted the functional analysis in Blake. In Blake this court extended absolute immunity to a county and prosecuting attorney who employed and supervised an investigator to check both court and penitentiary records, investigated matters preliminary to initiating the prosecution, and presented the prosecution of the state's case of perjury charges against a juror. Blake, 651 P.2d at 1104. Relying on Imbler and decisions following that case, this court determined that the prosecutor's challenged activities were intimately associated with the judicial phase of the criminal process. In that regard, this court found it significant that the ill-fated prosecution concerned possible \"perjury by a prospective juror, arising in a judicial proceeding by failure to disclose [on voir dire examination] a conviction of felony.\" Id. at 1106. In this court's view, the integrity of the judicial process was at stake in the prosecutor's performing the investigative function. Therefore,\n\nnot only do we have an investigation involving the initiation of a criminal prosecution, but a prosecution resulting from alleged in-court perjury. We therefore find a greater involvement of the judicial function than the usual investigation by a prosecutor in preparation for initiation of the criminal process by filing of a complaint and trial.\n\nId. at 1106.\n\nThe functional analysis requires a cautious judicial application because \"[a]bsolute immunity flows not from rank or title or `location within the Government,' but from the nature of the responsibilities of the individual official.\" Cleavinger, 474 U.S. at 201, 106 S.Ct. at 501, 88 L.Ed.2d at 514 (emphasis added; citation omitted). It probes the character of the ultimate decisions required by any prosecutor who would make decisions in the situation in question; allegations of malice, self-interest, vindictiveness and the like will not defeat absolute immunity for protected prosecutorial functions. Myers v. Morris, 810 F.2d 1437, 1446 (8th Cir.), cert. denied, 484 U.S. 828, 108 S.Ct. 97, 98 L.Ed.2d 58 (1987); Ybarra v. Reno Thunderbird Mobile Home Village, 723 F.2d 675, 678 (9th Cir. 1984), and numerous cases cited therein. Therefore, the reviewing court must not allow its focus on the functional character of the prosecutorial conduct at issue to be skewed by an emotional response to a particularly abusive fact situation. There is no bad faith exception to absolute prosecutorial immunity for prosecutorial conduct that meets the Imbler requirements. See Imbler, 424 U.S. at 427, 96 S.Ct. at 993, 47 L.Ed.2d at 141. See also Taylor v. Kavanagh, 640 F.2d 450, 452 (2d Cir. 1981), cert. denied sub nom. Barbera v. Schlessinger, ___ U.S. ___, 109 S.Ct. 1338, 103 L.Ed.2d 808 (1989) (soliciting and suborning perjured testimony does not create liability in damages for prosecutorial conduct functionally qualifying for absolute immunity under Imbler); Lee v. Willins, 617 F.2d 320, 322 (2d Cir.), cert. denied, 449 U.S. 861, 101 S.Ct. 165, 66 L.Ed.2d 78 (1980) (falsifying evidence and coercing perjured testimony); Campbell v. State of Maine, 787 F.2d 776, 778 (1st Cir. 1986).\n\nThe functional approach has proven to be a somewhat difficult standard to apply because of the limited scope of the Imbler holding. In Imbler, the Court recognized there would be administrative and investigative prosecutorial conduct not done in furtherance of a prosecutorial function that demands the protection of absolute immunity. Imbler, 424 U.S. at 430-31, 96 S.Ct. at 995, 47 L.Ed.2d at 143-44. See also Butz v. Economou, 438 U.S. 478, 513-16, 98 S.Ct. 2894, 2914-16, 57 L.Ed.2d 895, 920-22 (1978) (certain federal administrative officers are entitled to absolute immunity when they function analogous to prosecutorial functions protected under Imbler). However, the Court expressly reserved an explanation of the difference between the two classes of conduct noting only that: \"Drawing a proper line between these functions may present difficult questions, but this case does not require us to anticipate them.\" Id., 424 U.S. at 431, 96 S.Ct. at 995, 47 L.Ed.2d at 144 n. 33. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e As the following discussion will illustrate, federal and state courts have been wrestling with those difficult questions ever since. The Eleventh Circuit recently remarked \"[t]he dividing line is amorphous, and the process of determining on which side of the line particular kinds of conduct fall has proceeded on a case-by-case basis.\" Marx v. Gumbinner, 855 F.2d 783, 789 (11th Cir. 1988). The Cooneys' § 1983 action against prosecutor White requires that we venture into this difficult legal terrain.\n\nIn their appeal the Cooneys contend that the deputy county attorney's wrongful conduct was his decision to have Mr. Cooney arrested and detained in jail for thirty-eight days. They argue that the deputy county attorney's activities of assisting the Department, of using the perjured probation revocation petition to obtain a bench warrant for Mr. Cooney's arrest, and of causing Mr. Cooney to be arrested and detained were administrative in nature and not the functional equivalent of the prosecutor's role as an advocate in a criminal proceeding. If they are correct, the deputy county attorney enjoys qualified, not absolute, immunity in their civil rights action.\n\n2. Application of Imbler and Blake\n\nAgainst the backdrop of Imbler and Blake, we must determine whether the deputy county attorney's challenged activities \"were intimately associated with the judicial phase of the criminal process,\" and, therefore, were \"functions to which the reasons for absolute immunity apply with full force.\" Imbler, 424 U.S. at 430, 96 S.Ct. at 995, 47 L.Ed.2d at 143.\n\nProbation Revocation as part of Criminal Proceedings\n\nWithout question, the sentencing court's granting of probation, supervision of the probationer's service of probation, and involvement in probation revocation proceedings are well within the judicial phase of the criminal process. \"Probation\" is defined as \"a sentence not involving confinement which imposes conditions and retains authority in the sentencing court to modify the conditions of the sentence or to resentence the offender if he violates the conditions.\" W.S. 7-13-401(a)(x) (emphasis added). To assist the sentencing judge in his consideration of whether to grant probation to an offender, the judge may direct the prosecuting attorney or the state probation and parole officer to investigate and report to him concerning factors which he may weigh. W.S. 7-13-303. The sentencing judge may place the offender on probation under such terms as the judge deems appropriate. W.S. 7-13-302, 304, 305. \"The sentencing judge has continuing jurisdiction over a probationer and inherent power to revoke probation granted. Knobel v. State [576 P.2d 941, 943 (Wyo. 1978)]; State v. Reisch ([491 P.2d 1254, 1255 (Wyo. 1971)]) * * *.\" Smith v. State, 598 P.2d 1389, 1390 (Wyo. 1979). In Smith we recognized, \"a trial judge's sentencing duties in a particular case are not over and a criminal case wherein probation is granted not closed until a defendant has satisfactorily served his probation period or his probation revoked.\" Id. at 1391. We further observed that\n\nprobation is a matter over which the sentencing judge takes a personal hand. His decision is one that he has made upon the basis of his own judgment of the defendant's potential. He has retained control over the defendant's conduct because of an intimate acquaintance with defendant as a person gained through his own observation in the courtroom and a special study of his background. No one is in a better position than the sentencing judge to accomplish the objects of probation and keep track of its progress. The supervision of probation, through his probation officers, is one of the most important duties performed by the trial judge. It is one of his functions in which he cannot be completely impersonal. So there are compelling reasons for the particular judge allowing probation to trace and retain an individual concern over each defendant in whom he has placed his confidence.\n\nThe probation revocation proceeding of February, 1979, was only a continuation of the guilty plea proceedings held in June, 1978 * * *.\n\nId.\n\nWith respect to the institution of probation revocation proceedings, if either the state probation and parole officer or a county attorney determines that consideration should be given to retaking or reincarcerating a probationer who allegedly has violated a condition of probation, then that officer or county attorney shall notify the court. W.S. 7-13-408(a). Gronski v. State, 700 P.2d 777, 778 (Wyo. 1985); Minchew v. State, 685 P.2d 30, 31 (Wyo. 1984); Weisser v. State, 600 P.2d 1320, 1323 (Wyo. 1979); Smith, 598 P.2d at 1390; and Knobel v. State, 576 P.2d 941, 943 (Wyo. 1978). Either a probation officer or a county attorney may initiate the revocation proceedings:\n\nin both instances the request for revocation [is] directed to the judge and, based upon the showing in the petition, it [is] the judge who [decides] whether or not to issue a warrant for the apprehension of the defendant. Furthermore, in both instances, it [is] the court that [decides] the ultimate revocation issue.\n\nWeisser, 600 P.2d at 1323. Just as the granting of probation is addressed to the sound discretion of the sentencing judge, so is its revocation. Gronski, 700 P.2d at 778.\n\nOur statutory provisions and our case law provide the proper due process protections to which a probationer faced with possible probation revocation is entitled. Among the many safeguards which our law affords the probationer in that circumstance are rights to written notice of the nature and content of the allegations, a probable-cause hearing before a judge, an opportunity to consult with any persons whose assistance he reasonably desires, confront and examine any person who has made allegations against him, counsel, present evidence on his own behalf, and a decision on the merits by the sentencing judge who makes a conscientious judgment after hearing the facts. See W.S. 7-13-305, 408; W.S. 7-6-104; Gagnon v. Scarpelli, 411 U.S. 778, 93 S.Ct. 1756, 36 L.Ed.2d 656 (1973); Minchew, 685 P.2d at 31-32. Although the decision to revoke probation is not based upon a \"beyond a reasonable doubt\" standard of proof, the sentencing judge's revocation decision is reviewable under an abuse of discretion standard. Longwell v. State, 705 P.2d 336, 338 (Wyo. 1985); and Minchew, 685 P.2d at 32.\n\nIn light of this review of the nature and substance of the imposition, supervision and revocation of probation under Wyoming law, we reject the Cooneys' arguments that Mr. Cooney's criminal case was closed and his criminal proceedings were at an end when deputy county attorney White performed his challenged activities. Although it is true that \"[a] probation revocation hearing is not a trial on a new criminal charge,\" we recognize it is \"an extension of the sentencing procedure resulting from conviction of the basic charge, coupled with\" the probationer's due process entitlements. Minchew, 685 P.2d at 31. As we have shown, from the granting of probation through the supervision of probation to the revocation of probation, the sentencing judge has continuing jurisdiction over the probationer during the sentencing stage of the criminal proceeding. Without a doubt, this sentencing stage is an integral part of the judicial phase of the criminal process. We emphasize and add to that said earlier: \"The supervision of probation, through his probation officers [and, we would add, the county attorney] is one of the most important duties performed by the trial judge.\" Smith, 598 P.2d at 1391.\n\nIntimate Association of Prosecutor's Activities With Judicial Phase of Criminal Process\n\nIn our foregoing review of this important sentencing stage of the judicial phase of the criminal process, we have specifically referred to the roles played by the probation officer and the county attorney. As we have shown, under Wyoming law these officials perform vital activities of informing the sentencing judge of possible probation violations and of presenting them to the judge under the probation revocation procedures. Due process safeguards abound during this stage when the judge receives the petition for revocation from the county attorney \"and, based thereon, gives probable-cause consideration to the issuance of an arrest warrant, and thereafter conducts a hearing with the probationer present.\" Weisser, 600 P.2d at 1323. Viewing deputy county attorney White's challenged activities in this perspective, we reject the Cooneys' argument that his challenged activities are not the functional equivalent of the prosecutor's role as an advocate in a criminal proceeding. We are convinced that his challenged activities are advocatory and \"intimately associated with the judicial phase of the criminal process\" and, therefore, \"are functions to which the reasons for absolute immunity apply with full force.\" Imbler, 424 U.S. at 430, 96 S.Ct. at 995, 47 L.Ed.2d at 143.\n\nWe find substantial support for our conviction in several decisions in the federal circuit courts of appeal. In Harris v. Menendez, 817 F.2d 737 (11th Cir. 1987), an action under 42 U.S.C. § 1983, the court relied on Imbler and extended absolute immunity to a state's attorney who allegedly perjured himself and conspired with the judge and a deputy sheriff to have the probationer arrested without probable cause and to have his probation revoked. In Allen v. Thompson, 815 F.2d 1433 (11th Cir. 1987) (per curiam), a civil rights action, the court extended absolute immunity to a United States Attorney and an assistant United States Attorney who, at the Federal Parole Commission's request, wrote a letter to the Bureau of Prisons and the Parole Commission allegedly falsely advising that a prisoner was guilty of additional drug trafficking for which he had not been charged or convicted, which resulted in the prisoner's parole eligibility date being enlarged and the prisoner's being reclassified to receive special monitoring. Finding that the federal prosecutor's activity of submitting information to the Federal Parole Commission falls within Imbler's protection, the Court explained:\n\na probation officer is entitled to immunity when preparing and submitting a presentence report in a criminal case. We noted that \"[t]he report is an integral part of the sentencing process, and in preparing the report the probation officer acts at the direction of the court.\"\n\nHere, the prosecutor responsible for [the prisoner's] case forwarded information about [the prisoner] to the Parole Commission at the Commission's request. This duty is assigned to the U.S. attorney's office as part of its role in the prosecution and sentencing of federal cases. Parole decisions are the continuation of the sentencing process, and the Assistant United States Attorney's reports to the Parole Commission are part of that process. While not undertaken literally at the direction of the court, these activities are so intimately associated with the judicial phase of the criminal process as to cloak the prosecutors with absolute immunity from suits for damages.\n\nId. at 1434.\n\nIn Hamilton v. Daley, 777 F.2d 1207 (7th Cir. 1985), an action under 42 U.S.C. § 1983, the court gave absolute immunity to an assistant state's attorney who allegedly forced two complaining witnesses to testify although he knew their testimony would be false and who allegedly caused an arrest warrant to issue for an alleged probation violation. Relying on Imbler, the court said: \"Probation revocation is a criminal proceeding. Prosecutors are absolutely immune from suit for initiating a prosecution and presenting the state's case.\" Hamilton, 777 F.2d at 1213. Addressing the probationer's claim about the arrest warrant, the court observed, \"* * * we have long held that securing the attendance of witnesses is associated with the judicial process and that any claim against a prosecutor arising from that activity is barred by absolute immunity. Daniels v. Kieser, 586 F.2d 64, 69 (7th Cir. 1978), cert. denied, 441 U.S. 931, 99 S.Ct. 2050, 60 L.Ed.2d 659 (1979).\" Id. See also, Taylor v. Jones, 121 Cal.App.3d 885, 175 Cal.Rptr. 678 (1981), where the court extended absolute immunity to county district attorneys who, allegedly motivated by racial prejudice, were involved in revoking probation.\n\nIn our review of the more recent decisions of the federal circuit courts of appeals, we find the following courts extending absolute immunity to prosecutors who make decisions in connection with the initiation of criminal proceedings:\n\nFirst Circuit\n\nCampbell v. State of Maine, 787 F.2d 776 (1st Cir. 1986) (prosecutor withholding exculpatory information in presenting case; bad faith exception does not exist).\n\nMalachowski v. City of Keene, 787 F.2d 704 (1st Cir.), cert. denied, 479 U.S. 828, 107 S.Ct. 107, 93 L.Ed.2d 56 (1986) (city attorney prosecuting juvenile delinquency proceeding).\n\nSecond Circuit\n\nBaez v. Hennessy, 853 F.2d 73 (2d Cir. 1988), cert. denied, ___ U.S. ___, 109 S.Ct. 805, 102 L.Ed.2d 796 (1989) (assistant district attorney mistakenly initiated grand jury indictment and filed it with the court which later dismissed it when mistake was discovered).\n\nBarr v. Abrams, 810 F.2d 358 (2d Cir. 1987) (assistant state attorney general initiated criminal contempt proceeding and obtained arrest warrant leading to an unlawful arrest and imprisonment before charges dropped).\n\nSixth Circuit\n\nJoseph v. Patterson, 795 F.2d 549 (6th Cir. 1986), cert. denied, 481 U.S. 1023, 107 S.Ct. 1910, 95 L.Ed.2d 516 (1987) (state prosecutors allegedly knowingly obtained issuance of criminal complaints and arrest warrants based on false, coerced statements).\n\nSeventh Circuit\n\nHenderson v. Lopez, 790 F.2d 44 (7th Cir. 1986) (assistant state's attorney on whose legal advice county sheriff unwarrantedly arrested and jailed plaintiff who had earlier satisfied a contempt citation for failure to pay child support).\n\nEighth Circuit\n\nCasey-El v. Hazel, 863 F.2d 29 (8th Cir. 1988) (state prosecutor allegedly withheld ballistics test results that would have established accused's innocence).\n\nWilliams v. Hartje, 827 F.2d 1203 (8th Cir. 1987) (county prosecutor allegedly concealed autopsy report and threatened an eyewitness into giving false testimony at coroner's inquest into a black prisoner's death at the hands of his white jailers).\n\nMyers v. Morris, 810 F.2d 1437 (8th Cir.), cert. denied, 484 U.S. 828, 108 S.Ct. 97, 98 L.Ed.2d 58 (1987) (county prosecutor allegedly knowingly offered false, misleading or perjured testimony and destroyed evidence, and without adequate investigation initiated and presented case in child sexual abuse proceedings).\n\nNinth Circuit\n\nMcCarthy v. Mayo, 827 F.2d 1310 (9th Cir. 1987) (special deputy attorneys general initiated criminal proceedings allegedly with knowledge that the statute of limitations had run).\n\nAshelman v. Pope, 793 F.2d 1072 (9th Cir. 1986) (alleged conspiracy between judge and prosecutor to predetermine outcome of a judicial proceeding).\n\nDemery v. Kupperman, 735 F.2d 1139 (9th Cir. 1984) (state deputy attorney general allegedly induced witnesses to testify falsely in connection with medical license revocation administrative proceedings).\n\nTenth Circuit\n\nMeade v. Grubbs, 841 F.2d 1512 (10th Cir. 1988) (state attorney general failed to initiate a civil or criminal complaint against certain state officials for their alleged physical violence toward and denial of medical care for a prisoner in their custody).\n\nMartinez v. Winner, 771 F.2d 424 (10th Cir. 1985) (prosecutor failed to investigate independently a suspect's guilt).\n\nLerwill v. Joslin, 712 F.2d 435 (10th Cir. 1983) (city attorney initiated a prosecution for violations of state law he was not authorized to invoke; procured an arrest warrant from a justice of the peace who did not follow required state procedure in issuing the warrant, and advocated excessive bail before a magistrate).\n\nEleventh Circuit\n\nMarx v. Gumbinner, 855 F.2d 783 (11th Cir. 1988) (state attorney and assistant state attorney caused father to be arrested and jailed without probable cause when later blood tests revealed father could not have been the one who had sexually assaulted his four-year old daughter).\n\nWith reference to the level of immunity accorded probation officers involved in probation revocation proceedings, we note that the Fifth Circuit recently extended absolute immunity to parole officers. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In Farrish v. Mississippi State Parole Board, 836 F.2d 969 (5th Cir. 1988), an action under 42 U.S.C. § 1983, the parolee was arrested on warrant issued by a municipal judge. A few days later, the parolee's parole officer issued a paroled prisoner arrest warrant causing the parolee to be detained without bond. At his informal preliminary hearing the parolee requested the presence of the complaining witness. The parole officer and hearing officer said they could not compel the witness's appearance. That witness did not appear; however, that witness's hearsay statement was presented along with other evidence. The hearing officer found probable cause to exist. The parolee was held in custody for the final revocation hearing before the state parole board. At that final hearing, held a month after preliminary hearing, the complaining witness did not appear and the parole board found no reasonable cause to revoke the parolee's parole. The court concluded that the parole officer's challenged activities were prosecutorial in nature and deserving of absolute immunity. Using Imbler's \"functional\" approach, the court determined that \"the parole revocation process is indistinguishable from the initial parole process and, arguably, is even more adjudicatory in nature.\" Id., at 974. Contra, Ray v. Pickett, 734 F.2d 370 (8th Cir. 1984) (federal probation officer who allegedly falsified parole violation report given only qualified immunity; however, the federal probation revocation scheme in question was administrative in nature and substance, unlike Wyoming's, which is judicial); and Galvan v. Garmon, 710 F.2d 214 (5th Cir. 1983) (the court held that a state probation officer, who mistakenly prepared a motion to revoke probation and caused the probationer to be arrested and jailed for twenty days, was entitled to only qualified immunity). The Galvan court failed to explain satisfactorily why it believed the probation revocation stage of the criminal process was less intimately associated with the judicial phase than the presentence stage. Both the presentence stage and the probation revocation stage are intimately associated with the judicial phase of the criminal process under Wyoming law.\n\nAs we are not called upon in this case to decide the appropriate level of immunity to which a probation officer is entitled, under the circumstances of this case we need not further discuss Ray, Galvan, or the similar case of Wolfel v. Sanborn, 691 F.2d 270 (6th Cir. 1982) (per curiam), cert. denied, 459 U.S. 1115, 103 S.Ct. 751, 74 L.Ed.2d 969 (1983), urged on us by the Cooneys as analogically supportive of their position. As we have explained, in view of the nature and substance of the sentencing procedure and the probation, supervision and probation revocation stages within that procedure, and in view of the closely related roles within that procedure played by the sentencing judge, the probation officer and the county attorney, the county attorney's challenged activities are advocatory, not administrative, and are intimately associated with the judicial phase of the criminal process.\n\nBecause both the probation revocation stage and the presentence stage of the sentencing procedure are intimately associated with the judicial phase of the criminal process, we find further substantial support for our holding in the numerous decisions extending absolute immunity to probation officers involved in the presentence stage of the sentencing process. Federal probation officers have been held absolutely immune in their preparation and submission of presentence reports. See Dorman v. Higgins, 821 F.2d 133 (2d Cir. 1987); Tripati v. United States Immigration and Naturalization Service, 784 F.2d 345 (10th Cir. 1986), cert. denied, 484 U.S. 1028, 108 S.Ct. 755, 98 L.Ed.2d 767 (1988); Spaulding v. Nielsen, 599 F.2d 728 (5th Cir. 1979). State probation officers have been held absolutely immune for their preparation and submission of presentence reports in other courts. Turner v. Berry, 856 F.2d 1539 (D.C. Cir. 1988); Demoran v. Witt, 781 F.2d 155 (9th Cir. 1985); Burkes v. Callion, 433 F.2d 318 (9th Cir. 1970); Friedman v. Younger, 282 F. Supp. 710 (C.D.Cal. 1968) (also extending absolute immunity to district attorneys); Hughes v. Chesser, 731 F.2d 1489 (11th Cir. 1984), Shelton v. McCarthy, 699 F. Supp. 412 (W.D.N.Y. 1988). The Shelton court identified three factors which justify absolute immunity for state probation officers acts involving presentence reports: (1) the nature of the function performed, (2) the impossibility of guaranteeing the accuracy of the information to be reported, and (3) the routine adversary review and judicial scrutiny of the reports. We think these last mentioned factors are equally applicable to the probation revocation stage and lend support to extending absolute immunity to the county attorneys who prepare and present petitions for revocation of probation to the judge. Shelton, 699 F. Supp. at 415.\n\nThe Ninth Circuit's reasoning in Demoran which afforded immunity to a state probation officer who allegedly deliberately falsified a presentence report, applies as well to the deputy county attorney in this case. This reasoning is closely paralleled by the Tenth Circuit's Tripati opinion, which involved a federal probation officer. Applying that reasoning here, we believe that the deputy county attorney's challenged activities serve a function integral to the independent judicial process. He acts as an arm of the sentencing judge. He is required by law to investigate and report to the judge upon the circumstances of any possible probation violation. The prospect of damage liability under 42 U.S.C. § 1983 would seriously erode the county attorney's ability to carry out his independent fact-finding function and thereby impair the sentencing judge's ability to carry out his judicial duties.\n\nA plethora of procedural safeguards surrounds the filing of a probation revocation petition. The petition is reviewed by the judge who makes an ex parte probable-cause determination. The probationer receives a copy of the petition and is entitled to counsel, to consult with persons whose assistance he reasonably desires, to confront complaining witnesses, to present evidence on his own behalf and to the sentencing judge's decision on the merits after conscientiously hearing the facts. In addition to that first level of judicial review, the probationer is afforded review by this court to ensure that the sentencing judge's revocation decision was not the result of an abuse of sound discretion.\n\nWe believe it evident that a deputy county attorney who assists the court in making these determinations during the sentencing process is performing activities which are exclusively for the benefit of the court. We hold, therefore, that these challenged activities are intimately associated with the judicial phase of the criminal process and are functions to which the reasons for absolute immunity apply with full force. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nWe close our discussion of this issue with these words:\n\nThe purpose of absolute immunity is to protect the function of the prosecutor as the key participant in the criminal process. The doctrine involves a choice between protecting all prosecutors from harassing lawsuits over their official acts and providing redress for all injuries occasioned by those acts. When such a choice is made in the law, it is inevitable that someone will be hurt. But the choice must be made, and it has been long decided that it is better to allow a few wrongs to go unredressed than to expose all prosecutors to the risk of retaliation for their occasional honest mistakes. Gregoire v. Biddle, 177 F.2d 579, 581 (2d Cir. 1949) (L. Hand, J.), cert. denied, 339 U.S. 949, 70 S.Ct. 803, 94 L.Ed. 1363 (1950).\n\nWilliams, 827 F.2d at 1208.\n\nC. Claims Act Immunity for All Appellees\n\nThe district court dismissed the Cooneys' state tort claims against all of the appellees after it concluded that no statutory waiver of sovereign immunity existed under the Claims Act upon which those claims could be based. The Claims Act did not create new causes of action against the State of Wyoming, its employees, agencies, or political subdivisions; rather, it statutorily affirmed the idea that those parties generally enjoy sovereign immunity from civil liability with the exception of certain conduct for which that immunity is specifically waived. Pickle v. Board of County Commissioners of County of Platte, 764 P.2d 262, 266 (Wyo. 1988). Cf. Oroz v. Board of County Commissioners of Carbon County, 575 P.2d 1155, 1159 (Wyo. 1978). The Claims Act provides a \"close-ended\" waiver of immunity from liability, and an injured party suing an arm of the State of Wyoming under the Act must first establish that the conduct complained of fits into a specific statutory waiver of immunity for liability. W.S. 1-39-104(a); Abelseth v. City of Gillette, 752 P.2d 430, 433 (Wyo. 1988) (citing Boehm v. Cody Country Chamber of Commerce, 748 P.2d 704, 709 (Wyo. 1987)).\n\nAppellees rested their motion to dismiss the Cooneys' state tort claims on the assertion that the conduct complained of did not fit into any of the enumerated exceptions to immunity. They argued that the only applicable exception the Cooneys could assert would be the one set out in W.S. 1-39-112 (Cum.Supp. 1985), which provided: \"A governmental entity is liable for damages resulting from tortious conduct of law enforcement officers while acting within the scope of their duties.\" (emphasis added). See 1986 Wyo. Sess. Laws ch. 74, § 2. Appellees also argued that a plain interpretation of this statute would be proper in light of this court's opinion in Hurst v. State, 698 P.2d 1130, 1132-33 (Wyo. 1985).\n\nIn Hurst, we faced the issue whether the plain language of the same statute subjected members of the Wyoming State Board of Parole or its parole officers to civil liability for their alleged negligence in allowing a parolee to leave the state, after which he committed numerous murders. This court's analysis in Hurst noted that the legislature had not given the phrase \"law enforcement officers\" a statutory definition. Hurst, 698 P.2d at 1133. This court resolved that problem by looking to the plain meaning of \"law enforcement officer\" which led us to the phrase \"peace officer.\" Id. That phrase indicated a legislative intent to limit peace officers to those persons with the direct authority to make arrests or keep the peace, and this court upheld the trial court's determination that parole officers were not vested with that kind of authority. That interpretation of the plain language of W.S. 1-39-112 (Cum.Supp. 1985) was also compared with case law from other jurisdictions defining the class of persons considered law enforcement officers, which case law generally supported that distinction. Id. at 1134. Relying on this information this court held that the waiver of sovereign immunity under the phrase \"law enforcement officer\" did not extend to the Parole Board or its officers. Id. Appellees have asserted that under either the unambiguous language of W.S. 1-39-112, or the holding in Hurst, or both, no statutory waiver of immunity existed to allow the Cooneys' state tort claims.\n\nThe Cooneys have countered those arguments by urging a broader waiver of sovereign immunity under W.S. 1-39-112, premised on a review of its subsequent legislative history. They explained that this court published its opinion in Hurst in April 1985. In the next year, during the 1986 legislative session, the legislature amended W.S. 1-39-112 by substituting the phrase \"peace officers\" for \"law enforcement officers.\" That amendment became effective on March 18, 1986, three days after Mr. Cooney was incarcerated. The Cooneys further noted that the amendment went on to provide for an automatic repealer that would change the phrase \"peace officers\" back to \"law enforcement officers\" effective June 16, 1988. See 1986 Wyo. Sess. Laws ch. 74, § 4. The Cooneys theorized that this legislative maneuver was intended to create a two year time period during which the legislature could set up a state self-insurance program to provide monies to be available to pay for the liability of a \"peace officer.\" See W.S. 1-41-101 through 1-41-111 (Cum.Supp. 1986). They also argued that the 1986 amendment's automatic resuscitation of the phrase \"law enforcement officer\" into the current version W.S. 1-39-112 stands as evidence of legislative intent to give that phrase a broader meaning than the one articulated by this court in Hurst. Under this line of reasoning, they concluded that the legislature intended the phrase \"law enforcement officers\" in W.S. 1-39-112 to have a broader meaning from the inception of the statute and that it waived tort sovereign immunity for the appellees in this case and any other governmental officials who assert a more general authority to enforce the laws.\n\nThe district court considered the arguments of both parties on this issue and ruled for appellees. In its decision letter it rejected the Cooneys' approach to statutory interpretation of W.S. 1-39-112, and dismissed their state tort claims against all appellees finding them to be barred by sovereign immunity.\n\nIn this appeal, the Cooneys advance essentially the same arguments they made before the district court and candidly request that we overrule our decision in Hurst to reach the result they desire. The Cooneys' theory is creative, but, stripped of its trappings, advocates placing this court in the role of legislative clairvoyant when the unambiguous language of the controlling statute, W.S. 1-39-112, plainly does not waive tort immunity for persons who are not \"law enforcement officers\" as we defined that phrase in Hurst. The legislative intent that might have been lurking behind recent changes to the language in W.S. 1-39-112 is not a substitute for upholding a plain reading of an unambiguous statute. Hurst does that, and stare decisis demands that we follow Hurst in this case. We do not see any statutory waiver of sovereign immunity for appellees under the plain language of W.S. 1-39-112. We affirm the district court's W.R.C.P. 12(b)(6) dismissal of the appellants' complaint.\n\nURBIGKIT and MACY, JJ., filed dissenting opinions.\n\nURBIGKIT, Justice, dissenting.\n\nI. THE ISSUE IN PERSPECTIVE\n\nThis case questions whether society provides a remedy when public officials commit perjury, suborn perjury and acknowledge commission of perjury in the pointless and almost random incarceration of a person without justification. In refusing to consider only disbarrment, censure or criminal prosecution, none of which will occur, I will not reject civil damages for at least an attainable alternative. This is civil war; not by members of the society against the government, but by representatives of government against its citizens. This is statism \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e at its worst. This is the story of Thomas Russell Cooney who was unjustly arrested and thrown into jail for thirty-eight days without any court appearance upon a complaint intentionally based on false if not perjurious statements of government employees. This is absolute immunity for official misconduct defined as \"`entitlement not to have to answer for * * * conduct in a civil damages action.'\" Murphy v. Morris, 849 F.2d 1101, 1103 (8th Cir. 1988) (quoting Mitchell v. Forsyth, 472 U.S. 511, 525, 105 S.Ct. 2806, 2815, 86 L.Ed.2d 411 (1985)).\n\nFinally, it is a travesty and tragedy of rules of law that protect governmental misconduct from responsibility. By that, it is a strange and paranoid lemming like march, universally criticized by academic review which was accurately described thirty-one years ago to be justified by \"arguments [which] offer a wry blend of fairy tale and horror story.\" Gray, Private Wrongs of Public Servants, 47 Cal.L.Rev. 303, 339 (1959). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e \"This development has occurred in the context of logical inconsistencies and often with only cursory reasoning.\" Grimm v. Arizona Bd. of Pardons \u0026 Paroles, 115 Ariz. 260, 564 P.2d 1227, 1231 (1977). Immunity for responsibility for public officials is not mandated by the constitution nor even statute, but rather a public policy where the public to be protected is the miscreant public official at the loss and damage of the injured innocent citizen. Society cannot be sustained in a democratic system if arbitrary, malicious and perjurious conduct is not considered to be both reprehensible and punishable.\n\nInitially, in fairness to Chris J. White, assistant county prosecuting attorney, and Robert Mayor, probation officer for the Wyoming Department of Probation and Parole, this case does not \"prove\" why they did what they did or what in fact they may have done. In choosing to escape a full factual review, they are faced in concepts of the law with the stage where this case did progress which provides tactical assumptions of guilt to allegations whether in fact true. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nI would concur with the majority that the occurrence could be further explored in disciplinary action against the attorney which could lead to disbarrment and criminal prosecution against both the attorney and the parole officer. However, realistically, neither will occur. Actually, far better in fairness and justice to everyone, would be a responsible review in civil litigation. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Privileges and immunities against responsibility are an anathema for democratic society and most appropriately correctable by civil damage responsibility. The proper office of immunity should be constrained to protect governmental operation and not to insulate needlessly abject misconduct.\n\nAlleged official misconduct, corruption, and perjury is hidden here behind the dirty skirts of immunity. From these denigrations of rights guaranteed not only by the United States Constitution but also the Wyoming Constitution, which was written in the vigor of a young society for a new state, I impassionately dissent. It is time to look again whether our foundational documents are written to be found only as blank pages when governmental personnel misconduct occurs. Statism's uncaring autonomy in denied relief from oppression simply should not be acceptable within the clear mandate of the Wyoming Constitution. In response by caricatures of immunity for absolution from oppressive misconduct, malfeasance and perjury, we now write \"no\" for the state's adjudicatory future and to the Wyoming Constitution for protection of our citizens in whose protective interests the sacred and unalienable rights were provided.\n\nII. WE WRITE AS WYOMING JURISTS WITHIN A WYOMING CONSTITUTION\n\nI cannot retreat to find justice only for punishment of the miscreant where recompense to the victim could more appropriately serve society's interests. Consequently, I dissent from affirming the grant of the W.R.C.P. 12(b)(6) motion to dismiss. We misplace responsibility and improvidently auger out criminal conduct by the majority opinion. I am also unwilling to accept fear of responsibility as the basic justification of operational failures of government. Imbler v. Pachtman, 424 U.S. 409, 96 S.Ct. 984, 47 L.Ed.2d 128 (1976) was a bad case, a statistic derivation lacking accurate historical base and need not be extended further than the empirical sweep of the United States Supreme Court broom and not so far now to deny rights to this victim. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e A deterrence to sloganistic extension is called to our attention by the state constitution where it is stated:\n\nAll power is inherent in the people, and all free governments are founded on their authority, and instituted for their peace, safety and happiness; for the advancement of these ends they have at all times an inalienable and indefeasible right to alter, reform or abolish the government in such manner as they may think proper.\n\nWyo. Const. art. 1, § 1.\n\nThe right of the people to be secure in their persons, houses, papers and effects against unreasonable searches and seizures shall not be violated, and no warrant shall issue but upon probable cause, supported by affidavit, particularly describing the place to be searched or the person or thing to be seized.\n\nWyo. Const. art. 1, § 4.\n\nNo person shall be deprived of life, liberty or property without due process of law.\n\nWyo. Const. art. 1, § 6.\n\nAbsolute, arbitrary power over the lives, liberty and property of freemen exists nowhere in a republic, not even in the largest majority.\n\nWyo. Const. art. 1, § 7.\n\nAll courts shall be open and every person for an injury done to person, reputation or property shall have justice administered without sale, denial or delay. Suits may be brought against the state in such manner and in such courts as the legislature may by law direct.\n\nWyo. Const., art. 1, § 8.\n\nNo law shall be enacted limiting the amount of damages to be recovered for causing the injury or death of any person.\n\nWyo. Const. art. 10, § 4.\n\nNot unobtrusively involved is the oath of office which surely should include an assistant prosecuting attorney where, under sacred oath, the governmental official states in part:\n\n\"I do solemnly swear (or affirm) that I will support, obey and defend the constitution of the United States, and the constitution of this state, and that I will discharge the duties of my office with fidelity; * * *.\"\n\nWyo. Const. art. 6, § 20.\n\nIn obedience to that sacred trust, I do not draw down the insulative curtain of Imbler to so closely protect malefactors by simply accepting what the majority says that \"the reviewing court must not allow its focus on the functional character of the prosecutorial conduct at issue to be skewed by an emotional response to a particularly abusive fact situation. There is no bad faith exception to absolute prosecutorial immunity for prosecutorial conduct that meets the Imbler requirements.\" I do not reject the function analysis upon which the majority so strongly relies; I resist characterizing perjury from another public official as a function of the prosecutorial responsibilities in order to fulfill the most weighty position in the criminal justice delivery system. The function of the prosecutor does not include the commission of a crime. B. Gershman, Prosecutorial Misconduct (1989). See also the rule that the knowing use of perjured testimony by the prosecution denied a defendant due process of law and requires that the defendant be granted a new trial. People v. Foster, 190 Ill. App.3d 1018, 138 Ill.Dec. 311, 547 N.E.2d 478 (1989). See also Tiersma, The Language of Perjury: \"Literal Truth,\" Ambiguity, and the False Statement Requirement, 63 So.Cal.L.Rev. 373 (1990).\n\nIt is unacceptable by whatever justification to demean due process and fairness to the accused, Phillips v. State, 774 P.2d 118 (Wyo. 1989); Harvey v. State, 774 P.2d 87 (Wyo. 1989), in order now to cover up suborned perjury committed by the public official. Cf. Blake v. Rupe, 651 P.2d 1096 (Wyo. 1982), cert. denied 459 U.S. 1208, 103 S.Ct. 1199, 75 L.Ed.2d 442 (1983). Unfortunately, the majority gives immunity to the alleged criminal behavior in this instance by moving parole and probation decisions into the prosecutor's criminal prosecution function. Likewise, the majority obliterates the Wyoming Constitution in seeking justification from the federal courts where those officials did not achieve office by allegiance to the constitution of this state.\n\nIII. FACTS PRESENTED\n\nLacking any adequate development of the factual record, it is impossible to understand not only why but what happened resulting in the issuance of the arrest warrant and the consequent incarceration of Cooney. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e To answer as we can requires examination of these facts to establish where this course of conduct properly fits into immunity absolution. This is not a typical malicious prosecution, it is a criminal conspiracy to commit official perjury and deny constitutional rights to the victim. Basic documents, including a petition for revocation and warrant are not included in the official record. The decision letter of the trial court was confined to the factual allegations of the complaint. Briefing in trial court by the defendants obviously extended the contravention of facts and complexity of allegations without any records or documents produced to support the statements made.\n\nWe do know that on January 24, 1986 when Mayor contacted White to state that Cooney had failed to contact his probation officers, the prosecutor directed the probation officer to prepare a petition for revocation. Five days later, Mayor was advised that Cooney was residing in Bairoil, Wyoming in accordance with permission granted and was in contact with probation personnel. Cooney alleges that Mayor contacted White with this new information and was again directed to prepare a petition to revoke anyway, even though the revocation statement would be knowingly false and perjurious in effect. Mayor prepared the petition and a bench warrant containing the false statements and forwarded the documents to White who presented the petition to the trial court and obtained a bench warrant. On this record for motion purposes, both state officials conspired to obtain the arrest of Cooney by use of false statements made under oath.\n\nI have trouble fitting this scenario into prosecutorial discretion and state statutory provisions for revocation. Something is missing in the translation and remains missing when the public defender later requested Cooney's release and White refused so that the improperly incarcerated individual languished in jail without any court hearing or appearance for thirty-eight days. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See Morrissey v. Brewer, 408\n\nPage 1307 U.S. 471, 92 S.Ct. 2593, 33 L.Ed.2d 484 (1972), which requires a preliminary hearing.\n\nIV. PROBATION REVOCATION PROCESS\n\nThe Wyoming statute providing for revocation was, in its explicit terms, obviously not applied in context or intent for the arrest and incarceration of Cooney.\n\n(a) Where supervision of a probationer, parolee or other conditional releasee is being administered pursuant to directive of any court having criminal or juvenile jurisdiction, the board of parole, any of the state's correctional institutions or the state probation and parole agents shall notify the appropriate court, board or institution whenever, in their view, consideration should be given to retaking or reincarceration for a violation of probation, parole or other conditional release. Prior to notification, a hearing shall be held in accordance with this act [§§ 7-13-409, 7-13-410] within a reasonable time, unless a hearing is waived by the probationer, parolee or conditional releasee. The appropriate officer or agents shall as soon as practicable, following termination of any hearing, report to the court, board or correctional institution, furnish a copy of the hearing record, and make recommendations regarding the disposition to be made of the probationer, parolee or conditional releasee by the court, board or correctional institution. Pending any proceeding pursuant to this section, the appropriate agents may take custody of and detain the probationer, parolee or conditional releasee involved for a reasonable period of time prior to the hearing and, if it appears to the hearing officer or agents that retaking or reincarceration is likely to follow, for such reasonable period after the hearing or waiver as may be necessary to arrange for the retaking or reincarceration.\n\n(b) Any hearing pursuant to this section may be before the state probation and parole officer, his designated hearing officer or any other person authorized pursuant to the laws of this state to hear cases of alleged probation, parole or conditional release violations, except that no hearing officer shall be the person making the allegation of violation.\n\n(c) With respect to any hearing pursuant to this act [§ 7-13-409, 7-13-410], the probationer, parolee or conditional releasee:\n\n(i) Shall have reasonable notice in writing of the nature and content of the allegations to be made including notice that its purpose is to determine whether there is probable cause to believe that he has committed a violation that may lead to a revocation of probation, parole or conditional release;\n\n(ii) Shall be permitted to consult with any persons whose assistance he reasonably desires, prior to the hearing;\n\n(iii) Shall have the right to confront and examine any person who has made allegations against him, unless the hearing officer determines that the confrontation would present a substantial present or subsequent danger of harm to the person or persons;\n\n(iv) May admit, deny or explain the violation alleged and may present proof, including affidavits and other evidence, in support of his contentions.\n\n(d) A record of the proceedings shall be made and preserved either by stenographic means or through the use of a recording machine.\n\nW.S. 7-13-409 (1977) (renumbered in 1987 to W.S. 7-13-408). Simply stated, no hearing by the executive agency, the state probation and parole officer was ever provided. If Justice Powell was correct in Gagnon v. Scarpelli, 411 U.S. 778, 790, 93 S.Ct. 1756, 1763, 36 L.Ed.2d 656 (1973), there was no requirement for the prosecution to become involved in the non-adversary proceeding.\n\nIt is apparent that this court has created a further pathway for probation and parole revocation as a judicial revocation, \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Knobel v. State, 576 P.2d 941 (Wyo. 1978), in application of W.R.Cr.P. 33(f):\n\nThe court shall not revoke probation except after a hearing at which the defendant shall be present and apprised of the grounds on which such action is proposed. The defendant may be admitted to bail pending such hearing.\n\nWhat is first found missing here is a notice to appear without arrest, second was any immediate court appearance by the incarcerated defendant, and finally, any opportunity for consideration of bail pending hearing. The only \"conduct\" established for the prosecutor was first suborning a perjured petition for revocation; second, presentation to the trial court of a false document; and finally, denial of a bail arraignment for release of the incarcerated individual. Compare Knobel, 576 P.2d 941, where a bond was posted. None of these functions \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e are within the prosecutorial discretion even within any Imbler gambit.\n\nActually, nothing is found in statute, except by implication, that the office of the county attorney represents the state probation officer in revocation proceedings where that office has a function or responsibility for parole violation revocation. There is no record that determines White filed a motion for parole revocation. State v. Reisch, 491 P.2d 1254 (Wyo. 1971). This case develops from an executive department petition for revocation under W.S. 7-13-409 (1977) and there was apparently no order to show cause as recognized in Murphy v. State, 592 P.2d 1159 (Wyo. 1979), where other offenses became the basis presented for revocation and not internal rule non-compliance which was implicated here. See likewise Smith v. State, 598 P.2d 1389 (Wyo. 1979). Weisser v. State, 600 P.2d 1320 (Wyo. 1979) cannot be compared since there, the petition was filed by the department and not by the county attorney and a hearing was held within six days following arrest. It is interesting to observe that in this official record, we do not even have original probation office records of activities or a copy of the petition to revoke. (See, however, n. 7, supra.) See Mason v. State, 631 P.2d 1051 (Wyo. 1981), Rooney, J., specially concurring. Clearly, revocation addressed conditions and not other law violations. This is peculiarly a function of the probation department within which the proper involvement of the county attorney is totally undisclosed. Not knowing what documents exist, it is impossible to determine whether a mailman could have equally served the same function as performed by White, except not to convince the probation officer to commit perjury. Not even proper or official discretional decision of the prosecutor is authenticated in this record.\n\nWithin the facts of this misbegotten occurrence, one also is called to question White's authority and discretion to retain Cooney in jail without bond or appearance before a commissioner for thirty-eight days. Non-release in itself is separate misconduct — moral and legal. Sullivan v. Los Angeles County, 12 Cal.3d 710, 117 Cal.Rptr. 241, 527 P.2d 865 (1974). Intrinsic to either the judicial or administrative revocation process is an immediate opportunity for hearing or establishment of reasonable bail. See Weisser, 600 P.2d 1320 and Knobel, 576 P.2d 941.\n\nV. ALTERNATIVE REMEDIES AS JUSTIFICATION FOR NON-LIABILITY, PROFESSIONAL DISCIPLINE OR CRIMINAL PROSECUTION\n\nBefore I attenuate the anger that morality requires by discussion of why the majority is wrong on the law in absolving serious prosecutorial misconduct from financial responsibility for damage, reference is required to the alternative remedies gratuitously advanced, as buried in footnote 7 of the majority opinion, suggesting disciplinary action and criminal prosecution. The State, for the purposes of a motion to dismiss defense, filed a pleading which has the effect of admitting suborning perjury and execution of a document under a false oath by a public official on January 29, 1986. That was now four years ago. One would search in vain for either criminal prosecution or disciplinary action. White is shown in the current bar directory to be a member of the Wyoming State Bar and now a resident in Bakersfield, California. Wyoming State Bar Directory (1990). Mayor is no longer with the Department of Probation and Parole.\n\nThe most disturbing part of the majority opinion is the dissertation considering rather than providing economic repayment to the victim for damage sustained that alternative remedies for injury responsibility exist. It is argued that a chill upon proper performance is created by the requirement to defend against obligation to repay for damage inflicted by malevolent or malicious conduct. Otherwise, it is suggested that if the immunity is not provided, government cannot work. Immunity is, of course, only excused irresponsibility and denied liability for intentional wrongdoing in the use of a public office. Compare Foster, 190 Ill. App.3d 1018, 138 Ill.Dec. 311, 547 N.E.2d 478, if we are now also going to apply that same philosophy to similar misconduct of the private attorney.\n\nThese alternative remedies providing responsibility to the immunized public official for his bad conduct in order to avoid the chilling result of monetary responsibility would substitute either criminal prosecution or professional sanction as the punishment. Kentucky Bar Ass'n v. Lovelace, 778 S.W.2d 651 (Ky. 1989). The over-powering speciosity arises with a concurrent knowledge that in the justice delivery system, these alternatives are seldom if ever actually applied. It is an unacceptable fraud on the public since prosecutors seldom prosecute prosecutors and bar associations infrequently take punitive action to correct prosecutorial suborned perjury. Compare State v. Ramseur, 106 N.J. 123, 524 A.2d 188, 290 (1987), where the New Jersey Supreme Court gave notice that it would not hesitate to refer breaches of prosecutors (death case) to bar disciplinary committees. See People v. Green, 405 Mich. 273, 274 N.W.2d 448 (1979). See, however, Matter of Price, 238 Kan. 426, 709 P.2d 986 (1985) for more than conduct in just one case, but see State v. Smith, 245 Kan. 381, 781 P.2d 666 (1989).\n\nThis case provides an ordinary but predominating example of non-action. Before we consider what should have been done, we only prove the rule by recognition that the alternatives are only idle words not to be pursued as a remedy for the admitted evil perpetrated by the public official upon the wronged but hapless private individual. We do raise, however, question whether these alternatives, involving either prosecutor conviction and incarceration for a criminal charge and/or suspension or disbarrment to practice the profession of law which is the public official's livelihood, if really existent and pursued, would be preferred by the public official in avoiding damage responsibility. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e This analysis, if we accept the generally quoted concept of Judge Learned Hand in Gregoire v. Biddle, 177 F.2d 579 (2nd Cir. 1949), cert. denied 339 U.S. 949, 70 S.Ct. 803, 94 L.Ed. 1363 (1950), provides the only means of punishment for public officials who have been wrongful in their performance of responsibilities of a criminal complaint or professional discipline instead of economic repayment for the unjustified damage.\n\nIn the simplest terms within a motion to dismiss status, the facts presented could show criminal conduct where the assistant prosecuting attorney, White, told the probation officer, Mayor, to sign and swear to a false statement. The false affidavit was intentionally prepared by the probation officer in agreement with the prosecuting attorney. Then by direction and agreement, an affidavit was executed by Mayor. This perjurious document was next used by the prosecution in court filing to secure the issuance of an arrest warrant from the trial court. Pursuant to the conspiratorial agreement and planned use of the perjurious testimony, Cooney was arrested and held in jail for thirty-eight days without an opportunity for bond. The prosecuting attorney was advised by a third party that Cooney was innocent of any wrongdoing, but the conspiratorial conduct continued in denying an appearance before a court or arrangements for bond until the trial court hearing was finally provided and a release order obtained. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e What crimes do the foregoing course of conduct infold? Clearly, perjury is first implicated, W.S. 6-5-301, against either or both of the participants, but additionally available for multiple charging, W.S. 6-5-107, official misconduct; W.S. 6-5-202, accessory after the fact; W.S. 6-5-305(b), obstruction or impedance of the administration of justice; W.S. 6-2-203, false imprisonment; and, of course, the inchoate offenses, W.S. 6-1-303, conspiracy and W.S. 6-1-201, aiding and abetting as an accessory before the fact.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e If exposure to damage claims chill, then this is the criminal responsiveness as the alternative suggested. It is not a chill, it is pneumonia and virus flu combined.\n\nNext for inquiry is the disciplinary code and ethical conduct \"answer.\" First, of course, conviction of a felony requires an automatic suspension of the practice of law. Disciplinary Code for the Wyoming State Bar, Rule XVI. Also implicated as a standard of conduct, we are required to address rules of professional conduct for the lawyer:\n\nPreamble: A Lawyer's Responsibilities\n\nA lawyer is a representative of clients, an officer of the legal system and a public citizen having special responsibility for the quality of justice.\n\nLawyers play a vital role in the preservation of society. The fulfillment of this role requires an understanding by lawyers of their relationship to our legal system. The Rules of Professional Conduct, when properly applied, serve to define that relationship.\n\nRules for Professional Conduct for Attorneys at Law.\n\nA lawyer shall not bring or defend a proceeding, or assert or controvert an issue therein, unless there is a basis for doing so that is not frivolous, which includes a good faith argument for an extension, modification or reversal of existing law. A lawyer for the defendant in a criminal proceeding, or the respondent in a proceeding that could result in incarceration, may nevertheless so defend the proceeding as to require that every element of the case be established. The signature of an attorney constitutes a certificate by him that he has read the pleading, motion, or other court document; that to the best of his knowledge, information, and belief, formed after reasonable inquiry, it is well grounded in fact and is warranted by existing law or a good faith argument for the extension, modification, or reversal of existing law; and that it is not interposed for any improper purpose such as to harass or to cause unnecessary delay or needless increase in the cost of litigation.\n\nRule 3.1, Rules for Professional Conduct for Attorneys at Law.\n\n(a) A lawyer shall not knowingly:\n\n(1) make a false statement of material fact or law to a tribunal;\n\n(2) fail to disclose a material fact to a tribunal when disclosure is necessary to avoid assisting a criminal or fraudulent act by the client;\n\n(3) fail to disclose to the tribunal legal authority in the controlling jurisdiction known to the lawyer to be directly adverse to the position of the client and not disclosed by opposing counsel; or\n\n(4) offer evidence that the lawyer knows to be false. If a lawyer has offered material evidence and comes to know of its falsity, the lawyer shall take reasonable remedial measures.\n\n(b) The duties stated in paragraph (a) continue to the conclusion of the proceeding, and apply even if compliance requires disclosure of information otherwise protected by Rule 1.6.\n\n(c) A lawyer may refuse to offer evidence that the lawyer does not know to be false but reasonably believes is false.\n\n(d) In an ex parte proceeding, a lawyer shall inform the tribunal of all material facts known to the lawyer which will enable the tribunal to make an informed decision, whether or not the facts are adverse.\n\nRule 3.3, Rules for Professional Conduct for Attorneys at Law.\n\nThe prosecutor in a criminal case shall:\n\n(a) refrain from prosecuting a charge that the prosecutor knows is not supported by probable cause;\n\n(b) prior to interviewing an accused or prior to counseling a law enforcement officer with respect to interviewing an accused, make reasonable efforts to assure that the accused has been advised of the right to, and the procedure for obtaining, counsel and has been given reasonable opportunity to obtain counsel;\n\n(c) not seek to obtain from an unrepresented accused a waiver of important pretrial rights, such as the right to a preliminary hearing;\n\n(d) make timely disclosure to the defense of all evidence or information known to the prosecutor that tends to negate the guilt of the accused or mitigates the offense, and, in connection with sentencing, disclose to the defense and to the tribunal all unprivileged mitigating information known to the prosecutor, except when the prosecutor is relieved of this responsibility by a protective order of the tribunal; and\n\n(c) exercise reasonable care to prevent investigators, law enforcement personnel, employees or other persons assisting or associated with the prosecutor in a criminal case from making an extra-judicial statement that the prosecutor would be prohibited from making under Rule 3.6.\n\nRule 3.8, Rules for Professional Conduct for Attorneys at Law.\n\nIn the course of representing a client a lawyer shall not knowingly:\n\n(a) make a false statement of material fact or law to a third person; or\n\n(b) fail to disclose a material fact to a third person when disclosure is necessary to avoid assisting a criminal or fraudulent act by a client, unless disclosure is prohibited by Rule 1.6.\n\nRule 4.1, Rules for Professional Conduct for Attorneys at Law.\n\nI would wonder in consideration of the concept of chilling honest performance of professional responsibilities whether White or Mayor would prefer testing their contended wrongful conduct on a damage platform, and particularly so if protected by insurance or someone else's financial responsibility, or be faced with the permanency embodied in criminal prosecution or professional disenfranchisement. The answer is, of course, that the alternatives are almost never and certainly seldom ever really considered and, if considered, never anticipated to be an actual risk. That parenthetical question emerges — how often is a prosecutor prosecuted or censured for a wrongful arrest or malicious prosecution? The answer is, of course, next to never. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We are afforded in this wisdom by events and circumstances that occurred in the earlier litigation resulting in this court's decision in Blake, 651 P.2d 1096. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Anger and ego not to be assuaged by legal knowledge or morality, the prosecutor in Blake, through her friend the investigator, arranged to file charges challenging Rupe by criminal attack and press release dissertation as a response to a horror of a jury trial acquittal. After arrest, the criminal charges were appropriately dismissed in preliminary hearing. The lawsuit which was filed, although initially involving a civil rights proceeding (Section 1983), went to the jury on malicious prosecution where the jury obviously adopted the testimonial perspective of the plaintiff in awarding a jury verdict against the prosecutor of $40,000 actual damage and $105,000 punitive damage and $20,000 actual damage and $35,000 punitive damage against the investigator. Blake, 651 P.2d at 1097-98. This court, in a belated appeal on an immunity absolution, absolved the vicious, malicious and wrongful conduct which had clearly incensed the civil jury.\n\nIn Blake, 651 P.2d 1096, this court stretched inordinately in the belated appeal to reverse the jury verdict. The problem, however, continues if we assess realities to the available alternatives. The reader should not be surprised that the prosecutor did not prosecute herself criminally nor prosecute the investigator. Members of this court are, of course, lawyers and may be themselves insulated from responsibility by appellate posture from required action pursuant to Rule 8.3, entitled Reporting Professional Misconduct, as a particularly important provision of the Rules of Professional Conduct for Attorneys at Law. Recognizing that this court makes final decisions on disciplinary proceedings and should not normally file complaints, I would only ask if the alternatives of prosecution or professional discipline are intended to be anything but non-applied justifications for denial of economic justice. If that is not true, then where does the trial court, the state bar itself and particularly the office of the attorney general come to grips with the responsibilities of Rule 8.3.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Members of the office of the attorney general are also subject to the constraints and requirements of the Rules of Professional Conduct for Attorneys at Law as members of the Wyoming State Bar. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nA standard of morality is assumed for insulation of the public official (prosecutor) for liability from constitutional injury that cannot be constitutionally constrained within the function versus conduct dichotomy. A clear recognition is afforded by Ryland v. Shapiro, 708 F.2d 967 (5th Cir. 1983), where allegations involved prosecutorial falsification of death certificate and a cover up of a murder. \"Characterizing these actions as akin to those traditionally undertaken by officers of the court (which would entitle them to assert absolute immunity) would make a mockery of the judicial system.\" Id. at 975. I would likewise reflect that conspiracy to and suborning perjury for issuance of a probation revocation warrant is no less a mockery of both the judiciary and the lawyers who serve with distinction as the state's prosecutorial attorneys. Control of the unusual misconduct promotes both the image and the justification for the entire profession. Id. at 976.\n\n[C]laims of mental and emotional distress, if proven, can support an award of compensatory damages. * * * Moreover, the societal interest in deterring or punishing violators of constitutional rights supports an award of punitive damages even in the absence of actual injury. * * * Finally, an award of nominal damages may support an award of attorney's fees under section 1988.\n\nId. at 976.\n\nThe federal court creation of immunity to carve out an exception to Section 1983 liability for prosecutorial violation of an individual's civil rights, although very new in time in adjudicatory history, now has a complex definitional outer perimeter. In concept, it is defined as the core proceeding for prosecution requiring the application of the advocate's particularized responsibility. The broad language used obviously implemented to similarly continue to justify judicial immunity belies the necessity to confine and characterize where the advocate loses his mantle in collateral functioning. In the cases, words get in the way of reasoning and logic.\n\nThe principle of justified immorality for the prosecutor by the beneficial insulation of absolute immunity is stated in Demery v. Kupperman, 735 F.2d 1139, 1144 (9th Cir. 1984), cert. denied 469 U.S. 1127, 105 S.Ct. 810, 83 L.Ed.2d 803 (1985):\n\nThe fact that inducing false testimony is wrongful and indefensible is not relevant to the question whether immunity attaches. Underlying the doctrine of absolute immunity is a recognition that the advancement of broader public policies sometimes requires that concededly tortious conduct, no matter how reprehensible, go unremedied, at least by means of a civil action for damages.\n\nIn my unwillingness to accept this standard of conduct for Wyoming lawyers, one is called to wonder when the author of the opinion last read the statutes of the State of California, the federal code relating to crimes which can be committed, even by public officials, and the code of ethics which relate both to judges and lawyers. See ABA Code of Judicial Conduct § 3 D(2) (Discussion Draft Revisions May 1, 1989), which states:\n\nA judge having knowledge that a lawyer has committed a violation of the Rules of Professional Conduct * * * should take appropriate action and, if the violation raises a substantial question as to the lawyer's honesty, trustworthiness or fitness as a lawyer in other respects, shall inform the appropriate authority.\n\nSee also the comparable version found in Wyoming's Code of Judicial Conduct, 3 B(3) and Commentary (1979):\n\n(3) A judge should take or initiate appropriate disciplinary measures against a judge or lawyer for unprofessional conduct of which the judge may become aware.\n\n* * * Disciplinary measures may include reporting a lawyer's misconduct to an appropriate disciplinary body.\n\nOne would also wonder, if looking at the examination of the next seated applicant during the admission examination is cause for a lifetime denial of opportunity to practice law, Application of Corrigan, 47 Ohio St.3d 32, 546 N.E.2d 1315 (1989), what would be the proper relative responsibility for the wrongful and indefensible conduct recited in Demery, 735 F.2d 1139?\n\nMy justification for mucking through the morass of the law of alleged governmental agent misconduct and judicial self-justification as defined first for Section 1983 when applied in Wyoming and secondly for the Wyoming Constitution when applied in Wyoming is to establish some boundary criteria. Analysis requires two different resolutions since a character of lawyer advocate conduct sanitized by the federal courts cannot necessarily be acceptable in the state judiciary where this court, constitutionally, has the primary responsibility for the application and preservation of the Wyoming Constitution, supervision of the Wyoming practice of law and the general responsibility for the justice delivery system within the three branches of government pursuant to Wyo. Const. art. 2, § 1, Distribution of Powers. Consequently, the standards of behavior for lawyers and advocacy is the direct responsibility of this court and, as such, is identically applicable not only to lawyers in private practice, but also to governmental lawyers in advocacy in behalf of the state of Wyoming in general, prosecuting attorneys in representation of the state for criminal proceedings and the defense bar in criminal cases who are state agents by virtue of participation under the public defender program.\n\nVI. WHY THE MAJORITY IS WRONG\n\nI find the majority wrong first in its application of this case to Section 1983 federal standards and more expressly wrong about standards of advocacy conduct acceptable within the Wyoming Constitution. Finally, I assess judicial error in ignored direct responsibility for the state constitution and its preservation.\n\nIn analysis, we need to repeat the factual scenario with which this case is elucidated by a motion to dismiss status.\n\n1. A knowingly perjurious statement in official form was prepared by a parole officer.\n\n2. The perjured statement was knowingly prepared by the parole officer at the direction of the assistant county attorney.\n\n3. The document was prepared within the jurisdiction of the parole officer to accomplish the arrest and confinement of a person on parole who was not within the jurisdictional responsibility of that particular parole officer.\n\n4. The parole officer sent the perjured document to the prosecuting attorney for the prosecuting attorney's purpose in filing an order to secure an immediate arrest and a subsequent revocation of probation.\n\n5. The prosecuting attorney knowingly filed the perjured document in order to, and did, secure a warrant for the arrest of the damaged individual.\n\n6. The individual was arrested and taken to the jail in Cody.\n\n7. The prosecuting attorney was advised that the individual should be released since the proceeding was improper.\n\n8. Without hearing or appearance before any member of the judiciary, the individual was held in jail for thirty-eight days before appearance and release by judicial action.\n\nIf these facts are accurate in addition to clear felonies committed by both the parole officer and the prosecuting attorney plus serious ethical misconduct of various kinds by the prosecutor, there should be no doubt of a constitutional violation of a protected right under the Wyoming Constitution guaranteed to Cooney. I do not believe that even if the federal courts generally countenance commission of felonies by prosecutors, cf. United States v. Omni Intern. Corp., 634 F. Supp. 1414 (D.Md. 1986), the outer limits of the immunity umbrella would be extended to the prosecutor's solicitation of the preparation, execution and acknowledgement of a false government document by another governmental official.\n\nI establish the external line even for Section 1983 at a point later than when the prosecutor directs and solicits the execution of a false and perjurious document before arrest and the initiation of proceedings has ever commenced. Within this continuum, even under Section 1983, the prosecutorial conduct of White in initiation and direction for document preparation to secure arrest is not immunized when based on facts included which were knowingly false and perjurious. It is not believed that even the federal courts will accept that character of felonious conduct by a public official to be a core proceeding as an advocate in the prosecuting of a criminal case. Hampton v. Hanrahan, 600 F.2d 600 (7th Cir. 1979), rev'd on other grounds 446 U.S. 754, 100 S.Ct. 1987, 64 L.Ed.2d 670, reh'g denied 448 U.S. 913, 101 S.Ct. 33, 65 L.Ed.2d 1176, reh'g denied 448 U.S. 913, 101 S.Ct. 33, 65 L.Ed.2d 1177 (1980); Joseph v. Patterson, 795 F.2d 549 (6th Cir. 1986), cert. denied 481 U.S. 1023, 107 S.Ct. 1910, 95 L.Ed.2d 516 (1987).\n\nThe second difference I take with the majority is to ever extend immunity in Wyoming where violation of the Wyoming Constitution is considered for conduct which is either criminal or constitutes a serious violation of legal ethics by the governmental official. In other words, I will not accept immunizing, suborning perjury, blackmail, alteration of documents, etc. even if within the context of trial preparation and presentation as a criteria of the core proceeding. In this regard, I would apply the same rule for defense counsel representing the state in criminal defenses, state's attorneys representing the state in any general litigation, and the prosecuting attorney representing the state in criminal proceedings.\n\nWe note, however, that this cloak of immunity is limited to the attorney's performance of regular advocacy functions, and like the immunity afforded prosecutors, does not extend to intentional misconduct accomplished outside of the scope of the attorney's function as an advocate for the state. See Imbler, 424 U.S. at 429, 96 S.Ct. at 994; Tower v. Glover, 467 U.S. 914, 923, 104 S.Ct. 2820, 2826, 81 L.Ed.2d 758 (1984) (state public defenders are not afforded absolute immunity for intentional misconduct by virtue of alleged conspiratorial action which deprives their clients of federal rights). The immunity envisioned by the common law, and discussed by the Supreme Court, attaches only to those activities within counsel's normal duties as an advocate for his or her client. When an attorney goes beyond those boundaries and commits an act of intentional misconduct, the protections of absolute immunity no longer apply. Tower, 467 U.S. at 921, 104 S.Ct. at 2825. See Williams v. Hartje, 827 F.2d 1203, 1208-10 (8th Cir. 1987) (The advocacy function entails preparatory and other activity outside of the courtroom undertaken \"within the role of advocate.\" In drawing the line between absolutely immune and other activities, the important consideration is not whether the act was one which could be done only by an advocate but whether an act is closely related to the role of the advocate.)\n\nMurphy, 849 F.2d at 1105.\n\nI argue that this court should not adopt the Imbler litany of excused misconduct where criminal or serious ethical misconduct exists, except to the most confined extent required to apply federal criteria to the federal statute and then only to the Section 1983 claim. Consequently, this court is in error in extending the assumed Imbler immunity to a state responsibility under the state constitution.\n\nThere is yet a third reason why the majority is in error within these particularized facts. The statutory provision for probation revocation is not a direct prosecuting attorney responsibility. Admittedly, this court has created a judicial revocation process independent of statute where the prosecutor becomes a direct player. However, in this case, the revocation proceeding chosen was statutory and, as such, could have been processed without any involvement of the prosecuting attorney through parole officer direct filing. This was not a prosecution where the prosecuting attorney had sole responsibility. Consequently, here, that Park County official only served as an adviser and volunteer assistant in a proceeding initiated by a state office and official for which he did not necessarily have to take any direct responsibility. I do not accept contention that the prosecuting attorney has immunity in telling the parole officer to prepare, sign and swear to a false document which, within the parole officer's responsibility, will serve to obtain the incarceration of someone who both participants know is not at fault or subject factually to probation revocation.\n\nConsequently, for three reasons, the majority is substantively in error. First by extending Imbler beyond core proceedings; second by extending the outer reaches of Imbler to the Wyoming constitutional protection; and third by extending Imbler to a probation officer revocation document where the prosecutor was not directly responsible for providing the initial action.\n\nIt is fair to rationalize that if something like this ever occurred before, and if it really did happen here, it will not reoccur after this opinion. In 1989 and 1990, the lawyer disciplinary process of Wyoming is more organizationally attenuated to respond to the misconduct of the profession and recognition has occurred for the potential criminal responsibility when an attorney participates in the preparation of false documents. State v. Neilson, Seventh Judicial District, Natrona County, State of Wyoming. This case may not bring justice or equity to Tom and Lora Cooney nor even properly determine what did occur and what responsibility did exist, but a message should be indelibly communicated that if civil liability responsibility is denied for official misconduct of an egregious nature, worse punishment may and should be provided.\n\nVII. ALTERNATIVE RIGHT FOR REGRESS WHEN A PUBLIC OFFICIAL CAUSES DAMAGE IN VIOLATION OF THE STATE CONSTITUTION\n\nThere is a basic reason why this court is in error by affirming the dismissal of the case by sustaining the motion to dismiss without leave reserved to Cooney to file an amended complaint. Admittedly, Cooney only indirectly alleged facts which directs attention to a course of conduct implicating a violation of rights guaranteed by the Wyoming Constitution. I would perceive that with arguable violations of the United States Constitution and consequent disposition of the Section 1983 claim by a motion to dismiss, Cooney should have been reserved a further right to amend to protest violations of his state constitutional interests which could not have been substantively extinguished by the state tort claims act which, in its terms, is not addressed to a constitutional rights violation.\n\nThe near magnetic attraction to the federal judiciary, including categorically the United States Supreme Court for statism, \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e over individual rights is here personified in this occupational immunity. This is not only in contravention of Chief Justice John Marshall's directive in Marbury v. Madison, 1 Cranch 137, 5 U.S. 137, 163, 2 L.Ed. 60 (1803), in disregard of English law precedent, but also in apparent ignorance of world history even as more recently provided by the saga of totalitarian government emergence post-World War I with disintegration of the old order. Factually unjustified and precedentially unsupported, except as an accelerating growth, occupational immunity from responsibility for injury defines primarily only by its expansive growth any justification for its intrinsic existence. The comparable systematology within government to human cancer is not unnoticeable.\n\nGovernmental immunity or public officer privilege rests on a faulty and fallacious conceptual justification as only recently growing like thistles on the American governmental and judicial landscape. Error was initiated by judicial creation of judicial immunity and followed by that cancerous expansion as, for example here, to the prosecutorial function as pseudo-judicial. The proper foundational justification for non-liability of agents of government arises from the discretional nature of the responsibilities performed. The judge's judicial decision, Pierson v. Ray, 386 U.S. 547, 87 S.Ct. 1213, 18 L.Ed.2d 288 (1967), cf. Pulliam v. Allen, 466 U.S. 522, 104 S.Ct. 1970, 80 L.Ed.2d 565 (1984); the parole board's release decision, Hurst v. State, 698 P.2d 1130 (Wyo. 1985), cf. Grimm, 564 P.2d 1227; the president's national welfare decision, Nixon v. Fitzgerald, 457 U.S. 731, 102 S.Ct. 2690, 73 L.Ed.2d 349 (1982); and the legislator's legislative activities, Tenney v. Brandhove, 341 U.S. 367, 71 S.Ct. 783, 95 L.Ed. 1019, reh'g denied 342 U.S. 843, 72 S.Ct. 20, 96 L.Ed. 637 (1951); Clear Lake City Water Authority v. Salazar, 781 S.W.2d 347 (Tex. App. 1989), are properly protected from litigative attack because of the nature of the decisional responsibilities and not because the officer holder has been given a stature above the constitution as the basic law of society.\n\nExhaustive scholastic examination of the institutional expansion of the individualized privilege to harm without responsibility within the government by the general immunities, qualified and absolute, has attracted comprehensive scholastic analysis. The frustration and disdain of writers for the adversarial effect of immunity on individual rights is personified by the titles. Representative writings not otherwise specifically cited in this dissent include Barrett, Police Practices and the Law — From Arrest to Release or Charge, 50 Calif.L. Rev. 11 (1962); Beermann, Government Official Torts and the Takings Clause: Federalism and State Sovereign Immunity, 68 B.U.L.Rev. 277 (1988); Burke \u0026 Burton, Defining the Contours of Municipal Liability Under 42 U.S.C. § 1983: Monell Through City of Canton v. Harris, 18 Stetson L.Rev. 511 (1989): Eisenberg \u0026 Schwab, The Reality of Constitutional Tort Litigation, 72 Cornell L.Rev. 641 (1987); Gressman, The Unhappy History of Civil Rights Legislation, 50 Mich.L.Rev. 1323 (1952); Hundt, Suing Municipalities Directly Under the Fourteenth Amendment, 70 N.W.U.L.Rev. 770 (1975); Jaron, The Threat of Personal Liability Under the Federal Civil Rights Act: Does it Interfere with the Performance of State and Local Government?, 13 Urb.Law. 1 (1981); Kates \u0026 Kouba, Liability of Public Entities Under Section 1983 of the Civil Rights Act, 45 So.Cal.L.Rev. 131 (1972); Mead, 42 U.S.C. § 1983 Municipal Liability: The Monell Sketch Becomes a Distorted Picture, 65 N.C.L.Rev. 517 (1987); Schnapper, Civil Rights Litigation After Monell, 79 Colum.L.Rev. 213 (1979); Shapo, Constitutional Tort: Monroe v. Pape, and the Frontiers Beyond, 60 N.W.U.L. Rev. 277 (1965); Zagrans, \"Under Color of\" What Law: A Reconstructed Model of Section 1983 Liability, 71 Va.L.Rev. 499 (1985); Comment, Civil Rights. Malley v. Briggs: Application to the Harlow Objective Reasonableness Test to Section 1983 Liability for Police Officers, 29 Ariz.L. Rev. 333 (1987); Comment, Oregon's Discretionary Interpretation of Discretionary Immunity, 22 Willamette L.Rev. 147 (1986); Comment, Civil Rights: Discarding Section 1983 Municipal Immunity — Is That Enough? Monell v. Department of Social Services, 98 S.Ct. 2018 (1978), 30 U.Fla.L.Rev. 979 (1978); Note, Qualified Immunity — Public Officials Will Lose Qualified Immunity Where the Constitutional Rights Were Clearly Established at the Time of the Violation But Not For Violation of a Statute or Regulation Unless the Statute or Regulation Itself Creates the Protected Right. — Davis v. Scherer (U.S. 1984), 34 Drake L.Rev. 873 (1984-85); Note, Monell v. Department of Social Services: A Supreme Court Adoption of Lower Court Exceptions, 1979 Utah L.Rev. 251 (1979); Note, Municipal Liability Under Section 1983: The Meaning of \"Policy or Custom\" 79 Colum.L.Rev. 304 (1979); Note, From Monroe to Monell: Eliminating Absolute Municipal Immunity Under § 1983, 30 Mercer L.Rev. 747 (1979); Note, Limiting the Section 1983 Action in the Wake of Monroe v. Pape, 82 Harv.L.Rev. 1486 (1969); and Recent Development, Lynch v. Cannatella: An Inconsistent Application of Qualified Immunity, 62 Tulane L.Rev. 820 (1988).\n\nA couple of lines from Gressman, supra, 50 Mich.L.Rev. at 1358 (quoting To Secure These Rights 149-173 (1947)), as a distinction from the idealism of Marbury, may be charismatic in description:\n\n\"[I]n one sense, the actual infringements of civil rights by public or private persons are only symptoms. They reflect the imperfections of our social order, and the ignorance and moral weaknesses of some of our people.\"\n\nAfter assessment of this quantum of research, analysis and composition, one has cause to wonder where we are and why we got here with privilege to injure — immunity from responsibility as related to what Justice Miller said just over a century ago in United States v. Lee, 16 Otto 196, 106 U.S. 196, 220, 1 S.Ct. 240, 27 L.Ed. 171 (1882):\n\nNo man in this country is so high that he is above the law. No officer of the law may set that law at defiance with impunity. All the officers of the government, from the highest to the lowest, are creatures of the law, and are bound to obey it.\n\nMost recent law journal and legal periodical scholarship include Gildin, Immunizing Intentional Violations of Constitutional Rights Through Judicial Legislation: The Extension of Harlow v. Fitzgerald to Section 1983 Actions, 38 Emory L.J. 369 (1989); Manak, Update on Absolute/Good Faith Immunity, 23 The Prosecutor 5 (1989); Schwartz \u0026 Mahshigian, In the 1990's the Government Must be a Reasonable Person in its Workplaces: The Discretionary Function Immunity Shield Must be Trimmed, 46 Wn. \u0026 Lee L.Rev. 359 (1989); Tribe, Revisiting the Rule of Law, 64 N YU.L.Rev. 726 (1989); Comment, Anderson v. Creighton and Qualified Immunity, 50 Ohio St.L.J. 447 (1989); Comment, Qualified Immunity for Law Enforcement Officials in Section 1983 Excessive Force Cases, 58 U.Cinn.L. Rev. 243 (1989); Note, The Yonkers Case: Separation of Powers as a Yardstick for Determining Official Immunity, XVII Fordham Urb.L.J. 217 (1989) (see, however, Spallone v. United States, ___ U.S. ___, 110 S.Ct. 625, 107 L.Ed.2d 644 (1990), demonstrating that the author guessed totally wrong); Note, Section 1983: Absolute Immunity For Pretrial Police Testimony, XVI Fordham Urb.L.J. 647 (1988); and The D.C. Circuit Review September 1987-August 1988, 57 Geo.Wash.L.Rev. 1342 (1989).\n\nThe authoritative text, B. Gershman, supra, should not be ignored. In introduction, Gershman states:\n\nThis book is about the use and abuse of power by one of the most influential figures in the American governmental system. Although not a member of the legislative or judicial branches, this official exercises broad lawmaking and adjudicative powers. Although technically a member of the executive branch, this official operates autonomously and independently and is usually accountable only to the public. Whether rural or urban, local or federal, elected or appointed, this official is glamorized by the media and diabolized by his foes. This figure is the public prosecutor, and he has the power to make decisions that control and even destroy people's careers, reputations, and lives. Any comprehensive and systematic understanding of the criminal justice system must take account of the central role of the prosecutor.\n\nA study of the prosecutorial process is fascinating and frustrating. As a long-time prosecutor, defense attorney, and law professor, I have always believed that the prosecutor's task is more exacting than that of any other public officer. More than any other official, the prosecutor is required to serve two masters — society and justice. * * *\n\nTwo major themes emerge from this book. First, it becomes inescapably clear that the prosecutor, for good or ill, is the most powerful figure in the criminal justice system. * * *\n\nThe second theme is probably the most significant in terms of long-range reform. Restraints on prosecutorial misconduct are either meaningless or nonexistent. Relatively few judicial or constitutional sanctions exist to penalize or deter misconduct; the available sanctions are sparingly used and even when used have not proved effective. Misconduct is commonly met with judicial passivity and bar association hypocrisy.\n\nId. at vii-ix.\n\nConsidering this comprehensive history and exhaustive scholarly authority, it is time that state courts recognize a requirement of fidelity to the state constitution in principal responsibility to assure validity to the guarantees to the state's citizens. Cursory supplication to the waning protection afforded by the United States Constitution through current decisions of the highest court of the federal system can no longer meet the fealty demanded by the oath of office of what the state supreme court justices owe to the state constitution. Consequently, when addressing suborned perjury to incarcerate an innocent victim by a public official, I cannot escape personal responsibility to the Wyoming State Constitution or surrender by temporizing denial by unthoughtful adaptation of whatever temporary mores may be applied by the United States Supreme Court to federal legislation.\n\nI am led in this persuasion by an unquestionable bedrock principle of constitutional government that the legislature need not, and in fact cannot, act contrarily in order to deny to the judiciary the right to provide a remedy for government violation of constitutional rights. In Bivens v. Six Unknown Named Agents of Federal Bureau of Narcotics, 403 U.S. 388, 91 S.Ct. 1999, 29 L.Ed.2d 619 (1971), by foundational construction of the original philosophy initially developed by Chief Justice Marshall, the United States Supreme Court provided a direct constitutional remedy for violations by the government of constitutional guarantees afforded in the United States Constitution.\n\nI find no need for the application of W.S. 1-31-101 through 1-31-130, and, in fact, no exclusion by whatever such an act may or may not do to discern that this court, in exercise of its oath, must provide a right for protection to our citizens from constitutional depravation by the government or its employees. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Consequently, we can only meet that responsibility by providing a state Bivens right for redress of constitutional violation. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The Section 1983 remedy is, today, in its nadir, if not in obsolescence and impotency. Call then reoccurs for the state judiciary to recognize the empirical responsibility required within the state constitution. The non-legislative answer of the federal system of Bivens is an obvious answer to accord real meaning to the state constitutional guarantees and imperatives. Any constitution which can be ignored by judicial inaction or legislative denial of implementing processes is no constitution and the action or inaction will prostitute and demean the government itself. The clarion question of why we so often need to apply to Uncle Fed to provide can more persuasively and justiciably be answered by our own activity and ingenuity. The thesis presented that citizen's rights within the state constitution are not without substance, even if not enforced by federal legislation, has realistic precedent by previous use of the Bivens remedy for the state court to enforce the rights independent of the federal civil rights action and proceeding. These concepts, although not yet to have predominated because of the preferential posture of past federal remedies, can now be cultivated to further the well-being of our citizens in a realistic recognition of the state's function in the federal system for the mutual protection of the state's constitutional guarantees.\n\nWhat this means is that for the protection of state constitutional rights, if depravation or denigration from state employees occurs, the state Bivens cause of action should be available under the constitutional imperatives of our state constitution. Immunity cannot, in itself, as a non-constitutional function, amend out of societal rights for protection the guarantees which are provided within the state constitution. This is true no less nor no more than a like thesis which was developed in the federal judiciary by adaptation of a process and right for justiciability in Bivens. To paraphrase the oracle or ogle of the professional immunities, if it would be monstrous for the federal government not to protect citizens from denudation by federal employees, it is no less monstrous for this court to reject its willingness and our oath of office to provide a similar right within the state against denudation of constitutional rights by employees of the state.\n\nWe should then look, as Cooney was unconstitutionally incarcerated by conspiratorial perjury of public employees, where the contours of a Bivens state cause of action could be most adequately illuminated and implemented. In Bivens, a model was created by announcement that a federal right of action was defined for which damage was recoverable from federal agent violation of constitutional guarantees (Fourth Amendment rights in that case). In denial of the governmental posture that no right to enforce existed, the opinion said:\n\nWe think that respondents' thesis [that rights to redress could only be found under state tort law] rests upon an unduly restrictive view of the Fourth Amendment's protection against unreasonable searches and seizures by federal agents, a view that has consistently been rejected by this Court. Respondents seek to treat the relationship between a citizen and a federal agent unconstitutionally exercising his authority as no different from the relationship between two private citizens. In so doing, they ignore the fact that power, once granted, does not disappear like a magic gift when it is wrongfully used. An agent acting — albeit unconstitutionally — in the name of the United States possesses a far greater capacity for harm than an individual trespasser exercising no authority other than his own. Cf. Amos v. United States, 255 U.S. 313, 317 [41 S.Ct. 266, 267-68, 65 L.Ed. 654] (1921); United States v. Classic, 313 U.S. 299, 326 [61 S.Ct. 1031, 1043, 85 L.Ed. 1368] (1941). Accordingly, as our cases make clear, the Fourth Amendment operates as a limitation upon the exercise of federal power regardless of whether the State in whose jurisdiction that power is exercised would prohibit or penalize the identical act if engaged in by a private citizen. It guarantees to citizens of the United States the absolute right to be free from unreasonable searches and seizures carried out by virtue of federal authority. And \"where federally protected rights have been invaded, it has been the rule from the beginning that courts will be alert to adjust their remedies so as to grant the necessary relief.\" Bell v. Hood, 327 U.S., at 684 [66 S.Ct. 773, 777, 90 L.Ed. 939 (1946)] (footnote omitted); see Bemis Bros. Bag Co. v. United States, 289 U.S. 28, 36 [53 S.Ct. 454, 457, 77 L.Ed. 1011] (1933) (Cardozo, J.); The Western Maid, 257 U.S. 419, 433 [42 S.Ct. 159, 161, 66 L.Ed. 299] (1922) (Holmes, J.).\n\nBivens, 403 U.S. at 391-92, 91 S.Ct. at 2002.\n\nIn reciprocity, I now find equivalent opportunity and responsibility for adjustment of remedies by the state judiciary and particularly so since one would be foolhardy to confine remedial expectations only to the fortuities of the federal civil rights act as now under the severest of pressure in current adjudicatory direction. The Bivens constitutional tort was considered but not applied in Melbourne Corp. v. City of Chicago, 76 Ill. App.3d 595, 31 Ill.Dec. 914, 920, 394 N.E.2d 1291, 1297 (1979) by analysis \"to constitute a so-called `constitutional tort,' defendant's actions must constitute a knowing or malicious violation of Melbourne's clearly established constitutional rights.\" The failure to allege malicious action or invalid ordinance denied effectuation of the remedy. The outline for state use of a constitutional right remedy in state court was provided in Kewin v. Bd. of Ed. of Melvindale Northern Allen Park Public Schools, 65 Mich. App. 472, 237 N.W.2d 514 (1975) and T \u0026 M Homes, Inc. v. Mansfield Tp., 162 N.J. Super. 497, 393 A.2d 613 (1978), and in New Jersey, Strauss v. State, 131 N.J. Super. 571, 330 A.2d 646 (1974) and Cashen v. Spann, 125 N.J. Super. 386, 311 A.2d 192 (1973), cert. granted 65 N.J. 290, 321 A.2d 251 (1974), aff'd in part, modified in part and remanded 66 N.J. 541, 334 A.2d 8, cert. denied 423 U.S. 829, 96 S.Ct. 48, 46 L.Ed.2d 46 (1975).\n\nA school teacher mandatory maternal leave complaint was addressed in Kewin, 237 N.W.2d at 519-20, where the court sustained the damage award by statement in denying the challenge to reversal:\n\nWe reject these challenges to the judgment but admit that we are not entirely satisfied in requiring the Board to pay damages. We would, however, be less satisfied in denying plaintiff compensation. Her rights were clearly violated; she suffered economic loss as a result, losses well established in the court below. Even though the constitutional claim may be one of first impression, courts should award compensation where there is an infringement of personal interests in liberty. Cf., Bivens v. Six Unknown Named Agents of Federal Bureau of Narcotics, 403 U.S. 388, 91 S.Ct. 1999, 29 L.Ed.2d 619 (1971).\n\nThe court in T \u0026 M Homes, Inc., 393 A.2d 613 similarly applied the Bivens concept to provide \"another remedy.\" That case also has value in the analysis that constitutional rights cannot be denied by passage of state legislation, albeit in that case founded upon the existence of the federally guaranteed constitutional interest. It should be similarly recognized here that state tort claim acts do not amend the state constitution to deny nor denigrate basic guarantees inculcated into our society's basic structure by the constitutional declaration. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nImmunity cases of whatever brand of weed grow from a common seed fertilized by denial of rights to the injured from depravation or injury committed by agents of the state. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The basic thesis of the intrinsic constitutional tort is that inaction by legislature or executive cannot deny the judicial responsibility under the state constitution to support, obey and defend the constitution, Wyo. Const. art. 6, § 20, as the oath of office. Wyo. Const. art. 1, § 8 cannot be applied to permit constitutional extinguishment by legislative inaction where the rights granted as in themselves are at stake. As Wyo. Const. art. 1, § 6, Due Process of Law, states: \"No person shall be deprived of life, liberty or property without due process of law.\" That due process and the right of Wyo. Const. art. 1, § 8 that \"[a]ll courts shall be open and every person for an injury done to person, reputation or property shall have justice administered without sale, denial or delay,\" are the societal heritage of the judiciary by which our rights are defined and our oath of office is taken. A similar analysis was developed in Smith v. Whitehead, 436 A.2d 339 (D.C.App. 1981) (reh'g granted and opinion vacated 1/5/82) in adaptation of Bivens for a District of Columbia remedy. The case is interesting in analysis but questionable in precedent by virtue of its succeeding history of the panel trial court affirmance and subsequent en banc equally divided posture in review, but the Bivens issue was not the subject of the extensive judicial disagreement reflected in the divergent judicial views.\n\nI do not perceive that the majority thoughtfully extends sovereign immunity or even prosecutorial immunity to actions of the public official that violates the constitution of a state under which the oath of office is taken by not only the jurist but by the office holder. The contours of this consideration and its persuasion for present application requires analysis of the recent case, Smith v. Department of Public Health, 428 Mich. 540, 410 N.W.2d 749 (1987), cert. granted sub nom. Will v. Michigan Department of State Police, 485 U.S. 1005, 108 S.Ct. 1466, 99 L.Ed.2d 696 (1988), judgment aff'd sub nom. Will v. Michigan Department of State Police, ___ U.S. ___, 109 S.Ct. 2304, 105 L.Ed.2d 45 (1989). What the Michigan Supreme Court did must be distinguished from what was included in the affirming United States Supreme Court decision. Leaving aside the Will v. Michigan Dept. of State Police, ___ U.S. ___, 109 S.Ct. 2304, 105 L.Ed.2d 45 (1989) issue of the state as a person under Section 1983, the Michigan Supreme Court, in a very splintered decision, resolved in memorandum statement within the opinion:\n\n5) Where it is alleged that the state, by virtue of custom or policy, has violated a right conferred by the Michigan Constitution, governmental immunity is not available in a state court action.\n\n6) A claim for damages against the state arising from violation by the state of the Michigan Constitution may be recognized in appropriate cases.\n\n* * * We affirm the Court of Appeals affirmance of the denial of summary judgment as to the plaintiff's Michigan constitutional claims, and direct the Court of Claims, on remand, to determine whether a violation of the Michigan Constitution by virtue of a governmental custom or policy has been alleged; whether such a violation occurred; and, if it occurred, whether it is one for which a damage remedy is proper.\n\nSmith, 410 N.W.2d at 751. A majority of four of the court determined that governmental immunity did not apply to violations of the Michigan Constitution. Despite the stridency of the lead opinion which did not garner a majority of concurrence, that writer and the justice concurring lost a battle with the majority of the court maintaining and affirming the motion for summary judgment on the issue of non-immunity for constitutional violation of the Michigan Supreme Court. Justice Boyle, concurring in part and dissenting in part, stated:\n\nThe defendant moved for summary judgment on the basis that the state is immune from liability for plaintiff's injuries. The Court of Claims found governmental immunity inapplicable to the constitutional tort * * *. We agree * * *.\n\nAssuming the plaintiff proves an unconstitutional act by the state which is otherwise appropriate for a damage remedy, the question which confronts this Court is whether sovereign or governmental immunity shields the state from liability for damages for its alleged acts which violate our state constitution. We would hold that neither common-law sovereign immunity nor the governmental immunity * * * bars recovery.\n\nIn our constitutional form of government, the sovereign power is in the people, and \"[a] Constitution is made for the people and by the people.\" Michigan Farm Bureau v. Secretary of State, 379 Mich. 387, 391, 151 N.W.2d 797 (1967) (quoting Cooley, Constitutional Limitations [6th ed.], p. 81). The Michigan Constitution is a limitation on the plenary power of government, and its provisions are paramount. * * * It is so basic as to require no citation that the constitution is the fundamental law to which all other laws must conform. All state public officers, legislative, executive, and judicial, are required by Const. 1963, art. 11, § 1, to swear or affirm to support that same document.\n\nNeither does common-law sovereign immunity immunize the state from liability for its alleged unconstitutional acts. This Court abrogated common-law sovereign immunity in Pittman v. City of Taylor, 398 Mich. 41, 247 N.W.2d 512 (1976). Even absent such general abrogation, however, we would decline to apply sovereign immunity to violations by the state of our state constitution. The curious doctrine of sovereign immunity in America, subject to great criticism over the years, see, generally, Jaffe, Suits against governments and officers: Sovereign immunity, 77 Harv.L.R. 1 (1963), should, as a matter of public policy, lose its vitality when faced with unconstitutional acts of the state. The primacy of the state constitution would perforce eclipse the vitality of a claim of common-law sovereign immunity in a state court action for damages.\n\nIn a case involving an alleged unconstitutional act by the state government, neither sovereign nor statutory immunity should bar liability. The injury arises from violation of a constitutionally protected right by the government, a right engendered by \"the basic law which created and seeks to control that government.\" Dellinger, Of rights and remedies: The constitution as a sword, 85 Harv.L.R. 1532, 1557 (1972). The primacy of the constitution must eclipse the power of immunity to countenance constitutional violations by the state without concomitant liability.[ \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e]\n\n\u003cspan class=\"fn\"\u003e1. Their claims included malicious prosecution, false imprisonment, abuse of probation revocation process, and intentional infliction of emotional distress.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Cooneys commenced this action with a May 15, 1986, letter to appellee State of Wyoming as mandated by the Claims Act. That letter claim was filed on May 19, 1986, and denied by the State of Wyoming on September 5, 1986. The Cooneys filed a Claims Act claim against appellee Park County on March 13, 1987. They filed the complaint in this case on May 14, 1987. Appellees White and Park County filed a W.R.C.P. 12(b)(6) motion and an accompanying brief on June 15, 1987. By stipulation of the parties, appellees the State of Wyoming, the Department, and Mayor filed their motion to dismiss and supporting materials on July 15, 1987. The Cooneys filed a brief in opposition to those motions on July 30, 1987. The district court filed its decision letter on the appellees' motions on November 10, 1987, in which it dismissed all claims against White and the Claims Act claims against Park County, the State of Wyoming, the Department, and Mayor for failure to state claims upon which relief could be granted under W.R.C.P. 12(b)(6). A corresponding order was filed on December 7, 1987. The Cooneys then moved the district court to finalize its order on the motions to dismiss under W.R.C.P. 54(b) on December 15, 1987. The district court gave the parties notice concerning this motion and responses in opposition were filed by appellees the State of Wyoming, the Department and Mayor. The district court held a hearing on the matter on January 13, 1988, after which it granted the Cooneys' motion and entered an order to that effect on January 25, 1988. The Cooneys appealed that final order on February 1, 1988. On its own motion, this court dismissed that appeal because the district court's W.R.C.P. 54(b) certification did not contain at least a brief explanation for the district court's conclusion to take that action. See Tader v. Tader, 737 P.2d 1065 (Wyo. 1987). On remand the Cooneys made a W.R.C.P. 60(a) motion for a revised order. A revised final order was entered on June 7, 1988; this appeal was taken from that order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Imbler identified those reasons as: 1) a prosecutor is more likely to be sued when he decides, rather than declines, to prosecute; thus, the desire to avoid liability would always slant a prosecutor's conduct toward fewer prosecutions. This result clashes with the prosecutor's public duty to enforce the law vigorously; 2) the volume of potential lawsuits poses a serious threat to a prosecutor's decision making. Each time a prosecutor moves against an individual, he is exposed to an identifiable potential plaintiff. Conventional wisdom informs that, generally, criminal defendants are unlikely to view prosecutorial actions as having been taken in good faith. Consequently, any overturned action could generate a lawsuit. These damage claims against prosecutors may drain a disproportionately large amount of prosecutorial time — which would be better spent serving the criminal justice system; 3) qualified professionals may choose not to serve in the high-profile post of prosecutor because of an increased likelihood of untoward influences on the exercise of prosecutorial discretion and the increased drain on prosecutorial time caused by lawsuits; 4) prosecutors may be more reluctant to admit weaknesses in their cases or to produce later-discovered exculpatory evidence. Appellate judges may be more reluctant to reverse convictions if to do so might spark damage suits; 5) in-place judicial review mechanisms satisfactorily operate to deter prosecutorial misconduct. Moreover, prosecutors are subject to professional discipline, formal removal proceedings and criminal liability; and 6) reexamination in a 42 U.S.C. § 1983 action of the many prosecutorial decisions made under time and information constraints would involve a retrying of the criminal charge before a jury different from the one who decided the criminal charge and would run the risk of conflicting decisions. Id., 424 U.S. at 424-29, 96 S.Ct. at 992-94, 47 L.Ed.2d at 139-43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. 42 U.S.C. § 1983 provides: Every person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory, subjects or causes to be subjected, any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proper proceeding for redress.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In Imbler, a plurality of the Court expressly stated: We have no occasion to consider whether like or similar reasons require immunity for those aspects of the prosecutor's responsibility that cast him in the role of an administrator or investigative office rather than that of advocate. We recognize that the duties of the prosecutor in his role as advocate for the State involve actions preliminary to the initiation of a prosecution and actions apart from the courtroom. A prosecuting attorney is required constantly, in the course of his duty as such, to make decisions on a wide variety of sensitive issues. These include questions of whether to present a case to a grand jury, whether to file an information, whether and when to prosecute, whether to dismiss an indictment against particular defendants, which witnesses to call, and what other evidence to present. Preparation, both for the initiation of the criminal process and for trial, may require the obtaining, reviewing, and evaluating of evidence. At some point, and with respect to some decisions, the prosecutor no doubt functions as an administrator rather than as an officer of the court. Drawing a proper line between these functions may present difficult questions, but this case does not require us to anticipate them. Imbler, 424 U.S. at 430-31, 96 S.Ct. at 995, 47 L.Ed.2d at 144 (quoted in Blake, 651 P.2d at 1101-02 (emphasis added)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For revocation purposes no distinctions have been drawn between offenders on parole or offenders on probation. Gagnon v. Scarpelli, 411 U.S. 778, 782, 93 S.Ct. 1756, 1759, 36 L.Ed.2d 656, 661 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Safeguards against prosecutorial misconduct, other than damages actions within 42 U.S.C. § 1983, exist outside the judicial process in the form of professional sanctions and criminal prosecutions. In Imbler, the Court made it a point to remind prosecutors that: This Court has never suggested that the policy considerations which compel civil immunity for certain governmental officials also place them beyond the reach of the criminal law. Even judges, cloaked with absolute civil immunity for centuries, could be punished criminally for willful deprivations of constitutional rights on the strength of 18 U.S.C. § 242, the criminal analog of § 1983. The prosecutor would fare no better for his willful acts. Moreover, a prosecutor stands perhaps unique, among officials whose acts could deprive persons of constitutional rights, in his amenability to professional discipline by an association of his peers. These checks undermine the argument that the imposition of civil liability is the only way to insure that prosecutors are mindful of the constitutional rights of persons accused of crime. Id., 424 U.S. at 429, 96 S.Ct. at 994, 47 L.Ed.2d at 142-43 (citing ABA Code of Professional Responsibility § EC 7-13. and ABA Standards, supra, n. 24, §§ 1.1(c), (e), and Commentary, pp. 44-45) (other citations and footnotes omitted). Abusive Wyoming prosecutors are always subject to professional sanctions and criminal prosecutions. See Wyoming Rules for Professional Conduct of Attorneys at Law 3.3, 3.4, 3.8, 4.1, and 8.4 (1986). Once properly investigated, these cases should be pursued by the Wyoming Bar and the Attorney General's office with zeal. The deterrence to abusive prosecution that results from a proper disbarrment and/or conviction is logically much more effective than a large punitive damages award in a § 1983 action. When analyzing prosecutorial immunity cases, we will not arbitrarily conclude that these contemporaneous remedies are necessarily ineffective or inadequate. Doing so would require this court to hold that we are incapable of policing prosecutorial abuses properly investigated and presented to us by the Wyoming Bar, or that a majority of Wyoming prosecutors necessarily would violate their constitutional oaths rather than prosecute another lawyer. Conclusions of that character are untenable and must not be based on speculation. Compare Gray v. Bell, 712 F.2d 490, 501 (D.C. Cir. 1983) (judicial supervision under the exclusionary rule and professional sanctions are often too attenuated from the judicial process to provide more than \"hollow and ineffectual remedies.\"). See also Higgs v. District Court In and For the County of Douglas, 713 P.2d 840, 856 (Colo. 1985). They must come from the record or from judicially noticeable sources. Accord Briggs v. Goodwin, 569 F.2d 10, 24 (D.C. Cir. 1977), cert. denied, 437 U.S. 904, 98 S.Ct. 3089, 57 L.Ed.2d 1133 (1978) (where the record indicated a four and one-half year lapse since the alleged prosecutorial misconduct without any official inquiry). Without record evidence to the contrary, we must assume that professional sanctions and criminal prosecution are remedies available to an aggrieved private citizen as a deterrent to prosecutorial abuses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Superiority of government, inferiority of citizens, rejection of predominance of rights guaranteed by amendment to the United States Constitution and Bill of Rights of the Wyoming Constitution, e.g., Wyo. Const. art. 10, § 4. \"Concentration of all economic controls and planning in the hands of a highly centralized government.\" Webster's Third New International Dictionary 2230 (1971). Cf. White v. Towers, 37 Cal.2d 727, 235 P.2d 209, 211 (1951). Immunity is not a \"major step toward `statism.'\" Id. 235 P.2d at 211.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Gray, supra, 47 Cal.L.Rev. at 303 initiates this composition by quotation from William Shakespeare, Measure for Measure, Act II, Scene 2: \"O! It is excellent To have a giant's strength; but it is tyrannous To use it like a giant. . . .\" If monstrous is substituted for tyrannous, the philosophical battle lines become clarified. See Gregoire v. Biddle, 177 F.2d 579 (2nd Cir. 1949), cert. denied 339 U.S. 949, 70 S.Ct. 803, 94 L.Ed. 1363 (1950).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The vice of this case is in writing bad law on assumed facts. One could peripherally hope that the real facts were not actually so bad as what we now assume them to be by the state of this record. Suborning perjury by a prosecutorial official is unlimited meanness. Since the law that we will write is based on the assumption of the facts that were made by disposition in the motion to dismiss, we write with an assumption of validity but with a prayer that somehow lawyers, professionals and governmental agents must have some better explanation for the perpetration of cruelty than intentional criminality upon the hapless victims, Tom and Lora and their small child. Suborning perjury by a public official is infinitely worse in malum prohibitum than whatever may have occurred when Cooney, as a teenager, wrote insufficient fund checks which, as a societal activity for anyone with knowledge of banking activities, is commonplace.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. An interesting observation is found in ABA Monogram, The Judicial Role in Identifying Referring Prosecutorial Misconduct I.12-I.13 (1989): Any case in which a court has ordered a reversal of a conviction because of prosecutorial misconduct should, as a matter of court policy, be referred to the disciplinary body for investigation, whether or not the referral is mentioned in the opinion. Even when prosecutorial misconduct is not sufficient to require reversal of a conviction, if a court sees fit to comment adversely on a prosecutor's conduct, it should also refer the matter to the disciplinary body for investigation. An inextricable rule of this character would create its own danger in that the appellate court might be reluctant to reverse if the necessities of disciplinary review would automatically follow. It is apparent within the heavy volume of prosecutorial misconduct complaints that not even in a small percentage of total cases providing a finding of fault (not necessarily reversible error) was any disciplinary reference by the court made. Perhaps the only meaningful substitute for compensation would be the application of Hammurabi's Code, 1792 to 1750 B.C., where White and Mayor would spend thirty-eight days in the Park County jail as prisoners without access to a court and while their families, if any, wait without funds or home for some other bureaucratic majordomo to end the incarceration. It should be recognized that we write at a time where economic harm responsibility can be asserted painfully against attorneys under a Rule 11 assessment. See Kapco Mfg. Co., Inc. v. C \u0026 O Enterprises, Inc., 886 F.2d 1485 (7th Cir. 1989), where counsel failed in defense of his $46,780.07 Rule 11 penalty on the basis of a family's contended needs for their \"children in college.\" Compare, however, Freeman v. Myers, 191 Ill. App.3d 223, 138 Ill.Dec. 419, 547 N.E.2d 586 (1989), which shows how this non-responsibility for irresponsibility has wandered. Counsel, by deliberately ignoring court direction, incited a mistrial. The trial court, upon granting the mistrial, also granted attorney's fees to the other litigant. The appellate court in reversal, even though finding the misconduct to have been a violation of the court order, stated: Such a sanction [awarded attorney's fees] could have a dangerous chilling effect upon an attorney's ability to represent his client. Trial tactics should not be constrained with the fear a mistake or vigorous advocacy could result in severe financial penalty. There may be cases where it would be difficult to judge between mistaken tactics and deliberate and premeditated conduct. * * * Additionally, in clearly intentional situations a court may be able to fashion appropriate relief pursuant to contempt proceedings. Freeman, 138 Ill.Dec. at 422, 547 N.E.2d at 589.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Prosecutorial immunity can only be dated to 1896 or twenty-five years after the enactment of the 1871 Ku Klux Klan Act, Act of April 20, 1871, chapter 22, § 1, 17 Stat. 13 (codified at 42 U.S.C. § 1983 (1982)). The initiating case was Griffith v. Slinkard, 146 Ind. 117, 44 N.E. 1001 (1896). See Imbler, 424 U.S. at 421, 96 S.Ct. at 990 and Kreimer, The Source of Law in Civil Rights Actions: Some Old Light on Section 1988, 133 U.Pa.L.Rev. 601, 609, n. 35 (1985). For this very obvious reason, a reconstruction by historical analysis of immunities in the application of Section 1983 has clear invalidity. See Coleman, 42 U.S.C. § 1988: A Congressionally-Mandated Approach to the Construction of Section 1983, 19 Ind.L.Rev. 665, 677 (1986), which states that \"[n]owhere in the debates accompanying the passage of the Ku Klux Klan act of 1871 did members of Congress state that common law was incorporated into the 1871 Act. The Court has nevertheless attempted to deduce a rationale for implying such incorporation.\" See also Smith v. Wade, 461 U.S. 30, 93, 103 S.Ct. 1625, 1659, 75 L.Ed.2d 632 (1983) (O'Connor, J., dissenting). Coleman, supra, 19 Ind.L.Rev. at 691, discerns \"from the crazy-guilt interplay of policy, common law, and the purposes of section 1983 that the Court in the immunity cases has engaged in the creation of common law.\" The English law has long since excised the inequality of the citizen against his public official. Dicey, The Law of the Constitution 189 (8th ed. 1915) (quoted in Jaffe, Suits Against Governments and Officers: Damage Actions, 77 Harv.L. Rev. 209, 215 (1963)). See also Gray, supra, 47 Cal.L.Rev. 303. In current sarcasm — but accuracy — for so-called historical analysis, see Massey, The Jurisprudence of Poetic License, 1989 Duke L.J. 1047 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Use of the motion to dismiss to dispose of absolute or qualified immunity cases provides its own singular disability. The record, as developed, is singularly unsatisfactory to either factually justify trial court decision or to provide protection to the accused official from what may be unsubstantiated allegations. The author in Kinports, Qualified Immunity in Section 1983 Cases: The Unanswered Questions, 23 Ga.L.Rev. 597, 599-600 (1989), in recognition of the entire problem of court developed immunity to require a reasoned application, approached this problem: On a procedural level, Harlow [v. Fitzgerald, 457 U.S. 800, 102 S.Ct. 2727, 73 L.Ed.2d 396 (1982)] should not be interpreted as jettisoning years of judicial experience in dealing with comparable issues: Like other affirmative defenses, therefore, qualified immunity is something the defendant should be required to plead and prove. Similarly, the courts should treat claims of qualified immunity like other pretrial motions and should afford the plaintiff an opportunity to conduct limited discovery relevant to the qualified immunity analysis before ruling in favor of the defendant on that issue. Thoughtful authority has followed this view. Maxey By Maxey v. Fulton, 890 F.2d 279 (10th Cir. 1989); Gomez v. City of Nashua, N.H., 126 F.R.D. 432 (D.N.H. 1989). In Maxey By Maxey, 890 F.2d at 282, the Tenth Circuit Court of Appeals discerned that Mitchell, 472 U.S. 511, 105 S.Ct. 2806, 86 L.Ed.2d 411 did not \"sweep so broadly\" to deny proper discovery. \"[D]iscovery is permissible\" for which it is \"`narrowly tailored to uncover only those facts needed to rule on the immunity claim * * *.'\" Maxey By Maxey, 890 F.2d at 282-83 (quoting Lion Boulos v. Wilson, 834 F.2d 504, 507-08 (5th Cir. 1987)). How much more satisfying this present case would be if we had an adequate evidentiary base where the prosecuting attorney and parole officer testified under oath in cross-examination as to why they did what they did in securing the arrest and continuing the confinement of Cooney, when he had done nothing wrong for which that result was even arguably justified. We now need to determine if we have abandoned the principle stated by the United States Supreme Court over a century ago, to regress to a present result which is antithetical to the basic notion of public accountability on which our government is premised. \"No man in this country is so high that he is above the law. No officer of the law may set that law at defiance with impunity. All the officers of the government, from the highest to the lowest, are creatures of the law and are bound to obey it.\" Kinports, supra, 23 Ga.L.Rev. at 610-11 (quoting United States v. Lee, 16 Otto 196, 106 U.S. 196, 220, 1 S.Ct. 240, 27 L.Ed. 171 (1882)). To this end, Harlow and its progeny should be read to deny qualified immunity to a public official who is guilty of acting in violation of the Constitution if she actually realized that her conduct was unconstitutional, or if the reasonable public official acting under the same circumstances would have recognized the unconstitutionality of that conduct. In addition, this affirmative defense should be available only if the defendant is able to establish the requisite elements of the defense, and only after the plaintiff is given a reasonable opportunity to conduct the discovery necessary to support her opposition to the defendant's claim of immunity. This accommodation of the competing considerations will shield those public officials deserving of protection from \"insubstantial lawsuits,\" while at the same time ensuring that government officials may not \"with impunity discharge their duties in a way that is known to them to violate the United States Constitution or in a manner that they should know transgresses a clearly established constitutional rule.\" Kinports, supra, 23 Ga.L.Rev. at 661-62 (quoting Harlow v. Fitzgerald, 457 U.S. 800, 814, 102 S.Ct. 2727, 2736, 73 L.Ed.2d 396 (1982) and Butz v. Economou, 438 U.S. 478, 507, 98 S.Ct. 2894, 2911, 57 L.Ed.2d 895 (1978)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. For the information of the reader, I judicially notice what the criminal file, No. 3035, Park County, Wyoming, shows as facts known to the probation personnel and file information in the possession of the prosecutor. Russ Cooney was charged in a December 1983 criminal complaint involving multiple checks written with \"insufficient funds\" in an aggregate amount sufficient to constitute a felony when totaling more than $500. He was returned by extradition from Colorado and the Information was filed August 22, 1984. Arraigned in September, he appeared before the court and entered a guilty plea. On January 24, 1985, he was sentenced apparently following a plea agreement. By then, much of the bad check indebtedness had been paid, leaving only $446.92 remaining. Cooney was sentenced to a term of five years under W.S. 7-13-203 (1977) as probation before sentence and restitution of the remaining $446.92. The importance to him of the W.S. 7-13-203 (1977) probationary process is that \"[a]t any time after the expiration of one (1) year from the date of the original parole, the court shall have the power in its discretion to terminate parole and finally discharge the person and annul the verdict or plea of guilty.\" This presentence probationary arrangement has the effect of avoidance of a conviction for a felony for the individual to avoid loss of citizenship and associated adverse effects including federal firearm possession exposure. Obviously, it was of great moment to Cooney that he comply with the probationary requirements to protect his future career and maintain his family of his wife and small child. Actually, following dismissal of the revocation by hearing April 21, 1986, which is the subject of this civil damage suit, an early petition for discharge was filed by the Department of Probation and Parole and followed by an order entered December 18, 1989 \"that said defendant, Russ Cooney, be and he is hereby granted a full and complete discharge from probation in this matter.\" Cooney was a drilling rig deck hand and, at sentence, was living in Worland and employed by Corbin Well Service. Two payments were made on the restitution order as mailed from Riverton where his probation file had been transferred because of his work status. On August 12, 1985, Chris White, for the county attorney's office in Park County, filed a first petition for revocation alleging restitution payment of only $225.00, leaving a remaining balance of about $221.92. The petition for hearing was set on a notice of motion scheduled to be heard November 4, 1985. The Riverton case worker was contacted by her superior and arrangements were made between her and Cooney for payment of that balance. At about the same time, Cooney also made arrangements for his transfer of residence to Bairoil, where he was employed. He had been working on a rig at Bairoil and commuting from Riverton, a distance of approximately eighty miles each way. Finding housing available, he wanted to move to Bairoil to be with his family instead of the commuting arrangements. Bairoil is in Sweetwater County, but is served by the parole office in Rawlins, Carbon County, the closest adjoining town. The case file was transferred to Rawlins in October. On October 15th, the Riverton agent received a call from Cooney in which she believed he said his address was at a box number in LaBarge. She stated that she furnished the Rawlins office that information. As a result of that mistake however made, the case file was transferred from Rawlins to Evanston, 200 miles away, as the servicing office for LaBarge in Lincoln County. Apparently, the August petition to revoke just went away and, on November 6, 1985, it was officially dismissed by another member of the county attorney's staff. What then occurred between and among the Rawlins, Evanston and Riverton offices of probation and parole and Chris White, assistant prosecutor in Cody, is undisclosed in any record, except what was alleged in the present pleadings. We do know that Cooney was told to wait for contact from Rawlins personnel and that on January 29, 1986, Riverton received two monthly reports with advice from Cooney that no one from Rawlins had contacted him. The agent sent additional report forms which were completed by Cooney and mailed to the Rawlins office. Cooney then got permission from the Rawlins office to move to Montana since his job at Bairoil had terminated. Following the layoff, he found available work in Montana for which permission to move was requested and granted (by the Rawlins office). What we do not know is when both White and the Evanston probation officer, Mayor, knew that Cooney was in Bairoil and making regular and proper efforts to comply with the requirements of his probation. Cooney brings this case by alleging that on February 7, 1986, before he was arrested and when the petition for revocation was filed and thereafter thrown in jail for thirty-eight days, both White and Mayor knew what he was doing and where. It is apparent from the transcript of the probation revocation hearing that was held April 21, 1986 following arrest of March 15, 1986, that White and his boss, the county attorney, were taking a tough defensive stand in attempting to excuse and justify what occurred despite the known actual facts. The petition for revocation and bench warrant form designated Uinta County (Evanston), dated January 29, 1986 and filed February 7, 1986, included the following attestation: Robert Mayor, Probation and Parole Agent, Department of Probation and Parole, being duly sworn according to law, deposes and says that he is the petitioner herein; that he has read the above and foregoing Petition; that he knows the contents thereof; and that the same is true as he verily believes. And in substance for revocation, the petition stated: 3. That said Defendant has failed to maintain contact with the Wyoming Department of Probation and Parole and has changed his address without prior notification. 4. That the Park County Attorney's office has been notified of the above probation violations and has recommended that the Defendant's probation be revoked. This petition, prepared at the direction of White, was executed by Mayor and mailed to Park County as the result of which the bench warrant was issued and Cooney was consequently arrested in Bairoil and jailed in Cody over 250 miles distant. Unquestionably, paragraph three of the petition was completely false. The factual issue denied resolution by this record was what occurred between Mayor and White before January 29, 1986 and thereafter before February 7, 1986 and did either or both know where Cooney was and what he was doing as information clearly available to both the Rawlins and Riverton parole offices. If they did know, I ask why was the perjurious form signed and why was continued action taken for probation revocation? Additionally on this record, one wonders why the same form of an order to show cause was not used as had previously been prepared rather than the bench warrant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Nothing of record or in available literature establishes a normal practice. Cf. Gless, Nebraska Probation Revocation: A Primer, 68 Neb. L.Rev. 516 (1989). The usual practice is by petition to revoke and notice to appear. \"Most alleged violators appear voluntarily in response to the notice to appear.\" Id. at 521.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Obviously, the intended sort of fairness addressed in Knobel, where incarceration was limited to eight days before the bond was established and the probationer released, is not found here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In review of the many current prosecutorial misconduct absolute immunity cases, it is incomprehensible to me why the charged individual permits defenses on a motion to dismiss or judgment on the pleadings so that answering statements are not at least established in the record as a factual defense to the allegation of misbehavior. In this case, either or both the prosecutor and the probation officer may have some answers to the conspiracy to perpetrate perjury which caused not only arrest, but also retention of the innocent victim. By emplacing defense on a motion to dismiss immunity, further perjury may have been avoided, but the other side of the story is lost from the factual record. I do not find any conceivable excuse for the retention of Cooney in jail for thirty-eight days except ignorance, stupidity or simple malicious wrongdoing, but there may be some justification for the action initially taken as a result that perhaps only one if not both of the perpetrators are not perjurers and liars or not both. It may have even been a case of negligence and bad memory. Within the nature of the record and the majority opinion, we are required to assume the worst and will never know, factually, otherwise. I cannot imagine an attorney permitting decision on a record where there is unchallenged attacks on his character and honor to remain unanswered by permitting the intervention of the unwholesome armament of absolute immunity (unless the allegations are true). Ignored were both the Wyoming statute and also the United States constitutional Gagnon right to preliminary hearing and bond.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Much or even most of the foregoing may be subject to answer or response, but the use of immunity as a defense rather than a denial of wrongdoing denies assessment of a factual dispute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. An exception is found in Ramsey v. Board of Professional Responsibility of Supreme Court of Tennessee, 771 S.W.2d 116 (Tenn.), cert. denied ___ U.S. ___, 110 S.Ct. 278, 107 L.Ed.2d 258 (1989), where the district attorney was suspended for 180 days, with 135 days of that sanction suspended. The case involved fighting with and contempt for the trial judge, but nothing as serious as alleged here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Two interesting facets of the Blake opinion are immediately apparent. First, the case was not a civil rights action, 42 U.S.C. § 1983, in appellate submission since that issue had not been submitted to the jury within the verdict obtained. Additionally, in the opinion, this court made reference that \"[t]he evidence is in dispute * * *.\" Blake, 651 P.2d at 1098. This is directly contrary to our normal appellate rule where, with the entry of a jury verdict, the evidence supporting the successful participant should only be considered. In Blake, the prosecutor and her friend, the investigator, were extremely angry because of one adverse jury verdict by acquittal and another by mistrial. Giving vent to anger, damaged ego and adverse professional reflection, a victim was sought to assuage anger and erase a blight on her reputation. Unfortunately, the victim was Thomas Rupe who had served on the juries. The Wyoming statute then in effect provided a near automatic pardon result after successful conduct of criminal sentence confinement. Any casual review of the Wyoming statutes would have alerted the prosecutor to the state of Wyoming. Unfortunately, however, Rupe, who had once been convicted, appropriately answered the questions asked that he was clearly entitled to sit as a juror since, with pardon, his citizenship had been restored.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. What this means is that the blase justification for denial of economic responsibility cannot be sustained against the prosecuting attorney unless explanation is provided why the alternatives of criminal prosecution or disciplinary action were not pursued. Admitting in pleading that the prosecutor may have suborned perjury provides a heavy burden of other responsibilities to the membership of the office of the attorney general in performance of correlative responsibility as an employee of the law enforcement executive branch and as a lawyer within each participant's disciplinary responsibilities as established by the rule adopted by this tribunal. There is just nothing quasi-judicial about committing breaches of legal ethics or directly participating in the commission of perjury. A motion to dismiss is ill-mannered to provide an escape from all responsibilities for contended malfeasance, malice or criminal conduct. In defining this absolution from responsibility for misconduct as quasi-judicial, we are faced with a strongly stated characterization of American law by Gray who was a Canadian: The law relating to judges is at the root of many of the problems afflicting the law of officer's tort liability. The judge has truly been the pampered child of the law, for he is among those privileged few who are allowed to fulfill their duties not only stupidly, or negligently but wilfully, maliciously, corruptly or just plain dishonestly, yet escape liability to those damaged by his conduct. A cynic might be forgiven for pointing out just who made this law. However, it would be to give the judges much less than their due to suggest that self-protection is the clue which explains the theory of judicial immunity. Before attempting an explanation of this special status, it is wise to note there are limits to it. First of all it is not the personal immunity of the King, who is in fact absolutely immune from the reach of the courts for any and all tortious conduct. Rather the privilege of the judge extends only to acts done in his judicial capacity. So if, on the street, he punches a citizen in the nose, or runs him down in his automobile, if he has another maliciously prosecuted, or if he keeps a leaky dam that floods his neighbor, the judge, unlike the King, will be liable for damages. Second, even if he is acting in a judgelike capacity, the matter of jurisdiction may arise, depending on what category of judge he be, to dilute his immunity. Finally, while it is little solace to the individual injured thereby, the judge is open to possible criminal prosecution and liable to impeachment or removal for his mala fide or corrupt acts. However, it is ordinarily a complete answer to a complaint charging tortious conduct to a judge for him to answer, \"I am a judge and the act complained of was done while I acted as a judge within my proper jurisdiction.\" Suggested rationale of this sweeping immunity are numerous. Prof. Edward Jennings' leading article suggests no less than nine reasons that have combined to establish it. Yet, none are truly satisfactory as explanations of why a person alleging injury by a corrupt act should be barred from compensation without any consideration on the merits of the case. Gray, supra, 47 Cal.L.Rev. at 309-10 (footnotes omitted and citing Jennings, Tort Liability of Administrative Officers, 21 Minn.L.Rev. 263 (1937)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The delineation of immunity's relation to statism is not original with me. See White v. State, 784 P.2d 1313 (Wyo. 1989), Urbigkit, J., dissenting. In addition to law journal references, see Davidson v. O'Lone, 752 F.2d 817, 839 (3rd Cir. 1984), cert. granted 471 U.S. 1134, 105 S.Ct. 2673, 86 L.Ed.2d 692 (1985), aff'd 474 U.S. 344, 106 S.Ct. 668, 88 L.Ed.2d 677 (1986), Gibbons, J., dissenting. See also Meachum v. Fano, 427 U.S. 215, 230, 96 S.Ct. 2532, 2541, 49 L.Ed.2d 451, reh'g denied 429 U.S. 873, 97 S.Ct. 191, 50 L.Ed.2d 155 (1976), Stevens, J., dissenting. Man is not a creature of the state; the state is a creature of man.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In recognizing the extended discussion of the majority about the state tort claims act, although not completely in agreement, I abjure that subject in professing that a right to correct constitutional violations exists independent of any confined statutory process relating primarily to recovery for injury caused by negligent misconduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Historical review demonstrates that development of state remedies was delayed both by availability of the federal Section 1983 remedy and by the innate inaction of most state court systems. Some states such as Hawaii and New Jersey reached for an answer to provide a similar result by recognition of the general invalidity of the preclusionary immunities as a total justice denial device. Other states move forward legislatively by a more realistic general tort claims act. Generally, however, the action was federal where both the remedy and attorney's fees could be obtained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The concept presented here has similarities to but is different from the governmental-sovereign immunity addressed in White, 784 P.2d 1313. White did not consider depravation of a constitutionally protected right, but contrarily addressed the extinguishment of any remedy for injury. Here, the right is constitutional and the consequent inquiry is requirement to provide a structure for protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. It could be said that the state needs an effective weed killer which should be the Wyoming Constitution as enforced by the Wyoming judiciary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. It is a curious fact to recognize that in the majority opinion in Will, 109 S.Ct. 2304, no cognizance was taken of the decision in the state court that the state enjoyed no common-law immunity for violation of its own constitution. This subject of decision was recognized only by Justice Brennan in dissent. Justice Stevens, in dissent, additionally discerned: Legal doctrines often flourish long after their raison d'etre has perished. The doctrine of sovereign immunity rests on the fictional premise that the \"King can do no wrong.\" Even though the plot to assassinate James I in 1605, the execution of Charles I in 1649, and the Colonists' reaction to George III's stamp tax made rather clear the fictional character of the doctrine's underpinnings, British subjects found a gracious means of compelling the King to obey the law rather than simply repudiating the doctrine itself. They held his advisors and his agents responsible. Id. at 2320-21 (footnotes omitted). I am not unaware of the relationship of the Section 1983 claim against Mayor to Will, 109 S.Ct. 2304. That issue is not here before us since summary judgment was denied in the trial court and an appellate issue on that basis is not presented. Cf. Buseck v. State, 785 P.2d 855 (Wyo. 1990). The prosecuting attorney is not a state official within the office of local election and county responsibilities. Crane v. State of Texas, 759 F.2d 412, aff'd as modified 766 F.2d 193 (5th Cir.), cert. denied 474 U.S. 1020, 106 S.Ct. 570, 88 L.Ed.2d 555 (1985); Orso v. City \u0026 County of Honolulu, 56 Haw. 241, 534 P.2d 489 (1975); Kovarik v. Banner County, 192 Neb. 816, 224 N.W.2d 761 (1975). Will does not apply to the predominate issue of this appeal. See W.S. 18-3-301 through 18-3-303 and compare W.S. 9-1-801 through 8-1-811. In Park County, the office holder was an assistant county attorney with his superior elected as a county official under the provence of W.S. 18-3-301. I am also aware of the fact that the initiating complaint in this case pleaded essentially a Section 1983 federal right of action and only made claim under state law through the state tort claims act, W.S. 1-39-101 through 1-39-112. The answer is simplistic but direct. Allegations of the complaint touch the subject of guarantees afforded by the Wyoming Constitution and the defense came on a motion to dismiss. Cooney should have been given an opportunity to replead to state more forcefully and directly a claim requesting damages for the alleged violation of his constitutional rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In Blake, 651 P.2d 1096, the innocent juror had been maliciously damaged. I suffer from no particular distress if the insurance companies involved had been called to pay for the tortious damages which had been appropriately assessed by the jury verdict. It is also fair to assume that the prosecutor in that case has not now to date and will not in the future file criminal actions against jurors without bothering to read the applicable statutes and to get transcripts of proceedings to determine suitably what had occurred and whether any factual basis for the vented anger and ego assault could be justified. She also is no longer in this state in legal practice. Wyoming State Bar Directory (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. \"We are satisfied that the touchstone authority for the basis of our disposition of this appeal rests in Imbler v. Pachtman, * * *.\" Blake, 651 P.2d at 1099.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. It is \"well settled that a statute should not be considered in derogation of the common law unless it expressly so states or the result is imperatively required from the nature of the enactment.\" Bauers v. Heisel, 361 F.2d 581, 587 (3rd Cir. 1966), cert. denied 386 U.S. 1021, 87 S.Ct. 1367, 18 L.Ed.2d 457 (1967) (accord Mobile Gas Service Corp. v. Federal Power Commission, 215 F.2d 883 (3rd Cir. 1954), cert. granted 348 U.S. 950, 75 S.Ct. 446, 99 L.Ed. 742, cert. granted 348 U.S. 950, 75 S.Ct. 447, 99 L.Ed. 742 (1955), aff'd, 350 U.S. 332, 76 S.Ct. 373, 100 L.Ed. 373 (1956)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. A good faith argument that a federal court is so enabled would need to place into the context of such a result the principles established by Byrd v. Blue Ridge Rural Electric Cooperative, 356 U.S. 525, 78 S.Ct. 893, 2 L.Ed.2d 953, reh'g denied 357 U.S. 933, 78 S.Ct. 1366, 2 L.Ed.2d 1375 (1958); Guaranty Trust Co. of New York v. York, 326 U.S. 99, 65 S.Ct. 1464, 89 L.Ed. 2079, reh'g denied 326 U.S. 806, 66 S.Ct. 7, 90 L.Ed. 491 (1945); and Erie R. Co. v. Tompkins, 304 U.S. 64, 58 S.Ct. 817, 82 L.Ed. 1188 (1938), as well as those which argue for comity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Supplementing the statement, the court, in a comprehensive footnote, stated: It seems uncontroverted that 42 U.S.C. § 1983 does not provide a statutory vehicle for the enforcement of State constitutional rights. See Parratt v. Taylor, 451 U.S. 527, 535, 101 S.Ct. 1908, 1912, 68 L.Ed.2d 420 (1981); Paul v. Davis, 424 U.S. 693, 700-701, 96 S.Ct. 1155, 1160-1161, 47 L.Ed.2d 405 (1976). There was, therefore, no statutory vehicle available, at the time of her discharge, pursuant to which the plaintiff could seek redress for the alleged violation of her State constitutional rights. The absence of a statutory remedy for the violation of constitutional rights cannot absolutely and in all cases bar judicial protection of those rights. The Supreme Court of the United States has recognized this principle and, in the absence of special factors or an explicit alternative statutory remedy, has allowed direct actions to protect rights under the Federal Constitution. See Carlson v. Green, 446 U.S. 14, 18-19, 100 S.Ct. 1468, 1471, 64 L.Ed.2d 15 (1980); Davis v. Passman, 442 U.S. 228, 242-243, 99 S.Ct. 2264, 2275-2276, 60 L.Ed.2d 846 (1979); Bivens v. Six Unknown Named Agents of the Fed. Bureau of Narcotics, 403 U.S. 388, 396-397, 91 S.Ct. 1999, 2004-2005, 29 L.Ed.2d 619 (1971). Phillips, 459 N.E.2d at 457 n. 4. Also cited in support was Cooper v. Nutley Sun Printing Co., 36 N.J. 189, 197, 175 A.2d 639 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The broad academic differentiation of remedies where the injunction is available to deter invasion of constitutional rights by the prosecutor, Dombrowski v. Pfister, 380 U.S. 479, 85 S.Ct. 1116, 14 L.Ed.2d 22 (1965), but the remedial remedy of damage considering Imbler, remains unclear in American jurisprudence. The anomalies do not there end. The United States Supreme Court, in finding that a public defender did not exist in 1871, provides no immunity. Tower v. Glover, 467 U.S. 914, 104 S.Ct. 2820, 81 L.Ed.2d 758 (1984). Likewise, although not generally observed, there was no prosecutorial immunity in 1871 either since first created years later in Yaselli v. Goff, 12 F.2d 396 (2nd Cir.), cert. granted 273 U.S. 677, 47 S.Ct. 101, 71 L.Ed. 835 (1926), aff'd 275 U.S. 503, 48 S.Ct. 155, 72 L.Ed. 395 (1927) and for the United States constitutional right action by Imbler at a date one century later. Another interesting anomaly is that the state action requirement for Section 1983 can be maintained even though the only state actor is the trial judge alleged to have conspired with the litigants. Dennis v. Sparks, 449 U.S. 24, 101 S.Ct. 183, 66 L.Ed.2d 185, cert. denied 449 U.S. 1021, 101 S.Ct. 588, 66 L.Ed.2d 483 (1980). As such, the judge is exposed in all regards like his co-conspirators to some extent including the requirement to be a witness, except from being named as a party and being subjected to repayment responsibilities from the injury resulting from his conspiracy. Sykes v. State of California (Dept. of Motor Vehicles), 497 F.2d 197 (9th Cir. 1974). What is consequently presented is the anomaly that the prosecutor is given immunity from conspiratorial denial of a person's civil rights, but the public defender is not. Apparently, if the public defender conspires with the prosecutor, the public defender is subject to a Section 1983 claim and the prosecutor is not. This dichotomy is overtly senseless and, as such, although conceptionally applicable to federal civil rights under Section 1983, should not be applied to state court defenses of the state constitutional guaranteed rights. This litany of unjustified absolution of official misconduct has an edge of acceptability that is singularly undefined.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The name of the AUSA, perhaps in the interest of his or more likely her sensibilities, was never given. No indication of attorney conduct reference to a disciplinary agency appears. Obviously, an immunity defense would have been asserted if a Bivens proceeding against this prosecutor had ever been instituted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In historical perspective, as related in Davidson, 752 F.2d 817 (Gibbons, J., dissenting), the Civil Rights Act of 1871 was anesthetized by the United States Supreme Court as administered principally by White, 114 U.S. 307, 5 S.Ct. 923, 29 L.Ed. 199 and then finally come back to life sixty years later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. An observation made in Mitchell, 472 U.S. at 522-23, 105 S.Ct. at 2813 that \"the judicial process is largely self-correcting: procedural rules, appeals, and the possibility of collateral challenges obviate the need for damages actions to prevent unjust results\" is undemonstrable in general occurrence as a nature of events in this country and clearly wrong here. Thirty-eight days in jail is proof of the erroneous observation. A most striking article is Greengard, Lawyer Discipline Today, 17 Barrister 11 (1990). Every appellate judge and lawyer involved in attorney discipline should read this article.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In Barr, 360 U.S. at 564-65, 79 S.Ct. at 1336, the dilemma and weighing process was described: We are called upon in this case to weigh in a particular context two considerations of high importance which now and again come into sharp conflict — on the one hand, the protection of the individual citizen against pecuniary damage caused by oppressive or malicious action on the part of officials of the Federal Government; and on the other, the protection of the public interest by shielding responsible governmental officers against the harassment and inevitable hazards of vindictive or ill-founded damage suits brought on account of action taken in the exercise of their official responsibilities. One of the major curiosities of this entire academic exercise of reading the writings of the multitude of the jurists who deal in the merchandise of lawsuits is their paranoic like fear of claims or litigation against themselves to then be applied to other functionaries of the government establishment. It is a fear of being involved, not the comfort of being right. It is not unlike the supposition that the skilled surgeon for his own medical attention should go to a witch doctor or a medicine man, because of fear of the profession in which his skills have been entrusted. Observedly, it is no different from the predominating feature of the so-called medical malpractice insurance crisis, which has entered stage two of current time, where sincere and severe academic analysis reveals it is neither the cost of insurance nor the problem of patient recovery which magnifies the concern, but essentially the possibility, if not more than that of the filing of a lawsuit, whether well founded or not. The unanswerable question that is created within the authenticated supposition is that the justice delivery system has no confidence in the merchandise of justice for which its existence is created to provide. Anybody in business in the era of this litigious society knows that litigation is an inconvenience, but the real concern is first, litigative costs (primarily attorney fees) and secondly, availability for resort if a judgment of substance might be lost. Why the businessman, the private professional individual and, for that matter, the automobile driver should be subject to exposure, but the publicly supported governmental official demands insulation and insolation has never been persuasively or cogently explained within the mass of conclusory comments justifying an expansion of statism at the price of individual rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The concept of Liberty Lobby, Inc. today finds almost no judicial approval in the state courts and certainly has been explicitly uninvited to the Wyoming adjudicatory system, although out-of-state lawyers continue to brief and argue Liberty Lobby, Inc. and Creighton without state authority and with undiscernible benefit. See Berner v. Caldwell, 543 So.2d 686 (Ala. 1989) and Comment, Anderson v. Liberty Lobby, Inc.: Federal Rules Decision or First Amendment Case?, 59 U.Colo.L.Rev. 933 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. An incomprehensible immorality and venality is demonstrable from the concepts: The decision to initiate, maintain, or dismiss criminal charges is at the core of the prosecutorial function. These defendants allegedly used their prosecutorial powers to threaten McGruder into dismissing his damages suit. McGruder therefore argues that their activities were not those of a prosecutor seeking to punish and deter crime, but of an agent of the county seeking to intimidate a citizen in his exercise of constitutional rights. Such a motivation would be reprehensible and such threats abhorrent, but they do not lift the decision to maintain a criminal prosecution from the prosecutorial activities protected by Imbler. See Boyd v. Adams, 513 F.2d 83 (7th Cir. 1975) (anticipating Imbler test; dismissal of charges in return for release was within immunity). Our language in Henzel v. Gerstein, 608 F.2d 654, 657 n. 4 (5th Cir. 1979), is not to the contrary. The prosecutor in that case allegedly acted with the same motive as Necaise and Henry — to intimidate Henzel into agreeing not to sue state officials. But the Henzel prosecutor's activities — conditioning parole on an agreement not to sue — were not those protected by Imbler. In contrast, Henry and Necaise sought to \"persuade\" with their prosecutorial power, and therefore remained within the field of their prosecutorial immunity. McGruder, 733 F.2d at 1148. This conduct would not fit comfortably without the Wyoming extortion statute. Perhaps a differentiated sense of legal ethics and criminal misconduct exists in other jurisdictions. Cf. United States v. Davis, 890 F.2d 1373 (7th Cir. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. This means to those cognizant of the First Amendment that the prosecutor cannot function unless he can hide his criminal, unethical or slothful actions from public review and only a lawsuit can be expected to provide a searching public review. Even more curious is the fact that the case involved the membership and immunity of the California Public Service Commission. What Imbler, 424 U.S. at 424-25, 96 S.Ct. at 992 actually stated was: The public trust of the prosecutor's office would suffer if he were constrained in making every decision by the consequences in terms of his own potential liability in a suit for damages. Such suits could be expected with some frequency, for a defendant often will transform his resentment at being prosecuted into the ascription of improper and malicious actions to the State's advocate. * * * Further, if the prosecutor could be made to answer in court each time such a person charged him with wrongdoing, his energy and attention would be diverted from the pressing duty of enforcing the criminal law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. There are fringe cases, e.g. filed before trial, Ashelman, 793 F.2d 1072, or filed after ultimate acquittal for retribution or revenge, Joseph, 795 F.2d 549.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Illustrative of a time zone pretrial case is Rex, 753 F.2d at 843-44: A prosecutor is absolutely immune only for those activities \"intimately associated\" with \"initiating a prosecution [and] presenting the State's case.\" Imbler v. Pachtman, 424 U.S. 409, 430-31, 96 S.Ct. 984, 995, 47 L.Ed.2d 128 (1976). Absolute prosecutorial immunity extends no further than necessary to protect those activities. See Harlow v. Fitzgerald, 457 U.S. 800, 811, 102 S.Ct. 2727, 2735, 73 L.Ed.2d 396 (1982). Consequently, a prosecutor acting as an investigator has only qualified immunity. See id. 457 U.S. at 811 n. 16, 102 S.Ct. at 811 n. 16. Although identifying those acts entitled to absolute immunity is not always easy, the determinative factor is \"advocacy\" because that is the prosecutor's main function and the one most akin to his quasi-judicial role. See, e.g., Lerwill v. Joslin, 712 F.2d 435, 437 (10th Cir. 1983); Gray v. Bell, 712 F.2d 490, 500-02 (D.C. Cir. 1983), cert. denied, 465 U.S. 1100, 104 S.Ct. 1593, 80 L.Ed.2d 125 (1984). In Atkins v. Lanning, 556 F.2d 485, 488 (10th Cir. 1977), this court distinguished between the prosecutor's quasi-judicial role warranting absolute immunity, and his \"police-related\" work not accorded such immunity. We there cited cases making this distinction: Hampton v. City of Chicago, 484 F.2d 602, 609 (7th Cir. 1973) (planning a raid to obtain evidence of criminal activity not covered by prosecutorial immunity), cert. denied, 415 U.S. 917, 94 S.Ct. 1413, 39 L.Ed.2d 471 (1974); Apton v. Wilson, 506 F.2d 83, 91 (D.C. Cir. 1974) (prosecutorial immunity not available when a civil rights claim \"focuses on a prosecutor's actions in the course of directing police investigative activity\"); and Weathers v. Ebert, 505 F.2d 514, 517 (4th Cir. 1974) (\"Making an arrest is a police function, not a judicial one. . . .\"), cert. denied, 424 U.S. 975, 96 S.Ct. 1480, 47 L.Ed.2d 745 (1976). Other courts have held that the preliminary gathering of evidence which may blossom into a potential prosecution is investigatory activity receiving only a qualified immunity. McSurely v. McClellan, 697 F.2d 309, 320 (D.C. Cir. 1982). \"[A] prosecutor who assists, directs or otherwise participates with, the police in obtaining evidence prior to an indictment undoubtedly is functioning more in his investigative capacity than in his quasi-judicial capacities. . . .\" Marrero v. City of Hialeah, 625 F.2d 499, 505 (5th Cir. 1980). See also Crane v. State of Texas, 759 F.2d 412, aff'd as modified 766 F.2d 193 (5th Cir.), cert. denied 474 U.S. 1020, 106 S.Ct. 570, 88 L.Ed.2d 555 (1985) (which involved a practice of arresting for misdemeanors without issuance of a warrant) and Apton v. Wilson, 506 F.2d 83 (D.C. Cir. 1974). A converse example is the post-conviction treatment and jail conditions addressed in Wahl, 773 F.2d 1169. See also Joseph, 795 F.2d 549.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In reality, the Second Circuit Court of Appeals seems to have created the singular principle explained by variant statements of prosecutorial immunity without regard for criminality, morality or venality. Prosecutorial conduct is absolved by immunity. Lee is a good example of a different statement that prosecutorial misconduct is absolved by actual prosecution so no harm, no foul, whether criminal misconduct or not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Reaching the absolutely outer reefs for claimed judicial immunity is found in the claimed details of conduct of Judge Arden Mays Merckle in the Florida case with a verdict for the judge which was reversed in favor of the plaintiff in Harper, 638 F.2d 848. The case teaches that even for a judge in a Section 1983 term, there can be conduct which is unacceptable and without immunity. See likewise Beard, 648 F.2d 1264 (although at a later date, Beard was essentially reversed by the Ninth Circuit Court of Appeals in Ashelman, 793 F.2d 1072). Where a prosecutor may have caused criminal charges to be filed in order to further a civil suit in which he was involved, the conduct reached beyond absolute immunity. The court held: Udall's alleged activities, unlike those of the prosecutor in Imbler, were performed to further a private purpose. His conduct, therefore, went beyond merely performing his official duties. Beard alleges that Udall caused the criminal charge to be filed in order to further the civil suit Udall had filed on Crabtree's behalf, and that he filed the criminal charges while knowing the charges were baseless. A prosecutor who faces a conflict of interest is in as poor a position to act impartially as a judge who predetermines a judicial proceeding. See Rankin [v. Howard], supra, [633 F.2d 844 (9th Cir. 1980), cert. denied 451 U.S. 939, 101 S.Ct. 2020, 68 L.Ed.2d 326 (1981)]. Therefore, assuming Beard's allegations against Udall are true, we conclude that Udall was acting beyond the scope of his authority and thus does not enjoy absolute immunity. Beard, 648 F.2d at 1271 (footnote omitted). However, the morality expressed in the case did not last in the Ninth Circuit Court of Appeals. Ashelman, 793 F.2d 1072.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Conduct of a prosecutor conjunctive to a child abuse complaint in seizing a child from a parent was not a \"core\" proceeding justifying absolute immunity. Robison v. Via, 821 F.2d 913 (2nd Cir. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The attendant duty to deter a constitutional violation should also include the duty to speak which is attendant upon others who may be involved in malicious prosecution responses to the institution of criminal proceedings. Simmons v. Telcom Credit Union, 177 Mich. App. 636, 442 N.W.2d 739 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Omni Intern. Corp., 634 F. Supp. at 1423, 1428, 1432 (altering material documents, repeating untrue testimony, misrepresentations to the court); People v. Groh, 57 A.D.2d 389, 395 N.Y.S.2d 212 (1977) (after grand jury voted to dismiss charges against defendant, the prosecutor and the judge appeared in the grand jury room to deliver a further charge after the prosecutor discussed the grand jury's failure to indict). See generally B. Gershman, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. \"[H]arassment by unfounded litigation would cause a deflection of the prosecutor's energies from his public duties, and the possibility that he would shade his decisions instead of exercising the independence of judgment required by his public trust.\" Imbler, 424 U.S. at 423, 96 S.Ct. at 991. \"There is no great danger that abuse of power will be fostered by this exemption from civil liability, for the prosecutor is at all times under the wholesome restraint imposed by the risk of being called to account criminally for official misconduct * * *, or of being ousted from office on that account * * *.\" Yaselli, 12 F.2d at 404. Cf. B. Gershman, supra. \"The prosecuting attorney enjoys the same immunity as that which protects the judge.\" Gabbard, 359 F.2d at 185. \"The immunity rule is designed to promote `principled and fearless decision-making' by removing a judge's [and county district attorney's] `fear that unsatisfied litigants may hound him with litigation charging malice or corruption.'\" Fanale, 385 F.2d at 868 (quoting Pierson, 386 U.S. at 554, 87 S.Ct. at 1218). \"`[P]rosecutors performing their official duties are quasi-judicial officials, not non-judicial functionaries and should be able to vigorously proceed with their tasks unhampered by the fear of unlimited civil litigation.'\" Gartin, 281 N.W.2d at 30. Accord Blanton, 258 N.W.2d at 309. See Bauers, 361 F.2d 581; Sires, 320 F.2d 877; Kostal v. Stoner, 292 F.2d 492 (10th Cir. 1961), cert. denied 369 U.S. 868, 82 S.Ct. 1032, 8 L.Ed.2d 87, reh'g denied 370 U.S. 920, 82 S.Ct. 1559, 8 L.Ed.2d 500 (1962); Peckham v. Scanlon, 241 F.2d 761 (7th Cir. 1957); and Kenney, 232 F.2d 288.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. New Jersey statutes generally protect a public official for the performance of duties that statutory immunity \"does not extend to conduct amounting to a crime or constituting actual malice, actual fraud or willful misconduct.\" Cashen, 334 A.2d at 13 n. 4. New Jersey case law to date has not equated prosecutorial immunity with its judicial counterpart and reflects the philosophy that there are indeed circumstances in which a prosecutor will incur civil liability for his official conduct. We wish to make it clear that we believe that this is the preferable approach to future problems involving the civil immunity of prosecutors in this State. The public interest is best served by recognizing that prosecutors enjoy only a limited form of immunity. Id. at 13. See Zalewski v. Gallagher, 150 N.J. Super. 360, 375 A.2d 1195, 1200-01 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Hawaiian common-law had not backed away from this stance during the intervening seventy-four years it has had to do so. \"[W]e firmly rejected the view advanced in the federal courts, * * *, that non-judicial governmental officers [prosecutors] are absolutely immune from tort actions. This rejection of the federal approach was predicated on our desire to effectuate a balance between the interest of a maliciously injured plaintiff and a good faith public official.\" Towse v. State, 64 Haw. 624, 647 P.2d 696, 701 (1982). See Seibel v. Kemble, 63 Haw. 516, 631 P.2d 173 (1981); Kajiya v. Department of Water Supply, 2 Haw. App. 221, 629 P.2d 635 (1981); Lane v. Yamamoto, 2 Haw. App. 176, 628 P.2d 634 (1981); Orso, 534 P.2d 489; Runnels v. Okamoto, 56 Haw. 1, 525 P.2d 1125 (1974); and Medeiros v. Kondo, 55 Haw. 499, 522 P.2d 1269 (1974). MACY, Justice, dissenting. I dissent. No one should be immune from civil liability for intentionally committing a criminal act, especially a public official who has taken an oath to uphold the constitution and the laws of the State of Wyoming. I agree with and adopt the reasoning articulated in the closing remarks of Justice Urbigkit's dissenting opinion.\u003c/span\u003e\n\n",
    "body_length": 182980,
    "citedas": [
      "792 P.2d 1287"
    ],
    "attorneys": "Lawrence B. Cozzens, Billings, for appellants. Joseph B. Meyer, Atty. Gen., Sylvia Lee Hackl, Sr. Asst. Atty. Gen., Cheyenne, for appellee Chris J. White. Edward G. Luhm of Scott, Shelledy \u0026 Luhm, Worland, for appellees State of Wyo., Dept. of Probation and Parole, and Robert Mayor.",
    "category": [
      "36",
      "75"
    ],
    "judges": "BEFORE THOMAS, URBIGKIT, MACY, GOLDEN, JJ., AND GRANT, DISTRICT JUDGE.",
    "citation_count": 1
  }
}
