{
  "id": "VYHePWYBTlTomsSBeCkf",
  "document": {
    "title": "Mahone v. Waddle",
    "full_title": "GLENN R. MAHONE AND HARVEY L. MAHONE v. DAVID S. WADDLE, ALBERT B. ELLWAY, JR. AND THE CITY OF PITTSBURGH",
    "jurisdiction": "Third Circuit",
    "date": "1977-08-24T00:00:00.000Z",
    "docket": "Nos. 76-1377, 76-1378",
    "body": "ROSENN, Circuit Judge\n\nThese appeals from an order of the United States District Court for the Western District of Pennsylvania present the recurring question whether municipalities can be held accountable in the federal courts for deprivation of citizens' constitutional rights through misuse of governmental authority by municipal police. Facets of this issue have received the attention of the federal courts in recent years. These appeals, however, not only focus attention on the underlying language of the fourteenth amendment to the United States Constitution, but also command particular scrutiny of the thirteenth amendment and its implementation in the Civil Rights Act of 1866.\n\nThe plaintiffs instituted this action against two police officers individually and against the City of Pittsburgh. The district court granted the City's motion to dismiss all claims against it and the plaintiffs appeal. We affirm in part, reverse in part, and remand to the district court.\n\nI.\n\nPlaintiffs, two black citizens of the Pittsburgh area, claim that while driving motor vehicles on the public highways in the early morning of May 29, 1975, they were stopped without probable cause for a supposed traffic violation by the two individual defendants, Waddle and Ellway, police officers of the City of Pittsburgh. Plaintiffs allege that thereafter, because they were black, the police officers subjected them to racial epithets, verbal harassment, and physical abuse by hands, fists, and nightsticks. The police officers handcuffed the plaintiffs, threw them into a police van, and had them transported to a police station. Plaintiffs claim they were there charged with driving too fast for conditions and following too closely, although the police officers knew that these charges were false and unfounded in fact and in law. Plaintiffs were required to post a cash bond to obtain their release. Later in the day they were convicted in the city magistrate's court of the traffic violations, allegedly because the two policemen gave false testimony. They were sentenced to pay fines and costs.\n\nPlaintiffs allege that the conduct of the two police officers was performed under color of state law, that the officers were \"motivated by racial prejudice,\" and acted \"with purpose of depriving Plaintiffs of equal protection and benefits of the law, equal privileges and immunities under the law, and due process . . . .\" They claim that they sustained bodily injuries, mental anguish, and damage to their reputations as law abiding citizens by the actions of the two officers, and that the amount in controversy exceeds $10,000.\n\nPlaintiffs brought their action in the district court against the individual defendants and against the City on the grounds that plaintiffs' rights under 42 U.S.C. §§ 1981, 1983, and 1985 and the United States Constitution were violated.\n\nThree distinct grounds for relief were asserted against the City of Pittsburgh: (1) under the fourteenth amendment the City is liable on a respondeat superior basis for the misconduct of its officers; (2) under 42 U.S.C. § 1981 the City is liable on a respondeat superior basis for the misconduct of its officers; and (3) the City is liable directly for its alleged negligence or wanton recklessness in failing to train and supervise the two individual defendants and in permitting them to act as police officers notwithstanding the City's prior knowledge of their propensity to harass and mistreat black citizens. The first two grounds being federal, jurisdiction was asserted under 28 U.S.C. §§ 1331 and 1343. The third is based on state law and the federal court is asked to exercise derivative, pendent jurisdiction.\n\nIn dismissing the claims against the City, the learned district judge held that Congress' grant of immunity to municipalities in section 1983, Monroe v. Pape, 365 U.S. 167, 5 L. Ed. 2d 492, 81 S. Ct. 473 (1961), precluded any action against a municipality directly under the fourteenth amendment. He also held that on the facts alleged by plaintiffs, no relief could be granted under 42 U.S.C. § 1981, and, in addition, that the City was immune from liability under that section. The district court also dismissed the claims stated under Pennsylvania law, holding it could not exercise derivative, pendent jurisdiction since there was no basis for the exercise of federal question jurisdiction. The district court thereupon entered final judgment in favor of the City of Pittsburgh, finding \"that there is no just reason for delay with respect to the entry of final judgment as to the City of Pittsburgh.\"\n\nII.\n\nOn reviewing the dismissal under Rule 12(b)(6) of plaintiffs' claims against the City of Pittsburgh for failure to state a claim upon which relief can be granted, we are constrained to accept all the uncontroverted allegations of the complaint as true. Curtis v. Everette, 489 F.2d 516, 518 (3d Cir. 1973). Our task at this point is to determine whether the plaintiffs could prevail if the facts alleged in their complaint were borne out at a trial on the merits. Central-Penn Nat'l Bank v. Portner, 201 F.2d 607 (3d Cir.), cert. denied, 346 U.S. 815, 74 S. Ct. 26, 98 L. Ed. 342 (1953).\n\nFor the purpose of this appeal, we assume, without deciding, that the conduct alleged does violate the guarantees of the Constitution and is actionable under 42 U.S.C. § 1983\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e against the two police officers. In other than section 1983 actions, their employer would ordinarily also be held liable under the doctrine of respondeat superior for their misconduct if it occurred during the performance of their duties and within the scope of their employment. The City of Pittsburgh, however, occupies a position different from that of an ordinary employer; as a municipality, it is not a \"person\" within the meaning of § 1983 and thus is absolutely immune from the reach of that section. Monroe v. Pape, supra. Plaintiffs concede that the City is immune from liability under section 1983 and they therefore seek relief (1) under the fourteenth amendment directly, and (2) under 42 U.S.C. § 1981 (1970).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e We are thus faced with three major questions: First, can this action be maintained against the City directly under the provisions of the fourteenth amendment? Second, on the facts alleged, can relief be granted under section 1981? Third, if a claim for section 1981 relief has been stated, can the City be held liable for damages under that section? Our resolution of the pendent jurisdiction issue will turn on the answers to these questions.\n\nIII.\n\nThe first question presented is whether the fourteenth amendment by itself gives rise to a cause of action. As the City correctly informs us, this question is definitely distinct from the independent issue whether plaintiffs have properly invoked the general federal question jurisdiction of the district court under 28 U.S.C. § 1331 (1970).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In Bell v. Hood, 327 U.S. 678, 90 L. Ed. 939, 66 S. Ct. 773 (1946), the Supreme Court held that a federal district court has subject matter jurisdiction over a case whenever the pleadings allege matters in controversy arising under the Constitution or laws of the United States. Bell also teaches, however, that the question whether a court has jurisdiction under § 1331 is analytically distinct from the question whether the plaintiff has stated a cause of action upon which relief can be granted.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In the instant case, therefore, the district court's jurisdiction over the subject matter of the claim against the City is clear under section 1331.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The availability of section 1331 jurisdiction to entertain claims of constitutional violations by municipalities is a settled principle of law. See, e.g., City of Kenosha v. Bruno, 412 U.S. 507, 513-14, 516, 37 L. Ed. 2d 109, 93 S. Ct. 2222 (1973) (remand for consideration of jurisdictional amount to satisfy section 1331 requirements). Furthermore, the City in this case concedes that a federal court has section 1331 jurisdiction to try a claim against a municipality based directly on a fourteenth amendment violation. The significant question is whether plaintiffs have stated a claim upon which relief can be granted. As plaintiffs claim the source of such relief to be the fourteenth amendment, the precise issue which we are called upon to decide is whether the fourteenth amendment can serve as an independent source of an affirmative right of action against the City for damages flowing from constitutional misconduct by the City's police.\n\nThe City argues forcefully that the fourteenth amendment cannot serve as an independent source of an affirmative right of action. The City believes that section 1983, as interpreted by the Supreme Court in Monroe v. Pape, supra, completely bars any action against it for damages resulting from a deprivation of fourteenth amendment rights. Section 1983 manifests a congressional policy against municipal liability, asserts the City, which this court must not circumvent by recognizing a direct cause of action under the fourteenth amendment. In its brief, the City also contends that under section 5 of the fourteenth amendment, the exclusive power to enforce the amendment is vested in Congress and that the courts are powerless to redress violations of the amendment's guarantees without supporting legislation by Congress:\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea\n\nTo infer that the Fourteenth Amendment itself gives rise to a cause of action in damages for violations of its provisions is to ignore the plain language of Section 5 of the Amendment itself. Such a holding would make Section 5 mere surplusage. Further, such an inference by the courts would be a blatant usurpation of the power vested in Congress. [Footnote omitted.]\n\nThe plaintiffs, on the other hand, take the view that the bar on municipal liability in section 1983 does not preclude the courts from fashioning a remedy against the City directly under the fourteenth amendment. Plaintiffs do not see in section 5\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e of that amendment any limit on the power of the courts, only a grant of power to Congress. The plaintiffs find their strongest support in Bivens v. Six Unknown Named Agents of the Federal Bureau of Narcotics, 403 U.S. 388, 29 L. Ed. 2d 619, 91 S. Ct. 1999 (1971). Plaintiffs contend that Bivens stands for an expansive principle of federal court jurisprudence under which this court is empowered to imply an affirmative remedy without more from the very proscriptions of the fourteenth amendment.\n\nIn response to plaintiffs' Bivens argument, the City argues in its brief that section 5 of the fourteenth amendment precludes an extension of the rationale of that case to afford a damage remedy for a fourteenth amendment violation.\n\nThe Fourth Amendment whose enforcement was the subject of Bivens, like the other amendments in the Bill of Rights, applies per se only to the federal government. See, e.g. Wolf v. Colorado, 338 U.S. 25, 69 S. Ct. 1359, [93 L. Ed. 1782] (1949); Palko v. Connecticut, 302 U.S. 319, 58 S. Ct. 149, [82 L. Ed. 288] (1937). Thus it was reasonable for the Bivens court to conclude that implementing legislation by the national government, whose power the Bill of Rights was intended to check, was unnecessary. The Fourteenth Amendment, which applies to state action, did not leave this question open. Section 5 of the amendment expressly reposes in Congress the power to carry out its commands . . . .\n\nPlaintiffs can prevail on their fourteenth amendment claim only if we determine that section 1983 does not bar us from holding the City liable for the constitutional misconduct of its officers, that the Bivens principle can be extended to the context of the fourteenth amendment, and that section 5 of the amendment does not limit the traditional power of the courts to create appropriate remedies for the vindication of constitutional rights. The question whether liability may be imposed upon municipalities directly under the fourteenth amendment on a Bivens rationale has cropped up repeatedly but the cases exhibit a disappointing lack of analysis. Several decisions counsel against using the fourteenth amendment to hold cities accountable for unconstitutional conduct. See, e.g., Payne v. Mertens, 343 F. Supp. 1355 (N.D. Cal. 1972); Bennett v. Gravelle, 323 F. Supp. 203, 217 (D. Md. 1971), aff'd on other grounds, 451 F.2d 1011 (4th Cir. 1971), cert. dismissed, 407 U.S. 917, 92 S. Ct. 2451, 32 L. Ed. 2d 692 (1972). On the other hand, by far the greater number of cases, including three of our own decisions, either assume or leave open the possibility that a direct fourteenth amendment action will lie against a municipality.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The only extended analysis by a circuit court supports the concept of a fourteenth amendment cause of action. Brault v. Town of Milton, 527 F.2d 730 (2d Cir. 1975). That decision, however, was vacated by the court en banc and the case was decided ultimately on other grounds. Id. at 732.\n\nWe must decline to join in this debate over a fourteenth amendment, Bivens-type remedy. In view of our holding in this case that plaintiffs have stated a cause of action against the City under 42 U.S.C. § 1981, we conclude that a fourteenth amendment remedy should not be implied. Judge Garth, however, in an effort to reach the fourteenth amendment question, endeavors to structure a fourteenth amendment claim for the plaintiffs contending that their complaint alleges separate, independent conduct by the defendants not racially animated. The specific allegations to which the dissent refers, Dissenting Opinion at 1034 n.30, however, charge that the defendants \"by their actions under color of State law and motivated by racial prejudice\" deprived plaintiffs of rights, privileges, and immunities secured by the Constitution.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003eA If plaintiffs prove the racially motivated deprivations of their rights which they allege, section 1981 will afford them the redress in federal court which they seek. Bivens teaches that the existence of an effective and substantial federal statutory remedy for the plaintiffs obviates the need to imply a constitutional remedy on the plaintiffs' behalf, 403 U.S. at 407-11 (Harlan, J., concurring), and we will therefore affirm the district court's dismissal of the fourteenth amendment claims.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e We express no opinion, of course, on the issue whether a fourteenth amendment remedy may or should be implied in other cases where the plaintiffs have no effective federal statutory remedy.\n\nAn alternative basis on which we affirm the dismissal by the district court of the fourteenth amendment claim is provided by the presence in this case of pendent state law claims.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In Gagliardi v. Flint, 564 F.2d 112 (3d Cir. 1977), we reiterate a settled constitutional doctrine:\n\nHagans v. Lavine, 415 U.S. 528, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974), holds that a federal court may, and indeed usually should, decide pendent, non-constitutional claims if by doing so the court can avoid the decision of difficult constitutional issues. This is true even if the pendent claims standing alone would be beyond the jurisdiction of the federal court. 415 U.S. at 546-47 and nn.12-13. The only requirement for this exercise of pendent jurisdiction over state law claims is that the federal constitutional claims not be so insubstantial as to be incapable of supporting federal jurisdiction.\n\n564 F.2d at 114-15. As the dissent points out, Hagans itself involved a pendent federal statutory claim but the Hagans doctrine applies with equal force to state law claims. See Siler v. Louisville \u0026 Nashville R. Co., 213 U.S. 175, 53 L. Ed. 753, 29 S. Ct. 451 (1909); Mayor of Philadelphia v. Educational Equality League, 415 U.S. 605, 636-37, 39 L. Ed. 2d 630, 94 S. Ct. 1323 (1974) (White, J., dissenting); Frederick L. v. Thomas, 557 F.2d 373, n.33 (3d Cir. 1977). Our decision in Gagliardi, of course, binds us in the instant case and dictates that we affirm the dismissal of the fourteenth amendment claim.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nTwo points not raised in Gagliardi need to be made here. First, we must recognize the possibility that a case may arise in which a plaintiff claims the relief available under state law is not co-extensive with the relief available under the fourteenth amendment. We do not now decide what the proper course would be in such a situation since plaintiffs' counsel in the instant case expressly invited the Court at oral argument to decide the case solely on the basis of the pendent state claims without reaching the fourteenth amendment claims.\n\nThe second point we would make concerns the difference between the posture in which Gagliardi came to us and that of the instant case. In Gagliardi, the district court had rendered judgment on the pendent state law claim after a jury verdict for the plaintiff and the question facing us was whether the district court had abused its discretion in exercising jurisdiction over that claim. We did not hold in Gagliardi that the district court would have abused its discretion if it had not exercised pendent jurisdiction. In the instant case, on the other hand, the district court has dismissed the pendent state claims together with the various federal claims. Although we reverse the district court's dismissal of the pendent claims so that it may reconsider the possible exercise of pendent jurisdiction in light of our decisions in this case and in Gagliardi, we will not affirmatively order the district court to exercise pendent jurisdiction. Neither our decision in Gagliardi nor the two leading Supreme Court decisions - Hagans v. Lavine and Siler v. Louisville and Nashville R. Co. - are mandatory in nature. All three decisions speak in terms of the course a court \"usually should\" take, Gagliardi, at 114, not in terms of the route a court must always follow.\n\nHaving affirmed the dismissal of the fourteenth amendment claim, we now turn to the merits of plaintiffs' claim under 42 U.S.C. § 1981.\n\nIV.\n\nPlaintiffs claim a right to relief under the final two clauses of 42 U.S.C. § 1981 (1970):\n\nAll persons within the jurisdiction of the United States shall have the same right in every state . . . to the full and equal benefit of all laws and proceedings for the security of persons and property as is enjoyed by white citizens, and shall be subject to like punishments, pains, penalties, taxes, licenses, and exactions of every kind, and to no other.\n\nThe meaning of these final clauses of section 1981 - which we shall refer to as the \"equal benefit\" and \"like punishment\" clauses - has not been considered in modern times either by the Supreme Court or by any of the various circuit courts of appeals. The City argues strenuously that section 1981 does not contemplate a cause of action for injuries of the type alleged by plaintiffs. Moreover, the City believes that it is immune from any section 1981 liability whatsoever. Plaintiffs, on the other hand, assure us that their action falls squarely within the plain meaning of the section, and they find no hint of municipal immunity anywhere in the section's language or history.\n\nA.\n\nNeither of the parties has directed us to a single decision construing the equal benefit and like punishment clauses of section 1981 and our own research has uncovered only three relevant cases.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe earliest case is Strauder v. West Virginia, 100 (10 Otto) U.S. 303, 25 L. Ed. 664 (1879). The Supreme Court held that under R.S. § 1977, an identically worded predecessor to section 1981, black persons were entitled to be tried by juries selected in a racially nondiscriminatory manner. The Court declared that section 1977 \"[put] in the form of a statute what had been substantially ordained by the [fourteenth] amendment.\" 100 U.S. at 312.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e On this basis, the Court concluded that the statute prohibited trial by a jury from which blacks were excluded by law. The Court failed to specify the clauses of section 1977 on which it relied but it could only have had in mind the equal benefit and like punishment clauses. Although Strauder offers little guidance in construing the clauses, it at least refutes the City's contention that the Act is confined to deprivations of the right to contract.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe Equal Benefit clause has more recently been applied in Central Presbyterian Church v. Black Liberation Front, 303 F. Supp. 894 (E.D. Mo. 1969). The court held that the defendants' interruptions of the Church's Sunday services had deprived the church and its members of the right guaranteed by section 1981 to equal benefit of the laws for the security of property.\n\nIn the third case, a black woman and her white husband brought suit against a county alleging harassment by county police officers. Observing that the final clauses of section 1981 would be \"relegate[d] to . . . meaningless phraseology\" if racially motivated police abuses were held not actionable under the provision, the court denied the county's motion to dismiss. Raffety v. Prince George's County, 423 F. Supp. 1045 (D. Md. 1976).\n\nOur own examination of the language of section 1981 leads us to believe that its reach is as wide as these cases would indicate. The section takes the form of an enumeration of diverse rights: the right to make and enforce contracts, the right to sue, the right to be a party, the right to give evidence, and the right \"to the full and equal benefit of all laws and proceedings for the security of persons and property.\" All persons are guaranteed these rights to the same degree as they are enjoyed by white persons. The statute then provides that all persons shall be subject to the same punishment as white persons are subject, to the same \"pains\" as white persons, to the same \"penalties\" as white persons, and to the same \"taxes, licenses and exactions of every kind\" as white persons, and that no person shall be subject to any punishment, pain, penalty, tax, license or exaction other than that to which white persons are subject. The statute can be read in no other way. To read the language of the statute as applying only to the right to contract ignores the clear and vital words of the majority of its provisions. Despite the sparsity of precedent, a natural and commonsense reading of the statute compels the conclusion that section 1981 has broad applicability beyond the mere right to contract.\n\nIt is not enough to know that section 1981 extends beyond the right to contract; we must also determine whether the specific conduct alleged in the instant case falls within the ambit of the statutory language. Once again, we focus on the plain meaning of the words, because \"if the language be clear it is conclusive. There can be no construction where there is nothing to construe.\" United States v. Hartwell, 73 U.S. (6 Wall.) 385, 396, 18 L. Ed. 830 (1867).\n\nPlaintiffs have alleged that the City's police officers, clothed with the authority of the City and the state and motivated by racial bias, verbally and physically abused them, falsely arrested them, and gave false testimony against them. It seems to us that plaintiffs have in effect alleged that because they are black they were subjected to officially inflicted \"punishment, pains, [and] penalties\" other than those to which white persons are subject. In alleging that because of their race they were arrested without probable cause or warrant and that they were convicted by false testimony of crimes they did not commit, plaintiffs have in effect charged that the City's officers denied them the same \"full and equal benefit of . . . laws and proceedings for the security of persons . . . as is enjoyed by white persons.\" We therefore believe that the facts alleged fall within the broad language of both the equal benefits and like punishment clauses of section 1981.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nOur conclusion is buttressed by evidence of the contemporary understanding of the Civil Rights Act of 1866, the Act from which section 1981 derives.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e In the view of Congress, the Act was a complete statutory analog to the thirteenth amendment. The Act was not intended to have merely limited effect; rather, it was to eradicate all discrimination against blacks and to secure for them full freedom and equality in civil rights.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The broad sweep and power of the Act were recognized by the bill's opponents: one warned balefully that the Act would bestow upon the freed slaves all the rights of free citizens.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In vetoing the bill (the veto was later overridden), President Johnson expressed the fear that the bill would prohibit states from exercising any power of discrimination between the different races.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Congress thus believed that the Civil Rights Act of 1866 would prohibit all racial discrimination, apparently including the type of racially motivated physical abuse and misuse of governmental power which is alleged in this instance.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The Congressional debates thus support our conclusion that the Act's successor, section 1981,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e applies on its face to the type of discriminatory conduct alleged here.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nWeighing against the plain meaning of section 1981 and the expansive view of that section suggested by the legislative history is the City's contention that a broad construction of section 1981 will give rise to a federal cause of action for every racially motivated private tort. The City points to the Supreme Court's holdings in Johnson v. Railway Express Agency, 421 U.S. 454, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975), and Runyon v. McCrary, 427 U.S. 160, 49 L. Ed. 2d 415, 96 S. Ct. 2586 (1976), that private discrimination in employment and education is actionable under section 1981 and reasons that the inevitable result of combining Johnson and Runyon with a broad reading of the equal benefit and like punishment clauses will be a section 1981 action in federal court whenever a white man strikes a black in a barroom brawl.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nWe see no such danger. The Supreme Court cases have construed only the first of section 1981's enumerated rights - the right \"to make and enforce contracts.\" We deal here with the distinct and separate right \"to full and equal benefit of all laws and proceedings for the security of persons and property\" and with the prohibition against unequal \"punishment, pains [and] penalties.\" We perceive a fundamental distinction which precludes an application of the Johnson and Runyon principles to cases arising under the equal benefit and like punishment clauses.\n\nThe right \"to make and enforce contracts\" necessarily is concerned with relations between private individuals. It is usually with another individual, not the state, that a black person would seek to make a contract; it is that other individual's racially motivated refusal to make a contract which can cause harm to the black person. The right \"to make and enforce contracts\" can thus be infringed by private individuals and it is appropriate that private individuals be held liable for that infringement.\n\nThe words \"full and equal benefit of all laws and proceedings for the security of persons and property\" (emphasis supplied), on the other hand, suggest a concern with relations between the individual and the state, not between two individuals. The state, not the individual, is the sole source of law, and it is only the state acting through its agents, not the private individual, which is capable of denying to blacks the full and equal benefit of the law. Thus, while private discrimination may be implicated by the contract clause of section 1981, the concept of state action is implicit in the equal benefit clause. The like punishment clause may be read in the same way. Only the state imposes or requires \"taxes, licenses, and exactions\" and the maxim noscitur a sociis suggests that the \"punishment, pains [and] penalties\" to which the clause refers are those imposed by the state. In the instant case, of course, the complaint does allege state action. Certainly the like punishment clause applies to such action. We need decide no more in this case.\n\nB.\n\nWe now turn to the contention by the City and by the dissent that the district court has no jurisdiction to hold the City liable under section 1981. We will consider the City's arguments first.\n\nThe City entreats us to shield it from section 1981 liability by extending to that provision the municipal \"immunity\" recognized in 42 U.S.C. § 1983 and Monroe v. Pape, 365 U.S. 167, 5 L. Ed. 2d 492, 81 S. Ct. 473 (1961). We can find no justification for such an extension of municipal immunity. The unanimous en banc decision of the Ninth Circuit overruling its prior decision in Arunga v. Weldon, 469 F.2d 675 (1972), fully supports our conclusion. See Sethy v. Alameda Co. Water Dist., 545 F.2d 1157 (9th Cir. 1976) (en banc).\n\nFirst, the Court in Monroe v. Pape explicitly limited its holding to the narrow question whether the word \"person\" in section 1983 includes municipal corporations: \"We cannot believe that the word 'person' was used in this particular Act to include [municipalities].\" 365 U.S. at 191 (footnotes omitted) (emphasis supplied). See also Moor v. County of Alameda, 411 U.S. 693, 709-10, 36 L. Ed. 2d 596, 93 S. Ct. 1785 (1973); Note, Damage Remedies Against Municipalities for Constitutional Violations, 89 Harv. L. Rev. 922, 939-42 (1976). Whereas the word \"person\" in section 1983 defines those on whom liability may be visited, the word \"persons\" in section 1981 describes those who are protected by the statute. See Maybanks v. Ingraham, 378 F. Supp. 913 (E.D. Pa. 1974) (Lord, C.J.). Thus, Monroe's holding on municipal liability is by its terms wholly inapplicable to the question of municipal liability under section 1981. Moreover, we find in section 1981 no language whatsoever indicating a congressional intent that municipalities be held immune from liability for violations of the section's guarantees.\n\nSecondly, we are not persuaded by the argument that the congressional policy motivating the passage of section 1983 informed Congress' prior enactment of section 1981. Although their modern codification in Title 42 may make it appear that section 1981 and section 1983 are sister provisions of a single act of Congress which ought to be construed together, such is not the case.\n\nSection 1981 derives from the Civil Rights Act of 1866 and from the reenactment of section 1 of that Act in sections 16 and 18 of the Act of May 31, 1870.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Runyon v. McCrary, supra, 427 U.S. at 168-70 n.8. Due to its unusual history, section 1981 can fairly be said to rest not only on the fourteenth amendment but also on the foundation provided by the thirteenth amendment. Id. at 189 (Stevens, J., concurring). See also Tillman v. Wheaton-Haven Recreation Ass'n, 410 U.S. 431, 439-40 n.11, 35 L. Ed. 2d 403, 93 S. Ct. 1090 (1973); Strauder v. West Virginia, 100 U.S. 303, 312, 25 L. Ed. 664 (1879); Young v. Int'l Tel. \u0026 Tel. Co., 438 F.2d 757, 759 (3d Cir. 1971). As we have previously noted, the legislative history of the Civil Rights Act of 1866 manifests Congress' purpose to enact sweeping legislation implementing the thirteenth amendment to abolish all the remaining badges and vestiges of the slavery system. Section 1983, on the other hand, derives from the Civil Rights Act of 1871,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e enacted to enforce the fourteenth amendment. \"And it has long been recognized that ' different problems of statutory meaning are presented by two enactments deriving from different constitutional sources.'\" Dist. of Columbia v. Carter, 409 U.S. 418, 423, 34 L. Ed. 2d 613, 93 S. Ct. 602 (1972), quoting Monroe v. Pape, 365 U.S. at 205-06 (Frankfurter, J., dissenting).\n\nThe two Acts differ not only in derivation but also in scope: the debates on the 1871 Act evidence Congress' intent to temper the protection of civil rights against encroachment by the states with countervailing concerns of federalism.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Moreover, the Act of 1871 is addressed only to the state and to those acting under color of state authority while the Act of 1866 extends, in some respects, to acts of private discrimination. Jones v. Alfred H. Mayer, 392 U.S. 409, 20 L. Ed. 2d 1189, 88 S. Ct. 2186 (1968); Johnson v. Railway Express Agency, 421 U.S. 454, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975); Runyon v. McCrary, supra. Although we recognize that the later Act is more limited in scope, the broad language of the Act of 1866 has never been repealed by Congress and we must apply it as written. See Dist. of Columbia v. Carter, supra, 409 U.S. at 424-25. We therefore reject the suggestion that section 1981 must be interpreted by reference to the legislative history of section 1983.\n\nWe also find no merit in the proposition that section 1983 constitutes an implied repeal of section 1981 insofar as municipal liability is concerned. The idea that section 1983 bars municipal liability is based on Congress' rejection of Senator Sherman's proposed amendment to the Civil Rights Act of 1871 under which all the inhabitants of a city would have been collectively responsible for a single individual's private act of violence against blacks which occurred within the city's borders. Monroe v. Pape, 365 U.S. at 188-90. The liability which we believe section 1981 authorizes us to impose on the City in the instant case, however, is based not on private acts of violence but instead on official misconduct under color of state law by the City's police officers. Nothing in the legislative history of section 1983 indicates that Congress' concern with municipal liability under that section extended to municipal liability under every prior federal civil rights act.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e We therefore cannot agree with the City that Congress' rejection of the Sherman Amendment in 1871, shields the City from liability under the Act of 1866. See Sethy v. Alameda Co. Water Dist., supra.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nWe now turn to the somewhat more abstruse argument advanced by Judge Garth. That argument, as we understand it, is this: (1) Since at the time the 1866 Act was enacted the federal trial courts had no jurisdiction to hear civil rights actions and since the 1866 Act did not itself vest the courts with such jurisdiction, the 1866 Act clearly did not contemplate that the rights which it declared could be enforced by private civil actions in the federal courts. (2) The potential for private civil actions under the 1866 Act was realized only when Congress enacted the Civil Rights Act of 1871 and vested the federal courts with a limited jurisdiction to hear civil rights suits. (3) Any § 1981 cause of action, therefore, must be defined by the limits on the 1871 grant of jurisdiction. (4) Since the 1871 grant of jurisdiction accompanied the substantive provisions of the 1871 Act now codified in 42 U.S.C. § 1983 and since § 1983 does not extend to suits against municipalities, Monroe v. Pape, supra, it impliedly follows that the jurisdiction granted in 1871 also does not extend to suits against municipalities. (5) Thus, since the limitation of the 1871 grant of jurisdiction must be read into the substantive provisions of § 1981, it is clear, according to the dissent, that § 1981 does not create a private right of action against municipalities cognizable under the modern day successor to the 1871 Act's jurisdictional component - 28 U.S.C. § 1343(3). (6) Since municipalities are immune from liability under a § 1981 and § 1343(3) combination, it would frustrate the intent of Congress to hold municipalities liable under any combination of § 1981 with the post-1871 jurisdictional provisions codified in 28 U.S.C. § 1331 and 28 U.S.C. § 1343(4).\n\nLaboriously building its analysis, the dissent endeavors to construct a wall insulating the City from the consequences of its officers' alleged misconduct. The wall which it attempts to build must crumble if even one of the blocks upon which it rests is removed. Nevertheless, since we believe that each and every step in the analysis is flawed, we will discuss each seriatim.\n\n(1) We begin with the dissent's bold assertion that \"the 39th Congress never contemplated that section 1 of the 1866 Act would enable aggrieved persons to initiate suit in federal court against anyone. . . .\" Dissenting at 1041. This conclusion is based, it appears, both on the dissent's jaunt into legislative history and its erroneous conclusion that the federal courts enjoyed no jurisdiction over private civil rights actions until 1871. The problem with this part of the dissent is threefold: it overlooks the very language of both the 1866 and 1871 Acts, it erroneously attributes § 1343(3) to the 1871 Act, and it ignores scores of decisions by both the Supreme Court and the lower federal courts.\n\nSection 3 of the Civil Rights Act of 1866 provides in part:\n\nSec. 3. And be it further enacted, That the district courts of the United States, within their respective districts, shall have, exclusively of the courts of the several States, cognizance of all crimes and offenses committed against the provisions of this act, and also, concurrently with the circuit courts of the United States, of all causes, civil and criminal, affecting persons who are denied or cannot enforce in the courts or judicial tribunals of the State or locality where they may be any of the rights secured to them by the first section of this act ; and if any suit or prosecution, civil or criminal, has been or shall be commenced in any State court, against any such person, for any cause whatsoever, or against any officer, civil or military, or other person, for any arrest or imprisonment, trespasses, or wrongs done or committed by virtue or under color of authority derived from this act or the act establishing a Bureau for the relief of Freedmen and Refugees, and all acts amendatory thereof, or for refusing to do any act upon the ground that it would be inconsistent with this act, such defendant shall have the right to remove such cause for trial to the proper district or circuit court in the manner prescribed by the \"act relating to habeas corpus and regulating judicial proceedings in certain cases,\" approved March three, eighteen hundred and sixty-three; and all acts amendatory thereof.\n\n(Emphasis added.) The italicized language, it seems to us, vests the district courts with the very jurisdiction over civil cases which the dissent professes not to see.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nAny possible question as to the jurisdiction vested by section 3 of the 1866 Act is resolved by a close reading of section 1 of the 1871 Civil Rights Act:\n\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That any person who, under color of any law, statute, ordinance, regulation, custom, or usage of any State, shall subject, or cause to be subjected, any person within the jurisdiction of the United States to the deprivation of any rights, privileges, or immunities secured by the Constitution of the United States, shall, any such law, statute, ordinance, regulation, custom, or usage of the State to the contrary notwithstanding, be liable to the party injured in any action at law, suit in equity, or other proper proceeding for redress; such proceedings to be prosecuted in the several district or circuit courts of the United States, with and subject to the same rights of appeal, review upon error, and other remedies provided in like cases in such courts, under the provisions of the act of the ninth of April, eighteen hundred and sixty-six entitled \"An act to protect all persons in the United States in their civil rights, and to furnish the means of their vindication \"; and the other remedial laws of the United States which are in their nature applicable in such cases.\n\n(Emphasis added.) The language preceding the first semicolon, now codified in 42 U.S.C. § 1983, creates a cause of action; the language following the first semi-colon establishes concomitant jurisdiction. According to the dissent, this language marks the very first grant of federal court jurisdiction over civil rights actions. The dissent, however, overlooks the express and unambiguous reference, emphasized above, to \"like cases . . . under the provisions of [the Civil Rights Act of 1866].\"\n\nSince the \"proceedings\" contemplated by Section 1 of the 1871 Act are private civil actions for deprivations of the enumerated rights (now familiar as § 1983 actions), the reference to \"like cases\" under the 1866 Act shows that the 1871 Congress understood the 1866 Act as also giving rise to private civil actions in the federal courts. The plain language of the 1866 Act combined with this evidence of the almost contemporaneous Congressional understanding of that language more than adequately refutes the dissent's assertion that the 1866 Act did not include a cause of action and a grant of jurisdiction co-extensive with the rights which it declared.\n\nAn equally fundamental flaw in the dissent's argument is its assertion that 28 U.S.C. § 1343(3) derives only from the 1871 Act - an assertion which serves as the basis for its contention that a § 1981 action alleging jurisdiction under § 1343(3) must be limited by the substantive provisions of the 1871 Act (now found in 42 U.S.C. § 1983). However, the genesis of § 1343(3) is not the 1871 Act but the 1866 Act:\n\n[Section 1343(3)] is derived from R.S. 563, § 12, which, in turn, originated in § 3 of the Civil Rights Act of April 9, 1866, 14 Stat. 27, as reenacted by § 18 of the Civil Rights Act of May 31, 1870, 16 Stat. 144, and referred to in § 1 of the Civil Rights Act of April 20, 1871, 17 Stat. 13.\n\nHague v. CIO, 307 U.S. 476, 508 n.10 83 L. Ed. 2d 1423, 59 S. Ct. 954 (1939) (Opinion of Roberts, J.). See also Lynch v. Household Finance Corp., 405 U.S. 538, 543-44 n.7, 31 L. Ed. 2d 424, 92 S. Ct. 1113 (1972); Bodensteiner, Federal Court Jurisdiction of Suits Against \"Non-Persons\" for Deprivation of Constitutional Rights, 8 Val. L. Rev. 215, 229-34 (1974).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003eA The dissent's assertion that § 1343(3) derives from the 1871 Act is thus unfounded and its conclusion that the substantive provisions of the 1871 Act (§ 1983) somehow limit the scope of the § 1981 action is erroneous.\n\nJudge Garth's alternative theory that § 1981 creates no cause of action even if it does vest jurisdiction must also be rejected. Interesting as his excerpts from the legislative history may be - and we do not concede that they provide an accurate summary of the entire debate - the contention that § 1981 (and § 1982 which is also derived from section 1 of the 1866 Act) create no cause of action is completely foreclosed by the scores of adjudicated cases concerning § 1981 (and § 1982) causes of action.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Judge Garth's novel theory that all these cases have been brought on a federal common law basis, Dissenting Opinion at 1037, finds absolutely no support in the cases or commentary.\n\n(2) In view of our determination above that the 1866 Act created both a cause of action and co-extensive jurisdiction - the former now codified in 42 U.S.C. §§ 1981-82 and the latter in 28 U.S.C. § 1343(3), we must also reject the dissent's contention that the jurisdictional component of the 1871 Act somehow breathed life into the 1866 Act for the first time.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\n(3) Even if we were to accept arguendo the dissent's erroneous contention that it was the jurisdictional component of the 1871 Act which somehow gave life to a theretofore non-existent § 1981 action as well as the contention that § 1343(3) derives from the 1871 Act, we still could not agree with the next step in the analysis - that the limits on the jurisdiction vested by the 1871 Act must now be read into every § 1981 action. The first reason is that we believe our proper concern must still be with the language of § 1343(3), not with that of the 1871 Act.\n\nA cursory comparison of the jurisdictional language of the 1871 Act -\n\nsuch proceeding to be prosecuted in the several district or circuit courts of the United States, with and subject to the same rights of appeal, review upon error, and other remedies provided in like cases in such courts, under the provisions of [the Civil Rights Act of 1866] -\n\nwith the language presently found in 28 U.S.C. § 1343(3) -\n\nThe district courts shall have original jurisdiction of any civil action authorized by law to be commenced by any person:\n\n(3) To redress the deprivation, under color of any State law, statute, ordinance, regulation, custom or usage, of any right, privilege or immunity secured by the Constitution of the United States or by any Act of Congress providing for equal rights of citizens . . .;\n\nreveals that § 1343(3) represents a much broader grant of jurisdiction than section 1 of the 1871 Act. The two provisions are not \"in substantially identical form\" as the dissent suggests. Dissenting opinion at 1041. Whereas the 1871 Act creates jurisdiction only for \"such proceedings,\" i.e., actions brought under that Act's substantive provisions (now § 1983), section 1343(3) extends jurisdiction over actions to redress the deprivation of rights secured by \" any Act of Congress providing for equal rights of citizens.\" (Emphasis supplied.)\n\nThe difference between the two provisions is of more than historical or theoretical interest. Assuming that Judge Garth is correct is stating that the jurisdictional component of the 1871 Act was codified in Revised Statutes § 563(12) and § 629(16), see Dissenting op. at 1037-38 n.1, those provisions were ultimately replaced by section 1343(3) which, as it now stands, was enacted into positive law by the Act of June 25, 1948.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Thus, it is the Act of June 25, 1948 which we must construe, not the more narrowly drawn jurisdictional provisions of the 1871 Act which have been long since repealed.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nNotwithstanding the repeal of the 1871 Act's limited jurisdictional provisions and the modern day enactment of a substantively distinct and very much broader grant of jurisdiction, Judge Garth would evidently imply into § 1343(3) all the limitations of the 1871 Act and in turn read those limitations into the § 1981 cause of action. With all due respect, we believe that such an interpretation of § 1343(3) is neither consistent with the language of that statute nor accurately reflective of its history.\n\nThere is another, even more serious flaw in the dissent's argument that the limits of § 1343(3) jurisdiction must be read into every section 1981 cause of action. In concentrating on what he perceives as an implied condition of section 1343(3) limiting its application to suits against non-municipal defendants, Judge Garth has apparently overlooked the express clause of section 1343(3) restricting its reach to claims of discriminatory state action - \". . . under color of state law, statute, ordinance, regulation, custom or usage . . . .\"\n\nInasmuch as the Supreme Court has explicitly held that sections 1981 and 1982 apply to private discrimination, see, e.g., Runyon v. McCrary, supra; Johnson v. Railway Express Agency, Inc., supra, it is obvious that the express state action requirement of section 1343(3) is irrelevant to a section 1981 claim. If the courts are not permitted to read the express state action requirement to section 1343(3) into section 1981, we cannot see how we could or why we should read into that section an arguably implied condition of section 1343(3). In the absence of any explanation of these cases by the dissent, we believe that the Supreme Court's decisions in Runyon, Johnson, and Jones militate strongly against this aspect of Judge Garth's theory.\n\n(4, 5) After contending that the limits of the 1871 Act are somehow made a part of a section 1981 cause of action, the dissent seems to shift its concern from the scope of the section 1981 cause of action to the bounds of section 1343(3) jurisdiction. The argument, as we understand it, is that since the 1871 Act was not to apply to actions against municipalities, it follows that section 1343(3) provides no jurisdiction over civil rights actions against municipalities.\n\nWe agree with Judge Garth that Monroe v. Pape, supra, teaches that the 1871 Act was not intended to apply to suits against municipalities but we are not convinced that this has any relevance to present day jurisdiction based on section 1343(3). First, as we demonstrate above, section 1343(3) derives primarily from section 3 of the 1866 Act, not from section 1 of the 1871 Act; whatever limits may have been a part of the 1871 Act, therefore, are not germane to a section 1981 action under section 1343(3). Secondly, as we also discuss above, even if Judge Garth were correct in tracing section 1343(3) to the 1871 Act, our proper concerns would still be with the modern day language of section 1343(3), rather than the very different, obsolete and repealed provision of the 1871 Act.\n\nWe also cannot accept the dissent's view that the Supreme Court has held that section 1343(3) jurisdiction over suits brought under provisions other than section 1983 is limited to non-municipal defendants. Judge Garth maintains that City of Kenosha v. Bruno \"held . . . that 28 U.S.C. § 1343 did not furnish jurisdiction for any suit against a municipality.\" Dissenting op. at 1043 n.12 (emphasis added). We have searched in vain for this \"holding,\" but we find nothing more in Bruno than the holding that a section 1983 complaint against a municipality does not fall within the scope of section 1343(3) jurisdiction. The reason, of course, is that section 1343 vests jurisdiction only over \"civil actions authorized by law\" whereas a section 1983 action against a municipal defendant is clearly not \"authorized by law.\"\u003cspan class=\"fnref\"\u003e32\u003c/span\u003ea\n\nAldinger v. Howard, 427 U.S. 1, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976), adds nothing of relevance to our concern in the case sub judice. It teaches that since section 1343(3) cannot provide federal question jurisdiction over a section 1983 action against a municipality, neither can section 1343(3) support pendent jurisdiction over state law claims against a city where section 1983 is the only ground of federal relief asserted against the non-pendent parties.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Neither Bruno nor Aldinger involved a section 1981 claim and neither decision offers any guidance to us in the case sub judice.\n\nFor these reasons, we are not persuaded that the district court lacked section 1343(3) jurisdiction over the section 1981 claims against the City.\n\n(6) Assuming arguendo that Judge Garth were correct in his conclusion that section 1343(3) cannot provide jurisdiction for an action against a municipality under section 1981, we still perceive no logic in extending municipal immunity to section 1981 suits brought under 28 U.S.C. § 1331 (enacted in 1875) or 28 U.S.C. § 1343(4) (enacted in 1957). We perceive neither logic nor legal basis for the dismissal of a complaint which states a cause of action under the Civil Rights Act of 1866 and alleges jurisdiction under provisions enacted in 1875 and 1957 on the basis of the legislative history of an unrelated 1871 Act of Congress.\n\nCity of Kenosha v. Bruno, supra, on which the dissent relies so heavily, fully supports our view. After holding that section 1343(3) did not provide jurisdiction over the section 1983 action against the municipal defendants, the Court remanded the case for consideration of possible section 1331 jurisdiction. Bruno contains no suggestion that the unavailability of section 1343(3) jurisdiction necessarily defeats jurisdiction over claims against municipalities under section 1331 as well.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nC.\n\nFor the foregoing reasons, we hold that plaintiffs' complaint states a cause of action under section 1981 and that the City is not immune from liability under that section. Accordingly, we will reverse the district court's dismissal of the section 1981 claim against the City.\n\nV.\n\nThe plaintiffs contend that their state law claim against the City for negligence is cognizable in the district court under that court's pendent jurisdiction. Because the district court believed it had no federal question jurisdiction over any of the claims against the City, it declined to exercise pendent jurisdiction over plaintiffs' state law claims. In light of our holding that plaintiffs have stated a claim for relief directly under section 1981, we will also remand the pendent jurisdiction question to the district court for its further consideration.\n\nThe judgment of the district court dismissing the fourteenth amendment claim will be affirmed, the dismissal of the other claims will be reversed, and the case will be remanded for proceedings consistent with this opinion.\n\nAPPENDIX\n\nTHE CIVIL RIGHTS ACT OF 1866, ACT OF APRIL 9, 1866, CH. 31, 14 STAT. 27 (1866).\n\nCHAP. XXXI. - An Act to protect all Persons in the United States in their Civil Rights, and furnish the Means of their Vindication.\n\nApril 9, 1866.\n\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, That all persons born in the United States and not subject to any foreign power, excluding Indians not taxed, are hereby declared to be citizens of the United States; and such citizens, of every race and color, without regard to any previous condition of slavery or involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall have the same right, in every State and Territory in the United States, to make and enforce contracts, to sue, be parties, and give evidence, to inherit, purchase, lease, sell, hold, and convey real and personal property, and to full and equal benefit of all laws and proceedings for the security of person and property, as is enjoyed by white citizens, and shall be subject to like punishment, pains, and penalties, and to none other, any law, statute, ordinance, regulation, or custom, to the contrary notwithstanding.\n\nWho are citizens of the United States, their rights and obligations.\n\nSEC. 2. And be it further enacted, That any person who, under color of any law, statute, ordinance, regulation, or custom, shall subject, or cause to be subjected, any inhabitant of any State or Territory to the deprivation of any right secured or protected by this act, or to different punishment, pains, or penalties on account of such person having at any time been held in a condition of slavery or involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, or by reason of his color or race, than is prescribed for the punishment of white persons, shall be deemed guilty of a misdemeanor, and, on conviction, shall be punished by fine not exceeding one thousand dollars, or imprisonment not exceeding one year, or both, in the discretion of the court.\n\nPenalty for depriving any person of any right protected by this act, by reason of color or race, \u0026c.\n\nSEC. 3. And be it further enacted, That the district courts of the United States, within their respective districts, shall have, exclusively of the courts of the several States, cognizance of all crimes and offences committed against the provisions of this act, and also, concurrently with the circuit courts of the United States, of all causes, civil and criminal, affecting persons who are denied or cannot enforce in the courts or judicial tribunals of the State or locality where they may be any of the rights secured to them by the first section of this act; and if any suit or prosecution, civil or criminal, has been or shall be commenced in any State court, against any such person, for any cause whatsoever, or against any officer, civil or military, or other person, for any arrest or imprisonment, trespasses, or wrongs done or committed by virtue or under color of authority derived from this act or the act establishing a Bureau for the relief of Freedmen and Refugees, and all acts amendatory thereof, or for refusing to do any act upon the ground that it would be inconsistent with this act, such defendant shall have the right to remove such cause for trial to the proper district or circuit court in the manner prescribed by the \"Act relating to habeas corpus and regulating judicial proceedings in certain cases,\" approved March three, eighteen hundred and sixty-three, and all acts amendatory thereof. The jurisdiction in civil and criminal matters hereby conferred on the district and circuit courts of the United States shall be exercised and enforced in conformity with the laws of the United States, so far as such laws are suitable to carry the same into effect; but in all cases where such laws are not adapted to the object, or are deficient in the provisions necessary to furnish suitable remedies and punish effences against law, the common law, as modified and changed by the constitution and statutes of the State wherein the court having jurisdiction of the cause, civil or criminal, is held, so far as the same is not inconsistent with the Constitution and laws of the United States, shall be extended to and govern said courts in the trial and disposition of such cause, and, if of a criminal nature, in the infliction of punishment on the party found guilty.\n\nCourts of the United States to have jurisdiction of offences under this act.\n\nSuits commenced in State courts may be removed on defendant's motion.\n\n1865, ch. 90. Vol. xiii, p. 507.\n\n1863, ch. 87. Vol. xii, p. 755.\n\nJurisdiction to be enforced according to the laws of the United States, or the common law, \u0026c.\n\nSEC. 4. And be it further enacted, That the district attorneys, marshals, and deputy marshals of the United States, the commissioners appointed by the circuit and territorial courts of the United States, with powers of arresting, imprisoning, or bailing offenders against the laws of the United States, the officers and agents of the Freedmen's Bureau, and every other officer who may be specially empowered by the President of the United States, shall be, and they are hereby, specially authorized and required, at the expense of the United States, to institute proceedings against all and every person who shall violate the provisions of this act, and cause him or them to be arrested and imprisoned, or bailed, as the case may be, for trial before such court of the United States or territorial court as by this act has cognizance of the offence. And with a view to affording reasonable protection to all persons in their constitutional rights of equality before the law, without distinction of race or color, or previous condition of slavery or involuntary servitude, except as a punishment for crime, whereof the party shall have been duly convicted, and to the prompt discharge of the duties of this act, it shall be the duty of the circuit courts of the United States and the superior courts of the Territories of the United States, from time to time, to increase the number of commissioners, so as to afford a speedy and convenient means for the arrest and examination of persons charged with a violation of this act; and such commissioners are hereby authorized and required to exercise and discharge all the powers and duties conferred on them by this act, and the same duties with regard to offences created by this act, as they are authorized by law to exercise with regard to other offences against the laws of the United States.\n\nDistrict Attorneys, \u0026c., to institute proceedings against all violating this act.\n\nNumber of commissioners appointed by circuit and territorial courts to be increased; their authority.\n\nSEC. 5. And be it further enacted, That it shall be the duty of all marshals and deputy marshals to obey and execute all warrants and precepts issued under the provisions of this act, when to them directed; and should any marshal or deputy marshal refuse to receive such warrant or other process when tendered, or to use all proper means diligently to execute the same, he shall, on conviction thereof, be fined in the sum of one thousand dollars, to the use of the person upon whom the accused is alleged to have committed the offence. And the better to enable the said commissioners to execute their duties faithfully and efficiently, in conformity with the Constitution of the United States and the requirements of this act, they are hereby authorized and empowered, within their counties respectively, to appoint, in writing, under their hands, any one or more suitable persons, from time to time, to execute all such warrants and other process as may be issued by them in the lawful performance of their respective duties; and the persons so appointed to execute any warrant or process as aforesaid shall have authority to summon and call to their aid the bystanders or posse comitatus of the proper county, or such portion of the land or naval forces of the United States, or the militia, as may be necessary to the performance of the duty with which they are charged, and to insure a faithful observance of the clause of the Constitution which prohibits slavery, in conformity with the provisions of this act; and said warrants shall run and be executed by said officers anywhere in the State or Territory within which they are issued.\n\nMarshals, \u0026c., to obey all precepts under this act.\n\nPenalty for refusal, \u0026c.\n\nCommissioners may appoint persons to execute warrants.\n\nAuthority of such persons.\n\nWarrants to run where.\n\nSEC. 6. And be it further enacted, That any person who shall knowingly and wilfully obstruct, hinder, or prevent any officer, or other person charged with the execution of any warrant or process issued under the provisions of this act, or any person or persons lawfully assisting him or them, from arresting any person for whose apprehension such warrant or process may have been issued, or shall rescue or attempt to rescue such person from the custody of the officer, other person or persons, or those lawfully assisting as aforesaid, when so arrested pursuant to the authority herein given and declared, or shall aid, abet, or assist any person so arrested as aforesaid, directly or indirectly, to escape from the custody of the officer or other person legally authorized as aforesaid, or shall harbor or conceal any person for whose arrest a warrant or process shall have been issued as aforesaid, so as to prevent his discovery and arrest after notice or knowledge of the fact that a warrant has been issued for the apprehension of such person, shall, for either of said offences, be subject to a fine not exceeding one thousand dollars, and imprisonment not exceeding six months, by indictment and conviction before the district court of the United States for the district in which said offence may have been committed, or before the proper court of criminal jurisdiction, if committed within any one of the organized Territories of the United States.\n\nPenalty for obstructing process under this act;\n\nfor rescue, \u0026c.;\n\nfor aiding to escape;\n\nfor harboring, \u0026c.\n\nSEC. 7. And be it further enacted, That the district attorneys, the marshals, their deputies, and the clerks of the said district and territorial courts shall be paid for their services the like fees as may be allowed to them for similar services in other cases; and in all cases where the proceedings are before a commissioner, he shall be entitled to a fee of ten dollars in full for his services in each case, inclusive of all services incident to such arrest and examination. The person or persons authorized to execute the process to be issued by such commissioners for the arrest of offenders against the provisions of this act shall be entitled to a fee of five dollars for each person he or they may arrest and take before any such commissioner as aforesaid, with such other fees as may be deemed reasonable by such commissioner for such other additional services as may be necessarily performed by him or them, such as attending at the examination, keeping the prisoner in custody, and providing him with food and lodging during his detention, and until the final determination of such commissioner, and in general for performing such other duties as may be required in the premises; such fees to be made up in conformity with the fees usually charged by the officers of the courts of justice within the proper district or county, as near as may be practicable, and paid out of the Treasury of the United States on the certificate of the judge of the district within which the arrest is made, and to be recoverable from the defendant as part of the judgment in case of conviction.\n\nFees of district attorneys, marshals, clerks, commissioner, \u0026c.;\n\nto be paid from the treasury of the United States, and to be recoverable from defendant when convicted.\n\nSEC. 8. And be it further enacted, That whenever the President of the United States shall have reason to believe that offences have been or are likely to be committed against the provisions of this act within any judicial district, it shall be lawful for him, in his discretion, to direct the judge, marshal, and district attorney of such district to attend at such place within the district, and for such time as he may designate, for the purpose of the more speedy arrest and trial of persons charged with a violation of this act; and it shall be the duty of every judge or other officer, when any such requisition shall be received by him, to attend at the place and for the time therein designated.\n\nPresident may direct the judge, \u0026c., to attend, \u0026c., for the more speedy trial of persons charged with violating this act;\n\nSEC. 9. And be it further enacted, That it shall be lawful for the President of the United States, or such person as he may empower for that purpose, to employ such part of the land or naval forces of the United States, or of the militia, as shall be necessary to prevent the violation and enforce the due execution of this act.\n\nmay enforce the act with the military and naval power.\n\nSEC. 10. And be it further enacted, That upon all questions of law arising in any cause under the provisions of this act a final appeal may be taken to the Supreme Court of the United States.\n\nAppeal to the supreme court of the United States.\n\nGARTH, Circuit Judge, dissenting in part and concurring in part.\n\nI must respectfully dissent because I am convinced that the majority has erred in several important respects. First, I do not believe that a cause of action under 42 U.S.C. § 1981 can be asserted against a municipality. Second, I believe that we cannot avoid the troublesome question of whether the Fourteenth Amendment by itself furnishes a cause of action for damages which can be employed against a municipality under any circumstances. I would reach that question, and I would hold that municipalities are not subject to such suits. Finally, I would hold that the district court did not err in dismissing the plaintiffs' pendent state claims against the City. I would accordingly affirm the judgment of the district court.\n\nTo the extent that I agree that the plaintiffs' Fourteenth Amendment claims must be dismissed, (albeit for reasons that differ from the majority's), I concur. In all other respects, I dissent.\n\nI.\n\nClaims under 42 U.S.C. § 1981\n\nThe fundamental flaw in the majority's analysis of 42 U.S.C. § 1981 is its refusal to recognize that the scope of the cause of action created by that section must be interpreted in light of the legislative history of the \"Ku Klux Klan Act\" of 1871. While it is true, as the majority notes, that 42 U.S.C. § 1981 derives from section 1 of the Civil Rights Act of 1866,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e it was not until the 1871 Act became law that § 1 of the 1866 Act was effectively converted into a provision which furnished a civil cause of action cognizable in the federal courts. As a result, it is necessary to look to the legislative history, not of the 1866 Act, as does the majority, but rather to the legislative history of the 1871 Act in order to determine whether Congress intended to subject municipalities to liability when it created the cause of action asserted by the plaintiffs in this case.\n\nA.\n\nIt is quite clear that the 39th Congress, which enacted the Civil Rights Act of 1866, never contemplated that section 1 of that Act would furnish a private cause of action cognizable in federal court. In order to understand what section 1 of the 1866 Act meant to the Congress which enacted it, it is necessary to examine the 1866 Act as a whole.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nSection 1 of the Act - which ultimately became 42 U.S.C. §§ 1981 and 1982 - was described by proponents of the measure as a declaration of rights enforceable by the machinery set up in the remaining sections of the Act. For example, Senator Lyman Trumbull (Rep. Ill.), the Chairman of the Senate Judiciary Committee and the sponsor of the 1866 Act, said of section 1:\n\nThis section is the basis of the whole bill. The other provisions of the bill contain the necessary machinery to give effect to what are declared to be the rights of all persons in the first section. . . .\n\nCong. Globe, 39th Cong., 1st Sess. 474 (1866). He also observed:\n\nThe first section will amount to nothing more than the declaration in the Constitution itself unless we have the machinery to carry it into effect. A law is good for nothing without a penalty, without a sanction to it, and that is to be found in the other sections of the bill.\n\nCong. Globe, 39th Cong., 1st Sess. 475 (1866).\n\nSection 2 provided the principal weapon for enforcing the rights enumerated in section 1. Section 2 made it a crime for anyone acting under color of law to deprive another person of any of those rights because of race or previous condition of servitude. Senator Trumbull commented:\n\nThis is the valuable section of the bill so far as protecting the rights of freedmen is concerned. . . .\n\nWhen it comes to be understood in all parts of the United States that any person who shall deprive another of any right or subject him to any punishment in consequence of his color or race will expose himself to fine and imprisonment, I think such acts will soon cease.\n\nI think it will only be necessary to go into the late slaveholding States and subject to fine and imprisonment one or two in a State, and the most prominent ones I should hope at that, to break up this whole business.\n\n(Emphasis added.) Cong. Globe, 39th Cong., 1st Sess. 475 (1866).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nSection 3 of the Act contained two important provisions. The first \"conferred exclusive criminal jurisdiction for violations of the Act upon the federal courts.\" Casper, Jones v. Mayer : Clio, Bemused and Confused Muse, 1968 Sup. Ct. Rev. 89, 104. The second \"gave persons claiming rights under the Act the opportunity to have civil or criminal state proceedings against them removed to the federal courts.\" Id.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In response to the arguments set out in this dissent, the majority contends that § 3 of the 1866 Act also conferred upon the federal court original jurisdiction over private claims under that Act. For the reasons explained in part IC infra, I am satisfied that the majority has erred in its thesis.\n\nSections 4 through 8 concerned the apprehension and prosecution of persons who had violated section 2. Section 9 empowered the President \"to employ such part of the land or naval forces of the United States, or of the militia, as shall be necessary to prevent the violation and to enforce the due execution of this Act.\" And the final section, section 10, permitted an appeal to the Supreme Court in \"any cause under the provisions of this act.\"\n\nIn short, the 1866 Act provided for the enforcement of the rights enumerated in section 1 by means of criminal prosecutions, by the removal of state suits to federal court, and, if necessary, by military force. Private actions in federal court were not among the weapons supplied by Congress for the enforcement of the rights enumerated in § 1.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nOn the contrary, a proposal to add a provision authorizing such private actions was advanced and rejected in the House of Representatives. On March 8, 1866, while the 1866 Act was being debated in the House, a motion was made to send the Act back to the Judiciary Committee. Representative John A. Bingham (Rep. Ohio) amended that motion by adding instructions for the committee\n\nto strike out all parts of said bill which are penal, and which authorize criminal proceedings, and in lieu thereof to give all citizens injured by denial or violation of any of the other rights secured or protected by said act an action in the United States courts with double costs in all cases of recovery, without regard to the amount of damages. . . .\n\n(Emphasis added.) Cong. Globe, 39th Cong., 1st Sess. 1271 (1866). The motion to recommit the bill to the Judiciary Committee with Bingham's instruction was defeated by a vote of 53 to 45. Id.\n\nBingham's proposed instructions to the Committee would obviously have been meaningless if the Act had already provided for a private cause of action cognizable in federal court. And the defeat of Bingham's proposal suggests that the House did not desire to create such a cause of action at that time.\n\nUndoubtedly the principal reason why the members of the 39th Congress never contemplated that section 1 of the 1866 Act would authorize the filing of civil actions in the federal courts is that there was no jurisdictional basis upon which the federal courts of 1866 could have entertained such suits. The first provision granting the federal courts jurisdiction over civil rights actions was not enacted until 1871,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and general federal question jurisdiction was not created until 1875.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Diversity jurisdiction would also have been unavailable for a number of reasons.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe few federal cases decided under section 1 between 1866 and 1871 reflect Congress's understanding of the meaning of that section. Section 1 was enforced during that period by criminal prosecution, United States v. Rhodes, 1 Abb. 28, 27 Fed. Cas. 785 (No. 16,151) (C.C.D. Ky. 1866), and by means of habeas corpus, In re Turner, 1 Abb. 84, 24 Fed. Cas. 337 (No. 14,247) (C.C.D. Md. 1867). However, there is no evidence that any member of a racial minority attempted to enforce § 1 by means of a civil action in federal court.\n\nWhile it seems clear that the members of the 39th Congress never contemplated that section 1 of the 1866 Act would be enforced by means of civil suits in the federal courts, they must have realized that private actions in state courts could be used to enforce that provision. As I have noted, the 1866 Act itself did not create a private cause of action. But that would not have prevented a civil plaintiff in state court from raising claims under that Act if he could fit his claims into one of the pre-existing common law forms of action.\n\nThe Constitution itself, like the 1866 Act, did not expressly create private causes of action designed to enforce its guarantees. Nevertheless, civil plaintiffs had successfully raised constitutional claims in the state courts by fitting those claims into one of the ancient forms of action. Hill, Constitutional Remedies, 69 Col. L. Rev. 1109, 1133 (1969). As one commentator has written:\n\nAfter centuries of evolution in England, litigation had become synonymous with the forms of action at Common Law and the bills in Equity. What safer way, then, of raising a constitutional question than by an action of trespass quare clausum fregit, ejectment, replevin in the cepit, detinue, trover, action on the case, covenant, special or indebitatus assumpsit, or a bill for equitable relief?\n\nJaffin, Federal Procedural Revision, 21 Va. L. Rev. 504, 525-26 (1935) (footnotes omitted). Rights under the 1866 Act were asserted by civil plaintiffs in state suits in the same way. See, e. g., Smith v. Moody, 26 Ind. 299 (1866) (action on promissory note); Cory v. Carter, 48 Ind. 327, 17 Am. Rep. 738 (1874) (mandamus); Carter v. Greenhow, 114 U.S. 317, 29 L. Ed. 202, 5 S. Ct. 928 (1884) (action on the case). In those states in which common law pleading had been replaced by a simplified code of civil procedure, a plaintiff could achieve the same result by fitting his claims into the form of a common law tort action. See, e. g., Ward v. Flood, 48 Cal. 36, 17 Am. Rep. 405 (1874).\n\nThis process is well illustrated by the case of Ferguson v. Gies, 82 Mich. 358, 46 N.W. 718 (1890), in which a black who was excluded from the dining room of a restaurant brought suit against the proprietor under a Michigan statute which guaranteed equal access to public accommodations but provided only a criminal sanction. The Supreme Court of Michigan wrote:\n\nIt is [argued] by the defendant's counsel that this statute gives no right of action for civil damages, that it is a penal statute; and that the right of the plaintiff under it is confined to a criminal prosecution. . . . The common law as it existed in this state before the colored man became a citizen under our constitution and laws, gave to the white man a remedy against any unjust discrimination to the citizen in all public places. It must be considered that, when this suit was planted, the colored man, under the laws of this state, was entitled to the same rights and privileges in public places as the white man and must be treated the same there; and that his right of action for any injuries arising from an unjust discrimination against him is just as perfect and sacred in the courts as that of any other citizen. This statute is only declaratory of the common law, as I understand it to now exist in this state.\n\nId. at 720. See also Norwood v. Galveston, H. \u0026 S.A. Ry. Co., 12 Tex. Civ. App. 560, 34 S.W. 180 (1896).\n\nIt seems to me that two important points emerge from the discussion above. First, since the 39th Congress never contemplated that section 1 of the 1866 Act would enable aggrieved persons to initiate suit in federal court against anyone, the legislative history of that Act can provide no guidance with respect to whether a private action under 42 U.S.C. § 1981 can now be maintained against a municipality. Second, since private actions under the 1866 Act could be initiated in the state courts, all that was needed to clear the way for the maintenance of such actions in the federal courts was a practicable basis of federal jurisdiction under which such suits could be entertained. Congress furnished such a basis of federal jurisdiction in 1871.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003ea\n\nB.\n\nCongress furnished a practicable basis of federal jurisdiction for private claims under the 1866 Act when it enacted § 1 of the Ku Klux Klan Act of 1871. That provision was the predecessor of the current 28 U.S.C. § 1343(3). As the Revised Statutes of 1874 phrased it, the district and circuit courts were given jurisdiction over all suits \"brought by any person to redress the deprivation, under color of any law, ordinance, regulation, custom, or usage of any State, of any right, privilege, or immunity secured by the Constitution of the United States\" or by certain federal statutes. R.S. §§ 563(12) and 629(16).\n\nObviously one of the effects of this provision was to permit the federal courts to entertain common law suits brought to vindicate rights guaranteed by the 1866 Act. If, for example, an action of trespass vi et armis could have been brought in the Pennsylvania courts prior to 1871 to redress a violation of one of the rights enumerated in the 1866 Act,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e then after 1871 that same action could be maintained in the federal courts. And in fact, once the 1871 Act was enacted, private claims under § 1 of the 1866 Act were asserted in the federal courts without any difficulty. See, e. g., Bertonneau v. Board of Directors, 3 Fed. Cas. 294 (No. 1,361) (C.C.D. La. 1878); Ho Ah Kow v. Nunan, 5 SAWY. 552, 12 Fed. Cas. 252 (No. 6,546) (C.C.D. Cal. 1879); Fraser v. M'Conway \u0026 Torley Co., 82 F. 257 (C.C.D. Pa. 1897). In short, when Congress enacted section 1 of the Ku Klux Klan Act, it took the last step needed to transform section 1 of the 1866 Act into a provision which could be enforced by means of a private cause of action in federal court. It is instructive, therefore, to determine precisely what Congress had in mind when it effected this transformation.\n\nThe Congressional debates on the 1871 Act show that the members of both Houses realized that § 1 of that measure profoundly altered \"the relationship between the States and the Nation with respect to the protection of federally created rights \", Mitchum v. Foster, 407 U.S. 225, 242, 32 L. Ed. 2d 705, 92 S. Ct. 2151 (1972), and that it \"opened up the federal courts\" to suits which previously could be brought only in state tribunals. Id. at 239. For example, an opponent of the measure, Senator Allen G. Thurman (Dem. Ohio), a former judge on the Supreme Court of Ohio, said of § 1:\n\nThis section relates wholly to civil suits. It creates no new cause of action. Its whole effect is to give to the Federal Judiciary that which now does not belong to it - a jurisdiction that may be constitutionally conferred upon it, I grant, but that has never yet been conferred upon it. It authorizes any person who is deprived of any right, privilege, or immunity secured to him by the Constitution of the United States, to bring an action against the wrong-doer in the Federal courts, and that without any limit whatsoever as to the amount in controversy. The deprivation may be of the slightest conceivable character, the damages in the estimation of any sensible man may not be five dollars or even five cents; they may be what lawyers call merely nominal damages; and yet by this section jurisdiction of that civil action is given to the Federal courts instead of its being prosecuted as now in the courts of the States. I am certainly not in favor of denying to any man who is deprived unlawfully of his right, his privilege, or his immunity, under the Constitution of the United States, that redress to which every man is entitled whose rights are violated; but I do think that it is a most impolitic provision, that in effect may transfer the hearing of all such causes into the Federal courts.\n\nMy objections to this section are briefly these: I object to it, first, because of the centralizing tendency of transferring all mere private suits, as well as the punishment of offenses, from the State into the Federal courts.\n\nIn the next place, I object to it because it is really, whatever may be said about it, a disparagement of the State courts. This bill embraces the whole United States; and to say that every man who may be injured, however slightly, in his rights, privileges, or immunities as a citizen of the United States can go to the Federal courts for redress is to say, in effect, that the judiciary of the States is not worthy of being trusted. I for one am unwilling to say that. . . .\n\nFor these reasons it does seem to me that this grant of jurisdiction to the Federal courts to entertain these actions, without any limit whatsoever as to the amount in controversy, is impolitic and unwise.\n\nCong. Globe, 42d Cong., 1st Sess., app. 216 (1871). (Emphasis added.)\n\nProponents of the 1871 Act did not dispute the fact that § 1 would permit the federal courts to hear suits which previously could be brought only in the state courts. Instead, they maintained that it was both constitutional and necessary to give the federal courts that power. For example, Representative David P. Lowe (Rep. Kan.) stated that the\n\nrecords of the [state] tribunals are searched in vain for evidence of effective redress [of federally secured rights]. . . What less than this [section 1 of the 1871 Act] will afford an adequate remedy? The Federal Government cannot serve a writ of mandamus upon State Executives or upon State courts to compel them to protect the rights, privileges and immunities of citizens. . . . The case has arisen . . . when the Federal Government must resort to its own agencies to carry its own authority into execution. Hence this bill throws open the doors of the United States courts to those whose rights under the Constitution are denied or impaired.\n\nCong. Globe, 42d Cong., 1st Sess. 374-76 (1871).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nCongress weighed these competing arguments and decided to make the \"basic alteration in our federal system\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e which § 1 of the 1871 Act entailed. It enacted that provision and thereby transformed section 1 of the 1866 Act into a statute which could be enforced by means of a private suit in federal court. However, at the same time that Congress made that important policy decision, it decided to limit the scope of the changes it was making in one significant respect. As Monroe v. Pape, 365 U.S. 167, 187-92, 5 L. Ed. 2d 492, 81 S. Ct. 473 (1961), and City of Kenosha v. Bruno, 412 U.S. 507, 37 L. Ed. 2d 109, 93 S. Ct. 2222 (1973),\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e have taught, the enactment of section 1 of the 1871 Act was not intended to make municipalities subject to suit in federal court on civil rights claims. Since it was the enactment of section 1 of the 1871 Act which cleared the way for civil actions in federal court under the 1866 Act, it follows that those suits cannot be maintained against municipalities. The 42d Congress understood that section 1 of the 1871 Act would permit private suits under the 1866 Act to be filed in federal court. It considered the arguments in favor of and against taking such a step, and it decided to enact section 1. At the same time, it rejected the idea of subjecting municipalities to such suits. It seems to me that we are bound by that decision.\n\nI am aware that some courts and commentators have argued that the Supreme Court erred in Monroe v. Pape, supra, when it concluded that the 42d Congress opposed all forms of municipal liability on civil rights claims.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e However, it seems to me that that is not a question which this Court is free to decide. The Supreme Court has repeatedly reaffirmed Monroe's interpretation of the legislative history of the 1871 Act. Aldinger v. Howard, 427 U.S. 1, 49 L. Ed. 2d 276, 96 S. Ct. 2413 City of Kenosha v. Bruno, 412 U.S. 507, 37 L. Ed. 2d 109, 93 S. Ct. 2222 (1974); Moor v. County of Alameda, 411 U.S. 693, 36 L. Ed. 2d 596, 93 S. Ct. 1785 (1973). Until that interpretation is repudiated by the Supreme Court, it binds this Court. In addition, it appears that there is a sound basis for Monroe's interpretation. While I do not propose to pass judgment upon the validity of Monroe's assessment of Congressional intent, it is interesting to note the conclusion reached by a recent, detailed study of this question:\n\nIt should . . . be noted that, while the Civil Rights Bill of 1871 was sweeping in scope, it was considered to be a first step in the enforcement of the principles of the fourteenth amendment. This point was emphasized by Representative Coburn. He stated that it was the belief of the proponents of the fourteenth amendment and this legislation that the Congress had the power to literally set aside state governments and take over the functions of the state, but that such drastic remedies were not yet needed. It was preferable in his view, and that of the drafters of the bill, that a \"simpler remedy\" against individual persons be tried before undertaking any direct interference with state governments. Thus, it would seem that the proponents of the bill intended to provide civil and criminal sanctions against individuals who engaged in activities designed to deprive some individuals of the rights guaranteed by the amendment and thought it advisable to see if these provisions were effective before determining whether any sanction against governmental bodies was needed in order to enforce the amendment.\n\nWhen seen in this context it is easy to understand why the House of Representatives defeated the proposal which Senator Sherman had introduced in the Senate to make municipalities civilly liable under this section. Throughout the debates Congress was worried about the control of some local governments by the Ku Klux Klan and the lack of enforcement of the fourteenth amendment in those areas. Senator Sherman wanted to make local governmental units responsible for those deprivations of rights so that the community as a whole would share responsibility for allowing such a situation to exist. Yet the House of Representatives overwhelmingly defeated the amendment, apparently on the basis that a milder course of action - that of proceeding directly against individuals - should be followed first.\n\nThis Congress was willing to end \"states' rights\" by penalizing state officers and other individuals who sought to violate the principles of the fourteenth amendment, but it showed no inclination to interfere directly with governmental units at this time.\n\n(Emphasis added.) (footnotes omitted.) Nowak, The Scope of Congressional Power to Create Causes of Action Against State Governments, and the History of the Eleventh and Fourteenth Amendments, 75 Col. L. Rev. 1414, 1467-68 (1975).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nC.\n\nIn response to the arguments set out above, the majority argues that § 3 of the 1866 Act conferred upon the federal courts original jurisdiction to entertain private claims under that Act. It appears to me, however, that the evidence to the contrary is overwhelming.\n\nThe relevant portions of § 3, together with the marginal notes printed in the Statutes at Large, are set out below. (As noted earlier, the entire text of the Civil Rights Act of 1866, including § 3, is attached to this dissent as an appendix.) I have subdivided the portions of § 3 quoted to make reference more convenient.\n\n(a) SEC. 3. And be it further enacted, That the district courts of the United States, within their respective districts, shall have, exclusively of the courts of the several States, cognizance of all crimes and offences committed against the provisions of this act,\n\nCourts of the United States to have jurisdiction of offences under this act.\n\n(b) and also, concurrently with the circuit courts of the United States, of all causes, civil and criminal, affecting persons who are denied or cannot enforce in the courts or judicial tribunals of the State or locality where they may be any of the rights secured to them by the first section of this act;\n\n(c) and if any suit or prosecution, civil or criminal, has been or shall be commenced in any State court, against any such person, for any cause whatsoever, or against any officer, civil or military, or other person, for any arrest or imprisonment, trespasses, or wrongs done or committed by virtue or under color of authority derived from this act or the act establishing a Bureau for the relief of Freedmen and Refugees, and all acts amendatory thereof, or for refusing to do any act upon the ground that it would be inconsistent with this act, such defendant shall have the right to remove such cause for trial to the proper district or circuit court in the manner prescribed by the \"Act relating to habeas corpus and regulating judicial proceedings in certain cases,\" approved March three, eighteen hundred and sixty-three, and all acts amendatory thereof.\n\nSuits commenced in State courts may be removed on defendant's motion.\n\n1865, ch. 99. Vol. xiii, p. 507.\n\nThe majority maintains that \"subsection b\" conferred original jurisdiction upon the federal courts and that it was the forerunner of 28 U.S.C. § 1343(3). I disagree.\n\nIt seems to me that the true meaning of \"subsection b\" is fairly obvious when it is viewed together with the other provisions of § 3. \"Subsection c\" permitted defendants who could not enforce their rights in state court to remove the proceedings against them to federal court. It also provided that the procedures for removal were to be the same as those set out in the Habeas Corpus Suspension Act of 1863, Act of March 3, 1863, c.81, 12 Stat. 755, 756 (1863).\n\nIn addition, it should be noted that a bill to amend the procedures established by the 1863 Habeas Corpus Suspension Act\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e had been introduced by Senator Trumbull and was pending in Congress while the Civil Rights Act of 1866 was under consideration. That bill amending the 1863 Act was in fact enacted on May 11, 1866, just over one month after the Civil Rights Act of 1866 became law. Thus the members of Congress who approved § 3 of the 1866 Civil Rights Act must have recognized that the procedures for the removal of cases under that section would be governed by the soon-to-be enacted measure amending the 1863 Act.\n\nAs modified by the 1866 amendment, the 1863 Act permitted removal of cases under § 3 of the 1866 Civil Rights Act in three circumstances. First, at any time after entering his appearance but prior to the empanelling of the jury, a defendant could file in the state court a verified petition stating the grounds for removal. The state court would then be obligated to proceed no further with the case and to forward the record to the appropriate federal court. Second, the defendant could remove the case to the appropriate federal circuit court after the entry of final judgment against him. Such post-trial removal was the equivalent of an appeal to a federal appellate court from a state trial court. Finally, if the state court refused to remove a case to federal court, the defendant could docket the case in federal court, and the federal court would then compel the plaintiff to proceed in federal court or suffer a default judgment.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe purpose of \"subsection b\" of the Civil Rights Act of 1866 was to give the federal courts jurisdiction of all cases under that Act which reached federal court by any of these three methods. Such cases were, by definition, cases in which the defendant could not enforce his rights in state court. The evidence suggest strongly that \"subsection b\" did no more than to provide jurisdiction for cases of this sort.\n\nThe members of Congress who debated the 1866 Act devoted little attention to § 3. (That in itself strongly suggests that it did not create a new type of original jurisdiction.) Indeed, the only authoritative explanation of that section was that given by Senator Trumbull. Trumbull stated that under § 3, \"jurisdiction is given to the Federal courts of a case affecting the person that is discriminated against.\" Cong. Globe, 39th Cong., 1st Sess. 1759 (1866). He then explained:\n\nNow, he is not necessarily discriminated against, because there may be a custom in the community discriminating against him, nor because a Legislature may have passed a statute discriminating against him; that statute is of no validity if it comes in conflict with a statute of the United States; and it is not to be presumed that any judge of a State court would hold that a statute of a State discriminating against a person on account of color was valid when there was a statute of the United States with which it was in direct conflict, and the case would not therefore rise in which a party was discriminated against until it was tested, and then if the discrimination was held valid he would have a right to remove it to a Federal court.\n\n(Emphasis added.)\n\nId. In other words, Trumbull said, a defendant could remove his case to federal court after the entry of judgment against him if that judgment was based on discrimination. Trumbull continued:\n\n- or, if undertaking to enforce his right in a State court he was denied that right, then he could go into the Federal court. . . .\n\nId. In other words, Trumbull observed, if a defendant undertook to enforce his \"right to remove\" his case to federal court but was denied that right by the state court, \"then he could go into the Federal court,\" and the case would proceed as if it had been removed from the state court. Trumbull concluded:\n\nbut it by no means follows that every person would have a right in the first instance to go to the Federal court because there was on the statute book of the State a law discriminating against him, the presumption being that the judge of the court, when he came to act upon the case, would, in obedience to the paramount law of the United States, hold the State statute to be invalid.\n\nIt seems to me that Trumbull's authoritative explanation of § 3 is utterly irreconcilable with the majority's thesis.\n\nI will not set out in text all the other evidence which refutes the majority's interpretation of section 3 as a grant of original jurisdiction. However, it seems to me that there is additional persuasive evidence refuting the majority's interpretation in the language of § 3 itself,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e in the legislative history of the 1866 Act,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e in the absence of reported cases invoking original civil jurisdiction under that Act,\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e in the legislative history of the 1871 Act,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and in recent Supreme Court cases\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and scholarly commentary on the 1866 Act.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nI turn now to the arguments advanced by the majority in support of its thesis. The majority relies, first, upon the language in section 1 of the 1871 Act which provided that the civil actions initiated under that section were:\n\n(Emphasis added.)\n\nThe majority then reasons as follows:\n\nSince the \"proceedings\" contemplated by Section 1 of the 1871 Act are private civil actions for deprivations of the enumerated rights (now familiar as § 1983 actions), the reference to \"like cases\" under the 1866 Act shows that the 1871 Congress understood the 1866 Act as also giving rise to private civil actions in the federal courts.\n\nMaj. Op. at 1033.\n\nIt seems to me that the conclusion drawn by the majority is wholly unwarranted. The Congress which enacted the 1871 Act must have known that civil actions had been removed from the state to the federal courts under the 1866 Act, and it obviously intended that the \"rights of appeal, review upon error, and other remedies\" applicable in those cases be applied as well in civil actions initiated in the federal courts under the 1871 Act. Thus the phrase \"like cases\" in § 1 of the 1871 Act undoubtedly refers to civil cases removed to - not initiated in - federal court under the 1866 Act.\n\nThe majority also cites Lynch v. Household Finance Corp., 405 U.S. 538, 543-44 n.7, 31 L. Ed. 2d 424, 92 S. Ct. 1113 (1972), to support its thesis that 28 U.S.C. § 1343(3) had its origin in § 3 of the 1866 Act. Lynch, however, provides no support for the majority's argument. The portion of Lynch to which the majority refers, states:\n\nThis Court has traced the origin of § 1983 and its jurisdictional counterpart [i.e., 28 U.S.C. § 1343(3)] to the Civil Rights Act of 1866, 14 Stat. 27. Adickes v. Kress \u0026 Co., 398 U.S. 144, 162-163, 26 L. Ed. 2d 142, 90 S. Ct. 1598 (1970); Monroe v. Pape, 365 U.S. 167, 171, 183-185, 5 L. Ed. 2d 492, 81 S. Ct. 473 (1961).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nWhile the sentence in text appears on first glance to support the majority's position, footnote 7 and the citations to Adickes and Monroe quickly disclose that the Supreme Court has traced 28 U.S.C. § 1343(3) to the 1866 Act in quite a different sense from that which the majority suggests. What the Court obviously meant in Lynch was not that § 3 of the 1866 Act conferred original jurisdiction similar to that created by § 1 of the 1871 Act but that § 2 of the 1866 Act, the criminal provision, was the model for § 1 of the 1871 Act. While the majority quarrels with my assertion that § 2 of the 1866 Act was the model for § 1 of the 1871 Act (Maj. Op. at 1033 \u0026 n.28A), and regards that assertion as incredible, nevertheless that is precisely what the Court said in footnote 7 of Lynch and on the referenced pages in Adickes and Monroe.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Representative Shellabarger first made this observation in introducing the 1871 Act. See n.20 supra.\n\nThe majority also relies upon footnote 10 of Justice Roberts' opinion in Hague v. CIO, 307 U.S. 496, 508 n.10, 59 S. Ct. 954, 83 L. Ed. 1423 (1939). That footnote states that § 24(14) of the Judicial Code of 1911, a predecessor of 28 U.S.C. § 1343(3), derived from § 3 of the 1866 Act. With all due respect, I do not believe that that footnote carries very much weight. It was dicta par excellence in an opinion endorsed by only two Justices. Justice Stone's opinion in the same case indicated that § 24(14) derived instead from § 1 of the 1871 Act. 307 U.S. at 525, 527-31 (Opinion of Stone, J.). No subsequent Supreme Court case has traced 28 U.S.C. § 1343(3) to § 3 of the 1866 Act, while several have traced it to the 1871 Act.\n\nFinally, the majority cites Bodensteiner, Federal Court Jurisdiction of Suits Against \"Non-Persons\" for Deprivation of Constitutional Rights, 8 Valparaiso L. Rev. 215, 229-34 (1974). However, Professor Bodensteiner's argument is based entirely on the excerpts from Lynch and Hague discussed above.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIn sum, therefore, it seems to me that the weight of the evidence is overwhelmingly arrayed against the majority's position.\n\nD.\n\nThe majority's rather astonishing argument that the legislative history of the 1871 Act is no longer relevant because 28 U.S.C. § 1343(3) was enacted into positive law in 1948 (Maj. Op. 1034-35) requires little comment. The majority does not point to any language in the 1948 enactment which suggests that Congress authorized suits to be brought against a municipality for tort damages. Hence, the legislative history of the 1871 Act is, as I have discussed and as other cases have found, highly relevant. The concept that the reenactment or recodification of a statute in substantially identical form makes the legislative history of its predecessors irrelevant is a novel one and understandably not supported by any authority. The notion expressed by the majority that we should look only to the 1948 Act is contrary to virtually every case involving the nineteenth century civil rights acts which the Supreme Court or this Court has decided in recent years. Three examples will suffice. In Aldinger v. Howard, 427 U.S. 1, 17 n.12, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1977), and Lynch v. Household Finance Corp., 405 U.S. 538, 31 L. Ed. 2d 424, 92 S. Ct. 1113 (1972), the Court consulted the legislative history of the 1871 Act in construing 28 U.S.C. § 1343(3), which as the majority observes was enacted in 1948. And in Georgia v. Rachel, 384 U.S. 780, 16 L. Ed. 2d 925, 86 S. Ct. 1783 (1966), the Court consulted the legislative history of the 1866 Act in construing 28 U.S.C. § 1443 (1) and (2) even though the substance of that provision had been enacted into positive law in 1948 and on three other occasions since 1866.\n\nE.\n\nAlthough the Supreme Court has never directly addressed the issue of whether municipalities are subject to suit under 42 U.S.C. § 1981, the Court's opinions in Moor v. County of Alameda, supra, and City of Kenosha v. Bruno, supra, suggest that it would not countenance such suits.\n\nMoor, like the instant case, was a civil rights action against a municipal corporation for allegedly unconstitutional acts by its law enforcement officials. In the Supreme Court, the plaintiffs' principal argument was that 42 U.S.C. § 1988 permitted them to sue the county directly under 42 U.S.C. § 1983. 42 U.S.C. § 1988 provides that when the federal civil rights acts do not \"furnish suitable remedies\" a federal court may apply the law of the state in which it sits \"so far as the same is not inconsistent with the Constitution and laws of the United States.\" The plaintiffs argued that federal law did not \"furnish suitable remedies\" because it did not permit suits against municipal corporations. They therefore contended that the District Court for the Northern District of California should have applied the California law of vicarious liability for municipalities.\n\nThe Supreme Court rejected this theory for two reasons. The Court held, first, that 42 U.S.C. § 1988 did not create an independent cause of action and that therefore that section did not authorize the plaintiffs to sue the county. Second, the Court noted that 42 U.S.C. § 1988 permits federal courts to look to state law only when that law \"is not inconsistent with the Constitution and laws of the United States,\" and it observed:\n\nIf we were to look to California law imposing vicarious liability upon municipalities, as petitioners would have us do, the result would effectively be to subject the County to federal court suit on a federal civil rights claim. Such a result would seem to be less than consistent with this Court's prior holding in Monroe v. Pape, 365 U.S., at 187-191, that Congress did not intend to render municipal corporations liable to federal civil rights claims under § 1983.\n\nId. at 706.\n\nTaken literally, the Court's words seem to dispose of the case at hand. \"To subject the County to federal court suit on a federal civil rights claim,\" the Court wrote, \"would seem to be less than consistent with this Court's prior holding Monroe v. Pape. . . .\" Justice Marshall also observed that:\n\n(Emphasis in original omitted). Id. at 710 n.27. In addition, it should be noted that Justice Marshall must have had the possibility of an action against a municipality under 42 U.S.C. § 1981 in mind when he wrote the Court's opinion in Moor. The plaintiffs' complaint in that case asserted claims under 42 U.S.C. § 1981, but the plaintiffs chose not to press those claims in the Supreme Court.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e 411 U.S. at 696 n.4.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe implication in Moor that suits against municipalities cannot be maintained under 42 U.S.C. § 1981 was echoed in City of Kenosha v. Bruno. Both Justice Rehnquist's opinion for the Court (412 U.S. at 513) and Justice Brennan's dissenting opinion (id. at 516) state that 28 U.S.C. § 1343 cannot provide jurisdiction for an action against a municipality.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Since 28 U.S.C. § 1343(3) was intended \"to establish a right to bring any authorized Civil Rights action in the federal courts,\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e the implication is clear that actions against municipalities under 42 U.S.C. § 1981 are not authorized.\n\nThe majority argues in rejoinder that 28 U.S.C. § 1343(3) can furnish jurisdiction for an action against a municipality provided that the claims asserted are not under 42 U.S.C. § 1983. Maj. Op. 1036. This argument is untenable. In City of Kenosha v. Bruno, supra, the Court, without holding that a cause of action was stated, did hold that 28 U.S.C. § 1331 provides jurisdiction for a Bivens-type Fourteenth Amendment claim against a municipality, but that 28 U.S.C. § 1343 does not. This, of course, refutes the majority's assertion that City of Kenosha v. Bruno, supra, did nothing more than to hold \"that a section 1983 complaint against a municipality does not fall within the scope of section 1343(3) jurisdiction.\" Maj. Op. at 1036.\n\nThe majority attempts to explain the basis for the holding in City of Kenosha v. Bruno, supra, by stating that\n\na fourteenth amendment claim against a municipality is not a \"civil action authorized by law,\" the Supreme Court having expressly declined to hold that such a fourteenth amendment action will lie. See e.g., Ingraham v. Wright, 430 U.S. 651, 97 S. Ct. 1401, 51 L. Ed. 2d 711, 45 U.S.L.W. 4364, 4365 n.3 (1977); Mt. Healthy City School Dist. Bd. of Ed. v. Doyle, 429 U.S. 274, 97 S. Ct. 568, 50 L. Ed. 2d 471, 45 U.S.L.W. 4079, 4080-81 (1977); Aldinger v. Howard, 427 U.S. 1, 4 n.3, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976). An action brought under section 1981, on the other hand, is perforce a \"civil action authorized by law,\" to which the holding in Bruno is completely inapposite.\n\nMaj. Op. at 1036 n.32A. While I do not understand the distinction which the majority seeks to make, it seems to me that the basis for the holding in Bruno is quite clear. 42 U.S.C. § 1983 and 28 U.S.C. § 1343(3) both derive from § 1 of the 1871 Act. Monroe v. Pape, supra, found that Congress intended to exclude municipalities from liability under § 1983. Therefore, the Court has concluded that municipalities were also excluded \"by reference in the grant of jurisdiction under § 1343(3).\" Aldinger v. Howard, 427 U.S. 1, 17, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976).\n\nIn short, although the Supreme Court has not decided the issue posed in this case, it has given every indication that it would not permit an action against a municipality under 42 U.S.C. § 1981.\n\nF.\n\nI realize that it can be argued that the developments which I have summarized above show only that 28 U.S.C. § 1343(3) cannot provide jurisdiction for an action against a municipality under 42 U.S.C. § 1981 but that 28 U.S.C. § 1331 (enacted in 1875) and 28 U.S.C. § 1343(4) (enacted in 1957) can furnish jurisdiction for such suits. To take that position, it seems to me, is to frustrate the intent of Congress.\n\nWhen Congress converted § 1 of the 1866 Act into a provision which furnished a private cause of action cognizable in the federal courts, it made a considered decision to exempt municipalities from such suits. Congress did not reconsider that decision in 1875, when it enacted the predecessor of 28 U.S.C. § 1331, or in 1957, when it enacted 28 U.S.C. § 1343(4).\n\nThe predecessor of 28 U.S.C. § 1331 was enacted in 1875 without any substantive debate. Chadbourn \u0026 Levin, Original Jurisdiction of Federal Questions, 90 U. Pa. L. Rev. 639, 639-45 (1942). There is nothing to suggest that Congress reconsidered the proper scope of the private cause of action furnished by 42 U.S.C. § 1981 at that time.\n\n28 U.S.C. § 1343(4), which was added by the Civil Rights Act of 1957, was not perceived by the Congress which enacted it as a provision of wide-ranging significance. See H.R. Rep. No. 291, 85th Cong., 1st Sess. 11 (1957) [1957] U.S. Code Cong. \u0026 Admin. News 1975-76. In considering that provision, Congress did not reevaluate the proper scope of 42 U.S.C. § 1981.\n\nIn sum, as I see it, Congress considered the question of whether municipalities could be sued under 42 U.S.C. § 1981 for the first and last time in 1871. It decided then that such suits could not be maintained. In the years since 1871, that decision has remained without change and accordingly it still binds us today.\n\nNor do policy considerations dictate otherwise. The same policy considerations ostensibly involved in this case (i.e. no \"deep pocket\" defendant; the difficulty of identifying individual officers; the unwillingness of juries to award damages against individual officers; the immunity of individual officers to the extent applicable; deterrence) were also present when the Supreme Court decided in Monroe v. Pape that no § 1983 action could be maintained against a municipality. Just as these considerations did not govern the decision by the Supreme Court in a § 1983 context, no more should they govern here in an action brought under § 1981.\n\nI would affirm the dismissal of the plaintiffs' claims against the City under 42 U.S.C. § 1981.\n\nII.\n\nClaims Directly Under the Fourteenth Amendment\n\nA.\n\nI agree with the majority that the dismissal of plaintiffs' Fourteenth Amendment claims against the City should be affirmed, but I disagree with the basis upon which the majority has reached that conclusion. I would affirm the dismissal of those claims because I do not believe that damage claims arising directly from the Fourteenth Amendment can ever be asserted against a municipality. The majority, however, has declined to address this issue. It has based its holding instead on the theory that 42 U.S.C. § 1981 furnishes an \"effective and substantial federal statutory remedy\" for all the claims raised by the plaintiffs. Maj. Op. at 1024-25. In my view, the majority's rationale is based upon a misreading of plaintiffs' complaint and of legal precedent, and it creates a real possibility of unjust results on remand.\n\nIn their complaint, the plaintiffs asserted three very different sets of claims against the City. First, the plaintiffs asserted claims under 42 U.S.C. § 1981. In support of these claims, they alleged that City police officers had abused them because of race. The plaintiffs maintained that the City was liable for the actions of the officers under the doctrine of respondeat superior. Second, the plaintiffs asserted claims directly under the Fourteenth Amendment. They alleged that the police officers had denied them the equal protection of the laws and certain rights incorporated into the due process clause, including those guaranteed by the First, Fourth, Sixth, and Eighth Amendments. They maintained that the City was liable for the officers' Fourteenth Amendment violations under respondeat superior. Finally, the plaintiffs asserted pendent state claims against the City. They alleged that the City recklessly and negligently failed to train, supervise, and discipline the defendant officers and that the City recklessly and negligently continued to employ those officers even though it \"knew or . . . should have known that [the officers] . . . posed a great threat and danger to people, and particularly Black people . . . .\" Appendix at 12.\n\nThe facts which the plaintiffs would have to prove to recover on each of these sets of claims are by no means identical. Plaintiffs' § 1981 claims, for example, would require proof that the defendant officers acted with racial animus. McDonald v. Santa Fe Transportation Co., 427 U.S. 273, 285-86, 96 S. Ct. 2574, 49 L. Ed. 2d 493 (1976); Johnson v. Railway Express Agency, Inc., 421 U.S. 454, 459, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975). Plaintiffs' Fourteenth Amendment claims and their pendent state claims would not. Similarly, plaintiffs' pendent state claims would require proof of recklessness or negligence on the part of the City; plaintiffs' other claims would not.\n\nThe district court dismissed all of the plaintiffs' claims. The majority has reversed that portion of the district court's order which dismissed the plaintiffs' § 1981 claims against the City, and it has remanded those claims to the district court for trial. It has also reversed the dismissal of the plaintiffs' pendent state claims, and it has instructed the district court on remand to reconsider its decision to dismiss those claims. In affirming the dismissal of plaintiffs' Fourteenth Amendment claims the majority has found it unnecessary to decide whether the plaintiffs' Fourteenth Amendment claims against a municipality could survive a motion under Fed. R. Civ. Proc. 12(b)(6) if no other claims were asserted. A hypothetical example will illustrate the unjust results which the majority's rationale may well produce on remand.\n\nLet us suppose that the facts which come out at trial in this case prove that the defendant officers searched and arrested the plaintiffs in flagrant violation of Fourth Amendment standards, that they acted in bad faith,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e but that they made no reference whatsoever to the plaintiffs' race and, despite some of the allegations in the plaintiffs' complaint, in fact were not racially motivated. Let us also suppose that the facts disclose that the officers regularly brutalized persons regardless of race. Finally, let us suppose that the facts show that the City was not reckless or negligent in any way. Under these facts, I take it that the plaintiffs could not recover under 42 U.S.C. § 1981, since the officers' conduct would not be due to racial prejudice, a sine qua non for a § 1981 cause of action. Nor could the plaintiffs recover on their pendent state claims, since the City had not been reckless or negligent. I would suppose, however, that the plaintiffs could recover on their Fourteenth Amendment claims - if this Court had not affirmed the dismissal of those claims. Since this Court has affirmed the dismissal of those claims, however, no recovery would be possible. This result would clearly be unwarranted and unfair. The plaintiffs would have proved facts establishing that agents of the City had violated their rights under the Fourteenth Amendment; even though I do not believe that direct Fourteenth Amendment claims can be asserted against a municipality, this Court would not have determined that issue on the merits; nevertheless the plaintiffs would be barred from recovering on their Fourteenth Amendment claims.\n\nNone of the reasons advanced by the majority can even begin to justify a disposition capable of producing such a result. The majority argues, first, that we need not consider the hypothetical example I have posed because the plaintiffs' complaint alleges constitutional violations \"motivated by racial prejudice\" (Maj. Op. at 1024), not \"independent conduct by the defendant not racially animated.\" Id. This argument is at war with the liberal pleading rules established by the Federal Rules of Civil Procedure. An illustrative portion of plaintiffs' complaint is set out in a footnote below.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e I doubt whether any district court judge would rule that these allegations were insufficient to permit the plaintiffs to recover for First or Fourteenth Amendment violations which were not racially motivated. Moreover, at no point in their brief and at no time before this Court did the plaintiffs ever restrict or limit their Fourteenth Amendment argument to constitutional violations which were racially motivated. Since constitutional violations not motivated by racial prejudice are fairly raised by the plaintiffs' pleadings, we must consider those alleged violations in this appeal.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe majority observes next:\n\nIf the plaintiffs prove the racially motivated deprivations of their rights which they allege, section 1981 will afford them the redress in federal court which they seek.\n\nMaj. Op. at 1024. This statement, while true, obviously begs the question. If the plaintiffs prove that they were deprived of their rights but fail to prove that that deprivation was racially motivated, § 1981 will not afford them redress. Their Fourteenth Amendment claim, if sustained by us, would.\n\nThe majority also argues:\n\nOur course also finds support in the established principle that when a claim is asserted on both statutory and constitutional bases, the constitutional question should not be reached if the statutory claim is dispositive. See Ashwander v. TVA, 297 U.S. 288, 347, 80 L. Ed. 688, 56 S. Ct. 466 (1936) (Brandeis, J., concurring) . . . . See also, Hagans v. Lavine, 415 U.S. 528, 543, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974). (Emphasis added.)\n\nMaj. Op. at 1025 n.8.\n\nIt seems clear, however, that the doctrine invoked by the majority is inapplicable in this case. Ashwander and Hagans apply when a plaintiff claims that a single set of facts entitles him to recover on two or more separate legal theories, one of which does not require the resolution of a substantial constitutional question. In this case, each of the three legal theories advanced by the plaintiffs requires proof of a different set of facts. Therefore, none of the three theories is \"dispositive,\" and accordingly Ashwander and Hagans are inapplicable.\n\nMoreover, it is inconsistent to characterize plaintiffs' § 1981 claims as \"statutory\" (and thus nonconstitutional) and at the same time to characterize plaintiffs' Bivens-type claims as \"constitutional.\" The question of whether or not an implied cause of action under the Fourteenth Amendment should be recognized is not, in the first instance, a \"constitutional\" question. As in Bivens, the question is not whether the Constitution requires the federal courts to recognize such a cause of action but whether it is appropriate for them to do so. Bivens v. Six Unknown Federal Narcotics Agents, supra, at 397. It is quite true that plaintiffs' Bivens-type claims cannot be recognized without deciding at least one constitutional question, i.e., whether the power to enforce the Fourteenth Amendment is granted exclusively to Congress by § 5 of that Amendment or whether that power is shared by the courts. But by the same token, plaintiffs' claims under 42 U.S.C. § 1981 cannot be recognized without deciding at least one constitutional question upon which the Supreme Court expressly reserved decision in Monroe and Moor : \"whether Congress has the power to make municipalities liable for acts of its officers that violate the civil rights of individuals.\" 365 U.S. at 191; 411 U.S. at 709.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Because plaintiffs' § 1981 claims and their Bivens-type claims both involve constitutional questions, Hagans does not justify the majority's failure to determine whether a Bivens-type claim can be asserted against a municipality.\n\nThe majority also writes:\n\nAn alternative basis on which we affirm the dismissal by the district court of the fourteenth amendment claim is provided by the presence in this case of pendent state law claims.\n\nMaj. Op. at 1025. The majority argues that, under Hagans v. Lavine, supra, the plaintiffs' \"constitutional\" (i. e. their Bivens-type) claims should be dismissed and that this case should be remanded to the district court for trial on the pendent state claims. In my view, the majority has erroneously applied Hagans. First, Hagans and its progeny hold that under certain circumstances constitutional claims should not be reached. Those cases do not hold that the constitutional claims must be dismissed, nor do they provide any basis for dismissing such claims. Hagans v. Lavine, supra, at 543; Shea v. Vialpando, 416 U.S. 251, 258, 40 L. Ed. 2d 120, 94 S. Ct. 1746 (1974); Wood v. Strickland, 420 U.S. 308, 314, 43 L. Ed. 2d 214, 95 S. Ct. 992 (1975); Massachusetts v. Westcott, 431 U.S. 322, 97 S. Ct. 1755, 52 L. Ed. 2d 349, 45 U.S.L.W. 4503 (1977). Second, as I have already noted, Hagans is inapplicable to this case because plaintiffs' pendent state claims necessitate proof of facts which differ dramatically from those required by their Bivens-type claims. As a result, it is obvious that plaintiffs' pendent state claims are not \"dispositive.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e 415 U.S. at 543. The majority apparently recognizes this, but it observes that \"plaintiffs' counsel in the instant case expressly invited the Court at oral argument to decide the case solely on the basis of the pendent state claims without reaching the fourteenth amendment claims.\" Maj. Op. at 1026. (Emphasis added.) However, plaintiffs' counsel never invited the Court to affirm the dismissal of those claims. Unless the plaintiffs formally withdraw their appeal from the dismissal of their Bivens-type claims, we have no choice but to address that issue. Cf. Jones v. Hildebrant, 432 U.S. 183, 97 S. Ct. 2283, 53 L. Ed. 2d 209, 45 U.S.L.W. 4703, 4706 (1977) (White, J., dissenting).\n\nI will proceed, therefore, to consider the question of whether the district court was correct in dismissing plaintiffs' Bivens-type claims against the City.\n\nB.\n\nIn considering whether a municipality is subject to suit for damages on claims arising directly from the Fourteenth Amendment, it is important to note at the outset that neither the Supreme Court nor this Court has decided that question.\n\nThe Supreme Court has determined that a district court has jurisdiction under 28 U.S.C. § 1331 to entertain Fourteenth Amendment claims against municipalities. City of Kenosha v. Bruno, supra, at 513-14, 516. But that holding means only that claims of that nature are claims \"arising under\" federal law and that they have a modicum of substance. See Hagans v. Lavine, supra, at 536-37. With respect to the real question at issue here - whether the plaintiffs' Fourteenth Amendment damage claims against the City are claims upon which relief can be granted - the Supreme Court has expressly reserved decision on at least four occasions during the past year. Ingraham v. Wright, 430 U.S. 651, 97 S. Ct. 1401, 51 L. Ed. 2d 711, 45 U.S.L.W. 4364, 4365 n.3 (1977); Mt. Healthy City School District Board of Education v. Doyle, 429 U.S. 274, 97 S. Ct. 568, 50 L. Ed. 2d 471, 45 U.S.L.W. 4079, 4080-81 (1977); Aldinger v. Howard, 427 U.S. 1, 4 n.3, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976); City of Charlotte v. Firefighters Local 660, 426 U.S. 283, 284 n.1, 96 S. Ct. 2036, 48 L. Ed. 2d 636 (1976).\n\nIt is true that both the Supreme Court and some lower federal courts have long assumed that equitable relief based directly on the Fourteenth Amendment can be granted against municipalities and other nonpersons. See, e.g., Griffin v. County School Board, 377 U.S. 218, 232-34, 12 L. Ed. 2d 256, 84 S. Ct. 1226 (1964). However, these holdings appear to be of little significance for present purposes. No one questions the ability of federal courts to enforce the Fourteenth Amendment through injunctive relief directed against municipal officials in their official capacity, and the Supreme Court has recently recognized that relief of this type is tantamount to injunctive relief against the municipality itself. City of Charlotte v. Firefighters Local 660, supra, at 284 n.1.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Thus, the award of injunctive relief against a municipality for the purpose of enforcing the Fourteenth Amendment is wholly unremarkable.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThe plaintiffs in this case argued strenuously that this Court has already recognized the validity of damage claims against municipalities based directly upon the Fourteenth Amendment. I believe, however, that this Court has gone no further than the Supreme Court. In Skehan v. Board of Trustees, 501 F.2d 31 (3d Cir. 1974), vacated and remanded on other grounds, 421 U.S. 983, 95 S. Ct. 1986, 44 L. Ed. 2d 474 (1973), on remand, 538 F.2d 53 (3d Cir. 1976), we vacated a judgment which had been entered against individual defendants and the board of trustees of a state college. In remanding the case to the district court, we suggested that the court had jurisdiction to entertain the plaintiffs' claims against the college under 28 U.S.C. § 1331 but not under 28 U.S.C. § 1343(3). 501 F.2d at 44. In other words, we did precisely what the Supreme Court did in City of Kenosha v. Bruno, supra.\n\nIn McCullough v. Redevelopment Authority, 522 F.2d 858 (3d Cir. 1975), the plaintiffs advanced a host of statutory and constitutional claims against numerous individual defendants and several municipal corporations. While it is true that we entertained the plaintiffs' Fourteenth Amendment claims against the municipal corporations, two facts must be noted. First, the plaintiffs sought only declaratory and injunctive relief. Since officials of the municipalities were also named as defendants, it was immaterial whether or not the relief requested was awarded against the municipalities as well. Second, the municipal defendants never argued that the plaintiffs' Fourteenth Amendment claims could not be asserted against them. As the Supreme Court recently noted, \"the question as to whether the [plaintiff] stated a claim for relief [against a nonperson] under § 1331 is not of the jurisdictional sort which the Court raises on its own motion.\" Mt. Healthy City School District Board of Education v. Doyle, supra, at 279. In addition, as this Court has observed, \"Questions 'neither brought to the attention of the court nor ruled upon, are not to be considered as having been so decided as to constitute precedents.'\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nIn Rotolo v. Borough of Charleroi, 532 F.2d 920 (3d Cir. 1976), the district court dismissed a complaint which asserted § 1983 claims against a municipality and several individual defendants. The complaint alleged jurisdiction under 28 U.S.C. § 1343. We vacated and remanded while instructing the district court to permit the plaintiff \"to amend the jurisdictional allegations in those parts of his complaint which refer to the Borough of Charleroi\" to allege jurisdiction under 28 U.S.C. § 1331. 532 F.2d at 922. Again, as in Skehan, we did no more than the Supreme Court did in City of Kenosha v. Bruno.\n\nOther circuits have reached the question of whether damage claims against municipalities can be asserted directly under the Fourteenth Amendment.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Unfortunately, none has devoted very much analysis to this question.\n\nC.\n\nI have concluded that it would be inappropriate for us to recognize claims for damages asserted directly under the Fourteenth Amendment. Although the opinion of the Court in Bivens appears to presume that it is appropriate for federal courts to recognize damage claims asserted directly under provisions of the Constitution guaranteeing individual rights, the Court was careful to note that in that case there were no \"special factors counselling hesitation.\" 403 U.S. at 396. In particular, the Court noted that\n\nwe have here no explicit congressional declaration that persons injured by a federal officer's violation of the Fourth Amendment may not recover money damages from the agents, but must instead be remitted to another remedy, equally effective in the view of Congress.\n\nId. at 397. See also Bivens v. Six Unknown Federal Narcotics Agents, supra, at 398-411 (Harlan, J., concurring).\n\nIn this case there are at least four \"special factors counselling hesitation\" which persuade me that the cause of action asserted by the plaintiffs must be rejected. First, it seems clear that the framers of the Fourteenth Amendment intended to confer upon Congress - not the courts - the primary responsibility for developing appropriate measures to enforce the Amendment. Section five of the Fourteenth Amendment provides that \"Congress shall have power to enforce, by appropriate legislation, the provisions of this article.\" None of the first eight Amendments contains a similar provision. Compare Bivens v. Six Unknown Federal Narcotics Agents, supra, (implied cause of action under Fourth Amendment); Paton v. La Prade, 524 F.2d 862 (3d Cir. 1975) (First Amendment); United States ex rel. Moore v. Koelzer, 457 F.2d 892 (3d Cir. 1972) (Fifth Amendment).\n\nIn Ex parte Virginia, 100 U.S. 339, 345-46, 25 L. Ed. 676 (1880), the Supreme Court said of section 5:\n\nIt is not said the judicial power of the general government shall extend to enforcing the prohibitions and to protecting the rights and immunities guaranteed. It is not said that branch of the government shall be authorized to declare void any action of a State in violation of the prohibitions. It is the power of Congress which has been enlarged. Congress is authorized to enforce the prohibitions by appropriate legislation.\n\n(Emphasis in original.) If nothing else, section 5 counsels strongly against judicial alteration of the scheme of enforcement developed by Congress.\n\nThe second factor \"counselling hesitation\" in this case is the enactment by Congress of a statute which creates a federal cause of action for damages for violations of the Amendment. That statute, of course, is 42 U.S.C. § 1983, and, as the Supreme Court held in Monroe v. Pape, supra, Congress chose to make municipalities exempt from suit under that provision. For the federal courts to create a cause of action directly under the Fourteenth Amendment for the sole purpose of overruling Congress's decision to exempt municipalities from suit is hardly the deference to congressional choice which section 5 of the Fourteenth Amendment demands. I recognize that those who favor a judge-made cause of action under the Fourteenth Amendment argue that Monroe v. Pape erred in concluding that the Congress which enacted the predecessor of 42 U.S.C. § 1983 intended to exempt municipalities. However, as I have noted above, I cannot accept that argument.\n\nThe third factor \"counselling hesitation\" is the failure of Congress to bring municipalities within the scope of 42 U.S.C. § 1983 during the sixteen years since Monroe v. Pape was decided. Although the campaign to end the exclusion of municipalities from the scope of 42 U.S.C. § 1983 has been sustained and vigorous, \"Congress, which could easily change the rule, has not yet seen fit to intervene.\" Canada Packers v. Atchison, Topeka \u0026 Santa Fe Railway Co., 385 U.S. 182, 184, 17 L. Ed. 2d 281, 87 S. Ct. 359 (1966).\n\nAlmost as soon as Monroe v. Pape was decided, Congress was urged to impose § 1983 liability upon municipalities. In its annual report for 1961, the United States Commission on Civil Rights recommended:\n\nThat Congress consider the advisability of amending section 1983 of title 42 of the United States Code to make any county government, city government, or other local governmental entity that employs officers who deprive persons of rights protected by that section, jointly liable with the officers to victims of such officers' misconduct.\n\nU.S. Comm'n on Civil Rights, 1961 Commission Report on Civil Rights - Justice 113 (1961). The Commission reiterated this recommendation in subsequent years. See U.S. Comm'n on Civil Rights, Report for 1963 at 125 (1963); U.S. Comm'n on Civil Rights, Law Enforcement - A Report on Equal Protection in the South 179 (1965).\n\nThe President's Commission on Law Enforcement and Administration of Justice also studied this problem, but it concluded that \"civil litigation is an awkward method of stimulating proper law enforcement policy.\" President's Comm'n on Law Enforcement and Administration of Justice, Task Force Report: The Police 32 (1967).\n\nIn addition to these recommendations, Congress may also have taken notice of the protracted campaign to have Monroe circumvented by the courts\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e and the innumerable legal articles written on this subject.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nBills to overrule Monroe v. Pape were introduced in Congress in 1962. S. 2983, 87th Cong., 2d Sess. (1962); H.R. 10120, 87th Cong. 2d Sess. (1962); H.R. 10951, 87th Cong., 2d Sess. (1962). Similar bills have followed in a steady stream. E.g., S. 1215, 88th Cong., 1st Sess. (1963); H.R. 3932, 88th Cong., 1st Sess. (1963); H.R. 6030, 88th Cong., 1st Sess. (1963); H.R. 6300, 88th Cong., 1st Sess. (1963); H.R. 6334, 88th Cong., 1st Sess. (1963); H.R. 5427, 89th Cong., 1st Sess. (1965); H.R. 10876, 90th Cong., 1st Sess. (1967); H.R. 11827, 93d Cong., 1st Sess. (1973). None of these bills made significant progress. However, while Congress has shown little interest in eliminating the restriction which Monroe v. Pape placed upon the remedies available in § 1983 actions, Congress has responded to other court decisions limiting the remedies which can be awarded in suits under the nineteenth century civil rights statutes. When the Supreme Court determined that attorney's fees could not be awarded in such actions in the absence of a special authorizing statute or proof of bad faith (Alyeska Pipeline Service Co. v. Wilderness Society, 421 U.S. 240, 264, 44 L. Ed. 2d 141, 95 S. Ct. 1612 (1975)), Congress quickly enacted a statute authorizing the award of attorney's fees. Civil Rights Attorney's Fees Awards Act of 1976, P.L. 94-559, § 2 (Oct. 19, 1976). See also S. Rep. No. 94-1011, 94th Cong., 2d Sess. (1976) [1976] U.S. Code Cong. \u0026 Admin. News 5908. Congress has also responded to Bivens by waiving sovereign immunity so that persons deprived of constitutional rights by federal agents can sue the United States. See 28 U.S.C. § 2680(h) (Supp. 1976); S. Rep. No. 93-588, 93d Cong., 2d Sess. (1973) [1974] U.S. Code Cong. \u0026 Admin. News 2790-91.\n\nIn light of these factors, I think it is fair to say that Congress has chosen not to end the exemption which municipalities now enjoy from federal actions claiming damages for Fourteenth Amendment violations. For the federal courts to eliminate that exemption would not be consistent with the spirit of § 5 of the Fourteenth Amendment.\n\nThe final factor \"counselling hesitation\" in this case is that the need for an implied cause of action is far less in this case than it was in Bivens, in Paton v. La Prade, supra, or in United States ex rel. Moore v. Koelzer, supra. In all of those cases, the defendants were federal officers, and it seemed unlikely that the plaintiffs would be able to collect damages from anyone if the implied causes of action which they asserted were not acknowledged. As Justice Brennan recognized in Bivens, the difficulties involved in suing a federal agent in state court were formidable. 403 U.S. at 395. And direct actions against the agents' employer, the United States, were not possible at that time because the United States had not yet waived sovereign immunity for claims of this nature. In this case, the plaintiffs were able to sue the officers in federal court under 42 U.S.C. §§ 1981 and 1983. In addition, they had the option of suing the officers and the City in state court. See Ayala v. Board of Public Education, 453 Pa. 584, 305 A.2d 877 (1973) (abolishing immunity of units of local government).\n\nIn sum, it appears to me that it would be highly inappropriate for the federal courts, as distinct from the legislature, to hold municipalities liable for tort damages on civil rights claims by recognizing an implied cause of action arising directly from the Fourteenth Amendment. While I therefore agree with the majority that the plaintiffs' Fourteenth Amendment claims must be dismissed, I do so, not on the ground which has attracted the majority - i.e., that the plaintiffs' § 1981 claims subsume their Fourteenth Amendment claims -, but rather on the ground that no Fourteenth Amendment cause of action for damages is available against a city.\n\nIII.\n\nPendent State Claims\n\nThe final question posed by this appeal is whether the district court erred in dismissing the plaintiffs' pendent state claims against the City. The district court stated:\n\nPlaintiffs finally request that we exercise pendent jurisdiction over the City with regard to their state claims which are grounded on the tort-related theories of respondeat superior and direct negligence . . . .\n\nIn part because of the broad scope given a district court's discretion in such matters the Third Circuit has indicated that it will approve a lower court's exercise of joining state claims when the circumstances warrant. The Court has its doubts as to whether the City would be liable for punitive damages because of the alleged wrongs perpetrated by its police officers . . . We read plaintiffs' direct claim against the City as one which, sounding in negligence, could not be asserted for punitive damages. Since plaintiffs' counsel conceded at oral argument that compensatory damages are de minimus we are not persuaded that, in the interest of judicial economy, claim expediency and fairness to all parties the City should be retained as a pendent party. In fact (1) confusion of the issues and (2) unsettled questions of state law were the two reasons expressly approved by the Supreme Court as a sound basis for refusing to retain the county as a pendent party in Moor. The City's motion to dismiss shall therefore be granted. (Citations omitted.) (App. at 8-10.)\n\nI am convinced that the district court acted correctly. \"It has consistently been recognized that pendent jurisdiction is a doctrine of discretion, not of plaintiff's right. . . . [and] . . . if the federal claims are dismissed before trial, even though not insubstantial in a jurisdictional sense, the state claims should be dismissed as well.\" United Mine Workers v. Gibbs, 383 U.S. 715, 726, 16 L. Ed. 2d 218, 86 S. Ct. 1130 (1966). See also Broderick v. Associated Hospital Service of Philadelphia, 536 F.2d 1, 8 n.25 (3d Cir. 1976); Kavit v. A. L. Stamm \u0026 Co., 491 F.2d 1176, 1180 (2d Cir. 1974). Since I have concluded that plaintiffs' federal claims against the City were properly dismissed before trial, I believe that the dismissal of the pendent state claims was also called for by Gibbs.\n\nNot only does the district court's determination comport with the discretionary standard of Gibbs, but in light of the foregoing analysis which precludes a Fourteenth Amendment cause of action against the City (see pp. 61-77 supra), pendent jurisdiction over the state law claims would not be available under Aldinger v. Howard, 427 U.S. 1, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976). The rationale of Aldinger, which held that the district court had no jurisdiction to entertain a state law claim pendent to a § 1983 claim against the county (a nonperson) is just as applicable to the situation here, where a state law claim is pendent to a Fourteenth Amendment cause of action against the City. Having determined that no such cause of action against the City is available, the \"joinder of a municipal corporation . . . for purposes of asserting a state-law claim not within federal diversity jurisdiction, is without the statutory jurisdiction of the district court.\" (Footnote omitted). 427 U.S. at 17.\n\nIV.\n\nTo sum up, first: I would affirm the dismissal of plaintiffs' claims against the City under 42 U.S.C. § 1981. I have reached that conclusion because I believe that it was not until the Ku Klux Klan Act was enacted in 1871 that Congress effectively converted § 1 of the 1866 Act - from which 42 U.S.C. § 1981 derives - into a provision which could be enforced by private suit in federal court. At the same time that Congress took that significant step, it decided to limit the scope of its action in one important respect: it determined that municipalities should not be subject to suit in federal court on civil rights claims. Since Congress has never reversed that decision, it still binds us.\n\nSecond, as would the majority, I too would affirm the dismissal of plaintiffs' direct Fourteenth Amendment claims against the City, but for completely different reasons. In my view, the plaintiffs' complaint asserts direct Fourteenth Amendment claims whether or not \"racial motivation\" is implicated. I would dismiss those claims because there are four \"special factors counselling hesitation\" which dictate that result and none which counsel otherwise. First, section five of the Fourteenth Amendment conferred upon Congress, not the courts, the primary responsibility for developing remedies for violations of that amendment. Second, Congress excluded municipalities from liability under 42 U.S.C. § 1983. Third, Congress has failed to show any interest in overruling Monroe v. Pape's interpretation of § 1983 despite a sustained and vigorous campaign to achieve that result. And, fourth, victims of Fourteenth Amendment violations have other civil remedies which may afford them redress.\n\nFinally, I would affirm the dismissal of plaintiffs' pendent state claims because I do not believe that the district court abused its discretion in doing so.\n\nI would therefore affirm in its entirety the order of the district court dismissing all plaintiffs' claims against the City of Pittsburgh.\n\n\u003cspan class=\"fn\"\u003e1. 42 U.S.C. § 1983 (1970) provides: Every person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory, subjects, or causes to be subjected, any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proceeding for redress.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 1981 provides: All persons within the jurisdiction of the United States shall have the same right in every State and Territory to make and enforce contracts, to sue, be parties, give evidence, and to the full and equal benefit of all laws and proceedings for the security of persons and property as is enjoyed by white citizens, and shall be subject to like punishment, pains, penalties, taxes, licenses, and exactions of every kind, and to no other.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 1331(a) provides: (a) The district courts shall have original jurisdiction of all civil actions wherein the matter in controversy exceeds the sum or value of $10,000, exclusive of interest and costs, and arises under the Constitution, laws, or treaties of the United States.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In Bell, plaintiffs alleged that FBI agents had violated their fourth and fifth amendment rights. The district court dismissed for want of federal question jurisdiction under the predecessor to section 1331. The Supreme Court reversed, holding that the district court had jurisdiction under the section but that the plaintiffs' right to recover depended on whether the fourth and fifth amendments would support an affirmative cause of action against federal officers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Insofar as the district court believed the issue to be one of jurisdiction, we disagree. Jurisdiction was not the issue in the district court nor is it an issue on appeal. 5a See Ex Parte Virginia, 100 U.S. 339, 345, 25 L. Ed. 676 (1880).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Section 5 of the fourteenth amendment provides: The Congress shall have power to enforce, by appropriate legislation, the provisions of this article.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See Rotolo v. Borough of Charleroi, 532 F.2d 920 (3d Cir. 1976), (per curiam); McCullough v. Redev. Auth. of Wilkes-Barre, 522 F.2d 858 (3d Cir. 1975); Skehan v. Bloomsburg State College, 501 F.2d 31 (3d Cir. 1974), vacated on other grounds, 421 U.S. 983, 95 S. Ct. 1986, 44 L. Ed. 2d 474 (1975); Amen v. City of Dearborn, 532 F.2d 554 (6th Cir. 1976); Fitzgerald v. Porter Memorial Hosp., 523 F.2d 716 (7th Cir. 1975) (Stevens, J.), cert. denied, 425 U.S. 916, 47 L. Ed. 2d 768, 96 S. Ct. 1518 (1976); Hostrop v. Board of Junior College Dist. No. 515, 523 F.2d 569 (7th Cir. 1975); Calvin v. Conlisk, 520 F.2d 1 (7th Cir. 1975), vacated on other grounds, 424 U.S. 902, 96 S. Ct. 1093, 47 L. Ed. 2d 307 (1976) (allegations similar to those of the instant case); Cox v. Stanton, 529 F.2d 47 (4th Cir. 1975); Hanna v. Drobnick, 514 F.2d 393 (6th Cir. 1975); Singleton v. Vance County Board of Education, 501 F.2d 429, 433 (4th Cir. 1974) (Winter, J., concurring and dissenting); Williams v. Brown, 398 F. Supp. 155 (N.D. Ill. 1975); Maybanks v. Ingraham, 378 F. Supp. 913 (E.D. Pa. 1974); Stephens v. City of Plano, 375 F. Supp. 985 (E.D. Tex. 1974); Grissom v. County of Roanoke ; 348 F. Supp. 321 (W.D. Va. 1972); cf. Dist. of Columbia v. Carter, 409 U.S. 418, 34 L. Ed. 2d 613, 93 S. Ct. 602 (1973). 7A Paragraph IX of Count One of the complaint reads as follows (emphasis supplied): Plaintiffs claim that Defendants, by their actions under color of State law and motivated by racial prejudice as aforesaid, have violated and deprived Plaintiffs of rights, privileges and immunities secured by the Constitution and laws of the United States in the following particulars: A. Defendants stopped, detained, abused, insulted, brutalized, searched, seized, beat, arrested, confined, imprisoned, prosecuted and gave false testimony against Plaintiffs because Plaintiffs are Black and for the purpose of denying and depriving Plaintiffs of equal protection and benefits of the law, equal privileges and immunities under the law and due process of law as secured by the Thirteenth and Fourteenth Amendments to the Constitution of the United States and 42 U.S.C. §§ 1981 and 1983; B. Defendants stopped, detained, searched, seized, arrested, confined and imprisoned Plaintiffs without a warrant and without probable cause in violation of Plaintiffs' rights to be free from unreasonable searches and seizures and to due process of law secured by the Fourth and Fourteenth Amendments to the Constitution of the United States and 42 U.S.C. § 1983. C. Defendants abused, brutalized, beat, searched, seized, arrested, confined and imprisoned Plaintiffs because Plaintiffs exercised their rights to freedom of speech secured by the First and Fourteenth Amendments to the Constitution of the United States and 42 U.S.C. § 1983;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Our course also finds support in the established principle that when a claim is asserted on both statutory and constitutional bases, the constitutional question should not be reached if the statutory claim is dispositive. See Ashwander v. TVA, 297 U.S. 288, 347, 80 L. Ed. 688, 56 S. Ct. 466 (1936) (Brandeis, J., concurring). Although we recognize that § 1981 reaches only racial discrimination whereas the fourteenth amendment applies as well to other discriminatory conduct, the specific fourteenth amendment violations alleged in the instant case are racial in character and, as such, are fully actionable under § 1981. The statutory claim in this case is, therefore, dispositive and Ashwander, supra, counsels against decision of the constitutional claim. See also Hagans v. Lavine, 415 U.S. 528, 543, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974). We are not persuaded by the dissent that our reliance on Ashwander and Hagans is misplaced. In dissenting, Judge Garth contends that even though the fourteenth amendment violations of which plaintiff complains are exclusively racial in character, we must also consider the possibility that the evidence adduced at trial might establish some non-racial fourteenth amendment violation. Judge Garth, in other words, would have us review the district court's dismissal of plaintiffs' complaint not only on those facts which plaintiffs alleged but also on those facts which they did not. A hypothetical case may point up the illogic of this novel proposition. Let us suppose that a plaintiff files a section 1983 complaint alleging that he is a member of the Socialist Workers Party, that state agents broke into his home and illegally seized Socialist literature and documents in violation of the fourth amendment, and that, as a result, he has been deprived of his fourth amendment rights as made applicable against the state through incorporation into the fourteenth amendment. Suppose further that the district court dismisses the complaint on the facts alleged, finding that there was no violation of the fourth amendment. On appeal, what would be the scope of our inquiry? As we understand Judge Garth's theory, we would be required to determine not only whether the district court was correct in its conclusion that there had been no fourth amendment violation but also whether some combination of the facts alleged by the plaintiff might give rise to a claim that plaintiff's first amendment rights had been infringed by the conduct of the state agents, thereby entitling the plaintiff to relief under the fourteenth amendment on a theory which the plaintiff himself had never advanced. We do not believe that it is our responsibility to enlarge a litigant's case beyond the parameters he himself has fixed. The dissent also criticizes our reliance on Ashwander and Hagans for another reason. It asserts without advancing any authority that a policy favoring avoidance of constitutional issues has no application in the present case since the § 1981 claim which we characterize as \"statutory\" is, in reality, \"constitutional.\" Inherent in plaintiffs' § 1981 claim, according to Judge Garth, is the question whether § 1981, as we apply it, is constitutional. Inasmuch as this constitutional \"issue\" was never raised by the parties, Judge Garth must be understood to suggest that every time a court is faced with the construction of a statute, it must also sua sponte both raise and resolve the question whether the particular statute is constitutional as applied. By such reasoning, every statutory question would be transformed into a \"constitutional\" issue and the principle enunciated in Ashwander and Hagans, to name but two of a score of cases, would totally disintegrate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The dissent expresses concern that in affirming the dismissal of the fourteenth amendment claim, we may inadvertently leave the plaintiffs without a remedy if they fail to make out their pendent state law claims of negligence against the City. Judge Garth, however, fails to appreciate the significance of our holding that the section 1981 action may go forward. Even if plaintiffs should be unable to make out their pendent claims, they will still have their section 1981 claim which, as we have already explained, is co-extensive with their fourteenth amendment claim on the facts they have alleged. Thus, in affirming the dismissal of the fourteenth amendment claim, we do not deprive the plaintiffs of any remedy which they do not already enjoy under section 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The mandate of Gagliardi, also provides sufficient answer to Judge Garth's contention that the § 1981 remedy may not be co-extensive with the fourteenth amendment remedy. If Judge Garth were correct - and we do not believe that he is, see note 8, supra - Gagliardi teaches that the Court should then properly turn not to the fourteenth amendment claim but to the pendent state claims. Even if § 1981 were completely inapplicable to this case, as the dissent argues, Gagliardi would still control and would require that the pendent state law claims be decided rather than the fourteenth amendment issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It is possible to read our decision in Valle v. Stengel, 176 F.2d 697 (3d Cir. 1949), as implying that R.S. § 1977 - a predecessor to section 1981 - extends to claims such as the instant one, but alternative interpretations are also possible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Court evidently referred to the reenactment of section 1 of the Civil Rights Act of 1866 in sections 16 and 18 of the Act of May 31, 1870, ch. 114 §§ 16, 18, 16 Stat. 144, codified at 42 U.S.C. §§ 1981, 1982 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. There is an abundance of case law under section 1981 dealing with claims of deprivation of the guaranteed right \"to make and enforce contracts.\" In one such case, the Supreme Court stated that section 1981 \"on its face relates primarily to racial discrimination in the making and enforcing of contracts.\" Johnson v. Railway Express Agency, 421 U.S. 454, 459, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975). The City interprets this casual observation by the Court as a holding that section 1981 can reach no further than the right to contract. We do not believe, however, that the Court intended to read the other clauses of section 1981 out of existence and we do not consider ourselves bound by the Court's dictum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The plaintiffs in the instant case have prayed for compensatory damages and we note in passing that such damages are appropriate in section 1981 cases. \"An individual who establishes a cause of action under section 1981 is entitled to both equitable and legal relief, including compensatory and, under certain circumstances, punitive damages.\" Johnson v. Rwy. Express Agency, 421 U.S. 454, 460, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975). The Supreme Court recently affirmed the awarding of compensatory damages for embarrassment, humiliation, and mental anguish in a section 1981 action. Runyon v. McCrary, 427 U.S. 160, 49 L. Ed. 2d 415, 96 S. Ct. 2586 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See note 24 infra and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See remarks of Sen. Trumbull, the sponsor of the bill which became the Civil Rights Act of 1866, reported in Cong. Globe, 39th Cong., 1st Sess., 474-75 (1866), reprinted in Va. Comm'n on Constitutional Gov't, The Reconstruction Amendments' Debates 121-22 (1967) [hereinafter \"Reconstruction Debates\"].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Remarks of Senator Saulsbury, Cong. Globe, 39th Cong., 1st Sess., 477-78 (1866), reprinted in Reconstruction Debates, supra note 17, at 123.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Veto Message, Cong. Globe, 39th Cong., 1st Sess., 1679-80 (1866), reprinted in Reconstruction Debates, supra note 17, at 194.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See generally J. tenBroek, Equal Under Law 181-91 (rev. ed. 1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Section 1 of the Civil Rights Act is now codified in 42 U.S.C. §§ 1981 and 1982. As section 1982 deals exclusively with the right to own and convey real property, our sole concern is with section 1981 which codifies the remainder of section 1 of the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We might also reason backward from our understanding of the fourteenth amendment. That amendment was apparently enacted with the purpose of giving long term effect to the principles of the 1866 Act and protecting them from the whims of a subsequent Congressional majority. See tenBroek, supra note 20, at 201-37; Gressman, The Unhappy History of Civil Rights Legislation, 50 Mich. L. Rev. 1323 (1952). The fourteenth amendment was intended to embody the principles of the 1866 Act. See tenBroek, supra note 20, at 223-26. Thus, interpretations of the fourteenth amendment might well shed some light on the meaning of the 1866 Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See also Note, Federal Power to Regulate Private Discrimination: The Revival of the Enforcement Clauses of Reconstruction Era Amendments, 74 Colum. L. Rev. 449, 479 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Civil Rights Act of 1866, ch. 31, section I, 14 Stat. 27, reenacted, Civil Rights Act of 1870, ch. 114 §§ 16, 18, 16 Stat. 144, codified at 42 U.S.C. §§ 1981, 1982 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Civil Rights Act of 1871, ch. 22, § I, 17 Stat. 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See tenBroek, supra note 20, at 216.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The debates on section 1983 are collected in Virginia Comm'n on Constitutional Gov't, The Reconstruction Amendments Debates (1967). For additional discussion of the legislative history see City of Kenosha v. Bruno, 412 U.S. 507, 517, 37 L. Ed. 2d 109, 93 S. Ct. 2222 et seq. (1973) (Appendix to dissenting opinion of Douglas, J.); Moor v. County of Alameda, 411 U.S. 693, 708, 36 L. Ed. 2d 596, 93 S. Ct. 1785 (1973); Note, Damage Remedies Against Municipalities for Constitutional Violations, 89 Harv. L. Rev. 922, 929-42 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We note in passing that the City also has no claim to immunity under the eleventh amendment. See Moor v. County of Alameda, 411 U.S. 693, 36 L. Ed. 2d 596, 93 S. Ct. 1785 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The dissent construes the italicized language as creating only a right to remove to federal court actions commenced in state court, not original jurisdiction over actions initiated in federal court itself. Judge Garth's construction, however, does not square with the interpretation of the Supreme Court. See text accompanying note 29A, infra. The remarks made by Senator Trumbull on which the dissent heavily relies speak only to certain questions raised by President Johnson's veto message concerning the scope of the removal provisions, Cong. Globe, 39th Cong., 1st Sess. 1679-80 (1866), not the question whether section 3 provides for original civil jurisdiction. Id. at 1759. 28A We believe that Judge Garth's assertion that the jurisdictional provision codified in section 1343(3) derives from section 2 of the Act of 1866 is not credible. Section 2 deals with criminal sanctions, not with jurisdiction. The quoted language from Adickes v. Kress \u0026 Co., 398 U.S. 144, 162, 26 L. Ed. 2d 142, 90 S. Ct. 1598 (1970), cited by the dissent, Dissenting Opinion at 1048 n.23, quite obviously speaks to the derivation of 42 U.S.C. § 1983 rather than 28 U.S.C. § 1343(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See, e.g., McDonald v. Santa Fe Trail Transp. Co., 427 U.S. 273, 96 S. Ct. 2574, 49 L. Ed. 2d 493 (1976); Runyon v. McCrary, 427 U.S. 160, 49 L. Ed. 2d 415, 96 S. Ct. 2586 (1976); Johnson v. Railway Express Agency, Inc., 421 U.S. 454, 44 L. Ed. 2d 295, 95 S. Ct. 1716 (1975); Tillman v. Wheaton-Haven Recreation Ass'n, Inc., 410 U.S. 431, 35 L. Ed. 2d 403, 93 S. Ct. 1090 (1973); Jones v. Alfred H. Mayer Co., 392 U.S. 409, 20 L. Ed. 2d 1189, 88 S. Ct. 2186 (1968); Meyers v. Pennypack Woods Home Ownership Association, 559 F.2d 894, (3d Cir. 1977); Young v. Int'l Tel. \u0026 Tel. Co., 438 F.2d 757 (3d Cir. 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Even on its own terms, moreover, this aspect of the dissenting opinion disregards the principle which Judge Garth quite correctly invokes elsewhere in his opinion - that jurisdiction and a cause of action are two different things, the existence of one of which neither establishes nor implies the existence of the other. See Dissenting op. at 1056. See also Gagliardi v. Flint, supra, Majority op., 564 F.2d at 115 n.3. The jurisdiction vested by the 1871 Act could not create a cause of action where there had been none before.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The jurisdictional provision of section 1 of the 1871 Act as codified in Revised Statutes § 563(12) and § 629(16) were repealed by section 297 and replaced by section 24(14) of the Act of March 3, 1911, ch. 231, 36 Stat. 1087, 1092, 1168. The provisions of the 1911 Act were themselves repealed by section 39 of the Act of June 25, 1948, ch. 646, 62 Stat. 869, 992, 994. Section 1343(3) was enacted into positive law by the 1948 Act, 62 Stat. 869.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See 1 U.S.C. § 204(a) (1970) which provides: In all courts, tribunals, and public offices of the United States, at home or abroad, of the District of Columbia, and of each State, Territory, or insular possession of the United States - (a) United States Code. - The matter set forth in the edition of the Code of Laws of the United States current at any time shall together with the then current supplement, if any, establish prima facie the laws of the United States, general and permanent in their nature, in force on the day preceding the commencement of the session following the last session the legislation of which is included: Provided, however, That whenever titles of such Code shall have been enacted into positive law the text thereof shall be legal evidence of the laws therein contained, in all the courts of the United States, the several States, and the Territories and insular possessions of the United States. [Emphasis added.] 32a The dissent also attaches significance to the holding in Bruno that section 1343(3) does not provide jurisdiction for a Bivens- type fourteenth amendment claim against a municipality, although section 1331 does. Dissenting opinion at 1051. The basis for this holding, however, is simply that a fourteenth amendment claim against a municipality is not a \"civil action authorized by law,\" the Supreme Court having expressly declined to hold that such a fourteenth amendment action will lie. See Ingraham v. Wright, 430 U.S. 651, 97 S. Ct. 1401, 51 L. Ed. 2d 711 n.3 (1977); Mt. Healthy City School Dist. Bd. of Ed. v. Doyle, 429 U.S. 274, 97 S. Ct. 568, 50 L. Ed. 2d 471, 45 U.S.L.W. 4079, 4089-91 (1977); Aldinger v. Howard, 427 U.S. 1, 4 n.3, 49 L. Ed. 2d 276, 96 S. Ct. 2413 (1976). An action brought under section 1981, on the other hand, is perforce a \"civil action authorized by law\" to which the holding in Bruno is completely inapposite.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Court expressly noted the limited question before it: We decide here only the issue of so-called \"pendent party\" jurisdiction with respect to a claim brought under §§ 1343(3) and 1983. Other statutory grants and other alignments of parties and claims might call for a different result. 427 U.S. at 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. We also note that the Congressional determination to make a section 1343(3) jurisdiction unavailable in actions alleging private discrimination has never prompted the Supreme Court or this court to hold that other jurisdictional bases are foreclosed as well. See, e. g., Sullivan v. Little Hunting Park, 396 U.S. 229, 238, 24 L. Ed. 2d 386, 90 S. Ct. 400 (1969); Jones v. Alfred H. Mayer, 392 U.S. 409, 20 L. Ed. 2d 1189, 88 S. Ct. 2186 (1968); Young v. Int'l Tel. \u0026 Tel. Co., 438 F.2d 757, 760 (3d Cir. 1971). Jurisdiction in these cases was found on 28 U.S.C. § 1343(4). If § 1343(4) jurisdiction is present, it follows that § 1331 jurisdiction must also be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* * * * We are surprised by Judge Garth's expression of doubt that \"any district court judge would rule these allegations were insufficient to permit the plaintiffs to recover for First and Fourteenth Amendment violations which were not racially motivated.\" Dissenting opinion at 1053. The plaintiffs having limited the allegations in their complaint exclusively to racial misconduct, we doubt that any district court judge would permit recovery upon proof of nonracial misconduct. The dissent's assertion that plaintiffs \"never [restricted] or [limited] their Fourteenth Amendment argument to constitutional violations which were racially motivated,\" Dissenting opinion at 1054, may be misleading inasmuch as plaintiffs never discussed the substance of their fourteenth amendment claim at all in this court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The substance of 42 U.S.C. § 1981 was first enacted as § 1 of the Civil Rights Act of 1866. Act April 9, 1866, c. 31, § 1, 14 Stat. 27. Both the Congressional opponents of the 1866 Act and President Andrew Johnson, who vetoed the bill, argued that the Thirteenth Amendment had not given Congress the power to enact such a measure. Therefore, after the Fourteenth Amendment was ratified, Congress reenacted the 1866 Act in 1870 in order to insure that it was supported by both the Thirteenth and Fourteenth Amendments. Section 16 of the Enforcement Act of 1870, Act May 31, 1870, ch. 114, 16 Stat. 140, repeated essentially the same language which had been included in § 1 of the 1866 Act. In addition, § 18 of the 1870 Act stated that the 1866 Act in its entirety was reenacted. When the Revised Statutes of the United States were enacted in 1874, the essence of § 1 of the 1866 Act was placed in R.S. 1977 and 1978. For a more detailed description of this process, see Runyon v. McCrary, 427 U.S. 160, 168-69 n.8, 49 L. Ed. 2d 415, 96 S. Ct. 2586 (1976); Young v. ITT, 438 F.2d 757, 759 (3d Cir. 1971); Note, Racial Discrimination in Employment under the Civil Rights Act of 1866, 36 U. Chi. L. Rev. 615, 619-21 (1969). R.S. 1977 finally entered the United States Code as 42 U.S.C. § 1981. Since reference is made throughout this opinion to the various predecessors of 42 U.S.C. § 1983 and 28 U.S.C. § 1343(3), it may be helpful to summarize their evolution as well. What is now 42 U.S.C. § 1983 originated in § 1 of the Ku Klux Klan Act of 1871, Act April 20, 1871, c. 22, 17 Stat. 13. When the Revised Statutes were enacted in 1874, the substance of this provision was placed in R.S. 1979. R.S. 1979 was designated as 42 U.S.C. § 1983 in the United States Code. What is now 28 U.S.C. § 1343(3) also originated in § 1 of the Ku Klux Klan Act of 1871. In the Revised Statutes, this provision was incorporated into two separate sections. One section, R.S. 563(12), concerned the jurisdiction of the district courts, and the other, R.S. 629(16), concerned the original jurisdiction of the circuit courts. In 1911 Congress enacted a new Judicial Code, Act March 3, 1911, ch. 231, 36 Stat. 1092, which eliminated the original jurisdiction of the circuit courts. Under § 24(14) of that Code, the district courts retained the jurisdiction originally granted to them in the 1871 Act. In the 1940 edition of the United States Code, § 24(14) of the Judicial Code of 1911, became 28 U.S.C. § 41(14). Finally, in 1948, Congress enacted a revised version of Title 28, Act June 25, 1948, c. 646, 62 Stat. 869, in which this provision was rephrased and designated as 28 U.S.C. § 1343(3). The majority claims that these statutes had their origin in § 3 of the Civil Rights Act of 1866. For the reasons discussed in this dissent, I disagree. In tracing the evolution of 42 U.S.C. §§ 1981 and 1983 and 28 U.S.C. § 1343(3), I have not mentioned the numerous changes in phraseology which have occurred. While some may be of significance in other contexts, none seems important here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Civil Rights Act of 1866, Act April 9, 1866, c. 31, 14 Stat. 27, is set out in its entirety in the appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Similarly, in the Civil Rights Cases, 109 U.S. 3, 16, 27 L. Ed. 835, 3 S. Ct. 18 (1883), the Court described § 2 of the 1866 Act as \"really the effective part of the law.\" For interpretations of this section see Screws v. United States, 325 U.S. 91, 89 L. Ed. 1495, 65 S. Ct. 1031 (1945); United States v. Classic, 313 U.S. 299, 85 L. Ed. 1368, 61 S. Ct. 1031 (1941).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 3 of the 1866 Act also contained the forerunner of the present 42 U.S.C. § 1988. For a description of the scope of 42 U.S.C. § 1988, see Moor v. County of Alameda, 411 U.S. 693, 36 L. Ed. 2d 596, 93 S. Ct. 1785 (1973). Removal under § 3 was attempted in a number of cases during the period following the Civil War. See, e. g., Dubuclet v. La., 103 (13 Otto) U.S. 550, 26 L. Ed. 504 (1880) (civil action against black); Va. v. Rives, 100 U.S. 313, 25 L. Ed. 667 (1879) (criminal prosecution of black); Strauder v. W. Va., 100 U.S. 303, 25 L. Ed. 664 (1879) (criminal prosecution of black); Ex parte Wells, 3 Wood. 128, 29 Fed. Cas. 633 (No. 17,386) (C.C.D. La. 1878) (criminal prosecution of blacks and white Southern Republicans); Fowlkes v. Fowlkes, 9 Fed. Cas. 621 (No. 5,005) (C.C.W.D. Va. 1875) (civil action against blacks); Texas v. Gaines, 2 Wood. 342, 23 Fed. Cas. 869 (No. 13,847) (C.C.D. Tex. 1874) (Bradley, J.) (criminal prosecution of black).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. For a contemporary judicial explanation of the scope of the 1866 Act as a whole, see United States v. Rhodes, 1 Abb. 28, 27 Fed. Cas. 785, 787 (No. 16,151) (C.C.D. Ky. 1866) (Swayne, J.). For modern commentary on the scope of the Act, see C. Fairman, History of the Supreme Court of the United States, vol. 6: Reconstruction and Reunion, 1864-88, part one at 1169-72 (1971); Casper, Jones v. Mayer : Clio, Bemused and Confused Muse, 1968 Sup. Ct. Rev. 89, 194; Bickel, The Original Understanding and the Segregation Decision, 69 Harv. L. Rev. 1 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Act April 20, 1871, c. 22, § 1, 17 Stat. 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Act March 3, 1875, c. 137, § 1, 18 Stat. 470.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. First, the right of blacks to invoke the diversity jurisdiction of the federal courts was not made clear until the Fourteenth Amendment was enacted in 1868. In the infamous case of [Dred] Scott v. Sandford, 60 U.S. (19 How.) 393, 15 L. Ed. 691 (1856), Chief Justice Taney held that native-born blacks whose ancestors had entered the country as slaves were not entitled to any of the rights of citizens of the United States, including the right to bring diversity actions in federal court. It was not until § 1 of the Fourteenth Amendment became law in 1868 that this holding was definitively overruled. A. Bickel, The Morality of Consent 41 (1975). See also Slaughter-House Cases, 83 U.S. (16 Wall.) 36, 72-73, 21 L. Ed. 394 (1872) (Miller, J., for the Court); id. at 94-95 (Field, J., dissenting); Ex parte Virginia 100 U.S. (10 Otto) 339, 364-65, 25 L. Ed. 676 (Field, J., dissenting). Even after 1868, the obstacles to a diversity suit by a black deprived of his civil rights would appear to have been formidable. In the vast majority of instances in which there were grounds for filing suit, diversity of citizenship probably did not exist. In addition, the $500 amount in controversy requirement had to be met. Act Sept. 24, 1789, ch. 20, § 11, 1 Stat. 73. Finally, it should be noted that until Cowles v. Mercer County, 74 U.S. (7 Wall.) 118, 19 L. Ed. 86 (1869), was decided it was not clear that the federal courts' diversity jurisdiction reached suits by citizens of one state against municipal corporations created by another state. 8a The jurisdictional discussion that follows constitutes no more than an argument supporting my contention that § 1981 does not give rise to a cause of action against a municipality for tort damages. It does not mean, as the majority opinion states at p. 1030, that I am contending that the district court lacked \"jurisdiction\" to hold the City liable under § 1981. I recognize, as does the majority, the distinction between \"jurisdiction\" and \"claims upon which relief can be granted\" once jurisdiction is found to exist.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Cf. West Chester and Philadelphia RR Co. v. Miles, 55 Pa. Sta. 209, 93 Am. Dec. 744 (1867) (action of trespass initiated by black who was forcibly removed from portion of railroad car reserved for whites).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. For a summary of additional remarks to the same effect see Mitchum v. Foster, supra, at 240-41 \u0026 n.31. See also Cong. Globe, 42d Cong., 1st Sess., app. 79 (Rep. Perry); app. 153 (Rep. Garfield); 476 (Rep. Dawes).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Mitchum v. Foster, supra, at 238.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Monroe held that a cause of action for damages under 42 U.S.C. § 1983 could not be asserted against a municipality. City of Kenosha v. Bruno, supra, held that an action for injunctive relief against a municipality could not be maintained under 42 U.S.C. § 1983 and that 28 U.S.C. § 1343 did not furnish jurisdiction for any suit against a municipality. See p. 59 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. E.g., Comment, Toward State and Municipal Liability in Damages for Denial of Racial Equal Protection, 57 Calif. L. Rev. 1142, 1164-69 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See also Senator Sherman's reaction to the defeat of his proposed amendment: What remedy do you offer the victims and with what punishment do you threaten the guilty? First, the party injured may sue in the courts of the United States for money damages. Whom? Disguised outlaws. (Emphasis added.) Cong. Globe, 42d Cong., 1st Sess. 820 (1871).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Act of May 11, 1866, 14 Stat. 46 (1866).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. On Congress's use of removal jurisdiction to enforce civil rights during the Reconstruction era, see S. Kutler, Judicial Power and Reconstruction Politics 143-160 (1968); Wiecek, The Reconstruction of Federal Judicial Power, 1863-1875, 13 Am. J. Leg. Hist. 333, 338-42 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The very language of \"subsection b\" belies the majority's interpretation. \"Subsection b\" furnishes federal jurisdiction for certain \"causes, civil and criminal.\" (Emphasis added.) This parallel treatment of civil and criminal cases makes perfect sense if \"subsection b\" refers only to cases removed from the state courts, since both civil and criminal cases could be removed. It makes little sense, however, if \"subsection b\" refers to original jurisdiction, because that would suggest that \"subsection b\" conferred original criminal jurisdiction upon the federal courts. We know, however, that \"subsection a\" gave the federal courts original jurisdiction of all criminal prosecutions for violations of the 1866 Act, and it is difficult to see what other type of original criminal jurisdiction could have been granted by \"subsection b.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In addition to Sen. Trumbull's speech, three other events in the legislative history of the 1866 Act militate against the majority's interpretation. First, Senator Willard Saulsbury (Dem. Del.), an intemperate opponent of the 1866 Act, discussed § 3 on January 29, 1866, and gave illustrations of what he considered to be the extreme results which that section would produce. Cong. Globe, 39th Cong., 1st Sess. 479 (1866). All of his examples involved the removal to federal court of criminal or civil proceedings initiated against blacks in state courts, and he concluded by predicting that § 3 would result in the removal from the state courts of all cases in which the defendants were blacks. Id. If it had been understood in the 39th Congress that § 3 conferred a new type of original jurisdiction upon the federal courts, it seems doubtful that that significant step would have escaped comment by Senator Saulsbury. Second, when President Johnson vetoed the 1866 Act, he echoed Saulsbury's prediction that in some states § 3 would result in the removal of all actions in which the defendants were black. Cong. Globe, 39th Cong. 1st Sess., 1680 (1866). President Johnson also failed to suggest that § 3 gave the federal courts a new type of original jurisdiction. Id. Finally, the amendment to the 1866 Act proposed by Representative Bingham would have made little sense if § 3 of the 1866 Act had been a forerunner of 28 U.S.C. § 1343(3). See pp. 38-39 of this dissent supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See p. 39 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. During the debate on the 1871 Act, Senator Frederick Frelinghuysen (Rep. N.J.) stated: There are three classes [of remedies] that might be applied [by the federal government to protect civil rights]: civil remedies, criminal remedies, and public or national relief. As to civil remedies for a violation of these privileges, we know that when the courts of a State violate the provisions of the Constitution or the law of the United States there is now relief afforded by review in the Federal courts [i.e. in the Supreme Court by writ of error or certiorari and in the lower courts by post-trial removal under § 3 of the 1866 Act]. And since the fourteenth amendment forbids any State from making or enforcing any law abridging these privileges and immunities . . ., the injured party should have an original action in our Federal courts, so that by injunction or by the recovery of damages he could have relief against the party who under color of such law is guilty of infringing his rights. As to the civil remedy no one, I think, can object. Senator Frelinghuysen's observation that persons deprived of their civil rights \" should have an original action in our Federal courts\" certainly suggests that he did not believe that they had such an action at that time. The remarks made by Representative Samuel Shellabarger (Rep. Ohio) in introducing § 1 in the House are also revealing. Shellabarger observed: My first inquiry is as to the warrant which we have for enacting such a section as this. The model for it will be found in the second section of the act of April 9, 1866, known as the \"civil rights act.\" That section provides a criminal proceeding in identically the same case as this one provides a civil remedy . . . (Emphasis added.) If section 3 of the 1866 Act were the forerunner of section 1, Shellabarger almost certainly would have mentioned that fact while discussing the relationship of section 1 to the 1866 Act and the \"warrant . . . for enacting such a section.\" Finally, as I have noted, some of the opponents of the 1871 Act claimed during the debates that the type of federal jurisdiction created by § 1 was unprecedented and unconstitutional. See p. 1042 supra. Many of the supporters of the Ku Klux Klan Act had also voted for the 1866 Act. Therefore, if § 3 of the 1866 Act had created a basis of original jurisdiction, it would seem natural for one of them to have responded to the criticism of § 1 of the 1871 Act by pointing out that the jurisdiction created by that provision had precedent in § 3 of the earlier Act. None did.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See, e.g., Lynch v. Household Finance Corp., 405 U.S. 538, 543-44 n.7, 31 L. Ed. 2d 424, 92 S. Ct. 1113 (1972) (traces history of 28 U.S.C. § 1343(3)); Georgia v. Rachel, 384 U.S. 780, 16 L. Ed. 2d 925, 86 S. Ct. 1783 (1966) (traces history of 28 U.S.C. § 1443(1) and (2) to § 3 of 1866 Act).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. C. Fairman, supra note 5, at 1170-71; Casper, supra note 5, at 104; Note, Developments in the Law - Section 1983 and Federalism, 90 Harv. L. Rev. 1133, 1147-49 (1977). 7 Section 2 of the 1866 Act was the model for § 1 of the Civil Rights Act of 1871, 17 Stat. 13. See n.9, infra. Sections 1983 and 1343(3) are direct descendants of § 1 of the Act of 1871. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Adickes stated: What is now 42 U.S.C. § 1983 came into existence as § 1 of the Ku Klux Klan Act of April 20, 1871, 17 Stat. 13. The Chairman of the House Select Committee which drafted this legislation described § 1 as modeled after $+S 2 of the Cifil Rights Act of 1866 - a criminal provision that also contained language that forbade certain acts by any person \"under color of any law, statute, ordinance, regulation, or custom,\" 14 Stat. 27. (footnote omitted) 398 U.S. at 62. The relevant pages in Monroe are also devoted to showing the relationship between § 1 of the 1871 Act and § 2 - not § 3 - of the 1866 Act. 365 U.S. at 183-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The key portion of Bodensteiner's article states: What is now § 1343(3) also has its origin in the 1866 Civil Rights Act. n.106 Section 3 of the 1866 Act gave the district and circuit courts jurisdiction over civil actions brought to enforce the provisions of § 1. Similar language then appeared in § 1 of the Civil Rights Act of 1871. n.106 Lynch v. Household Finance Corp., 405 U.S. 538, 543-44 n.7, 31 L. Ed. 2d 424, 92 S. Ct. 1113 (1972). See also Hague v. Committee for Industrial Organization, 307 U.S. 496, 508 n.10, 59 S. Ct. 954, 83 L. Ed. 1423 (1939). (some footnotes omitted). Bodensteiner, supra, at 232 \u0026 n.106.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. It is interesting to note that the complaint in Monroe v. Pape, supra, also asserted claims against municipalities under 42 U.S.C. § 1981. However, in that case, as in Moor, the plaintiff chose not to press those claims on appeal. 365 U.S. at 170 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Moor militates against the plaintiffs' and the majority's interpretation of 42 U.S.C. § 1981 in an additional way. 42 U.S.C. § 1981, like 42 U.S.C. §§ 1982 and 1983, does not specify the types of relief which a court can award. In Basista v. Weir, 340 F.2d 74, 85-88 (3d Cir. 1965), this Court found it necessary to look to 42 U.S.C. § 1988 in order to determine the types of damages which could be awarded under 42 U.S.C. § 1983. In Sullivan v. Little Hunting Park, 396 U.S. 229, 239-40, 24 L. Ed. 2d 386, 90 S. Ct. 400 (1969), the Supreme Court relied upon 42 U.S.C. § 1988 in concluding that compensatory damages could be awarded under 42 U.S.C. § 1982. Similar reasoning would have to be employed to provide remedies for 42 U.S.C. § 1981. See McCrary v. Runyon, 515 F.2d 1082, 1089 (4th Cir. 1975) (en banc), aff'd, 427 U.S. 160, 49 L. Ed. 2d 415, 96 S. Ct. 2586 (1976); Sethy v. Alameda County Water District, 545 F.2d 1157, 1161 (9th Cir. 1976). However, Moor held that 42 U.S.C. § 1988 cannot supply a damage remedy against a municipal corporation. Thus if 42 U.S.C. § 1981 does provide a cause of action against a municipality, it is a cause of action which is not aided by the statute (42 U.S.C. § 1988) which normally supplies remedies for violations of the nineteenth century civil rights acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Nevertheless, Sethy v. Alameda County Water District, 545 F.2d 1157, 1159 (9th Cir. 1976), the most authoritative precedent for the majority's position, apparently countenanced a § 1981 employment-discharge action against a county \"nonperson\" with jurisdiction based on 28 U.S.C. § 1343. That opinion relied upon Supreme Court employment cases and predicated its holding on a Thirteenth Amendment analysis but with a minimum of discussion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Blue v. Craig, 505 F.2d 830, 835-37 n.11 (4th Cir. 1974) (emphasis added), quoting Cover, Establishing Federal Jurisdiction in Actions Brought to Vindicate Statutory (Federal) Rights When No Violations of Constitutional Rights Are Alleged, Clearinghouse L. Rev., Feb.-March 1969 at 5-6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Compare Scheuer v. Rhodes, 416 U.S. 232, 247-49, 40 L. Ed. 2d 90, 94 S. Ct. 1683 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Count One of plaintiffs' complaint alleges in part: Plaintiffs claim that Defendants, by their actions under color of State law and motivated by racial prejudice as aforesaid, have violated and deprived Plaintiffs of rights, privileges and immunities secured by the Constitution and laws of the United States in the following particulars: B. Defendants stopped, detained, searched, seized, arrested, confined and imprisoned Plaintiffs without a warrant and without probable cause in violation of Plaintiffs' rights to be free from unreasonable searches and seizures and to due process of law secured by the Fourth and Fourteenth Amendments to the Constitution of the United States and 42 U.S.C. § 1983; C. Defendants abused, brutalized, beat, searched, seized, arrested, confined and imprisoned Plaintiffs because Plaintiffs exercised their rights to freedom of speech secured by the First and Fourteenth Amendments to the Constitution of the United States and 42 U.S.C. § 1983 . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The majority claims that I would have the Court \"review the district court's dismissal of plaintiffs' complaint not only on those facts which the plaintiffs alleged but also on those facts which they did not.\" Maj. Op. at 1025 n.8. The majority misstates my position. I do not suggest that we should consider whether the plaintiffs' complaint can be sustained on facts which they did not allege. The hypothetical which I have posed does not contain any facts which the plaintiffs did not allege. Even a cursory reading of the complaint (App. 16-26) reveals the factual allegations which are incorporated in my example (see e.g. n.29 supra). In addition, the hypothetical I have posed - unlike that given by the majority (Maj. Op. at 1025 n.8) - does not raise legal theories which the plaintiffs did not raise themselves. My hypothetical example simply recognizes the possibility that the plaintiffs may be unable to prove every fact which they have indeed asserted. This case is before us on appeal from an order of the district court granting the City's motion to dismiss under Fed. R. Civ. Proc. 12(b)(6). At this stage of the proceedings, we must determine whether any combination of those facts which the plaintiffs have pleaded would entitle them to recover under any of the legal theories which they have raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The majority contends that this argument would transform every issue of statutory construction into a \"constitutional\" question, because the court would be required sua sponte both to raise and to resolve the question of whether the construction of the statute which it has adopted is constitutional. This may prove to be a prophetic and real fear in some cases. However, in the present context where the constitutional question presented is not only the one which contributed to the defeat of the Sherman Amendment (Monroe v. Pape, supra, at 190) but was also expressly reserved by the Supreme Court in Monroe and Moor, I think the majority's argument is flawed and irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. It should also be noted that to date the Supreme Court has carefully limited the holding of Hagans to cases involving pendent federal claims. See Hagans v. Lavine, supra, at 551 (Powell, J., dissenting); Mayor of Philadelphia v. Educational Equality League, 415 U.S. 605, 635, 39 L. Ed. 2d 630, 94 S. Ct. 1323 (1974) (White, J., dissenting) (\"if the pendent claim were a federal statutory one, the constitutional issue should not be reached if the statutory claim was dispositive\") (emphasis added); Shea v. Vialpando, 416 U.S. 251, 258, 40 L. Ed. 2d 120, 94 S. Ct. 1746 (1974) (Powell, J., for the Court) (\"Finding the pendent federal statutory claim dispositive, the District Court properly did not reach the constitutional issue . . . Hagans v. Lavine. . . .\") (emphasis added); Wood v. Strickland, 420 U.S. 308, 314, 43 L. Ed. 2d 214, 95 S. Ct. 992 (1975) (White, J., for the Court) (\". . . the immunity question involves the construction of a federal statute, and our practice is to deal with possibly dispositive statutory issues before reaching questions turning on a construction of the Constitution. Cf. Hagans v. Lavine. . . .\") (emphasis added); Massachusetts v. Westcott, 431 U.S. 322, 97 S. Ct. 1755, 52 L. Ed. 2d 349, 45 U.S.L.W. 4503 (1977). See also White v. Beal, 555 F.2d 1146 (3d Cir. 1977) (involving pendent federal statutory claim). Contra, Frederick L. v. Thomas, 557 F.2d 373 (3d Cir. 1977) at 9 n.33 (dictum). At least some of the reasons why the Supreme Court has thus far refrained from extending Hagans to pendent state claims seem readily apparent. First, if Hagans were fully applicable to pendent state claims, it would frequently come into direct conflict with the admonition in United Mine Workers v. Gibbs, 383 U.S. 715, 726, 16 L. Ed. 2d 218, 86 S. Ct. 1130 (1966), that federal courts should not entertain pendent state claims when the relevant state law is unclear or unsettled. See Moor v. County of Alameda, supra, at 716. Indeed, that conflict may exist in the present case, since Pennsylvania only recently abolished governmental immunity, Ayala v. Bd. of Pub. Educ., 453 Pa. 584, 305 A.2d 877 (1973), and the Pennsylvania law relevant to the plaintiffs' state law claims is hardly wellsettled. It is noteworthy that in Moor, the district court dismissed the plaintiffs' state tort claims against the County because those claims would have required the court \"to resolve difficult questions of California law upon which state court decisions are not legion.\" Rundle v. Madigan, 331 F. Supp. 492, 495 n.5 (N.D. Cal. 1971). The Supreme Court affirmed that decision. 411 U.S. at 715-17. In the present case, the majority has not required the district court to entertain plaintiffs' pendent state claims thus leaving the court free to dismiss those claims under Gibbs. (Maj. Op. at 1026, 1037) In cases such as this, district courts will have a difficult time indeed in reconciling Gibbs and the majority's interpretation of Hagans. The majority's interpretation of Hagans may also produce unfortunate results in another respect. A particular federal claim, such as plaintiffs' Bivens-type claims, may be of questionable validity but not so \"wholly insubstantial,\" Bailey v. Patterson, 369 U.S. 31, 33, 7 L. Ed. 2d 512, 82 S. Ct. 549 (1962), or \"obviously frivolous,\" Hannis Distilling Co. v. Baltimore, 216 U.S. 285, 288, 54 L. Ed. 482, 30 S. Ct. 326 (1910), as to deprive the federal courts of jurisdiction. If such a claim were always joined with a related state law claim - e.g., a state tort claim - the federal claim could be used again and again for the sole purpose of creating otherwise non-existent federal jurisdiction. Under the majority's interpretation of Hagans, the validity of the federal claim itself might never be reached.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See also Firefighters Local 660 v. City of Charlotte, 518 F.2d 83, 85 n.3 (4th Cir. 1975); United Farmworkers Housing Project v. City of Delray Beach, 493 F.2d 799, 802 (5th Cir. 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. It has also been suggested that the Supreme Court has recognized that municipalities are subject to suit on a federal common law cause of action for damages resulting from takings of private property which violate the Fourteenth Amendment. See, e.g., Note, Damage Remedies Against Municipalities for Constitutional Violations, 89 Harv. L. Rev. 922, 950 n.145 (1976). I disagree. The Supreme Court has decided in numerous cases that particular state takings violated the Fourteenth Amendment. See, e.g., Griggs v. Allegheny County, 369 U.S. 84, 7 L. Ed. 2d 585, 82 S. Ct. 531 (1962); Chicago B. \u0026 Q. R.R. v. City of Chicago, 166 U.S. 226, 41 L. Ed. 979, 17 S. Ct. 581 (1897). But those cases reached the Supreme Court by writ of certiorari or error to state courts. Under those circumstances, the Supreme Court had no occasion to consider whether there exists a federal cause of action under the Fourteenth Amendment for damages resulting from unconstitutional takings. Nor can one assume that the Supreme Court would recognize such a federal cause of action simply because the Court has held that various state court decisions incorrectly interpreted the Fourteenth Amendment's guarantee against takings without just compensation. The Supreme Court can review a state court decision by writ of certiorari whenever a \"right . . is . . . claimed under the Constitution . . . of . . . the United States.\" 28 U.S.C. § 1257(3). In other words, every right guaranteed by the Constitution can be enforced by the Supreme Court by writ of certiorari. The federal district courts, on the other hand, cannot redress the deprivation of a constitutional right unless a federal cause of action exists. Unless one assumes that there is a federal cause of action for every constitutional violation, the Supreme Court's holdings in cases reviewed by writ of certiorari provide no guidance with respect to the question at issue in this case. And the Supreme Court has not assumed a one-to-one correlation between constitutional rights and federal causes of action. See Bivens v. Six Unknown Federal Narcotics Agents, supra. It is true that some lower federal courts have permitted plaintiffs who claimed that their property had been unconstitutionally taken by the state to maintain suits in federal court with jurisdiction predicated upon 28 U.S.C. § 1331. See, e.g., Miller v. County of Los Angeles, 341 F.2d 964 (9th Cir. 1965); Foster v. City of Detroit, 405 F.2d 138 (6th Cir. 1968). However, almost none of these cases acknowledged the problems created by the implication of a federal cause of action for damages which could be asserted against a municipality. Judge Renfrew's decision in Dahl v. City of Palo Alto, 372 F. Supp. 647 (N.D. Cal. 1974), is the rare exception, and the facts of that case point up the questionable validity of this entire line of cases. Are the federal courts really open to every case in which a property owner claims that a local zoning ordinance constitutes an unconstitutional taking - even when that property owner bypasses available state administrative and judicial forums?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Soyka v. Alldredge, 481 F.2d 303, 306 (3d Cir. 1973), quoting Webster v. Fall, 266 U.S. 507, 511, 69 L. Ed. 411, 45 S. Ct. 148 (1925).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The Fifth Circuit, sitting en banc, has refused to recognize such claims. Ingraham v. Wright, 525 F.2d 909, 912 (5th Cir. 1975) (en banc), aff'd, 430 U.S. 651, 97 S. Ct. 1401, 51 L. Ed. 2d 711, 45 U.S.L.W. 4361 (1977) (Supreme Court did not reach question). The Sixth and Seventh Circuits have permitted such claims, but they appear to have proceeded upon the erroneous assumption that the question is purely one of jurisdiction. See, e.g., Amen v. City of Dearborn, 532 F.2d 554, 559 (6th Cir. 1976); Hostrop v. Board of Junior College Dist. No. 515, 523 F.2d 569, 577 (7th Cir. 1975); Calvin v. Conlisk, 520 F.2d 1, 8 (7th Cir. 1975); Bosely v. City of Euclid, 496 F.2d 193, 195 (6th Cir. 1974). The Second, Ninth, and District of Columbia Circuits have reserved decision on this question. See, e.g., Fine v. City of New York, 529 F.2d 70, 76 n.13 (2d Cir. 1975); Brault v. Town of Milton, 527 F.2d 730, 738 (2d Cir. 1975) (en banc); Aldinger v. Howard, 513 F.2d 1257, 1257 n.1 (9th Cir. 1975); Apton v. Wilson, 165 U.S. App. D.C. 22, 506 F.2d 83, 96 (1974). The Fourth Circuit, like this Circuit, has apparently decided only that § 1331 jurisdiction exists. Cox v. Stanton, 529 F.2d 47, 50-51 (4th Cir. 1975). The district court opinions on this question are far too numerous to list here. Compilations of those cases are included in the articles listed below. Among the very recent cases not listed in those articles are: Crosley v. Davis, 426 F. Supp. 389 (E.D. Pa. 1977); Raffety v. Prince George's County, 423 F. Supp. 1045 (D. Md. 1976); Livingood v. Townsend, 422 F. Supp. 24 (D. Minn. 1976); Pitrone v. Mercadante, 420 F. Supp. 1384 (E.D. Pa. 1976). The commentary on this question is extensive. See, e.g., Comment, Implying a Damage Remedy Against Municipalities Directly Under the Fourteenth Amendment: Congressional Action as an Obstacle to Extension of the Bivens Doctrine, 36 Md. L. Rev. 123 (1976); Note, Remedies for Constitutional Torts: \"Special Factors Counselling Hesitation,\" 9 Ind. L. Rev. 441 (1976); Note, Damage Remedies Against Municipalities for Constitutional Violations, 89 Harv. L. Rev. 922 (1976); Hundt, Suing Municipalities Directly Under the Fourteenth Amendment, 70 Nw. U.L. Rev. 770 (1975); Note, Municipal Liability in Damages for Violations of Constitutional Rights - Fashioning a Cause of Action Directly from the Constitution - Brault v. Town of Milton, 7 Conn. L. Rev. 552 (1975). See also Monaghan, The Supreme Court, 1974 Term - Forward: Constitutional Common Law, 89 Harv. L. Rev. 1 (1975); Dellinger, Of Rights and Remedies: The Constitution As a Sword, 85 Harv. L. Rev. 1532 (1972); Hill, Constitutional Remedies, 69 Col. L. Rev. 1110 (1969); Katz, The Jurisprudence of Remedies: Constitutional Legality and the Law of Torts in Bell v. Hood, 117 U. Pa. L. Rev. 1 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. For an account of the various skirmishes in this campaign, see Hundt, supra note 20, at 778-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See note 20 supra.\u003c/span\u003e\n\n",
    "body_length": 197912,
    "citedas": [
      "564 F.2d 1018"
    ],
    "attorneys": "Wendell G. Freeland, Esquire, Freeland \u0026 Kronz, Pittsburgh, Pennsylvania. Gilbert J. Helwig, Esquire, Reed, Smith, Shaw \u0026 McClay, Pittsburgh, Pennsylvania. Garland H. McAdoo, Jr., Esquire, Tucker, Arensberg \u0026 Ferguson, Pittsburgh, Pennsylvania, for Appellants. Daniel M. Curtin, First Assistant City Solicitor, Mead J. Mulvihill, Jr., City Solicitor, Law Department, City of Pittsburgh, Pittsburgh, Pennsylvania, for Appellee.",
    "category": [
      "75"
    ],
    "judges": "Rosenn, Kalodner, and Garth, Circuit Judges. Gibbons, Rosenn, and Garth, Circuit Judges. Garth, Circuit Judge, dissenting in part and concurring in part.",
    "citation_count": 172
  }
}
