{
  "id": "LJRYQ2YBTlTomsSBmz_H",
  "document": {
    "title": "MARGARET S. v. TREEN",
    "full_title": "MARGARET S., and Linda S., on their own behalf and on behalf of all others similarly situated, Dr. Roy Wood, Dr. Calvin Jackson, and Dr. Duncan McKellar, on their own behalf and on behalf of all others similarly situated, and Clinical Leasing Services, Inc. d/b/a Delta Women's Clinic, Orleans Women's Clinic, Causeway Medical Suite, Bossier City Medical Suite, and Metairie Women's Medical Center v. David C. TREEN, Governor of the State of Louisiana, William J. Guste, Jr., Attorney General of the State of Louisiana, George A. Fischer, Secretary of the State of Louisiana Health and Human Resources Administration, all of the above in their individual and official capacities",
    "jurisdiction": "E.D. Louisiana.",
    "date": "1984-06-29T00:00:00.000Z",
    "docket": "78-2765",
    "body": "ROBERT F. COLLINS, District Judge.\n\nThis is an individual and class action brought by two representatives of the class of pregnant women desiring abortions, three physicians who perform abortions, and five clinics offering facilities for the performance of abortions. The action seeks declaratory and permanent injunctive relief against the operation of La.Rev.Stat.Ann. §§ 40:1299.35.2(B); 1299.35.3; 1299.35.5; 1299.35.6(B)(3), (4), (5) and (7); 1299.35.10(A)(18); 1299.35.12; 1299.35.13 and 1299.35.14 (West Supp.1981) (hereinafter referred to as \"the challenged sections\"), and against state officials who will be required to execute and enforce the statute challenged herein.\n\nLa.Rev.Stat.Ann. § 40:1299.35.12 was enacted September 11, 1980 and was not repealed by subsequent legislative action. La.Rev.Stat.Ann. §§ 40:1299.35.2(B); 1299.35.3; 1299.35.5; 1299.35.6(B)(3), (4), (5) and (7); 1299.35.10(A)(18); 1299.35.13 and 1299.35.14 were amended and reenacted by the 1981 session of the Louisiana legislature and became law on July 23, 1981.\n\nThe plaintiffs contend that the challenged sections are intended to and will have the effect of deterring women from exercising the fundamental right to abortion which was recognized by the Supreme Court in Roe v. Wade, 410 U.S. 113, 93 S. Ct. 705, 35 L. Ed. 2d 147 (1973). The plaintiffs also contend that the challenged sections subject physicians who perform abortions and facilities which provide abortion services to regulation and criminal prosecution if they fail to comply with the provisions. The plaintiffs challenge these sections on various grounds, contending that they are violative of the due process and equal protection clauses of the Fourteenth Amendment; that they are unconstitutionally vague; and that they violate the free exercise clause of the First Amendment.\n\nPlaintiff Margaret S. is a citizen of the United States residing in New Orleans, Louisiana. At the time of filing of the original complaint, Margaret S. was eight weeks pregnant and desired an abortion. Margaret S. was certified by this Court as a class representative for the class described in paragraph 16 of the original complaint and paragraph 19 of this second amended and supplemental complaint. She brings this action on behalf of herself and all others similarly situated.\n\nPlaintiff Linda S. is a citizen of the United States residing in Louisiana. At the time of the filing of this complaint, Linda S. was ten weeks pregnant and desired that an abortion be performed in Louisiana. Linda S. is 17 years old, unmarried and unemancipated. She claims that both of her parents are vehemently opposed to abortion, and she would be afraid to ask their consent. She has no knowledge of how she could obtain a court order for an abortion. She contends that she is a mature minor, and it would not be in her best interests for her parents to know of her decision to get an abortion. She wishes to sue under a pseudonym to protect her privacy rights. She seeks to represent herself and all other minors similarly situated.\n\nPlaintiff Dr. Roy C. Wood is a citizen of the United States residing in Baton Rouge, and is a physician licensed to practice medicine in the State of Louisiana. Dr. Wood is actively engaged in the practice of medicine, including the performance of abortions, in Baton Rouge. Dr. Wood brings this action on his own behalf and on behalf of those similarly situated, and his pregnant women patients who desire abortions, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Calvin Jackson is a citizen of the United States residing in New Orleans and is a physician licensed to practice medicine in the State of Louisiana. Dr. Jackson is actively engaged in the practice of gynecology, including the performance of abortions, in New Orleans. Dr. Jackson brings this action on his own behalf and on behalf of all those similarly situated, and on behalf of his pregnant women patients who desire abortions, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Dr. Duncan McKellar is a citizen of the United States residing in New Orleans, Louisiana, and Dallas, Texas, and is a physician licensed to practice medicine in the States of Louisiana and Texas. Dr. McKellar is actively engaged in the practice of medicine, including abortions, in New Orleans. Dr. McKellar brings this action on his own behalf and on behalf of all those similarly situated, and on behalf of his pregnant women patients who desire abortions, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Clinical Leasing Services, Inc. is a Delaware corporation doing business in Louisiana as Delta Women's Clinic (hereinafter Delta Women's Clinic). Plaintiff Delta Women's Clinic provides facilities and support staff for the performance of services to women in the area of family planning, counseling, pregnancy tests, abortions, sterilizations, birth control, and other gynecological services. Plaintiff Delta Women's Clinic raises its own claims and the claims of its women patients, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Orleans Women's Clinic is a corporation doing business in New Orleans, Louisiana. Orleans Women's Clinic offers facilities and support staff for the performance of services to women in the area of family planning, pregnancy tests, abortions, sterilizations, birth control, and other gynecological services. Plaintiff Orleans Women's Clinic raises its own claims and the claims of its women patients, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Causeway Medical Suite is a corporation doing business in New Orleans, Louisiana. Causeway Medical Suite offers facilities and support staff for the performance of services to women in the area of family planning, pregnancy tests, first trimester abortions, birth control, and related gynecological services. Plaintiff Causeway Medical Suite raises its own claims and the claims of its women patients, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Metairie Women's Medical Center is a corporation doing business in Metairie, Louisiana. Metairie Women's Medical Center offers facilities and support staff for the performance of services to women in the area of family planning, pregnancy tests, abortions, sterilization, birth control and gynecological services. Plaintiff Metairie Women's Medical Clinic raises its own claims and the claims of its women patients, among whom are minors who are not emancipated judicially or by marriage.\n\nPlaintiff Bossier City Medical Suite is a corporation doing business in Bossier City, Louisiana. Bossier City Medical Suite offers facilities and support staff for the performance of services to women in the area of family planning, pregnancy tests, abortions, birth control and other gynecological services. Plaintiff Bossier City Medical Suite raises its own claims and the claims of its women patients, among whom are minors who are not emancipated judicially or by marriage.\n\nDefendant David C. Treen, a resident of Louisiana and citizen of the United States, is Governor of the State of Louisiana. He is the successor in office to Edwin W. Edwards, named as defendant in the original complaint. As Governor he is responsible for the execution of the laws of the State including the challenged sections.\n\nDefendant William J. Guste, Jr., a resident of Louisiana and citizen of the United States, is Attorney General of the State of Louisiana. As such, he is responsible for the enforcement of laws of the State, including the challenged sections.\n\nDefendant George A. Fischer, a resident of Louisiana and citizen of the United States, is Secretary of Louisiana's Health and Human Resources Administration (hereinafter HHRA) and successor in office to William A. Cherry, M.D., who was named as defendant in the original complaint. As Secretary of HHRA, he is responsible for the administration, control, and operations of the functions, programs, and affairs of HHRA and the policies with respect hereto, including the challenged sections.\n\nMargaret S. and Linda S. bring this action pursuant to Fed.R.Civ.P. 23 on behalf of all women similarly situated. Dr. Roy Wood, Dr. Calvin Jackson and Dr. Duncan McKellar also bring this action pursuant to Rule 23, on behalf of all physicians similarly situated. Margaret S. and Linda S. bring this action on behalf of all women and minors who are now or may become pregnant and who desire or may desire an abortion to be performed in Louisiana by the physician of their choice. Dr. Roy Wood, Dr. Calvin Jackson, and Dr. Duncan McKellar bring this action on behalf of all present and future physicians who desire to give full, safe, and adequate medical advice and treatment to their patients, including the performance of abortions, but who have been or will be restricted in their medical practice by operation of the challenged sections and by defendants' actions thereunder, and who are threatened with criminal prosecution if they perform an abortion in violation of any of the terms of the statute challenged herein.\n\nIn approaching this inquiry into the constitutionality of the Louisiana abortion statute, the Court is of the opinion that it is appropriate to preface its discussion of the challenged sections with a statement of the legislative intent motivating the enactment of the provisions regulating abortion:\n\nit is the intention of the Legislature of the State of Louisiana to regulate abortion to the extent permitted by the decisions of the United States Supreme Court. The Legislature does solemnly declare and find in reaffirmation of the longstanding policy of this State, that the unborn child is a human being from the time of conception and is, therefore, a legal person for purposes of the unborn child's right to life and is entitled to the right to life from conception under the laws and Constitution of this State. Further, the Legislature finds and declares that the longstanding policy of this State is to protect the right to life of the unborn child from conception by prohibiting abortion impermissible only because of the decisions of the United States Supreme Court and that, therefore, if those decisions of the United States Supreme Court are ever reversed or modified or the United States Constitution is amended to allow protection of the unborn then the former policy of this State to prohibit abortions shall be enforced.\n\nLa.Rev.Stat.Ann. § 40:1299.35.0 (West Supp.1981). The Court finds this expression of legislative intent particularly significant in view of the Supreme Court's specific holding in Roe v. Wade, 410 U.S. 113, 158 93 S. Ct. 705, 729, 35 L. Ed. 2d 147 (1973), that \"the word 'person, ' as used in the Fourteenth Amendment, does not include the unborn,\" and the Court's refusal to decide \"the difficult question of when life begins.\" 410 U.S., at 159, 93 S. Ct., at 730. The Court stated \"when those trained in the respective disciplines of medicine, philosophy, and theology are unable to arrive at any consensus, the judiciary, at this point in the development of man's knowledge, is not in a position to speculate as to the answer. Id.1\n\nFinally, before embarking upon this journey into the constitutionality of the challenged sections of the Louisiana abortion law, the Court notes that this is not the first time it has been faced with the formidable task of deciding the constitutionality of Louisiana laws regulating abortion. In Margaret S. v. Edwards, 488 F. Supp. 181 (E.D.La.1980), (hereinafter referred to as \" Margaret S (I) \"), this Court declared certain sections of the Louisiana abortion statute unconstitutional. La.Rev.Stat.Ann. §§ 40:1299.35.1 et seq. (West Supp.1979). The challenged sections in this matter raise issues identical as well as similar to those decided in Margaret S (I). In addition, the present Louisiana abortion statute imposes additional restrictions on the fundamental right to obtain an abortion.\n\nThe Ultra-Sound Testing Requirement\n\nLa.Rev.Stat.Ann. § 40:1299.35.2(B) (West Supp.1981) requires the attending physician in an abortion procedure to perform an ultra-sound test upon the pregnant woman before carrying out the abortion procedure. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" The ultra-sound procedure, which involves the use of sound waves to produce fetal pictures, enables the physician to estimate fetal age. The constitutionality of this section is an issue of first impression since it is the first law of this nature to be enacted by a state legislature.\n\nThe plaintiffs contend that the ultra-sound requirement violates the due process and equal protection clauses of the Fourteenth Amendment in that it impedes women's access to abortions. Specifically, the plaintiffs charge that the ultra-sound requirement directly interferes with the abortion right because it increases the cost of abortions and lessens the availability of the procedure in Louisiana. The plaintiffs also contend that this provision creates an illegal classification by imposing the ultra-sound testing requirement only upon pregnant women seeking abortions, while it is not required in comparable medical procedures.\n\nIn analyzing the plaintiffs, claim that the ultra-sound testing requirement is repugnant to the due process clause of the Fourteenth Amendment, it is necessary to set forth the applicable standard of review. In the seminal case involving the constitutionality of legislation concerning abortion, Roe v. Wade, 410 U.S. 113, 153, 93 S. Ct. 705, 727, 35 L. Ed. 2d 147, the Supreme Court held that the right of privacy encompasses a woman's decision whether to terminate her pregnancy. The Court stated that \"Where certain 'fundamental rights' are involved . . . regulation limiting these rights may be justified only by a 'compelling state interest, ' (citations omitted) and that legislative enactments must be narrowly drawn to express only the legitimate state interests at stake.\" Roe, 410 U.S., at 155, 93 S. Ct., at 728.\n\nApplying this standard, the plaintiffs must initially demonstrate \"that the state regulation in question interferes directly with a woman's abortion decision.\" Scheinberg v. Smith, 659 F.2d 476, 482 (5th Cir.1981), reh. den. 667 F.2d 93 (5th Cir.1981), on remand 550 F. Supp. 1112 (S.D.Fla.1982). If the plaintiffs sustain this burden of proof, then the onus shifts to the State to show \" 'the compelling basis for the law, that is, that the burden [imposed on the abortion decision] is not \"undue\" or unjustifiable. '\" Id. (quoting Charles v. Carey, 627 F.2d 772, 777 (7th Cir.1980)).\n\nThe task before the Court, then, is to determine whether the plaintiffs have demonstrated that the ultra-sound testing requirement interferes directly with a woman's fundamental right to obtain an abortion. The plaintiffs contend that this requirement interferes directly with the abortion right since it would raise the cost of abortions by imposing an unnecessary test. The plaintiffs further maintain that the ultra-sound testing requirement would lessen the availability of abortion services in Louisiana because physicians would be able to perform fewer abortions if the test were required.\n\nThe Court finds credible evidence in the record to support the plaintiffs' claim that the ultra-sound testing requirement would impose additional costs on women seeking abortions in Louisiana. The evidence reveals that the ultra-sound testing requirement would increase the cost of each abortion in Louisiana by at least $100.00, given current rates. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" This significant increase in the cost of an abortion would be likely to occur for several reasons. First, the current cost of an ultra-sound test administered on an outpatient basis in Louisiana ranges from $60.00 to $195.00. Additionally, the testimony adduced at trial indicates that relatively few obstetricians and gynecologists in private practice own ultra-sound machines. If required to perform an ultra-sound test on each abortion patient, these physicians would incur substantial costs in purchasing and maintaining such machines, and in hiring, and training technicians to assist with the administration of the test. Further, since the ultra-sound test is a relatively new technique which most physicians are not familiar with, they would be required to secure additional training in order to properly administer the test and interpret the results.\n\nThe requirement that the attending physician in the abortion procedure also administer the ultra-sound test is an additional factor which would raise the cost of abortion. Currently, a first trimester abortion can be performed in approximately five minutes, and a second trimester procedure in approximately ten minutes. The performance of an ultra-sound test requires approximately twenty minutes. Thus, the statutorily imposed requirement that the attending physician perform the ultra-sound test would require the physician to spend an additional twenty minutes with each patient. Two physicians, as well as the administrator of an abortion clinic in Louisiana, stated at trial that this additional expenditure of time occasioned by the ultra-sound testing requirement would result in higher costs for abortion services. The State contends that this testimony was speculative, especially since there was no testimony by cost accountants establishing such an increase. It is the opinion of the Court, however, that the plaintiffs' failure to prove the precise amount of such an increase does not refute their claim that the ultra-sound testing requirement would result in higher prices for abortion services, especially in view of the testimony to this effect given by physicians who perform abortions on a regular basis. With respect to their individual practices, these physicians are in the best position to know whether such a testing requirement would affect prices for abortion services. This is true, even if they are not capable at this time to state with specificity the amount of such an increase. Moreover, in an era of rising medical costs, and a trend toward passing these expenses on to consumers, it does not strain the imagination to conclude that at least some of the additional costs imposed by the ultra-sound testing requirement will be borne by the consumers of abortion services.\n\nThe State argues that even if the ultra-sound testing requirement would increase the cost of abortions in Louisiana, this result has no constitutional significance under the established jurisprudence. In support of its stance on this issue, Louisiana cites Harris v. McRae, 448 U.S. 297, 100 S. Ct. 2671, 65 L. Ed. 2d 784 (1980) and Maher v. Roe, 432 U.S. 464, 97 S. Ct. 2376, 53 L. Ed. 2d 484 (1977), which dealt with refusals by states or the federal government to make funds available for abortions. In these cases, the Court held that such refusals did not constitute a direct interference with the abortion right. In Harris, the Court stated:\n\nit simply does not follow that a woman's freedom of choice carries with it a constitutional entitlement to the financial resources to avail herself of the full range of protected choices. The reason why was explained in Maher : although government may not place obstacles in the path of a woman's exercise of her freedom of choice, it need not remove those not of its own creation. Indigency falls in the latter category. The financial constraints that restrict an indigent woman's ability to enjoy the full range of constitutionally protected freedom of choice are the product not of governmental restrictions on access to abortions, but rather of her indigency.\n\n448 U.S., at 316, 100 S. Ct., at 2688.\n\nThe State argues that in light of the Maher and Harris holdings, the additional costs imposed upon the abortion procedure by the ultra-sound testing requirement do not constitute a direct burden on the abortion right. The Court does not agree, however, that these cases support the defendants' argument, since Maher and Harris focus on the \"basic difference between direct state interference with a protected activity and state encouragement of an alternative activity consonant with legislative policy.\" Maher v. Roe, 432 U.S., at 475, 97 S. Ct., at 2383. In contrast, the Court is confronted here with \"a government-imposed regulation that adds to the cost of abortion,\" and as such, it \"is a government-created obstacle and is subject to strict scrutiny.\" Planned Parenthood Association of Kansas City, Missouri v. Ashcroft, 655 F.2d 848, 864 (8th Cir.1981), op. supp. 664 F.2d 687 (8th Cir.1981), cert. granted 456 U.S. 988, 102 S. Ct. 2267, 76 L. Ed. 2d 733 (1982). In Ashcroft, the Court held that a Missouri law which raised the cost of abortion by requiring the presence of a second physician during the abortion of a \"viable unborn child\" constituted a direct burden to the abortion right and was therefore subject to strict scrutiny. Mo.Rev.Stat. § 188.030.3. The Court's sentiments there are appropriate here, for if the rule were as the State claims, \"the state would be free to add on any costly requirements under the guise of regulation, and would not be required to justify these requirements by a compelling state interest.\" Id.\n\nThe plaintiffs also demonstrated at trial that because of the increased amount of time the ultra-sound testing provision would require of physicians performing abortions, the law would decrease the availability of abortion services in Louisiana. Testimony revealed that currently, in a typical Louisiana abortion clinic, approximately 24 abortions can be performed in four hours. If the ultra-sound testing requirement were operative, only eight abortions could be performed in a comparable period of time. This is particularly significant in a state that is already under-served in terms of the availability of abortion services. See Plaintiffs' Exhibits #4A-G. Approximately 17,680 abortions were performed in Louisiana in 1980. The projected number of abortions which would have been performed in 1978 had there been good availability is 48,680. Thus, only 35.4 percent of the need for abortion services in Louisiana was met. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Further, in 1978, 64 percent of the women in Louisiana lived in a parish which had no abortion provider; whereas, the comparable nationwide figures for counties was 27 percent.\n\nThe Court has concluded that Louisiana's ultra-sound testing requirement constitutes a direct burden on the abortion right. Accordingly, the State must demonstrate a compelling state interest which justifies this requirement. Roe, 410 U.S., at 155, 93 S. Ct., at 728; Scheinberg, 659 F.2d at 482. Louisiana offers in support of the requirement that such testing is necessary in order to accurately determine gestational age and the correct method of abortion, and to determine life-threatening conditions such as atopic pregnancies. The Court will analyze each of these contentions.\n\nAs to the first claim, that ultra-sound testing is necessary in order to accurately determine gestational age, the state has failed to demonstrate that such testing is medically necessary. Louisiana does not argue that the most common method of determining gestational age, a pelvic examination coupled with the patient's menstrual history, is inaccurate or otherwise unreliable. The range of error in estimating gestational age by this method is approximately plus or minus one week during the first trimester, and plus or minus 10 days to two weeks during the second trimester. By contrast, ultra-sound testing does not measure gestational age with any reliability until the eighth week of pregnancy. By the eighth week of pregnancy, approximately 60 percent of all abortions in Louisiana have already been performed. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" Ultra-sound testing achieves its greatest accuracy in approximately the twelfth week of pregnancy, when it is possible to determine gestational age to within plus or minus three to four days, that is, assuming skilled personnel and high quality equipment. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" Starting with the eighteenth week of pregnancy, however, the accuracy of ultra-sound testing declines to plus or minus one week by the 20th week of pregnancy, and, by the 24th week, to plus or minus 10 days.\n\nThe testimony of several physicians indicated that overall, that is, throughout the course of a pregnancy, the clinical examination method and ultra-sound testing are comparable in their levels of accuracy and reliability as to gestational age. The overwhelming weight of the evidence further indicates that ultra-sound testing is not medically indicated for all pre-abortion cases; rather, the evidence indicated that ultra-sound testing is medically indicated in a selected number of cases where a discrepancy exists between a patient's menstrual history and the size of her uterus, where an unidentified mass is present, or where the patient has other abnormalities which impede the accuracy of clinical examination. In such cases, ultra-sound testing can increase the accuracy and confidence level of the treating physician. In the vast majority of cases, however, ultra-sound testing is not necessary in order to enable the physician to exercise his or her best medical judgment. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nIt is apparent then, that ultra-sound testing is medically indicated or helpful in only a selected number of cases in determining gestational age. Thus, the State has failed to demonstrate, by advancing this rationale for the ultra-sound testing requirement, a compelling basis for the requirement. The Court remains unconvinced by the additional reasons offered in support of the requirement. While the State argues that the ultra-sound testing would enable a physician to determine the correct method of abortion for each patient, expert testimony established that the use of ultra-sound testing prior to the abortion procedure would not affect the treating physician's decision as to the proper method of abortion. Louisiana also argues that ultra-sound testing is necessary in order to determine life-threatening conditions such as atopic pregnancies. However, there was no suggestion at trial that this condition occurs with such frequency so as to justify the imposition of such a sweeping requirement. It is significant to note too, that because the ultra-sound test is a relatively new device, the long-term biological and genetic effects of sonography are unknown at this time. This factor also militates against the imposition of so sweeping a requirement in the absence of a clear and pressing need.\n\nIn reaching the conclusion that the State of Louisiana has not demonstrated a compelling basis for the ultra-sound testing requirement, the Court deems it appropriate to reiterate the \"important and legitimate\" state interests identified in Roe. 410 U.S., at 163, 93 S. Ct., at 731. There it was stated:\n\nThe State does have an important and legitimate interest in preserving and protecting the health of the pregnant woman, . . . and treatment . . . it has still another important and legitimate interest in protecting the potentiality of human life. These interests are separate and distinct. Each grows in substantiality as the woman approaches term and, at a point during pregnancy, each becomes \"compelling.\"\n\nWith respect to the State's important and legitimate interest in the health of the mother, the \"compelling\" point, in the light of present medical knowledge, is at approximately the end of the first trimester. This is so because of the now-established medical fact . . . that until the end of the first trimester mortality in abortion may be less than mortality in normal childbirth. It follows that, from and after this point, a State may regulate the abortion procedure to the extent that the regulation reasonably relates to the preservation and protection of maternal health. Examples of permissible state regulation in this area are requirements as to the qualifications of the person who is to perform the abortion; as to the licensure of that person; as to the facility in which the procedure is to be performed, that is, whether it must be a hospital or may be a clinic or some other place of less-than-hospital status; as to the licensing of the facility; and the like.\n\nThis means, on the other hand, that, for the period of pregnancy prior to this \"compelling\" point, the attending physician, in consultation with his patient, is free to determine, without regulation by the State, that, in his medical judgment, the patient's pregnancy should be terminated. If that decision is reached, the judgment may be effectuated by an abortion free of interference by the State (emphasis added).\n\nWith respect to the State's important and legitimate interest in potential life, the \"compelling\" point is at viability. This is so because the fetus then presumably has the capability of meaningful life outside the mother's womb. State regulation protective of fetal life after viability thus has both logical and biological justifications. If the State is interested in protecting fetal life after viability, it may go so far as to proscribe abortion during that period, except when it is necessary to preserve the life or health of the mother.\n\nId., at 410 U.S. 163-64, 93 S. Ct. 731-32.\n\nThe Supreme Court emphasized in Roe that the State's interest in maternal health is not \"compelling\" until the end of the first trimester. In Margaret S (I), 488 F. Supp. at 195, this Court observed that \"since the Roe decision, major advances have occurred in medical knowledge,\" and that the post-first trimester abortion technique employed by nearly all physicians who perform abortions in Louisiana, dilation and evacuation, is safer than childbirth until the eighteenth week of pregnancy. Reasoning from the Supreme Court's holding in Roe that the State's compelling interest in maternal health does not commence until abortion threatens maternal health in the same degree as does childbirth, this Court held that the State may not regulate abortion until the eighteenth week of pregnancy. Margaret S (I), supra, at 195-196. The Court has observed that approximately 93.3 percent of all abortions performed in Louisiana have been performed by the end of the first trimester of pregnancy. The Court emphasizes again, as the Supreme Court stated in Roe, before this compelling point is reached, a physician may, in consultation with his patient, decide to terminate her pregnancy, and if this determination is reached, the abortion may be effectuated without interference by the State according to the physician's medical judgment. Id. It is significant to note that in enumerating examples of permissible regulations which reasonably relate to the preservation and protection of maternal health subsequent to the point where the State's interest becomes compelling, the Supreme Court failed to specify diagnostic procedures which a physician must employ in the abortion procedure. Indeed, the Court recognized that its decision vindicated \"the right of a physician to administer medical treatment according to his professional judgment up to the points where important state interests provide compelling justifications for intervention.\" Roe, 410 U.S. at 166-67, 93 S. Ct. at 733.\n\nThis Court is of the opinion that La.Rev.Stat.Ann. § 40:1299.35.2(B) (West 1981), which requires the attending physician to perform an ultra-sound examination on abortion patients, must fall. This result is dictated by the jurisprudence since the statute commands a physician to perform a specific diagnostic procedure which imposes significant costs upon the exercise of a woman's constitutionally protected right to obtain an abortion, and it is apparent that there is no legitimate, compelling state interest justifying the requirement of such a test. Indeed the evidence indicates that this test would be useless in the vast majority of abortions performed in Louisiana. Accordingly, this section of the statute cannot survive the constitutional attack launched by the plaintiffs in this matter. In view of the Court's deposition of this issue, it is unnecessary to consider the plaintiffs' challenge to this section on equal protection grounds.\n\nParental Consent for Minors\n\nLa.Rev.Stat.Ann. § 40:1299.35.5 (West Supp.1981) prohibits a physician from performing an abortion on an unemancipated pregnant woman under eighteen years of age without parental consent or a court order. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" Before trial, the State, contending that this provision was clearly constitutional, presented this issue to the Court in a Motion for Summary Judgment. After a careful consideration of the arguments of counsel, the submitted memoranda, and the applicable law, the Court granted the Motion for Summary Judgment and stated that it would issue reasons for its ruling in a final opinion on the merits. See Minute Entry, Collins, J., November 18, 1981. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nIn opposing the motion for summary judgment, the plaintiffs contended that the issue of the constitutionality of the minor consent provisions was not ripe for summary judgment because of the presence of disputed issues of material fact. Fed.R.Civ.P. 56. The plaintiffs stated their intention to demonstrate, inter alia, at the trial of this matter that the requirement of parental consent in every instance of a minor seeking an abortion often does not promote maternal health or further the goal of protecting minors; that the statute is facially defective in that the Court procedures provide insufficient guidance to judges who must determine whether a pregnant minor is competent to make a decision concerning abortion, or whether an abortion is in her best interests; and that, as a practical matter, the Court procedure is unworkable and unduly burdensome on minors seeking abortions.\n\nAfter a careful consideration of each of these contentions, the Court concluded and remains of the opinion that, assuming the truth of these allegations, they are nevertheless insufficient to defeat the State's Motion for Summary Judgment on the issue of the constitutionality of the minor consent provisions. In Bellotti v. Baird, 443 U.S. 622, 643, 99 S. Ct. 3035, 3048, 61 L. Ed. 2d 797 (1979) (hereinafter Bellotti II), the Supreme Court held that where a state \"decides to require a pregnant minor to obtain one or both parents' consent to an abortion, it also must provide an alternative procedure (footnote omitted) whereby authorization for the abortion can be obtained.\" The Court elaborated on the substantive and procedural aspects of such proceedings:\n\nA pregnant minor is entitled in such a proceeding to show either: (1) that she is mature enough and well enough informed to make her abortion decision; in consultation with her physician, independently of her parents' wishes; or (2) that even if she is not able to make this decision independently, the desired abortion would be in her best interests. The proceeding in which this showing is made must assure that a resolution of the issue, and any appeals that may follow, will be completed with anonymity and sufficient expedition to provide an effective opportunity for an abortion to be obtained.\"\n\nBellotti II, 443 U.S. at 643, 644, 99 S. Ct. at 3048.\n\nThe Court finds that Louisiana's minor consent provisions, La.Rev.Stat.Ann. § 40:1299.35.5, fulfill the requirements governing abortions for unemancipated minors set forth in Bellotti II. This statute does not permit an absolute parental veto, a fatal constitutional defect which led to the downfall of other state statutes. See, e.g., H. L. v. Matheson, 450 U.S. 398, 101 S. Ct. 1164, 67 L. Ed. 2d 388 (1981); Bellotti v. Baird, 428 U.S. 132, 96 S. Ct. 2857, 49 L. Ed. 2d 844 (1976) (Bellotti I); Planned Parenthood of Central Missouri v. Danforth, 428 U.S. 52, 96 S. Ct. 2831, 49 L. Ed. 2d 788 (1976). Rather, the statute provides for parental consent and, alternatively, a judicial procedure wherein the pregnant minor can demonstrate that she is sufficiently mature to make the decision that an abortion is in her best interests. In addition to requiring a confidential and expeditious hearing of the matter, the statute provides safeguards to ensure that the minor is able to exercise her constitutional right to an abortion, including dual jurisdiction. This enables the minor to obtain a Court order in an area in which she resides or in another area if she fears that her presence in court will alert the public that she is seeking an abortion. She may also obtain a trial de novo in the event that she appeals a decision denying her an abortion. This allows her a second opportunity to convince an independent decision maker that she is sufficiently mature to make the abortion decision. The statute also permits a minor who cannot afford court costs to proceed in forma pauperis. Most importantly, this statute establishes a standardize procedure for pregnant minors seeking judicial approval for abortions. In this regard, the parental consent statute does not suffer from the infirmities which rendered its predecessors unconstitutional in Margaret S (I), 488 F.Supp. at 203. La.Rev.Stat.Ann. § 40:1299.35.5 (West Supp.1979).\n\nWhile it is true that the statute does not establish criteria by which a judge must determine whether a minor may obtain an abortion, the failure to establish such criteria is not sufficient to defeat the statute. The establishment of such criteria may unnecessarily restrict a decision maker in his deliberations, particularly where each case will undoubtedly involve the consideration of many different factors and circumstances pertaining only to the individual seeking an abortion. Moreover, the statute provides that \"jurisdiction to hear [such] applications shall be in the court having juvenile jurisdiction in the parish where the abortion is to be performed or the parish in which the minor is domiciled.\" La.Rev.Stat.Ann. § 40:1299.35.5(B)(2) (West Supp.1981). Juvenile courts decide difficult issues involving the health, welfare and best interests of minors on a regular basis. Thus, they are particularly well suited to decide abortion-related issues as they can bring to bear a wealth of experience on each case.\n\nThe Court disagrees with the contention that the statute is unworkable as a practical matter or is unduly burdensome on minors seeking abortions. The statute outlines a precise procedure that is to be carried out expeditiously and with a minimum of inconvenience to the minor. While a minor who must endure this process may experience some mental or emotional discomfort, the statute nevertheless provides an appropriate resolution of the conflicting rights involved, that is, the right of a minor to secure an abortion and the right of the state to further \"'a constitutionally permissible end by encouraging an unmarried pregnant minor to seek the help and advice of her parents in making a very important decision whether or not to bear a child. '\" Bellotti II, supra, 443 U.S., at 640-41, 99 S. Ct., at 3047 (quoting Planned Parenthood of Central Missouri v. Danforth, supra, 428 U.S. at 91, 96 S. Ct. at 2851 (concurring opinion). \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" Further, the court procedure established by the statute gives a minor a workable alternative to parental consent and complies with the requirements set forth in Bellotti II, supra. Accordingly, the Court has concluded that La.Rev.Stat.Ann. § 40:1299.35.5 (West Supp.1981) is constitutional.\n\nPost-First Trimester Hospitalization Requirement\n\nLa.Rev.Stat.Ann. § 40:1299.35.3 (West Supp.1981) requires an abortion performed subsequent to the first trimester of pregnancy to be performed in a hospital. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" In Margaret S. v. Edwards, 488 F. Supp. 181, 191-96, this Court declared unconstitutional the predecessor to this statute. La.Rev.Stat.Ann. § 40:1299.35.3 (West Supp. 1979). Reaching this conclusion after an extensive analysis of the statutory provision, the applicable jurisprudence, and the practical impact that the post-first trimester hospitalization requirement would have on women in Louisiana seeking abortions, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" the Court determined that the requirement limited access to abortion while it had no rational relationship to the preservation of maternal health, and that it regulated abortions prior to the time when the State's interest becomes compelling. Margaret S (I), supra, at 196.\n\nSubsequent to this Court's decision in Margaret S (I), supra, in Gary-Northwest Indiana Women's Services, Inc. v. Bowen, 496 F. Supp. 894 (N.D.Ind.1980), aff'd sub nom. Gary-Northwest Indiana Women's Services, Inc. v. Orr, 451 U.S. 934, 101 S. Ct. 2012, 68 L. Ed. 2d 321 (1981), a three-judge panel considered the constitutionality of an Indiana law requiring second trimester abortions to be performed in hospitals and concluded that the statute was constitutional. The Supreme Court summarily affirmed.\n\nIn light of the Supreme Court's summary affirmance of Gary-Northwest, supra, the Louisiana legislature re-enacted a mandatory post-first trimester hospitalization requirement. La.Rev.Stat.Ann. 40:1299.35.3 (West Supp.1981). On November 18, 1981, the plaintiffs brought on for hearing a motion for summary judgment on the issue of the constitutionality of this provision. The plaintiffs contended that the Supreme Court's summary affirmance of Gary-Northwest, supra, was not binding on this Court since the constitutionality of a post-first trimester hospitalization requirement was not an issue on appeal in that case. After a careful consideration of the arguments of counsel, the submitted memoranda, and the applicable law, the Court agreed with the plaintiffs and granted their motion for summary judgment. At that time, the Court indicated that it would issue reasons for this decision in its final opinion on the merits. See Minute Entry, Collins, J., November 18, 1981.\n\nThe issue confronting the Court concerns the significance of the Supreme Court's summary affirmance of Gary-Northwest Indiana Women's Services, Inc. v. Bowen, 496 F. Supp. 894 (N.D.Ind.1980), and the weight that decision should be accorded. The plaintiffs argue that the Supreme Court's Gary-Northwest, supra, decision is not binding on this Court since the issues presented on appeal in that matter did not include the constitutionality of the post-first trimester hospitalization requirement. To the contrary, the State argued that the Gary-Northwest, supra, decision was indeed binding on the Court since a \"'summary disposition of an appeal . . . is a disposition on the merits. '\" Hicks v. Miranda, 422 U.S. 332, 344, 95 S. Ct. 2281, 2289, 45 L. Ed. 2d 223 (1975) (quoting C. Wright, Law of Federal Courts 495 (2d Ed. 1970)).\n\nWhile the jurisprudence is replete with authority to the effect that a summary affirmance is a decision on the merits, it is also true that \"summary affirmances have considerably less precedential value than an opinion on the merits. \" Illinois State Board of Elections v. Socialist Workers Party, 440 U.S. 173, 180-181, 99 S. Ct. 983, 988, 59 L. Ed. 2d 230 (1979). Moreover, it is also settled doctrine that \"the precedential effect of a summary affirmance can extend no further than \"the precise issues presented and necessarily decided by those actions. \" Id. 99 S. Ct. at 989 (quoting Fusari v. Steinberg, 419 U.S. 379, 391-392, 95 S. Ct. 533, 540-541, 42 L. Ed. 2d 521 (1975). \"Questions which 'merely lurk in the record, ' (citations omitted) are not resolved, and no resolution of them may be inferred.\" Illinois State Board of Elections, 440 U.S. at 183, 99 S. Ct. at 989 (quoting Webster v. Fall, 266 U.S. 507, 511, 45 S. Ct. 148, 149, 69 L. Ed. 411 (1925). Further, \"summary actions . . . should not be understood as breaking new ground but as applying principles established by prior decisions to the particular facts involved.\" Mandel v. Bradley, 432 U.S. 173, 176, 97 S. Ct. 2238, 2240-2241, 53 L. Ed. 2d 199 (1977).\n\nWhile lower courts are bound by summary actions on the merits by the Supreme Court, Hicks v. Miranda, 422 U.S. 332, 343-345, 95 S. Ct. 2281, 2289, 45 L. Ed. 2d 223, the Court has noted that \"ascertaining the reach and content of summary actions may itself present issues of real substance.\" Id. at 422 U.S. 345 n. 14, 95 S. Ct. at 2290 n. 14. Accord, Mandel v. Bradley, supra, 432 U.S. at 176, 97 S. Ct. at 2240. Further, \"because a summary affirmance is an affirmance of the judgment only, the rationale of the affirmance may not be gleaned solely from the opinion below.\" Id.\n\nThe Court may examine the jurisdictional statement to determine what issues were necessarily decided on appeal to the Supreme Court. Illinois State Board of Elections v. Socialist Workers, 440 U.S. at 182, 99 S. Ct. at 989; Mandel v. Braldey, 432 U.S. at 176, 97 S. Ct. at 2240; Gibson v. Berryhill, 411 U.S. 564, 576, 93 S. Ct. 1689, 1697, 36 L. Ed. 2d 488 (1973). The jurisdictional statement in Gary-Northwest indicates that three questions were presented to the Supreme Court:\n\nI. Whether the Three-Judge District Court Erroneously Treated the Supplemental Petition for Injunctive Relief as a Rule 60 Motion for Relief from Judgment, When It had Never Entered a Final Judgment On the Merits of the Second Trimester Hospital Restriction in any Previous Proceeding?\n\nII. Whether this Court Should Vacate the Judgment Below and Remand for a Full Hearing before the Entire Three-Judge Court on the Merits of the Second Trimester Hospital Restriction?\n\nIII. Whether the District Court Abused Its Discretion in Preliminarily Upholding the Second Trimester Hospital Restriction, When the Overwhelming Majority of Indiana Hospitals Ban all Abortion Services, and there is no Compelling Health Reason for Mandatory Hospitalization?\n\nJurisdictional Statement in Gary-Northwest Indiana Women's Services, Inc. v. Bowen, No. 80-1275, p. i; Exhibit A, Memorandum of Law in Support of Plaintiffs' Motion for Summary Judgment.\n\nIt is apparent from the jurisdictional statement in Gary-Northwest that the Supreme Court was not confronted with the precise issue presented here, that is, whether a mandatory hospitalization requirement for post-first trimester abortions is constitutional. The issues on appeal in Gary-Northwest are properly characterized as procedural. The first issue concerned the characterization of a motion as a 60(b) motion. The second contended that a full hearing on the merits was mandated. The third issue considered whether the district court abused its discretion in refusing to issue a preliminary injunction. This Court is of the opinion that the Supreme Court's summary affirmance signified the Court's satisfaction that these questions were adequately resolved by the lower court. However, none of the issues on appeal in Gary-Northwest addresses the full merits of the constitutionality of a mandatory post-first trimester hospitalization requirement.\n\nOnly the third question presented to the Supreme Court in Gary-Northwest could possibly be characterized as substantive, rather than procedural. Yet, even assuming this to be so, it does not mean that the Supreme Court considered the factual issues raised in the same context as this Court faced them in Margaret S (I). The third issue raised in Gary-Northwest concerned the applicable standard in granting motions for preliminary injunctive relief. The district court denied plaintiff's request for relief against Indiana's second trimester hospitalization requirement after concluding that the plaintiffs had failed to demonstrate a likelihood of success on the merits. The plaintiffs appealed the district court's ruling on this issue. The Supreme Court's summary affirmance indicates, as is apparent from the jurisdictional statement in Gary-Northwest, that the Court was of the opinion that the district court did not abuse its discretion in refusing to grant preliminary injunctive relief. This summary affirmance, however, was not tantamount to a decision on the merits on the constitutionality of a post-first trimester hospitalization requirement since it is clear that different standards apply in the granting of preliminary and permanent injunctions. University of Texas v. Camenisch, 451 U.S. 390, 101 S. Ct. 1830, 68 L. Ed. 2d 175 (1981). In Camenisch, supra, the Court rejected the suggestion that a determination of the likelihood of success on the merits constitutes a decision on the merits. The Court stated that \"This reasoning fails, however, because it improperly equates 'likelihood of success' with 'success', and what is more important, because it ignores the significant procedural differences between preliminary and permanent injunctions.\" Id. 101 S. Ct. at 1833. The Court remanded Univ. of Texas v. Camenisch, 451 U.S. 390, 394, 101 S. Ct. 1830, 68 L. Ed. 2d 175 (1981), for a full hearing on the merits after emphasizing the settled rule of law concerning preliminary injunctions: \"A party thus is not required to prove his case in full at a preliminary injunction hearing, . . . and the findings of fact and conclusions of law made by a court granting a preliminary injunction are not binding at trial on the merits.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" Id. (citations omitted). The Court further stated that it is \"generally inappropriate for a federal court at the preliminary injunction stage to give a final judgment on the merits\". Id. The Court refused to speculate on the merits of the challenge until the completion of the trial on the matter.\n\nThe procedural framework of Gary-Northwest Indiana Women's Services, Inc. v. Bowen, 496 F. Supp. 894 (N.D.Ind.1980), is similar to that in Camenish, supra, in that both courts decided motions for preliminary injunctive relief. In neither case were full hearings on the merits held before Supreme Court review. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" In contrast, this Court granted permanent injunctive relief against Louisiana's post-first trimester hospitalization requirement after a full trial on the merits where evidence establishing the burdensomeness of this requirement, without regard to the preservation of maternal health, led the Court to declare it unconstitutional.\n\nThe Court's conclusion on this issue is further buttressed by the presence of an important factual distinction between Gary-Northwest, supra, and this matter. Incorporated into the Indiana statute was a statutory definition of hospitals that included ambulatory out-patient surgical centers. Ind.Code Ann. § 35-1-58.5-1(C)(2). By contrast, the Louisiana statute does not define the term \"hospital\" to include outpatient facilities. See La.Rev.Stat.Ann. §§ 2100 et seq. This definitional distinction means, of course, that the Indiana statute permits post-first trimester abortions to be performed in a wider variety of institutions. It would also mean that post-first trimester abortions are more readily accessible in Indiana. The Court has noted, in Margaret S (I), supra, at 488 F. Supp. 192, and in this matter, supra, n. 12, \"that severe limitations . . . [exist] on the availability of post-first trimester abortions in Louisiana.\" Since the \"precedential significance of . . . [a] summary action . . . is to be assessed in the light of all the facts in that case,\" Mandel v. Bradley, supra, 432 U.S. at 177, 97 S. Ct. at 2241, this important factual difference between the statute in Gary-Northwest, supra, and the Louisiana statute under consideration here also lessens the precedential value of Gary-Northwest Indiana Women's Services, Inc. v. Bowen, 496 F. Supp. 894 (N.D.Ind.1980).\n\nIn Margaret S (I), supra, this Court considered in great detail the issue of the constitutionality of Louisiana's mandatory hospitalization requirement for post-first trimester abortions. After carefully considering all the evidence adduced at trial, including a considerable amount of expert testimony and many documents and other exhibits in the voluminous record amassed in Margaret S (I), as well as an extended analysis of the pertinent jurisprudence, the Court concluded that the statute was unconstitutional because it limited \"access to abortion without regard to preservation of maternal health, and because it . . . attempted to regulate abortions prior to the time when the State's interest in maternal health becomes compelling.\" Margaret S (I), supra, 488 F. Supp. at 196. No evidence has been offered to the Court in this matter to suggest that this conclusion should be altered.\n\nOther courts, when faced with ample evidence of the burdensomeness of second trimester hospitalization requirements, have also declared them unconstitutional. See, e.g., Wolfe v. Stumbo, 519 F. Supp. 22 (W.D.Ky.1980); Planned Parenthood Association of Kansas City, Missouri v. Ashcroft, 483 F. Supp. 679, 686-687 (W.D.Mo.1980), aff'd in part, rev'd in part, 655 F.2d 848 (8th Cir.1981), opinion after remand, 664 F.2d 687 (8th Cir.1981) cert. granted, 456 U.S. 988, 102 S. Ct. 2267, 73 L. Ed. 2d 733 (1982). The Court finds the reasoning in Ashcroft, supra, particularly instructive. On appeal, the Eighth Circuit remanded the second trimester hospitalization requirement to the district court for further findings of fact. This occurred after the Supreme Court's summary affirmance of Gary-Northwest, supra, and suggests that the Court concluded that the summary affirmance was not dispositive of the issue of the constitutionality of Missouri's second trimester hospitalization requirement. On remand, the district court again declared the requirement unconstitutional after hearing additional evidence on the availability and safety of second trimester abortions in Missouri.\n\nThis Court notes that the Supreme Court has recently determined that a second trimester hospitalization requirement is unconstitutional. See, e.g., City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983). In light of the Supreme Court's decision in Akron, supra, the Court is of the opinion that its previous ruling in this matter should not be disturbed despite the Supreme Court's summary affirmance of Gary-Northwest, supra. The jurisprudence establishes that summary affirmances are dispositive of issues that are necessarily decided. Thus, such affirmances must be carefully scrutinized in order to determine the precise reach of the decision. The jurisdictional statement in Gary-Northwest, supra, indicates that the only issue on appeal which concerned the constitutionality of the second trimester hospitalization requirement addressed the issue of the appropriateness of preliminary injunctive relief in the matter. Further, important legal and factual differences exist between Gary-Northwest Indiana Women's Services, Inc. v. Bowen, 496 F. Supp. 894 (N.D.Ind.1980), and the matter before this Court.\n\nAccordingly, since La.Rev.Stat.Ann. § 40:1299.35.3 (West Supp.1981) is a re-enactment of the mandatory second trimester hospitalization requirement which this Court declared unconstitutional in Margaret S. (I), supra, the Court has concluded that this provision, too, must fall. Accordingly, the plaintiff's Motion for Summary Judgment on this issue will be and hereby is GRANTED.\n\nInformed Consent\n\nLa.Rev.Stat.Ann. 40:1299.35.6(B) (West Supp.1981) requires a physician, prior to performing an abortion, to orally inform the pregnant woman of certain facts, including: that in his or her opinion, the woman is in fact pregnant; the number of weeks that have elapsed since conception; the anatomical and physical development of the fetus; whether the child is viable, according to the best medical judgment of the attending physician; the type of technique which will be utilized in the abortion procedure and the medical risks and possible consequences associated with it; and that public and private agencies are available to assist her if she wishes to continue her pregnancy. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\nThe plaintiffs maintain that the informed consent provisions are unconstitutional. First, they object to the requirement that the attending physician personally perform the counseling duties required under the statute. The plaintiffs contend that this requirement significantly burdens women's exercise of the abortion right by preventing clinics from utilizing physicians' services efficiently and economically, thereby increasing the cost of abortions. The crux of the plaintiffs' argument in this regard is that the requirement that the attending physician personally perform counseling duties would force the physician to spend a significantly greater amount of time at the clinic and, since the physician's fees are the single largest component of costs in the abortion procedure, would result in an increase in the cost of abortions. The plaintiffs also argue that the physician counseling requirement represents a substantial intrusion into the physician-patient relationship and that the State's interest in maternal health does not justify such a requirement.\n\nIn contrast, the State argues that the physician counseling requirement comports with the community standard for informed consent for obstetric and gynecological surgical procedures. The State contends that by failing to personally perform counseling duties in the abortion procedure, the attending physician fails to provide the quality of care that is the standard within the medical community.\n\nA review of the applicable legal standard is appropriate at this juncture. The Court has previously stated that Roe v. Wade, 410 U.S. 113, 155. 93 S. Ct. 705, 728, 35 L. Ed. 2d 147 (1973), establishes that the right of privacy, which is implicit in the concept of liberty guaranteed by the Fourteenth Amendment, encompasses a woman's decision to terminate her pregnancy. Thus, \"only compelling state interests can justify any state limitations.\" Women's Medical Center of Providence, Inc. v. Roberts, 530 F. Supp. 1136, 1143 (D.R.I.1982). Accord, Roe v. Wade, 410 U.S. at 155, 93 S. Ct. at 728; City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983); Planned Parenthood League of Massachusetts v. Bellotti, 641 F.2d 1006, 1016 (1st Cir.1981). \"When any state regulations implicate directly a woman's abortion decision, it is incumbent on a court to determine whether the regulations in question are justified by a compelling state interest and whether they have been drafted narrowly to further that compelling state interest.\" Scheinberg v. Smith, 659 F.2d 476, 482 (5th Cir.1981). Accord, Carey v. Population Services International, 431 U.S. 678, 686, 97 S. Ct. 2010, 2016, 52 L. Ed. 2d 675 (1977); Poe v. Gerstein, 517 F.2d 787, 791 (5th Cir.1975), aff'd sub nom. mem., Gerstein v. Coe, 428 U.S. 901, 96 S. Ct. 3202, 49 L. Ed. 2d 1205 (1976). Initially, the plaintiffs must demonstrate that \"the state regulation in question interferes directly with a woman's abortion decision,\" Scheinberg, supra, 659 F.2d at 482, since if the regulation constitutes only a de minimis burden on the abortion right, it is permitted under the jurisprudence. See Charles v. Carey, 627 F.2d 772, 777 (7th Cir.1980); Women's Medical Association v. Roberts, 530 F. Supp. 1136, 1143 (D.R.I.1982).\n\nThe evidence adduced at trial established that the physician counseling requirement would affect the cost of abortion services in Louisiana. In a typical Louisiana abortion clinic, only one physician is on duty at any given time. While the attending physician is available to consult with patients should they so request, his duties are normally confined to the actual performance of the abortion procedure. Other aspects of a woman's care while at the clinic, including counseling, preparing the woman for the procedure, and post-operative care, are provided by other clinic personnel such as nurses, laboratory technicians, counselors, and clerical workers, whose services are not as costly as those of a physician. The testimony at trial established that physicians' fees account for approximately 50 percent of the total cost of providing abortion services. If physicians performed counseling duties as well as the abortion procedure, they would spend more time at clinics and would charge additional fees. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" These increased costs would undoubtedly be reflected in higher fees to patients. Thus, by limiting the attending physician's involvement to the actual performance of the abortion, clinics are able to provide abortions at the current rates.\n\nThe physician counseling requirement would not only result in higher fees for abortions, it is also apparent that it would lessen the availability of abortion services in Louisiana since a physician would be required to spend a significant amount of time counseling abortion patients instead of focusing his attention exclusively on the performance of the surgical procedure. This is particularly significant in view of the fact that Louisiana is an underserved state in terms of the availability of abortion services. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nThe Court is further convinced that the physician counseling requirement would result in longer delays for women seeking abortions. The requirement would necessarily involve massive scheduling changes as physicians combined counseling duties with their primary responsibility to perform the abortion procedure. Patients would be required to wait for longer periods of time for the performance of abortions. The decreased availability of abortion services would also result in longer delays for women seeking abortions. Additional delays could increase the anxiety and stress that many patients experience when facing a surgical procedure of this nature. Clearly, as was established at the trial of this matter, as well as in Margaret S (I), 488 F. Supp. at 194 n. 39, the risk of the pregnant woman's health increases with each week of delay.\n\nThe Court is convinced that the physician counseling requirement constitutes a direct burden upon the abortion right since the requirement would increase the cost of abortions, see, e.g., Planned Parenthood Association of Kansas City, Missouri v. Ashcroft, 462 U.S. 476, 103 S. Ct. 2517, 76 L. Ed. 2d 733 (1983), lessen the availability of the procedure, and result in longer delays for women seeking abortions. See also City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983); Charles v. Carey, 627 F.2d 772, 784 (7th Cir.1980). Thus, the State must demonstrate the \"compelling bases for the law, that is, that the burden [imposed on the abortion decision] is not 'undue' or unjustifiable.\" Scheinberg, 659 F.2d, at 482. Accord, Charles v. Carey, 627 F.2d, at 777.\n\nIn support of the physician counseling requirement, the State argues that by delegating counseling duties, physicians who perform abortions do not comply with the community medical standard for informed consent in gynecological surgical procedures. The State maintains that the law requiring the attending physician to supply a woman seeking an abortion with the information specified in the statute is designed to force abortion practitioners to provide the same quality of care that is the prevailing standard within the medical community. This appears to be the only justification the State advances in support of the physician counseling requirement, and the Court is of the opinion that the State has failed to establish the truth of this contention. In fact, the evidence adduced at trial indicates that all of the abortion clinics represented in this matter utilize the services of trained counselors to counsel abortion patients and to impart necessary information to them. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Some physicians use standardized materials to impart basic information to patients which is not necessarily repeated during sessions with clinic counselors. The evidence established that counselors are often more effective than physicians in alleviating the anxiety and stress that many abortion patients experience, and that counselors are often more sensitive to the needs of abortion patients than physicians. Also, the testimony of two physicians indicated that many abortion patients are more relaxed with counselors, all of whom are females in the clinics represented in this matter, because of gender and because counselors are closer in age and educational backgrounds to patients. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nIn light of the evidence submitted in this case, the Court is not convinced that the State's interest in assuring that physicians conform to standards of good medical practice by personally informing abortion patients of the information contained in La.Rev.Sta.Ann. § 40:1299.35.6(B) constitutes a compelling one. Indeed, the evidence adduced at trial suggests, at best, that the physician counseling requirement is a \"good idea.\" See Women's Medical Service of Providence, Inc. v. Roberts, 530 F. Supp. 1136 at 1148 (D.R.I.1982). However, the evidence did not establish a compelling need for the physician counseling requirement. Trained counselors are capable of imparting necessary information to abortion patients. The content of this information is determined by clinic physicians. Finally, it is apparent that trained counselors are more capable of performing the counseling function, which often involves discussions of a very sensitive and personal nature. Thus, even assuming that the State has a compelling interest in assuring that the informed consent process conforms to good medical practice, the State has failed to demonstrate that the physician counseling requirement serves this end. See Women's Medical Service of Providence, Inc., supra, at 1149.\n\nTo summarize, the Court has concluded that the physician counseling requirement constitutes a direct burden on the abortion right because of its impact on the cost and availability of abortions in Louisiana. Since the State has failed to demonstrate a compelling basis for the requirement, it must be eliminated from the statute. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nTurning to the remaining requirements of the statute which specify certain information that must be imparted to women prior to the performance of an abortion, the Court preliminary notes that the Supreme Court has held, in Planned Parenthood of Central Missouri v. Danforth, 428 U.S. 52, 67, n.8, 49 L. Ed. 2d 788, 96 S. Ct. 2831, 2840 (1976), that a state may require a woman's written informed consent prior to the performance of an abortion. In Danforth, supra, the Court stated that \"the decision to abort, indeed, is often a stressful one, and it is desirable and imperative that it be made with full knowledge of its nature and consequences.\" However, the Court went on to state that\n\nWe are content to accept, as the meaning [of informed consent], as the giving of information to the patient as to just what would be done and as to its consequences. To ascribe more meaning than this might well confine the attending physician in an undesired and uncomfortable straightjacket in the practice of his profession.\n\nDanforth, 428 U.S. at 67 n. 8, 96 S. Ct. at 2840 (Emphasis added).\n\nLa.Rev.Stat.Ann. § 40:1299.35.6 (West Supp.1981) directs a physician to convey a variety of information to a woman prior to the performance of an abortion. First, in referring to the fetus, the statute employs the term \"unborn child.\" The plaintiffs object to the use of this term, maintaining that it injects a religious bias into the informed consent process in violation of the First and Fourteenth Amendments to the Constitution. As to this contention, the Court holds that the use of the term \"unborn child\" in the statute does not infringe upon the plaintiffs' constitutional rights inasmuch as the statute does not mandate the inclusion of this term in the consent form which the pregnant woman signs. The Court interprets this statute to require that a woman be apprised of certain facts concerning the elective abortion she is considering; however, while the statute refers to the fetus as an \"unborn child,\" it does not specifically mandate the use of this terminology in the consent form provided to the abortion patient. Provided the factual information required by the statute is conveyed to the woman, other terms may be employed in referring to the \"unborn child,\" such as \"fetus\" or \"conceptus.\" The evidence adduced at trial established that these are medically accepted terms, unlike the term \"unborn child,\" which could increase a woman's guilt surrounding the abortion decision by implying that she is taking the life of a person. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\"\n\nSection 40:1299.35.6(B)(3) requires a pregnant woman seeking an abortion to be informed of the \"anatomical and physiological development of the unborn child at the time the abortion is to be performed.\" The plaintiffs object to the inclusion of such information in the informed consent dialogue. They maintain that it is impossible for a physician to determine with accuracy the precise gestational age of a fetus, especially in the first trimester when fetal development is particularly rapid. Yet, the statute requires a physician, under threat of criminal prosecution, to impart information to a pregnant woman which is derived from the physician's knowledge of gestational age. To comply with the statute, a physician would be required to describe a range of fetal development of several weeks. The plaintiffs further argues that the statute is vague in this regard since it does not state with specificity the amount of information a physician must impart in order to comply with this requirement. The plaintiffs also present several other arguments against the provision requiring physicians to explain the anatomical and physiological development of the fetus to the pregnant woman, including (1) the provision is irrelevant, unnecessary, and prejudicial to the informed consent dialogue; (2) such information would have an adverse effect on a pregnant woman's emotional health in many instances and (3) this requirement would prevent physicians from exercising their best medical judgment with respect to the kinds of information to be imparted to individual patients.\n\nIn support of this provision, the State argues that information concerning the anatomical and physiological development of the fetus promotes the State's legitimate interest in assuring that the abortion decision is made in a knowing, intelligent, and voluntary fashion. The State further argues that it is necessary to good medical practice that abortion patients be provided with this information.\n\nIn evaluating the outer limits of state intervention in the informed consent process, the Court must again balance the burdens imposed on the abortion right against the interests asserted by the State. Roe v. Wade, supra, 410 U.S. at 154, 93 S. Ct. at 727. The Court approaches this inquiry by analyzing the abortion right in terms of two components:\n\none prong of the right protects the process of the decision, guarding against intrusions into the physician-patient relationship essential to the course of decisionmaking; the second prong protects the outcome of the decision, providing a shield against state requirements that attempt to skew the choice one way or another.\n\nPlanned Parenthood League of Massachusetts v. Bellotti, 641 F.2d 1006, 1017 (1st Cir.1981).\n\nThe plaintiffs do not contend that the required use of a prescribed consent form offends the \"process\" aspect of the abortion decision. The plaintiffs do contend, however, that the required disclosure of information concerning the anatomical and physiological development of the fetus constitutes an intrusion into the physician-patient relationship by requiring the physician to convey this information to abortion patients in every instance even when in the exercise of his medical judgment, it is not in the best interest of the patient to make such disclosures. The Court agrees. In Planned Parenthood of Central Missouri v. Danforth, supra, the Supreme Court cautioned against \"confining the attending physician in an undesired and uncomfortable straightjacket in the practice of his profession.\" 428 U.S. at 67, n. 8, 96 S. Ct. at 2840 n. 8. The Court has concluded that this section so confines the physician since he has no discretion as to whether he discloses such information. On the contrary, he must convey to the abortion patient information concerning the anatomical and physiological development of the fetus in every case, regardless of his medical judgment in certain instances that such disclosure is inappropriate. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Further, \"this section forces the physician to communicate to his patients questionable information,\" Margaret S (I), supra, 488 F. Supp. at 210, since it is difficult to determine fetal age with precision, especially in the first trimester when fetal development is particularly rapid.\n\nThe plaintiffs also argue that the provision requiring physicians to detail the anatomical and physiological development of the fetus impermissibly burdens the outcome of the abortion decision. In light of the evidence presented at trial on this issue, the Court agrees. First, it is apparent that this \"information is not directly material to any medically relevant fact, and thus does not serve the concern for providing adequate medical information that lies at the heart of the informed consent requirement.\" Planned Parenthood League of Massachusetts v. Bellotti, 641 F.2d at 1021. In other words, an understanding of fetal development by abortion patients is unnecessary to the informed consent process. Second, several experts were of the opinion that this information would cause emotional distress and guilt feelings surrounding the abortion decision. It was also apparent from the testimony at trial that many women would not understand a detailed description of fetal development. In such cases, providing information concerning fetal development would serve no useful purpose. Finally, many women expressly ask to not be told of fetal development.\n\nSimilar considerations led to the holding in Planned Parenthood League of Mass. v. Bellotti, 641 F.2d at 1021-1023 where the Court declared unconstitutional a statutory requirement that an abortion patient be provided a description of the stage of development of the unborn child. The Court concluded that the requirement \"imposes clear burdens on a fundamental right by presenting irrelevant and potentially prejudicial information, inflicting emotional distress, constituting an undesired intrusion, and perhaps representing an attempt at moral indoctrination.\" Planned Parenthood League of Mass. v. Bellotti, 641 F.2d 1006 at 1022 (1st Cir.1981). The Court stated:\n\nto the extent that information may be imposed by the state it must be neutral and objective; coercive state indoctrination of particular values or ethical judgments is objectional to First as well as Fourteenth Amendment principles. The state may not add to its presentation of material facts such as moral overlay, an attempted imposition of ideas that is particularly objectionable in connection with the exercise of fundamental rights.\n\nId.\n\nWhile the State argues that the requirement of an explanation of fetal development furthers the State's legitimate interest in insuring that the abortion decision is intelligently made, this is a dubious claim since it is not clear that abortion decisions made with such knowledge are \"better\" than decisions made without this information. See Planned Parenthood League of Massachusetts v. Bellotti, at 1018-1019. More importantly, however, the State has failed to demonstrate that it has a compelling interest in providing this information. Accordingly, the Court concludes that La.Rev.Stat.Ann. § 40:1299.35.6(B)(3) (West Supp.1981) is unconstitutional.\n\nThis Court reached the same conclusion in Margaret S (I), supra, 488 F. Supp. 181, 208-209 (E.D.La.1980), when it declared the predecessor to this statute unconstitutional. La.Rev.Stat.Ann. § 40:1299.35.6(B)(3) (West Supp.1979). The Court's holding rested in part upon the conclusion that since it is extremely difficult for a physician to determine fetal age precisely during the early stages of pregnancy, it would be impossible to comply with the statute. Margaret S (I), supra, at 209. The Court also noted that it was impossible to determine under the statute how detailed a discussion of fetal development he must provide to the pregnant woman. These considerations are no less compelling in this matter. The physician's \"right and ability to practice medicine 'free from the imposition of arbitrary restraints' will be injured no matter how he attempts to comply with the statute.\" Margaret S (I), supra at 209, (quoting Greco v. Orange Memorial Hospital Corp., 513 F.2d 873, 875 (5th Cir.), cert. denied, 423 U.S. 1000, 96 S. Ct. 433, 46 L. Ed. 2d 376 (1975). Further, because of the uncertainty as to the amount of information concerning fetal development required by the statute, it is a trap for the unwary that \"encourages arbitrary and erratic arrests and convictions.\" Papachristou v. City of Jacksonville, 405 U.S. 156, 162, 92 S. Ct. 839, 843, 31 L. Ed. 2d 110 (1972). Thus, La.Rev.Stat.Ann. § 40:1299.35.6(B)(3) is also void for vagueness. This is especially true here, \"where the uncertainty induced by the statute threatens to inhibit the exercise of constitutionally protected rights.\" (citations omitted.) Colautti v. Franklin, 439 U.S. 379, 391, 99 S. Ct. 675, 683, 58 L. Ed. 2d 596 (1979).\n\nOther courts have also concluded that abortion statutes requiring a description of fetal development are unconstitutional. See, e.g., Charles v. Carey, 627 F.2d 772, 784 (7th Cir.1980); Women's Medical Center of Providence, Inc. v. Roberts, 530 F. Supp. 1136, 1153-1154 (D.R.I.1982); Planned Parenthood Association v. Ashcroft, 462 U.S. 476, 103 S. Ct. 2517, 76 L. Ed. 2d 733 (1983); Leigh v. Olson, 497 F. Supp. 1340, 1345 (D.N.D.1980); City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983). This jurisprudence supports the Court's conclusion that such legislation\n\n. . . is totally inappropriate. It is an attempt by the state to coerce a woman's decision, without regard to her physical and mental health, by the use of information irrelevant to her decision. It is an extravagant tactic by the state that unduly burdens a woman's fundamental right to a free objective choice.\n\nWomen's Medical Center of Providence, Inc. v. Roberts, 530 F. Supp. 1136, 1153-1154 (D.R.I.1982).\n\nLa.Rev.Stat.Ann. § 40:1299.35.6(B)(4) (West Supp.1981) requires disclosure to the abortion patient whether the fetus is viable, according to the physician's best medical judgment. The plaintiffs argue that this section unduly burdens the abortion right by forcing a physician to discuss irrelevant and prejudicial information with the pregnant woman. They further argue that in many instances a physician may conclude, in the exercise of his best medical judgment, that it is in the best interest of the patient to not receive such information. In response to the plaintiffs' assertions, the State again argues that physicians within the medical community routinely discuss viability with pregnant patients. Thus, they contend that the statute merely forces physicians who perform abortions to conform to accepted standards of good medical practice.\n\nThe Court is convinced that the provision requiring a discussion of the viability of a fetus which a woman intends to abort exceeds the constitutionally permissible limits of state involvement in the informed consent process. This provision requires such a discussion in every instance despite the facts that approximately 93.3 percent of all abortions performed in Louisiana occur prior to the end of the first trimester of pregnancy, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" and that more than 99 percent of all abortions performed in Louisiana occur before the 20th week of pregnancy, see Plaintiffs' Exhibit #4D, when viability is not a possibility. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" Thus, with respect to the vast majority of abortion patients in Louisiana, the statute requires the woman to receive information that is irrelevant to her decision, see Planned Parenthood League of Massachusetts v. Bellotti, supra, 641 F.2d at 1021, and that may influence the outcome of her decisionmaking process by suggesting that the fetus is a human being. In the absence of a compelling basis for this substantial burden on the abortion right, this is impermissible. The State's claim that a discussion of viability with abortion patients comports with accepted standards of medical practice is doubtful since, again, the State failed to demonstrate that abortion decisions made with such knowledge are better than abortion decisions made without them. Bellotti, supra, 641 F.2d at 1018-1019. Moreover, the State failed to demonstrate that it has a compelling interest in providing this information.\n\nThe Court has also concluded that § 40:1299.35.6(B)(4) constitutes an intrusion into the physician-patient relationship since the statute requires disclosure of information regarding fetal viability in every case, even when the physician, in the exercise of his best medical judgment, determines that such disclosure is not in the best interest of the patient. This provision confines the physician in \"an undesirable and uncomfortable straightjacket in the practice of his profession.\" Danforth, supra, 428 U.S. at 67 n. 8, 96 S. Ct. at 2840 n. 8.\n\nAs a final challenge to specific provisions of the informed consent statute, La.Rev.Stat.Ann. § 40:1299.35.6(B), the plaintiffs object to Section 40:1299.35.6(B)(5), which requires the abortion patient to be informed of \"the type of method or technique which will be utilized in the abortion, the means of effectuating the method or technique, and the medical risks and consequences of the method or technique to be utilized.\" The plaintiffs argue that some women ask not to be told such information, and that in such cases disclosure of this information would adversely affect the patient's health. The plaintiffs contend that this requirement burdens a woman's right to receive information in an unbiased and neutral way and serves no legitimate state interest in maternal health. In response, the State argues that physicians engaged in comparable surgical procedures in the medical community, routinely convey to patients the information required by the statute. The State contends that the statutory requirement merely insures that physicians comport with standards of good medical practice prevailing in the medical community.\n\nIn evaluating the constitutionality of La.Rev.Stat.Ann. § 40:1299.35.6(B)(5), the Court again turns to Planned Parenthood of Central Missouri v. Danforth, where the Supreme Court stated that \"we are content to accept, as the meaning [of informed consent], as the giving of information to the patient as to just what would be done and as to its consequences.\" 428 U.S. at 67 n. 8, 96 S. Ct. at 2840 n. 8. According to this standard, it is apparent that La.Rev.Stat.Ann. § 40:1299.35.6(B)(5) is \"entirely unobjectionable.\" Planned Parenthood League of Massachusetts v. Bellotti, supra, 641 F.2d at 1019. The statute requires the woman to be informed of the nature of the abortion procedure and the risks associated with it, directives which were specifically approved in Danforth, supra, Accord, Planned Parenthood League of Massachusetts v. Bellotti supra; Hodgson v. Lawson, 542 F.2d 1350, (8th Cir.1976); Planned Parenthood Association v. Ashcroft, 462 U.S. 476, 103 S. Ct. 2517, 76 L. Ed. 2d 733 (1983). Accordingly, the Court has concluded that this section is constitutional.\n\nFinally, the plaintiffs challenge the concept of informed consent requirements for the abortion procedure. They argue that since the State has not chosen to similarly regulate other comparable surgical procedures, the informed consent requirements violate the equal protection clause of the Fourteenth Amendment. In response to this argument, the Court emphasizes that the Supreme Court has sanctioned consent requirements for the abortion procedure despite the fact that other surgeries are not regulated in this manner. In Planned Parenthood of Central Missouri v. Danforth, supra, 428 U.S. at 67, 96 S. Ct. at 2840, the Court stated:\n\nwe could not say that a requirement imposed by the State that a prior written consent for any surgery would be unconstitutional. As a consequence, we see no constitutional defect in requiring it only for some types of surgery as, for example, an intracardiac procedure, or where the surgical risk is elevated above a specified mortality level, or, for that matter, for abortions. (footnote omitted).\n\nAs this Court previously noted, the Supreme Court unequivocally held in Danforth, supra, that the State has a legitimate interest in insuring that the abortion decision is intelligently made. Thus, this Court has concluded that the fact that the State has not chosen to impose informed consent requirements upon surgical procedures comparable to the abortion procedure does not render the notion of informed consent for abortions constitutionally defective.\n\nEmergency Provisions\n\nThis section suspends the operation of the minor consent provisions of La.Rev.Stat.Ann. § 40:1299.35.5 and the informed consent requirements of La.Rev.Stat.Ann. § 40:1299.35.6 in the event that \"the pregnancy creates an emergency need for an abortion to be performed or induced because the continuation of the pregnancy poses an immediate threat and grave risk to the life or permanent physical health of the pregnant woman. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" The plaintiffs argue that the emergency provision violates the due process clause of the Fourteenth Amendment by contravening the standards set forth in Roe v. Wade, 410 U.S. 113, 163, 93 S. Ct. 705, 732, 35 L. Ed. 2d 147 (1973) which outlined the parameters of permissible state regulation of abortion under a broad standard of \"preservation and protection of maternal health.\" The plaintiffs contend that the emergency provision formulates an objective and highly restrictive definition of an emergency, thereby detailing the elements of an emergency, and limiting the circumstances under which physicians can certify to an emergency need for an abortion. Thus, the plaintiffs argue that the statute eliminates the latitude for a physician to exercise his best medical judgment to protect maternal health, which was deemed critical in Roe v. Wade, supra. The plaintiffs contend that by placing this obstacle in the path of the pregnant woman's physician, the fundamental right to abortion is unduly burdened. Whalen v. Roe, 429 U.S. 589, 604 n.33, 97 S. Ct. 869, 879 n. 33, 51 L. Ed. 2d 64 (1977). A second aspect of the plaintiffs' due process challenge rests on the fact that the statute allows for the suspension of consent requirements only in the event of an emergency where a pregnant woman's physical health is threatened. The plaintiffs argue that by not allowing for \"psychiatric emergencies,\" La.Rev.Stat.Ann. § 40:1299.35.12 is not reasonably related to the statutory goal of suspending the consent requirements in genuine emergency situations. The plaintiffs also argue that by excluding from consideration other factors such as a woman's emotional and psychological well-being, as well as age and family circumstances in determining whether an emergency exists, the statute is not narrowly drawn to promote the State's interest in the preservation of maternal health.\n\nIn defending the emergency provision, the State argues that by positing the occurrence of a so-called \"psychiatric emergency,\" the plaintiffs have erected a smokescreen designed to exempt most women from the minor and informed consent provisions. The State further argues that if a woman should experience a genuine psychiatric emergency as a result of her pregnancy, it is in her best interest to postpone the termination of her pregnancy until the resolution of her crisis.\n\nWhile the plaintiffs launch a barrage of due process challenges against Louisiana's emergency provision, the Court is convinced that this statute is constitutional. The statute represents a balanced attempt to promote the State's interest in protecting maternal health by providing for abortions without consent in certain emergency situations, while protecting a woman's constitutional right to an abortion. The statute does not place a physician in an \"undesired and uncomfortable straightjacket,\" see Danforth, 428 U.S. at 67 n. 8, 96 S. Ct. at 2840 n. 8, in the exercise of his best medical judgment since he may dispense with the consent requirements imposed by law and terminate a woman's pregnancy immediately when he determines the existence of an immediate threat to the pregnant woman's physical health.\n\nThe plaintiffs argue that under circumstances where a pregnant woman experiences a \"psychiatric emergency,\" the woman's best interest is promoted by an immediate termination of the pregnancy. The Court rejects this argument, however, since unrefuted psychiatric testimony at trial demonstrated that it is not in the best interest of a woman experiencing psychological or emotional trauma concerning her pregnancy to terminate the pregnancy until the crisis is resolved. The evidence established that in order to avoid long-term or permanent psychological damage, such patients should receive further counseling prior to the performance of the abortion. It is apparent then, that the State rationally concluded that it is not in the best interest of a pregnant woman experiencing a \"psychiatric emergency\" to have an immediate abortion prior to resolving her crisis. By failing to statutorily provide for an abortion in such circumstances, the State has attempted to further its legitimate interest in protecting maternal health. If the Court were to accept the plaintiffs' argument regarding the existence of a psychiatric emergency, the possibilities would be endless with respect to the number of women who could not face the stress of childbearing, and thus could be classified as \"psychiatric emergencies.\" Indeed, this concept of the so-called \"psychiatric emergency\" has the potential to subvert the State's legitimate interests in insuring that minors seek guidance before making the very difficult decision to abort, see Bellotti II, 443 U.S. at 639-651, 99 S. Ct. at 3046-3052, and that all women make the abortion decision \"with full knowledge of its nature and consequences.\" Danforth, 428 U.S. at 67, 96 S. Ct. at 2840.\n\nThe Court has concluded that the emergency provision constitutes a de minimis burden on the abortion right in view of the fact that the statute does not prevent a woman from seeking an abortion; rather, it insures that the abortion decision is intelligently made in furtherance of a legitimate state interest. Contrary to the plaintiffs' assertion that the emergency provision interferes with a woman's right to choose an abortion, the statute actually allows a physician to dispense with consent requirements and to terminate a woman's pregnancy immediately in circumstances that present an immediate threat to the woman's physical health. In this regard, the statute furthers the State's legitimate interest in promoting maternal health.\n\nThe plaintiffs also argue that the emergency provision is unconstitutionally vague in that it subjects physicians to criminal penalties without providing adequate notice as to the conduct required under the statute. The plaintiffs contend that the statute impermissibly requires physicians to determine what constitutes an \"immediate threat and grave risk to life or permanent physical health.\" The plaintiffs presented evidence to the effect that the terminology of La.Rev.Stat.Ann. § 40:1299.35.12 is subject to varying interpretations in medical practice, and that the statute requires physicians to make highly predictive judgments which may exceed human competence. However, the Court also rejects this argument since expert testimony established that physicians are capable of determining the meaning of the phraseology employed in the statute. Indeed, considering that physicians make determinations of the existence of medical emergencies that threaten a patient's physical health on a regular basis, this testimony becomes compelling.\n\nFinally, the plaintiffs launch a challenge under the equal protection clause of the Fourteenth Amendment against the emergency provision of La.Rev.Stat.Ann. § 40:1299.35.12. The gravamen of the plaintiffs' charge in this regard is that the State has chosen to narrowly define, only with respect to the abortion procedure, an \"emergency\" exception to the doctrine of informed consent which excludes from consideration all but physical threats to a patient's health. The plaintiffs argue that the informed consent standard embedded in the jurisprudence, which is applicable to other aspects of patient care, permits a physician to dispense with the requirement of patient consent under a wider variety of circumstances. See, e.g., Canterbury v. Spence, 150 U.S. App. D.C. 263, 464 F.2d 772, 778-779 (D.D.C. 1972), cert. denied 409 U.S. 1064, 93 S. Ct. 560, 34 L. Ed. 2d 518 (1972); Babin v. St. Paul Fire and Marine Insurance Co., 385 So.2d 849, 853 (La.App. 1st Cir.1980), writ denied 386 So. 2d 358 (1980); Percle v. St. Paul Fire and Marine Insurance Co., 349 So.2d 1289, 1299-1300 (La.App. 1st Cir.1977), writ denied 350 So. 2d 1218 (1977).\n\nIn order to answer the plaintiffs' equal protection challenge to the emergency provision, it is necessary to review the applicable law. The Court must first look at the nature of the classification to determine whether the statute utilizes a suspect classification. See Harris v. McRae, 448 U.S. at 321-325, 100 S. Ct. at 2690-2692; Maher v. Roe, 432 U.S. 464, 470-471, 97 S. Ct. 2376, 2380-2381, 53 L. Ed. 2d 484 (1977); San Antonio School District v. Rodriguez, 411 U.S. 1, 17, 93 S. Ct. 1278, 1288, 36 L. Ed. 2d 16 (1973). The plaintiffs do not argue that a pregnant woman desiring an abortion comes within the limited category of disadvantaged classes recognized in the jurisprudence, and the Court finds no basis for reaching such a conclusion. Thus, the Court would have no occasion to apply strict scrutiny unless the statute \"impermissibly interferes with the exercise of a fundamental right.\" Massachusetts Board of Retirement v. Murgia, 427 U.S. 307, 312, 96 S. Ct. 2562, 2566, 49 L. Ed. 2d 520 (1976). See also Zablocki v. Redhail, 434 U.S. 374, 383, 98 S. Ct. 673, 679, 54 L. Ed. 2d 618 (1978); Planned Parenthood League of Mass. v. Bellotti, 641 F.2d 1006, 1012 (1st Cir.1981). The Court has previously indicated its conclusion that this statute constitutes only a de minimis burden upon a woman's constitutional right to choose an abortion. Thus, the State need only demonstrate that La.Rev.Stat.Ann. § 40:1299.35.12 is rationally related to a legitimate governmental objective. Harris v. McRae, 448 U.S. at 324-325, 100 S. Ct. at 2692. Accord, Planned Parenthood League of Mass, 641 F.2d at 1012. The Court has concluded that this statute promotes the State's legitimate interest in protecting maternal health. In view of this discussion, the Court has concluded that La.Rev.Stat.Ann. § 40:1299.35.12 (West Supp.1981) is constitutional.\n\nDisposal of Remains\n\nTrial of the issue of the constitutionality of La.Rev.Stat.Ann. 40:1299.35.14 (West Supp.1981) (Disposal) was bifurcated from the trial of the other abortion regulations in December of 1981, due to the failure of the Department of Health and Human Resources to promulgate regulations needed to complete the statute. Those regulations have now been published in the Louisiana Register.\n\nThe newly-enacted version of La.Rev.Stat.Ann. 40:1299.35.14 (West Supp.1981), \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" which regulates the disposal of fetal tissue following an abortion, provides that the \"remains of the [dead] child are [to be] disposed of in accordance with rules and regulations which shall be adopted by the Department of Health and Human Resources.\" La.Rev.Stat.Ann. 40:1299.35.14(A). However, paragraph (B) of the statute provides that in certain \"instances\" the \"remains of the child\" shall be buried or cremated in accordance with La.Rev.Stat.Ann. 8:651, which governs the disposition of \"all dead bodies.\" Those \"instances\" presumably would be at the behest of the woman. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" Paragraph (C) requires that:\n\nthe attending physician shall inform each woman upon whom he performs or induces an abortion of the provisions of this Section within twenty-four hours after the abortion is performed or induced.\n\nPlaintiffs maintain that the disposal provisions are unconstitutional. First, they object to the requirement that the physician inform the woman within twenty-four hours after the abortion that she must choose between burial of the \"child\" or other means of disposal. Plaintiffs argue that this requirement suggests to the woman that abortion is to be equated with the taking of a human life.\n\nUnderlying this requirement, plaintiffs argue, is the belief that the aborted fetus is a \"baby,\" and therefore entitled to the same kind of ritual upon death as are other human beings. Plaintiffs argue that to force women who have undergone abortions to choose the method of disposal of their fetal remains will cause many to feel guilty, as if they had taken a human life.\n\nPlaintiffs also argue that there is no justification in terms of promoting maternal health for this section. Moreover, plaintiffs argue that by requiring that each and every woman be told of the disposal law within twenty-four hours of the operation, this statute burdens a woman's constitutional right to choose an abortion. Finally, it is argued that the statute's requirements unduly interfere with the physician-patient relationship in that the statute does not allow the physician to exercise his judgment as to which women would or would not benefit from the receipt of this information. Plaintiffs assert that this burden on the abortion right is not justified by a compelling state interest.\n\nIn contrast, the State argues that the burden on a woman's abortion decision, if any, is de minimus and thus insufficient to overturn the disposal statute. The State argues that the statute places no burden on the abortion decision because the abortion decision is over by the time the statute comes into play. Thus, the State contends that there is no chilling effect on the abortion decision.\n\nMoreover, the State argues that any potential resulting emotional distress which could be caused to the woman by making a decision as to alternative methods of disposition of fetal remains is far outweighed by the legitimate purpose of assuring the woman that the fetal remains will be disposed of in accordance with her desires. The State argues that the notification requirement prevents the far more serious emotional distress of a woman unknowingly permitting fetal remains to be disposed of in a manner not in accordance with the particular individual's religious, moral or other convictions. Finally, the State argues that the statute protects the First Amendment rights of those who for religious reasons wish to exercise their freedom of choice in having the fetal remains buried or cremated.\n\nA review of the applicable legal standard is appropriate at this juncture. The Court has previously stated that Roe v. Wade, 410 U.S. 113, 155, 93 S. Ct. 705, 728, 35 L. Ed. 2d 147 (1973), establishes that the right of privacy, which is implicit in the concept of liberty guaranteed by the Fourteenth Amendment, encompasses a woman's decision to terminate her pregnancy. Thus, \"only compelling state interests can justify any state limitations.\" Women's Medical Center of Providence, Inc. v. Roberts, 530 F. Supp. 1136, 1143 (D.R.I.1982). Accord, Roe v. Wade, 410 U.S. at 155, 93 S. Ct. at 728; City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983); Planned Parenthood League of Massachusetts v. Bellotti, 641 F.2d 1006, 1016 (1st Cir.1981). \"When any state regulations implicate directly a woman's abortion decision, it is incumbent on a court to determine whether the regulations in question are justified by a compelling state interest and whether they have been drafted narrowly to further that compelling state interest.\" Scheinberg v. Smith, 659 F.2d 476, 482 (5th Cir.1981). Accord, Carey v. Population Services International, 431 U.S. 678, 687, 97 S. Ct. 2010, 2016, 52 L. Ed. 2d 675 (1977); Poe v. Gerstein, 517 F.2d 787, 791 (5th Cir.1975), aff'd sub nom; Gerstein v. Coe, 428 U.S. 901, 96 S. Ct. 3202, 49 L. Ed. 2d 1205 (1976). Initially, the plaintiffs must demonstrate that \"the state regulation in question interferes directly with a woman's abortion decision,\" Scheinberg, supra, 659 F.2d at 482, since if the regulation constitutes only a de minimus burden on the abortion right, it is permitted under the jurisprudence. See Charles v. Carey, 627 F.2d 772, 777 (7th Cir.1980); Women's Medical Association v. Roberts, 530 F. Supp. 1136, 1143 (D.R.I.1982).\n\nOnce the plaintiffs demonstrate that regulation in question directly interferes with a woman's abortion decision, the State must demonstrate a compelling basis for the law. Scheinberg, supra. Moreover, the State has the additional burden of demonstrating that its regulation is reasonably designed to further that [compelling] state interest. City of Akron v. Akron Center for Reproductive Health, Inc., supra, 103 S. Ct. at 2495 (citations omitted). The Court is convinced that the disposal provisions constitute a direct and undue burden upon the abortion right.\n\nLa.Rev.Stat.Ann § 40:1299.35.14(C) requires the physician, within 24 hours after the abortion is performed, to tell the woman of the provisions of the disposal section. The section provides that the remains of the \"child\" be disposed of in accordance with state regulations, except in instances where it is disposed of pursuant to La.Rev.Stat.Ann. § 8:651 which governs the disposal of \"all dead bodies.\" Thus, it requires the physician to tell the woman she must choose between burial and other means of disposal. The Court finds that the requirement embodied in paragraph (C) of the new statute involves the same constitutional defects as those found to exist in the previous statute. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nThe use of the term \"the remains of the child\" reveals intent by the legislature to \"impermissibly [raise] the status of a fetus to that of a human being.\" Margaret S (I), supra, 488 F. Supp. at 222. By requiring the physician to confront the woman with a choice on the method of disposal, the state suggests to the woman that it equates abortion with the taking of a human life. Such a suggestion can only serve to increase the woman's feelings of guilt and impose a psychological burden on her. Id. at 223. This requirement thus penalizes those women who exercise their constitutional right in choosing abortion. See Memorial Hospital v. Maricopa County, 415 U.S. 250, 94 S. Ct. 1076, 39 L. Ed. 2d 306 (1974); Dunn v. Blumstein, 405 U.S. 330, 92 S. Ct. 995, 31 L. Ed. 2d 274 (1972); Shapiro v. Thompson, 394 U.S. 618, 89 S. Ct. 1322, 22 L. Ed. 2d 600 (1969). There is no conceivable justification for this requirement in terms of protecting maternal health.\n\nThe State argues that disposal choice information given after the abortion will not have a \"chilling effect\" on her decision to have that abortion. Further, the State contends that even if it did, the legitimate purpose of the State in protecting the First Amendment rights of those who do choose to bury or cremate their fetus outweigh the burden on women who choose not to do so. The Court is not persuaded by defendants' arguments. The fact that the woman would presumably hear this information after, and not before, the abortion, does not render this requirement any less offensive. The woman's privacy right encompasses the entire process surrounding the abortion. Whether she is psychologically harmed immediately before or after the abortion, a woman is no less penalized for having exercised her constitutional right to choose abortion.\n\nAdditionally, the statute, by requiring physicians to give all abortion patients this information, intrudes into the doctor-patient relationship. The intrusion is not minor but goes directly to the core of the physician's relationship with the patient. The statute \"straightjackets\" the physician into a course of behavior which in his best medical judgment may not be the wisest course of behavior with respect to a particular patient. Testimony at the trial established that many women would find the disposal information required to be disclosed under the statute psychologically and emotionally disturbing. The statute, in the extreme case, would require the disclosure to be made even if the physician knows it would be emotionally detrimental to his patient. Thus, not only does the statute impinge upon the woman's right to receive information in an unbiased and neutral manner, but it also does not allow doctors discretion in individual instances.\n\nFor these reasons, the Court concludes that the disposal statute unreasonably places \"obstacles in the path of the doctor upon whom [the woman is] entitled to rely for advice in connection with her decision.\" City of Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983), (citing Whalen v. Roe, 429 U.S. 589, 604 n. 33, 97 S. Ct. 869, 878-79 n. 33, 51 L. Ed. 2d 64 (1977)).\n\nThe Court has concluded that La.Rev.Stat.Ann. § 40:1299.35.14 (West Supp.1981) constitutes a direct burden on the abortion right. Accordingly, the State must demonstrate a compelling state interest which justifies that statute. Roe, supra, 410 U.S. at 155, 93 S. Ct., at 728; Scheinberg, supra, 659 F.2d, at 482. In support of La.Rev.Stat.Ann. § 40:1299.35.14, Louisiana argues that the provisions of the Act relative to the disposal of fetal remains is a legitimate exercise of state regulatory power and furthers the state interests of providing for sanitary disposal thereof. In addition, the State argues that the provisions of the statute relating to the requirement that the patient be informed of certain options respecting the disposal of the fetus are consistent with the physician's obligation to respect the wishes of the patient as to the disposal of the fetus. The Court finds that these state interests are not compelling enough to justify the direct burdens on the abortion right imposed by La.Rev.Stat.Ann. § 40:1299.35.14.\n\nIn sum, the Court concludes that the burdens imposed by La.Rev.Stat.Ann. § 40:1299.35.14 are not outweighed by any compelling state interest and are thus invalid. Roe v. Wade, 410 U.S. 113, 93 S. Ct. 705, 35 L. Ed. 2d 147 (1973). Indeed, the Court finds that the requirement embodied in paragraph (C) of La.Rev.Stat.Ann. § 40:1299.35.14 furthers no state interest whatsoever. Women who desire the burial or cremation of fetal remains may request such disposal if they so choose. The sole purpose of this statute is to deter women from obtaining abortions by equating the fetus to a human life thereby making the abortion decision psychologically more disturbing. Accordingly, it is this Court's holding that La.Rev.Stat.Ann. § 40:1299.35.14 is unconstitutional.\n\nExperimentation\n\nLa.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" forbids experimentation, except for therapeutic purposes, \"on an unborn child or on a child born as a result of an abortion,\" whether the unborn child (fetus) or child is aborted alive or dead.\n\nThe predecessor to La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) reads as follows: \"No person shall experiment upon or sell a live or unborn child unless such experimentation is therapeutic to the child or unborn child\" (emphasis added). The former section was upheld as constitutional by this Court in Margaret S (I), supra, 488 F. Supp. at 221. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" Unlike its predecessor, the new statute prohibits \"experimentation on a child born as a result of an abortion, whether the child is alive or dead. . . .\" (emphasis added) La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981). Plaintiffs argue that this new clause endows the statute with constitutional infirmities which did not exist in the predecessor statute.\n\nPlaintiffs contend that this statute unconstitutionally burdens plaintiffs' right to choose an abortion in that fetal \"experimentation\" is only permitted if it is \"therapeutic to the unborn child or child.\" Procedures involving fetal tissue which may be considered \"experimentation\" and which are therapeutic to a pregnant woman are prohibited. Thus, plaintiffs argue that the statute unconstitutionally burdens the abortion right because while it purports to merely regulate abortion, it actually prohibits procedures which are \"necessary to preserve the life or health of the mother.\" Roe v. Wade, 410 U.S. 113, 163, 93 S. Ct. 705, 731, 35 L. Ed. 2d 147 (1973); Margaret S (I), supra, 488 F. Supp. at 200. Plaintiffs argue that the statute will deter women from having abortions, in that the performance of the abortion will in and of itself render illegal post-abortion procedures which may be helpful to the mother in determining the likelihood of success in future pregnancies.\n\nSecond, plaintiffs argue that the statute unconstitutionally burdens a doctor's right to do medical research. Plaintiffs argue that since the statute includes a prohibition against experimentation on fetal tissue as well as in utero fetuses, that it will have the disastrous effect of preventing scientific research.\n\nFinally, plaintiffs argue that the new clause renders the statute unconstitutionally vague. In this regard, plaintiffs contend that the phrase \"dead or alive child born as a result of an abortion\" is ambiguous in that it is unclear as to exactly what is included in the category of a dead or alive child born as a result of an abortion.\n\nDefendants maintain that all of the issues raised by plaintiffs in their challenge to La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) were disposed of by this Court's ruling in Margaret S. (I), supra. In this regard, defendants argue that the addition of a clause banning experimentation on dead fetuses does not change the constitutional ramifications of the Court's Opinion in Margaret S (I), supra. Accordingly, defendants contend that plaintiffs' arguments regarding the constitutionality of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) are meritless. Finally, defendants argue that as long as testing is not prohibited by the Court's interpretation of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981), plaintiffs have not demonstrated standing to sue on behalf of anyone interested in experimentation. The Court does not agree with defendants' position.\n\nThe challenge by plaintiffs to La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981), which prohibits experimentation on, inter alia, a dead, aborted fetus, presents questions of law which were not resolved by this Court's ruling in Margaret S (I), supra. The Court interpreted the statute at issue in that case to concern only fetuses in utero. Margaret S (I), supra, 488 F. Supp. at 220, n. 123. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" The statute has since been amended to include a fetus \"whether alive or dead.\" In addition, the plaintiffs in Margaret S (I), supra, presented no evidence that the prior version of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) imposed a significant burden on any fundamental right. Such evidence has been introduced in the case now before the Court, thus distinguishing it both from Margaret S (I), supra, and from Wynn v. Scott, 449 F. Supp. 1302, 1322 (N.D.Ill.1978), aff'd on other grounds sub. nom., Wynn v. Carey, 599 F.2d 193 (7th Cir.1979).\n\nThe standard for review of state laws which burden reproductive choices is not limited to abortion decisions per se but extends to both childbirth and contraception. \"The decision whether or not to beget or bear a child is at the very heart of this cluster of constitutionally protected choices recognized as the right of privacy.\" Carey v. Population Services International, 431 U.S. 678, 685, 97 S. Ct. 2010, 2016, 52 L. Ed. 2d 675 (1977). The prohibition in La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) of the use of fetal tissue for experimental purposes violates the fundamental right of women in Louisiana to make reproductive choices. The Court finds that this statute unduly limits the medical information obtainable through experimentation in that it deprives women of information concerning the likelihood of fetal deformity in their future pregnancies. Such experimentation which might be therapeutic to the woman would be prohibited by La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) because it would not be therapeutic to the aborted, dead fetus. The right of women to make reproductive choices free of undue burdens imposed by the state is further violated by La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) in that the information needed to improve the accuracy and reliability of amniocentesis and other pre-natal diagnostic methods is dependent on the use of aborted fetal tissue for experimentation. The prohibition of such experimentation therefore directly burdens the exercise of fundamental rights by women and their physicians in Louisiana.\n\nThe Court also concludes that enforcement of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) would substantially burden the right of women in Louisiana to choose specifically to terminate their pregnancies. The prohibition on experimentation involving aborted fetal tissue is likely to impede the thorough, complete pathological examination of such tissue, thereby potentially endangering the health of women who choose abortion. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" The Court finds that this statute, which carries substantial criminal penalties, \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" would cause pathologists to refrain from using experimental procedures to diagnose possible infections or illnesses in women who have undergone abortions. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" The denial of such health care for women having abortions is a significant burden on their right to chose to terminate their pregnancies. Therefore, La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) must be stricken as to first trimester abortions. In reaching this determination, the Court notes that it found the testimony of Dr. William Sternberg particularly instructive. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\"\n\nThe Court further concludes that La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) does not serve the state's legitimate interest during the second trimester of protecting the pregnant woman's health. Accordingly, La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) must be stricken to the extent that it regulates second trimester abortions.\n\nDefendants challenge plaintiffs' standing to sue on behalf of anyone interested in experimentation. The plaintiffs' class includes the class of physicians who desire or may desire to give full, safe, adequate and responsible medical advice and treatment to their patients, including the performance of abortions, but who have been or will be prevented from so doing by operation of the challenged sections and by defendants' actions thereunder. Margaret S (I), supra, 488 F. Supp. at 186 n.2. Said physician class has standing to challenge the constitutionality of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981), Doe v. Bolton, 410 U.S. 179, 93 S. Ct. 739, 35 L. Ed. 2d 201 (1973); Planned Parenthood Assn. v. Danforth, 428 U.S. 52, 96 S. Ct. 2831, 49 L. Ed. 2d 788 (1976); Margaret S (I), supra, 488 F. Supp. at 187-88. In Wynn v. Scott, 449 F. Supp. 1302 (N.D.Ill.1978), the Court found that although plaintiff doctors who performed abortions had standing to challenge a ban on fetal research, id. at 1309, they lacked standing to assert the claims of medical researchers. Id. at 1322. The present case involves a ban on fetal research, and the Court finds that the physician class has standing to challenge such a ban. Moreover, in the instant case, the class certified includes doctors in Louisiana, some of whom have engaged in medical and/or fetal research. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\"\n\nThe prevention of fetal research by Louisiana doctors, including members of the plaintiff class, which would result from enforcement of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) is not justified by any legitimate state interest furthered by the statute. The right of physicians to engage in their profession, although not recognized as a fundamental right, nonetheless is entitled under the Constitution to protection from arbitrary infringement. The Court in Meyer v. Nebraska, 262 U.S. 390, 399, 43 S. Ct. 625, 626, 67 L. Ed. 1042 (1923) defined \"liberty\" to include \"the right to engage in any of the common occupations of life.\" A state law will not be permitted to deny a person the right to pursue his occupation (including the physician class in this case) unless it is rationally related to the achievement of a legitimate state interest. Kelley v. Johnson, 425 U.S. 238, 247, 96 S. Ct. 1440, 1445, 47 L. Ed. 2d 708 (1976); Weber v. Aetna Casualty \u0026 Surety Co., 406 U.S. 164, 172-73, 92 S. Ct. 1400, 1405, 31 L. Ed. 2d 768 (1972). Neither the interest which was served by the prior version of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) nor the stated goal of the new statute, however, is furthered by La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) as amended. In Margaret S (I), supra, this Court upheld the constitutionality of a statute which prohibited experimentation on \"a live child or unborn child\", unless the experimentation was therapeutic. The ruling was based on the state's interest in protecting human life.\n\nStatutes regulating human experimentation and in utero fetal experimentation are a reasonable exercise of the state's police powers . . . It is rational for a state to act to protect the health and safety of its citizens.\n\n488 F. Supp. at 221. The section was rewritten after this decision, however, to expressly include the dead, aborted fetus within the scope of the statute. As it is challenged here, the new language of La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) does not further the legitimate interest which the Court identified in Margaret S (I), supra. The state's interest in protecting fetal life does not continue past the death of the fetus. Even if one assumes the validity of the legislative intent stated in the new statute, the rational basis test still is not satisfied. The 1981 law expresses the goal of treating the fetus as \"a human being\" . . . and as \"a legal person\" . . . from the time of conception. La.Rev.Stat.Ann. § 40:1299.35.0. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" The addition of the dead fetus to the scope of La.Rev.Stat.Ann. § 40:1399.35.13 (West Supp.1981), however, had the effect not of treating the fetus as a human being but of according greater protection to the dead fetus than to the deceased human being. There is no Louisiana law which prohibits experimentation on a deceased human being and, in fact, such experimentation is conducted during autopsies which are routinely performed in Louisiana. For example, the Louisiana Anatomical Gift Act, La.Rev.Stat.Ann. § 17:2351 ff., specifically permits the use of human tissue for the purpose of education, research or the advancement of science. La.Rev.Stat.Ann. § 17:2353. Under that statute, a mother could donate the body of her child to medical science for those purposes, but the criminal penalty imposed by La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) would effectively block the donation of a mass of aborted tissue. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" This statute draws a distinction between a dead fetus and a deceased human being. There is no rational basis to draw such a distinction.\n\nMoreover, the evidence establishes that there is no threat to public health from the use of aborted tissue in experimentation. Therefore, La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) is violative of the equal protection clause of the Fourteenth Amendment because it infringes on the rights of physicians to participate in fetal research without bearing a rational relationship to the achievement of a legitimate state interest.\n\nLastly, the imposition of a criminal penalty on conduct which cannot be distinguished from lawful conduct is a violation of the due process clause of the Fourteenth Amendment. If a statute \"fails to give a person of ordinary intelligence fair notice that his contemplated conduct is forbidden by the statute,\" the law is void for vagueness. Colautti v. Franklin, 439 U.S. 379, 390, 99 S. Ct. 675, 683, 58 L. Ed. 2d 596 (1979), quoting United States v. Harriss, 347 U.S. 612, 617, 74 S. Ct. 808, 811, 98 L. Ed. 989 (1954). The term \"unborn child\" as used in La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) is unconstitutionally vague because it is impossible for a pathologist or other physician to distinguish or separate fetal tissue from maternal tissue in the handling and treatment of tissue which is the result of abortion. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" The term \"born as a result of abortion\" as used in La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) is unconstitutionally vague because it is impossible for a pathologist or other physician to distinguish tissue which is the product of an induced abortion from that which is the product of a spontaneous abortion. Thus, La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) must be declared void for vagueness.\n\nAccordingly, and for the reasons outlined above, the Court concludes that La.Rev.Stat.Ann. § 40:1299.35.13 (West Supp.1981) is unconstitutional.\n\nFor reasons stated above, certain provisions of La.Rev.Stat.Ann. § 40:1299.35.1, et seq. (West Supp.1981) have been held unconstitutional. Therefore, the Court will enter an order striking the following Sections:\n\n(1) La.Rev.Stat.Ann. § 40:1299.35(2)B;\n\n(2) La.Rev.Stat.Ann. § 40:1299.35.3;\n\n(3) La.Rev.Stat.Ann. § 40:1299.35.6(B), insofar as it requires physicians to personally perform counseling duties;\n\n(4) La.Rev.Stat.Ann. § 40:1299.35.6(B)(3) and (4);\n\n(5) La.Rev.Stat.Ann. § 40:1299.35.13; and\n\n(6) La.Rev.Stat.Ann. § 40:1299.35.14.\n\n\u003cspan class=\"fn\"\u003e1. The expression of legislative will is relevant to a determination of constitutionality. See Arlington Heights v. Metropolitan Dev. Corp., 429 U.S. 252, 97 S. Ct. 555, 50 L. Ed. 2d 450 (1977); Weinberger v. Wiesenfeld, 420 U.S. 636, 95 S. Ct. 1225, 43 L. Ed. 2d 514 (1975); United States Dep't of Agriculture v. Moreno, 413 U.S. 528, 93 S. Ct. 2821, 37 L. Ed. 2d 782 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. This section provides: B. In order to preserve the health of the mother by insuring the use of the method of abortion most likely to preserve the health of the mother and to enable the physician to exercise his best medical judgment, each physician who performs or induces any abortion at any time during pregnancy shall perform an ultra-sound test in order to facilitate the determination of the state of development of the unborn child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Currently, the prevailing rate for a first trimester abortion in Louisiana is approximately $175.00. The cost of a second trimester abortion is approximately $350.00.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This figure represents the percentage of need met for abortions to Louisiana residents in 1980, per 100 resident women expected to need abortion services in 1978. The source of this information is the Alan Guttmacher Institute of health institutions and private physicians providing abortion services in the United States. This information is scheduled for publication in the institute's Abortion Provider Survey. See Plaintiffs' Exhibit #4a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Approximately 60 percent of all abortions in Louisiana are performed prior to the eighth week of pregnancy. About 22 percent of all abortions in Louisiana are performed during the ninth and tenth week of pregnancy. Only 6.7 percent of all abortions in Louisiana are performed in the second trimester. See Plaintiffs' Exhibit #4d.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This accuracy rate represents the highest quality of ultra-sound testing and evaluation within the medical profession. The accuracy of an ultra-sound measurement is affected by several factors, including the experience and skill level of the person performing the test and of the person interpreting the results, as well as by the positioning of the fetus in the uterus, and the kind and condition of the equipment being used. Expert testimony revealed that since most physicians in Louisiana are inexperienced in ultra-sound testing, they are unlikely to achieve this level of accuracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Expert testimony indicated that ultra-sound testing is medically more useful in the treatment and care of pregnant women who choose to carry their pregnancies to term. Even in these cases, however, it is not accepted medical practice to require ultra-sound testing in every case. Rather, the test is performed by a radiologist at the request of the treating physician, who presents the radiologist with a specific question about the patient that can be answered by an ultra-sound examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This section provides: no physician shall perform or induce an abortion upon any pregnant woman who is under the age of eighteen years and who is not emancipated judicially or by marriage unless the physician has received one of the following documents: (1) A notarized statement signed by the mother, father, legal guardian, or tutor of the minor declaring that the affiant has been informed that the minor intends to seek an abortion and that the affiant consents to the abortion. (2) A court order as provided in Subsection B of this Section. B. The following provisions shall apply to all applications for court orders by minors seeking abortions and appeals from denials of applications: (1) Jurisdiction to hear applications shall be in the court having juvenile jurisdiction in the parish where the abortion is to be performed or the parish in which the minor is domiciled. (2) Each clerk of each court which has jurisdiction to hear such applications shall prepare application forms in clear and concise language which shall provide step by step instructions for filling out and filing the application forms. All application forms shall be submitted to the attorney general for his approval. Each clerk shall assist each minor who requests assistance in filling out or filing the application forms. (3) Each application shall be heard in chambers, confidentially, in a summary manner, and within forty-eight hours of the filing thereof. (4) If the court finds that the minor is sufficiently mature and well enough informed to make the decision concerning the abortion on her own, the court shall issue an order authorizing the minor to act on the matter without parental consultation or consent. (5) If the court finds that the minor is not competent to make the decision concerning the abortion on her own, but finds that the abortion nevertheless would be in the best interest of the minor, the court shall issue an order authorizing the abortion. (6) Appeals from decisions of the court hearing the application shall be by trial de novo in the court of appeal. (7) Each clerk of each court of appeal shall prepare appeal forms in clear and concise language which shall provide step by step instructions for filling out and filing the appeal forms. All appeal forms shall be submitted to the attorney general for his approval. Each clerk shall assist each minor who requests assistance in filling out or filing the appeal forms. (8) Each appeal shall be heard in chambers, confidentially, in a summary manner, and within forty-eight hours of the filing thereof. (9) The decision of the court of appeal shall be based on the criteria provided in Paragraphs (4) and (5) of this Subsection. (10) Each minor who declares to the clerk of the court hearing the application or appeal that she does not have sufficient funds to pay for the costs of the application or the appeal shall be allowed to proceed in forma pauperis. (11) Each minor who files an application or an appeal shall be entitled to a hearing and a determination by the court independently of any notice to or consultation with her parents, tutor or guardian. (12) Except as otherwise provided in this Section, or as otherwise provided by rule of court, hearings of applications and appeals shall be conducted in accordance with the provisions of the Louisiana Code of Juvenile Procedure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. On December 9, 1981, the plaintiffs sought an injunction from the Fifth Circuit Court of Appeals pending an appeal of the Court's ruling on this issue. This petition was subsequently denied. See No. 81-3750.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. This Court recognized in Margaret S (I), as did the Supreme Court in Planned Parenthood of Central Mo. v. Danforth, 428 U.S. 52, 74, 96 S. Ct. 2831, 2843, 49 L. Ed. 2d 788 (1976), that \"the State has somewhat broader authority to regulate the activities of children than of adults.\" 488 F. Supp. at 202.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. La.Rev.Stat.Ann. § 40:1299.35.3 (West Supp.1981) provides: no abortion performed or induced after the first trimester of pregnancy shall be performed or induced except in a hospital licensed under the provisions of R.S. 40:2100, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Court noted that there are \"severe limitations on the availability of post-first trimester abortions in Louisiana\" and that there were \"no Louisiana hospitals performing abortions after the first trimester.\" Thus, the Court concluded that the second trimester hospitalization requirement would \"effectively halt the performance of post-first trimester abortions in Louisiana.\" Margaret S. (I), supra, 488 F. Supp. at 192. More recent statistics indicate that the situation has not improved. In 1977, only one hospital in Louisiana, located in the New Orleans Metropolitan area, provided abortion services. See Plaintiffs' Exhibit #2, Abortion: Need, Services and Policies -- Louisiana, the Alan Guttmacher Institute, New York 1979.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Camenish involved a challenge against the University of Texas by a deaf graduate student under a federal statute prohibiting discrimination against handicapped persons. The district court granted a preliminary injunction, concluding that the balance of hardships weighed in favor of the student, and that he was likely to prevail on the merits. The Court determined that the district court properly based its decision not on the ultimate merits, but rather on the balance of hardships.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Gary-Northwest began in 1974 as a challenge to an Indiana abortion-restrictive statute requiring, among other things, parental consent for minors desiring abortions, and the second trimester hospitalization requirement. A three-judge court in 1975 granted a preliminary injunction against the parental consent requirement. Gary-Northwest Ind. Women's Services, Inc. v. Bowen, 418 F. Supp. 9 (N.D.Ind.1976). No parties appealed the preliminary injunction rulings. In 1976, the three-judge court permanently enjoined enforcement of the parental consent provision, but remained silent on the still-pending challenge to the hospitalization requirement. Gary-Northwest Ind. Women's Services, Inc. Bowen, 421 F. Supp. 734 (N.D.Ind.1976). The Attorney General of Indiana appealed the parental consent issue to the Supreme Court, which summarily affirmed in 1977. Bowen v. Gary-Northwest Ind. Women's Services, Inc., 429 U.S. 1067, 97 S. Ct. 799, 50 L. Ed. 2d 785 (1977) (per curiam), relief den. 496 F. Supp. 894 (N.D.Ind. 1980). Judgment aff'd 451 U.S. 934, 101 S. Ct. 2012, 68 L. Ed. 2d 321 (1981). In 1980, the plaintiffs filed a supplemental petition for preliminary and permanent injunctive relief. One judge from the original panel heard arguments and evidence on the petition which resulted in the decision reported at 496 F. Supp. 894.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. This section provides: B. In order to insure that the pregnant woman is able to give her informed consent, the attending physician, prior to performing or inducing the abortion, shall orally inform the pregnant woman of the facts set forth in this Subsection and shall require the signature of the woman on a consent form wherein she acknowledges that she has been informed: (1) That, according to the best judgment of the attending physician, she is pregnant. (2) Of the number of weeks which have elapsed from the probable time of the conception of the unborn child, based on the information provided by her as to the time of her last menstrual period or based upon a history, physical examination, and appropriate laboratory tests. (3) Of the anatomical and physiological development of the particular unborn child at the time the abortion is to be performed or induced, according to the best medical judgment of the attending physician. (4) That the unborn child is viable, or not viable, according to the best medical judgment of the attending physician. (5) Of the type of method or technique which will be utilized in the abortion, the means of effectuating the method or technique, and the medical risks and consequences of the method or technique to be utilized. (6) That numerous public and private agencies and services are available to assist her during pregnancy and after the birth of her child, if she chooses not to have the abortion, whether she wishes to keep her child or place him or her for adoption, and that her physician will provide her with a list of such agencies and services. (7) That locations of public mental health agencies shall be available to the patient if and when post-partum psychological damage requires professional attention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The evidence adduced at trial established that the physician counseling requirement would consume an additional twenty to thirty minutes of a physician's time, and that, even if patients were counseled in groups, the attending physician would nevertheless be required to devote a significant amount of time to counseling patients. In reaching this determination, the Court notes that it found the testimony of Drs. Cottle, Oakes and Jackson particularly instructive on this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See n. 4, supra, and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In Women's Medical Center of Providence, Inc. v. Roberts, 530 F. Supp. 1136, 1148 (D.R.I.1982), the Court recognized a \"national trend\" toward the use of trained counselors in the abortion procedure \"developed in response to a national desire to lower the cost of medical care and to offset a national shortage of doctors, and in recognition of the fact that doctors often are not the best people to perform this function.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The testimony revealed that clinic counselors have varying educational backgrounds. While some have only completed high school, most have college degrees. All counselors have received special training for counseling abortion patients. This training consists of on-the-job training by more experienced counselors, instruction in the medical aspects of the abortion procedure, observance of the procedure, and instruction from clinic physicians. Registered nurses supervise the training of counselors. Ultimately, however, clinic physicians are responsible for the content of the information provided to patients.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Cf. Planned Parenthood League of Mass. v. Bellotti, 641 F.2d 1006, 1017 (1st Cir.1981), where the court upheld the use of a consent form in the informed consent process, in part because the statute did not require the attending physician to personally conduct the informed consent dialogue. See also Charles v. Carey, supra, at 784, where the court held that in the absence of any justification for the physician counseling requirement, the plaintiffs were entitled to a preliminary injunction against the operation of the statute. But see Planned Parenthood Ass'n of Kansas City, Mo. v. Ashcroft, 462 U.S. 476, 103 S. Ct. 2517, 76 L. Ed. 2d 733 (1983). In affirming the district court's holding that a statute requiring the attending physician to inform the pregnant woman of risks associated with the abortion procedure and alternatives to abortion, the Court held that \"this minimal requirement is consistent with the principle that the abortion decision is one to be made by a woman and her physician, and advances the state's interest in insuring that the decision is made with \"full knowledge of its nature and consequences.\" Planned Parenthood v. Danforth, 428 U.S. at 67, 96 S. Ct. at 2840. (Footnote and citations omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In Roe v. Wade, 410 U.S. 113, 159, 93 S. Ct. 705, 729, 35 L. Ed. 2d 147 (1973), the Supreme Court stated that \"the word 'person, ' as used in the Fourteenth Amendment, does not include the unborn.\" (footnote omitted). In Poe v. Gerstein, 517 F.2d 787, 796 (5th Cir.1975), aff'd sub. nom. mem., Gerstein v. Coe, 428 U.S. 901, 96 S. Ct. 3202, 49 L. Ed. 2d 1205 (1976), the court concluded that \"since the fetus is not a person, [citations omitted] neither is it a 'child. '\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Accord, Planned Parenthood Ass'n of Kansas City, Mo. v. Ashcroft, supra, 483 F. Supp. at 698, where the court stated that \"it is evident that [many] physicians, in the exercise of their best medical judgment, would choose not to provide their patients seeking abortions with a detailed anatomical description of the fetus.\" In Leigh v. Olson, 497 F. Supp. 1340, 1345 (D.N.D.1980), the court concluded that such information \"may have an adverse medical effect on the patient.\" Cf. Akron Center for Reproductive Health, Inc. v. City of Akron, 479 F. Supp. 1172, 1203 (N.D. Ohio 1979), aff'd in relevant part, 651 F.2d 1198 (6th Cir.1981), 462 U.S. 416, 103 S. Ct. 2481, 76 L. Ed. 2d 687 (1983), in which the court held that \"the state cannot . . . specify what each [abortion] patient must be told.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See n.5, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Expert testimony indicated that viability is not a serious possibility until the 24th gestational week of pregnancy. In Roe v. Wade, 410 U.S. at 160, 93 S. Ct. at 730, the Court stated \"viability is usually placed at about seven months (28 weeks) but may occur earlier, even at 24 weeks.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. La.Rev.Stat.Ann. § 40:1299.35.12 provides: The provisions of R.S. 40:1299.35.5 and R.S. 40:1299.35.6 shall not apply when the pregnancy creates an emergency need for an abortion to be performed or induced because the continuation of the pregnancy poses an immediate threat and grave risk to the life or permanent physical health of the pregnant woman. The attending physician shall certify to the emergency need for the abortion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. La.Rev.Stat.Ann. 40:1299.35.14 provides: A. Each physician who performs or induces an abortion which does not result in a live birth shall insure that the remains of the child are disposed of in accordance with rules and regulations which shall be adopted by the Department of Health and Human Resources. B. The provisions of this Section shall not apply to, and shall not preclude, instances in which the remains of the child are provided for in accordance with the provisions of R.S. 8:651 et seq. C. The attending physician shall inform each woman upon whom he performs or induces an abortion of the provisions of this Section within twenty-four hours after the abortion is performed or induced. La.Rev.Stat.Ann. 8:651 provides: Except in cases of lawful dissection of where a dead body shall rightfully be carried through or removed from the state for the purposes of interment or cremation elsewhere, every dead body of a human being lying within this state, and the remains of any dissected body, after dissection, shall be decently interred or cremated within a reasonable time after death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Should the statute not be interpreted in such a way as to allow the provisions of paragraph (B) and La.Rev.Stat.Ann. 8:651, et seq. to apply only when the woman so requests, this newly-enacted statute would present the identical problems posed by the predecessor statute, Margaret S. v. Edwards, 488 F. Supp. at 221-223, and would also be unconstitutionally vague.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. As in the old statute, newly enacted La.Rev.Stat.Ann. § 40:1299.35.14 uses \"language equating fetal remains with human remains,\" Margaret S. (I), supra, 488 F. Supp. 181. For example, the new statute uses the phrase \"the remains of the child,\" in referring to the disposal issue. La.Rev.Stat.Ann. § 40:1299.35.14(A) and (B) (West Supp.1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This section provides: \"No person shall experiment on an unborn child or child born as a result of abortion, whether the unborn child or child is alive or dead unless the experimentation is therapeutic to the unborn child or child.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Specifically, the Court stated: \"The Court holds that La.Rev.Stat.Ann. § 40:1299.35.13 [West Supp.1979] is rationally related to the promotion of a legitimate state interest, and La.Rev.Stat.Ann. § 40:1299.35.13 is therefore constitutional.\" Margaret S (I), supra, at 221.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See also Wolfe v. Schroering, 388 F. Supp. 631, 638 (W.D.Ky.1974) aff'd in part, rev'd in part, 541 F.2d 523 (6th Cir.1976) (law prohibiting experimentation on a \"viable aborted child\" held to be constitutional) and Utah Crim.Code Ann. Section 76-7-310 (Smith 1977) (experimentation prohibited, except for genetic testing, on \"live unborn children\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Two other state laws banning fetal experimentation specifically provide for pathological examinations. Ind.Code Ann. § 35-1-58, 5-6 (Burns 1979); Ill.Ann.Stat. Ch. 38, § 81-32 (Smith-Hurd Supp.1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. La.Rev.Stat.Ann. § 40:1299.35.18 outlines the penalties for violation of § 40:1299.35, et seq. It reads as follows: \"whoever violates the provisions of this part shall be fined not more than one thousand dollars, or imprisoned for not more than two years or both.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The Court makes this finding regarding the prohibition on experimentation, notwithstanding an interpretation of La.Rev.Stat.Ann. § 40:1299.35.13, which allows testing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Dr. William Sternberg is a professor of clinical pathology and is a member of the faculty of Tulane Medical School. At trial, he was qualified as an expert on pathology and genetics. Dr. Sternberg testified that in his opinion, La.Rev.Stat.Ann. § 40:1299.35.13 was so vague as to preclude testing for pathological or genetic purposes. Dr. Sternberg also stated that it is impossible to distinguish between the tissue of a pregnant woman and the \"unborn child.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The evidence adduced at trial indicated that members of the certified class have engaged in medical research as well as fetal research.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. La.Rev.Stat.Ann. § 40:1299.35.0 states as follows: It is the intention of the Legislature of the State of Louisiana to regulate abortion to the extent permitted by the decisions of the United States Supreme Court. The Legislature does solemnly declare and find in reaffirmation of the longstanding policy of this State, that the unborn child is a human being from the time of conception and is, therefore, a legal person for purposes of the unborn child's right to life and is entitled to the right to life from conception under the laws and Constitution of this State. Further, the Legislature finds and declares that the longstanding policy of this State is to protect the right to life of the unborn child from conception by prohibiting abortion impermissible only because of the decision of the United States Supreme Court and that, therefore, if those decisions of the United States Supreme Court are ever reversed or modified or the United States Constitution is amended to allow protection of the unborn then the former policy of this State to prohibit abortions shall be enforced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The Court notes that South Dakota law allows experimentation on fetuses, apparently both in utero and ex utero, if the pregnant woman consents. S.D. Compiled Laws Ann. Section 34-23A-17 (Smith Supp.1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See n. 35, supra, and accompanying text.\u003c/span\u003e\n\n",
    "body_length": 145336,
    "citedas": [
      "597 F. Supp. 636"
    ],
    "attorneys": "Suzanne Lynn, Nan Hunter, Jane Johnson, Wendy Wells, New York, New York, for Plaintiffs. , Thomas A. Rayer, Dept of Justice, Patricia Bowers, Asst. Atty. Gen., New Orleans, Louisiana, for Defendants. Robert F. Collins, District Judge.",
    "category": [
      "36",
      "75"
    ],
    "judges": "ROBERT F. COLLINS, District Judge.",
    "citation_count": 0
  }
}
