{
  "id": "Wa4WS2YBTlTomsSBVGdR",
  "document": {
    "title": "12/19/85 STATE IDAHO v. KARLA YVONNE WINDSOR",
    "full_title": "STATE OF IDAHO v. KARLA YVONNE WINDSOR",
    "jurisdiction": "Idaho Supreme Court",
    "date": "1985-12-19T00:00:00.000Z",
    "docket": "No. 15486",
    "body": "Appellant Karla Windsor appeals from her conviction for first degree murder and from the imposition of the death penalty therefor.\n\nOn September 7, 1983, Sterling Grammer was stabbed to death in his Caldwell home. On September 10, 1983, Karla Windsor and Donald Fetterly were observed driving a vehicle registered to Grammer. They were subsequently arrested and charged with first degree murder, burglary, grand theft and the use of a deadly weapon in connection with Grammer's death.\n\nThe record reveals that Windsor and Fetterly had become acquainted with Grammer several weeks prior to his death. Grammer was dating Fetterly's ex-mother-in-law, Viola Hogan, and Windsor and Fetterly met Grammer through her.\n\nThe scenario that culminated in Grammer's death on Wednesday, September 7 began unfolding on Monday, September 5 when Windsor and Fetterly showed up at Grammer's home around dinner time. The pair had been living together for approximately six months at the time of Grammer's death. They were unemployed and had sold most of their possessions to raise money in order to travel to adjacent states in search of work. When they arrived at Grammer's doorstep on September 5, they were without money, a vehicle or a place to stay. Grammer invited them to stay for dinner and allowed them to spend the night in his extra room. Grammer woke them about 5:30 the next morning and they all left the house together.\n\nWindsor and Fetterly had been told that there were several warrants out for their arrest and they spent the day of September 6 walking around and trying to devise a plan to get themselves safely out of the state. During their visit with Grammer, they had observed that he owned two vehicles, a large television, and a diamond ring. Windsor testified that they decided to ask Grammer to loan them a vehicle. She further testified that, if he refused, they had decided to tie him up and rob him. She stated that they never intended to hurt Grammer, only to rob him.\n\nThe pair returned to Grammer's house that afternoon and waited for him to come home from work. When he did not arrive, they entered the house through a window and waited for him. Grammer did not come home until about 6:30 the following morning. Viola Hogan testified that he had spent the night at her home.\n\nWindsor testified that when Grammer arrived at home on Wednesday morning, she and Fetterly explained their situation and asked him to give them a vehicle and some money. When he refused, they decided to go ahead with the robbery. They had\n\nfound some duct tape in Grammer's bedroom which they used to bind his hands and feet. Windsor stated that Grammer agreed to let them tie him up and did not struggle. The autopsy, however, revealed an unexplained bruise to the back of Grammer's head. The state's medical expert testified that in his opinion a blow sufficient to have raised such a bruise would have rendered Grammer unconscious. From this, the state postulated that Windsor and Fetterly struck Grammer and that he was unconscious when they taped him.\n\nGrammer's face was also covered with duct tape. The state's expert testified, over objection, that the placement of the tape would have completely cut-off Grammer's air supply. Windsor testified that she taped Grammer's face and that his breathing was not affected.\n\nWindsor's version of the stabbing is substantially as follows: Grammer was taped up and left lying on his bed while Windsor and Fetterly determined which of his possessions to take. Grammer began to make a lot of noise. Afraid that he would alert the neighbors, Windsor and Fetterly ran into the bedroom and attempted to quiet him. Grammer began to thrash around on the bed. Fetterly grabbed him and tried to hold him still. Grammer then began kicking his legs and Windsor laid across them. At that point, Fetterly reached across the headboard and grabbed the knife they had used to cut the duct tape. He held the knife to Grammer's chest. When Grammer continued to struggle, Fetterly stabbed him several times in the chest. Windsor stated that the stabbing occurred so quickly that it was impossible for her to do anything to prevent it.\n\nGrammer's body was dumped in the Snake River where it was discovered by a pair of fishermen on September 9. The following day, a police officer observed Windsor and Fetterly driving around Caldwell in Grammer's pickup. They were stopped and taken to the Canyon County Sheriff's Office for questioning.\n\nWindsor was placed in an interrogation room and questioned by Detective Jim Hensen as to the whereabouts of the deceased's other vehicle. She was not given Miranda warnings prior to this questioning. Windsor's answers enabled the police to locate the vehicle.\n\nAfter Hensen had obtained the information about the vehicle, his supervisor, Richard Appleton, suggested Hensen leave the room as Windsor was becoming upset by what Appleton termed Hensen's \"firm attitude.\" Appleton then talked to Windsor in an attempt to calm her. He told her that if she was involved in anything it would be best if she told the truth. Windsor responded that she was not going to make any statement without Fetterly being present. Appleton had Fetterly brought into the room and, after talking together, Fetterly and Windsor agreed to make a joint statement. At that point, Appleton read them their Miranda rights. Both Windsor and Fetterly signed forms waiving those rights and proceeded to give a detailed confession. On the basis of that confession, they were indicted on charges of first degree murder, burglary, grand theft and the use of a deadly weapon in the commission of a felony.\n\nTrial was set for December 12, 1983. On November 21, 1983, the defense filed a motion for change of venue or, in the alternative, for selection of a jury from a county other than Canyon alleging that widespread pretrial publicity mandated such procedures. Both motions were denied without prejudice.\n\nSeveral other pretrial motions were made, including a motion to sever the trial of the two defendants and a motion to suppress the joint confession. Additionally, the public defender moved to sever Windsor's defense due to a conflict of interest. The court granted the motion to sever the trial, rescheduling Windsor's trial for February 13, 1984, and allowed withdrawal of counsel from Windsor's defense. The motion for suppression of the joint confession was denied.\n\nThe trial of co-defendant Donald Fetterly began on December 12, 1983 and concluded on December 15, 1983. The jury returned\n\na guilty verdict not only to first degree premeditated and deliberate murder, but to felony murder as well. Publicity regarding Fetterly's trial and conviction was extensive. As a result, Windsor renewed her motion for a change of venue. The trial court took the motion under advisement indicating that the matter of venue would not be decided until trial. Jury selection in Windsor's trial was commenced on February 13, 1984. Once the jury had been impanelled, the court denied Windsor's motion for change of venue without comment.\n\nOn February 16, 1984, the jury returned a verdict of guilty to the charges of grand theft, second degree burglary and first degree murder in the perpetration of a burglary. The verdict form for premeditated murder was returned unsigned. Windsor's motion to have an acquittal entered on that charge was denied.\n\nNotice of intent to seek the death penalty was filed on March 20, 1984. The court scheduled the matter for sentencing and ordered a presentence investigation. Alleging that the pre-sentence investigator interrogated Windsor regarding facts of the crimes charged in violation of her constitutional rights, the defense filed a motion to strike portions of the presentence report. The motion was denied. Prior to sentencing, Windsor moved for a formal sentencing hearing and for sentencing by jury. These motions were also denied and the hearing on aggravation and mitigation commenced on March 28, 1984. Following testimony and argument, the court determined that the aggravating circumstances outweighed the mitigating circumstances and the death penalty was imposed. The court also imposed a concurrent indeterminate five-year sentence for burglary and a concurrent indeterminate fourteen-year sentence for grand theft. A death warrant and findings were filed pursuant to I.C. § 19-2515.\n\nThereafter, Windsor filed a motion for reduction and correction of sentence. A hearing on that motion was held on November 14, 1984. At the hearing, Windsor objected to the fact that the prosecutor had filed a document with the court entitled \"Memorandum Regarding Aggravation/Mitigation Hearing of Karla Windsor\" without serving the defense with a copy. She also argued that the death penalty was disproportionate in her case. Windsor's motion was denied without any Discussion of her objection to the prosecutor's memorandum. Windsor appeals from the judgment of conviction for first degree murder and from the imposition of the death penalty.\n\nI.\n\nWindsor alleges that the totality of the circumstances surrounding the taking of the joint confession rendered it involuntary and therefore inadmissible. Although conceding that she was read her Miranda rights and that she signed a waiver of those rights prior to giving the confession, she nevertheless asserts that she was coerced into making a statement in violation of Miranda. See Miranda v. Arizona, 384 U.S. 436, 86 S.Ct. 1602, 16 L.Ed.2d 694 (1966). She contends that Officers Hensen and Appleton used a \"good cop/bad cop\" technique to psychologically pressure her into making a statement. She asserts that Officer Hensen assumed the role of \"bad cop\" badgering her to the point where she was visibly upset. Officer Appleton then intervened, she alleges, cajoling her into giving a confession which she would not otherwise have made.\n\nWindsor raised this same issue before the trial court when she moved to suppress the joint confession. The record from that hearing does reveal that Officer Hensen questioned Windsor prior to reading her her Miranda rights and that Windsor was upset by what Officer Appleton referred to as Hensen's \"firm attitude.\" However, the record also reveals that Hensen only questioned Windsor for a total period of approximately five minutes and that his questions were confined solely to ascertaining the location of Grammer's car. Windsor provided him with a phone number of the residence where the car was located and he\n\nleft the room. The joint confession was not taken until more than an hour later.\n\nAfter Hensen departed, Windsor asked to speak to Fetterly. The pair conferred for some time and then agreed to make a joint statement. At that point, they were read their Miranda rights. The confession which followed was not connected in any way to the initial questioning as to the location of the car.\n\nThe United States Supreme Court recently addressed this issue in Oregon v. Elstad, 470 U.S. 298, 105 S.Ct. 1285, 84 L.Ed.2d 222 (1985), holding that a suspect who has responded to unwarned, yet uncoerced, questioning is not thereby disabled from thereafter waiving his or her rights and confessing following proper Miranda warnings.\n\n\"Far from establishing a rigid rule, we direct courts to avoid one; there is no warrant for presuming coercive effect where the suspect's initial inculpatory statement, though technically in violation of Miranda, was voluntary. (Footnote omitted.) The relevant inquiry is whether, in fact, the second statement was also voluntarily made. As in any such inquiry, the finder of fact must examine surrounding circumstances and the entire course of police conduct with respect to the suspect in evaluating the voluntariness of his statements. The fact that a suspect chooses to speak after being informed of his rights is, of course, highly probative. . . . We hold today that a suspect who has once responded to unwarned yet uncoercive questioning is not thereby disabled from waiving his rights and confessing after he has been given the requisite Miranda warnings.\" Id. at , 105 S.Ct. at 1298.\n\nAfter hearing testimony and argument on this issue, the trial Judge concluded that\n\n\"when Mr. Hensen inquired about the automobile and was given a telephone number, nothing transpired there that was brought back to the Defendants that might cause them to be coerced or pushed into a confession. . . . [I]t is clear to the Court, at least as to Mr. Appleton's interview, that the Miranda warnings were given in detail, and each paragraph was read, and a response was given back by the Defendants that they understood that right and that they waived the same, both being present and having had the benefit of conferring with each other and talking with each other as to whether they wanted to make that confession. . . . I think that the record is void of any psychological pressure brought to bear upon the Defendants. . . . There is just no indication at all at this point that they were pressured or coerced in any way.\"\n\nWe have carefully examined the record and we agree with the trial Judge that it does not appear that Windsor was coerced into giving a statement. After examining the totality of the circumstances surrounding the making of the joint confession, we conclude that sufficient evidence was introduced to permit the trial court to conclude that the confession was voluntarily made and therefore admissible.\n\nII.\n\nWindsor contends that the trial court abused its discretion in denying her motion for a change of venue. She maintains that the extensive pretrial publicity coupled with the widespread media coverage of the trial and conviction of her co-defendant, Donald Fetterly, deprived her of the opportunity to be tried before an impartial jury.\n\nThe decision as to whether or not to grant a motion for change of venue lies within the discretion of the trial court. State v. Thomas, 94 Idaho 430, 432, 489 P.2d 1310, 1312 (1971). \"[W]here it appears that the defendant actually received a fair trial and that there was no difficulty experienced in selecting a jury, refusal to grant a change of venue is not a ground for reversal.\" Id.\n\nThe evidence in the record before us leads us to conclude that Windsor received a fair trial by an impartial jury. Despite the widespread publicity surrounding this\n\ncase, a jury was selected from Canyon County with relative ease. From their answers to preliminary questions by the court, it appears that most of the jury panel was largely unfamiliar with the facts of this case. In individual questioning, most of the jurors indicated that any recall they did have was very vague. Only two prospective jurors were disqualified because of bias they had developed due to media coverage. Of the twelve jurors and two alternates selected, none had more than a hazy recollection of the circumstances surrounding the killing. None of these jurors were challenged for cause. In addition, we note that defense counsel did not exercise all of her peremptory challenges. All of the jurors who were finally selected stated they had formed no opinion, and could set aside anything they had heard and base their verdict only on the evidence at trial.\n\nConsidering the record as a whole, including the transcript of the voir dire examination, it appears that there was no difficulty in selecting the jury, and that the defendant received a fair trial. We conclude that the trial court did not abuse its discretion in denying Windsor's motion for change of venue.\n\nIII.\n\nWindsor next asserts that the trial court committed reversible error by admitting inflammatory testimony and photographs.\n\nAt trial, the state's pathologist, Dr. Dondelinger, was permitted to testify, over objection, that the manner in which the tape was affixed to the victim's face would have prevented any breathing. Windsor contends that such testimony served no probative function and that its admission could only have served to inflame the minds and passions of the jury against her.\n\nWhere allegedly inflammatory evidence is relevant and material to an issue of fact, the trial court must determine whether the evidence's probative value is outweighed by its possible prejudicial effect. State v. Wilson, 93 Idaho 194, 196-97, 457 P.2d 433, 435-36 (1969). The determination of whether or not to admit such evidence is within the sound discretion of the trial court and will not be disturbed on appeal absent an abuse of that discretion. State v. Abel, 104 Idaho 865, 870, 664 P.2d 772, 777 (1983).\n\nWhile we agree that the evidence was prejudicial, we do not agree that its admission was erroneous. As the trial Judge recognized in admitting the evidence, a jury is entitled to base its decision upon a full and complete description of the events surrounding the commission of a crime. State v. Izatt, 96 Idaho 667, 670, 534 P.2d 1107, 1110 (1975). Dr. Dondelinger's testimony was clearly relevant to provide a complete description of the crime and, because Windsor admitted that she did the taping, to show her state of mind and intent at the time of its commission. We conclude that the trial court did not abuse its discretion in admitting Dr. Dondelinger's testimony.\n\nWindsor also objects to the admission of photographs of the deceased's body. Photographs of the victim in a prosecution for homicide, duly verified and shown by extrinsic evidence to be faithful representations of the victim at the time in question are, in the discretion of the trial court, admissible in evidence as an aid to the jury in arriving at a fair understanding of the evidence. State v. Martinez, 92 Idaho 183, 188, 439 P.2d 691, 696, cert. denied, 393 U.S. 945, 89 S.Ct. 317, 21 L.Ed.2d 283 (1968). Having reviewed the photographs, we find no abuse of discretion in their admission.\n\nIV.\n\nWindsor claims that her state and federal constitutional rights to due process of law were violated because she was tried and convicted on a charge of which she had no notice. She argues that there was a variance between the information by which she was charged and the verdict by which she was convicted, and that the variance is fatal and mandates reversal of her conviction.\n\nWindsor was charged with first degree murder under Count I of the Information which read as follows:\n\n\"COUNT I\n\nThat DONALD KENNETH FETTERLY and KARLA YVONNE WINDSOR, on or about the 7th day of September, 1983, in the County of Canyon and State of Idaho, then and there being, did then and there wilfully, knowingly, intentionally, unlawfully, feloniously, with malice aforethought and premeditation, kill a human being, to wit: STERLING GENE GRAMMER, by then and there stabbing the said Sterling Gene Grammer in the chest with a knife, thereby mortally wounding said Sterling Gene Grammer, from which wounds said Sterling Gene Grammer died on or about the 7th day of September, 1983, in the County of Canyon, State of Idaho.\n\n\"All of which is contrary to Idaho Code Sections 18-4001 and 18-4003, and against the power, peace and dignity of the State of Idaho.\"\n\nThe jury was instructed that a verdict of first degree murder could be returned on one of two theories: (1) a wilful, deliberate and premeditated killing or (2) a murder committed in the perpetration or attempt to perpetrate a felony. The jury returned a verdict of \"guilty of the offense of First Degree Murder in perpetration of, or attempt to perpetrate, a burglary, as charged by Count I of the Information.\" The verdict form for wilful, deliberate and premeditated murder was returned unsigned. Windsor contends that the information charged her only with the crime of \"premeditated murder\" and that she was never charged with what she views as a separate and distinct crime \"first degree murder in the perpetration of or attempt to perpetrate a burglary.\" Therefore, she insists that the verdict is inconsistent and irreconcilable with the information, mandating reversal of her conviction.\n\nWe deem it unnecessary to address the question of whether a variance existed, for, even assuming, arguendo, that there was a variance between the crimes charged and the proof at trial, we conclude that under the facts of the present case such a variance was not fatal.\n\nThe sufficiency of an indictment or information ultimately depends on whether it fulfills the basic functions of the pleading instrument. In Hamling v. United States, 418 U.S. 87, 94 S.Ct. 2887, 41 L.Ed.2d 590 (1974), the United States Supreme Court, applying a functional analysis, set forth the following standard for testing the sufficiency of a pleading:\n\n\"Our prior cases indicate that an indictment is sufficient if it, first, contains the elements of the offense charged and fairly informs the defendant of the charges against which he must defend, and, second, enables him to plead an acquittal or conviction in bar of future prosecutions for the same offense.\" Id. at 117, 94 S.Ct. at 2907.\n\nSpecifically, then, regarding the issue of variance, a determination of whether a variance is fatal depends on whether or not the basic functions of the pleading requirement have been met. As stated by the United States Supreme Court in Berger v. United States, 295 U.S. 78, 82, 55 S.Ct. 629, 630, 79 L.Ed. 1314 (1935):\n\n\"The true inquiry . . . is not whether there has been a variance in proof, but whether there has been such a variance as to 'affect the substantial rights' of the accused. The general rule that allegations and proof must correspond is based upon the obvious requirements (1) that the accused shall be definitely informed as to the charges against him, so that he may be enabled to present his defense and not be taken by surprise by the evidence offered at the trial; and (2) that he may be protected against another prosecution for the same offense.\"\n\nThus, under the prevailing state standard, a variance is held to require reversal of the conviction only when it deprives the defendant of his right to fair notice or leaves\n\nhim open to the risk of double jeopardy.[Footnote 1] The notice element of the Berger standard requires courts to determine whether the record suggests the possibility that the defendant was misled or embarrassed in the preparation or presentation of his defense. Berger, supra at 82-84, 55 S.Ct. at 630-631.\n\nBased on the foregoing, it becomes clear that in the present case there was no fatal variance. There is no evidence in the record to suggest that the defendant was either misled or embarrassed at trial by the fact that the prosecution's theory of the case included a felony murder theory. It was clear from the very beginning of this case that the prosecution intended to proceed on both premeditated and deliberate, and felony murder theories. The record before us indicates that prior to trial the prosecution proposed a plea negotiation whereby Windsor would agree to plead guilty to both premeditated murder and felony murder in exchange for a sentence other than death. At the close of the trial, when the prosecution offered an instruction on felony murder, the defense objected only on the ground that the instruction did not properly define all of the necessary elements of the crime. It did not object on the grounds of surprise or variance. We conclude that the allegations of the information were sufficient to permit the jury to be instructed on a felony murder theory.\n\nV.\n\nAs mentioned above, Windsor maintains that the jury was erroneously instructed on the elements of felony murder. At trial, she requested an instruction to the effect that a burglary and a murder must be part of a continuous action closely related in time, place and causal relation before the murder can be found to be in the perpetration of the felony. It is Windsor's position that under the facts of the present case the burglary was completed long before the victim was murdered and, therefore, that it was error to instruct on felony murder. We addressed the same issue in State v. Fetterly, 109 Idaho 766, 710 P.2d 1202, 1297-1298 (1985), wherein we held that such a narrow construction would deprive the felony murder rule of any validity unless the victim was killed while the burglar had one leg over the windowsill or one foot across the threshold. Our Discussion in Fetterly, supra, is dispositive of this issue. The trial court was correct in refusing to give defendant's requested instruction.\n\nVI.\n\nWindsor argues that Idaho's capital sentencing process violates both the Idaho and Federal Constitutions in its failure to utilize a jury. This Court has previously addressed this issue. See State v. Sivak, 105 Idaho 900, 674 P.2d 396 (1983) cert. denied, U.S. , 104 S.Ct. 3591, 82 L.Ed.2d 887 (1984); State v. Creech, 105 Idaho 362, 670 P.2d 463 (1983) cert. denied, 465 U.S. 1051, 104 S.Ct. 1327, 79 L.Ed.2d 722 (1984). We continue to adhere to the position stated in both Creech and Sivak, and find the Idaho death penalty procedure to be constitutional.\n\nVII.\n\nWindsor next contends, citing Enmund v. Florida, 458 U.S. 782, 102 S.Ct. 3368, 73 L.Ed.2d 1140 (1982), that the imposition of the death penalty upon her conviction for felony murder contravenes the eighth amendment's prohibition against cruel and unusual punishment.\n\nIn Enmund, the United States Supreme Court held that the eighth amendment forbids the imposition of the death penalty against one who neither took life, attempted to take life, nor intended to take life. Id. at 797, 102 S.Ct. at 3376. The evidence introduced in Enmund established that the defendant, Earl Enmund, and two accomplices planned a robbery of the Kersey farm. The plan went awry and, while Enmund waited in the getaway car, his accomplices killed the Kerseys. Although Enmund did not participate in the actual killings, nor intend that the Kersey's be killed, the Florida Supreme Court concluded that his role in the felony, out of which the murders arose, was sufficient to warrant imposition of the death penalty. The Supreme Court reversed holding that the death penalty could not be imposed on a co-felon who neither killed nor intended that a killing occur. The Court acknowledged that there was sufficient evidence to convict Enmund of the substantive capital offense, but concluded that the imposition of the death penalty in such circumstances was contrary to the eighth and fourteenth amendments. Id. at 788, 102 S.Ct. at 3372.\n\nThe Court, recognizing that the death penalty is unique in its severity and irrevocability, required that the state must focus on the defendant's personal intent, character and culpability and not merely that of an accomplice, before the death penalty may be constitutionally imposed. Id. at 798, 102 S.Ct. at 3377.\n\n\"Enmund did not kill or intend to kill and thus his culpability is plainly different from that of the robbers who killed; yet the State treated them alike and attributed to Enmund the culpability of those who killed the Kerseys. This was impermissible under the Eighth Amendment.\" Id.\n\nEnmund, then, allows the state to impose the death penalty only if it first proves that the defendant either personally participated in the killing or personally intended that a death occur. Windsor asserts that her case falls within the scope of Enmund because the evidence establishes that she neither took life, attempted to take life, nor intended to take life. The record reflects that the trial Judge specifically found that Windsor's participation in the felony was accompanied by the specific intent to cause the death of a human being. Findings of the Court in Considering the Death Penalty Under § 19-2515, Idaho Code, Aggravating Factor No. 3. Windsor contends, however, that the trial Judge's finding is not conclusive. She asserts that the issue of specific intent is an issue of fact which must necessarily be decided by the jury as the trier of fact. She argues that because the jury convicted her of first degree murder in the perpetration of a felony, and not of deliberate and premeditated murder, the jury did not make a finding as to her intent.\n\nWindsor is correct in her assertion that I.C. § 18-4003(d), the felony murder rule, does not include any element of intent. Under that section, a defendant who participates in a felony can be held liable for the death of any person killed during the commission of the felony, regardless of the individual defendant's intent that a death occur. State v. Paradis, 106 Idaho 117, 125, 676 P.2d 31, 39 (1984). We need not address the issue of whether a jury finding on the issue of intent is constitutionally required, however, because our review of the record in the present case convinces us that the jury did indeed make such a finding.\n\nWindsor's conviction for felony murder must be read to include a finding that her actions were accompanied by an intent to cause the death of Sterling Grammer. The jury was instructed that in order to return a verdict of first degree murder committed in the perpetration of, or attempt to perpetrate, a burglary, it had to find the state had proven that Windsor \"[w]ith malice aforethought, wilfully, unlawfully, and intentionally murdered Sterling Gene Grammer while perpetrating or attempting to perpetrate a burglary. . . .\" (Emphasis ours.)\n\nDefense counsel herself told the jury in her closing argument that the key\n\nissue in the case was the issue of Windsor's intent.\n\n\"I'm not going to suppose you're naive enough not to realize that some laws were broken in this case. But I am going to ask you to hold her responsible for her criminal acts and for her intent and not for Donald Fetterly's.\n\n\"Her crime in its majority was being associated with Donald Fetterly. Karla's presence at the scene of Mr. Grammer's death is not the key here. Karla's intent is the issue.\"\n\nUnless they found that Windsor knowingly intended to bring about Grammer's death, she told them, they could not find her guilty of murder.\n\n\"You have to decide whether Karla participated in bringing about Sterling Grammer's death. And remember, you have heard the instructions. It can't be accidental. You have to decide that Karla knowingly intended to bring about Sterling Grammer's death or you're going to have to decide if Donald Fetterly acted on his own. . . . Now, if you decide that Donald Fetterly acted on his own without Karla's knowing and intentional assistance, then you can stop, because you are not going to have to go any farther.\"\n\nShe stated that the theory of murder in the perpetration of a felony was inapplicable absent a finding that Windsor participated in the murder with the specific intent to bring about Grammer's death.\n\n\"The prosecutor has also talked to you, and the Judge has instructed you, on the second theory of murder, and given to you instructions. Any murder committed in the perpetration or attempt to perpetrate a burglary. In order for this theory to be applicable, you will of course first have to decide that there was a murder, again, a killing with malice aforethought. That Karla intentionally participated in the murder with specific intent of bringing about Sterling Grammer's death.\"\n\nIt is clear from the above that the jury's verdict of guilty on the charge of murder committed in the perpetration of a felony included a finding that Windsor participated in the burglary with the specific intent to bring about the death of Sterling Grammer.\n\nAs both the trial Judge and the jury found that Windsor intentionally participated in a killing while perpetrating a felony, there is no merit to Windsor's contention that the imposition of the death penalty was constitutionally impermissible under the mandate of Enmund v. Florida.\n\nVIII.\n\nWindsor alleges that the death penalty was imposed under the one-sided influence of prosecutorial bias, passion and prejudice, and as a result of prosecutorial misconduct. She delineates several instances of alleged misconduct in support of these charges. In particular, she objects to the prosecutor's filing of a memorandum entitled \"Memorandum Regarding Aggravation/Mitigation hearing of Karla Windsor\" which she alleges was never served upon the defense.\n\nThe record before us on direct appeal is devoid of the factual information necessary to allow us to evaluate Windsor's allegations. The proper forum for raising allegations of this kind, which are outside the record on appeal, is via a petition for post-conviction relief. I.C. § 19-4901 et seq. See State v. Blackburn, 99 Idaho 222, 579 P.2d 1205.\n\nIX.\n\nFinally, we review the record in this case pursuant to the mandate of I.C. § 19-2827. Whenever the death penalty is imposed this Court is required to conduct an independent review of the record to insure (1) that the death sentence was not imposed under the influence of passion or prejudice; (2) that the evidence supports the Judge's findings as to the statutory aggravating factors; and (3) that when both the crime and the defendant are considered, a sentence of death is not excessive or disproportionate. After careful consideration of both the crime and the\n\ndefendant, we conclude that the sentence of death imposed in this case was excessive and disproportionate. We therefore set aside the death sentence and remand for resentencing.\n\nThe penalty of death is qualitatively different from that of any other sentence. When the choice is between life and death, the fundamental respect for humanity underlying the eighth amendment to the United States Constitution mandates that we carefully consider both the character and record of the individual offender and the circumstances of the particular offense before we uphold the infliction of the ultimate penalty. Woodson v. North Carolina, 428 U.S. 280, 304, 96 S.Ct. 2978, 2991, 49 L.Ed.2d 944 (1976). Unlike other sentences, once a capital sentence is executed there is no opportunity for correction.\n\nWe begin our analysis by focusing on the crime itself and comparing the degree of involvement of the two participants. The evidence establishes that Sterling Grammer died as a result of multiple stab wounds to the chest. Donald Fetterly admitted that it was he who stabbed Grammer. He stated that he and Windsor were attempting to quiet Grammer who had been taped up and left lying in the bedroom. According to Fetterly, he was holding Grammer down on the bed and Grammer's head struck his. At that point, Fetterly grabbed a knife lying on the headboard of the bed and began stabbing Grammer. He stated that while he remembers holding the knife to Grammer's chest he has no memory of actually stabbing Grammer. Fetterly was subsequently convicted of both premeditated murder and felony murder and given the death penalty.\n\nThere was never any contention that Karla Windsor actually stabbed Grammer. Windsor admitted that she aided Fetterly in trying to quiet the victim, and that she witnessed the stabbing. She testified that the stabbing occurred so quickly that she was powerless to stop it. The jury found Windsor guilty of felony murder, but acquitted her on the premeditated and deliberate murder charge. Like Fetterly, she was sentenced to death.\n\nTaking into account the differences in their level of participation in the crime, in their background and in the jury verdicts, we conclude that it was disproportionate for Windsor and Fetterly to receive the identical sentence. Our Conclusion is consistent with the result reached in the companion cases of State v. Sivak, 105 Idaho 900, 674 P.2d 396 (1983) and State v. Bainbridge, 108 Idaho 273, 698 P.2d 335 (1984), and in the companion cases of State v. McKinney, 107 Idaho 180, 687 P.2d 570 (1984), and State v. Small, 107 Idaho 504, 690 P.2d 1336 (1984). In both sets of cases, the defendant who did the actual killing was given the death penalty while his co-defendant received a life sentence. The difference in their degree of participation in the crime appeared to be the primary factor justifying the disparity in sentences in both sets of cases. McKinney, supra, 107 Idaho at 186, 687 P.2d at 576. While we are not suggesting that the death penalty is always inappropriate in a case where the defendant did not actually wield the murder weapon, we do conclude that this fact when combined with Windsor's background and individual characteristics serves to make the death penalty excessive in the present case.[Footnote 2]\n\nThe concept of individualized sentencing is firmly entrenched in modern American jurisprudence. The familiar maxim that punishment should fit the crime has been broadened to provide that punishment should also fit the criminal. See generally United States v. Barker, 771 F.2d 1362 (9th Cir.1985). With this in mind, we now turn our focus to the defendant as an individual, outlining those factors in Windsor's background and character which convince us that the death penalty was excessive in this instance. We begin by noting that Windsor, unlike the majority of capital defendants, has no formal criminal record nor significant history of prior criminal activity. There is no history of violent criminal activity, nor is there an indication that Windsor possesses any propensity toward violence.\n\nWe next note Windsor's cooperation with the authorities both after her arrest and during her incarceration. Windsor and Fetterly gave a joint confession to the arresting officers without the benefit of counsel. They then agreed to accompany the officers to the crime scene and to participate in a video re-enactment of the crime. Two officers from the Canyon County Detention Center testified at the Aggravation/Mitigation Hearing. Both officers stated that Windsor is an ideal inmate. They indicated that she has volunteered to do bookkeeping and laundry, and that she does the Center's mending. They stated that she is very industrious and spends much of her time cleaning up the Center. In addition, one officer testified to two incidents where Windsor had come to the aid of fellow inmates. In one case, she cared for an inmate who was experiencing acute alcohol and drug withdrawal and notified the staff when the woman had a seizure. In addition to the officers, several other witnesses testified at the sentencing hearing on Windsor's behalf. The state did not offer any rebuttal witnesses.\n\nWindsor has skills and abilities which indicate she might ultimately be capable of maintaining employment and functioning as a productive member of society. She graduated from high school and attended one semester of college. She has some secretarial skills, and the art work she has completed during her incarceration evinces considerable artistic ability. Additionally, Windsor has experience and training in caring for handicapped individuals. She spent one year caring for a quadriplegic as a home health aid, and another six months caring for two elderly women in the same capacity.\n\nNext, we note that Windsor's childhood was extremely troubled. The presentence investigation revealed serious problems in the home environment. As a result of these problems, Windsor was removed from her home and made a ward of the court at the age of thirteen. She remained in shelter care throughout her teenage years.\n\nAfter careful consideration of the entire record, with specific attention to the circumstances of the offense, the character of the offender and the protection of the public interest, we hold that the death penalty was excessive in the instant case. We therefore vacate the death sentence and remand this case for resentencing in accord with the views expressed herein.[Footnote 3]\n\nHUNTLEY, Justice, specially Concurring.\n\nI concur in the majority opinion with three reservations which do not affect my Concurring with the result reached by the majority.\n\nFirst, as to Part IV, I believe there was an improper variance between the information and the instructions and verdict, but since the evidence is overwhelming that there was a felony-murder committed, retrial would serve no purpose.\n\nSecond, as to Part VI concerning the constitutional requirement that the jury be involved in the sentencing process, I remain of the view expressed in my Dissents in State v. Sivak, 105 Idaho at 921, 674 P.2d at 417 (1983); and State v. Creech, 105 Idaho 362, 375-419, 670 P.2d 463, 476-520 (1985).\n\nThird, as to Part VII, I am of the opinion that imposition of the death penalty in this case would be constitutionally impermissible under the mandate of Enmund v. Florida, 458 U.S. 782, 102 S.Ct. 3368, 73 L.Ed.2d 1140 (1982).\n\nBISTLINE, Justice, Dissenting in part; Concurring in part.\n\nThe opinion for the Court which has been authored by Justice Donaldson is neatly compartmented into nine issues. To facilitate my independent examination of those issues and the independent review which will be made by the trial bench and bar, I have prepared the following table of contents, following the Court's listing of the issues as I through IX:\n\nI Windsor was not coerced into giving a confession. Based on the totality of the circumstances, there is sufficient evidence introduced which reveals that Windsor's confession was voluntarily made. It is therefore admissible. pp. 1186-1187.\n\nII The district court did not abuse its discretion in denying Windsor's motion for a change of venue. pp. 1187-1188.\n\nIII The district court did not abuse its discretion in allowing the testimony of a doctor concerning the manner in which tape was affixed to the victim's mouth. The district court also did not abuse its discretion in allowing the introduction of photographs of the victim's body. p. 1188.\n\nIV There was no fatal variance between that with which Windsor was charged and that for which she was tried. Allegations in the information were sufficient to permit the jury to be instructed on a felony murder theory. pp. 1188-1190.\n\nV The jury was properly instructed on felony murder. Windsor's requested instruction was erroneous and the district court acted properly in refusing to use it. p. 1190.\n\nVI Judge-imposed death penalty sentencing scheme in Idaho is constitutional. p. 1190.\n\nVII Death penalty was not given unconstitutionally so far as United States Supreme Court decision of Enmund v. Florida is concerned -- jury found that Windsor participated in burglary with specific intent to bring about the death of the victim. pp. 1190-1192.\n\nVIII Windsor's allegation that the death penalty was imposed as a result of prosecutorial misconduct is not supported by the record. Windsor's allegations here are more properly made in a post-conviction hearing. p. 1192.\n\nIX The death penalty imposed in this case was excessive and disproportionate. Death penalty is set aside and case remanded for resentencing. pp. 1192-1195.\n\nThose issues will be addressed in the order of their relative importance, which appears to be IX, VI, IV, VII, VIII, V, III, I, and II.\n\nIX and VI\n\nBecause these two issues are to some extent intertwined, they are readily considered together. I am in agreement with the Court's judgment to set aside the death penalty, but not for the reasons which those who comprise the majority have advanced. Had the jury been the sentencer in this case, as is constitutionally mandated by our Idaho Constitution, my vote would be to affirm, assuming an error-free trial on the guilt issue. Otherwise put, I do not subscribe to the view that the death penalty was excessive and disproportionate.[Footnote 1] In addition to the footnote Discussion, the track record in Idaho on proportionality of death penalty impositions by district Judges is not impressive -- even by the same district Judge in regard to different and unrelated first degree murder convictions. One example is that of the Wilson brothers, Kelly and David, who were convicted of the murder of a Canyon County grocery owner in December of 1981. State v. David Wilson, 107 Idaho 506, 690 P.2d 1338 (1984); State v. Kelly Wilson, 107 Idaho 510, 690 P.2d 1342 (1984).\n\nAnother case which comes to mind, also from Canyon County, is State v. Majors, 105 Idaho 4, 665 P.2d 703 (1983), where on a conviction of first degree murder, a brutal stabbing on a par with the facts of this case,[Footnote 2] the death penalty was not imposed. In another case from North Idaho, however, the Judge there sentenced to death a defendant who was charged with neither first degree murder nor felony murder, but rather murder by torture, and the three members of this Court who prefer Judge sentencing to jury sentencing in death penalty cases had little trouble in affirming. Stuart, supra.\n\nHere, although the charge against Windsor was not murder by torture, it was in the eyes of the sentencing Judge that kind of a murder. The Judge set his beliefs in writing -- as is statutorily required:\n\n4) The defendant did not inflict the actual knife wounds which directly caused the demise of Mr. Grammer. However, the record is clear that the defendants intended to take whatever action was necessary to secure from the victim the property they wanted. This\n\ndefendant was present and assisted the co-defendant in keeping the victim subdued and quiet when the knife wounds were inflicted. The defendant also admitted that she was instrumental in planning and preparing for the burglary and theft. It is clear from the evidence that both those crimes could have been accomplished long before the victim returned home, yet both defendants lay in wait for Mr. Grammer's return. The only reasonable construction of the evidence thereafter is that the defendants hit the victim on the head, robbed him of his modest personal belongings, bound and gagged him, and later eliminated him as the only eyewitness to their actions. While this defendant did not wield the knife, in light of her other acts of complicity, this finding is a difference without a distinction. R., Vol. II, pp. 0315-1316.\n\nThe foregoing statement by the Judge is part of his sentencing rationale under FACTS AND ARGUMENTS FOUND IN POSSIBLE MITIGATION. Findings of the Court in aggravation included these:\n\n1) The crime was totally senseless and void of any compassion or feeling for one's fellow man. The victim had taken the defendants into his home, had fed them and had given them a place to sleep. They knew he was a man of humble means, but one who cherished his home and the few personal belongings he had.\n\n2) The killing was exceptionally brutal and the conduct of a depraved mind. There is no rational explanation for the blow to the back of the victim's head other than that he was hit by the defendants so that they could carry out their plan. His hands and feet were then bound with duct tape so that he was rendered helpless, and then this defendant proceeded to place the tape over his eyes, mouth and nose. Dr. Donndelinger testified that the tape was sealed in such a manner that the victim would have suffocated eventually but for the knife wounds (See State's Exhibit No. 35 for verification).\n\n3) The callousness with which the body was disposed of in the river confirms the defendant's utter disregard for morality, decency, or feeling for a person's loved ones. The defendant professes to love children, yet she willingly participated in taking the life of a four-year-old boy's father even after she had observed how close the father and son were.\n\n4) There is no evidence that the defendant's mind was under the influence or effect of alcohol and/or drugs at the time of the killing.\n\n5) The planning for the commission of the crime continued over a two to three day period. Zeke Palacios was contacted as a \"fence\" for the property as early as two days prior to the commission of the crimes. Also, both defendants discussed their plans at length while they were in the schoolyard adjacent to the victim's home, and then the defendants waited in the victim's home for several hours for Mr. Grammer to return to complete the same.\n\nDefendant's contention that the victim agreed to go along with the appearance of a robbery is inconsistent with the evidence, defies common sense and is a gross distortion of the facts. The defendants had entered the victim's home without his consent through a window, had ransacked one of his rooms and left the same covered with broken glass, unless the same was done as a result of a struggle between the defendants and the victim, sought the victim's diamond rings and other personal property which they knew had particular sentimental value to him, kept him from work when his whole work history shows him to have been a reliable and conscientious worker. To believe that he would have voluntarily agreed to let these defendants have his car or pickup when he would not even let his wife drive the same is an exercise in futility. Mr. Grammer was so particular about his home and his belongings that on the night the defendants stayed with him, he nevertheless got them up at 5:30 A.M. and asked them to leave so he could padlock his residence. It is inconceivable to the Court\n\nthat such a person would agree to a feigned burglary or robbery.\n\n6) The record is void of any remorse by either defendant at or near the time of the killing. The blow to the head, the taping of the face, the binding of the hands and feet, the killing, the manner in which the body was discarded and the selling of the property even after shock would normally have set in vividly describe the true feelings and attitude towards the value and sanctity of life possessed by these defendants.\n\n7) There is no evidence that the victim provoked the incident. On the contrary, the victim was described as a hard-working, peaceful and quiet individual, and the record indicates that his relationship with the defendant was marked by his kindness.\n\n8) The defendant was the \"brain\" behind the scheme or plan and was the motivating force which set in motion the chain of events which led to the cruel and savage murder of Mr. Grammer. The defendant's motive was allegedly to get a new start in life and to avoid what she believed were outstanding warrants for the arrest of herself and/or the co-defendant.\n\n9) The murder effectively silenced the only eyewitness to the crime and the one person who could have identified the defendants.\n\n10) The defendant, though unemployed and without a means of support, was not destitute, as she has claimed, inasmuch as her own family lived in this area and had offered to take her in just prior to the perpetration of this crime and, according to the testimony of her mother, would have taken her in at any time.\n\n11) The defendant has over the years repeatedly chosen to associate with undesirable companions and has frequently cohabited with men who were in trouble with the law. Even now, despite all the tragedy and heartache involving Mr. Grammer's death, and the violence with which it was brought about, the defendant still desires to marry Mr. Fetterly and to be with him (See letters to the Court in the file).\n\n12) The evidence clearly establishes beyond a reasonable doubt that the murder was committed in the perpetration of a burglary, and that it was accomplished with the specific intent to cause the death of Sterling Grammer.\n\nSTATUTORY AGGRAVATING CIRCUMSTANCES FOUND UNDER SECTION 19-2515(f), IDAHO CODE\n\nThe Court finds the following aggravating circumstances existed beyond a reasonable doubt:\n\n(1) The murder was especially heinous, atrocious or cruel, manifesting exceptional depravity (No. 5).\n\n(2) By the murder, or circumstances surrounding its commission, the defendant exhibited utter disregard for human life (No. 6).\n\n(3) The murder was one defined as murder of the first degree by Section 18-4003, Idaho Code, and was accompanied with the specific intent to cause the death of a human being (No. 7).\n\nThe Legislature, on behalf of the people of the State of Idaho, has determined that a murder committed in the commission of certain enumerated crimes is so offensive to society that it will necessarily be murder of the first degree if there was the specific intent to cause the death of a human being. Premeditation and deliberation are implied by law in a murder committed under such circumstances, so defense counsel's argument that this jury did not find the elements of premeditation and deliberation on the part of this defendant since they did not sign the verdict form providing for the same is without merit. The jury may well have determined that a conviction for murder in the perpetration of a burglary was the more appropriate verdict since it was undisputed that this defendant did not actually inflict the fatal knife wounds. The Court's instructions did require, however, a finding of malice aforethought and the necessary criminal intent.\n\nFINAL CONCLUSIONS\n\nHaving fully considered the record, and having duly deliberated the nature of the\n\ncrime and the Court's responsibility to the defendant and to society, the Court finds that the defendant actively participated in the brutal and savage slaying of a man who was her friend. The intentional killing took from the victim what an offender can never restore -- the fragile gift of life.\n\nThe defendant's actions were the final betrayal of another human being and embodied the ultimate affront to society.\n\nThe Court concludes that the mitigating circumstances do not outweigh the gravity of the aggravating circumstances so as to make unjust the imposition of the death penalty.\n\nThe will of the people set forth in Section 19-2515, Idaho Code, requests that this be done, and with this will the Court in its discretion concurs.\n\nFinally, any lesser punishment under the facts of this case than that imposed upon the co-defendant, Mr. Fetterly, when it has been established beyond a reasonable doubt that the killing was committed by both defendants for a base, anti-social purpose with wanton disregard for human life, would not only be disproportionate to the crime, but would be a disparity that could not be rationally reconciled.\n\nNo legal cause or reason to the contrary has been shown, and it is the judgment of this Court that the death penalty should be imposed on the defendant for the capital offense of which she was convicted.\n\nIT IS, THEREFORE, ADJUDGED that the defendant is guilty of First Degree Murder in the perpetration of, or attempt to perpetrate, a burglary, by verdict of a jury, and that she should be punished by the imposition of the death penalty by the Idaho State Board of Correction in a manner prescribed by law on May 4, 1984. R., Vol. 6, pp. 0317-24.\n\nFrom the foregoing there is one passage which is deserving of additional comment and that passage follows the Judge's Conclusion that he found on balancing nothing to \"make unjust the imposition of the death penalty.\" That passage is: \"The will of the people set forth in Section 19-2515, Idaho Code, requests that this be done, and with this will the Court in its discretion concurs.\" R., Vol. II, p. 0323 (emphasis added). When the Judge stated a few sentences earlier that he had fully considered and duly deliberated the nature of the crime and his responsibility to the defendant and to society, there will be no one who will doubt that he was saying for himself all other district Judges two things: (1) that under the present state of the law, to be the sole person who will make the decision of whether a defendant will live or die is an agonizing experience as much as unlike any other decision that a Judge ever has to make as is to the defendant the difference between dying and living. A trial Judge has open to him only the alternative of fulfilling his duty as the legislature has prescribed it for him, or to decline to do so on the basis that his own legal mind is in good conscience convinced that three members of this Court are in error in their explanation as to why the present legislative scheme is not unconstitutional. No district Judge has as yet deigned to so confront the majority -- yet not one Judge has yet voiced any support for the two theories advanced by the majority of three who see no problem.\n\nSuch being the state of affairs, the trial Judge responded to the mandate of the legislative scheme, performed the weighing and balancing act required of him, exercised judicial discretion vested in him by the legislature, and imposed the death sentence -- only to learn today his agonizing over the sentence was a needless exercise in futility. The Judge learns instead of a new doctrine, that of \"paramount exercise of discretion\" -- today by the Supreme Court of Idaho vested in itself. History will note that the majority opinion points to no error in the trial Judge's determination that the facts and the law required of his discretion that the death penalty be imposed. To reach its result the majority on the face of its opinion as weighed against the trial Judge's § 19-2515 findings is obviously guilty of exercising that discretion which the trial Judge in this case thought\n\nwas not only within his exclusive province, but awesome responsibility as well.\n\nWhat we have, then, is a Supreme Court which (by a 3-2 majority) has declared constitutional a legislative sentencing scheme which foists off onto the district Judges the agonizing burden of making the decision between life and death -- a function which in pre- Woodson[Footnote 3] days had always been within the province of the jury, and at the same time a Supreme Court which does not hesitate to substitute its own discretion for that of the Judge. To set aside a death sentence and \"remand for resentencing in accordance with the views expressed herein,\" which views preclude the reimposition of the death sentence, cannot be said to be an agonizing experience.\n\nThe majority makes much of Windsor's childhood and her background in general. All of these factors were first considered by the trial Judge. The fact remains that, just as the Judge observed, two people, Windsor and Fetterly, set out together on this crime spree which culminated in the death of their selected victim. This is not an Enmund[Footnote 4] situation -- not even a distant cousin of Enmund. In that regard, the majority opinion is internally inconsistent. Of a necessity to reach the desired result it has created new law in Idaho -- that where death of another is attempted by two people in more than one way, he or she who was less successful must yield the hangman's noose to the one to whom must go the honor of inflicting the blow or wound which gains the medical credit for producing the victim's expiration.\n\nReturning to the passage above taken from the trial Judge's § 19-2515 findings, where he recited that the \"will of the people set forth in Section 19-2515\" placed upon him the sentencing of Windsor, is it indeed the will of the people? Or is it perhaps a temporary abberation brought on by the interference of the Supreme Court of the United States in capital sentencing, beginning with Furman, which case short years later was said by the High court to have been misunderstood and misapplied by the various state legislatures and supreme courts. In State v. Creech, 105 Idaho 362, 670 P.2d 463 (1983) cert. denied 465 U.S. 1051, 104 S.Ct. 1327, 79 L.Ed.2d 722, it was thought by some that Justice Huntley and myself had made it reasonably clear that the office of the attorney general, in response to its views of what the High Court was mandating, that drafted the legislation and presented it to the legislature. The office of the attorney general, so as we heard from its solicitor general, did not draft that legislation pursuant to the will of the people, and has never pretended that it did so. That the legislature passed the legislation conveys only one Conclusion, and it is not that those legislators were acting under any influence other than that the office of the attorney general who was advising the legislators that passage of the new sentencing scheme was required to conform to the views which the office of the attorney general then entertained as to what the High Court had said. As often as the High court vacillated, the office of the attorney general had to respond. And sought and obtained the requisite vote from the legislature. In the year 1977, and following Woodson, supra, jury sentencing fell by the wayside in favor of what we now have. Would Idaho's former scheme of jury sentencing today be invalidated by the High Court? Not at all. Idaho is only one out of three states in the fifty where the jury is not involved. What we learn is that that which well served the people, the trial bar, and the trial bench for over a century went down the drain because the office of the attorney general in undoubted good faith brought about what it perceived as a change mandated by the High Court.[Footnote 5]\n\nWhen Justice Huntley, by reason of his own knowledge of constitutional law, suggested\n\nin Creech the invalidity of non-jury sentencing, the only response which he gained from the majority of three was this single and singularly remarkable paragraph:\n\nAppellant next asserts that Idaho's death penalty provisions are unconstitutional, in that jury participation is not required in the sentencing decision, but rather the discretion to impose a death sentence is vested in a Judge. At other places or at other times, juries have been given an integral role in imposing the death sentence. However, we hold that jury participation in the sentencing process is not constitutionally required. Creech, supra, 105 Idaho at 372-73, 670 P.2d at 473-74.\n\nApparently conceding the dismal inadequacy of that response to the documented authority and history of both of the Creech Dissents, in State v. Sivak, 105 Idaho 900, 903-04, 674 P.2d 396, 399-400 (1983) cert. denied U.S. , 104 S.Ct. 3591, 82 L.Ed.2d 887 the majority offered this:\n\nUnder the scheme that existed at the time of the adoption of the Idaho Constitution, the jury determined whether a person was guilty of first or second degree murder. Once the degree of crime was determined, the jury's factfinding function was completed. It is certainly true that the jury's decision had an impact on the sentence which was imposed. Thus, if the jury determined that the defendant was guilty of only the crime of second degree murder, no death penalty could be imposed. However, that is only an incidental consequence which is true in every case where a jury finds a defendant guilty of a lesser included offense from that with which the defendant is charged. Thus, if a defendant is charged with first degree burglary, and the jury finds him guilty of second degree burglary or perhaps petit larceny, the jury's determination will have a substantial impact upon the sentence which is imposed upon the defendant. However, that does not mean that under our Constitution a defendant is entitled to have a jury impose the sentence. While the jury's determination of the crime of which the defendant was guilty affects the sentence which may necessarily be imposed, that incidental effect does not mean that the jury is an integral part of the sentencing process. The argument that is made that R.S. § 65673, in effect in 1889 when the Idaho Constitution was adopted, constitutionalized a right to be sentenced by a jury in capital cases, basically misconstrues the distinction between the factfinding function of determining the degree of crime of which the defendant is guilty performed by the jury, and the sentencing function which is to be performed by the court. Accordingly, we conclude that Art. 1, § 7, of the Idaho Constitution does not require the participation of a jury in the sentencing process in a capital case.\n\nThis reasoning was not only inept, but inapplicable, as was well pointed out:\n\nIn State v. Creech, 105 Idaho 362, 670 P.2d 463 . . . , I expressed a strong concern with a majority opinion which refused to discuss the view of Justice Huntley who in Dissent pointed out that our Idaho Constitution guarantees that no person shall be executed except on direction of a jury. In today's opinion the same majority, now deigning to discuss that that issue, and completely ignoring that written by Justice Huntley and by myself in Creech, rationalizes around the research which we there presented by noting the absurdity that it was the Judge who was the sentencer where the jury convicted an accused of second degree murder -- but at the same time facetiously conceding \"that the jury's decision had an impact on the sentence which was imposed.\" This is pure sophistry at its best. The jury, if it convicted the accused of first degree murder thereby sent the accused to the gallows. That is an impact indeed. As stated in my Creech Dissent:\n\n\"In People v. Walters, 1 Idaho 271 (1869), the defendant was charged with murder in the first degree. The jury, knowing that a first degree conviction\n\nrequired execution, recommended the mercy of the court.\n\n\"'We the jurors in the above entitled cause find the Deft guilty as charged in the Indictment and recommend him to the mercy of the court.\n\nL. Jackson\n\nForeman of Jury'\"\n\nIt cannot in good conscience be argued that from 1869 until Furman it was not the jury which made the life or death decision. Any lingering doubt as to the intention of the legislature should be dispelled by simply observing that following the 1911 Amendment to I.C. § 18-4004 the courts of Idaho, including this Supreme Court, continued to acknowledge the jury's function as sentencer, as was carefully documented in my Dissenting opinion in Creech wherein were set forth verbatim the jury verdicts in [ State v. ] Hoagland [39 Idaho 405, 228 P. 314 (1924)], [ State v. ] Reding, [52 Idaho 260, 13 P.2d 253 (1932)], [ State v. VanVlack, [57 Idaho 316, 65 P.2d 736 (1936)], [ State v. ] Golden, [67 Idaho 497, 186 P.2d 485 (1947)], Owen, Clokey, [State v.] Gonzales [92 Idaho 152, 438 P.2d 897 (1968)], and Buckley -- which latter was the last first degree murder to be reviewed in this Court under the law as it existed prior to Furman 's advent.\n\nRegrettably one must conclude that the author of today's opinion for the Court has yet to read my Creech Dissent. Nothing in today's majority opinion supports its bald Conclusion \"that Art. 1, section 7, of the Idaho Constitution does not require the participation of a jury in the sentencing process in a capital case.\" The best that can be said for the majority opinion is that it does recognize that where the jury convicts of second degree murder, \"no death penalty could be imposed,\" but this is said to be an incidental effect. Some may consider it a deplorable state of affairs that in a matter of such grave moment the majority does not even attempt to comment upon the proceedings of the Constitutional Convention and the remarks of Mr. Heyburn, Mr. Claggett, and Mr. Ainslie in the drafting of Art. 1, section 7 -- which was thereafter adopted by the people. Instead the majority digresses into the wholly irrelevant field of the Judge's discretion where the jury's verdict was to convict of murder in the second degree.\n\nWith equal facility the majority facilely avoids discussing the teaching of State v. Miles, 43 Idaho 46, 248 P. 442 (1926), or attempting to explain away the words and wisdom of Justice Ailshie in In re Prout, 12 Idaho 494, 86 P. 275 (1906). Instead the majority opinion speaks of the sentencing discretion in, of all things, burglary cases. It gives us the remarkable pronouncement that the jury's determination of whether the defendant is guilty of first or second degree murder, or perhaps the include offense of petit larceny, \"will have a substantial impact upon the sentence . . . ,\" and that such \"does not mean that under our Constitution a defendant is entitled to have a jury impose the sentence.\" No one has ever contended that it did in other than murder cases; the statement of the majority only serves to show no knowledge of the documentation of the Creech Dissenting opinions, at the best, or, at the worst, a complete disregard for the irrefutable teaching of that documentation. In an ordinary case this would be thought regrettable. In a case where we review the imposition of a death sentence, it may well be regarded as unpardonable. Sivak, supra, 105 Idaho at 908-10, 674 P.2d at 404-06 (footnote omitted).\n\nIV.\n\nThere is more to this issue than has met the eye -- of the majority. Windsor was charged with first degree murder, and she went to trial on a charge of first degree murder. This was not unusual, because this was also the exact nature of the complaint against her and Donald Fetterly, as defendants, not only filed by the prosecuting attorney himself, but also signed by him. This was on September 12, 1983. On that same date Judge Broadman in magistrate court proceedings read the complaint\n\nto both defendants, advising them that the maximum penalty was death. The public defender, already appointed for both defendants in another case against the same two, was appointed for this case, a preliminary hearing was requested, and a date set for it. R., Vol. 5, p. 8. The hearing took place as scheduled, against both defendants. The court minutes state with respect to the complaint's charge of murder that:\n\nThe Court, after considering the testimony and evidence presented, found that the State had established probable cause to believe that a public offense had been committed and probable cause to believe that each of the defendants did commit the offense as charged in count one, first degree murder. . . .\n\nThe Court Ordered the defendants bound over to District Court to answer to the charges. R., Vol. 5, p. 10.\n\nAnd on the same day an order was entered by Judge Swafford, who presided at the preliminary hearing, holding the defendant to answer on both the murder charge and the grand larcency charge -- with which we are not concerned. Two weeks after filing the information charging Fetterly and Windsor with premeditated first degree murder, and with a separate count for robbery, the prosecutor filed an amended information. This information, too, continued the charge of premeditated first degree murder, Count I, but the prosecutor apparently saw a need to add a court of burglary, and separately, an enhancement count predicated on use of a deadly weapon -- the knife.\n\nThus, it is seen that felony murder was never charged in the complaint or in the information. Moreover, and critically, the defendants Fetterly and Windsor were not by the magistrate held to answer at trial in district court on a charge of felony murder. For that reason Windsor is correct in her assertion that the jury should not have been given a verdict which allowed the jury to find her guilty of felony murder -- a crime with which she had not been charged. Quite the contrary, the prosector had made the election to charge her (and Fetterly) with premeditated first degree murder -- notwithstanding that he was clearly at liberty to have charged her with felony murder as well.\n\nShe was properly held to answer for the crime of premeditated first degree murder -- the charge leveled against her in the prosecutor's criminal complaint, and the charge which was pursued at the preliminary hearing.\n\nArticle 1, § 8 of the Idaho Constitution specifically provides:\n\nNo person shall be held to answer for any felony or criminal offense of any grade, unless on presentment or indictment of a grand jury or on an information of the public prosecutor, after a commitment by a magistrate. . . .\n\nThere is in Part IV of the majority opinion a Discussion of variances and fatal variances, and there is mention made of two federal prosecutions which reached the Supreme Court of the United States, Hamling v. United States, 418 U.S. 87, 94 S.Ct. 2887, 41 L.Ed.2d 590 (1974), and Berger v. United States, 295 U.S. 78, 55 S.Ct. 629, 79 L.Ed. 1314 (1935). Whatever the rule may be in federal court, Windsor was tried in state court, and entitled to all of the guarantees of the Idaho Constitution -- some of which have no counterpart in the federal constitution. Whether the majority accidentally or purposefully avoids the issue raised by our Idaho Constitution is interesting speculation. The fact is that issue has been adroitly finessed, and this is an intolerable state of affairs.\n\nThe Idaho Constitution allows the trial of any person on a prosecutor's information only \"after a commitment by a magistrate. . . .\" Id. Const. art. 1, § 8. Here there had been no preliminary hearing on the charge of felony murder. And, if the Constitution was not authority enough, the legislature, which is the voice of the people, has also ruled in I.C. § 19-1420 that \"[a]n information or indictment cannot be amended so as to charge an offense other than that for which the defendant has been held to answer.\" Neither the legislature nor the Framers of the Constitution were willing\n\nto concede that mere expediency should prevail as against the constitutional and statutory provisions. Even the Court's own rule, I.C.R. 7(e) (formerly I.C.R. 7(d)), does not purport to alter the substance of the Constitution or the statutory enactment. Nine short years ago a unanimous Court, which included Justices Bakes, Donaldson and Shepard, but not myself or Justice Huntley, wrote:\n\nWe are constrained to dispose of the instant action on the following ground. It has been held that the district court lacks jurisdiction to try any person for an offense by information absent compliance with the statutes regarding preliminary examinations. Idaho Constitution art. I § 8; I.C. § 19-804; State v. Braithwaite, 3 Idaho 119, 27 P. 731 (1891); State v. West, 20 Idaho 387, 118 P. 773 (1911). State v. Ruddell, 97 Idaho 436, 439, 546 P.2d 391, 394 (1976).\n\nIn the ensuing nine years, none of those cited bases have been overruled; nor in good conscience could they be overruled. In State v. McGreevey, 17 Idaho 453, 105 P. 1047 (1909), Justice Ailshie, who also authored State v. West, 20 Idaho 387, 118 P. 773 (1911), wherein McGreevey was followed, wrote:\n\nYaner v. People, 34 Mich. 286, was a case identical in its facts with reference to preliminary examination, commitment, and information, with the case at bar. The court speaking of the examination said:\n\n\"And it is only when it shall appear from such examination that an offense not cognizable by a Justice of the peace has been committed, and that there is a probable cause to believe the prisoner guilty thereof, that he can be held for trial. (Comp. Laws 1871, secs. 7859 7860.) The clear evident intent of this statute was that the magistrate should exercise his best judgment in the matter; that he should from the testimony determine whether the crime charged in the warrant had been committed; or where, as in this case, the offense charged includes one or more of lesser degree, the magistrate should determine which offense, if any, had been committed, so that the accused might not be placed upon trial in the circuit to answer to a charge different or greater than the one on which he had been examined, and to answer which he had been held for trial. If this were not so, we should have the magistrate binding over for one offense, and the prosecuting attorney filing an information for another and different one; or the magistrate binding over to answer to an offense of one degree, and the prosecuting attorney filing an information for a like offense of a higher degree.\" McGreevey, supra, 17 Idaho at 459-60, 105 P. at 1053-54.\n\nTo which could be added apropos to what transpired here: \"or we should have the magistrate binding over for premeditated first degree murder, the prosecuting attorney filing an information on that charge, and the district court allowing the jury to consider both whether the defendant was guilty of premeditated murder, and if not, whether the defendant was guilty of felony murder.\" Those interested readers who may now peruse the two cases cited in Ruddell will find the most comprehensive Discussion of the Constitution and the statute in McGreevey.\n\nThe question before this body is not whether there was a fatal variance as viewed under federal law in a federal prosecution, but a question of district court jurisdiction -- which as I understand it is never waived.\n\nVII.\n\nIn Part VI I suggested that this was not an Enmund type of case. Here we have no driver of a get-away car -- completely detached from the scene of a murder-in-progress scene. Hence, I see no necessity for the majority's considerable exertion in reaching the Conclusion that \"there is no merit to Windsor's contention that the imposition of the death penalty was constitutionally impermissible under the mandate of Enmund.\n\nThe trial court's instruction making a murderous intent an integral factor in felony murder was obviously erroneous. I do not see, however, that on this record such error can properly be assessed to Windsor.\n\nVIII.\n\nWhile it is the unanimous judgment of all five of us that the death penalty here imposed must be set aside, with directions for resentencing in accordance with the views of the majority as expressed in the opinion delivered by Chief Justice Donaldson, it seems to me that Windsor has a perfectly valid issue here which has to be addressed. The prosecutor's memorandum in the record, Vol. 8, p. 13, shows that it was dated March 23, 1984. It was filed (so marked at first) in the Clerk's Office at 8:26 a.m. on March 28, 1984. Contrary to approved practice, and perhaps even mandated by rule, nothing on the document purports to show that it was served on defendant's attorney -- whose affidavit states unequivocally that she never saw the memorandum until accidentally coming across it on July 24, 1984, which was some 120 days after Windsor had been sentenced to death on April 9, 1984. The affidavit was filed -- and served -- in support of Windsor's July 30, 1984 Motion for Reduction of Sentence which was noticed up for hearing at 2:30 p.m. October 9, 1984. There was also a defendant's motion for oral argument on this motion, and on July 8 the district court so ordered. There is nothing which I can find in the record where the prosecuting attorney claims that he served this fifteen-page memorandum on defense counsel.\n\nThe aggravation-mitigation hearing was conducted on March 28, 1984, leaving the clear inference that the district Judge had the memorandum on his desk for five days. There is no reason to believe that the court thought other than that it had been served, but defense counsel did not see fit to respond to it.\n\nAt the Conclusion of the aggravation-mitigation hearing, the court spoke:\n\nCOURT: Karla, I'm going to go ahead with my sentence at this time.\n\nI don't want you to feel that I have considered this matter lightly by doing it so shortly after arguments of counsel and the evidence we heard today.\n\nThe Court, as in the other matters, capital matters, has had these cases on its mind almost from the day I became involved. I have given them a lot of thought to the pros and cons of what I anticipated the arguments would be. I have had the benefit of statements by counsel in writing, so I could to some extent anticipate what their position would be and what their arguments would be.\n\nThe evidence we heard today is really the only additional factor that I have had to give additional consideration to, along with my review of the pre-sentence, in light of the testimony that we heard today.\n\nI am going to go ahead and make this decision at this time, because I know it is important to everyone involved, ad because not only you, but the people have a right to know what the Court's position is in this matter. But I am going to reserve the right to make my formal decision in the form of written findings and Conclusions so that I do not run the risk of misstating something or overlooking something, so it will be in a formal written document and signed by the Court as required by the laws of the State of Idaho. Tr., Vol. 4, pp. 638-39 (emphasis added).\n\nWhat we have before us is the trial Judge's own statement that he had been pondering the defendant's sentence even before the hearing -- and that he had indeed been resorting to the prosecutor's Memorandum, which included much argument based on much surmise and suspicion. That Memorandum is attached as Appendix A. Also attached, as Appendix B, is the remainder of the court's continuing remarks, clearly demonstrating defense counsel's contention that this secret, unserved Memorandum constituted the thread of the court's sentence decision.\n\nIn considering whether the prosecutor acted inadvertently in this sorry affair, one must also consider the probability of prosecutorial vindictiveness -- a doctrine given recognition by the Supreme Court of the United States -- in that, as defense counsel brings to our attention with the unserved Memorandum given to the trial court, the prosecutor before the trial was willing to forego seeking the death penalty, having written on January 4, 1984:\n\nAs you are aware, Karla Windsor is scheduled to go to trial on February 13, 1984, as a principal in the murder of Sterling Grammer. There is absolutely no question in my mind at trial that a jury would return the same verdicts that the Fetterly jury did. It would, therefore, seem to me to be appropriate to resolve the Windsor case by pleas. I would require Karla to enter pleas to the same charges corresponding to the Fetterly jury verdict. At sentencing, I would recommend an indeterminate life on the murder charge, as well as at least one consecutive indeterminate as to the other charges. Please review this and advise me at your earliest convenience what your position is. R., Vol. 8, p. 12.\n\nProportionality, wherefore art thou? As I have written and written, defendants who are bound over for trial on charges of first degree murder should have their verdict and their fate determined not by prosecutorial whim, fancy, or vindictiveness, but by juries.\n\nMore appropriate here, however, is my suggestion to the other members of this Court that because of the prosecutor's grossly improper conduct at the first sentencing hearing, and even though the trial court was not aware of the non-service on defense counsel, that first sentencing was tainted beyond correction, and it is difficult to expect that the same trial Judge can wipe clean the slate. Moreover, it would seem that the particular trial Judge may very well respond as did another highly respected trial Judge who, having agonized once over a death penalty sentencing, declined the offer to do so a second time. State v. Osborn, 102 Idaho 405, 631 P.2d 187 (1981); State v. Osborn, 104 Idaho 809, 663 P.2d 1111 (1983) (appendix to separate opinion of Bistline, J., 104 Idaho at 822-23, 663 P.2d 1111).\n\nV.\n\nI concur generally with the majority opinion in Part V. We have before us a clear case of an intent to rob Mr. Grammer, and in connection with that planned crime, Windsor and Fetterly made a burglarious entry into his private residence. It was what might be called an ongoing crime as compared to most crimes, and it would be difficult for me to accept the proposition that the burglary was an instantaneous fleeting affair which somehow evaporated before the killing of Grammer -- whether it was a scheduled or an unscheduled killing. It took place either during or out of the ongoing felonies of burglary, robbery, or both.\n\nIII.\n\nAgain I concur with the majority opinion, at least generally. Where two co-conspirators engage in a criminal scheme which results in the death of the victim whom they are robbing, it should make little difference which of the two did the stabbing which happened to be a faster accelerating cause of death than the prolonged suffocation.\n\nI.\n\nThe majority gives no reason for ruling as it does on this issue, but instead only states that its review of the record convinces it that the district court did not err in holding that Windsor was not coerced into giving the statements she did. A review of the facts convinces me otherwise.\n\nOnce Windsor was taken into custody and transported in a police car to the Canyon County Sheriff's Office on September 10, 1984, officers commenced a custodial interrogation. Without advising Windsor of her Miranda rights, Detective Jim Hensen began interrogating her about the whereabouts of the deceased's auto. Hensen\n\ninsisted at the suppression hearing that he was not questioning Windsor about the homicide, just about the missing car of the deceased. To assert that such a \"distinction\" took him outside the scope of Miranda is incredible. Hensen was well aware that Windsor and Donald Fetterly were suspects; and he knew that they had been stopped by Canyon County authorities while traveling in the deceased's pickup. The information provided to him by his unconstitutional interrogation of Windsor allowed seizure of the car from which a knife was recovered. The state later introduced that same knife at the trial as the alleged murder weapon. Without advising Windsor of her rights, Hensen clearly interrogated her about the location of incriminating evidence that by itself could be damning without a confession.\n\nThe fact that the statement was custodial is irrefutable. There also is no doubt that detective Hensen conducted an interrogation as that term is defined by this Court. In State v. Monroe, 103 Idaho 129, 645 P.2d 363 (1982), this Court, citing Rhode Island v. Innis, 446 U.S. 291, 100 S.Ct. 1682, 64 L.Ed.2d 297 (1980), determined that the test for deciding whether a suspect has been interrogated for purposes of Miranda was as follows:\n\n\"[T]he term 'interrogation' under Miranda refers not only to express questioning, but also to any words or actions on the part of the police (other than those normally attendant to arrest and custody) that the police should know are reasonably likely to elicit an incriminating response from the suspect.\" Monroe, supra, 103 Idaho at 130, 645 P.2d at 364.\n\nHere, just as in Monroe, there was \"express questioning\" by the detective. Here, as in Monroe, the Miranda warnings were neglected. Detective Hensen, in his haste, began his questioning without the benefit of any warning whatsoever. As a result of the unlawful questioning, the auto was located and the knife, the size and length of which the pathologist identified as being consistent with the chest wounds of the deceased, was recovered from the auto.\n\nIt is only after Detective Hensen had gained this damning evidence from the lips of the accused that we are told that Hensen's \"firm attitude\" upset and agitated Windsor. As a result, Hensen's supervisor, Detective Richard Appleton relieved Hensen of his duty of interrogation and began the task of calming Windsor down. One does not have to be too creative to guess at what Appleton means by \"firm attitude,\" when he said that he assured Windsor that he was not mad at her and treated her like a \"human being.\" That testimony can leave no doubt as to how Hensen was interrogating Windsor, and why he was relieved. Obviously by the time Hensen was taken off the interrogation he had violated the mandate of Miranda and this Court; further, he had mistreated Windsor to the point of upsetting her greatly.\n\nTaking over in the old police \"Mutt and Jeff\" routine, Appleton calmed Windsor down and advised her that if she knew anything it would be better for her to tell the truth. When she asked to see Fetterly, Appleton permitted it, but only allowed the two to talk in his presence. Windsor had previously informed Appleton that if there was to be a statement it would have to be a joint statement. Still, neither Fetterly nor Windsor, both in custody and both definitely suspects in the murder of Grammer, had been advised of their rights under Miranda.\n\nAppleton testified that he advised Fetterly and Windsor that his report would show that they had voluntarily given a statement, and that he would be in court with them because he would be testifying. Then, in the words of Appleton, when they \"agreed\" to give him a statement, and only after the two of them agreed to do so did the subject of rights arise.\n\nHence, only after convincing Windsor to make a statement did Detective Appleton tell her of her rights under Miranda. Only then was Windsor informed of her right to remain silent and to be represented by counsel. Surely neither the United\n\nStates Supreme Court nor this Court ever intended that the Miranda warnings could be put off until after an accused in custody had agreed to give a statement. What occurred in this case was a concerted effort to convince Windsor and her co-defendant to give a statement. Only after they agreed to do so were they advised that they had the right to refuse. What good is a right if you are not advised you have it until after you have agreed to give it up? Therefore, under the totality of the circumstances in this case, the statement which was given was involuntary and inadmissible and should have been suppressed.\n\nII.\n\nHere, although I believe that a change of venue would have been the better route to go, a close study of the jury selection shows that the trial Judge did not in this case, as it seemed to me was done in State v. Beam, 109 Idaho 616, 710 P.2d 526 (1985), indoctrinate the entire jury panel in such a manner that voir dire examination by counsel was reduced to a meaningless exercise. On the other hand, nearly 100 percent of the jurors had participated in prior trials with the same Judge, but whether those earlier experiences caused any of the jurors to avoid confessing to knowing too much from pre-trial publicity, and accordingly forming and concealing opinions with respect thereto, is not within a realm of knowing from this record. If the Court were to reverse for a new trial because of error in the instructions, I would vote that the change of venue motion be given serious reconsideration. For certain I would vote to direct cautionary protective procedures to ensure a fair trial in Canyon County -- and point briefly to factors which are of deep concern.\n\nThe flood of media coverage following the arrest of Windsor and her co-defendant, Fetterly, included information released by the Canyon County Sheriff's Office and the Canyon County Prosecutor's Office of a prior arrest, the existence and contents of a confession, statements that both defendants had stabbed the victim, and the prosecutor's opinion of the guilt of both this defendant and her co-defendant. The release of such information was clearly in violation of the American Bar Association Standards Relating to Fair Trial and Free Press. Those standards issued in 1970 provide as follows:\n\nFrom the time of arrest . . . in any criminal matter until the commencement of trial or Disposition without trial, a lawyer associated with the prosecution or defense shall not release or authorize the release of any extrajudicial statement, for dissemination by any means of public communication, relating to that matter and concerning:\n\n(1) The prior criminal record (including arrests, indictments, or other charges of crime), or the character or reputation of the accused. . . .\n\n(2) The existence or contents of any confession, admission, or statement given by the accused, or the refusal or failure of the accused to make any statement; . . . .\n\n(6) Any opinion as to the accused's guilt or innocence or as to the merits of the case or the evidence in the case. ABA Minimum Standards for Criminal Justice, Standards Relating to Fair Trial and Free Press.\n\nNot only did the release of such information violate the American Bar Association standards, but it was also clearly in violation of Disciplinary Rule 7-107 Trial Publicity of the Code of Professional Responsibility adopted by the Idaho State Bar and approved by the Idaho Supreme Court. Disciplinary Rule 7-107 prohibits essentially the same conduct as outlined in the ABA Minimum Standards for Criminal Justice. This information further indicates that the district court should have changed the venue in this case.\n\nPre-trial publicity for Windsor continued in December 1983 up to commencement of her co-defendant's trial on December 12, 1983. As a result, she filed two supplemental affidavits regarding venue. Her affidavits contain, as exhibits, the coverage of defendant Fetterly's trial by the Idaho\n\nStatesman and the Idaho Press Tribune. Also included in the record are the transcripts of the local television station broadcasts. With the new wave of publicity brought by Fetterly's trial, Windsor's name was continually before the community tied to a man tried and convicted of first degree murder. The public was reminded that Windsor's trial would begin in February. A representative sample of these reports state as follows:\n\n1. From the Idaho Press Tribune, December 11, 1983\n\n\"The 27-year old Fetterly and a companion, Karla Yvonne Windsor, also 27, both of Caldwell, have been charged with First Degree Murder, First Degree Burglary, Grand theft, and use of a deadly weapon in the commission of a felony in connection with Grammer's death. . . . Fetterly and Windsor, also were both unemployed at the time, were arrested by Canyon County Sheriff's deputies the day after Grammer's body was found. The couple was driving a pickup owned by Grammer at the time they were apprehended, police have said . . .\" (R. 120)\n\n2. From the Idaho Press Tribune of December 12, 1983\n\n3. From KBCI TV, Boise, December 12, 1983\n\n4. From KIVI TV, Nampa, December 12, 1983\n\n5. From the Idaho Statesman, December 14, 1983\n\n6. From the Idaho Press Tribune, December 14, 1983\n\n7. From KIVI TV, Nampa, December 14, 1983\n\n8. From the Idaho Press Tribune, December 15, 1983\n\n9. From the Idaho Statesman, December 15, 1983\n\nY. Windsor, 27, were arrested Sept. 10 and accused of stabbing Sterling G. Grammer, 45, 1201 E. Elgin St., . . .\"\n\n10. From KBCI TV, Boise, December 15, 1983\n\n11. From Idaho Press Tribune, December 16, 1983\n\n12. From the Idaho Statesman:, December 16, 1983\n\n13. From the Idaho Statesman, February 1, 1984\n\nAs a result of the Fetterly trial, the Canyon County community was bombarded with media coverage of every detail of the crimes Windsor was charged with a second time around. Evidence that pre-trial publicity was exhaustive and inflammatory is contained in the voir dire results. Four of the jurors questioned knew that Windsor's co-defendant had been convicted of murder. Half of the jurors questioned had acquired some information about the case and one juror was excused when she stated: \"I've read so much about this case, I feel like I'm prejudiced. I have an opinion.\" Tr., Vol. 1.\n\nJust an objective inspection of such voir dire results would indicate that because of the amount and nature of the pre-trial publicity, there was a reasonable likelihood that a fair trial could not be had in Canyon County. It is clear to me that the trial court erred in refusing to consider the prevoir dire motion for a change of venue. The extremely detailed coverage of the contents of the joint confession coupled with other prosecutorial comments which were prejudicial and unethical and the continuous coupling of Windsor's name in the media with that of convicted murderer, Fetterly, resulted in her being tried and convicted even before her February trial date. Had the trial court granted a change of venue, Windsor's due process and fair trial rights would have been insured.\n\nAPPENDIX A\n\nRICHARD L. HARRIS\n\nCANYON COUNTY PROSECUTING ATTORNEY\n\nCanyon County Courthouse\n\nPost Office Box 668\n\nCaldwell, Idaho 83606-0668\n\nTelephone: (208) 454-7391\n\nIN THE DISTRICT COURT OF THE THIRD JUDICIAL DISTRICT OF THE STATE OF IDAHO, IN AND FOR THE COUNTY OF CANYON\n\nCase No. C-5576\n\nMEMORANDUM REGARDING AGGRAVATION/MITIGATION HEARING OF KARLA WINDSOR\n\nIdaho Code, Section 19-2515(b) provides that: \"Where a person is convicted of an\n\noffense which may be punishable by death, a sentence of death shall not be imposed unless the Court finds at least one statutory aggravating circumstance. Where the Court finds a statutory aggravating circumstance, the Court shall sentence the defendant to death unless the Court finds that mitigating circumstances which may be presented outweigh the gravity of any aggravating circumstance found and make imposition of the death penalty unjust.\"\n\nIdaho Code, Section 19-2515(f) provides that: \"The following are statutory aggravating circumstances, at least one of which must be found to exist beyond a reasonable doubt before a sentence of death can be imposed:\n\n(5) The murder was especially heinous, atrocious or cruel, manifesting exceptional depravity;\n\n(6) By the murder or circumstances surrounding its commission, the defendant exhibited utter disregard for human life;\n\n(7) The murder was one defined as murder of the first degree by Idaho Code, Section 18-4003(d), and it was accompanied with the specific intent to cause the death of a human being.\"\n\nI\n\nFACTORS IN MITIGATION\n\n(A) The defendant is somewhat educated, has one semester of college and appears to be fairly literate.\n\n(B) The defendant has the ability to obtain employment. Because of education, the defendant has some skills that could make her employable. However, her past history shows no inclination to consistently maintain employment or any desire to be a productive member of society.\n\n(C) The defendant has a limited criminal record. There does not appear to be a prior felony record, depending on whether the prostitution charge of 1978 is considered a felony or a misdemeanor. At the time of the present offense, the defendant had two felony charges pending, one being Possession of a Controlled Substance and the other being the charge of Fraudulent Use of a Credit Card. Further prosecution of those charges was abandoned because of the commission of the present crimes. It should be pointed out that the same credit card upon which the charge against the defendant is based, was used in California to obtain possession of a 1983 Buick, which was brought to Canyon County and then cut in pieces for parts. These facts have been verified by the Canyon County Sheriff's Office.\n\nAlthough the defendant has a limited criminal record, the defendant is not unfamiliar with criminal activity. The defendant admits to heavy drug use and abuse. Heavy drug use necessarily involves contact with the criminal underworld. In addition, the defendant admits to long involvement in prostitution. Her associates have generally been described as unsavory people, in trouble with the law. In fact, one of her boyfriends in the past was murdered on the street. There has not been a demonstration that the defendant has ever lived a law-abiding life, separate and apart from vice, prostitution, drug use and theft. The defendant, by her own admission, has a long history of criminal conduct which is not revealed by the formal criminal record.\n\n(D) Her home environment was unsettled and there is an apparent history of sexual molestation by her step-father at a young age, resulting in placement in a series of foster homes and group homes. However, the history also discloses that the defendant had been involved in counseling programs from age 13 to 17, which apparently has had negligible effect on her ability to conform her conduct to the requirements of the law. The history also points out that the defendant has spent time in shelter homes, a juvenile hall and a school for incorrigible girls. As an adult, she has continued to live on the street as a drug user and a prostitute. Although the defendant is now 27 years of age, there is no history that the defendant has made any effort or attempt at living as a law-abiding, productive member of society. Indeed, the entire record discloses that the defendant\n\nhas been hardly anything more than a societal parasite. By that, I mean most of her entire life seems to have evolved around illicit and illegal conduct.\n\n(E) The defendant did cooperate with the police by giving a voluntary statement as to her involvement in the crime. It is my belief, however, that the decision to give a statement to the police was based upon the fact that the evidence overwhelmingly indicated guilt and, by giving a statement, the defendant could, to some extent, manipulate the facts and soften the effect of what actually happened. I also believe that although the defendant's statement is incriminating, there is reason to distrust the statement in its entirety as being a truthful account of what happened, inasmuch as her statements do not conform to the physical evidence nor to reason or common sense.\n\n(F) The defendant did not actually wield the knife that caused the death of the victim. However, the defendant was present and was assisting the co-defendant in the intent to keep the victim quiet at the moment the victim was stabbed to death. In addition, the crime in its inception was this defendant's idea. The evidence suggests that this defendant was a willing participant who counseled and encouraged its commission. There is nothing in the record that would suggest that this defendant's responsibility for the murder is any less, notwithstanding the fact she did not wield the knife.\n\nII\n\nFACTORS IN AGGRAVATION\n\n(A) It was Karla Windsor's idea to commit the crime. Windsor and Fetterly were living on the street. Neither was employed and neither had any apparent means of support. Although the defendant was offered a place to stay until she could get on her feet, she, nonetheless, rejected the offer inasmuch as the offer was extended to her alone and she rejected the invitation so that she could remain with Fetterly on the street. The crime was committed as a means of obtaining property which could be sold so they could ostensibly raise money to leave the area. Again, it was Karla's idea, in the first instance, to commit the crime.\n\n(B) In the planning phase of the crime, the suggestion to hurt Grammer came up. Windsor, at one point in her statement, talks of making a joke about it. I believe the reasonable inferences to be drawn from all of the evidence supports the contention that Windsor and Fetterly knew from the beginning, when they decided to commit the crime, that they would have to kill Grammer.\n\n(C) The defendants broke into Grammer's house without his permission or consent, and there laid in wait for him to come home. If they had, in fact, only intended to burglarize the place, they could easily have done so, departing with their property long before Grammer ever came home. However, they chose to wait for him so that they could take his vehicles, as well as his property. I believe, because they chose to wait for him, that murder was inevitable. I believe that is the only reasonable inference to draw from the evidence.\n\n(D) The defendant, at trial and in the pre-sentence report, is not being truthful about what actually happened. The defendant has attempted, by her testimony, to soften the impact of her involvement, even saying that the stabbing occurred unexpectedly and without her prior knowledge. In actual fact, the statement the defendant gave to the police indicated that when the victim began struggling, Fetterly grabbed the knife, held it to his chest, telling him to be quiet, and when he persisted in struggling, Fetterly then stabbed the victim. All of that was done in the presence of the defendant who was assisting Fetterly in trying to keep the victim from struggling and who was also telling the victim to keep quiet so that he would not awaken the neighbors next door. In addition, the defendant is not being truthful about the placement of the duct tape over Grammer's face. First, she says that they taped his hands in the living room when he was on the couch. She says that\n\nhe kept falling asleep, so they moved him from the living room to the bedroom, where they laid him on the bed so that he would be more comfortable. She then taped his feet. She also says that they asked Grammer to let them take his pickup and the rings. Grammer did not volunteer to let them have any of his property and the defendants informed him that they were going to take his property anyway. At that point, the defendant says Grammer agreed to be tied up to make it look like a burglary and the authorities would not suspect he had been involved. She then taped his face, later helped him smoke a cigarette and gave him a drink of water and then re-taped his face. She says approximately half an hour later, Grammer began to struggle and make noise which precipitated the stabbing. The explanation she gives does not square with the evidence nor does it square with reason and common sense. The evidence discloses that Grammer received a blow to the head of sufficient force and magnitude to cause loss of consciousness. There was broken glass all over the bedroom. I suspect they clubbed him over the head with that bottle and then put him on the bed and tied him up. Indeed, Fetterly's statement is that \"Karla cut the tape on his mouth so he could have a drink of water and smoke a cigarette and then she put the tape back on him. That's when he started to go nuts, after she put the tape back on him. I was trying to hold him still and he hit me in the head with his head and that's when I lost it.\" Fetterly's statement is much closer to the truth than is the statement of Windsor. At trial, the testimony of Dr. Donndelinger was to the effect that the placement of the tape over Grammer's face created a seal so that he could not breathe either through his nose or his mouth. Dr. Donndelinger also testified that had it not been for the penetrating stab wounds to the victim's chest, he would have, nonetheless, died of asphyxiation as a result of the tape. The defendant, Windsor, put the tape over the face of the victim and that, alone, would have caused his death had it not been for the immediate reaction as described by Fetterly resulting from Grammer's inability to breathe. It was on the basis of that reaction that Fetterly stabbed him to death.\n\n(E) The victim, Grammer, did nothing to provoke the incident which lead to his death. On the contrary, he took the defendants into his home, gave them food, let them spend the night with him when they had no other place to go, and there is nothing in the record to suggest that he did anything other than extend the hand of fellowship to them. He was rewarded for his kindness and help by the defendants' murdering him. It is my belief that they would have committed the crime as early as Monday night except for the fact that Grammer's four-year-old boy spent the night with him. Fetterly had already made arrangements to fence the property and, in my judgment, only the presence of the boy kept them from committing the crime at that time.\n\n(F) The murder occurred to silence the only eyewitness to the crime. The record reveals that Grammer took great pride and joy in his vehicles, not even letting his wife drive them. The defendants agree that Grammer did not want them to take the pickup or the rings or the rest of his property, for that matter. The defendant says that Grammer agreed to have his hands tied so that it would look like a burglary and the authorities would not suspect that he (Grammer) had been involved in it. That statement by the defendant obviously is false. Why would Grammer voluntarily cooperate with the defendant in the commission of the crime? He was a man of modest means, his vehicles meant a great deal to him and it is inconceivable that he would voluntarily give the property to the defendants. On the other hand, Grammer was acquainted with the defendants. He could readily identify the defendants to the police. Reason indicates that Grammer was murdered to prevent him from identifying the defendants as the culprits. In addition, Grammer was killed at the exact moment that the defendant was fearful that Grammer's struggling and noise would waken the neighbors and reveal\n\ntheir criminal scheme. The defendant chose not to let that happen.\n\n(G) Disposal of the body in the Snake River is further evidence of the defendants' attempt to cover up the crime and to prevent their detection as the murderers. Dumping the body in the river also demonstrates the defendant to be bankrupt of any feelings of compassion or regard for another person. Indeed, it does show the morbid and depraved nature of the defendant's personality.\n\n(H) Sale of Grammer's property demonstrates the total selfish and callous attitude toward the murder which she had committed. The entire episode, the planning, the murder, the disposal of the body and the sale of the property indicates to me that the crime was carried out in a manner devoid of normal human feelings toward another person. It is proof positive of the warped and depraved attitude of the defendant.\n\n(I) Finally, the crime was totally senseless and exceptionally cruel in its commission. The crime was ostensibly for the purpose of stealing property to obtain money so the defendants could get away and get a new start in life. Grammer was a man of humble means. He didn't have much in the way of property and certainly didn't have anything of any substantial value. He was not a likely target for robbery and murder. It was a situation where the defendants were desperate and were sufficiently callous and hardened in their outlook and manner that they could rob and murder a friend for, in reality, a pittance. I believe the murder was inevitable even from the planning stage of the crime. I believe the defendant knew that also. It seems to me that it would not take an intellectual giant to realize the consequence of placing the tape in the manner it was placed. The stabbing occurred to avoid detection, stemming from Grammer's natural reaction to the tortuous application of the tape. The body was disposed of in the Snake River much like a piece of garbage, also to avoid detection. Again, it was totally senseless and exceptionally cruel.\n\nIII\n\nSTATUTORY AGGRAVATING CIRCUMSTANCES\n\n(A) The murder was especially heinous, atrocious, cruel and manifested exceptional depravity. (5)\n\n(B) By the murder and circumstances surrounding its commission, the defendant exhibited utter disregard for human life. (6)\n\n(C) The murder was one defined as murder of the first degree by Idaho Code, Section 18-4003(d), and it was accompanied with the specific intent to cause the death of a human being.\n\nI believe on this last statutory ground, some comment is in order. The Court, in Instruction No. 16, submitted to the jury two theories of murder upon which they could find the defendant guilty under Count I of the Information. The jury, by its verdict, found the defendant guilty of the second theory of first degree murder in that the defendant, on or about the 7th day of September, 1983, in Canyon County, with malice aforethought, wilfully, unlawfully and intentionally murdered Sterling Gene Grammer while perpetrating or attempting to perpetrate a burglary, as defined in Instructions Nos. 19 and 20. The Court, by Instruction No. 14, instructed the jury that murder is the unlawful killing of a human being with malice aforethought. The Court further instructed the jury that the malice may be express or implied. It is express if the evidence shows an unlawful and deliberate intention to kill a human being without just cause or excuse. It is implied if the evidence shows no considerable provocation for the killing. It is also implied when the evidence of the circumstances surrounding the killing shows the presence of an abandoned and malign heart, which means a condition of heart and mind which has no regard for social or moral obligation. Thus, malice is implied when the evidence shows that a killing resulted from an act or acts involving high degree of probability that death would result\n\nwhen such act or acts have been committed for a base anti-social purpose and with wanton disregard for human life. The Court, in Instruction No. 13, defined wilful as intentional. In addition, under the case of State v. Owen, the Idaho Supreme Court has basically stated that where the homicide is committed in the perpetration of or attempt to perpetrate one of the enumerated felonies, proof of deliberation and premeditation is not essential. The reason that it is not essential is that he who is guilty of perpetrating a crime which the statute defines as first degree murder commits a crime so offensive to society that should death result therefrom, it is murder of the first degree. The Court further has said that where \"any person commits or attempts to commit any of these major felonies, he is motivated by malice and when the killing of a human being directly results, it is murder because malice, the essential element of murder, is present. The felon's malicious act in perpetrating or attempting to perpetrate his planned crime is justly regarded by the law as the causative antecedent of the homicide.\" In addition, by Instruction No. 12, the jury was instructed relative to the law of aiding and abetting. Although the jury did not return a verdict nominating the defendant as an aider and abetter, the evidence is clear that the defendant was an aider and abetter. It was she that planned the crime, it was she who placed the tape on the defendant which would have caused his death but for the intervening stab wounds, it was she who was assisting in the attempt to quiet the victim immediately before his death. Instruction No. 12 says that to \"aid and abet\" means to assist, facilitate, promote, encourage, counsel, solicit or invite the commission of the crime. The definition encompasses the activity of one who knowingly participates by any such means in bringing about the commission of the crime. Participation is wilful if done voluntarily and intentionally and with the specific intent to do something the law forbids, or with the specific intent to fail to do something the law requires. It contemplates a sharing by the aider of the criminal intent of the perpetrator. Further, in order to aid and abet another to commit a crime, it is necessary that the accused wilfully associate herself in some way with the criminal venture and wilfully participate in it as she would in something she wishes to bring about. That is to say, that she wilfully seek by some act or omission of hers to make the criminal venture succeed. The evidence is clear beyond a reasonable doubt that the defendant wilfully and intentionally committed all of the acts which would make her an aider and abetter under the instruction. It is clear beyond a reasonable doubt that the murder was committed in the perpetration of a burglary and that it was accompanied with the specific intent to cause the death of a human being.\n\nIV\n\nConclusion\n\nIdaho Code, Section 19-2515, provides that the sentence of death shall not be imposed unless the Court finds at least one statutory aggravating circumstance. It is my belief that the evidence shows beyond a reasonable doubt that three statutory aggravating circumstances exist in the present case. The statute further provides that where the Court finds a statutory aggravating circumstance, the Court shall sentence the defendant to death unless the Court finds that mitigating circumstances which may be presented outweigh the gravity of any aggravating circumstance found and make imposition of death unjust. In weighing the mitigating circumstances against the aggravating circumstances, and particularly the statutory aggravating circumstances, it is my belief that the aggravating circumstances clearly outweigh the mitigating circumstances and, indeed, the mitigating circumstances are depreciated significantly by the explanations given. Therefore, it seems to me that the mitigating circumstances do not outweigh the gravity of the aggravating circumstances. The question then is, do the circumstances surrounding the death of Sterling Gene Grammer and the involvement of the defendant,\n\nKarla Windsor, make imposition of the death penalty, as it applies to her, unjust. In answer to that question, I return again to the thought that one must be held accountable for the act a person has done. This defendant set in motion the chain of events which lead to the cruel and savage murder of Sterling Grammer. In my mind, by her actions and her conduct, she is as guilty as the person who wielded the knife. In my mind, her responsibility is as great or greater than the person who wielded the knife. I, therefore, believe that the imposition of the death penalty in this instance is not unjust and, in fact, the only way that Justice can be accomplished for the senseless and savage murder of Sterling Grammer is to sentence the defendant to death because her conduct demands it and the ends of Justice demand it.\n\nRespectfully submitted this 23rd day of March, 1984.\n\ns/Richard L. Harris\n\nRichard L. Harris\n\nAPPENDIX B\n\nSENTENCING\n\nThe evidence we heard today is really the only additional factor that I have had to give additional consideration to, along with my review of the pre-sentence, in light of the testimony that we heard today.\n\nI am going to go ahead and make this decision at this time, because I know it is important to everyone involved, and because not only you, but the people have a right to know what the Court's position is in this matter. But I am going to reserve the right to make my formal decision in the form of written findings and Conclusions so that I do not run the risk of misstating something or overlooking something, so it will be in a formal written document and signed by the Court as required by the laws of the State of Idaho.\n\nHowever, it is my feeling that is a sterile way of telling you what my decision is. I would prefer telling you eye-to-eye, face-to-face what my decision is.\n\nIn approaching this sentence I first gave consideration to the fact that it had to be individualized; that I had to consider all available mitigating circumstances that may have any bearing on the issue of your moral or legal culpability, as well as the aggravating circumstances that might bear on that same question.\n\nI took the position that if I determined the culpability was not as great as the culpability of the co-defendant Mr. Fetterly, so as to make a lesser sentence not be unjust, then the Court felt it could consider sentencing alternatives.\n\nOn the other hand, if the Court determined after review of those same things that your culpability and responsibility in the crime were equal to or as great as that of the co-defendant, then in the Court's judgment a lesser sentence would make the sentence not only disproportionate, but would be a disparancy that could not be rationally reconciled.\n\nThe Court is now convinced, and possibly even more convinced that the sentence I imposed on Mr. Fetterly was just and proportionate to the savage and brutal slaying that occurred to Mr. Grammer.\n\nSo the question, then, is what is your legal and moral culpability in these crimes? After considering the entire record before the Court, the evidence in mitigation and aggravation as it relates particularly to the time period of the crime itself. In my judgment the evidence is clear that the plans to commit these crimes were conceived, not like a bastard child that might have resulted from a fling or an accident, but were plans that were put into effect after considerable Discussion and planning between you and the co-defendant.\n\nWe have the testimony of Zeke Palacios concerning your contact with him as a fence to move the property that might be accumulated. There was a long period of time that you and Mr. Fetterly spent in the school yard discussing the possibilities, pro and con, and then there was a period of time that existed while you waited for Mr. Grammer to return after you had entered into the home of Mr. Grammer.\n\nIt is my opinion and my belief, based on the evidence, that when this matter is scrutinized and analyzed for what it is, that you were the brains and the motivating force that set this catastrophe in motion. I do not mean by saying that that Mr. Fetterly did not have an equal or even possibly greater involvement, but insofar as why it came up, why it happened and how it was to happen, I believe that the evidence is clear that you desired to have a new start in life; that there were the threats of the alleged warrants out for your arrest and for Mr. Fetterly's arrest; and that the motivation was to obtain the property, the finances, the vehicle, to make the escape into a new life.\n\nThe evidence, in my opinion, is absolutely clear that you were a willing participant. You not only counseled, but encouraged the commission of the crime.\n\nI have searched the record in hopes of finding some evidence of the fact that you some way might have been threatened by Mr. Fetterly or that he had some kind of influence that would control your judgment in the decisions that were to follow. Listening to the evidence this morning particularly, I have the feeling that you are kind of like a Jekyll and Hyde, because you are a person who is described as a person who has compassion and feeling for the underdog or the downtrodden or the helpless. In fact, for a short period of your life you have worked very effectively in those areas. But at the same time, I think that the evidence is absolutely clear that you were able to commit, along with Mr. Fetterly, this heinous crime against a person who had befriended you and taken you into his home and given you food to eat.\n\nIn the pre-sentence and in some of the testimony you have been described at times as being a gullible person capable of being manipulated. Yet in my opinion the evidence is that in your lifestyle, at least in recent years, you have demonstrated a deliberate choice concerning the direction your life was to take. By that, I mean that the evidence demonstrates that you have the education, the talent, and the ability to lead a productive life, and to take the course in life that would have directed you in a meaningful manner in achieving the goals you have talked about. Your mother has testified that she gave you the opportunity of a place to live. True, it did not include Mr. Fetterly, but it was the despair that you have talked to the Court about, frustration and feelings you had at that time were manufactured in your own mind, inasmuch as the real facts do not support that destitute position that you talk about.\n\nThere were people that loved you and cared for you and were willing to extend open arms to you without the association of Mr. Fetterly. I think that their feelings and their judgment of Mr. Fetterly was well-founded. I think if you would just look at the history of your own life, that your choice in companions has not been good, and of course I am certain there are exceptions to every rule, and there might have been for short periods of time, but by and large your association and your contact with people has been primarily with people in trouble or people which were not constructive or beneficial to society. That may have been from the feelings you have towards the downtrodden and the underdog that you are drawn in that direction.\n\nThe Court respects you for that compassion and that feeling, but without a question of a doubt in my mind, you are an intelligent person, that you know right from wrong, and that can make intelligent decisions.\n\nIn trying to look for mitigating factors that might influence the Court's decision on the culpability at the time of the commission of the crime, the Court has taken into consideration each and every one of the mitigating factors discussed by counsel. I did consider the fact that you are twenty-seven years of age, but I am not sure that is a mitigating factor or a factor that works against you, inasmuch as the decisions we are talking about is the decision that occurred on the night of the commission of this murder, and certainly I think you would have to agree if a person is twenty-seven years of age, not handicapped\n\nin some manner, that they are the age of reason; they have experience in life; and there is really no justification based upon age itself.\n\nThe Court has taken into consideration your record is void of any convictions for violent criminal activity.\n\nThe Court can take into consideration and does take into consideration, but places very little weight on the fact that there are two pending felonies or were two pending felonies at the time of the commission of this crime. The statement made by the prosecutor certainly supports the fact that there was a basis for the filing of those charges, but the Court also believes in the presumption of innocence your counsel talked about, and it is just a consideration that the Court has thought about.\n\nI think more importantly, while it may not be a criminal history, what in fact is your history. The Court is aware -- I do not necessarily want to bring it out to embarrass you or cause it to be a Discussion in open court, but there was some traumatic experiences in your early life because of your position in a home with a step-father situation that caused you to be removed or caused you to leave.\n\nAgain the Court has great feeling and compassion for the position that you were in at that time. But you were placed in foster homes, and the Convent of the Good Shepherd, and a shelter home. I believe from reading the record and analyzing the record before the Court that you did from time to time run away from those placements; that you, by your own testimony, spent three years in the Convent of the Good Shepherd, and while there was a period of time that you admit to as far as prostitution, there was a mental development that you allowed yourself to be engaged in, and that was survival of the fittest, by using your body or whatever was necessary to survive on the streets. And probably because of that history, you had become somewhat hardened, and that course in your lifestyle has caused you maybe to make some decisions you might not have made otherwise.\n\nAgain, it goes back to your association with companions you pick up.\n\nAs far as your work history is concerned, it is rather sporadic. There is no real stability in either your lifestyle or work history. It is a matter of existence. And while it is not a criminal record per se, it is void of any real merit or any real plusses that the Court could consider.\n\nI did take into consideration the fact you were cooperative with the law enforcement upon your arrest, and that you did admit some involvement in the commission of the crime. I don't think it is any surprise to counsel, because I think they were present in Mr. Fetterly's sentencing. Based on my hearing of the testimony and review of the records, felt ever since the completion of the trial that while the statements bordered at times on the truth of what might have happened, there is serious gaps in the testimony, there is some fabrication, there is some distortion of what really in fact did transpire based on the physical evidence available to the Court and produced in the form of testimony and evidence also. I will discuss that in a little more detail later.\n\nI have taken into consideration also that you are intelligent, you have received training in various fields, and that would make it possible for you to be a productive member of society but for these crimes. However, the Court has to recognize you have not had the inclination, at least to the point, to maintain any particular employment or any real desire to be a productive member of society, other than just long enough to get from pillar to post or to exist from one bad relationship to another.\n\nI have taken into consideration that you did not inflict the actual knife wounds that caused the demise of Mr. Grammer. However, as I will discuss a little later, when you look at the cold, hard facts in this case, it is really a difference without a distinction.\n\nI have taken into consideration the fact that you were not raised in a stable home environment, but that is as far as a mitigating circumstance loses certain strength\n\nwhen you consider the fact that you were by your own testimony counseled and assisted in your psychological adjustment for the period of time between twelve to seventeen. There is really not evidence that you benefitted from that counseling.\n\nI have taken into consideration that there is no credible evidence that you have had any addiction to alcohol and/or drugs. But I think that the record is clear by your own admission again that you have abused the use of drugs and/or alcohol throughout most of your adult life.\n\nIn looking at the aggravating circumstances, I have to believe that most of the things I said in Mr. Fetterly's case are applicable here. I recall very well that one of the first statements I made was that the crime was totally senseless and void of any compassion or feeling. The facts are that Mr. Grammer had not only befriended you on earlier occasions by providing you with a place to sleep and food to eat, but you were actually in his home and about his person where you could make a decision for yourself that he was a man of modest means; that he did not have very much property; and that the little property that he did have had a particular sentimental value to him.\n\nDuring the testimony of the trial you recall that his wife testified she was not even allowed to use his car. That he padlocked his home when he left, and that on the night he had you stay over, provided a place for you and Mr. Fetterly to sleep, awakened you about 5:30 in the morning so that you would not be left in his home when he left. In other words, he was protective of the few material belongings that he had.\n\nKnowing that, knowing the little value that was there, to set this crime in motion is senseless and void of any compassion or feeling.\n\nI think it is clear from the evidence that while your initial Discussion and your planning with Mr. Fetterly was to burglarize Mr. Grammer's home and rob Mr. Grammer of his possessions, that it was discussed, and it was clear in your mind, based upon not only what transpired here, but your conduct and life with Mr. Fetterly before that. Whatever actions necessary would be taken. And you cannot close your eyes to the fact that maybe it might have even gone beyond your wildest dreams, because when you set a force in motion like that and the plan is clear, that you are going to take a man's prized possessions, invade his castle, he is going to react, particularly when he is in a position to identify you. The signals are all that you are going to have to take whatever action is necessary to silence him to complete your plan.\n\nThe killing was exceptionally brutal. In my judgment, as I stated in Mr. Fetterly's case, it was the conduct of a depraved mind. Why would the Court use the language that your counsel says is not applicable? The simple fact is that when you look at the cold, hard facts, in the absence of any explanation, and that explanation could only come from you or Mr. Fetterly, and it is not in the record.\n\nMr. Grammer received a blow to the back of his head, according to Dr. Donndelinger, would have rendered him or any person of like stature unconscious. The duct tape, of course, then was placed upon Mr. Grammer's person, and I am convinced in my mind, I believe without a question of doubt that the evidence supports that the only way that duct tape could have been placed on Mr. Grammer was while he was rendered helpless, because of his feeling for his home and his property, and the fact he was to be at work. He was the type of person that did not miss work, even when he was ill, according to the evidence.\n\nThat duct tape, when you examine the pictures, was not just lightly placed around an individual's hands or feet so as to give the appearance that he was to be burglarized or robbed, but was in fact placed around there so he was rendered immobile and helpless. The duct tape was then placed over his eyes, his mouth, and his nose.\n\nI think all you have to do is examine Exhibit Number Thirty-five to see how clear and plain the evidence really is in that regard. There are pictures in evidence that show Mr. Grammer's body while it was still in the water before it had been touched or moved to any extent at all, and the mask is in place.\n\nDr. Donndelinger testified about removing that mask from his face and the fact it was in a sealed condition. It would seem very likely to the Court that if in fact that tape that was over his nose had been placed there by either you or Mr. Fetterly, after Mr. Grammer was killed, for whatever reason, because you just did not want to see his facial appearance or whatever reason, you would have told the Court that, and the jury.\n\nYou are the only people that are capable of telling the jury or the Court that, and the record is void of that information. The fact is that the tape is demonstrated by Exhibit Number Thirty-five, is far down below the nostrils or where there could have been any breathing capacity. It is in a sealed condition.\n\nDr. Donndelinger further testified that Mr. Grammer would not have lived, whether he had been stabbed or not, with the tape in that position. Why would you tape Mr. Grammer's eyes, nose and mouth? In my opinion, after he had been rendered unconscious, that was placed over his eyes, nose, and mouth, maybe so you could avoid identification. You could take his personal property from his body and search him for his keys and take his rings or whatever you had in mind. But he became conscious during that period of time, and even though the tape may or may not have been placed on before that time, at some time during that time the tape is placed on him in that manner. And of course he is fighting for his life. As I explained to Mr. Fetterly, anybody with his hands tied in the manner in which Mr. Grammer's hands were tied and his feet were tied would fight for his very existence. It may have caused his head to come up and hit Mr. Fetterly's. But the evidence is clear to me at that point there was an abandoned heart on the part of you and Mr. Fetterly in the fact the knife was thrust into Mr. Grammer's body no less than five times.\n\nYour testimony is that you were trying to hold him down, laying over his legs while Mr. Fetterly was over the main part of his body. The testimony in my recollection is the knife was first held to his chest, trying to keep him quiet, to silence him. Then the knife was thrust into his body in the vicious manner in which it was.\n\nNow, if your course of conduct and actions thereafter had been different than what it was, I may have tried to work my way around to believe you were surprised by what had happened. But when you look at the facts subjectively and do not allow yourself to get into the subjective part of it, it is simply not there. Even after Mr. Grammer had been killed in the manner in which he was killed, you and Mr. Fetterly were able to come back to that residence, even though you had his car at that time and could have removed whatever property you wanted, and even after a period of time when the shock would normally set in if you were innocent, there is no indication that it was effective as to either you or Mr. Fetterly. In fact, you did return to the home and you proceeded to pick up the few belongings Mr. Grammer had and attempted to pawn them or sell them to Mr. Palacios or any buyer that he could obtain for you. Just common sense absent some kind of callousness and some type of voidness for human compassion and feeling would have caused the normal human being to either turn themselves in at that time or leave the community. But instead you and Mr. Fetterly drove around as if nothing had happened. You lied as to the property you possessed, even to the people that were friends, where it came from, what it was and how you happened to have it.\n\nThe taking of the body, of course, to the river in the manner in which it was dumped is incapable of explanation. I think I said in Mr. Fetterly's sentencing that you would not really do that to an animal, let alone a human being, particularly a human being\n\nyou knew was loved by a four-year-old boy that would sooner or later have to face the fact that his father had been killed in the manner in which he had been killed.\n\nTo me that handling of the body, particularly after the time you had to think about it, because you did not just immediately dispose of the body like it does happen in some criminal cases; again, thought was put into it. You returned to the home after almost twelve hours, and then the body was taken to the river. To me that is an utter disregard for morality or decency or the effect that it might have on one's loved ones. There was no remorse shown at the time that it was relevant.\n\nI have felt at times now, since you are in the predicament you are in, there have been indication of remorse and feeling. People have testified that you are capable of compassion and feeling, but the time that counts and the person that counts is around the time and events of the death of Mr. Grammer, and there was absolutely no remorse. A person that was capable of going forward after the death that he suffered and selling his personal belongings for the trivial amount that was there certainly is not indicative of any kind of remorse that I'm aware of.\n\nYour testimony is clear to the Court that the record is that you, particularly at the time we are talking about, was not under the influence of any mind-controlling drugs and/or alcohol, so that your intent or your state of mind could have been confused or affected or had some kind of control on the physical acts that you took. You in fact had entered the home, according to your testimony, the night before and were lying in wait for the return of Mr. Grammer. That because of your financial situation you did not have any drugs or alcohol, and so that your state of mind was clear and capable of making right decisions.\n\nYour intent was not to go further than just to try to get Mr. Grammer to cooperate with you in the commission of burglary and robbery. I have already talked about the fact that defies common sense when you think about he had such few possessions and what they meant to him sentimentally.\n\nIn your testimony you talked about entering the window. When you entered the window, there was the bottle or whatever it was that was knocked off the dresser, and that the disturbance that was all over the floor was as a result of that entry. That just does not stand up when you examine the facts, because if your purpose was to get your friend to go along with you and make it look like a burglary or robbery, and you wanted him to go along with that kind of plan or scheme, he certainly would not be inclined to do so if when he walked in the house there was broken glass all over the floor, his drawers had been pulled out, and things were ransacked. That also has not been consistent with the testimony that I have heard here today about how clean and neat you are, because the room had been ransacked and was a mess, and there was the opportunity to clean that up and make it halfway presentable if your true intent was not to go any further than to try to get Mr. Grammer to go along with the burglary.\n\nI think it was more indicative of the fact that you intended to disguise your presence by knocking Mr. Grammer unconscious and covering his face and leaving with his property whether he liked it or not, and if he got in your way, whatever means were necessary would be taken.\n\nI have searched and searched the record for some evidence of provocation on the part of the victim. It is simply not there. He went out of his way, it seems, to be a friend and provide for you. He asked nothing more than for his life and for the sanctity of his castle.\n\nAnother thing that crosses the Court's mind that bears upon the question of what your true intent was concerning the murder is how it was that you could conceive or believe, based upon what transpired thereafter, that Mr. Grammer could be in a tied-up position in the manner in which he was tied up for the period of time that it would take to dispose of the property. Even after two days' period of time you\n\nstill had not disposed of very much property of any value, and it has crossed the Court's mind, at least, what Mr. Grammer was supposed to be doing during all of this period of time while you were selling his belongings, because that was apparently necessary before you could leave town. It is just inconsistent and contrary to common sense that he was to be left in that condition for that period of time, particularly based on your prior knowledge of him. You knew that he would be missed at work, and his boy would be likely to come by, or his ex-wife, or his other friend could drop by.\n\nThere was something the prosecutor discussed that I want to make one comment on. If your true intent was to just take some property as having a means to get out of town and start a new life, particularly with the threats of the alleged warrants outstanding, there was ample time while you were waiting, even in the school yard, you could have made your entry, probably even sooner. But even if you hadn't've, if you'd waited until the time you did, there was ample time from then until Mr. Grammer came home to remove the property that was there. I believe even a vehicle was there. Certainly he could not be driving both of them.\n\nBut I think that the real motive was you wanted the diamond rings and the location of the same, and Mr. Grammer had already told you, advised you, that he was not going to depart or separate from those belongings. So again, your intention, in my judgment, was to take the same with whatever force was necessary.\n\nNow, as far as the statutory aggravating circumstances that the Court must find in this case, the Court without question feels that number (5), the murder was especially heinous, atrocious, or cruel, manifesting depravity, applies to this case. It was coldblooded, and it was pitiless, a senseless killing. I can't hardly think of a greater torture than the striking of a person in the back of the head and the taping. The vivid portrayal of what was to occur, when you are rendered helpless to do anything about it. The fact you could feel the tape going over your eyes, over your mouth, and then before it actually even proceeded, over your nose. What would happen if your air passage was sealed off when the knife was pulled, when you were rendered so helpless that you couldn't even scream or holler or move or do anything. To me is certainly a crime of a heinous, atrocious nature.\n\nNumber (6), the murder or circumstances surrounding its commission, the defendant exhibited utter disregard for human life. I think what the legislature and the people are asking us to look at is that murder on the spur of the moment, or did it occur without any really thought put into it, and what transpired shortly thereafter, so that the Court can look at the totality of the circumstances surrounding its commission. And here we have not only the lying in wait and preparation and thought and Discussion even with the fence to take the property when the crime was committed against a person who you knew could identify you unless he was silenced.\n\nWe have the disposal of the body and the manner in which it was disposed of, the driving around for a couple of days as if nothing had happened, the selling of the belongings right off the body itself. To me that type of conduct, as I indicated, I believe already manifests such depravity as to offend all standards of morality and human intelligence.\n\nNumber (7), the Court also feels is applicable, in that it is clearly murder defined as murder of the first degree under Section 18-4003, and examination of the instruction submitted to the Court and the evidence before the Court, I think it is absolutely clear that the murder or the killing was accompanied with the specific intent to cause the death and demise of a human being.\n\nCounsel has argued and rightfully so, I don't fault her because she did an excellent job in this case, but the jury somehow has not found deliberation and premeditation, and therefore it is non-existent in this type of crime. I am confident that the jury may very well have felt that since the defendant\n\ndid not actually use the knife, that they preferred to stay away from that particular finding. But the finding is there by a jury of twelve and by the people of the State of Idaho, and that the people of the State of Idaho and the legislature have imputed malice, deliberation, and premeditation into this type of crime when it's committed in the commission of certain enumerated crimes, and that, of course, is because of the propensity of the danger to commit some kind of a serious crime or injury when it is involved with the commission of those particular crimes.\n\nHowever, this Court, in an effort to be extra cautious, did nevertheless include in the instructions that the finding of malice particularly had to be there, and that it had to be an intentional killing before that jury verdict could be returned.\n\nSo as difficult as it has been for this Court personally and as a Court, it is my considered judgment that to impose a sentence of less than death where the defendant directly aided and abetted in the killing, where the requisite intent has been found, would make the sentence not only disproportionate to the sentence imposed on the defendant Fetterly, but would create a disparity in sentencing that could not be reconciled.\n\nTherefore, having taken into consideration and after having duly deliberated the nature of the crime and the Court's responsibility to the defendant and to society, the Court finds that the defendant did actively participate in this brutal and savage slaying of a person who was her friend; that the intentional killing took from the victim what an offender and this Court can never restore, and that is the fragile gift of life.\n\nThe defendant's actions were the final betrayal of another human being and the ultimate affront to society.\n\nThe Court, after serious consideration, concludes that the mitigating circumstances, while greater in this case than in the case of Mr. Fetterly, still when looked at in true perspective and particularly to the time period that is relevant in a capital case, do not outweigh the gravity of the aggravating circumstances so as to make unjust the imposition of the death penalty.\n\nAs the state has argued, the will of the people has been set forth in Idaho Code 19-2515, and the will of the people is very clear. And while the Court does not feel it is particularly bound because mandatory language is used in this particular case, the Court feels and concurs with the particular will expressed therein, and in my discretion I concur with the fact that where the aggravating circumstances do outweigh the mitigating circumstances, in particularly as I have outlined the death penalty as not disproportionate. No legal cause or reason to the contrary having been shown, it is the judgment of this Court that the death penalty should be imposed on the defendant for the capital offense for which she was convicted of.\n\nTherefore, it is my intent to find again the defendant under the evidence and the law before this Court, is guilty of murder of the first degree, the same having been committed in the perpetration of or attempt to perpetrate a burglary, and that punishment should be imposed in the manner prescribed by law. That the same should occur no later than forty days from this date.\n\nThe Court further concludes that the defendant is guilty of second-degree burglary by verdict of the jury. Punishment should be imposed by a sentence to the Idaho State Board of Corrections for an indeterminate period of time not to exceed five years, the same to run concurrent to life imprisonment if for some reason the penalty of death is not imposed.\n\nThe Court further concludes that the defendant is guilty of grand theft by the verdict of the jury, and punishment should be imposed by sentence to the Idaho State Board of Corrections for an indeterminate period of time not to exceed fourteen years, the same to run concurrent to the penalty imposed for second-degree burglary as hereinbefore set forth.\n\nI will remand the defendant to the custody of the Canyon County Sheriff. I said\n\nnot less than forty days. I'm going to name that date. May 3rd, 1984. While the Court realizes that it will be set aside, there will be an appeal, it is required by statute that it be set.\n\nThe defendant is remanded to the custody of the Canyon County authorities to be delivered to the proper authorities at the Idaho State Penitentiary. (Whereupon court then adjourned.)\n\n",
    "body_length": 148579,
    "citedas": [
      "716 P.2d 1182",
      "110 Idaho 410"
    ],
    "attorneys": "Renae Hoff, of Gunn \u0026 Hoff, Caldwell, for defendant-appellant. Jim Jones, Atty. Gen., Lynn E. Thomas, Sol. Gen., Boise, for plaintiff-respondent.",
    "category": [
      "78"
    ],
    "judges": "Donaldson, Chief Justice. Shepard, and Bakes, JJ., concur. Shepard, J., concurs in the result in Part IX. Huntley, Justice, specially Concurring. Bistline, Justice, Dissenting in part; Concurring in part.",
    "citation_count": 0
  }
}
