{
  "id": "iYOqPmYBTlTomsSBdvBp",
  "document": {
    "title": "O'Bryan v. Estelle",
    "full_title": "RONALD CLARK O'BRYAN -APPELLANT, v. W. J. ESTELLE, JR., DIRECTOR, TEXAS DEPARTMENT OF CORRECTIONS -APPELLEE.",
    "jurisdiction": "Fifth Circuit",
    "date": "1983-08-26T00:00:00.000Z",
    "docket": "No. 82-2422.",
    "body": "Before RANDALL and HIGGINBOTHAM, Circuit Judges, and BUCHMEYER,*fn* District Judge.\n\nRANDALL, Circuit Judge:\n\nRonald Clark O'Bryan was convicted of the murder of his own child in a Texas state court in 1974 and sentenced to die. On appeal from the federal district court's denial of habeas corpus relief, 28 U.S.C. ยง 2254 (1976), the defendant contends:\n\n(1) that the exclusion of three jurors who expressed conscientious objections to the death penalty violated the rule of Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968);\n\n(2) that the Texas death penalty procedure is unconstitutional because it does not provide for jury instructions concerning mitigating circumstances;\n\n(3) that the defendant's constitutional rights were violated when the trial court permitted the prosecutor to comment on defense counsel's failure to ask defense witnesses certain questions about the defendant's reputation; and\n\n(4) that the trial court's refusal to instruct the jury on the law governing parole as it relates to persons sentenced to life imprisonment violated the defendant's due process rights.\n\nWhile we are compelled to recognize that O'Bryan has raised a serious challenge to the exclusion of two of the three jurors under Witherspoon, we conclude that the district court's denial of habeas corpus relief should be affirmed.\n\nI. FACTUAL AND PROCEDURAL BACKGROUND.\n\nO'Bryan was convicted of murdering his eight-year-old son, Timothy, for remuneration or the promise thereof, namely, the proceeds from a number of life insurance policies on Timothy's life. See Tex.Penal Code Ann. ยง 19.03(a)(3) (Vernon 1974).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The facts of this case as adduced at trial are set forth in detail in the Texas Court of Criminal Appeals' disposition of O'Bryan's direct appeal. O'Bryan v. State, 591 S.W.2d 464 (Tex.Cr.App.1979) (en banc), cert. denied, 446 U.S. 988, 100 S. Ct. 2975, 64 L. Ed. 2d 846 (1980).We have summarized them briefly here.\n\nThe record reflects that O'Bryan, who worked as an optician at Texas State Optical Company, had serious financial problems. The family was delinquent on a number of loans and had been forced to sell their home to meet their most pressing obligations. O'Bryan discussed his financial burdens with friends and acquaintances, informing some of them that he expected to receive some money by the end of the year. Despite his financial difficulties, O'Bryan substantially increased the life insurance coverage on his two children, Timothy and Elizabeth Lane, during 1974. By mid-October there was $30,000 worth of coverage on each child, while the coverage on O'Bryan and his wife was minimal.\n\nIn August, 1974, O'Bryan tried unsuccessfully to obtain cyanide where he worked. In September, he called a friend who worked at Arco Chemical Company, and the two discussed the varieties and availability of cyanide. O'Bryan continued to discuss cyanide among his fellow employees at Texas State Optical. Shortly before Halloween, O'Bryan appeared at Curtin Matheson Scientific Company, a chemical outlet in Houston. When he discovered that the company had cyanide available only in large quantities, O'Bryan asked the salesperson where he could obtain a smaller amount.\n\nOn Halloween, Thursday, October 31, 1974, the O'Bryan family dined at the home of the Bates family. The children of both families had planned to go \"trick or treating\" together in the Bates' neighborhood. The defendant and Mr. Bates accompanied O'Bryan's children and Bates' son on the Halloween outing. When the party arrived at the Melvin's home, the lights were out, but O'Bryan and the children went up to the home anyway. When no one answered the door, the children went on to the next house; O'Bryan remained behind for about thirty seconds. He then ran up to the children, \"switching\" at least two \"giant pixy styx\" in the air and exclaiming that \"rich neighbors\" were handing out expensive treats. O'Bryan offered to carry the pixy styx for the children. Back at the Bates' home, O'Bryan distributed the pixy styx to his and Bates' two children, and gave a fifth stick to a boy who came to \"trick or treat\" at the door.\n\nAfter the Halloween festivities had been completed, O'Bryan took his children home, while his wife went to visit a friend. O'Bryan informed the children that they could each have one piece of candy before going to bed; Timothy chose the pixy stick. The boy had trouble getting the candy out of the tube, so O'Bryan rolled the stock in his hand to loosen the candy for his son. When Timothy complained that the candy had a bitter taste, O'Bryan gave him some Kool-Aid to wash it down.\n\nTimothy immediately became ill and ran to the bathroom, where he started vomiting. When Timothy became sicker and went into convulsions, O'Bryan summoned an ambulance. Timothy died within an hour after he arrived at the hospital. Cyanide was found in fluids aspirated from his stomach and in his blood. The quantity of cyanide in the blood was well above the fatal human dose.\n\nThere was conflicting testimony at trial concerning the extent to which the defendant showed remorse at the hospital and at his son's funeral. During the days following Halloween, O'Bryan gave conflicting stories as to the origin of the pixy styx, but he eventually claimed that the pixy styx came from the Melvin home. Mr. Melvin was at work, however, until late in the evening on Halloween.\n\nO'Bryan was charged with and convicted of capital murder. At the sentencing proceeding, the State reintroduced the evidence that it had presented at trial and the defendant presented nine lay witnesses who stated that they did not believe that O'Bryan was likely to be a danger to society in the future. The jury answered the two special issues affirmatively\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and O'Bryan was sentenced to die.\n\nO'Bryan's conviction and sentence were affirmed by the Texas Court of Criminal Appeals on September 26, 1979. O'Bryan v. State, supra. His application for a writ of certiorari to the United States Supreme Court was denied in 1980, O'Bryan v. Texas, 446 U.S. 988, 100 S. Ct. 2975, 64 L. Ed. 2d 846 (1980), as was his first application for state habeas corpus relief.\n\nIn July, 1980, he filed a petition for federal habeas corpus relief, which was dismissed without prejudice so that he could return to state court to present additional unexhausted claims. His second application for state habeas corpus relief was denied on September 1, 1982, and his execution date set for October 31, 1982. On September 29, 1982, O'Bryan filed his second application for federal habeas relief. The district court denied his application for the writ and stay of execution on October 29, 1982. We granted his application for a stay and request for a certificate of probable cause on October 27. 1982. O'Bryan v. Estelle, 691 F.2d 706 (5th Cir.1982).\n\nII. THE WITHERSPOON ISSUE.\n\nAt least seventeen persons were excused for cause from serving on the jury on the basis of their opposition to the death penalty. O'Bryan challenges the exclusion of three of them: Jurors Wells, Pfeffer, and Bowman.\n\nIn Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), the Supreme Court set aside a defendant's death sentence where members of the venire had been excluded solely because they had conscientious scruples against capital punishment. The Court held that a potential juror could not be excused for cause on the basis of his opposition to the death penalty unless he was \"irrevocably committed, before the trial has begun, to vote against the penalty of death regardless of the facts and circumstances that might emerge in the course of the proceedings.\" Id. at 522 n. 21, 88 S. Ct. at 1777 n. 21. Such persons may be excluded only if they make it\n\nunmistakably clear (1) that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them, or (2) that their attitude toward the death penalty would prevent them from making an impartial decision as to the defendant's guilt.\n\nId. (emphasis in original). The Supreme Court reasoned that a jury from which all persons who had reservations against imposing the death penalty had been excluded was a jury \"uncommonly willing to condemn a man to die.\" Id. at 521, 88 S. Ct. at 1776.\n\nBoth the Supreme Court and this circuit have insisted upon strict adherence to the mandate of Witherspoon. The courts have required a death sentence to be set aside even if only one potential juror has been excluded for opposing the death penalty on grounds broader than those set forth in Witherspoon, see Davis v. Georgia, 429 U.S. 122, 97 S. Ct. 399, 50 L. Ed. 2d 339 (1976); Marion v. Beto, 434 F.2d 29, 32 (5th Cir.1970), regardless of whether the state has any peremptory challenges remaining at the close of voir dire. Alderman v. Austin, 663 F.2d 558, 564 n. 7 (5th Cir.1982), aff'd in relevant part, 695 F.2d 124 (5th Cir.1983) (en banc); Granviel v. Estelle, 655 F.2d 673, 678 (5th Cir.1981), cert. denied, 455 U.S. 1003, 102 S. Ct. 1636, 71 L. Ed. 2d 870 (1982); Burns v. Estelle, 592 F.2d 1297, 1299 (5th Cir.1979), aff'd 626 F.2d 396 (5th Cir.1980) (en banc); contra, Davis, supra, 429 U.S. at 124, 97 S. Ct. at 400 (Rehnquist, J., dissenting).\n\nA. The Standard of Appellate Review.\n\nAs a threshold matter, we address the question of the appropriate standard of appellate review in federal habeas proceedings in assessing challenges to the exclusion of jurors in state trials under Witherspoon. The Supreme Court has never expressly stated what the standard of review of a Witherspoon challenge should be. Our review of the Supreme Court's principal Witherspoon cases, Adams v. Texas, 448 U.S. 38, 49-51, 100 S. Ct. 2521, 2528-29, 65 L. Ed. 2d 581 (1980); Lockett v. Ohio, 438 U.S. 586, 595-97, 98 S. Ct. 2954, 2959-61, 57 L. Ed. 2d 973 (1978); Maxwell v. Bishop, 398 U.S. 262, 264-65, 90 S. Ct. 1578, 1580, 26 L. Ed. 2d 221 (1970); Boulden v. Holman, 394 U.S. 478, 482-84, 89 S. Ct. 1138, 1140-42, 22 L. Ed. 2d 433 (1969); Witherspoon, supra, suggests to us that in those cases, the Court was engaging in an independent or de novo review. By de novo review, we mean that the Court appears to decide for itself, based upon a reading of the transcript, whether a juror who was allegedly improperly excluded under Witherspoon has made it unmistakably clear that he or she would automatically vote against the imposition of the death penalty, without regard to any evidence that might be developed at trial, or that his or her attitude toward the death penalty would prevent him or her from making an impartial decision as to the defendant's guilt. No deference appears to be given to the trial court's ability to observe the demeanor of the juror, perhaps because Witherspoon 's requirement that a juror must make his or her views \"unambiguously\" or \"unmistakably clear\" suggests that there is no need for such deference. Significantly, however, the high Court's decisions have generally been made in the context of a direct criminal appeal.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nWitherspoon challenges in the lower federal courts are raised in the context of federal habeas proceedings. In the traditional juror bias case, federal habeas review of a state trial court's findings is more narrowly circumscribed than is appellate review in a direct criminal appeal. See Smith v. Phillips, 455 U.S. 209, 102 S. Ct. 940, 71 L. Ed. 2d 78 (1982). In Smith, the petitioner maintained that a juror who had applied for a law enforcement position during the trial was presumptively biased against him. The state trial court held a post-trial hearing and determined that the juror had not been biased. The Supreme Court held that in a federal habeas action like the one before it, the state court's findings with respect to actual bias were \"presumptively correct under 28 U.S.C. ยง 2254(d),\" and that \"federal courts in such proceedings must not disturb the findings of state courts unless the federal habeas court articulate[d] some basis for disarming such findings of the statutory presumption that they are correct. . . .\" 102 S. Ct. at 946 (citing Sumner v. Mata, 449 U.S. 539, 101 S. Ct. 764, 66 L. Ed. 2d 722 (1981)); see also, Rogers v. McMullen, 673 F.2d 1185, 1190 n. 10 (11th Cir.1982), cert. denied, 459 U.S. 1110, 103 S. Ct. 740, 74 L. Ed. 2d 961 (1983); but see Irvin v. Dowd, 366 U.S. 717, 723, 81 S. Ct. 1639, 1642, 6 L. Ed. 2d 751 (1961) (habeas case in which Supreme Court held that juror bias is \"mixed [question of] law and fact\" and therefore, it was duty of court of appeals to \"independently evaluate the voir dire testimony of the impaneled jurors\") (quoting Reynolds v. United States, 98 U.S. 145, 156, 25 L. Ed. 244 (1878)). Since a Witherspoon challenge is a form of a challenge for juror bias, Smith would seem to indicate that a state court's factual findings with respect to a juror's willingness to impose the death penalty should be entitled to a presumption of correctness under section 2254(d). The Court's requirement of strict adherence to Witherspoon, however, see, e.g., Davis v. Georgia, 429 U.S. 122, 97 S. Ct. 399, 50 L. Ed. 2d 339 (1976) (death sentence must be set aside even if only one prospective juror is excluded in violation of Witherspoon), leaves us with some doubts about whether the Court would apply the traditional juror bias standard of review to a Witherspoon challenge.Further, the Supreme Court has not been entirely consistent in its treatment of the juror bias cases. Compare Smith, supra (presumption of correctness accorded state court's findings with respect to actual bias), with Irvin, supra (juror bias is mixed question of law and fact to be independently reviewed by appellate court).\n\nThe State maintains that a state court's factual findings are entitled to a presumption of correctness under section 2254(d) in Witherspoon challenges as well. See Alderman v. Austin, 695 F.2d 124, 130 (5th Cir.1983) (en banc) (Fay, J., dissenting); Darden v. Wainwright, 699 F.2d 1031, 1037-38 (11th Cir.), rehearing en banc granted, 699 F.2d 1043 (11th Cir.1983) (Fay, J., suggesting that Sumner presumption applies, but apparently engaging in independent review of the propriety of the state trial court's exclusion of prospective jurors). Like the Supreme Court, however, the lower federal courts, without expressly establishing a standard of review, appear to engage in a de novo review of Witherspoon challenges in federal habeas proceedings. McCorquodale v. Balkcom, 705 F.2d 1553, 1556-57 n. 9 (11th Cir.1983); Bell v. Watkins, 692 F.2d 999, 1006-08 (5th Cir.1982); Williams v. Maggio, 679 F.2d 381, 384-86 (5th Cir.1982) (en banc), cert. denied, 463 U.S. 1214, 103 S. Ct. 3553, 77 L. Ed. 2d 1399 (1983); Alderman v. Austin, 663 F.2d 558, 562-64 (5th Cir.1982), aff'd in relevant part, 695 F.2d 124 (5th Cir.1983) (en banc); Granviel v. Estelle, 655 F.2d 673, 677-78 (5th Cir.1981); Burns v. Estelle, 592 F.2d 1297, 1300-01 (5th Cir.1979), aff'd, 626 F.2d 396, 397-98 (5th Cir.1980) (en banc); Marion v. Beto, 434 F.2d 29, 31 (5th Cir.1970).\n\nSome judges have suggested a third possibility: according some deference to the trial court's decision in light of its opportunity to observe the juror's demeanor while he or she is answering the questions on voir dire. Judge Kravitch recently suggested that where the questions asked of the prospective jurors are precise and closely track the language in Witherspoon, an appellate court's deference to the trial court's assessment of the clarity of the juror's answers is appropriate. McCorquodale v. Balkcom, 705 F.2d 1553, 1561 (11th Cir.1983) (Kravitch, J., dissenting); see also Mason v. Balkcom, 487 F. Supp. 554, 560 (M.D.Ga.1980) (noting trial judge's opportunity to observe and listen to juror, but engaging in independent analysis of Witherspoon challenge), rev'd on other grounds, 669 F.2d 222 (5th Cir.1982), cert. denied, 460 U.S. 1016, 103 S. Ct. 1260, 75 L. Ed. 2d 487 (1983). The McCorquodale majority, however, carefully \"scrutinized the record in [its own] effort to ascertain the correctness of the trial court's finding with regard to a venireman's convictions about capital punishment,\" 705 F.2d at 1556-57, n. 9, and noted that in Aiken v. Washington, 403 U.S. 946, 91 S. Ct. 2283, 29 L. Ed. 2d 856 (1971), the Supreme Court summarily reversed a death sentence where the state court had found no Witherspoon violation and had accorded some deference to the trial court.\n\nAs discussed above, however, our review of the case law reveals that the courts have not specifically established a standard for appellate or collateral review of Witherspoon challenges. While a state trial court's factual findings with respect to juror bias may normally be entitled to a presumption of correctness in a federal habeas proceeding, Smith, supra, or at least to some deference in light of the trial court's opportunity to observe the prospective juror during voir dire, the federal courts appear to engage in a de novo review of the trial court's conclusions in cases where the defendant complains of a Witherspoon violation. Fortunately, we do not have to resolve the question whether or to what extent we should defer to the state court's findings because we have concluded that even if we proceed under the more exacting standard resulting from de novo review, the trial judge's exclusion of the three jurors in this case was proper under Witherspoon.\n\nB. Juror Wells.\n\nThe first prospective juror excused for cause who has merited the defendant's attention in these habeas proceedings was the Reverend Charles D. Wells. While Wells was able to imagine a case where a juror would vote to impose the death penalty, he was unable to see himself doing it, and on further questioning stated that he would automatically vote against the death penalty:\n\nQ. Mr. Wells, I'm Mike Hinton, as the Court told you awhile ago for the State, and this is by co-counsel, Mr. Vic Driscoll. We come here representing the State of Texas in this case in which we are seeking as the punishment for this defendant the penalty of death.\n\nLet me begin then by asking you whether or not you have any conscientious, moral or religious scruples against the imposition of the penalty of death in the electric chair?\n\nA. Let me say that morally, I do, and I don't think that I am capable of issuing a penalty of death to any man.\n\nQ. All right. Again, as Judge Price told you a moment ago, no one is here to quarrel with your feelings and you certainly are entitled to your opinions as all of us are in our good country, and that includes your feelings about the death penalty. But under the law I must ask you this further additional question, Reverend, which is, I take it from your answer that you cannot imagine a case of murder where you could, as one of twelve jurors, vote to send someone to the electric chair as a punishment for their offense even though it was authorized by statute?\n\nA.Would you repeat yourself now, please?\n\nQ. Yes, sir. My question that I must ask you then, based upon your former answer is, I take it that because of the feelings that you do have that you are entitled to have, moral feelings, religious feelings, that you cannot imagine a case where you, sitting on a jury, could vote to send someone to death in the electric chair as a punishment for their crime even though the law authorizes such penalty?\n\nA. I can imagine it, but I can't see myself doing it.\n\nQ. All right. Then, I believe we must [be] somewhere between our hypothetical case where you can imagine a jury doing it?\n\nA. Yes.\n\nQ. But you can't imagine yourself doing it as one of those jurors, is that correct, sir?\n\nA. I can hardly see myself doing it, yes.\n\nQ. All right. Now, I don't want you to get angry with me and I'm not trying to argue with you, but I have to ask you for your answer, because this lady is taking down your testimony at this time for the record.\n\nI take it from your answer that because of your religious and moral principles and feelings that you are certainly entitled to have, you cannot imagine a case where you would vote for the imposition of death in the electric chair. Is that correct, sir?\n\nA. No, I can't.\n\nMR. HINTON: I thank you, sir. We submit that the juror is not qualified, Your Honor.\n\nEXAMINATION BY THE COURT\n\nQ. Mr. Wells, let me ask you a question before they have the right to ask you questions.\n\nBecause of your moral or religious scruples, would you, if you were a member of the jury, would you automatically vote against the imposition of capital punishment no matter what the trial revealed?\n\nA. As far as the electric chair is concerned?\n\nQ. Would you personally, if you were a member of a jury, would you automatically vote against the imposition of the death penalty no matter what the trial revealed?\n\nA. Yes, I would.\n\nQ. All right.\n\nA. I would vote against it.\n\n2 Trial Transcript at 763-66.\n\nIn Texas, however, a juror does not technically vote to impose the death penalty. Instead, the trial judge sentences the defendant to die if, and only if, the jury answers two, sometimes three, statutory question in the affirmative. Following the examination by counsel for the State and by the court set forth above, counsel for the defendant directed Wells' attention to those two questions:\n\nQ. All right. You understand of course, nobody would ask you personally to put somebody to death. You understand that. You personally do not have to pull the switch or something?\n\nA. I understand that.\n\nQ.Surely. And of course there's a lot of steps to go to between the time you start trial and the time you end the testimony and the defense puts on their testimony and of course, there's a finding of guilt. You understand that. You do now if you haven't before. Is that correct?\n\nA. Yes.\n\nQ.All right. And then, after a finding of guilt, if there is one, certain questions will be submitted to you as a juror. Now, are you saying at this time that under no circumstance, regardless of what the testimony would be, under no circumstances could you vote for the death penalty?\n\nA. I don't think there are any that I possibly could vote for the death penalty.\n\nQ.All right. Let me ask you this, sir, if you were selected as a juror, even though the State has asked for the death penalty, could you consider these two issues -- and I'll ask you the issues that you would perhaps be asked to consider. All right?\n\nA. All right.\n\nQ. All right. The first issue would be whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result. Could you answer that question, sir, after you had gotten all the facts?\n\nA. Yes, Yes.\n\nQ.You could answer that all right?\n\nA. Yes.\n\nQ. And that wouldn't have any trouble with your conscience, would it?\n\nA. No.\n\nQ. Then of course there would be another question, and that would be whether there is [a] probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. Now, could you possibly answer that question?\n\nA. Yes, I possibly could answer that question.\n\nQ.And would you have any quarrel or any problem with those questions?\n\nA. I don't think so.\n\nQ. All right. And if you answered those questions, of course, it wouldn't be up to you to do anything to this defendant. Those are merely questions that you answer to the Court. Isn't that correct?\n\nA. I would say yes.\n\nQ.Could you do that, sir?\n\nA. I could be as liberal in answering the questions as I could.\n\nQ. And you would answer those questions truthfully, would you not?\n\nA. Yes, as far as my opinions are concerned.\n\nQ. I know you're a minister, are you not?\n\nA. Yes, sir. That's correct.\n\nQ. And you could answer those questions to the best of your ability and truthfully, could you not?\n\nA. Yes.\n\n2 Trial Transcript at 768-70. In spite of Wells' assurance that he could and would answer the statutory questions, the trial court granted the State's request that Wells be excused for cause. Significantly, at no time did defense counsel explain to Wells that if he and the other jurors answered the statutory questions in the affirmative, the trial judge would be required to sentence the defendant to death, and our review of the record indicates that at no point in the proceedings before the voir dire of Wells did the court or counsel render any such explanation. We thus do not know whether, in saying that he could and would answer the two statutory questions truthfully, Wells understood what the effect of those answers could be.\n\nThe Texas Court of Criminal Appeals was recently presented with a Witherspoon challenge involving a prospective juror whose views were in some respects strikingly similar to those of Wells. In Cuevas v. State, 641 S.W.2d 558 (Tex.Crim.App.1982) (en banc), venireman Ward initially stated, in the words of the court of criminal appeals, \"that under no circumstances could he participate as a juror in returning a verdict that would require the court to assess the death penalty.\" Id. at 560. After the \"bifurcated system in Texas for assessing guilt and punishment in capital murder cases\" had been \"carefully\" explained to him, however, and after he had been informed that the court, not the jury, would impose the penalty, Ward told the trial court that he could set aside his objections to capital punishment and answer the statutory questions on the basis of the evidence presented. Id.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e While the court of criminal appeals relied on Adams, rather than Witherspoon, in setting aside Cuevas' death sentence,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e the court was convinced that Ward could not have been excluded consistently with Witherspoon either, because \"[h]e repeatedly stated that he could follow the law and convict upon proper evidence of guilt beyond a reasonable doubt, despite his opposition to the death penalty.\" 641 S.W.2d at 563.\n\nCuevas sharpens the ultimate question presented by Wells' exclusion. Just as a juror may be able to put aside his or her opposition to the death penalty and obey the law, so may he or she decide that he or she can determine the facts, i.e., answer the questions as long as he or she is not the one who must actually pronounce the fatal words.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e If this is the juror's conclusion, then he or she cannot be excluded under Witherspoon. Ward in Cuevas was just such a juror, and the Texas Court of Criminal Appeals held that his exclusion was error.\n\nThe threshold question presented by Wells' voir dire is whether Wells had the same views as Ward. The record indicates that he may have held these views. He stated that he could and would answer the statutory questions truthfully. But in view of the fact that the record does not contain an explanation to Wells of the effect of \"yes\" answers to those questions by the jury, we do not know from the record whether Wells, like Ward, could put aside his opposition to the death penalty and obey the law, i.e., answer the statutory questions truthfully, knowing the possible effect of his answers to those questions. We can only speculate. If the requirement of Witherspoon and its progeny -- that a venireman must make \"unmistakably clear\" his or her inability to follow the law and abide by his or her oath, Adams, supra, 448 U.S. at 48, 100 S. Ct. at 2528; accord Boulden, supra, 394 U.S. at 483-84, 89 S. Ct. at 1141-42 -- means that an appellate or federal habeas court that cannot be certain from the face of the record about a venireman's inability to follow the law must, without any further consideration, grant the writ, then we would be compelled to do so here.\n\nThe State argues that we should not apply such a rule in the circumstances of this case. It maintains that it clearly established Wells' automatic opposition to the death penalty during its initial examination of him. Having done so, the State argues that if the petitioner wished to rehabilitate Wells as a juror successfully, it was incumbent upon defense counsel to take his inquiry into Wells' ability to answer the statutory questions one step further by clarifying, on the record, whether Wells understood the possible effect of his answers to those questions. The State argues that, since the defense failed to take that step, the exclusion of Wells on the basis of his initial unequivocal statements of automatic opposition to the death penalty was proper. We agree with the State.\n\nA fair reading of Wells' testimony in response to the initial questioning by the State and by the trial court indicates that Wells stated clearly, forcefully and without an equivocation that he would automatically vote against the imposition of the death penalty no matter what the trial revealed. Had the voir dire ended with the court's questioning, the State would clearly have properly obtained the exclusion of Wells under Witherspoon. If the defense wished to rehabilitate Wells by demonstrating that he could obey the law regardless of his opposition to the death penalty, perhaps because of the distinction between the jury as the fact-finder and the judge as the sentencer that Ward found persuasive in Cuevas, then it was incumbent upon the defense to establish, on the record, Wells' ability to engage in that fact-finding function without knowledge of the possible effect of those findings on the defendant's fate. This the defense failed to do. Accordingly, we hold that the exclusion of Wells on the basis of his initial clear and unequivocal statements that he would automatically vote against the death penalty no matter what the trial revealed was proper under Witherspoon and its progeny.\n\nThis holding is not inconsistent with Burns, supra, in which we held that the exclusion of juror Doss was improper because we were forced to speculate about whether she could put aside her disbelief in the death penalty and follow the law. 592 F.2d at 1301. In Burns, Doss affirmed that she \"did not believe in\" the death penalty three times and stated \"that the mandatory penalty of death or life imprisonment would \"affect\" her \"deliberations on any issue of fact in the case.\" Id. The trial court excluded Doss solely on the basis of those statements, and it rejected defense counsel's suggestion that Doss be asked further questions because it could not imagine what else could have been asked. Unfortunately, we could:\n\nShe could have been asked whether, despite her expressed convictions, she could put her disbelief aside and do her duty as a citizen. Her answer might have been that she could. Or she could have been asked what effect the presence of a possible death sentence would have on her deliberations.Her answer might have been that she would wish to be very sure of guilt, to be thoroughly convinced, before she could find facts in such a way that the death penalty might result. Either answer would doubtless have rehabilitated her for jury service. An answer that she would not take or could not comply with the required oath not to be \"affected\" in her deliberations would doubtless, upon a proper definition of \"affected\" as meaning \"disabling\" or \"insurmountably\" affected, have clearly disqualified her.\n\nId. (emphasis in original). We went on to explain that the speculations caused by the inadequacy of Doss' responses to the questions initially posed to her, in combination with the trial court's failure to permit additional questioning by the defense, required us to hold that her exclusion was improper under Witherspoon:\n\nTo be sure, these are mere speculations about what her answers to such [additional] questions might have been. The point is that nothing in her actual answers forecloses them. Her mere acknowledgement that the penalty would \"affect\" her deliberations does not do so: what candid and responsible citizen would not admit as much, could truthfully swear the proposition to be one of no concern whatever?\n\nId.\n\nIn contrast to the voir dire in Burns, neither the State nor the trial court has left us to speculate about the nature of Wells' opposition to the death penalty. The prosecutor did not settle for Wells' statement that he did not think that he was \"capable of issuing the penalty of death to any man,\" or that he could \"imagine\" but could not \"see\" himself voting to send someone to death. 2 Trial Transcript at 764-65. The prosecutor did not sit down until Wells had stated unequivocally that he could not imagine a case where he would \"vote for the imposition of death.\" Id. at 765. After the prosecutor had finished his questioning, the court took up the task and asked whether Wells would \"automatically vote against the death penalty no matter what the trial revealed,\" to which Wells replied that he would. Id. at 766. If we are forced to speculate in this case, it is defense counsel, not the State or the trial judge, who failed to ask the necessary question.\n\nWe have here the converse of the situation in Burns. Nothing in Wells' answers to defense counsel's questions forecloses the possibility that he would not have answered the statutory questions on the basis of the evidence if he knew that an affirmative answer to both questions would mandate the defendant's execution. The State established Wells' unequivocal opposition to the death penalty beyond speculation; it was then incumbent upon the defendant, if he wished to rehabilitate the juror, to ask enough questions to demonstrate that Wells could perform his fact-finding function in spite of his opposition to the death penalty.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nWe were recently confronted with a similar failure by defense counsel to rehabilitate a juror who had expressed her opposition to the death penalty in Porter v. Estelle, 709 F.2d 944 (5th Cir.1983). In Porter, in response to the State's questions, prospective juror Herndon had repeatedly expressed \"longstanding convictions against the death penalty that would [have] require[d] her to vote against [it] no matter what the trial revealed.\" 709 F.2d at 948. She maintained her opposition in response to two questions from defense counsel but when asked whether she could \"put her convictions aside and do her duty \" as a Juror in a Capital Murder case, \" she replied that she could. Id. (emphasis in original). When defense counsel objected to the State's challenge for cause, the State pointed out that the general question asked about Herndon's ability to do her \"duty as a juror\" had not included \"the second predicate question in Burns . . . [that] if it meant sentencing a man to death, could you follow that duty?\" Id. Defense counsel did not ask any more questions and the juror was excused for cause. We held in Porter that\n\nIn view of Herndon's repeated, firm, and unequivocal statements of irrevocable [opposition to the] imposition of the death penalty under any circumstances, we are unable to say her limited reply that \"she could do her duty as a juror \" indicated any vacillation or equivocation in her previous statement of unalterable opposition to imposition of the death penalty.\n\n709 F.2d at 948-49 (emphasis in original). Like the defense counsel in Porter, defense counsel here did not ask enough questions to demonstrate that Wells' previously expressed unequivocal opposition to the death penalty would not prevent him from performing his function as a juror in a capital case.\n\nC. Juror Pfeffer.\n\nJuror Pfeffer presents the opposite problem from Wells. Indeed, the voir dire of Pfeffer may be the quintessential example of a situation in which it would be appropriate for an appellate court to give at least some deference to trial judge, who had had the opportunity to observe the juror as he or she struggles to give an honest answer to difficult questions. Regardless of whether such deference is advisable, our own independent review of the record indicates that Pfeffer's exclusion was not in violation of Witherspoon.\n\nAs we observed in our decision to grant O'Bryan a stay of execution, and as the court of criminal appeals recognized, during the initial two-thirds of Pfeffer's lengthy voir dire examination (covering twenty-four pages in the transcript), he was\n\nequivocal in stating his position on capital punishment. He described himself as a \"borderline thinker\" on the issue of capital punishment, and expressed doubt that he could make the proper judgment because of his \"mixed feelings\" concerning the infliction of the death penalty.\n\nO'Bryan v. Estelle, 691 F.2d 706, 709 (5th Cir.1982). When informed by the trial court that he must give a definite answer, Pfeffer stated that he \"would have to say\" that he could not vote to impose the death penalty, although he continued to add caveats from time to time, referring to the necessity for giving the judge a \"yes or no answer,\" \"to give a correct answer,\" or \"for the good of everyone concerned:\"\n\nTHE COURT: Well, the law requires that we have to have a definite answer.\n\nJUROR PFEFFER: I understand, right.\n\nTHE COURT: Because the law does allow people to be excused because of certain beliefs that could be prejudicial or biased for one side or the other, and both sides just want to know if you can keep an open mind, consider the entire full range of punishment, whatever that may be, and under the proper set of circumstances, if they do exist and you feel they exist, that you could return that verdict. And that's in essence what they're asking.\n\nJUROR PFEFFER: Indirectly, I guess I would have to say no.\n\nTHE COURT: You could not?\n\nJUROR PFEFFER: I would have to say no then, to give you a yes or no answer.\n\nTHE COURT: Then, am I to believe by virtue of that answer that regardless of what the facts would reveal, regardless of how horrible the circumstances may be, that you would automatically vote against the imposition of the death penalty?\n\nJUROR PFEFFER: As I say, I don't know.\n\nTHE COURT: Well, that's the question I have to have a yes or no to.\n\nJUROR PFEFFER: Right.\n\nTHE COURT: And you're the only human being alive who knows, Mr. Pfeffer.\n\nJUROR PFEFFER: Right, I understand.If I have to make a choice between yes and no, I would say that I couldn't make the judgment.\n\n3 Trial Transcript at 882-84. Although Pfeffer interspersed his answers from this point on in his voir dire with caveats or qualifications such as those referred to above, there are at least two instances in which, if we focus on a specific question and answer, he gave unqualified answers:\n\nTHE COURT: You yourself are in such a frame of mind that regardless of how horrible the facts and circumstances are, that you would automatically vote against the imposition of the death penalty? Is that correct?\n\nJUROR PFEFFER: Well, if it says a yes or no, I would have to say yes, I would automatically vote against, to give a correct answer.\n\nTHE COURT: You would vote against?\n\nJUROR PFEFFER: Yes.\n\n3 Trial Transcript at 884-85 (emphasis added).\n\nQ. (By Mr. Harison) Then, under no circumstances, Mr. Pfeffer, could you even think of voting or answering those questions if the result of those questions were to be to, in effect, give somebody the death penalty. Is that correct?\n\nA. I think at the present time that's correct, yes.\n\nId. at 892.\n\nIn O'Bryan's view, while Pfeffer had \"reservations\" or \"mixed emotions\" about the death penalty, and while he was seriously concerned about his own ability to assess the death penalty, he was willing to do so in a \"very, very extreme set of circumstances.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e If this were an accurate view, then Pfeffer's exclusion would have been improper. In Witherspoon, one of the venirewomen excluded stated that \"she would not \"like to be responsible for . . . deciding somebody should be put to death.\" 391 U.S. at 515, 88 S. Ct. at 1773. In the footnote accompanying this description of the juror's feelings, the Supreme Court cited, apparently with approval, a Mississippi case that reversed a trial court's exclusion of jurors who did not wish to decide whether a person should die:\n\nThe declaration of the rejected jurors, in this case, amounted only to a statement that they would not like . . . a man to be hung. Few men would. Every right thinking man would regard it as a painful duty to pronounce a verdict of death upon his fellow-man.\n\nId. at 515 n. 8, 88 S. Ct. at 1773 n. 8 (quoting Smith v. State, 55 Miss. 410, 413-14 (1887); accord Burns, supra, 592 F.2d at 1299 n. 2. Witherspoon makes it clear that neither a deep reluctance to pronounce the death penalty, short of absolute refusal to do so, nor the reservation of the death penalty for only an extreme set of circumstances, is a ground for exclusion.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e 391 U.S. at 522 n. 21, 88 S. Ct. at 1777 n. 21.\n\nA careful review of the transcript indicates that during the initial two-thirds of Pfeffer's voir dire, he did indeed suggest that he would be able, in an extreme set of circumstances, to assess the death penalty. At that point, however, Pfeffer's attitude, or at the very least, his answers, changed when he stated that \"if [he had] to make a choice between yes and no,\" 3 Trial Transcript at 884, he would have to say that he would automatically vote against imposition of the death penalty. We conclude that this case is controlled by our en banc decision in Williams v. Maggio, 679 F.2d 381 (5th Cir.1982) (en banc), cert. denied, 463 U.S. 1214, 103 S. Ct. 3553, 77 L. Ed. 2d 1399 (1983). Juror Brou in Williams stated that there were \"certain cases where you read about them and they are so hideous that you just think, oh, the death penalty would be the only good outcome,\" 679 F.2d at 305, a statement similar to Pfeffer's statement that he could assess the death penalty in a \"very, very extreme set of circumstances.\" The prosecutor continued his probing, however, and in response to a leading question about Williams' particular case, Brou stated that she felt that she could not impose the death penalty:\n\nQ. So you feel that you could not return the death penalty?\n\nA. (Ms. Brou) No.\n\nId. (emphasis in majority opinion).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nViewing Brou's initial uncertainty in conjunction with her ultimate response to the prosecutor's question about her ability to return the death penalty, the majority of this court concluded in Williams that \"the record of [Brou's] automatic opposition to the death penalty [was] established.\" Id. The en banc majority specifically rejected the contention that under Witherspoon \"exclusion of a venireman is impermissible unless he states in response to all questions that he absolutely refuses to consider the death penalty.\" 679 F.2d at 386 (emphasis added). It would seem that under Williams, it is the juror's ultimate conclusion about whether he or she is irrevocably opposed to the death penalty that is critical. Absent effective rehabilitation of the sort that we found lacking in defense counsel's questioning of Wells and the Texas Court of Criminal Appeals found present in Cuevas, a juror's ultimate statement of unequivocal oppostion to the death penalty will justify his or her exclusion under the Williams court's interpretation of Witherspoon.\n\nPfeffer's unequivocal statement that he would automatically vote against the death penalty, 3 Trial Transcript at 885, was sufficient to justify his exclusion under Williams; his earlier statement that he could assess the death penalty in an extreme set of circumstances, his prolonged uncertainty and his caveats and qualifications preceding that unequivocal statement do not undercut the validity of that exclusion. The caveats and qualifications following that unequivocal statement do not amount to the kind of effective rehabilitation of Pfeffer that would be necessary for us to hold that his exclusion was error.\n\nO'Bryan suggests that Pfeffer's ultimate statements do not accurately reflect Pfeffer's position. O'Bryan contends that the trial judge mistakenly viewed Witherspoon as an \"exclusionary rule,\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and that the judge was unwilling to accept Pfeffer's deep, agonized reluctance to pronounce the death penalty. The defendant maintains that the trial court, in effect, coerced Pfeffer into taking a position that he would automatically vote against the imposition of the death penalty regardless of the facts established at trial. Our review of the entire voir dire, encompassing seven volumes of the trial record, indicates that the trial judge did not generally view Witherspoon as an exclusionary rule. Instead, he painstakingly questioned, and permitted counsel to question, each and every juror who expressed discomfort about imposing the death penalty, excluding some for cause but refusing to exclude others, thereby forcing the State to exercise its peremptory challenges.\n\nWe cannot say that the court's probing of Pfeffer's answers in an attempt to find some basis on which to evaluate his true feelings was improper. Throughout the voir dire, Pfeffer continued to express concern about his ability to pronounce the death penalty.The trial judge may have thought that Pfeffer's professed willingness to assess the death penalty in a \"very, very extreme set of circumstances\" was a smoke screen for what was really an inability to assess the death penalty under any circumstance. Under this view, we would have to say that a trial judge, harboring those suspicions about the person in front of him or her, has the right, within certain limitations, to pursue a line of questioning designed to flush out the venireman's true views. Indeed, an appellate court confronted with the question whether such an exclusion was proper, and with the apparent necessity of making an independent review based on the cold record, will expect no less. The trial court in this case succeeded in obtaining an answer from Pfeffer that he could not impose the death penalty. Under these circumstances, we cannot say that Pfeffer's exclusion was improper. Williams, supra.\n\nD. Juror Bowman.\n\nO'Bryan's final complaint about the voir dire involves the exclusion of juror Bowman. Like Pfeffer, Bowman was originally unsure of his feelings about the death penalty, but on further questioning, he stated that he could not vote for it. When asked about a crime \"closer to home,\" however, he said that he could consider the death penalty if the victim \"was one of [his] family.\" 3 Trial Transcript at 918.\n\nWe agree with the Texas Court of Criminal Appeals that Bowman's response that he could impose the death penalty if a member of his family had been killed does not invalidate the trial court's excusal of him for cause. If the victim had been a member of Bowman's family, he would have been \"unable to serve as a juror because of his interest and prejudice in the case.\" O'Bryan, supra, 591 S.W.2d at 473 (citing Tex.Code Crim.Pro.Ann. art. 35.16 (Vernon 1966 \u0026 Supp.1983)). The statement that a person could impose the death penalty only in a case in which he or she would not be permitted to serve is virtually the equivalent of a statement that the juror would never vote in favor of capital punishment.\n\nIII. THE CONSTITUTIONALITY OF THE CAPITAL SENTENCING PROCEDURE.\n\nO'Bryan contends that the Texas capital sentencing procedure, Tex.Code Crim.Pro. Ann. art. 37.071 (Vernon 1981), is unconstitutional because it does not provide for instructions to the jury concerning mitigating circumstances.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e He argues that in the absence of such instructions, the determination of punishment is left to the unbridled discretion of the jury, resulting in the imposition of the death penalty in an arbitrary and capricious manner, in violation of the eighth and fourteenth amendments. See Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972). Relying on the Supreme Court's holdings in Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982), that a sentencer must consider all of the mitigating evidence before sentencing someone to die, and in Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978), that the sentencer cannot be precluded from considering any mitigating factors, O'Bryan maintains that an instruction concerning mitigating evidence is constitutionally mandated.\n\nThe State claims that O'Bryan cannot be heard to complain about the trial court's failure to give a jury instruction on mitigating circumstances because he did not make a contemporaneous objection to the court's charge on this ground or request such an instruction at trial, as required by state law. Tex.Code Crim.Pro.Ann. arts. 36.14, .15 (Vernon 1981, superseded). It is, of course, settled law that \"when a procedural default bars state litigation of a constitutional claim, a state prisoner may not obtain federal habeas relief absent a showing of cause and actual prejudice.\" Engle v. Isaac, 456 U.S. 107, 129, 102 S. Ct. 1558, 1572, 71 L. Ed. 2d 783 (1982); accord, Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977). On the other hand, we are not \"barred from reviewing a claim by a state procedural rule when the state courts themselves have not followed the rule.\" Bell v. Watkins, 692 F.2d 999, 1004 (5th Cir.1982); accord, Ulster County Court v. Allen, 442 U.S. 140, 154, 99 S. Ct. 2213, 2223, 60 L. Ed. 2d 777 (1979); Henry v. Wainwright, 686 F.2d 311, 313 (5th Cir. 1982). The problem here is that the state court did not say whether it was denying the petitioner habeas corpus relief on the basis of his procedural default or on the merits of his claim; it simply denied his petition without comment.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nWe were recently confronted with the problem of interpreting a state court's silence with respect to the grounds for its denial of a state habeas petitioner's claim in Preston v. Maggio, 705 F.2d 113 (5th Cir.1983). We determined that the same considerations should be applied to cases in which the state court has denied relief without offering any reasons for its denial as are applied to cases where a state court has been \"less than explicit.\" Id. at 116. We included among those considerations:\n\nWhether the court has used procedural default in similar cases to preclude review of the claim's merits, whether the history of the case would suggest that the state court was aware of the procedural default, and whether the state court's opinions suggest reliance upon procedural grounds or a determination of the merits.\n\nId. (citing Ulster County Court, supra, 442 U.S. at 147-54, 99 S. Ct. at 2219-23). Applying the Preston criteria to O'Bryan's case, we conclude that the state court presumably denied his claim on the basis of his procedural default.\n\nThe Texas courts have held that\n\nin the absence of objections to the charge or a specially requested charge, no errors therein can be considered on appeal \"unless it appears that the defendant has not had a fair and impartial trial.\" Boles v. State, 598 S.W.2d 274, 278 (Tex.Cr.App.1980). And, in determining whether fundamental error is present, it is proper to view the charge as a whole.\n\nWhite v. State, 610 S.W.2d 504, 506 (Tex.Cr.App.1981) (en banc). In Williams v. State, 622 S.W.2d 116 (Tex.Cr.App.1981) (en banc), cert. denied, 455 U.S. 1008, 102 S. Ct. 1646, 71 L. Ed. 2d 876 (1982), the Texas Court of Criminal Appeals refused to hear a capital murder defendant's contention that he was entitled to a mitigating circumstances instruction during the sentencing phase of his trial where he had failed to object or request such an instruction at trial. The court held: \"Absent such an objection or requested instruction, the trial court's failure to charge the jury as to the consideration of mitigating circumstances was not reversible error.\" Id. at 120. Williams' position was the same as O'Bryan's: Williams contended that his death sentence had been imposed unconstitutionally because the jury had not been given a mitigating circumstances instruction, but he had never requested such an instruction at trial. Under these circumstances, the Texas court concluded that Williams' procedural default precluded review of his constitutional claim. O'Bryan has not offered us any indication that the court would not have made the same decision here.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Further, we know that the Texas Court of Criminal Appeals had been made aware of O'Bryan's procedural default, since the State raised the matter in its answer opposing the petitioner's second application for habeas relief.\n\nO'Bryan argues that his failure to object to the trial court's charge should not bar his claim because the Texas court's decision in Williams, supra, and Quinones v. State, 592 S.W.2d 933 (Tex.Cir.App.) (en banc), cert. denied, 449 U.S. 893, 101 S. Ct. 256, 66 L. Ed. 2d 121 (1980), placed him in a \"Catch-22\" situation. As discussed above, the court of criminal appeals held in Williams that it would not review a challenge to the sentencing instructions where the defendant had made no objection to those instructions at trial. In Quinones, the defendant had requested and been denied a charge on mitigating circumstances. The court of criminal appeals held that no such charge was necessary and overruled his exception:\n\nAppellant was entitled to present evidence of any mitigating circumstances and did present such evidence, including a broad discussion of his personal and family background. The question then is whether the language of the special issue is so complex that an explanatory charge is necessary to keep the jury from disregarding the evidence properly before it. In King v. State, 553 S.W.2d 105 (Tex.Cr.App.1977), cert. denied, 434 U.S. 1088, 98 S. Ct. 1284, 55 L. Ed. 2d 793 (1978), this Court held that the questions in Art. 37.071 used terms of common understanding which required no special definition. The jury can readily grasp the logical relevance of mitigating evidence to the issue of whether there is a probability of future criminal acts of violence. No additional charge is required.\n\nId. at 947. Contrary to O'Bryan's assertion, these two decisions do not present him with a Catch-22 situation, since they do not hold that a trial judge may not give a mitigating circumstances instrauction if he or she is disposed to grant the defendant's request. The purpose of a contemporaneous objection requirement is to give the trial judge the opportunity to rule on the defendant's constitutional claim, see Engle v. Isaac, 456 U.S. 107, 128-29, 102 S. Ct. 1558, 1572, 71 L. Ed. 2d 783 (1982); this is what O'Bryan failed to do.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nAccordingly, we hold that the defendant is barred from raising his claim about the absence of a mitigating circumstances instruction in these federal habeas proceedings. See also O'Bryan v. Estelle, 691 F.2d 706, 710 (5th Cir.1982) (Gee, J., dissenting). We note further that the Supreme Court's recent decision in Zant v. Stephens, 462 U.S. 862, 103 S. Ct. 2733, 2744, 77 L. Ed. 2d 235 (1983) (holding that death sentence need not be set aside where one of three statutory aggravating circumstances found by juror was subsequently held to be invalid by state supreme court but other two were specificially upheld, and stating that \"the absence of legislature or court-imposed standards to govern the jury in weighing the significance of either or both of those aggravating circumstances does not render [Capital sentencing statute] invalid\" as applied) makes the defendant's argument on the merits far more difficult.\n\nO'Bryan also contends that his punishment of death, based solely upon the evidence introduced at the guilt stage of trial, the state having elected to present no evidence bearing upon the special issued required by article 37.071(b)(2), V.A.C.C.P., violated the plurality conclusion in Furman v. Georgia, 408 U.S. 238 [92 S. Ct. 2726, 33 L. Ed. 2d 346] (1972); Woodson v. North Carolina, 428 U.S. 280 [96 S. Ct. 2978, 49 L. Ed. 2d 944] (1976); Roberts v. Louisiana, 428 U.S. 325 [96 S. Ct. 3001, 49 L. Ed. 2d 974] (1976).\n\nThe defendant never explains precisely what he means by this statement, but it seems to refer to the contention that he made in his direct criminal appeal that the evidence was insufficient to support the jury's finding that there was a probability that he would commit criminal acts of violence that would constitute a continuing threat to society. O'Bryan v. State, supra, 591 S.W.2d at 489.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e We agree with the Texas Court of Criminal Appeals that the State's reintroduction of the evidence presented during the guilt phase of the trial provided sufficient evidence of O'Bryan's future dangerousness to support the jury's findings.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In particular, we note that O'Bryan carefully planned the poisoning of his own son so that he could collect life insurance proceeds, and that he gave the poisoned pixy styx to four other children, including his own daughter, in an attempt to cover up his crime. We cannot say that no rational trier of fact could have found beyond a reasonable doubt that such a man posed a continuing threat to society. See note 18.\n\nIV. PROSECUTORIAL ARGUMENT.\n\nO'Bryan complains that his constitutional rights were violated when the prosecutor was permitted to comment, during closing argument at the sentencing phase of the trial, on defense counsel's failure to question defense witnesses concerning O'Bryan's reputation for being a peaceful and law-abiding citizen, and to suggest that counsel had a \"moral obligation\" to ask this question of the witnesses. O'Bryan contends that these comments impermissibly shifted the burden of disproving future dangerousness onto the defendant, and that the prosecutor's comments deprived him of a fundamentally fair trial.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe trial court overruled O'Bryan's objection to the prosecutor's argument. The court stated that a party is permitted, in Texas, to comment on the failure to call certain witnesses. The Texas Court of Criminal Appeals agreed, noting that it \"is well settled that the prosecutor, in argument, may comment upon the defendant's failure to call certain witnesses.\" O'Bryan v. State, 591 S.W.2d 464, 479 (Tex.Cr.App.1979) (en banc), cert. denied, 446 U.S. 988, 100 S. Ct. 2975, 64 L. Ed. 2d 846 (1980) (citing, e.g., Carrillo v. State, 566 S.W.2d 902, 912 (Tex.Cr.App.1978)). The court added that while the burden of proving the special issues is on the State, \"the option of coming forward with mitigating circumstances is upon the capital defendant.\" 591 S.W.2d at 479. Noting that counsel for both the defense and the prosecution had commented on the failure to call witnesses,\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and that the trial court had properly charged the jury court with regard to the State's burden of proof during the punishment phase of the trial, the Texas Court of Criminal Appeals held that the prosecutor's remarks had not shifted the burden of proof to the defendant, and that the trial court's ruling was not in error. Id.\n\nOur review of the propriety of prosecutorial comments made during a state trial is \"the narrow one of due process, and not the broad exercise of supervisory power that [we] would possess in regard to [our] own trial court.\" Donnelly v. DeChristoforo, 416 U.S. 637, 642, 94 S. Ct. 1868, 1871, 40 L. Ed. 2d 431 (1974). In the absence of a violation of a specific guarantee of the Bill of Rights,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e we may overturn a state court conviction only if the complained-of conduct has made the trial fundamentally unfair. Id. at 645, 94 S. Ct. at 1872; see also Passman v. Blackburn, 652 F.2d 559, 567 (5th Cir.1981), cert. denied, 455 U.S. 1022, 102 S. Ct. 1722, 72 L. Ed. 2d 141 (1982); Cobb v. Wainwright, 609 F.2d 754, 756 (5th Cir.), cert. denied, 447 U.S. 907, 100 S. Ct. 2991, 64 L. Ed. 2d 857 (1980). Such is not the case here.\n\nThe prosecutor's remarks did not impermissibly shift the burden of proving the special issues under Tex.Code Crim.Pro.Ann. art. 37.071 (Vernon 1981). The prosecutor's comments were at most tangentially related to the burden of proof.The cases cited by the defendant as examples of impermissible burden-shifting involved specific instructions by the trial court about who bore the burden of proving certain issues, see, e.g., Sandstrom v. Montana, 442 U.S. 510, 99 S. Ct. 2450, 61 L. Ed. 2d 39 (1979), or a state statute establishing the same. In re Winship, 397 U.S. 358, 90 S. Ct. 1068, 25 L. Ed. 2d 368 (1970). Here the complaint is about a prosecutor's off-the-cuff comments, not judicial instructions.\n\nIn Cupp v. Naughten, 414 U.S. 141, 94 S. Ct. 396, 38 L. Ed. 2d 368 (1979), the habeas petitioner claimed that a state trial judge's instruction that \"[e]very witness is presumed to speak the truth,\" id. at 142, 94 S. Ct. at 398, impermissibly shifted the burden of proof. The Supreme Court held that \"[w]hatever tangential undercutting of [the presumption of innocence and the state's duty to prove guilt beyond a reasonable doubt] may, as a theoretical matter, have resulted from the giving of the instruction on the presumption of truthfulness is not of constitutional dimension.\" Id. at 149, 94 S. Ct. at 401. The connection between the prosecutor's comments about the failure to question defense witnesses in this case and the burden of proof is even more attenuated than was the connection Naughten, supra.\n\nFurther, we have held that the requirements of the federal Constitution are satisfied as long as the State bears the burden of proving the aggravating circumstances. Gray v. Lucas, 677 F.2d 1086, 1107 (5th Cir.1982), cert. denied, 461 U.S. 910, 103 S. Ct. 1886, 76 L. Ed. 2d 815 (1983). The trial court instructed the jury that the prosecution bore the burden of proving the defendant's future dangerousness beyond a reasonable doubt. The Constitution requires no more. The question of who should produce evidence of mitigating circumstances was a matter of state law; the state court's decision that the defendant bore that burden entailed no constitutional violation. See Gray, supra.\n\nWe find no error of constitutional magnitude, if there be any error at all, in the trial court's permitting the prosecution to comment on the defendant's failure to ask his witnesses certain questions. As the Texas Court of Criminal Appeals noted, the prosecutor may comment, as a matter of state law, on the defendant's failure to call a material witness, and he may draw an inference from that failure that the testimony would have been unfavorable. See, e.g., Carrillo, supra. Similarly, we have held that in federal court, \"the failure of a party to produce as a witness one peculiarly within the power of such party creates an inference that such testimony would be unfavorable, and may be the subject of comment to the jury by the other party.\" United States v. Lehmann, 613 F.2d 130, 136 (5th Cir.1980) (quoting McClanahan v. United States, 230 F.2d 919 (5th Cir.), cert. denied, 352 U.S. 824, 77 S. Ct. 33, 1 L. Ed. 2d 47 (1956)). Comment is not permissible, however, if the \"person in question is equally available to both parties; particularly where he is actually in court.\" Id.\n\nO'Bryan did call these witnesses, and he points out that the prosecutor could have asked them about the defendant's reputation for peacefulness as easily as the defendant could have. The prosecutor's statement that defense counsel had a \"moral obligation\" to ask certain questions of the witnesses probably bordered on the improper. Viewing these two comments in the context of the trial as a whole, however, see Houston v. Estelle, 569 F.2d 372, 377 (5th Cir.1978), we cannot say that they deprived the defendant of a fundamentally fair trial.\n\nIn Houston, supra, where we set aside a state court conviction on the basis of improper prosecutorial comments, the prosecutor had repeatedly made the remarks even after he was reprimanded by the trial judge. Further, the comments themselves were far more egregious than those made during O'Bryan's trial. The prosecutor began his argument with a personal attack on the integrity of defense counsel, continued with a personal opinion about the defendant's credibility on the witness stand, and suggested that the jury give the defendant a long sentence so that the defendant would have an opportunity to rehabilitate himself, a suggestion that was improper under state law. 569 F.2d at 378, 380, 381 n. 12. In contrast, the Supreme Court refused to set aside a defendant's conviction where the prosecutor had expressed his personal opinion about the defendant's guilt and had made an improper suggestion about the defendant's motives for standing trial. Donnelly v. DeChristoforo, 416 U.S. 637, 642, 94 S. Ct. 1868, 1871, 40 L. Ed. 2d 431 (1974). In O'Bryan's case, the State's evidence, adduced at the guilt phase of trial, of the probability of the defendant's future dangerousness was substantial, and the comments' potential for prejudice was at best minimal. Accordingly, we hold that the prosecutor's comments do not entitle O'Bryan to federal habeas relief.\n\nV. PAROLE INSTRUCTIONS.\n\nUnder Texas law, a jury may not consider the possibility of parole in its deliberation on punishment, see, e.g., Moore v. State, 535 S.W.2d 357 (Tex.Cr.App.1976), and the jury in O'Bryan's case was so instructed.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The defendant maintains that the trial court's refusal to instruct the jury about the law governing the Board of Pardons and Paroles in relation to inmates sentenced to life imprisonment deprived him of a fundamentally fair trial in violation of the due process clause of the fourteenth amendment. Relying on People v. Morse, 60 Cal.2d 631, 388 P.2d 33, 36 Cal. Rptr. 201 (1964). O'Bryan argues that an instruction about the law of parole is necessary in a capital case to dispel the widely held misconception that a life sentence will result in a defendant's only serving nine or ten years in prison. The Texas Court of Criminal Appeals declined to adopt the view of the California courts that a jury should be charged on the law of parole and then instructed not to consider it. O'Bryan, supra, 591 S.W.2d at 478.\n\nAs in our review of alleged prosecutorial misconduct, our review of a challenge to instructions given in a state criminal trial is narrowly limited to whether the alleged impropriety \"so infected the entire trial that the resulting conviction violates due process.\" Cupp v. Naughten, 414 U.S. 141, 147, 94 S. Ct. 396, 400, 38 L. Ed. 2d 368 (1973); accord, Easter v. Estelle, 609 F.2d 756, 758 (5th Cir.1980); Higgins v. Wainwright, 424 F.2d 177 (5th Cir.1970). Morse, supra, was a response to California's earlier minority position permitting the jury to consider parole in determining punishment. Concluding that the evidence concerning parole introduced at trials was confusing to the jurors, the California Supreme Court decided that a jury should be informed about the parole law and then told not to consider parole in making its determination on punishment. The California court's decision was based on its supervisory powers over the state trial courts, not on the United States Constitution. Whatever the reasons for a state court's decision to require such an instruction in its own trial courts, we cannot say that an instruction on parole is constitutionally mandated in a capital case. See California v. Ramos, 463 U.S. 992, 103 S. Ct. 3446, 3448, 77 L. Ed. 2d 1171 (1983) (instruction informing jurors in capital case that governor has power to commute \"life sentence without possibility of parole\" but not informing them of equivalent power to commute death sentence not unconstitutional).\n\nSince the failure to give such an instruction did not deprive O'Bryan of a fundamentally fair trial, his complaint about the court's instruction is not cognizable in federal habeas proceedings. See Easter, supra.\n\nVI. CONCLUSION.\n\nWe hold:\n\n1. that jurors Wells, Pfeffer and Bowman were not excluded in violation of Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), because at some point during the voir dire, each made it unmistakably clear that he could not vote for the death penalty no matter what the law required;\n\n2. that O'Bryan's failure to request an instruction concerning mitigating circumstances at trial precludes him from challenging the court's failure to give such an instruction in these proceedings;\n\n3. that the prosecutor's comments about the defendant's failure to ask certain questions of defense witnesses did not deprive the defendant of a fundamentally fair trial; and\n\n4. that O'Bryan's complaint about the trial judge's refusal to give an instruction concerning Texas parole law is not cognizable in federal habeas proceedings.\n\nAccordingly, the federal district court's denial of habeas relief to O'Bryan is AFFIRMED.\n\nPATRICK E. HIGGINBOTHAM, Circuit Judge, special concurrence:\n\nI join Judge Randall's opinion except with respect to the standard by which we ought to review the claimed Witherspoon errors. I also write separately to explain how we differ in our reading of the voir dire.\n\nI\n\nI am not persuaded that the dispassionate disinterest that we ought to bring to the case requires that we recast the facts in sterile abstraction. If the facts are unpleasant or horrible, they remain so whether or not we wish them away. Ultimately our rules, our justice is judged on the actual facts and not on our restatement of them. Those facts follow.\n\nIn early November 1974, petitioner arose in his church and sang a solo dedicated to his eight year-old son, Timothy, buried the previous day. It was soon learned that Timothy had been murdered by petitioner for the proceeds of recently purchased life insurance. As described by the Texas Court of Criminal Appeals:\n\nA more calculated and cold-blooded crime than the one for which appellant was convicted can hardly be imagined. Appellant murdered his child in order to collect life insurance money. The record reflects months of premeditation and planning. As Halloween neared, he took out new and additional life insurance policies on both of his children, made his diligent and successful search for the poison which he was to use, set up plans to insure that he would take his children \"trick or treating,\" bought the children their costumes, and even began making plans to spend the money which he would collect upon the deaths of his children. Well before the carefully planned and executed murder, appellant began to consider buying a new house, paying off his debts, and even quitting his job.\n\nAppellant, in order to execute his plan to murder his son and to collect the life insurance proceeds, and to escape detection in doing so, was willing to and attempted to commit murder four more times. When he intentionally distributed the four additional poisoned pixy styx to the other children, the likely and predictable result of his acts was to cause their deaths also. The lives which appellant was willing to sacrifice in order to carry out the murder of his son included those of the two children of his good friend Jimmy Bates, and another child who attended appellant's church, and his own daughter, whose life was also heavily insured.\n\nThe jury also had before it evidence of appellant's attempt to implicate another for the poisoning death, by a positive identification of another man as the source of the candy, when the evidence showed that this could not have been true.\n\nFurther, the jury had before it evidence of appellant's attitude toward his crime. There was testimony that he was \"excited\" by wide spread news coverage of his son's death. There was also various testimony concerning the disparity between appellant's public displays of grief over his son's death and his behavior when the circumstances were more private. The jury also heard testimony that at approximately 9:00 a.m. on November 1, the morning after his son's death the previous night, appellant called his life insurance agent to find out how to collect the proceeds of the policy on his son. At approximately 9:30 a.m. this same morining after his son's death, he inquired at his bank about collecting on a policy there, also. Further, over the next several days, appellant openly discussed how he would use the proceeds of the life insurance; these plans included taking an extended vacation.\n\nBy his entire conduct, including the facts that appellant, in such a deliberate and calculated way, took the life of his own child for money and jeopardized the lives of four others, the jury could have concluded that appellant had a wanton and callous disregard for human life; the evidence is sufficient for the jury to have found that there is a probability that appellant would commit criminal acts of violence that would constitute a continuing threat to society.\n\n591 S.W.2d at 480-81 (emphasis in original).\n\nPetitioner was indicted November 11, 1974 for the offense of capital murder. After finding him guilty, a Houston, Texas jury, proceeding under Texas' bifurcated decisions of guilt and punishment, answered yes to the questions put to them as required by Article 37.071(b), Vernon's Ann. C.C.P. As required by those answers, petitioner was sentenced to death. The conviction was affirmed on direct appeal. O'Bryan v. State, 591 S.W.2d 464 (Tex.Cr.App.1979) (en banc). On June 2, 1980, the Supreme Court denied certiorari. O'Bryan v. Texas, 446 U.S. 998, 100 S. Ct. 2975, 64 L. Ed. 2d 846 (1980). Petitioner has twice, before filing this petition, sought state habeas and, once before, federal habeas relief. His first trip through state habeas ended with relief denied on July 31, 1980. In that same month, petitioner filed his first application for federal habeas. That petition was pending before the United States District Court for approximately one year when Texas requested expedition. In August 1981, pretrial briefing schedules were set. The state requested an evidentiary hearing, but in November petitioner's request to return to state court to exhaust additional claims was granted, over the objections of the state. On September 1, 1982, petitioner's state writ application was denied a second time, and his execution was set for October 31, 1982. Thirty days before the scheduled execution, petitioner filed his second petition for federal habeas. On October 2, 1982, the District Court held a hearing denying the writ, and refused an application for stay and certificate of probable cause to appeal. On October 27, 1982, a panel of this court, by divided vote, granted a stay, pending full appellate review. This decision then is at least the fourth time a court has decided that the contested juror exclusions were proper under Witherspoon.\n\nII\n\nWhile suggesting that precedent may not require it or is at least uncertain Judge Randall's able opinion employs a de novo standard of review that accords no deference to the trial judge. The standard by which an appellate court reviews is too basic to be so neatly sidestepped nor on these facts can it be. No decision is a decision here because Judge Randall's analysis is inevitably touched by the effort to disclaim any deference to the trial judge. The use of an evidentiary device of rehabilitation of a witness to fill a perceived Witherspoon hold in Wells' voir dire testimony is illustrative. The supposition that such a hole exists (might have answered the death penalty questions despite oposition to the penalty) is fueled, at least in part, by the decision that no weight is to be accorded the trial judge. I am persuaded that we are not required to proceed as if there were no trial judge and that here we should not.\n\nWitherspoon held that a state was constitutionally barred from excluding venirement that expressed reservations about the death penalty, or had conscientious scruples against its imposition. At the same time, the Court made clear that a state retained the right to exclude veniremen\n\nwho made unmistakably clear (1) that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them, or (2) that their attitude toward the death penalty would prevent them from making an impartial decision as to the defendant's guilt.\n\n391 U.S. 522-23 n. 21, 88 S. Ct. at 1777 n. 21 (emphasis in original).\n\nThere is nothing inherent in Witherspoon which explains failure to accord deference to the trial court by courts reviewing claimed Witherspoon error. That a trial court's decision may result in a death sentence has not been sufficient to strip it of all such deference. Trial judges daily decide whether conspiracies have been established independent of declarations by co-conspirators, whether statements were voluntary, and whether warnings were given or rights understood. Many trial decisions have lethal potential, yet are reviewed by standards as deferential as \"clearly erroneous.\"\n\nDespite its many applications during its fourteen-year life, there have been few efforts by appellate courts to confront the core appellate question of the deference due a trial court decision excluding venirement over a Witherspoon objection. For example, in a recent review by the Eleventh Circuit of claimed Witherspoon error, three dissenting judges treated the subject in two opinions, but the majority never mentioned its standard of review. Alderman v. Austin, 695 F.2d 124 (11th Cir.1983) (en banc). The Eleventh Circuit now has the question before its en banc court. Darden v. Wainwright, 699 F.2d 1031 (11th Cir.), rehearing en banc granted, 699 F.2d 1043 (1983). This silence is especially puzzling in light of the Supreme Court's explicit requirement of deference to decisions of trial courts in matters of jury selection. For example, pointing in part to the trial judge's superior opportunity to observe venirement, the Court has said that \"the trial court has a serious duty to determine the question of actual bias, and a broad discretion in its rulings on challenges therefor.\" Dennis v. United States, 339 U.S. 162, 168, 70 S. Ct. 519, 521, 94 L. Ed. 734 (1950).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nYet, in Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980), the Court prefaced its conclusion with the statement, \"Based on our own examination of the record, we have concluded that ยง 12.31(b) was applied in this case to exclude prospective jurors on grounds impermissible with Witherspoon and related cases.\" Id. at 49, 100 S. Ct. at 2528 (emphasis added). This seeming inconsistency is not compelled. That the Court itself examined the record is as consistent with deferential review as review that ignores the existence of the trial judge. Adams turned on the legal question of whether the Texas courts could, consistent with Witherspoon, exclude venirement who indisputably only had opinions that would affect their answers. It did not present a review of a trial judge's conclusion that the sum of his observations of veniremen and their testimony was that they would automatically refuse to vote for the death penalty. The fact is the Supreme Court has shed little direct light on the standard of review of claimed Witherspoon error. The usual language of deference is conspicuous in its absence. Equally conspicuous, however, is the lack of any discussion at all of the appellate standard. In summary, review in Witherspoon cases is independent but precedent does not bar an attempt to develop an appellate standard for its exercise.\n\nIn the following I examine in functional terms the justifications for a deferential standard of review and inquire whether such justifications are apt in a death penalty case. There are three overlapping, but nonetheless distinct, fundamental judicial policies to which a deferential standard is responsive: first, the recognition of a trial court as an integral level of an operating justice system; second, as an expression of comity and federalism, the deference owed a state court by a federal court engaged in collateral review; and third, recognition of the superior oportunity of an observer of witnesses to comprehend their testimony.\n\nThat an appellate court not simply ignore that the case has been earlier decided expresses in part a recognition that the trial court was more than an entrance gate. When an appellate court starts afresh, a trial court's function is reduced to that of collecting data and providing an opportunity for an extrajudicial resolution of the dispute. Even this function would experience a reduction in value as expectation of a judicial decision of consequence shifts wholly away from the trial court. The pyramidal shape of our present court structure rests on the institutional integrity of the trial court as a distinct part of the justice system. As such review is extended upward, only the last \"court\" in the chain retains full institutional integrity. More is afoot here than nostalgic or romantic reverence for trial courts. Finality and all values bound up in that precept are implicated.\n\nReview which ignores the trial court also travels against the command of 28 U.S.C. ยง 2254(d) as read in Sumner v. Mata, 449 U.S. 539, 101 S. Ct. 764, 66 L. Ed. 2d 722 (1981), and the concern for the sovereignty of states presented by collateral review of state criminal convictions. Such review is \"perplexing given \"the limited nature of review provided federal courts by 28 U.S.C. ยง 2245 [sic].\" Alderman v. Austin, 695 F.2d 124, 131 (11th Cir.1983) (Fay, J., dissenting) (quoting Sumner v. Mata, 449 U.S. at 541, 101 S. Ct. at 766). Cf. Rose v. Lundy, 455 U.S. 509, 102 S. Ct. 1198, 71 L. Ed. 2d 379 (1982). Indeed when other than Witherspoon error has been asserted the principles of Sumner v. Mata have been applied in federal habeas review of asserted juror bias. Smith v. Phillips, 455 U.S. 209, 102 S. Ct. 940, 71 L. Ed. 2d 78 (1982).\n\nFinally, the appellate courts have long recognized the advantage of the trial judge in essaying the truth of a matter when the facts are caught up with a witness's manner of expression. As noted, we and the Supreme Court have at the least touched this base when reviewing decisions of trial judges regarding jury selection, save for Witherspoon error, when we all have proceeded in near silence.\n\nNothing teaches that these three ideas, general but central, are inapt in death cases. That death cases must evoke a high level of scrutiny at every level in no way travels against any of the three expressed values. To the contrary, if we believe that a trial judge's superior opportunity to observe gives his call a greater probability of being correct than a person who was not there, then it is unclear why we ought to ignore his decision in administering the Witherspoon standard.\n\nThe selection of a jury in a capital case includes many judgment calls by trial judges -- calls that involve the judge's intuition about the demeanor of the venireman, the appropriateness of his response, his manner, dress, and his inflection. It is a decision with the usual stuff of trial court decisionmaking, calls more dependent upon intuition, shrewdness, or courtroom savvy than abstract analogical processes. Correspondingly, one need not pause for long to summon up myriad examples of expression whose meaning can only be determined by the inflection and manner of its expression. For example, the simple expressions \"I reckon so\" and \"I could hardly do so\" may or may not express doubt.\n\nIn sum, ruling upon a request to exclude a venireman inevitably involves an interpretation of what was asked and answered. The dynamic trial scene is not easily conformed to a mold judicially shaped to facilitate review or to achieve a targeted level of accuracy, perhaps because few but lawyers and judges talk and think in such a fashion, peculiarly so with the interrogation of veniremen in death cases. Indeed, there is almost a pattern in the clarity and certainty of response -- progressing from hesitation and vagueness at the outset toward greater comprehension and clarity at the end. And this mental groping ought not be a surprise. Few citizens chosen at random have so thought through the profound moral and ethical questions implicated by a Witherspoon qualification as to do otherwise.\n\nA trial court's decision to sustain a challenge for cause because the venireman would automatically vote against the death penalty sometimes presents questions of fact in the sense that the trial court must choose from permissible inferences. That choice is often aided by the opportunity to observe and sometimes cannot be made without that opportunity.If we really mean that the review is wholly afresh, one can wonder if we are telling the trial judge not to make the choice.\n\nIt would seem to follow that jury selection in capital cases presents the type of decision properly categorized as factual, and thus reviewable by a familiar standard such as clearly erroneous. But it is not so simple. First, there is the recurring difficulty of the deference due a mixed question of law and fact. See Pullman-Standard v. Swint, 456 U.S. 273, 286 nn. 16 and 19, 102 S. Ct. 1781, 1790 nn. 16 and 19, 72 L. Ed. 2d 66 (1982). Second, appellate courts have independently assessed \"ultimate facts.\" See Baumgartner v. United States, 322 U.S. 665, 64 S. Ct. 1240, 88 L. Ed. 1525 (1944). Third, there is a legacy, if not category, of unique review of \"constitutional fact.\" See, e.g., Norris v. Alabama, 294 U.S. 587, 55 S. Ct. 579, 79 L. Ed. 1074 (1938). Fourth, Witherspoon itself demands heightened appellate review. As will be seen, however, whether termed a mixed question of law and fact, ultimate fact, or constitutional fact, and despite its internal demands, according the trial court deference is not forbidden by independent appellate review of Witherspoon error. That is, an independent review of the facts may be undertaken against a backdrop of trial court discretion.\n\nAppellate review of mixed questions of law and fact and questions of ultimate fact was discussed by the Supreme Court in Swint. The Court intimated that the two categories may involve essentially the same type of determination, of whether the legally determinative consideration is \"satisfied by subsidiary facts admitted or found by the trier of fact.\" 102 S. Ct. at 1788-89 n. 16. Cases similar Witherspoon, involving exclusions of veniremen for bias resulting from pre-trial publicity, traditionally have been characterized as involving a mixed question of law and fact. Irvin v. Dowd, 366 U.S. 717, 723, 81 S. Ct. 1639, 1642, 6 L. Ed. 2d 751 (1961); Reynolds v. United States, 98 U.S. 145, 156, 25 L. Ed. 244 (1878). For that reason in these cases there is on appeal an independent evaluation of the voir dire testimony. Irvin v. Dowd, 366 U.S. at 723, 81 S. Ct. at 1642; United States v. Williams, 523 F.2d 1203, 1208 (5th Cir.1975); Wansley v. Slayton, 487 F.2d 90, 98 (4th Cir.1973), cert. denied, 416 U.S. 994, 94 S. Ct. 2408, 40 L. Ed. 2d 773 (1974). Yet citing Irvin v. Dowd, we held in United States v. Robbins, 500 F.2d 650 (5th Cir.1974), that \"rulings on suggestions of impartiality of the jury is within the discretion of the trial judge, and an abuse of that discretion must be clear.\" Id. at 653. See also Dennis v. United States, 339 U.S. 162, 168, 70 S. Ct. 519, 521, 94 L. Ed. 734 (1950). This combination of independent review and deference to the trial judge was evident in United States v. Taylor, 554 F.2d 200 (5th Cir.1977). We noted there that the trial judge had discretion to decide whether to excuse a juror but nonetheless reversed his decision not to do so. Though we did not expressly characterize our review as \"independent,\" we reexamined the colloquy between the judge and juror, noted that \"[i]t was apparent to the judge that [the juror] was extremely reluctant to sit on this jury,\" and concluded that \"[t]he right to an impartial jury trial, free of fear, dominated all other considerations.\" These cases establish that reviewing courts can engage in an independent review and simultaneously give weight to trial court decisions.\n\nIndependent review of Witherspoon decisions is driven in part by its similarity to cases traditionally characterized as mixed questions of law and fact, in which the courts engage in de novo review without mentioning deference. Of particular relevance is the Swint Court's characterization of why the Baumgartner Court there allowed de novo review:\n\nThe Court said that the significance of the clear and convincing proof standard \"would be lost\" if the ascertainment of the lower courts whether that exacting standard of proof had been satisifed on the whole record were to be deemed a \"fact\" of the same order as all other \"facts\" not open to review here.\n\n102 S. Ct. at 1790 n. 16. Like the clear and convincing standard, the unmistakably clear standard pushes reviewing courts to independent review and, as Judge Randall records, with little shown deference to the trial court. Of course, that deference is not articulated with independent review does not mean either that it was absent or that it was inappropriate.\n\nThe independent character of Witherspoon review is also explainable by its similarity to appellate review of issues termed constitutional fact. in Norris v. Alabama, Justice Hughes for a unanimous Court expressed the need not only to examine whether a rule of law has been correctly applied to established facts but also to examine historical facts -- constitutional facts -- in certain instances:\n\nThe question is of the application of [an] established [constitutional] principle to the facts disclosed by the record. That the question is one of fact does not relieve us of the duty to determine whether in truth a federal right has been denied. When a federal right has been specially set up and claimed in a state court, it is our province to inquire not merely whether it was denied in express terms but also whether it was denied in substance and effect. If this requires an examination of evidence, that examination must be made. Otherwise, review by this Court would fail of its purpose in safeguarding constitutional rights.\n\n294 U.S. at 589-90, 55 S. Ct. at 580. Of course a decision to exclude a venireman under Witherspoon can involve more than the question of whether established historical facts satisfy the Witherspoon standard. It can also include resolution of disputed historical facts.\n\nIn addition to its similarity to the categories of cases in which appellate courts engage in independent review, Witherspoon review is driven by its unique formulation of a rule that carries an internal standard of review, equally unique. This is true because Witherspoon has two intertwined parts that can for analysis be separated and labelled as a standard for decision and a required level of proof. Although each party requires reviewing courts to independently review voir dire testimony in order to decide whether an exclusion was proper, each part also allows reviewing courts to give weight to the trial judge's decision.\n\nWitherspoon as a standard for decision offers three possibilities: (1) the venireman must be unwilling to consider the death penalty; (2) the venireman must say that he is unwilling to consider the death penalty; (3) he must both say that he is and be unwilling to consider the death penalty.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e All three are at their core factual inquiries, but there are differences. If an appellate court's inquiry is into what a venireman believed or attempted to say, we will be forced to judge demeanor from a transcript. If the question is what was said, each court can read as well as another. The Court has said that \"[u]nless a venireman states unambiguously that he would vote against the imposition of capital punishment no matter what the trial might reveal, it simply cannot be assumed that that is his position.\" Witherspoon, 391 U.S. at 516 n. 9, 88 S. Ct. at 1774 n. 9 (emphasis added). The rub is that what is said can be ambiguous in the record but unambiguous at trial due to the ability of transcript to mirror only part of the trial scene. Certainly in such a case the decision of the trial judge must count for something.\n\nThe \"unmistakably clear\" language suggests that Witherspoon is not only a standard for decision but also a standard of proof. Many trial court decisions are based on a preponderance standard or a substantial evidence standard. See United States v. James, 590 F.2d 575 (5th Cir.1979) (en banc). Others are based on a clear and convincing, or beyond a reasonable doubt standard. See McCormick on Evidence ยงยง 340-41 (1972). The unmistakably clear standard sets Witherspoon apart.\n\nYet nothing internal to the unmistakably clear standard forbids deference to a trial court. If there is any such internal sign it points in the opposite direction. In certain instances the only way for a reviewing court to reliably conclude that the objective fact of absolute bias was unmistakably clear is to defer to the trial court's judgment. To never defer would be to review according to a less than accurate view of the nature of many venire decisions. This would inevitably lead to inaccurate decisionmaking in the trial courts because trial judges and counsel would attempt to force venirement to conform their language and thought pattern to the mold cast by the audience of reviewing judges. Thus, the accuracy of decisionmaking that the unmistakably clear standard requires would be diminished.\n\nI recognized that accuracy in decisionmaking can be defined in different ways. If the goal is to minimize all error, the deference to the trial judge follows for the reasons I have stated. But if the goal is only to eliminate any possibility of error harmful to defendants, without regard to the overall accuracy of the proceedings, then giving defendants two wholly fresh bites at the Witherspoon apple may be more likely to achieve this end. Some have subscribed at least in the abstract to the view that appellate review of a death sentence must be controlled by this imperative. I disagree. The institutional integrity of our judicial system demands that a line be drawn at some point. Thus, for example, we apply Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977), to death penalty cases. See Bass v. Estelle, 696 F.2d 1154 (5th Cir.1983). Indeed, assertions that a capital case should be subjected to this level of absolute scrutiny may be little more than a flanking opposition to the penalty itself. Yet when it comes to Witherspoon, the argument becomes that courts ought to be willing to find error if based on the record any hypothetical scenario can be constructed, regardless of the trial court's finding and the probability of its correctness, in which the potential juror was not inalterably opposed to imposition of the death penalty.\n\nAn extreme standard of proof coupled with a standard of decision calling for an extreme level of stated partiality requires reviewing courts to freshly make the Witherspoon decision. At the same time, both the standard of proof and nature of the venire decision itself counsel against a total ban of deference to such trial court decisions. All considered, I am persuaded that independent appellate review by a standard of abuse of discretion responds to the concerns of Witherspoon while expressing the values of comity and of respect for trial court integrity with its sometime superior opportunity for accurate decisionmaking. Independent review is an understandable expression of appellate courts' reluctance to tie their hands in advance when the stakes are so high. Here an abuse of discretion standard will allow reviewing courts freedom to correct asserted Witherspoon error without dilution of its demanding standard while giving weight to the trial court's decision as warranted by the circumstances of the particular case.\n\nIII.\n\nI turn now to the specifics of the error claimed in the exclusion of veniremen Wells, Bowman and Pfeffer.Fully one-half of the effort in the trial court was devoted to the selection of a jury. Little of that effort was devoted to other than Witherspoon qualification. In other words, seven of the fifteen volumes of transcript report efforts to meet the requirements of Witherspoon. After devoting one half of the trial to jury selection, only three of the venirement interrogated are now claimed to have been erroneously excluded under Witherspoon.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nCharles D. Wells is a minister. After testifying that he had an open mind as to guilt or innocence in the case, he was asked:\n\nQ. Let me begin then by asking you whether or not you have an conscientious, moral or religious scruples against the imposition of the penalty of death in the electric chair?\n\nA. Let me say that morally, I do, and I don't think that I am capable of issuing a penalty of death to any man.\n\nHe was further asked by the prosecutor:\n\nQ. But you can't imagine yourself doing it as one of those jurors, is that correct, sir?\n\nA.I can hardly see myself doing it, yes.\n\nQ. All right. Now, I don't want you to get angry with me and I'm not trying to argue with you, but I have to ask you for your answer, because this lady is taking down your testimony at this time for the record.\n\nI take it then from your answer that because of your religious and moral principles and feelings that you are certainly entitled to have, you cannot imagine a case where you would vote for the imposition of death in the electric chair. Is that correct, sir?\n\nA. No, I can't.\n\nHe was then asked by the court:\n\nQ. Would you personally, if you were a member of a jury, would you automatically vote against the imposition of the death penalty no matter what the trial revealed?\n\nA. Yes, I would.\n\nQ. All right.\n\nA. I would vote against it.\n\nAt this juncture, Wells was indisputably properly excludable under Witherspoon. His answers were direct and unequivocal, both in response to questions by the prosecutor and the court. Then, in response to questions by defense counsel, he made plain that his earlier answers were not made on an assumption that he would personally pull the switch \"or something.\" Otherwise stated, Wells had explained that causing the death penalty in an indirect manner was equally abhorrent. He was then asked by defense counsel:\n\nQ. All right. And then, after a finding of guilt, if there is one, certain questions will be submitted to you as a juror. Now, are you saying at this time that under no circumstances, regardless of what the testimony would be, under no circumstances could you vote for the death penalty?\n\nA. I don't think there are any that I possibly could vote for the death penalty.\n\nAt this juncture, the minister remained unshaken in his statements that there were no circumstances under which he could vote for the death penalty. Defense counsel then asked the following questions and received the following answers:\n\nQ. All right. Let me ask you this, sir, if you were selected as a juror, even though the State has asked for the death penalty, could you consider these two issues -- and I'll ask you the issues that you would perhaps be asked to consider. All right?\n\nA. All right.\n\nQ. All right. The first issue would be whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result. Could you answer that question, sir, after you had gotten all the facts?\n\nA. Yes, yes.\n\nQ. You could answer that all right?\n\nA. Yes.\n\nQ. And that wouldn't have any trouble with your conscience, would it?\n\nA. No.\n\nQ.Then of course there would be another question, and that would be whether there is probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. Now, could you possibly answer that question?\n\nA. Yes, I possibly could answer that question.\n\nQ. And would you have any quarrel or any problem with those questions?\n\nA. I don't think so.\n\nQ. All right. And if you answered those questions, of course, it wouldn't be up to you to do anything to this defendant. Those are merely questions that you answer to the Court. Isn't that correct? (emphasis supplied)\n\nA. I would say yes.\n\nQ. Could you do that, sir?\n\nA. I could be as liberal in answering the questions as I could.\n\nQ. And you would answer those questions truthfully, would you not?\n\nA. Yes, as far as my opinions are concerned.\n\nQ. I know you're a minister, are you not?\n\nA. Yes, sir. That's correct.\n\nQ. And you could answer those questions to the best of your ability and truthfully, could you not?\n\nA. Yes.\n\nAt no time was Reverend Wells told that affirmative answers to the questions would compel the imposition of the death penalty. To the contrary, he was asked whether he would have \"any quarrel or any problem with those questions,\" with the explanation that \"[t]hose are merely questions that you answer to the Court.\"\n\nIt is suggested that because the record does not affirmatively reflect that Reverend Wells did not know that the effect of his answers to these questions would be a death sentence, it is not unmistakably clear that he was disqualified under Witherspoon. Not only does this argument proceed upon an assumption that Wells knew the effect of affirmative answers to the question, an assumption unsupported by the record, it ignores the fact that defense counsel told him that these were \"merely questions that you answer to the court.\" It also makes all his other testimony virtual nonsense. It is suggested that Reverend Wells, despite his view that he could not vote for the death penalty, might yet have been of the view that he could answer the death penalty questions. Apart from being an unsupported hypothesis, the supposition is directly inconsistent with his testimony that he could not see himself \"doing it\" as one of the jurors. He was asked and answered as follows:\n\nQ. But you can't imagine yourself doing it as one of those jurors, is that correct, sir?\n\nA. I can hardly see myself doing it, yes.\n\nIndeed, the witness became angry with even the suggestion that he could so vote.\n\nThere may be persons who, although opposed to the death penalty, could answer questions, the effect of which is to impose the penalty, but only a tortured reading of this transcript supports the finding that Reverend Wells was explaining that he was one of those persons.\n\nL. R. Pfeffer is a paradigm of veniremen in capital cases. His responses to the questions of counsel and court were at the outset, to the extent they are intelligible, equivocal. The prosecution was able to elicit intelligible responses only with difficulty. Faced with a confused and confusing venireman, the court attempted to learn Pfeffer's opinions. Pfeffer volunteered, \"I know you would like direct answers but this is the best I can do and this is a vague answer.\" The trial court explained to Pfeffer that only he knew his opinion. Pfeffer stated then, \"if I have to make a choice between yes and no, I would say that I couldn't make a judgment.\" At this juncture, Pfeffer had progressed from an equivocal position to a clear expression of opinion. His response became certain, however, only as he was pushed by the trial judge to give an opinion one way or the other. The record is plain that the trial judge pushed for an opinion. It is equally plain that the trial judge pushed in no particular direction.\n\nUnlike Wells, Pfeffer knew the effect of answering the sentencing questions. In response to questions by defense as to whether the sentencing questions would \"pose any problems to you,\" he answered:\n\nA. I think it would, because it would have a direct bearing on the outcome anyway, what we've been talking about with the Judge a minute ago.\n\nQ. Well, my question would be, could you or could you not answer that question, sir?\n\nA. Well, I would have to say I couldn't. I already made the statement a moment ago.\n\nAfter a colloquy among counsel and the court, defense counsel put the final question to Pfeffer as follows:\n\nQ. (By Mr. Harrison) Then, under no circumstances, Mr. Pfeffer, could you even think of voting or answering those questions if the result of those questions were to be to, in effect, give somebody the death penalty. Is that correct?\n\nA. I think at the present time that's correct, yes.\n\nDespite his initial confusion and uncertainty, Pfeffer's testimony read as a whole makes unmistakably clear that he would automatically vote against the death penalty. It is suggested that the trial judge's insistence upon an answer somehow taints Pfeffer's responses. The trial judge told Pfeffer that only he knew the answer to the questions. At that point Pfeffer had done little more than think aloud. It was Pfeffer who first suggested framing his responses in yes or no terms by his gratuitous statement that \"if I have to make a choice between yes and no, I would say I couldn't make a judgment.\" The trial judge, following Pfeffer's lead, put the question in yes or no terms. The difficulty is that in philosophical terms certainty that one would automatically vote against the death penalty in all cases has an internal continuum. There is no finite certainty in predicting one's future response. Pfeffer translated his own level of certainty by stating what his answer would be if he must answer. Implicit in the argument that this exchange does not allow one to conclude that Pfeffer's absolute partiality was unmistakenly clear is that the no answer expresses a range of uncertainty that exceeds the level acceptable under Witherspoon. Otherwise stated, the argument is that extruding a juror's views through yes or no channels does not resolve the uncertainty that Pfeffer earlier expressed. Accepting for now the premise that a juror who has no view or who after voir dire remains uncertain cannot be excluded on Witherspoon grounds, I am persuaded that when Pfeffer left the stand he had sorted his views and made a decision.\n\nI note that Pfeffer's responses were becoming questions themselves when the trial judge redirected the inquiry to Pfeffer declining, properly, to suggest a response. It was then that Pfeffer himself, not the judge, reached for the yes or no strainer and answered the question.Significantly, the record does not stop with the yes or no question. Defense counsel probed Pfeffer without such a preface by inquiry into whether he could answer the sentencing questions. This exchange I have set out. It concluded with the following question and answer:\n\nQ. (By Mr. Harrison) Then, under no circumstances, Mr. Pfeffer, could you even think of voting or answering those questions if the result of those questions were to be to, in effect, give somebody the death penalty. Is that correct?\n\nA. I think at the present time that's correct, yes.\n\nThis sequence is important because it evidences the progressive character of Pfeffer's level of certainty and fixity of opinion. We are not, contrary to petitioner's suggestion, forced to rely upon an answer forced through yes or no gates to decide Pfeffer's view. Instead we have a venireman who reached for that device and a court that then used it to provide a framework for thought. The witness was given every opportunity ot explain his answer. After the yes or no exchange he was cross-examined by defense counsel. The responses were then direct and unmistakably clear. That the yes or no exchange may have been a catalyst in Pfeffer's progressive grasp of and ability to express his own views is no vice. There was no error in the exclusion.\n\nFinally, Mr. Gus B. Bowman, in response to the first questions regarding his beliefs regarding capital punishment, stated:\n\nA. Well, I've never thought about it until I was called yesterday into this court.\n\nShortly thereafter, he explained: \"I doubt very seriously I could assess the death penalty. I could give him life or some other penalty, but I don't think in my mind that I could condemn him to death.\" The prosecutor asked the next question, with Bowman answering as follows:\n\nQ. Certainly many people do not believe in the death penalty, and many people who believe in the death penalty believe in it but think that they could not do it themselves. And others, while they might not have general objections to it, could not assess or consider assessing the death penalty themselves. And I take it by your answer that in every case, no matter how serious it was, you as a juror could automatically exclude consideration of the death penalty and would in every case turn to some other form of punishment, whether it be life confinement or 99 years or whatever?\n\nA. I think that's true.\n\nQ. Okay. We appreciate your candor, Mr. Bowman and we would challenge for cause.\n\nIn response to cross-examination, Bowman testified that he could only consider the penalty if \"it was closer to home.\" He explained that he meant by that if a member of his family were a victim.\n\nWitherspoon does not require that exclusion be limited to veniremen who would automatically vote against the death penalty in every conceivable case. Williams v. Maggio, 679 F.2d 381, 386 (5th Cir.1982) (en banc), cert. denied, 463 U.S. 1214, 103 S. Ct. 3553, 77 L. Ed. 2d 1399 (1983). Rather, Witherspoon allows the exclusion of those veniremen who automatically vote against the death penalty \"without regard to any evidence that might be developed at the trial of the case before them.\" 391 U.S. at 522-23 n. 21, 88 S. Ct. at 1777 n. 21. The state is entitled to a jury that will consider imposing the death penalty based on the evidence in the case before them. See Williams, 679 F.2d at 386. Bowman without question would have been absolutely incapable of doing so in this case. Thus he was properly excluded.\n\nWith each of these jurors the trial judge had a superior view of what was asked, answered, and understood than do we. After independent review of the claimed errors and giving weight to the presence of the trial judge I am persuaded that his decisions were reasonable constructions of the testimony and no abuse of discretion has thus been shown. The doubts suggested by the dissent and worried over by Judge Randall's opinion are largely spun from factual supposition. That supposition proceeds as if there was no trial judge, sworn as we to apply Witherspoon. But there was.\n\nBUCHMEYER, District Judge, dissenting:\n\nMy dissent is presumptuous.\n\nA district judge -- one who has never before considered a death penalty case, much less the frustrating problems under Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968) -- is urging this Court to make it \"unmistakably clear\" just what standard of review the Fifth Circuit will apply in this and future cases involving Witherspoon challenges.\n\nIn the fifteen years since Witherspoon, this has not been done. And, the Fifth Circuit decisions in this area are becoming confusing and inconsistent. This dissent, therefore, argues that the Court should expressly hold:\n\n(i) that it will apply the same standard of review in Witherspoon cases that it does in other habeas corpus matters -- and, contrary to Judge Randall's opinion, will not conduct a de novo review to determine whether jurors were improperly excluded because of \"conscientious scruples\" against the death penalty;\n\n(ii) that it will, therefore, give deference under 28 U.S.C. ยง 2254(d) to specific findings of fact and credibility determinations made by state courts concerning the exclusion of jurors under Witherspoon\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e -- but that, contrary to Judge Higginbotham's opinion, no such deference will be accorded if the trial judge did not make express factual or credibility determinations, and merely concluded without explanation that the juror was properly excluded;\n\n(iii) that it will, of course, make an \"independent review\" of the state court record in Witherspoon cases -- just as it does in other habeas corpus matters involving fundamental constitutional issues -- to determine if it is \"unmistakably clear\" that jurors were, or were not, improperly excluded under Witherspoon;\n\n(iv) but that, if this is not \"unmistakably clear\" from the \"close scrutiny\" of the state court record, then the case will be remanded -- just as in other habeas corpus matters -- to the federal district court for an evidentiary hearing to determine whether or not jurors were improperly excluded under Witherspoon.\n\nIndeed, the Fifth Circuit approved just such a \" Witherspoon evidentiary hearing\" by a federal district court in Jackson v. Beto, 428 F.2d 1054 (5th Cir.1970) (the state prosecutor, the state trial judge, and the excluded jurors testified at this hearing).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Similarly, in Boulden v. Holman, 394 U.S. 478, 484-85, 89 S. Ct. 1138, 1142, 22 L. Ed. 2d 433 (1969), and Maxwell v. Bishop, 398 U.S. 262, 90 S. Ct. 1578, 26 L. Ed. 2d 221 (1970), the Supreme Court remanded cases to federal district courts for a \"further hearing directed to the [ Witherspoon ] issue\" which might \"conceivably modify in some fashion the conclusion so strongly suggested by the [state court] record\" that jurors were improperly excluded.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nApplying these standard principles of habeas review to the present case, this Court should reverse and remand to the federal district court for an evidentiary hearing concerning the exclusion of Juror Wells -- the minister who would automatically vote against the death penalty, but who could truthfully answer the two statutory death penalty questions -- (i) because the trial judge made no specific fact findings or credibility determinations concerning his exclusion,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and (ii) because, as Judge Randall also holds, it is not clear from the state court record whether Wells \"could and would answer the two statutory questions truthfully\" if someone had explained to him \"what the effect of those answers could be.\" For similar reasons, the case should be remanded for an evidentiary hearing concerning Juror Pfeffer.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e However, if this is not done, or if the district court determines that a meaningful Witherspoon hearing cannot be conducted,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e then the case must be reversed and remanded to the state courts for a new trial solely on the question of punishment. Witherspoon, 391 U.S. at 523 n. 21, 88 S. Ct. at 1777 n. 21.\n\nI. The Witherspoon Issue\n\nJudge Randall is correct that the federal courts \"have never expressly stated what the standard of review of a Witherspoon challenge should be\" in a petition for federal habeas corpus relief under 28 U.S.C. ยง 2254. However, she erroneously concludes that both the Supreme Court and the lower federal courts \"appear to engage in a de novo review of Witherspoon challenges\" without giving any deference to fact findings made by the state court.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e And, she errs in conducting such a de novo review in this case.\n\nWitherspoon challenges should, in fact, be subject to the very same standards of review that are applied to other constitutional issues presented by petitions for federal habeas relief. This conclusion is demonstrated by the following summary of:\n\n(i) the standards of habeas corpus review of findings of fact and credibility determinations by state courts and the deference that must be accorded to them under 28 U.S.C. ยง 2254(d) (slip op. page 7294, pages - );\n\n(ii) the standards for evidentiary hearings and fact findings by federal district courts in habeas matters (slip op. pages 7294-7295, pages - );\n\n(iii) the application of these standards and the \"presumption of correctness\" under ยง 2254(d) to review of Witherspoon challenges (slip op. pages 7295-7296, pages - );\n\n(iv) the types of Witherspoon cases that can -- and should -- be resolved by evidentiary hearings in the federal district courts, and the cases supporting the conclusion that such Witherspoon evidentiary hearings are proper (slip op. pages 7296-7297, pages - ); and\n\n(v) the application of these principles in the present case to Jurors Wells (slip op. pages 7297-7303, pages - ) and Pfeffer (slip op. pages 7303-7308, pages - ).\n\nHabeas Corpus Review: \"Findings\" by State Courts\n\nIn all habeas corpus proceedings instituted by state prisoners under 28 U.S.C. ยง 2254, the federal district and appellate courts are bound by the provisions of ยง 2254(d) -- which provide, in substance, that the findings of the state court \"shall be presumed to be correct,\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and that the petitioner has the burden of establishing that the factual determinations of the state court are \"clearly erroneous.\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Sumner v. Mata, 449 U.S. 539, 101 S. Ct. 764, 66 L. Ed. 2d 722 (1981); Asper v. Estelle, 709 F.2d 356 (5th Cir.1983).\n\nThe \"factual determinations\" covered by ยง 2254(d) are \"basic, primary or historical facts: facts in the sense of a recital of external events and the credibility of their narrators.\" Townsend v. Sain, 372 U.S. 293, 83 S. Ct. 745, 9 L. Ed. 2d 770 (1963), quoting Brown v. Allen, 344 U.S. 443, 506, 73 S. Ct. 397, 445, 97 L. Ed. 469 (1953) (opinion of Mr. Justice Frankfurter); Mason v. Balcom, 531 F.2d 717, 721-23 (5th Cir. 1976). Thus, if a state court has made specific findings of fact or credibility determinations, these are binding upon a federal court in a subsequent habeas proceeding unless the federal court concludes -- not with a \"broiler plate\" dismissal, but with \"some reasoned written references to ยง 2254(d) and the state court findings\" -- that the findings or credibility determinations are clearly erroneous. Summer v. Mata, 449 U.S. at 549-52, 101 S. Ct. at 770-71; Smith v. Phillips, 455 U.S. 209, 218, 102 S. Ct. 940, 946, 71 L. Ed. 2d 78 (1982).\n\nOf course, this does not mean that total deference must be accorded to state court findings. Eight exceptions to the \"presumption of correctness\" are listed in ยง 2254(d); the ones most relevant to this case and other Witherspoon challenges are:\n\n\"(1) that the merits of the factual dispute were not resolved in the State court hearing;\n\n(2) that the factfinding procedure employed by the State court was not adequate to afford a full and fair hearing;\n\n(3) that the material facts were not adequately developed at the State court hearing;\n\n(6) that the applicant did not receive a full, fair and adequate hearing in the State court proceeding;\"\n\nAccordingly, no \"presumption of correctness\" is due under ยง 2254(d) if the state court does not make any specific fact findings or credibility determinations -- or if the record is incomplete because the material facts were not fully and adequately developed at the state court hearing; Mason v. Balcom, 531 F.2d at 721-23; White v. Finkbeiner, 570 F.2d 194, 201 (7th Cir. 1978). Nor is any deference due to conclusions of law by a state court. Cuyler v. Sullivan, 446 U.S. 335, 341-42, 100 S. Ct. 1708, 1714-15, 64 L. Ed. 2d 333 (1980). And, where the resolution of the habeas corpus issue presents a \"mixed question of fact and law,\" the presumption of correctness under ยง 2254(d) does apply to findings of \"specific historical facts\" and to specific credibility determinations made by a state court -- but it does not apply to the conclusions of law reached by the trial court on the mixed question of fact and law. Townsend v. Sain, 372 U.S. 293, 309 n. 6, 83 S. Ct. 745, 755 n. 6, 9 L. Ed. 2d 770 (1963); Lee v. Hopper, 499 F.2d 456, 462 (5th Cir. 1974).\n\nEvidentiary Hearings and Findings by Federal District Courts in Habeas Matters\n\nIn all habeas corpus proceedings instituted by state prisoners for federal habeas relief, the district court first -- and, subsequently, the federal appellate court -- must \"closely scrutinize\" the state record to determine whether or not an evidentiary hearing must be held. Townsend v. Sain, 372 U.S. at 312-316, 83 S. Ct. at 756-58.\n\nIf a full and fair hearing had been held by the state court on the issues raised by the habeas petition \"either at the time of trial or in a collateral proceeding\" -- and if the merits of these issues have been resolved by specific fact findings and credibility determinations of the state court -- then no hearing is required by the federal district court. Townsend v. Sain, 372 U.S. at 312-15, 83 S. Ct. at 756-57. The \"presumption of correctness\" applies to these factual and credibility determinations under ยง 2254(d), and the federal courts then decide whether the conclusions of law reached by the state court are erroneous. Cuyler v. Sullivan, 446 U.S. at 341-42, 100 S. Ct. at 1714-15; Mason v. Balcom, 531 F.2d at 722 n. 10.\n\nHowever, if the state court has not conducted a full and fair hearing, or if the material facts were not adequately developed, or if the state court did not make any factual findings or credibility determinations, then an evidentiary hearing must be held by the federal district court. Mason v. Balcom, 531 F.2d at 721-23; Carroll v. Beto, 421 F.2d 1065 (5th Cir.1970). As stated in Martin v. State of Texas, 694 F.2d 423, 425 (5th Cir.1982).\n\n\"Had Martin's petition alleged facts contradicted by the record of the trial or a subsequent state hearing, an evidentiary hearing in the district court would be unnecessary. See Mack v. Smith, 659 F.2d 23, 25 (5th Cir.1981) ( ยง 2255 case). However, when a habeas corpus petitioner alleges facts not resolved in state proceedings that, if proved, would entitle him to the writ, he is entitled to an evidentiary hearing. Rummel v. Estelle, 590 F.2d 103, 105 (5th Cir.1979), aff'd 445 U.S. 263, 100 S. Ct. 1133, 63 L. Ed. 2d 382 (1980). . . .\" (694 F.2d at 425.)\n\nOf course, once a federal court holds an evidentiary hearing in a habeas proceeding, deference must be given to that court's findings of fact and credibility determinations; they \"shall not be set aside unless clearly erroneous.\" Fed.R.Civ.P. 52(a); Hall v. Maggio, 697 F.2d 641 at 643 (5th Cir.1983); Carroll v. Beto, 446 F.2d 648, 649 (5th Cir.1971). However, no deference is due if the federal district court has made no specific fact findings or credibility determinations, or if the trial court has reached an erroneous conclusion of law.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Jurek v. Estelle, 623 F.2d 929, 931-32 (5th Cir.1980); West v. Louisiana, 478 F.2d 1026, 1031-32 (5th Cir.1973), affirmed in relevant part, 510 F.2d 363 (5th Cir.1975) (en banc). Finally, if a hearing is required on the petition for habeas relief -- but if it is not possible for a meaningful hearing to be held -- then the writ of habeas corpus must be granted. Gray v. Lucas, 677 F.2d at 1097 (Witherspoon challenge and alleged ineffective assistance of counsel); Martin v. Estelle, 583 F.2d 1373, 1374 (5th Cir.1978) (compentency to stand trial); Hart v. Eyman, 458 F.2d 334 (9th Cir.1972) (habeas claim of coerced confession).\n\nHabeas Corpus Review of Witherspoon Challenges\n\nThere is no \" Witherspoon exception\" to 28 U.S.C. ยง 2254(d).\n\nThe standards concerning habeas corpus review and evidentiary hearings -- which apply to every other type of issue raised by petitions for federal habeas relief filed by state prisoners in death penalty cases -- should apply equally to a habeas claim that jurors were improperly excluded under Witherspoon. See Boulden v. Holman, 394 U.S. at 484-85, 89 S. Ct. at 1142; Jackson v. Beto, 428 F.2d 1054. Specifically, a Witherspoon challenge requires the federal courts to make an \"independent review\" of the state court record to determine whether an evidentiary hearing is necessary and to determine whether the state court has made findings or credibility determinations that must be given deference under ยง 2254(d). Townsend v. Sain, 372 U.S. at 316, 83 S. Ct. at 758.\n\n(i) The independent review\n\nThis review alone may establish that jurors were improperly excluded under Witherspoon. For example, it may be \"unmistakably clear\" from the state record that a juror was excluded who, despite her scruples against capital punishment, could set these feelings aside and truthfully answer the statutory death penalty questions. Moore v. Estelle, 670 F.2d 56, 57 (5th Cir.1982).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Or, the record may reveal that numerous jurors were excluded merely because they had \"conscientious scruples against the death penalty,\" Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776, or merely because their deliberations might be \"affected\" by their feelings about the death penalty, Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980). In these situations, no evidentiary hearing is necessary; jurors were improperly excluded under Witherspoon, and no deference is due under ยง 2254(d) to the state court's incorrect legal conclusions.\n\nSimilarly, the \"close scrutiny\" of the voir dire examination may establish, without more, that jurors were not improperly excluded under Witherspoon. For example, it may be \"unmistakably clear\" that the challenged jurors stated unequivocally that they could never vote for the death penalty under any circumstances. Lockett v. Ohio, 438 U.S. 586, 595-96, 98 S. Ct. 2954, 2959-60, 57 L. Ed. 2d 973 (1979); Porter v. Estelle, 709 F.2d 944 at 948-49 (5th Cir.1983); Bell v. Watkins, 692 F.2d 999, 1006-08 (5th Cir.1982).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In these situations, no evidentiary hearing is necessary; jurors were not improperly excluded under Witherspoon, and no ยง 2254(d) deference is accorded (or need be given) to the state court's correct legal conclusions.\n\nHowever, the independent review may simply establish that the state court record is not clear. From the answers given by the challenged jurors during voir dire, it may not be \"unmistakably clear\" whether they were, or were not improperly excluded under Witherspoon.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In these situations, an evidentiary hearing may or may not be necessary -- depending upon whether the state court made specific findings of fact or credibility determinations, or whether it merely concluded, without explanation, that the jurors were properly excluded.\n\n(ii) Specific findings or mere conclusions\n\nAs the level of Witherspoon frustration has increased, so have arguments by different Fifth Circuit judges that some deference must be accorded to the state court's \"findings\" that jurors were properly excluded for cause under Witherspoon\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e -- but none of these arguments have distinguished between specific factual and credibility determinations and mere conclusions of general rulings.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Mason v. Balcom, 531 F.2d 717. The resolution of a Witherspoon challenge presents \"a mixed question of law and fact,\" not unlike the mixed question of law and fact presented by a habeas claim of \"ineffective assistance of counsel.\" Mason v. Balcom, 531 F.2d at 721; Martin v. State of Texas, 694 F.2d at 425 n. 3. Therefore, under correct standards of review, a federal court confronted with a Witherspoon issue:\n\n(i) is not bound by purely legal conclusions reached by the state court. Cuyler v. Sullivan, 446 U.S. at 341-42, 100 S. Ct. at 1714-15.\n\n(ii) must give deference under ยง 2254(d), to any specific findings of factor credibility determinations made by the state court. Sumner v. Mata, 449 U.S. at 549-52, 101 S. Ct. at 770-71.\n\n(iii) but need not apply any \"presumption of correctness\" under ยง 2254(d) if the state court did not make any specific factual or credibility determinations, or if the record is incomplete because the material facts concerning the juror's exclusion were not adequately developed. Mason v. Balcom, 531 F.2d at 722; White v. Finkbeiner, 570 F.2d at 201.\n\nThese principles are illustrated by Mason v. Balcom, 531 F.2d 717 (5th Cir.1976). There, the petition for federal habeas corpus relief under 28 U.S.C. ยง 2254 alleged ineffective assistance of counsel. This was \"a mixed question of fact and law,\" so the \"presumption of correctness\" under ยง 2254(d) applied only to \"specific historical facts found by a state habeas corpus (such as what an attorney actually did for his client)\" -- but did not apply to the legal conclusions to be drawn from these facts (531 F.2d at 721-22). Accordingly, this Court held that it was not proper to give ยง 2254(d) deference to the state court's \"mere conclusion\" that petitioner Mason had been effectively represented by attorney Watts:\n\n\"The District Court found that the factual determinations of the state habeas court were inadequate and not fairly supported by the record. . . . In fact, the state habeas court in this case eally did not make any purely factual findings which the District Court could presume to be correct.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e It merely found -- or more properly, \"concluded\" -- that counsel had not been ineffective. Since the state habeas court did not make ny separate, purely factual findings of fact concerning the representation which attorney Watts afforded his client, no such findings were available for the District Court to rely on and the District Court properly conducted its own evidentiary hearing.\" (531 F.2d at 722) (emphasis added).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nSimilarly, in the review of a Witherspoon challenge, the \"presumption of correctness\" under ยง 2254(d) should apply to specific findings of fact and credibility determinations -- but no deference should be accorded to a mere conclusion that the juror was properly excluded. See Mason v. Balcom, 531 F.2d at 722; White v. Finkbeiner, 570 F.2d at 201. For example, a state trial judge could make specific factual and credibility determinations concerning the juror who may not be telling the truth or the juror who uses words like \"I don't think so\" that may appear equivocal in the voir dire transcript:\n\nthe lying juror\n\nJuror Drew first stated that she was morally opposed to capital punishment but later said she could vote to convict the defendant and sentence him to death. However, from her demeanor and from the tone of her voice when she tried to be convincing in saying she could put aside her scruples against the death penalty, it is clear to me that she could not vote to impose the death penalty. Indeed, it appears that she is lying -- perhaps out of some deep moral conviction -- in order to sit as a juror in this case and \"veto\" the death penalty even if the evidence should warrant it.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nthe \"I don't think so\" juror\n\nJuror Brou first said she \"did not think\" she could return a verdict that caused the defendant's death, then said that she couldn't \"positively\" say that she could not impose the death penalty in some \"hideous\" case, and finally answered that she did not \"feel\" she could return the death penalty. From her facial expressions, from her demeanor and the tone of her voice -- indeed, she indignantly spat out the words \"I don't think I can do that\" when asked if she could ever return a death verdict -- and from her positive and resounding \"no\" to the question of whether she could return the death penalty, it is clear to me that she would automatically vote against the death penalty in all cases.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIt is obvious that such specific fact findings and credibility determinations must be given deference under ยง 2254(d). Not to do so would be absurd: the trial judge has made specific factual and credibility findings based upon observations of the juror's demeanor, observations that cannot be reproduced in the cold appellate record; the typed transcript cannot accurately reflect the all-too-typical vacillating juror's true feelings about the death penalty; and the words on the printed page may not reveal whether the juror's answers are patently false. In addition, responses to Witherspoon questions during voir dire \"are often fraught with ambiguity\"; because of the \"tone of voice, the facial expression and the demeanor\" of the juror, even a simple \"yes,\" although on a cold written record appearing crystal clear, can be delivered in a manner that conveys doubt.\" McCorquodale v. Balkcom, 705 F.2d at 1561 (Kravitch, Jr., dissenting).\n\nAccordingly, specific findings of fact and credibility determinations by state courts in Witherspoon cases must be accorded the presumption of correctness under ยง 2254(d) -- just as, in other areas of voir dire, trial judges are accorded broad discretion in evaluating juror impartiality. See Irvin v. Dowd, 366 U.S. 717, 81 S. Ct. 1639, 6 L. Ed. 2d 751 (1961); United States v. Taylor, 554 F.2d 200, 202 (5th Cir.1977); United States v. Robbins, 500 F.2d 650, 653 (5th Cir.1974).\n\nHowever, the state court may not contain any specific fact findings or crediability determinations.Instead, the trial judge may have merely concluded that the juror was properly excluded, without explanation and with a general ruling, such as: \"The juror is excused for cause,\" or \"The state's motion to exclude this juror for cause is granted,\" or \"This juror is not qualified under Witherspoon. \" The trial judge may have decided that the complaint juror was lying, or that the \"I don't think so\" juror had expessed unequivocal opposition to the death penalty. However, there is simply no way for an appellate court to review these findings -- to determine if they are clearly erroneous or if the trial court abused its discretion -- since there are no specific and express findings in the record. In analogous situations, this Court has not hesitated to require \"on the record\" findings when they are necessary to a proper appellate review. See, for example, United States v. Preston, 608 F.2d 626 (5th Cir.1979):\n\n\"We hold today that a Trial Judge must make an on-the-record finding that the probative value of admitting a prior conviction outweighs its prejudicial effect before admitting a non-609(a)(2) prior conviction for impeachment purposes under Rule 609(a)(1). An on-the-record finding that probative value outweighs prejudicial effect is not merely an idle gesture. Such a finding insures that the Judge has at least taken into account the relevant considerations. Of course, such a finding can still be challenged, but such challenge is analyzed under the abuse of discretion standard.\" (608 F.2d at 638).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nSee also United States v. Martinez, 604 F.2d 361, 364 (5th Cir.1979) (there may be situations \"where the trial judge must spell out his findings with adequate specificity for meaningful appellate review\").\n\nMoreover, a general ruling by a state court that \"the juror is not qualified\" is no different than the mere conclusions that \"the petitioner received effective assistance of counsel\", Mason v. Balcom, 531 F.2d at 722, or that \"the confession was not coerced\", White v. Finkbeiner, 570 F.2d at 201. Therefore, such general rulings -- unsupported by any specific fact findings or credibility determinations -- are not entitled to a \"presumption of correctness\" under ยง 2254(d), nor is a federal court \"required to strain to transform [such conclusions] into a set of findings of fact binding upon it.\" Mason v. Balcom, 531 F.2d at 722.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nWitherspoon Evidentiary Hearings\n\nThis does not mean, however, that every Witherspoon case must be reversed and remanded for a new punishment trial if there are no specific factual and credibility findings by the state court resolving the question of whether jurors were, or were not, improperly excluded. As discussed above, it may be \"unmistakably clear\" from the review of the record that the challenged jurors were, or were not, properly excluded for cause; but if it is not, then -- just as in other habeas matters -- an evidentiary hearing in the federal district court may be required. See Mason v. Balcom, 531 F.2d at 721-23; Carroll v. Beto, 421 F.2d 1065.\n\nFor example, the juror may have been excused immediately after making the statement \"I don't think I could ever vote to inflict the death penalty.\" If asked additional questions, this juror may have been properly excluded because of unequivocal opposition to capital punishment -- or this juror may have been able to set aside personal feelings and vote for the death penalty if warranted by the evidence. In cases like this, the federal district court should hold an evidentiary hearing to determine whether the juror was, or was not, improperly excluded under Witherspoon. This Court has, in fact, approved the holding of evidentiary hearings to resolve appropriate Witherspoon challenges -- as has the United States Supreme Court.\n\n(i) Supreme Court cases\n\nWitherspoon evidentiary hearings were directed by the Supreme Court in Boulden v. Holman, 394 U.S. 478, 89 S. Ct. 1138, 22 L. Ed. 2d 433 (1969) and Maxwell v. Bishop, 398 U.S. 262, 90 S. Ct. 1578, 26 L. Ed. 2d 221 (1970). In Boulden, the \"independent review\" of the state court record revealed that thirteen jurors had been excluded for cause immediately after stating they had \"a fixed opinion against\" or \"did not believe in\" capital punishment. In Maxwell v. Bishop, it was clear from the state court record that three jurors had been excused immediately after stating that they \"didn't believe in capital punishment\" or that they \"thought\" or were \"afraid\" they had conscientious scruples against the death penalty. No additional questions were asked to determine if these jurors could, despite their feelings about capital punishment, \"conscientiously follow the instructions of the trial judge and fairly consider the imposition of the death penalty.\" Instead of reversing and remanding to the state courts for new punishment trials -- as this Court did in almost identical situations in Granviel v. Estelle, 655 F.2d 673, and Burns v. Estelle, 626 F.2d 396 -- the Supreme Court remanded to the federal district courts for hearings concerning the Witherspoon challenges:\n\n\"It appears, therefore, that the sentence of death imposed upon the petitioner cannot consitutionally stand under Witherspoon v. Illinois. We do not, however, finally decide that question here, for several reasons. First, the Witherspoon issue was not raised in the District Court, in the Court of Appeals, or in the petition for certiorari filed in this Court. A further hearing directed to the issue might conceivably modify in some fashion the conclusion so strongly suggested by the record now before us. Further, it is not clear whether the petitioner has exhausted his state remedies with respect to this issue. Finally, in the event it turns out, as now appears, that relief from this death sentence must be ordered, a local federal court will be far better equipped than are we to frame an appropriate decree with due regard to available Alabama procedures.\" (394 U.S. at 484, 89 S. Ct. at 1142) (emphasis added).\n\nIn other Witherspoon cases which have reached the Supreme Court, there has been no remand for an evidentiary hearing. However, none of these involved petitions for federal habeas relief; all were direct appeals in state court cases and, of course, federal courts to hold hearings in habeas matters. Townsend v. Sain, 372 U.S. at 313 n. 9, 83 S. Ct. at 757 n. 9; Dixon v. Beto, 472 F.2d 598 (5th Cir.1973).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\n(i) Fifth Circuit cases\n\nJackson v. Beto, 428 F.2d 1054 (5th Cir.1970), was this Court's first \"post- Witherspoon \" decision.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e There, the state prisoner claimed that jurors had been excluded solely because of their \"conscientious scruples\" against the death penalty. No \"independent review\" could be conducted of the state court record because the transcript of the voir dire examination had been lost.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e However, the federal district court, applying standard principles of habeas review to this Witherspoon challenge, conducted an evidentiary hearing -- approximately six years after the state court trial -- to determine whether jurors had, or had not, been improperly excluded. At this hearing, the petitioner presented evidence that of the twenty-three jurors who had been excluded for cause by the state court:\n\n\"Two veniremen were dead.\n\n\"Two were not available.\n\n\"Two (Forse and Porterfield) did not recall being asked if they could conceive of any fact, situation, or circumstance in which they could vote for the death penalty.\n\n\"One venireman said he was asked no questions at all.\n\n\"One recalled his response that he could not conceive of any situation in which he could vote a death penalty.\n\n\"Thirteen testified that the question was not asked or they could not remember if being asked.\n\n\"Only two veniremen, Kelly and Inmon, testified that they were asked about an irrevocable commitment against the death penalty, that they replied they had none, but were nonetheless exluded for cause. In the final analysis, only two of twenty three excluded veniremen testified to clear non-compliance with Witherspoon standards.\" (428 F.2d at 1056).\n\nHowever, both the prosecutor and the state trial judge testified at the Witherspoon hearing that no juror had been excused merely because of scruples against the death penalty; that the prosecutor usually asked each juror, in turn, \"whether or not they could, under any circumstances, any state of facts, give the death penalty?\"; and that, if the prosecutor failed to do so, the trial judge asked each juror this \"second question\": \"Can you conceive of any facts or circumstances so brutal that you could vote for the death penalty in a proper case?\" In addition:\n\n\"Judge Bacon further testified that he had presided over a number of capital cases, that his concern was not to excuse a juror simply because he stated he had a conscientious scruple, that no venireman was excused unless he stated unambiguously that he could not vote for the death penalty under any set of facts or circumstances.\" (428 F.2d at 1056).\n\nThe federal district court resolved the conflict in the evidence by crediting the testimony of the state trial judge and prosecutor, and by specifically finding that each prospective juror had been asked the \"second question.\" This Court affirmed the death penalty, holding that the district court's findings were not \"clearly erroneous\" and that no juror had been improperly excused under Witherspoon. (428 F.2d at 1057).\n\nSimilarly, in Marion v. Beto, 434 F.2d 29 (5th Cir.1970), the state trial court held a \" Witherspoon evidentiary hearing on a petition for habeas corpus -- apparently four or five years after the original murder trial -- and made \"findings of fact concerning the methods used in selecting jurors and excluding same for cause\" (302 F. Supp. at 913. This Court gave deference to the specific factual findings made by the state court and by the federal district court\" (434 F.2d at 30), but held that both lower courts reached the erroneous legal conclusions that the improper exclusion of three jurors did not require reversal under Witherspoon because there had been no \"sytematic exclusion\" of jurors merely because they had scruples against the death penalty (434 F.2d at 31-32). And, in Gray v. Lucas, 677 F.2d 1086, 1098 (5th Cir.1982), this Court approved an evidentiary hearing at which the federal district court determined -- upon the basis of testimony by the state prosecutor and the defense attorney -- \"which jurors had been struck preemptorily\"; no Witherspoon violation was found because these feelings were not \"clearly erroneous.\"\n\nIn contrast to these cases, the Fifth Circuit did not even consider remanding Witherspoon challenges for evidentiary hearings in Burns v. Estelle, 626 F.2d 396 (5th Cir.1980) (en banc) or in Granviel v. Estelle, 655 F.2d 673 (5th Cir.1981). Mrs. Doss had been excused for cause in Burns after stating that she \"did not believe\" in the death penalty and this \"would affect her deliberations.\" Mr. Harrison had been excused for cause in Granviel after stating that \"I don't think I could [ever vote to inflict the death penalty].\" In neither case had the state court made specific factual or credibility determinations that, based on the demeanor and tone of voice of the jurors, these answers established automatic and unequivocal opposition to the death penalty.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Although noting that additional questioning may have done so, this Court reversed the death penalty in both cases and remanded both cases to the state courts for new punishment trials:\n\n\". . . Further questioning, which was denied, might well have either revealed that [Mrs. Doss] she could lay her personal views aside, follow the court's instructions, and do her duty as a citizen or made unmistakeably clear that she could not or would not do so. What her answers might have been will never be known. She was therefore prematurely excused, with the showing required by Witherspoon for her dismissal incomplete. Since she was, Burns' death sentence cannot be carried out. The panel's disposition of the case was therefore correct.\" (626 F.2d at 398) (emphasis added).\n\nYet, it is obvious that this \"further questioning\" could have been done at an evdentiary hearing before the federal district court -- at which the judge, in addition to the \"close scrutiny\" of the state record, could hear testimony from the challenged jurors, as well as the prosecutor, the defense attorney, and even the state trial judge.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Jackson v. Beto, 428 F.2d 1054. And, if the district court specifically found that the jurors (Mrs. Doss in Burns, Mr. Harrison in Granviel) could have set aside their \"conscientious scruples\" against capital punishment, their exclusion would have been improper under Witherspoon. But if these jurors could not have set aside their feelings, and were in fact automatically opposed to the death penalty, then there would have been no Witherspoon violation -- and the cases should not have been reversed by this Court.\n\nIndeed, this is precisely what was determined at the evidentiary hearing in Jackson v. Beto, 428 F.2d 1054. However, neither Burns nor Granviel even mention the fact that a Witherspoon hearing as approved by this Court in Jackson v. Beto, 428 F.2d 1054, or the fact that the Supreme court remanded almost identical situations to federal district courts for hearings in Boulden v. Holman and Maxwell v. Bishop. And, neither these two opinions -- nor any other Fifth Circuit decision -- discuss any reasons why evidentiary hearings should not be held on appropriate Witherspoon challenges.\n\n(iii) Possible objections -- and obvious benefits\n\nObjections might be made to Witherspoon evidentiary hearings on the basis that it would be too difficult to make a reliable determination of how the juror really felt about the death penalty during voir dire -- or on the basis that it would not be possible to hold a Witherspoon hearing several years after the original trial. Neither of these objections is valid.\n\nThe issues in a Witherspoon evidentiary hearing would be no more difficult than those raised in other death penalty cases, such as claims that the petitioner received ineffective assistance of counsel or was not mentally competent to stand trial. See Mason v. Balcom, 531 F.2d at 721-23; Carroll v. Beto, 421 F.2d 1065. In analogous situations, post-trial hearings are conducted to determine the impartiality of a juror. See, e.g., Smith v. Phillips, 455 U.S. 209, 215-16, 102 S. Ct. 940, 945 71 L. Ed. 2d 78 (1982) (during trial, juror applied for job with prosecutor; this \"Court has long held that the remedy for allegations of juror partiality is a hearing in which the defendant has the opportunity to prove actual bias\"); Remmer v. United States, 347 U.S. (1954) (hearing required to determine if juror prejudiced by attempted bribe).\n\nMoreover, retrospective determinations of events which took place years earlier are regularly required in habeas matters. For example, this Court has held that it is proper to make a retrospective determination of whether or not a state prisoner was mentally competent to stand trial twenty-three years before the federal court evidentiary hearing. Carroll v. Beto, 421 F.2d 1065 (5th Cir.1970) and 446 F.2d 648 (5th Cir.1971). The Witherspoon hearing in Jackson v. Beto, 428 F.2d 1054, was held some six years after the original murder trial.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The evidentiary hearing in this case would be held some nine years after O'Bryan's murder trial.\n\nFinally, just as in any other habeas matter, the federal district court must determine whether or not a retrospective Witherspoon hearing cannot be held for some reason -- e.g., if the challenged juror is dead or cannot be located\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e -- then the conviction cannot stand and the writ of habeas corpus must issue. See Martin v. Estelle, 583 F.2d at 1374 (if \"a meaningful restrospective competency hearing cannot be conducted, then of course, the writ must issue\"); Hart v. Eyman, 458 F.2d 334 (habeas claim of coerced confession).\n\nIn addition, there are obvious benefits of appropriate Witherspoon challenges are resolved by evidentiary hearings in the federal district courts. This may help prevent inconsistent Witherspoon decisions; for example, if Williams v. Maggio, 679 F.2d 381, ahd been remanded for an evidentiary hearing concerning the challenged juror (Ms. Brou), this Court would not have rendered a fragmented (7-4) determination that \"I think\" and \"I feel\" voir dire answers constituted unequivocal opposition to the death penalty -- even though they are remarkably similar to the \"I think\" and \"I feel\" voir dire answers in Granviel v. Estelle.\n\nFinally, the procedure suggested by the dissent offers the best way to resolve the competing interests which are present in every death penalty case. Judge Randall described these interests in granting the stay of execution in this case, O'Bryan v. Estelle, 691 F.2d 706, 708 (5th Cir.1982):\n\n\"In a capital case, the possibility of irreparable injury weighs heavily in the movant's favor. The irreversible nature of the death penalty must be weighed against the fact that \"[t]here must come a time, even when so irreversible a penalty as that of death has been imposed upon a particular defendant, that the legal issues in the case have been sufficiently litigated and relitigated so that the law must be allowed to run its course. . . .\" Evans v. Bennett, 440 U.S. 1301, 1303, 1306, 99 S. Ct. 1481, 1484, 59 L. Ed. 2d 756 (1979) (Rehnquist, J., granting a stay of execution). In a capital case, we must be particularly certain that the legal issues \"have been sufficiently litigated,\" and the criminal defendant accorded all the protections guaranteed him by the Constitution of the United States. See Shaw v. Martin, 613 F.2d 487, 491 (4th Cir.1980).\"\n\nIn this and other Witherspoon cases, the Fifth Circuit has recognized only two alternatives: either affirm the conviction and the death penalty (even if some members have serious doubts about Witherspoon challenges,) or reverse and remand to the state court for a new punishment trial. A third alternative -- remanding to the federal district court for an evidentiary hearing if the state record is not clear and if the state court has made no specific fact findings or credibility determinations -- is the quickest and the best way of resolving these competing interests.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e It is also the correct way.\n\nApplying these standards of review to the present case, it is clear that this Court should reverse and remand to the federal district court or an evidentiary hearing concerning the exclusion of Juror Wells and Juror Pfeffer. Juror Wells\n\nReverend Wells first said that he would automatically vote against the death penalty. Then, he stated that he could truthfully answer the two statutory death penalty questions.But no one -- the prosecutor, the defense attorney, or the trial judge -- explained to Reverend Wells the effect of \"yes\" answers to these questions: that the trial judge would be compelled to sentence the defendant to death. So, Judge Randall correctly concludes:\n\n\"We thus do not know whether, in saying that he could and would answer the two statutory questions truthfully, Wells understood what the effect of those answers could be.\"\n\nWe cannot assume that Reverand Wells knew the effect of his answers to the death penalty questions, anymore than we can assume that he did not know. Nor can we suppose, as Judge Higginbotham does, that Reverand Wells did not know the effect of his answers (i) because the defense attorney told him these were \"merely questions that you answer to the court,\" or (ii) because his statement that he could \"answer the two statutory questions truthfully\" would make all his other testimony virtual nonsense. Witherspoon prohibits such speculation -- and makes it clear that the critical question is not what exotic reasoning might be applied to Reverand Wells' answers by courts or commentators, but what he meant by them:\n\n\"The critical question, of course, is now how the phrases employed in this area have been construed by courts and commentators.What matters is how they might be understood -- or misunderstood -- by prospective jurors. . . . Unless a venireman states unambigously that he would automatically vote against the imposition of capital punishment no matter what the trial might reveal, it simply cannot be assumed that is his position.\" (391 U.S. at 516 n. 9, 88 S. Ct. at 1774 n. 9).\n\nIndeed, \"only a tortured reading of the transcript\" will support any conclusion but the fact that Reverand Wells first stated he would automatically vote against the death penalty, but then said that he could truthfully answer death penalty questions.\n\nNor can we resolve this uncertainty concerning Reverend Wells' answers by giving \"deference\" under ยง 2254(d) to specific findings of fact or credibility determinations by the state court. Indeed, there were none -- although, without question, the trial judge might have made factual and credibility findings. For example, these two alternatives are consistent with the entire voir dire examination of Reverand Wells:\n\nthe disqualified juror\n\nJuror Wells first stated that he could never vote to impose the death penalty, but later said he could truthfully answer the two statutory punishment questions. It is clear to me that this juror is not being truthful when he says he can set aside his deep feelings against the death penalty. His demeanor, his tone of voice -- indeed, he was angry when he realized the initial questions implied that he might be willing to impose the death penalty -- all make it unmistakably clear that he could never vote to impose the death penalty.\n\nthe qualified juror\n\nJuror Wells first stated that he could never vote to impose the death penalty, but later said he could truthfully answer the two statutory punishment questions. It is clear to me that this juror is qualified under Witherspoon. His demeanor, his tone of voice -- indeed, he spoke quietly and deliberately, without hint of anger\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e -- all make it unmistakably clear that this minister could, despite his feelings about the death penalty questions, just as he said.\n\nIf either of these specific determinations had been made, the ยง 2254(d) \"presumption of correctness\" would apply and the findings would be binding on the federal courts because they are not \"clearly erroneous.\" However, the trial judge made no such findings; instead, after the state's motion to disqualify Reverand Wells, he merely ruled \"I'll sustain the motion.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e No deference should be accorded to this mere conclusion, Mason v. Balcom, 531 F.2d at 721-23 -- and this Court must not speculate about which possible interpretation of the voir dire is correct. Witherspoon, 391 U.S. at 516 n. 9, 88 S. Ct. at 1774 n. 9.\n\nSince it is not clear from the record whether Juror Wells was, or was not, improperly excluded under Witherspoon, the case should be reversed and remanded for an evidentiary hearing. Jackson v. Beto, 428 F.2d 1054.If the federal district court finds that Reverand Wells was unequivocally opposed to the death penalty at the time of voir dire in 1974, there would be no error in his exclusion for cause. However, if it is determined that Reverand Wells could have served as an impartial juror notwithstanding his views about the death penalty, then the cae must be reversed and remanded to the state courts for a new punishment trial.\n\nFinally, Judge Randall's \"shifting burden\" of proof -- which penalizes O'Bryan because his attorney failed to clarify \"whether Wells understood the possible effect of his answers\" -- is novel, unsupported and undefined.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e It is also erroneous: Witherspoon is \"a limitation on the State's power to exclude, \" and Judge Randall's approach would permit prospective jurors to be barred from jury service on \"a broader basis\" than their inability to follow the law. Adams v. Texas, 448 U.S. at 48, 100 S. Ct. at 2528. In addition, it ignores the fact that, under Texas law, it is within the discretion of the trial court to refuse to permit the attorneys to \"tell the jury panel the effect of their \"yes' and \"no\" answers\" to the death penalty cases. See Burns v. State, 556 S.W.2d 270, 279 (Tex.Cr.App.1977), rev'd on other grounds, 626 F.2d 396 (5th Cir.1980) (en banc); Hammett v. State, 578 S.W.2d 699, 704 (Tex.Cr.App.1979) (en banc). Thus, if Judge Randall's analysis is correct, this Court must also hold that the state practice is unconstitutional and that attorneys must be permitted to explain to the jurors the effect of their answers to the statutory death penalty questions.\n\nTherefore, if the case is not remanded for a Witherspoon evidentiary hearing in the federal district court as urged by this dissent, the death sentence must be reversed -- because two of the three members of this panel have concluded that it is not \"unmistakably clear\" whether Reverend Wells was, or was not, unequivocally opposed to the death penalty.\n\nJuror Pfeffer\n\nTo Judge Randall, Juror Pfeffer presents \"the quintessential example of a situation\" where \"at least some deference\" would be appropriate for a trial judge observing a juror struggling \"to give an honest answer to difficult questions.\" To Judge Higginbotham, he is both \"a paradigm of veniremen in capital cases\" and a \"confused and confusing venireman.\" To the Texas Court of Criminal Appeals, he was equivocal at first, but the \"unbending in his resolve\" against capital punishment (591 S.W.2d at 471).\n\nBut, to this dissent, Juror Pfeffer is another example of why federal judges should not, on the basis of their \"independent review\" of a cold appellate record, engage in speculation about a confusing inconsistent voir dire -- but should, if the state court has made no specific fact findings or credibility determinations concerning a juror like Pfeffer, remand the case with a Witherspoon evidentiary hearing so the federal district court can determine whether he was, or was not, improperly excluded under Witherspoon. Jackson v. Beto, 428 F.2d 1054; Boulden v. Holman, 394 U.S. 478, 89 S. Ct. 1138, 22 L. Ed. 2d 433.\n\nDuring the first portion of his voir dire, Juror Pfeffer was (as described by Judge Randall) equivocal and inconsistent. However, he did state clearly -- not once, but several times -- that he could vote to impose the deathy penalty if the circumstances were \"very, very extreme. \"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e For example:\n\n\"THE COURT: From listening to the way you've explained your answers, I take it that you're not necessarily opposed to it, but it would take an extreme set of circumstances for you to ever give it?\n\n\"JUROR PFEFFER: That's correct.\" (3 Trial Transcript at 875).\n\n\"THE COURT: Then, are you saying by virtue of that answer that you feel that there would be a set of circumstances that could exist whereby you as a member of a jury could feel that the death penalty would be a proper punishment and that you would return such a verdict if you felt it was proper?\n\n\"JUROR PFEFFER: In general, I would say, that was when I said with reservations. So, I still have reservations.\" (3 Trial Transcript at 879-880).\n\n\"THE COURT: Are you telling me then that this is just something that would be difficult within yourself to do, but your'e not necessarily opposed to it?\n\n\"JUROR PFEFFER: I think this is correct.\n\n\"THE COURT: And there may well be some facts and circumstances that do exist whereby you could and would, if you felt it was justified, return a verdict of death?\n\n\"JUROR PFEFFER: Well, like I say, I still have the mixed feelings there that I don't really think I could make a proper judgment, being a borderline thinking on the subject. I just don't -- a decision that I don't know that I could make. Let's put it that way.\n\n\"THE COURT: Are you saying that under no circumstances could you ever make that decision or that it would just take an extreme set of circumstances before you would?\n\n\"JUROR PFEFFER: It would take a very, very extreme set of circumstances to do it.\" (3 Trial Transcript at 881-82).\n\nShortly after this, the trial judge instructed Pfeffer that \"the law requires that we have to have a definite answer\" -- and from that point on every answer given by Pfeffer was obviously affected by one trial court's statement that he must give \"a yes or no\" answer.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Consider, for example, the three responses from which Judges Randall and Higginbotham conclude that Pfeffer made \"unmistakably clear\" his opposition to the death penalty:\n\n(i) \"Well if it says a yes or no, I would have to say yes, I would automatically vote against [the death penalty], to give a correct answer\";\n\n(ii) \"I think [sentencing] would [pose problems] because it would have a direct hearing on the outcome anyway, what we've been talking abut with the judge a minute ago \";\n\n(iii) \"I think at the present time that's correct [I couldn't answer the penalty questions if the death penalty resulted], yes.\"\n\nObviously, the emphasized portion of each of these responses is a qualification, -- one which refers to the trial judge's instructions that Juror Pfeffer must give definite, \"yes or no\" answers. And, even if this were not so, to focus on two or three responses, and ignore the rest of the voir dire is improper.\n\nTo be sure, as Judge Randall suggests, the trial judge could have made specific findings \"that Pfeffer's professed willingness to assess the death penalty in a \"very, very extreme set of circumstances' was a smoke screen for what was really an inability to assess the death penalty under any circumstances.\" But he did not: again, there are no specific factual or credibility determinations; the trial judge merely granted the state's challenge for cause with conclusion \"Mr. Pfeffer, you will be excused at this particular time.\"\n\nAccordingly, the \"independent review\" of the state record reveals a confusing voir dire where Juror Pfeffer said that he could impose the death penalty in extreme circumstances -- but later siad that, if forced to give a definite answer, he would haave to say \"at the present time\" that he could not vote to impose the death penalty.It is not \"unmistakably clear\" whether Juror Pfeffer was, or was not, improperly excluded for cause. Therefore, the case should be remanded to the federal district court for a Witherspoon evidentiary hearing.\n\nHowever, if there is no remand for an evidentiary hearing, then the case must be reversed and remanded to the state courts for a new punishment trial. It is not \"ummistakably clear\" from the state record that Juror Pfeffer was irrevocably opposed to the death penalty. From a fair reading of the entire voir dire of Juror Pfeffer, he was excused for cause either (i) because he could not say \"in advance of trial whether he would in fact vote for the extreme penalty in the case before him,\" or (ii) because he was unable to state positively whether he could or could not vote for the death penalty. In either event, his exclusion would have been improper. Witherspoon v. Illinois, 391 U.S. at 522 n. 21, 88 S. Ct. at 1777 n. 21; Adams v. Texas, 448 U.S. at 49-50, 100 S. Ct. at 2528-29 (\"But neither nervousness, emotional involvement, nor inability to deny or confirm any effect whatsoever is equivalent to an unwillingness or an inability on the part of the jurors to follow the court's instructions and obey their oaths, regardless of their feelings about the death penalty.\")\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nII. Other Issues\n\nI concur with Judges Randall and Higginbotham that the exclusion of Juror Bowman was not in violation of Witherspoon. I also concur in parts I, II, IV and V of Judge Randall's opinion, and in part I of Judge Higginbotham's opinion.\n\n\u003cspan class=\"fn\"\u003e1. The Texas Penal Code provides in relevant part: (a) A person commits an offense if he commits murder as defined under Section 19.02(a)(1) of this code and: (3) the person commits the murder for remuneration or the promise of remuneration or employs another to commit the murder for remuneration or the promise of remuneration; (b) An offense under this section is a capital felony. Tex.Penal Code Ann. ยง 19.03(a)(3)(b) (Vernon 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A Texas trial judge must sentence a defendant to die if the jury returns affirmative answers to two, sometimes three, special interrogatories. See Tex.Code Crim.Pro.Ann. art. 37.071 (Vernon 1981) (set forth in relevant part at note 13).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. While Maxwell, supra, and Boulden, supra, were federal habeas cases, the Supreme Court did not ultimately decide whether a Witherspoon violation had occurred in either case because it was not satisfied that the Witherspoon issue had been raised in the federal or state courts below. Accordingly, the Court remanded both cases to the lower federal courts for further consideration, and if necessary, exhaustion of state remedies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The relevant portion of the voir dire is set forth in the Court of Criminal Appeals' opinon: Q. . . . Now, you have expressed an objection to the death penalty. Would you feel that your conscientious objection to the death penalty as such, that it would affect your deliberation upon his guilt in the first instance or on either of the questions of fact, on those questions that I asked? A. No. Q. Well, now you have answered me two different ways. A. Maybe I misunderstood you. Q. I asked you at the outset whether you could participate as a juror in returning a verdict that would require the infliction of death as a punishment of crime. A. Oh, I see. Q. And you expressed an opinion that you could not. A. May I ask a question? You say it's the Court and not the jury that imposes the penalty, is that right? Q. That's right, but the Court is obligated to assess punishment based on the answers to those special issues. . . . Would your attitude and your objection to that form of punishment interfere with the way you deliberated upon the facts of the case? A. No, it wouldn't. Q. You believe you can successfully set that aside and base your answers solely and exclusively upon the evidence you hear in the trial of the case? A. Yes, Sir. 641 S.W.2d at 560.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Ward was excused because he could not take the oath swearing that his decision would not be \"affected\" by the fact that the death penalty might be imposed. See Tex. Penal Code Ann. art. 12.31(b) (Vernon 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. We have held, for example, that a trial court cannot exclude a juror who says that he or she would be able to serve as a juror but that he or she could not sign the verdict as the foreman. Alderman, supra, 663 F.2d at 563.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Witherspoon holds that the state must establish that a juror's automatic opposition to the death penalty is \"unmistakably clear.\" While a defendant who seeks to rehabilitate a juror might not be held to such an exacting standard, we express no view as to how certain a trial judge should be before he or she rejects the state's challenge for cause on the basis of the defendant's rehabilitation of the juror. We hold only that the defense counsel's attempt at rehabilitation was insufficient here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. There is ample support in the record of the first twenty pages of the voir dire for this position. For example: THE COURT: From listening to the way you've explained your answers, I take it that you're not necessarily opposed to it, but it would take an extreme set of circumstances for you to ever give it? JUROR PFEFFER: That's correct. 3 Transcript at 875. THE COURT: Then, are you saying by virtue of that answer that you feel that there would be a set of circumstances that could exist whereby you as a member of a jury could feel that the death penalty would be a proper punishment and that you would return such a verdict if you felt it was proper? JUROR PFEFFER: In general, I would say, and that was when I said with reservations. So, I still have reservations. THE COURT: Well, everybody is going to have reservations. There's no question about that. They're just wanted to know how you feel personally as far as the death penalty being considered as punishment for crime. In other words, you apparently do not have any conscientious objection to the death penalty, do you? JUROR PFEFFER: Not in general. THE COURT: All right. JURER PFEFFER: But specific possibly. THE COURT: And then, if you felt the facts and circumstances justified and warranted the death penalty being the verdict, could you join and vote with eleven others to return that verdict if you felt it was proper to do so under the facts and circumstances as you hear them from this witness stand? JUROR PFEFFER: As I said, I don't know. Like I say, I'm not set -- I'm trying to answer your question. THE COURT: I understand. JUROR PFEFFER: But I know I'm vague; but I don't trust myself on the judgment of this with -- as you understand as you heard from my answers, I don't have a concrete enough conviction either way. I just really -- THE COURT: Are you telling me then that this is just something that would be difficult within yourself to do, but you're not necessarily opposed to it? JUROR PFEFFER: I think this is correct. THE COURT: And there may well be some facts and circumstances that do exist whereby you could and would, if you felt it was justified, return a verdict of death? JUROR PFEFFER: Well, like I say, I still have the mixed feelings there that I don't really think I could make a proper judgment, being a borderline thinker on the subject. I just don't -- a decision that I don't know that I could make. Let's put it that way. THE COURT: Are you saying that under no circumstances could you ever make that decision or that it would just take an extreme set of circumstances before you would? JUROR PFEFFER: It would take a very, very extreme set of circumstances to do it. THE COURT: Then you're not opposed to it. Is that correct? JUROR PFEFFER: Well, I'm not opposed to it, but in my own heart I don't know if I could make the decision, the proper decision with really by weighing the evidence, being on a thin line one way or another. I mean, this is not directly -- I know you would like direct answers, but this is the best I can do and it is a vague answer. Id. at 879-82.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Pfeffer may also be viewed as a person who is simply afraid to make a decision involving the death penalty, not because of scruples against the death penalty but because of concern about his ability to make a correct judgment on such an important matter. For example, Pfeffer explained to the trial court that he did not \"trust [himself] on the judgment of this.\" 3 Trial Transcript at 881. He continued: \"I'm not opposed to it, but in my own heart I don't know if I could make the decision, the proper decision with really by weighing the evidence.\" Id. at 882. In view of the fact that the trial court excluded Pfeffer because he ultimately stated that he would automatically vote against the death penalty no matter what the trial revealed, we need not decide whether Witherspoon would permit exclusion of a juror who concludes that he would be unable to make a decision in a death penalty case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. A portion of the voir dire was set forth in the majority opinion: Q. Assuming that I prove the defendant committed first degree murder and is convicted, assume I prove the statutory requirements of aggravating circumstances, which under Louisiana law make the case appropriate for the death penalty, can you return a verdict that mandates that the defendant be put to death by electrocution? A. (Ms. Brou) I don't think I could do that. Q. Okay. I appreciate your being honest with me. And let me ask you this. When you say I don't think I can, what you are telling me, you can't tell me positively that you can; is that correct? A. (Ms. Brou) I know there is certain cases where you read about them and they are so hideous that you just think, oh, the death penalty would be the only good outcome, but this particular case, I don't know. Q. As the Judge told you, this is the killing of a -- Well, I don't know if the Judge said all that, but I think it is before the jury. This is the A \u0026 P robbery, murder that occurred on January the 5th of this year. And it is my understanding that you feel that you could not return the death penalty. A. (Ms. Brou) Oh, let's see. I'm afraid I couldn't. I would just be thinking in terms of why can't a person like that be rehabilitated rather than exterminated. Q. So you feel that you could not return the death penalty? A. (Ms. Brou) No. Q. Are there any circumstances which you could return a verdict that would require a defendant to be electrocuted? A. (Ms. Brou) This particular one or just in general? Q. This particular one. A. Any circumstances where I could do that? Q. Yes. A. (Ms. Brou) Well, of course, I don't know that much about the case. I always think in terms of how hideous the crime is because I don't know that much about it. I don't know. I don't think I can do it. 679 F.2d at 385 (emphasis in majority opinion). Immediately preceding this line of questioning, Ms. Brou asked where a juror would be disqualified if she did not have a \"firm conviction\" about the death penalty. 679 F.2d at 399 n. 3 (Randall, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Adams, supra, the Supreme Court stated that Witherspoon was not a ground for challenging any prospective juror, but rather a limitation on the state's power to exclude jurors for cause. 448 U.S. at 47-48, 100 S. Ct. at 2527-28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The capital sentencing procedure is set forth in Tex.Code Crim.Pro.Ann. art. 37.071 (Vernon 1981), which provides in relevant part: (a) Upon a finding that the defendant is guilty of a capital offense, the court shall conduct a separate sentencing proceeding to determine whether the defendant shall be sentenced to death or life imprisonment. The proceeding shall be conducted in the trial court before the trial jury as soon as practicable. In the proceeding, evidence may be presented as to any matter that the court deems relevant to sentence. This subsection shall not be construed to authorize the introduction of any evidence secured in violation of the Constitution of the United States or of the State of Texas. The state and the defendant or his counsel shall be permitted to present argument for or against sentence of death. (b) On conclusion of the presentation of the evidence, the court shall submit the following issues to the jury: (1) whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result; (2) whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; (c) The state must prove each issue submitted beyond a reasonable doubt, and the jury shall return a special verdict of \"yes\" or \"no\" on each issue submitted. (d) The court shall charge the jury that: (1) it may not answer any issue \"yes\" unless it agrees unanimously; and (2) it may not answer any issue \"no\" unless 10 or more jurors agree. (e) If the jury returns an affirmative finding on each issue submitted under this article, the court shall sentence the defendant to death. If the jury returns a negative finding on any issue submitted under this article, the court shall sentence the defendant to confinement in the Texas Department of Corrections for life.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. O'Bryan did not object to the adequacy of the trial court's instructions on mitigating circumstances until he filed his two applications for state habeas relief in 1980 and 1982. The Texas Court of Criminal Appeals denied both petitions without comment. O'Bryan did raise a more generalized challenge to the Texas capital sentencing procedure throughout the proceedings: that the procedure was unconstitutional because it permitted the jury to make its decision in unbridled discretion and in an arbitrary and capricious manner. In its disposition of O'Bryan's direct criminal appeal, the Texas Court of Criminal Appeals held: \"Appellant's contention that Article 37.071 is invalid under the United States Constitution has been answered adversely to him in Jurek v. Texas, 428 U.S. 262, 96 S. Ct. 2950, 49 L. Ed. 2d 929 (1976). These two grounds of error are overruled.\" O'Bryan v. State, 591 S.W.2d 464, 475 (Tex.Cr.App.1979) (en banc), cert. denied, 446 U.S. 988, 100 S. Ct. 2975, 64 L. Ed. 2d 846 (1980). We agree with the Texas court that O'Bryan's generalized claim that the Texas capital sentencing procedure is unconstitutional is foreclosed by the Supreme Court's decision in Jurek.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. For example, O'Bryan has not demonstrated that the Texas courts have at times waived the procedural bar with respect to juror instructions because they were presented with a capital case. See Bell v. Watkins, 692 F.2d 999, 1004 n. 5 (5th Cir.1982) (citing Culberson v. State, 379 So.2d 499 (Miss.1980), cert. denied, 449 U.S. 1103, 101 S. Ct. 903, 66 L. Ed. 2d 831 (1981)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In Engle, supra, the Supreme Court noted: [T]he futility of presenting an objection to the state courts cannot alone constitute cause for a failure to object at trial. If a defendant perceives a constitutional claim and believes it may find favor in the federal courts, he may not bypass the state courts simply because he thinks they will be unsympathetic to the claim. Id. at 130, 102 S. Ct. at 1573. In Bass v. Estelle, 696 F.2d 1154 (5th Cir.), modified, 705 F.2d 121 (5th Cir.1983), the petitioner argued that the Texas Courts apply a less exacting standard in deciding to excuse a procedural default where \"a defect of constitutional magnitude has not been established at the time of trial,\" quoting Cuevas v. State, 641 S.W.2d 558, 563 (Tex.Cr.App.1982) (en banc). We observed that some sort of objection to the exclusion of the jurors had been made in Cuevas, and that the quoted passage seemed \"to apply only to situations where the grounds in question were novel and unknown.\" 705 F.2d at 122.O'Bryan's appellate brief, which relies on a Texas case dating from 1919 about the necessity of giving an instruction concerning the purpose of evidence of the defendant's good reputation, Gilbert v. State, 84 Tex.Cr.R.616, 209 S.W. 658, 659 (1919) (jury determination of suspended sentence), demonstrates that the ground of error urged here was \"not novel and unknown.\" Compare, Bass, supra (contemporaneous objection rule applies where precise ground of objection -- overbreadth of Texas oath requirement under Witherspoon -- had been upheld year before trial), with Green v. Estelle, 706 F.2d 148 (5th Cir.), explained, 712 F.2d 995 (5th Cir. 1983) (federal court would not presume from state court's silence that state court had applied procedural bar to claim of misuse of psychiatric testimony where petitioner's trial was conducted before Supreme Court's decision in Estelle v. Smith, 451 U.S. 454, 101 S. Ct. 1866, 68 L. Ed. 2d 359 (1981)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Since O'Bryan has raised this claim throughout the proceedings and the Texas Court of Criminal Appeals reached the merits of the claim, we are not barred by Sykes, supra, from reviewing this variation on O'Bryan's challenge to the constitutionality of his death sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Our standard of reviewing sufficiency of evidence claims in collateral attacks upon state criminal proceedings is: [T]he applicant is entitled to habeas corpus relief if it is found that upon the record evidence adduced at the trial no rational trier of fact could have found proof of guilt beyond a reasonable doubt. Jackson v. Virginia, 443 U.S. 307, 324, 99 S. Ct. 2781, 2791, 61 L. Ed. 2d 560 (1979) (sufficiency of evidence to support criminal conviction).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The prosecutor stated: People that know [the defendant] and know him well told you he is not worthy of belief under oath. He has a bad reputation for truth and veracity. You didn't hear any of the witnesses that he called say anything about his reputation in the community for being a peaceful and a law abiding citizen, or for being a person of truth and veracity. No, and they weren't asked that question by these defense lawyers because those witnesses would have told you the truth in that respect. They have a moral obligation if, in fact, this defendant has a good reputation in his community for being a peaceful citizen, a law abiding citizen, a citizen of truth, a citizen of veracity, to come in here and bring you those witnesses, and there are none. 14 Trial Transcript at 5276.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Defense counsel mentioned the State's failure to call any witnesses to testify about the probability of O'Bryan's future dangerousness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. O'Bryan has not alleged that the prosecutor's comments violated any specific provision of the Bill of Rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The court instructed the jury: You are not to discuss among yourselves how long the defendant would be required to serve the sentence that you impose. Such matters come within the exclusive jurisdiction of the Board of Pardons and Paroles and the Governor and are no concern of yours. 14 Trial Transcript at 5254.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* District Judge of the Northern District of Texas, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. See also Irvin v. Dowd, 366 U.S. 717, 81 S. Ct. 1639, 6 L. Ed. 2d 751 (1961); Spies v. Illinois, 123 U.S. 131, 8 S. Ct. 22, 31 L. Ed. 80 (1887); Reynolds v. United States, 98 U.S. 145, 25 L. Ed. 244 (1878); United States v. Taylor, 554 F.2d 200 (5th Cir.1977); United States v. Robbins, 500 F.2d 650 (5th Cir.1974); United States v. Brown, 540 F.2d 364 (8th Cir.1976); Government of Virgin Islands v. Gereau, 502 F.2d 914 (3d Cir.1974); United States v. Palumbo, 401 F.2d 270 (2d Cir.1968); Beck v. United States, 298 F.2d 622 (9th Cir.1962); United States v. Sferas, 210 F.2d 69 (7th Cir.1954); Bratcher v. United STates, 149 F.2d 742 (4th Cir.1945).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. I do not here discuss the part of the Witherspoon standard relating to the guilt decision. Of course our objective is to learn the truth of belief, using the measure of the law, rather than the semantically esquisite measures of the philosophers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The transcript relating to their selection is set out in the Appendix to Judge Randall's opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. This issue is pending for en banc determination by the Eleventh Circuit. Darden v. Wainwright, 699 F.2d 1031 (11th Cir.1983), vacated pending rehearing en banc, 699 F.2d 1043 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Recent Fifth Circuit decisions have not even considered the question of whether evidentiary hearings should be held on appropriate Witherspoon challenges. As discussed below, a Witherspoon evidentiary hearing in the federal district court -- such as the one conducted in Jackson v. Beto, 428 F.2d 1054 -- could have avoided some inconsistency in Fifth Circuit Witherspoon decisions. For example, contrast Granviel v. Estelle, 655 F.2d 673 (5th Cir.1981) with Williams v. Maggio, 679 F.2d 381 (5th Cir.1982) (en banc), cert. denied, 463 U.S. 1214, 103 S. Ct. 3553, 77 L. Ed. 2d 1399 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See also Gray v. Lucas, 677 F.2d 1086, 1096-98 (5th Cir.1982) (the state prosecutor and the defense attorney testified at a Witherspoon evidentiary hearing before the federal district court); Marion v. Beto, 434 F.2d 29 (5th Cir.1970) (Witherspoon evidentiary hearing held by state district court).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The state judge merely concluded \"I'll sustain the motion\" made by the prosecutor to excuse Juror Wells for cause (2 Trial Transcript at 771). See Mason v. Balcom, 531 F.2d 717, 721-23 (5th Cir.1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As to Juror Bowman, I concur with Judges Randall and Higginbotham; it is \"unmistakably clear\" from the review of the state court record alone that his exclusion was not in violation of Witherspoon v. Illinois.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Martin v. Estelle, 583 F.2d 1373, 1374 (5th Cir.1978) (if \"a meaningful retrospective competency hearing cannot be conducted, then of course, the writ must issue\"); Hart v. Eyman, 458 F.2d 334 (9th Cir.1972) (habeas claim of coerced confession).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Judge Randall also errs in finding, in her analysis of the exclusion of Juror Pfeffer, that this de novo review can simply focus on one response -- \"the ultimate conclusion\" -- given by a juror during voir dire. In considering Witherspoon challenges, the voir dire examination must be viewed in its entirety. Williams v. Maggio, 679 F.2d 381, does not hold to the contrary. See Porter v. Estelle, 709 F.2d 944 (5th Cir.1983); Witt v. Wainwright, 707 F.2d at 1208-09.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The state court's factual determinations must be \"evidenced by a written finding, written opinion, or other reliable and adequate written indicia\" to be entitled to the presumption of correctness under ยง 2254(d). The transcript of the voir dire examination in the state court criminal trial satisfies this requirement in federal habeas cases involving a Witherspoon challenge. See Grigsby v. Estelle, 500 F.2d 394 (5th Cir.1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The statutory language of ยง 2254(d) -- that the petitioner must establish that \"the factual determinations are not fairly supported by the record\" -- has been held to be \"the same as the \"clearly erroneous' standard employed in federal appellate review of trial findings on constitutional facts.\" Alderman v. Austin, 695 F.2d 124, 132-33 (5th Cir.1983) (en banc) (Fay, J., dissenting), quoting Wright v. State of North Carolina, 483 F.2d 405, 408 (4th Cir.1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Nor does the clearly erroneous rule apply with respect to inferences drawn by the trial court from transcripts, documents, and undisputed facts where the Fifth Circuit is \"in the same position to review the evidence as the Court below.\" Jurek v. Estelle, 623 F.2d at 957-58; Nash v. Estelle, 597 F.2d 513, 518 (5th Cir.1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See also Alderman v. Austin, 695 F.2d 124 (three jurors stated unequivocally that they could vote for the death penalty, but that they would not sign the verdict as foreman).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See also Williams v. Maggio, 679 F.2d 381 (two of the three challenged jurors \"unequivocally stated their inability to consider the death penalty\"); Marion v. Beto, 434 F.2d 29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Williams v. Maggio, 679 F.2d 381; Granviel v. Estelle, 655 F.2d 673; Burns v. Estelle, 626 F.2d 396 (5th Cir.1980) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. There arguments have been made by Judges Tjoflat, Fay and Roney in Alderman v. Austin, 695 F.2d 124 (5th Cir.1983) (en banc) (Tjoflat, dissenting in part at 126-27) (Fay and Roney, dissenting at 128-34) . . . by the Judges Reavley and Fay in Burns v. Estelle, 626 F.2d 396 (5th Cir.1980) (en banc) (Reavley and Fay, concurring at 398) . . . and perhaps by Judge Hill in Alderman v. Austin, 663 F.2d 558, 563 n. 5 (5th Cir.1981), affirmed, 695 F.2d 124, 126 (5th Cir.1983) (en banc). See also, Judge Kravitz's dissent in McCorquodale v. Balkcom, 705 F.2d 1553, 1561-64 (11th Cir.1983) (Kravitz, J., dissenting). But see Judge Clark's majority opinion in McCorquodale v. Balkcom, 705 F.2d at 1556 n. 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See, e.g., the remarkable deference that would be accorded to mere conclusions by a state trial judge in Darden v. Wainwright, 699 F.2d 1031 (11th Cir.1983), vacated pending rehearing on en banc, 699 F.2d 1043 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Mason v. Balcom also holds: \"While the state habeas judge did state that he credited attorney Watts' testimony rather than Mason's, Watts did not actually remember Mason and testified only as to his general custom and practice in representing court-appointed clients. In any case, the District Court was not required to strain to transform this credibility choice into a set of findings of fact binding upon it. \" (531 F.2d at 722 n. 9) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See also White v. Finkbeiner, 570 F.2d at 201 (state court merely \"concluded\" that confession was voluntary, but made no specific findings; therefore, no \"presumption of correctness\" was proper under ยง 2254); Jurek v. Estelle, 623 F.2d at 929 (absence of any specific fact findings or court after evidentiary hearing on petition for habeas relief under ยง 2254); Hart v. United States, 565 F.2d 360 (5th Cir.1978) (failure of federal district court to make specific findings in ยง 2255 case).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. This example is, of course, based upon the unanswered question in footnote 5 in Alderman v. Austin, 663 F.2d 558, 563 n. 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This example is, of course, based upon Williams v. Maggio, 679 F.2d 381 at 385. The trial judge might have made contrary findings and credibility determinations if the demeanor, tone of voice, etc. of the \"I don't think so\" juror had been different. See Granviel v. Estelle, 655 F.2d 673.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In Preston, the conviction was not reversed; instead, the case was remanded to the district court for a hearing at which \"an on-the-record Rule 609(a)(1) determination\" would be made (608 F.2d at 639). This is, in essence, the same procedure being urged by this dissent in appropriate Witherspoon cases. See also United States v. Rivero, 532 F.2d 450, 460-61 (5th Cir.1976) (remand for Jencks Act hearing).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Indeed, if this were not so, the Fifth Circuit could dispose of every Witherspoon challenge simply by giving deference to the state court's general conclusion that this juror is properly excused.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. But see the \"alternative\" order affirmed in Hart v. Eyman, 458 F.2d 334 (9th Cir.19723), giving the state the options of conducting a hearing, releasing the prisoner, or retrying him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Supreme Court summarily reversed this case, Jackson v. Beto, and remanded it to the Fifth Circuit \"for reconsideration in light of Witherspoon \" (392 U.S. 649, 88 S. Ct. 2290, 20 L. Ed. 2d 1350).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. \"The record is silent as to who was responsible for misplacing it, but petitioner-appellant does not charge that it occurred through the willfull fault of the State.\" 428 F.2d at 1056).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See, e.g., the findings discussed above concerning the \"I don't think so\" juror.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Under 28 U.S.C. ยง 2246, \"the certificate of the [state] judge who presided at the trial, setting forth the facts occurring at the trial,\" would be admissible in evidence at the Witherspoon hearing. However, the \"clearly erroneous\" rule would not apply to inferences drawn by the federal district court from this written certification.See Jurek v. Estelle, 623 F.2d at 957-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The hearings ordered by the Supreme Court in Boulden v. Holman, 394 U.S. 478, 89 S. Ct.1138, 22 L. Ed. 2d 433 and Maxwell v. Bishop, 398 U.S. 262, 90 S. Ct. 1578, 26 L. Ed. 2d 221, could not have taken place until five and eight years, respectively, had elapsed since the original trials.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. But see Jackson v. Beto, 428 F.2d 1054, where a Witherspoon evidentiary hearing was held -- and was approved by this court -- even though two jurors were dead, two were not available, and several could not even remember the questions asked during voir dire.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Particularly since a death penalty must be set aside if only one juror has been improperly excluded under Witherspoon. See Davis v. Georgia, 429 U.S. 122, 97 S. Ct. 399, 50 L. Ed. 2d 339 (1976); Marion v. Beto, 434 F.2d at 32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Judge Higginbotham's statement that Reverend Wells \"became angry with even the suggestion that he could so vote\" is based -- not upon any response by Wells -- but upon the prosecutor's sixth question: \"All right. Now, I don't want you to get angry with me and I'm not trying to argue with you, but I have to ask you for your answer, because this lady is taking down your testimony at this time for the record.\" It is pure speculation to conclude from this that Reverand Wells was angry. Although he could have been, it is just as likely that this comment was nothing more than verbal fumbling by the prosecutor's as he searched for a way to ask the same question again -- as indicated by his nonsensical explanation to Reverand Wells that he was asking these questions only because the court reporter was transcribing the answers. In any event, the trial judge made no specific fact finding that Juror Wells was angry.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. This is not surprising. The state trial judge made no specific fact findings or credibility determinations at any place in the seven volumes of transcript which contain the voir dire examination. Certainly, the length of voir dire was not due to the trial judge \"painstakingly questioning\" each juror. Indeed, his questions about publicity were perfunctory (see, e.g., 2 Trial Transcript 761-63; 3 Trial Transcript 870-71) -- and the length of the voir dire was, no doubt, due to the practice of state courts in Texas to permit the attorneys to conduct the voir dire. See Adams v. State, 577 S.W.2d 717, 724 (Tex.Cr.App.1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See footnote 7 in Judge Randall's opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Pfeffer did not know just how \"extreme\" the O'Bryan case was. He had seen little, if any, publicty about the murder so he \"was not familiar with it at all.\" 3 Trial Transcript at 870. The trial judge did not even ask Pfeffer what publicity he had seen -- and he refused to permit the defense attorney to determine what publicity or other information Pfeffer had seen about the case. 3 Trial Transcript at 870-71, 885-86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Although Judge Higginbotham suggests that Juror Pfeffer was somehow responsible for causing the trial judge to insist on \"yes\" or \"no\" answers, the judge also gave similar instructions during the voir dire of a least two other jurors. See 4 Trial 1649-50 (Juror Garrett), 6 Trial Transcript 2186-87 (Juror Cooley). However, Judge Higginbotham is correct that \"the trial judge pushed in no particular direction.\" 3 Trial Transcript at 882-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Judge Randall's opinion notes (slip op. page 7296, page ) that \"in Aiken v. Washington, 403 U.S. 946, 91 S. Ct. 2283, 29 L.ED.2d 856 (1971), the Supreme Court summarily reversed a death sentence where the state court had found no Witherspoon violation and had accorded some deference to the trial court.\" This dissent, therefore, will similarly note that in Mathis v. New Jersey, 403 U.S. 946, 91 S. Ct. 2277, 29 L. Ed. 2d 855 (1971) and Adams v. Washington, 403 U.S. 947, 91 S. Ct. 2273, 29 L. Ed. 2d 855 (1971), the Supreme Court summarily reversed death penalties in cases where jurors had been excluded because they were unable to say whether they \"could or could not\" vote for the death penalty. However, it will also note that all three of these summary reversals should be of little precedential value because they were simply among a substantial number of cases reversed by the Supreme Court following Witherspoon. See 403 U.S. 946-948, 91 S. Ct. pages 2273, 2277-2284, 2287-2292.\u003c/span\u003e\n\n",
    "body_length": 196900,
    "citedas": [
      "714 F.2d 365"
    ],
    "attorneys": "Stanley G. Schneider, Suite 530, 3000 Richmond Ave., Houston, TX 77098, Will Gray, 2038 Lexington Street, Houston, TX 77098, for Appellant Mark White, Atty. Gen., P.O. Box 12548, Capitol Station, Austin, TX 78711, Leslie A. Benitez, AAG, P.O. Box 12548, Capitol Station, Austin, TX 78711, AMICI CURIAE, David Crump, (for Texas District \u0026 County Attorneys Association), The Legal Foundation of America, South Texas College of Law, 1303 San Jacinto, Houston, TX 77002, Nicholas E. Calio, (for Washington Legal Foundation), 1612 K St., N.W., Suite 502, Washington, D.C. 20006, for Appellee",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Before RANDALL and HIGGINBOTHAM, Circuit Judges, and BUCHMEYER,*fn* District Judge.",
    "citation_count": 65
  }
}
