{
  "id": "7YJPPmYBTlTomsSBjbJx",
  "document": {
    "title": "Urofsky v. Gilmore",
    "full_title": "MELVIN I. UROFSKY; PAUL SMITH; BRIAN J. DELANEY; DANA HELLER; BERNARD H. LEVIN; TERRY L. MEYERS v. JAMES S. GILMORE, III, IN HIS OFFICIAL CAPACITY AS GOVERNOR OF THE COMMONWEALTH OF VIRGINIA . AMERICAN ASSOCIATION OF UNIVERSITY PROFESSORS; THE AUTHORS GUILD; THE THOMAS JEFFERSON CENTERFORTHE PROTECTION OF FREE EXPRESSION, AMICI CURIAE.",
    "jurisdiction": "Fourth Circuit",
    "date": "2000-06-23T00:00:00.000Z",
    "docket": "No. 98-1481",
    "body": "As amended July 6, 2000\n\nOPINION ON REHEARING EN BANC\n\nPUBLISHED\n\nArgued: October 25, 1999\n\nReversed by published opinion. Judge Wilkins wrote the majority opinion, in which Judges Widener, Niemeyer, Luttig, Williams, Traxler, and Hamilton joined. Judge Luttig wrote a concurring opinion; Judge Hamilton wrote a concurring opinion; and Chief Judge Wilkinson wrote an opinion concurring in the judgment. Judge Murnaghan wrote a dissenting opinion, in which Judges Michael, Motz and King joined.\n\nOPINION\n\nAppellees, six professors employed by various public colleges and universities in Virginia, brought this action challenging the constitutionality of a Virginia law restricting state employees from accessing sexually explicit material on computers that are owned or leased by the state.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e See Va. Code Ann. §§ 2.1-804 to -806 (Michie Supp. 1999) (the Act). The district court granted summary judgment in favor of Appellees, reasoning that the Act unconstitutionally infringed on state employees' First Amendment rights. See Urofsky v. Allen, 995 F. Supp. 634 (E.D. Va. 1998). A panel of this court reversed that decision, holding that our prior en banc opinion in Boring v. Buncombe County Board of Education, 136 F.3d 364, 368-69 (4th Cir. 1998) (en banc), compelled the conclusion that the restriction on state employees' access to sexually explicit material on computers owned or leased by the state is constitutional because the Act regulates only state employees' speech in their capacity as state employees, as opposed to speech in their capacity as citizens addressing matters of public concern. See Urofsky v. Gilmore, 167 F.3d 191 (4th Cir. 1999). A majority of the active circuit judges thereafter voted to hear this appeal en banc. We now hold that the regulation of state employees' access to sexually explicit material, in their capacity as employees, on computers owned or leased by the state is consistent with the First Amendment. Accordingly, we reverse the decision of the district court.\n\nI.\n\nThe central provision of the Act states:\n\nExcept to the extent required in conjunction with a bona fide, agency-approved research project or other agency approved undertaking, no agency employee shall utilize agency-owned or agency-leased computer equipment to access, download, print or store any information infrastruc ture files or services having sexually explicit content. Such agency approvals shall be given in writing by agency heads, and any such approvals shall be available to the public under the provisions of the Virginia Freedom of Information Act[, Va. Code Ann. §§ 2.1-340.1 to -346.1 (Michie Supp. 1999)]. Va. Code Ann. § 2.1-805.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Another section of the Act defines \"sexually explicit content.\" When the district court ruled, and when the panel initially considered this appeal, the Act defined \"sexually explicit content\" to include:\n\n(i) any description of or (ii) any picture, photograph, draw ing, motion picture film, digital image or similar visual rep presentation depicting sexual bestiality, a lewd exhibition of nudity, as nudity is defined in § 18.2-390, sexual excite ment, sexual conduct or sadomasochistic abuse, as also defined in § 18.2-390, coprophilia, urophilia, or fetishism. Va. Code Ann. § 2.1-804 (Michie Supp. 1998).\n\nFollowing our panel decision, the Virginia General Assembly amended the definition of \"sexually explicit content\" to add the italicized language:\n\ncontent having as a dominant theme (i) any lascivious description of or (ii) any lascivious picture, photograph, drawing, motion picture film, digital image or similar visual representation depicting sexual bestiality, a lewd exhibition of nudity, as nudity is defined in § 18.2-390, sexual excite ment, sexual conduct or sadomasochistic abuse, as also defined in § 18.2-390, coprophilia, urophilia, or fetishism. Va. Code Ann. § 2.1-804 (Michie Supp. 1999) (emphasis added).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAs its language makes plain, the Act restricts access by state employees to lascivious sexually explicit material on computers owned or leased by the state. But, the Act does not prohibit all access by state employees to such materials, for a state agency head may give permission for a state employee to access such information on computers owned or leased by the state if the agency head deems such access to be required in connection with a bona fide research project or other undertaking. Further, state employees remain free to access sexually explicit materials from their personal or other computers not owned or leased by the state. Thus, the Act prohibits state employees from accessing sexually explicit materials only when the employees are using computers that are owned or leased by the state and permission to access the material has not been given by the appropriate agency head.\n\nNone of the Appellees has requested or been denied permission to access sexually explicit materials pursuant to the Act. Indeed, the record indicates that no request for access to sexually explicit materials on computers owned or leased by the state has been declined.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAppellees maintain that the restriction imposed by the Act violates the First Amendment rights of state employees. Appellees do not assert that state employees possess a First Amendment right to access sexually explicit materials on state-owned or leased computers for their personal use; rather, Appellees confine their challenge to the restriction of access to sexually explicit materials for work-related purposes. Appellees' challenge to the Act is twofold: They first maintain that the Act is unconstitutional as to all state employees; failing this, they argue more particularly that the Act violates academic employees' right to academic freedom.\n\nII.\n\nIt is well settled that citizens do not relinquish all of their First Amendment rights by virtue of accepting public employment. See United States v. National Treasury Employees Union, 513 U.S. 454, 465 (1995) [hereinafter NTEU]; Connick v. Myers, 461 U.S. 138, 142 (1983); Pickering v. Board of Educ., 391 U.S. 563, 568 (1968). Nevertheless, the state, as an employer, undoubtedly possesses greater authority to restrict the speech of its employees than it has as sovereign to restrict the speech of the citizenry as a whole. See Waters v. Churchill, 511 U.S. 661, 671 (1994) (plurality opinion) (recognizing that \"the government as employer . . . has far broader powers than does the government as sovereign\"); Pickering, 391 U.S. at 568 (explaining that \"the State has interests as an employer in regulating the speech of its employees that differ significantly from those it possesses in connection with regulation of the speech of the citizenry in general\"). A determination of whether a restriction imposed on a public employee's speech violates the First Amendment requires \"`a balance between the interests of the [employee], as a citizen, in commenting upon matters of public concern and the interest of the State, as an employer, in promoting the efficiency of the public services it performs through its employees.'\" Connick, 461 U.S. at 142 (alteration in original) (quoting Pickering, 391 U.S. at 568). This balancing involves an inquiry first into whether the speech at issue was that of a private citizen speaking on a matter of public concern. If so, the court must next consider whether the employee's interest in First Amendment expression outweighs the public employer's interest in what the employer has determined to be the appropriate operation of the workplace. See Pickering, 391 U.S. at 568.\n\nThe threshold inquiry thus is whether the Act regulates speech by state employees in their capacity as citizens upon matters of public concern. If a public employee's speech made in his capacity as a private citizen does not touch upon a matter of public concern, the state, as employer, may regulate it without infringing any First Amendment protection.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See Connick, 461 U.S. at 146 (explaining that if a plaintiff's speech \"cannot be fairly characterized as constituting speech on a matter of public concern, it is unnecessary . . . to scrutinize the reasons for [the] discharge\"); Holland v. Rimmer, 25 F.3d 1251, 1254-55 \u0026 n.11 (4th Cir. 1994). Whether speech is that of a private citizen addressing a matter of public concern is a question of law for the court and, accordingly, we review the matter de novo. See Connick, 461 U.S. at 148 n.7; Hall v. Marion Sch. Dist. Number 2, 31 F.3d 183, 192 (4th Cir. 1994); Holland, 25 F.3d at 1255.\n\nTo determine whether speech involves a matter of public concern, we examine the content, context, and form of the speech at issue in light of the entire record. See Connick, 461 U.S. at 147-48. Speech involves a matter of public concern when it involves an issue of social, political, or other interest to a community. See id. at 146. An inquiry into whether a matter is of public concern does not involve a determination of how interesting or important the subject of an employee's speech is. See Terrell v. University of Tex. Sys. Police, 792 F.2d 1360, 1362 (5th Cir. 1986). Further, the place where the speech occurs is irrelevant: An employee may speak as a citizen on a matter of public concern at the workplace, and may speak as an employee away from the workplace. Compare Rankin v. McPherson, 483 U.S. 378, 388-92 (1987) (holding public employee's discharge was violative of First Amendment when based on comment by employee as a private citizen on a matter of public concern made at work), with DiMeglio v. Haines, 45 F.3d 790, 805 (4th Cir. 1995) (recognizing that speech by a public employee outside the workplace was made in the employee's official capacity).\n\nThe Supreme Court has made clear that the concern is to maintain for the government employee the same right enjoyed by his privately employed counterpart. To this end, in its decisions determining speech to be entitled to First Amendment protection the Court has emphasized the unrelatedness of the speech at issue to the speaker's employment duties. See NTEU, 513 U.S. at 465 (concluding that balancing test applied to employees' \"expressive activities in their capacity as citizens, not as Government employees\" and noting that \"[w]ith few exceptions, the content of [employees'] messages [had] nothing to do with their jobs\"); id. at 466 (emphasizing that the Court has applied the Pickering balancing test \"only when the employee spoke as a citizen upon matters of public concern rather than as an employee upon matters only of personal interest\"); id. at 480 (O'Connor, J., concurring in the judgment in part and dissenting in part) (agreeing that balancing test was appropriate because restriction applied only to \"off-hour speech bearing no nexus to Government employment\"); Pickering, 391 U.S. at 574 (explaining that when \"the fact of employment is only tangentially and insubstantially involved in the subject matter of the public communication made by [the employee], . . . it is necessary to regard the [employee] as the member of the general public he seeks to be\"). Thus, critical to a determination of whether employee speech is entitled to First Amendment protection is whether the speech is \"made primarily in the [employee's] role as citizen or primarily in his role as employee.\" Terrell, 792 F.2d at 1362; see Boring, 136 F.3d at 368-69 (holding that the selection of a play by a high school drama teacher did not involve a matter of public concern because the choice was made by the teacher in her capacity as a teacher in a matter dealing with curriculum); Holland, 25 F.3d at 1255-56 (concluding that speech by supervisor disciplining subordinates was not speech as private citizen on matters of public concern because it constituted \"in-house communications between employees speaking as employees\"); see also DiMeglio, 45 F.3d at 805 (noting that \"the [Supreme] Court [has] distinguished between speaking as a citizen and as an employee, and [has] focused on speech as a citizen as that for which constitutional protection is afforded\").\n\nThis focus on the capacity of the speaker recognizes the basic truth that speech by public employees undertaken in the course of their job duties will frequently involve matters of vital concern to the public, without giving those employees a First Amendment right to dictate to the state how they will do their jobs. For example, suppose an assistant district attorney, at the District Attorney's direction, makes a formal statement to the press regarding an upcoming murder trial--a matter that is unquestionably of concern to the public. It cannot seriously be doubted that the assistant does not possess a First Amendment right to challenge his employer's instructions regarding the content of the statement.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In contrast, when the same assistant district attorney writes a letter to the editor of the local newspaper to expose a pattern of prosecutorial malfeasance, the speech is entitled to constitutional protection because it is made in the employee's capacity as a private citizen and touches on matters of public concern.\n\nJudge Wilkinson and Judge Murnaghan fail to recognize the importance of the role of the speaker in determining whether speech by a public employee is entitled to First Amendment protection. Under their respective analyses, the assistant district attorney in the above hypothetical would have a First Amendment right to challenge his employer's directions regarding the press conference.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e It is difficult to imagine the array of routine employment decisions that would be presented as constitutional questions to this court under this view of the law. See Connick, 461 U.S. at 143 (recognizing that \"government offices could not function if every employment decision became a constitutional matter\").\n\nThe speech at issue here--access to certain materials using computers owned or leased by the state for the purpose of carrying out employment duties--is clearly made in the employee's role as employee. Therefore, the challenged aspect of the Act does not regulate the speech of the citizenry in general, but rather the speech of state employees in their capacity as employees. It cannot be doubted that in order to pursue its legitimate goals effectively, the state must retain the ability to control the manner in which its employees discharge their duties and to direct its employees to undertake the responsibilities of their positions in a specified way. Cf. Waters, 511 U.S. at 675 (explaining that restrictions on speech may be necessary when \"the government is employing someone for the very purpose of effectively achieving its goals\"); id. at 672 (noting that \"even many of the most fundamental maxims of . . . First Amendment jurisprudence cannot reasonably be applied to speech by government employees\"); Connick, 461 U.S. at 143 (acknowledging that \"government offices could not function if every employment decision became a constitutional matter\"). The essence of Appellees' claim is that they are entitled to access sexually explicit material in their capacity as state employees by using equipment owned or leased by the state. Because, as Appellees acknowledge, the challenged aspect of the Act does not affect speech by Appellees in their capacity as private citizens speaking on matters of public concern, it does not infringe the First Amendment rights of state employees.\n\nIII.\n\nAlternatively, Appellees maintain that even if the Act is valid as to the majority of state employees it violates the First Amendment academic freedom rights of professors at state colleges and universities,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and thus is invalid as to them.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In essence, Appellees contend that a university professor possesses a constitutional right to determine for himself, without the input of the university (and perhaps even contrary to the university's desires), the subjects of his research, writing, and teaching. Appellees maintain that by requiring professors to obtain university approval before accessing sexually explicit materials on the Internet in connection with their research, the Act infringes this individual right of academic freedom. Our review of the law, however, leads us to conclude that to the extent the Constitution recognizes any right of \"academic freedom\" above and beyond the First Amendment rights to which every citizen is entitled, the right inheres in the University, not in individual professors, and is not violated by the terms of the Act.\n\n\"Academic freedom\" is a term that is often used, but little explained, by federal courts. See W. Stuart Stuller, High School Academic Freedom: The Evolution of a Fish Out of Water, 77 Neb. L. Rev. 301, 302 (1998) (\"[C]courts are remarkably consistent in their unwillingness to give analytical shape to the rhetoric of academic freedom.\"); see also J. Peter Byrne, Academic Freedom: A \"Special Concern of the First Amendment\", 99 Yale L.J. 251, 253 (1989) (\"Lacking definition or guiding principle, the doctrine [of academic freedom] floats in the law, picking up decisions as a hull does barnacles.\"). As a result, decisions invoking academic freedom are lacking in consistency, see Stuller, supra, at 303, and courts invoke the doctrine in circumstances where it arguably has no application, see Byrne, supra, at 262-64. Accordingly, we begin with a brief review of the history of the concept of academic freedom in the United States.\n\nPrior to the late nineteenth century, institutions of higher education in this country were not considered centers of research and scholarship, but rather were viewed as a means of passing received wisdom on to the next generation. See Richard Hofstadter \u0026 Walter P. Metzger, The Development of Academic Freedom in the United States 278-79 (1955); Stuller, supra, at 307-08. \"Faculty performed essentially fixed if learned operations within a traditional curriculum under the sanction of established truth. . . . [A]cademic freedom as we know it simply had no meaning.\" Byrne, supra, at 269. Additionally, American universities during this period were characterized by \"legal control by non-academic trustees; effective governance by administrators set apart from the faculty by political allegiance and professional orientation; [and] dependent and insecure faculty.\" Id. at 268-69. This began to change, however, as Americans who had studied at German universities sought to remodel American universities in the German image. See Walter P. Metzger, Profession and Constitution: Two Definitions of Academic Freedom in America, 66 Tex. L. Rev. 1265, 1269 (1988).\n\nThe German notion of academic freedom was composed primarily of two concepts: Lehrfreiheit and Lernfreiheit. See generally Hofstadter \u0026 Metzger, supra, at 386-91 (discussing German understanding of academic freedom). Lehrfreiheit, or freedom to teach, embodied the notion that professors should be free to conduct research and publish findings without fear of reproof from the church or state; it further denoted the authority to determine the content of courses and lectures. See id. at 386-87. Lernfreiheit was essentially a corollary right of students to determine the course of their studies for themselves. See id. at 386.\n\nIn 1915, a committee of the American Association of University Professors (AAUP) issued a report on academic freedom that adapted the concept of Lehrfreiheit to the American university. See generally Metzger, supra, at 1267-85 (examining the factors influencing the AAUP's definition of academic freedom). In large part, the AAUP was concerned with obtaining for professors a measure of professional autonomy from lay administrators and trustees.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e See Byrne, supra, at 273-78; Metzger, supra, at 1275-76. The AAUP defined academic freedom as \"a right claimed by the accredited educator, as teacher and investigator, to interpret his findings and to communicate his conclusions without being subjected to any interference, molestation, or penalization because the conclusions are unacceptable to some constituted authority within or beyond the institution.\" Stuller, supra, at 309 (internal quotation marks omitted).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Significantly, the AAUP conceived academic freedom as a professional norm, not a legal one: The AAUP justified academic freedom on the basis of its social utility as a means of advancing the search for truth, rather than its status as a manifestation of First Amendment rights. See Hofstadter \u0026 Metzger, supra, at 398-400; Byrne, supra, at 277-78. The principles adopted in the 1915 report were later codified in a 1940 Statement of Principles on Academic Freedom and Tenure promulgated by the AAUP and the Association of American Colleges. See Richard H. Hiers, Academic Freedom in Public Colleges and Universities: O Say, Does that Star-Spangled First Amendment Banner Yet Wave?, 40 Wayne L. Rev. 1, 4-5 (1993). The 1940 Statement since \"has been endorsed by every major higher education organization in the nation,\" Byrne, supra, at 279, \"through its adoption into bylaws, faculty contracts, and collective bargaining agreements,\" Amy H. Candido, Comment, A Right to Talk Dirty?: Academic Freedom Values and Sexual Harassment in the University Classroom, 4 U. Chi. L. Sch. Roundtable 85, 86-87 (1996-97).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAppellees' insistence that the Act violates their rights of academic freedom amounts to a claim that the academic freedom of professors is not only a professional norm, but also a constitutional right.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We disagree. It is true, of course, that homage has been paid to the ideal of academic freedom in a number of Supreme Court opinions, often with reference to the First Amendment. See, e.g., Regents of the Univ. of Mich. v. Ewing, 474 U.S. 214, 226 \u0026 n.12 (1985); Regents of the Univ. of Cal. v. Bakke, 438 U.S. 265, 312-13 (1978) (opinion of Powell, J.); Keyishian v. Board of Regents, 385 U.S. 589, 603 (1967); Sweezy v. New Hampshire, 354 U.S. 234, 250 (1957) (plurality opinion); id. at 261-63 (Frankfurter, J., concurring in the result). Despite these accolades, the Supreme Court has never set aside a state regulation on the basis that it infringed a First Amendment right to academic freedom. Cf. Minnesota State Bd. for Community Colleges v. Knight, 465 U.S. 271, 287 (1984) (stating that the Court has not recognized a First Amendment right of faculty to participate in academic policymaking).\n\nMoreover, a close examination of the cases indicates that the right praised by the Court is not the right Appellees seek to establish here. Appellees ask us to recognize a First Amendment right of academic freedom that belongs to the professor as an individual. The Supreme Court, to the extent it has constitutionalized a right of academic freedom at all, appears to have recognized only an institutional right of self-governance in academic affairs.\n\nWe begin our examination of the cases with Sweezy, in which Appellees claim \"[t]he Supreme Court first adopted the principle of academic freedom.\" Brief of the Appellees at 21. Sweezy arose from an investigation of \"subversive activities\" by the New Hampshire Attorney General. Paul Sweezy, a target of the investigation, refused to answer certain questions regarding a guest lecture he had given at the University of New Hampshire. His refusal to answer these and other questions ultimately resulted in his incarceration for contempt. On certiorari review of the decision of the New Hampshire Supreme Court affirming the conviction, a plurality of four justices indicated that the action of the state \"unquestionably\" infringed Sweezy's \"liberties in the areas of academic freedom and political expression.\" Sweezy, 354 U.S. at 250.\n\nThe essentiality of freedom in the community of Ameri can universities is almost self-evident. No one should under estimate the vital role in a democracy that is played by those who guide and train our youth. To impose any strait jacket upon the intellectual leaders in our colleges and universities would imperil the future of our Nation. No field of educa tion is so thoroughly comprehended by man that new dis coveries cannot yet be made. Particularly is that true in the social sciences, where few, if any, principles are accepted as absolutes. Scholarship cannot flourish in an atmosphere of suspicion and distrust. Teachers and students must always remain free to inquire, to study and to evaluate, to gain new maturity and understanding; otherwise our civilization will stagnate and die. Id.\n\nThis paean to academic freedom notwithstanding, the plurality did not vacate Sweezy's contempt conviction on First Amendment grounds, but rather concluded that because the Attorney General lacked authority to investigate Sweezy, the conviction violated due process. See id. at 254-55.\n\nJustice Frankfurter, who along with Justice Harlan provided the votes necessary to reverse, relied explicitly on academic freedom in concluding that Sweezy's contempt conviction offended the Constitution. The right recognized by Justice Frankfurter, however, was not the individual right claimed by Appellees, but rather an institutional right belonging to the University of New Hampshire: \"When weighed against the grave harm resulting from governmental intrusion into the intellectual life of a university, [the] justification for compelling a witness to discuss the contents of his lecture appears grossly inadequate.\" Id. at 261 (Frankfurter, J., concurring in the result) (emphasis added). Justice Frankfurter emphasized \"the dependence of a free society on free universities\" and concluded by enumerating \"the four essential freedoms of a university--to determine for itself on academic grounds who may teach, what may be taught, how it shall be taught, and who may be admitted to study.\" Id. at 262-63 (internal quotation marks omitted). Significantly, at no point in his concurrence does Justice Frankfurter indicate that individual academic freedom rights had been infringed; in his view, the constitutional harm fell entirely on the university as an institution.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn light of this review of the actual holding and rationale in Sweezy, it is difficult to understand how that case can be viewed as clearly \"adopting\" any academic freedom right, much less a right of the type claimed by Appellees. At best, it can be said that six justices agreed that the First Amendment protects values of academic freedom. However, the justices were plainly of very different minds as to the nature of this \"right.\" And, even if Sweezy could be read as creating an individual First Amendment right of academic freedom, such a holding would not advance Appellees' claim of a First Amendment right pertaining to their work as scholars and teachers because Sweezy involved only the right of an individual to speak in his capacity as a private citizen. See id. at 249 (explaining that \"[t]he sole basis for the inquiry was to scrutinize [Sweezy] as a person,\" not as a teacher).\n\nSeveral other cases decided at roughly the same time as Sweezy involved restrictions on state employees' rights as private citizens to speak and associate. See, e.g., Whitehill v. Elkins, 389 U.S. 54 (1967) (loyalty oath required of publicly employed teachers); Shelton v. Tucker, 364 U.S. 479 (1960) (affidavit listing organizational membership required of teachers at state-funded educational institutions); Wieman v. Updegraff, 344 U.S. 183 (1952) (loyalty oath required of state employees). Although the Court discussed the infringement of the state act on academic freedom in two of the cases, see Whitehill, 389 U.S. at 59-60; Shelton, 364 U.S. at 487, and all of the actions were brought by teachers, in none of them did the Court base its holding on academic freedom, see Whitehill, 389 U.S. at 59-62 (striking down provision on basis of overbreadth); Shelton, 364 U.S. at 490 (same); Wieman, 344 U.S. at 190-92 (declaring statute unconstitutional as violative of due process).\n\nEven if Whitehill, Shelton, and Wieman could be said to have established a constitutional right of academic freedom enjoyed by publicly employed teachers, such a holding would be of little significance in light of the historical context. As late as March 1952, mere months before Wieman was decided, the Supreme Court had adhered to the principle that public employment was a privilege, not a right, and thus could be conditioned on restrictions on the exercise of constitutional rights by individuals in their capacities as private citizens. See Adler v. Board of Educ., 342 U.S. 485, 492 (1952) (rejecting argument by public school teacher that statute and regulations disqualifying from employment individuals who belonged to certain organizations violated First Amendment rights). By 1956, however, the Court had begun to back away from this position. See Slochower v. Board of Higher Educ., 350 U.S. 551, 555, 558-59 (1956) (holding that dismissal of professor, pursuant to statute that required termination of any public employee who invoked Fifth Amendment right against self-incrimination to avoid a question related to official conduct, violated due process; observing that \"[t]o state that a person does not have a constitutional right to government employment is only to say that he must comply with reasonable, lawful, and nondiscriminatory terms laid down by the proper authorities\"). And, by 1967, the Court had rejected it altogether. See Keyishian, 385 U.S. at 605-06; see also Elrod v. Burns, 427 U.S. 347, 358-59 (1976) (opinion of Brennan, J.) (\"Keyishian squarely held that political association alone could not, consistently with the First Amendment, constitute an adequate ground for denying public employment.\"). Indeed, it is now beyond question that a public employer does not enjoy carte blanche to sanction employees for the exercise of First Amendment rights. See Rankin, 483 U.S. at 383-84. Therefore, to the extent that Whitehill, Shelton, and Wieman may have held that a publicly employed teacher may not be disciplined for the exercise of First Amendment rights as a private citizen, that holding has been subsumed by later cases extending the same protection to all public employees.\n\nOther cases that have referred to a First Amendment right of academic freedom have done so generally in terms of the institution, not the individual. For example, in Keyishian the Court considered a renewed challenge to a New York statute and regulations, certain provisions of which were upheld in Adler, designed \"to prevent the appointment or retention of `subversive' persons in state employment.\" Keyishian, 385 U.S. at 592. Keyishian, like the cases discussed above, involved the right of a professor to speak and associate in his capacity as a private citizen, and thus is not germane to Appellees' claim. Moreover, in the course of reaching its conclusion that the provisions were unconstitutionally vague, the Court discussed the detrimental impact of such laws on academic freedom, which the Court characterized as \"a special concern of the First Amendment.\" Id. at 603. The discussion by the Court indicates, however, that it was not focusing on the individual rights of teachers, but rather on the impact of the New York provisions on schools as institutions: The vice of the New York provisions was that they impinged upon the freedom of the university as an institution. See University of Pa. v. EEOC, 493 U.S. 182, 198 (1990) (noting that Keyishian was a case involving governmental infringement on the right of an institution \"to determine for itself on academic grounds who may teach\" (internal quotation marks omitted)).\n\nThis emphasis on institutional rights is particularly evident in more recent Supreme Court jurisprudence. For example, in Bakke Justice Powell discussed academic freedom as it related to a program of admissions quotas established by a medical school. Relying on Keyishian and on Justice Frankfurter's concurrence in Sweezy, Justice Powell characterized academic freedom as \"[t]he freedom of a university to make its own judgments as to education.\" Bakke, 438 U.S. at 312 (opinion of Powell, J.). Similarly, in Ewing the Court described academic freedom as a concern of the institution. See Ewing, 474 U.S. at 226. Significantly, the Court has never recognized that professors possess a First Amendment right of academic freedom to determine for themselves the content of their courses and scholarship, despite opportunities to do so. For example, in Epperson v. Arkansas, 393 U.S. 97 (1968), the Court considered a challenge to a state law that prohibited the teaching of evolution. The Court repeated its admonition in Keyishian that \"the First Amendment `does not tolerate laws that cast a pall of orthodoxy over the classroom,'\" Epperson, 393 U.S. at 105 (quoting Keyishian, 385 U.S. at 603), but nevertheless declined to invalidate the statute on the basis that it infringed the teacher's right of academic freedom.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Rather, the Court held that the provision violated the Establishment Clause. See id. at 106-09. Almost twenty years later, the opportunity to create an individual First Amendment right of academic freedom again arose in Edwards v. Aguillard, 482 U.S. 578 (1987), another case involving limitations on public school teachers' authority to teach evolution. In Edwards, a state statute required that instruction on evolution be accompanied by teaching on creation science. As in Epperson, the Court decided the case on Establishment Clause grounds. See Edwards, 482 U.S. at 596-97. This time, however, the Court did not even mention academic freedom as a relevant consideration in holding the statute unconstitutional.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nTaking all of the cases together, the best that can be said for Appellees' claim that the Constitution protects the academic freedom of an individual professor is that teachers were the first public employees to be afforded the now-universal protection against dismissal for the exercise of First Amendment rights. Nothing in Supreme Court jurisprudence suggests that the \"right\" claimed by Appellees extends any further. Rather, since declaring that public employees, including teachers, do not forfeit First Amendment rights upon accepting public employment, the Court has focused its discussions of academic freedom solely on issues of institutional autonomy. We therefore conclude that because the Act does not infringe the constitutional rights of public employees in general, it also does not violate the rights of professors.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIV.\n\nWe reject the conclusion of the district court that Va. Code Ann. §§ 2.1-804 to -806, prohibiting state employees from accessing sexually explicit material on computers owned or leased by the state except in conjunction with an agency-approved research project, infringes upon the First Amendment rights of state employees. We further reject Appellees' contention that even if the Act is constitutionally valid as to the majority of state employees, it is invalid to the extent it infringes on the academic freedom rights of university faculty.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Accordingly, we reverse the judgment of the district court.\n\nREVERSED\n\nLUTTIG, Circuit Judge, concurring:\n\nI join in Judge Wilkins' fine opinion for the court. I agree that the Commonwealth of Virginia may regulate its employees' access to \"bestiality, lewd exhibition of nudity, . . . sexual excitement, sexual conduct or sadomasochistic abuse, . . . coprophilia, urophilia, or fetishism,\" on the public's computers, in the public's offices, on the public's time, and at the public's expense, without infringement on any First Amendment right of those employees. The Supreme Court's precedents would not countenance the contrary conclusion reached by Judge Wilkinson and the dissent.\n\nJudge Wilkinson reaches his conclusion, writing, as he understands it, in support of academic freedom. Because of its analytical flaws and the pyrrhic victory it offers the academy, however, I believe that the true academic will understand that Judge Wilkinson's opinion ultimately will be of little service to the real cause of academic freedom, despite its superficial appeal. More importantly, however, as I explain below, the true academic is actually in no need of such attempts at support -- least of all from the federal judiciary.\n\nFrom time to time, even within the confines of an Article III case or controversy, jurists express their general and personal views on subjects related (and, to be honest, often unrelated) to the particular legal issues before them. It is best that we do so infrequently, and ideally we would never do so, because such naturally gives rise to the legitimate question whether, when we do write opinions only of law, our personal views have influenced or even supplanted the dispassionate, reasoned analysis that defines the Judiciary in our constitutional scheme. At points, what Judge Wilkinson writes in his opinion might fairly be understood as more in the nature of a general statement of personal viewpoint because he comments on a range of matters legal and non-legal, including: the aggregate social impact of \"subjects touching our physical health, our mental well-being, our economic prosperity, and ultimately our appreciation for the world around us and the different heritages that have brought that world about,\" post at 44; the asserted perniciousness of affirmative action and college speech codes to our cultural progress, post at 48; the need for intolerance of sexual harassment in every setting, post at 49-50; the \"exponential growth of freedom\" for society in general that comes with the \"modern technological development\" of the Internet, post at 49, 53; the importance of federalism in our system of governance, post at 52 -- and even the imperative for judicial restraint. Post at 52-53.\n\nBut he does also express the opinion on the issue that is before us, that there is a First Amendment right of \"academic freedom\" and that other public employees do not possess an analogous First Amendment right to pursue matters that they believe are important to performance of their public responsibilities. Because he writes separately and does not join in either of the court's principal opinions, Judge Wilkinson's is an opinion of significance to our court. Accordingly, even though it be that of only a single judge, it is right that that analysis be subjected to the rigors of conventional legal analysis. When subjected to such analysis, I believe it is apparent that the conclusions he reaches and the means by which he reaches those conclusions are analytically indefensible.\n\nFirst, it is unclear even in whom Judge Wilkinson would create his new constitutional right. For example, from reading his opinion, one cannot discern whether he is creating a right in professors generally, in only university professors, in all academics, in all institutions of learning, in only universities, in all public employees, in some of the above, or in all of the above. All that is clear is that he is emphatic that a new constitutional right must be created. If there were nothing else, one might suppose from the fact that he discusses the impact upon the academy purportedly only as \"illustrative\" of the Commonwealth's statute on all public employees, see post at 42 (\"I consider the statute's application to academic inquiry as a useful illustration of how the statute restricts material of public concern.\") (emphasis added)), that he would recognize for all public employees the same constitutional right that he apparently would create for academics. At the end of the day, however, his analysis and conclusion confirm that indeed he would not recognize the same right in all public employees, and that his new-found right is reserved for professors alone. He begins his opinion with that conclusion: \"By thus preserving the structure of university self-governance, the statute withstands constitutional scrutiny.\" Post at 41. He ends his opinion with this same conclusion: \"Because the limited restrictions in this Act are administered within the traditional structure of university governance, I do not believe the Virginia statute contravenes the Constitution.\" Post at 53. And his entire discussion focuses on the need for such a special right for those in the academic community. Indeed, nonacademic public employees are never mentioned by Judge Wilkinson, except in passing, and in ways that are substantively irrelevant. Judge Wilkinson simply, and quite genuinely, believes that the academy has a special contribution to make to society, beyond that that the ordinary citizen is able to make, and that its \"speech\" should enjoy constitutional protection that other public employees' speech should not.\n\nSecond, at the same time that Judge Wilkinson fails to identify even in whom he would vest the constitutional right that he would create, he also never defines the First Amendment right that he so unreservedly would recognize. As a court, we have before us a discrete question of law as to whether the particular speech limited by the statute we interpret is subject to the protection of the First Amendment, and the majority addresses itself to that speech and only to that speech, as a court should. Judge Wilkinson is certain that \"the First Amendment does not slumber while the state regulates\" the speech in question here, post at 41, that \"the legislative scythe [has] cut[ ] a broad swath through the field of public employee speech,\" post at 41, that \"some umbrella of protection\" must be extended to public employee speech, lest they be \"caught in the rain,\" post at 43, and that no \"stream or tributary\" of the \"broad river of American speech [should be] shut off,\" post at 55. However, he never actually identifies the speech that he concludes is entitled to First Amendment protection.\n\nThus, he begins his opinion as if the speech that he concludes is protected is the speech of \"Internet access.\" Post at 41. One page later, he states that the threshold inquiry in this case, rather, is whether \"the use of the Internet for academic research\" relates to a matter of public concern. Post at 41. Four pages after that, he suggests something entirely different --that the speech at issue, and the speech that is addressed by the statute, is \"academic inquiry,\" and even \"academic curiosity.\" Post at 44. Within the very same paragraph, he says not that it is academic curiosity, but, instead, \"research in socially useful subjects such as medicine, biology, anatomy, psychology, anthropology, law, economics, art history, literature, and philosophy\" that is the \"matter of public concern.\" Id. In the next paragraph after that, he says that it is the \"content of academic fields\" which is at issue. Post at 44. And later in that same paragraph, he implies that it is \"Internet research\" that is the relevant speech. Id.\n\nHe vacillates between \"use [of] the Internet to research and write\" and \"research and writing\" generally as the speech of public interest in the very next paragraph. Post at 45. And he later suggests, in the same paragraph in which he states that it is \"a professor's research projects\" that is the First Amendment protected speech, post at 45, that it actually is the \"professor's work\" that is the speech on a matter of public concern, post at 45. And he recites in the very next sentence that it is \"the content of [professorial] Internet research\" that is at issue in this case, post at 46, only a page later, to observe that it is \"[s]peech in the social and physical sciences, the learned professions, and the humanities\" that is in the public interest, and this because it is \"central to our democratic discourse and social progress.\" Post at 47. Two pages later still, he says it is \"academic speech\" that is the speech on a matter of public concern that he addresses. Post at 48. On that same page, he says that it is the \"informational resource\" of the Internet that is the relevant speech. Id. And, finally, Judge Wilkinson tells us that it is \"academic freedom,\" which he nowhere defines, that is entitled to the protection of the First Amendment, a concept that one must assume includes not only research and writing, but also teaching. Post at 51.\n\nThe only speech that Judge Wilkinson does not explicitly identify as relevant, and for reasons obvious, is the only speech that actually is relevant for purposes of the case or controversy before us. That \"speech\" is Internet access, on state computers and on state time, to websites that offer displays of \"bestiality, lewd exhibition of nudity, . . . sexual excitement, sexual conduct or sadomasochistic abuse, . . . coprophilia, urophilia, or fetishism.\" Va. Code Ann. § 2.1-804. And the \"academic research\" in particular that is proffered to this court as deserving of First Amendment protection by the professor plaintiffs, and that must be, and is, accepted by Judge Wilkinson as an example of the highest \"matter of public concern,\" includes, as described by the district court, \"graphic images of a nude woman in chains, a nude man with an erection, and a man and woman engaged in anal intercourse,\" see Urofsky v. Allen, 995 F. Supp. 634, 639 (E.D. Va. 1998). Or, as that research appears in the record before us, a close-up photograph of a woman holding open her buttocks, so that her dilated anus and genitals, pierced with multiple earrings, are visible, J.A. 182; a photograph of a woman wearing a false penis and engaging in anal intercourse with another individual of unidentifiable sex, J.A. 183; a photograph of a naked man apparently hanging by his wrists from a chain to which are attached numerous sexual paraphernalia, J.A. 170; a photograph of a naked woman, spread-eagle, whose wrists and ankles have been chained and extended, J.A. 179; a photograph of a close-up of the erect genital of a man, J.A. 181; and a photograph of a naked woman whose wrists have been padlocked together behind her back, J.A. 178. Although he never addresses himself to this speech, which is the speech at issue in the case, Judge Wilkinson says that \"[t]he content and context of the speech covered by this statute leave no doubt that the law in question affects speech on matters of public concern.\" Post at 42. I agree that the fact that university professors, with no apparent pedagogical reason therefor, are accessing material like this at public taxpayers' expense, on public taxpayer time, and with public taxpayer-purchased computers-- all under the auspices of \"academic research\" -- is a matter of public concern, but I believe that it is so for reasons quite different from Judge Wilkinson's. Third, even if one takes Judge Wilkinson to hold that it is \"academic freedom\" or \"academic research\" that is entitled to \"the ancient safeguards of the First Amendment,\" post at 49, he does not even attempt to support the existence of such a right in either the text of the Constitution or Supreme Court precedents, or even through resort to the history or traditions of our Nation. He simply asserts that there is (and assumes that there must be) a First Amendment right in such speech, however it is defined. And this, in the face of the substantial Supreme Court and other precedent marshaled by Judge Wilkins to the effect that there is no such right, and certainly no such individual professorial right. Ante at 15-22. As Professor Rabban, on whom Judge Wilkinson so heavily relies for a different point, has put it:\n\nFitting academic freedom within the rubric of the first amendment is in many respects an extremely difficult chal lenge. The term \"academic freedom,\" in obvious contrast to \"freedom of the press,\" is nowhere mentioned in the text of the first amendment. It is inconceivable that those who debated and ratified the first amendment thought about aca demic freedom. David M. Rabban, Functional Analysis of \"Individual\" and \"Institutional\" Academic Freedom Under the First Amendment, 53 Law \u0026 Contemp. Probs. 227, 237 (1990).\n\nThus, although Judge Wilkinson trumpets judicial restraint when explaining (as to an issue that is not before the court today) that courts must be reticent to review the decisions of deans and other university administrators on whether to grant research waivers under the statute at issue, post at 52 (\"It is well-established that federal courts have no business acting as surrogate university deans.\"), his fanfare can hardly be heard over the clashing from his own unabashed creation of new constitutional rights out of whole cloth -- an unabashedness that forces his surrender of the high ground that he has assumed in the debate over judicial activism. See, e.g., Gibbs v. Babbitt, No. 99-1218, 2000 WL 726073, at *7 (4th Cir. June 6, 2000) (Wilkinson, J.) (\"The irony of disregarding limits on ourselves in the course of enforcing limits upon others will assuredly not be lost on those who look to courts to respect restraints imposed by rules of law.\"); Friends of the Earth, Inc. v. Gaston Copper Recycling Corp., 204 F.3d 149, 163 (4th Cir. 2000) (en banc) (Wilkinson, J.) (\"This case illustrates at heart the importance of judicial restraint.\"); Johnson v. Collins Entertainment Co., Inc., 193 F.3d 710, 725-26 (4th Cir. 1999) (Wilkinson, J.) (\"Legal constraints cannot yield even to the noblest of intentions, for judicial visions of the social good will differ from issue to issue and from judge to judge, and will, if allowed to run unchecked, thwart the expression of the democratic will.\").\n\nFourth, when, in all but afterthought, Judge Wilkinson finally does turn to the determinative Pickering balance, he ignores the critical aspect of that analysis as set forth by the Supreme Court: the question whether the plaintiffs are speaking in their roles as citizens or in their roles as employees. In all three of its seminal cases on public employee speech, the Supreme Court has placed heavy emphasis on whether the speakers in question were acting in their roles as employees. In Pickering v. Board of Educ., 391 U.S. 563 (1968), a case in which the Court extended protection to a teacher's letter to a newspaper concerning school budgeting, the court emphasized that \"the fact of employment [was] only tangentially and insubstantially involved in the subject matter of the public communication made by a teacher,\" and that, for that reason, it was \"necessary to regard the teacher as the member of the general public he [sought] to be.\" Id. at 574. In Connick v. Myers, 461 U.S. 138 (1983), which presented the question whether a prosecutor could be fired for circulating a questionnaire in her workplace, the Court made the importance of the employee/citizen distinction clear in its very holding sentence: \"We hold only that when a public employee speaks not as a citizen upon matters of public concern, but instead as an employee upon matters only of personal interest, absent the most unusual circumstances, a federal court is not the appropriate forum in which to review the wisdom of a personnel decision. . . .\" Id. at 147. (emphasis added). Finally, and ironically, United States v. National Treasury Employees Union, 513 U.S. 454 (1995), the authority relied on most extensively by Judge Wilkinson, provides perhaps the most powerful indictment of Judge Wilkinson's failure to address the employee/citizen distinction. There, in striking down a law banning federal government employees from collecting honoraria for speaking or writing, the Court emphasized that:\n\n[The plaintiff-government employees] seek compensation for their expressive activities in their capacity as citizens, not as Government employees. They claim that their employment status has no more bearing on the quality or market value of their literary output than it did on that of Hawthorne or Melville. With few exceptions, the content of the [government employees'] messages has nothing to do with their jobs and does not even arguably have any adverse impact on the efficiency of the offices in which they work. They do not address audiences composed of co-workers or supervisors; instead, they write or speak for segments of the general public. Neither the character of the authors, the sub ject matter of their expression, the effect of the content of their expression on their official duties, nor the kind of audi ences they address has any relevance to their employment. Id. at 465. (emphasis added).\n\nThus, although the public concern/personal interest distinction is no doubt of importance under Connick, the citizen/employee distinction is, by force of these three authorities, equally so, at the very least.\n\nJudge Wilkinson never quotes or otherwise references any of these key passages from Pickering, Connick, and NTEU. Indeed, in the only passage in which Judge Wilkinson makes any reference to the fundamental distinction between the individual acting in his role as employee and the individual acting in his role as citizen, he criticizes our court and the Commonwealth for our over-emphasis on it. See post at 42 (\"[T]he majority . . . goes astray by placing exclusive emphasis on the fact that the statute covers speech of `state employees in their capacity as employees.'\"); compare id. with Boring v. Buncombe County Bd. of Education, 136 F.3d 364, 375, 379 (Motz, J., dissenting) (\"Conceivably, the majority's holding is grounded in misreading Connick to make the role in which a public employee speaks determinative of whether her speech merits First Amendment protection.\"). And, in effect to read the employee/citizen distinction out of Pickering and its successors altogether, Judge Wilkinson eventually completely merges the employee/citizen analysis into the public concern/private analysis, criticizing the Commonwealth for \"begin[ning] and end[ing] the public concern inquiry with the signature on the plaintiffs' paychecks or the serial number on their computers.\" Post at 46. Thus, by the time he is through, although seemingly without even realizing that he has done so, Judge Wilkinson has purged altogether from Connick and Pickering the public employee/private citizen analysis that he himself has consistently held is critical. See, e.g., Robinson v. Balog, 160 F.3d 183, 189 (4th Cir. 1998) (Wilkinson, J.) (\"By Responding to the Board's invitation to testify at a public hearing and by cooperating with law enforcement investigators, Robinson and Marc spoke not in their `capacity as . . . public employee[s],' DiMeglio, 45 F.3d at 805, but as `citizen[s] upon matters of public concern.' Connick, 461 U.S. at 147, 103 S. Ct. 1684.\").\n\nIt is unsurprising that Judge Wilkinson would avoid the question whether the plaintiffs here are speaking in their roles as public employees or in their roles as private citizens, because in the answer to that question lies the refutation of the constitutional right that Judge Wilkinson concludes exists. For, when university professors conduct university research on university time, on university computers, and in conduct of their university duties, it is indisputable that they are performing in their role as public employees of the university, even though Judge Wilkinson is unwilling to accept as much. See post at 45 (\"[I]n their research and writing university professors are not state mouthpieces --they speak mainly for themselves.\"). They are as different as can be imagined from the teacher who wrote to the newspaper in Pickering, the prosecutor who circulated the questionnaire in Connick, or the federal government employees who gave speeches and wrote articles for the general public in NTEU. The professors' research is conducted on computers and via Internet access services that are both paid for by the public; thus, the professors' research is itself paid for by the people of the Commonwealth of Virginia. Indeed, the professors are paid to conduct the research that they do. The professors' research thus belongs to the public (at least in the only sense that matters here). In a word, when conducting their research so that they may better discharge their professorial responsibilities to the public, these professors are speaking qua public employees, not qua private citizens. I cannot imagine that anyone would contend otherwise. Certainly, the professors before us are not so brazen as to do so.\n\nFifth, with respect to those portions of the Pickering analysis to which Judge Wilkinson does address himself, not only does he identify incorrectly the employee speech to be balanced, he incorrectly identifies the corresponding state interest that would be balanced were he correct that that employee speech was the relevant speech under Pickering.\n\nThus, consistent with his exclusive focus on academic speech in the first half of his opinion in which he identifies the employee speech at issue --which focus he said at that point was \"illustrative\" only, see post at 42 -- he identifies as the entirety of the relevant employee speech for purposes of his Pickering balance the academic speech discussed in the first half of his opinion. (At this point in his opinion, Judge Wilkinson is unwilling to assert that this speech relates to a matter of public concern; rather, he says only that it \"potentially touches on\" such matters. Post at 50.). If one chooses to balance only the academic employees' interests, as does Judge Wilkinson, then one must balance against that interest only the governmental interest in regulation of that academic speech, not the government's interest in regulation of that same kind of speech by all of the state's public employees, as does Judge Wilkinson. And the only principled conclusion that one can reach upon thus properly balancing the correct interests is that the Commonwealth's statute cannot stand -- a consequence that Judge Wilkinson (even at the cost of analytical incredibility) is unwilling to accept. For, if the academic employees' First Amendment interests are as profound as Judge Wilkinson believes them to be, then the government's interest in regulating the university professors' private access to the prohibited materials for individual research purposes pales by comparison.\n\nThat is, it is unquestionable not only that academic research in general is of utmost importance, but also that there could well be legitimate research that would entail, if not necessitate, access to the very kinds of material to which access is prohibited by the Commonwealth's statute. And it is also unquestionable that an individual professor's private access to such materials in the sanctity of his own office would have little, if any, disruptive effect on the workplace at all. Indeed, I cannot imagine a governmental interest either specific to university professors or equally applicable to them as to any other public employee that would override those academic freedom interests. And, obviously, neither can Judge Wilkinson, despite his affirmance of the Commonwealth's statute on the very ground that the state's interest in the avoidance of workplace disruption surpasses the professors' First Amendment right to research the matters proscribed by the statute. Not only does he identify none at all; he does not even attempt to do so. In fact, the state's interest in avoidance of workplace disruption, that Judge Wilkinson balances against the professors' interest in \"academic freedom\" is wholly unattributable to the professor plaintiffs. See post at 49 (\"The posting of such material on web sites in state offices has led to workplace disruption and complaints that such sexually graphic matter contributes to a hostile work environment.\").\n\nIn other words, if one really believed that there is an actual constitutional right to academic freedom and that it is a right of the importance believed by Judge Wilkinson, then he would unhesitatingly invalidate the Commonwealth's statute as urged by the professor plaintiffs (at least as applied to them) -- not sustain it and dismiss the plaintiffs' research as \"abuse\" and \"misconduct,\" as does Judge Wilkinson, post at 49-50 -- because the state's interest in limiting individual professor access to the proscribed material within the privacy of the professor's own office is, and obviously so, comparatively insignificant to the professor's interest in academic freedom. It is for this reason that Judge Wilkinson's seemingly bold recognition of a constitutional right in the university professors is but a pyrrhic victory (indeed, as it is indirectly for all public employees), because it is a right that must yield to the subjective and uninformed views of the federal judiciary, and even beyond that, to the most negligible of governmental interests.\n\nOf course, it is not academic speech alone that must be balanced under Pickering, contrary to Judge Wilkinson's belief. It is the speech of all public employees who would engage in \"research\" that must be balanced against the state's interest in the regulation of this particular speech by all of its employees. The consequence of this proper balancing, however, is that one is unable to recognize a special First Amendment right in academics over all other public employees -- a consequence that Judge Wilkinson likewise is unwilling (also at the cost of analytical incredibility) to accept.\n\nSixth, and most tellingly, in his understandable haste to express disapproval of the material to which access has been denied by the Commonwealth, Judge Wilkinson actually does not perform any balancing at all -- none at all. The total of his reasoning on the Pickering balance is that the Commonwealth's revised statute \"restricts a more limited range of material\" than its predecessor statute, post at 51 -which of course is to say nothing as to the relative weight of the respective employee and governmental interests. Given the complete absence of any attempt at the Supreme Court-required balancing of interests under Pickering, the only reasonable conclusion that can be drawn is that, at least by this point in his opinion, Judge Wilkinson knows well that the result of that balancing would be precisely opposite that which he wishes to reach. That balancing would yield either the validation of the Commonwealth's statute as to all employees of the State, not just the State's academic employees, or the invalidation of the statute as to all of the State's employees, academic and non-academic alike.\n\nJudge Wilkinson believes that he has undertaken the substantive equivalent of the required balancing of interests in reaching his conclusion that the state's interests outweigh those of the relevant public employees, because he goes on to consider that the statutory waiver power resides in the university itself and thus that the intrusion on the public employees' speech interests is \"minimal.\" Post at 51. Of course, in neither substance nor form is this the equivalent of the Pickering balance.\n\nHowever, even if one views the waiver provision as a free-floating savings provision somehow related to the required Pickering balance, as Judge Wilkinson mistakenly does, then that provision should not have the constitutional effect that Judge Wilkinson concludes it has. If one believes, as does he, that the constitutional right of \"academic freedom\" belongs to the individual university professor, then the fact that the state government, acting through the university's administration, holds the power of censorship cannot possibly be viewed as a feature that saves the statute from unconstitutionality. It may be that, if put to the choice, every professor would rather have the power of censorship rest with their academic colleagues than with the state's elected officials. However, no professor would believe that his right of academic freedom is safeguarded merely because it can be denied only by his politically-accountable university administrators, as this litigation -- brought by professors notwithstanding the state's conferral of the waiver authority upon the university-- proves. In fact, as one of the professors on whom Judge Wilkinson relies extensively explained in the article on which Judge Wilkinson relies, the seminal academic definition of \"academic freedom\" was itself derived in response to \"threats to professors from university trustees.\" David M. Rabban, Functional Analysis of \"Individual\" and \"Institutional\" Academic Freedom Under the First Amendment, 53 Law \u0026 Contemp. Probs. 227, 229 (1990) (\"Threats to professors from university trustees loomed behind the seminal professional definition [of academic freedom] produced in 1915 by a committee of eminent professors for the first annual meeting of the American Association of University Professors (\"AAUP\").\").\n\nBut, even more fundamentally, the university does not exercise the waiver authority with respect to the vast number of public employees as to whom the Commonwealth's statute also applies, a fact that is ignored by Judge Wilkinson. Compare post 51 (observing that \"[u]nder the Act, the ultimate judgment on whether a requested waiver is for a bona fide research project resides in the system of university governance\") with id. (noting in next sentence that \"[t]he statute grants `agency heads' the authority to approve these waivers\"). The waiver provision may, in Judge Wilkinson's view, save the Commonwealth's statute from constitutional infirmity when the statute is applied against the university professor, because it represents the repository of the critical authority of self-governance in the institution itself, rather than in the state. See id. But one may be assured that Judge Wilkinson would not so view the waiver provision when the statute is applied instead against the ordinary public servant, who is \"left in the rain\" by Judge Wilkinson. For the ordinary public servant, to confer the waiver authority in the relevant state department head would be, in Judge Wilkinson's words, to consign that employee's speech to \"a First Amendment netherworld.\" See post at 48.\n\nFinally, Judge Wilkinson's opinion in concurrence today is, it should come as no surprise, irreconcilable with our own Circuit's precedent in Boring v. Buncombe County Bd. of Education, 136 F.3d 364 (4th Cir. 1998), an opinion in which he joined at the time. In Boring, we held unequivocally, against a First Amendment challenge indistinguishable from that here, that a high school teacher does not have a First Amendment right in the secondary school's curriculum itself. Judge Wilkinson, understanding the incompatibility of his position in Boring with the position he takes today, distinguishes Boring on the ground that, unlike curriculum choices, a professor's research and writing does not bear the imprimatur of government. See post at 45. Boring, of course, did not rest upon any such notion of official imprimatur. It rested, instead, as we said, solely on the firm belief that the teacher possessed no First Amendment right in the curriculum itself; that this was the rationale for our decision is as clear from Judge Motz's dissent as it is from the text of the majority opinion. To attempt to distinguish Boring on the ground of official imprimatur is to betray at once not only disagreement with the essential holding of that case, but fundamental agreement with the dissent in that case. Compare post at 42 (Judge Wilkinson asserting that the \"`content of the speech [here] surely touches on matters of political and social importance\" with Boring, 136 F.3d 375, 378 (Motz, J., dissenting) (\"Although Boring's in-class speech does not itself constitute pure public debate, obviously it does `relate to' matters of overwhelming public concern . . . .\"); see also id. at 379. If research and writing is \"a matter of public concern\" within the intendment of Connick and Pickering, as Judge Wilkinson believes it is, then surely far more \"a matter of public concern\" is the curriculum of our elementary and secondary schools, and consequently far clearer is the elementary and secondary school teachers' First Amendment right to participate in, if not direct entirely, the curriculum of our young.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe factual assertion on the basis of which Judge Wilkinson would distinguish Boring is itself revealing of the doctrinal conundrum in which he finds himself vis-a-vis Boring. For his needed distinction of Boring, Judge Wilkinson asserts that, when professors research and write, \"they speak mainly for themselves,\" post at 45, a declaration in support of which he can cite but a lone academic article from Law \u0026 Contemporary Problems, see id. (citing David M. Rabban, Functional Analysis of \"Individual\" and \"Institutional\" Academic Freedom Under the First Amendment, 53 Law \u0026 Contemp. Probs. 227, 242-244 (1990)). If it is the case that the public university's professors operate independently of state supervision and public accountability, then it is a surprise to me. And I am confident that it would come as a surprise to the public, who pays the professors' salaries in order that they may conduct important research for the public and without whose tax money the professors' research and writing would not be possible.\n\nI do not chronicle these analytic flaws in Judge Wilkinson's analysis for the sake of chronicling. Collectively, each building upon the other, these errors disguise, I believe even from Judge Wilkinson, the uncomfortably counter-precedential and counter-intuitive conclusions that he can, as a result, reach seemingly quite comfortably. If one does not identify in whom a particular right would be created, then he need never confront the consequences of the principled extension of the same right to the similarly situated. If one does not identify the actual right that is created, then he is never obliged to reconcile the creation of that right with the precedent extant. If one ignores the critical step of the established analysis, then he has preordained his conclusion. If one places a thumb on the scale of the determinative balance, then the resulting measure will be the foreseeable consequence of that weighted balance. And if one conducts no balancing at all, then the measure will be that which he, and he alone, tells us it is.\n\nThe true academic should find small comfort in such a defense of his academic freedom.\n\nIn reality, however, the true academic is in no need of defense. The court holds today, as has been uniformly recognized by the Supreme Court through the years, only that there is no constitutional right of free inquiry unique to professors or to any other public employee, that the First Amendment protects the rights of all public employees equally. Neither the value nor the contributions of academic inquiry to society are denigrated by such a holding. And to believe otherwise is to subscribe to the fashionable belief that all that is treasured must be in the Constitution and that if it is not in the Constitution then it is not treasured. But precisely because it is a constitution that we interpret, not all that we treasure is in the Constitution. Academic freedom is paradigmatic of this truism. Academic freedom, however, is also paradigmatic of the truism that not all that we treasure is in need of constitutionalization. No university worthy of the name would ever attempt to suppress true academic freedom --constrained or unconstrained by a constitution. And, if it did, not only would it find itself without its faculty; it would find itself without the public support necessary for its very existence. The Supreme Court has recognized as much -- be it through wisdom, prescience, or simple duty to the Constitution -- for over two hundred years now. It has recognized that, in the end, the academic can be no less accountable to the people than any other public servant. His speech is subject to the limitations of the First Amendment certainly no more, but just as certainly no less, than is the custodian's. That we should all be accountable to the people, and accountable equally, should cause none of us to bridle. Volume 2 of 2\n\nHAMILTON, Senior Circuit Judge, concurring:\n\nThe Appellees claim that they have a First Amendment right to access and disseminate sexually explicit materials on computers that are owned or leased by the Commonwealth. The Appellees' access to, and dissemination of, sexually explicit materials is necessary for them to perform their duties as educators; but, nevertheless, the Appellees' access to, and dissemination of, sexually explicit materials is accomplished in their capacities as state employees. Because the Appellees' access to, and dissemination of, sexually explicit materials is accomplished in their capacities as state employees, the court today correctly concludes under the implicit holding of our en banc decision in Boring v. Buncombe County Board of Education, 136 F.3d 364 (4th Cir.) (en banc), cert. denied, 119 S. Ct. 47 (1998), that the speech in this case is employee speech, and, therefore, not entitled to First Amendment protection. Furthermore, the court correctly rejects the Appellees' contention that even if the Act is constitutionally valid as to the majority of state employees, it is invalid to the extent it infringes on the academic freedom rights of university faculty.\n\nI joined Judge Motz's dissent in Boring which persuasively explains why a public employee should enjoy far greater First Amendment protection than that contemplated by Boring. See id. at 378-80. Left to my own devices, I would hold that the Appellees' speech in this case is entitled to some measure of First Amendment protection, thus triggering application of the Connick/Pickering balancing test. However, being bound by the en banc court's decision in Boring, a decision the en banc court chose not to revisit in the present case, I concur in the court's majority opinion.\n\nFinally, I write separately to make clear that we leave unanswered the question of whether a governmental employee who seeks to access and disseminate sexually explicit materials rising to the level of matters of public concern, not in his or her role as a governmental employee, but rather as a private citizen, is entitled to some measure of First Amendment protection. The facts of this case leave that issue for another day.\n\nWILKINSON, Chief Judge, concurring in the judgment:\n\nI agree with the majority that the Virginia Act is constitutional. Unlike the majority, I believe that this statute restricts matters of public concern, especially in the context of academic inquiry. The state, however, has a legitimate interest in preventing its employees from accessing on state-owned computers sexually explicit material unrelated to their work. Here the Commonwealth has promoted this legitimate interest through minimally intrusive means, i.e., by permitting university officials to grant waivers for all bona fide research projects. By thus preserving the structure of university self-governance, the statute withstands constitutional scrutiny.\n\nI write separately because the majority accords the speech and research of state employees, including those in universities, no First Amendment protection whatsoever. While the statute may ultimately be constitutional, the First Amendment does not slumber while the state regulates speech on matters of vital public importance.\n\nI.\n\nAlthough the restrictions on Internet access in this statute may appear to pose a novel question, I agree with the majority that it is amenable to traditional analysis through the framework for public employee speech established in Pickering v. Board of Educ., 391 U.S. 563 (1968), and Connick v. Myers, 461 U.S. 138 (1983). But because the statute at issue regulates a broad range of speech, its widespread impact \"gives rise to far more serious concerns than could any single supervisory decision.\" United States v. National Treasury Employees Union, 513 U.S. 454, 468 (1995) (\"NTEU \"). Moreover, the Act's restriction constitutes a prior restraint because it chills Internet research before it happens. Cf. Near v. Minnesota ex rel. Olson, 283 U.S. 697 (1931). Unlike Pickering and its progeny, the statute does not \"involve a post hoc analysis of one employee's speech and its impact on that employee's public responsibilities.\" NTEU, 513 U.S. at 467. Rather, this statute involves a \"wholesale deterrent to a broad category of expression by a massive number of potential speakers.\" Id. When the legislative scythe cuts such a broad swath through the field of public employee speech, Pickering and NTEU require us to carefully consider the First Amendment interests at stake.\n\nThe threshold inquiry in this case is whether the use of the Internet for academic research relates to a matter of \"public concern.\" Connick, 461 U.S. at 147; Robinson v. Balog, 160 F.3d 183, 187-89 (4th Cir. 1998); DiMeglio v. Haines, 45 F.3d 790, 805 (4th Cir. 1995). To make this determination Connick requires that we closely examine the \"content, form, and context\" of the speech at issue. 461 U.S. at 147-48.\n\nWhile the majority undertakes this same inquiry, it goes astray by placing exclusive emphasis on the fact that the statute covers speech of \"state employees in their capacity as employees.\" Whether speech is undertaken as a citizen or public employee is certainly relevant to the analysis. However, it is not the only inquiry. By making it the dispositive criterion, the majority rests its conclusions solely on the \"form\" of the speech. The public concern inquiry, however, does not cease with form. The majority fails to examine the \"content\" of the speech, which surely touches on matters of political and social importance. It also fails to examine the \"context\" of the speech, which can occur in a variety of settings, including the public university. As this case was brought by public university professors, I consider the statute's application to academic inquiry as a useful illustration of how the statute restricts material of public concern.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The content and context of the speech covered by this statute leave no doubt that the law in question affects speech on matters of public concern.\n\nTo take the matter of content first, if the speech at issue were primarily of personal workplace interest to the plaintiffs, it is clear that no First Amendment significance would attach to it. Public employee speech is not entitled to protection if it is of \"purely personal concern to the employee -- most typically, a private personnel grievance.\" Berger v. Battaglia, 779 F.2d 992, 998 (4th Cir. 1985) (internal quotation marks omitted). For instance, in Connick, Assistant District Attorney Sheila Myers was informed that she would be transferred. 461 U.S. at 140. She protested the transfer and distributed a questionnaire soliciting the views of her colleagues. She was then terminated because of her refusal to accept the transfer and her insubordination in distributing the questionnaire. See id. at 141. The Supreme Court held that with but one exception the questions Myers asked did not touch on matters of public concern because they were nothing more than \"mere extensions of Myers' dispute over her transfer.\" Id. at 148. Similarly, in Terrell v. University of Texas System Police, the Fifth Circuit found that a police captain's diary that was critical of a supervisor did not constitute speech on a matter of public concern. 792 F.2d 1360, 1362-63 (5th Cir. 1986). And in Holland v. Rimmer, we found that internal employee discipline by a director of a county agency was not speech on a matter of public concern. 25 F.3d 1251, 1255-56 (4th Cir. 1994). All of these cases involved speech that related to personal workplace disputes and did not involve \"any matter of political, social, or other concern to the community.\" Connick, 461 U.S. at 146.\n\nBy contrast, speech found to be of public concern covers an array of subjects stretching beyond the narrow confines of personal workplace disputes. Courts have focused upon \"whether the `public' or the `community' is likely to be truly concerned with or interested in the particular expression.\" Berger, 779 F.2d at 999; see also Pickering, 391 U.S. at 573 (emphasizing the \"public interest in having free and unhindered debate on matters of public importance\"). For example, in Pickering, a school teacher was dismissed for sending to a newspaper a letter that was critical of the Board of Education for the way it handled past proposals to raise new revenue for schools. 391 U.S. at 564. The Court held that the letter touched on matters of \"legitimate public concern\" because on such questions of school funding \"free and open debate is vital to informed decision-making by the electorate.\" Id. at 571-72. In NTEU, two unions and several career civil servants challenged a statute that forbade federal employees from accepting honoraria. 513 U.S. at 461. The employees received compensation for speaking and writing on a variety of topics -- a mail handler lectured on the Quaker religion, an aerospace engineer lectured on black history, and a microbiologist reviewed dance performances. See id. The Court found that these expressive activities \"fall within the protected category of citizen comment on matters of public concern rather than employee comment on matters related to personal status in the workplace.\" Id. at 466. The First Amendment thus affords public employee speech some umbrella of protection -- those, however, with purely personal workplace disputes will get caught in the rain. The statute at issue here addresses speech that is quite unrelated to personal grievances about the workplace. The content of academic inquiry involves matters of political and social concern because \"academic freedom is of transcendent value to all of us and not merely to the teachers concerned.\" Keyishian v. Board of Regents, 385 U.S. 589, 603 (1967). Academic inquiry is necessary to informed political debate. Academic curiosity is critical to useful social discoveries. One cannot possibly contend that research in socially useful subjects such as medicine, biology, anatomy, psychology, anthropology, law, economics, art history, literature, and philosophy is not a matter of public concern. The content of this research does not involve a professor's wages or working conditions. Rather it concerns an aggregate of subjects with broad social impact -- subjects touching our physical health, our mental well-being, our economic prosperity, and ultimately our appreciation for the world around us and the different heritages that have brought that world about.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The right to academic inquiry into such subjects cannot be divorced from access to one means (the Internet) by which that inquiry is carried out. By restricting Internet access, a state thus restricts academic inquiry at what may become its single most fruitful source.\n\nNot only does the content of these academic fields support the conclusion that these are matters of public concern, the context of the affected speech is unique. In the university setting \"the State acts against a background and tradition of thought and experiment that is at the center of our intellectual and philosophic tradition.\" Rosenberger v. Rector \u0026 Visitors of Univ. of Va., 515 U.S. 819, 835 (1995). Internet research, novel though it be, lies at the core of that tradition. These plaintiffs are state employees, it is true. But these particular employees are hired for the very purpose of inquiring into, reflecting upon, and speaking out on matters of public concern. A faculty is employed professionally to test ideas and to propose solutions, to deepen knowledge and refresh perspectives. See William W. Van Alstyne, Academic Freedom and the First Amendment in the Supreme Court of the United States: An Unhurried Historical Review, 53 Law \u0026 Contemp. Probs. 79, 87 (1990). Provocative comment is endemic to the work of a university faculty whose \"function is primarily one of critical review.\" Id.\n\nFurthermore, state university professors work in the context of considerable academic independence. The statute limits professors' ability to use the Internet to research and to write. But in their research and writing university professors are not state mouthpieces -- they speak mainly for themselves. See generally David M. Rabban, Functional Analysis of \"Individual\" and \"Institutional\" Academic Freedom Under the First Amendment, 53 Law \u0026 Contemp. Probs. 227, 242-44 (1990). It is not enough to declare, as the majority does, \"The speech at issue here . . . is clearly made in the employee's role as employee.\" Ante at 11. No one assumes when reading a professor's work that it bears the imprimatur of the government or that it carries the approval of his or her academic institution. University research and writing thus differ fundamentally from secondary school curriculum selection, in which we have held that the desires of the individual teacher must give way to local school board policies. See Boring v. Buncombe County Bd. of Educ., 136 F.3d 364, 370-71 (4th Cir. 1998) (en banc).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Curricular choices uniquely can be perceived by\"students, parents, and members of the public . . . to bear the imprimatur of the school.\" Id. at 368 (internal quotation marks omitted).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The interest of the state in a professor's research projects is simply not as all-encompassing. The Commonwealth has nonetheless insisted that professors have no First Amendment interest in the content of their Internet research. It rests this breathtaking assertion on two props: that the professors are state employees, and that the computers are state-owned. See Appellant's Br. at 12 (\"The speech at issue here is speech by state employees in the performance of their governmental duties. This is not citizen speech; it is government speech.\"); id. (\"[T]he Act governs such speech only insofar as state employees seek to use state computers. This is a legitimate exercise of control by government over its own property . . . .\").\n\nPut simply, Connick does not support the Commonwealth's leap. To begin and end the public concern inquiry with the signature on plaintiffs' paychecks or the serial number on their computers would be to permit all manner of content- and viewpoint-based restrictions on speech and research conducted in our universities. The Commonwealth acknowledges as much. See Appellant's Reply Br. at 14. (\"`[G]overnment-as-speaker' as well as `government-as-buyer' may constitutionally engage in content and viewpoint discrimination.\"). It cannot be true, however, that on university campuses the First Amendment places no limits on the Commonwealth's proprietary prerogative -- a prerogative that it claims here in sweeping terms. See id. at 29 (\"[T]he Internet remains as free as the open sea and anyone who wishes may sail there; but the Commonwealth's boats are the Commonwealth's business, and no one can take them out without the Commonwealth's permission.\"). Under this view, if the Commonwealth were to declare that certain politically sensitive subjects could not be researched on state computers by state employees holding politically objectionable views, the statutory restriction must be upheld. By embracing the Commonwealth's view that all work-related speech by public employees is beyond public concern, the majority sanctions state legislative interference in public universities without limit. The majority's position would plainly allow the prohibition of speech on matters of public concern.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The worry over undue intrusion is not mere tilting at windmills -- the Commonwealth's original Internet access restrictions were stunning in their scope. For example, the Act originally barred access to all materials having \"sexually explicit content\" without regard to whether the depiction was \"lascivious\" or whether it constituted the material's \"dominant theme.\" Compare Va. Code Ann. § 2.1-804 (Michie Supp. 1998), with Va. Code Ann. § 2.1-804 (Michie Supp. 1999). As the panel opinion noted, this restriction swept within its ambit \"research and debate on sexual themes in art, literature, history, and the law; speech and research by medical and mental health professionals concerning sexual disease, sexual dysfunction, and sexually related mental disorders; and the routine exchange of information among social workers on sexual assault and child abuse.\" Urofsky v. Gilmore , 167 F.3d 191, 195 n.6 (4th Cir. 1999). These are areas of more than mere personal interest. Speech in the social and physical sciences, the learned professions, and the humanities is central to our democratic discourse and social progress.\n\nThe majority's reasoning could also be used to uphold statutes that otherwise would fall for overbreadth and vagueness. A prime example is speech codes that have the potential to suppress classroom speech that is unconventional or unorthodox. Courts have repeatedly invalidated these codes for trampling on First Amendment freedoms. See Dambrot v. Central Mich. Univ., 55 F.3d 1177, 1182-84 (6th Cir. 1995) (finding policy against discriminatory harassment unconstitutionally vague and overbroad); Iota Xi Chapter of Sigma Chi Fraternity v. George Mason Univ., 993 F.2d 386, 393 (4th Cir. 1993) (holding that university cannot maintain gender-neutral educational environment by silencing speech on the basis of viewpoint). These speech codes are often exceptionally broad. For instance, one university code forbids \"`any intentional, unintentional, physical, verbal, or nonverbal behavior that subjects an individual to an intimidating, hostile or offensive educational, employment or living environment by . . . demeaning or slurring individuals through . . . written literature because of their racial or ethnic affiliation; or . . . using symbols, [epithets] or slogans that infer negative connotations about the individual's racial or ethnic affiliation.'\" See Dambrot, 55 F.3d at 1182 (quoting the Plan for Affirmative Action at Central Michigan University). A statute could be passed that has similarly broad terms reaching substantial amounts of protected speech. Yet under the majority's reasoning, such statutes would not implicate any First Amendment rights because they would regulate university professors only as state employees, and therefore would not involve matters of public concern. The majority provides no way to distinguish the statute at issue here from more intrusive future statutes. Under the majority's rationale, whenever state employees are regulated as state employees, their speech lies outside the realm of \"public concern.\" Thus, regardless of the statute, there is no balancing of the competing First Amendment and state interests. This relegates academic speech to a First Amendment netherworld.\n\nThe Supreme Court has recognized that \"the university is a traditional sphere of free expression . . . fundamental to the functioning of our society.\" Rust v. Sullivan, 500 U.S. 173, 200 (1991). Further, \"[t]he essentiality of freedom in the community of American universities is almost self-evident.\" Sweezy v. New Hampshire, 354 U.S. 234, 250 (1957). Thus the Commonwealth's ownership of the plaintiffs' computers or communication lines cannot end our analysis. Virginia also owns the chairs on which plaintiffs sit and the desks at which they work. But the Commonwealth does not thereby \"own\" their every thought and utterance. As cyberspace expands, web pages may provide more and faster access to information that will contribute to the understanding of social problems and ultimately to solutions for them. Insofar as public employees are concerned, the majority would allow the state to shut down this informational resource at its whim. It is remarkable that Internet research with all its potential falls outside the majority's conception of public concern. Discarding the ancient safeguards of the First Amendment is no way to welcome this modern technological development.\n\nII.\n\nBecause the Act restricts speech on matters of public concern, we must determine whether the burden on speech is justified by the governmental interest at stake. See Pickering, 391 U.S. at 568. Because of the widespread impact of the statute, \"the Government's burden is greater . . . than with respect to an isolated disciplinary action\" such as those considered in Connick and Pickering. NTEU, 513 U.S. at 468. The Commonwealth must show that the interests of plaintiffs and of society in the expression \"are outweighed by [the] expression's necessary impact on the actual operation of the Government.\" Id. (internal quotation marks omitted). Whether judges happen to approve of this statute is not the question to be addressed under the Pickering/NTEU balance. We do not evaluate the enactment's desirability, only its constitutionality. Our view of the wisdom of a state provision \"may not color our task of constitutional adjudication.\" Clements v. Fashing, 457 U.S. 957, 973 (1982).\n\nWhile I fully agree with my dissenting colleagues that the speech at issue here is of public concern, I part company with their balancing under the second part of the Connick analysis. There is no question that the General Assembly addressed a real, not a fanciful, problem when it enacted this statute. The record is replete with examples of Internet web sites displaying graphic forms of sexual behavior. See Urofsky v. Allen, 995 F. Supp. 634, 639 (E.D. Va. 1998) (describing web site on university computer containing \"graphic images of a nude woman in chains, a nude man with an erection, and a man and woman engaged in anal intercourse\"). The posting of such material on web sites in state offices has led to workplace disruption and complaints that such sexually graphic matter contributes to a hostile work environment. While such abuses may be confined to a small minority of employees, Virginia has an undisputed and substantial interest in preventing misconduct of this sort. Sexual harassment via computer is as objectionable in the university setting as it is in any workplace. The Commonwealth's interest as an employer in workplace efficiency is similarly beyond question. See Pickering, 391 U.S. at 568; Connick, 461 U.S. at 143 (\"[G]overnment offices could not function if every employment decision became a constitutional matter.\").\n\nThe state thus has every right to require its employees to spend their workday energies on the functions for which it is paying them. As the Supreme Court has stated, \"Interference with work, personnel relationships, or the speaker's job performance can detract from the public employer's function; avoiding such interference can be a strong state interest.\" Rankin v. McPherson, 483 U.S. 378, 388 (1987). While many university employees doubtless have genuine scholarly interests in the study of sexual phenomena, for others the examination of sexually explicit matter may bear no relationship to any academic enterprise. As the Commonwealth argues,\"Publication of materials in the workplace that colleagues find offensive and demeaning plainly harms workplace morale and detracts from the efficiency of the workforce.\" Appellant's Br. at 35. In a more general but still important sense, the ubiquity of sexual imagery may diminish employee self-control and debase the entire workplace environment. My dissenting colleagues, however, give little weight to the Commonwealth's interest in the management of its own educational system and the running of its own workforce -- surely important interests under our federal scheme of government.\n\nOn plaintiffs' side of the balance, the Act, as noted, restricts access to material that potentially touches on matters of public concern. The recent revisions to the statute, however, have narrowed its scope considerably. As noted by the majority, the Act restricts the use of state owned or leased computer equipment to access any material \"having sexually explicit content.\" Va. Code Ann. § 2.1-805 (Michie Supp. 1999). As revised the statute defines \"sexually explicit content\" as: \"content having as a dominant theme (i) any lascivious description of or (ii) any lascivious picture, photograph, drawing, motion picture film . . . or similar visual representation depicting sexual bestiality, a lewd exhibition of nudity, . . . sexual excitement, sexual conduct or sadomasochistic abuse, . . . coprophilia, urophilia, or fetishism.\" Id. § 2.1-804. Although the statute still limits access to some nonobscene information, it now restricts a more limited range of material -- namely that which has as its dominant theme the lascivious depiction of nudity or sexual conduct.\n\nMost importantly, through the waiver process the Commonwealth also accommodates the various interests at stake-- barring employee access to lascivious material generally, but providing a procedure that can be invoked whenever educational institutions determine that academic freedom so requires. The significant state interest here is thus balanced against a minimal intrusion on academic inquiry. Under the Act, the ultimate judgment on whether a requested waiver is for a bona fide research project resides in the system of university governance. The statute grants \"agency heads\" the authority to approve these waivers. Id. § 2.1-805. As a practical matter, it appears from the record that Virginia's colleges and universities have delegated primary approval authority to officials such as deans and department heads.\n\nThe Commonwealth thus maintains academic freedom by reposing critical authority within the university itself. The Supreme Court has noted that academic freedom \"thrives not only on the independent and uninhibited exchange of ideas among teachers and students, but also, and somewhat inconsistently, on autonomous decisionmaking by the academy itself.\" Regents of the Univ. of Mich. v. Ewing, 474 U.S. 214, 226 n.12 (1985) (citations omitted). See also J. Peter Byrne, Academic Freedom: A \"Special Concern of the First Amendment\", 99 Yale L.J. 251, 333 (1989) (defending institutional academic freedom based on \"those research and humanistic values of a university that are unique to it\"). Virginia's statute fits within this model of university self-governance. In using the term university self-governance I do not intend to downplay the significant role of state government and boards of trustees with respect to state systems of higher education, but to underscore the traditional role of deans, provosts, department heads, and faculty in making purely academic decisions.\n\nIt is this thread of institutional self-governance that ties our judgment today with Boring v. Buncombe County Board of Education, 136 F.3d 364 (4th Cir. 1998) (en banc). In Boring we held that \"school administrative authorities had a legitimate pedagogical interest in the makeup of the curriculum of the school.\" Id. at 370. We reasoned that school boards must retain the \"most basic authority to implement a uniform curriculum.\" Id. at 373. In upholding the right of a school board to make curriculum decisions, we upheld as well the state's legitimate interest in its secondary school governance structure. See id. at 368-69 (citing Hazelwood Sch. Dist. v. Kuhlmeier, 484 U.S. 260, 271 (1988), and Kirkland v. Northside Indep. Sch. Dist., 890 F.2d 794, 800 (5th Cir. 1989)). It is true that the governance structures of higher education and secondary education differ quite dramatically. The underlying approach of the court, however, should be the same. Where the state, as here, has worked within the traditional governance structure for educational institutions, the hand of the federal judiciary should ordinarily be stayed.\n\nThis is so for many reasons. It is well-established that federal courts have no business acting as surrogate university deans. Our \"reluctance to trench on the prerogatives of state and local educational institutions,\" Ewing, 474 U.S. at 226, is grounded in powerful notions of federalism and a healthy awareness of limited judicial competence in university administration. Federal courts are simply not \"suited to evaluate the substance of the multitude of academic decisions that are made daily by faculty members of public educational institutions.\" Id.\n\nWere we asked to review ex post the judgments of these academic deans and department heads with respect to individual waiver requests, we would thus act with extreme deference. And for good reason. The discretionary choices made by provosts, deans, and faculties in the contexts of hiring, tenure, curriculum selection, grants, and salaries all potentially burden individual academic freedom to some extent, but courts have generally been unwilling to second-guess these necessarily sensitive and subjective academic judgments. See Ewing, 474 U.S. at 225 (\"When judges are asked to review the substance of a genuinely academic decision, . . . they should show great respect for the faculty's professional judgment.\"); University of Pa. v. EEOC, 493 U.S. 182, 199 (1990) (\"[C]courts have stressed the importance of avoiding second-guessing of legitimate academic judgments.\"). We should not presume ex ante that those same institutions will discharge their authority under this statute in an irrational or arbitrary fashion. I am thus not prepared to believe, as plaintiffs suggest, that a free academic institution will invade the freedoms of its own constituent members. In fact, the record reflects just the opposite -- several professors have received research waivers from their colleges or universities upon request. We have not been made aware of any examples of professors whose requests for exemptions were denied.\n\nThe fact that this statute governs use of the Internet should not change our approach to institutional self-governance. The Internet allows unparalleled access to information, thereby enhancing opportunities for freedom of expression and holding tremendous promise for virtually all types of research. But with this exponential growth of freedom comes the potential for abuse. Whereas formerly access to sexually explicit matter was somewhat limited, now a click of the mouse can invite obscene material into the middle of the working environment.\n\nWhen the danger of abuse is great, however, so also is the danger of unwarranted repression. There will be the temptation to brand all public employees as miscreants because of the publicized misadventures of a few. This would be a mistake. \"`The greater the importance of safeguarding the community . . . the more imperative is the need to preserve inviolate the constitutional rights of free speech, free press and free assembly in order to maintain the opportunity for free political discussion . . . .'\" Keyishian, 385 U.S. at 602 (quoting De Jonge v. Oregon, 299 U.S. 353, 365 (1937)). The Commonwealth has made the judgment that universities themselves are best equipped to balance the enormous promise of the Internet against the novel risks that may accompany it. Because the limited restrictions in this Act are administered within the traditional structure of university governance, I do not believe the Virginia statute contravenes the Constitution.\n\nIII.\n\nMy fine colleagues in the majority and in concurrence take issue with the above approach. They claim I believe \"professors possess a special constitutional right,\" ante at 10 n.7, that I am \"emphatic that a new constitutional right must be created,\" ante at 25 (Luttig, J., concurring), and that my \"new-found right is reserved for professors alone,\" ante at 25. I would, however, create no new right of any sort. I would simply review the form, content, and context of the speech at issue -- something that the Supreme Court requires us to do in Connick and that the majority steadfastly refuses to do. The consequence of the majority's failure could not be more serious. Under the majority's view, even the grossest statutory restrictions on public employee speech will be evaluated by a simple calculus: if speech involves one's position as a public employee, it will enjoy no First Amendment protection whatsoever. My colleagues in the majority would thus permit any statutory restriction on academic speech and research, even one that baldly discriminated on the basis of social perspective or political point of view.\n\nThe Supreme Court has eschewed such a reductionist view of First Amendment rights. By refusing to undertake a proper public concern inquiry under the first step of Connick and Pickering, the majority ensures that all statutes targeting public academic speech are immune from balancing in the second step. Thus, a court need never even examine the competing state and public employee interests at stake. But the Supreme Court has stated that \"[a]lthough such particularized balancing is difficult, the courts must reach the most appropriate possible balance of the competing interests.\" Connick, 461 U.S. at 150. By upholding this statute on the first step of Connick/Pickering, the majority surrenders this balance to a world of absolutes.\n\nThe majority and concurrence also characterize my approach as one of academic privilege. They contend I believe that \"professors possess a special constitutional right of academic freedom,\" ante at 10 n.7, and that \"the academy has a special contribution to make to society,\" ante at 25 (Luttig, J., concurring).\n\nBut the Supreme Court itself has emphasized that \"academic freedom . . . is of transcendent value to all of us and not merely to the teachers concerned.\" Keyishian, 385 U.S. at 603 (emphasis added). Indeed, \"[t]he essentiality of freedom in the community of American universities is almost self-evident.\" Sweezy, 354 U.S. at 250 (emphasis added). By its talk of special rights and privileges, I fear the majority somehow sees academic speech and democratic values as inconsistent or at odds. With all respect, this need not be our view. I had always supposed that democracy and speech, including academic speech, assisted one another and that democracy functioned best when the channels of discourse were unfettered. It would be folly to forget this fundamental First Amendment premise in complex times when change of every sort confronts us. Those who have worked to acquire expertise within their given fields can aid popular representatives in reaching decisions and in shaping an informed response to rapid change. Democratic representatives may often choose to reject academic proposals, but rejection, not suppression, is the constitutionally tested course. In all events, for speech to function usefully and creatively it cannot be subject, as my colleagues in the majority would now have it, to the unexamined legislative will. \"One's right to life, liberty, and property, to free speech, a free press, freedom of worship and assembly, and other fundamental rights may not be submitted to vote; they depend on the outcome of no elections.\" West Va. State Bd. of Educ. v. Barnette, 319 U.S. 624, 638 (1943).\n\nThe majority undertakes an extended discussion of academic speech, because public university professors are the plaintiffs before us. But the majority concludes, without any proper content-context inquiry, that such speech can never be of public concern. This dismissal is something we shall come to regret. I recognize that academic speech may well appear at times to be petty, \"politically correct,\" or floating far beyond reality. But to see it as only that is to slip too easily into stereotype. Academic views on any subject are often varied, and it remains an abiding challenge to democratic leadership to understand what is misguided and naive about expert opinion and what is sound and wise. I offer no apology for believing, along with the Supreme Court in Keyishian, Sweezy, and Rosenberger, in the significant contribution made to society by our colleges and universities. That contribution, however, is but one of many made from all walks of national life. Elected officials, labor leaders, industrialists, farmers, entrepreneurs, social workers, religious leaders, parents and teachers, the self-employed and the unemployed all make their contribution to the broad river of American speech, and I would not shut off any stream or tributary. The source from which speech flows should not mark it for judicial disfavor. I fear the court forgets that freedom of speech belongs to all Americans and that the threat to the expression of one sector of society will soon enough become a danger to the liberty of all.\n\nMURNAGHAN, Circuit Judge, dissenting:\n\nThe majority's interpretation of the \"public concern\" doctrine makes the role of the speaker dispositive of the analysis. Specifically, the majority states that \"critical to a determination of whether employee speech is entitled to First Amendment protection is whether the speech is `made primarily in the [employee's] role as citizen or primarily in his role as employee.'\" See ante at 8 (quoting Terrell v. University of Tex. Sys. Police, 792 F.2d 1360, 1362 (5th Cir. 1986)). The majority then rejects the plaintiffs' First Amendment claim because \"[t]he speech at issue here . . . is clearly made in the employee's role as employee.\" Id. at 11. Because an analysis of Connick v. Myers, 461 U.S. 138 (1983), and its progeny reveals that the majority has adopted an unduly restrictive interpretation of the \"public concern\" doctrine, I respectfully dissent.\n\nI.\n\nA.\n\nIn Connick, the Supreme Court held that, as a threshold matter, if a public employee's speech \"cannot be fairly characterized as constituting speech on a matter of public concern,\" then a court does not balance the employer's interests with those of the employee. Connick, 461 U.S. at 146. The Court broadly defined speech of public concern as speech \"relating to any matter of political, social, or other concern to the community.\" Id. The Court also stated that \"[w]hether an employee's speech addresses a matter of public concern must be determined by the content, form, and context of a given statement, as revealed by the whole record.\" Id. at 147-48. Nowhere in Connick, however, did the Court state that the role of the speaker, standing alone, would be dispositive of the public concern analysis.\n\nIndeed, the facts of Connick belie this suggestion. Sheila Myers, an Assistant District Attorney, was discharged for distributing a questionnaire to the other attorneys in her office. In general, Myers' questionnaire asked her peers what they thought of the trustworthiness of certain attorneys in the office, the morale of the office, and the office's transfer policy. See id. at 141.\n\nThe Court held that these questions \"do not fall under the rubric of matters of `public concern,'\" because they were \"mere extensions of Myers' dispute over her transfer to another section of the criminal court.\" Id. at 148. Myers' questionnaire, however, also asked whether her fellow attorneys \"ever feel pressured to work in political campaigns on behalf of office supported candidates.\" Id. at 149. This question was in the same form and context as Myers' other questions --an internal questionnaire distributed by an employee complaining about on-the-job conditions. The question thus was speech by an employee in her role as an employee. The Court nevertheless held that this question did \"touch upon a matter of public concern.\" Id. The majority's formalistic focus on the \"role of the speaker\" in employee speech cases therefore runs directly contrary to Supreme Court precedent.\n\nB.\n\nPost-Connick decisions of this court also make it clear that the role of the speaker does not control the public concern analysis. In Piver v. Pender County Bd. of Educ., 835 F.2d 1076 (4th Cir. 1987), the plaintiff, a high school teacher, circulated a petition to his students during class urging retention of the school's principal. See id. at 1077. The plaintiff undoubtedly was speaking in his role as an employee, as he was being paid by the State and using State facilities (classrooms) to carry out his employment duties (instructing students). The court nevertheless held that the plaintiff's speech was on a matter of public concern because it was a \"matter in which the community . . . was vitally interested.\" Id. at 1080. The court also stressed that the speech was \"of much wider importance than a mere`private personnel grievance,'\" that would not be of public concern. Id.\n\nIn Piver, the court relied on the \"public concern\" analysis set out by this court in Berger v. Battaglia, 779 F.2d 992 (4th Cir. 1985). In Berger, the court interpreted the public concern doctrine as excluding from First Amendment protection only those matters of purely personal interest to the employee.\n\nPickering, its antecedents, and its progeny--particularly Connick--make it plain that the \"public concern\" or \"com munity interest\" inquiry is better designed--and more concerned--to identify a narrow spectrum of employee speech that is not entitled even to qualified protection than it is to set outer limits on all that is. The principle that emerges is that all public employee speech that by content is within the general protection of the first amendment is entitled to at least qualified protection against public employer chilling action except that which, realistically viewed, is of purely \"personal concern\" to the employee- most typically, a private personnel grievance. Id. at 998.\n\nFurthermore, the court stated that when analyzing whether speech is upon \"any matter of political, social, or other concern to the community,\" see Connick, 461 U.S. at 146,\"[t]he focus is . . . upon whether the `public' or the `community' is likely to be truly concerned with or interested in the particular expression, or whether it is more properly viewed as essentially a `private' matter between employer and employee.\" Berger, 779 F.2d at 999.\n\nBerger's broad approach to the public concern doctrine, focusing on the public importance of the speech, stands in stark contrast to the majority's singular focus on the role of the speaker--regardless of the public import of the speaker's message. See also Arvinger v. Mayor and City Council of Baltimore, 862 F.2d 75, 79 (4th Cir. 1988) (\"Although the Connick court did not elaborate on the relative weight to be accorded these three factors, this court has held that `content, subject-matter, is always the central aspect.'\") (quoting Jackson v. Blair, 851 F.2d 714, 720 (4th Cir. 1988)).\n\nC.\n\nThe majority justifies its singular focus on the role of the speaker by citing to language from United States v. National Treasury Employees Union, 513 U.S. 454 (1995) (\"NTEU\"). In NTEU, the plaintiffs were executive branch employees challenging a law prohibiting federal employees from accepting any compensation for making speeches or writing articles, even when the speeches or articles did not have any connection to the employees' official duties. The Supreme Court held that the plaintiffs' speech was on a matter of public concern. See id. at 466. In doing so, the Court stated that \"[t]hey seek compensation for their expressive activities in their capacity as citizens, not as Government employees. . . . With few exceptions, the content of respondents' messages has nothing to do with their jobs and does not even arguably have any adverse impact on the efficiency of the offices in which they work.\" Id. at 465. The majority's analysis of this language attempts to push NTEU where it did not go. The Court in NTEU stated that the plaintiffs' speech was on a matter of public concern in part because it was unrelated to the plaintiffs' employment; however, nowhere in NTEU did the Court state the converse: namely, that if the plaintiffs' speech was in their role as employees, then it automatically would not qualify as speech on a matter of public concern. Therefore, at best, NTEU suggests that the role of the speaker is a factor in a public concern analysis. But even a broad reading of NTEU does not suggest that the role of the speaker is the only factor to consider in a public concern analysis, despite the majority's claims to the contrary.\n\nThe majority also relies on our decision in Boring v. Buncombe County Bd. of Educ., 136 F.3d 364 (4th Cir. 1998) (en banc). In Boring, the plaintiff, a high school teacher, was transferred by her principal for producing a student-acted play that addressed controversial topics such as lesbianism and teen pregnancy. The plaintiff alleged that the County violated her First Amendment rights by transferring her in retaliation for producing the play. See id. at 366-67.\n\nA majority of this court framed the issue in Boring as only \"whether a public high school teacher has a First Amendment right to participate in the makeup of the school curriculum through the selection and production of a play.\" Id. at 366. The majority held that the plaintiff's selection of the play was not a matter of public concern and was merely an \"ordinary employment dispute.\" Id. at 368. As their framing of the issue shows, however, the majority's reasoning was not based on the fact that the plaintiff's production of the play was in her role as a school district employee. Rather, the majority answered the narrower question of whether a teacher has a First Amendment right to participate in the makeup of the curriculum.\n\nJudge Luttig's concurring opinion in Boring also illustrates that the majority's holding did not deal with the broader issue of whether speech by an employee in her role as an employee can qualify as speech on a matter of public concern. Judge Luttig stated that\n\n[the dissent] fails to recognize the elementary difference between teacher in-class speech which is curricular, and teacher in-class speech which is noncurricular, because it assumes that every word uttered by a teacher in a classroom is curriculum. In the latter context of teacher in-class non curricular speech, the teacher assuredly enjoys some First Amendment protection. Id. at 373 (Luttig, J., concurring) (emphasis added).\n\nPresumably, Judge Luttig meant that teacher in-class noncurricular speech could be speech on a matter of public concern. As stated previously, however, a teacher's in-class speech is speech in her role as an employee, whether the speech is curricular or noncurricular. While students are under her care and supervision in the classroom, a teacher surely cannot be regarded as a \"citizen\" rather than an \"employee\" merely because she is discussing something other than trigonometry. Thus, Boring must rest on something other than the principle that speech by an employee in her role as an employee never qualifies as speech on a matter of public concern. See Boring, 136 F.3d at 379 (Motz, J., dissenting) (\"Because the majority does not attempt to explicitly hold that the role in which an employee speaks is determinative [or overrule prior precedent], this reasoning must not be the basis for its conclusion that Boring's speech does not relate to a matter of public concern.\"). Boring therefore does not compel a finding that the plaintiffs' speech is not on a matter of public concern, merely because the plaintiffs' speech occurs in their role as employees.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nD.\n\nBecause speech by an employee in her role as an employee can qualify as speech on a matter of public concern, the issue thus becomes whether, in the instant case, the plaintiffs' speech is on a \"matter of political, social, or other concern to the community.\" Connick, 461 U.S. at 146. The plaintiffs' speech easily meets this test. The Supreme Court has stated that \"[s]ex, a great and mysterious motive force in human life, has indisputably been a subject of absorbing interest to mankind through the ages; it is one of the vital problems of human interest and public concern.\" Roth v. United States, 354 U.S. 476, 487 (1957) (emphasis added).\n\nThe Act restricts over 101,000 state employees, including university professors, librarians, museum workers, and physicians and social workers at state hospitals, from researching, discussing, and writing about sexually explicit material. As the district court noted, \"the Act's broad definition of `sexually explicit' content would include research and debate on sexual themes in art, literature, history and the law, speech and research by medical and mental health professionals concerning sexual disease, sexual dysfunction, and sexually related mental disorders, and the routine exchange of information among social workers on sexual assault and child abuse.\" Urofsky v. Allen, 995 F. Supp. 634, 636 (E.D. Va. 1998). These topics undeniably touch on matters of public concern.\n\nThe Commonwealth's recent revision to the Act limiting the definition of \"sexually explicit content\" to materials and descriptions that are \"lascivious\" does not change the analysis. Many works of public import could be classified as lascivious; in fact, many were specifically intended to have such an effect. For instance, the works of Toni Morrison and many themes found in Victorian poetry, including the material researched online by one of the plaintiffs, Professor Myers, could be classified as lascivious. Also, the application of the Act to \"lascivious\" e-mail discussions by psychologists and social workers implicates topics of public import, because the public has an interest in unfettered discussions by State professionals concerning the abnormal sexual behaviors of their patients, in order to better diagnose and understand sexual deviancy.\n\nFinally, the form of the plaintiffs' speech, Internet and e-mail communications, makes the speech of special public significance. In the information age, electronic communications may be the most important forum for accessing and discussing topics of concern to the community. This court should be wary of allowing the State to regulate this important medium of communication without requiring a legitimate justification for the regulation.\n\nII.\n\nBecause the plaintiffs' speech is on a matter of public concern, we must balance the plaintiffs' interests in speaking on a matter of public concern against \"the interest of the State, as an employer, in promoting the efficiency of the public services it performs through its employees.\" Pickering v. Bd. of Educ., 391 U.S. 563, 568 (1968). Our analysis of this balancing test is guided by the Supreme Court's decision in NTEU, a case involving a statutory prohibition on certain types of employee speech.\n\nAs in NTEU, the Act at issue in the instant case does not involve a post hoc analysis of one public employee's speech and the impact of that speech on the operation of government. Rather, we are forced to apply Pickering to the Commonwealth's \"wholesale deterrent to a broad category of expression by a massive number of potential speakers.\" NTEU, 513 U.S. at 467. The widespread impact of a prospective deterrent on employee speech \"gives rise to far more serious concerns than could any single supervisory decision,\" because \"unlike an adverse action taken in response to actual speech, this ban chills potential speech before it happens.\" Id. at 468.\n\nThe Commonwealth's burden in justifying its statutory restrictions on speech is therefore greater than with respect to an isolated disciplinary action. The Commonwealth must establish that \"the interests of both potential audiences and a vast group of present and future employees in a broad range of present and future expression are outweighed by that expression's `necessary impact on the actual operation' of the Government.\" Id. (quoting Pickering, 391 U.S. at 571).\n\nA. The Interests of the Plaintiffs and the Public\n\nThe Act restricts 101,000 state employees from researching, discussing, and writing about sexually explicit topics within their areas of expertise, thereby depriving the plaintiffs of their ability to speak on matters of public concern. It is difficult to measure the effect that the Act will have in stifling commentary and discourse on important topics in art, literature, psychology, and other disciplines; however, it is possible, for example, that seminal academic commentary on the works of Toni Morrison might be scrapped, and that research into sadomasochistic abuse in prisons might be set aside. The chilling of discourse on these topics and other issues adversely affects the material available to \"potential audiences\" of the plaintiffs' speech, restricting \"the public's right to read and hear what the employees would otherwise have written and said.\" NTEU, 513 U.S. at 470. The Act thereby deprives the public of the \"unique insights\" that public employees can provide in their areas of specialization. Sanjour v. Environmental Protection Agency, 56 F.3d 85, 94 (D.C. Cir. 1995) (en banc).\n\nB. The Commonwealth's Interests\n\nThe Commonwealth advances two interests in support of the Act's broad restrictions on employee speech: (1) maintaining operational efficiency in the workplace; and (2) preventing a sexually hostile work environment. While the Act may marginally serve the Commonwealth's asserted interests, the under and overinclusiveness of the Act is fatal to its constitutionality.\n\n1. Underinclusiveness\n\nThe Commonwealth argues that the Act furthers its interest in workplace efficiency. The Commonwealth states that \"[a] state employee who is reading sexually explicit material unrelated to his work is not doing the job he was hired to do.\" Appellant's Br. at 35. The Commonwealth's general interest in workplace efficiency, however, cannot be the basis for the Act's specific prohibition on accessing sexually explicit material on State computers.\n\nFirst, employee efficiency is undermined by any activities that distract an employee from her job-related duties, not just unauthorized Internet use. Reading newspapers, listening to the radio, chatting with co-workers, or talking on the telephone with friends are examples of activities that keep an employee from performing her best on the job. The Commonwealth, however, does not attempt to regulate these activities through the Act, nor does it cite to any evidence that accessing sexually explicit material undermines workplace efficiency any more than these activities.\n\nSecond, the Act does not even cover all of the uses of the Internet that undermine workplace efficiency. Employees may use State computers to send non-work related e-mail, as well as access news services, chat rooms, sports websites, and other material unrelated to their jobs. The Commonwealth has not explained, and cannot possibly explain, why employees who access sexually explicit material are any less \"efficient\" at their work than employees who check espn.com every twenty minutes during the NCAA tournament.\n\nThe Commonwealth next argues that the Act furthers its interest in preventing sexual harassment in the workplace. Again, the Act is not tailored to combat this ill in any material way. The Act targets only access to sexually explicit material on the Internet--ignoring books, calendars, pictures, and other sexually explicit material that demeans women and helps create a sexually hostile work environment. A professor therefore would violate the Act by accessing the Internet to complete research on Victorian poetry, yet he would not violate the Act by leaving copies of Hustler Magazine lying around his office.\n\nIn addition, the Act only prohibits the accessing of sexually explicit material on state-owned computers; it does not impose a general ban on accessing any sexually explicit material on computers in the workplace. Thus, a state employee may use his own computer to access patently pornographic pictures around his students or colleagues without violating the Act. The Commonwealth does not provide any justification for why sexually explicit images are any less likely to create a hostile work environment if those images come from an employee's personal computer rather than from a state-owned computer.\n\n2. Overinclusiveness\n\nThe Act is also impermissibly overinclusive. It prohibits research and commentary by state employees who access this material to advance public discourse, awareness, treatment, and commentary on a variety of disciplines and social problems. The Act thus reaches the legitimate work-related uses of sexually explicit material, uses wholly unrelated to the narrower category of gratuitous sampling of pornographic material that the Act was intended to address. The Commonwealth appears to concede this point; however, the Commonwealth argues that the Act's prior approval process ensures that employees who have a legitimate need to access sexual explicit material will be able to do so.\n\nThe Act's prior approval provision allows state employees to access sexually explicit material \"to the extent required in conjunction with a bona fide, agency-approved research project or other agencyapproved undertaking.\" The Act's prior approval process, however, has no check on the discretionary authority of State agencies. The Supreme Court, in a related context, has found that such grants of unbridled discretion to government agents invites arbitrary enforcement. In City of Lakewood v. Plain Dealer Publishing Co., 486 U.S. 750 (1988), the Court held that\n\nwhen the determination of who may speak and who may not is left to the unbridled discretion of a government official . . . we have often and uniformly held that such statutes or policies impose censorship on the public or the press, and hence are unconstitutional, because without standards gov erning the exercise of discretion, a government official may decide who may speak and who may not based upon the content of the speech or viewpoint of the speaker. Id. at 763; see also Sanjour, 56 F.3d at 97 (\"Far from being the saving grace of this regulatory scheme--as the government suggests--the broad discretion that the regulations vest in the agency reinforces our belief that they are impermissible.\").\n\nThe potential for censorship by the State \"justifies an additional thumb on the employees' side of [the] scales.\" See Harman v. City of New York, 140 F.3d 111, 120 (2d Cir. 1998) (invalidating agency's policy requiring prior approval for employee statements to the media) (quoting Sanjour, 56 F.3d at 97). The danger of arbitrary censorship is particularly relevant in the instant case, given the differing views on the merits of research and discussion into sexually-related topics.\n\nThe prior approval process does not save the Act even if we could assume that approvals would not be withheld arbitrarily, because the \"mere existence of the licensor's unfettered discretion, coupled with the power of prior restraint, intimidates parties into censoring their own speech, even if the discretion and power are never actually abused.\" Lakewood, 486 U.S. at 757. Thus, even those employees who receive permission to speak will be inclined to engage in selfcensorship, ultimately to the detriment of the public in the form of a banal and lifeless discourse on issues of public concern.\n\nThe under and overinclusiveness of the Act shows the \"obvious lack of `fit' between the government's purported interest and the sweep of its restrictions.\" Sanjour, 56 F.3d at 95. The lack of fit between the Act's broad restrictions and the interests the Act allegedly was intended to serve \"cast[s] serious doubt,\" see id., on the Commonwealth's claim that employees' access to sexually explicit material has a \"necessary impact on the actual operation of the Government.\" NTEU, 513 U.S. at 468 (internal quotation omitted). Consequently, the Act does not survive the heightened scrutiny applied to statutory restrictions on employee speech.\n\nIII.\n\nFor the foregoing reasons, I would affirm the judgment of the district court.\n\n\u003cspan class=\"fn\"\u003e1. Appellees named George Allen, then Governor of Virginia, as defendant. Subsequently, James S. Gilmore, III was elected Governor and was substituted as a party.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Another provision of the Act defines \"agency\" and \"information infrastructure\": \"Agency\" means any agency, authority, board, department, division, commission, institution, institution of higher education, bureau, or like governmental entity of the Commonwealth, except the Department of State Police. \"Information infrastructure\" means telecommunications, cable, and computer networks and includes the Internet, the World Wide Web, Usenet, bulletin board systems, online systems, and telephone networks. Va. Code Ann. § 2.1-804 (emphasis omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 18.2-390 provides in pertinent part: (2) \"Nudity\" means a state of undress so as to expose the human male or female genitals, pubic area or buttocks with less than a full opaque covering, or the showing of the female breast with less than a fully opaque covering of any portion thereof below the top of the nipple, or the depiction of covered or uncovered male genitals in a discernibly turgid state. (3) \"Sexual conduct\" means actual or explicitly simulated acts of masturbation, homosexuality, sexual intercourse, or physical contact in an act of apparent sexual stimulation or gratification with a persons clothed or unclothed genitals, pubic area, buttocks or, if such be female, breast. (4) \"Sexual excitement\" means the condition of human male or female genitals when in a state of sexual stimulation or arousal. (5) \"Sadomasochistic abuse\" means actual or explicitly simulated flagellation or torture by or upon a person who is nude or clad in undergarments, a mask or bizarre costume, or the condition of being fettered, bound or otherwise physically restrained on the part of one so clothed. Va. Code Ann. § 18.2-390(2) to -390(5) (Michie 1996) (emphasis omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In June 1997, a machine shop supervisor in the Physics Department at the College of William and Mary requested approval under the Act to research non-work-related issues concerning his disability. An administration official determined that prior approval was not necessary to access such materials.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. When a public employee's speech as a private citizen does not touch upon a matter of public concern, that speech is not \"totally beyond the protection of the First Amendment,\" but \"absent the most unusual circumstances, a federal court is not the appropriate forum in which to review the wisdom of a personnel decision taken by a public agency.\" Connick, 461 U.S. at 147.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In this respect, restrictions on speech by public employees in their capacity as employees are analogous to restrictions on governmentfunded speech. For example, in Rust v. Sullivan, 500 U.S. 173 (1991), the Court rejected an argument that regulations prohibiting abortion counseling in a federally funded project violated the First Amendment rights of the staff of clinics accepting federal funds, reasoning that \"[t]he employees' freedom of expression is limited during the time that they actually work for the project; but this limitation is a consequence of their decision to accept employment in a project, the scope of which is permissibly restricted by the funding authority.\" Rust, 500 U.S. at 199. In both situations--public employee speech and government-funded speech-the government is entitled to control the content of the speech because it has, in a meaningful sense, \"purchased\" the speech at issue through a grant of funding or payment of a salary. The limits of government control are similar in both types of cases, as well: Just as the government as provider of funds cannot dictate the content of speech made outside the confines of the funded program, see id. at 198, the government as employer is restricted in its ability to regulate the speech of its employees when they speak not as public employees, but as private citizens on matters of public concern. The insistence of Judge Wilkinson and Judge Murnaghan that a public employee is entitled to First Amendment protection for speech made in the course of his employment duties creates a fundamental and unnecessary schism between government-employee speech cases and government-funding cases. Under their respective analyses, a public employee would possess a First Amendment right to challenge his employer's directions regarding, for example, the preparation and content of a report, while the same directions issued with respect to a report prepared pursuant to a grant of funding would not be subject to a First Amendment challenge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Judge Wilkinson writes as though he believes that professors possess a special constitutional right of academic freedom not enjoyed by other citizens. However, his statement that he applies the Pickering analysis solely to professors merely because \"the statute's application to academic inquiry\" provides \"a useful illustration,\" post at 42, might indicate that he actually believes that they do not. If one reads his opinion this way, then he could be understood to believe that all public employees, not just professors, have First Amendment interests in speech made in the course of their employment duties--a concession, even if tacit, that completely undermines the arguments and analysis that he undertakes in his opinion. Judge Wilkinson attempts to blunt the force of any such concession by claiming that he is addressing an \"as applied\" challenge by Appellees. See post at 42 n.1. This attempt must fail for the simple reason that none of the Appellees have ever sought permission to access any materials on the Internet pursuant to the terms of the Act. See Lawline v. American Bar Ass'n, 956 F.2d 1378, 1386 (7th Cir. 1992) (holding that an \"as applied\" challenge was improper when the provision had not yet been applied to the plaintiffs); National Commodity \u0026 Barter Ass'n v. United States, 951 F.2d 1172, 1175 (10th Cir. 1991) (same). Moreover, the text of Judge Wilkinson's concurrence--which addresses the constitutionality of the statute as a whole, rather than with respect to any particular application--makes clear that he is in fact responding to Appellees' facial challenge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. For ease of reference, we will refer to public institutions of higher learning generally as \"universities.\" This designation includes neither private institutions of higher learning nor public and private primary and secondary schools, as constitutional considerations applicable to such institutions are not pertinent to this appeal. Although we discuss Appellees' argument regarding academic freedom as applying to professors, we note that in their brief Appellees asserted that \"[a]cademic freedom embraces not only professors but [also] the librarians, research assistants, and other staff without whom they cannot effectively function.\" Brief of the Appellees at 22. And, at oral argument Appellees went so far as to suggest that the Act infringes the academic freedom of any state employee who engages in \"intellectual work\" analogous to the work of a professor. Of course, our determination, set forth below, that the Act does not violate any right of academic freedom possessed by university professors obviates the need to consider whether such a right could extend beyond professors. We feel compelled to note, however, the virtually limitless nature of Appellees' suggestion. Research is, by its very nature, an \"intellectual\" pursuit. Thus, any state employee who conducts work-related research on sexually explicit topics on the Internet--i.e., any state employee covered by the Act--arguably would possess a constitutional right of academic freedom. We have little doubt that even the most vigorous proponent of an individual right of academic freedom would not contend that the right extends so far.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Appellees assert that the Act infringes on academic freedom by hindering professors' ability to perform their employment duties, particularly teaching and research. The facts alleged in the complaint illustrate the type of restrictions with which Appellees are primarily concerned. Melvin I. Urofsky, the lead plaintiff in the district court, alleged that he had declined to assign an online research project on indecency law because he feared he would be unable to verify his students' work without violating the Act. Appellee Terry L. Meyers contended that he is affected by the Act because his ability to access Virginia's database to research sexually explicit poetry in connection with his study of Victorian poets is restricted by the policy. Appellee Paul Smith's website has been censored as a result of the Act. And, appellees Dana Heller, Bernard H. Levin, and Brian J. Delaney maintained that they were hesitant to continue their Internet research of various aspects of human sexuality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The AAUP was not concerned with interference from the federal or state governments, which at that time \"largely refrained from any involvement in internal university affairs.\" Byrne, supra, at 273; see Metzger, supra, at 1277-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This freedom from lay interference, however, did not mean that academics were immune from the professional judgments of their peers. See Byrne, supra, at 277-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In view of this history, we do not doubt that, as a matter of professional practice, university professors in fact possess the type of academic freedom asserted by Appellees. Indeed, the claim of an academic institution to status as a \"university\" may fairly be said to depend upon the extent to which its faculty members are allowed to pursue knowledge free of external constraints. See Metzger, supra, at 1279 (explaining that the authors of the 1915 AAUP report believed \"that any academic institution that restrict[ed] the intellectual freedom of its professors . . . cease[d] to be a true university\"). Were it not so, advances in learning surely would be hindered in a manner harmful to the university as an institution and to society at large. However, Appellees fail to appreciate that the wisdom of a given practice as a matter of policy does not give the practice constitutional status. See Minnesota State Bd. for Community Colleges v. Knight, 465 U.S. 271, 288 (1984) (concluding that \"[f]aculty involvement in academic governance has much to recommend it as a matter of academic policy, but it finds no basis in the Constitution\"). Additionally, we note that we are not here called upon to decide the wisdom of the Act as a matter of policy. That an enactment may be utterly unnecessary, or even profoundly unwise, does not affect its validity as a matter of constitutional law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Irrespective of the validity of this claim as a matter of constitutional law, we note that the argument raises the specter of a constitutional right enjoyed by only a limited class of citizens. See David M. Rabban, Functional Analysis of \"Individual\" and \"Institutional\" Academic Freedom Under the First Amendment, 53 Law \u0026 Contemp. Probs. 227, 238 (1990). Indeed, the audacity of Appellees' claim is revealed by its potential impact in this litigation. If Appellees are correct that the First Amendment provides special protection to academic speakers, then a professor would be constitutionally entitled to conduct a research project on sexual fetishes while a state-employed psychologist could constitutionally be precluded from accessing the very same materials. Such a result is manifestly at odds with a constitutional system premised on equality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Justice Frankfurter's reasoning, if controlling, would dictate that we uphold the Act on the basis that it does not infringe the academic freedom of the university. As explained infra note 17, the Act places with the university authority to approve or disapprove access to sexually explicit materials on computers owned or leased by the state. Because the Act does not subject university decisionmaking to outside interference by the state, the Act would pass constitutional muster under Justice Frankfurter's understanding of academic freedom.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Interestingly, several concurring justices criticized the discussion of academic freedom in the majority opinion. Justice Black rejected the discussion altogether: I am . . . not ready to hold that a person hired to teach school children takes with him into the classroom a constitutional right to teach sociological, economic, political, or religious subjects that the school's managers do not want discussed. . . . I question whether it is absolutely certain, as the Court's opinion indicates, that \"academic freedom\" permits a teacher to breach his contractual agreement to teach only the subjects designated by the school authorities who hired him. Id. at 113-14 (Black, J., concurring). Justice Harlan disassociated himself from the discussion, which he found unnecessary and likely to lead to confusion. See id. at 115 (Harlan, J., concurring). Justice Stewart, while not using the term \"academic freedom,\" attempted to limit the right discussed by the majority. See id. at 115-16 (Stewart, J., concurring in the result) (noting that \"[t]he States are most assuredly free to choose their own curriculums for their own schools,\" but rejecting the notion that a State could constitutionally punish a teacher for mentioning the existence of a prohibited subject (internal quotation marks omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Justice Brennan's omission of academic freedom from his majority opinion in Edwards is particularly noteworthy in light of his subsequent dissent in Knight, in which he argued that university faculty possess a constitutional right of academic freedom to participate in institutional policymaking. See Knight, 465 U.S. at 295-300 (Brennan, J., dissenting). Arguably, Justice Brennan believed that while faculty members were constitutionally entitled to participate in curricular decisions, they did not enjoy constitutional protection for rejecting the selected curriculum in favor of their own.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In reaching this conclusion, we note that the Act places the authority to approve or disapprove research projects with the agency, here the university. Thus, the Act leaves decisions concerning subjects of faculty research in the hands of the institution. And, while a denial of an application under the Act based upon a refusal to approve a particular research project might raise genuine questions--perhaps even constitutional ones --concerning the extent of the authority of a university to control the work of its faculty, such questions are not presented here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Our conclusion that the Act does not infringe on protected speech is dispositive of Appellees' claim that the Act is overbroad. See Boos v. Barry, 485 U.S. 312, 331 (1988) (recognizing that a regulation that \"does not reach a substantial amount of constitutionally protected\" speech cannot be overbroad). Further, the Act is not unconstitutionally vague because it gives a \"person of ordinary intelligence a reasonable opportunity to know what is prohibited.\" Grayned v. City of Rockford, 408 U.S. 104, 108 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Elsewhere in his concurrence, when the need is different, Judge Wilkinson presents Boring as a decision chiefly premised not on official imprimatur, but, rather, on the necessity of institutional governance. Post at 51-52; see discussion supra. Boring was no more about institutional governance than it was about official imprimatur. There is not even a hint in our opinion in Boring that we would have viewed a state statute forbidding the teaching of lesbianism any differently than we viewed the high school's forbiddance -- nor, given our reasoning, would one ever expect to find such a suggestion in the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Appellees here are public university professors who raised both facial and as-applied challenges to the statute. To prevail on their facial challenge, plaintiffs \"must establish that no set of circumstances exists under which the Act would be valid.\" Rust v. Sullivan, 500 U.S. 173, 183 (1991) (internal quotation marks omitted). By finding the statute valid as applied to these plaintiffs, the facial challenge fails as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As such, a statute of general applicability differs from individual disputes over hiring, tenure, and promotion, which courts have routinely regarded as matters of personal workplace rather than public concern. See, e.g., Lovelace v. Southeastern Mass. Univ., 793 F.2d 419, 425-26 (1st Cir. 1986); Megill v. Board of Regents of the State of Fla., 541 F.2d 1073, 1085 (5th Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. It should go without saying that I adhere to my vote and views in Boring v. Buncombe County Board of Education, 136 F.3d 364 (4th Cir. 1998) (en banc), see also id. at 371-72 (Wilkinson, C.J., concurring). The distinctions between that case and this one, however, are numerous. Boring involved an individual employment decision pertaining to curriculum at the secondary school level. By contrast, this case involves a broadly applicable statute unrelated to curriculum at the level of higher education. To find that the statute in this case impacts non-curricular speech in colleges and universities and that such speech is a matter of public concern in no way weakens the Boring holding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In his concurring opinion, my brother Luttig thus wrongly asserts that \"Boring, of course, did not rest upon any such notion of official imprimatur.\" Ante at 36. Indeed, courts dealing with the question of First Amendment rights concerning curriculum choices have limited their holdings to curriculum matters in light of the distinctly institutional character of curriculum decisions: \"[A] public university professor does not have a First Amendment right to decide what will be taught in the classroom.\" Edwards v. California Univ. of Pa., 156 F.3d 488, 491 (3d Cir. 1998). \"Although the concept of academic freedom has been recognized in our jurisprudence, the doctrine has never conferred upon teachers the control of public school curricula.\" Kirkland v. Northside Indep. Sch. Dist., 890 F.2d 794, 800 (5th Cir. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The majority's hypothetical involving an assistant district attorney serves further to illustrate the drawbacks of its approach. In focusing once again solely on the form of speech, the majority ignores the different context between its hypothetical and the present case. Assistant district attorneys operate under a chain of supervision and command and their words would be taken to represent the government's position on a given matter. This differs so dramatically from the context of the present speech that it is hard to believe that the majority would even seek to draw a comparison. All this is quite apart from the fact that the majority's assistant district attorney hypothetical represents an individual employment matter that (academic or otherwise) is less likely to involve matters of public concern than a broad statutory restriction on speech.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In any event, to the extent that Boring controls the public concern analysis in the instant case, and I do not agree that it does, I would revisit that holding. Judge Motz persuasively argued in her dissent in Boring why the majority's approach to public employees is at odds with Connick and its progeny.\u003c/span\u003e\n\n",
    "body_length": 151795,
    "citedas": [
      "216 F.3d 401",
      "145 Ed. Law Rep. 582",
      "145 Ed. Law Rep. 582",
      "16 IER Cases 737",
      "16 IER Cases 737"
    ],
    "attorneys": "CounselArgued: William Henry Hurd, Senior Counsel to the Attorney General, OfficeOF The Attorney General, Richmond, Virginia, for Appellant. Marjorie Heins,American Civil Liberties Union Foundation, New York, New York, forAppellees. ON Brief: Mark L. Earley, Attorney General of Virginia, Peter R.Messitt, Senior Assistant Attorney General, Alison Paige Landry, AssistantAttorney General, Rita R. Woltz, Assistant Attorney General, Office OF TheAttorney General, Richmond, Virginia, for Appellant. Ann Beeson, AmericanCivil Liberties Union Foundation, New York, New York; Louis M. Bograd,American Civil Liberties Union Foundation, Washington, D.C.; Michael H.Hammer, Todd G. Hartman, Wilkie, Farr \u0026 Gallagher, Washington, D.C., forAppellees. Jonathan Alger, Donna Euben, American Association OF UniversityProfessors, Washington, D.C.; J. Joshua Wheeler, Robert M. O'Neil, TheThomas Jefferson Center For The Protection OF Free Expression,Charlottesville, Virginia; Edward M. McCoyd, The Authors Guild, New York,New York, for Amici Curiae.",
    "category": [
      "124"
    ],
    "judges": "Wilkinson, Chief Judge, Widener, Murnaghan, Wilkins, Niemeyer,Luttig, Williams, Michael, Motz, Traxler, and King, Circuit Judges, andHamilton, Senior Circuit Judge.",
    "citation_count": 73
  }
}
