{
  "id": "5YjjP2YBTlTomsSBCzU-",
  "document": {
    "title": "Quinn v. Robinson",
    "full_title": "WILLIAM JOSEPH QUINN -APPELLEE, v. GLEN ROBINSON, UNITED STATES MARSHAL FOR THE NORTHERN DISTRICT OF CALIFORNIA -APPELLANT",
    "jurisdiction": "Ninth Circuit",
    "date": "1986-02-18T00:00:00.000Z",
    "docket": "No. 83-2455",
    "body": "Before: DUNIWAY, FLETCHER, and REINHARDT, Circuit Judges\n\nREINHARDT, Circuit Judge:\n\nPursuant to 18 U.S.C. § 3184 (1982) and the governing treaty between the United States and the United Kingdom of Great Britain and Northern Ireland (\"United Kingdom\"), Extradition Treaty of June 8, 1972, United States - United Kingdom, 28 U.S.T. 227, T.I.A.S. No. 8468 [hereinafter cited as Treaty ], the United Kingdom seeks the extradition of William Joseph Quinn, a member of the Irish Republican Army (\"IRA\"), in order to try him for the commission of a murder in 1975 and for conspiring to cause explosions in London in 1974 and 1975. After a United States magistrate found Quinn extraditable, Quinn filed a petition for a writ of habeas corpus. The district court determined that Quinn cannot be extradited because a long-standing principle of international law which has been incorporated in the extradition treaty at issue -- the political offense exception -- bars extradition for the charged offenses. The United States government, on behalf of the United Kingdom, appeals.\n\nThis case requires us to examine the parameters of a foreign sovereign's right to bring about the extradition of an accused who maintains that the offense with which he is charged are of a political character. Ultimately we must determine whether the political offense exception is applicable to the type of violent offenses Quinn is alleged to have committed. We undertake this task with the aid of very little helpful precedent. The United States Supreme Court has discussed the political offense exception only once, and then during the nineteenth century. See Ornelas v. Ruiz, 161 U.S. 502, 40 L. Ed. 787, 16 S. Ct. 689 (1896). The only time we considered the subject, see Karadzole v. Artukovic, 247 F.2d 198 (9th Cir. 1957), the Supreme Court vacated our opinion, see Karadzole v. Artukovic, 355 U.S. 393, 78 S. Ct. 381, 2 L. Ed. 2d 356 (1958) (mem.), an opinion which, in any event, has subsequently been roundly and uniformly criticized, see Eain v. Wilkes, 641 F.2d 504, 522 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981); Garcia-Mora, The Nature of Political Offenses: A Knotty Problem of Extradition Law, 48 Va.L.Rev. 1226, 1246 (1962); Lubet \u0026 Czackes, The Role of the American Judiciary in the Extradition of Political Terrorists, 71 J. Crim L. \u0026 Criminology 193, 205 (1980). Only one circuit has previously considered in any detail how or whether the exception applies when the accused person or persons have engaged in conduct involving the use of some of the more violent techniques or tactics that have come to mark the activities of contemporary insurgent or revolutionary movements. Eain v. Wilkes, 641 F.2d 504 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981). The few opinions of other circuits that have considered the exception shed no light on the difficult questions we must resolve here.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Therefore, we must carefully examine the historic origins of the political offense exception, analyze the various underpinnings of the doctrine, trace its development in the lower courts and elsewhere, and seek to apply whether principles emerge to the realities of today's political struggles.\n\nIn the case before us, we find, for reasons we will explain in full, that the charged offenses are not protected by the political offense exception. We vacate the writ of habeas corpus and remand to the district court. We hold that Quinn may be extradited on the murder charge but that the district court must consider Quinn's remaining defense to the conspiracy charge before extradition is permitted for that offense.*fn*\n\nI. BACKGROUND\n\nA. The Extradition Treaty\n\nThe right of a foreign sovereign to demand and obtain extradition of an accused criminal is created by treaty. Ramos v. Diaz, 179 F. Supp. 459, 460-61 (S.D. Fla. 1959). In the absence of a treaty there is no duty to extradite, see Factor v. Laubenheimer, 290 U.S. 276, 287, 78 L. Ed. 315, 54 S. Ct. 191 (1933); Epps, The Validity of the Political Offender Exception in Extradition Treaties in Anglo-American Jurisprudence, 20 Harv. Int' L.J. 61, 74 (1979); cf. Bassiouni, International Extradition: A Summary of Contemporary American Practice and a Proposed Formula, 15 Wayne L. Rev. 733, 734 (1969) (in Western world, \"extradition is a matter of favor or comity rather than a legal duty\"), and no branch of the United States government has any authority to surrender an accused to a foreign government except as provided for by statute or treaty. Factor v. Laubenheimer, 290 U.S. 276, 287, 78 L. Ed. 315, 54 S. Ct. 191 (1933); Ramos, 179 F.2d at 460-61.\n\nThe extradition treaty between the United States and the United Kingdom provides for the reciprocal extradition of persons found within the territory of one of the nations who have been accused or convicted of certain criminal offenses committed within the jurisdiction of the other nation. Treaty, supra p. 1, at art. I. Murder and conspiracy to cause explosions, the offense with which Quinn has been charged, are extraditable offense under the Treaty. Id. art. III(1), (2).\n\nUnited States citizenship does not bar extradition by the United States. See Charlton v. Kelly, 229 U.S. 447, 467, 57 L. Ed. 1274, 33 S. Ct. 945 (1913); Escobedo v. United States, 623 F.2d 1098, 1104-07 (5th Cir.), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497, 101 S. Ct. 612 (1980). However, under the doctrine of \"dual criminality,\" an accused person can be extradited only if the conduct complained of is considered criminal by the jurisprudence or under the laws of both the requesting and requested nations. Factor, 290 U.S. at 293; Caplan v. Vokes, 649 F.2d 1336, 1343 (9th Cir. 1981); see, e.g., Treaty, supra p. 1, at art. III(1)(a). In addition, there must be evidence that would justify committing the accused for trial under the law of the nation from whom extradition is requested if the offense had been committed within the territory of that nation. Hooker v. Klein, 573 F.2d 1360, 1367 (9th Cir.), cert. denied, 439 U.S. 932, 99 S. Ct. 323, 58 L. Ed. 2d 327 (1978); 18 U.S.C. § 3184 (1982); see, e.g., Treaty, supra p. 1, at art. VII(d). United States courts have interpreted this provision in similar treaties as requiring a showing by the requesting party that there is probable cause to believe that the accused has committed the charged offense. See, e.g., Glucksman v. Henkel, 221 U.S. 508, 512, 55 L. Ed. 830, 31 S. Ct. 704 (1911); United States ex rel. Sakaguchi v. Kaulukukui, 520 F.2d 726, 729-31 (9th Cir. 1975). The doctrine of \"specialty\" prohibits the requesting nation from prosecuting the extradited individual for any offense other than that for which the surrendering state agreed to extradite. United States v. Rauscher, 119 U.S. 407, 420-21, 30 L. Ed. 425, 7 S. Ct. 234 (1886); Caplan v. Vokes, 649 F.2d at 1343; see, e.g., Treaty, supra p. 1, at art. XII.\n\nThe treaty between the United States and the United Kingdom provides certain exceptions to extradition, notwithstanding the existence of probable cause to believe that the accused has committed the charged offense. In particular, the treaty specifies that \"extradition shall not be granted if . . . the offense for which extradition is requested is regarded by the requested party as one of a political character . . . .\" Treaty, supra p. 1, at art. v(1)(c).\n\nB. Factual Background\n\nQuinn, a United States citizen, was arrested on September 30, 1981 in Daly City, California pursuant to a provisional arrest warrant issued by a United States magistrate upon application of the United States acting for and on behalf of the United Kingdom. On November 4, 1981, the United Kingdom formally requested Quinn's extradition to face charges of the murder of Police Constable Stephen Tibble and conspiracy to cause explosions of a nature likely to endanger human life.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe duration of the conspiracy with which Quinn is charged from January 1, 1974 to April 3, 1975, the day before Quinn was arrested for questioning regarding separate 1974 offense of kidnapping and assault. Quinn was, in fact, charged, tried, and convicted at that time in Ireland, in a special court utilized for the trial of political cases, of membership in an outlawed organization -- the IRA. He was imprisoned in Dublin as a \"special category prisoner\" -- a political prisoner incarcerated in a manner akin to prisoner-of-war status -- until January 2, 1976.\n\nThe evidence before the United States magistrate regarding the conspiracy centered around six specific bombing incidents:\n\n1. On January 18, 1974, a hollowed-out copy of the Bible containing a bomb was mailed to and received by Bishop Gerard William Tickle in London. At that time, Bishop Tickle was the Roman Catholic Bishop to the British Armed Forces Quinn's fingerprints were found on the wrapping paper around the bomb, which was defused without causing any harm.\n\n2. On January 30, 1974, a letter bomb was sent to the Surrey, England home of Crown Court Judge John Huxley Buzzard who, at that time, was a senior Treasury Prosecuting Counsel. When Judge Buzzard began to open the package, it partially exploded, lacerating the face, hands, and wrist and causing the loss of the ends of two fingers on his left hand. Quinn's fingerprints were on the wrapping around the bomb.\n\n3. On February 4, 1974, a letter bomb was sent to the offices of Max Aitken, Chairman of the Daily Express Newspaper in London. Aitken's assistant secretary, who partially opened the package, believed it looked suspicious and called a security guard. As the security guard picked up the package, it partially exploded and the officer lost most of the fingers on his left hand. Quinn's fingerprints were found on the book in which the bomb was concealed.\n\n4. On December 20, 1974, a bomb was found in the foyer adjacent to the loading platform at Aldershot Railway Station in Hampshire County, England. The bomb was defused without causing any harm, and the fingerprints of a number of Quinn's alleged co-conspirators were found on the wrapping paper and bomb mechanisms.\n\n5. On December 21, 1974, a bomb was discovered in an attache case in the archway entrance to the Kings Arms Public House in Warminster, England. The bomb was defused and the fingerprints of Gilhooley, a fugitive who was not indicted as a co-conspirator, were found on its timing mechanism.\n\n6. On January 27, 1975, a bomb was found in a black bag on the front step on the Charco-Burger Grill on Heath Street in London. The bomb was defused and Quinn's fingerprints were found on the Irish newspaper that had been used to wrap the bomb.\n\nSearches of two flats in the London area conducted during this time period revealed explosives, detonators, fuses, and diagrams of bomb construction. Fingerprints matching those of Quinn, his alleged co-conspirators, and Gilhooley were each found on at least one item at each location.\n\nThe murder with which Quinn is charged took place on February 26, 1975. On that day, Police Constables Adrian Blackledge and Leslie White were patrolling the West Kensington area of London on foot, looking for burglary suspects. Blackledge saw a man engaged in \"suspicious\" behavior, such as looking around and changing directions. Blackledge lost sight of the man but later, while White was on a lunch break, saw the suspect reappear from one of a number of houses on Fairholme Road. Blackledge approached the man while he waited at a bus stop, identified himself as a police officer, and asked the man where he had been. The suspect was unable to give Blackledge the address of the house he had emerged from and gave his name as William Rogers. The suspect said he would take Blackledge to the home he had visited, began to walk away, then ran.\n\nA chase ensued, and other plainclothes police officers, including Temporary Detective Constable Derek Hugh Wilson, joined in. Police Constable Stephen Tibble, who was on a motorcycle dressed in civilian clothes, caught up to the suspect, got off his motorcycle, and assumed a crouched position. The suspect shot Tibble three times and ran, evading the other officers. Tibble died that afternoon.\n\nBlackledge described the suspect as 25-30 years old, with straight, short, light brown hair of about collar length, a heavy build, a slightly tanned complexion, and a \"mellow\" Irish accent. Wilson estimated the suspect's height at five feet ten inches. He offered a description of the suspect that differed in only two respects from Blackledge's. Wilson described the suspect as slimly built, and said he had dark brown hair. Quinn speaks with an American accent but has been reputed to have assumed an Irish accent on occasion. He normally has a pale complexion. He has a slim build and dark brown hair.\n\nOn December 12, 1975, British police arrested Quinn's alleged co-conspirators after a six-day siege with hostages in a flat in London. In the flat they discovered, among other things, a revolver. Bullets fired from this revolver revealed rifling characteristics similar to those on the bullets recovered from Tibble's body.\n\nQuinn's alleged co-conspirators became known as the \"Balcombe Street Four\" during their trial under the British Prevention of Terrorism Act on charged stemming from their activity as members of an Active Service Unit (\"ASU\") of the Provisional Irish Republican Army (\"PIRA\"), a more violent offshoot of the IRA. ASUs are small groups of PIRA members who conducted a series of violent actions in England, including bombings designed to pressure the British government into negotiating independence for Northern Ireland. Quinn's alleged co-conspirators were tried in a special criminal court in London utilized only for prosecution of \"political cases,\" and the prosecution at their trial argued that the motive in setting the bombs was purely political.\n\nOn May 14, 1975, Constable Blackledge was taken to the Special Criminal Court in Dublin, where Quinn was appearing on the charge of being a member of the IRA. Blackledge pointed Quinn out to Rollo Watts of the Special Branch of New Scotland Yard and identified Quinn as the man who had shot Tibble. On October 8, 1981, Watts was shown a photograph of Quinn taken in San Francisco on September 30, 1981, at the time of Quinn's arrest by the FBI. Watts identified Quinn as the man that Blackledge had identified in Ireland six years earlier.\n\nC. Decisions Under Review\n\nAfter the United Kingdom formally requested Quinn's extradition, a United States Magistrate conducted preliminary proceedings and a hearing to determine extradictability pursuant to 18 U.S.C. § 3184 (1982). Quinn contended that the conspiracy charge was time barred, that the evidence was insufficient to establish probable cause to believe he had committed the alleged crimes, and that all the offenses for which the United Kingdom seeks his extradition are \"offenses of a political character\" upon which extradition cannot be based. At the hearing, Quinn introduced evidence regarding activities of the IRA and the PIRA in Northern Ireland and in England that were designed to cause the overthrow of British rule in Northern Ireland. Quinn did not testify at the hearing or otherwise offer any evidence of his own motivation for his alleged participation in the charged crimes.\n\nOn September 29, 1982, the magistrate rejected Quinn's defenses and issued a Certification of Extraditibility and Order of Committment of the Secretary of State. The magistrate held that in order to qualify for the protection afforded by the political offense exception, Quinn had to show three elements: that there was a violent political uprising, that he was a member of the uprising group, and that the crimes were committed in furtherance of the uprising. The magistrate concluded that there was a violent political uprising in the United Kingdom at the time of the alleged crimes sufficient to bring into play the political offense exception. However, he found that Quinn had not proved the other two elements of a political offense.\n\nAccording to the magistrate, Quinn's evidence of his membership in the IRA was of little weight since he had failed to demonstrate that he was a member of the PIRA or of the Active Service Unit that allegedly conducted the bombings. The magistrate also determined that Quinn failed to show that the charged crimes were \"in furtherance of\" PIRA political goals. According to the magistrate, because the ASUs often acted without guidance from superiors, their targets may have been chosen for personal reasons -- such as spite or revenge -- rather than out of political motivations. Second, the magistrate determined that the bombings could not be \"in furtherance\" of the uprising because there was no evidence that any hierarchy within the PIRA had considered their potential effectiveness in promoting the group's political goals. Third, relying in part on Eain v. Wilkes, 641 F.2d 504 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981), the magistrate found that the bombings failed to meet the \"direct link\" test because they were directed at civilians rather than the government the IRA was attempting to displace and they did not take place in Northern Ireland. Quinn contended that the murder of Officer Tibble was a political offense because it was motivated by the killer's fear that, if captured, he would be questioned and forced to reveal information about PIRA activities. The magistrate rejected this argument as well, finding that the murder was motivated by a simple desire to escape capture.\n\nQuinn filed a Petition for Writ of Habeas Corpus commanding Glen E. Robinson, the United States Marshal, to release him.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The district court did not address all of Quinn's arguments\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e because it determined that the offenses for which extradition is being sought are non-extraditable political offenses.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn granting Quinn's petition, the district court identified three legal errors in the magistrate's analysis and found that the magistrate erred in its factual findings regarding Quinn's membership in the PIRA and the killer's motive for the Tibble murder. First, the district court held that the magistrate was wrong in requiring Quinn to show, as a separate element, membership in an uprising group. Second, the district court concluded that the magistrate erred in imposing a requirement that the acts potentially be politically efficacious or directed by a hierarchy within the PIRA in order to meet the requirement of being \"incidental to\" the uprising. Third, the court disagreed with the magistrate's application of Eain to this case, noting that the motive of the petitioner in Eain, a member of the Palestinian Liberation Organization (\"PLO\"), in bombing civilians was to drive them out of Israel. Here, in contrast, the court found that the motive was to influence the British government in its relationship with the PIRA and Northern Ireland and that the potential harm to civilians was merely a consequence of the activities designed to influence the government. As to the Tibble murder, the district court determined that he magistrate erred in finding no political motive. Although it agreed that the killing was the result of an effort to avoid immediate capture, the court said that it was incidental to the uprising because Quinn was trying to avoid a capture that could lead to the discovery of the bomb factory.\n\nII. JURISDICTION TO CONSIDER THE POLITICAL OFFENSE EXCEPTION\n\nAs it has in other recent extradition cases, see, e.g., In re Mackin, 668 F.2d 122 (2d Cir. 1981); Eain v. Wilkes, 641 F.2d 504 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981), the government contends that both the magistrate and the district court lacked jurisdiction to determine whether the political offense exception bars extradition. According to the government, the language of both the jurisdictional statute and the treaty precludes a judicial determination of whether the exception applies. Moreover, the government contends, such a determination involves political questions that only the executive branch of the government can resolve. Like every court before us that has considered these arguments, see, e.g., Mackin, 668 F.2d at 135-37; Eain, 641 F.2d at 512-18; In re Ezeta, 62 F. 972, 996-97 (N.D. Cal. 1894), and like those that have not explicitly considered them but have proceeding to determine whether the exception applies, see, e.g., Ornelas v. Ruiz, 161 U.S. 502, 510-12, 40 L. Ed. 787, 16 S. Ct. 689 (1896); In re Doherty, 599 F. Supp. 270 (S.D.N.Y. 1984), we believe the government's contentions to be meritless.\n\nA. The Language of the Statute and the Treaty\n\nThe government contends that the jurisdictional statute, 18 U.S.C. § 3184, fails to authorize the magistrate to determine whether the political offense exception applies and that the treaty explicitly contemplates an executive branch resolution of the question. According to the government, section 3184's command that the magistrate consider whether \"the evidence [is] sufficient to sustain the charge under the provisions of the proper treaty\" authorizes the magistrate to determine only whether there is probable cause to believe the accused committed the offense. The government further notes that the treaty calls for the \"requested party\" to determine if it regards the offense as one of a political character. See Treaty, supra p. 1, at art. V(1)(c)(ii). According to the government, the term \"requested party\" refers to the Secretary of State, not the judiciary.\n\nThe government's construction of both the statute and the treaty is in error. The \"requested party\" language has been used in treaties since at least the turn of the century, see Mackin, 668 F.2d at 132-33 (citing treaties), and has consistently been interpreted to refer to the country, not any particular branch of its government. The language does not undermine the well-established responsibility of the extradition magistrate -- and the judiciary on habeas review -- to determine whether the charged offense is or is not extraditable. Id.; Caplan v. Vokes, 649 F.2d 1336, 1342-44 (9th Cir. 1981); Eain, 641 F.2d at 517-18. The determination whether a crime is extraditable \"under the provisions of the treaty\" includes consideration of whether the crime is nonextraditable because it falls within the political offense exception. See Ezeta, 62 F. 972 at 996-97. We fail to see how the magistrate could determine whether there is probable cause that the defendant committed an extraditable crime without determining whether the charged offense is one for which extradition is prohibited. Nor can we conclude in the absence of explicit language that Congress, in enacting 18 U.S.C. § 3184, intended to restrict the ability of the judiciary to carry out its role in protecting the liberty interests of individuals by requiring us to review extradition orders without considering all aspects of the pertinent question -- whether there is probable cause to believe that the accused committed an extraditable offense.\n\nB. The Political Question Doctrine\n\nThe government next argues that because three of the factors enumerated in Baker v. Carr, 369 U.S. 186, 217, 7 L. Ed. 2d 663, 82 S. Ct. 691 (1962), are present in this case, the judiciary should abstain, under the political question doctrine, from determining whether the political offense exception applies. The government contends that determining whether the exception applies requires a policy determination of a kind clearly inappropriate for the exercise of judicial discretion, that different pronouncements from the executive and judiciary on matters necessary to a determination of the applicability of the exception could embarrass the government, and that the issue does not lend itself to resolution through judicially discoverable manageable standards. Other circuit courts have considered and rejected the precise arguments advanced by the government in this case. See Mackin, 668 F.2d at 132-37; Eain, 641 F.2d at 513-18; cf. Tel-Oren v. Libyan Arab Republic, 233 U.S. App. D.C. 384, 726 F.2d 774, 796-98 (D.C. Cir. 1984) (Edwards, J., concurring) (political question doctrine is a very limited basis for nonjusticiability and does not bar review of a tort claim for damages consequent to terrorist activities), cert. denied, 470 U.S. 1003, 105 S. Ct. 1354, 84 L. Ed. 2d 377 (1985). But see id. at 826 (Robb, J., concurring) (\"[T]here is simply 'no justiciable standard to the political offense.'\") (quoting Extradition Reform Act of 1981: Hearings on H.R. 5227 Before the Subcommittee on Crime of the House Committee on the Judiciary, 97th Cong., 2d Sess. 24-25 (testimony of Roger Olson, Deputy Assistant Attorney General, Criminal Division, U.S. Department of Justice)). Like these courts, we recognize the executive branch's interest in matters that touch on foreign policy. However, as did Judge Friendly in Mackin, 668 F.2d at 134, we also recognize the individual liberty concerns at stake in cases of this nature and note the Supreme Court's long accepted conclusion that \"extradition without an unbiased hearing before an independent judiciary . . . [is] highly dangerous to liberty, and ought never to be allowed in this country.\" In re Kaine, 55 U.S. (14 How.) 103, 112, 14 L. Ed. 345 (1852).\n\nIn identifying the specific Baker v. Carr factors that it claims are present in this case, the government begins by noting that in order to consider whether the political offense exception applies, a court must determine whether a political uprising was in progress in the foreign land when the offense occurred. See infra p. 41. The government contends that such a factual finding requires a policy determination. We disagree. We need not determine whether the uprising was \"justified\" or was motivated by political forces of which we approve.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Rather, we must determine simply whether an uprising was in progress. \"The existence of a violent political uprising in an issue of past fact: either there was demonstrable, violent activity tied to political causes or there was not.\" Eain, 641 F.2d at 514. Furthermore, like the Seventh Circuit, we believe that even if unique, sensitive information that is available to the State Department bears on this factual issue, there are adequate mechanisms -- such as in camera disclosure -- for ensuring that the material can be produced for judicial consideration. See id. at 514-15.\n\nThe government also contends that the presence of a second factor enumerated in Baker v. Carr counsels judicial abstention. The government argues that a judicial determination that Quinn's extradition is precluded by the political offense exception would \"recognize\" political terrorists and would thus constitute a potentially embarrassing pronouncement different than the pronouncements of the executive branch. Like the Seventh Circuit, see Eain, 641 F.2d at 515, we do not believe the executive branch has refused to recognize the existence of terrorists. Rather, in some cases, it may have refused to recognize the legitimacy of these groups. We fail to see why a judicial acknowledgment that terrorist groups exist would constitute a \"recognition\" of those groups in the sense of legitimizing their actions. Cf. Tel-Oren, 726 F.2d at 822 (Bork, J., concurring) (noting that judicial acknowledgment of effect of PLO on the foreign relations of the United States does not grant the PLO any form of \"official recognition\" and is similar to the executive branch's commenting on the subject of the PLO while continuing to maintain that the group is not deserving of recognition).\n\nFar from embarrassing the executive branch, assigning to the judiciary the responsibility for determining when the exception applies actually affords a degree of protection to the executive branch. As a political branch, the executive could face undue pressure when public and international opposition to the activities of an unpopular group create conflicts with the treaty obligation created by the political offense exception. See Epps, supra p. 4, at 84 (\"[T]he requesting state is much more likely to be irate if a court deems the fugitive extraditable but the executive reverses that decision.\"); Cf. Eain, 641 F.2d at 513 (assignment of this determination to judiciary allows executive branch to avoid risk to political and economic sanctions that could result from discretionary executive refusal to extradite) (quoting Lubet \u0026 Czackes, supra, p. 3, at 200; citing I.A. Shearer, Extradition in International Law 192 (1971); Note, Bringing the Terrorist to Justice: A Domestic Law Approach, 11 Cornell Int'l L.J. 71, 74 (1978)). By assigning the initial determination of when the exception applies to the impartial judiciary -- particularly life-tenured Article III judges -- Congress has substantially lessened the risk that majoritarian consensus of favor due or not due to the country seeking extradition will interfere with individual liberty. See C. Van den Wijngaert, The Political Offense Exception to Extradition 100 (1980) (\"Administrative decisions with respect to extradition are much more likely to be influenced by political elements than the decisions of the courts.\"). The treaty's assignment to the judiciary of the task of determining the applicability of the political offense exception \"reflects a congressional judgment that that decision not be made on the basis of what may be the current view of any one political administration.\" In re Doherty, 599 F. Supp. 270, 277 n.6 (S.D.N.Y. 1984).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nNor does the assignment to the judiciary of the initial determination of the applicability of the political offense exception deprive the executive branch of all discretion to determine that a person claiming the protection of that exception should not be extradited. The executive branch has the ultimate authority to decide whether to extradite the accused after a judicial determination that the individual is, in fact, extraditable. Eain, 641 F.2d at 516 (citing In re Ezeta, 62 F. 972 (N.D. Cal. 1894); 18 U.S.C. § 3186 (1982). Although the Secretary of State's authority to refuse extradition is presumably constrained by our treaty obligations, the contours of executive branch discretion in this area have never been expressly delineated. Bassiouni, supra p. 4, at 756 ([\"T]he statute should probably be interpreted to grant the Secretary only limited discretion to differ from the courts in the matter of treaty interpretation. In fact, the Secretary has always based his refusal to surrender upon a determination that the treaty did not require extradition in that instance . . . . [T]he Secretary apparently considers his discretion only coextensive with the issues presentable at the extradition proceedings . . . [and] has refused surrender infrequently (only twice between 1940 and 1960) . . . .\"). Nevertheless, it is clear that the Secretary of State has sole discretion to determine whether a request for extradition should be denied because it is a subterfuge made for the purpose of punishing the accused for a political crime, see In re Lincoln, 228 F. 70 (E.D.N.Y. 1915), aff'd, 241 U.S. 651, 36 S. Ct. 721, 60 L. Ed. 1222 (1916) (per curiam), or to refuse extradition on humanitarian grounds because of the procedures or treatment that await a surrendered fugitive, Arnbjornsdottir-Mendler v. United States, 721 F.2d 679, 683 (9th Cir. 1983); Escobedo v. United States, 623 F.2d 1098, 1105 (5th Cir.), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497, 101 S. Ct. 612 (1980); 18 U.S.C. § 3186 (1982).\n\nFinally, the government points out the difficulty of defining which offenses are a political character. It suggests that this difficulty demonstrates an absence of judicially discoverable manageable standards, another factor that, according to Baker v. Carr, counsels for judicial abstention. As in many areas of the law, and as we discuss further in the remainder of this opinion, there has always been debate about the precise contours of the political offense exception. But the absence of perfect predictive ability in discerning whether a given act falls within the exception is not synonymous with an absence of manageable standards. Rather, as with other complex legal problems, the basic standards that guide us in deciding whether the exception applies are refined on a case-by-case basis as new situations arise. The determination whether there was a violent political disturbance in the requesting country at the time of the alleged acts and whether the acts were incidental to the disturbance, see infra pp. 62-72, are mixed questions of law and fact, see Ornelas v. Ruiz, 161 U.S. 502, 509, 40 L. Ed. 787, 16 S. Ct. 689 (1896), that do not require a political judgment. See Eain, 641 F.2d at 516. We fail to see how the judicial construction of 18 U.S.C. § 3184 and the applicable treaty, and the application of these laws to the facts of a given case, differs from all other judicial decisionmaking.\n\nAs the Supreme Court noted in Baker v. Carr, \"it is error to suppose that every case or controversy which touches foreign relations lies beyond judicial cognizance.\" 369 U.S. at 211.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The magistrate properly considered the applicability of the political offense exception to the offense charged against Quinn, and we as well have a responsibility to construe the treaty and to determine whether \"it provides the answer.\" Id. at 212.\n\nIII. STANDARD OF REVIEW\n\nA. District Court Review of The Magistrate's Order\n\nThe scope of the district court's review of a magistrate's extradition order on a petition for writ of habeas corpus is limited to \"whether the magistrate had jurisdiction, whether the offense [sic] charged is within the treaty and, by a somewhat liberal extension, whether there was any evidence warranting the finding that there was reasonable ground to believe the accused guilty.\" Fernandez v. Phillips, 268 U.S. 311, 312, 69 L. Ed. 970, 45 S. Ct. 541 (1925); accord Zanazanian v. United States, 729 F.2d 624, 626 (9th Cir. 1984). Preliminary, the magistrate must determine, and the court must review whether the extradition treaty was in effect and applicable to the case and whether the person named in the complaint is the individual before the magistrate. See Ivancevic v. Artukovic, 211 F.2d 565 (9th Cir.), cert. denied, 348 U.S. 818, 75 S. Ct. 28, 99 L. Ed.645 (1954). As discussed supra Section II., the political offense question is reviewable on habeas corpus as part of the question of whether the offense charged is within the treaty. See Eain, 641 F.2d at 513-18.\n\nThe question whether the offense comes within the treaty ordinarily involves a determination of whether it is listed as an extraditable crime and whether the conduct is illegal in both countries, Factor v. Laubenheimer, 290 U.S. 276, 78 L. Ed. 315, 54 S. Ct. 191 (1933); see supra p. 5; these are purely legal questions that the habeas court may review de novo. Kamrin v. United States, 725 F.2d 1225 (9th Cir. 1984); Cucuzzella v. Keliikoa, 638 F.2d 105 (9th Cir. 1981). Purely factual questions in extradition cases are reviewed under the clearly erroneous standard. See, e.g., Caplan v. Vokes, 649 F.2d 1336, 1342 (9th Cir. 1981) (finding that accused was a fugitive reviewed under clearly erroneous standard). The magistrate's probable cause determination \"serve[s] only the narrow function of indicating those items of submitted evidence on which the decision to certify extradition is based.\" Caplan v. Vokes, 649 F.2d at 1342 n.10. Because the magistrate's probable cause finding is thus not a finding of fact \"in the sense that the court has weighed the evidence and resolved disputed factual issues,\" id., it must be upheld if there is any competent evidence in the record to support it. See Fernandez, 268 U.S. at 312; Zanazanian, 729 F.2d at 626; Valencia v. Limbs, 655 F.2d 195, 197 (9th Cir. 1981).\n\nThe political offense issue, in contrast to the determinations discussed above, is a mixed question of law and fact. See Ornelas v. Ruiz, 161 U.S. at 509. Accordingly, the district court must review the magistrate's determination on this issue in the same manner that an appellate court reviews a district court's findings on mixed fact and law questions. Review of the application of law to fact depends on whether the determination is \"essentially factual\" -- in which case it is reviewed under the clearly erroneous standard, United States v. McConney, 728 F.2d 1195, 1203 (9th Cir.) (en banc), cert. denied, 469 U.S. 824, 105 S. Ct. 101, 83 L. Ed. 2d 46 (1984) -- or whether it requires the court to consider \"legal concepts in the mix of fact and law and to exercise judgment about values that animate legal principles\" -- in which case the issue is reviewed de novo, id. at 1199-1204. Accordingly, a district court must review the magistrate's purely factual findings underlying the application of the political offense exception under the clearly erroneous standard, while the mixed determinations at issue -- such as the question whether the crime was incidental to a political uprising -- must be reviewed de novo.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nB. Appellate Review of the District Court's Decision\n\nAs discussed supra Section I.B., the district court disagreed with some of the magistrate's factual findings and legal determinations, as well as its ultimate conclusion on the mixed questions of whether the charged crimes were political offense. There is no question that we review the legal questions and mixed questions de novo. McConney, 728 F.2d at 1199-1204. Quinn contends, however, that we should uphold the district court's factual findings unless they are clearly erroneous, while the government urges us to defer to the factual findings made by the magistrate unless they are clearly erroneous. In support of his argument, Quinn contends that Hooker v. Klein, 573 F.2d 1360 (9th Cir.), cert. denied, 439 U.S. 932, 99 S. Ct. 323, 58 L. Ed. 2d 327 (1978), requires us to focus on \"the findings of fact and conclusions of law made by the district court in granting or denying habeas relief.\" See id. at 1368. In that case, however, the habeas court affirmed the extradition court\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e without making specific findings. We focused on the findings of the court that had ordered extradition, which were adopted by the district court that heard the petition for writ of habeas corpus. See also Caplan v. Vokes, 649 F.2d 1336 (9th Cir. 1981) (clearly erroneous standard applied to factual findings of district court that had both ordered extradition and denied petition for habeas corpus).\n\nIt would make little sense for us to ignore the factual findings of the judicial tribunal that made the initial factual determinations and defer, instead, to the differing factual finding made by a similar tribunal that merely reviewed the record of the earlier proceedings and held no evidentiary hearing of its own. Rather, we must determine whether the habeas court erred, as a matter of law, in overruling the magistrate's factual findings. Accordingly, we will defer to the extradition tribunal's factual findings unless we agree with the district court that they are clearly erroneous.\n\nIV. THE DEVELOPMENT OF THE POLITICAL OFFENSE EXCEPTION\n\nA. Origin of the Exception\n\nThe first-known extradition treaty was negotiated between an Egyptian Pharoah and a Hittite King in the Thirteenth Century B.C. See I.A. Shearer, supra p. 22, at 5. However, the concept of political offense as an exception to extradition is a rather recent development. In the centuries after the first known extradition treaty, and throughout the Middle Ages, extradition treaties were used primarily to return political offenders, rather than the perpetrators of common crimes, to the nations seeking to try them for criminal acts. See I.A. Shearer, supra p. 22, at 166; Recent Decisions, The Political Offense Exception to Extradition: A 19th Century British Standard in 20th Century American Courts, 59 Notre Dame L. Rev. 1005, 1008 (1984) [hereinafter cited as 20th Century American Courts ]. It was not until the early nineteenth century that the political offense exception, now almost universally accepted in extradition law, was incorporated into treaties.\n\nThe French and American revolutions had a significant impact on the development of the concept of justified political resistance, see Declaration des droits de l'homme et du Citoyen du 26 about 1789, art. 2 (Fr.), incorporated as La preamble de la Constitution de 1791 (Fr.), reprinted in Les Constitutions de la France Depuis 1789, at 33, 33 (S. Godechot ed. 1970) (declaring as an inalienable right \"la resistance a l'oppression\"); La Constitution de 1793, art. 120 (Fr.), reprinted in Les Constitutions de la France Depuis 1789, supra, at 79, 91 (France \"donne asile aux etrangers bannis de leur patrie pour la cause de la liberte.\"); The Declaration of Independence para. 1 (U.S. 1776) (\"Whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it . . . .\"), as did the political philosophers of the time, see J. Locke, The Second Treatise of Civil Government ch. XIX (T. Cook ed. 1947); J.S. Mill, On Liberty and Considerations on Representative Government (R. McCallum ed. 1948). In 1834, France introduced the political offense exception into its treaties, see I.A. Shearer, supra p. 22, at 166-67, and by the 1850's it had become a general principle of international law incorporated in the extradition treaties of Belgium, England, and the United States as well. See C. Van den Wijngaert, supra p. 22, at 5-14; Epps, supra p. 4, at 62-63.\n\nThe political offense exception is premised on a number of justifications. First, its historical development suggests that it is grounded in a brief that individuals have a \"right to resort to political activism to foster political change.\" Note, American Courts and Modern Terrorism: The Politics of Extradition, 13 N.Y.U.J. Int'l L. \u0026 Pol. 617, 622 (1981) [hereinafter cited as Politics of Extradition ]; see also In re Doherty, 599 F. Supp. 270, 275 n.4 (S.D.N.Y 1984) (\"The concept was first enunciated during an era when there was much concern for and sympathy in England for the cause of liberation for subjugated peoples.\") (citation omitted). This justification is consistent with the modern consensus that political crimes have greater legitimacy than common crimes. Politics of Extradition, supra p. 31, at 623. Second, the exception reflects a concern that individuals -- particularly unsuccessful rebels -- should not be returned to countries where they may be subjected to unfair trials and punishments because of their political opinions. See M. Bassiouni, International Extradition and World Public Order 425 (1974); C. Van den Wijngaert, supra p. 22, at 3; Garcia-Mora, supra p. 3, at 1226, 1238. Third, the exception comports with the notion that governments -- and certainly their nonpolitical branches -- should not intervene in the internal political struggles of other nations. See C. Van den Wijngaert, supra p. 22, at 3, 158, 204; Politics of Extradition, supra p. 31, at 622.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nB. Comparative Legal Standards\n\nNone of the political offense provisions in treaties includes a definition of the word \"political.\" I.A. Shearer, supra p. 22, at 168. Thus, the term \"political offense\" has received various interpretations by courts since the mid-nineteenth century. Garcia-Mora, supra, p. 3 at 1230-31; Wise, Book Review, 30 Am. J. Comp. L. 362, 363 (1982) (reviewing C. Van den Wijngaert, The political Offense Exception to Extradition (1980)); cf. M. Bassiouni, supra p. 32, at 371-72 (inability to define precisely the term \"political offense\" promotes a necessary flexibility of the concept). Not every offense that is politically motivated falls within the exception. Instead, courts have devised various tests to identify those offenses that comport with the justifications for the exception and that, accordingly, are not extraditable.\n\nWithin the confusion about definitions it is fairly well accepted that there are two distinct categories of political offenses: \"pure political offenses\" and \"relative political offense.\" See Karadzole v. Artukovic, 247 F.2d 198, 203 (9th Cir. 1957), vacated, 355 U.S. 393, 2 L. Ed. 2d 356, 78 S. Ct. 381 (1958) (mem.); see generally Garcia-Mora, supra p. 3, at 1230; 20th Century American Courts, supra p. 30, at 1009. Pure political offense are acts aimed directly at the government, see Lubet \u0026 Czackes, supra p. 3, at 200, and have none of the elements of ordinary crimes, Garcia-Mora, supra p. 3, at 1230. These offenses, which include treason, sedition, and espionage, Garcia-Mora, supra p. 3, at 1234; Lubet \u0026 Czackes, supra p. 3, at 200, do not violate the private rights of individuals, Garcia-Mora, supra p. 3, at 1237. Because they are frequently specifically excluded from the list of extraditable crimes given in a treaty, see 20th Century American Courts, supra p. 30, at 1009, courts seldom deal with whether these offenses are extraditable, see id., and it is generally agreed that they are not, see Lubet \u0026 Czackes, supra p. 3, at 200 (citing In re Ezeta, 62 F. 972 (1894)).\n\nThe definitional problems focus around the second category of political offense -- the relative political offenses. These include \"otherwise common crimes committed in connection with a political act,\" Lubet \u0026 Czackes, supra p. 3, at 200, or \"common crimes . . . committed for political motives or in a political context,\" 20th Century American Courts, supra p. 30, at 1009. Courts have developed various tests for ascertaining whether \"the nexus between the crime and the political act is sufficiently close . . . [for the crime to be deemed] not extraditable.\" Lubet \u0026 Czackes, supra p. 3, at 200. The judicial approaches can be grouped into three distinct categories: (1) the French \"objective\" test; (2) the Swiss \"proportionality\" or \"predominance\" test; and (3) the Anglo-American \"incidence\" test. See generally Carbonneau, The Political Offense Exception to Extradition and Transnational Terrorists: Old Doctrine Reformulated and New Norms Created, 1 Assoc. of Student Int'l L. Societies Int'l L.J. 1, 11-31 (1977); Garcia-Mora, supra p. 3, at 1239-56; 20th Century American Courts, supra p. 30, at 1009-17. More recent developments allow for further distinctions between the British test and the test employed in the United States. See generally Lubet \u0026 Czackes, supra p. 3, at 201-10.\n\nThe early French test, most clearly represented in In re Giovanni Gatti, [1947] Ann. Dig. 145 (No. 70) (France, Ct. App. of Grenoble), considered an offense non-extraditable only if it directly injured the rights of the state. See 20th Century American Courts, supra p. 30, at 1010. Applying this rigid formula, French courts refused to consider the motives of the accused. Garcia-Mora, supra p. 3, at 1249-50. The test primarily protects only pure political offense, see id. at 1235-36 (discussing cases), and is useless in attempts to define whether an otherwise common crime should not be extraditable because it is connected with a political act, motive, or context. Id. at 1252. Because politically motivated and directed acts may injure private as well as state rights, the objective test fails to satisfy the various purposes of the political offense exception. Politics of Extradition, supra p. 31, at 629-30. Nevertheless, this test has one benefit: because it is so limited, it is not subject to abuse; perpetrators of common crimes will not be protected because of alleged political motivations. Id. at 630; Garcia-Mora, supra p. 3, at 1251.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn contrast to the traditional French test, Swiss courts apply a test that protects both pure and relative political offenses. The Swiss test examines the political motivation of the offender, see Garcia-Mora, supra p. 3, at 1251, but also requires (a) a consideration of the circumstances surrounding the commission of the crime, see Carbonneau, supra p. 34, at 23-26, and (b) either a proportionality between the means and the political ends, see 20th Century American Courts, supra p. 30, at 1010-11, or a predominance of the political elements, see Garcia-Mora, supra p. 3, at 1254.\n\nAt least one commentator has suggested that the first condition of the Swiss test is a requirement of a direct connection between the crime and the political goal -- a condition that essentially requires the presence of a political movement. See Garcia-Mora, supra, p. 3, at 1253 (citing Swiss cases). Others point out that the Swiss cases). Others point out that the early Swiss requirement that a crime be incident to a political movement has been explicitly rejected in later cases. See, e.g., Carbonneau, supra p. 34, at 26-28 (citing Swiss cases). More recent Swiss cases concentrate less on the accused's motive, relying instead almost entirely on an ends-means test under which potentially motivated conduct is protected by the exception only if the danger created by the conduct is proportionate to the objectives, i.e., if the means employed are the only means of accomplishing the end and the interests at stake are sufficiently important to justify the danger and harm to others. See Carbonneau, supra p. 34, at 28-29 (citing Swiss cases).\n\nThe comprehensiveness and flexibility of the \"predominance\" or \"proportionality\" test allows it to be conformed to changing realities of a modern world. See Garcia-Mora, supra p. 3, at 1255. But because the relative value of the ends and the necessity of using the chosen means must be considered, the criteria applied by Swiss courts incorporate highly subjective and partisan political considerations within the balancing test. See C. Van den Wijngaert, supra p. 22, at 158; Politics of Extradition, supra p. 31, at 631.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The test explicitly requires an evaluation of the importance of the interests at stake, the desirability of political change, and the acceptability of the means used to achieve the ends. The infusion of ideological factors in the determination which offense are non-extraditable threatens both the humanitarian objectives underlying the exception and the concern about foreign nonintervention in domestic political struggles. Moreover, it severely undermines the notion that such determinations can be made by an apolitical, unbiased judiciary concerned primarily with individual liberty. See supra pp. 20-22.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe \"incidence\" test that is used to define a non-extraditable political offense in the United States and Great Britain was first set forth by the Divisional Court in In re Castioni, [1891] 1 Q.B. 149 (1890). In that case, the Swiss government requested that Great Britain extradite a Swiss citizen who, with a group of other angry citizens, had stormed the palace gates and killed a government official in the process. Id. at 150-51. Castioni did not know the victim or have a personal grudge against him. The habeas court considered:\n\n[Whether, upon the facts, it is clear that the man was acting as one of a number of persons engaged in acts of violence of a political character with a political object, and as part of the political movement and [up]rising in which he was taking part.\n\nId. at 159 (per Denman, J.). The court denied extradition, finding that Castioni's actions were \"incidental to and formed a part of political disturbances,\" id. at 166 (per Hawkins, J.), and holding that common crimes committed \"in the course\" and \"in the furtherance\" of a political disturbance would be treated as political offenses, id. at 156 (per Denman, J.).\n\nAlthough both the United States and Great Britain rely explicitly on Castioni, each has developed its own version of the incidence test. British courts proceeded first to narrow the exception in 1894. In In re Meunier, [1894] 2 Q.B. 415, the court extradited a French anarchist charged with bombing a cafe and military barracks, id. at 415, concluding that anarchist action is not incident to a two-party struggle for political power, id. at 419 (per Cave, J.). The court held that the political offense exception protects those who seek to substitute one form of government for another, not those whose actions disrupt the social order and whose \"efforts are directed primarily against the body of citizens.\" Id.\n\nThe rigid \"two-party struggle\" requirement of the British incidence test has not survived. More recently, British courts have taken other factors into account, noting that political offenses must be considered \"according to the circumstances existing at the time.\" Regina v. Governor of Brixton Prison (ex parte Kolczynski), [1955] 1 Q.B. 540, 549 (1954) (per Cassels, J.). In Kolczynski, a British court refused to extradite Polish soldiers who were at risk of being punished for treason although the Polish government officially sought their extradition for common crimes. See id. at 543, 545. No political uprising existed at the time the crimes were committed. Id. at 544. Instead of a distinct uprising, the new British incidence test requires some \"political opposition . . .between fugitive and requesting State,\" Schtraks v. Government of Israel, [1964] A.C. 556, 591 (1962) (per Viscount Radcliffe), and incorporates an examination of the motives of the accused and the requesting country in those situations in which the offense is not part of an uprising, see Lubet \u0026 Czackes, supra p. 3, at 202-03.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nC. Original Formulation of the United States Incidence Test\n\nThe United States, in contrast to Great Britain, has adhered more closely to the Castioni test in determining whether conduct is protected by the potential offense exception. The seminal United States case in this area is In re Ezeta, 62 F. 972 (N.D. Cal. 1894), in which the Salvadoran government requested the extradition of a number of individuals accused of murder and robbery. The fugitives maintained that the crimes had been committed while they unsuccessfully attempted to thwart a revolution. See id. at 995. Extradition was denied because the acts were \"committed during the progress of actual hostilities between contending forces,\" id. at 997, and were \"closely identified\" with the uprising \"in an unsuccessful effort to suppress it,\" id. at 1002. However, an alleged act that occurred four months prior to the start of armed violence was held not to be protected by the incidence test despite the accused's contention that El Salvador's extradition request was politically motivated. Id. at 986.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nAs we noted at the outset, the Supreme Court has addressed the political offense issue only once. In Ornelas v. Ruiz, 161 U.S. 502, 40 L. Ed. 787, 16 S. Ct. 689 (1896), Mexico sought the extradition of an individual for murder, arson, robbery and kidnapping committed in a Mexican border town, at or about the time revolutionary activity was in progress. Id. at 510. The Court allowed extradition on the basis that the basis that the habeas court had applied an improper, non-deferential standard of review to the extradition court's findings. Id. at 511-12. It continued by listing four factors pertinent to the potential offense inquiry in the case: (1) the character of the foray; (2) the mode of attack; (3) the persons killed or captured; and (4) the kind of property taken or destroyed. Id. at 511. It found that although the raid (in December 1892) may have been contemporaneous with a revolutionary movement (in 1891), it was not of a political character because it was essentially unrelated to the uprising. The Court noted that the purported political aspects of the crimes were negated \"by the fact that immediately after this occurrence, though no superior armed force of the Mexican government was in the vicinity to hinder their advance into the country, the bandits withdrew with their booty across the river into Texas.\" Id.\n\nSince Ornelas, lower American courts have continued to apply the the incidence test set forth in Castioni and Ezeta with its two-fold requirement: (1) the occurrence of an uprising or other violent political disturbance\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e at the time of the charged offense, see, e.g., Garcia-Guillern v. United States, 450 F.2d 1189, 1192 (5th Cir. 1971), cert. denied, 405 U.S. 989, 92 S. Ct. 1251, 31 L. Ed. 2d 455 (1972); Ramos v. Diaz, 179 F. Supp. 459, 462 (S.D. Fla. 1959), n.18 [Footnote omitted] and (2) a charged offense that is \"incidental to\" \"in the course of,\" or \"in furtherance of\" the uprising, see, e.g., Eain, 641 F.2d at 518; Sindona v. Grant, 619 F.2d 167, 173 (2d Cir. 1980); Garcia-Gullern, 450 F.2d at 1192. While the American view that an uprising must exist is more restrictive than the modern British view and while we, unlike the British, remain hesitant to consider the motives of the accused or the requesting state, see Lubet \u0026 Czackes, supra p. 3, at 203, 205, American courts have been rather liberal in their construction of the requirement that the act be \"incidental to\" an uprising, see Garcia-Mora, supra p. 3, at 1244.\n\nThe American approach has been criticized as being \"both underinclusive and overinclusive,\" see Lubet \u0026 Czackes, supra p.3, at 203, and as \"yield[ing] anomalous . . . results,\" see 20th Century American Courts, supra p. 30, at 1013-14. Although these criticisms have some merit, neither flaw in the American incidence test is serious. Some commentators have suggested that the test is underinclusive because it exempts from judicially guaranteed protection all offenses that are not contemporaneous with an uprising even though the acts may represent legitimate political resistance. See, e.g., Lubet \u0026 Czackes, supra p. 3, at 203-04. For example, the attempted kidnapping of a Cuban consul, allegedly for the purpose of ransoming the consul for political prisoners held in Cuba, was held by a court not to be a political offense because the act was not \"committed in the course of and incidental to a violent political disturbance.\" Escobedo v. United States, 623 F.2d 1098, 1104 (5th Cir.), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497 101 S. Ct. 612 (1980).\n\nThere are several responses to the charges of underinclusiveness. First, in their critiques, the commentators fail to give sufficient weight to the existence of a number of ameliorative safeguards. For example, review of certifications of extradition by the Secretary of State, see supra pp. 23-24, serves partially to remedy any underinclusiveness problem. If a court finds the accused extraditable, the Secretary has, at the very least, broad discretion to review the available record and conduct a de novo examination of the issues and, if necessary, to consider matters outside the record in determining whether to extradite. See Lubet \u0026 Czackes, supra p. 3, at 199. The potential underinclusiveness dangers of the uprising requirement are also mitigated by the fact that purely political offenses are never extraditable. See id. at 206; supra pp. 33-34. Additionally, because of the rule of dual criminality, see supra p. 5, individuals accused of offenses that constitute protected activity under the First Amendment will not be extradited. See Lubet \u0026 Czackes, supra p. 3, at 206. Second, it is questionable whether the incidence test is, in fact, underinclusive. While it does not protect all politically motivated offense, it protects those acts that are related to a collective attempt to abolish or alter the government -- the form of political offense that the exception was initially designed to protect, see supra pp. 31-32. Third, any effort to protect all crimes that are in some way politically motivated would either require the abandonment of the objective test for determining which offenses fall within the exception -- in our view a most undesirable result -- or would result in the protection of innumerable crimes that fall far outside the original purposes underlying the exception.\n\nA number of commentators suggest, on the other hand, that the American test is overbroad because it makes non-extraditable some offenses that are not of a political character merely because the crimes took place contemporaneously with an uprising. See Garcia-Mora, supra p. 3, at 1246; Lubet \u0026 Czackes, supra p. 3, at 205; Politics of Extradition, supra p. 31, at 628. We think these commentators misunderstand the test. They all cite Karadzole v. Artukovic, 247 F.2d 198 (9th Cir. 1957) -- \"one of the most roundly criticized cases in the history of American extradition jurisprudence,\" Eain v. Wilkes, 641 F.2d 504, 522 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981) -- to support their argument.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In Artukovic, the Yugoslavian government sought the extradition of a former Minister of the Interior of the puppet Croatian government which took over a portion of Yugoslavia following the German invasion in April 1941. Artukovic was charged with directing the murder of hundreds of thousands of civilians in concentration camps between April 1941 and October 1942. Prior to a hearing by an extradition magistrate, the district court granted habeas relief, concluding that the charged offenses were non-extraditable political offenses. Artukovic v. Boyle, 140 F. Supp. 245, 246 (S.D. Cal. 1956). We affirmed, applying the Castioni language and noting that the offenses occurred during the German invasion of Yugoslavia and subsequent establishment of Croatia. Karadzole v. Artukovic, 247 F.2d 198, 202-04 (9th Cir. 1957). We considered but were unpersuaded by the argument that because war crimes are so barbaric and atrocious they cannot be considered political crimes, see id. at 204, and that United Nations resolutions called for the extradition of war criminals, see id. at 205.\n\nThe Supreme Court vacated our opinion in a one paragraph per curiam opinion and remanded for an extradition hearing pursuant to 18 U.S.C. § 3184. See 355 U.S. 393, 78 S. Ct. 381, 2 L. Ed. 2d 356 (1958). The Court did not comment on the substantive issues and may well have based its order solely on the fact that the habeas court considered the legal questions involved in Artukovic's extradition before and extradition court had an opportunity to make the preliminary findings mandated by section 3184. See United States v. Artukovic, 170 F. Supp. 383, 393 (S.D. Cal. 1959). In his subsequent decision the magistrate denied extradition on the ground that there was insufficient evidence to establish probable cause of Artukovic's guilt, see id. at 393.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nWe do not believe that Artukovic adequately supports the commentators' suggestion that the incidence test is overinclusive. We think it more likely that the problem lies not in the test itself but in the fact that we erred by applying it in that case.\n\nThe offenses with which Artukovic was charged fall within that very limited category of acts which have been labeled \"crimes against humanity.\" In Artukovic we erroneously assumed that \"crimes against humanity\" was synonymous with \"war crimes,\" and then concluded in a somewhat irrelevant fashion that not all war crimes automatically fall outside the ambit of the political offense exception. See 247 F.2d at 204. Our analysis was less than persuasive. We did not need then, and do not need now, to reach a conclusion about whether all war crimes fall outside the bounds of the exception. Cf. C. Van den Wijngaert, supra p. 22, at 143 (suggesting that, under international law, states remain free to consider war crimes as political offenses). The offenses with which Artukovic was charged were crimes against humanity; it matters not whether or not they were also war crimes; either way, crimes of that magnitude are not protected by the exception.\n\nCrimes against humanity, such as genocide, violate international law\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and constitute an \"abuse of sovereignty\" because, by definition, they are carried out by or with the toleration of authorities of a state.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e While some of the same offenses that violate the laws and customs of war\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e are also crimes against humanity, crimes of the latter sort most notably include \"murder, extermination, enslavement, . . . .or persecutions on political, racial or religious grounds . . .\" of entire racial, ethnic, national or religious groups. The Nurnberg (Nuremberg) Trial, 6 F.R.D. 69, 130 (Int'l Military Tribunal 1946). Various \"inhumane acts . . . . committed after the beginning of [World War II] did not constitute war crimes, [but] . . . constituted crimes against humanity.\" Id. at 131.\n\nWholly aside from the Artukovic court's confusion of \"war crimes\" and \"crimes against humanity,\" we do not believe that the political offense exception, even if meant to protect the acts of representatives of a former government,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e should have been extended to protect those carrying out a governmental policy calling for acts of destruction whose \"nature and scope . . . exceeded human imagination,\" Excerpts from Speech by German President, N.Y. Times, May 9, 1985, at 10, col. 1, 3 (excerpts from Speech to Parliament on May 8, 1985 by President Richard von Weizsacker, as translated by the West German Foreign Ministry) (noting that the Nazi genocide is \"unparalled in history\"). These crimes are simply treated differently and are generally excluded from the protection of many normally applicable rules. See, e.g., The Nurnberg Trial, 6 F.R.D. at 107-11 (individuals accused to these offenses can be tried before international tribunal because offenses violate international law). They are certainly in our view to be excluded from coverage under the political offense exception.\n\nAccordingly, we do not consider the \"underinclusiveness\" and \"overinclusiveness\" problems of the incidence test to have been as severe as has been suggested by some of the commentators. Rather, we believe that the incidence test, when properly applied, has served the purposes and objectives of the political offense exception well. More recently, a number of courts have begun to question whether, in light of changing political practices and realities, when properly applied, has served the purposes and objectives of the political offense exception well. More recently, a number of courts have begun to question whether, in light of changing political practices and realities, we should continue to use the traditional American version of that test. They have suggested that basic modifications may be required and, specifically, that certain types of conduct engaged in by some contemporary insurgent groups, conduct that we in our society find unacceptable, should be excluded from coverage. For the reasons we explain below, we believe that the American test in its present form remains not only workable but desirable; that the most significant problems that concern those advocating changes in the test can be dealt with without making the changes they propose; and that efforts to modify the test along the lines suggested would plunge our judiciary into a political morass and require the type of subjective judgments we have so wisely avoided until now.\n\nD. The Recent Political Offense Cases\n\nRecently, the American judiciary has split almost evenly over whether the traditional American incidence that test should be applied to new methods of political violence in two categories -- domestic revolutionary violence and international terrorism -- or whether fundamental new restrictions should be imposed on the use of the political offense exception.\n\nIn both In re McMullen, No. 3-78-1099 MG (N.D. Cal. May 11, 1979), and In re Mackin, No. 80 Cr. Misc. 1 (S.D.N.Y Aug. 13, 1981), appeal dismissed, 668 F.2d 122 (2d Cir. 1981), extradition magistrates applied the traditional United States incidence test despite expressing serious concern over the nature of the charged offenses. In McMullen, the United Kingdom sought the extradition of a former PIRA member accused of murder in connection with the bombing of a military barracks in England. Finding that McMullen's acts took place during a state of uprising throughout the United Kingdom and were incidental to the potential disturbance, the magistrate denied extradition noting that \"[e]ven though the offense be deplorable and heinous, the criminal actor will be excluded from deportation if the crime is committed under these pre-requisites.\" Slip op. at 3.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The magistrate's formulation of the test for the political offense exception in Mackin was similar.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e In that case, the United Kingdom's request for the extradition of an IRA member accused of murdering a British soldier in Northern Ireland was denied.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIn contrast, although asserting that the existing incident test \"is sufficiently flexible to avoid [the] abuses [noted by commentators],\" 641 F.2d at 519, and while ostensibly applying the traditional test, see id. at 515-16, 518, the Seventh Circuit in Eain v. Wilkes, 641 F.2d 504 (7th Cir.), cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981), superimposed a number of limitations on the exception that had not previously been a part of United States law. Abu Eain, a resident of the occupied West Bank and a member of the PLO, was accused by the State of Israel of setting a bomb that exploded in the Israeli city of Tiberias in 1979, killing two boys and injuring more than thirty other people. A magistrate granted Israel's extradition request, the district court denied habeas corpus relief, and the Seventh Circuit affirmed.\n\nFirst, the Eain court distinguished between conflicts that involved \"on-going, organized battles between contending armies,\" 641 F.2d at 519, and conflicts that involved groups with \"the dispersed nature of the PLO,\" id., noting that in the former case, unlike the latter, a clear distinction can be drawn between the activities of the military forces and individual acts of violence. Second, although acknowledging that motivation is not determinative of the political character of an act, see id. at 520 (citing Lubet \u0026 Czackes, supra p. 3, at 203 n. 102), and characterizing its next requirement as that of a \"direct link\" between the offense and the conflict, id. at 521, the court examined the motivation for and political legitimacy of the act. The court appears to have concluded that, according to the evidence presented, the PLO's objectives were not politically legitimate: the PLO sought changes in \"the Israeli political structure as an incident of the expulsion of a certain population from the country,\" id. at 520, and its activities were therefore more properly characterized as aimed at Israel's \"social structure\" rather than its \"political structure,\" id. Third, the court held simply that regardless what the political objective is, \"the indiscriminate bombing of a civilian population is not recognized as a protected political act.\" Id. at 521.\n\nThus, the Seventh Circuit in Eain redefined an \"uprising\" as a struggle between organized, non-dispersed military forces; made a policy determination regarding the legitimacy of given political objectives;\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and excluded violent acts against innocent civilians\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e from the protection afforded by the exception. Cf. Note, Terrorist Extradition and the Political Offense Exception: An Administrative Solution, 21 Va. J. Int'l L. 163, 177-78 (1980) (criticizing Eain magistrate's test because it invites ideological and foreign policy determinations by extradition courts). As part of its justification for the new limitations it imposed on the applicability of the exception, the Eain court expressed concern that, in the absence of these restrictions,\n\nnothing would prevent an influx of terrorists seeking a safe haven in America . . . . Terrorists who have committed barbarous acts elsewhere would be able to flee to the United States and live in our neighborhoods and walk our streets forever free from any accountability for their acts. We do not need them in our society . . . .[T]he political offense exception . . . should be applied with great care lest our country, become a social jungle . . . .\n\nId. at 520.\n\nThe District Court for the Southern District of New York has recently rejected portions of the Eain analysis but accepted some of the new restrictions propounded by the Seventh Circuit. In In re Doherty, 599 F. Supp. 270 (S.D.N.Y. 1984), the court denied the United Kingdom's request that a PIRA member accused of attacking a convoy of British soldiers in Northern Ireland be extradited. The extradition court rejected the notion that the exception protects only \"actual armed insurrections or more traditional and overt military hostilities.\" Id. at 275. Noting that \"political struggles have been . . . effectively carried out by armed guerillas,\" id., the court concluded that a dissident group's likelihood of success and its ability to effect changes by other than violent means were not determinative factors. Id. Nevertheless, the court agreed with the Seventh Circuit's tacit conclusion that the traditional incidence test is \"hardly consistent with . . .the realities of the modern world,\" id. at 274.\n\nThe Doherty court continued by approving of the Eain court's willingness to balance policy considerations so that the exception \"does not afford a haven for persons who commit the most heinous atrocities for political ends.\" Id. at 275 n.4. Although such issues were not raised in Doherty, the court stated explicitly that the exception would not protect bombings in public places, id. at 275; acts that \"transcend the limits of international law,\" id.; acts \"inconsistent with intentional standards of civilized conduct,\" id. at 274; harm to hostages, id. at 276; violations of the Geneva convention, id.; or the acts of \"amorphous\" or \"fantastic\" groups without structure, organization, or clearly defined political objectives, id. Thus, the Doherty court, like the Eain court, concluded that the traditional incidence test is insufficient to determine which offenses are protected by the exception. Both courts felt it necessary and appropriate to judge the political legitimacy of various ends and means and to exclude \"illegitimate\" acts from protection even if the incidence test were met. While not identifying their new limitations as such, both incorporated significant aspects of the Swiss ends-means or proportionality test into Anglo-American jurisprudence.\n\nV. THE POLITICAL OFFENSE EXCEPTION AND THE REALITIES OF CONTEMPORARY POLITICAL STRUGGLES\n\nA. The Political Reality: The Contours of Contemporary Revolutionary Activity\n\nThe recent lack of consensus among United States courts confronted with requests for the extradition of those accused of violent political acts committed outside the context of an organized military conflict reflects some confusion about the purposes underlying the political offense exception. See supra pp. 31-32. The premise of the analysis performed by modern courts favoring the adoption of new restrictions on the use of the exception is either that the objectives of revolutionary violence undertaken by dispersed forces and directed at civilians are by definition, not political, see, e.g., Eain, 641 F.2d at 519 (\"Terrorist activity seeks to promote social chaos.\"), or that, regardless of the actors' objectives, the conduct is not politically legitimate because it \"is inconsistent with intentional standards of civilized conduct,\" Doherty, 599 F. Supp. at 274. Both assumptions are subject to debate.\n\nA number of courts appear tacitly to accept a suggestion by some commentators that begins with the observation that the political offense exception can be traced to the rise of democratic governments. See I.A. Shearer, supra p. 22, at 166; C. Van den Wijngaert, supra p. 22, at 100; Carbonneau, supra p. 34, at 5. Because of this origin, these commentators argue, the exception was only designed to protect the right to rebel against tyrannical governments, see e.g., Epps, supra p. 4, at 65, and should not be applied in an ideologically neutral fashion, see, e.g., Carbonneau, supra p. 34, at 44; see also In re Gonzalez, 217 F. Supp. 717, 721 n.9 (S.D.N.Y. 1963) (evaluating whether acts in question \"were blows struck in the cause of freedom against a repressive totalitarian regime\"). But see C. Van den Wijngaert, supra p. 22, at 102 (noting that democratic states may also suppress political conduct in the guise of criminalty).\n\nThese courts then proceed to apply the exception in a non-neutral fashion but, in doing so, focus on and explicitly reject only the tactics, rather than the true object of their concern, the political objectives. See C. Van den Wijngaert, supra p. 22, at 102. The courts that are narrowing the applicability of the exception in this manner appear to be moving beyond the role of an impartial judiciary by determining tacitly that particular political objectives are not \"legitimate.\"\n\nWe strongly believe that courts should not undertake such a task. The political offense test traditionally articulated by American courts, as well as the text of the treaty provisions, see, e.g., Treaty, supra p. 1, at art. V(1)(c), is ideologically neutral. We do not believe it appropriate to make qualitative judgments regarding a foreign government or a struggle designed to alter that government. Accord In re Doherty, 599 F. Supp. 270, 277 (S.D.N.Y. 1984); see generally supra note 6. Such judgments themselves cannot be other than political and, as such, involve determinations of the sort that are not within the judicial role. See supra Section II.B.\n\nA second premise may underlie the analyses of courts that appear to favor narrowing the exception, namely, that modern revolutionary tactics which include violence directed at civilians are not politically \"legitimate.\" This assumption, which may well constitute an understandable response to the recent rise of international terrorism, skews any political offense analysis because of an inherent conceptual shortcoming. In deciding what tactics are acceptable, we seek to impose on other nations and cultures our own traditional notions of how internal political struggles should be conducted.\n\nThe structure of societies and governments, the relationships between nations and their citizens, and the modes of altering political structures have changed dramatically since our courts first adopted the Castioni test. Neither wars not revolutions are conducted in as clear-cut or mannerly a fashion as they once were. Both the nature of the acts committed in struggles for self-determination, see M. Bassiouni, International Extradition: United States Law \u0026 Practice, ch. VIII, at §§ 2-71 to 2-72, and the geographic location of those struggles have changed considerably since the time of the French and American revolutions. Now challenges by insurgent movements to the existing order take place most frequently in Third World countries rather than in Europe or North America. In contrast to the organized, clearly identifiable, armed forces of past revolutions, today's struggles are often carried out by networks of individuals joined only by a common interest in opposing those in power.\n\nIt is understandable that Americans are offended by the tactics used by many of those seeking to change their governments. Often these tactics are employed by persons who do not share out cultural and social values or mores. Sometimes they are employed by those whose views of the nature, importance, or relevance of individual human life differ radically from ours. Nevertheless, it is not our place to impose our notions of civilized strife on people who are seeking to overthrow the regimes in control of their countries in contexts and circumstances that we have not experienced, and with which we can identify only with the greatest difficulty. It is the fact that the insurgents are seeking to change their governments that makes the political offense exception applicable, not their reasons for wishing to do so or the nature of the acts by which they hope to accomplish that goal.\n\nPolitically motivated violence, carried out by dispersed forces and directed at private sector institutions, structures, or civilians, is often undertaken -- like the more organized, better disciplined violence of proceeding revolutions -- as part of an effort to gain the right to self-government. See Politics of Extradition, supra p. 31, at 632-33. We believe the tactics that are used in such internal political struggles are simply irrelevant to the question whether the political offense exception is applicable.\n\nB. Relationship Between the Justifications for the Exception, the Incidence Test, and Contemporary Political Realities\n\nOne of the principal reasons our courts have had difficulty with the concept of affording certain contemporary revolutionary tactics the protection of the political offense exception is our fear and loathing of international terrorism. See, e.g., Eain, 641 F.2d at 520. The desire to exclude international terrorist from the coverage of the political offense exception is a legitimate one; the United States unequivocally condemns all international terrorism.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e However, the restrictions that some courts have adopted in order to remove terrorist activities from coverage under the political offense exception are overbroad. As we have noted, not all politically-motivated violence undertaken by dispersed forces and directed at civilians is international terrorism and not all such activity should be exempted from the protection afforded by the exception.\n\nAlthough it was not accepted as international law, the position of the United States, not only on international terrorism but also on the extradition of international terrorists, was made clear in 1972 when it introduced its Draft Convention on Terrorism in the United Nations. See U.N. Draft Convention for the Prevention and Punishment of Certain Acts of International Terrorism: United States Working Paper, U.N. Doc. A/C.6/L.850 (September 25, 1972), reprinted in 1 R. Friedlander, Terrorism: Documents of International and Local Control 487 (1979). The Draft Convention calls either for trial of international terrorists in the State where found or for their extradition. See id. at art. 3; see also 1984 Act to Combat International Terrorism § 201, Pub. L. 98-533, 96 Stat. 2706, 2709 (to be codified at 18 U.S.C. § 3077) (reaffirming United States position on the extradition of intentional terrorists).\n\nThe policy and legal considerations that underlie our responses to acts of international terrorism differ dramatically from those that form the basis for our attitudes toward violent acts committed as a part of other nations' internal political struggles. The application of the political offense exception of acts of domestic political violence comports in every respect with both the original justifications for the exception and the traditional requirements of the incidence test.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The application of that exception to acts of international terrorism would comport with neither. First, we doubt whether the designers of the exception contemplated that it would protect acts of international violence, regardless of the ultimate objective of the actions. Second, in cases of international terrorism, we are being asked to return the accused to the government in the country where the acts were committed: frequently that is not a government the accused has sought to change. In such cases there is less risk that the accused will be subjected to an unfair trial or punishment because of his political opinion.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Third, the exception was designed, in part, to protect against foreign intervention internal struggles for political self-determination. When we extradite an individual accused of international terrorism, we are not interfering with any internal struggle; rather, it is the international terrorist who has interfered with the rights of others to exist peacefully under their chosen form of government.\n\nThere is no need to create a new mechanism for defining \"political offense\" in order to ensure that the two important objectives we have been considering are met: (a) that international terrorists will be subject to extradition, and (b) that the exception will continue to cover the type of domestic revolutionary conduct that inspired its creation in the first place. While the precedent that guides us is limited, the applicable principles of law are clear. The incidence test has served us well and requires no significant modification. The growing problem of international terrorism, serious as it is, does not compel us to reconsider or redefine that test. The test we have used since the 1800's simply does not cover acts of international terrorism.\n\n1. The \"Incidence\" Test\n\nAs all of the various tests for determining whether an offense is extraditable make clear, not every offense of a political character is non-extraditable. In the United States, an offense must meet the incidence test which is intended, like the test designed by other nations, to comport with the justifications for the exception. We now explain the reasons for our conclusion that the traditional United States incidence test by its terms (a) protects acts of domestic violence in connection with a struggle for political self-determination, but (b) was not intended to and does not protect acts of international terrorism.\n\n2. The \"Uprising\" Component\n\nThe incidence test has two components -- the \"uprising\" requirement and the \"incidental to\" requirement. The first compotent, the requirement that there be an \"uprising,\" \"rebellion,\" or \"revolution,\" has not been the subject of much discussion in the literature, although it is firmly established in the case law, see supra note 1. Most analyses of whether the exception applied have focused on whether the act in question was in furtherance of or incidental to a given uprising. Nevertheless, it is the \"uprising\" component that plays the key role in ensuring that the incidence test protects only those activities that the political offense doctrine was designed to protect.\n\nAs we have noted, the political offense doctrine developed out of a concern for the welfare of those engaged in a particular form of political activity -- an effort to alter or abolish the government that controls their lives -- and not out of a desire to protect all politically motivated violence. See In re Ezeta, 62 F. 972, 998 (N.D. Cal. 1894) (\"'Any offense committed in the course of or furthering of civil war, insurrection, or political commotion.'\") (quoting John Stuart Mill); In re Castioni, [1891] 1 Q.B. 149, 156 (1890) (\"a sort of overt act in the course of acting in a political matter, a political rising, or a dispute between two parties in the State as to which is to have the government in its hands\") (per Denman, J.).\n\nThe uprising component serves to limit the exception to its historic purposes. It makes the exception applicable only when a certain level of violence exists and when those engaged in that violence are seeking to accomplish a particular objective. The exception does not apply to political acts that involve less fundamental efforts to accomplish change or that do not attract sufficient adherents to create the requisite amount of turmoil. See Escobedo v. United States, 623 F.2d 1098 (5th Cir.), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497 101 S. Ct. 612 (1980). Thus, acts such as skyjacking (an act that has never been used by revolutionaries to bring about a change in the composition or structure of the government in their own country) fall outside the scope of the exception.\n\nEqually important, the uprising component serves to exclude from coverage under the exception criminal conduct that occurs outside the country or territory in which the uprising is taking place. The term \"uprising\" refers to a revolt by indigenous people against their own government or an occupying power. That revolt can occur only within the country or territory in which those rising up reside. By definition acts occurring in other lands are not part of the uprising. The political offense exception was designed to protect those engaged in internal or domestic struggles over the form or composition of their own government, including, of course, struggles to displace an occupying power. It was not designed to protect international political coercion or blackmail, or the exportation of violence and strife to other locations -- even to the homeland of an oppressor nation. Thus, an uprising is not only limited temporally, it is limited spatially. See 20th Century American Courts, supra p. 30, at 1021 n. 115.\n\nIn his concurring opinion, Judge Duniway points out that the limitation to acts occurring within the territory in which there is an uprising means that persons committing acts of piracy, terrorism, or other crimes on high seas will be unable to invoke the protection of the political offense exception. His observation is correct. Just as skyjackers and other international terrorists are not protected under the exception, neither are persons who commit or threaten to commit violent crimes on high seas. The political offense exception was never intended to reach such conduct.\n\nWhile determining the proper geographic boundaries of an \"uprising\" involves a legal issue that ordinarily will be fairly simple to resolve, there may be some circumstances under which it will be more difficult to do so. We need not formulate a general rule that will be applicable to all situations. It is sufficient in this case to state that for purposes of the political offense exception an \"uprising\" cannot extend beyond the borders of the country or territory in which a group of citizens or residents is seeking to change their particular government or governmental structure.\n\nIt follows from what we have said that an \"uprising\" can exist only when the turmoil that warrants that characterization is created by nationals of the land in which the disturbances are occurring. Viewed in that light, it becomes clear that had the traditional incidence test been applied in Eain, discussed supra pp. 50-52, the result would have been identical to that reached by the Seventh Circuit. When PLO members enter Israel and commit unlawful acts, there is simply no uprising for the acts to be incidental to. The plain fact is that the Israelis are not engaged in revolutionary activity directed against their own government. They are not seeking to change its form, structure, or composition through violent means. That the PLO members who commit crimes are seeking to destroy Israel as a state does not help bring them within the political offense exception. In the absence of an uprising, the violence engaged in by PLO members of Israel and elsewhere does not meet the incidence test and is not covered by the political offense exception. To the contrary, the PLO's worldwide campaign of violence, including the crimes its members commit in the state of Israel, clearly constitutes \"international terrorism.\"\n\nMoreover, Eain's conduct may have fallen outside the political offense exception for an additional, though related, reason. Not only was there no uprising in Israel, but Eain himself was not a national of that country. It is not clear whether, even when the violence is primarily conducted by nationals and thus an uprising may properly be found to exist, a foreign citizen who voluntarily joins the fray is protected by the exception. The exception was designed to protect those seeking to change their own government or to oust an occupying power that is asserting sovereignty over them. We question whether it should apply when the accused is not a citizen of the country or territory in which the uprising is occurring. In the absence of a tangible demonstration that he or she has more than a transitory connection with that land, the acts of a foreign national may simply not qualify for protection.\n\nAlthough we find substantial merit to the argument that foreign nationals should be excluded from coverage under the political offense exception, the incidence test has never previously been analyzed in a manner that considers the question in any detail. Because of the conclusion we reach with respect to other issues in the case before us, there is no need for us to answer the question here. Accordingly, we leave its resolution to a subsequent time. It is enough for our purposes merely to note that the fact that Eain was not an Israeli might well have constituted another basis for holding that his conduct was not protected under the incidence test.\n\nIn short, the Eain and Doherty courts' objective that this country not become a haven for international terrorists can readily be met through a proper application of the incidence test. It is met by interpreting the political offense exception in light of its historic origins and goals. Such a construction excludes acts of international terrorism. There is no reason, therefore, to construe the incidence test in a subjective and judgmental manner that excludes all violent political conduct of which we disapprove. Moreover, any such construction would necessarily exclude some forms of internal revolutionary conduct and thus run contrary to the exception's fundamental purpose.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e For that reason, we reject the Eain test and especially the concept that courts may determine whether particular forms of conduct constitute acceptable means or methods of engaging in an uprising.\n\n3. The \"Incidental to\" Component\n\nWhen the describing the second requirement of the incidence test, the \"incidental to\" component, American courts have used the phrases \"in the course of,\" \"connected to,\" and \"in furtherance of\" interchangeably. We have applied a rather liberal standard when determining whether this part of the test has been met and have been willing to examine all of the circumstances surrounding the commission of the crime. Garcia-Guillern v. United States, 450 F.2d 1189, 1192 (5th Cir. 1971), cert. denied, 405 U.S. 989, 92 S. Ct. 1251, 31 L. Ed. 2d 455 (1972); Ramos v. Diaz, 179 F. Supp. 459, 463 (S.D. Fla. 1959).\n\nCommentators have criticized United States courts for applying the \"incidental to\" component too loosely or flexibly. See supra p. 42. We disagree with this criticism. To put the matter in its proper context, it is necessary to bear in mind that the offense must occur in the context of an \"uprising.\" Acts \"incidental to\" an uprising are, as we have noted, limited by the geographic confines of the uprising. In addition, the act must be contemporaneous with the uprising. Moreover, the \"incidental to\" component is not satisfied by \"any connection, however feeble, between a common crime and a political disturbance,\" Garcia-Mora, supra p. 3, at 1244. The act must be causally or ideologically related to the uprising. See, e.g., Ornelas v. Ruiz, 161 U.S. 502, 511, 40 L. Ed. 787, 16 S. Ct. 689 (1896) (concluding that rapid withdrawal of bandits after foray, in absence of threatening armed forces, suggested that acts were not incidental to uprising).\n\nWe believe the traditional liberal construction of the requirement that there be a nexus between the act and the uprising, see supra p. 42, is appropriate. There are various types of acts that, when committed in the course of an uprising, are likely to have been politically motivated. There is little reason, under such circumstances, to impose a strict nexus standard. Moreover, the application of a strict test would in some instances jeopardize the rights of the accused.\n\nUnder the liberal nexus standard, neither proof of the potential or actual effectiveness of the actions in achieving the group's political ends, In re Castioni, [1891] 1 Q.B. 149, 158-59 (1890) (refusing to consider whether the act was a wise mode of promoting the cause) (per Denman, J.), nor proof of the motive of the accused, Eain, 641 F.2d at 519, or the requesting nation, Garcia-Guillern, 450 F.2d at 1192; Ramos v. Diaz, 179 F. Supp. at 463, is required. Nor is the organization or hierachy of the uprising group or the accused's membership in any such group determinative. See Fain, 641 F.2d at 519.\n\nWhen extradition is sought, the \"offender\" at this stage in the proceedings has ordinarily only been accused, not convicted, of the offense. It would be inconsistent with the rights of the accused to require proof of membership in an uprising group. For example, the accused might be able to show that the acts were incidental to the uprising but might be unable to prove membership because he or she did not commit the offense or was not a member of the group. Furthermore, requiring proof of membership might violate the accused's Fifth Amendment rights both because it might force him to supply circumstantial evidence of guilt of the charged offense and because membership in the group itself might be illegal. Also, we question how one proves membership in an uprising group. Uprising groups often do not have formal organizational structures or document membership. In addition, it is entirely possible to sympathize with, aid, assist, or support a group, help further its objectives and its activities, participate in its projects, or carry on parallel activities of one's own, without becoming a member of the organization. Still, one may be acting in furtherance of an uprising.\n\nOn the other hand, a number of factors, though not necessary to the nexus determination, may play a part in evaluating the circumstances surrounding the commission of the offense. For example, proof of membership in an uprising group may make it more likely that the act was incidental to the uprising. See, e.g., Ramos v. Diaz, 179 F. Supp. at 463; Castioni, 1 Q.B. at 157-59 (per Denman, J.). The similarity of the charged offense to other acts committed by the uprising group, and the degree of the control over the accused's acts by some hierarchy within the group, may give further credence to the claim that the act was incidental to the uprising. And while evidence of the accused's political motivation is not required and is usually unavailable, evidence that an act was \"committed for purely personal reasons such as vengeance or vindictiveness,\" In re Doherty, 599 F. Supp. 270, 277 n.7 (S.D.N.Y. 1984), may serve to rebut any presumption that a nexus exists. The exception is not designed to protect mercenaries or other acting for non-political motives.\n\nUnder the liberal nexus test we have traditionally applied, or even under a strict nexus standard, there is no justification for distinguishing, as Doherty suggests, between attacks on military and civilian targets. The \"incidental to\" component, like the incidence test as a whole, must be applied in an objective, non-judgmental manner. It is for the revolutionaries, not the courts, to determine what tactics may help further their chances of bringing down or changing the government. All that the courts should do is determine whether the conduct is related to or connected with the insurgent activity. It is clear that various \"non-military\" offense, including acts as disparate as stealing food to sustain the combatants, killing to avoid disclosure of strategies, or killing simply to avoid capture, may be incidental to or in furtherance of an uprising. To conclude that attacks on the military are protected by the exception, but that attacks on private sector institutions and civilians are not, ignores the nature and purpose of the test we apply, as well as the realities of contemporary domestic revolutionary struggles. See supra pp. 57-59.\n\nWe should add that the spatial limitations imposed under the \"uprising\" component may not be circumvented by reliance on the \"incidental to\" component. As we said earlier, for the political offense exception to be applicable at all, the crime must have occurred in the country or territory in which the uprising was taking place, not in a different geographic location. See supra pp. 64-65.\n\nVI. THE INCIDENCE TEST APPLIED TO THE CHARGED OFFENSES\n\nA. The Magistrate's Factual Findings and Legal Conclusions\n\nIn disposing of this case, the extradition magistrate first made a legal determination that the incidence test has three prongs, the latter two of which are \"flip sides of the same question\": (a) the existence of an uprising; (b) that the charged offense be in furtherance of that uprising; (c) and that the accused be a member of the uprising group. In evaluating the applicability of the first prong to the instant case, the magistrate made a number of factual findings, a legal determination, and a conclusion based on the mixed fact and law determinations. First, the magistrate found that there was a violent political uprising in Northern Ireland at the time of the commission of the crimes with which Quinn is charged. He also noted that, were his inquiry limited to conditions in London, he would \"find that the severity of the political disturbance [in London] was insufficiently grave to bring into play the political offense exception.\" The magistrate then made a legal determination that because Northern Ireland and London are both constitutionally a part of the United Kingdom, and because offenses committed in both geographic areas are directed against the same sovereign, he must consider the United Kingdom as a whole. Accordingly, he determined that a political uprising existed throughout the United Kingdom.\n\nIn applying the second and third prongs in his test the magistrate made the factual finding that Quinn was a member of a conspiracy involving the Balcombe Street Four, who were convicted on nineteen counts of bombing and shooting attacks, and that the case against the four was based on the theory that they were members of an Active Service Unit. The magistrate concluded, however, that this was an insufficient basis for considering the offenses to be \"in furtherance of\" the uprising. First, the magistrate held that membership in the uprising group is a necessary component of the incidence test, and that Quinn's IRA membership and involvement in an ASU conspiracy were insufficient to establish that he was a member of the PIRA, the group that the magistrate labeled the uprising group in this case. Next, the magistrate held that Quinn had failed to establish that the bombings were in furtherance of the PIRA's political goals (a) because he failed to show that they were ordered by the command within the PIRA hierarchy, (b) because the failed to show that the PIRA considered their efficacy in advancing its objectives; and (c) because he failed to introduce any evidence of his own political motivations. Third, the magistrate adopted the holding the Seventh Circuit in Eain v. Wilkes, and concluded that \"by definition, there can be no direct link between [these bombing directed against innocent civilians] and the political goal of the IRA to force British withdrawal from Northern Ireland, as these actions neither took place in Northern Ireland nor were they directed against the government the IRA was attempting to displace.\"\n\nB. Our Areas of Agreement With the District Court: The \"Incidental To\" Prong\n\nLike the district court, we believe the magistrate reached a number of erroneous legal conclusions. The incidence test has never required that an accused prove his political motivations directly, or establish that the acts were ordered by the leadership of the uprising group or were effective in obtaining the group's objectives. Nor need an accused prove membership in the uprising group; the magistrate's hairsplitting distinction between Quinn's proven IRA membership and his involvement in a conspiracy with ASU members on the one hand, and his failure to prove conclusively PIRA membership on the other makes apparent the logical absurdity of requiring proof of membership in a specific group.\n\nQuinn is accused of having been a member of a conspiracy involving the Balcombe Street Four and he does not challenge the probable cause finding on this charge; his fingerprints were found on the bombs and within the flats where bombs were constructed. Quinn has already been convicted of and has served a prison sentence for his membership in the IRA. There is no evidence that he was involved in the conspiracy for other than political reasons, and his alleged co-conspirators, the Balcombe Street Four, were convicted of politically motivated bombings. Moreover the PIRA's use of bombing campaigns as a political tactic is well-documented. Accepting the magistrate's factual findings, which are not clearly erroneous, and applying the legal standards we have explained above, we think it quite clear that if an uprising, as that term is defined for purposes of the political offense exception, existed at the time the offenses were committed, the bombings were incidental to that uprising.\n\nFurthermore, because various disparate acts may be incidental to an uprising, we agree with the district court's conclusion that the Tibble murder would be incidental to the uprising, although we believe the analysis performed by both the magistrate and the district court is in error with respect to this incident. It does not matter if the killer's motivation in killing Officer Tibble was to conceal a bomb factory or to avoid capture. A murder of a police officer is related to an uprising whether the reason for the act is to avoid discovery of munitions or to avoid reduction of \"forces\" by capture. Regardless which of these goals motivated the killer, if an uprising existed at the time, this offense as well was incidental to it.\n\nC. Our Area of Disagreement With the District Court: The \"Uprising\" Prong\n\nWith regard to the uprising prong of the incidence test, we must again review the magistrate's factual findings under the clearly erroneous standard and his legal conclusions de novo. The district court failed to do this, construing the magistrate's conclusion that there was an uprising throughout the United Kingdom solely as a finding of fact. The district court summarized the magistrate's factual findings as to the levels of violence that existed in Northern Ireland and elsewhere in the United Kingdom at the time Quinn allegedly committed the charged offenses, and properly adopted them. However, the district court failed to analyze the magistrate's legal conclusion that because the requisite level of violence existed in Northern Ireland and because Northern Ireland is \"in a constitutional sense\" a part of the United Kingdom, an uprising existed in the United Kingdom as a whole.\n\nThe magistrate traced the history of the constitutional relationship between Ireland and England, the Irish nationalist movement in opposition to British rule in Northern Ireland, and the history of violent political disturbances concomitant with the struggle to liberate Northern Ireland from British rule. During the 1700's, economic and political differences between the Catholics in the south of the one, unified, colonized country of Ireland and the Protestants in the north grew, and in 1800 Ireland's parliament was dissolved and the country became a part of the United Kingdom. Many Catholics continued to demand liberty through the period in the late 1800's when \"home rule\" -- under which Ireland would have remained a part of the United Kingdom but with local control of domestic affairs -- was contemplated. In 1914 the British Parliament passed a bill instituting home rule but it was not implemented because of the outbreak of World War I.\n\nAfter increased violence between Irish rebels -- including the IRA -- and British forces broke out in 1919, the British Parliament passed the Government of Ireland Act in 1920. That Act divided Ireland into two partially self-governing countries. Most of Ireland's political leaders initially rejected proposed division, demanding complete independence for all of Ireland. Eventually partition was accepted and in 1921 southern leaders and Great Britain signed a treaty creating the Irish Free State in the south (which became the independent Republic of Ireland in 1949) and Northern Ireland in the north. Under the treaty, Northern Ireland separated from Great Britain. Although it remained a part of the United Kingdom with representation in the British Parliament, it had its own governor, parliament, prime minister, and cabinet and controlled most domestic matters independently. Certain powers, such as levying income taxes and maintaining a militia, were reserved for the British Parliament. The Ulster Unionist Party, the Protestant party, retained control of the parliament in Northern Ireland and Catholics were excluded from political power and subjected to civil discrimination.\n\nIRA-organized violence, with the objective of separating Northern Ireland from the United Kingdom and reuniting the northern and southern parts of Ireland, continued in Northern Ireland. In 1969, the PIRA split off from the IRA, which adopted the view that violence was not the best means to achieve its goals at that time. The PIRA advocated armed insurrection and after one campaign of violence in 1969, British troops were sent into Northern Ireland. PIRA bombing campaigns continued between 1970 and 1972. In 1971, the British passed the Special Powers Act, which provided for internment without trial. In 1972, the British dissolved the Parliament of Northern Ireland and once again established direct rule. PIRA bombings continued through 1973, when the Special Powers Act was replaced by the Emergency Provisions Act. The Emergency Provisions Act abolished jury trials for certain offenses, relaxed standards of admissibility for confessions, and provided special tribunals for the trials of those accused of political crimes.\n\nThe PIRA was responsible for a number of bombing campaigns again in 1974 and 1975. These campaigns were designed to \"bomb the British government to the bargaining table\" and to force the withdrawal of British troops from Northern Ireland. The PIRA took responsibility for the bombings of both military and civilian targets in both Northern Ireland and England. In 1974 the Prevention of Terrorism (Temporary Provisions) Act, which applies to the entire United Kingdom, was passed. The Act extended the length of time police could detain those suspected of political violence; made it illegal to refuse to give to the authorities information about those suspected of committing acts of political violence; suspended habeas corpus rights for detainees; and proscribed the IRA and the Irish National Liberation Army and formal support for them.\n\nThe magistrate correctly concluded that there was an uprising in Northern Ireland at the time of the offenses with which Quinn is charged. PIRA members, although a minority faction, sought to change the structure of the government in that country, the country in which they lived. Criminal activity in Northern Ireland connected with this uprising would clearly fall within the political offense exception.\n\nWe cannot conclude, however, that the uprising extended to England. We do not question the fact that throughout the time of the alleged conspiracy, some politically motivated violence was taking place in England as well as in Northern Ireland. See, e.g., J. Bell, The Secret Army: The IRA 1916-1979, at 403-24 (1980). However, as the magistrate noted, in general the violent attacks and the responses to them were far less pronounced outside of Northern Ireland. It is clear from the record that the magistrate correctly concluded that the level of violence outside Northern Ireland was insufficient in itself to constitute an \"uprising.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThere is a second and even more significant reason why the \"uprising\" prong is not met in this case. As the magistrate found, what violence there was not being generated by citizens or residents of England. In fact, the magistrate determined that a large percentage of the bombing incidents in England were attributable to the Balcombe Street Four. The critical factor is that nationals of Northern Ireland, seeking to alter the government in that territorial entity, exported their struggle for political change across the seas to a separate geographical entity -- and conducted that struggle in a country in which the nationals and residents were not attempting to alter their own political structure.\n\nWe do not ignore the constitutional, legal, and military relationship between England and Northern Ireland. The ties are so well established, see generally 1 Europe Year Book 1984, at 991-96; 14 World Book Encyclopedia 403-06b (1985 ed.), that had evidence of the relationship not been presented to the magistrate, judicial notice would have been appropriate. It is beyond dispute that during the time of the conspiracy with which Quinn is charged, Northern Ireland was, in essence under British rule: the British government had dissolved the Northern Ireland Parliament, declared a state of emergency, and made the Secretary of State for Northern Ireland directly answerable for the government of Northern Ireland to the United Kingdom Parliament at Westminster.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nWe do not question whether the PIRA sought to coerce the appropriate sovereign. Nor do we pass judgment on the use of violence as a form of political coercion or the efficacy of the violent attacks in England. But, as we have already said, see supra pp. 62-68, the word \"uprising\" means exactly that: it refers to a people rising up, in their own land, against the government of that land. It does not cover terrorism or other criminal conduct exported to other locations. Nor can the the existence of an uprising be based on violence committed by persons who do not reside in the country or territory in which the violence occurs.\n\nIn light of the justifications for the political offense exception, the formulation of the incidence test as it has traditionally been articulated, and the cases in which the exception has historically been applied, we do not believe it would be proper to stretch the term \"uprising\" to include acts that took place in England as a part of a struggle by nationals of Northern Ireland to change the form of government in their own land.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Accordingly, we need not decide whether had an uprising occurred, the protection afforded by the exception would have been extended to one who, like Quinn, is a citizen of a different and uninvolved nation. See supra pp. 66-67. Because the incidence test is not met, neither the bombing conspiracy nor the murder of Police Constable Tibble is a non-extraditable offense under the political offense exception to the extradition treaty between the United States and the United Kingdom.\n\nVII. ISSUES NOT ADDRESSED BY THE DISTRICT COURT\n\nIn addition to contending that all the crimes with which he is charged are protected by the political offense exception, Quinn argued to the district court that the magistrate erred in concluding (1) that the conspiracy charge was not time barred and (2) that there was sufficient competent legal evidence to establish probable cause to believe that he murdered Police Constable Tibble. Because it held that the political offense exception barred extradition, the district court did not reach either of these issues.\n\nA. Appellate Discretion to Resolve These Issues\n\nAs a general rule, \"a federal appellate court does not consider an issue not passed upon below.\" Singleton v. Wulff, 428 U.S. 106, 120, 49 L. Ed. 2d 826, 96 S. Ct. 2868 (1976). But this rule is not inflexible. Youakim v. Miller, 425 U.S. 231, 234, 47 L. Ed. 2d 701, 96 S. Ct. 1399 (1976). We have discretion to decide whether to address an issue that the district court did not reach if the question is a purely legal one and the record has been fully developed prior to appeal; in deciding whether to exercise this discretion we should consider whether the resolution of the issue is clear and whether injustice might otherwise result. See Lien Ho Hsing Steel Enterprise Co. v. Weihtag, 738 F.2d 1455, 1461 (9th Cir. 1984); In re Howell, 731 F.2d 624, 627 (9th Cir. 1984).\n\nThe government suggests in a footnote in its appellate brief that we should exercise our \"pendant\" jurisdiction and resolve the issues not addressed by the district court, yet it failed to brief those issues on appeal. Quinn argues on appeal that the two remaining issues are not properly before us; he also did not brief either of these issues on appeal. We do have before us the parties' memoranda to the district court and the full factual record developed before the magistrate and, at this point, the questions appear to be purely legal. Accordingly, we evaluate the remaining factors to determine whether to reach these issues.\n\nClearly, in considering the risk that injustice might result, we must be more concerned about the possible unjust deprivation of Quinn's liberty than about any other source of injustice. The delay that could from a remand on these issues affects both parties; we cannot see any other manner in which a remand might cause injustice to the government. However, because Quinn has asked us not to reach these issues, the fact that a remand might prolong his pretrial detention is insufficient, in itself, to convince us that we should resolve issues that have not been addressed on appeal.\n\nThe crucial factor, then, appears to be whether the resolution of either of these issues is clear. We believe that the probable cause issue is clear and we thus resolve it. The statute-of-limitations issue, in contrast, is quite complex and involves a discovery request as well. Accordingly, we do not reach that issue at this time.\n\nB. Probable Cause: The Tibble Murder\n\nAlthough he accepts the magistrate's conclusion that there is probable cause to believe that Police Constable Tibble was murdered, Quinn contends that the magistrate erred in concluding that there was any competent evidence to support the belief that he was the murderer. Quinn points to alleged procedural irregularities in the circumstances surrounding Constable Blackledge's identification, the \"double hearsay\" method of presenting this evidence through Inspector Watts, see supra pp. 11-12, the six day delay between Blackledge's identification in Ireland and Watts' photo identification after Quinn's arrest in San Francisco, and some contradictions between the description of the assailant Blackledge originally gave the police and Quinn's actual physical characteristics, see supra p. 10. Quinn contends that because of these irregularities the evidence is unreliable and cannot be considered \"competent,\" see supra pp. 25-27, and that it thus cannot support the probable cause finding. We disagree.\n\nClearly the evidence introduced before the magistrate for the purpose of linking Quinn with the Tibble murder is not overwhelming. If that were all the evidence introduced at a murder trial, Quinn could not be convicted. But the country seeking extradition is not required to produce all its evidence at an extradition hearing and it is not our role to determine whether there is sufficient evidence to convict the accused. The magistrate does not weigh conflicting evidence and make factual determinations but, rather, determines only whether there is competent evidence to support the belief that the accused has committed the charged offense. See supra p. 27. And on review we can determine only whether, because of an absence of competent evidence, the magistrate's determination is wrong as a matter of law. Cf. Ker v. California, 374 U.S. 23, 33-34, 10 L. Ed. 2d 726, 83 S. Ct. 1623 (1963) (reasonableness of search and seizure is mixed question of law and fact which is reviewed de novo); United States v. McConney, 728 F.2d 1195, 1203 (9th Cir.) (en banc) (probable cause determination is mixed question of law and fact which is reviewed de novo), cert. denied, 469 U.S. 824, 105 S. Ct. 101, 83 L. Ed. 2d 46 (1984).\n\nThe credibility of witnesses and the weight to be accorded their testimony is solely within the province of the extradition magistrate. See Garcia-Guillern v. United States, 450 F.2d 1189, 1192 (5th Cir. 1971). The magistrate was free to determine the weight to be accorded to the various descriptions of the killer. In addition, although the magistrate may take the circumstances of an identification into account in assessing its reliability, there is no per se rule that specifies which identification procedures are \"component\" for probable cause purposes. An identification does not fail to constitute competent evidence merely because the required United States procedures for admissibility of the identification at trial were not followed. See Zanazanian v. United States, 729 F.2d 624, 627 (9th Cir. 1984) (multiple hearsay method of presenting evidence may decrease reliability of evidence but evidence may nevertheless be sufficiently reliable to be \"competent\"); Escobedo v. United States, 623 F.2d 1098, 1102 \u0026 n. 10 (5th Cir.) (single photograph identified by witness sufficient to support probable cause finding), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497, 101 S. Ct. 612 (1980). Barring hearsay from extradition proceedings would thwart one of the objectives of bilateral extradition treaties by requiring the requesting nation to send its citizens to the extraditing country to confront the accused. Zanazanian, 729 F.2d at 626-27.\n\nBecause the magistrate properly determined that there is competent legal evidence to support the belief that Quinn murdered Officer Tibble, the habeas petition cannot be granted for lack of probable cause. See Fernandez v. Phillips, 268 U.S. 311, 312, 69 L. Ed. 970, 45 S. Ct. 541 (1925); Valencia v. Limbs, 655 F.2d 195, 197 (9th Cir. 1981).\n\nC. The Statute of Limitations on the Conspiracy Charge\n\nIn addition to the political offense exception, the extradition treaty between the United States and the United Kingdom provides that \"extradition shall not be granted if . . .the prosecution for the offense for which extradition is requested has become barred by lapse of time according to the law of the requesting or requested Party . . . .\" Treaty, supra p. 1, at art. V(1)(b). Neither the United States nor the United Kingdom imposes a statute of limitations on murder charges. Since the United Kingdom has no relevant limitations period, the applicable statute of limitations on the conspiracy charge is that which is set forth in 18 U.S.C. § 3282 (1982).\n\nUnder section 3282, prosecution on a conspiracy charge is barred \"unless the indictment is found or the information is instituted within five years next after such offense shall have been committed.\" The United Kingdom does not follow the same criminal procedures as the United States; no indictment is issued for a conspiracy charge, and the extradition magistrate determined that the United Kingdom's \"laying of an information\" is not analogous to the United States procedures mandated by section 3282.\n\nQuinn contends that the conspiracy charge is time-barred because the conspiracy terminated on April 3, 1975, and the United Kingdom's extradition request was not filed until November 1981, well over five years later. However, the magistrate concluded that the statute of limitations was tolled when Quinn became a fugitive from justice after the murder of Officer Tibble,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e and that the tolling continued through the time of Quinn's Daly City arrest, notwithstanding the British government's fairly consistent knowledge of his whereabouts from the time that Blackledge identified him in 1975 throught the time he was incarcerated in Ireland and the years that he subsequently lived openly and notoriously in San Francisco.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The government, which originally specified that it would not contend that Quinn was a fugitive at any time and which addressed the issue only after the magistrate sua sponte ordered the parties to do so, asks that the magistrate's findings on the fugitive issue be affirmed. In the alternative, it contends that the habeas court should affirm the magistrate's findings on the fugitive issue be affirmed. In the alternative, it contends that the habeas court should affirm the magistrate's conclusion that the extradition request is timely by concluding that the United Kingdom's \"laying of an information\" satisfies the United States' statute of limitations.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nEach of these questions is complex. Complicating them further, Quinn contends that the magistrate erred as a matter of law in refusing his request for discovery on the fugitive issue. He seeks documents that would demonstrate that the United Kingdom knew his whereabouts and was dilatory in initiating proceedings. He also contends that, because the standard of proof for the fugitive issue is a preponderance standard,\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e he is entitled to discovery in order to test the credibility of the Blackledge identification that serves as the premise for the theory that his absence from the United Kingdom was due to a desire to avoid arrest or prosecution.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nThe multiple legal questions involved in the statute of limitations issue are complicated; their resolution is not clear and could even lead to the introduction of additional facts. Accordingly, it would not be proper for us at this time to decide this issue which the district court did not reach and the parties have not briefed on appeal. Nor would it be appropriate to indicate any view as to its ultimate outcome. Should the United Kingdom continue to be interested in pursuing Quinn's extradition on the conspiracy charge so that he may be tried for that offense, it will have to await the district court's determination whether the charge is time-barred, and possibly our subsequent review.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nVIII. CONCLUSION\n\nFor extradition to be denied for an otherwise extraditable crime on the basis that it falls within the protective ambit of the political offense exception, the incidence test must ordinarily be met. (We reserve the question whether offenses committed by government officials or in connection with wars between nations are covered by the exception and, if so, whether a different test would be appropriate.) The incidence test has two components, designed so that the exception comports with its original justifications and protects acts of the kind that inspired its inclusion in extradition treaties. First, there must be uprising -- a political disturbance related to the struggle of individuals to alter or abolish the existing government in their country. An uprising is both temporarily and spatially limited. Second, the charged offense must have been committed in furtherance of the uprising; it must be related to the political struggle or be consequent to the uprising activity. Neither the objectives of the uprising nor the means employed to achieve those objectives are subject to judicial scrutiny. And while the nature of the uprising group and any evidence of the accused's motivations may be relevant, proof on these elements is not required or necessarily determinative. Acts of international terrorism do not meet the incidence test and are thus not covered by the political offense exception. Crimes against humanity also are beyond the scope of the exception.\n\nThe conspiracy to cause explosions and the murder with which Quinn is charged do not fall within the political offense exception. Although an uprising existed in Northern Ireland at the time the charged offense were committed, there was no uprising in England. The crimes did not take place within a territorial entity in which a group of nationals were seeking to change the form of the government under which they live; rather the offense took place in a different geographical location. We do not decide whether Quinn's status as a citizen of an uninvolved nation would also preclude him from receiving the protection of the exception.\n\nWe conclude that the magistrate did not err in finding probable cause in connection with the charge that Quinn murdered Officer Tibble. However, we cannot properly determine at this point whether the conspiracy charge is time-barred. That matter must first be considered by the district court.\n\nWe vacate the writ of habeas corpus and remand to the district court. We hold that Quinn may be extradited on the murder charge but that the district court must consider whether the conspiracy charge is time-barred before extradition is permitted for that offense.\n\nVACATED AND REMANDED\n\nDUNIWAY, Circuit Judge (Concurring in the Judgement):\n\nI concur in the judgment, but I cannot concur in the lengthy opinion of Judge Reinhardt and the very extensive dicta that it expounds.\n\nI agree that the magistrate had jurisdiction, including jurisdiction to determine whether the offenses with which Quinn is charged were of a political character. I agree that the district court had jurisdiction on habeas corpus to decide that question and that we have jurisdiction on appeal to consider it. I have no doubt that the evidence is sufficient to enable, indeed, to require, the magistrate, the district court, and this court to say that the offenses charged against Quinn are extraditable offenses, and that the only basis upon which extradition could be denied is the treaty provision that \"extradition shall not be granted if . . . the offense . . . is regarded by the requested party, [the United States], as one of a political character.\"\n\nMy principal difficulty is with part V of Judge Reinhardt's thoughtful and careful opinion, and especially with part V, B, 2, and the geographical limitation announced there, reading as follows:\n\nEqually important, the uprising component serves to exclude from coverage under the exception criminal conduct that occurs outside the country or territory in which the uprising is taking place. The term \"uprising\" refers to a revolt by indigenous people against their own government or an occupying power. That revolt can occur only within the country or territory in which those rising up reside. By definition acts occurring in other lands are not part of the uprising.\n\nThe limitation may be useful to us in this case, but I doubt that it is a valid one. To consider an old example, let us suppose that it is a valid one. To consider an old example, let us suppose that the treaty was in effect immediately following the revolutionary war, and his majesty's government sought to extradite John Paul Jones for piracy in British waters. Would be grant extradition because there was no uprising in Great Britain? Assume that we had a comparable treaty with the government of Nicaragua. Suppose that, today, a citizen of Nicaragua, active in the so-called contras, were to sink a vessel owned by the Sandinista government on the high seas, and flee to this country. Would we grant extradition because his act did not take place within the territorial waters of Nicaragua?\n\nParticular today, with the airplane, the helicopter? the high speed motor vehicle, the railroad, the speedboat and submarine? genuinely revolutionary activities can take place outside the geographic boundaries of the requesting state. I fear that if we adopt the geographic limitation propounded in the opinion today, we will find ourselves trying to work our way around it tomorrow.\n\nI much prefer the rationale of the Seventh Circuit in Eain v. Wilkes, 7th Cir., 1981, 641 F.2d 504. There, the court held that the political character of the offense provision does not apply to \"the indiscriminate bombing of the civilian population\" (p. 521). I cannot believe that the framers of the treaty intended that the exception would embrace the kind of activities that the record in this case reveals. As the Eain court said, \"We recognize the validity and usefulness of the political offense exception, but it should be applied with great care lest our country become a social jungle and an encouragement to terrorists everywhere.\" (p. 520)\n\nThis case does not involve the \"random bombing\" that Eain involved. But every letter bomb to which Quinn was connected was directed to an innocent, albeit influential, civilian who had no direct connection to the troubles in Northern Ireland. Nor does the fact that Tibble was a policeman make any difference. The evidence does not indicate that Quinn knew or believed that he was a policeman. Moreover, it would make no difference if he did either know it or believe it. The killing of Tribble was an attempt to avoid arrest for extraditable offense. The fact that Tribble was a policeman could metamorphose that killing, which, on its face, was a murder to escape arrest, into an offense regarded by the United States as one of a political character.\n\nI concur in part VII C of the opinion, and in the judgment.\n\nFLETCHER, Circuit Judge, Concurring and Dissenting:\n\nI respectfully dissent from my colleagues' conclusion that Quinn may now be extradited on the murder charge. The decision facing this court is excruciatingly difficult. Quinn is accused of hideous crimes -- violent and cruel and some of them cowardly. Innocent victims were targeted for receipt of letter bombs mailed anonymously. A decision that the full force of the law should not be invoked to punish persons found guilty of such acts seems inconceivable. However, the political offense exception to the treaty to extradition has a long history of protecting person rebelling against their governments.\n\nThis longstanding tradition among western nations is an acknowledgment of the right of the governed to oppose unjust governments. Although the nations, ours included, have acknowledged the heinous nature of violent political crimes, they have nonetheless, under treaties and statutes, denied extradition when an individual's conduct falls within the narrow exception for the \"political offense.\"\n\nI find that I can concur in much of Judge Reinhardt's opinion. In part I, Judge Reinhardt simply and eloquently outlines the facts and the difficult dilemma that confronts us. In Part II he rightly concludes that the determination us to what constitutes a political offense within the meaning of the treaty and the statute is a task for the court. I also agree with his discussion of the standard of review to be applied by both the district court and our court.\n\nIn Part IV, Judge Reinhardt ably documents the evolution of the political offense exception, paying particular attention to the development of the incidence test in the United States. His description of the conflicting approaches taken by various United States courts grappling with issues similar to ours highlights the difficult nature of our charge. In Part V, I wholly agree with his condemnation of international terrorism and his conclusion that acts of international terrorism not be protected under the political offense exception. I believe, as does Judge Reinhardt, that the traditional incidence test applied by courts of this country since the 1800's accommodates the exclusion of acts of international terrorism from protection. The new limitations imposed by the courts in Eain v. Wilkes and In re Doherty unnecessarily break from the traditional test by inquiring into the evaluating the legitimacy of given political objectives and the conduct of internal political struggles. The political offense exception should be applied in an ideologically neutral fashion; it is neither necessary nor appropriate for courts to balance policy considerations. I believe the Seventh Circuit in Eain improperly rested its decision on its conclusion that only organized form of aggression are afforded protection under the political offense exception and on its distinction between attacks on military and civilian targets. These limitations run counter to the reasons that originally supported creation of the political offense exception. I agree with Judge Reinhardt that the incidence test neither requires proof of membership in an uprising group nor recognizes a distinction between attacks on military and civilian targets. For these reasons I join Judge Reinhardt in rejecting the Eain test.\n\nI concur in Judge Reinhardt's conclusion in Part VI that if an uprising existed at the time the offenses were committed, the bombings and the Tibble murder were incident to that uprising. I disagree, however, with his further conclusion that because the level of violence in Northern Ireland far exceeded that in England, the uprising did not extend to England.\n\nI find persuasive the magistrate's and district court's findings that a severe political uprising existed in the United Kingdom, including England, at the time the acts of which Quinn is accused took place. The magistrate recognized the constitutional unity of Northern Ireland and Great Britain, and noted the numerous violent incidents that occurred in areas outside Northern Ireland, particularly in and around London. I cannot agree with Judge Reinhardt's conclusion that when PIRA members revolt against their British rulers in Northern Ireland, such acts are protected under the political offense exception, whereas the identical violent acts carried out against the same British rulers in London lose their protected status.\n\nI disagree that this interpretation of the \"uprising\" component of the political offense exception sanctions previously extraditable violent acts. Judge Reinhardt is rightly concerned that \"uprising\" not encompass \"terrorism or other criminal conduct exported to other locations.\" I share his concern. But in my view, the acts of Irish nationalists against the British in London are not international \"terrorism or other criminal conduct exported to other locations.\" The longstanding ties between England and Northern Ireland, which Judge Reinhardt acknowledges are \"well established,\" cannot be avoided or ignored. Although Northern Ireland may have been \"separated\" from Great Britain by treaty when the Irish Free State was created, it remained a part of the United Kingdom with representation in the British Parliament and it has been occupied by British troops lo these many years. The acts of terrorism in England by members of the PIRA can hardly be termed acts of international terrorism.\n\nThe magistrate in another extradition case involving a PIRA member charged with bombing a British military barracks in England reached this same conclusion. McMullen was found not extraditable because his acts fell within the political offense exception. See In re McMullen, No. 3-78-1899 MG (N.D. Cal. May 11, 1979), reprinted in Extradition Act of 1981: Hearings on S. 1639 Before the Senate Comm. on the Judiciary, 97th Cong., 1st Sess. 294, 294-96 (1981). I likewise conclude that Quinn's actions in London were part of an overall uprising in Northern Ireland and England.\n\nGiven my conclusion that the offenses of which Quinn is accused are protected under the political offense exception, I must address whether this protection extends to one who, like Quinn, is a citizen of a different nation from that in which the uprising is occurring. I do not believe that mercenaries or volunteers in a foreign conflict can claim protection under the political offense exception. I deduce from Judge Reinhardt's views on international terrorism that he would agree. To be entitled to protection, an individual would have to demonstrate tangible and substantial connections with the country in which an uprising occurs. It could be short of citizenship, but there must be a showing of substantial connection -- for example, that he or she had lived in the country or territory and planned to continue to live there under a changed regime.\n\nIn Quinn's case, we lack sufficient information with which to make any such evaluation. We know that Quinn is a United States citizen, and that he resided in San Francisco during the years immediately preceding his arrest. In an Order Denying Bail, the magistrate noted Quinn's\n\nlong standing family roots and ties in this [San Francisco] local community. He has a father and uncles and aunts here, he was educated here, and was employed in a family business at the time of his arrest. Except for a sojourn abroad, during which the alleged events occurred which resulted in the charges filed in the United Kingdom, he has for the most part resided in this community.\n\nBecause we do not know the extent of Quinn's ties to Northern Ireland, I would remand the case for an initial determination by the district court as to whether Quinn should be treated as an Irish national and afforded the protection of the political offense exception. Accordingly, I dissent from the holding that Quinn may now be extradited on the murder charge.\n\nI agree with my colleagues that Quinn may not be extradited on the conspiracy charge at least until after the district court considers the question of the statute of limitations. However, I believe that the district court should be required to reach that question unless it first concludes that Quinn's ties to Northern Ireland was insufficient to invoke the protection of the political offense exception. For the reasons I have explained, I concur in the holding remanding the conspiracy count.\n\n\u003cspan class=\"fn\"\u003e1. See In re Mackin, 668 F.2d 122 (2d Cir. 1981) (determining that magistrate had jurisdiction to decide the applicability of the political offense exception, but declining to review the merits of the magistrate's decision on appeal or writ of mandamus); Escobedo v. United States, 623 F.2d 1098 (5th Cir.) (determining in one paragraph that charges arising out of the kidnapping of Cuban Consul in Mexico in 1976 were not within political offense exception because of absence of any violent political disturbance to which they could have been incidental), cert. denied, 449 U.S. 1036, 66 L. Ed. 2d 497, 101 S. Ct. 612 (1980); Sindona v. Grant, 619 F.2d 167 (2d Cir. 1980) (determining that charge of fraudulent bankruptcy was not within political offense exception because of absence of any political disturbance to which the act could have been incidental; that there was no evidence that the requesting nation sought accused's extradition on fraudulent bankruptcy charge in order to try him covertly for a political offense; and that degree of risk to accused's life from extradition was an issue that properly fell within purview of executive branch); Garcia-Guillern v. United States, 450 F.2d 1189 (5th Cir. 1971) (determining that charge of embezzlement by public official was not within political offense exception because of absence of political disturbance to which the offense could have been incidental), cert. denied, 405 U.S. 989, 99 S. Ct. 1251, 31 L. Ed. 2d 455 (1972); Jimenez v. Aristeguieta, 311 F.2d 547, 558-60 (5th Cir. 1962) (determining that potentially political character of alleged murders did not bar extradition on separate charged of fraud and embezzlement when those acts were not incidental to a violent political disturbance).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Quinn was originally charged with one count of murder of a police constable, three counts of sending letter bombs in the London area, two counts of causing explosions in the London area, one count of placing an explosive device in the London area, and one count of conspiracy with six other persons to cause explosions in the United Kingdom. The request for extradition on all but the murder and conspiracy charges was withdrawn by the United Kingdom prior to the hearing before the magistrate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Quinn followed the proper procedure for seeking review of the magistrate's extradition order. Because of the limited function of an extradition proceeding, see Charlton v. Kelly, 229 U.S. 447, 461, 57 L. Ed. 1274, 33 S. Ct. 945 (1913) (analogizing extradition hearing to a preliminary hearing in a criminal case), there is no appeal from an extradition order by the government or by the defendant, Collins v. Miller, 252 U.S. 364, 369-70, 64 L. Ed. 616, 40 S. Ct. 347 (1920); In re Mackin, 668 F.2d 122, 125-27 (2d Cir. 1981); Eain v. Wilkes, 641 F.2d 504, 508 (7th Cir.) cert. denied, 454 U.S. 894, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981); Hooker v. Klein, 573 F.2d 1360, 1368 (9th Cir.), cert. denied, 439 U.S. 932, 99 S. Ct. 323, 58 L. Ed. 2d 327 (1978). But cf. Proposed Extradition Act of 1984, H.R. 3347, 98th Cong., 2d Sess. § 3195(a)(1) (making extradition decision appealable), printed in H. Rep. 998, 98th Cong., 2d Sess. 54 (1984). However, res judicata does not apply, Hooker, 573 F.2d at 1368, and the government is free to reinstitute an extradition request after it has been denied in a first extradition proceeding, Mackin, 668 F.2d at 128; Hooker, 573 F.2d at 1368. A petition for writ of habeas corpus is the only mechanism by which the defendant can seek review. Mackin, 668 F.2d at 128; Eain, 641 F.2d at 508; Hooker, 573 F.2d at 1364. See generally Lubet \u0026 Czackes, supra p. 3, at 199.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Quinn raised the same arguments before the district court that he had presented to the magistrate, see supra p. 12, except that he no longer contended that there was insufficient evidence to find probable cause to believe he had engaged in a conspiracy to cause explosions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Quinn remains in custody because we granted the United Kingdom's motion for a stay of release pending appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Clearly, if application of the exception required us to approve of the political goals of an uprising group, executive discretion in granting protection from extradition would be more appropriate than judicial review. See, e.g., Note, Terrorist Extradition and the Political Offense Exception: An Administrative Solution, 21 Va. J. Int'l L. 163, 182 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We note that since this case was argued, Congress has enacted the 1984 Act to Combat International Terrorism, Pub. L. 98-533, 98 Stat. 2706 (to be codified in scattered sections of 18 U.S.C., 22 U.S.C., § 41 U.S.C.). Section 201(a) of that Act, 98 Stat. 2709, urges the President \"to seek more effective international cooperation in combating international terrorism, including . . . extradition of all terrorists.\" This mandate supports some of the substantive conclusions we reach below. See infra pp. 64-65. However, it does not assign the executive initial responsibility for determining when the exception applies or suggest that the relationship between the United States and the requesting nation should be considered when a judicial determination is made regarding whether the exception applies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Whether the political offense exception applies in a particular case requires an inquiry not unrelated to and somewhat less intrusive than that required to determine if the Attorney General is prohibited from deporting or returning an alien to a country if \"such alien's life or freedom would be threatened in such country on account of . . . political opinion,\" 8 U.S.C. § 1253(h) (1982). See Bolanos-Hernandez v. INS, 767 F.2d 1277, 1283 (9th Cir. 1984) (evaluating whether threatened persecution is based on political opinion). We note that, rather than considering such a determination as one property left to the executive branch, Congress has recently amended this section of the Immigration and Nationality of Act to remove the Attorney General's discretion in making the determination that an alien is likely to be persecuted on the basis of political opinion. See INS v. Stevic, 467 U.S. 407, 104 S. Ct. 2489, 2496 n.15, 81 L. Ed. 2d 321 (1984)(discussing effect of section 203(e) of the Refugee Act of 1980, Pub. L. No. 96-212, 94 Stat. 102, which amended 8 U.S.C. § 1253(h)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In Ornelas v. Ruiz, 161 U.S. 502, 40 L. Ed. 787, 16 S. Ct. 689 (1896), in reviewing a determination that a raid on a Mexican town was not protected by the political offense exception, the Court considered whether the extradition court \"had no choice on the evidence\" but to conclude that the acts were politically motivated. Id. at 511. Although this standard of review is substantially the same as the clearly erroneous standard's requirement that the reviewing court have \"the definite and firm conviction that a mistake has been committed,\" United States v. United States Gypsum Co., 333 U.S. 364, 365, 92 L. Ed. 746, 68 S. Ct. 525 (1948), earlier in its opinion the Court noted that the magistrate's judgment that the charged offense is an extraditable crime should be reversed if \"palpably erroneous in law,\" id. at 509, suggesting a de novo review of the legal aspects of the magistrate's mixed fact and law determination. We note that since Ornelas was decided in 1896, the Supreme Court has held that various mixed question of law and fact are reviewed de novo, see, e.g., Ker v. California, 374 U.S. 23, 33-34, 10 L. Ed. 2d 726, 83 S. Ct. 1623 (1963) (reasonableness of searches and seizures), a standard of review we adopted for all mixed questions of fact and law in United States v. McConney, 728 F.2d 1195, 1203 (9th Cir.) (en banc), cert. denied, 469 U.S. 824, 105 S. Ct. 101, 83 L. Ed. 2d 46 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Under current practice extradition hearings are generally conducted by magistrates. However, 18 U.S.C. § 3184 grants jurisdiction to conduct extradition hearings to \"any justice or judge of the United States, or any magistrate authorized so to do by a court of the United States, or any judge of a court of record of general jurisdiction of any State.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The differing justifications partially explain the differences between the test we apply in determining whether the political offense exception applies and the analysis we make when determining whether an alien is entitled to relief from deportation because of threat of political persecution. See supra note 8 \u0026 infra note 15. The Refugee Act of 1980, Pub. L. No. 96-212, 94 Stat. 102 (codified in scattered sections of 8 U.S.C. (1982)), responded to a \"national commitment to human rights and humanitarian concerns.\" S. Rep. No. 256, 96th Cong., 2d Sess. 1, reprinted in 1980 U.S. Code Cong. \u0026 Ad. News 141, 141. The political offense exception, in contrast, is justified by an acceptance of the right to political self-determination as well as by humanitarian concerns.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. French court have more recently begun to follow a less rigid approach, first set forth in In re Rodriquez, 2 Gaz. Palais 113 (Ct. App. Paris, Fr. 1953). The new French test is similar to the Swiss test in considering the context in which the crime was committed and the motivations of the accused, see Carbonneau, supra p. 34, at 19-22, but French courts have not incorporated a rigid ends-means test, id. at\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Swiss, aware that their test incorporates factors that preclude ideological neutrality, allow only their highest court to determine when the political offense exception applies. See Politics of Extradition, supra p. 31, at 631 (citing 1 L. Oppenheim, International Law 579 (4th ed. 1928).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. A number of commentators have suggested that perhaps the most useful test for when the exception should apply can be derived from the theory of \"ideological self-preservation.\" See, e.g., M. Bassiouni, International Extradition: United States Law \u0026 Practice ch. VIII, at § 2-74 to § 2-77 (1983); C. Van den Wijngaert, supra p. 22, at 157-58. The premise of this theory is that a political crime is justified if it is a form of self-defense, in that the means used to attempt to secure a fundamental right were limited to the least harmful means available. The commentators suggest that an objective test could be derived from this theory and would weigh (a) the nature of the rights violated by the state; (b) the nature of the state conduct that violated these rights; and (c) the nature of the individual conduct that violated the law of the state in an attempt to defend these rights. As one commentator has noted see C. Van den Wijngaert, supra p. 22, at 158, this test resembles the Swiss proportionality test but, in addition to the balancing required by that test, it requires an evaluation of the conduct of the requesting nation. Despite the initial appeal of the theory of ideological self-preservation, we believe it is an inappropriate test. It is subject to all the criticisms to which the Swiss test is subject. Moreover, it requires the kind of evaluation of the conduct of another nation that violates the principle of nonintervention in the internal affairs of another state. See id. It thus runs counter to one of the primary tenets underlying the political offense exception, see supra pp. 31-32, and requires the judiciary to undertake a task for which it is particularly ill-suited, see supra pp. 20-21 \u0026 note 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The British refusal to extradite those who are at risk of persecution parallels the United States' standards for asylum, see 8 U.S.C. § 1158(a) (1982), and for prohibiting the Attorney General from returning an alien to a country in which the alien's life or freedom would be threatened, see 8 U.S.C. § 1253(h) (1982). However, in contrast to the British standard, United States courts hesitate to evaluate either the accused's motives when applying the political-offense incidence test, see infra pp. 42, 69, or the alien's subjective fears when determining whether the Attorney General is prohibited from returning an alien to a specified country, see Bolanos-Hernandez v. INS, 767 F.2d 1277, 1283 (1984). But see id. at 1321 n.11 (courts consider subjective fear in determining whether alien qualifies for grant of asylum). In the United States in the extradition context the Secretary of State evaluates the risks that an accused will be persecuted if extradited. See supra pp. 23-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The court referred that issue to the executive branch. 62 F. at 986; see supra pp. 23-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although unnecessary to the resolution of the cases before them, a number of courts have stated that a \"war\" could qualify as the violent political disturbance for purposes of the incidence test. See, e.g., Eain v. Wilkes, 641 F.2d 504, 518 (7th Cir.), cert. denied, 454 U.S. 894,, 102 S. Ct. 390, 70 L. Ed. 2d 208 (1981); Sindona v. Grant, 619 F.2d 167, 173 (2d Cir. 1980). Although the terms \"rebellion,\" \"revolution,\" \"uprising,\" and \"civil war\" may for our purposes be treated as synonymous, none is for any purpose synonymous with the term \"war.\" As we discuss further below, see infra note 33, we question the propriety of applying the incidence test in the same manner in the case of crimes occurring during wars as in the case of crimes occurring during uprisings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The extradition question in this case originally went up and down the federal court system for almost a decade. See Artukovic v. Boyle, 107 F. Supp. 11 (S.D. Cal. 1952), rev'd sub nom. Ivancevic v. Artukovic, 211 F.2d 565 (9th Cir.), cert. denied, 348 U.S. 818, 75 S. Ct. 28, 99 L. Ed.645, reh. denied, 348 U.S. 889, 75 S. Ct. 202, 99 L. Ed. 698 (1954), on remand, 140 F. Supp. 245 (S.D. Cal. 1956), aff'd sub nom. Karadzole v. Artukovic, 247 F.2d 198 (9th Cir. 1957), vacated and remand sub nom. United States v. Artukovic, 170 F. Supp. 383 (S.D. Cal. 1959). After Congress removed protection from alleged Nazi war criminals who claimed to be at risk of persecution if deported, see Immigration and Nationality Act - Nazi Germany, Pub. L. No. 95-549, 92 Stat. 2065 (codified at 8 U.S.C. §§ 1251, 1253-54 (1982)), deportation proceedings that had been initiated in 1951 on the basis of Artukovic's 1948 illegal entry into the United States were reinstated. See Artukovic v. INS, 693 F.2d 894, 896 (9th Cir. 1982). We held that the stay of Artukovic's deportation, granted in 1959 on the ground that Artukovic would be subject to persecution if deported to Yugoslavia, see id. at 896, could not be revoked without a hearing, see id. at 899. Then, in 1984, Yugoslavia filed a new extradition request; a magistrate determined that there was probable cause to believe Artukovic committed the charged offenses. See Extradition of Artukovic, CV 84-8743-R(B) (C.D. Cal. May 1, 1985). The district judge denied the habeas petition, see Artukovic v. United States, No. CV 85-3611-R (C.D. Cal. February 6, 1986), and Artukovic was extradited a few days later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Because the Supreme Court vacated the judgment in Artukovic without discussion of the merits, see 355 U.S. 393, 78 S. Ct. 381, 2 L. Ed. 2d 356 (1958), we cannot reach any conclusion about whether it believe Artukovic's acts were protected by the political offense exception. However, it is clear that our opinion has no precedential value. See County of Los Angeles v. Davis, 440 U.S. 625, 634 n. 6, 59 L. Ed. 2d 642, 99 S. Ct. 1379 (1979) (\"Of necessity our decision 'vacating the judgment of the Court of Appeals deprives that court's opinion of precedential effect . . . .'\") (quoting O'Connor v. Donaldson, 422 U.S. 563, 577-78 n. 12, 45 L. Ed. 2d 396, 95 S. Ct. 2486 (1975)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See M. Bassiouni, supra note 14, at ch. VIII, §§ 2-80, 2-83 (1983); C. Van den Wijngaert, supra p. 22, at 44, 140-41; Garcia-Mora, Crimes Against Humanity and the Principle of Nonextradition of Political Offenders, 62 Mich. L. Rev. 832, 939 (1964) (citing Convention on the Prevention and Punishment of the Crime of Genocide, adopted Dec. 9, 1948, T.I.A.S. No. 1021, 78 U.N.T.S. 277); see also I.A. Shearer, supra p. 22, at 186 (Genocide Convention imposes extradition obligation on parties thereto).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See Bassiouni, International Law and the Holocaust, 9 Cal. W. Int'l L.J. 201, 255-56 (1971) (\"Crimes against humanity\" including genocide \"involve wholesale human depredation which could not occur without the state's instigation or acquiescence.\"); Garcia-Mora, supra note 21, at 933-34 (quoting Draft Code of Offenses Against the Peace and Security of Mankind art. 2, para. 11, Report of the International Law Commission to the General Assembly, 9 U.N. GAOR Supp. (No. 9) at 9-11, U.N. Doc. No. A/2693 (1954)); cf. The Nurnberg (Nuremberg) Trial, 6 F.R.D. 69, 108 (Int'l Military Tribunal 1946) (holding that international tribunal had jurisdiction to hold individual defendants responsible for aggressions, crimes against humanity, and war crimes because these individuals, who occupied responsible positions in the German government, must have known that their acts violated Germany's responsibilities under international law); M. Bassiouni, International Criminal Law: A Draft International Criminal Code 65 (1980) (pointing out that various war crimes necessarily involve a policy level government decision).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. War crimes include \"devastation not justified by military necessity.\" See The Nurnberg (Nuremberg) Trial, 6 F.R.D. at 130.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The incidence test was originally intended to afford protection to individuals engaged in political resistance; the test was designed to identify a set of protestors, namely, those engaged in an uprising designed to change the existing government. See supra pp. 31-32. It is unclear whether this test applies to former government officials, cf. In re Ezeta, 62 F. 972, 1000 (N.D. Cal. 1894) (noting that most extradition cases involve acts committed against the government, and that such cases are only of some value when the pending case concerns acts that were committed by representatives of the then-existing government), and even whether the political offense exception is applicable is all to such individuals. Courts have heretofore, on the few occasions when conduct by former governmental officials was involved, see, e.g., Jimenez v. Aristeguieta, 311 F.2d 547 (5th Cir. 1962); In re Ezeta, 62 F. 972 (N.D. Cal. 1984), simply assumed without discussion or analysis that the political offense exception was applicable and that the incidence test constituted the proper standard. That is what we did in Artukovic. Because all acts of government officials that carry out a government policy are, by definition, political, applying the incidence test makes little sense and leads to paradoxical results. It gives special protection to officials when they are suppressing an uprising and strips them of protection at all other times. Conceptually, the appropriate analogy to individuals acting in furtherance of an uprising is government officials acting in furtherance of a government policy, not in connection with an uprising. Thus, a serious question exists as to whether we should apply the incidence test where extradition is requested of persons who commit crimes while officials of a government. Since the political offense exception is rooted in a desire to protect those rebelling against autocratic regimes, there is, as we have suggested, some question whether the doctrine is applicable at all in the case of former government officials. There are, however, two policies in addition to the protection of those who engage in political uprisings that underlie the political offense exception. They are concern about the safety and welfare of those to the government now in power and a commitment to non-intervention in the internal affairs of foreign countries. Both these policies would be applicable in the case of former government officials who have fled their native land. Thus, it can be argued that while the incidence test may be inappropriate for evaluating the extraditability of former government officials, the exception itself is applicable and a different test should be devised for use in such cases. See also infra note 33 (discussing application of the incidence test to wars between nations). However, we leave these questions for resolution in future cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The United States government subsequently sought to deport McMullen because of his illegal entry into this country and his undocumented status. We found that McMullen had established that, because he had deserted the PIRA, his life or freedom would be threatened if he returned to the United Kingdom. McMullen v. INS, 658 F.2d 1312 (9th Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The magistrate in Mackin also evaluated whether Mackin was a member of a group engaged in an uprising. We do not find any support in the case law for imposing this requirement See discussion infra pp. 69-70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In contrast to the McMullen magistrate, the Mackin magistrate suggested that sufficiently \"anarchistic\" acts, such as those directed at civilians, would be extraditable. However, the fact that a group that engaged in dispersed political violence frequently directed at civilians carried out the bombing was, in the magistrate's view, insufficient to remove the acts from the exception's protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The Seventh Circuit did not characterize the PLO's efforts to expel Jews from Israel as a part of a plan to commit a \"crime against humanity.\" We express no view here as to whether the PLO's actions might constitute such a crime. See supra p. 47 for a discussion of the meaning of the term \"crimes against humanity.\" Our comments are limited to the form of analysis actually employed by the Eain court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The distinction between \"innocent\" and \"guilty\" civilians may not be as simple as it may first appear and is not always an ideologically neutral distinction. C. Van den Wijngaert, supra p. 22, at 156 \u0026 n.839. Similarly, we question how a court is to define \"indiscriminate,\" as opposed to \"defensible,\" bombings of civilians. Any such effort would probably directly involve the court in the types of political judgments that the American version of the political offense exception has always sought to avoid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See Tel-Oren v. Libyan Arab Republic, 233 U.S. App. D.C. 384, 726 F.2d 774, 795 (D.C. Cir. 1984) (Edwards J., concurring), cert. denied, 470 U.S. 1003, 105 S. Ct. 1354, 84 L. Ed. 2d 377 (1985); 1984 Act to Combat International Terrorism, Pub. L. 98-533, 98 Stat. 2706 (to be codified in scattered sections of 18 U.S.C., 22 U.S.C., § 41 U.S.C.); cf. European Convention on the Suppression of Terrorism art. 1, done Jan. 27, 1977, reprinted in Control of Terrorism: International Documents 87 (Y. Alexander ed. 1979) (Council of Europe declares terrorist acts excluded from political offense exception to treaties between members of that Council); Protocol I to the Geneva Conventions art. 51, adopted June 8, 1977, U.N. Doc. A/32/144 annex I, reprinted in 16 Am. Society Int'l L., Int'l L. Materials 1391, 1431-32 (1977) (condemning violence designed to spread terror among civilian populations).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See, e.g., G.A. Res. 3103, 28 U.N. GAOR Supp. (No. 30) at 142, U.N. Doc. A/9030 (1974) (armed struggles for independence and self-determination are \"in full accordance with the principles of international law\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In cases where it appears that a fair trial is unlikely, the Secretary of State retains discretion to refuse extradition even if a court determines that the incidence test is not met. See supra pp. 23-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. A number of courts have suggested that the incidence test is applicable whether it occurs during a violent political disturbance such as an uprising, rebellion, or war. See supra note 17. If, by using the term \"war\" these courts meant a civil war, see, e.g., In re Ezeta, 62 F. 972 (N.D.Cal. 1984), we have no difficulty with their characterization of the test; we see no difference between an uprising, a rebellion, a revolution, and a civil war. In contrast, if these courts used the term to refer to violent conflicts between nations that transcend national boundaries, we question whether the protections afforded by the exception should be available and, if so, whether the incidence test should apply. First, we note that wars between nations are the manifestation of hostilities between two or more governments and that those who participate in those wars typically are representatives of one of the involved governments. Thus, the questions regarding the political offense exception's applicability to government officials arise. See supra note 24. Second, we note that one of the primary purposes of the exception is to protect revolutionary activity. See supra pp. 31-32. Although the two other justifications for the exception, see id., suggest that perhaps offenses incidental to wars should receive some protection, the absence of the primary justification cautions against applying the same test to transnational military conflicts as is applied to uprisings. Third, the application of the incidence test to international conflicts is inconsistent with the traditional formulation of the test and the jurisprudence in this area. With the exception of the Artukovic case, see discussion supra pp. 44-48 \u0026 notes 19-24, (in which the offenses were not, in any event, necessarily incidental to World War II) courts do not appear to have applied the incidence test to offenses engaged in during the course of military conflicts between nations. Rather, they have followed the Castioni formulation that the offense must be related to \"a political rising,\" 1 Q.B. at 165 (per Hawkins, J.), or the Ezeta formulation that it must be related to a \"civil war, insurrection, or political commotion,\" 62 F. at 998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In his discussion, the magistrate considered separately the level of violence in Great Britain and in Northern Ireland. It is not clear whether in referring to Great Britain he meant England or England, Scotland, and Wales. In any event, his conclusion that the requisite level of violence existed only in Northern Ireland was correct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The Secretary of State did not gain parliamentary consent to establish a new parliament until 1982. See 1 Europa Year Book 1984, supra p. 81, at 991-92, 996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. In one other case, In re McMullen, No. 3-78-1099 cMG (N.D. Cal. May 11, 1979), the extradition magistrate also concluded that, because the PIRA violence was not confined to Northern Ireland, the uprising extended throughout the entire United Kingdom. For the same reasons that we find that there was no uprising in England or Great Britain at the time of the acts with which Quinn is charged, we believe the uprising determination in McMullen was in error. We note, however, that the United Kingdom never filed a new extradition request in McMullen's case and that McMullen has since been granted asylum. McMullen v. INS, 658 F.2d 1312 (9th Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The magistrate determined that an individual who flees from the scene of the crime is, by definition, a fugitive. We do not believe the issue is quite that simple. See United States v. Parrino, 180 F.2d 613, 616 (2d Cir. 1950) (Learned Hand, C.J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The magistrate determined that Quinn must have known that he was wanted by the authorities in question, a requirement for being determined to be a fugitive, see United States v. Gonsalves, 675 F.2d 1050, 1053 (9th Cir. 1982). In contrast, in its memorandum in opposition to the writ, the government does not argue that there is sufficient evidence to demonstrate that Quinn acted from 1975 until 1981 with the intent of avoiding arrest or prosecution for this offense, as required by United States v. Wazney, 529 F.2d 1287 (9th Cir. 1976), and its progeny. Rather, the government suggests that the Ninth Circuit's intent rule be abandoned in favor of a \"mere absence from the jurisdiction\" rule, a suggestion we have previously rejected in an extradition case, see Caplan v. Vokes, 649 F.2d 1336, 1341 (9th Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Quinn argues that the limited scope of habeas review of an extradition order precludes a reversal of the magistrate's finding on this point. In order to determine the appropriate standard of review, the district court must decide on remand what portion of the magistrate's determination of this issue was based on factual findings and what portion was based on legal conclusions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See Jhirad v. Ferrandina, 536 F.2d 478, 485 (2d Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Although there is no explicit statutory basis for ordering discovery in extradition hearings, see Merino v. United States Marshal, 326 F.2d 5, 12-13 (9th Cir. 1963), the extradition magistrate has the right, under the court's \"inherent power,\" see First National City Bank of New York City v. Aristeguieta, 287 F.2d 219, 226 (2d Cir. 1960), vacated as moot, 375 U.S. 49, 11 L. Ed. 2d 106, 84 S. Ct. 144 (1963), to order such discovery procedures \"as law and justice require,\" Jhirad v. Ferrandina, 536 F.2d at 484. In exercising discretion, the magistrate should consider both \"the well-established rule that extradition proceedings are not to be converted into a dress rehearsal trial,\" id., and whether the resolution of the contested issue would be appreciably advanced by the requested discovery, id. Although the accused is not entitled to introduce evidence that goes to his defense, \"he may offer limited evidence to explain elements in the case against him.\" Jimenez v. Aristeguieta, 311 F.2d 547, 556 (5th Cir. 1962). Needless to say, a habeas court can determine whether the magistrate's decision to deny discovery constituted an abuse of discretion that deprived the accused of due process. See id.; Jhirad, 536 F.2d at 484.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. In the alternative, the United Kingdom is free to withdraw its request for extradition in the conspiracy charge, in which case Quinn could be extradited to and tried in the United Kingdom on the murder charge. See supra p. 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* I have been authorized to include this footnote on behalf of the full panel. We are unanimous in our decision that the writ of habeas corpus issued by the district court must be vacated. We reach this difficult decision by somewhat different routes. Judge Duniway concurs in the result but not for the reasons that are set forth in this opinion. His reasons appear in his separate concurring opinion. Judge Fletcher concurs in the reasoning set forth in this opinion with the exception of the part that treats England and Northern Ireland as separate entities for purposes of applying the \"uprising\" component of the political offense doctrine. Her disagreement on that point causes her to dissent from the holding that Quinn may be extradited on the murder charge. As her concurring and dissenting opinion states, she would remand in order to permit the district court to determine the extent of Quinn's ties to Northern Ireland. I do not find it necessary to reach that issue, see page 68 infra, but believe that Judge Fletcher's argument regarding the necessity for such ties has considerable merit. We are unanimous in our holding that a remand to the district court is required with respect to the conspiracy charge. We also are unanimous that extradition on that count would not be proper in the absence of an appropriate resolution of the statute of limitations issue, a decision that must be made initially by the district court.\u003c/span\u003e\n\n",
    "body_length": 174186,
    "citedas": [
      "783 F.2d 776"
    ],
    "attorneys": "FOR PETITIONER/APPELLEE: Mark N. Zandies, AUSA, San Francisco, CA. FOR RESPONDENT/APPELLANT: Patricia Sarsfield Hallinan, Esq., Colleen Mary Rohan, Esq., Dale A. Drozd, Esq., HALLINAN, OSTERHOUDT, \u0026 POPLACK, San Francisco, CA.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before: DUNIWAY, FLETCHER, and REINHARDT, Circuit Judges",
    "citation_count": 203
  }
}
