{
  "id": "roHsPWYBTlTomsSBkloY",
  "document": {
    "title": "Limerick Ecology Action Inc. v. United States",
    "full_title": "LIMERICK ECOLOGY ACTION, INC. IN 85-3431, 86-3314, 87-3508, THOMAS MARTIN, F8255 IN 85-3444, 87-3190, 87-3565, ROBERT L. ANTHONY IN 85-3606 v. UNITED STATES NUCLEAR REGULATORY COMMISSION AND THE UNITED STATES OF AMERICA PHILADELPHIA ELECTRIC COMPANY, INTERVENOR",
    "jurisdiction": "Third Circuit",
    "date": "1989-02-28T00:00:00.000Z",
    "docket": "Nos. 85-3431, 85-3444, 85-3606, 86-3314, 87-3190, 87-3508, 87-3565",
    "body": "BECKER, Circuit Judge.\n\nI. INTRODUCTION\n\nThis opinion addresses several petitions for review of orders of the Nuclear Regulatory Commission (\"NRC\") granting a full power license to the Philadelphia Electric Co. (\"PECO\") for operation of Unit I of the Limerick Nuclear Power Generating Station (\"Limerick\") in Limerick, Pennsylvania. The Limerick plant is, along with the Indian Point plant near New York City, and the Zion plant near Chicago, one of three operating nuclear plants in the country located within 50 miles of a major metropolitan area. The Limerick plant is twenty-five miles from Philadelphia and approximately eight miles from the State Correctional Institution at Graterford (\"Graterford\"), the largest maximum security prison in Pennsylvania.\n\nTwo parties challenge the grant of a full power license. First, Limerick Ecology Action, Inc. (\"LEA\"), a citizens' group formed in opposition to the plant, contends that, in granting the full power license, the NRC violated the National Environmental Policy Act of 1969, 42 U.S.C. §§ 4321 to 4361 (1982) (\"NEPA\"), by failing adequately to consider: (1) severe accident mitigation design alternatives (\"SAMDAs\"); (2) the threat of reactor sabotage; and (3) the possible industrial and economic effects that might arise more than one year after a severe accident. The NRC has described severe accidents as \"those in which substantial damage is done to the reactor core whether or not there are serious offsite consequences.\" Policy Statement on Severe Reactor Accidents Regarding Future Designs and Existing Plants, 50 Fed. Reg. 32,138, 32,138 (1985) (\"Final Policy Statement\"). Second, Thomas Martin, a Graterford inmate, challenges the adequacy of the Commonwealth of Pennsylvania's plans to protect or evacuate the inmates in the event of a nuclear accident.\n\nWe are confronted at the outset by the NRC's contention that by making decisions under the Atomic Energy Act, 42 U.S.C. §§ 2011 to 2282 (1982) (\"AEA\"), it has precluded the need for consideration of environmental implications under NEPA. Because we conclude that consideration under NEPA should not be precluded by the AEA, we must address LEA's three specific contentions.\n\nLEA's first contention requires us to address the question whether, by excluding consideration of the environmental impact of SAMDAs through the use of a policy statement instead of a rulemaking, the NRC violated the first of NEPA's twin aims: consideration of \"every significant aspect\" of the environmental consequences of government actions. The Supreme Court has stated that \"the role of the courts [under NEPA] is simply to ensure that the agency has adequately considered and disclosed the environmental impact of its actions and that its decision is not arbitrary and capricious.\" Baltimore Gas \u0026 Electric Co. v. Natural Resources Defense Council, Inc., 462 U.S. 87, 97-98, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (1983).\n\nAlthough NEPA requires the Commission to undertake \"careful consideration,\" Baltimore Gas, 462 U.S. at 98, of environmental consequences, under Baltimore Gas it may issue a rulemaking to address and evaluate environmental impacts that are \"generic\", i.e., not plant-specific. We find in this case that (1) the SAMDAs were addressed through a policy statement, not a rulemaking, and that the policy statement does not represent the requisite careful consideration of the environmental consequences; and (2) the Commission did not find that such risks are remote and speculative and failed to give the requisite careful consideration to SAMDAs. Because the level of consideration given was legally inadequate, we will grant LEA's petition for review as to its first contention and remand the case to the NRC for consideration of severe accident mitigation design alternatives.\n\nLEA's second contention requires us to consider whether the NRC's refusal to consider specifically and separately the risk of sabotage in the Final Environmental Statement, NUREG-0974 (1984) (\"FES\") or in the licensing proceedings, on the ground that estimation of the risk is beyond the state of the art of risk assessment, violated NEPA. Because we conclude that LEA did not produce sufficient evidence to support its claim, and therefore that the NRC did not act arbitrarily or capriciously in denying specific and separate consideration of the risk of sabotage, we will deny LEA's petition on this issue.\n\nLEA's third and final contention requires us to decide whether the NRC impermissibly excluded consideration in the FES of the amount of any industrial or economic damages arising more than one year after a nuclear accident. Again, we conclude that the NRC did not act arbitrarily or capriciously in refusing to consider such damages.\n\nWe then turn to the AEA based challenge of petitioner Thomas Martin, a Graterford inmate, to the prison evacuation plan.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Martin challenges the adequacy of the nuclear accident emergency response evacuation plan prepared by the Commonwealth's Bureau of Corrections, which provides for evacuation of maximum security inmates through two important steps: (1) telephone calls to off-duty guards to notify them of the need to assist in the evacuation; and (2) transportation of inmates from the prison on commercial buses driven by civilian bus drivers. Martin claims that the NRC erred in approving civilian evacuation training, evacuation time, and manpower mobilization aspects of the emergency response plan. Martin also contends that the NRC erred in excluding from consideration three of his other objections to the response plan: lack of participation in the planning by the guards' union; the potential for panic by inmates and guards; and the need for actual training (as opposed to the mere offer of training) of civilian drivers. Finally, Martin contends that the Atomic Safety and Licensing Board (\"Licensing Board\") of the NRC violated his procedural due process rights in its treatment of his various contentions.\n\nWe hold that substantial evidence exists to support the Commission's acceptance of the estimated time for evacuation and the off-duty staff notification system and therefore that the NRC did not abuse its discretion with respect to these issues. We also hold that the NRC's exclusion of the issues of the union's awareness of the plan and of the inmates' claimed potential for panic was within the bounds of the agency's discretion. The issue of whether the civilian drivers must actually receive training was, however, properly raised by the inmates below, and we hold that the NRC abused its discretion in excluding consideration of that issue. We therefore remand to the Licensing Board for initial consideration of that contention. Finally, we conclude that there was no violation of Martin's due process rights.\n\nProper understanding of the issues requires that we first review the statutory framework and next the facts and procedural history of the case. We will then turn to a resolution of the legal issues raised by the petitions.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nII. THE STATUTORY FRAMEWORK\n\nA. The Atomic Energy Act and the Licensing Process\n\nThe Atomic Energy Act provides for a two-stage approval process for consideration of the public health and safety aspects of nuclear power plant licensing: (1) consideration of whether the applicant should be able to construct a plant, see 42 U.S.C. § 2235; and (2) consideration of whether a facility should be licensed to generate electricity. Id. The NRC technical staff reviews an applicant's safety and environmental reports, conducts technical studies, and employs consultants to review safety and environmental concerns. The staff's conclusions are then set forth in a Safety Evaluation Report, an Environmental Impact Statement, and supplements to both documents.\n\nSection 189 a of the AEA, 42 U.S.C. § 2239(a) (1982), the Administrative Procedure Act (\"APA\"), 5 U.S.C. §§ 551 to 706 (1982), and Commission regulations, 10 C.F.R. Part 2 (1988), establish a hearing framework for examining issues. First, a three-member Licensing Board is formed, generally composed of one lawyer and two technical members. 10 C.F.R. Part 2, App. A. For operating license applications, a hearing must be held on material issues that are specifically and timely raised upon request of an interested person. Id. at §§ 2.105, 2.714; see generally id. at Part 2, App. A. The findings and conclusions of the Licensing Board constitute the agency's initial decision. Licensing Board decisions may be appealed to a three-member Appeal Board within forty days. Id. at § 2.786. However, the ultimate determination as to whether a facility's operation \"will be in accord with the common defense and security and will provide adequate protection to the health and safety of the public\" rests with the Commission itself. 42 U.S.C. § 2232(a) (1982).\n\nB. The National Environmental Policy Act\n\nThe National Environmental Policy Act of 1969, 42 U.S.C. §§ 4321 to 4361 (1982) (\"NEPA\"), requires that federal agencies prepare a \"detailed statement,\" known as an environmental impact statement, for every major federal action \"significantly affecting the quality of the human environment.\" 42 U.S.C. § 4332(2)(C). The statement must address \"any adverse environmental effects\" of the project and \"alternatives to the proposed action.\" Id.\n\nWe have observed that \"the purpose of NEPA is to focus national policymaking on the interdependence between human beings and the environment.\" Dunn v. United States, 842 F.2d 1420, 1426 (3d Cir. 1988). In Baltimore Gas \u0026 Electric Co. v. Natural Resources Defense Counsel, Inc., 462 U.S. 87, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (1983), the Supreme Court identified NEPA's \"twin aims.\" \"First, it 'places upon an agency the obligation to consider every significant aspect of the environmental impact of a proposed action.'\" Baltimore Gas, 462 U.S. at 97 (quoting Vermont Yankee Nuclear Power Corp. v. Natural Resources Defense Counsel, Inc., 435 U.S. 519, 553, 55 L. Ed. 2d 460, 98 S. Ct. 1197 (1978)). \"Second, it ensures that the agency will inform the public that it has indeed considered environmental concerns in its decisionmaking process.\" Id. However, in Vermont Yankee, 435 U.S. at 558, the Supreme Court made clear that NEPA imposes duties upon agencies that are \"essentially procedural.\" See also Strycker's Bay Neighborhood Council, Inc. v. Karlen, 444 U.S. 223, 228, 62 L. Ed. 2d 433, 100 S. Ct. 497 (1980) (per curiam) (holding that NEPA permits a court to ensure that an agency has considered environmental consequences but not to review the weight given to the consequences).\n\nThe Council on Environmental Quality (\"CEQ\") issues general regulations for NEPA, while each agency issues its own implementing regulations.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e We have determined that the CEQ guidelines are not binding on an agency that has not expressly adopted them. Township of Lower Alloways Creek v. Public Service Electric \u0026 Gas Co., 687 F.2d 732, 740 n. 16 (1982). The NRC has acknowledged its obligation to comply with NEPA, however, by issuing regulations governing the consideration of the environmental impact of the licensing and regulatory actions of the agency. See 10 C.F.R. §§ 51.1 (1988); Susquehanna Valley Alliance v. Three Mile Island Nuclear Reactor, 619 F.2d 231, 239 (3d Cir. 1980), cert. denied, 449 U.S. 1096, 66 L. Ed. 2d 824, 101 S. Ct. 893 (1981). These regulations require the Commission to consider \"the alternatives available for reducing or avoiding adverse environmental and other effects.\" 10 C.F.R. § 51.71(d) (incorporated by reference in 10 C.F.R. § 51.90). The Commission has also issued a NEPA policy statement mandating consideration of alternative plant designs, discussed infra Typescript at 26.\n\nIn 1971, the Atomic Energy Commission (\"AEC\"), the predecessor of the NRC, published proposed regulations to implement NEPA which created an accident classification scale, rating classes of accidents according to risk. See Consideration of Accidents in Implementation of the National Environmental Policy Act of 1969, 36 Fed. Reg. 22,851 (1971). Although never promulgated in final form, the NRC followed these proposed regulations throughout the 1970s. In classes one through eight, the AEC placed so-called \"design-basis accidents,\" those accidents hypothesized on the basis of certain specific failures that the design attempted to protect against. Apart from class-one accidents, which were classified as \"trivial,\" the AEC required that NEPA reviews for each plant consider the risks from that plant's design of all of these design-basis accidents.\n\nIn class nine, the AEC placed severe potential accidents that involved more complex sequences of successive failures, such as a partial reactor core melt accompanied by the production of large quantities of steam and gas or the rupture of the containment vessel. The AEC proposed regulations assumed that a severe accident's probability was so low that no consideration of its risks or consequences was necessary in the review of individual plants. Early NRC environmental impact statements did not consider the risk of severe accidents, because these proposed NRC regulations classified severe accidents as too unlikely to occur to necessitate consideration of consequences. Courts upheld this policy. See, e.g., Carolina Environmental Study Group v. United States, 166 U.S. App. D.C. 416, 510 F.2d 796, 798-800 (D.C. Cir. 1975).\n\nHowever, beginning in 1975, new and controversial studies such as the Reactor Safety Study indicated that the risk of severe core accidents was greater than previously thought. See Reactor Safety Study: An Assessment of Accident Risks in U.S. Commercial Nuclear Power Plants, NUREG-75/014 at 135 (1975). In addition, a new risk assessment method was developed, called Probabilistic Risk Assessment (\"PRA\"), which involved modeling potential accident sequences and estimating their likelihood. A 1977 study could not determine whether these probability estimates were high or low, but it did determine that enormous possibilities for error existed in the estimates because of the difficulties of the PRA approach. See Risk Assessment Review Group Report to the U.S. Nuclear Regulatory Commission, NUREG/CR-0400 at vi-x, 4-5 (1978).\n\nIn combination with the March 28, 1979, Three Mile Island Unit 2 accident (\"TMI\"), which involved a partial core melt, these studies induced the NRC in 1980 to issue a policy statement revoking the earlier classification scheme and requiring consideration of severe accidents in future NEPA reviews, see Statement of Interim Policy, Nuclear Power Plant Accident Considerations Under the National Environmental Policy Act of 1969, 45 Fed. Reg. 40,101 (1980) (\"NEPA Interim Policy Statement\").\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The studies (coupled with TMI) also induced the NRC to expand the scope of emergency planning requirements, see 10 C.F.R. Part 50, App. E (1988), and to initiate a research program into severe accident risks and mitigation alternatives, including a review of Limerick and other facilities located near major population centers. \"Filtered-vented containment systems,\" which LEA asserts should have been considered in the Limerick FES, are one of the mitigation alternatives studied, having received widespread attention and some acceptance in Europe. See infra at note 11.\n\nFollowing the 1980 actions, the NRC took several actions, ostensibly under the AEA's required safety procedures that it has subsequently applied to NEPA environmental reviews. First, the NRC set qualitative and quantitative goals for the risk of severe accidents in the Safety Goal Development Program, 48 Fed. Reg. 10,772 (1983) (\"Safety Goals Policy Statement\"). This Policy Statement indicated that plant designs should ensure that the \"likelihood\" of an accident resulting in a large-scale core melt is \"less than one in 10,000\" per year of operation. Id. at 10,775. The NRC refused, however, to adopt quantitative limits on the risk of severe accidents through regulations, because it concluded that PRA techniques \"have substantial associated uncertainties\" that \"raise[] a serious question whether . . . [a] quantitative risk goal can be verified with a sufficient degree of confidence.\" Id. Instead, the NRC retained its regulatory \"defense-in-depth approach . . . in order to prevent accidents from happening and to mitigate their consequences\" through \"siting in less populated areas\" and \"emergency response capabilities.\" Id.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nSecond, the NRC issued a release in which it continued to eschew numerical licensing goals. See Proposed Commission Policy Statement on Severe Accidents and Related Views on Nuclear Reactor Regulation, 48 Fed. Reg. 16,014, 16,016 (1983) (\"Proposed Policy Statement\"). Because the NRC proposed to find the risk of accident for already designed plants acceptable, it proposed to conclude that the capability of current designs or alternatives \"to control or mitigate severe accidents should not be addressed in case-related safety hearings.\" Id. at 16,018. However, the NRC did instruct that applications for new construction permits for boiling water reactors should provide for \"filtered-vented containment systems, or a variation of such systems . . . if these yield a cost-effective reduction in risk.\" Id. at 16,019. Commissioners Asselstine and Gilinsky dissented on the ground that the Commission had not received any briefings from the staff regarding the studies initiated in 1980 and hence could not possibly reach any conclusions based on those studies. Id. at 16,023.\n\nSubsequently, in its Policy Statement on Severe Reactor Accidents Regarding Future Designs and Existing Plants, 50 Fed. Reg. 32,138 (1985) (\"Final Policy Statement\"), the Commission concluded that no changes in design regulations were needed, apparently because PRA's indicated \"that existing plants pose no undue risk to public health and safety.\" Id. at 32,138. Most important for this case is the fact that, although the Commission stated that \"[a] fundamental objective\" was \"to take all reasonable steps\" not only to reduce the chances of a severe accident but also \"to mitigate the consequences of such an accident should one occur\", id. at 32,139, the Commission excluded consideration of severe accident mitigation design alternatives from individual licensing proceedings. It concluded that \"individual licensing proceedings are not appropriate forums for a broad examination of the Commission's regulatory policies relating to evaluation, control and mitigation of accidents more severe than the design basis.\" Id. at 32,144.\n\nThe Commission did not explain its reasoning, but simply stated that \"plant-specific review of severe accident vulnerabilities . . . is not considered to be necessary to determine adequate safety or compliance with NRC safety regulations under the Atomic Energy Act.\" Id. at 32,138. Commissioner Asselstine again dissented, arguing that the unreliability of PRA analysis precluded confidence in the NRC's judgment about reactor safety.\n\nAlthough the NRC issued the Final Policy Statement under the Atomic Energy Act, the NRC specifically applied the Statement to exclude environmental considerations under NEPA in the case sub judice. In addition to applying the Final Policy Statement to NEPA reviews, the Commission amended its NEPA regulations in 1984. See Environmental Protective Regulations for Domestic Licensing and Related Regulatory Functions and Related Conforming Amendments, 49 Fed. Reg. 9352 (1984). The amended regulations adopt the CEQ guidelines with a few significant exceptions. The CEQ guidelines, 40 C.F.R. § 1502.22(b) (1985) (superseded by 40 C.F.R. § 1502.22(b) (1987)), state that where an agency acts despite not having access to information regarding the potential adverse impact of its action, the agency \"shall include a worst case analysis and an indication of the probability . . . of its occurrence.\" In its notice amending its NEPA regulations, however, the Commission concluded that because NEPA has been held to be procedural only, and because the Commission viewed the worst-case analysis requirement as substantive, it was not bound by the provision. The NRC also indicated that the 1980 interim NEPA policy on severe accident risks would remain in effect pending further study and experience. See 49 Fed. Reg. at 9356-57.\n\nIn sum, the NRC originally thought severe accidents too unlikely to justify consideration of their likelihood in reviewing and determining the safety of nuclear plants. It retreated from that viewpoint following the TMI accident and subsequently set safety goals with respect to severe accidents. However, it refused to set quantitative limits; it provided that severe accident mitigation design alternatives should not be studied on a case-by-case basis; and it excluded environmental considerations under NEPA in the case sub judice.\n\nIII. PROCEDURAL HISTORY\n\nThe Limerick Generating Station is a nuclear electric generating plant with two light water reactors: Limerick Unit 1 is licensed and running; Limerick Unit 2 is still under construction. PECO received a permit to construct Units 1 and 2 in 1974, and applied for a license to operate Unit 1 in 1981. See 46 Fed. Reg. 42,557 (1981) (notice published by NRC informing the public that it could request a hearing on PECO's application). In response, the NRC convened a Licensing Board, which conducted hearings lasting ninety-five days and generating a 20,000-page transcript. Much of the activity concerned (1) challenges to the FES prepared by the staff to comply with NEPA and the Radiologic Emergency Response Plan (\"evacuation plan\") prepared in conjunction with the Federal Emergency Management Agency and (2) whether the Commonwealth of Pennsylvania had complied with NRC emergency planning regulations. See generally 40 C.F.R. Part 50, App. E (1988).\n\nIn addition to holding numerous conferences and public hearings during this period, the Licensing Board issued four partial initial decisions (\"PIDs\") under 10 C.F.R. § 2.714 regarding (1) supplementary cooling water systems, 17 N.R.C. 413 (1983); (2) on-site emergency planning, environmental and safety contentions, 20 N.R.C. 446 (1984); (3) off-site emergency planning issues, 21 N.R.C. 1219 (1985); and (4) Graterford prison emergency planning, 22 N.R.C. 101 (1985), supplemented at 24 N.R.C. 731 (1986). The licensing process culminated in the issuance of an operating license for Limerick I on June 19, 1987.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn 1982, LEA applied for and was admitted as an intervenor in the licensing proceedings. LEA filed petitions to review the second PID and the final licensing decision. Thomas Martin, a prisoner at Graterford, filed petitions to review the fourth PID and the final licensing decision. We consider LEA's petitions for review in Part III and Martin's petitions in Part IV.\n\nOur standard of review of an order granting a nuclear power operating license under section 10(e) of the APA, 5 U.S.C. § 706, is \"deferential; that order may not be overturned unless it is found to be 'arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with law.'\" In re Three Mile Island Alert, Inc., 771 F.2d 720, 727 (3d Cir. 1985), cert. denied, 475 U.S. 1082, 106 S. Ct. 1460, 89 L. Ed. 2d 717 (1986).\n\nIV. THE APPEAL OF LIMERICK ECOLOGY ACTION\n\nLEA appeals from the Commission's rejection of three contentions decided in the second PID. The Appeal Board affirmed the second PID, Philadelphia Electric Company (Limerick Generating Station, Units 1 and 2), 22 N.R.C. 681 (1985), as did the NRC itself, by refusing review, 23 N.R.C. 125 (1986).\n\nA. Does a Finding of Adequate Protection Under the AEA Preclude Consideration Under NEPA ?\n\nIn rejecting consideration of design alternatives, the Appeal Board concluded that \"NEPA could not logically require more than the safety provisions of the Atomic Energy Act.\" 22 NRC at 696 n. 10. Before turning to the three contentions addressed in the second PID, we must consider the NRC's argument that a finding of adequate protection of public health and safety under section 182 a of the AEA precludes the need for further consideration under NEPA. The NRC seeks to extend that decision here to encompass all three rejected contentions. LEA responds that NEPA imposes additional requirements over and above the AEA, and that the Appeal Board erred in excluding such considerations.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe language of NEPA indicates that Congress did not intend that it be precluded by the AEA. Section 102 of NEPA requires agencies to comply \"to the fullest extent possible.\" 42 U.S.C. § 4332. Although NEPA imposes responsibilities that are purely procedural, see Vermont Yankee, 435 U.S. at 558, there is no language in NEPA itself that would permit its procedural requirements to be limited by the AEA. Moreover, there is no language in AEA that would indicate AEA precludes NEPA.\n\nThe legislative history of the phrase \"to the fullest extent possible\" indicates that Congress intended that NEPA not be limited by other statutes by implication. The proposed language, which was replaced by \"to the fullest extent possible\" in the current statute, stated that \"nothing in this Act shall increase, decrease or change any responsibility or authority of any Federal official or agency created by any other provision of law.\" Conf. Rep. No. 765, 91st Cong., 1st Sess. 9-10, reprinted in 1969 U.S. Code Cong. \u0026 Admin. News 2767, 2770. The Conference Report stated that \"the purpose of the new language is to make it clear that each agency of the Federal Government shall comply with the directives [of section 102] unless the existing law applicable to such agency's operations expressly prohibits or makes full compliance with one of the directives impossible.\" Id. The Report concluded that \"it is the intent of the conferees that the provision 'to the fullest extent possible' shall not be used by any Federal agency as a means of avoiding compliance with the directives set out in section 102.\" Id. Hence, the legislative history unequivocally supports LEA's contention that the AEA cannot preclude application of NEPA by implication. The Commission in the case sub judice does not maintain that the AEA contains express provisions prohibiting compliance with NEPA, nor does it argue that compliance is impossible.\n\nThird, courts have repeatedly held that, as suggested by the legislative history, compliance with NEPA is required unless specifically excluded by statute or existing law makes compliance impossible. See, e.g., Public Service Co. of New Hampshire v. NRC, 582 F.2d 77, 81 (1st Cir.) (\"The directive to agencies to minimize all unnecessary adverse environmental impact obtains except when specifically excluded by statute or when existing law makes compliance with NEPA impossible.\"), cert. denied, 439 U.S. 1046, 99 S. Ct. 721, 58 L. Ed. 2d 705 (1978).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Accordingly, \"unless there are specific statutory provisions which necessarily collide with NEPA, the Commission was under a duty to consider and, to the extent within its authority, minimize environmental damage. . . .\" Public Service, 582 F.2d at 81 (footnote omitted). On the basis, therefore, of the language of NEPA and AEA, the legislative history of NEPA, and the existing case law, we find no intent by Congress that the AEA preclude application of NEPA.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFurthermore, the NRC points to no cases indicating that exclusion of consideration of an issue under the AEA requires exclusion of the same issue from consideration under NEPA. As we discussed supra note 7, the case law suggests that where review of environmental implications occurs under a \"functional equivalent\" of NEPA, the review need not be repeated. But these cases do not suggest that NEPA can never require consideration of additional alternatives simply because there is some overlap in the considerations required by both statutes. Nor do the cases indicate that an issue not considered under the AEA need not be considered under NEPA.\n\nIn Citizens for Safe Power, Inc. v. NRC, 173 U.S. App. D.C. 317, 524 F.2d 1291, 1299 (D.C. Cir. 1975), the court indicated that where the concerns under the AEA and NEPA are the same, conclusions reached on the basis of evidence received in \"environmental\" hearings conducted under NEPA may be applied to \"health and safety\" considerations under the AEA. As the court stated, to hold otherwise would amount to \"stultifying formalism.\" Id. The court did not indicate, however, that when issues are excluded from consideration under the AEA they must also be excluded under NEPA. In contrast, the court noted, albeit in dictum, that it is \"unreasonable to suppose that [environmental] risks are automatically acceptable, and may be imposed upon the public by virtue of the AEA, merely because operation of a facility will conform to the Commission's basic health and safety standards.\" Id. It is this automatic exclusion which the NRC seeks here and which we refuse to adopt.\n\nIn its affirmance of the Appeal Board's decision, the NRC stated that the Commission's Final Policy Statement \"was intended to address both NEPA and Atomic Energy Act reviews. . . . Insofar as this type of accident mitigation is concerned, NEPA and the Atomic Energy Act reviews are both directed at cost-effective measures to reduce the risk from accidental discharges of radioactive materials, and it would make no sense for the Commission to implement different review policies under the two statutes.\" Philadelphia Electric Co., 23 N.R.C. 125, 127 (1986). However, the NRC's regulations implementing NEPA require it to consider \"the alternatives available for reducing or avoiding adverse environmental and other effects.\" 10 C.F.R. § 51.71(d) (incorporated by reference in 10 C.F.R. § 51.90). And the Commission's most recent NEPA policy statement makes clear that among the alternatives to be considered are alternative plant designs. 49 Fed. Reg. 9352, 9354 (1984). Thus, whether or not there are two review policies, the NRC was required to address SAMDAs and cannot now look to sufficiency under the AEA to avoid that obligation.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In sum, by whatever route the NRC claims to have determined the environmental impact of Limerick, it has not succeeded, or attempted to succeed, in convincing this Court that the procedural requirements of NEPA have been met.\n\nB. Severe Accident Mitigation Damage Alternatives\n\n1. The Commission's Decision\n\nIn its second PID, the Licensing Board resolved numerous technical, environmental, and on-site emergency planning issues in favor of PECO, and authorized issuance of a low-power license for Limerick Unit 1. LEA contends that generic staff studies of SAMDAs indicate that such alternatives should be considered in the licensing process. Severe accident mitigation design alternatives are, as the name suggests, possible plant design modifications that are intended not to prevent an accident, but to lessen the severity of the impact of an accident should one occur.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe NRC staff prepared a FES for Limerick that sought to comply with NEPA and particularly with the NRC's 1980 Interim Policy Statement on Nuclear Power Plant Accident Considerations, 45 Fed. Reg. 40,101. The FES stated that, consistent with the interim policy statement, it would include \"a reasoned consideration of the environmental risks (impacts) attributable to accidents at the particular facility or facilities within the scope of [the] statement.\" FES at 1-3. The FES contained an extensive review of the risk of severe accidents at Limerick, including the results of a PRA performed for Limerick. Nevertheless, although the FES reviewed existing containment mechanisms, see FES at 5-69, it neither considered nor specifically rejected SAMDAs. Instead, the FES concluded:\n\nAccident risks from Limerick are expected to be a small fraction of the risks the general public incurs from other sources. Further, the best estimate calculations show that the risks of potential reactor accidents at Limerick are within the range of such risks from other nuclear power plants.\n\nBased on the foregoing considerations of environmental impacts of accidents, which have not been found to be significant, the staff has concluded that there are no special or unique circumstances about the Limerick site and environs that would warrant consideration of alternatives for Limerick Units 1 and 2.\n\nFES at 5-126.\n\nLEA challenged this failure to consider design alternatives. The Licensing Board excluded consideration of mitigation design alternatives, however, on the ground that because the contention was too general, it failed the Commission's \"basis and specificity\" requirement under 10 C.F.R. § 2.714(b). See 22 N.R.C. at 693. According to the Licensing Board, LEA failed because it did not identify a \"particular, cost-effective design alternative for a particular accident sequence.\" Id.\n\nThe Appeal Board concluded that LEA's contentions met the basis and specificity requirement because they were based on the studies sponsored by the NRC, which included preliminary conclusions regarding design mitigation alternatives at Limerick itself. Philadelphia Electric Co., 22 N.R.C. at 693-94. In fact, the NRC has studied, designed and assessed the costs of mitigation systems.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The Appeal Board upheld the exclusion of design mitigation alternatives, however, holding that the contention was precluded by the Final Policy Statement. Id. at 693-96.\n\nThe Appeal Board explicitly relied on the Final Policy Statement's directive that \"severe accident mitigation measures, beyond already existing Commission requirements, 'should not be addressed in case-related safety hearings.'\" Id. at 696-97 (quoting Final Policy Statement, 50 Fed. Reg. at 32,145). The Board noted that because the Final Policy Statement found that existing plants posed no undue risk to the public health and safety and that research was ongoing, the policy statement precluded review of design alternatives.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e As we have explained above, the Board also noted that there is \"Commission precedent holding that NEPA could not logically require more than the safety provisions of the Atomic Energy Act, and court precedent recognizing the inherent interrelationship of these statutes and thus issues raised under each.\" 22 N.R.C. at 696 n. 10 (citing Public Service \u0026 Electric Co., 9 N.R.C. 14, 39 (1979); Citizens for Safe Power, Inc. v. NRC, 173 U.S. App. D.C. 317, 524 F.2d 1291, 1299-1300 (D.C. Cir. 1975)).\n\nAdditionally, the Appeal Board reasoned that although SAMDAs were being excluded from consideration in the Limerick licensing proceedings, they were not being ignored. Although the Board did not state or even intimate that it would, without the Final Policy Statement, reject the design alternatives contention, it pointed to several additional factors supporting its decision. The Board noted that extensive research into design alternatives was ongoing. In addition, the Board pointed out that although the FES did not consider design alternatives for Limerick, it did consider severe accidents, concluding that \"there are no special or unique circumstances about the Limerick site,\" 22 N.R.C. at 697 (citing FES at 5-126), and maintaining that because the consideration of a severe accident was done at the Commission's discretion (and was not required), \"[a] fortiori, consideration of possible design alternatives to mitigate a severe accident is not required either.\" Id.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn sum, the Appeal Board upheld the decision not to consider design alternatives on the grounds that the Policy Statement's conclusion that existing designs were sufficiently safe to exclude considerations of alternatives controlled its decision; that NEPA \"could not logically require more than the safety provisions of the Atomic Energy Act\"; that ongoing studies were still considering design alternatives; and that the FES's consideration of severe accidents (although not of design alternatives) was sufficient.\n\nThe NRC refused review, thus affirming the decision of the Appeal Board. In the order declining review, the Commission briefly stated that the Final Policy Statement was intended to address both NEPA and AEA reviews. The Commission stated that \"insofar as this type of accident mitigation is concerned, NEPA and Atomic Energy Act reviews are both directed at cost-effective measures to reduce the risk from accidental discharges of radioactive materials, and it would make no sense for the Commission to implement different review policies under the two statutes.\" 23 N.R.C. at 127. Commissioner Asselstine dissented. Id. at 128. He noted that the order extended the Final Policy Statement's requirement of exclusion of design alternatives under the AEA to exclusion also under NEPA. He also noted that the NRC's estimate of the chance of an accident at least as severe as TMI occurring in the next 20 years is \"50-50.\" According to Commissioner Asselstine, \"a 50-50 chance within the next twenty years is [not] an acceptable level of risk,\" particularly for plants such as Limerick and Indian Point, which are located in densely populated areas. Id. at 129.\n\n2. The Propriety of General Exclusion by the Final Policy Statement\n\nThe parties do not dispute that the Appeal Board excluded consideration of design alternatives on the basis of the Final Policy Statement, and that the NRC's opinion affirmed on this ground. See 23 N.R.C. at 126. On appeal, LEA and the Commonwealth of Pennsylvania in its amicus brief acknowledge that after Baltimore Gas, the NRC may preclude consideration of generic issues by rulemaking. They contend, however, that because the Final Policy Statement was a \"policy statement\" as opposed to a \"rule\" and because it seeks to apply to all plants yet does not concern a generic issue, it does not have the force of a rulemaking and should not be permitted to exclude consideration of mitigation alternatives. The distinction is important: courts have repeatedly held that if an agency action is merely a policy statement, \"when the agency applies the policy in a particular situation, it must be prepared to support the policy just as if the policy statement had never been issued.\" Pacific Gas \u0026 Electric Co. v. Federal Power Commission, 164 U.S. App. D.C. 371, 506 F.2d 33, 37 (D.C. Cir. 1974).\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\na. The NRC's Pronouncement: Policy Statement or Rule?\n\nWe begin by briefly reviewing the process by which the NRC arrived at its Final Policy Statement. On October 2, 1980, the NRC published The Advanced Notice of Proposed Rulemaking, 45 Fed. Reg. 65,474 (1980), in which it indicated that a long-term rulemaking effort was being initiated that would establish policy goals and requirements relating to core-melt accidents greater than the \"design basis.\" The NRC retreated from this formal rulemaking proceeding, however, in its Proposed Policy Statement, 48 Fed. Reg. 16,014 (1983). In the Proposed Policy Statement, the Commission proposed to replace long-term generic rulemaking in favor of future \"rulemakings on specific standard plant designs and regulatory decisions on other classes of existing or future plants which may, or may not, include rulemaking.\" Id. at 16,014. Instead of a severe accident rulemaking, the NRC stated that it would promulgate rules for future plants only, and that for operating plants or those under construction it would exclude consideration of design alternatives as a matter of Commission policy while research into design alternatives was ongoing.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The proposed exclusion of design alternatives was unequivocal, although it was characterized as a policy statement, not a rule.\n\nThe Final Policy Statement revised the Proposed Policy Statement, but on the issue of design alternatives for existing plants or those under construction, the NRC reiterated its refusal to consider such alternatives in individual licensing proceedings. Again, the NRC asserted that it was excluding such considerations on the basis of its \"policy statement,\" and stated that it \"sees no present basis for immediate action on generic rulemaking [such as a rule requiring certain mitigation design alternatives] or other regulatory changes for these plants because of severe accident risk.\" 50 Fed. Reg. at 32,138. Because the NRC has repeatedly characterized its exclusion of design alternatives as a policy statement, not a rulemaking, we must determine the impact of that determination on the validity of the exclusion in the case sub judice.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe agency's label of an agency action, although one factor to be considered, does not control whether the action is in fact a rulemaking. Cerro Metal Products v. Marshall, 620 F.2d 964, 981-82 (3d Cir. 1980). Instead, \"it is the substance of what the [agency] has purported to do and has done which is decisive.\" Columbia Broadcasting System v. United States, 316 U.S. 407, 416, 86 L. Ed. 1563, 62 S. Ct. 1194 (1942); see also Lewis-Mota v. Secretary of Labor, 469 F.2d 478, 481-82 (2d Cir. 1972) (\"The label that the particular agency puts upon its given exercise of administrative power is not, for our purposes, conclusive; rather it is what the agency does in fact.\").\n\nIn Pacific Gas \u0026 Electric, 506 F.2d at 37, the District of Columbia Circuit recognized that the distinction between substantive rules and policy statements is not altogether clear, but noted several distinctions between the two. First, the court noted that a policy statement differs, because \"it is not finally determinative of the issues or rights to which it is addressed.\" Id. at 38. Here, however, the Final Policy statement purports finally to preclude consideration of design alternatives in individual licensing proceedings. See American Business Assoc. v. United States, 201 U.S. App. D.C. 66, 627 F.2d 525, 531 (D.C. Cir. 1980) (where a statement does not allow an official to exercise discretion, it is a rule rather than an interpretation); see also J. O'Reilly, Administrative Rulemaking § 3.08, at 59 (1983) (\"Agency discretion and its absence is one of the measures of a rule's substantive character.\").\n\nSecond, the Pacific Gas court determined that an action is a rule where \"not subject to challenge in particular cases.\" 506 F.2d at 39. Cf. Ryder Truck Lines, Inc. v. United States, 716 F.2d 1369, 1377-78 (11th Cir. 1983) (where an action sets forth a rebuttable presumption which may be challenged in individual proceedings, it is not a binding norm), cert. denied, 466 U.S. 927, 104 S. Ct. 1707, 80 L. Ed. 2d 181 (1984). Obviously, the intent of the Final Policy Statement at issue here is to exclude challenges in particular licensing decisions. Third, as the Pacific Gas court noted, policy statements are not subject to the notice and comment requirements of the APA.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Final Policy Statement, however, did undergo notice and comment.\n\nThus, although described as a policy statement, the NRC appears to have intended the Final Policy Statement to have the effect of a substantive rule, i.e., it appears that it was intended to be: (1) finally determinative as to the issue of design alternatives for Limerick; (2) not subject to challenge in the individual licensing proceeding; and (3) subjected to notice and comment procedures.\n\nAlthough the Final Policy Statement more closely approximates a substantive rule than a policy statement, the NRC asserts before this Court that it did not promulgate a binding rule:\n\nBecause the policy statement was not promulgated by the Commission as a binding rule, petitioners were free (and arguably obliged) to challenge it when the Appeal Board applied the policy statement to affirm the Licensing Board's exclusion of their contention. Because the Commission does not argue that the policy statement was immune to challenge in individual licensing proceedings, as a rule would have been, the petitioners' various arguments that turn on the fact that the policy statement was not a rule are simply irrelevant.\n\nNRC Br. at 33 n.16.\n\nThe NRC cannot have it both ways, however. The Appeal Board decision and the subsequent order of the full Commission unequivocally indicated that the issue of mitigation design alternatives could not be challenged in the Limerick licensing proceeding. It is plain that, notwithstanding the Commission's protestation to the contrary in its brief, the Commission did, in fact, rely on the prior statement itself without examining the substantive arguments for considering design alternatives.\n\nWe conclude that the Final Policy Statement here should not be accorded the stature of a rule. First, it was described as a policy statement by the NRC in the proposed and final Federal Register notices. An informed public interest group such as LEA, aware of the notice, and also (presumably) aware of the substantial precedent that policy statements cannot preclude consideration in individual licensing proceedings, might reasonably have been led to concentrate scarce resources on a challenge to a decision in a specific licensing proceeding such as this one rather than to a generic policy statement which, by definition, can have no binding effect. The NRC's assertion that the \"policy statement was not promulgated . . . as a binding rule\" indicates in no uncertain terms the stature that the Commission accords the Final Policy Statement before this court. We cannot hold the public to a higher standard of divining the actual function of the Statement.\n\nMoreover, it is uncertain whether, even if LEA had sought judicial review of the Final Policy Statement at the time of its promulgation, review would have been permitted. General policy statements, because they are ineffective except as applied and defended in specific proceedings, are often insulated from judicial review at the time of issuance. See, e.g., Regular Common Carrier Conference v. United States, 202 U.S. App. D.C. 248, 628 F.2d 248, 252 (D.C. Cir. 1980). Although it is uncertain whether, because the Final Policy Statement sought to foreclose consideration of design alternatives in all proceedings, the statement could have been challenged in court at the time of its publication, a reviewing court might reasonably have concluded that because the NRC chose to proceed under the \"policy statement\" rubric, it intended to defend the policy where challenged in licensing proceedings and hence a generic challenge would be \"premature.\" National Association of Insurance Agents, Inc. v. Board of Governors, 160 U.S. App. D.C. 144, 489 F.2d 1268, 1271 (D.C. Cir. 1974).\n\nAt all events, we need not decide whether the Final Policy Statement could have been challenged at the time of issuance because it is contrary to the intent of the APA to force the public to divine the obfuscated intention of the NRC. We conclude that the NRC's Final Policy Statement is entitled to no greater deference than any other policy statement, i.e., none.\n\nb. The NRC's Failure to Give Careful Consideration to SAMDAs\n\nIn Baltimore Gas \u0026 Electric Co. v. Natural Resources Defense Council, 462 U.S. 87, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (1983), the Supreme Court upheld an NRC rule establishing that licensing boards should assume for the purposes of individual licensing decisions that the permanent storage of radioactive wastes would have no significant environmental impact and could not affect the decision whether to license a particular nuclear plant. First adopted after \"extensive informal rulemaking proceedings\" and later finalized after formal rulemaking proceedings, see 44 Fed. Reg. 45,362 (1979), the NRC's \"zero-release\" assumption, as indicated in a table compiling the environmental effects of nuclear fuel storage, dictated that \"'no further discussion of such environmental effects shall be required.'\" Baltimore Gas, 462 U.S. at 93, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (quoting 42 Fed. Reg. 13,806 (1977)). The Court of Appeals for the District of Columbia Circuit had held that the rules were arbitrary and capricious and not in accordance with NEPA, because the NRC had failed to include the uncertainties surrounding the zero-release assumption into the licensing process in a way that the uncertainties could affect the outcomes of any particular licensing decision. The D.C. Circuit invalidated the rule adopting the zero-release assumption in part because the rule prevented the uncertainties in the assumption from affecting any individual licensing decision, but did not find the environmental effects to be insignificant as required by NEPA.\n\nThe Supreme Court's reversal was predicated upon the fact that the zero-release assumption was within the bounds of reasoned decisionmaking under the APA. Although the Commission did not allow the uncertainties involved in making the zero-release assumption to affect any particular licensing, the Court determined that through the extensive rulemaking it \"made the careful consideration and disclosure required by NEPA.\" Id. at 98. The Court held that exclusion by a generic rule was appropriate because, since the rule was predicated upon storage of wastes at a \"common long-term repository\" (bedded-salt repositories), \"the environmental effects of much of the fuel cycle are not plant specific.\" Id. at 101. According to the Court, the generic nature of the problem therefore could be regulated efficiently and consistently by a generic proceeding. The Court then concluded that because the zero-release assumption, when read in context with the other assumptions made in the rule, represented a reasonable statement of risks and because the predictions of environmental effects were scientific judgments within the Commission's \"special expertise,\" the zero-release assumption was not arbitrary and capricious. Id. at 103.\n\nBaltimore Gas is readily distinguishable from the NRC's decision not to consider SAMDAs, however. First, in Baltimore Gas the NRC proceeded on the basis of a formal rulemaking, whereas in this case, as the discussion supra explains, the NRC promulgated the decision not to consider mitigation alternatives as a policy statement. To the extent we hold the NRC to its unequivocal language in the Final Policy Statement and on review, the NRC cannot simply reject consideration of design alternatives, but must fully defend its reasons for doing so.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e This the Licensing Board, Appeal Board, and full Commission explicitly declined to do. ASLB Order (unpublished), slip op. at 1, 3 (April 20, 1984); 22 N.R.C. at 693-96; NRC Order, slip op. at 2 (March 2, 1986).\n\nAs we discussed above, numerous courts have held that policy statements must be supported just as if they did not exist. See Pacific Gas \u0026 Electric Co., 506 F.2d at 38. Even the rulemaking in Baltimore Gas, 462 U.S. at 98-99, which, as a rulemaking, was not as vulnerable to challenge, reflected \"the careful consideration and disclosure required by NEPA.\" We therefore review whether the FES or the Final Policy Statement itself provides support for the exclusion of SAMDAs.\n\nFirst, to qualify, the FES must contain sufficient discussion of the relevant issues and opposing viewpoints to enable the decisionmaker to take a \"hard look\" at the environmental factors and to make a reasoned decision. Kleppe v. Sierra Club, 427 U.S. 390, 410 n.21, 49 L. Ed. 2d 576, 96 S. Ct. 2718 (1976). The impact statement must be sufficient to enable those who did not have a part in its compilation to understand and consider meaningfully the factors involved. Environmental Defense Fund, Inc. v. Corps of Engineers, 492 F.2d 1123, 11367 (5th Cir. 1974). Cf. Dunlop v. Bachowski, 421 U.S. 560, 572, 44 L. Ed. 2d 377, 95 S. Ct. 1851 (1975) (noting that a statement by an agency of the reasons for its determination is crucial to effective judicial review). Here, as we discussed supra, Typescript at 32, the FES neither considered nor specifically rejected SAMDAs.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nSecond, preclusion from consideration in individual licensings must be based on a judgment that the issue could not affect the decisions therein. However, the policy statement at issue excludes consideration of design alternatives without making any conclusions about the effectiveness or cost of any particular alternative. Nor does the Final Policy Statement indicate that the NRC has determined that current plants are so safe that no design mitigation could be worthwhile. Rather, the Commission merely states its belief that SAMDAs \"should not be addressed in case-related safety hearings.\" 50 Fed. Reg. at 32,145. Yet, this conclusion is undercut by the Commission's statement earlier in the Final Policy Statement that the NRC \"intends to take all reasonable steps . . . to mitigate the consequences of [a severe] accident. . . .\" Id. at 32,139. The NRC further pointed out that \"the occurrence of a severe accident is more likely at some plants than at others. At each plant there will be systems, components or procedures that are the most significant contributors to severe accident risk,\" id., implying that SAMDAs should most appropriately be considered on a case-by-case basis. It would seem, even on the Commission's own terms, that a failure to consider SAMDAs in the Limerick proceeding could affect the final decision and, therefore, that preclusion from consideration was an abuse of discretion.\n\nThird, it is axiomatic that the generic approach of Baltimore Gas will not suffice where the underlying issues are not generic.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e In Baltimore Gas, the rulemaking concerned an unquestionably generic issue: the environmental effect of the long-term storage of nuclear waste from all plants, assuming that those wastes are stored not at individual plants, but in a \"common long-term repository.\" Baltimore Gas, 462 U.S. at 101. Given that the NRC's long-term storage plans did not provide for permanent storage at each individual site, the common storage of the wastes in bedded-salt repositories provided a generic basis for the regulation because the effect of long-term storage could be expected to arise from the situs of the waste, rather than from the particular characteristics of the plants at which the waste was generated.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe Commission's assertion as to the generic nature of severe accident risks would be analogous to Baltimore Gas only if the \"zero-release\" assumption in Baltimore Gas assumed that nuclear fuel would be stored at each individual plant permanently. However, to assume that in such a situation the NRC could permissibly promulgate a generic rule, as the NRC would have us conclude, would render meaningless the discussion in Baltimore Gas regarding the importance of common storage to the promulgation of a generic rule. As the Commission itself has noted, the impact of SAMDAs on the environment will differ with the particular plant's design, construction and location.\n\nMoreover, as a logical proposition, because risk equals the likelihood of an occurrence times the severity of the consequences, see Baltimore Gas, 462 U.S. at 104-05 (quoting NUREG-0116 at 2-11), even assuming that all plants are of exactly equal design and construction, which they obviously are not, the risk will vary with the potential consequences. Because the potential consequences will largely be the product of the location of the plant, the risk will vary tremendously across all plants. As the NRC itself has noted, \"the population distribution in the vicinity of the site affects the magnitude and location of potential consequences from radiation releases.\" 48 Fed. Reg. at 16,020.\n\nThis is particularly true for plants such as Limerick which were built near densely populated areas. The FES noted that \"the [Limerick] site is substantially higher than average in terms of population density,\" FES at 1-4, and that approximately seven million persons are expected to live within fifty miles of Limerick in the year 2000. Id. at 5-98. In other words, the same probability of the same accident in a plant such as Limerick will produce a higher risk than that produced by the same accident at a plant not located within twenty-five miles of a major metropolitan area.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Therefore, it is unlikely that severe accident mitigation can be treated as a generic issue. In fact, in its conclusion that severe accidents pose \"no undue risk,\" the Final Policy Statement did not take into account the added risks of a plant located in a densely populated area. Since the Commission never addressed this added risk problem in either the licensing proceeding or the Final Policy Statement, the record does not support the NRC's assertion that severe accident potential may be treated as a generic issue.\n\nTo summarize, the policy statement was not a rulemaking and therefore did not absolve the NRC of the required consideration of environmental effects. We conclude that the FES failed adequately to consider SAMDAs and, therefore, the decisionmaker did not take the requisite \"hard look\" at SAMDAs. We further conclude that a decision with respect to SAMDAs could affect the final decision and therefore preclusion of consideration of SAMDAs was inappropriate. Finally, on the record, the underlying issue of SAMDAs may not be treated as a generic issue and therefore summary treatment of SAMDAs was inappropriate.\n\n3. Is the Risk Remote and Speculative?\n\nThe NRC asserts that, even if we conclude that the exclusion from consideration under the Final Policy Statement was otherwise improper, we should uphold the Appeal Board's decision because the risks of severe accidents are \"remote and speculative.\" It is undisputed that NEPA does not require consideration of remote and speculative risks. See, e.g., San Luis Obispo Mothers for Peace v. NRC, 243 U.S. App. D.C. 68, 751 F.2d 1287, 1300-01 (D.C. Cir. 1984), rehearing en banc granted on other grounds, 245 U.S. App. D.C. 296, 760 F.2d 1320 (D.C. Cir. 1985), aff'd on rehearing en banc, 252 U.S. App. D.C. 194, 789 F.2d 26 (D.C. Cir.), cert. denied, 479 U.S. 923, 107 S. Ct. 330, 93 L. Ed. 2d 302 (1986); Carolina Environmental Study Group v. United States, 166 U.S. App. D.C. 416, 510 F.2d 796, 799 (D.C. Cir. 1975).\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Neither the Appeal Board nor the Commission based its decision on the belief that the risk of severe accidents is remote and speculative, however, and \"argument by counsel cannot take the place of an agency's statement of reasons or findings.\" WAIT Radio v. FCC, 135 U.S. App. D.C. 317, 418 F.2d 1153, 1158 (D.C. Cir. 1969). Accord Sierra Club v. EPA, 231 U.S. App. D.C. 192, 719 F.2d 436, 466 (D.C. Cir. 1983), cert. denied, 468 U.S. 1204, 82 L. Ed. 2d 870, 104 S. Ct. 3571 (1984). See also SEC v. Chenery, 332 U.S. 194, 196, 91 L. Ed. 1995, 67 S. Ct. 1575 (agency action must be judged solely on grounds invoked by the agency).\n\nThe Appeal Board determined that design alternatives could be excluded under the AEA and that NEPA could require no more. After concluding that the AEA satisfied NEPA concerns, the Appeal Board added that further studies were ongoing which might indicate that consideration of design alternatives would be required in the future. The Appeal Board relied on staff findings in the FES that concluded that the likelihood of a severe accident at Limerick is \"small and comparable to that of other reactors.\" FES at 5-126. The Board noted that the staff further concluded that \"based on the . . . considerations of environmental impacts of accidents, which have been found to be significant, [we have] concluded that there are no special or unique circumstances about the Limerick site and environs that would warrant consideration of alternatives for Limerick Units 1 and 2.\" Id. Such conclusions are not the equivalent of a finding that such risks are remote and speculative.\n\nMoreover, this refusal to consider reasons not advanced in the agency's decision is particularly apt where we are asked to reach a conclusion in this area of \"special expertise, at the frontiers of science.\" Baltimore Gas, 462 U.S. at 103.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In fact, as the Commonwealth points out, an across-the-board conclusion that the risks of severe accidents are remote and speculative, even if it had been made, would fly in the face of the expenditure of tens of millions of dollars by PECO at Limerick and as required at other plants by the NRC to increase safety in the event of a severe accident. As the NRC itself has indicated with regard to emergency planning, these \"regulations are premised on the assumption that a serious accident might occur.\" 22 N.R.C. at 713.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe NRC maintains that San Luis Obispo indicates that we should find that the risks at issue here are remote and speculative. 751 F.2d at 1301. We do not find San Luis Obispo persuasive. The court in that case refused to require supplementation of the environmental impact statement after discovery of a nearby earthquake fault line, interpreting the NRC's Statement of Interim Policy, 45 Fed. Reg. at 40,101, as follows: \"The clear import of the Commission's Statement is that, until such time as its research yields a contrary result, the Commission continues to regard Class Nine accidents as highly improbable events.\" Id. However, the fact that the Commission has initiated research into the subject does not necessarily entail a finding that the Commission does not view severe accidents as remote and speculative. To the contrary, it would seem that the extensive research projects undertaken by the Commission concerning nuclear accidents indicate that it no longer considers such risks remote and speculative. 50 Fed. Reg. at 32,138; see also NRC Policy on Future Reactor Designs, NUREG-1070 at 22 (1985) (\"The overall strategy of the Policy for Severe Reactor Accidents cannot be well understood except in the larger perspective of the Severe Accident Program, [which includes a variety of research activities].\").\n\nSecond, San Luis Obispo was decided before the Final Policy Statement and NUREG-1070 were issued. The Final Policy Statement stated that \"on the basis of currently available information, the Commission concluded that existing plants pose no undue risk. . . . Should significant new safety information become available, from whatever source, to question the conclusion of 'no undue risk,' then the technical issues thus identified would be resolved by the NRC. . . .\" 50 Fed. Reg. at 32,138. While the language is not crystal clear, the Commission's reference to the risk as not \"undue,\" would appear to be a retreat from a finding of remote and speculative.\n\nThird, San Luis Obispo held that the Interim Policy Statement's requirement that discussion of severe accident be included in the FES did not apply retroactively. The Interim Policy Statement was promulgated in 1980. The FES in this case was issued in 1983. Therefore, under the holding of San Luis Obispo discussion of severe accident potential would be required in this case.\n\nThe arguments on this point by the Commonwealth of Pennsylvania amicus curiae, are persuasive: (1) after Three Mile Island, it would be irrational for the NRC to maintain that severe accident risks are too remote to require consideration; (2) the NRC itself has devoted $50 million to studying such risks, not to mention the expenditures for evacuation plans; and (3) the NRC's own interpretation of its NEPA requirements requires consideration of such risks. 45 Fed. Reg. 40,103; 49 Fed. Reg. 9357.\n\nWhere the issue is as important as this one, and the Commission's conclusion as to whether the risk is remote and speculative is ambiguous as it is in this case, we are unwilling to read into the Commission's statements a finding that the risk is remote and speculative. Since neither the Appeal Board nor the Commission excluded consideration of design alternatives on the basis of a finding that the risks of severe accidents are remote and speculative, and, given the substantial arguments and recent history to the contrary, we are unwilling to intrude into the realm of the NRC's technical expertise to do so.\n\n4. Summary\n\nWe conclude that, contrary to the NRC's contention, simply meeting the requirements of the AEA does not exempt the Commission from complying with NEPA's procedural requirements. NEPA requires that the environmental impacts of agency action be given careful consideration and that the public be informed of them. Here, the NRC excluded consideration of design alternatives through a generic policy statement rather than through careful consideration. Because the action not to consider SAMDAS was promulgated as a policy statement, rather than a rule, and because it applies to an issue that we find is unlikely to be treated as generic, it does not meet the Baltimore Gas criteria for a generic rulemaking and therefore SAMDAs must be given careful consideration. Moreover, we are unwilling to conclude on the basis of the record before us, that, if the Commission had not excluded consideration of severe accident mitigation design alternatives on the basis of the Final Policy Statement, it would nevertheless have precluded their consideration on the ground that the underlying risks were remote and speculative. We therefore will grant the petition for review and remand for consideration of SAMDAs in light of this opinion.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nC. Sabotage Risk\n\n1. The Commission's Decision\n\nIn the FES, the Commission addressed the issue of sabotage risk as follows:\n\n[PECO] has presented a plant- and site-specific probabilistic assessment of severe accidents, including the effects of external events such as fires and earthquakes. . . . As a direct result of the applicant's efforts in performing the probabilistic assessment, several risk reduction modifications to the plant design were implemented during its construction. These modifications have been reviewed by the staff and are incorporated into the staff's analysis. . . . Neither the applicant's analysis nor the staff's analysis includes the potential effects of sabotage; such an analysis is considered to be beyond the state of the art of probabilistic risk assessment. However, the staff judges that the additional risks from severe accidents initiated by sabotage are within the uncertainties of risks presented for the severe accidents considered here.\n\nFES at 5-74.\n\nLEA contended before the Atomic Safety and Licensing Board that the Commission violated NEPA by refusing to consider the risk of sabotage issue. The Licensing Board rejected their claim on the ground that \"various Commission policy statements militate against litigation of such an issue.\" 22 N.R.C. at 698. The Commission was specifically referring to the Safety Goals Policy Statement, which stated that \"the possible effects of sabotage . . . are also not presently included in the safety goal. At present there is no basis on which to provide a measure of risk on [this] matter[]. It is the Commission's intention that everything that is needed shall be done to keep such risks at their present, very low, level; and it is our expectation that efforts on this point will continue to be successful.\" 48 Fed. Reg. at 10,773.\n\nOn appeal, the Appeal Board analyzed the Licensing Board's refusal to consider LEA's sabotage contention as follows:\n\nAs the staff points out in its brief, the FES does, in fact, consider a whole range of design-basis and severe accident scenarios. . . . LEA does not explain what separate consideration of sabotage as an initiator of such a severe accident would add, from a qualitative standpoint. . . . It would also add nothing of real quantitative significance. LEA has therefore failed to cast any serious doubt on either the staff's conclusion that a sabotage risk analysis is beyond state of the art probabilistic risk analysis or the Commission's similar determination that there is no basis by which to measure that risk. [LEA's sabotage contention] thus lacks even the threshold basis and specificity necessary to withstand rejection.\n\nA second factor to bear in mind is that, although the risk of sabotage cannot be quantified in a way that would permit its litigation per se, the Commission's regulations nonetheless require each plant to have a detailed security plan to protect against external and internal sabotage. . . . LEA, however, has raised no challenge to Limerick's security plan.\n\nIn sum, the risk of sabotage is simply not yet amenable to a degree of quantification that could be meaningfully used in the decisionmaking process. The Licensing Board therefore properly excluded LEA's [sabotage contention].\n\n22 N.R.C. at 698-701 (citations omitted). As a procedural matter, therefore, the Appeal Board affirmed the Licensing Board's refusal to permit litigation of the sabotage contention on the basis of the record evidence produced by LEA. LEA appeals from this decision.\n\n2. Discussion\n\nOn appeal, LEA makes several specific contentions: (1) that failure to consider sabotage violates the NEPA regulations as promulgated by the CEQ, which provide requirements for consideration of \"worst case\" scenarios; (2) that exclusion is based solely on policy statements, hence is not supported in the record; and (3) that LEA presented evidence that the risk of sabotage can be estimated.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\na. Whether Worst Case Analysis Is Required\n\nLEA's first contention is that the NRC failed to comply with the requirements of 40 C.F.R. § 1502.22(b) (1985), the NEPA implementing guidelines issued by the CEQ. However, as we have explained, CEQ guidelines are not binding on an agency to the extent that the agency has not expressly adopted them. See Township of Lower Alloways Creek v. Public Service Electric \u0026 Gas Co., 687 F.2d 732, 740 n. 16 (3d Cir. 1982). In the NRC's Final NEPA Rules, 49 Fed. Reg. at 9856-57, the Commission declined to adopt the \"worst case\" provision. Compare 40 C.F.R. 1502.22(b) (1985) with 10 C.F.R. Part 51 (1988). Because the CEQ guidelines are not binding on the NRC unless they have been adopted by it, we conclude that the NRC was not required to perform a \"worst case\" analysis.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nb. Whether the NRC's Determination that LEA's Sabotage Contention Was Unsupported Is Arbitrary and Capricious\n\nLEA's second contention is that the decision to exclude consideration of sabotage risks was not supported by the record, and that the exclusion was only on the basis of several policy statements. This is incorrect. The decision that risk analysis techniques were not capable of assessing sabotage risks was not made simply by proscribing consideration of the risks on the basis of a policy statement as was the exclusion of SAMDAs. See 50 Fed. Reg. at 32,138 (summary refusal to consider SAMDAs, because \"existing plants pose no undue risk\"). Rather, the NRC concluded that current risk assessment techniques could not provide a meaningful basis upon which to measure such risks. The fact that the conclusion of the NRC staff in the FES relied on several policy statements does not indicate that the Commission improperly excluded consideration of sabotage risks. Rather, it reached a judgment based on its contemporary evaluation of risk assessment techniques that assessment of such risks was attended by a great deal of uncertainty. See FES at 5-74. We believe that such a conclusion satisfies NEPA's requirement that the NRC take a \"hard look\" in this case, because we are required to \"be at [our] most deferential\" when the NRC makes such a scientific determination, Baltimore Gas, 462 U.S. at 103, and because the challenging party has failed to undermine or rebut the NRC's conclusion that the risk of sabotage cannot be assessed.\n\nWe hold that the NRC did not act arbitrarily in adhering to this conclusion where LEA proposed no meaningful method by which the NRC could either assess or predict sabotage risks. Moreover, we believe that LEA has mischaracterized this issue by casting it in terms of the NRC's burden to prove its asserted inability to quantify or predict sabotage risk. The essence of the Appeal Board's final decision on this matter is that LEA failed to produce any credible evidence or theory that would \"cast any serious doubt\" on the Commission's conclusion that sabotage risk analysis is beyond current probabilistic risk assessment methods and that there is no current basis by which to measure such risk. 22 N.R.C. at 699.\n\nThe Licensing Board's treatment of this very issue in the Three Mile Island case provides helpful guidance for us in this case. See Metropolitan Edison Co., 11 N.R.C. 297 (1980).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e In that case, the \"focal point of the most vigorous debate among the parties\" concerned the NRC's claim that it could not quantify community fears and psychological stress. 11 N.R.C. at 301-02. Proceeding under NEPA, the complaining parties challenged the NRC's asserted inability to quantify the phenomenon of stress and presented convincing evidence to rebut the NRC's claim. In addition, the NRC staff \"acknowledge[d] that some quantification of stress upon the community is being undertaken by responsible organizations.\" Id. These two items, the complaining party's evidence rebutting the NRC's claim and the NRC staff's concession that \"some quantification\" was being undertaken, formed the basis for the Licensing Board's holding that the NRC must consider the phenomenon of psychological stress despite its claim that it could not quantify it. Id. at 302-03, 309. To prevail here, LEA should have advanced some method or theory by which the NRC could have entered into a meaningful analysis of the risk of sabotage despite its asserted inability to quantify the risks.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nWe have neither of the aspects in this case that led the Licensing Board in the Three Mile Island case to require the NRC to consider a phenomenon that it claims is unquantifiable. As the Licensing Board and the Appeal Board explicitly held, LEA failed to present any evidence that rebutted the NRC's position or even \"cast any serious doubt\" upon it. 22 N.R.C. at 699. Moreover, the staff has made no concession, like the concession in the Three Mile Island case, that others are engaging in quantification of the phenomenon. We subscribe to the dissent's underlying sentiment that the failure to separately address the unquantifiable risk of sabotage raises serious concerns, but we cannot remand to the Commission for a standardless proceeding. Where LEA failed to meet its burden and therefore failed to meet the basis and specificity requirement for bringing a claim against the NRC, we cannot conclude that the NRC acted arbitrarily and capriciously by refusing to litigate this issue.\n\nFinally, LEA maintains that we should reverse the decision of the NRC because LEA supported its contention by expert review of PECO's severe accident risk assessment. LEA presented some evidence in an effort to show that the risk of sabotage could be measured, attempting to rebut the NRC's conclusion. Amicus Union of Concerned Scientists' Steven Sholly stated there were at least eleven acts of insider sabotage between 1971 and 1981, and thus risk assessment could be performed. Both the Licensing and Appeal Boards reviewed this evidence and concluded that it was insufficient to raise a litigable claim, let alone rebut the NRC's conclusion that sabotage risks are nonlitigable. The Licensing Board, affirmed by the Appeal Board, therefore, made a scientific determination that LEA's evidence does not undermine the Board's conclusion.\n\nAs the Court in Baltimore Gas stated: \"The Commission is making predictions, within its area of special expertise, at the frontiers of science. When examining this kind of scientific determination, as opposed to simple findings of fact, a reviewing court must generally be at its most deferential.\" 462 U.S. at 103. In view of this highly deferential standard and the evidence of record, we cannot conclude that the NRC's determination that LEA's contention was unsupported and therefore nonlitigable was arbitrary and capricious.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nD. Industrial or Economic Damages After One Year\n\nLEA's final contention is that the NRC impermissibly excluded consideration in the FES of industrial or economic losses (also called \"socioeconomic\" losses) arising after the first year following an accident. The Commission's Statement of Interim Policy on NEPA implementation requires consideration of \"socioeconomic impacts that might be associated with emergency measures during or following an accident.\" Nuclear Power Plant Accident Considerations Under the National Environmental Policy Act of 1969, Statement of Interim Policy, 45 Fed. Reg. 40,101, 40,103 (1980). The FES recognized that \"[a] severe accident that requires the interdiction and/or decontamination of land areas is likely to force numerous businesses to temporarily or permanently close. These closures would have additional economic effects beyond the contaminated areas through the disruption of regional markets and sources of supplies.\" FES at 5-102. The FES concluded, however, that \"the longer term consequences are not considered because they will vary widely depending on the level and nature of efforts to mitigate the accident consequences and to decontaminate the physically affected areas.\" FES at 5-106.\n\nThe FES therefore excluded consideration of such consequences arising beyond the first year following an accident. The Licensing Board excluded evidence of such consequences on the ground that impacts beyond the first year were \"speculative, both in terms of [their] occurrence and in terms of any reasonable quantification, even given that occurrence, and they are remote . . .,\" Transcript of Hearing Before Licensing Board at 8773; ASLB Order at 2 (April 20, 1984); and the Appeal Board affirmed. The Appeal Board's affirmance reiterated the Licensing Board's rationale, and supported the exclusion on the additional ground that the FES considered various other socioeconomic impacts arising from immediate emergency interdiction such as evacuation costs, value of crops and milk contaminated and condemned, costs of property decontamination, and indirect costs from the loss of business and income because of contamination. See FES at 5-93.\n\nNEPA requires full disclosure and consideration of environmental impacts, see, e.g., Kleppe v. Sierra Club, 427 U.S. at 410, but does not require consideration of risks that are remote or speculative. Vermont Yankee, 435 U.S. at 551 (citing Natural Resources Defense Counsel, Inc. v. Morton, 148 U.S. App. D.C. 5, 458 F.2d 827, 837-38 (D.C. Cir. 1972)). Thus, the consideration of impacts must be guided by a rule of reasonableness. NRDC v. Morton, 458 F.2d at 837. LEA contends in its petition that the Licensing Board's categorical decision to exclude evidence of socioeconomic impacts after one year was arbitrary because it does not comply with NEPA's mandate of full disclosure and consideration of environmental impacts and was not based on any record evidence of \"speculativeness.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e LEA also maintains that extensive information was available to the Commission upon which to base estimates of socioeconomic damages after one year. However, our consideration does not turn on whether there is evidence that contradicts the NRC's decision that damages after one year are too uncertain to calculate. Rather, our consideration must be whether the decision was arbitrary.\n\nIn Baltimore Gas, 462 U.S. at 101-03, the Supreme Court cautioned that agency decisions such as the one before us must be considered in the context of the entire decisionmaking process. Here, the NRC in the FES, using fully explained assumptions and established risk assessment models, performed a detailed quantitative analysis of the economic impacts that would follow for one year after an accident, the period during which those impacts arguably would be most severe because decontamination and other mitigation procedures would only have begun to be implemented. Further, in assessing those risks, the staff used conservative methodology, \"assum[ing] no compensating effects, such as the use of unused [industrial] capacity in the physically unaffected area to offset the initial lost production in the physically affected area or income payments to individuals displaced from their jobs. . . .\" FES at 5-106. Most importantly, the agency specifically addressed the uncertainties in the analysis, concluding that a major uncertainty -- the \"level and nature of efforts to mitigate the accident consequences and to decontaminate physically affected areas\" -- precluded any meaningful analysis of economic costs beyond one year. Id.; see also FES at 5-114.\n\nObviously, an examination of the socioeconomic effects of a nuclear accident must terminate at some reasonable period. One year is a surprisingly short time after which to stop such consideration, given that economic projections for numerous government and private endeavors, i.e., planning for a municipal convention center, or an office building or hotel, include economic projections for periods much in excess of one year. In fact, as LEA points out, the NRC itself has recognized that a severe accident could require the permanent closure of numerous businesses and the interdiction of land areas for periods exceeding thirty years. See Testimony of Lewis G. Hulman, Tables 1-5; LEA Br. at 47.\n\nHowever, we are not at liberty to substitute our judgment for that of the Commission, which considered the whole range of issues and developed a considerable record. Indeed, we must concede that the level of uncertainty involved in estimating economic consequences more than a year after a severe nuclear accident are extraordinarily high, hence we cannot conclude that there is no rational basis for the NRC's action.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e We will therefore deny LEA's petition regarding the consideration of socioeconomic effects arising more than one year after an accident.\n\nV. THE APPEAL OF THE GRATERFORD INMATES\n\nThe State Correctional Institution at Graterford is located approximately eight miles from the Limerick reactor. Graterford is a maximum security prison, housing some of the most serious offenders in the Commonwealth of Pennsylvania. Pursuant to NRC regulations, an emergency plan, called a Radiological Emergency Response Plan, must be prepared for the facility (as well as other facilities in the area) and must include plans for the possible evacuation of the inmates in the event of a nuclear accident at Limerick. No operating license may be issued \"unless a finding is made by NRC\" that [the state of onsite and offsite emergency preparedness provides] reasonable assurance that adequate protective measures can and will be taken in the event of a radiological emergency.\" See 10 C.F.R. § 50.47(a)(1) (1988).\n\nAlthough for security reasons, portions of the Graterford emergency plan are not public information (we have received it under seal), the broad outlines of the plan as it was approved by the Licensing Board and upheld by the Appeal Board envision a lock-down of inmates in their cells in the event of an emergency, followed by an evacuation if necessary. The evacuation would require that off-duty staff be enlisted to assist in the evacuation. To contact off-duty staff, the evacuation plan envisions prison officers using commercial telephone lines in a pyramid calling system (one superior officer calls two subordinates, who each do the same, etc.). Back-up communication systems such as short-wave radio are also mentioned in the plan, but are not envisioned to provide the primary means of alerting off-duty staff. With the assistance of the additional correctional officers, the plan provides for loading the inmates onto commercial buses, driven by commercial bus drivers, and transporting the inmates away from the Limerick area.\n\nAfter a lengthy process of filing contentions with the Licensing Board and appeals to the Appeals Board, petitioner Martin, on behalf of himself and the other inmates of Graterford, litigated several issues concerning the adequacy of the evacuation plan. Martin's petition for review presents three issues that were considered and rejected by the Commission: (1) whether training for civilian bus drivers must be offered or actually received; (2) whether an evacuation time estimate exists and is supported by the record; and (3) whether the plan provides an adequate telephone notification system for mobilizing the off-duty Graterford guards needed to carry out the evacuation. Martin also presents two issues that were rejected without consideration by the Commission: (1) whether the correctional officers' union was required to have signed an agreement to participate in an evacuation on behalf of the guards; and (2) whether panic by guards and inmates must be considered in the development of the evacuation plan.\n\nA. The Regulatory Framework and Procedural History\n\n1. The Regulatory Framework\n\nFollowing the TMI accident, the President's Commission on the Accident at Three Mile Island concluded that the emergency offsite response was \"dominated by an atmosphere of almost total confusion.\" Report of the President's Commission on the Accident at Three Mile Island -- The Need for Change: The Legacy of TMI 17 (1979). The NRC thereafter began requiring offsite emergency plans as a condition of granting a nuclear reactor operating license, and announced that it \"view[ed] emergency planning as equivalent to . . . siting and design in public protection.\" 44 Fed. Reg. 75,167, 75,169 (1979) (codified at 10 C.F.R., Part 50); see generally Union of Concerned Scientists v. NRC, 237 U.S. App. D.C. 1, 735 F.2d 1437, 1439 (D.C. Cir. 1984).\n\nThe Commission's regulations on off-site emergency preparedness now provide: \"No operating license for a nuclear power reactor will be issued unless a finding is made by NRC that there is reasonable assurance that adequate protective measures can and will be taken in the event of a radiological emergency.\" 10 C.F.R. § 50.47(a)(1) (1988). The regulations further provide for licensing of plants only on satisfaction of sixteen specific standards for emergency preparedness plans. 10 C.F.R. § 50.47(b)(1) to (b)(16). The specific standards provide, inter alia, that primary responsibilities for emergency response lie with the licensee and state and local organizations, and that adequate facilities and equipment to support the emergency response must be made available.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nFor the purposes of Martin's petitions, there are two important requirements of § 50.47(b). First, subsection (b)(5) requires that procedures be established for notification of state and local response organizations including \"means to provide early notification and clear instruction to the populace within the plume exposure pathway.\" Second, subsection (b)(15) requires that \"radiological emergency response training is provided to those who may be called on to assist in an emergency.\" Martin and the other inmates of Graterford sought to raise contentions before the Licensing Board based upon § 50.47(b) in the proceedings discussed below.\n\n2. Procedural History\n\nThe Licensing Board, clearly hostile to the inmates' concerns, repeatedly rejected their contentions and was repeatedly reversed by the Appeals Board. Counsel for inmates originally received a \"sanitized\" copy of the first evacuation plan, of which, according to the inmates, 50% had been deleted. On February 27, 1985, the Licensing Board held an in camera conference regarding full disclosure of the plan in which it determined that the inmates' expert, Major John Case, a former corrections superintendent, would be permitted to view the full plan under a protective order. The Licensing Board then rejected the inmates' request to revise their contentions after having viewed the plan request, and on April 12 the inmates were dismissed as parties to the case by order of the Board. The Appeal Board, however, reinstated the inmates' contentions, and granted them leave to restate them.\n\nAt a hearing on July 15-16, 1985, the inmates contended that PECO's estimated evacuation time was inaccurate and that insufficient provisions had been made for participation of civilian bus drivers in evacuation exercises. On July 22, 1985, however, the Licensing Board ruled, in its fourth PID, that reasonable assurances had been made regarding the inmates' contentions. See Supp. to PID 4, 24 N.R.C. 731 (1986).\n\nOn August 8, 1985, the Commission granted the full power license for Limerick Unit 1. Subsequently, on August 28, 1986, the Appeal Board issued an order affirming PID 4 in part, but reversing and remanding for a hearing on the issue of the plan's provision for manpower mobilization. Philadelphia Electric Co., 24 N.R.C. 220, 233 (1986). On November 12, 1986, the Commission declined review, and the Appeal Board's order became a final decision of the Commission. Martin filed petition No. 87-3190 from this fourth PID.\n\nOn September 22, 1986, within the time frames suggested by 10 C.F.R. part 2, Rules of Practice, the Licensing Board held a hearing, and ruled on November 10, 1986, that reasonable assurance had been provided that sufficient manpower would be mobilized in order to conduct the evacuation. See 24 N.R.C. at 745. In April 1987, the Appeal Board affirmed the Licensing Board's rejection of the mobilization contention. 25 N.R.C. 7, 15 (1987). The Appeal Board noted procedural shortcomings, but concluded that there was no reversible error. On June 19, 1987, the Commission denied review, and the Appeal Board's order became a final decision. Martin subsequently filed this petition for review.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nB. Contentions Not Considered by the NRC\n\nSection 2.714(b) of 10 C.F.R. (1988) permits those persons whose interests may be affected by the NRDC hearing to intervene; intervenors are required to submit a \"list of the contentions which petition seeks to have litigated in the matter, and the bases for each contention set forth with reasonable specificity.\" See generally BPI v. Atomic Energy Com., 163 U.S. App. D.C. 422, 502 F.2d 424, 429 (D.C. Cir. 1974) (the NRC's requirement of specificity in § 2.714 is not a \"transgress[ion of] its legislative charter\"). It is beyond dispute that issues not raised with sufficient particularity may be excluded by the Licensing Board. See 10 C.F.R. § 2.714(b); Commonwealth Edison Co. (Byron Nuclear Power Station, Units 1 and 2), 12 N.R.C. 683, 686-87 (1980) (quoting Philadelphia Electric Co. (Peach Bottom Atomic Power Station, Units 2 and 3), 8 A.E.C. 13, 20-21 (1974)). This particularity requirement serves the function of ensuring (1) the existence of a sufficient basis for further inquiry into the subject matter of the contention and (2) that the NRC receives a fair opportunity to address the petitioners' claims. Id. at 687. Martin initially challenges the Licensing Board's refusal to consider the inmates' claims (1) that the correctional officers union should have been required to approve the plan; (2) that the plan failed to address the likelihood of panic among guards and inmates; and (3) that the Licensing Board improperly failed to consider whether training was required, as opposed to merely offered, to civilian bus drivers. The Licensing Board rejected the first two of these contentions on the ground that they did not provide the basis and specificity required, and the Appeal Board affirmed. 24 N.R.C. at 235, 240. The Licensing Board simply did not address the third issue, and the Appeal Board refused to consider it on appeal. 24 N.R.C. at 242-43.\n\nWe conclude that the Commission's exclusion of the first two contentions was not an abuse of discretion, but that it should have addressed the issue of civilian bus driver training.\n\n1. The Need for Union Approval of the Plan\n\nThe correctional officers are represented by the American Federation of State, County, and Municipal Employees. Martin's revised contention asserted that \"there is no reasonable assurance that the correctional officers union is aware of the Bureau of Corrections concept of operations and its relationship to the total effort.\" Proposed Revised Contention at 4. The Licensing Board rejected this contention on the ground that it lacked basis and specificity under § 2.714(a) and the Appeal Board affirmed.\n\nMartin first contends before us that because Criterion A of NUREG 0654, Criteria for Preparation and Evaluation of Radiological Emergency Response Plans, NUREG-0654 at 28, provides that any organization involved in the response to a nuclear accident should sign a letter of agreement to participate, and because the union is a \"supporting organization\" under 10 C.F.R. § 50.47(b)(1), the plan is defective because the Union did not sign such a letter. Martin's contention before the Licensing Board did not mention this letter requirement, however, and cannot be construed as having put the Licensing Board on notice that it was being raised. Hence, it is not properly before this court.\n\nSecond, as to the argument that the union lacked knowledge of the plan, although Martin clearly raised that issue, the substance of the contention is unclear. As the Appeal Board noted, the contention that the union was unaware of the plan does not support the conclusion that the participating guards lacked such knowledge. 24 N.R.C. at 235.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e We therefore conclude that the exclusion of the union awareness contention was not an abuse of discretion.\n\n2. Panic Potential\n\nMartin contended before the Licensing Board that there is no reasonable assurance that the Graterford emergency plan will prevent panic by the guards or inmates. The Licensing Board concluded that because the plan itself concerned evacuating the inmates, and presumably evacuating inmates involves controlling them, absent some indication that the guards would not or could not restrain the inmates, Martin's objection lacked a sufficient basis to be litigated. The Appeal Board affirmed, noting that the plan expressly recognized and addressed the security needs during evacuation and the \"possible stresses on the inmates and the workforce,\" 24 N.R.C. at 240, and concluded that:\n\nIn view of this special attention in the plan itself, the inmates were obliged to explain more precisely why the plan is nevertheless inadequate for the prevention and control of a panic situation; the mere recitation of past disturbances at [Graterford] . . . is not enough to establish a basis for hearing on this issue.\n\nMartin contends that panic among violent inmates is a real possibility, and the Board should have allowed this issue to be developed further. The NRC rejoins, however, that rejection of these contentions was within the agency's discretion, and we agree. The potential for panic is an inherent part of the inmates' evacuation and Martin did not identify sufficiently how or why the plan's security measures, which were extensive, do not address this problem.\n\n3. The Civilian Evacuation Training Claim\n\nA contention not made before the Licensing Board cannot be reviewed by the Appeal Board. See Philadelphia Electric Co., 23 N.R.C. 479, 496 n.28 (1986). The inmates contended before the Appeal Board that the Licensing board addressed only the issue of whether civilian bus driver training was offered and improperly ignored the issue of whether training will be received. The Appeal Board, however, refused to allow the inmates to \"recast their contention\" and, therefore, refused review of the issue of the requirement of training. See 24 N.R.C. at 241-42. We must determine whether the Appeal Board abused its discretion by finding that the contention had not been raised before the Licensing Board.\n\nMartin contends that because 10 C.F.R. § 50.47(b)(15) requires reasonable assurances that \"radiological emergency response training is provided to those who may be called on to assist in an emergency\" (emphasis added), and because the section following Criterion O, NUREG 0654 at 66, states that \"each organization shall make provisions for the training of appropriate individuals\" and that \"each offsite response organization shall participate in and receive training,\" personnel involved in evacuation must actually receive training, rather than simply be offered training. It is undisputed that the six bus companies that are expected to provide buses to transport inmates in the event of an emergency received a one-page form letter offering training. But as of the date of the Appeal Board's rejection of Martin's contention, the bus drivers had not actually received training. 24 N.R.C. at 237 (description of simulated evacuation). The NRC, however, asserts that the Appeal Board properly excluded from consideration the issue of whether the drivers actually received training, because the inmates failed to raise this distinction when they brought their amended contention before the Licensing Board.\n\nIn their original contention, the inmates alleged that no reasonable assurance had been given that the bus drivers would receive any emergency response training. Hence, the Licensing Board was fully informed that the inmates were contending that training was required to be provided, but in fact was not. Nevertheless, the Licensing Board on April 12, 1985, dismissed this contention for lack of specificity. After conferring with agency officials (the identity of the agency is unclear, but is apparently the Pennsylvania Emergency Management Agency), the inmates subsequently revised their contention, and in attempting to make the contention more specific, focused on the issue of whether training would be offered to the drivers as opposed to the rules' requirement that training be provided. We do not understand the inmates' rephrasing of the issue to be tantamount to abandonment, but rather a continuation of their presentation of the issue. Thus, the Licensing Board was fully informed of the rule requiring that training be provided, and only through the redefinition of the contention was the issue obscured.\n\nWe therefore conclude that the NRC abused its discretion when it found that the inmates had failed to alert the Licensing Board to the issue of whether training was required pursuant to 10 C.F.R. § 50.47(b)(15). The literal terms of the regulation cited by the inmates to the Licensing Board in the first contention stated that reasonable assurances must be made that training \"is provided.\" We decline to engage in the rote formalism necessary to determine whether the inmates, acting with minimal resources and under time pressure, failed to properly raise the contention that training must be provided rather than offered. To hold otherwise would be to allow the Commission to be in noncompliance with its own regulations so long as the party has cited the proper provision, and raised the issue, but has later amended its contention to no longer track the language of the regulation. Because the Commission should have an opportunity to consider in the first instance whether training has been provided, we will grant the petition for review on this issue and remand to the Licensing Board for initial consideration of the contention.\n\nC. The Accuracy of Estimate of Time of Evacuation Claim\n\nThe Commission's emergency planning regulations require an evacuation time estimate for \"various sectors and distances within the plume exposure pathway [emergency planning zone] for transient and permanent populations.\" 10 C.F.R. Part 50, Appendix E, § IV (1988). Further guidance is provided in NUREG 0654, which provides that protective measures must be taken as a \"means [ inter alia ] for protecting those persons whose mobility may be impaired due to such factors as institutional confinement.\" See NUREG 0654 at 52, Criterion J, § 10(d). As the Appeal Board noted, \"no particular time limits are established for an evacuation; rather, the analysis is intended to reflect a realistic time for completing an evacuation.\" 24 N.R.C. at 244.\n\nThe initial estimated time for evacuation was developed by the Pennsylvania Bureau of Corrections. It estimated the evacuation time at five and one half hours, to occur only during daylight hours. A second estimated time was developed by Bureau of Corrections Commissioner Glen Jeffes and was estimated to be six to ten hours. The inmates initially contended that there was no reasonable assurance that an evacuation of Graterford could be achieved in that amount of time. At the Licensing Board hearing, however, Graterford Superintendent Charles H. Zimmerman identified a third estimated time. Zimmerman modified the second estimate to eight to ten hours and presented a flow chart demonstrating the estimated time required for each major step in the evacuation process. The Licensing Board concluded that the Zimmerman estimate was reasonable and in compliance with NRC regulations. 22 N.R.C. at 109-16.\n\nMartin first asserts that the evacuation plan developed by the Commonwealth and Department of Corrections failed to identify a single estimated time of evacuation. However, as the Appeal Board noted, the Zimmerman estimate was offered by the Bureau of Corrections as the official estimated time of evacuation.\n\nMartin also asserts that the evacuation time accepted by the Appeal Board is unrealistic and unsupported in the record. However, as Martin himself asserts, his claim is based not on an absence of record evidence to support the eight-to-ten hour estimate, but on differences of opinion between the evidence presented by Superintendent Zimmerman and others from the Bureau of Corrections on the one hand, and by Martin's own expert, Major Case, on the other. In fact, Martin states on review that \"the Department of Corrections offered a step-by-step analysis of how Superintendent Zimmerman's [estimated time of evacuation] of 8 to 10 hours would be achieved.\" Martin Br. at 26.\n\nAlthough Martin argues with some force that the official estimated time overlooks several factors such as traffic congestion, highways closed by meteorological conditions and radioactive fallout, this court cannot weigh the conflicting testimony and reach its own conclusions as to the proper estimate. Instead, we must determine whether the Commission's conclusion that the time estimate is realistic is arbitrary and capricious. Because we conclude that ample evidence exists to support the Commission's determination on this issue, and therefore its conclusion was not an abuse of discretion, we will deny the petition on this ground.\n\nD. The Manpower Mobilization by Telephone Claim\n\nThe Graterford evacuation plan relies upon the commercial telephone system to alert off-duty staff to report to the prison and assist in the evacuation. Although several plan modifications were made regarding the number of off-duty officers who would need to be telephoned and the manner in which those calls would be made, under the final plan calls would be made from the prison's 66 telephone lines. A \"pyramid system,\" in which senior officers would call several subordinates from their private residences, was designed for use only as a back-up. According to the testimony of Superintendent Zimmerman, approximately one hundred guards would be called.\n\nAs we have noted, the Licensing Board originally rejected Martin's challenge to the adequacy of the communication system on the ground that it failed the specificity requirement. The Appeal Board reversed, however, and forced the Licensing Board to consider the contention. 24 N.R.C. at 233. The Licensing Board conducted an expedited hearing and rejected the contention. The Licensing Board determined that the plan provided reasonable assurance that in the event of an accident at Limerick, the call-up system would function successfully. 24 N.R.C. at 745. The Licensing Board reached this conclusion because few off-duty staff would have to be notified, the calling system would only be required during the 10:00 p.m. to 6:00 a.m. shift when insufficient staff would be available at the prison to conduct the evacuation, and because alternative means would be available to notify the staff to report to duty. The Appeal Board affirmed. Philadelphia Electric Co., 25 N.R.C. 273, 284 (1987).\n\nSection 50.47(a)(1) of 10 C.F.R. provides that notification procedures should be adequate to serve their purpose, and § 50.47(b)(5) provides that procedures for notification must be established. Martin contends that record evidence indicates that commercial phone lines will not function well in the event of an emergency and thus that the notification procedures are inadequate. He points to testimony from several witnesses to the effect that the telephone system had become overburdened in the past by occurrences as diverse as Hurricane Agnes, severe winter storms, and the recent sale of Bruce Springsteen concert tickets. Richard T. Brown, Chairman of the Board of Supervisors of Lower Providence Township testified that the Three Mile Island crisis in 1979 resulted in congested telephone lines for several days and dial tone delays of up to thirty minutes. See Testimony of Brown, Hearing Tr. at 21,529-34 (Sept. 22, 1986).\n\nThe NRC correctly argues, however, that the role of this court is not to weigh the evidence, but to determine whether substantial evidence supports the Commission's decision. See, e.g., Lehigh Valley Farmers v. Block, 829 F.2d 409, 412 (3d Cir. 1987); Monsour Medical Center v. Heckler, 806 F.2d 1185, 1190-91 \u0026 n.12, (3d Cir. 1986), cert. denied, 482 U.S. 905, 107 S. Ct. 2481, 96 L. Ed. 2d 373 (1987). The Commission points to no particular evidence in its brief, however, but rather rests on a one-sentence assertion: \"there is substantial evidence to support the agency's finding on all three contentions.\" NRC Br. at 46. Although we cannot rely on such bald assertions, we conclude that the decision of the Licensing Board does reflect a detailed weighing of evidence introduced by Martin and by the NRC, and that the Board's conclusion is supported.\n\nFirst, as the Licensing Board noted, Superintendent Zimmerman testified that only approximately one hundred guards must be notified to perform an evacuation. Although, in view of the willingness of the Bureau of Corrections repeatedly to revise downward its estimates of the number of staff necessary to perform the evacuation, its views do not inspire great confidence, we are not in a position to substitute Major Case's estimates for those of Superintendent Zimmerman. At all events, we are satisfied that the revised estimate of the number of guards needed to conduct the evacuation adequately supports the determination that sufficient numbers of guards would be available to complete the evacuation without use of the telephones at all times except the 10:00 p.m. to 6:00 a.m. shift. Testimony from telephone system experts at the Licensing Board hearing indicated that during the late night shift normal telephone usage is lowest, hence telephone lines are least likely to be congested. See 24 N.R.C. at 740.\n\nAlthough the testimony presented by Martin strongly suggests that telephone lines will be congested in the event of a Limerick emergency just as they were for Three Mile Island, record evidence supports the Licensing Board's conclusion that alternative systems are available in the event of the failure of the telephone system. The testimony of Superintendent Zimmerman indicates that alternative communication methods include a dedicated line to the state police headquarters which would not be affected by an overload on other lines; that the combined law enforcement assistance network (\"CLEAN\") links Graterford to the Corrections Bureau central office, other law enforcement offices, and other prisons; and that radio contacts could be made with Montgomery County emergency officials, who could in turn contact the Emergency Broadcast System and the media generally. See id. at 741.\n\nIn sum, we conclude that record evidence supports the conclusion that there are adequate assurances that the off-duty staff notification system, whether through use of the commercial telephone lines or back-up systems, will function successfully and therefore the NRC did not abuse its discretion by holding that the plan provided reasonable assurance the call-up system would function successfully. Hence, we will deny Martin's petition on this issue.\n\nVI. CONCLUSION\n\nFor the foregoing reasons, we will deny LEA's petitions for review, Nos. 87-3508, 86-3314 \u0026 85-3431, of the Commission's exclusion of consideration of sabotage risk and socioeconomic damages after one year. However, we will grant LEA's petition with respect to the Commission's refusal to consider SAMDAs and remand for further consideration of that issue consistent with this opinion.\n\nWe will deny the Martin petition for review, Nos. 87-3190 and 87-3444, on the time estimate and manpower mobilization issues, No. 87-3565, and on the issues of panic potential and whether the guards' union was required to approve the evacuation plan. However, we will grant Martin's petition, No. 87-3190, insofar as it challenges the decision to exclude consideration of whether a mere offer of training will satisfy the requirement that training be provided to the evacuation plan participants, and remand for further proceedings on this issue. We will dismiss appeal No. 85-3606 as moot.\n\nSCIRICA, Circuit Judge, dissenting in part.\n\nI join in all of the majority opinion except for part IV-C(2)(b), where I respectfully dissent from the majority's affirmance of the decision by the Nuclear Regulatory Commission (NRC) to exclude consideration of the risk of sabotage in assessing the environmental impact of the Limerick nuclear power plant. See Maj. Op. Typescript at 58. I cannot conclude, on the basis of this record, that the NRC did not act arbitrarily and capriciously in refusing to consider the potential impact of sabotage.\n\nThe majority finds that the NRC \"reached a judgment based on its contemporary evaluation of risk assessment techniques\" which led the NRC to conclude \"that assessment of such risks was attended by a great deal of uncertainty\" and therefore current techniques \"could not provide a meaningful basis upon which to measure such risks.\" Maj. Op. at 743.\n\nTwo aspects of the majority's holding disturb me. First, the decision of the Atomic Safety and Licensing Appeal Board clarifies that the NRC has, in this instance, equated the word \"meaningful\" with the word \"quantifiable.\" Early in its discussion of the exclusion of sabotage, the Appeal Board stated, \"the risk of sabotage cannot be quantified in a way that would permit its litigation per se.\" 22 N.R.C. 681, 699 (1985). The Appeal Board concluded, \"In sum, the risk of sabotage is simply not yet amenable to a degree of quantification that could be meaningfully used in the decisionmaking process.\" Id. at 701. In other words, the majority affirms a decision by the NRC in which the agency has taken the position that when its staff cannot quantify a risk -- in this case, sabotage -- it need not consider it. Second, although the NRC fails to cite support in the record, the majority accepts the NRC's conclusion that there exists no means by which to consider the risk of sabotage.\n\nI.\n\nI find no statutory provision, no NRC regulation or policy statement, and no case law that permits the NRC to ignore any risk found to be unquantifiable. Courts have held that the National Environmental Policy Act of 1969 (NEPA), 42 U.S.C. §§ 4321-4361 (1983) does not require that the NRC address \"remote and highly speculative\" consequences. Maj. Op. Typescript at 48; San Luis Obispo Mothers For Peace v. NRC, 243 U.S. App. D.C. 68, 751 F.2d 1287, 1300 (D.C. Cir. 1984), rehearing en banc granted on other grounds, 245 U.S. App. D.C. 296, 760 F.2d 1320 (D.C. Cir. 1985), aff'd on rehearing en banc, 252 U.S. App. D.C. 194, 789 F.2d 26 (D.C. Cir.), cert. denied, 479 U.S. 923, 107 S. Ct. 330, 93 L. Ed. 2d 302 (1986); Environmental Defense Fund, Inc. v. Hoffman, 566 F.2d 1060, 1067 (8th Cir. 1977); see also Vermont Yankee Nuclear Power Corp. v. Natural Resources Defense Council, Inc., 435 U.S. 519, 551, 55 L. Ed. 2d 460, 98 S. Ct. 1197 (1977) (quoting Natural Resources Defense Council, Inc. v. Morton, 148 U.S. App. D.C. 5, 458 F.2d 827, 837-38 (D.C. Cir. 1972)). While offering diverse views on what consequences they would consider \"remote and highly speculative,\" courts have stressed either the low probability of the risk, see e.g., San Luis Obispo, 751 F.2d at 1299 (\"there is a point at which the probability of an occurrence may be so low as to render it almost totally unworthy of consideration\") (citation omitted), or the breadth of the inquiry required, see e.g., Vermont Yankee, 435 U.S. at 551-52 (NRC did not have to consider \"energy conservation\" as an alternative to nuclear power, as the phrase \"suggests a virtually limitless range of possible action and developments that might, in one way or another, ultimately reduce projected demands for electricity from a particular proposed plant\"). No court, however, has suggested that merely because a risk evades quantification, and is in that sense \"speculative,\" the NRC is relieved of its statutory duty to adequately consider and disclose its potential environmental effects. Cf. People against Nuclear Energy v. NRC, 219 U.S. App. D.C. 358, 678 F.2d 222, 228-29 (D.C. Cir. 1981) (where NRC contended that psychological stress is beyond scope of NEPA because it is not readily quantifiable, court held that NEPA does not authorize federal agencies to deal with intangible factors by ignoring them), rev'd on other grounds sub. nom. Metropolitan Edison Co. v. People against Nuclear Energy, 460 U.S. 766, 75 L. Ed. 2d 534, 103 S. Ct. 1556 (1983). Moreover, the test of \"remote and highly speculative\" is stated in the conjunctive, requiring that a risk meet both prongs to be properly excluded from consideration under NEPA.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe NRC itself has recognized that consideration of uncertain risks may take a form other than quantitative \"probabilistic\" assessment. In its \"Proposed Policy Statement on Severe Accidents and Related Views on Nuclear Reactor Regulation,\" 48 Fed. Reg. 16,014 (1983), the Commission stated that:\n\nIn addressing potential accident initiators (including earthquakes, sabotage, and multiple human errors) where empirical data are limited and residual uncertainty is large, the use of conceptual modeling and scenario assumptions in Safety Analysis Reports will be helpful. They should be based on the best qualified judgments of experts, either in the form of subjective numerical probability estimates or qualitative assessments of initiating events and casual [sic] linkages in accident sequences.\n\n48 Fed. Reg. at 16,020.\n\nNEPA \"places upon an agency the obligation to consider every significant aspect of the environmental impact of a proposed action.\" Vermont Yankee, 435 U.S. at 553; 42 U.S.C. § 4332(2)(C). The judicial rule of allowing the exclusion of \"remote and highly speculative\" consequences is, in part, a logical corollary to this statutory mandate requiring consideration of only \"significant\" environmental risks. Accordingly, once the NRC has conceded the risk to be \"significant,\" difficulty in measuring the risk does not automatically excuse the NRC from considering it. Cf. State of Cal. by Brown v. Watt, 215 U.S. App. D.C. 258, 668 F.2d 1290, 1311-13 (D.C. Cir. 1981) (where controlling statute required Secretary of the interior to consider each specific factor on the basis of \"existing information,\" Secretary's assertion that there was \"an absence of meaningful measurements\" did not excuse Secretary from complying with statutory mandate). In fact, NEPA expressly instructs all federal agencies to identify and develop methods and procedures \"which will insure that presently unquantified environmental amenities and values may be given appropriate consideration in decisionmaking along with economic and technical consideration.\" 42 U.S.C. § 4332(2)(B). Not having found that the risk of sabotage is insignificant, the NRC has a statutory obligation to take a hard look at the risk of sabotage.\n\nI underscore that the Licensing Board and the Appeals Board determined only that the risk of sabotage was \"beyond the state of the art of probabilistic risk assessment.\" Limerick FES 5-74; Maj. Op. at 742. The Commission did not make a finding that the possibility of sabotage was \"remote and highly speculative.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Agency action must be judged solely on the grounds invoked by the agency. SEC v. Chenery Corp., 332 U.S. 194, 196, 91 L. Ed. 1995, 67 S. Ct. 1575 (1947). Refusal to consider at this stage a claim by the NRC that the risk of sabotage is \"remote and highly speculative\" is consistent with the majority's rejection of the same argument that the NRC advanced to justify its refusal to consider severe accident mitigation design alternatives. See Maj. Op. Typescript at 48-49.\n\nEven if the NRC had made a contemporaneous finding that the risk of sabotage is \"remote and highly speculative,\" several factors would undermine such a determination. In most court decisions invoking this phrase, the issues involved bear little resemblance to sabotage. For example, in Vermont Yankee, an intervenor requested that the NRC examine \"energy conservation\" as an alternative to the construction of the nuclear power plant. Given the breadth of the potential inquiry, it is understandable why the Supreme Court excused its exclusion: \"Common sense also teaches us that the 'detailed statement of alternatives' cannot be found wanting simply because the agency failed to include every alternative device and thought conceivable by man.\" 435 U.S. at 551. Similarly, in Environmental Defense Fund, Inc. v. Hoffman, the court balked at the seemingly limitless scope of the proposed inquiry. The court held that where a river project involved clearing, realigning, enlarging and rechanneling for flood control and drainage purposes over two hundred thirty-one miles of river, the cumulative secondary impact of the project on the groundwater was \"remote and speculative.\" 566 F.2d at 1067. In Natural Resources Defense Council, Inc. v. Morton, the court had in mind even more remote possibilities, stating, \"We do not suppose Congress intended an agency to devote itself to extended discussion of the environmental impact of alternatives so remote from reality as to depend on, say, the repeal of the anti-trust laws.\" 458 F.2d at 837. To the extent that some courts have loosened the standards under which the NRC can claim that consequences are \"remote and highly speculative, \" I disagree with their holdings. See, e.g., San Luis Obispo, 751 F.2d at 1301 (\"because the environmental consequences of Three Mile Island [accident] were scientifically and legally inconsequential, the fact that the accident occurred does not establish that accidents with significant environmental impacts will have significant probabilities of occurrence\").\n\nFurthermore, the NRC has indicated that it regards the risk of sabotage as a realistic possibility. In its regulations setting forth requirements for a detailed security plan, the threat of radiological sabotage is listed first.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e See 10 C.F.R. § 73.1 (1988). In addition, in its Proposed Policy Statement on Severe Accidents the NRC states, \"Pending decision on the final content of the safety goal policy statement, the Commission expects that [future] applicants for standard design approvals will address . . . design considerations to inhibit sabotage. . . . [Future] applicants for standard design approvals or construction permits are to give specific consideration of plant design features that would decrease the probability of damage from sabotage.\" 48 Fed. Reg. at 16,020. In its final Policy Statement on Severe Reactor Accidents, the NRC stated, \"the Commission recognizes the importance of such potential contributors to severe accident risks as human performance and sabotage.\" Policy Statement on Severe Reactor Accidents Regarding Future Designs and Existing Plants, 50 Fed. Reg. 32,138, 32,141 (1985).\n\nAs the NRC itself has acknowledged, in this day and age, we cannot ignore the risk of sabotage in the construction of our nuclear facilities. That is no less true for the plants currently undergoing licensing proceedings, which will continue to operate for years to come, than for future plants. The Limerick plant, located twenty-five miles from Philadelphia, PA, and eight miles from Graterford State Correctional Institution, is hardly inaccessible. In sum, the NRC has not convinced me that the possibility of sabotage to the Limerick plant is \"remote and highly speculative.\" I would remand to the NRC for this determination.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nI would impose no restrictions on the methods the NRC may choose to adopt for consideration of the sabotage risk. Yet this would not be, as the majority suggests, a remand to the NRC for a \"standardless proceeding.\" Maj. Op. at 744. Judicial review of agency action under NEPA is intended to ensure that the agency considered and disclosed the environmental consequences of proposed actions. Baltimore Gas, 462 U.S. at 97-8. The nature and form of environmental analysis required in any given case, however, are matters left to the agency's discretion. Alaska v. Andrus, 188 U.S. App. D.C. 202, 580 F.2d 465, 480 (D.C. Cir.), vacated in part on other grounds sub. nom. Western Oil \u0026 Gas Assoc. v. Alaska, 439 U.S. 922, 58 L. Ed. 2d 315, 99 S. Ct. 303 (1978). On remand, the agency would receive the clear directive to consider the risk. It is the duty of the agency to employ its technical expertise to devise a method for considering the risk of sabotage, or justify why it cannot.\n\nII.\n\nAssuming arguendo that an unquantifiable risk is in fact a risk that cannot be considered, I can find no evidence in the record before us to support this assertion. In enacting NEPA, Congress required that an agency take a \"hard look\" at the environmental consequences before taking a major action. Baltimore Gas \u0026 Electric Co. v. Natural Resources Defense Council, Inc., 462 U.S. 87, 97, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (1983). \"If that [administrative] finding is not sustainable on the administrative record made, then the . . . [agency's] decision must be vacated and the matter remanded . . . for further consideration.\" Vermont Yankee, 435 U.S. at 549.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAs already noted, unless the NRC determines that a risk is \"remote and highly speculative,\" the agency must consider and disclose that risk. If the NRC for some reason cannot satisfy its statutory obligation, the NRC bears the burden of proving why not. Cf. State of Cal. by Brown v. Watt, 668 F.2d at 1312-13 (where agency has not made good faith effort to perform the statutory mandate, but rather, asserts it is impossible or impracticable to perform inquiry explicitly required by statute, the \"agency's burden of justification is especially heavy\"). In this case, there is reason to take a skeptical view of the agency justifications for refusing to consider sabotage because underlying the NRC decision was the premise that review of all aspects of severe accidents was discretionary. The Appeal Board states this explicitly: \"At the outset, it is important to place the contention in its proper perspective. . . . Insofar as this review -- undertaken pursuant to the Commission's Interim NEPA Policy -- encompasses severe (beyond design-basis) accidents, it is not even required by NEPA.\" 22 N.R.C. at 698-99. As the majority has persuasively noted, an across-the-board conclusion that the risks of severe accidents are remote and speculative is not credible. See Maj. Op. Typescript at 50.\n\nIn examining whether the administrative record is sufficient to sustain the NRC's decision to exclude consideration of the problem of sabotage, it is worth recounting in detail the NRC's own explanation. In the Final Environmental Statement (FES) for Limerick, the Licensing Board offered the following explanation for its exclusion of sabotage risk:\n\n[Applicant] has presented a plant- and site-specific probabilistic assessment of severe accidents, including the effects of external events such as fires and earthquakes. . . . As a direct result of the applicant's efforts in performing the probabilistic assessment, several risk reduction modifications to the plant design were implemented during its construction. These modifications have been reviewed by the staff and are incorporated into the staff's analysis. . . . Neither the applicant's analysis nor the staff's analysis includes the potential effects of sabotage; such an analysis is considered to be beyond the state of the art of probabilistic risk assessment. However, the staff judges that the additional risks from severe accidents initiated by sabotage are within the uncertainties of risks presented for the severe accidents studied here.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nLimerick FES 5-74. At the public licensing hearings, the Licensing Board refused to allow Limerick Ecology Action (LEA) to introduce a report that challenged the assertion that the risk of sabotage was impossible to quantify. The Licensing Board explained that, \"the Commission's policy statements, looked at collectively, militate in favor of not admitting the contention.\" Tr. 8777-78; J.A. 570-71. The first policy statement to which the Licensing Board apparently refers simply states, in part, \"The possible effects of sabotage or diversion of nuclear material are also not presently included in the safety goal. At present there is no basis on which to provide a measure of risk on these matters.\" Policy Statement on Safety Goals for the Operation of Nuclear Power Plants, 48 Fed. Reg. 10,772, 10,773 (1983). The second policy statement mentioned by the Licensing Board provides, \"while it is possible . . . that new information will demonstrate the desirability of certain . . . [design] changes . . . that would reduce the risk from sabotage. . . . [However], the capability of current designs or procedures . . . to control or mitigate severe accidents would not be addressed in case-related safety hearings.\" Proposed Commission Policy Statement on Severe Accidents and Related Views on Nuclear Reactor Regulation, 48 Fed. Reg. at 16,018 (1983). The last segment of this policy statement cited by the Licensing Board actually undermines the decision to exclude the issue of sabotage, providing, \"Although the Commission has explicitly excluded sabotage from the safety goal policy statement, the Commission recognized the merit of providing guidance on plant design that inhibit sabotage.\" 48 Fed. Reg. at 16,018. Finally, the Appeal Board summarized the NRC's justification for excluding the risk of sabotage: \"We are aware of no . . . principles (and LEA identifies none) that would permit reasonable prediction of . . . the kind of stochastic human behavior displayed in an act of sabotage. In sum, the risk of sabotage is simply not yet amenable to a degree of quantification that could be meaningfully used in the decisionmaking process.\" 22 N.R.C. at 701.\n\nEven if the NRC is correct in claiming that unquantifiable risks are properly ignored, the NRC has failed to articulate the critical facts upon which it relied in reaching this conclusion. Thus I cannot determine whether the agency has engaged in rational decision-making. See Columbia Gas Transmission Corp. v. Federal Energy Regulatory Comm'n, 202 U.S. App. D.C. 291, 628 F.2d 578, 593 (D.C. Cir. 1979). If it is true that there exists no method by which the NRC can assess the risk of sabotage, the NRC has provided us with no evidence in support of this assertion. The FES and the policy statements contain only undocumented conclusions. Without a more detailed explanation of the limits of risk assessment techniques, or citations to studies on sabotage, we have no idea whether the NRC has accurately described -- or is aware of -- the state of the art probabilistic risk assessment techniques for sabotage.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Furthermore, we also remain in the dark whether the NRC has made any attempts to improve this deficiency in risk assessment techniques.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Finally, the NRC's final Policy Statement on Severe Reactor Accidents, announcing that the risk of sabotage \"to the extent practicable, will be emphasized in the design and operating procedures developed for new plants,\" 50 Fed. Reg. at 32,141 (emphasis added), undermines the agency's assertion that this risk could not be meaningfully discussed in the Limerick licensing proceedings.\n\nAs an additional explanation for the exclusion of the sabotage risk, the NRC explains that, \"whatever additional risks might be associated with sabotage-initiated accidents are essentially already taken into account in the Limerick PRA [Probabilistic Risk Assessment] within a general category of uncertainties.\" 22 N.R.C. at 699 n. 18; Limerick FES 5-74. Because the NRC has provided no evidence that it has considered the risk of sabotage, I cannot determine whether it was arbitrary and capricious of the agency to assume that whatever additional risks might be associated with sabotage are already taken into account in the Limerick PRA. See Limerick FES 5-74. Thus, the administrative record in the Limerick proceeding differs from the one in Baltimore Gas, where the Supreme Court instructed reviewing courts not to magnify the significance of a single line item in a table containing a number of assumptions, and to employ a deferential standard of review when the Commission is making predictions at the frontiers of science. 462 U.S. at 102-103. In Baltimore Gas, the NRC arrived at its \"zero-release\" assumption after careful consideration and disclosure. The NRC Statement of Consideration announcing the final Table S-3 rule incorporating the zero-release assumption summarized the major uncertainty of long-term storage, which is that water could infiltrate the repository as a result of such diverse factors as geologic faulting, meteor strike, or the accidental or deliberate intrusion by man; Table S-3 refers interested person to staff studies that discuss the uncertainties in greater detail. Id. at 98-99 \u0026 n. 11 The NRC has provided us with no analogous evidence with respect to sabotage.\n\nIn sum, the NRC has failed to carry its burden to justify its decision to exclude a risk not found to be insignificant. We are asked to take it on blind faith that the NRC has attempted to assess the risk and has come up short. I would remand this case to the Commission to ensure that it has taken a \"hard look\" at the issue of sabotage.\n\nIII.\n\nSince, based on the foregoing analysis, I do not believe that the NRC can set forth a rational basis for excluding consideration of the risk of sabotage, I would require the NRC to include consideration of the risk in the decision whether to issue an operating license. On remand, I would require the NRC both to focus on whether the risk of sabotage is amenable to consideration in licensing proceedings, and to document its conclusions, so that this court can properly review the Commission's actions.\n\n\u003cspan class=\"fn\"\u003e1. On August 21, 1985, this Court rejected Martin's motion to add other Graterford prisoners as petitioners.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The parties initially disputed this Court's jurisdiction to hear several of the petitions, but it was agreed by all parties at oral argument that, with one exception, all the issues before us were raised in petitions for review of final licensing decisions, and that consequently we have jurisdiction over all the subject petitions. We agree. The only petition that involves issues not also raised in a petition from the final licensing decision is No. 85-3606, in which Robert L. Anthony challenges an NRC staff decision to exempt Limerick from the requirement that a full participation emergency exercise be held within one year of issuance of a full power operating license for a nuclear power plant. See 10 C.F.R. Part 50, App. E, IV.F.1. (1988). However, because a full participation exercise was conducted on April 3, 1986, this contention is now moot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. CEQ is the agency established under NEPA, 42 U.S.C. §§ 4341-47 (1982), which \"serve[s] as a research, resource, and advisory body in the Executive Office of the President of the United States.\" Hiram Clarke Civic Club, Inc. v. Lynn, 476 F.2d 421, 423 (5th Cir. 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The NEPA Interim Policy Statement required reasoned consideration of the environmental risks attributable to accidents at the facility for which the environmental impact statement was prepared, a discussion of risks at the particular plant arising from external causes, and an estimate of the socioeconomic impact that might be associated with the emergency measures during or following an accident. See 45 Fed. Reg. at 40, 101-04.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Three Commissioners filed separate views. Commissioner Gilinsky criticized the Commission's policy goals, because they were \"poorly conceived\" and its risk estimates, because they \"are based on uncertain and unreliable calculational techniques,\" 48 Fed. Reg. at 10,775. Commissioner Ahearne defended the Commission's views in response to Commissioner Gilinsky's comments. Id. at 10,776. Commissioner Asselstine commented that PRA may be \"an unreliable basis for making judgments on the overall risk posed by specific plants . . .,\" but praised the Commission for initiating a two-year evaluation period. Id. at 10,778.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The NRC let stand the final administrative appellate review decision affirming the Licensing Board's determination that PECO should be licensed to operate Limerick and thereafter issued an operating license for Unit 1. Limerick Generating Station, License NPF-39, 50 Fed. Reg. 32,918 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is well established that where one statute requires the \"functional equivalent\" of NEPA's environmental review process, a second, repetitive review under NEPA need not be undertaken. See Environmental Defense Fund, Inc. v. EPA, 160 U.S. App. D.C. 123, 489 F.2d 1247, 1256 (D.C. Cir. 1973) (finding the Federal Insecticide, Fungicide, and Rodenticide Act (\"FIFRA\") to be a functional equivalent); Merrell v. Thomas, 807 F.2d 776, 781 (9th Cir. 1986) (FIFRA), cert. denied, 484 U.S. 848, 108 S. Ct. 145, 98 L. Ed. 2d 101 (1987); Getty Oil Co. v. Ruckelshaus, 467 F.2d 349, 359 (3d Cir. 1972) (Clean Air Act), cert. denied, 409 U.S. 1125, 35 L. Ed. 2d 256, 93 S. Ct. 937 (1973). The Commission does not contend that NEPA and AEA are functional equivalents and we therefore do not express a holding on that issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This Court applied NEPA to the decision to expand on-site nuclear fuel storage capacity in Township of Lower Alloways Creek v. Public Service Elec. \u0026 Gas Co., 687 F.2d 732 (3d Cir. 1982), but did not address the question whether an AEA review of the same issue, or a decision declining AEA review, would have preempted NEPA review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The NRC contends that because Vermont Yankee held that NEPA is only procedural, Public Service and the other cases relied on by petitioner have been undermined. We disagree. The clear instruction of Vermont Yankee is that NEPA's procedural requirement cannot be expanded upon by the courts either by requiring additional procedures or by requiring substantive outcomes. The issue in Public Service and the other cases cited here is whether NEPA's procedural requirements were complied with, not whether additional procedures could be required. The issue sub judice is whether actions under the AEA may preclude NEPA considerations, not whether additional requirements may be imposed over and above NEPA. Finally, it is instructive to note that, as discussed supra, Typescript at 24, the NRC's own regulations implementing NEPA acknowledge the Commission's obligation to comply with NEPA's procedural requirements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The NRC also contends that it properly excluded design alternatives because it concluded that on the basis of its review of the Limerick license application, Limerick's design complied with existing AEA regulations mandating protection of health and safety. The basis for this assertion is unclear. The Commission states in passing that it has given \"appropriate AEA consideration\" to the question of mitigation alternatives, NRC Br. at 29 n. 11, yet does not identify what consideration was given, or how that consideration is the functional equivalent of the NEPA requirements, either in terms of agency decisionmaking or public participation. Instead, the Commission notes in a footnote that mitigation alternatives were excluded by the Commission staff in the form of: (1) Safety Evaluation Report, NUREG-0991 at 23-1 (1983); and (2) Review Insights on the Probabilistic Risk Assessment for the Limerick Generating Station, NUREG-1068, at 1-7 to 1-8, which concluded that severe accident mitigation systems were not warranted. NRC Br. at 25 n.8. However, according to the NRC, the Final Policy Statement precluded consideration of such information under the AEA; hence the purported \"basis\" for the decision was expressly not the staff studies listed above, but rather the Final Policy Statement. Moreover, even if the NRC maintained that such staff conclusions met NEPA's requirements, which it does not, we would then face the question whether staff conclusions which were not considered as a part of the licensing process and were not subject to challenge in the licensing proceeding could satisfy NEPA, see Calvert Cliffs' Coordinating Committee, Inc. v. AEC, 146 U.S. App. D.C. 33, 449 F.2d 1109, 1118 (D.C. Cir. 1971), a most doubtful proposition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The principal mitigation design alternative that could have been considered here appears to have been a \"filtered-vented containment,\" a secondary structure that acts as a giant filter connected to an emergency vent in the primary containment vessel. Filtered-vented containment functions by relieving pressure in a containment structure that occurs in a core melt. At some set point, the overpressurized materials are released into a filter. The filter prevents the radioactive solids from being released while letting out gases, in particular radioiodines and noble gases. The system thereby prevents only the immediately fatal products of a core melt, the solids, from being released. See generally Survey of the State of the Art in Mitigation Systems, NUREG/CR-3908 at 62 (1984). The Commonwealth asserts that the filtered-vented containment system has been used in other countries such as France, Sweden and West Germany, and is required in France before new power plants will be licensed. See Commonwealth Br. at 8 (citing Nucleonics Week, September 3, 1987). PECO responds that further study is required before conclusions can be drawn about such systems. PECO Br. at 23. A second type of mitigation alternative is the core-melt retention device, which collects a molten core and conducts it to a chosen location to prevent it from rupturing the containment and entering the environment. See NUREG/CR-3908.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In PWR Severe Accident Delineation and Assessment, NUREG/CR-2666 (1983), the NRC considered SAMDAs with respect to the Zion, Indian Point and Limerick plants and concluded that \" a serious look at what measures are best is still needed.\" Id. at 85. The NRC committed itself to continuing study of SAMDAS: \"Future work should be more complete and yield a more comprehensive study and evaluation of mitigation for each plant. Various sequence and mitigation strategies should be considered, and followed by detailed engineering feasibility studies.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In the Proposed Policy Statement, the Commission had stated that \"in future applications for both pressurized water reactors (PWRs) and boiling water reactors (BWRs) [such as Limerick] filtered vent containment systems or a variation of such systems, should be provided if these yield a cost-effective reduction in risk.\" 48 Fed. Reg. 16,014, 16,019 (1983). LEA urged before the Appeal Board that the Final Policy Statement, which concluded that mitigation design alternatives \"should not be addressed in case-related safety hearings,\" 50 Fed. Reg. at 32,145 (emphasis added), although perhaps applicable to Atomic Energy Act safety proceedings, could not be used to exclude such alternatives under the Commission's NEPA requirements. The Appeal Board rejected LEA's contention on the ground that \"it is unreasonable to believe the Commission intended to preclude litigation of severe accident mitigation measures under the rubric of safety issues, while permitting the litigation of the same subject matter as an environmental issue.\" 22 N.R.C. at 696 n. 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Safety Evaluation Report, NUREG-0991 at 23-1; Review Insights, NUREG-1068 at 1-8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Pacific Gas \u0026 Electric court explained that \"an agency cannot escape its responsibility to present evidence and reasoning supporting its substantive rules by announcing binding precedent in the form of a general statement of policy.\" 506 F.2d at 38-39; see also Texaco, Inc. v. FPC, 412 F.2d 740, 744 (3d Cir. 1969) (general policy statements cannot establish binding norms in support of particular agency rulings); Amrep Corp. v. FTC, 768 F.2d 1171, 1178 (10th Cir. 1985), (same) cert. denied, 475 U.S. 1034, 89 L. Ed. 2d 352, 106 S. Ct. 1167 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. According to the Proposed Policy Statement, two rules on hydrogen control and related matters, one final and one proposed, would provide adequate assurance that the risk of degraded core accidents was acceptable. 48 Fed. Reg. at 16,018.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The policy statement itself says it is to be fleshed out, and is not a final statement of the NRC's position: The policies presented in this statement will lead to amendment of NRC regulations, standard review plans for licensing actions, or other decision procedures and criteria as part of NRC's ongoing Severe Accident Program. This Policy Statement makes allowance for such changes as the result of the development of new safety information of significance for design and operating procedures. 50 Fed. Reg. at 32,139.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The APA provides: Except when notice or hearing is required by statute, this subsection does not apply -- (A) to interpretative rules, general statements of policy, or rules of agency organization, procedure, or practice; . . . . 5 U.S.C. § 553(b)(A) (1982); see American Mining Congress v. Marshall, 671 F.2d 1251, 1263 (10th Cir. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. There may be instances in which the policy statement itself fully explicates the NRC's position as applied to the particular individual plant such that we would find it to be sufficient for purposes of careful consideration. In this case, however, see infra Typescript at 43-47, the policy statement as applied to Limerick fails to meet the careful consideration standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. LEA also maintains that the Final Policy Statement is flawed because the rule itself must be capable of incorporation into individual environmental impact statements with sufficient clarity to be \"capable of being understood by the reader without the need for undue cross reference.'\" Baltimore Gas, 462 U.S. at 99 n. 12, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (quoting 38 Fed. Reg. 20,554 (1973), 40 C.F.R. § 1500.8(b) (1974)). The NRC does not respond to this argument, because it contends that the policy statement was not immune to challenge in individual licensing proceedings as a rule would have been and hence that \"the petitioners' various arguments that turn on the fact that the policy statement was not a rule are simply irrelevant.\" NRC Br. at 33 n. 16. Because we conclude that the agency did, in fact, rely on the policy statement without subjecting it to challenge in the Limerick licensing proceeding, we believe that petitioner's argument is certainly not \"irrelevant.\" We nevertheless need not consider LEA's contention, because we grant the petition for review on other grounds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Lower Alloways, albeit in dictum, stated that \"as for [a generic environmental impact statement], it is clear that the NRC cannot use that document as a proxy for the more individualized consideration of a particular expansion proposal that NEPA would appear to require. . . .\" 687 F.2d at 748. If the routine expansion of fuel storage is insufficiently generic among plants to justify generic treatment, it would seem that the use of mitigation design alternatives at plants with significantly different severe accident potentials should not be subject to generic treatment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In Minnesota v. NRC, 195 U.S. App. D.C. 234, 602 F.2d 412 (D.C. Cir. 1979), decided before Baltimore Gas, the District of Columbia Circuit recognized that the NRC \"could properly consider the complex issue of nuclear waste disposal in a 'generic' proceeding such as rulemaking, and then apply its determinations in subsequent adjudicatory proceedings\". Id. at 415-16. The court remanded the case for further consideration by the NRC in light of an ongoing rulemaking to determine the feasibility of interim or ultimate nuclear waste disposal solutions. The court noted, however, that such generic proceedings are appropriate \"where factual issues do not involve particularized situations,\" but rather involve an issue \"essentially common to all nuclear facilities.\" Id. at 416-17. As we discuss infra, Typescript at 46-47, such \"particularized situations\" do exist here and on the record before us, generic rulemaking is inappropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Moreover, not only is the severity of consequences not subject to generic determination, we doubt that likelihood of occurrence is subject to such an across-the-board rule. The Commission has noted that \"the occurrence of a severe accident is more likely at some plants than at others.\" 50 Fed. Reg. at 32,139. Furthermore, the policy statement directs that individualized consideration of new plants consider a full range of new safety proposals, including exactly these same proposed mitigation systems, 50 Fed. Reg. at 32,140-41; 22 N.R.C. at 696 n. 11, implicitly recognizing that such consideration will not be common to all new plants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As we noted supra Typescript at 14, the NRC defined serious accidents as remote and speculative before the partial core melt at Three Mile Island. On appeal, the NRC contends that although serious accidents can no longer be considered remote and speculative after Three Mile Island, a different category of risks is at issue here: serious accidents with \"serious offsite consequences.\" NRC Br. at 29. However, the Appeal Board did not make such a distinction and did not base its exclusion of design alternatives on such a concept.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. As the Supreme Court noted in Baltimore Gas, \"it is not our task to determine what decision we, as Commissioners, would have reached. Our only task is to determine whether the Commission has considered the relevant factors and articulated a rational connection between the facts found and the choice made.\" 462 U.S. at 105 (citing Bowman Transp., Inc. v. Arkansas-Best Freight System, Inc. 419 U.S. 281, 285-96, 95 S. Ct. 438, 42 L. Ed. 2d 447 (1974); Citizens to Preserve Overton Park, Inc. v. Volpe, 401 U.S. 402, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The NRC also contends that because its consideration of serious accidents in operating licensing proceedings was discretionary, it need not consider alternative safety systems. We are troubled by the NRC's seeming insistence on defining serious risks as remote and speculative, hence not considering their environmental impacts, until experience proves the Commission wrong.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 10 C.F.R. § 50.47(c)(1) (1988), which is applicable, provides as follows: Failure to meet the applicable standards set forth in paragraph (b) [emergency plan requirements] of this section may result in the Commission declining to issue an operating license; however, the applicant will have an opportunity to demonstrate to the satisfaction of the Commission that deficiencies in the plans are not significant for the plant in question, that adequate interim compensating actions have been or will be taken promptly, or that there are other compelling reasons to permit plant operations. We also note that 28 U.S.C. § 2342(4) (1982) gives us \"exclusive jurisdiction to enjoin, set aside, suspend (in whole or in part), or to determine the validity of . . . all final orders of the [Nuclear Regulatory] Commission made reviewable by section 2239 of title 42.\" In this case, however, the petitioners are not asking us to enjoin, set aside, suspend or determine the validity of the grant of an operating license to Limerick Units 1 and 2. Rather, they ask us to remand to the Commission and order it to hold evidentiary hearings on issues the Commission should have, but failed to, consider under NEPA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. LEA also contends that its exclusion is inconsistent with the NRC's Final Policy Statement, which indicates that sabotage risks are \"potential contributors\" to plant risks which will be \"carefully analyzed.\" 50 Fed. Reg. at 32,141. However, those statements indicate only that the NRC intended to analyze the risk of sabotage to the extent possible, and do not indicate that risk assessment techniques were available that would enable such analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The CEQ guidelines subsequently have been amended to eliminate the requirement that a worst case analysis be performed, and now require \"reasonably foreseeable\" adverse impacts to be analyzed, even if probability is \"low.\" 51 Fed. Reg. 15,618 (April 25, 1986) (codified at 40 C.F.R. § 1502.22(b)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The decision of the Licensing Board is followed by a rather tortuous history through the Commission, 12 N.R.C. 609 (1980), the Court of Appeals for the District of Columbia Circuit, People Against Nuclear Energy v. NRC, 219 U.S. App. D.C. 358, 678 F.2d 222 (D.C. Cir. 1982), and the Supreme Court, Metropolitan Edison Co. v. People Against Nuclear Energy, 460 U.S. 766, 75 L. Ed. 2d 534, 103 S. Ct. 1556 (1983). Ultimately, the Supreme Court decided that psychological harm based on a mere perception of risk was not cognizable under NEPA. 460 U.S. at 779. But neither the Court of Appeals nor the Supreme Court questioned the Licensing Board's procedural treatment of a challenge to the NRC's assertion that the risk cannot be quantified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The dissent argues that the \"NRC has in this instance, equated the word 'meaningful' with the word 'quantifiable.'\" Diss. at 754. We do not believe that is a fair characterization of either the NRC's position or our conclusion. We do not hold that the mere assertion of unquantifiability immunizes the NRC from consideration of the issue under NEPA. To the contrary, we endorse the approach taken by the Licensing Board in the Three Mile Island case, 11 N.R.C. 297 (asserted lack of quantifiability does not necessarily preclude further consideration under NEPA), but find that LEA has failed to carry its burden to rebut the NRC's claim that it cannot meaningfully consider the issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. LEA points out that other areas that are too uncertain to be analyzed by PRA have been considered by using conceptual modeling and scenario assumptions, citing 48 Fed. Reg. at 16,020. In fact, the risk of earthquake, which LEA asserts is quantitatively uncertain, was considered in the Limerick environmental review. Despite this apparent inconsistency in the Commission's approach, we do not conclude that consideration of some speculative risks, e.g., earthquake, but not others, e.g., sabotage, is necessarily an arbitrary or capricious exercise of the Commission's broad discretion. As the NRC has stated, \"LEA has . . . failed to cast any serious doubt on either the staff's conclusion that a sabotage risk analysis is beyond state of the art probabilistic risk analysis or the Commission's similar determination that there is no basis by which to measure that risk.\" 22 N.R.C. at 699. LEA has not convinced us that this determination of the NRC was arbitrary and capricious.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. LEA maintains that City of Rochester v. Postal Service, 541 F.2d 967, 973 (2d Cir. 1976), supports its contention that socioeconomic impacts arising after one year must be considered. The court in City of Rochester held that the Postal Service was required under NEPA to consider the long term effects of \"urban decay and blight.\" In City of Rochester, however, the Postal Service had failed to consider any off-site environmental effects of the construction of a new postal facility. The court concluded that the effects of increased commuting, movement of employees to the suburbs, and abandonment of the downtown area must be considered, but did not address the length of a reasonable period during which such impacts must be considered. Id. at 974. City of Rochester, therefore, does not provide guidance for the issue presented to this Court. LEA also cites to Trinity Episcopal School Corp. v. Romney, 523 F.2d 88, 93-95 (2d Cir. 1975) (\"NEPA's review encompasses in the urban setting the quality of urban life.\"). In Trinity, the Second Circuit held that the effects of inter alia displacement and relocation of residents, decay and blight, implications for city growth policy and neighborhood stability must be considered by the Department of Housing and Urban Development, which had simply stated that no alternatives to its proposed action existed. Trinity is not helpful, however, because the court did not discuss the minimum length of time over which such considerations must be studied or the point at which such considerations would become speculative. Additionally, LEA cites Concerned About Trident, 180 U.S. App. D.C. 345, 555 F.2d 817 (D.C. Cir. 1977), to support the proposition that a decreasing ability to forecast effects beyond a certain date does not excuse failure to consider impacts but that a reasonable effort to discern future effects is required. One issue in that case was how far into the future the Navy had to estimate environmental impacts in its environmental impact statement. The Court of Appeals did not set a minimum time period and did not \"demand that the agency 'foresee the unforeseeable',\" but declared that \"just as the EIS for a proposed highway may not analyze only the environmental effects of the construction stage of the new road, but must also look to the [effects] it will bring to the community when it is completed\", the Navy environmental impact statement must look to the impacts generated from operation. 555 F.2d at 830 (footnote omitted); see also Potomac Alliance v. NRC, 682 F.2d 1030, 1036 (D.C. Cir. 1982) (\"It is well recognized that a lack of certainty concerning prospective environmental impacts cannot relieve an agency of responsibility for considering reasonably foreseeable contingencies that could lead to environmental damage.\"). Although Trident suggests that increasing difficulties in ensuring accuracy of a forecast do not excuse a less than \"reasonable effort to discern . . . the effects,\" id., that are at issue in the environmental impact statement, it does not assist us in determining whether a reasonable effort was made here. While we believe that the one-year time period was quite short, in light of the extreme uncertainty in estimating socioeconomic consequences in this case, we do not believe that it was arbitrary and capricious. LEA also contends that the NEPA guidelines promulgated by the CEQ require consideration in an environmental impact statement of these socioeconomic effects, see 40 C.F.R. § 1508.14 (1987) (socioeconomic issues \"interrelated\" with the environmental issues must be addressed in environmental impact statement). This same requirement is reiterated in the Interim Policy Statement and, as discussed supra, we find the Commission's consideration of socioeconomic effects to be adequate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See Izaak Walton League of America v. Marsh, 210 U.S. App. D.C. 233, 655 F.2d 346, 377 (D.C. Cir. 1981) (\"NEPA does not require federal agencies to examine every possible environmental consequence. Detailed analysis is only required where impacts are likely. . . . So long as the environmental impact statement identifies areas of uncertainty the agency has fulfilled its mission under NEPA.\") (citation omitted), cert. denied, 454 U.S. 1092, 102 S. Ct. 657, 70 L. Ed. 2d 630 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. A recent Executive Order permits the Federal Emergency Management Agency to intervene in cases in which state or local governments have declined or failed to enter into emergency preparedness plans. See Exec. Order No. 12,657, 53 Fed. Reg. 47,513 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Martin contends in his petition for review that his procedural due process rights were violated because: (1) he was pressured into accepting an expedited schedule violating 10 C.F.R. Part II and the APA; (2) the inmates were pressured into trading other contentions for a view of the plan; (3) the Licensing Board was biased and demonstrated hostility (as evidenced by its unwillingness to reveal the undeleted evacuation plan); and (4) the Licensing Board was reversed three times by the Appeals Board. Martin maintains that money damages should be granted, citing Carey v. Piphus, 435 U.S. 247, 266-67, 55 L. Ed. 2d 252, 98 S. Ct. 1042 (1978) (\"denial of procedural due process should be actionable for nominal damages without proof of actual injury\"). The NRC rejoins that any potential due process challenges were satisfied by the Appeal Board via its many reversals of the Licensing Board, or related to matters that Martin had agreed to, were harmless, or lack factual support. Although the Licensing Board was apparently hostile to the prisoners, we do not find a due process deprivation that the Appeal Board did not correct or to which Martin did not voluntarily stipulate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Martin also asserts that the decision to exclude the contention that the union was unaware of the plan was arbitrary and capricious because the NRC did not weigh the five factors, 10 C.F.R. § 2.714(a)(1) (as incorporated by reference into § 2.714(b)) for determining whether additional time should be granted for filing a supplement (to provide the required reasonable specificity in the contention). Martin does not contend that he presented this argument to the Licensing or Appeal Boards, however, and there is no suggestion in their opinions that he did so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Although consideration of a \"remote\" possibility may entail \"speculation,\" the two terms are not synonymous. \"Remote\" is defined as \"far removed in time . . . [or] space.\" Webster's Third New International Dictionary at 1921 (1964). \"Speculative\" is defined as \"not subject to clear-cut demonstration or analysis.\" Id. at 2189. The Appeal Board suggests that Sierra Club v. Sigler, 695 F.2d 957 (5th Cir. 1983) supports the NRC's position that NEPA allows an agency to disregard risks that are not quantifiable. 22 N.R.C. at 701. I disagree. Although the Sigler court uses the terms \"speculative\" and \"remote\" to denote generic \"uncertainty,\" 695 F.2d at 974-975, it never insisted that the uncertainties be \"quantifiable.\" In fact, the Sigler court took the position that the CEQ \"worst case scenario\" is part of the common-law of NEPA, and therefore binding on the NRC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Twice in these proceedings the NRC mentioned the notion of \"remoteness.\" First, the policy statement on which the Licensing Board relied in excluding consideration of the sabotage risk provides, that \"it is the Commission's intention to keep such risks [as sabotage] at their present, very low level.\" 48 Fed. Reg. at 10,773. Second, the Appeal Board cited case law indicating that \"an agency 'may (and should) consider remoteness.'\" 22 N.R.C. at 701 (citation omitted). These vague references to remoteness cannot substitute for an agency's clearly articulated and documented finding that the risk is \"remote and highly speculative.\" The NRC cannot invoke the words \"remote and highly speculative\" as a talismanic phrase intended to ward off judicial scrutiny of its actions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. It should be noted that these regulations address the establishment and maintenance of a physical protection system, rather than the design of the nuclear reactor. Where the possibility of other severe accident initiators such as earthquakes and fires were considered in the licensing proceedings, several modifications to the plant design were implemented during its construction. Limerick FES 5-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. I would also require that the NRC provide specific evidence in support of any conclusion that the risk of sabotage is \"remote and highly speculative.\" In this regard, I disagree with San Luis Obispo, which affirmed NRC conclusions despite the lack of record evidence. See San Luis Obispo, 751 F.2d at 1332-1335 (given lack of record evidence to support NRC assertion of \"low probability\" of risk, majority should not have affirmed Commission decision to exclude from consideration the complicating effects of earthquakes on response to radiological emergency at Diablo Canyon nuclear power plant) (Wald, J., concurring in part, dissenting in part).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In its determination that the NRC's decision to exclude consideration of the risk of sabotage is supported by the record, the majority invokes the warning in Baltimore Gas that a reviewing court be at its \"'most deferential' when the NRC makes such a scientific determination.\" Maj. op. at 743 (quoting Baltimore Gas, 462 U.S. at 103). This reference to Baltimore Gas is inapposite. In Baltimore Gas, the Court cautioned against judicial overreaching where the agency is \"making predictions . . . at the frontiers of science.\" 462 U.S. at 103. In this case, the NRC has made no such scientific prediction. As the Supreme Court stated, the NRC in Baltimore Gas reached its zero-release assumption after \"confronting the issue,\" as evinced by the \"impressive\" volumes of proceedings on the risk in question. Id. at 98. In contrast, the NRC has refused to confront the issue of sabotage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Appeal Board explains this confusing final sentence: \"whatever additional risks might be associated with sabotage-initiated accidents are essentially already taken into account in the Limerick PRA [Probabilistic Risk Assessment] within a general category of uncertainties.\" 22 N.R.C. at 699 n. 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. LEA cites testimony from the Indian Point Nuclear Power Plant proceedings, indicating disagreement within the technical community, and asserting that the European Communities have begun including sabotage in its PRA models. See Consolidated Edison Co. of New York, et. al. (Indian Point, Unit No. 2), 18 N.R.C. 811, 889 (1983); LEA Brief at 33. The NRC has manifested no awareness of this debate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In the Indian Point litigation, the Licensing Board noted that NRC Staff \"acknowledged that some members of the Advisory Committee on Reactor Safety (ACRS) have urged Staff, over the last three or four years, to undertake the probabilistic risk assessment of sabotage.\" 18 N.R.C. at 889.\u003c/span\u003e\n\n",
    "body_length": 164691,
    "citedas": [
      "869 F.2d 719"
    ],
    "attorneys": "Charles W. Elliott (Argued), Brose and Poswistilo, Easton, Pennsylvania, Attorney for Petitioner Limerick Ecology Action, Inc. Angus R. Love (Argued), Norristown, Pennsylvania, Attorney for Petitioner, Thomas Martin. Robert L. Anthony, Moylan, Pennsylvania, Petitioner Pro Se. William C. Parler, General Counsel, William H. Briggs, Jr., Solicitor, E. Leo Slaggie, Deputy Solicitor, Irwin B. Rothschild, III, Deputy Asst. General Counsel, G. Paul Bollwerk, III (Argued), Michael B. Blume, Senior Attorneys, Washington, District of Columbia, Peter R. Steenland, Jr., Chief Appellate Section, Vicki L. Plaut, Arthur E. Gowran, Jacques B. Gelin, Washington, District of Columbia, Attorneys for Respondents. Bernard Chanin, Wolf, Block, Schorr and Solis-Cohen, Philadelphia, Pennsylvania, Edward G. Bauer Jr., Eugene J. Bradley, Philadelphia, Pennsylvania, Troy B. Conner, Jr., Robert M. Rader (Argued), Nils N. Nichols, Conner \u0026 Wetterhahn, P.C., Washington, District of Columbia, Attorneys for Intervenor, Philadelphia Electric Company. Richard D. Spiegelman, Chief Deputy General Counsel, Timothy D. Searchinger, Deputy General Counsel, John R. McKinstry, Assistant Counsel, Harrisburg, Pennsylvania, Attorneys for Amicus Curiae, Commonwealth of Pennsylvania. Ellyn R. Weiss, Harmon \u0026 Weiss, Washington, District of Columbia, Attorney for Amicus Curiae, Union of Concerned Scientists.",
    "category": [
      "251",
      "75"
    ],
    "judges": "Becker, Hutchinson and Scirica, Circuit Judges. Scirica, Circuit Judge, dissenting in part.",
    "citation_count": 26
  }
}
