{
  "id": "brhsTmYBTlTomsSBVrQ-",
  "document": {
    "title": "State v. Perry",
    "full_title": "STATE OF NEW JERSEY v. ARTHUR PERRY",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1991-05-20T00:00:00.000Z",
    "docket": "No. A-3",
    "body": "On Thursday, February 27, 1986, Arthur Perry went to a second-floor bedroom of an apparently abandoned house at 762 Division Street in Camden, New Jersey, to inject himself with heroin. Jerome Redd, a fourteen-year-old acquaintance of Perry who often supplied Perry with drugs, entered that room before Perry could inject himself with the drugs. The ensuing encounter led to the death of Jerome Redd.\n\nA jury convicted defendant, Arthur Perry, of the murder of Jerome Redd and sentenced him to death. He appeals directly to this Court as a matter of right. R. 2:2-1(a)(3). We affirm defendant's conviction of knowing murder and related offenses.\n\nBecause we find that there was insufficient proof to have submitted to the jury the aggravating factor described in N.J.S.A. 2C:11-3c(4)(c) (\"c(4)(c)\"), we reverse the imposition of the death penalty. For the same reason, no court may again impose the death penalty on defendant. Consequently, we remand the matter to the Law Division for the imposition of a life sentence with a thirty-year-parole-ineligibility term, pursuant to N.J.S.A. 2C:11-3(b).\n\nOn March 4, 1986, Perry confessed to killing Redd following a brief dispute over drugs, money, and a possible distribution/commission arrangement between Perry and Redd. The confession followed a week-long investigation by the Camden City Police Department and the Camden County Prosecutor's Office.\n\nA. The Initial Discovery of Jerome Redd's Body at 762 Division Street\n\nOn Sunday, March 2, 1986, Arthur Perry and Clark Miller, his estranged homosexual partner, called the Camden Police to report that they had found a dead body in the basement of a home owned by Perry located at 762 Division Street, Camden. When, in response to the call, Detective Beverly arrived several minutes after 1 p.m., Miller and Perry told Beverly that they had found a body in the right rear corner of the basement. They then showed Beverly the door to the basement.\n\nBeverly went into the basement carrying his service flashlight. In the relative darkness, Beverly \"couldn't see anything,\" despite his flashlight. What he could see appeared to be rags. Beverly then left the basement without determining that a body was actually present.\n\nAfter obtaining a stronger flashlight Beverly returned to the basement where he found a dead, young black male of medium complexion with an electrical cord wrapped \"choker-style\" around\n\nhis neck. The body was in a semi-sitting position, covered by a blanket, and partially hidden by a detached screen door. After replacing the blanket, which he had partially removed from the victim during his initial inspection, Beverly returned to the front of the house and notified the appropriate members of the police force and the prosecutor's office. After ordering Patrolman Vernon Curtis to keep the area secure, Beverly took Miller and Perry to the police administration building for interviewing.\n\nB. The Subsequent Investigation of the Basement of 762 Division Street\n\nMeanwhile, the \"appropriate members\" of the police department and the prosecutor's office, Inspector Craig Milbury and Crime Scene Technician Paul Scully, responded to the crime scene and went directly to the basement, where Scully began to photograph the scene, collect physical evidence and sketch a diagram of the scene.\n\nBecause the presence of the electrical cord around the victim's neck suggested that the victim had been hanged, Milbury's investigation focused on evidence to support that cause of death. He found none.\n\nInvestigator James Doyle of the Camden County Medical Examiners Office then arrived. Following his check-list report form, he inspected the body. He noted rigor mortis in the jaw, arms and legs and livor mortis in the back.\n\nDr. Sunandan Singh, an assistant medical examiner for Camden County, conducted an autopsy, which indicated asphyxia by manual strangulation as the cause of death. He also ruled out death by hanging because the broken hyoid bone and ligature marks that lacked an upward turn contra-indicated such a conclusion. Although this confirmed an earlier, independent conclusion by Inspector Milbury, it still left unexplained the electrical cord wrapped around Redd's neck. Dr. Singh noticed another oddity: the victim had unusually well-arched eyebrows,\n\nas if shaved or plucked. He also had pink make-up around his eyes.\n\nC. Subsequent Investigation of Other Areas In and Around 762 Division Street\n\nAfter transporting Perry and Miller to the police station, Detective Beverly canvassed the neighborhood around Division Street with a polaroid photo of the victim in an unsuccessful effort to find someone who could identify the victim.\n\nInspector Milbury surveyed the rest of the house. He found the first floor empty, except for an unplugged refrigerator. The second floor had two sparsely furnished bedrooms. One of the rooms had \"a lived-in or transient appearance\" and contained blue glassine bags with a white powdery residue, plus drug paraphenalia, including a burnt spoon, two syringes, and two pumps. Milbury also discovered forms and insurance paperwork bearing the name Clark Miller and the address 1189 Landsdowne Avenue, Camden.\n\nD. Statements by Arthur Perry Concerning the Police Investigation\n\nBetween March 2, 1986, when authorities were first notified of the discovery of the victim's body, and March 4, 1986, when Perry confessed to killing Jerome Redd, police officers or members of the prosecutor's office interviewed Perry four times. Although defendant was notified repeatedly of his right to remain silent and his right to counsel, he volunteered his assistance each time, seeking to resolve that matter as quickly as possible. Because inconsistencies developed between his statements and those of Miller as well as among his own statements, authorities interviewed Miller and Perry separately and sought additional evidence further to corroborate or discredit the story of either one.\n\n1. The Initial Interview at 762 Division Street\n\nAfter Detective Beverly had transported Perry and Miller to the police administration building, Inspector Milbury, who had taken charge of the investigation, decided to question Miller and Perry at the scene. The two were returned for that purpose.\n\nPerry told Inspector Milbury that he owned the house and that he and Miller had discovered the body while making one of their periodic checks for vandalism. He stated that they had arrived Sunday March 2nd, at around 1:00 p.m. and had noticed the front door ajar. When they entered the house, they discovered that the basement door had been nailed shut. Perry said that they pried open the door and went into the basement, where they discovered that a screen door had been moved and seemed to cover \"something stashed.\" Because of the dim lighting in the basement, Perry reached out and felt a human knee. Miller then lit his cigarette lighter to provide illumination and confirmed that there was a body. Milbury asked Perry and Miller if they knew the identity of the victim. Each said he did not.\n\n2. The Later Interview at the Police Administration Building\n\nAfter the initial interview at 762 Division Street, Perry and Miller were taken back to the Administration Building for separate interviews by Inspector Milbury, during which previously unknown facts and further inconsistencies came to light. When informed of the inconsistencies, each volunteered to take a polygraph test.\n\nBefore Perry could be given the test, he terminated the interview, promising instead to return the next day to submit to the polygraph. He stated that he wished to confer with counsel.\n\n3. The March 3rd Interview\n\nWhen Perry returned to the Administration Building on Monday, March 3rd, he stated that he wanted to proceed with the polygraph test. He had not communicated with his attorney. During the pre-test interview Perry revealed that he and Miller had a homosexual relationship and that he knew the victim, Jerome Redd. This conflicted with his earlier statements to Milbury. Perry also stated that the house at 762 Division had been purchased for one dollar as a \"shooting gallery,\" i.e., a place for drug users to inject or \"shoot up\" drugs. Perry repeated his story about checking for vandalism. He added that he had also gone into the house on Sunday, March 2nd, to inject drugs. According to Perry, Miller waited outside, entering only when Perry called him in to investigate the boarded-up door.\n\nHis suspicions aroused because of Perry's appearance and behavior, the polygrapher asked Perry if he had taken drugs. On receiving an affirmative response, he terminated the test, which was then scheduled for the following day. Perry left, accompanied by Miller.\n\nThereafter, Milbury interviewed Robert Morton, a local high-school teacher who lived on Division Street, and two of his pupils, Todd Lewis and Troy Hunt, both also Division Street residents. The teacher stated that he knew the victim, Jerome Redd, to be a drug dealer who frequented the shooting gallery at 762 Division Street. He also mentioned that he had information that on occasion Perry allowed Redd to borrow a maroon Buick in exchange for drugs. The vehicle was later identified as Miller's car. The two boys stated that they had been in the Division Street building with Perry on Friday, February 28th, and that they had helped him fix the lock on the front door. They also had watched him nail shut the basement door. They differed over whether Miller was present while the door was being nailed shut. One said that he was, while the other stated that Miller arrived just after Perry had completed the task.\n\nThis information from the boys directly contradicted Perry's assertion that he had found the door boarded up.\n\n4. The March 4th Interview\n\nPerry was scheduled for a polygraph test at 2:00 p.m. on March 4th. The police had assumed that he would arrive with Miller, who was also scheduled for a polygraph that day. When Miller arrived without Perry, the police asked Miller to find Perry and bring him back. Miller returned at noon without Perry.\n\nMiller informed Inspector Milbury and Detective Beverly that Perry would not come to the station until after he had purchased and used drugs. Realizing that Perry's drug use would cause another postponement of the twice-delayed polygraph, Milbury and Beverly set out to find Perry before he could purchase or use drugs. After looking unsuccessfully at several known Camden drug-dealing locations, they drove by Miller's 1189 Landsdowne Avenue address where they spotted Miller's car. Knowing Miller to be at the police station, they stopped to look for Perry.\n\nEntering through the partially-open door, Milbury and Beverly saw Perry at the top of the stairs. He said that although he knew that he was supposed to be at the detective bureau taking a polygraph, he wished to \"mellow out\" prior to the interview. He asked the detectives if he could then inject the drugs. They said \"no\" and confiscated the drugs, a spoon and a hypodermic needle.\n\nWhile under arrest for unlawful possession of those drugs and the paraphernalia, Perry stated that he nonetheless wanted to continue with the previously-scheduled polygraph test because he \"wanted to clear himself.\" After being taken to the detective bureau for that purpose, Perry again went through a pre-test interview, in which he basically repeated the same story he had previously given. James Bandock of the Camden County Prosecutor's Office then conducted the polygraph examination.\n\nIn common parlance, he \"failed the lie detector test.\" The examiner told Perry the results.\n\nPerry then changed his story several times in several ways. He then agreed to give a taped statement to Detective Beverly and Inspector Milbury. In that statement, he confessed to killing Jerome Redd on Thursday, February 27, 1986.\n\nQ. Okay, Arthur, will you describe to me in your own words exactly what you know concerning the commission of this crime?\n\nA. There was a dispute over monies. He and the people he worked for was trying to get me to distribute drugs so I could have drugs free of charge and to make them money. By them knowing that I didn't need that, they pursued coming around the job, coming around our home, to give me drugs. On that Thursday when Clark got me out of prison, out of jail, and bailed me out, the young man came around to the home\n\nwith two bundles to try to give me both of them so I could sell some for him. When I resisted and, to do so, we got into an argument. I did not mean to kill this man [Jerome Redd].\n\nHe stood as tall as I did, so I had to grab him. I grabbed him in the fashion that I learned in the Marine Corp., by the neck, and locking him. When we fell, the pressure of my grip strangled him obviously. He got limp for a few minutes, then he broke out into a rage as if he was trying to really get loose. I guess that's when he was losing his life. And I held him for another minute or so and he just collapsed; he died. I panicked, searched his body for any weapons or any other drugs, took him downstairs, attempted to get rid of his body out of my place, but it was too early to do so, so I camouflaged his body behind an air-conditioning unit in the basement. Didn't want to touch his body so I took a cord that was given to me and tied him up and drug him to the area which he was found and camouflaged him as much as I could.\n\nQ. Okay. Now, again, how did this argument develop while you and he were in the residence?\n\nA. Over monies that they say that I had owed them.\n\nQ. Now, was the victim, Jerome Redd, already in the house at that time?\n\nA. A, he had shortly came in just before I even got a chance to do anything with what I had.\n\nQ. Were you in the process of shooting your drugs.\n\nA. Yes.\n\nQ. Even when he came in.\n\nA. Right.\n\nUm, he told me he had something nice.\n\nQ. Referring to drugs?\n\nA. To the drug. I said, well, let me do this and let me check out what you've got. And he said, you know that you owe us money. I said, look, as far as I know all my debts are paid. He said, well, we can work around that; I have something for you if you want to take it and every four bags you sell you get one for yourself; if you fuck us around, you know you can't be here no more. I said, I don't have to do all of that, you know. He started cursing me out and, um, went into this little rage, and he came towards me just as I was injecting and I took one, I didn't have even a chance to boot as they call it, and I took the syringe out of me and I told him, I said, look M.F., you better back the fuck up and wait until what I got to do, figuring I could pump enough fear in him to make him shut up and wait. It didn't work. He came at me as if he had something, that's why I searched him after what went down.\n\nA weapon. I thought he had a gun or a knife or something, cause he was too anxious to come at me. And, um, before I had gave him a chance to do such, when he walked towards me cause its a narrow room, I gave him enough room to get close enough to me where when he pointed at me, I moved to the side and I grabbed him and threw him back over me, you know. And, um, it was a method I learned from the Marine Corp. I grabbed him, threw my knee up and threw him down on it and kept him locked like that to restrain him. And, I seen that he wasn't gonna cool out and he just broke into a rage and we scuffled for a few.\n\nAnd, um, I just held on to him as tight as I could, and he relaxed for a second. Now, I know when you strangle somebody the first thing that they pass out. I assume that's what happened. As soon as I gave a little bit of leeway is to let him go. He broke on me again and he had strength that I've never felt before and I knew if I let him go it was either me or him. That's when I grabbed him with the death grip and didn't let him go for at least thirty to a half a minute or even a minute. When he had no more movement in his body, I let him go. I could see then that I did something that I didn't want to do because his tongue was puffed sticking out the side of his mouth. I don't know if he was dead at that time. Maybe I could have saved his life if I would have called the police right away and an ambulance, but I didn't do that. I was scared to death and, um, I searched him for a weapon.\n\nI did it by myself; didn't mean to do it; didn't know what was gonna happen afterwards. I was scared to death; never killed nobody in my life.\n\nBeside confessing to the method and circumstances of the killing, Perry admitted several other things. He described\n\ntaking money and drugs from the lifeless Redd. He also told of carrying Redd to the basement, wrapping him in a blanket, and tying an electrical cord around his neck, thereby allowing him to drag the body across the basement floor without touching it further. He also admitted taking Redd's sheepskin jacket and selling it to one of Redd's friends. That admission corroborated information police would later receive from Sir Walter Alexander Pitt, III, who had witnessed a transaction involving the sheepskin coat on Friday, February 28, 1986.\n\nOn August 20, 1986, the Camden County Grand Jury returned an eight-count indictment charging Perry with first-degree murder, contrary to N.J.S.A. 2C:11-3a(2) (count one); felony murder, contrary to N.J.S.A. 2C:11-3a(3) (count two); first-degree robbery, contrary to N.J.S.A. 2C:15-1 (count three); four counts of third-degree hindering his own apprehension, contrary to N.J.S.A. 2C:29-3b, alleging that defendant had concealed, moved, and disguised the victim's body (count four), and had nailed shut the door to the basement where the body was found and further had barricaded it with a refrigerator (count five); volunteering false information to police (count six); concealing the victim's identity and manner of death from Miller, a material witness (count seven); and possession of heroin, contrary to N.J.S.A. 24:21-20(a)(1) (count eight). After Perry had pled not guilty, the State filed notice of its intent to seek the death penalty because of the alleged presence of two aggravating factors, N.J.S.A. 2C:11-3c(4)(c) (murder involving torture/aggravated assault, or murder evidencing a depraved mind), and N.J.S.A. 2C:11-3c(4)(g) (murder committed in the course of a felony).\n\nE. The Trial\n\n1. The Guilt Phase\n\nJury voir dire lasted roughly six court days. Under a \"struck jury\" approach the trial court and counsel questioned five jury panels. Approximately fifty-four jurors were \"death-qualified.\"\n\nThe process included the jurors' responses to a written questionnaire and to questions from the court. The questionnaire explored basic biographical information, inquired whether the jurors had any acquaintance with the defendant or counsel, and investigated the jurors' past contacts with, and relationship to, the criminal justice system. Questions from the bench probed more deeply into issues raised by responses to the written questions and then examined the jurors' views on the death penalty. That process, coupled with peremptory challenges, produced sixteen jurors for the guilt phase.\n\nAt the conclusion of the jury voir dire Perry entered a plea of guilty to count eight, possessing heroin.\n\nAt trial, the State basically related the facts described above. Additionally, the prosecution played a thirty-six-minute audio tape of Perry's statement, the most salient parts of which are quoted above. Milbury, Beverly, and Dr. Singh all testified to the facts set forth above. During the guilt phase, the State advanced the theory that defendant, fed up with being harassed by Redd and his associates, decided to kill Redd in order to steal his drugs and money. The State produced as a witness John Leroy Harris, who had shared a cell in the Camden County Jail with Perry in April 1986. Harris testified that Perry had confessed the killing to him, had told him that \"they\" had taken the body to the cellar and put it behind some boards, that the \"white guy\" had shaved the eyebrows and put make-up on the body to make the victim look homosexual (so that it appeared someone else had killed him), and that Perry had strangled the victim with his hands. Finally, the State introduced various pieces of physical evidence, including drug paraphernalia, clothing and blankets from the basement, and the extension cord.\n\nThe defense case centered around the uncertainty of the date of death and the State's alleged failure to corroborate Perry's confession. The defense sought to establish that Redd had died on March 2nd, not three days earlier as Perry's confession indicated. Hence, the State had not proved its case that defendant was present or participated in any way in the death of\n\nRedd. To discredit the State's theory the defense called James Doyle from the Medical Examiner's office. Based on his report of the incident, Doyle testified that he had observed rigor mortis in the jaw, arms, and legs of the victim, livor mortis in the back, and that when he had felt the body, it was cold. Lieutenant Long of the Camden Police testified that no missing-persons report had been filed on Jerome Redd between February 25 and March 4, 1986. Defense counsel also recalled Milbury to the stand to establish that several items referred to in Perry's statement, including a Kangol hat and large cardboard box, had never been confirmed to have been at 762 Division Street.\n\nOn count one the trial court charged the jury on knowing murder, aggravated manslaughter, and reckless manslaughter. The court next charged the jury on felony murder (during the robbery of Redd), first-degree robbery, and the hindering-apprehension counts. After deliberating for an hour and a half, the jury sought re-instruction on felony murder and first-degree robbery, after which it resumed deliberations and found Perry guilty of knowing murder, felony murder, and three counts of hindering apprehension (counts one, two, four, five and six). However, it acquitted defendant of robbery (count three) and one count of hindering apprehension (count seven). The State, defense, and the court all noted the inconsistency in the conviction for felony murder and the acquittal of the underlying felony of robbery. In a highly unusual procedure, the trial court, over defendant's objection, questioned the jury foreman directly concerning the basis of the robbery verdict. Thereafter the trial court decided to mold the verdict to \"not guilty of felony murder\" because the jury had acquitted defendant of robbery, the underlying felony. The trial court, however, never informed the jury of that change in its verdict.\n\n2. The Penalty Phase\n\nThe State had originally served notice of two aggravating factors, N.J.S.A. 2C:11-3c(4)(c) and (g). However, the acquittal\n\nof felony murder resulted in the dismissal of aggravating factor. Therefore, the State relied exclusively on c(4)(c), the torture/aggravated assault/depravity factor.\n\nThe State offered no new evidence at the penalty phase, limiting its presentation to an opening and a closing statement by the prosecutor. In those statements, the prosecutor adopted what came to be known as the \"strangled twice\" theory. In an effort to establish \"aggravated assault\" and to show that the crime was not one of self-defense or quick death, the prosecutor described the murder as one in which Perry had choked Redd to the point of unconsciousness, and then let him revive. According to the prosecutor, after Redd had revived, defendant then reapplied the choke-hold and killed him. That theory was based more on the medical examiner's answer to a hypothetical question than it was on any of Perry's statements about the encounter.\n\nDespite the fact that the State's main guilt-phase argument was that the murder had occurred during the course of a robbery, the prosecutor, in an attempt to establish the \"depravity of mind\" element of c(4)(c), alleged inconsistently that the murder was purposeless. \"The defendant just felt like killing [the victim] because, as you know, Jerome was unconscious for a while after the first strangulation. There's no need for him to die.\"\n\nDefendant alleged five mitigating factors: N.J.S.A. 2C:11-3c(5)(a) (extreme mental or emotional disturbance), c(5)(b) (the victim \"solicited, participated in, or consented to the conduct resulting in death\"), c(5)(d) (impairment due to mental disease, defect or intoxication), c(5)(e) (\"unusual or substantial duress\"), and c(5)(h) (the \"catch-all\" factor). The defense called only one witness, Delihah Redd, the victim's mother, who spoke out against capital punishment. In closing, defense counsel linked all of those mitigating factors into an argument that during a dispute between Redd and Perry, Perry's withdrawal from drugs had caused him to over-react during the confrontation.\n\nThe trial court then charged the jury, explaining the general differences between aggravating factors and mitigating factors. It differentiated the two according to the burden each party carried to show a particular factor and to how the jury should determine its existence or non-existence.\n\nThe jury unanimously found aggravating factor c(4)(c) and found no mitigating factors. The court sentenced defendant to death.\n\n3. Post-Trial Proceedings\n\nDefendant moved to set aside the penalty-phase verdict, or, in the alternative, for a new trial. The motion had been foreshadowed by counsel's eleventh-hour request to forego the penalty phase. That request had come after the jury had been charged in the penalty phase but before deliberations had actually begun. The trial court both then and at the post-trial hearing rejected Perry's argument that a jury could not rationally find factor c(4)(c) to exist.\n\nThe trial court sentenced defendant on his non-capital convictions as follows: after merging the three hindering-apprehension charges, to a five-year term, consecutive to any other sentence, and for possession of heroin to a consecutive five-year term.\n\nII\n\nGuilt Phase\n\nDefendant makes four principal challenges to the guilt phase. First, he asserts that he was denied effective assistance of counsel in violation of the sixth amendment of the federal Constitution and article 1, paragraph 10 of the state Constitution. Second, he asserts for the first time on appeal that incomplete and improper jury voir dire denied him his right to a fair trial by an impartial jury in violation of both federal and state constitutions. Third, he asserts that the court erred in failing to charge the jury sua sponte on passion/provocation\n\nmanslaughter and self-defense, thereby depriving him of due process of law. Finally, he argues pursuant to State v. Gerald, 113 N.J. 40 (1988), that the trial court's failure in its jury charge to distinguish for capital-sentencing purposes between intent to kill and intent to cause serious bodily injury deprived him of due process of law and subjected him to cruel and unusual punishment. We find no prejudice to defendant as a result of any of these alleged errors. Accordingly, we affirm Perry's conviction for the knowing murder of Redd.\n\nA. Alleged Ineffective Assistance of Counsel\n\nFirst, Perry claims denial of his constitutional right to counsel under the sixth amendment. Specifically, he contends with respect to the guilt-phase that his counsel were ineffective because (1) they failed to move to suppress evidence based on fourth- and fifth-amendment violations, and (2) they failed to investigate and present alternative defenses. We find his contentions meritless.\n\nThe United States Supreme Court set the test for identifying ineffective assistance of counsel, see Strickland v. Washington, 466 U.S. 668, 80 L. Ed. 2d 674 (1984), which we adopted in State v. Fritz, 105 N.J. 42 (1987). More recently, we affirmed our adherence to the Strickland/Fritz standard in State v. Savage, 120 N.J. 594, 614-15 (1990), and State v. Davis, 116 N.J. 341 (1989), where we declared the Strickland/Fritz standard applicable also to capital-murder cases. Under that test, the benchmark for determining attorney incompetency is \"whether counsel's conduct so undermined the proper functioning of the adversarial process that the trial cannot be relied on as having produced a just result.\" Strickland v. Washington, supra, 466 U.S. at 686, 80 L. Ed. 2d at 692-93.\n\n1. Defendant's Arrest Was Legal\n\nDefendant asserts that law-enforcement officers Milbury and Beverly illegally entered 1189 Landsdowne Avenue on March 4,\n\n1986. Defendant argues that, because the entry was illegal, so was his warrantless arrest for narcotics possession. As the fruits of that illegal arrest, drugs and paraphernalia should have been suppressed, as should have the taped confession, because there were no intervening circumstances that purged the taint. The State contends that the arrest was legal because the illicit materials, the drugs and paraphernalia, were in plain view.\n\nThe police may seize evidence found \"in plain view\" despite the lack of a warrant. State v. Hill, 115 N.J. 169, 173 (1989). The applicability of the plain-view doctrine depends on the right of the officer to be in the position to have that view and to seize that evidence. Harris v. United States, 390 U.S. 234, 236, 19 L. Ed. 2d 1067, 1069 (1968). Detective Beverly and Inspector Milbury had that right.\n\nThe officers' right to be in a position to have a plain view arose out of the purpose of their entrance into the house. \"Legitimate precaution justifies routine police procedures not designed as pretexts to discover evidence.\" State v. Esteves, 93 N.J. 498, 506 (1983) (citing Cady v. Dombrowski, 410 U.S. 432, 447-48, 37 L. Ed. 2d 706, 718 (1973)). Here, the officers had no underlying design to find drugs linked to Perry or to make a drug arrest of Perry. Indeed, they hoped to deter Perry from taking drugs completely to protect the polygraph process from pollution. Moreover, they were involved in legitimate procedures to locate an important source of information. In attempting to locate Perry, they followed a routine procedure of checking places that they knew he frequented. After checking unsuccessfully two known drug-dealing locations, the police proceeded to a vacant building defendant often frequented. Finding the door unlocked and ajar, they entered. Their entry into 1189 Landsdowne Street was legitimate and rightfully reflected the objectively-reasonable actions of well-trained police officer.\n\nDefendant's claim that Payton v. New York, 445 U.S. 573, 63 L. Ed. 2d 639 (1980), compels a different conclusion lacks merit. Unlike the officers here, those in Payton entered \"in order to make an arrest.\" Id. at 576, 63 L. Ed. 2d at 644. The officers here entered to find Arthur Perry so that they could perform a polygraph test. In Payton, police pried open a door to search for a felon and for evidence of a felony. Here, the officers walked through the open front door of an apparently-vacant building, with no suspicion that a crime had been or would be committed. But for the fact that defendant himself volunteered that he possessed drugs and intended to use them, the officers would have asked him merely to come with them for the polygraph test. However, once he volunteered that information freely, handed them a syringe and a drug spoon, and the officers saw the drugs in plain view atop a bureau after their legal entry on another matter, they had no duty to retreat to a neutral magistrate for an arrest or search warrant. See Texas v. Brown, 460 U.S. 730, 75 L. Ed. 2d 502 (1983); State v. Ercolano, 79 N.J. 25, 34-35 (1979); State v. Contunsi, 44 N.J. 422 (1965).\n\nMoreover, defendant cannot claim any disappointment of his expectation of privacy. Although we recognize that \"the Fourth Amendment has drawn a firm line at the entrance to the house\" preventing a warrantless entrance to search or arrest absent exigent circumstances, Payton, supra, 445 U.S. at , 63 L. Ed. 2d at 653, it has not erected a barrier to officers entering for other legitimate purposes. Because the heart of the \"plain view\" doctrine is the unrelated, legitimate purpose that occasions one's presence near the contraband, seizures subsequent to lawful entry fit within the \"plain view\" doctrine and are not prohibited by Payton. State v. Moller, 196 N.J. Super. 511, 515 (App. Div. 1984) (observation of evidence in plain view does not constitute a search).\n\nIn addition to the foregoing, other reasoning demonstrates that Perry's expectation of privacy was not impinged. He was\n\nin a house, not his own, that appeared vacant and whose front door was not only unlocked but open. The open door, uncertain ownership, and vacant nature of the edifice create a situation far from unambiguous and make it difficult to give its transient user a constitutionally-reasonable expectation of privacy. Moreover, the evidence shows that defendant's own subjective expectations were not thwarted by the officers' entrance. Katz v. United States, 389 U.S. 347, 361, 19 L. Ed. 2d 576, 588 (1967) (Harlan, J. concurring) (the resolution of fourth-amendment issues turns on whether the individual exhibited an actual, subjective expectation of privacy). He \"expected\" their arrival, wished to continue cooperating with them in the murder investigation, and did not object to them ascending the stairs once they entered and he saw them.\n\nBecause we find that counsel could reasonably have concluded that any effort to suppress the drug evidence would be unsuccessful, arguments growing out of the \"fruit of the poisonous tree\" doctrine for suppressing his post-arrest statement also lack vitality. Perry, although technically under arrest for events occurring at 1189 Landsdowne, voluntarily made statements and kept a scheduled interview unrelated to his drug arrest. New York v. Harris, U.S. , 109 L. Ed. 2d 13, 21-22 (1990) (the Supreme Court held that violation of fourth-amendment prohibition of warrantless and non-consensual entry into a suspect's home in order to make a routine felony arrest did not affect the admissibility of statements made by defendant after he had been taken from his home to the police station). Here, the separately-scheduled interview was \"sufficiently independent to dissipate the taint of [any alleged] illegal conduct.\" State v. Johnson, 118 N.J. 639, 653 (1990).\n\n2. Defendant's Taped Confession was Voluntary and Properly Admitted into Evidence\n\nAdditionally, defendant contends that his confession should also have been suppressed because it was obtained in\n\nviolation of his rights under the fifth amendment. Edwards v. Arizona, 451 U.S. 477, 68 L. Ed. 2d 378, reh'g denied, 452 U.S. 973, 69 L. Ed. 2d 984 (1981), prevents police-initiated custodial questioning of a suspect once that person has expressed a desire to deal with police only through counsel. Defendant's assertion that Edwards provided grounds for the suppression of all his statements is meritless. Hence, counsel's decision not to move to suppress cannot constitute ineffective assistance of counsel.\n\nThe initial conversations between defendant and police were neither custodial nor police-initiated. On both March 2nd and 3rd, Perry spoke with police but was free to leave at any time. He did in fact leave each day before completing the planned interviews. He was also repeatedly told he need not cooperate, yet freely returned to do so. One could not conclude that he was deprived of \"his freedom of action in any significant way,\" Miranda v. Arizona, 384 U.S. 436, 444, 16 L. Ed. 2d 694, 706 (1966), or that he was subject to formal arrest or the restraint of freedom of movement normally associated with formal arrest. California v. Beheler, 463 U.S. 1121, 77 L. Ed. 2d 1275 (1983). Neither the timing, atmosphere, police conduct, or defendant's response to that conduct at that time resembled the conduct criticized in the Supreme Court's latest application of the Edwards rule. Minnick v. Mississippi, U.S. , 112 L. Ed. 2d 489 (1990) (where a defendant subject to custodial interrogation repeatedly made unequivocal requests to proceed only through counsel and was told that he could not refuse to talk to federal and state interrogators, his statements should be suppressed for violation of his fifth-amendment rights as protected by Edwards).\n\nNor was his questioning on March 4 the police-initiated. Despite the fact that Perry's March 4th statements were doubtless made in a custodial context (due to his arrest on drug charges), they are still admissible. He \"'evinced a willingness\n\nand a desire for a generalized discussion about the investigation.'\" State v. Fuller, 118 N.J. 75, 82 (1990) (quoting Oregon v. Bradshaw, 462 U.S. 1039, 77 L. Ed. 2d 405 (1983)). He repeatedly expressed both his desire to assist with the murder investigation and his understanding that he did not have to cooperate. He never stated that he wished to deal only through counsel; in fact, he explicitly stated on March 3rd that he would proceed without counsel. See Michigan v. Mosley, 423 U.S. 96, 101 n.7, 46 L. Ed. 2d 313, 320 n.7 (1975) (stating that suspect's decision to cut off questioning, unlike a request for counsel, does not raise presumption that the suspect is unable to proceed without lawyer's advice). Defendant returned to the police on the successive days expressing his desire to take the polygraph to clear himself of the murder and waived his rights before doing so on each day including March 4th. As he initiated the conversation himself, he does not fit within the Edwards rule.\n\nNor does the record show that defendant's waiver of his right to counsel was involuntary or unintelligent. The prosecution has shown that Perry's waiver of the right to counsel and to remain silent was made \"voluntarily, knowingly, and intelligently.\" See State v. Bey III, 112 N.J. 123, 134 (1988) (Bey II). He repeatedly expressed his eagerness to take the test to prove himself innocent. He repeated his desire to proceed without an attorney. The State met its burden under State v. Wright, 97 N.J. 113, 123 (1984), and Bey II, supra, 112 N.J. at 134, by showing that his March 4th confession was not tainted by any drug use that day, by any prolonged questioning or abuse, or by any confusion over his right to remain silent.\n\nLikewise, the State did not violate any of the rules springing from Edwards. It cannot be said that Perry requested or chose to proceed only through counsel. In fact, he admits that he was very well treated and voluntarily spoke with police. This differs radically from Minnick, who claimed both mistreatment and persistent pressure. These facts assure \"that the\n\ncoercive pressures of custody were not the inducing cause\" of his confession.\" Minnick, supra, 112 L. Ed. 2d at 499. Counsel's refusal to contest the admissibility of a statement under such conditions was neither unreasonable nor prejudicial.\n\nUnder the Strickland/Fritz standards, defendant's right to counsel was not violated by his attorney's failure to move to suppress evidence under the fourth and fifth amendments.\n\nWhere defense counsel's failure to litigate a Fourth [or Fifth] Amendment claim competently is the principal allegation of ineffectiveness, the defendant must also prove that his Fourth [or Fifth] Amendment claim is meritorious and that there is a reasonable probability that the verdict would have been different absent the excludable evidence in order to demonstrate actual prejudice.\n\n[Kimmelman v. Morrison, 477 U.S. 365, 375, 91 L. Ed. 2d 305, 319 (1986)].\n\nSince Perry cannot establish that his fourth or fifth amendment claim is meritorious, he has not cleared the first hurdle in establishing that he received ineffective assistance of counsel.\n\n3. Guilt-Phase Strategy\n\nDefendant claims that counsels' reliance on \"insubstantial defenses\" in lieu of other stronger theories and their failure to investigate and present other relevant exculpatory evidence also constituted ineffective assistance of counsel in the guilt phase. We disagree. We will not second-guess counsel's reasonable adoption of one of the \"countless ways to provide effective assistance in any given case.\" Strickland v. Washington, supra, 466 U.S. at 689, 80 L. Ed. 2d at 695. In a case like this one, in which the State's case rests nearly exclusively on a confession given by the defendant, counsel's decision to pursue a line of defense (reasonable doubt) that undercuts that confession's scientific and circumstantial reliability is not an unreasonable one. State v. Hightower, 120 N.J. 378, 412 (1990). Counsel believed that only by attacking the confession could defendant prevail. Eschewing equally-problematic alternatives such as self-defense, passion/provocation\n\nmanslaughter, an intoxication defense, or implicating Clark Miller is not constitutionally-deficient representation.\n\nDefendant's contention that counsel could not reasonably have rejected such alternatives because he did not adequately investigate the potential of each lacks persuasiveness. Although limited, his investigation here fell no-where near the depths of deficiency found in State v. Savage, supra, 120 N.J. at 618-622.\n\nStrategic choices made after thorough investigation of law and facts relevant to plausible options are virtually unchallengeable, and strategic choices made after less than complete investigation are reasonable precisely to the extent that reasonable professional judgments support the limitations on investigation. In other words, counsel has a duty to make reasonable investigation or to make a reasonable decision that makes particular investigations unnecessary. In any ineffectiveness case, a particular decision not to investigate must be directly assessed for reasonableness in all the circumstances, applying a heavy measure of deference to counsel's judgments. [Strickland v. Washington, supra, 466 U.S. at 690-91, 80 L. Ed. 2d at 695.] Defendant has not shown counsel to have fallen below that mark of adequate acumen. Therefore, he has failed to satisfy the objective-unreasonableness prong of the Strickland test.\n\nLikewise, we reject defendant's claim that the cumulative effect of counsels' failures constituted a constitutional deprivation of effective assistance of counsel at the guilt phase even if no single instance itself does. Regardless of the choices that could have been made by trial counsel, those choices involved trial strategy in \"a difficult case, [in which] defense counsel attempted to highlight what few weaknesses there were in the State's case.\" State v. Hightower, supra, 120 N.J. at 412. We will not base a decision that counsel was ineffective on such subjective standards.\n\nB. Jury Voir Dire\n\n1. General Voir Dire\n\nDefendant alleges for the first time on appeal that inadequate voir dire denied him his right to a fair trial by an\n\nimpartial jury in violation of the federal and state constitutions. Specifically, defendant claims that the trial court's voir dire failed to elicit sufficient information concerning the jurors' attitudes toward the death penalty and toward racial prejudice to enable counsel intelligently or effectively to exercise his right to challenge. Our independent review of the entire voir dire process leads us to conclude that the voir dire questioning was adequate.\n\nVoir dire attempts to assure an impartial jury, a critical and indispensable component of a fair trial. See, e.g., State v. Williams, 113 N.J. 393, 409 (1988) (Williams II). The test for determining juror ineligibility to serve in capital cases is whether the prospective juror's opinions, be they for or against the death penalty, would \"'prevent or substantially impair the performance of his duties in accordance with his instructions and his oath.'\" State v. Bey, supra, 112 N.J. at 151 (citations omitted); see also State v. Ramseur, 106 N.J. 123, 255 (1987) (quoting Adams v. Texas, 448 U.S. 38, 45, 65 L. Ed. 2d 581, 589 (1980)). The examination of each juror's views on capital punishment must be sufficiently probing to assure compliance with the governing legal standards, and open-ended questions requiring the juror to articulate those views in his or her own words are preferable. State v. Hunt, 115 N.J. 330, 354 (1989); Williams II, supra, 113 N.J. at 413.\n\nThe questions and instructions used by the trial court to select death-qualified jurors showed \"a balanced discussion about the differing views that jurors might have about the death penalty, the only qualification being that they could follow the court's instructions.\" State v. Long, 119 N.J. 439, 480 (1990);see also State v. Biegenwald, 106 N.J. 13, 29 (1987) (\"an independent review of the record reveals that the overall scope and quality of the voir dire was sufficiently thorough and probing to assure the selection\n\nof an impartial jury.\"). In addition to basic biographical information requested by the questionnaire, each juror was asked specific questions aimed at exposing the impact of a defendant's or witness's drug use or homosexuality on the juror's assessment of that person. Moreover, while the voir dire was conducted by the trial court, the court readily accommodated any request by defense counsel for additional voir dire.\n\nDefendant, relying on Williams II, supra, 113 N.J. 393, decided after this trial, argues that the court's introductory remarks explaining that jurors would be disqualified only if personally-held beliefs prevented them from following the law were in error. In Williams II, the Court expressed \"serious reservations\" about such an instruction because it \"tells a juror what answers during the death qualification process lead to automatic excusal and what responses avoid excusal.\" Id. at 412. Defendant argues that the two excluded death-scrupled jurors, Thomas Seavey and Kevin Mauro, purposely disqualified themselves, noting that both indicated an inability to sit for the extended period the court estimated the case would take.\n\nThe trial court obviously was not aware of this Court's disapproval of the instruction, but it is apparent that it did not operate negatively in defendant's case. The trial court's instructions contained \"a balanced discussion about the differing views that jurors might have about the death penalty, the only qualification being that they could follow the court's instructions.\" State v. Long, supra, 119 N.J. at 480 (rejecting similar claim). Moreover, many jurors who were qualified expressed similar difficulties with participation in a long trial. Most importantly, a review of the voir dire of jurors Seavey and Mauro plainly shows that each tried to answer the trial court's inquiries honestly. Nothing indicates an intent to get excused from jury duty. There is no indication that the preliminary instruction was harmful.\n\nAlthough further inquiry into the views of a particular juror might have further assisted counsel in the evaluation of that juror, the trial court complied with our instruction in State v. Hunt, supra, 115 N.J. at 354, and Williams II, supra, 113 N.J. at 413, by assuring each juror's compliance with the governing legal standards and by using open-ended questions requiring the juror to articulate his or her views in his or her own words. There was nothing perfunctory about the process; rather, the trial court's mixture of open-ended initial questioning and more-particularized follow-up questioning nicely meshed the duty to probe sufficiently with allowing a juror to use his or her own words. Nothing in that process resulted in prejudice to the defendant or the impaneling of a jury that could not perform its duty in accordance with its instruction or oath. See Bey II, supra, 112 N.J. at 151-52; State v. Ramseur, supra, 106 N.J. at 255.\n\n2. Racial-Prejudice Inquiry\n\nPerry claims that voir dire was impermissibly abbreviated by the absence of inquiry into potential racial prejudice. Although the questionnaire did not contain a question specifically directed at the impact of the race of the witness or defendant, it did contain a question investigating the potential presence of \"any passion, prejudice, sympathy or bias.\" At least one juror found that question to include an inquiry into a juror's potential racial prejudice.\n\nRecently, in State v. McDougald, 120 N.J. 523, 550-54 (1990), we addressed the issue of voir dire on racial prejudice. Sua sponte inquiry into the racial views of potential jurors is not required under either the federal or state constitution in minority-defendant capital cases that carry no special circumstances involving racial overtones. Turner v. Murray, 476 U.S. 28, 90 L. Ed. 2d 27 (1986); McDougald, supra, 120 N.J. at 553-54. Absent a\n\nrequest from counsel for such a question and in the presence of a question about general prejudice or bias, the trial court's failure to ask such a non-required question cannot be considered error. Both State v. Ramseur and Williams II call for more expansive voir dire to combat subtle and difficult-to-discern racial prejudice in cases in which the defendant is black. See, e.g., State v. Ramseur, supra, 106 N.J. at 247. However, absent other factors putting a court on notice of the racial overtones of a case, specific inquiry into racial prejudice need be conducted only at the request of the minority defendant. Ibid.\n\nThe circumstances of this crime do not indicate the presence of circumstances raising explicit racial concerns. As in McDougald both the victim and defendant were black. Therefore, while still recognizing the subtle way in which racial prejudice can impact on any proceeding involving a black defendant, State v. Ramseur, supra, 106 N.J. at 247, we believe the court's inquiry here bears substantial similarity to the means employed in State v. McDougald, supra, 120 N.J. at 553-54, and therefore did not constitute error.\n\nC. Failure to Charge Self-Defense and Passion/Provocation Sua Sponte\n\nPerry contends that plain error occurred because of incomplete jury instructions prior to the guilt-phase deliberations. On the murder count the trial court charged the jury on knowing murder, aggravated manslaughter, and reckless manslaughter. Defendant argues for the first time on appeal that the trial court's failure to charge sua sponte passion/provocation manslaughter and self-defense violated his right to due process. We disagree.\n\nFrom the evidence, principally the statement of Arthur Perry, we cannot say plain error occurred when the court failed to charge the jury on passion/provocation manslaughter and self-defense. The facts of this case did not \"'clearly indicate' the\n\nappropriateness of those charges.\" State v. Choice, 98 N.J. 295, 298 (1985) (quoting State v. Powell, 84 N.J. 305, 318 (1980)). Because Perry's statement bears no indication that the defendant was reasonably provoked or subjectively impassioned, and offered only weak potential support for self-defense, the court did not err in failing to charge those sua sponte.\n\n1. Passion/Provocation\n\nMurder is reduced to manslaughter if \"committed in the heat of passion resulting from a reasonable provocation.\" N.J.S.A. 2C:11-4(b)(2). Unlike aggravated assault or reckless manslaughter, which involve mental states different from knowing murder, passion/provocation involves mitigation of intentional murder because of the existence of objectively-reasonable provocation. State v. Grunow, 102 N.J. 133 (1986).\n\nPassion/provocation manslaughter has four elements: the provocation must be adequate; the defendant must not have had time to cool off between the provocation and the slaying; the provocation must have actually impassioned the defendant; and the defendant must not have actually cooled off before the slaying. LaFave \u0026 Scott, [Substantive Criminal Law]  7.10 at 255. The first two criteria are objective, the other two subjective. If a slaying does not include all of those elements, the offense of passion/provocation manslaughter cannot be demonstrated.\n\n[State v. Mauricio, 117 N.J. 402, 411 (1990)].\n\nPerry's statement could not support a finding that each of the four elements of passion/provocation manslaughter existed.\n\nAlthough we acknowledge and embrace the \"trend away from the usual practice of placing the various types of provocatory conduct into pigeon-holes,\" State v. Mauricio, supra, 117 N.J. at 414 (quoting LaFave \u0026 Scott, Substantive Criminal Law  7.10 at 256), we nonetheless fail to see a clear basis in the record that would indicate that a reasonable person could have been provoked to murder under these circumstances. The victim, visibly agitated perhaps, spoke harshly to Perry. As he \"walked\" toward defendant, he \"pointed\" at him. The victim's exposed hands, pointing at Perry, held no weapon.\n\nHowever disturbing or irritating Redd's interruption of Perry's drug use was under those circumstances, it could not reasonably have provoked passion.\n\nPerry's statement, which details what occurred in his encounter with Redd, provided no basis for a passion/provocation manslaughter charge. In that statement, he recognizes relevant emotions, e.g., \"pump enough fear into [Redd] to make him shut up and wait,\" Redd's \"little rage,\" and his self-description as \"scared\" and \"panicked\" after Redd's death. Yet, nowhere does he describe any rage of his own nor would his careful application of a take-down and throttle lead to a conclusion that he lost control of his emotions and reason. State v. Crisantos (Arriagas), 102 N.J. 265, 278-80 (1986) (absence of any evidence in the record of \"passion\" or extreme emotional disturbance coupled with very slight evidence of provocation consisting of verbal abuse and an attempt to strike the defendant warranted denial of passion/provocation jury charge). In State v. Pitts, 116 N.J. 580, 618-19 (1989), the Court noted the correctness of giving a passion/provocation instruction where defendant had given relevant testimony supporting it and counsel had argued it, even though \"the jury had ample basis in the record to reject\" that alternative. The converse is presented here in that no argument or evidence was proferred by defendant. The court had no basis in the record to accept such a charge. Sifted or otherwise, State v. Choice, supra, 98 N.J. at 298, the record here could not support a finding by the jury or a charge by court, that Perry had killed Redd in the heat of passion resulting from a reasonable provocation. See State v. Crisantos (Arriagas), supra, 102 N.J. at 273 (\"a court is not obligated, and indeed should not, instruct a jury to return a verdict that would clearly be unwarranted by the record\").\n\n2. Self-Defense\n\nThe use of force against another in self-defense is justifiable \"when the actor reasonably believes that such force\n\nis immediately necessary for the purpose of protecting himself against the use of unlawful force by such other person on the present occasion.\" N.J.S.A. 2C:3-4(a). Self-defense requires an \"actual, honest, reasonable belief\" by a defendant in the necessity for using force. See State v. Kelly, 97 N.J. 178, 198 (1984).\n\nIn State v. Bowens, 108 N.J. 622 (1987), the Court said:\n\nGenerally, \"in order for a killer to have a perfect self-defense to homicide, he or she must: (1) be free from fault in bringing on the conflict with his or her adversary; and (2) reasonably, though not necessarily correctly, believe (a) that his adversary will, unless forcibly prevented, immediately inflict upon him or her a fatal or serious bodily injury, and (b) that the deadly force must be used upon the adversary to prevent him or her from inflicting such an injury.\" [Id. at 628 (quoting W. LaFave and A. Scott, Handbook on Criminal Law 583 (1972)).]\n\nWhether Perry's statement, the principal evidence on self-defense, \"clearly indicates\" that the victim exhibited any unlawful force toward defendant so as to cause defendant to have any reason to believe that his life was in danger presents a difficult question. See N.J.S.A. 2C:3-4(a). After defendant and the victim had exchanged some heated words, the victim \"walked toward\" defendant with his finger pointed at him. Defendant found no weapon on the victim's body, and although defendant thought that the victim might have a gun, at no time did defendant ever say that he saw, or even thought he saw, the victim pull out a weapon. Defendant never stated that the victim struck him or tried to strike him prior to or during the struggle. Defendant, not the victim, started the fight. Defendant stated that because the room was narrow, he let the victim get \"close enough\" so that \"when he pointed at me,\" he was able to grab him; he threw the victim \"back over\" himself in a method he had learned in the Marine Corps. It was at that point that they \"scuffled for a few.\" The \"scuffle,\" it appears, was the result of the victim trying to break loose from defendant's stranglehold. \"He got limp for a few minutes, then he broke out into a rage as if he was trying to really get loose. I\n\nguess that's when he was losing his life. And I held him for another minute or so and he just collapsed; he died.\" See State v. Crisantos (Arriagas), supra, 102 N.J. at 274-75 (to reduce murder to manslaughter, contest must have been waged on equal terms and no unfair advantage taken of deceased).\n\nThe State further alleges that any belief defendant may have had that he was in immediate danger when the victim partially revived was unreasonable. The medical testimony revealed that the victim would have been \"pretty incapacitated\" and \"disoriented\" at that point. Defendant himself stated that he thought the victim had passed out shortly after initially being grabbed. We find it difficult to conclude that a jury reviewing all the evidence could find that defendant had reasonably believed that he had to strangle the victim to protect himself from unlawful force.\n\nNonetheless, there are other statements in defendant's confession, such as the reason he applied the \"death grip\" (he thought \"it was either him or me,\" and \"he came at me as if he had something\") that might support a self-defense claim. Had defense counsel requested such an instruction or objected to its absence, we might conclude that the trial court should have charged self-defense. See State v. Rose, 112 N.J. 454, 480 (1988) (noting that different levels of review will be used depending on whether the instruction was requested, citing Crisantos (Arriagas), or was not, citing Choice). However, defendant did not request a self-defense charge. Under those circumstances in the face of non-compatible defense strategy, we cannot conclude that the trial court committed plain error in not charging self-defense sua sponte.\n\nTrial courts must carefully refrain from preempting defense counsel's strategic and tactical decisions and possibly prejudicing defendant's chance of acquittal. The public interest, while important, may not overwhelm defendant's interest in pursuing a legitimate defense in the complex setting of a\n\ncriminal trial. Choice, supra, 98 N.J. at 300-01. In Choice, we explained that although tactical decisions to forego such lesser-included-offense charges do not minimize the public's interest in the appropriate charge, a trial court nonetheless should be sensitive to the potential that such charges might prejudice a defendant's case with respect to a greater crime (as, for example, because additional evidence may then become relevant to the State's case), and make defendant's conviction for the greater crime more likely. Weexplained the distinction:\n\nIn the former case [where the court should charge sua sponte] defendant is concerned that by positing the manslaughter option, the court will allow a jury that might have acquitted defendant to choose a manslaughter conviction. In the latter case [where perhaps such a charge should not be given] defendant's concern is not that the introduction might preempt the possibility of acquittal, but that it will -- because of the evidence it will engender -- assure conviction of murder.\n\n[Id. at 301].\n\nThe same problems exist here. Defense counsel's strategy was to highlight the contradictions in defendant's statement and the paucity of corroborating evidence, and to argue to the jury that the State had not proven its case that defendant was present or participated in any way in the death of Jerome Redd. Hence, despite the arguable appropriateness of the self-defense charge, such a charge would have been directly contrary to defendant's position at trial, could have prejudiced his chances of being acquitted of knowing murder by emphasizing his presence at the murder scene, and would have forced counsel to have forsaken or altered his chosen strategy. In a close case, forcing counsel to incorporate defenses that pre-suppose the existence of the very fact his main method of defense contests destroys the credibility and coherence of the defense entirely. Our analysis of the duties of a trial judge must be \"seasoned by a degree of deference to defense counsel's strategic decisions.\" State v. Marshall, 123 N.J. 1, 92 (1991).\n\nIn sum, we re-affirm our position in State v. Choice, supra, 98 N.J. at 300, that a trial court must be sensitive to the potential that charging lesser-included offenses could\n\nprejudice a defense to the more serious charges. Despite the public interest in offering such charges when appropriate, the trial court's failure to include a self-defense charge was not plain error, but rather fit into that \"latter case [where] defendant's concern is not that the introduction might pre-empt the possibility of acquittal, but that it will -- because of the guidance it will engender -- assure conviction of murder.\" Id.\n\nD. Issues Raised by State v. Gerald\n\nBecause we conclude that defendant may not be subject to the death penalty because there was insufficient evidence to submit aggravating factor c(4)(c) to the jury, we need not decide whether it was harmless error for the trial court to have failed to instruct the jury that it must find that defendant knowingly or purposely caused death and not that he intended to cause serious bodily harm resulting in death. See State v. Hunt, supra, 115 N.J. at 340 (citing State v. Gerald, 113 N.J. 40, 69 (1987)).\n\nE. Incidental Guilt-Phase Issues\n\nDefendant's other claims of error regarding the guilt phase merit little discussion.\n\n1. Sequential Deliberation on Homicide Offenses\n\nDefendant objects for the first time on appeal to the trial court instructing the jury to consider the various charges in a sequential manner. The trial court, when it charged the jury on knowing murder, aggravated manslaughter, and reckless manslaughter, instructed it to begin by deliberating on the first charge, knowing murder, and to move on to subsequent charges only if the jury acquitted defendant of murder. We reject defendant's contention because \"there is nothing inherently wrong with a sequential charge.\" State v. Coyle, 119 N.J. 194, 223 (1990);see also State v. Zola, 112 N.J. 384, 405-06 (1988) (same).\n\nIn Coyle, we rejected the use of a strictly sequential charge where passion/provocation manslaughter provided a viable alternative for the jury. In such a case, the sequential charge has \"the potential to foreclose whether passion/provocation should reduce an otherwise purposeful killing from murder to manslaughter.\" State v. Coyle, supra, 119 N.J. at 222. However, here, where no evidence supporting passion/provocation exists, and where passion/provocation was not argued, the concerns present in Coyle disappear.\n\nWe reaffirm the position that\n\nabsent evidence of passion/provocation, sequential charges usually provide a framework for orderly deliberations. State v. Zola, supra, 112 N.J. at 405, 548 A.2d 1022.\n\n[State v. Coyle, supra, 119 N.J. at 223].\n\nAccordingly, we find that the trial court did not commit plain error by instructing the jury to consider the charges in a sequential order.\n\n2. Motion to Dismiss Robbery and Felony Murder\n\nPerry was acquitted of robbery, yet convicted of felony murder. Noting the inconsistency of those verdicts, the trial court molded the verdict on each count to \"not guilty.\" Therefore, it is apparent that no direct harm to defendant occurred as a result of the trial court's failure to dismiss the robbery and felony murder charges.\n\nHowever, there remains the question of whether indirect harm occurred as a result of the failure to dismiss those charges. That indirect harm revolves around the elusive idea of \"taint\" and whether the jurors' obvious confusion (as to what they must find to support a felony murder conviction) spilled over into their consideration of the charge of knowing murder. We conclude that neither the jury's deliberations nor the verdict of knowing murder was tainted by the misunderstanding of the trial court's instructions on those two charges.\n\nThe conceded correctness of the court's definition of knowing murder (apart from the already-disposed-of Gerald issue) coupled with the court's instruction to deliberate sequentially suggests\n\nthat the jury reached its conclusion regarding knowing murder before any possible taint. That conclusion rests on bi-polar support. The first strut is our necessary presumption that juries follow the instructions that they are given. State v. Manley, 54 N.J. 259, 270 (1969).\n\nThe process of death qualification, the juror's oath, and the trial court's instructions are all designed to assure that the jury will make a conscientious attempt to follow the law in reaching its verdict. The entire system of capital punishment depends on the belief that the jury exercising the conscience of the community will responsibly exercise its guided discretion in deciding who shall live and who shall die. [State v. Ramseur, supra, 106 N.J. at 310 (emphasis added).]\n\nThe second is the belief that where appropriate, sequential charges \"assure that a jury renders 'a just verdict by applying the facts to the law as it is charged.'\" State v. Coyle, supra, 119 N.J. at 223 (quoting People v. Boettcher, 69 N.Y.2d 174, 183, 513 N.Y.S.2d 83, 87, 505 N.E.2d 594, 597 (1987)). Together, they support the conclusion that no taint stained the jury's decision on knowing murder, because the verdict on knowing murder would have preceded any decision based on a misunderstanding of theinstructions on felony murder or robbery. Even if the jury decided the robbery issue first, its \"not guilty\" on that count would not have prejudiced its consideration of the other charges against defendant.\n\n3. Prosecutorial Misconduct\n\nFinally, defendant raises numerous issues with regard to the prosecutorial practices and procedures used to indict, try, convict, and sentence him. All of those claims fit under the general rubric of prosecutorial misconduct. As he earlier asserted with regard to his counsel's performance, defendant alleges that the prosecutor's behavior was constitutionally unacceptable in the specific instances and in the entirety. We do not agree.\n\nPerry claims five instances of prosecutorial misconduct, all of which can essentially be classified as a claim that the prosecutor\n\nabused his discretion in determining whom to prosecute and whom not to prosecute. To elaborate, he claims that\n\n(1) the State abused its discretion in failing to properly investigate Miller's complicity and prosecuting him;\n\n(2) defendant was selectively prosecuted;\n\n(3) the State purposely misled the Grand Jury by failing to disclose the extent of Miller's involvement and otherwise compromised their function;\n\n(4) A Brady violation occurred because the State failed to turn over to the defense the crucial portion of the report on Miller's polygraph wherein he makes inculpatory admissions;\n\n(5) the State's entire case was grounded on the \"fundamental misrepresentation\" that defendant alone committed these crimes.\n\nAll of those claims are essentially a contention that Perry was prosecuted and Miller was not, and that no reason exists for that distinction.\n\nProsecutors have very broad discretion in determining whom to prosecute and whom not to prosecute, but also have an obligation to exercise that discretion in good faith. State v. McCrary, 97 N.J. 132, 142 (1984); State v. Hermann, 80 N.J. 122, 127 (1979); State v. Laws, 51 N.J. 494, 510, cert. denied, 393 U.S. 971, 21 L. Ed. 2d 384 (1968); State v. Winne, 12 N.J. 152, 171 (1953). \"The effect of this broad grant of power has been to accord a presumption of validity to the conduct of the prosecutor.\" State v. McCrary, supra, 97 N.J. at 142 (citing In re Investigation Regarding Ringwood Fact Finding Comm'n., 65 N.J. 512, 516 (1974) and State v. Laws, supra, 51 N.J. 494). Courts will review the exercise of prosecutorial power by the executive branch for \"arbitrariness or abuse.\" In re Investigation Regarding Ringwood Fact Finding Comm'n, supra, 65 N.J. at 516.\n\nRecently, in State v. DiFrisco, 118 N.J. 253 (1990), the defendant argued that the prosecution had abused its discretion in failing to investigate and prosecute a putative accomplice. DiFrisco confessed that he had done the killing at the behest of one Franciotti. Only DiFrisco was prosecuted for\n\nthe crime. The Court noted that in discriminatory enforcement cases, the general rule is:\n\n\"So long as the prosecutor has probable cause to believe that the accused committed an offense defined by statute, the decision whether or not to prosecute, and what charge to file or bring before a grand jury, generally rests entirely in his discretion.\" Bordenkircher v. Haye, 434 U.S. 357, 364, 54 L. Ed. 2d 604, [611] (1978). This broad discretion rests largely on the recognition that the decision to prosecute is particularly ill-suited to judicial review. Such factors as the strength of the case, the prosecution's general deterrence value, the Government's enforcement priorities, and the case's relationship to the Government's overall enforcement plan are not readily susceptible to the kind of analysis the courts are competent to undertake. [Wayte v. United States, 470 U.S. 598, 607, 84 L. Ed. 2d 547, 566 (1986).]\n\n[Id. at 265-66].\n\nThe Court explained that a defendant's burden in discriminatory or selective prosecution cases is to \"plead and prove intentional selectivity as well as an unjustifiable basis for the discrimination. '[The] standards require petitioner to show both that the * * * enforcement system had a discriminatory effect and that it was motivated by a discriminatory purpose.'\" Id. at 266 (quoting Wyte, supra, 470 U.S. at 608, 84 L. Ed. 2d at 556).\n\nThe State's abandonment of prosecution against Miller was a legitimate exercise of discretion. Contrary to defendant's implication, Miller was not ignored during the investigation. Both men were subjected to polygraph examinations on Tuesday, March 4th. Any intensified efforts directed toward Perry were a product of his drug use as it interfered with the polygraph. In gathering evidence and questioning witnesses, the officials repeatedly probed for information involving Miller. For example, based on information that Miller had been present when 762 Division Street was secured, the police repeatedly questioned witnesses about Miller's role. All of those facts provide a rational reason for the State's decision to concentrate their efforts on the prosecution of Arthur Perry.\n\nAn indictment should be disturbed only on the \"clearest and plainest ground.\" New Jersey Trade Waste Ass'n, 97 N.J. 8, 18-19\n\n(1984). Such a ground would be an indication that the prosecutor's conduct affected the fairness of defendant's trial. State v. Ramseur, supra, 106 N.J. at 426; State v. Zola, supra, 112 N.J. at 426. No evidence presented to the grand jury relating to Clark Miller's involvement in the crime would have exculpated the defendant. Clear grounds for probable cause existed based on Perry's taped confession. Evidence regarding Miller would have been only incidental to the grand jury's decision regardingdefendant.\n\nFinally, there is no factual basis for defendant's claims of a Brady violation, see Brady v. Maryland, 373 U.S. 83, 10 L. Ed. 2d 315 (1963) (prosecution has ongoing duty to reveal all potentially exculpatory evidence to the defense), or a \"fundamental misrepresentation\" by the prosecution. There is no evidence that trial counsel did not receive a one-page section of the report on Miller's polygraph test, despite his certification that he did not recall receiving it. The sheets of the six-page report were numbered consecutively, and page five contained the \"results\" without which the report would have made little sense. The prosecutor sent the report to trial counsel well before trial with a letter saying \"If you have any questions please do not hesitate to call.\" Although prosecutors may not transfer the burden of Brady compliance by beseeching defense attorneys to be inquisitive, State v. DiFrisco, supra, 118 N.J. at 260 (Brady creates \"a non-delegable responsibility\"), that letter and the lack of any response lead us to conclude that defense counsel received page five, even if he cannot recall having done so. Similarly, the record contradicts the assertion that the prosecutor attempted to deceive the jury into believing that defendant was the sole actor involved in the crime. Such a claim ignores the testimony of Inspector Milbury surrounding the investigation of the crime. In that testimony he told the jury that Miller and Perry had reported the body and that he had interviewed both Miller and Perry. More importantly, defendant's entire taped confession was played for\n\nthe jury, wherein he begins by implicating Miller. The prosecution did nothing to inhibit the defense from exploring alternative defenses, including the implication of Miller.\n\n4. Gaps in Trial Transcript\n\nDefendant alleges that three \"gaps\" in the trial transcript plus the closed recording of the peremptory-challenge process resulted in an incomplete, defective record of the trial and prejudiced his chance for appellate review. We disagree.\n\nThe three \"gaps,\" when read in the context of the entire transcript and of those discussions immediately preceding each gap, all involved inconsequential administrative matters or were related simply to waiting for the jury to re-enter the courtroom and settle into the jury box. Concerning the transcription of peremptory challenges, the jury-selection list on file with the court clerk renders any error harmless.\n\nIII\n\nPenalty Phase\n\nAlthough defendant raises numerous claims of error regarding the penalty phase, his principal and most important contention is that his death sentence should be vacated because there was insufficient evidence to warrant jury consideration of aggravating factor N.J.S.A. 2C:11-3c(4)(c).\n\nA. Aggravating factor c(4)(c)\n\nN.J.S.A. 2C:11-3c(4)(c) provides that the death penalty may be imposed in those cases in which \"the murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind or an aggravated assault to the victim.\" In State v. Ramseur, supra, 106 N.J. at 198-211, we recognized the \"obvious vagueness\" of that provision. To save the constitutionality of c(4)(c), we narrowed its construction.\n\nIn Ramseur, we identified the two components of factor c(4)(c) as follows:\n\nTorture or aggravated battery to the victim shall be found if the defendant intended to cause, and did in fact cause, severe physical or psychological pain or suffering to the victim prior to the victim's death, \"severity\" measured either by the intensity of the pain, or the duration of the pain, or a combination of both. Where the murder was not the product of greed, envy, revenge or another of those emotions ordinarily associated with murder, and served no purpose for the defendant beyond his pleasure of killing, the court shall instruct the jury on the meaning of depravity in this specific context. For the defendant who killed for the enjoyment of it, because the victim just happened to be in the area, or for no reason at all, just to kill, society must be able to reserve its most extreme sanction.\n\n[Id. at 211].\n\nMoreover, we have held that depravity of mind can be found from evidence of mutilation after death. See State v. McDougald, supra, 120 N.J. at 565.\n\nThe State noticed a general allegation of factor c(4)(c) at pre-trial. The State asserts that at the penalty phase there was sufficient evidence of \"aggravated assault\" (physical pain and that the victim was strangled twice) and \"depravity of mind\" (purposeless killing) for the jury to find c(4)(c). On appeal, the State argues for the first time that the make-up and shaved eyebrows indicate depravity via corpse mutilation. The trial court, however, charged the jury on depravity only by way of senseless killing.\n\n1. Aggravated Assault\n\nIn State v. Ramseur, supra, we explained that in regard to the aggravated-assault/torture component of c(4)(c) the \"essence of the legislative concern is the defendant's state of mind.\" 106 N.J. at 207. \"Society's concern, the community's concern, the Legislature's concern, is to punish most harshly those who intend to inflict pain, harm, and suffering -- in addition to intending death. . . .\" Id. at 207-08. We cautioned that the torture and aggravated-assault basis for the death penalty cannot apply where no pain was suffered despite the murderer's intent to inflict it, because \"there would be too many possible presentations by the prosecution,\n\neach conceivably turning on theoretical reconstruction of intent.\" Id. at 208. We include, therefore, only\n\nthe class of murders in which defendant intended to, and did in fact, cause extreme physical or mental suffering -- in addition to death. The state of mind that we require corresponds to our Code's \"purposeful\" definition. Thus, the extreme physical or mental suffering must be precisely what\n\ndefendant wanted to occur in addition to death.\n\nOur concern is that if the c(4)(c) factor could be sustained on this evidence alone [method of killing] there would be no principled way to distinguish this case, in which the death penalty was imposed from the many cases in which it was not.\n\nBecause factor c(4)(c) focuses on the criminal's state of mind, it cannot be supported solely by reference to the means employed to commit the murder. State v. Matulewicz, supra, 115 N.J. 191. As we have noted previously, aggravated battery is \"'qualitatively and quantitatively [] more culpable than the minimum [force] necessary to accomplish an act of murder.'\" State v. Ramseur, supra, 106 N.J. at 205 (quoting Smith v. Commonwealth, 219 Va. 455, , 248 S.E.2d 135, 149, cert. denied, 441 U.S. 967, 60 L. Ed. 2d 1074 (1978)). However, manual strangulation of a teenager as described here bears no rational distinction from shaking an infant to death and certainly does not fall within that class of cases where \"intent to . . . inflict gratuitous pain may be inferred from the circumstances of the crime * * * * [or where] needless torture [is] apparent.\" State v. Matulewicz, supra, 115 N.J. at 194, 199.\n\nExactly how much force is necessary to strangle or shake someone to death is unclear and \"death should not be imposed as a result of what may be an extremely close determination of how much pain is considered \"necessary.\" State v. Ramseur, supra 106 N.J. at 206; see also State v. Matulewicz, supra, 115 N.J. at 199-200 (\"the pathological evidence presented thus far is insufficient to establish that point [i.e., an intent to 'cause extreme physical or mental suffering in addition to death.']\"). We conclude that the evidence does not rationally support a finding that defendant intended to and did inflict extreme pain other than that incidental to the strangulation that caused Redd's death.\n\n2. Depravity of Mind\n\nThe record also shows a dearth of support on which to establish that this murder evinces \"depravity of mind.\" In Ramseur we defined \"depravity of mind\" as follows:\n\nThese words mark society's concern to punish severely those who murder without purpose or meaning as distinguished from those who murder for a purpose (albeit a completely unjustified purpose). This term isolates conduct that causes the greatest abhorrence and terror within an ordered society, because citizens cannot either in fact or in perception protect themselves from these random acts of violence. The killer who does it because he likes it, perhaps even because it makes him feel better, who kills bystanders without reason, who kills children and others whose helplessness would indicate that there was no reason to murder, evinces what we define as depravity of mind. [106 N.J. at 209 (footnotes omitted).]\n\nThe Court clarified the last portion of that definition by saying that \"the helplessness of the victim\" was not enough to permit a finding of depravity, but rather that that fact \"usually demonstrates the senselessness of the killing.\" Id. at 209 n.36. In Ramseur, we also concluded that depravity of mind should apply to \"the defendant who killed * * * because the victim just happened to be in the area, or for no reason at all.\" Id. at 211. The so-called \"purposeless murder,\" then, is the killing that involves none of the emotions or motives normally associated with murder, State v. Matulewicz, supra, N.J. at 198 (\"crime bereft of recognizable human emotion\"), but rather is done at the murderer's whim or for his pleasure. State v. Ramseur, supra, 106 N.J. at 211.\n\nMost motives are inconsistent with the assertion that the murder was one of depraved mind done for whim or pleasure. For example, the assertion that the murder was done to escape detection is inconsistent with the claim that the defendant was depraved and acted solely for pleasure. State v. Rose, supra, 112 N.J. at 531-532. See also State v. Gerald, supra, 113 N.J. at 65-66 (finding that where the defendant killed in the course of greed-motivated burglary, his beating of victim after victim was unconscious was insufficient to show depravity in c(4)(c) sense). This Court has found that where \"greed, anger, revenge or other similar motive is present, the depravity aspect of section (c)(4)(c) should not be submitted to the jury.\" Id. at 66.\n\nThe evidence does not rationally support a finding that this murder was one of depravity. Although the prosecutor argued at the penalty phase that Jerome Redd had died for \"no other reason\" than that \"Arthur Perry decided he should die,\" there is no basis for believing that this death \"served no purpose for the defendant beyond his pleasure of killing.\" State v. Ramseur, 106 N.J. at 211. As noted above, where \"greed, anger, revenge or other similar motive is present, the depravity aspect of section c(4)(c) should not be submitted to the jury.\" State v. Gerald, supra, 113 N.J. at 65-66; see also State v. Ramseur, 106 N.J. at 209 (holding that anyone who murders for a purpose, albeit a completely unjustified purpose, cannot be deemed depraved under c(4)(c)). This case involved a dispute over drugs and money, a period of harassment, and an exchange of profanities that resulted in a brief fight that unfortunately led to Redd's death. Greed, anger, revenge, or all three, were present.\n\nIt is also impossible to say that the other circumstances of the crime evidenced a depravity of mind. The touchstone is still a question of purpose. The age of the victim and the cosmetic changes to the victim's face indicate depravity only if they do not portray a rational purpose. Here, the killing of Redd had a purpose, and his age would not \"indicate that there was no reason to murder.\" Ramseur, 106 N.J. at 209 n.36. Similarly, the application of eye make-up and the shaving of the eyebrows of the victim, even if done by Perry, do not seem to rise to the level of \"physical damage to a corpse\" discussed in Ramseur. Id. at 210 n.37. Moreover, if they did constitute mutilation, the State did not assert mutilation at the penalty phase nor did the court charge mutilation, referring to depravity only by way of a senseless killing and aggravated assault related to physical pain. Under Coyle, mutilation could not serve as the basis for retrial of c(4)(c), and certainly could not serve as a basis for an appellate court's de novo justification for a death sentence. State v. Coyle, supra, 119 N.J. at 237-38\n\n(distinguishing Biegenwald II, 110 N.J. 521 (1988)).\n\nTo summarize, motivations other than mere whim coupled with the absence of any evidence showing that Perry intended to cause gratuitous pain in addition to that necessary to strangle Redd to death demonstrate the inapplicability of c(4)(c) to this case. Accordingly, aggravating factor N.J.S.A. 2C:11-3c(4)(c), the sole aggravating factor remaining after the guilt-phase verdict, was improperly presented to the jury. Therefore, the defendant's death sentence is vacated. Because defendant cannot again be subjected to the death penalty, we do not discuss defendant's other claims of error concerning the penalty phase.\n\nIV\n\nSentencing on Non-Capital Counts\n\nDefendant complains that the trial court mistakenly weighed the aggravating factors relating to non-capital sentencing in giving Perry consecutive sentences for hindering apprehension and possession of drugs. He also points out that the court failed to state its reasons for imposing consecutive sentences, as required by State v. Yarbough, 100 N.J. 627 (1985). We believe, to the contrary, that the trial court properly weighed only the appropriate factors (as established by N.J.S.A. 2C:44-1f(1) and N.J.S.A. 2C:43-6a(3)) and imposed consecutive sentences in compliance with Yarbough.\n\nWhere the sentences imposed by the court are within the statutory range and guidelines, we normally will not disturb them. State v. Jabbour, 118 N.J. 1, 5 (1990). Given that the sentences are within those guidelines and the court explicitly found two aggravating factors (need for deterrence and prevention of recidivism), the court could, in its discretion, increase Perry's sentences for non-capital offenses to the maximum allowed. In response to defense counsel's\n\nrequest, the trial court explicitly stated that it was \"not going to consider as aggravating circumstances the commission of the murder itself.\" That further refutes any contention that the court weighed the aggravating factors in any way other than according to that established by our criminal code. See N.J.S.A. 2C:441f(1); N.J.S.A. 2C:43-6a(3).\n\nCourts can impose consecutive sentences because \"the crimes and their objectives were predominantly independent of each other.\" State v. Yarbough, supra, 100 N.J. at 644. In this case, Perry was convicted of hindering apprehension and possession of heroin, in addition to murder. As we recognized in Yarbough itself, the crimes of murder and hindering apprehension involve similar yet distinct acts. Id. at 638. It is obvious from the record that Perry's drug possession was also separate and distinct from the murder of Redd. Although the trial court failed to \"separately state[]\" its \"reasons for [not] imposing . . . [a] concurrent sentence\" (as required by Yarbough, id. at 643), the sentences are affirmed because they clearly fit within the Yarbough guidelines.\n\nV\n\nArthur Perry deliberately killed Jerome Redd on February 27, 1986. For that he was correctly convicted of murder, and nothing in this opinion is meant to condone his unlawful acts. However, this State has recognized that its ultimate sanction is reserved for a certain class of offenders. Arthur Perry is not in that class.\n\nWe reverse the imposition of the death penalty, affirm defendant's convictions for knowing murder, possession of drugs, and hindering apprehension, affirm the sentences on the latter two offenses, and remand the matter to the Law Division for the imposition of sentence on the murder conviction.\n\nSTEIN, J., concurring in part and dissenting in part.\n\nThis capital-murder prosecution was based on proofs that defendant, an acknowledged drug addict, manually strangled a fourteen-year-old drug dealer in the course of an argument about money owed to the victim and defendant's unwillingness to distribute drugs for the victim and his cohorts. Primarily on the basis of his confession, defendant was named in an eight-count indictment charging him, among other offenses, with murder, N.J.S.A. 2C:11-3a(2), felony murder, N.J.S.A. 2C:11-3a(3), and robbery, N.J.S.A. 2C:15-1. The robbery count was based on defendant's admission that he took the victim's coat and $60 from his pockets after the homicide. After indictment, the State gave notice of its intention to prove two aggravating factors, N.J.S.A. 2C:11-3c(4)(c), the aggravated assault/torture/depravity factor (hereafter c(4)(c)), and N.J.S.A. 2C:11-3c(4)(g), murder in the course of a felony. Defendant did not seek pretrial review of the sufficiency of the evidence supporting the aggravating factors. See State v. McCrary, 97 N.J. 132, 143-47 (1984).\n\nBecause the jury acquitted defendant of robbery, the trial court dismissed the felony-murder aggravating factor, 2C:11-3c(4)(g), and the penalty phase of the case proceeded solely on the basis of the c(4)(c) factor. The jury found that aggravating factor to have been proved, and found no mitigating factors. The court sentenced defendant to death.\n\nThe Court now affirms defendant's conviction of murder and related offenses. I concur in that aspect of the Court's opinion. The Court also holds that the death sentence must be reversed because there was insufficient proof to warrant submission 'of the c(4)(c) aggravating factor to the jury. I acknowledge that the evidence supporting that aggravating factor is marginal, so marginal that one is prompted to question the exercise of prosecutorial discretion to treat this as a capital case. I disagree, however, with the Court's conclusion that the evidence supporting aggravating factor c(4)(c) was insufficient to\n\npresent a jury question. Hence, I would affirm both defendant's convictions and sentence.\n\nI.\n\nThe aggravating factor presented to the jury during the penalty phase of this case is set forth in N.J.S.A. 2C:11-3c(4)(c):\n\nThe murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind, or an aggravated assault to the victim[.]\n\nIn State v. Ramseur, 106 N.J. 123 (1987), this Court narrowly construed the c(4)(c) factor to sustain its constitutionality, concluding that the introductory language (\"the murder was outrageously or wantonly vile, horrible or inhuman\") -- \"is indefinite beyond anyone's ability to remedy, and presumably was so recognized by the Legislature * * * .\" Id. at 199. We determined that the qualifying language of c(4)(c) -- that the murder \"involved torture, depravity of mind or an aggravated assault\" -- described the essential elements to be found by a jury. Ibid. Concluding that \"the essence of the legislative concern is the defendant's state of mind,\" id. at 207, we held that the c(4)(c) factor encompassed the class of murders\n\nin which defendant intended to, and did in fact, cause extreme physical or mental suffering -- in addition to death. The state of mind that we require corresponds to our Code's \"purposeful\" definition. Thus, the extreme physical or mental suffering must be precisely what defendant wanted to occur in addition to death. \"Torture\" and \"aggravated battery\" take on adequate definiteness when the circumstances are described in terms of defendant's intention, and the requirement that defendant intentionally inflicted extreme physical or emotional pain eliminates the need for a distinction between the two statutory terms.\n\nat 287 n.68 (quoting State v. Reyes, 50 N.J. 454, 459 (1967)).]\n\nIn State v. Bey II, 112 N.J. 123 (1988), an autopsy of the homicide victim disclosed that she had been beaten, sexually assaulted, and strangled. The medical examiner also concluded that her assailant had stomped on her chest. The cause of death was ligature strangulation. Id. at 131-32. The defendant testified during the guilt phase of the trial, acknowledging that he had struck and sexually assaulted the victim but denying any recollection that he had stepped on her chest. No evidence was offered to prove that the defendant had intended to inflict physical or psychological pain before death, nor did the proofs indicate whether the victim was alive when the stomping occurred. We held that the jury charge on aggravating factor c(4)(c), delivered prior to our opinion in Ramseur, constituted reversible error. Id. at 173-74. Nevertheless, we acknowledged that the c(4)(c) aggravating factor could be resubmitted to the jury on remand. Id. at 174.\n\nSimilarly, in State v. Zola, 112 N.J. 384 (1988), although the victim's death was caused by manual strangulation, she had also been wounded in the throat and face, and a substantial portion of her body showed signs of scalding. Her body was found \"spread-eagled\" on her bed, with leather thongs tied to a wrist and an ankle. The defendant's account of the homicide suggested that the scalding had been accidental, occurring during his attempt to revive the victim from a blow to the head that the defendant had perceived to have been fatal. No specific evidence was offered to prove that the defendant had intended to inflict pain before death. Without addressing the sufficiency of the c(4)(c) charge, we held that on remand the jury instruction should be in accordance with our holding in Ramseur. Id. at 433. The Court also rejected the defendant's contention that the evidence was insufficient to justify submission of the c(4)(c) factor to the jury:\n\nThe wounding and scalding of the victim here may indicate defendant's desire to make the victim suffer before he killed her, or, if these injuries were inflicted after the victim had died, they could constitute a mutilation of the corpse.\n\n[112 N.J. at 434.]\n\nState v. Gerald, 113 N.J. 40 (1988), is also analogous. In that case the homicide victim was beaten in the course of a burglary and robbery. A witness testified that one of the perpetrators had struck the victim in the face with a television set. The medical examiner determined that\n\ndeath was caused by blunt-force injuries to the head, specifically, cerebral concussions and a fractured nose, inflicted by blows of the fists and feet.\n\n[Id. at 50.]\n\nThere were discernible sneaker-prints on the victim's face and forehead. Ibid. The medical examiner surmised that death resulted not from a single blow but rather from the sum of numerous blows. Id. at 51. In response to the defendant's argument that the evidence did not demonstrate an intention to inflict pain prior to death, we determined that the record was sufficient \"to sustain a finding that the defendant intended to and did cause 'severe physical or psychological pain or suffering to the victim prior to the victim's death.'\" Id. at 66-67 (quoting State v. Ramseur, supra, 106 N.J. at 211).\n\nOther decisions involving c(4)(c) also demonstrate that the jury must infer a purpose to inflict pain from the circumstances surrounding the homicide. Compare State v. McDougald, 120 N.J. 523, 567 (1990) (\"Defendant had repeatedly slashed and bludgeoned the victims before killing them. Walter Bass was awake and knew he was dying and that defendant would also probably kill his wife. The jury could surmise that defendant purposely awoke Mrs. Bass with the first blow to the head and wanted her to know from that point on that she was going to die. Although there are facts that could be interpreted to contradict those elements of c(4)(c), there is sufficient evidence to allow the issue to be submitted to the jury on remand.\") with State v. Hunt, 115 N.J. 330, 388-89 (1989) (\"The evidence here is that Lawson was stabbed\n\ntwenty-four times, was shocked by the attack, and bled for twenty minutes before dying. * * * Our concern is that if the c(4)(c) factor could be sustained on this evidence alone, there would be 'no principled way to distinguish this case, in which the death penalty was imposed from the many cases in which it was not.'\" (quoting Godfrey v. Georgia, 446 U.S. 420, 433, 64 L. Ed. 2d 398, 409 (1980))).\n\nEvaluating defendant's confession in the context of our c(4)(c) decisions suggests that this record was at least minimally sufficient to warrant submission of that factor to the jury on the basis of aggravated assault. After explaining that he and the fourteen-year-old victim had argued over drugs, defendant stated:\n\nHe stood as tall as I did, so I had to grab him. I grabbed him in the fashion that I learned in the Marine Corps, by the neck, and locking him. When we fell, the pressure of my grip strangled him obviously. He got limp for a few minutes, then he broke out into a rage as if he was trying to really get loose. I guess that's when he was losing his life. And I held him for another minute or so and he just collapsed; he died.\n\nAfter further questioning, defendant gave a more detailed account of the homicide:\n\nA. * * * I thought he had a gun or a knife or something, cause he was too anxious to come at me. And, um, before I had gave him a chance to do such, when he walked towards me cause it's a narrow room, I gave him enough room to get close enough to me where when he pointed at me, I moved to the side and I grabbed him and threw him back over me, you know. And, um, it was a method I learned from the Marine Corps. I grabbed him, threw my knee up and threw him down on it and kept him locked like that to restrain him. And, I seen that he wasn't gonna cool out and he just broke into a rage and we scuffled for a few.\n\nQ. He was resisting at this time?\n\nA. Right. And, um, I just held on to him as tight as I could, and he relaxed for a second. Now, I know when you strangle somebody the first thing that they pass out. Assume that's what happened. As soon as I gave a little bit of leeway is to let him go. He broke on me again and he had strength that I've never felt before and I knew if I let him go it was either me or him. That's when I grabbed him with the death grip and didn't let him go for at least thirty to a half a minute or even a minute. When he had no more movement in his body, I let him go. I could see then that I did something that I didn't want to do because his tongue was puffed sticking out the side of his mouth. I don't know if he was dead at that time. Maybe I could have saved his life if I would\n\nhave called the police right away and an ambulance, but I didn't do that. I was scared to death and, um, I searched him for a weapon. I didn't find no weapon. He only had about forty some, about sixty something dollars on him and the drugs. I took both. I camouflaged his body, too, I carried, I didn't push him down the stairs or anything like that.\n\nDefendant's statement describes a murder by manual strangulation in the course of which the victim struggled to survive, and from which a jury could rationally infer that the victim experienced physical or psychological pain, or both, before death. Manual strangulation necessarily involves the infliction of physical pain. Defendant's statement indicated that after he assumed the victim \"passed out,\" he relaxed his grip; the victim struggled and defendant then \"grabbed him with the death grip and didn't let him go * * * .\" It would at least have been rational for the jury to have inferred from defendant's statement that defendant made a calculated decision to kill the victim by manual strangulation and did so intending to cause severe pain before death. Whether defendant actually intended to inflict severe pain before death is, of course, debatable; but the evidence, qualitatively, is at least comparable to the evidence adduced in other cases in which we have held that a jury issue had been raised.\n\nII.\n\nAlthough I view the evidence supporting aggravating factor c(4)(c) as minimally sufficient to have presented a jury question, I am troubled about the basis for the exercise of prosecutorial discretion that resulted in the determination to try this as a capital-murder case. We have frequently had occasion to express our concern about standards for the exercise of prosecutorial discretion to seek the death penalty in specific cases. In State v. McCrary, supra, 97 N.J. 132, we acknowledged the broad charging discretion inherent in the prosecutorial function but recognized the right to pre-trial review of aggravating factors to an extent sufficient to verify that the evidence was adequate to justify submission of an aggravating factor to a jury. Id. at 142-43. In Ramseur, we\n\nanticipated the need to consider, in the course of proportionality review, \"whether to address concerns about possible misuse of prosecutorial discretion * * * including in the review all cases in which the prosecutor had the discretion to seek the death penalty.\" 106 N.J. at 329. Additionally, in State v. Koedatich, 112 N.J. 225 (1988), we encouraged the adoption of prosecutorial guidelines to assist in the designation of capital cases:\n\nWe recognize the need for greater guidance for prosecutors as they attempt to perform their constitutional duty of enforcing this statute. Other death penalty jurisdictions have held the validity of the prosecutor's exercise of discretion depends solely on whether a factual basis exists for the charging of aggravating factors. * * * Nevertheless, we believe there is a need to promote uniformity in the administration of the death penalty, which will be an additional safeguard against arbitrariness and an assistance to this Court in its developing proportionality review.\n\nAccordingly, we strongly recommend that the Attorney General, and the various County Prosecutors, in consultation with the Public Defender, adopt guidelines for use throughout the state by prosecutors in determining the selection of capital cases.\n\n[Id. at 258 (citations omitted).]\n\nJustice Handler, dissenting in Koedatich, expressed the view that the lack of mandatory prosecutorial standards constituted an unacceptable flaw in our Capital Punishment Act:\n\nAs I intimated in dissent in State v. Ramseur, the breadth of the definition of capital murder, and the absence of meaningful narrowing through the consideration of aggravating factors, renders the jury's discretion standardless. The absence of standards for prosecutors in such a scheme redoubles the infirmity of unguided discretion because the flaws that plague the jury's function in the statute -- the failure of the guilt-phase definition and the penalty-phase aggravating factors to guide discretion -- are replicated in the absence of prosecutorial standards. 106 N.J. at 405-06 (Handler, J., dissenting). Moreover, the lack of guidance with respect to the prosecutor's decision to charge a defendant with capital murder unacceptably increases the danger that the death penalty will be imposed arbitrarily because the needed narrowing function is not provided at this crucial initial stage of a prosecution.\n\n[Id. at 376.]\n\nAmong capital cases decided by this Court, this case is distinctive in that the homicide emanated from a conflict between two individuals engaged in the sale or use of drugs. The existence of slight evidence supporting the c(4)(c) aggravating factor was coincidental to the homicide, and the homicide itself\n\nappeared to be entirely spontaneous. The felony-murder aggravating factor was based solely on defendant's acknowledgment that he had taken sixty dollars and a coat from the victim after the homicide, and that factor was withdrawn from the case after the jury acquitted defendant of robbery. The impression is unavoidable that there was scant basis in the accumulated evidence to distinguish this homicide as one warranting a capital prosecution. The concerns expressed by Justice Handler, concurring in State v. Matulewicz, 115 N.J. 191, 208 (1989), are pertinent to this case:\n\nThe risk of arbitrary enforcement of the death penalty due to the lack of a uniform statewide standard to guide prosecutors in their selection of capital defendants is heightened considerably when c(4)(c) is the sole aggravating factor relied on to transform a homicide into a capital case.\n\n[Id. at 208.]\n\nConcededly, the prosecutor in this case served notice of the aggravating factors prior to the adoption in February 1989 by the New Jersey County Prosecutors Association of \"Guidelines for the Designation for Capital Prosecutions.\" Whether those guidelines will prove in practice to be sufficiently specific to overcome the problem of arbitrariness in the designation of cases for capital prosecution, a problem that is addressed currently only in the course of proportionality review of a death sentence that has been affirmed, is uncertain.\n\nHANDLER, J., concurring in part and dissenting in part.\n\nIn this case the essential evidence of defendant Perry's guilt is his confession to the homicide. In that confession, Perry recounts an altercation between himself and the victim, and repeatedly states that he did not intend to kill the victim but rather only to subdue him. This gives rise to several valid claims of reversible error with respect to the murder conviction. Defendant also makes claims of reversible error relating to voir dire. Additionally, defendant makes a broad-based claim that he received constitutionally-deficient representation at virtually all stages in the prosecution.\n\nThe Court reverses defendant's death sentence but upholds his conviction for non-capital murder. I agree with the Court's reasoning but believe that prejudicial error also surrounds defendant's conviction for non-capital murder, justifying a reversal of that conviction. In addition, while the Court reverses the death penalty, finding insufficient evidence to support the sole aggravating factor, N.J.S.A. 2C:11-3c(4)(c), there are additional substantial claims of error relating to the penalty phase that the Court neglects to address but that nevertheless should be the subject of comment to emphasize that such errors are not tolerable in capital-murder prosecutions.\n\nThese reasons, as well as my continuing conviction that our death-penalty statute is unconstitutional as enacted, construed, and applied, e.g., State v. Di Frisco, 118 N.J. 253, 284 (1990) (Handler, J., concurring in part and dissenting in part), impel me to write separately.\n\nI.\n\nThe Court reviews the facts surrounding the empaneling of the jury but finds nothing untoward with respect to that phase of the prosecution. Ante at (slip op. at 31-36). I believe the selection of the jury involved reversible error.\n\nThe voir dire spanned five trial days. Initially the trial court provided prospective jurors with an outline of the charges and an overview of the jury's function, the bifurcated nature of a capital case, and the role of aggravating and mitigating factors. Next, each panel of prospective jurors completed a questionnaire covering their general background, exposure to the case or acquaintance with anyone involved, association with law-enforcement personnel, views on the criminal-justice system, ability to follow the law, and the like. In addition, the questionnaire referred to potential prejudice engendered by homosexuality or use of illegal drugs. The court then questioned each prospective juror about problematic responses before proceeding to death qualification. With respect to death qualification, the\n\ntrial court asked virtually the same series of questions of each potential juror: whether that person was willing to discuss his or her beliefs about the death penalty \"openly and freely,\" whether the person inflexibly favored or opposed the penalty, generally what the person's opinion on the death penalty was, and whether the prospective juror could and would follow the law as charged. If the juror indicated he or she strongly favored or opposed capital punishment, the court asked further questions regarding that person's ability to decide the issue of punishment pursuant to the law and despite his or her beliefs.\n\nDefendant brings a plain-error challenge to the voir dire process as a whole, arguing, among other points, that the death-qualification interrogation was superficial and insufficient to permit the court and counsel to determine the opinions and views of prospective jurors.\n\nIt is well-settled that in capital-murder trials only a duly-qualified jury may be empaneled to determine a defendant's guilt of capital-murder and, if there is a \"guilty\" verdict, whether the defendant deserves to die. The jury's heavy and special responsibilities in a capital-murder case are unique. In such cases, the jury must be specially qualified in order to assure that high degree of fairness and impartiality essential to determine criminal guilt and appropriate sentence. Ross v. Oklahoma, 487 U.S 81, 101 L. Ed. 2d 80 (1988); State v. Bey, 112 N.J. 123, 151-54 (1988) (Bey II); State v. Ramseur, 106 N.J. 123, 248-54 (1987); State v. Williams, 93 N.J. 39, 61-62 (1983) (Williams I).\n\nBecause adequate juror qualification is an imperative condition for a valid capital-murder prosecution, extraordinary importance attaches to the voir dire and particularly the death-qualification process. Bey II, supra, 112 N.J. at 152. Because a jury in a capital case is called on to determine both ordinary criminal guilt and the sentence, which may be life or death, we take extensive measures to ensure the empaneling of a jury that is both conventionally qualified and specially qualified.\n\nSee State v. Marshall, 123 N.J. 1, 216-17 (1991) (Handler, J., dissenting). In particular, all potential jurors must submit to \"thorough and searching inquiry by the trial court into each individual's attitude concerning the death penalty.\" State v. Williams, 113 N.J. 393, 413 (1988) (Williams II). The examination of each juror's views on capital punishment must be particularly probing to ensure his or her ability to comply with the governing legal standards, and open-ended questions are required so that jurors can fully express their views in their own words. State v. Hunt, 115 N.J. 330, 354 (1989); Williams II, supra, 113 N.J. at 413. We insist that no person may serve on a jury in a capital case whose views concerning the death penalty \"would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" Williams II, supra, 113 N.J. at 415 (quoting Adams v. Texas, 448 U.S. 38, 45, 65 L. Ed. 2d 581, 589 (1980)).\n\nDefendant argues that the trial court's death-qualification questioning was \"perfunctory\" and failed to garner adequate information, so that the attitudes of the prospective jurors remained unknown. Noting that no ADP's, persons who would automatically vote to impose death, were identified, and that only two potential jurors were excused because of death scruples, he argues that the questions posed were leading, closed-ended, and framed to preserve the juror for service.\n\nSeveral examples can be cited. In the examination of juror Kathleen Porter on the first day, the juror revealed generally that she believed \"there are some crimes that deserve the death penalty,\" but she was not questioned further about which crimes she believed warranted death. Similarly with respect to the death qualification of alternate Linda Matrange, she indicated that she \"favored\" the death penalty but that \"it depends on the situation\"; however, she was not asked to explain what situations would or would not impel her to favor a death sentence. Another juror, John Benedict, indicated generally\n\nthat the death penalty was a better deterrent than prison, but the court then posed only closed-ended questions that masked real insight into the juror's thinking. The death-qualification questioning of the other thirteen jurors sworn was similar.\n\nI firmly believe that our law demands more searching inquiry into the jurors' views on the death penalty. Moreover, the absence of objections by counsel to the empaneling of the jury in these circumstances does not overcome the infirmity inherent in an inadequately-qualified jury. The judicial responsibility to secure a properly-qualified jury in a capital-murder prosecution is nondelegable. See State v. Marshall, supra, 123 N.J. at 220 (Handler, J., dissenting).\n\nThat the response by a potential juror that the death penalty is appropriate in some cases and not others is not sufficiently informative should be clear; it cannot constitute an adequate basis for the conclusion that a juror will be conscientious in attempting to understand the distinctions that are critical in deciding guilt and sentence in a capital-murder trial and will be able to follow the special principles of law in the assessment of evidence and determination of guilt and sentence. The juror-qualification process here, in my view, was not adequate to evaluate the jurors' fitness to serve in a capital case. I submit that defendant's general challenge to the voir dire should be sustained.\n\nII.\n\nA.\n\nDefendant raises several substantial claims that serve to impugn the reliability of his murder conviction. One such claim is based on a violation of the principles of State v. Gerald, 113 N.J. 40 (1988). Defendant argues that the record does not disclose whether the jury convicted him of knowingly causing death or of knowingly causing serious bodily injury resulting in death. We have recognized that \"in order to\n\nestablish death-eligibility, the jury must determine that the defendant had the knowledge or purpose to kill and not the knowledge or purpose merely to inflict serious bodily injury that happened to result in death.\" State v. Long, 119 N.J. 439, 450 (1990). Defendant contends that the facts adduced at trial rationally supported the lesser murder offense and therefore that the jury was constitutionally required to draw that distinction. See State v. Gerald, supra, 113 N.J. at 92. Because the Court reverses defendant's death sentence on other grounds and holds that defendant cannot be again subjected to a capital sentencing proceeding, it chooses simply to disregard the issue. Ante at (slip op. at 44). I would reverse defendant's murder conviction on this ground.\n\nBoth the indictment and the trial court's charge on murder served to obliterate any distinction between intentional murder and inadvertent, serious-bodily-injury murder. The trial court's charge is plainly incorrect in a critical aspect: it eliminates the necessity of a finding of an intent to cause death, which is essential to a verdict of guilty of capital murder. The jury was told that it could return a verdict of guilty to murder if it found defendant had been practically certain that he would cause \"serious bodily injury\" resulting in death. Serious bodily injury in turn was defined as a \"serious risk of death.\" Practical certainty that what one is doing is causing a serious risk of death, however, is not equivalent to practical certainty that those actions will cause death itself, despite the fact that death does occur. Accordingly, I submit, based on those inconsistent and incorrect instructions, that the jury's verdict does not reveal whether it found that defendant knowingly caused his victim's death or knowingly caused Jerome Redd serious bodily injury that happened to result in death. Moreover, the verdict sheet completed by the jury in no way required it to differentiate between the intentional and the unplanned murder.\n\nIf the jury's verdict cannot be interpreted to distinguish between capital and non-capital murder, it is important to determine whether a rational evidentiary basis exists for a\n\nfinding of that form of murder that is not punishable by death. See State v. Harvey, 121 N.J. 407, 412-14 (1990), cert. denied, U.S. , 111 S. Ct. 1136 (1991); see also State v. Crisantos, 102 N.J. 265, 278 (1986) (criminal code imposes \"low threshold . . . for permitting a charge on a lesser-included offense\"). The State concedes that the jury was not asked to distinguish between the two forms of murder, but argues that such a rational basis for serious-bodily-injury murder does not exist in this case, that \"under the facts of this case there can be no doubt that defendant intended to kill Jerome Redd.\" Accordingly, the State argues that the charging error was harmless because there can be no doubt that defendant intended to kill his victim.\n\nThe evidence, particularly defendant's own confession, demonstrates a rational basis for the jury to have been charged on serious-bodily-injury murder. While defendant's capital murder conviction is properly reversed on other grounds, I disagree with the majority that defendant's conviction can simply be molded to a conviction for non-capital murder. We cannot be certain that had the jury been given a full and proper charge on murder that included and clearly differentiated between capital and non-capital murder, it would not have rejected a determination of guilt with respect to both and have found that a lesser form of homicide had been established in the evidence. In State v. Hunt, I explained that\n\nthe real harm in failing to instruct the jury on serious-bodily-injury murder is that the jury was deprived of the full spectrum of choices on which to base its weighty determination of criminal liability, denying the defendant the opportunity to secure a conviction on a less serious offense, namely, a form of manslaughter.\n\nSo in this case, the failure to charge a less serious offense that is supported by the evidence could subtly induce a jury to believe that the evidence would support the more serious offenses; the failure to charge could prevent the jury deflating the weight of the evidence in order to conform to a lesser charge. What the Court conveniently overlooks here is that the jury might not have so readily rejected the evidence of a form of manslaughter had it been\n\ngiven the appropriate, full range of choices.\n\n[115 N.J. at 407, 409-10 (1989) (Handler, J., dissenting) (footnote omitted).]\n\nB.\n\nIn addition to knowing murder, the trial court also charged the jury on aggravated manslaughter and reckless manslaughter. Defendant argues that the trial court committed plain error in failing to charge sua sponte self-defense and passion/provocation manslaughter, and that the omission of those jury charges violated his right to due process of law. The Court, improperly, in my view, rejects those contentions. Ante at (slip op. at 36-44).\n\nA trial court is obligated to charge lesser offenses \"when the facts 'clearly indicate' the appropriateness of that charge,\" irrespective of the parties' wishes. State v. Choice, 98 N.J. 295, 298 (1985) (quoting State v. Powell, 84 N.J. 305, 318 (1980)) (emphasis added). What must be clearly indicated, however, is a rational basis in the evidence. A lesser included offense must be charged if there is a rational basis in the evidence to support such a charge. State v. Crisantos, supra, 102 N.J. at 271-73. Although that standard impels a court to charge only those offenses for which a rational basis can be found in the evidence, the court is not ordinarily required \"meticulously to sift through the entire record . . . to see if some combination of facts and inferences might rationally sustain\" lesser charges. State v. Choice, supra, 98 N.J. at 299. In a capital-murder prosecution, however, the interest in having factually-justified charges given to the jury is heightened. The standards for vindicating that interest must be correspondingly enhanced. Consequently, the trial court cannot be allowed to temporize its duty \"meticulously to sift\" through the record searching for rationally-supported lesser offenses. It has a firm obligation to do so in a capital-murder prosecution.\n\nThe record so examined clearly indicates a rational basis to support a valid claim of self-defense, which should have been\n\ncharged to the jury. N.J.S.A. 2C:3-4(a) provides that \"the use of force upon or toward another person is justifiable when the actor reasonably believes that such force is immediately necessary for the purpose of protecting himself against the use of unlawful force by such other on the present occasion.\" See State v. Bowens, 108 N.J. 622 (1987). Once the issue of self-defense has been raised, the burden to disprove the issue shifts to the State. State v. Kelly, 97 N.J. 178, 200 (1984).\n\nThe record discloses that defendant told police that \"there was a dispute over monies.\" The victim came to 762 Division Street in Camden (alleged to be his \"home\") to get Perry to sell drugs for him, and became enraged when Perry refused. \"When I resisted and, to do so, we got into an argument. I did not mean to kill this man.\" Redd cursed and came at Perry; Perry removed the syringe and told Redd \"you better back the fuck up and wait,\" but Redd \"came at [Perry] as if he had something\" (meaning a knife or the gun he was known to carry). Defendant asserts that he then grabbed Redd to \"restrain\" and subdue him, but when he \"gave a little bit of leeway is to let him go,\" Redd \"broke on me again and he had strength that I've never felt before and I knew if I let him go it was either me or him.\" That evidence supports a self-defense charge. Self-defense involves a reasonable, even if incorrect, belief that the victim, \"unless forcibly prevented,\" will inflict fatal or serious bodily injury. State v. Bowen, supra, 108 N.J. at 628. The evidence rationally suggests that possibility. Moreover, other support for the self-defense claim identified by defendant includes the fact that the victim was six feet tall, an established drug dealer, usually armed, and often cheated his customers and, inferentially, was therefore prone to engage in violent confrontations.\n\nThe State proffers its own version of the facts to contradict a basis for self-defense. Suffice it to say that either version advanced by the parties could rationally be inferred from defendant's statement. However, \"that a jury might easily reject\n\ndefendant's view of the facts and draw inferences different from those reached in defendant's brief . . . is of no moment, for 'the test is whether there was room for dispute.'\" State v. Mauricio, 117 N.J. 402, 415 (1990) (quoting State v. Crisantos, supra, 102 N.J. at 285 (O'Hern, J., dissenting)).\n\nDespite the appropriateness of the self-defense charge based on the evidence, the Court suggests that a charge of self-defense would have been directly contrary to defendant's position at trial and might have possessed the capacity to prejudice his chances on knowing murder as discussed in Choice, supra, 98 N.J. at 301. Ante at (slip op. at 42-43).\n\nA charge of self-defense, however, does not necessarily concede defendant's presence at the scene of the crime, because the defense is to be considered only if the jury is otherwise satisfied, over defendant's contrary contentions, that defendant was present. See, e.g., Model Criminal Jury Charge to 2C:3-4. Here, charging the jury on self-defense would have had little potential to prejudice defendant's chances with respect to the charge of knowing murder because there was other evidence that defendant was present. Accordingly, on balance, it was plain error for the trial court not to have charged that defense.\n\nBy similar reasoning, defendant was entitled to a charge of passion/provocation manslaughter. The Court rules to the contrary. Ante at (slip op. at 37-39).\n\nMurder is reduced to manslaughter if \"committed in the heat of passion resulting from a reasonable provocation.\" N.J.S.A. 2C:11-4b(2). Unlike aggravated or reckless manslaughter, which involve mental states different from knowing murder, passion/provocation involves mitigation of intentional murder because of the existence of objectively reasonable provocation. State v. Grunow, 102 N.J. 133 (1986).\n\nPassion/provocation manslaughter has four elements: the provocation must be adequate; the defendant must not have had time to cool off between the provocation and the slaying; the provocation must have actually impassioned the defendant; and the defendant must not have actually cooled off before the\n\nslaying. [LaFave \u0026 Scott, Substantive Criminal Law  7.10, at 255 (1986)]. The first two criteria are objective, the other two subjective. If a slaying does not include all of those elements, the offense of passion/provocation manslaughter cannot be demonstrated.\n\n[State v. Mauricio, supra, 117 N.J. at 411.]\n\nI believe the appropriateness of a passion/provocation charge is fairly inferable from the evidence, including defendant's account of the altercation between himself and Redd. The provocation asserted on appeal is that the two were engaged in \"mutual combat\" during which defendant became impassioned. See Mauricio, supra, 117 N.J. at 414 (physical confrontation between bouncer and bar patron was sufficient evidence to require trial court, at defendant's request, to provide passion/provocation manslaughter charge). Defendant was in the middle of injecting drugs with a hypodermic needle when Redd came at him, telling him he owed Redd money. Evidence suggested that defendant suspected Redd had a knife or a gun. \"[A] threat with a knife or a gun might constitute adequate provocation.\" Ibid. Further, Redd had an opportunity to provoke greater violence from defendant because even though he was held in a necklock throughout the entire incident, he appeared to become enraged in the effort to free himself, ultimately leading defendant to kill him.\n\nAccordingly I believe that the trial court erred in failing to charge passion/provocation manslaughter.\n\nC.\n\nRelated to those substantive errors surrounding defendant's murder conviction are errors relating to the way in which the homicide offenses were charged. On the murder count, the trial court charged the jury on knowing murder, aggravated manslaughter, and reckless manslaughter in that order. The court instructed the jury to begin by deliberating on knowing murder and to move on to aggravated manslaughter only if the jury acquitted defendant of murder. similarly, the jury was\n\ninstructed to move to reckless manslaughter only after acquitting on aggravated manslaughter.\n\nThe Court has noted the implications of the use of sequential homicide instructions in relation to passion/provocation manslaughter. State v. Coyle, 119 N.J. 194, 223-24 (1990). The Court there said: \"In murder cases in which there is evidence of passion/provocation . . . a court must take additional care in issuing clear instructions. In those cases a sequential charge coupled with an instruction that inadequately defines the elements of the greater offense . . . can mislead the jury. Such a charge is inadequate.\" The Court did not, however, expressly prohibit the use of sequential charges where there is evidence of passion/provocation. See ibid. I am constrained to repeat what I stated in Coyle :\n\nWe have consistently recognized that a jury should not be either directly or subliminally conditioned to reach a particular verdict. State v. Simon, 79 N.J. 191, 206-08 (1979); see State v. Collier, 90 N.J. 117, 122-23 (1982). The hierarchical charge has a clear capacity to encourage the jury to determine guilt because the jury must acquit before turning to lesser-included offenses. Because the jury must first find a defendant not guilty of the greater offense, such a charge may coerce the jury and limit its freedom to consider lesser-included offenses.\n\nIn capital cases the court should not only give the jury the most complete range of verdict choices covering possible homicide offenses, but also assure it the widest opportunity to determine guilt and decide which offense, if any, is justified by the evidence. See, e.g., State v. Rose, 112 N.J. 454, 566 (1988) (Handler, J., dissenting). The hierarchical charge goes against this grain. The hierarchical submission of offenses under which the jury is required to find defendant not guilty of a greater offense before considering lesser-included offenses serves to narrow the range of available choices and reduce the capacity to determine guilt. People v. Mays, [407 Mich. 619, 288 N.W.2d 207, 211-12 (1980)]; State v. Ogden, [35 Or. App. 91, 580 P.2d 1049, 1052 (1978)]. This concern is critical in a capital-murder case where a determination of the greater offense, intentional murder, will automatically expose defendant to the death penalty. If the jury has not fully and objectively been able to reach this conclusion, because its deliberations on lesser-included offenses have been short-circuited, the defendant will have been unfairly brought closer to a death sentence. The court should by its instructions give the jury an order in which offenses are to be considered but specifically allow the jury to consider lesser\n\noffenses before it has determined guilt on the greater offense.\n\n[Id. at 243-44 (Handler, J., concurring in part and dissenting).]\n\nThat the distinctions between the mental elements of these forms of homicide are \"subtle ones at best\" cannot be overemphasized. See State v. Rose, supra, 112 N.J. at 562 (Handler, J., dissenting). That is particularly so where theevidence provides a rational basis not only for a finding of any one of the lesser forms of homicide but for passion/provocation murder and the defense of self-defense as well. See Coyel, supra, 119 N.J. at 224; see also id. at 223 (citing State v. Zola, 112 N.J. 384, 405 (1988)).\n\nJuror understanding of the distinctions among the several forms of homicide requires that the jury be permitted to make cross-references and comparisons of the several offenses during the course of its deliberations on ultimate guilt. The sequential, hierarchical instruction forecloses that kind of deliberative process by blocking concomitant consideration of the less serious manslaughter offenses; it has a strong capacity prematurely to induce a guilty verdict on the most serious form of homicide. When, as in this case, the most serious offense is capital murder, the sequential charge is fundamentally unfair.\n\nD\n\nIn sum, the trial court erred by failing to charge the jury in accordance with State v. Gerald, supra, 113 N.J. 40; by failing to charge sua sponte self-defense and passion-provocation manslaughter; and by giving a sequentialhomicide instruction when there was evidence of passion-provocation manslaughter. In my view, any and all of those errors mandate the reversal of defendant's murder conviction.\n\nIII.\n\nDefendant alleges that defense counsel's performance was deficient during various stages of his prosecution and severely\n\nprejudiced his case in violation of his right to counsel under the sixth amendment to the United States Constitution and article I, paragraph 10 of the New Jersey Constitution. The ineffectiveness of counsel, according to defendant, includes counsel's failure to investigate and present viable defenses at the guilt phase of the trial, and to present any semblance of a penalty-phase case. The Court, finding other grounds for reversals of guilt and penalty, treats those contentions dismissively. Defendant's complaint, in my opinion, is valid and underscores a profoundly troublesome aspect of this Court's attitude on appellate review toward claims of ineffective counsel. Its importance merits comment.\n\nIn actuality, ineffective-assistance-of-counsel claims are essentially allegations that the trial was unfair. \"The benchmark for judging any claim of ineffectiveness must be whether counsel's conduct so undermined the proper functioning of the adversarial process that the trial cannot be relied on as having produced a just result.\" Strickland v. Washington, 466 U.S. 668, 686, 80 L. Ed. 2d 674, 692-93, reh'g denied, 467 U.S. 1267, 82 L. Ed. 2d 864 (1984). In order to prevail defendant must show\n\nthat counsel's representation fell below an objective standard of reasonableness, Strickland, 466 U.S., at 688, 80 L. Ed. 2d 674, 104 S. Ct. 2052, and that there exists a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. Id. at 694, 80 L. Ed. 2d 674, 104 S. Ct. 2052.\n\n[Kimmelman v. Morrison, 477 U.S. 365, 375, 91 L. Ed. 2d 305, 319 (1986).]\n\nWe endorse that standard, State v. Fritz, 105 N.J. 42 (1987), and apply in it capital-murder prosecutions. State v. Davis, 116 N.J. 341 (1989). A strong presumption exists that counsel's conduct falls within the rangeof reasonable professional practices and tactical judgments, Strickland v. Washington, supra, 466 U.S. at 690, 80 L. Ed. 2d at 695, and, although a defendant bears the added burden of establishing the prejudicial impact of that dereliction on the ultimate verdict, that burden is removed in those cases where \"the level of counsel's participation makes\n\nthe idea of a fair trial a nullity . . . .\" State v. Davis, supra, 116 N.J. at 352 (citing United States v. Cronic, 466 U.S. 648, 80 L. Ed. 2d 657 (1984)).\n\nAt the guilt phase, defense counsel pursued a reasonable-doubt defense, arguing to the jury that the State could not prove defendant's guilt beyond a reasonable doubt. Defendant's lawyers sought to show that there were lies within defendant's statement itself and inconsistencies between it and the State's evidence, rendering it generally unreliable and unworthy of belief. In challenging that strategy on appeal, defendant points to the account of the killing contained in his own statement and asserts that the defense of self defense and the lesser offense of passion/provocation manslaughter are strongly supported thereby. See discussion, supra at (slip op. at 10-14). Defendant contrasts the strength of those theories against the weakness of the theory embraced -- that his statement was inconsistent with the remainder of the State's evidence. Furthermore, defendant argues that counsel's failure to gather readily-available evidence that would have made the chosen defense more tenable also demonstrates counsel's incompetence. Thus, the core of defendant's argument is that defense counsel's tactical decisionmaking at trial was unreasonable.\n\nWith respect to the penalty phase, defendant also argues that trial counsel's failure to investigate and present relevant mitigating evidence in the form of testimony of family members and school, military, and medical records detailing his troubled childhood and background violated his right to effective assistance of counsel. Apparently, only defendant's aunt was interviewed on the telephone by a defense investigator about a week before the trial began, and was prepared to tell the jury of defendant's learning disabilities and childhood neglect. Defendant also argues that other family members had relevant information about his upbringing, character, past experiences, relationships, and difficulties, but were never interviewed by counsel. He also identifies relevant documentary evidence,\n\nsome that trial counsel had in their possession but did not use, and some that appellate counsel obtained, that both complement his family's information and possess independent mitigating weight.\n\nThere was evidence of defendant's mental and academic deficiencies and his struggles with drug addiction, as well as military records that show that Perry was discharged from the Marine Corps due to his limited mental ability. Yet trial counsel did not have defendant evaluated by an expert. Appellate counsel obtained an evaluation from Dr. Bogacki, in whose opinion defendant is functionally illiterate and has low intellectual functioning and an underlying learning disability. Dr. Bogacki believed that \"the combination of cognitive, personality [] and substance abuse factors no doubt played a significant role in the emergence of antisocial patterns of behavior throughout [defendant's] lifetime.\"\n\nDefendant contends that all of the above information about his childhood experiences, mental and emotional deficits, and struggles with drug addiction had the capacity to engender sympathy, understanding, and mercy in the minds of the jurors, and that counsel's failure to investigate those sources of evidence thoroughly strip any decision not to present that material of the presumption of attorney reasonableness.\n\nIn State v. Savage, 120 N.J. 594, 625 (1990), this Court concluded that counsel had acted unreasonably in limiting investigation into potential mitigating evidence. There counsel presented two mitigating factors involving defendant's mental condition, yet conducted no investigation into that condition. Id. at 623-24. Nor did counsel explore obvious and available sources of information relevant to all five mitigating factors alleged. \"Counsel interviewed no potential witnesses with respect to defendant's background; he did not investigate, and hence presented no evidence regarding, defendant's education, religious or cultural influences, or employment history. In sum, counsel provided the jury with little or\n\nno evidence to find any mitigating factor.\" Id. at 624.\n\nIt may be that defendant's complaints do not approximate those engendered in Savage and that the merits of defendant's complaint cannot be resolved on this record. But defendant makes a plausible argument that he did not have sufficiently-skilled defense attorneys. This case underscores the inadequacies of the standards of professional competence required in a capital-murder prosecution. The basic test of professional competence seems to be that which is regarded as reasonable in terms of an average attorney or is measured by the task to be accomplished. The Court's definitions do not provide adequate guidance. Thus, in this case, counsel's problematic representation is equated with effective assistance of counsel apparently because his level of competence is average or ordinary.\n\nThat the Court's test for assessing attorney competence does not assure a sufficiently high level of attorney performance in the defense of a capital-murder prosecution is clear. The level of competence that suffices for general criminal defense work cannot satisfy the heightened fair-trial standards that apply to capital-murder prosecutions. State v. Savage, supra, 120 N.J. at 644 (Handler, J., concurring in part and dissenting in part). The exigencies of capital-murder prosecutions demand specialized competence on the part of counsel. State v. Oglesby, 122 N.J. 522, 544 (1991) (Handler, J., concurring); see the American Bar Association Guidelines for the Appointment and Performance of Counsel in Death Penalty Cases, Commentary to Guideline 1.1. Counsel in such cases must provide competence grounded in experience, training, and professional skill that will assure a defendant the full measure of all the heightened protections a capital-murder prosecution engenders. State v. Davis, supra, 116 N.J. at 402 (Handler, J., concurring in part and dissenting in part).\n\nThe substantial and numerous differences between capital and non-capital criminal prosecutions compel, as a matter of state constitutional law, the adoption of an enhanced standard by which to measure the competence of counsel and the degree of prejudice sufficient to find a violation of the right to such assistance. See State v. Oglesby, supra, 122 N.J. at 544-45 (Handler, J., concurring).\n\nThe enhanced level of professional performance demanded in capital prosecutions does not appear to have been achieved in this case. The Court's failure to acknowledge that should not engender judicial complacency with counsel's performance in such cases.\n\nIV.\n\nDefendant alleges that the cumulative effect of prosecutorial misconduct resulted in the denial of his right to a fair trial under the federal and state Constitutions. I agree with that contention, while the Court does not. Ante at (slip op. at 47-52). Defendant contends that that prosecutorial misconduct all related to the culpability of Clark Miller. He asserts that defendant was selectively prosecuted, while Miller's culpability was not investigated, and that defendant was further prejudiced by a Brady v. Maryland, 373 U.S. 83, 10 L. Ed. 2d 215 (1963) violation when the State failed to turn over to the defense the crucial portion of the report on Miller's polygraph wherein he makes inculpatory admissions. He also claims that the State's entire case was grounded on the \"fundamental misrepresentation\" that defendant alone had committed the crimes.\n\nAn overview of the evidence of Miller's involvement is instructive. On Sunday, March 2, 1986, Miller and Perry reported to police that they had found a body in the basement of Perry's house. The police interviewed both and noted a contradiction in their stories. Accordingly, each volunteered to submit to polygraph examinations. Perry was \"escorted immediately\"\n\nto the prosecutor's office that evening for that purpose. On invocation of his right to counsel the examination ceased. The following day, March 3, 1986, both men returned to the police administration building to be examined. Perry was taken to the scheduled examination and began the pre-test interview, but the test had to be cut short soon thereafter because he was intoxicated. He did tell Examiner Bandock during the pre-test interview that he and Miller together had boarded up 762 Division Street on the preceding Friday, that Miller financially supported his drug habit, and that the victim had been in 762 Division Street on prior occasions dealing drugs. Defendant was then transported to Cooper Medical Center for a \"sex kit\" test, but refused to wait and was taken back to the police administration building. The record does not disclose what Miller was doing in the meantime, but he was waiting at the police station when Perry returned and the two men left together.\n\nLater that day, Investigator Milbury received information from a teacher that two of his pupils had helped Perry secure the house. The two boys, Tory Hunt and Todd Lewis, confirmed that. Todd Lewis also said in his statement that Miller had been present when the work began at the house, and had watched as the basement door was being nailed shut. Troy Hunt said that he was sent to call Miller, and that Miller had arrived and watched Perry nail shut the basement door.\n\nOn the morning of March 4, 1986, Miller arrived for his polygraph and said that defendant would appear later but intended to first use drugs. Miller was sent back to Philadelphia to locate and deliver Perry to the police. He returned at approximately noon, unsuccessful.\n\nAt 12:04 p.m. on that date Miller was given a polygraph examination. In it, he stated that on Friday, February 28th, he had taken Perry to Camden to purchase drugs and had left him at 762 Division Street to inject those drugs. He returned on a call from a neighborhood boy to find defendant and two boys\n\nsecuring the front door and a window, later leaving with defendant. He did not return to the house until Sunday, at which time they found the body. On being informed that it was the examiner's opinion that he had not been entirely truthful, Miller admitted that he had not told the whole truth, that on Sunday defendant had asked him to help move the body, saying that \"if worse came to worse he would tell the police that he used him as a alibi and would take the weight himself and should have gotten rid of the body in his own way.\" Miller also admitted having purchased drugs from the victim in the past. Miller subsequently refused to answer any more questions.\n\nDefendant's statements during his polygraph examination that same afternoon, and his confession, offer conflicting versions of Miller's complicity. The statements range from Miller having done the killing by himself, to both of them doing it, to Perry alone being responsible. For example, Examiner Bandock noted that after he had determined that Perry was psychologically stressful, Perry first said that he had discovered the body in the house on Thursday and that he and Miller had nailed the door shut so it would not be discovered, planning to return on Sunday to dispose of it. He then said that Miller had showed him the body in the basement on Thursday and that the two men proceeded to hide the body in the corner of the basement. Perry next said that he wanted to tell the \"whole story\" and stated that Miller had killed Redd in the house on Thursday. Perry then admitted that he had killed Redd and that Miller had helped him hide the body. During the subsequent taped confession, Perry first stated that Miller was present and aided in hiding the body but later retracted that and indicated that Miller had not been involved.\n\nStatements of friends of the victim taken in the following week also relate to Miller. Walter Pitt stated that he saw the victim selling drugs at about midnight on that Thursday before leaving with defendant and Miller. He next saw defendant the following day at noon on the same corner selling the victim's coat to Charles Turner. Charles Turner, however, said he had\n\nbought the coat from Wayne Robinson at Robinson's house on Thursday at about 7:00 p.m., and that Robinson said he had bought it from Perry. Turner also said that he had seen Perry and Miller together buying drugs on the corner in the past. Tony Floyd said that on Thursday at about five or six in the evening he saw Redd talking to Perry and the \"white guy\" (Miller?) on the corner and that Redd left with them.\n\nTwo cell-mates of defendants gave statements that also implicate Miller. One was given by Leroy Harris in April 1986, prior to the Grand Jury proceeding. Harris, who testified at trial, said Perry told him that defendant and Miller had picked up Redd, defendant had killed him, and Miller had orchestrated the disguise of the body as \"a faggot\" and its concealment in the basement.\n\nAlthough defendant was charged with capital-murder and other serious substantive offenses, Miller was charged only as a material witness and with four counts of hindering apprehension. The cases against them were submitted to a Grand Jury, and Investigator Milbury testified to the details of the crime and investigation. The prosecutor told the Grand Jury at an initial session that he would \"tie up some loose ends together, specifically, with regard to the involvement of Clark Miller in the case.\" Milbury later testified that \"Mr. Miller was not involved in any way,\" and that with respect to Miller \"the State recommends a no bill on those charges because at this point we have no additional evidence that would indicate that he was involved.\" Miller was called to testify before the Grand Jury but declined to answer any questions.\n\nDefendant claims selective prosecution in that Miller, a \"similarly situated wrongdoer,\" was not indicted or prosecuted, and that the decision not to indict or prosecute was motivated by illegitimate racial considerations (he is black and Miller is white). He relies on this Court's expression of heightened concern regarding arbitrary action by the State in capital cases. See State v. Ramseur, supra, 106 N.J. at 324.\n\nConcededly, prosecutors have very broad discretion in determining whom to prosecute and whom not to prosecute, but may also have an obligation to exercise that discretion in good faith. State v. McCrary, 97 N.J. 132, 142 (1984); State v. Hermann, 80 N.J. 122, 127 (1979); State v. Laws, 51 N.J. 494, 510, cert. denied, 393 U.S. 971, 21 L. Ed. 2d 384 (1968); State v. Winne, 12 N.J. 152, 171 (1953). See ante at (slip op. at 11-14) (Stein, J., concurring in part and dissenting in part).\n\nRecently, in State v. Di Frisco, supra, 118 N.J. 253, the defendant argued that the prosecutor had abused his discretion in failing to investigate and prosecute a putative accomplice. Di Frisco confessed that he had done the killing at the behest of one Franciotti. Only Di Frisco was prosecuted for the crime. The Court noted that the defendant's claim that Franciotti should have been prosecuted rested on his assertion that the State's reasons for failing to prosecute lacked support. Id. at 267-68. The Court concluded that the State's belief that it had insufficient evidence to prosecute Franciotti was entitled to deference, given the scant evidence generated after some investigation.\n\nThe Court here concludes that defendant has similarly failed to overcome the presumption that the Government's abandonment of prosecution against Miller was a legitimate exercise of discretion. Ante at (slip op. at 50). It may be that defendant has not demonstrated prosecutorial selectivity for an illegitimate purpose. The critical point, however, is that the issue is presented and resolved exclusively on an ad hoc basis that in no way can ensure the objective and even-handed administration of capital-murder prosecutions. The vice in this case, and the flaw in the Court's acquiescence in the State's position, is the absence of any general, uniform standards that prosecutors must follow and apply in determining whether and against whom to mount a capital-murder prosecution. See, e.g., State v. Marshall, supra, 123 N.J. at 250-52 (Handler, J., dissenting); State v. Di Frisco, supra, 118 N.J. at 302-05 (Handler,\n\nJ., concurring in part and dissenting in part); State v. Matulewicz, supra, 115 N.J. 191, 204 (1989) (Handler, J., concurring); State v. McCrary, supra, 97 N.J. at 147-48 (Handler, J., concurring). \"The impression is unavoidable that there was scant basis in the accumulated evidence to distinguish this homicide as one warranting a capital prosecution.\" Ante at (slip op. at 14) (Stein, J., concurring in part and dissenting in part).\n\nAbsent clear uniform standards to guide -- and explain the exercise of prosecutorial discretion, the capital prosecution of one of two or more similarly-situated or equally-culpable perpetrators constitutes improper discriminatory prosecution. Given the heightened protections standards accorded a capital defendant, that kind of error violates fundamental fairness.\n\nV.\n\nFor the reasons expressed, I dissent in part from the Court's opinion and judgment.\n\n",
    "body_length": 149861,
    "citedas": [
      "590 A.2d 624",
      "124 N.J. 128"
    ],
    "attorneys": "Katherine F. Graham, Designated Counsel, and Mark H. Friedman, Assistant Deputy Public Defender, argued the cause for appellant (Wilfredo Caraballo, Public Defender, attorney; Mr. Friedman, Ms. Graham, and Patricia Anne Kern, Designated Counsel, of counsel and on the briefs). Linda A. Rinaldi, Deputy Attorney General, argued the cause for respondent (Robert J. Del Tufo, Attorney General of New Jersey, attorney).",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "The opinion of the Court was delivered by Garibaldi, J. Chief Justice Wilentz and Justices Clifford, Pollock, and O'Hern join in this opinion. Justices Stein and Handler have filed separate opinions, concurring in part and dissenting in part.",
    "citation_count": 135
  }
}
