{
  "id": "toqbQGYBTlTomsSBXrc3",
  "document": {
    "title": "Church of Scientology Flag Service Org. Inc. v. City of Clearwater",
    "full_title": "CHURCH OF SCIENTOLOGY FLAG SERVICE ORG., INC. v. CITY OF CLEARWATER, MILTON A. GALBRAITH, JR., CITY ATTORNEY OF THE CITY OF CLEARWATER, CYNTHIA E. GOUDEAU, CITY CLERK OF THE CITY OF CLEARWATER .",
    "jurisdiction": "Eleventh Circuit",
    "date": "1993-09-30T00:00:00.000Z",
    "docket": "No. 91-3988.",
    "body": "DUBINA, Circuit Judge:\n\nThis appeal involves a challenge to an ordinance regulating the solicitation of funds by charitable organizations in the City of Clearwater, Florida (\"Clearwater\"). Plaintiff Church of Scientology Flag Service Organization, Inc. (\"Scientology\") claims that the ordinance deprives it of rights and liberties guaranteed by the First and Fourteenth Amendments of the Constitution of the United States in violation of 42 U.S.C. § 1983. Scientology appeals the district court's order granting summary judgment to the defendants (collectively \"the City\")\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and denying summary judgment to Scientology. Church of Scientology Flag Servs. Org. v. City of Clearwater, 756 F. Supp. 1498 (M.D.Fla.1991). We affirm in part, vacate in part, reverse in part and remand.\n\nI. BACKGROUND\n\nScientology, a worldwide organization, maintains one of the largest centers of its activities in Clearwater. The history, organization, doctrine and practices of Scientology have been thoroughly recounted in numerous judicial decisions. See, e.g., Hernandez v. Commissioner, 490 U.S. 680, 684-86, 109 S. Ct. 2136, 2141, 104 L. Ed. 2d 766 (1989); Church of Scientology v. Commissioner, 823 F.2d 1310, 1313-14 (9th Cir.1987), cert. denied, 486 U.S. 1015, 108 S. Ct. 1752, 100 L. Ed. 2d 214 (1988); Founding Church of Scientology v. United States, 133 U.S. App. D.C. 229, 409 F.2d 1146, 1151-52 (D.C.Cir.), cert. denied, 396 U.S. 963, 90 S. Ct. 434, 24 L. Ed. 2d 427 (1969), and on remand, United States v. Article or Device Hubbard Electrometer, 333 F. Supp. 357 (D.D.C.1971); Christofferson v. Church of Scientology, 57 Or.App. 203, 644 P.2d 577, 580-81, pet'n denied, 293 Ore. 456, 650 P.2d 928 (1982), and cert. denied, 459 U.S. 1206, 103 S. Ct. 1196, 75 L. Ed. 2d 439 (1983).\n\nWe need not reiterate this background because the district court found that no genuine factual issues existed to dispute Scientology's claim of being a bona fide religion. See 756 F. Supp. at 1502-04. The district court granted partial summary judgment to Scientology on that issue. Id. at 1532; accord Founding Church of Scientology, 409 F.2d at 1160; Christofferson, 644 P.2d at 600-01. As the City has neither appealed from that order nor argued that Scientology is not entitled to protection under the religion clauses of the First Amendment, we must assume that the district court was correct. In addition, without deciding the question ourselves, we note that research has not uncovered any holdings that Scientology is not a religion for First Amendment purposes. But Cf. Church of Scientology v. Commissioner, 823 F.2d at 1316-18 (upholding Tax Court determination that Church of Scientology was not entitled to religious tax exemption under 26 U.S.C. § 501(c)(3) for certain years because its revenues inured to the benefit of individuals and non-religious entities).\n\nII. PROCEDURAL HISTORY\n\nIn 1983 the City enacted Ordinance No. 3091-83 (the \"1983 Ordinance\"). The 1983 Ordinance imposed substantial recordkeeping and disclosure requirements for all charities and religious organizations soliciting funds in Clearwater. Scientology filed an action in the district court seeking an injunction against its enforcement. That action was consolidated with a similar case brought by Americans United for Separation of Church and State, Inc. (\"Americans United\"). Before the district court could rule on the law's validity, however, the City enacted Ordinance No. 3479-84 (the \"1984 Ordinance\"), repealing and modifying the 1983 Ordinance in part. Clearwater, Fla., Code Ordinances, tit. VIII, § 100 (1984) (hereinafter \"Code § /--\"). Both plaintiffs filed new lawsuits to challenge the revised ordinance and its 1983 predecessor.\n\nIn the second Scientology suit, the district court ruled the 1983 Ordinance unconstitutional on its face and permanently enjoined the City from enforcing it. The court further ruled the 1984 version facially valid, without reaching the question of its validity as applied to Scientology and Americans United. The City appealed the former ruling and Scientology and Americans United were permitted to file interlocutory cross-appeals of the latter. We vacated the former as moot, reasoning that challenges to the repealed 1983 Ordinance posed no live controversy suitable for judicial resolution. Church of Scientology Flag Serv. Org. v. City of Clearwater, 777 F.2d 598, 604-06 (11th Cir.1985), cert. denied, 476 U.S. 1116, 106 S. Ct. 1973, 90 L. Ed. 2d 656 (1986) (hereinafter Scientology-Clearwater I), overruled, Northeastern Fla. Chapter of Associated Gen. Contractors of Am. v. City of Jacksonville, U.S., 113 S. Ct. 2297, 2301, 124 L. Ed. 2d 586 (1993). We dismissed the interlocutory cross-appeals as improvidently granted, finding nothing in the record to support (or controvert) a conclusion that the plaintiffs possessed a sufficient interest in the outcome of the litigation to confer standing. Scientology-Clearwater I, 777 F.2d at 607. But see Pennell v. City of San Jose, 485 U.S. 1, 7-8, 108 S. Ct. 849, 855, 99 L. Ed. 2d 1 (1988) (holding that allegations of complaint should be accepted as true and construed in favor of standing when there is no factual record). We also affirmed the district court's denial of preliminary injunctive relief. 777 F.2d at 608.\n\nScientology continued to prosecute its second action challenging the 1984 Ordinance. Scientology also petitioned for leave to amend the complaint in its first pending action to challenge the new 1984 law. The district court apparently did not rule on that petition but rather proceeded to address the merits in the second Scientology case. Upon granting summary judgment to the City in that second case, from which this appeal followed, the district court dismissed with prejudice the earlier action for want of prosecution. The court also denied Scientology's request for attorney fees in the first action. In Church of Scientology Flag Service Organization v. City of Clearwater, 777 F.2d 598 (11th Cir.1993) (hereinafter Scientology-Clearwater II), this panel vacated the district court's denial of attorney fees in the first filed action.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nHaving found that Scientology had standing to sue in the second action, the district court further found the 1984 Ordinance constitutional, both on its face and as applied to Scientology, and therefore granted the City's motion for summary judgment and denied Scientology's cross-motion for summary judgment. Scientology then perfected this appeal.\n\nIII. THE ORDINANCES\n\nThe 1984 Ordinance, like its 1983 predecessor, is designed to regulate the solicitation of contributions within Clearwater by \"charitable organizations,\" a term that includes religious groups. Code § 100.01(1). The regulated \"solicitation of funds\" is defined to mean:\n\nany request, within the City of Clearwater, for the donation of money, property, or anything of value ...; or the selling or offering for sale of any property, real or personal ..., whether of value or not, including but not limited to, goods, books, pamphlets, tickets, publications or subscriptions to publications, upon the representation, express or implied, that the proceeds of such sale will be used for a charitable purpose.\n\nCode § 100.01(2) (emphasis added). \"Expressly excluded from the meaning of \"solicit funds' ... is any offer of membership in any charitable organization.\" Id. As Scientology points out, virtually any sale of religious literature carries the implied representation that the proceeds will be used to further the seller's purposes or, at least, to \"benefit\" the organization. (Appellant's Br. at 34-35). In essence, therefore, all speech that is not delivered gratis will subject a charitable organization to regulation. An organization is exempt, however, if it is all-volunteer and/or small in scale. Code § 100.02(1). A similar exemption applies to all-volunteer scholarship organizations. Code § 100.02(2).\n\nThe 1984 Ordinance is a licensing statute that requires charitable organizations to disclose certain information about themselves, their officers and the methods and purposes of the solicitation. A non-exempt organization that solicits without obtaining an annual registration certificate from the city clerk commits a criminal offense. Code § 100.05(1)(i). To obtain that certificate, an organization must file a registration form with the clerk. The form is a public document, Code § 100.03(7), submitted under oath, which must disclose among other things:\n\n(a) The name of the person registering and desiring to solicit funds for charitable purposes.\n\n(b) Whether the person registering is a natural person, partnership, corporation, or association and...\n\n(c) A reference to all determinations of tax-exempt status under the Internal Revenue Code of the United States and law of any state, and the laws of any county or municipality.\n\n(d) A brief description of the charitable purpose for which the funds are to be solicited, and a brief explanation of the intended use of the funds toward that purpose.\n\n(e) The names, mailing addresses and telephone numbers of all individuals authorized to disburse the proceeds of the solicitation.\n\n(f) The names, mailing addresses and telephone numbers of all individuals who will be in direct charge or control of the solicitation of funds.\n\n(g) The time period within which the solicitation of funds is to be made....\n\n(h) A brief description of the methods and means by which the solicitation of funds is to be accomplished.\n\n(i) An estimated schedule of salaries, wages, fees, commissions, expenses and costs to be expended and paid in connection with the solicitation of funds and in connection with their disbursement, and an estimated percentage of the total projected collections which the costs of the solicitation will comprise.\n\n(j) The names of any other cities in Florida in which the person registering has collected funds for charitable purposes within the past five (5) years....\n\n....\n\n(m) The names of any officer ... or any current agent or employee engaging in the solicitation of funds who has been convicted of a felony or a misdemeanor involving moral turpitude within the past seven (7) years, the nature of the offense, the State in which the conviction occurred, and the year of such conviction.\n\n(n) A brief explanation of the reasons, if the person registering is unable to provide any of the foregoing information, why such information is not available.\n\nCode § 100.03(1) (emphasis added). This information is virtually identical to the disclosure required under the ordinance upheld against facial attack on free exercise and associational privacy grounds in International Society for Krishna Consciousness v. City of Houston, 689 F.2d 541, 559-61 (5th Cir. Unit A 1982) (hereinafter ISKCON-Houston), although, as discussed below, there are significant differences between the Clearwater and Houston laws.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nUnlike the Houston submission, the Clearwater form must be filed even if the organization intends to solicit only from its own members, although the form may omit certain information \"regarding the solicitation of funds from members,\" provided it so states. Code § 100.02(3). Thus, as we read the Clearwater ordinance, an organization soliciting only from its members may omit the information required by subsections (d) through (i) of Code § 100.03(1). Nevertheless, even when no public solicitation is planned, subsections 100.03(1)(a), (b), (c), (j) and (n) of the code require an organization publicly to disclose significant information, namely the nature and identity of the organization, its tax-exempt status, the detailed criminal histories of its officers and solicitors, the names of other Florida cities in which it has registered and an explanation why any of the foregoing information is unavailable.\n\nThe City's law also requires organizations omitting information from the registration form to prepare a sworn \"private statement at least annually that contains all of the information\" that otherwise would be required in the registration form. Code § 100.02(3)(b). The organization must maintain the records used to complete the private statement for at least three years \"and, together with the private statement, make[ ] them reasonably available for inspection by every member of the charitable organization.\" Code § 100.02(3)(c). Wilful failure to prepare a truthful private statement, maintain the records or make the statement and records available to members is a criminal offense. Code § 100.05(1)(k). The same supporting documentation must be maintained when the organization files a public registration form, Code § 100.04, and failure to do so is also an offense, Code § 100.05(1)(j).\n\nAt the end of each annual registration period the organization must file a retrospective reporting statement giving \"the full amount of money and property collected\" in Clearwater and \"a complete list of any and all expenses incurred in procuring those funds ... broken down into salaries, wages, fees, commissions, advertising and all other expenses.\" Code § 100.03(8). The organization must reveal \"the bank, if any, where the proceeds of those solicitations of funds were placed\" and the \"actual or proposed utilization in approximate amounts of the said proceeds,\" id., and maintain supporting documentation for three years, Code § 100.04. Information about solicitations from members may be omitted on the same terms as the omission of similar information from the registration form, namely, upon condition that the organization prepare a \"private statement\" subject to disclosure along with supporting documentation upon request by a member, failure to prepare or disclose the materials being a criminal offense. Code § 100.02(3). Wilful failure to file truthful registration forms and retrospective annual statements is also an offense. Code § 100.05(1)(b). These provisions for retrospective disclosure differ from the Houston ordinance by (1) requiring detailed disclosure of the expenses incurred in the solicitation, (2) requiring disclosure of the bank account in which funds are located, (3) requiring disclosure of every proposed or actual use of the funds, (4) requiring the maintenance of supporting documentation for three years, (5) applying themselves to membership solicitations, and (6) imposing criminal penalties.\n\nThe Clearwater ordinance defines a number of other criminal offenses, including:\n\n(a) wilfully using any solicited funds or soliciting or retaining funds to support or execute any conduct that is criminal or illegal under the laws of the [city, county, state, or federal government];\n\n(c) using any scheme or artifice to defraud or obtain money or property by means of any false statement or representation;\n\n(d) wilfully concealing the identity of an organization on whose behalf solicitations are being made;\n\n(e) knowingly misrepresenting that the proceeds of any solicitation of funds, under current law, would entitle the donor to a Federal or State income tax deduction;\n\n(f) promising any person that the proceeds of a solicitation of funds will be refunded upon request, and thereafter wilfully failing within 60 days to make a refund that has been requested in writing;\n\n(g) promising any person that refunds of the proceeds of the solicitation of funds will be made upon request without providing such person, at the time such representation is made, with a written statement of the terms and conditions upon which refunds are made; provided, however, that any statement made in good faith at the time is not prohibited by this section;....\n\nCode § 100.05(1). All offenses under the law are punishable by a fine of up to $1,000 and/or imprisonment for up to six months. Code § 100.05(2). No such criminal provisions were included in the Houston ordinance.\n\nThe city clerk has power to review the registration form to determine whether it meets the ordinance's requirements and may deny registration if she determines that it does not. The clerk testified that she and her staff would exercise their personal judgment, under the direction of the city attorney, to decide whether a given response was adequate. For example, she and the city attorney would determine whether the stated purpose of the solicitation was in fact a charitable one. [R5-110-Tab 2-Exh. A-46-49.] In addition, although the statute provides no guidance on the subject, the city attorney testified that a general statement along the lines of \"We are a benevolent society and we will use [the funds] as our governing board decides is within our purposes\" would not provide adequate information to satisfy the requirements of Code § 100.03(1)(d). He was unable to say, however, whether a statement like \"We are a church and we will use [the funds] for general church purposes\" would be sufficiently specific. [R5-110-Tab 2-Exh. B-49.]\n\nWhatever level of detail would meet the city officials' standards concerning disclosure of charitable purpose, we may presume that they require a more specific explanation of how the funds will be used to further the purposes stated. In these respects the Clearwater ordinance confers broader executive discretion than the Houston law, which the Fifth Circuit interpreted as conferring only the ministerial authority to determine \"two objective facts: (1) whether information is provided, and (2) whether an explanation for failure to supply the information is provided,\" ISKCON-Houston, 689 F.2d at 547. The City of Houston had adopted an interpretation of the law giving the administering official no discretion to evaluate the adequacy of information provided by registrants. For example, any question about the required detail of disclosure concerning the purposes of solicitation would have been resolved in the registrant's favor. Id. at 555.\n\nIf the city clerk denies registration, the organization may still continue to solicit in Clearwater. The clerk must initiate a declaratory judgment action in state circuit court to \"review\" her decision. Code § 100.03(3). Presumably the court may set aside the denial if it finds the clerk acted improperly, but neither the ordinance nor the Florida declaratory judgment act provides express criteria by which the decision should be judged. The ordinance also permits the court to dispense with the requirement of furnishing information whose disclosure it finds to constitute a \"special or unique hardship to the charitable organization.\" Code § 100.03(4). Again, no further express guidance is offered.\n\nUpon receiving ten \"bona fide complaints,\" sworn in writing and suggesting that an offense has occurred, the city attorney may investigate.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The attorney may subpoena witnesses and documents, including \"private statements\" and the documentation supporting them. Upon investigation, and having found probable cause to believe that an offense has occurred, the attorney \"shall\" institute a prosecution. Code § 100.06. We note that these provisions entitle the city attorney to obtain the so-called \"private\" statements (and all of the supporting records), and presumably treat them as public documents, in the course of an investigation or prosecution to determine whether an organization was entitled to omit the specified information from its public registration form.\n\nThe ordinance has an express severability clause. 1984 Ordinance § 10.\n\nIV. ISSUES\n\nWe confront several complex issues in this appeal. First, Scientology argues that there are sufficient facts in dispute to preclude summary judgment on its claim that the 1984 Ordinance (like its 1983 predecessor) was enacted for the impermissible purpose of discriminating against it in favor of more popular religious organizations. Second, Scientology contends that, as a matter of law, the disclosure requirements applicable to solicitations of members and the public constitute an impermissible government \"entanglement\" in matters of ecclesiastical authority and governance in violation of the Establishment Clause. Although Scientology contends that such excessive entanglements may not be justified by resort to the balancing of compelling governmental interests that is applicable in other areas of constitutional law, it further contends that this disclosure of information concerning member solicitation is not narrowly tailored to serve such an interest. Third, Scientology argues that the ordinance is vague and confers overly broad discretion upon the city clerk to deny a registration certificate, thereby imposing an impermissible prior restraint upon its exercise of religion. Finally, Scientology argues that the requirements of providing a refund policy in writing and making refunds within sixty days also represent impermissible invasions of church governance and religious practice.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAfter considering the question of standing, we address these issues in turn.\n\nV. STANDING\n\nScientology is a charitable organization as defined under the 1984 Ordinance and is subject to direct regulation thereunder. As already detailed, the regulation is substantial and, accordingly, represents a sufficiently direct injury to Scientology to confer standing. The injury is caused by the City's ordinance (in other words, the injury is fairly traceable to the challenged conduct) and would be redressed by invalidation of the regulatory scheme. Therefore, Scientology meets the \"case\" or \"controversy\" requirements for standing imposed by Article III of the Constitution. See California Bankers Ass'n v. Shultz, 416 U.S. 21, 44-45, 68-69, 76, 94 S. Ct. 1494, 1509, 1521, 1524-25, 39 L. Ed. 2d 812 (1974). Moreover, it is well settled that \"a party may challenge a licensing statute regardless of whether he or she was denied a permit, or whether one has ever been sought.\" Fernandes v. Limmer, 663 F.2d 619, 625 (5th Cir. Unit A Dec. 1981), cert. dismissed, 458 U.S. 1124, 103 S. Ct. 5, 73 L. Ed. 2d 1395 (1982); see also, e.g., Shuttlesworth v. City of Birmingham, 394 U.S. 147, 151, 89 S. Ct. 935, 938, 22 L. Ed. 2d 162 (1969).\n\nScientology's interest in avoiding challenged regulation is greater than the minimum interest in the outcome of a lawsuit required for standing. Just as the Establishment Clause \"does not depend upon any showing of direct governmental compulsion and is violated by the enactment of laws which establish an official religion whether those laws operate directly to coerce nonobserving individuals or not,\" Engel v. Vitale, 370 U.S. 421, 430, 82 S. Ct. 1261, 1267, 8 L. Ed. 2d 601 (1962), so also does the clause prohibit the casting of official disfavor upon a particular sect even though its members are not directly regulated. Religious groups and their members that are singled out for discriminatory government treatment by official harassment or symbolic conduct analogous to defamation have standing to seek redress in federal courts. Church of Scientology v. Cazares, 638 F.2d 1272, 1279-80 (5th Cir.1981); see also, e.g., Allen v. Wright, 468 U.S. 737, 755, 104 S. Ct. 3315, 3326, 82 L. Ed. 2d 556 (1984) (noting that stigmatic injury associated with invidious official conduct is cognizable for standing purposes if the plaintiff is directly affected).\n\nThe question of standing is distinct from the broader issues concerning the merits of Scientology's case. Therefore, we would not require Scientology to prove that it is a bona fide religion entitled to First Amendment protection in order to obtain standing, any more than we would require a contract claimant to demonstrate that it is a party to a valid agreement before invoking jurisdiction in an ordinary private law dispute. See Larson v. Valente, 456 U.S. 228, 254 n. 30, 102 S. Ct. 1673, 1689 n. 30, 72 L. Ed. 2d 33 (1982) (finding standing to challenge regulation, but noting \"nothing in our opinion suggests that appellants could not ... put the Church to the proof of its bona fides as a religious organization\"). Moreover, in our view the facts considered by the district court, 756 F. Supp. at 1509-11, provide much more than \"a sufficiently strong demonstration that [Scientology] is a religion to overcome any prudential standing obstacles to consideration of [its] Establishment Clause claim\" and its free exercise claim, Valente, 456 U.S. at 244 n. 16, 102 S. Ct. at 1683 n. 16, assuming for present purposes that such a prudential obstacle exists.\n\nNevertheless, we do not accept the district court's application of the \"zone of interests\" requirement for standing to raise a First Amendment challenge under § 1983, see 756 F. Supp. at 1509-12. The requirement that \"the interest sought to be protected by the complainant [must be] arguably within the zone of interests to be protected or regulated by the statute or constitutional guarantee in question,\" Association of Data Processing Serv. Orgs. v. Camp, 397 U.S. 150, 153, 90 S. Ct. 827, 830, 25 L. Ed. 2d 184 (1970) (emphasis added) (hereinafter ADAPSO), was first developed as a limitation on judicial review of agency action under the Administrative Procedure Act (\"APA\"). The APA provides that a plaintiff must be adversely affected by challenged action \"within the meaning of a relevant statute.\" 5 U.S.C. § 702. The Supreme Court has used a similar standard to determine whether particular federal statutes create actionable \"rights\" under § 1983, which creates a federal cause of action for \"the deprivation of any rights, privileges, or immunities secured by the Constitution and laws.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The Court has undertaken the same zone of interests inquiry to determine whether a particular constitutional provision creates rights intended by Congress to be enforceable under § 1983.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe zone of interest requirement is a prudential standing doctrine, not mandated directly by Article III. Allen v. Wright, 468 U.S. at 751, 104 S. Ct. at 3324; Valley Forge Christian College v. Americans United for Separation of Church and State, 454 U.S. 464, 474-75, 102 S. Ct. 752, 760, 70 L. Ed. 2d 700 (1982). Whatever the nature of the inquiry in the absence of congressional legislation, the Court's precedents show that the zone of interests analysis under § 1983 is limited to ascertaining whether the substantive constitutional or statutory provision confers rights intended by the legislature to be enforceable under the remedial statute. See also Holmes v. Securities Investor Protection Corp., U.S., 112 S. Ct. 1311, 1328, 117 L. Ed. 2d 532 (1992) (Scalia, J., concurring) (zone of interests test is an \"element of statutory standing\"). The test does not require the plaintiff to show an identifiable \"legal interest\" that may entitle him to relief. ADAPSO, 397 U.S. at 153-56, 90 S. Ct. at 830-31; see also Clarke v. Securities Indus. Ass'n, 479 U.S. 388, 399-400, 107 S. Ct. 750, 757, 93 L. Ed. 2d 757 (1987); Valente, 456 U.S. at 254 n. 30, 102 S. Ct. at 1689 n. 30. The test requires only that the relationship between the plaintiff's alleged interest and the purposes implicit in the substantive provision be more than \"marginal[ ].\" Securities Indus. Ass'n, 479 U.S. at 399, 107 S. Ct. at 757.\n\nTherefore the district court erred when it investigated the merits of Scientology's claim by evaluating whether it is in fact a religion. Moreover, it is clear that the First Amendment creates enforceable \"rights\" under § 1983. Any citizen's interest in preventing violations of those rights is more than marginally related to the constitutional provision, which protects the public at large as well as the individual plaintiff from government invasion of religious, political and intellectual activity, although requirements other than the zone of interests test may preclude a finding of standing. Cf. Valley Forge, 454 U.S. at 478-87, 102 S. Ct. at 762-67 (holding citizens' generalized interest in preventing establishment of religion by federal government insufficient to confer standing without allegations that tax funds were improperly collected or expended by Congress). See generally Warth v. Seldin, 422 U.S. 490, 501, 95 S. Ct. 2197, 2206, 45 L. Ed. 2d 343 (1975). Thus, the complaint on its face alleges interests within the zone arguably protected by the constitutional provision. Since we have already held that all other requirements are satisfied, Scientology has standing.\n\nVI. STANDARD OF APPELLATE REVIEW\n\nA motion for summary judgment may be granted only if no genuine dispute remains as to any material fact and the moving party is entitled to judgment as a matter of law. Fed.R.Civ.P. 56(c). As with all questions of law, we review the district court's order granting summary judgment under the de novo standard of review. See Woodruff v. United States Dep't of Labor, 954 F.2d 634, 636 (11th Cir.1992) (per curiam).\n\nThe moving party bears the initial burden to show the district court, by reference to materials on file, that there are no genuine issues of material fact that should be decided at trial. Only when that burden has been met does the burden shift to the non-moving party to demonstrate that there is indeed a material issue of fact that precludes summary judgment.\n\nClark v. Coats \u0026 Clark, Inc., 929 F.2d 604, 608 (11th Cir.1991). With these principles in mind, we address the contentions of the parties.\n\nVII. DISCRIMINATORY PURPOSE\n\nUnder the Establishment Clause jurisprudence which has followed Lemon v. Kurtzman, 403 U.S. 602, 91 S. Ct. 2105, 29 L. Ed. 2d 745 (1971), courts undertake a three-part analysis of challenged legislation. \"First, the statute must have a secular legislative purpose; second, its principal or primary effect must be one that neither advances nor inhibits religion...; finally, the statute must not foster \"an excessive government entanglement with religion.' \" 403 U.S. at 612-13, 91 S. Ct. at 2111 (citations omitted). Only if all three criteria are satisfied may the law be upheld. As the district court correctly recognized, \"the three-part Lemon test remains the basic standard of judicial review in Establishment Clause cases.\" 756 F. Supp. at 1513; see, e.g., Hernandez, 490 U.S. at 695-96 \u0026 n. 11, 109 S. Ct. at 2146-47 \u0026 n. 11.\n\nA. Standard of Judicial Review\n\nJudicial review of governmental purpose is deferential. \"A religious purpose alone is not enough to invalidate an act of a state legislature. The religious purpose must predominate.\" Edwards v. Aguillard, 482 U.S. 578, 599, 107 S. Ct. 2573, 2586, 96 L. Ed. 2d 510 (1987) (Powell, J., concurring) (citations omitted). Thus, a statute is invalid only if it \"does not have a clearly secular purpose.\" Wallace v. Jaffree, 472 U.S. 38, 56, 105 S. Ct. 2479, 2489-90, 86 L. Ed. 2d 29 (1985) (emphasis added); see, e.g., Church of Scientology v. Commissioner, 823 F.2d at 1321. Nevertheless, the City cannot overcome the first Lemon prong merely by articulating a legitimate purpose. \"No legislative recitation of a supposed secular purpose can blind us\" to an enactment's \"pre-eminent purpose.\" Stone v. Graham, 449 U.S. 39, 41, 101 S. Ct. 192, 194, 66 L. Ed. 2d 199 (1980) (per curiam).\n\nInquiry into legislative purpose begins with interpreting the law itself. \"The plain meaning of the statute's words, enlightened by their context and the contemporaneous legislative history [or explained by the interpretation of a responsible administrative agency], can control the determination of legislative purpose.\" Aguillard, 482 U.S. at 594, 107 S. Ct. at 2583 (citations omitted). If the legislature's stated purpose is not actually furthered by the enactment then that purpose is disregarded as being insincere or a sham. Id., 482 U.S. at 586-87, 107 S. Ct. at 2579. Even if the proffered purpose is not a sham, the court must evaluate the effect of the statute's provisions and \"consider[ ] the historical context of the statute ... and the specific sequence of events leading to [its] passage ...,\" id., 482 U.S. at 595, 107 S. Ct. at 2583 (citations omitted); see, e.g., Jaffree, 472 U.S. at 59-60, 105 S. Ct. at 2491; Valente, 456 U.S. at 253-55, 102 S. Ct. at 1688-89; see also Village of Arlington Heights v. Metropolitan Hous. Dev. Corp., 429 U.S. 252, 267, 97 S. Ct. 555, 564, 50 L. Ed. 2d 450 (1977) (noting that Fourteenth Amendment challenge invokes inquiry into \"historical background\" and \"specific sequence of events\" preceding enactment); Hunter v. Underwood, 471 U.S. 222, 228, 105 S. Ct. 1916, 1920, 85 L. Ed. 2d 222 (1985); cf. County of Allegheny v. American Civil Liberties Union, 492 U.S. 573, 606, 109 S. Ct. 3086, 3107, 106 L. Ed. 2d 472 (1989) (applying the effects criterion of Lemon by evaluating the \"particular contexts\" in which the government acts).\n\nA statute in which an impermissible purpose predominates is invalid even if the legislative body was motivated in part by legitimate secular objectives. Thus, for example, even if the ordinance in fact furthers a secular purpose, the \"actual purpose\" may in certain cases be found by asking \"whether the government intends to convey a message of endorsement or disapproval of religion,\" Lynch v. Donnelly, 465 U.S. 668, 690-91, 104 S. Ct. 1355, 1368, 79 L. Ed. 2d 604 (1984) (O'Connor, J., concurring). See Jaffree, 472 U.S. at 56, 105 S. Ct. at 2489-90.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e If the \"pre-eminent purpose\" is illicit then the law is void. Stone, 449 U.S. at 41, 101 S. Ct. at 194.\n\nAlthough the Court stated in Bowen v. Kendrick, 487 U.S. 589, 108 S. Ct. 2562, 101 L. Ed. 2d 520 (1988), that a statute is void only if \"motivated wholly by an impermissible purpose,\" 487 U.S. at 602, 108 S. Ct. at 2570 (emphasis added), we do not believe that this statement was intended to overrule the \"predominate\" standard of Aguillard, the \"clearly secular\" standard of Jaffree or the \"pre-eminent\" standard of Stone. First, the statement in Kendrick was dictum. \"The [statute] was motivated primarily, if not entirely, by a legitimate secular purpose.\" Kendrick, 487 U.S. at 602, 108 S. Ct. at 2571 (emphases added). Second, we do not believe the Court would have overruled the principle of deferential yet searching analysis applied to questions of legislative purpose so recently (in Aguillard and Jaffree) and so broadly (for example, in Underwood and Metropolitan Housing) without explicitly acknowledging its intention to do so. Instead, the Court simply cited Donnelly and Stone with apparent approval. See Kendrick, 487 U.S. at 602, 108 S. Ct. at 2570. Third, the Court's statement in Stone that \"Kentucky's statute requiring the posting of the Ten Commandments in public schoolrooms had no secular legislative purpose, and is therefore unconstitutional,\" 449 U.S. at 41, 101 S. Ct. at 193 (emphasis added), does not represent a holding that any secular purpose is sufficient to validate an enactment. Cf. Stone, 449 U.S. at 43-47, 101 S. Ct. at 195-96 (Rehnquist, J., dissenting) (arguing that teaching children about the secular significance of the Ten Commandments is a sufficient legislative purpose). Finally, adopting the standard suggested by the Kendrick dictum would make Lemon 's purpose criterion a virtual dead letter, for \"rarely can it be said that a legislature or administrative body operating under a broad mandate made a decision motivated solely by a single concern ...,\" Metropolitan Housing, 429 U.S. at 266, 97 S. Ct. at 563.\n\nInexplicably, the City continues to argue that its purpose in enacting the ordinances is irrelevant to Scientology's allegation of an Establishment Clause violation. (Appellees' Br. at 48). As discussed above, the Supreme Court has unmistakably rejected this contention, most recently in Hernandez, in which the Court invoked the test of whether the challenged law \"was born of animus to religion in general or Scientology in particular.\" 490 U.S. at 696, 109 S. Ct. at 2147. The cases relied upon by the City, Palmer v. Thompson, 403 U.S. 217, 224-26, 91 S. Ct. 1940, 1944-45, 29 L. Ed. 2d 438 (1971) (upholding against equal protection challenge city decision to close swimming pools rather than operate them on racially integrated basis), and United States v. O'Brien, 391 U.S. 367, 382-86, 88 S. Ct. 1673, 1682-84, 20 L. Ed. 2d 672 (1968) (upholding against free speech challenge federal statute prohibiting burning of draft card), are obviously distinguishable, as neither involved a claim arising under the Establishment Clause. Contrary to the dictum of Palmer that judicial invalidation of a law on the basis of improper legislative purpose might be \"futile\" because the statute \"would presumably be valid as soon as the legislature or relevant governing body repassed it for different reasons,\" 403 U.S. at 225, 91 S. Ct. at 1945, the requirement that a court entertaining an Establishment Clause challenge must consider \"the specific sequence of events leading to [re-]passage of the statute,\" Aguillard, 482 U.S. at 595, 107 S. Ct. at 2583, embodies a sensitivity to the political realities of the legislative process that is amply refined to discern such a crude attempt to circumvent federal judicial determination.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFurthermore, Palmer 's holding simply has not withstood the test of time, even in the Fourteenth Amendment equal protection context. See, e.g., Personnel Adm'r v. Feeney, 442 U.S. 256, 99 S. Ct. 2282, 60 L. Ed. 2d 870 (1979) (sex discrimination); Washington v. Davis, 426 U.S. 229, 96 S. Ct. 2040, 48 L. Ed. 2d 597 (1976) (race discrimination); see also City of Mobile v. Bolden, 446 U.S. 55, 100 S. Ct. 1490, 64 L. Ed. 2d 47 (1980) (race discrimination under Fourteenth and Fifteenth Amendments). \"Once racial discrimination is shown to have been a \"substantial' or \"motivating' factor behind enactment of the law, the burden shifts to the law's defenders to demonstrate that the law would have been enacted without this factor.\" Underwood, 471 U.S. at 228, 105 S. Ct. at 1920. The Court's 1968 decision in O'Brien, holding in the free speech context \"that this Court will not strike down an otherwise constitutional statute on the basis of an alleged illicit motive,\" 391 U.S. at 383, 88 S. Ct. at 1682, may also effectively have been overruled in relevant part. In Pickering v. Board of Education, 391 U.S. 563, 568, 88 S. Ct. 1731, 1734, 20 L. Ed. 2d 811 (1968), Perry v. Sindermann, 408 U.S. 593, 597, 92 S. Ct. 2694, 2697, 33 L. Ed. 2d 570 (1972), and Mt. Healthy City School District Board of Education v. Doyle, 429 U.S. 274, 283-84, 97 S. Ct. 568, 574, 50 L. Ed. 2d 471 (1977), the Court held that improper retaliatory purpose would invalidate action directed against a government employee's protected speech. In Metropolitan Housing, 429 U.S. at 270 n. 21, 97 S. Ct. at 566 n. 21, and Mt. Healthy, 429 U.S. at 287, 97 S. Ct. at 576, both decided on the same day, the Court applied identical standards of proof to a zoning action allegedly motivated by racial considerations and an employment action allegedly motivated by a purpose to chill free speech, the same standard that it would later apply in Underwood to determine racially discriminatory legislative purpose. See also Lee v. Russell County Bd. of Educ., 684 F.2d 769, 773-74 (11th Cir.1982) (applying identical Mt. Healthy standards to free speech and equal protection challenges to government employment action). These decisions, which treat the evaluation of governmental purpose in challenges under the First Amendment as identical to the inquiry under the Equal Protection Clause, suggest that action by any branch of government may be invalid if the challenger shows the action was partly motivated by purposes offensive to the Free Speech Clause and the defender cannot prove that illicit motivation was not in fact the cause of the action. See Minneapolis Star \u0026 Tribune Co. v. Minnesota Comm'r of Revenue, 460 U.S. 575, 579-80, 585, 103 S. Ct. 1365, 1364-65, 1372, 75 L. Ed. 2d 295 (1983).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIf Hernandez, Aguillard, Jaffree, Stone and Lemon were not enough to show that the City's contention is meritless, our holding in American Civil Liberties Union v. Rabun County Chamber of Commerce, 698 F.2d 1098, 1110-11 (11th Cir.1983) (per curiam), that improper religious motive invalidates official action challenged under the Establishment Clause, would suffice. We readily conclude that a predominantly or pre-eminently sectarian purpose will invalidate an otherwise permissible law under the Establishment Clause. We therefore turn to consider the allocation of proof in applying the purpose criterion of Lemon, and conclude that the frequently invoked Mt. Healthy standard is the most appropriate. See Price Waterhouse v. Hopkins, 490 U.S. 228, 252-54, 109 S. Ct. 1775, 1792-93, 104 L. Ed. 2d 268 (1989) (plurality opinion) (applying Mt. Healthy to private intentional sex discrimination case under Title VII); id., 490 U.S. at 258-60, 109 S. Ct. at 1795 (White, J., concurring) (same); NLRB v. Transportation Management Corp., 462 U.S. 393, 403, 103 S. Ct. 2469, 2475, 76 L. Ed. 2d 667 (1983) (applying Mt. Healthy to discriminatory anti-union discharge case); Thompkins v. Morris Brown College, 752 F.2d 558, 563-64 (11th Cir.1985) (anticipating Hopkins); Hayes v. Shelby Mem. Hosp., 726 F.2d 1543, 1548 (11th Cir.1984) (applying Mt. Healthy to Pregnancy Discrimination Act).\n\nTo be sure, the competing interests implicated in an Establishment Clause case may differ from those in free speech cases, as well as those involved in discrimination cases under the equal protection aspect of the Fourteenth Amendment, the disparate treatment aspect of Title VII, the Pregnancy Discrimination Act and the National Labor Relations Act. Nevertheless, the Establishment Clause requirement that a statute must have a \"clearly secular\" purpose, over which any sectarian motivation does not \"predominate,\" is consistent with the allocation of proof adopted by the Court in Hopkins, Underwood, Transportation Management, Metropolitan Housing and Mt. Healthy and by our court in Hayes. Just as the plurality in Hopkins and Justice White were \"not inclined to say that the public policy against firing employees because they spoke out on issues of public concern [in violation of the First Amendment] or because they affiliated with a union is less important than the policy against discharging employees on the basis of their gender,\" 490 U.S. at 254, 109 S. Ct. at 1793, we are not inclined to conclude that the constitutional prohibition of laws tending to establish one or more official religions is less important than any of those policies just addressed. \"Each of these policies is vitally important, and each is adequately served by requiring proof by a preponderance of the evidence [that the defendant would have reached the same result in the absence of improper motivation].\" Id. (rejecting proposal to require defendant's proof by clear and convincing evidence). When a plaintiff shows by direct evidence that a sectarian or religious purpose was a substantial or motivating factor, the burden shifts to the defendant to show by a preponderance of the evidence that action challenged under the Establishment Clause would have been undertaken even in the absence of such improper considerations. See Aguillard, 482 U.S. at 595, 107 S. Ct. at 2583 (citing Metropolitan Housing); cf. Gillette v. United States, 401 U.S. 437, 451-52, 91 S. Ct. 828, 837, 28 L. Ed. 2d 168 (1971) (requiring challenger to show the absence of legitimate purpose when there is no direct evidence of sectarian motive).\n\nB. Discussion\n\nThe district court's opinion did not expressly address Scientology's claim of discriminatory purpose, see 756 F. Supp. at 1505, 1516, although the City concedes that the claim was vigorously argued throughout the course of this litigation. Having granted the City's motion for summary judgment, however, the district court did deny Scientology's motion to alter or amend the judgment on the basis of this issue. [R7-168-1; R6-147-4-9.]\n\nScientology points to various materials, including newspaper articles, that it submitted to the district court and which it argues tend to show sectarian motivation. Even if they would have been inadmissible at trial (and we do not hold that they would have been), such materials were appropriately submitted by the non-moving party in opposition to the motion for summary judgment. See Celotex Corp. v. Catrett, 477 U.S. 317, 319, 324, 106 S. Ct. 2548, 2551, 2553, 91 L. Ed. 2d 265 (1986) (non-moving party opposing motion for summary judgment with hearsay documents need not \"produce evidence in a form that would be admissible at trial in order to avoid summary judgment\"); see also Offshore Aviation v. Transcon Lines, Inc., 831 F.2d 1013, 1015 \u0026 n. 1 (11th Cir.1987) (per curiam) (\"The claim by [the moving party] that the letter is inadmissible hearsay does not undercut the existence of any material facts the letter may put into question.\").\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nConstrued in the light most favorable to the non-moving party, as they must be in evaluating a motion for summary judgment, Adickes v. S.H. Kress \u0026 Co., 398 U.S. 144, 157, 90 S. Ct. 1598, 1608, 26 L. Ed. 2d 142 (1970), these materials provide explicit evidence that the city commission conducted its legislative process from beginning to end with the intention of singling out Scientology for burdensome regulation. The record shows a widespread political movement, apparently driven by an upsurge of sectarian fervor,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e intent on driving Scientology from Clearwater. It also shows that various members of the commission had made their affiliation with that movement known to the public in the plainest terms possible, not only in the official legislative record leading to adoption of the ordinances but also in documents concerning unrelated government activity and in extemporaneous remarks.\n\nThe city commission hired a Boston lawyer named Michael Flynn to coordinate the publicly televised hearings that eventually led to adoption of the 1983 and 1984 Ordinances. [R1-18-Exh. S.] As reported in the Clearwater media and well known to the commission and the public, Flynn had dedicated much of his career to fighting Scientology. It was Flynn who first suggested adoption of a charitable solicitation ordinance, the avowed purpose of which was to target Scientology. [ Id. Exh. K.] In his written report Flynn appealed to the prejudices of his clients when he observed that such an ordinance would require lengthy and costly litigation to defend but that \"Scientology has rarely been successful in any judicial system in the world, including numerous cases in the U.S., in using its religious front to conceal its activities.\" [ Id. Exh. K-2.] (He did observe that Scientology was likely to achieve preliminary success in such litigation, noting \"the only analogy I can give is it's like dealing with the Nazis. They will litigate right to the bunker.\" [ Id. Exh. N1-13.] )\n\nFlynn told the commission that a primary purpose of the statute was the collection of data to support the City's position (since abandoned for purposes of this case) that Scientology is not a bona fide religion and therefore is not entitled to exemption from the payment of property taxes. [ Id. N-1-9.] Although proper enforcement of property tax laws is a legitimate local governmental interest, the highly charged political context in which it was pursued created a risk that the taxation purpose was a mere pretext. Certainly, the City had no interest in depriving Scientology of its privilege to pay the lower non-profit rate for United States mail bulk postage. [ Id. Exh. N-3.] Nor did the City have any interest in confounding Scientology's state and federal income tax exemptions. [ E.g., id. Exh. O-8-9.] Rather, viewed in the light most favorable to Scientology, these statements of purpose reveal an underlying objective to employ the tax laws to discriminate against Scientology, a purpose that is patently offensive to the First Amendment. See Powell v. United States, 945 F.2d 374 (11th Cir.1991).\n\nAs late as June 1983, commission members continued to express concern over suggestions that the proposed ordinance would \"create a hardship for legitimate organizations,\" including other \"churches,\" [R1-18-Exh. ZZ-33 to 34, 36,] and ordered further consideration of the matter by City Attorney Thomas Bustin. [ Id. Exh. CCC, EEE (transcript of consultation between Bustin and Episcopal and Jewish representatives).] Viewed in the light most favorable to Scientology, we may interpret this response as a sign of deference to the main-line denominations. Yet when identical concerns had been raised by Scientology at a public meeting, [ id. Exh. HH-49, 52-57,]\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e the commission's entire response had been limited to an argumentative discussion in which members of the body debated the constitutionality of the ordinance with Scientology's advocate. [ Id. at 57-64.]\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Clearwater did not invite Scientology representatives to consult with Bustin. According to City Manager Anthony Shoemaker, \"Why should we? We've heard their objections over and over again.\" [ Id. Exh. FFF-3.]\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nScientology also points to a number of changes embodied in successive drafts of the 1983 Ordinance, changes inserted at the instance of more popular denominations and other charities. [ See id. Exh. DD, FF, HH.] For example, the 1983 Ordinance was redrafted to remove any requirement that charitable organizations report or retain records concerning the identity of individual donors, [ id. Exh. ZZ-4,] a provision that main-line charities and churches suggested might discourage contributions. Similarly, the exemption for small-scale solicitations was adopted in response to more respected religious groups' concern for affiliated charities based outside Clearwater whose local activities were likely to be regular but small in scope. [ Id. Exh. EEE; see generally id. Exh. III-30; id. Exh. JJJ.] Such tinkering creates a significant \"risk of politicizing religion,\" Valente, 456 U.S. at 253-55, 102 S. Ct. at 1688-89, a danger that for purposes of summary judgment appears to have been realized in the present case.\n\nMayor Kathleen Kelly and others frequently voiced concern that main-line denominations opposed to the ordinance might express their dissension by refusing to comply with its provisions; no such solicitude was ever expressed concerning Scientology's objections. [R1-18-Exhs. MMM, III-6-15.] In voting against the 1983 Ordinance, Commissioner James Berfield noted one of the competing concerns before the body as \"Will the ordinance be so cumbersome on the legally recognized religions and charitable organizations that it will be burdensome to them?\" [ Id. Exh. OOO-6.] Voting in favor of the ordinance, Commissioner William Justice observed:\n\nAfter the amendments, I talked to a number of people in churches and charitable organizations, and they convinced me that [the 1983 Ordinance] would not work any hardship on them. They felt it was a good ordinance. Any [sic] of the ministers--I won't say all of them but many of them--ministers whom I'm very familiar with and trust their opinion said it would not affect their organization either way and they would be glad to show their records. Consequently, I changed my opinion and I will vote for the ordinance.\n\n[ Id. Exh. 000-9-10.]\n\nIn response to concerns over the cost of litigation to defend the ordinances, Commissioner James Calderbank noted in 1981 the relatively large size of the City's budget and further observed \"and I think number two, even emotionally, we are representatives of the citizens ( [then-Commissioner] KELLY agreeing here) and I think in the last few elections, [Commissioner] Rita [Garvey] was the first one, and [then-Mayor] Charlie [LeCher], that I heard years ago say, We've got to find a legal route.\" [ Id. Exh. N-1-17.] This reference to the continuing political movement against Scientology during election campaigns is amply corroborated by unrebutted newspaper clippings contained in several volumes of the record. Then-candidate Calderbank declared in 1980 that \"I will explore every avenue and support every legal means of encouraging the Scientologists to leave.... I am a doer, not a talker.\" [ Id. Exh. D-7.] In 1981 candidate Calderbank \"said that Scientology \"has to be treated like a cancer--first you arrest its growth, then remove it from the city ... or nullify its existence.' \" [ Id. Exh. D-13 (ellipses in original).] During his successful 1983 re-election campaign Calderbank again emphasized his opposition to Scientology, although he remained careful to articulate his respect for the law.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Mayor LeCher, successfully seeking re-election in 1981, characterized Scientology as a \"dark cloud ... that is upon us.\" [ Id. Exh. D-16.]\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Candidate Rita Garvey, successfully seeking election to the commission in 1980, entertained a \"position on Scientology [that] is forceful but balanced with a concern that the rule of law be followed. Mrs. Garvey says that Scientologists lie, steal and cheat. She feels the community must work to destroy the organization at the top.\" [ Id. Exh. E-2.] Then-Commissioner Richard Tenney, unsuccessfully seeking re-election in 1980, \"said his campaign will focus on one issue--forcing Scientology to leave town.\" [ Id. Exh. D-8.]\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Candidate Justice, successfully seeking election to the commission in 1983, stated his position that the City should \"use every legal means to show that they [Scientology] are a fraud.\" [ Id. Exh. D-33.] During a press conference Flynn and another person engaged in a colloquy to the effect that enacting a charitable solicitation ordinance would drive Scientology out of Clearwater. [ Id. Exh. N-7.]\n\nMayor LeCher gave a television interview concerning the hearings in which the following exchange took place.\n\nInterviewer: ... Respond to the argument that at least some of the church members raise that this is, in essence, an organized effort to run [Scientology] out of town.\n\nLeCher: It is an organized effort of the City of Clearwater... [ellipses in original] Where ever I go they say, \"What about the Scientologists?\" They seem to care more [about] that than the boat, than the pier, or the hotel, or whatever. It has been proven that street corner confrontation in politics no longer work in this issue. So we believe that government should be of laws. And we are trying to carry out the wish of the people. Again, if there is nothing there then there is nothing there. And [the Scientologists] should want to come to a conclusion on this issue....\n\nInterviewer: Would you like to see them run out of town?\n\nLeCher: The county has a lawsuit with them. I don't really care to comment publicly how I honestly feel with the threat of any possible litigation. But I would like to say that I yearn for the olden days when the Fort Harrison Hotel was full of Canadian tourists spending lots of money in the city of Clearwater.\n\n....\n\nInterviewer: ... Is anyone other than the Scientologists being brought before these hearings?\n\nLeCher: Not that I know of. I don't know anyone else that is claiming to be a religion that is not.\n\n[ Id. Exh. Q-2 to 3; see also id. Exh. W-13, P 21.] As late as August 1983, Mayor Kelly was reported to have expressed \"frustration\" that the First Amendment restricted the City's ability to prevent Scientology from distributing literature in public fora, while Calderbank called for increased police patrols to deal with this problem. [ Id. Exh. FFF-3.]\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe City also considered but rejected proposals to employ its power of eminent domain to condemn Scientology property \"even though the condemnation might put the organization out of business.\" [ Id. Exh. O-16.] In response to concerns over the cost of acquiring and renovating the former hotel which Scientology had purchased in downtown Clearwater, Commissioner Calderbank observed: \"There are other locations that they own that might be more practical.\" [ Id. Exh. P-18 (emphasis added).] A newspaper article reported that Mayor LeCher had expressed reservations that \"even if the move were successful, it would not guarantee Scientology will leave the city.\" [ Id. Exh. P-30.] As late as December 1983, City Manager Shoemaker stated in an official memorandum that \"I think total condemnation of all the Scientologist's [sic] property in the city might be a workable solution to this problem facing the City. This might even give them the needed boost to decide to relocate.\" [ Id. Exh. QQQ-1.] In considering Flynn's proposal to create a special taxing zone in the downtown area and prohibit real estate conveyances to tax exempt owners, commissioners expressed concern that the impact of the action be limited to Scientology. [ See id. Exh. P-25; id. Exh. KK-35-37.]\n\nThe City may have tried to conduct a second round of hearings to sanitize the legislative record and suggest a neutral motivation. [ E.g., id. Exhs. ZZ, III, JJJ.] Whatever weight may be accorded this fact, the new legislative record is insufficient to warrant summary judgment in the face of all that had gone before. [ See also id. Exh. LLL (commission delayed vote on 1983 Ordinance pending receipt of \"important\" information from disenchanted ex-Scientologists to \"help bolster Clearwater's legal position\").] Although it may not prove directly probative, we also note a Clearwater newspaper's 1983 opinion that \"this charitable solicitation ordinance was conceived as a means of attacking the Church of Scientology, and nothing the city does now can remove that defect.\" [ Id. Exh. UU; see generally id. Exh. DDD.] There is sufficient evidence supporting that conclusion to shift to the City the ultimate burden of showing, under all the circumstances, that it would have enacted the ordinance even without impermissible motive.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The same evidence precludes judgment as a matter of law for the City. We therefore reverse the district court's order of summary judgment in the City's favor. The district court's order denying summary judgment for Scientology is vacated, and the case is remanded for further proceedings concerning the Lemon purpose criterion. If the district court concludes that the City was improperly motivated then the entire ordinance will be invalid. No further proceedings are necessary concerning Lemon's excessive entanglement analysis, however, in view of our discussion that follows.\n\nVIII. EXCESSIVE ENTANGLEMENT\n\nThe three-prong Lemon inquiry also asks whether the challenged conduct \"fosters \"an excessive government entanglement with religion.' \" Lemon, 403 U.S. at 613, 91 S. Ct. at 2111 (quoting Walz v. Tax Comm'n, 397 U.S. 664, 674, 90 S. Ct. 1409, 1414, 25 L. Ed. 2d 697 (1970)). Later decisions have clarified this aspect of the Establishment Clause in part. In Jimmy Swaggart Ministries v. Board of Equalization, 493 U.S. 378, 110 S. Ct. 688, 107 L. Ed. 2d 796 (1990), the Court held that the required recordkeeping and disclosure associated with administering neutral collection of sales taxes on transfers of religious and other materials did not excessively entangle the government in church affairs. \"Generally applicable administrative and recordkeeping regulations may be imposed on religious organizations without running afoul of the Establishment Clause.\" 493 U.S. at 395, 110 S. Ct. at 698. Such \"routine regulatory interaction which involves no inquiries into religious doctrine, no delegation of state power to a religious body, and no \"detailed monitoring and close administrative contact' between secular and religious bodies, does not of itself violate the nonentanglement command.\" Hernandez, 490 U.S. at 696-97, 109 S. Ct. at 2147 (citations omitted); see also Tony \u0026 Susan Alamo Found. v. Secretary of Labor, 471 U.S. 290, 305-06, 105 S. Ct. 1953, 1963-64, 85 L. Ed. 2d 278 (1985) (holding that requirements of Fair Labor Standards Act foster no impermissible entanglement).\n\nA. Contentions of the Parties\n\nScientology argues that the effect of the 1984 Ordinance is to mandate disclosure of its entire operation. By requiring disclosure of the purpose for which funds are and have been solicited and the uses to which funds will be and have been put, the ordinance in effect makes the entire functioning of the church a matter of public record, either directly through reporting in the registration form and retrospective filing or indirectly by means of the \"private\" statement and disclosure of supporting records. This effect is heightened by the further requirements of particular disclosures, such as the amount of funds spent on salaries, overhead and the like, and the names and addresses of every person in the organization with authority to spend its money. And Scientology contends that, because funds solicited in Clearwater may be spent anywhere in the world, the ordinance perforce requires disclosure of its activities worldwide. See generally Code §§ 100.03(1), 100.03(8).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nScientology further argues that the disclosure provisions \"require disclosure of the financial affairs of churches and other voluntary associations and provide rights to members of a church (or other voluntary association[ ] ) that they would not have absent the Ordinance. Thus, these requirements impose on a church the form of organization Clearwater deems proper ... [and] removes from churches the ability to decide how they will govern and organize themselves.\" (Appellant's Br. at 18). Scientology contends, finally, that such an entanglement is categorically prohibited by Supreme Court precedent and can never be justified.\n\nThe City responds that these are merely \"generally applicable administrative and recordkeeping regulations\" and therefore permissible. Even if otherwise improper, it argues, the 1984 Ordinance is sufficiently closely tailored to serve the City's legitimate interest in preventing fraud.\n\nB. The Government Entanglement\n\nNone of the recent cases discussed above addressed facts similar to the ones presented here. All of the challenged regulations imposed recordkeeping and disclosure obligations that were narrowly drawn to specific regulatory objectives. See Jimmy Swaggart, 493 U.S. at 394-97, 110 S. Ct. at 698-99 (sales tax on books and similar material); Hernandez, 490 U.S. at 696-98, 109 S. Ct. at 2147-48 (tax deductibility of contributions as quid pro quo); Tony \u0026 Susan, 471 U.S. at 305-06, 105 S. Ct. at 1963-64 (wage and hour regulation). None of the regulations required a church to divulge its entire budget and all its operations on a continuing basis to a large group of governmental and non-governmental persons. In contrast, the 1984 Ordinance mandates a \"detailed monitoring and close administrative interaction\" by empowering the city clerk to review in detail the disclosure of proposed spending for the coming year and to assess disclosure of all such activities over the preceding year, by mandating public access to a detailed accounting of church expenditures, by opening the books and records to members of organizations employing the private statement and by involving criminal courts in enforcing these provisions. The disclosure and recordkeeping is \"significantly more intrusive into religious affairs,\" Tony \u0026 Susan, 471 U.S. at 306, 105 S. Ct. at 1964, than that imposed by any of the regimes recently upheld by the Supreme Court.\n\nThe monitoring imposed by the 1984 Ordinance is just as \"close\" as the surveillance of parochial school expenditures condemned in Aguilar v. Felton, 473 U.S. 402, 105 S. Ct. 3232, 87 L. Ed. 2d 290 (1985), and equally as \"detailed\" as the program at issue in that case, if not more so, for the 1984 Ordinance in effect requires recordkeeping and disclosure concerning every expenditure. As the Court noted in Jimmy Swaggart, even a generally applicable recordkeeping regulation is permissible only if \"the statutory scheme requires neither the involvement of state employees in, nor on-site continuing inspection of, [the church's] day-to-day operations.\" 493 U.S. at 395, 110 S. Ct. at 699 (emphases added). The 1984 Ordinance offends this principle because it involves executive and judicial authorities in every aspect of the church's activities, not only making them the ultimate arbiters of the appropriate level of disclosure to the church's members in all matters of ecclesiastical fiscal administration, but also conferring responsibility for apprising themselves and the public concerning such matters. The City's law violates the command that \"neither a state nor the Federal Government can, openly or secretly, participate in the affairs of any religious organizations or groups and vice versa. \" Everson v. Board of Educ., 330 U.S. 1, 16, 67 S. Ct. 504, 512, 91 L. Ed. 711 (1947).\n\nAlthough it does not require continuous or on-site inspection by government employees, the private statement option for member solicitations subjects religious organizations to the continuous surveillance of their own members by requiring disclosure of all records underlying the statements upon request. The City's legislative officials may not delegate to an individual citizen a power that they do not possess themselves, no matter how intimate the individual's relationship with the subject of the regulation may be, when the exercise of that power by the City would have infringed impermissibly a fundamental liberty guaranteed under our Constitution. Planned Parenthood v. Danforth, 428 U.S. 52, 69-72, 96 S. Ct. 2831, 2841-42, 49 L. Ed. 2d 788 (1976).\n\nThe potential for government invasion of church affairs is compounded by the ordinance's direct effect upon church hierarchy. By requiring a church to make detailed information about its activities available to members and the public, the ordinance has the direct effect of subtly shifting the balance of power between the laity and the central ecclesiastical authority. While democratic participation by individual members in the affairs of society is a cornerstone of our public life, government may not mandate such arrangements in private organizations. March Fong Eu v. San Francisco County Democratic Cent. Comm., 489 U.S. 214, 232-33, 109 S. Ct. 1013, 1025, 103 L. Ed. 2d 271 (1989). In addition to this legislatively sanctioned reordering of church hierarchy, of course, the ordinance requires prosecutorial and judicial authorities to assure compliance with its provisions by investigation and criminal enforcement. In accomplishing these results the legislative arm of the City's government has impermissibly imposed its own preferences concerning the degree of disclosure to members concerning daily operations.\n\nBy fiat it displaces one church administrator with another. It passes control of matters strictly ecclesiastical from one church authority to another. It thus intrudes for the benefit of one segment of a church the power of the state into the forbidden area of religious freedom contrary to the principles of the First Amendment.\n\nPresbyterian Church v. Hull Mem. Presbyterian Church, 393 U.S. 440, 448, 89 S. Ct. 601, 606, 21 L. Ed. 2d 658 (1969) (quoting Kedroff v. St. Nicholas Cathedral, 344 U.S. 94, 119, 73 S. Ct. 143, 156, 97 L. Ed. 120 (1952)). The interposition of official authority on behalf of a church's laity is equally as offensive to the Establishment Clause as the delegation of such authority to church leaders that was condemned in Larkin v. Grendel's Den, Inc., 459 U.S. 116, 123, 103 S. Ct. 505, 510, 74 L. Ed. 2d 297 (1982). For these reasons the recordkeeping and disclosure requirements of the 1984 Ordinance cannot be characterized as \"routine.\"\n\nThis type of surveillance is not rendered permissible by virtue of the fact that it does not expressly require the clerk or the court to make an assessment of the religious content of Scientology's activities. Cf. Jimmy Swaggart, 493 U.S. at 396-97, 110 S. Ct. at 699. For the imposition of civil authority in matters of \"church policy and administration\" by itself may pose a \"substantial danger that the State will become entangled in essentially religious controversies or intervene on behalf of groups espousing particular doctrinal beliefs.\" Serbian Eastern Orthodox Diocese v. Milivojevich, 426 U.S. 696, 710, 709, 96 S. Ct. 2372, 2381, 2380, 49 L. Ed. 2d 151 (1976); cf. Jones v. Wolf, 443 U.S. 595, 603-04, 99 S. Ct. 3020, 3025-26, 61 L. Ed. 2d 775 (1979) (holding that civil courts may apply only neutral principles of law to resolve disputes over church property).\n\nThe Fifth Circuit applied a settled principle when it declared that \"the law is clear: civil courts are barred by the First Amendment from determining ecclesiastical questions.\" Simpson v. Wells Lamont Corp., 494 F.2d 490, 493 (5th Cir.1974); accord, e.g., Natal v. Christian \u0026 Missionary Alliance, 878 F.2d 1575 (1st Cir.1989). In applying this principle we must not \"narrowly limit\" its scope to actual\n\ndifferences in church doctrine. The cases negative such a strict view. A \"spirit of freedom for religious organizations, an independence from secular control or manipulation[,] in short, power to decide for themselves, free from state interference, matters of church government as well as those of faith and doctrine\" is reflected in the Supreme Court's decisions.\n\nSimpson, 494 F.2d at 493 (quoting Kedroff, 344 U.S. at 116, 73 S. Ct. at 154). The district court erred when it concluded that \"the present situation does not involve an ecclesiastical dispute,\" 756 F. Supp. at 1521. To the contrary, the principle that civil authorities must abstain from interposing themselves in matters of church organization and governance is directly violated by the public financial, operational and organizational disclosures required of churches that solicit from members and the public and the alternative private statement procedures applicable to member solicitations.\n\nThe same excessive entanglement in church affairs that is triggered by member solicitation under the 1984 Ordinance occurs when churches solicit the public. The Court has never suggested that an excessive government entanglement that happens to involve church solicitation is mitigated by the fact that the public rather than the church's membership is the object of a request for funds. See Valente, 456 U.S. at 252-55, 102 S. Ct. at 1687-89 (noting that facial denominational preferences in law regulating public solicitation implicates excessive entanglement concerns). The ordinance provides for exactly the same public disclosure and exactly the same mechanisms for official monitoring and enforcement with respect to both member and non-member solicitations.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The tendency toward establishing religion that inheres in laws requiring public disclosure and official surveillance of church finances and activities is the same whether the regulation is occasioned by solicitations of co-religionists or church outsiders. See, e.g., Larkin, 459 U.S. at 126-27, 103 S. Ct. at 511-12 (condemning entanglement of official and ecclesiastical authority in matters entirely external to church affairs). The effect of such disclosure upon the associational interests of members in maintaining the privacy of their activities is the same whether the church engages in public solicitation or not. Moreover, the state may never require churches to forego protected religious and speech activity like public solicitation, see, e.g., Cantwell v. Connecticut, 310 U.S. 296, 303-05, 60 S. Ct. 900, 903-04, 84 L. Ed. 1213 (1940), in order to avoid becoming entangled with civil authorities. We need not determine in the present case whether prohibiting such speech in the absence of entangling regulation would be adequately tailored to some substantial interest, although we doubt that such a blanket prohibition could be sustained. An unconstitutional entanglement may not be excused on the ground that it is imposed only as a condition of avoiding otherwise permissible regulation or as a prerequisite to receiving a valuable privilege. See generally, e.g., Rutan v. Republican Party, 497 U.S. 62, 72, 110 S. Ct. 2729, 2736, 111 L. Ed. 2d 52 (1990).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIt is clear from the many entanglement cases that have involved direct regulation by executive rather than judicial institutions, beginning with Walz and continuing through Jimmy Swaggart, as well as those addressed to intervention by legislatures, see Kreshik v. St. Nicholas Cathedral, 363 U.S. 190, 80 S. Ct. 1037, 4 L. Ed. 2d 1140 (1960) (per curiam), that the same prophylactic rule must also apply to intervention in church affairs by non-judicial branches of civil government. In general \"it is of no moment that the State\" has selected a particular branch of its government to carry out the challenged conduct, \"for whether legislative or judicial, it is still the application of state power which we are asked to scrutinize.\" NAACP v. Alabama ex rel. Patterson, 357 U.S. 449, 463, 78 S. Ct. 1163, 1172, 2 L. Ed. 2d 1488 (1958). The principle of abstention is equally applicable to the decisions of church authorities that are not constituted as canonical courts or judicatories but merely as administrators. See, e.g., Gonzalez v. Roman Catholic Archbishop, 280 U.S. 1, 15-16, 50 S. Ct. 5, 7-8, 74 L. Ed. 131 (1929). Thus, the potential for entanglement by executive officials like the city clerk, judicial officials involved in applying the ordinance's criminal provisions and legislative authorities like the commission, whether intentionally undertaken or not, is sufficiently \"substantial\" to invoke the abstention principles first articulated in Watson v. Jones, 80 U.S. (13 Wall.) 679, 728-29, 20 L. Ed. 666, 676-77 (1872), reiterated in Gonzalez, and incorporated into First Amendment jurisprudence by Kedroff.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nWhen combined with the imposition of criminal enforcement mechanisms, the regime may become doubly offensive. We need not reiterate the many important concerns that underlie the principle of separation between the functions of government and those of churches under the First Amendment. See, e.g., Kedroff, 344 U.S. at 116, 73 S. Ct. at 154; Illinois ex rel. McCollum v. Board of Educ., 333 U.S. 203, 212, 68 S. Ct. 461, 465, 92 L. Ed. 649 (1948); Watson, 80 U.S. (13 Wall.) at 728-29, 20 L. Ed. at 676-77. We simply note that the procedures for citizen complaint to the city attorney and investigation by subpoena enacted in the 1984 Ordinance underscore the already substantial risk of government participation in intramural church conflict and decisionmaking. The provisions of the 1984 Ordinance requiring prospective and retrospective disclosure of church finances, activities and organization as a condition of soliciting funds foster an excessive government entanglement.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe ordinance requires organizations to make limited public disclosure even when other information is omitted from the registration form in reliance upon the private statement option. This mandatory public disclosure includes the nature and identity of the organization, its tax-exempt status, other Florida cities in which it is registered and the criminal histories of its officers and solicitors. Code § 100.03(1)(a), (b), (c), (j). This limited disclosure requires no continuing monitoring by private or public entities, imposes only a minimal burden on the organization and does not significantly interfere in the ordering of church affairs voluntarily accepted by members. This requirement standing alone does not foster an excessive entanglement. \"The internal operations of the organization ... remain under the veil of privacy.\" ISKCON-Houston, 689 F.2d at 556. The Supreme Court has said that \"a state may protect its citizens from fraudulent solicitation by requiring a stranger in the community, before permitting him publicly to solicit funds for any purpose, to establish his identity and his authority to act for the cause which he purports to represent.\" Cantwell, 310 U.S. at 306, 60 S. Ct. at 904; see also Riley v. National Fed'n of the Blind, 487 U.S. 781, 799 n. 11, 108 S. Ct. 2667, 2679 n. 11, 101 L. Ed. 2d 669 (1988). Upon remand, if the district court finds that the ordinance as a whole was not enacted with impermissible motive, it should proceed to determine whether the severability provision may appropriately be applied to preserve such limited disclosure.\n\nC. Asserted City Justification\n\nThe protections of the First Amendment are not absolute. The City argues that the excessive entanglement analysis also requires an evaluation of the objectives of the government's regulation and an assessment of whether it is adequately tailored to serve them. Scientology argues to the contrary that such an approach is inconsistent with the Supreme Court's precedents, which it contends have followed a categorical rather a comparative balancing approach in applying the Lemon Establishment Clause criteria and have reserved the familiar \"compelling interest\" test of Sherbert v. Verner, 374 U.S. 398, 83 S. Ct. 1790, 10 L. Ed. 2d 965 (1963), and its progeny\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e for application under the Free Exercise Clause. We note that the continuing vitality of the Sherbert test has been limited by the Court's decision in Employment Division v. Smith, 494 U.S. 872, 110 S. Ct. 1595, 108 L. Ed. 2d 876 (1990), which held that generally applicable criminal laws need not be justified by a compelling interest to withstand attack under the Free Exercise Clause. See also Church of the Lukumi Babalu Aye v. City of Hialeah, U.S., 113 S. Ct. 2217, 2226, 124 L. Ed. 2d 472 (1993).\n\nThe criteria adopted in Lemon and elaborated in its progeny are absolute in themselves, and a law that fails to meet any of them is per se invalid. Unlike the limitations placed upon government power to protect the individual's freedoms of expression and conscience under other clauses of the First Amendment, limitations which are themselves circumscribed by the flexible analysis of compelling interests, those imposed by Lemon provide a prophylactic wall of separation between church and state. See Everson, 330 U.S. at 15-16, 67 S. Ct. at 511-12; Larkin, 459 U.S. at 122-23, 103 S. Ct. at 510. The Supreme Court has often invalidated statutes without asking how the challenged legislation was related to a government objective. See, e.g., Aguillard, 482 U.S. at 585-94, 107 S. Ct. at 2578-83 (impermissible purpose); Felton, 473 U.S. at 408-15, 105 S. Ct. at 3236-39 (excessive entanglement); Meek v. Pittenger, 421 U.S. 349, 367-70, 95 S. Ct. 1753, 1764-66, 44 L. Ed. 2d 217 (1975) (same); Lemon, 403 U.S. at 618-19, 91 S. Ct. at 2114 (same). In Larkin the Court noted that the state's asserted interests in providing for the regulation of liquor distribution and controlling the use of property in the vicinity of schools, churches, hospitals and similar institutions readily could have been furthered by other regulation, 459 U.S. at 124-25, 103 S. Ct. at 510-11, but it did not rely upon this observation to invalidate a statute that conferred government liquor licensing powers upon churches and thereby enmeshed secular and ecclesiastical authority. 459 U.S. at 126-27, 103 S. Ct. at 511-12. Nor has the Court ever implied that it favored such an approach to the Lemon standards, even in decisions that simultaneously applied a compelling interest analysis under the Free Exercise Clause. See, e.g., Hernandez, 490 U.S. at 699-700, 109 S. Ct. at 2149; Gillette, 401 U.S. at 461, 91 S. Ct. at 842; cf. Corporation of the Presiding Bishop v. Amos, 483 U.S. 327, 339, 107 S. Ct. 2862, 2870, 97 L. Ed. 2d 273 (1987) (stating that judicial review of statute that \"passes the Lemon test\" requires inquiry \"whether Congress has chosen a rational classification to further a legitimate end\"). The statement in Allegheny that \"strict scrutiny\" should be applied to the Lemon \"effects\" prong, 492 U.S. at 608-09, 109 S. Ct. at 3109, appears to have been a misleading choice of words, for no compelling interest analysis was undertaken. The Establishment Clause prevents seemingly important justifications from becoming a shield to defend the subtle and incremental advance of government administration into the field of church activities. It is this function of the excessive entanglement analysis which helps to give meaning to the textual distinction in the First Amendment between \"laws respecting an establishment of religion\" on the one hand and \"[laws] prohibiting the free exercise thereof.\"\n\nMoreover, nothing in Smith has thrown doubt upon the categorical analytical approach embodied in Lemon and its progeny. The City's reliance upon Smith, together with Nineteenth Century decisions upholding laws that forbade polygamy,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e decisions applying labor and tax laws in the face of religious objections,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and those sustaining zoning regulations,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e is clearly misplaced, for those decisions involved Free Exercise rather than Establishment Clause challenges. The City's invocation of Bob Jones University v. United States, 461 U.S. 574, 103 S. Ct. 2017, 76 L. Ed. 2d 157 (1983), is unavailing for the same reason.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nSimilarly, Village of Schaumberg v. Citizens for a Better Environment, 444 U.S. 620, 100 S. Ct. 826, 63 L. Ed. 2d 73 (1980), involved asserted violations of the plaintiffs' freedom of speech by government conduct directly addressed to such protected activity. Regulations having such an effect upon speech are also subject to strict scrutiny under the compelling interest standard. See, e.g., Sable Communications v. FCC, 492 U.S. 115, 126, 109 S. Ct. 2829, 2836, 106 L. Ed. 2d 93 (1989); Citizens for a Better Environment, 444 U.S. at 637, 100 S. Ct. at 836; First Nat'l Bank v. Bellotti, 435 U.S. 765, 786, 98 S. Ct. 1407, 1421, 55 L. Ed. 2d 707 (1978). Regulations fostering an excessive entanglement between government and church are not.\n\nIn Gonzalez the Court suggested by negative implication that civil courts may supplant a decision of church authorities \"in the [presence] of fraud, collusion, or arbitrariness.\" 280 U.S. at 16-17, 50 S. Ct. at 7-8; cf. Presbyterian Church, 393 U.S. at 452 n. 7, 89 S. Ct. at 607 n. 7. In Serbian Diocese, however, the Court cast doubt upon the continuing vitality of the Gonzalez dictum by holding that \"whether or not there is room for \"marginal civil court review' under the narrow rubrics of \"fraud' or \"collusion' when church tribunals act in bad faith and for secular purposes, no \"arbitrariness' exception\" to the rule of abstention in \"matters of discipline, faith, internal organization, or ecclesiastical rule, custom or law\" is permissible under the First Amendment. Serbian Diocese, 426 U.S. at 713, 96 S. Ct. at 2382.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Even if the common law reasoning of Gonzalez also embodies the constitutional rule governing civil review of particular church decisions, the Court has not imported a judicial inquiry concerning fraud or collusion into the general Lemon analysis embracing the broad range of potentially establishmentarianist laws. In Felton, Meek and Lemon, for example, the Court did not pause to consider whether the state's interest in preventing \"fraudulent\" misappropriation of government funds to sectarian uses was \"compelling\" or otherwise substantial, or whether the means chosen were well tailored to accomplish that end, before it condemned the state's regulatory oversight of church expenditures. Cf. Felton, 473 U.S. at 409, 105 S. Ct. at 3236 (\"At best, the supervision in this case would assist in preventing the Title I program from being used, intentionally or unwittingly, to inculcate the religious beliefs of the surrounding parochial school.\"). Indeed, even in applying the Free Exercise Clause itself, we have held that no flexible analysis of compelling interest justifications may be entertained when the challenger shows either that the law was actually enacted for a sectarian purpose or that \"the \"essential effect' of the government action is to influence negatively the pursuit of religious activity or the expression of religious belief.\" Grosz v. City of Miami Beach, 721 F.2d 729, 733 (11th Cir.1983), cert. denied, 469 U.S. 827, 105 S. Ct. 108, 83 L. Ed. 2d 52 (1984).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nLemon is not the only guiding light in the Establishment Clause firmament. When the Court found explicitly preferential treatment for one sect over another to be plain on the face of an ordinance, it allowed the government to show that the preference was \"closely fitted\" to serve a \"compelling governmental interest,\" Valente, 456 U.S. at 246 \u0026 n. 23, 102 S. Ct. at 1684-85 \u0026 n. 23, and invalidated the statute only upon finding that the government had failed to carry this burden. Nevertheless, the compelling interest justification held out by Valente is unavailable to the City in the present case because the 1984 Ordinance is facially neutral among religions and indeed applies to wholly secular charities as well as churches. See Hernandez, 490 U.S. at 695-96, 109 S. Ct. at 2146-47.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Therefore, we need not decide how Valent ' e s strict scrutiny complements Lemon. See Amos, 483 U.S. at 339, 107 S. Ct. at 2870; Donnelly, 465 U.S. at 696 n. 2, 104 S. Ct. at 1371 n. 2 (Brennan, J., dissenting).\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Thus, we need go no further to conclude that the law's recordkeeping and disclosure requirements associated with the prospective and retrospective public disclosure and alternative private statements are invalid as applied to church solicitations of members and the public. The district court's orders denying summary judgment to Scientology and granting summary judgment to the City must be reversed in this respect.\n\nD. Free Exercise Analysis\n\nSome early cases appeared to proscribe civil intervention in church affairs by applying the Free Exercise Clause. See, e.g., Kedroff, 344 U.S. at 114, 73 S. Ct. at 153-54. The Fifth Circuit's citation of free exercise cases in Simpson, 494 F.2d at 493, shows that it viewed the principle as flowing from that source. As such, the prohibition against civil intervention arguably might be overcome by showing that it was necessary to serve a compelling interest, although at the time Kedroff was decided in 1952 the Court had not yet applied contemporary strict scrutiny standards to the Free Exercise Clause. See Kedroff, 344 U.S. at 117-19, 73 S. Ct. at 155-56 (distinguishing American Communications Ass'n v. Douds, 339 U.S. 382, 399-400, 70 S. Ct. 674, 684-85, 94 L. Ed. 925 (1950)).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Nevertheless, as our discussion above shows, the Establishment Clause also is implicated when the government entangles itself on a continuing basis in the non-doctrinal affairs of church functioning.\n\nThe two clauses are closely related in their purposes. For instance, the Establishment Clause prohibition of denominational preferences \"is inextricably connected with the continuing vitality of the Free Exercise Clause.\" Valente, 456 U.S. at 245, 102 S. Ct. at 1683. And the Court has observed,\n\nwhen the state becomes enmeshed with a given denomination in matters of religious significance, the freedom of religious belief of those who are not adherents of that denomination suffers, even when the governmental purpose underlying the involvement is largely secular. In addition, the freedom of even the adherents of the denomination is limited by the governmental intrusion into sacred matters.\n\nFelton, 473 U.S. at 409-10, 105 S. Ct. at 3236 (condemning excessive entanglement). In Serbian Diocese, for instance, the Court referred broadly to \"the First Amendment,\" without specifically citing either the Free Exercise or the Establishment Clause, and employed language that plainly implicated Establishment Clause concerns, 426 U.S. at 709, 710, 96 S. Ct. at 2380, 2381. In Presbyterian Church the Court adverted to both Free Exercise and Establishment Clause concerns. 393 U.S. at 449, 89 S. Ct. at 606; see also Kedroff, 344 U.S. at 121, 73 S. Ct. at 157 (Frankfurter, J., concurring) (\"What is at stake here is the power to exercise religious authority.\"). In the seminal case establishing the principles of civil abstention upon which our opinion relies so heavily, the Court unmistakably identified Establishment Clause values as contributing. \"The law knows no heresy, and is committed to the support of no dogma, the establishment of no sect.\" Watson, 80 U.S. (13 Wall.) at 728, 20 L. Ed. at 676 (distinguishing American legal principles from the British jurisprudence respecting \"the Established Church\").\n\nYet the two clauses are distinct. E.g., Gillette, 401 U.S. at 453, 91 S. Ct. at 838. Although government conduct may be impermissible under both the Free Exercise and the Establishment Clauses, challenged conduct that satisfies the former may offend the latter. E.g., Engel, 370 U.S. at 430-31, 82 S. Ct. at 1266-67. Thus, we have concluded, the Establishment Clause may condemn certain entanglements that take the form of civil intervention in church political organization under Lemon even if they might otherwise have been justifiable under the strict scrutiny of the Free Exercise Clause.\n\nThe \"establishment of religion\" clause of the First Amendment means at least this: Neither a state nor the Federal Government can set up a church. Neither can pass laws which aid one religion, aid all religions, or prefer one religion over another.... Neither a state nor the Federal Government can, openly or secretly, participate in the affairs of any religious organizations or groups and vice versa.\n\nAllegheny, 492 U.S. at 591, 109 S. Ct. at 3100 (quoting Everson, 330 U.S. at 15-16, 67 S. Ct. at 511-12).\n\nIn support of the ordinance the City has pointed to its interests in the prevention of fraud in charitable solicitations, together with concerns that Scientology may continue to engage in alleged illicit surveillance, intimidation and blackmail of political adversaries, dissident members and apostates, as well as bizarre physically and psychologically coercive forms of social control over members. The prevention of these ills is legitimate. Nevertheless, even if the 1984 Ordinance's entangling provisions were capable of justification as narrowly tailored to serve important or compelling interests, the justifications offered by the City are lacking.\n\nNeutral and generally applicable criminal laws may be applied to an individual without compelling justification even if they conflict with his religious beliefs. See Smith, 494 U.S. at 882-90, 110 S. Ct. at 1602-06. But cf. Wisconsin v. Yoder, 406 U.S. 205, 220-24, 92 S. Ct. 1526, 1535-37, 32 L. Ed. 2d 15 (1972) (holding that generally applicable regulatory law requiring mandatory school attendance cannot be applied without exemption for religious objectors unless denial of exemption is necessary to serve compelling interest). But the 1984 Ordinance is not a \"generally applicable\" law \"unconcerned with regulating\" protected activity, Smith, 494 U.S. at 886 n. 3, 110 S. Ct. at 1604 n. 3. Rather, the law applies only to the solicitation of funds by religious and charitable organizations. As such, the statute is directed solely to activity protected by the First Amendment. Solicitation by secular charities, e.g., National Fed'n of the Blind, 487 U.S. at 789, 108 S. Ct. at 2673; Secretary of State v. Joseph H. Munson Co., 467 U.S. 947, 967 \u0026 n. 16, 104 S. Ct. 2839, 2852-53 \u0026 n. 16, 81 L. Ed. 2d 786 (1984), as well as fundraising by political advocacy groups, e.g., Citizens for a Better Environment, 444 U.S. at 632, 100 S. Ct. at 834, no less than solicitation by religious organizations, e.g., Murdock v. Pennsylvania, 319 U.S. 105, 108-12, 63 S. Ct. 870, 872-74, 87 L. Ed. 1292 (1943), are protected as aspects of First Amendment speech and associational freedoms. The ordinance thus has no application to conduct whose exercise is not regarded as a fundamental constitutional liberty and the rule of Smith therefore does not apply.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e In lieu thereof, we employ \"exacting First Amendment scrutiny.\" National Fed'n of the Blind, 487 U.S. at 789, 108 S. Ct. at 2673.\n\nThe Supreme Court has never expressly decided whether the state's interest in preventing church-sponsored fraud upon members or the public should be considered \"compelling,\" although in National Federation of the Blind the Court concluded that the state's interest in protecting secular charities and the public from fraudulently excessive fundraisers' fees was \"a sufficiently substantial interest to justify a narrowly tailored regulation.\" 487 U.S. at 792, 108 S. Ct. at 2675. Faced with the state's asserted interest in \"protecting its citizens from abusive practices in the solicitation of funds for charity,\" including religious causes, the Court in Valente \"assumed, arguendo, that the Act generally is addressed to a sufficiently \"compelling' governmental interest,\" 456 U.S. at 248, 102 S. Ct. at 1685, but proceeded to hold that the regulation at issue was not \"closely fitted\" to serve that interest. See also Citizens for a Better Environment, 444 U.S. at 636, 100 S. Ct. at 836 (same).\n\nWe conclude that the state does indeed have a compelling interest in protecting church members from affirmative, material misrepresentations designed to part them from their money. \"Nothing we have said is intended even remotely to imply that, under the cloak of religion, persons may, with impunity, commit frauds upon the public. Certainly, penal laws are available to punish such conduct.\" Cantwell, 310 U.S. at 306, 60 S. Ct. at 904. The same interests are not diminished by the fact that victims may be voluntary members of a religious association. See, e.g., Wright v. Downs, 972 F.2d 350 (6th Cir.1992) (per curiam) (unpublished) (imposing securities fraud liability upon pastor who touted fraudulent mortgage notes from the pulpit), aff'g Guthrie v. Downs, [1992 Transfer Binder] 1991 U.S. Dist. LEXIS 16510, Fed.Sec.L.Rep. (CCH) P 96,896, 1991 WL 354939 (E.D.Mich. Aug. 7, 1991); United States v. Rasheed, 663 F.2d 843, 847-48 (9th Cir.1981) (affirming mail fraud convictions for church-sponsored Ponzi scheme), cert. denied, 454 U.S. 1157, 102 S. Ct. 1031, 71 L. Ed. 2d 315 (1982). This is so whether the ill-gotten funds are used for a \"legitimate\" religious purpose (however that might be defined by civil authorities), for the personal benefit of church leaders or for some other ends.\n\nWhen no affirmative misrepresentations are made concerning the uses for which funds will be employed, either explicitly or by clear implication, the state has no compelling interest in requiring members or the public to be made aware of such matters. If Scientologists are willing to contribute money without being told how it will be used, then the City has no interest in forcing the church to make such information available. \"All who unite themselves to such a body do so with an implied consent to this government, and are bound to submit to it.\" Watson, 80 U.S. (13 Wall.) at 728, 20 L. Ed. at 676. The continuing vitality of this principle is demonstrated by the 1989 decision in March Fong Eu, in which the Court held that \"a State cannot substitute its judgment for that of [a political] party as to the desirability of a particular internal party structure, any more than it can tell a party that its proposed communication to party members is unwise.\" 489 U.S. at 233, 109 S. Ct. at 1025 (citation omitted).\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Therefore, the City may not substitute its own judgment as to the desirable level of disclosure to church members.\n\nThe City's argument that devout church members may refrain from availing themselves of information that the ordinance requires to be disclosed is specious, for it fails to address the concerns of adherents whose interests in maintaining the privacy of church finances are impaired by disclosure to the public or to dissident members. The City may not intervene on behalf of such dissidents. If they remain dissatisfied with the church's voluntarily assumed disclosure policy then they may attempt to reform that policy from within, they may acquiesce in the policy despite their objections or they may leave the church. Civil authority \"cannot penetrate the veil of the church for the forbidden purpose of vindicating the alleged wrongs of ... members; when they became members they did so upon the condition of continuing or not as they and their churches might determine, and they thereby submit to the ecclesiastical power and cannot now invoke the supervisory power of the civil tribunals.\" Watson, 80 U.S. (13 Wall.) at 731, 20 L. Ed. at 677 (quotations omitted).\n\nSimilarly, the Court has held that \"the State's interest in unilaterally imposing its notions of fairness in the [charitable] fundraising contract is ... constitutionally invalid.\" National Fed'n of the Blind, 487 U.S. at 792, 108 S. Ct. at 2675. For this reason, as the district court recognized, the state may not compel specific disclosures merely because, in its view, some potential contributors to some causes might tend to think that those facts evidence unfairness or some other objectionable quality in the use to which funds will be put. 756 F. Supp. at 1515-16 (citing Indiana Voluntary Firemen's Ass'n v. Pearson, 700 F. Supp. 421, 442 (S.D.Ind.1988)). Just as a church-goer may refrain from tithing if he or she is unsatisfied with the degree of disclosure, a non-member may also demand any information desired, and \"if the solicitor refuses to give the requested information, the potential donor may (and probably would) refuse to donate.\" National Fed'n of the Blind, 487 U.S. at 799, 108 S. Ct. at 2679. Although substantial, the City's interest in preventing affirmative misrepresentations is not precisely furthered by the broad disclosures compelled by the 1984 Ordinance.\n\nThe City could not defend the ordinance by contending that the tenets of Scientology are fantastic or false and by arguing as a consequence that its collection of funds under the cloak of religion is therefore fraudulent. The First Amendment precludes civil authorities from evaluating the truth or falsity of religious beliefs. United States v. Ballard, 322 U.S. 78, 85-88, 64 S. Ct. 882, 886-87, 88 L. Ed. 1148 (1944). Thus, the fact that Scientology's doctrine of \"exchange\" may appear to non-adherents as a crass rationalization to justify the enrichment of a few select leaders at the expense of neophytes provides no basis for imposing burdensome and entangling regulations for the \"benefit\" of church members who voluntarily choose to adhere to that doctrine. Nor, for that matter, could such an official perception of theological unsoundness justify regulation respecting church disclosure to non-members.\n\nThe City's brief does refer to certain evidence in the legislative record suggesting that Scientology's now-deceased founder L. Ron Hubbard and others may have been insincere in professing church doctrines. (Appellees' Br. at 5-12). Although the City does not rely upon the principle directly, the Supreme Court has long held that civil tribunals may adjudicate the sincerity with which a religious belief is held by an individual. See, e.g., United States v. Seeger, 380 U.S. 163, 185, 85 S. Ct. 850, 863, 13 L. Ed. 2d 733 (1965). We need not consider how a determination concerning the sincerity of an organization's religious beliefs might appropriately be made in support of a specific administrative adjudication consistent with the procedural requirements of due process. To the extent that such a determination as to a single church is the sole support for legislation having general applicability and effect, however, the law must be fatally imprecise. Even assuming that the commission properly relied upon a conclusion that Scientology's beliefs were insincere, a contention only implicitly advanced by the City in this appeal,\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e the imposition of recordkeeping and disclosure requirements upon all churches and charities engaged in public and private solicitation would burden a great deal of protected expression without serving any legitimate purpose. The law would not be narrowly tailored, for a blanket application of regulation cannot distinguish between \"fraudulent\" and sincere religions. Joseph H. Munson Co., 467 U.S. at 964-68, 104 S. Ct. at 2851-53; City Council v. Taxpayers for Vincent, 466 U.S. 789, 798 \u0026 n. 14, 104 S. Ct. 2118, 2125 \u0026 n. 14, 80 L. Ed. 2d 772 (1984). Moreover, any City interest in the administrative convenience of dispensing with an individualized determination concerning the sincerity of particular religious beliefs is not compelling. Memorial Hosp. v. Maricopa County, 415 U.S. 250, 267-69, 94 S. Ct. 1076, 1086-88, 39 L. Ed. 2d 306 (1974) (concluding that interest in convenient prevention of fraud did not justify denying health care benefits to all out-of-state immigrants in first year of residency).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e In addition, whatever evidence might appropriately be considered at such a hearing, religious adherents have never been required to show the sincerity with which their deceased prophets espoused religious revelations per se; only the sincerity of contemporary church leadership might properly be put in issue.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nOnly a few provisions of the 1984 Ordinance appear narrowly tailored to serve the City's compelling interest in preventing affirmative fraud. For example, Code § 100.05(1)(c) prohibits the \"use of any scheme or artifice to defraud or obtain money or property by means of any false statement or representation.\"\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Consistent with the dicta of Cantwell, 310 U.S. at 306, 60 S. Ct. at 904, and National Federation of the Blind, 487 U.S. at 799 n. 11, 108 S. Ct. at 2679 n. 11, we hold that the identifying disclosure requirements of Code § 100.03(1)(a), (b), (c) and (j) are narrowly tailored to prevent fraud by religious and charitable organizations. We therefore must reject Scientology's claim that the ordinance, as we have circumscribed it, impermissibly imposes discriminatory regulation of speech on the basis of the speaker's identity as a religion or charity. See Cox v. New Hampshire, 312 U.S. 569, 576, 61 S. Ct. 762, 766, 85 L. Ed. 1049 (1941).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nDespite many volumes of testimony and exhibits, however, there is simply nothing in the record to suggest that any more extensive regulation is necessary to control fraudulent conduct by charitable organizations than is available to sanction similar activities by other entities. See, e.g., United States v. Rasheed, 663 F.2d at 847-48 (affirming fraud convictions); Fla.Stat.Ann. §§ 812.012-812.021 (larceny, including fraud and false pretenses) (West 1993). One witness at the legislative hearings did testify that she would have abstained from membership in Scientology if more complete financial disclosure had been made available. [ See R5-108-Exh. 1-Vol. IV-71-73; see also id. at 345, 412-13.] To be sure, even when a speaker's express statements are truthful in the literal sense, wilful omissions which render those statements materially misleading half-truths may constitute fraud just as surely as overt falsehoods.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Even if we construed this and other testimony as evidence that Scientology's finances and operations were implicitly or explicitly misrepresented to members and contributors, however, we would not regard this conclusion as sufficient to justify the far-reaching regulation advanced by the City. In light of the potent but significantly less intrusive regulatory alternatives available to authorities for dealing with such fraud, the ordinance cannot be characterized as narrowly tailored. Nor has the City tried to explain why less restrictive alternatives like generally applicable penal laws that proscribe extortion, burglary, kidnapping and the like are inadequate to address its other asserted interests in controlling the alleged illegal and coercive conduct of charitable and religious organizations like Scientology. See, e.g., Sun Myung Moon, 718 F.2d at 1227 (affirming religious leaders' convictions for filing false tax returns, obstructing justice, perjury and making false statements and submitting false documents to government agencies);\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e United States v. Heldt, 215 U.S. App. D.C. 206, 668 F.2d 1238, 1241 n. 2, 1242, 1244 (D.C.Cir.1981) (per curiam) (affirming Scientologists' convictions for theft of government property and conspiracy to steal government property, to intercept oral communications, to forge United States government credentials, to burglarize offices of the Internal Revenue Service, the Department of Justice and a United States Attorney, to obstruct justice, to obstruct a criminal investigation, to harbor and conceal a fugitive and to make false declarations to a federal grand jury), cert. denied, 456 U.S. 926, 102 S. Ct. 1971, 72 L. Ed. 2d 440 (1982); Fla.Stat.Ann. §§ 812.021(1)(e), 836.05 (extortion and obtaining property thereby), 810.011-810.115 (burglary and trespass), 787.01-787.02 (kidnapping and false imprisonment) (West 1993).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Thus, we conclude that the City has not carried its burden of showing that the required financial, operational and organizational disclosures are narrowly tailored to serve compelling interests. Those provisions are therefore void even under the strict scrutiny of the Free Exercise Clause.\n\nIX. PRIOR RESTRAINT\n\nScientology contends that the city clerk's discretion in administering the prospective disclosure requirements for obtaining a registration certificate is overly broad, and therefore constitutes an impermissible prior restraint of religion. The City contends that the ordinance's provision allowing continued solicitation pending judicial review through an action for declaratory judgment, Code § 100.03(3), makes the clerk's denial of a registration statement an insignificant act.\n\nA system of licensing speech or religious activity may be upheld against First Amendment challenge only if the criteria for denying a license are narrowly tailored to serve compelling governmental interests. See, e.g., Joseph H. Munson Co., 467 U.S. at 967-68 \u0026 n. 13, 104 S. Ct. at 2852-53 \u0026 n. 13; Fernandes v. Limmer, 663 F.2d at 628. Closely related to this requirement, although distinct, is the rule that \"such a scheme may not delegate overly broad licensing discretion to a government official.\" Forsyth County v. Nationalist Movement, U.S., 112 S. Ct. 2395, 2401, 120 L. Ed. 2d 101 (1992); see also, e.g., Saia v. New York, 334 U.S. 558, 68 S. Ct. 1148, 92 L. Ed. 1574 (1948).\n\nThe requirement of definite and precise standards to guide regulations of speech is distinct from the procedural requirements imposed by Freedman v. Maryland, 380 U.S. 51, 85 S. Ct. 734, 13 L. Ed. 2d 649 (1965), and its progeny.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e See, e.g., City of Lakewood v. Plain Dealer Publishing Co., 486 U.S. 750, 771, 108 S. Ct. 2138, 2151-52, 100 L. Ed. 2d 771 (1988). For whether speech is prohibited before the exercise of judicial review functions or after, the effect of such a ban is to impose a prior restraint. Moreover, a vague law is not rendered more precise by virtue of a court having passed upon its application to particular facts. Rather, such a process merely shifts the exercise of impermissibly broad discretion from executive officials to judges, a shift that has no significance in First Amendment jurisprudence. Baggett v. Bullitt, 377 U.S. 360, 373, 84 S. Ct. 1316, 1323, 12 L. Ed. 2d 377 (1964) (\"judicial safeguards do not neutralize the vice of a vague law\" under the First Amendment); see also, e.g., Maynard v. Cartwright, 486 U.S. 356, 364, 108 S. Ct. 1853, 1859, 100 L. Ed. 2d 372 (1988) (holding that judicial finding of factual basis for death sentence did not cure vagueness in criteria for penalty determination); cf. Vance v. Universal Amusement Co., 445 U.S. 308, 317, 100 S. Ct. 1156, 1162, 63 L. Ed. 2d 413 (1980) (per curiam) (requiring procedural safeguards for judicial injunctions of speech). Indeed, we note that declaratory judgment under Fla.Stat.Ann. § 86.011 (West 1993) is itself a discretionary remedy, and the circuit court's decision to grant or deny review is accorded great deference. E.g., Travelers Ins. Co. v. Emery, 579 So. 2d 798, 800-01 (Fla.Dist.Ct.App.1991).\n\nNevertheless, the limited prospective disclosure requirements of identifying information under Code § 100.03(1)(a), (b), (c) and (j), which we have held to be otherwise permissible against the religion clause challenges raised by Scientology, are not void for vagueness. It is a purely ministerial function to determine whether a registration form provides a statement of the nature and identity of the organization, its tax-exempt status, other Florida cities in which it is registered, and the criminal histories of its officers and solicitors. The ordinance on its face provides the clerk with no authority to make an investigation of the truthfulness of these statements or an evaluation of their completeness, and Scientology has not pointed to evidence that responsible administrative officials have inferred such authority. Nor may the clerk pass judgment upon the truthfulness or persuasiveness of any proffered explanation under Code § 100.03(1)(n) why such information is not available to be disclosed. Thus, the clerk has no latitude to engage in invidious discrimination against disfavored speakers or religions. Cf., e.g., Cox v. Louisiana, 379 U.S. 536, 557-58, 85 S. Ct. 453, 466, 13 L. Ed. 2d 471 (1965). In this respect the district court's order upholding the ordinance is affirmed.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nX. REFUND POLICY REGULATIONS\n\nAs part of its doctrine of \"exchange,\" Scientology collects payments from adherents whenever they receive religious services or training. As a corollary to that doctrine, the organization has a practice of offering to refund the payments to anyone who is not satisfied with the spiritual benefits he or she derives from such services. Scientology challenges the provision of the 1984 Ordinance requiring that it provide a written statement of any refund policy \"at the time such representation is made.\" Code § 100.05(1)(g). It also objects to the provision mandating that money be returned within sixty days of request. Code § 100.05(1)(f). Wilful violations of these provisions are criminal offenses. Code § 100.05(2).\n\nThe district court recognized, and the parties agree, that the City may not require an organization to adopt a refund policy in the first instance. 756 F. Supp. at 1523. Scientology contends that the ordinance \"both mandates the manner in which a church policy is communicated to a church member ..., and engrafts an additional condition upon the church policy, i.e., a time limit in which to make the refund.\" (Appellant's Br. at 24). The City contends that it has a compelling interest in preventing fraudulent offers of refunds that justifies the provisions.\n\nA. Standard of Judicial Review\n\nUnder the Free Exercise Clause we apply strict scrutiny to legislation that imposes a substantial burden on the observation of a religious belief or practice. Hernandez, 490 U.S. at 699, 109 S. Ct. at 2148. (As already noted, the more lenient standard of Smith is inapplicable to the 1984 Ordinance). Solicitation of funds by religious organizations is protected religious expressive activity under the First Amendment. See Murdock, 319 U.S. at 108-12, 63 S. Ct. at 872-74; Cantwell, 310 U.S. at 303-05, 60 S. Ct. at 903-04. There can be no contention that the practice of \"exchange\" in the solicitation of funds in connection with religious services and training is anything other than central to Scientology's religious practice, because \"it is not within the judicial ken to question the centrality of particular beliefs or practices to a faith, or the validity of particular litigants' interpretations of those creeds.\" Hernandez, 490 U.S. at 699, 109 S. Ct. at 2149.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nB. Discussion\n\nWe have held above that the City has a compelling interest in preventing affirmatively fraudulent conduct but no interest in regulating religious conduct as such. The legislative history contains substantial evidence that the refund policy had not been followed as promised, with the consequence that many contributors were deprived of their money by their reliance on statements appearing to be incomplete or only half-true. For instance, it appears that most contributors were not informed of the substantial procedural obstacles placed before applicants seeking refunds from Scientology, [ see R5-108-Exh. 1-Vol. II-205-06,] and some contributors who had previously signed prospective waiver forms may have been led to the erroneous belief that their refund rights would be unaffected, [ see id. Vol. III-79-81.] As we have already pointed out, wilful omission of such material facts constitutes fraud. The clear scope of Code § 100.05(1)(g)'s requirement that solicitors provide \"a written statement of the terms and conditions upon which refunds are made\" at the time when a refund promise is given encompasses the very sort of deception revealed at the hearings. We agree with the commission's apparent conclusion that requiring a complete and contemporaneous written statement will help substantially in preventing subtle and overt misrepresentations about the substance of a refund policy.\n\nTo the extent that the ordinance requires the statement to be contemporaneous with the offer of a refund, it merely duplicates the generally applicable principle that one may not wilfully and fraudulently omit material facts in the course of attempting to secure money from others. The requirement that the statement be given in writing goes beyond otherwise applicable law, but is narrowly tailored to meet the specific problems presented by the sophisticated practices of coercion, deception and psychological manipulation of groups like Scientology. This particular provision does not, by itself, require civil authorities to attempt to interpret or apply a church policy, an undertaking that is forbidden under both religion clauses by Serbian Diocese, 426 U.S. at 713, 96 S. Ct. at 2382.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Moreover, we can think of no significantly less restrictive alternative proposal for combatting this established evil, particularly in view of the fact that the restriction on religious practice is sharply reduced by the limited role that civil authorities may play in enforcing such a policy.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e The provision is closely fitted to serve its evident purposes, and the need for regulation is supported by actual evidence. This limited and precise disclosure provision, based on empirical evidence of actual abuses, is valid under the First Amendment. Cf. Peel v. Attorney Registration \u0026 Disciplinary Comm'n, 496 U.S. 91, 106-11, 110 S. Ct. 2281, 2290-93, 110 L. Ed. 2d 83 (1990) (plurality opinion); id., 496 U.S. at 112-1, 110 S. Ct. at 2294-95 (Marshall, J., concurring) (analyzing reasonable regulation of commercial speech). The district court's order granting summary judgment to the City and denying summary judgment to Scientology is affirmed in this respect.\n\nThe City concedes that it may not require a church to adopt a refund policy or dictate the terms of a policy voluntarily adopted. Yet Code § 100.01(5)(g) would require a policy of refunding money within sixty days of request whenever a refund policy is adopted, a course of conduct at odds with Scientology's current policy of submitting refund requests to a church authority that determines the bona fides of the request and counsels the member who is dissatisfied with the spiritual benefits he has received. [R5-110-Tab 1-2-3.] The statute has the principal effect of mandating a church policy, an effect on the free exercise of religion which is sufficiently direct to implicate our strict scrutiny. In this respect it differs from the incidental financial burden upon free exercise imposed by generally applicable, neutrally applied taxation laws like the sales tax upheld in Jimmy Swaggart, and the non-deductibility and exemption provisions construed in Hernandez and Bob Jones. In addition, we also note that the mandated policy would be especially burdensome in cases where a refund is requested many years after the contribution is given,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e for by imposing potentially limitless contingent liabilities the provision would significantly undermine the security of a church's finances.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nThe sixty-day refund is not narrowly tailored to serve the City's compelling interests. Although we agree that the provision conceivably might help to deter or remedy fraud, those interests are far better served by the less restrictive alternatives of requiring written disclosure of whatever policy the church adopts and enforcing generally applicable anti-fraud laws to the extent permitted by the First Amendment. Cf., e.g., Ballard, 322 U.S. at 85-88, 64 S. Ct. at 886-87; Dovydenas v. The Bible Speaks (In re The Bible Speaks), 869 F.2d 628, 643-44, 645-46 (1st Cir.), cert. denied, 493 U.S. 816, 110 S. Ct. 67, 107 L. Ed. 2d 34 (1989); Founding Church of Scientology, 409 F.2d at 1161, 1163-64; Van Schaick v. Church of Scientology, 535 F. Supp. 1125, 1140, 1141 (D.Mass.1982).\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e At best the provision affords only marginal additional benefits beyond those already conferred by other regulation. See City of Cincinnati v. Discovery Network, U.S., 113 S. Ct. 1505, 1515, 123 L. Ed. 2d 99 (1993) (commercial speech case). Instead, the provision advances the City's illegitimate goal of dictating to churches what the policy shall be, simultaneously imposing its own enforcement mechanisms in support of the mandated policy. The provision is void under the Free Exercise Clause,\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e and the district court's order granting the City's motion for summary judgment and denying Scientology's motion for summary judgment is reversed in this respect.\n\nXI. CONCLUSION\n\nWith the exception of the limited prospective disclosure of identifying information, the provisions of the 1984 Ordinance requiring prospective and retrospective disclosure and recordkeeping concerning solicitations directed toward members and the public foster an excessive entanglement between government and religion in violation of the Establishment Clause, substantially interfere in church organization without compelling justification in violation of the Free Exercise Clause, and are therefore void as applied to churches. The requirement of the otherwise valid disclosure in the registration form, however, does not impermissibly restrain free speech and religion by conferring undue discretionary power to deny a certificate. The district court's order upholding these provisions against the claim of vagueness is affirmed, although its order is vacated with respect to the invalid disclosure requirements.\n\nThe mandatory sixty-day refund provision is an impermissible intrusion on Scientology's free exercise of religion and is void as applied to churches. The requirement of providing a written statement of a refund policy, however, is otherwise valid. Upon remand, the district court should determine, consistent with this opinion, whether the 1984 Ordinance was enacted with impermissible sectarian motives. If the district court finds a predominantly or pre-eminently sectarian motive then it should permanently enjoin the City from enforcing the ordinance. If the district court finds no such motive then it should consider which of the otherwise valid provisions, if any, may appropriately be preserved by the ordinance's severability clause.\n\nAFFIRMED in part, VACATED in part, REVERSED in part, and REMANDED.\n\nDisposition\n\nAFFIRMED in part, VACATED in part, REVERSED in part, and REMANDED.\n\n\u003cspan class=\"fn\"\u003e1. Defendants are the City of Clearwater, its city attorney Milton A. Galbraith, Jr., as successor to Thomas Bustin, and city clerk Cynthia Goudeau, as successor to Lucille Williams.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We reasoned that the filing of the lawsuit had caused the City to amend the 1983 Ordinance in a manner that significantly affected the legal relationship between the parties. Therefore, Scientology was a \"prevailing party\" under 42 U.S.C. § 1988 and presumptively entitled to an award of attorney fees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Fifth Circuit decisions rendered by Unit A of that court after September 30, 1981, are not binding upon this court, but they are persuasive authority. Stein v. Reynolds Sec., Inc., 667 F.2d 33, 34 (11th Cir.1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although the relevant provision of the 1984 Ordinance substituted the phrase \"shall investigate ... only after receiving ten bona fide complaints\" for the apparently equivalent language in the 1983 Ordinance providing that the city attorney \"may investigate ... upon receiving ten bona fide complaints,\" the City adopted the position in Scientology-Clearwater II that this change removes all discretion from the city attorney. Nevertheless, it appears that the prosecutor retains unreviewable discretion to determine whether a complaint is \"bona fide.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. While Scientology argues on appeal that the entire 1984 Ordinance is unconstitutional, its brief challenges certain provisions only. See generally Code §§ 100.01(2), 100.01(3), 100.02(3)(c), 100.03(1), 100.03(1)(a), (b), (c), (d), (j) and (n), 100.03(2), 100.03(3), 100.03(4), 100.03(7), 100.03(8), 100.04, 100.05(1)(b), (f) and (g), 100.05(2), 100.06, 100.06(1), and 100.06(2). It is these provisions that we confront. All other provisions of the 1984 Ordinance not specifically addressed or encompassed by this opinion remain valid should the district court on remand determine that (1) the 1984 Ordinance was enacted without a discriminatory purpose and (2) the remaining provisions are severable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Compare Suter v. Artist M., U.S., 112 S. Ct. 1360, 118 L. Ed. 2d 1 (1992) (holding § 1983 remedy unavailable for violation of vaguely defined statutory \"right\") with Wilder v. Virginia Hosp. Ass'n, 496 U.S. 498, 508-10, 110 S. Ct. 2510, 2516-17, 110 L. Ed. 2d 455 (1990) (finding definite and enforceable \"right\") and Wright v. Roanoke Redev. \u0026 Hous. Auth., 479 U.S. 418, 431-32, 107 S. Ct. 766, 774-75, 93 L. Ed. 2d 781 (1987) (finding specific enforceable \"right\" defined by administrative regulations that clarified statutory language).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Compare Dennis v. Higgins, 498 U.S. 439, 449, 111 S. Ct. 865, 872, 112 L. Ed. 2d 969 (1991) (Commerce Clause creates rights enforceable under § 1983) and Boston Stock Exch. v. State Tax Comm'n, 429 U.S. 318, 321 n. 3, 97 S. Ct. 599, 603 n. 3, 50 L. Ed. 2d 514 (1977) (victims of discriminatory taxation are within \"zone of interests\" protected by Commerce Clause) with Golden State Transit Corp. v. City of Los Angeles, 493 U.S. 103, 110 S. Ct. 444, 107 L. Ed. 2d 420 (1989) (Supremacy Clause by itself was intended to provide no enforceable \"rights\" under § 1983) and Chapman v. Houston Welfare Rights Org., 441 U.S. 600, 99 S. Ct. 1905, 60 L. Ed. 2d 508 (1979) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This newly articulated principle that creation of the appearance of official disapproval for a sect may constitute a violation of the Establishment Clause appears to have overruled in part Church of Scientology v. Cazares, 638 F.2d 1272 (5th Cir. Mar.1981), in which the court held that defamatory public condemnation by former Clearwater mayor Gabriel Cazares did not violate Scientology's civil rights and could not, consistent with the mayor's freedom of expression, be condemned under state law. See also Aguillard, 482 U.S. at 585, 107 S. Ct. at 2578; cf. Lee v. Weisman, U.S., 112 S. Ct. 2649, 2655-57, 120 L. Ed. 2d 467 (1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In any event, we are not inclined to accord too much weight to Palmer. Four Justices dissented and Justice Blackmun's concurrence makes clear that he joined the majority only because facts developed in the record and conceded at oral argument rebutted the allegation of discriminatory motive. 403 U.S. at 228-30, 91 S. Ct. at 1946-47 (Blackmun, J., concurring). See generally Underwood v. Hunter, 730 F.2d 614, 617 n. 7 (11th Cir.1984), aff'd, 471 U.S. 222, 105 S. Ct. 1916, 85 L. Ed. 2d 222 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. A sharply divided Court recently relied on O'Brien for guidance in evaluating regulation of non-verbal expressive conduct, such as burning draft cards or dancing nude, that also has significant components lacking expressive content. See Barnes v. Glen Theatre, Inc., U.S., 111 S. Ct. 2456, 115 L. Ed. 2d 504 (1991). Only Justice Souter alluded to O'Brien 's holding concerning legislative purpose, although he would have recognized that illicit purpose is dispositive in the Establishment Clause context. Id., U.S. at \u0026 n. 1, 111 S. Ct. at 2469 \u0026 n. 1 (Souter, J., concurring in the judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although the Former Fifth Circuit had previously held that hearsay newspaper articles are ordinarily not competent evidence that a court may consider in ruling on a motion for summary judgment under Federal Rule of Civil Procedure 56(e), Pan-Islamic Trade Corp. v. Exxon Corp., 632 F.2d 539, 556-57 (5th Cir.1980), cert. denied, 454 U.S. 927, 102 S. Ct. 427, 70 L. Ed. 2d 236 (1981); cf. Victoria L. ex rel. Carol A. v. District School Bd., 741 F.2d 369, 373 (11th Cir.1984) (dictum), this holding appears to have been overruled in part by Celotex. See Pennington v. Vistron Corp., 876 F.2d 414, 426 \u0026 n. 15 (5th Cir.1989) (assuming for purposes of argument that hearsay medical journal article was competent to counter motion for summary judgment). While decisions of the Fifth Circuit rendered before October 1, 1981, are binding upon panels of this court, Bonner v. City of Prichard, 661 F.2d 1206, 1209 (11th Cir.1981) (en banc), we must disregard them if necessary to give effect to a decision of the Supreme Court of the United States. E.g., United States v. Giltner, 972 F.2d 1563, 1566 (11th Cir.1992). Celotex does not modify Pan-Islamic with respect to the materials that may be submitted by the moving party. As noted, we express no opinion concerning the admissibility of these materials at trial, a matter that is initially committed to the sound discretion of the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Epperson v. Arkansas, 393 U.S. 97, 98, 89 S. Ct. 266, 267, 21 L. Ed. 2d 228 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Those concerns included the scope of the recordkeeping burden, the potential for governmental entanglement in matters of church organization, the adequacy of existing anti-fraud statutes, the need to avoid governmental participation in intra-denominational disputes, the questionable constitutionality of the measure and the likelihood of expensive litigation to defend it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The tone of that discussion was apparently determined at the outset when then-Mayor Charles LeCher took the opportunity to remind the assembly of the Scientology lawyer's allegiance. [R1-18-Exh. HH-57; see also R5-108-Exh. 1-Vol. I-15-17 (transcript of denial of Scientology motion for leave to make opening statement at televised hearings); id. Exh. 2-Tape 1 (videotape of same).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Shoemaker apparently was not a voting member of the commission, although he and Bustin participated as panelists in the televised hearings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Speaking on the subject of Scientology, Calderbank said, \"the public record gives us a reason to enact ordinances to make sure fraud is not used in solicitation and the money goes for charitable purposes.\" [R1-18-Exh. D-32.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. LeCher was not mayor when the commission voted to adopt the ordinances. He did, however, oversee the televised legislative hearings that preceded his defeat by former commissioner Kelly in 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Tenney was not a member of the commission during the hearings or when it voted to adopt the ordinances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Other evidence of animus toward Scientology can be found in the commission's derisive response to letters submitted by the group at the hearings. CALDERBANK: There's a typo on the second page of the one where it says it should be. We really could return this. (giggling from a woman). GARVEY: I think you should get a paper shredder (to Flynn)[.] FLYNN: Among other things.... [R1-18-Exh. N1-20; see also, e.g., R5-108-Exh. 1-Vol. I-249-50.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. These references to the record do not reflect the only evidence tending to support Scientology's position. [ See generally, e.g., R5-108-Exh. 1 (transcript of hearings).] We express no opinion about the magistrate judge's discovery orders denying Scientology's motion to compel deposition testimony concerning the legislators' subjective thought processes. [R6-132; R5-115.] But see Jaffree, 472 U.S. at 56-57, 105 S. Ct. at 2490 (sponsor of legislation \"confirmed this purpose before the District Court\"); cf., e.g., Branch v. Tunnell, 937 F.2d 1382, 1385-88 (9th Cir.1991) (discussing prerequisites for discovery concerning subjective intent or motive in a suit against officials who may also be entitled to qualified immunity based on objective considerations, and citing cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Scientology raises a large portion of its revenues through its Clearwater activities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. As already noted, the optional private statement for member solicitations is equally as offensive as the alternative public disclosure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. For example, the Court in Felton condemned government entanglement in the administration of benefits to religious schools even though the schools could have escaped the entanglement by foregoing the benefits and despite the fact that the government was under no obligation to provide such benefits in the first instance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Both Watson and Gonzalez were decided before the religion clauses had been deemed applicable to the states by virtue of their incorporation into the Fourteenth Amendment. As a case arising under the diversity jurisdiction of the federal courts prior to the ruling in Erie R. Co. v. Tompkins, 304 U.S. 64, 58 S. Ct. 817, 82 L. Ed. 1188 (1938), the decision in Watson was reached by reference to general principles of common law. Gonzalez was decided under the Court's appellate jurisdiction over the inferior courts of the Philippines and applied the same principles. In Kedroff the Court adopted Watson, as elaborated in Gonzalez, as federal constitutional law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We have no need to consider the validity of other governmental regimes for disclosure of financial information by churches, such as that imposed by the Internal Revenue Service in administering 26 U.S.C. § 501(c)(3), which was evaluated against a claim of excessive entanglement by neither the Ninth Circuit in Church of Scientology v. Commissioner nor the Supreme Court in Bob Jones University v. United States, 461 U.S. 574, 604 n. 30, 103 S. Ct. 2017, 2035 n. 30, 76 L. Ed. 2d 157 (1983). See generally, e.g., Rev.Rul. 89-74, 1989-1 C.B. 311 (explaining I.R.S. treatment of exemptions or deductions claimed in relation to \"churches\" that actually constitute tax shelters). Such regimes may or may not be distinguishable from the City's in a number of respects, such as the scope or detail of required disclosure, the mechanisms for monitoring and enforcement and the confidentiality which routine filings are accorded. See, e.g., 26 U.S.C. §§ 508(c)(1)(A), 6033(a)(2)(A)(i), 6042, 6049(b)(2)(C)(i), (b)(4)(B), 6050N(c), 6104, 7611;Rev.Proc. 86-23, 1986-1 C.B. 564; cf. Hernandez, 490 U.S. at 696-98 \u0026 n. 12, 109 S. Ct. at 2147-48 \u0026 n. 12 (holding that determination of quid pro quo nature of religious contributions in administering 26 U.S.C. § 170 threatened no excessive entanglement).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See Hobbie v. Unemployment Appeals Comm'n, 480 U.S. 136, 141-42, 107 S. Ct. 1046, 1049, 94 L. Ed. 2d 190 (1987); United States v. Lee, 455 U.S. 252, 257-58, 102 S. Ct. 1051, 1055, 71 L. Ed. 2d 127 (1982); Thomas v. Review Bd., 450 U.S. 707, 717-19, 101 S. Ct. 1425, 1431-33, 67 L. Ed. 2d 624 (1981); Wisconsin v. Yoder, 406 U.S. 205, 220-21, 92 S. Ct. 1526, 1535-36, 32 L. Ed. 2d 15 (1972); Gillette v. United States, 401 U.S. 437, 462, 91 S. Ct. 828, 842, 28 L. Ed. 2d 168 (1971); see also West Va. State Bd. of Educ. v. Barnette, 319 U.S. 624, 639, 63 S. Ct. 1178, 1186, 87 L. Ed. 1628 (1943).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Davis v. Beason, 133 U.S. 333, 10 S. Ct. 299, 33 L. Ed. 637 (1890); Reynolds v. United States, 98 U.S. 145, 25 L. Ed. 244 (1879). To the extent that Davis may have interpreted the Establishment Clause (as distinct from the Free Exercise Clause) as subordinate to state regulation of \"acts recognized by the general consent of the Christian world in modern times as proper matters for prohibitory legislation,\" 133 U.S. at 343, 10 S. Ct. at 301, 33 L. Ed. at 640, we regard it as no longer controlling. Neither Davis nor Reynolds presented issues of Establishment Clause concern, as those concerns are understood in contemporary decisions like Lemon.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Prince v. Massachusetts, 321 U.S. 158, 64 S. Ct. 438, 88 L. Ed. 645 (1944); United States v. Lee, 455 U.S. 252, 257-58, 102 S. Ct. 1051, 1055, 71 L. Ed. 2d 127 (1982); United States v. Sun Myung Moon, 718 F.2d 1210, 1227 (2d Cir.1983), cert. denied, 466 U.S. 971, 104 S. Ct. 2344, 80 L. Ed. 2d 818 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Grosz v. City of Miami Beach, 721 F.2d 729 (11th Cir.1983), cert. denied, 469 U.S. 827, 105 S. Ct. 108, 83 L. Ed. 2d 52 (1984); Lakewood Congregation of Jehovah's Witnesses v. City of Lakewood, 699 F.2d 303, 303 \u0026 n. 1 (6th Cir.), cert. denied, 464 U.S. 815, 104 S. Ct. 72, 78 L. Ed. 2d 85 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The bulk of the constitutional analysis in Bob Jones addressed the government's compelling interest in preventing racial discrimination, which the Court held was served by a narrowly tailored regulation denying religious and charitable tax exemptions to discriminatory schools and colleges. This discussion applied the Free Exercise Clause. The Court also found the regulation permissible under Lemon 's effects criterion of Establishment Clause analysis because it was \"founded on a neutral, secular basis.\" 461 U.S. at 604 n. 30, 103 S. Ct. at 2035 n. 30 (quoting Gillette, 401 U.S. at 452, 91 S. Ct. at 837). Nothing in Bob Jones suggests a holding that regulations which are otherwise impermissible under Lemon may be justified by showing their close fit to a compelling interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See also Brundage v. Deardorf, 92 F. 214, 228-30 (6th Cir.1899).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In addition, of course, \"the freedom to hold religious beliefs and opinions is absolute.\" Braunfeld v. Brown, 366 U.S. 599, 603, 81 S. Ct. 1144, 1146, 6 L. Ed. 2d 563 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The exemption provided by Code § 100.02(1) for volunteer and small scale organizations is a denominational preference favoring such groups at the expense of larger denominations. Scientology has not challenged the exemption directly and the City has articulated no justification, compelling or otherwise, in support of this classification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Moreover, to the extent that the concerns presented in the instant case are similar to the concerns implicated in Valente, we believe our holding in this case--regarding which disclosures pass muster and which are too intrusive--is consistent with Valente. See Valente, 456 U.S. at 253-54 \u0026 n. 29, 102 S. Ct. at 1688 \u0026 n. 29. We believe the same can be said with respect to Village of Schaumburg, supra, and the other strict scrutiny cases relied upon by the city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See NAACP v. Alabama, 357 U.S. at 463, 78 S. Ct. at 1172; Sweezy v. New Hampshire, 354 U.S. 234, 265, 77 S. Ct. 1203, 1219, 1 L. Ed. 2d 1311 (1957) (Frankfurter, J., concurring) (\"For a citizen to be made to forego even a part of so basic a liberty as his political autonomy, the subordinating interest of the State must be compelling.\") That expansion was not explicitly accomplished until Sherbert was decided in 1963. Cf. Thomas v. Collins, 323 U.S. 516, 530, 65 S. Ct. 315, 323, 89 L. Ed. 430 (1945).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. We therefore need not consider whether the lenient review envisioned by Smith embodies the appropriate standard for assessing criminal laws that merely enforce malum prohibitum regulatory provisions like these, or whether Smith is limited to malum in se offenses like the drug crimes there at issue. In other words, we do not decide whether the government may evade strict scrutiny of particular regulatory statutes merely by employing more severe criminal sanctions. See Yoder, 406 U.S. at 220-22, 92 S. Ct. at 1535-36 (applying strict scrutiny to mandatory schooling law); cf. Smith, 494 U.S. at 884, 110 S. Ct. at 1603 (\"Whether or not the [Court's precedents requiring strict scrutiny] are ... limited [to unemployment benefit decisions], they at least have nothing to do with an across-the-board criminal prohibition on a particular form of conduct.\"). But cf. Montgomery v. County of Clinton, 743 F. Supp. 1253, 1259 \u0026 n. 5 (W.D.Mich.1990) (applying Smith as if it had overruled Yoder), aff'd without opinion, 940 F.2d 661 (6th Cir.1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Associational interests protected by the religion clauses stand on equal footing with protected political rights. NAACP v. Alabama, 357 U.S. at 460-61, 78 S. Ct. at 1171.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The City has conceded \"for purposes of the summary judgment motion\" that \"Scientology's beliefs, as opposed to its actions, are religious in character.\" (Appellees' Br. at 15).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See also Kraft Gen. Foods, Inc. v. Iowa Dep't of Revenue \u0026 Fin., U.S., 112 S. Ct. 2365, 2371-72, 120 L. Ed. 2d 59 (1992) (holding that avoiding \"marginal loss in convenience\" does not constitute a \"compelling justification\" for discrimination against foreign commerce); Estelle v. Williams, 425 U.S. 501, 505, 96 S. Ct. 1691, 1693, 48 L. Ed. 2d 126 (1976) (finding that convenience to jail administrators is no \"essential state policy\" imposing a \"substantial need\" sufficient to justify requiring the wearing of jail clothing at criminal trials); Stanley v. Illinois, 405 U.S. 645, 653-58, 92 S. Ct. 1208, 1213-16, 31 L. Ed. 2d 551 (1972); Bell v. Burson, 402 U.S. 535, 91 S. Ct. 1586, 29 L. Ed. 2d 90 (1971); Carrington v. Rash, 380 U.S. 89, 85 S. Ct. 775, 13 L. Ed. 2d 675 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. We express no opinion concerning whether a finding of insincere belief would validate the regulation imposed by this ordinance, nor do we decide its validity as applied to non-religious voluntary associations engaged in protected speech activities. The Supreme Court has noted that a regulatory scheme requiring such inquiries into the beliefs of an entire religion may itself pose a risk of excessive government entanglement. E.g., Bob Jones, 461 U.S. at 604 n. 30, 103 S. Ct. at 2035 n. 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The validity of this provision is not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. We recognize the tension between cases addressing regulation of charitable and religious solicitation like Cantwell and National Federation of the Blind, on the one hand, and cases addressing more broadly applicable regulation of speech like Talley v. California, 362 U.S. 60, 63-64, 80 S. Ct. 536, 538, 4 L. Ed. 2d 559 (1960), in which the Court has held that a speaker may not be forced to identify himself as a condition of obtaining a license to sell or distribute books, handbills and the like even for the purpose of preventing fraud. Cf. Thornburgh v. American College of Obstetricians \u0026 Gynecologists, 476 U.S. 747, 767, 106 S. Ct. 2169, 2182, 90 L. Ed. 2d 779 (1986) (\"the Court consistently has refused to allow government to chill the exercise of constitutional rights by requiring disclosure of protected, but sometimes unpopular, activities\"); Hynes v. Mayor \u0026 Council of Borough of Oradell, 425 U.S. 610, 624-30 \u0026 n. 2, 96 S. Ct. 1755, 1763-65 \u0026 n. 2, 48 L. Ed. 2d 243 (1976) (Brennan, J., concurring) (finding \"substantial questions whether identification requirements\" for charitable solicitation were \"so adequately related to their purpose as to withstand First Amendment challenge\"). We do not attempt to reconcile the two lines of cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See, e.g., Virginia Bankshares, Inc. v. Sandberg, U.S., \u0026 n. 7, 111 S. Ct. 2749, 2761 \u0026 n. 7, 115 L. Ed. 2d 929 (1991); United States v. Sampson, 371 U.S. 75, 77 \u0026 n. 3, 83 S. Ct. 173, 174 \u0026 n. 3, 9 L. Ed. 2d 136 (1962); United States v. Romano, 736 F.2d 1432, 1439 (11th Cir.1984), vacated in other respects as moot, 755 F.2d 1401 (11th Cir.1985) (per curiam); United States v. Martino, 648 F.2d 367, 393 (5th Cir. June 1981), vacated in other respects as moot sub nom. United States v. Holt, 650 F.2d 651 (5th Cir. July 1981) (per curiam), and aff'd on other grounds sub nom. Russello v. United States, 464 U.S. 16, 104 S. Ct. 296, 78 L. Ed. 2d 17 (1983); Adams v. G.D. Searle \u0026 Co., 576 So. 2d 728, 730 (Fla.Dist.Ct.App.), review denied, 589 So. 2d 290 (Fla.1991); Whigham v. Muehl, 500 So. 2d 1374, 1379-81 (Fla.Dist.Ct.App.1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. We respectfully express no approval of Sun Myung Moon to the extent that the Second Circuit's opinion could be read to authorize a jury to displace a church's sincere determination of appropriate religious purposes under the terms of a charitable trust, 718 F.2d at 1225-27. See Serbian Diocese, 426 U.S. at 713, 96 S. Ct. at 2382.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Cf. Church of Scientology v. Armstrong, 232 Cal.App.3d 1060, 283 Cal.Rptr. 917, 925 (1991) (disaffiliated church worker's reasonable fear of physical harm to himself and his family justified his taking of church records and rebutted Scientology's tort claims of conversion and invasion of privacy), review denied, (Cal. Oct. 17, 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. A system of prior restraint must guarantee prompt and final judicial review of an executive determination to deny a license, so that an erroneous abridgment of freedom of speech may be corrected as quickly as reasonably possible in the adversarial setting of a courtroom. E.g., National Fed'n of the Blind, 487 U.S. at 802, 108 S. Ct. at 2680-81. In most circumstances, the scheme must place upon the government the burden of initiating such proceedings and demonstrating the propriety of the restraint. See FW/PBS, Inc. v. City of Dallas, 493 U.S. 215, 225-27, 110 S. Ct. 596, 604-07, 107 L. Ed. 2d 603 (1990) (three-Justice opinion of O'Connor, J.); id., 493 U.S. at 238-42, 110 S. Ct. at 611-13 (three-Justice opinion of Brennan, J.). Scientology has not challenged the procedural safeguards adopted in the 1984 Ordinance, and we therefore express no opinion concerning them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. We express no opinion concerning the degree of discretion afforded the clerk to review disclosures that we have held cannot be required in any event. To the extent that the district court's order addressed these provisions it is vacated as moot. Scientology has not argued that the circuit court's authority to excuse disclosure on grounds of \"special or unique hardship to the charitable organization,\" Code § 100.03(4), embodies impermissible discretion and we therefore express no opinion as to that provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. We therefore need not consider the Fifth Circuit's conclusion in ISKCON-Houston that \"conduct relating to the solicitation of funds from the public [is] primarily a secular function.\" 689 F.2d at 556. Nor must we address the significance of this conclusion in considering the impact of solicitation regulation upon freedoms protected by other aspects of the First Amendment. Cf. National Fed'n of the Blind, 487 U.S. at 789, 108 S. Ct. at 2673; Citizens for a Better Environment, 444 U.S. at 632, 100 S. Ct. at 834.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The requirement of a written statement thus fosters no excessive entanglement under the Establishment Clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. We have no occasion in this appeal to consider the circumstances in which the terms of such a policy might appropriately be construed or applied by a civil court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The 1984 amendment eliminated a clause restricting the mandatory sixty day refund to cases in which the request is made within a \"reasonable\" time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Unlike the district court, 756 F. Supp. at 1522-23, we do not believe that the non-deductibility of such contributions under the Internal Revenue Code following Hernandez is at all material.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Not coincidentally, the plaintiff in Van Schaick was also a client of Flynn's and a witness at the televised hearings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. We therefore need not consider the Establishment Clause implications of the provision.\u003c/span\u003e\n\n",
    "body_length": 145942,
    "citedas": [
      "2 F.3d 1514"
    ],
    "attorneys": "For Plaintiff-Appellant: Paul B. Johnson, JOHNSON \u0026 JOHNSON, Tampa, FL. Eric M. Lieberman, Edward Copeland, RABINWITZ, BOUDIN, STANDARD, ET AL., New York, NY 10003-9518. For Defendants-Appellees: Alan S. Zimmett, SARGENT, REPKA \u0026 COVERT, Clearwater, FL. M.A. Galbraith, Jr., City Attorney, Clearwater, FL. Lawrence R. Velvel, Nasha, New Hampshire.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Anderson and Dubina, Circuit Judges, and Clark, Senior Circuit Judge.",
    "citation_count": 78
  }
}
