{
  "id": "4KFeR2YBTlTomsSBqP58",
  "document": {
    "title": "People v. Pride",
    "full_title": "THE PEOPLE AND v. TIMOTHY PRIDE AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-08-06T00:00:00.000Z",
    "docket": "No. S004779, Crim. No. 26413.",
    "body": "Defendant Timothy Pride was convicted of two counts of first degree murder (Pen. Code, § 187)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with personal use of a knife (§ 12022, subd. (b)). Under the 1978 death penalty law, a special circumstance of multiple murder was found true. (§ 190.2, subd. (a)(3).) The jury sentenced defendant to death, and the trial court denied the automatic motion to modify the verdict. (§ 190.4, subd. (e).) This appeal is automatic. (§ 1239, subd. (b).)\n\nWe find no prejudicial error affecting the guilt or penalty phases of defendant's trial. The judgment will be affirmed in its entirety.\n\nI. GUILT PHASE EVIDENCE\n\nA. Prosecution Case\n\nThe victims, Kimele S. and Catherine K., were Caucasian, in their 20's, and employed by the Progressive Casualty Insurance Company in Sacramento (Progressive). The crimes occurred in the Progressive building on September 3, 1984, Labor Day.\n\nThat morning, Kimele and her husband, Jeff, an attorney, decided to spend the first part of the day at their separate offices and to visit his parents sometime after 2 p.m. Kimele and Jeff had sexual intercourse and then he left for work. He returned to an empty house at 12:30 p.m. and waited for Kimele. At 2:15 p.m., she told him over the phone that she was still working but would be home in two hours. This was the last time Kimele was heard from alive.\n\nCatherine--who was single and lived with her parents--spent the night before Labor Day at the home of her sister-in-law. The next morning, the two women decided to spend a few hours apart at work and then meet for dinner. The sister-in-law left for work first at 1:45 p.m. At 4 p.m., Catherine called and said she was at Progressive. This was the last time Catherine was heard from alive.\n\nBecause of the holiday, few people were working in the Progressive building. Three management level employees, Charles Chokel, Pat Cadden, and Steve Andrews, were there at various times between 7:15 a.m. and 12:45 p.m. to interview a prospective employee. Andrews spoke briefly with Kimele no later than 11 o'clock, and Chokel saw her at her desk around noon. None of these men saw Catherine that day.\n\nA gardening crew, consisting of Jerry Wade and members of his household, worked outside the Progressive building from 9 a.m. until 3:30 p.m on Labor Day. Wade saw some people he assumed were Progressive employees enter the building around noon. Apparently, one or more doors were unlocked most of the day.\n\nBetween 4:15 and 4:30 p.m., Jeff called Progressive but got no answer. He assumed Kimele was running late, left a note for her, and went to his parents' home alone. He returned to an empty house at 5:45 p.m. After another unsuccessful attempt to reach Kimele by phone, Jeff became concerned for her safety and drove to Progressive. He arrived shortly before 6 o'clock and saw her car in the parking lot.\n\nThe Progressive building was a large one-story structure about 180 feet long from north to south, and 120 feet wide from east to west. The main entrance was located in the southeast corner. Inside, the building consisted primarily of open space bisected by a north-south corridor running the full length of the building. On the east and lower west sides, there were shelves stacked with files and employee work stations divided by partitions. A lunchroom, janitorial closet, and restrooms were clustered together along the main hall towards the middle of the west wall. There was an enclosed conference room in the northeast corner and a construction area in the northwest corner. Kimele worked in an alcove directly south of the lunchroom. Catherine worked across the hall, in the southeast section.\n\nJeff entered the building through an unlocked door in the lunchroom. Most of the lights were on. He saw bloodstains and a pile of bloody paper towels in the hallway outside the women's restroom. A blouse and bloodstained sweater were lying nearby, both wet with water. Jeff did not enter the women's restroom, but investigators ultimately found a pool of blood on the floor and blood spatters on the wall below one of the sinks. A mop stood in one corner, and several bottles of cleanser were left in apparent disarray on the sinks. Cigarette ash was found in one of the sink basins.\n\nA long trail of bloody footprints--later determined to have been made by Catherine--led down the hall from the restroom and ended in the southeast part of the building. There, on the floor between two partitions, Jeff discovered Catherine's dead body. She was lying on her back with her legs spread apart and was naked except for a \"tank top.\" Her pants were down around one ankle, and there were bloody paper towels nearby. Catherine had been stabbed many times and her face was battered and swollen. At first, Jeff thought he had found Kimele but soon realized the dead woman was too large and was wearing unfamiliar clothing.\n\nJeff frantically searched throughout the building but did not find Kimele. He called his parents and Progressive manager Cadden to see whether they knew her whereabouts. Jeff also told Cadden to call the police.\n\nSheriff's detectives arrived around 6:30 p.m. They ultimately found Kimele's dead body behind a table and between two chairs on the floor of the darkened conference room. She was lying on her side in a semifetal position and was nude except for a bra. There was a bloodstained sweater underneath her body, and her pants and underwear were down around one ankle. Kimele had been stabbed several times and her face was battered and swollen. A jug of cleaning fluid and a plunger sat on the floor nearby. Detectives also found Kimele's open purse sitting on a table near her work station. Her wallet and checkbook were missing.\n\nPathologist Hall examined the bodies at the crime scene that night and at the coroner's office the next morning. Kimele's jaw was broken, her body was scratched and bruised, and she had been stabbed 18 times. All but one of the stab wounds were located in her back and chest, including one that penetrated the heart. No defensive knife injuries were found. Dr. Hall concluded that Kimele died between 1:30 and 3:30 p.m. A vaginal examination revealed a moderate amount of semen and minor labial skin irritation. The results of other forensic tests performed on Kimele will be discussed below.\n\nDr. Hall determined that the other victim, Catherine, had been stabbed 69 times. Thirteen stab wounds were located in her chest, including three that made a \"symmetrical\" pattern around the left nipple and one that penetrated the heart. Of the 30 stab wounds found on Catherine's back, many were \"clustered\" on the left side. There were bruises and abrasions on her body and defensive knife wounds on her hands and forearms. Catherine's time of death was placed between 2 and 4 p.m. Pathologist Hall apparently found no semen in Catherine's vagina and discovered her hymen to be intact. However, forensic serologist Blake detected an \"extremely small\" amount of semen on a swab taken from inside the vagina, near the opening. Assuming the semen was deposited near the time of death, Blake attributed it to penetration by a non- or postejaculatory penis. The results of other forensic tests performed on Catherine will be discussed below.\n\nDefendant, who is Black, was employed by the American Building Maintenance Company (ABM) and worked as a janitor in the Progressive building. A few people (Chokel, Cadden, and Andrews) saw him cleaning inside the building the morning of the crimes. Wade, the gardener, saw defendant remove cleaning supplies from his car the same morning. Defendant's car\n\nwas still parked in the Progressive lot when Wade left the premises at 3:30 p.m.\n\nIn the middle of the day, about 1 p.m., ABM manager, Richard Leppington, arrived at Progressive and found defendant vacuuming in the northeast section. As previously arranged, the two men toured most of the building and discussed certain cleaning chores that needed attention. Leppington noticed that the women's restroom and surrounding areas had already been cleaned. Only some additional vacuuming and \"edging\" between the walls and carpet remained to be done. Defendant said he would be finished by 2 p.m. Leppington left the premises at 1:30 p.m.\n\nLeppington's Labor Day visit was prompted by events that had occurred a few days earlier. Specifically, on August 30, Leppington received a phone call from Kimele's supervisor, Kevin Legendre, complaining about the quality of defendant's janitorial services. Pursuant to company policy, Leppington prepared a written complaint and gave it to defendant's supervisor at ABM, Jesse Rubalcaba. Rubalcaba showed the complaint to defendant the same day. Rubalcaba testified that defendant reacted violently; he clenched his fists, moved towards Rubalcaba, and said the complaint was a \"fucking lie.\" Defendant also threatened to \"get the person [at Progressive who] made the complaint,\" and asked who it was. Rubalcaba testified that he did not respond because he did not know the complaint had come from Legendre. Legendre testified, however, that defendant knew he (Legendre) and Kimele were jointly responsible for monitoring janitorial services.\n\nRubalcaba immediately reported defendant's outburst to Leppington, said it was grounds for termination, and refused to continue working with defendant. All three men discussed the problem the next day (August 31), and Leppington decided not to fire defendant. As noted, Leppington and defendant met at Progressive shortly before the crimes to discuss job improvement.\n\nSheriff's Detectives Biondi and Bell visited defendant's home at 12:30 a.m. on September 4--the day after the crimes--to interview him as a possible witness. Defendant answered the door in his underwear and invited the officers inside. He said he was babysitting his children but was willing to discuss the case after his \"wife\" came home. When asked what he wore to work the previous day, defendant pointed to a shirt and pair of pants that had been freshly laundered and folded. No unusual marks were seen on his body.\n\nThe same detectives subsequently interviewed defendant on September 4, from 3 to 5 a.m., and on September 5, from 4:30 to 11:30 p.m. (with rest\n\nbreaks). In both interviews, defendant denied any involvement in the crimes and was \"adamant\" that he left Progressive around 2 p.m. the day they occurred. However, he gave slightly different accounts of what happened next. In the first interview, defendant said that his car stalled, that he received a jump start from someone in a red Camaro, and that he arrived home at 2:30 p.m. In the second interview, defendant said the car was started by fixing a loose wire and that he might have arrived home as late as 3:30 p.m. Defendant also said he wore a \"smock\" during the repair, but that he returned it to the trunk of his car before going home. When asked in the second interview if he owned or carried a knife, defendant said, \"no.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nOn September 6, detectives acquired fingerprint evidence that connected defendant to the crimes in a manner described below. They telephoned defendant--who had been under police surveillance for a day--and told him to submit to arrest at the station. He immediately complied.\n\nDefendant's live-in companion, Brenda, testified that he arrived home at 5 p.m. on Labor Day. His work clothes were covered by the \"jumpsuit\" he kept in the trunk of his car. Defendant disrobed for a shower while Brenda prepared to go shopping. When she returned, defendant was laundering his work clothes--something he did only \"once in a blue moon.\"\n\nA few days after the crimes, a local resident found a knife with a trace of blood on it in a field near Progressive, and called police. Prosecution experts determined that the blood was human, but could not otherwise identify it. However, other forensic data suggested the knife was the murder weapon. Hair and fiber particles on it could have come from the victims and their clothing, and the blade was \"consistent\" with the victims' wounds.\n\nBrenda testified that defendant possessed a knife \"similar\" to the purported murder weapon. She first noticed the knife on top of their refrigerator and last saw it on the bedroom dresser two weeks before Labor Day. Defendant told her after his arrest that it had been stolen. Brenda observed that both defendant's knife and the purported murder weapon had the same distinctive carved wood handle and folding blade, but she questioned\n\nwhether each had the same number of finger grooves. Four relatives and friends who had seen defendant's knife one or two months before the crimes made similar observations at trial.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nA few days after the crimes, a young woman on horseback found Kimele's wallet lying open and face down along a road not far from Progressive. The wallet contained identification and credit cards but no money. The sheriff's department was notified and searched the area. Kimele's checkpad was discovered near where the wallet had been found. A bank receipt and checkbook cover containing miscellaneous papers belonging to Kimele were found a quarter-mile down the road.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nFurther investigation of Progressive revealed defendant's fingerprints on several surfaces in the women's restroom (e.g., soap and towel dispensers, trash can, stall doors). A fingerprint was also lifted from each of two bloody paper towels found crumpled together near Catherine's body. One of the prints was positively identified as defendant's, and the other one was similar to his in several respects but could not be positively identified.\n\nTwo Kool cigarette butts were found at the scene: one in the northwest area and the other in the hall not far from the women's restroom. Serologist Blake determined that both items had been smoked by someone with type A secretor blood. Defendant is a type A secretor, and testified at trial that he regularly smoked Kool cigarettes.\n\nA few drops of blood were found in the northwest section of the building, near the cigarette butt. Electrophoretic testing by Dr. Blake disclosed that the\n\nbloodstains were compatible with Kimele's blood type, but not with Catherine's. Similar tests run on bloodstains found in the women's bathroom and near Catherine's body were consistent with her blood type, but not with Kimele's.\n\nA pubic hair was found on a semen-stained portion of carpet underneath Kimele's body. Criminalist Garbutt testified that the hair almost certainly came from a Black person; that it was \"inconsistent\" with the pubic hair of the victims or Sean Collins; and that it was \"consistent\" with defendant's pubic hair.\n\nNo conclusive information was obtained about the donor of semen found in each victim's vagina. ABO and electrophoretic tests by Dr. Blake revealed that all genetic markers could have been contributed by the victims themselves, and that no one could be eliminated as a donor.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nSemen stains were found on three \"zones\" of carpet underneath Kimele's body and on her panties. Again, ABO and electrophoretic tests were inconclusive because all markers could be attributed to the victim. However, because a relatively large amount of semen was found on the panties, Dr. Blake inferred from the absence of certain markers that the donor necessarily had type A or type O blood.\n\nAnother test--\"GM\" or \"Allotype\"--was performed by Dr. Moses Schanfield, a geneticist, on semen found on the carpet underneath Kimele and on her panties. The test identifies genetic markers grouped by class (Gm, Km, Am, etc.) on immunoglobulin antibodies (IGG, IGA, etc.) found in blood and, to a much lesser extent, semen. Schanfield compared markers found on the stained items with markers found in blood samples provided by Kimele, Catherine, Jeff, Sean Collins, and defendant. The import of Schanfield's testimony was that Jeff and Sean Collins could not have deposited the semen; that defendant could have deposited it; and that only 1 to 4 percent of the Black population could have contributed a particular foursome of genetic markers found in the underpants stain. However, forensic experts for the prosecution (Dr. Blake) and defense (criminalist Wraxall) vigorously disputed the accuracy of Schanfield's results at trial, and indicated that no\n\nmeaningful \"GM\" inferences could be drawn about the semen donor in this case.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nB. Defense Case\n\n1. Defendant's testimony.\n\nDefendant, who was 30 years old at the time of the crimes, testified as follows: he and Brenda had lived together for 10 years and had 2 young daughters. The family moved from East Palo Alto to Sacramento a few months before the crimes. Defendant had worked part time at Progressive for a total of two months, and also worked full time at a car wash. He knew Kimele and Catherine, and thought they had always been polite to him.\n\nOn September 3, Labor Day, defendant arrived at Progressive early in the morning. He saw Kimele and at least one other employee (Chokel) working at their desks around 9 a.m. Defendant spent the next few hours performing his usual work routine, which included cleaning the women's bathroom and restocking the paper towel dispenser.\n\nAt 1 p.m., defendant and ABM manager Leppington discussed the extra chores requested by Progressive. While the two men toured the building, defendant purportedly smoked a Kool cigarette and discarded the butt in the northwest section. Leppington left the premises around 1:30 p.m.\n\nDefendant testified that after Leppington's departure, he started vacuuming the building and probably finished around 3 p.m. He then cleaned some shelves, windows, and doors. He saw Kimele at her desk twice during this period and believed they were the only two people in the building. Defendant claimed he never saw Catherine that day.\n\nDefendant testified that he did not know when he left Progressive. He remembered seeing several Black men loitering nearby as he drove out of the parking lot. It usually took defendant 30 minutes to get home, but his car purportedly stalled along the way. A man in a red Camaro stopped to help defendant. They waited for the engine to cool down, fixed some loose wires, and jump-started the car. Afterwards, defendant put on the smock to protect his seat covers from car grease that had soiled his clothes. He wore the smock home.\n\nDefendant testified that he did not know when he arrived home. He laundered his clothes because he planned to wear them the next day.\n\nDefendant further testified that at some point before the crimes, his knife was stolen from his car while it was parked at Progressive. Defendant insisted that the knife identified by prosecution witnesses as the probable murder weapon did not belong to him. His knife purportedly had a longer blade and more finger grooves. He originally bought it from Brenda's brother to resell it and because the brother needed the money.\n\nDefendant denied committing the crimes. He acknowledged that his pre- arrest statements differed from his trial testimony on certain issues, including the timing of his movements on Labor Day and whether he wore the smock home or owned a knife. He blamed these discrepancies on the fact that he was tired during interviews with detectives.\n\nDefendant described his confrontation with ABM supervisor Rubalcaba three days before the crimes as follows: Rubalcaba threw the written complaint at defendant and demanded to know \"what [the] fuck this was.\" Defendant read it and said it was a \"fucking lie.\" Defendant asked who made the complaint and Rubalcaba purportedly identified Kimele's supervisor, Legendre. Defendant admitted raising his voice at Rubalcaba and becoming angry, but denied making any threat.\n\nDefendant further testified that he told Leppington the next day that he became angry as a result of Rubalcaba's \"attitude.\" Leppington purportedly replied that he had a \"pretty good idea\" of what had happened between Rubalcaba and defendant, and that defendant would not be fired but would work directly with Leppington from then on.\n\n2. Other defense witnesses.\n\nDefendant tried to suggest through other witnesses that someone else committed the crimes. For example, a woman who worked at Progressive drove by the building about 4 p.m. on Labor Day. She thought she saw a parked car similar to one which two Black men had previously used to cruise through the lot and flirt with female employees. Another woman who drove by the building twice the same day saw a Black man lying on the lawn in the morning and several \"scruffy\" Caucasian men nearby in the afternoon.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nII. PENALTY PHASE EVIDENCE\n\nA. Prosecution Case\n\nThe prosecution presented evidence of four prior violent crimes by defendant, one of which resulted in a felony conviction:\n\n1. The rape of Gloria G.\n\nThe parties stipulated that defendant was convicted in January 1972 of forcibly raping Gloria G. The crime occurred in October 1971, two months before defendant's 18th birthday. The facts underlying the conviction, including defendant's guilty plea, were not introduced at the penalty trial.\n\n2. The rape of Josephine H.\n\nIn exchange for the above mentioned guilty plea, charges that defendant forcibly raped Josephine H. a few months before the rape of Gloria G. were apparently dismissed. Josephine testified at the penalty trial as follows: in January 1971, 16-year-old Josephine and defendant lived in the same neighborhood and knew each other from high school. Defendant saw Josephine on the street and insisted she immediately come to his house and pick up a record he had supposedly borrowed from her boyfriend. When they arrived, Josephine said she would wait for defendant outside. However, he pulled her inside the empty house and insisted she accompany him to his bedroom. Josephine complied only because defendant became upset and started threatening her. Defendant momentarily left the bedroom and returned wearing only pajama pants. Defendant demanded sex, slapped Josephine, and pushed her onto the bed. She resisted, but he removed her pants and raped her twice. Defendant let Josephine leave only after she promised to return later that day. Josephine soon reported the rape to her parents and the police.\n\n3. The assault on the Marks family.\n\nSandy Marks testified as follows: one afternoon in May 1976, she and her sister Jackie and their four young children were present in Jackie's apartment. Defendant, who apparently managed the building, appeared at the door and demanded the rent. Jackie indicated that she would not pay rent until she spoke to the owner about building repairs. Defendant became upset and shoved Jackie--who was seven months pregnant--across the room. Sandy--who was on crutches with a broken foot--stood up to help her sister but was slapped by defendant and knocked to the floor. Defendant then \"smacked\" Sandy's son on the head as he ran outside to call the police. Defendant picked up a broom and threatened the women until the police arrived a short time later.\n\nOne of the responding officers testified that defendant was arrested for battery and that Sandy had an abrasion on her cheek. Sandy and the officer each testified that defendant threatened the women in the officers' presence (\"you bitches are dead\"). The penalty jury learned through stipulation of the parties that battery charges involving the two women were dismissed in\n\nexchange for defendant's plea of guilty to one count of disturbing the peace, a misdemeanor.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n4. The rape of Leonie D.\n\nLeonie D. testified as follows: In September 1980, she attended and worked part time at a local college where she met defendant, the janitor. She agreed to meet him one night to discuss his supposedly ill father. They drove to a nearby park, drank some beer, and apparently smoked some marijuana. When they returned to campus, defendant insisted Leonie wait while he used the restroom. Once they were inside the building, defendant pulled Leonie into one of the rooms and became sexually aggressive. Leonie tried to leave but defendant punched her in the face, knocked her to the ground, and started choking her. Defendant threatened to kill Leonie and forced her to engage in sexual intercourse and \"other things\" for a \"long time.\" Defendant let Leonie leave only after he had mopped some blood off the floor. Leonie soon reported the incident to two schoolmates and the police.\n\nThe schoolmates testified that Leonie was bloody, hysterical, and crying when they saw her that night. The doctor who examined Leonie shortly after the alleged rape remembered seeing scratches on her neck. A police officer who investigated the case noticed that the floor where the rape allegedly occurred had been freshly mopped. The same witness also testified that defendant was arrested, but later released at the request of the district attorney.\n\nB. Defense Case\n\nThe penalty defense consisted primarily of testimony by defendant's relatives attesting to his good character at certain times of his life. For example, defendant's mother, grandmother, and half-sister agreed that defendant was a good child. Defendant's mother explained that he grew up in a stable, two-parent home in a decent neighborhood. As a boy, defendant participated in wholesome recreational activities, enthusiastically performed chores at home, and performed fairly well in school. The half-sister also noted that defendant helped her recuperate from surgery for several days in\n\n1976. In addition, defendant's mother and half-sister testified that defendant was a good parent. They asked that his life be spared.\n\nIII. PRETRIAL ISSUES\n\nA. Venue\n\nDefendant contends the trial court erred in denying his motion for change of venue made before jury selection began and renewed when it was complete.\n\nA change of venue must be granted when the defendant shows a reasonable likelihood that a fair trial cannot otherwise be had. The trial court typically considers the nature and gravity of the offense, the size of the community, the status of the defendant and the victim, and the nature and extent of the publicity. On appeal, the defendant must show that denial of the venue motion was error (i.e., that it was reasonably likely a fair trial could not be had at the time the motion was made) and that the error was prejudicial (i.e., that it was reasonably likely a fair trial was not in fact had). We will sustain the court's determination of the relevant facts where supported by substantial evidence. We independently review the court's ultimate determination of the reasonable likelihood of an unfair trial. (People v. Edwards (1991) 54 Cal. 3d 787, 806-807 [1 Cal. Rptr. 2d 696, 819 P.2d 436].)\n\nThe charged offenses were serious and predictably attracted the attention of the media. But, as the trial court recognized, the same could be said of most multiple or capital murders. This factor is not dispositive. (See Edwards, supra, at p. 807.)\n\nThe record indicates that when defendant moved to change venue, Sacramento had a total population exceeding 875,800 and was at least the seventh largest county in the state. Defendant claims Sacramento County is unusually \"homogeneous\" and \"isolated\" in a cultural sense, but the trial court found no credible evidence to support this claim. We have rejected similar challenges to trial in the same locale. (People v. Ainsworth (1988) 45 Cal. 3d 984, 1001-1002 [248 Cal. Rptr. 568, 755 P.2d 1017]; see also People v. Bean (1988) 46 Cal. 3d 919, 942 [251 Cal. Rptr. 467, 760 P.2d 996].) The court properly found that the size and metropolitan nature of the county weighed heavily against a change of venue.\n\nDefendant correctly observes that certain news stories mentioned his prior criminal record, the possibility that he committed other crimes in the area, and a jailmate's claim that defendant admitted the charged crimes. However,\n\nas found by the court, there was comparable coverage of a sympathetic and positive nature. Several articles noted that defendant was a local resident--not an outsider or drifter--and that he held two jobs in order to support his family. Coworkers were quoted as saying defendant was \"polite\" and \"hardworking.\" Defendant's status in the community did not weigh strongly in favor of a change of venue. (Compare Martinez v. Superior Court (1981) 29 Cal. 3d 574, 584- 585 [174 Cal. Rptr. 701, 629 P.2d 502].)\n\nWhile the victims were evidently loved and respected in their circle of family and friends, they were not especially prominent. Defendant emphasizes their relative youth and \"innocence,\" as well as the fact that they were killed while working overtime on a holiday. These facts, however, would not change with a change of venue. Prospective jurors would have reason to sympathize with the victims and their families wherever the case was tried. (People v. Edwards, supra, 54 Cal. 3d 787, 808.)\n\nDefendant insists that \"sexual and racial overtones\" in the case were exploited. Not so. News accounts described the crime scene and investigation in factual terms. Some stories were accompanied by pictures of defendant and/or the victims but--as defendant concedes--race was not overtly mentioned.\n\nThe record also supports the finding that coverage was not excessive--23 articles and 43 minutes of broadcast time. Almost all publicity occurred within a few weeks of the crimes. The initial venue motion was denied a year and four months after the crimes. The guilt trial began another eight months later, i.e., two years after the crimes. Passage of time weighs heavily against a change of venue. (People v. Bonin (1988) 46 Cal. 3d 659, 677-678 [250 Cal. Rptr. 687, 758 P.2d 1217].)\n\nAt the first venue hearing, the defense presented expert testimony concerning the results of a \"venue survey\" it had recently conducted in Sacramento County. Contrary to what defendant argues, this evidence did not show that the pool of prospective jurors had been tainted by pretrial publicity. Of the 450 people responding to the survey, a high percentage remembered the case but most of them still had an open mind on the question of guilt. While a minority of those who remembered the case believed defendant committed the crimes, almost the same number of people believed any person brought to trial was probably guilty as charged.\n\nDefendant stresses that his primary expert, Dr. Bronson, testified at the first venue hearing that prospective jurors could not be trusted on voir dire to remember or reveal the full extent of their exposure to pretrial publicity.\n\nHowever, the court found Bronson was \"biased\" in favor of a change of venue. The court also found when rejecting the second venue motion that all jurors selected in this case had been \"honest and truthful\" when they denied being exposed to or affected by publicity. Nothing in the record of voir dire undermines this Conclusion.\n\nA few days after the court denied the second venue motion and one day before the guilt trial began, defendant informed the trial court that there had been four new articles and one radio broadcast about the case. The defense asked that voir dire be resumed or that jurors be polled on whether they had been exposed to the information. The court denied the request. It noted that the jury had been repeatedly admonished to avoid any coverage of the case and to inform the court if such exposure had inadvertently occurred. There was no indication any juror was aware of the new coverage.\n\nAbsent a contrary indication in the record, it must be assumed the jury followed its instruction to avoid all publicity in the case. (People v. Adcox (1988) 47 Cal. 3d 207, 252-253 [253 Cal. Rptr. 55, 763 P.2d 906].) The court was not obliged to inquire into the matter based on mere speculation or conjecture that some impropriety had occurred. (Id., at p. 253.) The court did not err in failing to ask further questions on the publicity issue.\n\nIn light of the foregoing, defendant has not established error or prejudice in the denial of his venue motions.\n\nB. Jury Selection Issues\n\n1. Introduction.\n\nWith the approval of the parties, the following procedure was used to select the jury (compare People v. Ashmus (1991) 54 Cal. 3d 932, 955-956 [2 Cal. Rptr. 2d 112, 820 P.2d 214]): Prospective jurors were first examined for hardship and some were excused. Following preinstruction and individual voir dire, the parties' challenges for cause were made and resolved. At the end of this process, 57 persons remained in the jury pool.\n\nTwelve jurors were then called at random and seated in the jury box. The prosecution and defense alternately exercised their peremptory challenges, and a new prospective juror was randomly called into the box each time a vacancy was created.\n\nUltimately, the prosecution struck 17 prospective jurors and no prospective alternates. Defendant used all 26 of his challenges against prospective jurors and none of his 4 challenges against prospective alternates. Defendant used a peremptory challenge to strike a prospective juror in every case in\n\nwhich he claims on appeal that a defense challenge for cause was erroneously denied.\n\nToward the end of the peremptory-challenge process, defendant requested \"at least ten\" additional challenges. The trial court denied the request. Defendant expressed dissatisfaction with the jury as sworn, primarily on grounds it was racially unbalanced and biased in favor of the death penalty.\n\n2. Representative jury.\n\nDefendant argues here--as he timely but unsuccessfully did below--that exclusion of ex-felons and resident aliens from juries in this state denied him a representative jury. We thoroughly discussed and rejected the same claim in People v. Karis (1988) 46 Cal. 3d 612, 631-634 [250 Cal. Rptr. 659, 758 P.2d 1189]. Defendant does not ask that we reconsider Karis, but raises the issue solely to preserve federal review.\n\n3. Discovery of information about prospective jurors.\n\nBefore jury selection began, defendant moved to compel disclosure of any prosecution records and reports containing information about prospective jurors. The court denied the motion. Defendant claims the ruling was erroneous under People v. Murtishaw (1981) 29 Cal. 3d 733, 767 [175 Cal. Rptr. 738, 631 P.2d 446] (trial court has discretion to give defense access to jury records and reports). Defendant asserts that because there is no record of what information the prosecution possessed, we must \"presume\" it had a \"significant advantage\" over the defense during jury selection and that defendant was prejudiced thereby. However, defendant concedes Murtishaw itself rejected this approach. \"[I]n any individual case it is entirely speculative whether denial of access caused any significant harm to the defense.\" (Ibid., italics omitted.) Thus, even assuming error occurred, it was necessarily harmless. (See also People v. Morris (1991) 53 Cal. 3d 152, 180 [279 Cal. Rptr. 720, 807 P.2d 949]; People v. Johnson (1989) 47 Cal. 3d 1194, 1225 [255 Cal. Rptr. 569, 767 P.2d 1047].)\n\n4. Defense challenges for cause.\n\nDefendant argues the court erred in denying his challenge for cause to four prospective jurors (Gluyas, Waterman, Gomez, Bardon) on grounds their views on capital punishment would \" 'prevent or substantially impair' \" performance of their duties as jurors under Wainwright v. Witt (1985) 469 U.S. 412, 424 [83 L.Ed.2d 841, 851-852, 105 S.Ct. 844] (Witt) (citation omitted). Defendant also claims the court erroneously prevented him from asking one of these jurors (Gluyas) an assertedly key question about capital punishment.\n\nDefendant notes the trial court apparently assessed all such challenges for cause under Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88\n\nS.Ct. 1770]. Witherspoon indicated that a prospective juror could be excluded for cause based on his views of the death penalty where he made it \"unmistakably clear\" he would \"automatically\" vote a certain way. (Id., at p. 522, fn. 21 [20 L.Ed.2d at p. 785].) Witt, supra, 469 U.S. at page 424 [83 L.Ed.2d at pages 851-852], \"clarif[ied]\" Witherspoon and was decided about a year and a half before jury selection began in this case. While both cases dealt specifically with prosecution attempts to exclude prospective jurors based on their views against the death penalty, the Witherspoon/Witt standard has since been applied to defense attempts to exclude prospective jurors assertedly biased in favor of death. (See Ross v. Oklahoma (1988) 487 U.S. 81, 85 [101 L.Ed.2d 80, 87-88, 108 S.Ct. 2273]; People v. Coleman (1988) 46 Cal. 3d 749, 763-765 [251 Cal. Rptr. 83, 759 P.2d 1260].)\n\nWe conclude defendant is estopped to argue that the court applied the erroneous standard or that its rulings on these four challenges for cause were incorrect. Here, the court and counsel discussed the effect of Witt before jury selection began. The court opined that no California cases had yet interpreted Witt but that it seemed to have \"changed\" Witherspoon. Defense counsel disagreed, arguing that Witt \"brought no substantial changes of any kind\" to the Witherspoon rule. The court immediately replied that it would \"stick with the old way\"--an apparent reference to Witherspoon.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nUnder the circumstances, any erroneous departure from Witt, supra, 469 U.S. 412, occurred at the request and with the approval of the defense. The tactical purpose behind such a stance was both plausible and clear: under Witherspoon, supra, 391 U.S. 510, the prosecution could excuse only those pro-life jurors who made their inability to impose the death penalty \"unmistakably clear.\" Defendant does not dispute that rejection of his four challenges to allegedly pro-death jurors was correct under Witherspoon, and he seems to explicitly concede the point as to prospective Juror Gluyas. Hence, defendant is precluded from complaining about the trial court's handling of voir dire or defense challenges for cause on the issue of capital punishment.\n\nDefendant also contends the court erred in denying his challenge for cause to four prospective jurors who were assertedly biased on issues\n\nunrelated to capital punishment. Defendant maintains that three of them (Eldridge, Bardon, and Blattel) had preJudged the case based on their exposure to pretrial publicity, and that the fourth one (Chamberlain) was biased in favor of police officer witnesses.\n\nNo error occurred. Defendant is correct that the three individuals who had heard or read about the case before voir dire indicated that they initially formed certain opinions about defendant's guilt, his background, and/or the manner in which the crimes occurred. The fourth juror acknowledged that he assumed police officers were \"more honest\" than other people. Nevertheless, all four individuals insisted they could apply the presumption of innocence, follow the evidence and instructions, and be fair and impartial if they served on the jury. Where a prospective juror gives such conflicting or equivocal answers concerning his impartiality, the trial court's assessment of his state of mind is generally binding on the appellate court. (People v. Bittaker (1989) 48 Cal. 3d 1046, 1089 [259 Cal. Rptr. 630, 774 P.2d 659].) For this reason, we find no impropriety here.\n\n5. Wheeler/Batson claim.\n\nOf the fifty seven individuals left in the jury pool at the start of peremptory challenges, eight were Black and at least five were apparently Hispanic. The prosecution's first twelve peremptory challenges included four against Blacks and two against Hispanics (Gipson, Grayson, Richey, Shaw, Morales, and Solorio). The defense peremptorily dismissed, among others, two Blacks and one Hispanic. The prosecution thereafter used five more peremptory challenges, two of which were made against the last two Blacks (Murchison and Williams).\n\nDefendant twice objected to the prosecution's use of its peremptory challenges under People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748] (Wheeler) and Batson v. Kentucky (1986) 476 U.S. 79 [90 L.Ed.2d 69, 106 S.Ct. 1712] (Batson). (See Powers v. Ohio (1991) U.S. [113 L.Ed.2d 411, 111 S.Ct. 1364].) Each time, the court \"required\" the prosecution to fully state its reasons for striking minority candidates. The prosecutor complied, and cited particular pages from the voir dire transcripts and jury questionnaires that he believed supported his decisions. The court concluded that each of the proffered reasons was \"bona fide\" and \"legitimate\" and that the prosecution had \"carried [its] burden\" under Wheeler and Batson as to all eight questioned challenges. It appears that at least two Hispanics, but no Blacks, sat on the jury.\n\nAs noted by defendant, the prosecutor said he excused all eight minority candidates because, among other things, they had expressed reservations about imposing the death penalty. Defendant insists this type of justification\n\nis \"improper\" per se. We have previously rejected this claim and see no reason to reconsider it here. (People v. Walker (1988) 47 Cal. 3d 605, 624-625 [253 Cal. Rptr. 863, 765 P.2d 70].)\n\nDefendant next argues the record does not support the prosecutor's claim that three (as opposed to all eight) of the challenged minority jurors were reluctant to impose the death penalty (Murchison, Williams, and Richey). Assuming a prima facie case of Wheeler discrimination was made, the trial court could properly sustain these challenges.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nMurchison and Williams said during voir dire that they had \"strong doubts\" about or \"generally opposed\" the death penalty. Murchison's reservations stemmed from an over distrust of the legal system, particularly its treatment of indigent defendants, while Williams was deeply concerned that an innocent person might be executed. The third individual, Richey, avoided answering most questions concerning the criminal Justice system. The prosecutor concluded--and the court did not disagree based on its observations during voir dire--that all three individuals might not be willing or able to impose a death sentence if appropriate in this case.\n\nDefendant does not dispute that the prosecutor properly identified the five other minority jurors he excused as also having reservations about the death penalty. Because the trial court found at least one legitimate race- neutral explanation for each questioned peremptory challenge, no abuse of discretion occurred. (Wheeler, supra, 22 Cal. 3d 258, 276-277 \u0026 fn. 18.)\n\n6. Failure to grant additional peremptory challenges.\n\nDefendant contends the trial court erred in not granting his timely and repeated request for \"at least 10\" more peremptory challenges. He insists he was entitled to additional challenges as a \"matter of right\" under the federal Constitution.\n\nDefendant also claims that by, among other things, \"artificially limiting\" the number of prospective jurors against whom peremptories might be\n\nexercised, the trial court improperly precluded itself from exercising its state law discretion to grant additional challenges during the selection process.\n\nBoth claims must be rejected. \"[T]o establish the constitutional entitlement to additional peremptory challenges argued for here, a criminal defendant must show at the very least that in the absence of such additional challenges he is reasonably likely to receive an unfair trial before a partial jury.\" (People v. Bonin, supra, 46 Cal. 3d 659, 679.) Logic dictates that no more lenient standard applies to nonconstitutional claims of error in denying additional peremptory challenges.\n\nThe standard of \"likely partiality\" is not met here. As noted above, defendant has not demonstrated that the trial court erroneously denied any challenges for cause. Nor did any of the allegedly biased prospective jurors he identifies on appeal actually serve on the jury. No basis for reversal appears.\n\nIV. GUILT PHASE ISSUES\n\nA. Shackling\n\nIn June 1986, before jury selection was complete, a two-day hearing was held concerning the need to physically restrain defendant in court. Several witnesses testified, including four sheriff's deputies and defendant. At the close of the hearing, the court ordered that defendant henceforth be secured to his chair by a single waist chain that would be concealed from the jury by his suit coat and by a special \"flap\" in the chair. The court found such measures were \"necessary\" based on evidence of defendant's threats of violence and hostile behavior towards deputies who transported him to and from the courtroom. The court was concerned that defendant might be difficult to control if he became disruptive, emphasizing, among other things, his \"muscular\" build and \"imposing\" size and the \"physical layout\" of the courtroom.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nDefendant correctly observes that shackling may be ordered during trial only upon a showing of a \"manifest need,\" and that an appellate court will uphold the order absent a clear abuse of discretion. (People v. Price (1991) 1 Cal. 4th 324, 403 [3 Cal. Rptr. 2d 106, 821 P.2d 610]; People v.\n\nDuran (1976) 16 Cal. 3d 282, 290-292 [127 Cal. Rptr. 618, 545 P.2d 1322, 90 A.L.R.3d 1].) Defendant claims the court abused its discretion because there was insufficient evidence that he was physically disruptive or dangerous. The record of the hearing belies this claim.\n\nDeputy Hayden described three occasions between December 1985 and early 1986 on which defendant threatened to harm him. The first incident occurred after Hayden asked defendant to promptly leave the courtroom during recess and walk toward the elevator. Defendant (who was not restrained at the time) said, \"Don't rush me when I'm talking to my attorney\" and \"This is my mother fucking life we are dealing with.\" Inside the elevator, defendant initially complied with Hayden's request to face the rear but then suddenly turned around, assumed a fighting stance, and said, \"Don't cut me no slack.\" When Hayden called for assistance, defendant said he would \"get back\" at the officers. The next incident occurred when Hayden insisted that defendant be shackled before escorting him from the holding tank into the courtroom. Defendant warned, \"This is personal now\" and Hayden would \"pay for it.\" The third incident occurred when defendant told another deputy to remove his restraints so that he could \"slap\" Hayden.\n\nDeputy Sterling testified that defendant threatened him in March 1986 while he and another officer were escorting defendant from the courtroom to the holding area. When Sterling asked defendant about counsel's efforts to have his shackles removed, defendant said, \"They are going to take these chains off of me in a few days [and] I am going to take some of you mother fuckers out.\" Defendant boasted that he could \"take on\" five or more deputies at one time.\n\nDeputy Wilcox testified that defendant threatened him in June 1986, 10 days before the shackling hearing. While being transported between jail and the courthouse, defendant repeatedly refused to carry a special shirt associated with his protective custody status. When Wilcox reminded defendant to carry the shirt, defendant (who was shackled) became angry and clenched his fists. He called the officer a \"punk\" and said, \"Let's get it on right now, let's get down to it.\"\n\nDeputy Varney testified that a few days after the foregoing incident, defendant was accused of misconduct by another inmate, Cortez, in the holding tank. The inmate was visibly upset, and asked to be removed from the tank on grounds defendant sexually taunted him (\"suck my dick\").\n\nThe appellate record also shows an outburst by defendant during an evidence-suppression hearing in April 1986. Defendant interrupted Detective\n\nBiondi's testimony and called him a \"damn liar.\" The court cited this incident in support of the shackling order, but said defendant had apologized for it.\n\nAs noted, defendant testified at the shackling hearing. He denied most of the alleged threats, but admitted that his dealings with the deputies were often tense. He insisted that Deputy Hayden was \"immature\" and that he and the other officers conspired to harass defendant. Another inmate, Avalos, corroborated defendant's testimony that he did not bother inmate Cortez in the holding tank.\n\nHowever, the court was not required to accept defendant's version of events and implicitly resolved any credibility questions against him. Prosecution evidence showed a series of threats or outburst over a six-month period preceding the shackling hearing, with two incidents occurring shortly beforehand. The court could reasonably infer that defendant was \"experiencing increasing difficulty in controlling his violent impulses[,]\" and that \"unless restrained physically, [he] would resort to violence in the courtroom if he became irritated or frustrated with the proceedings.\" (People v. Price, supra, 1 Cal. 4th 324, 404, fn. omitted.) The court need not have waited until such violence occurred before ordering restraints. There was no abuse of discretion.\n\nDefendant attacks the shackling order on other miscellaneous grounds. For example, the court purportedly erred in preventing Deputy Hayden from answering defense questions about \"problems\" he may have had with three other inmates. The court sustained prosecutorial objections to this line of questioning under Evidence Code section 352. We reject defendant's claim that this ruling constituted an abuse of discretion or that it violated defendant's federal constitutional right to confront witnesses. As noted, Hayden was one of four deputies who implicated defendant in several potentially violent episodes. The court could reasonably conclude that the probative value of Hayden's unrelated work experiences was low, while the risk of consuming an undue amount of time was high.\n\nDefendant also argues that the shackling order violated various federal and state constitutional rights (due process, right to effective assistance of counsel, and reliable death judgment). For purposes of this claim, defendant asks us to \"assume\" that his restraints were actually seen by the jury and that they affected his ability to assist in his defense. However, these assertions are speculative. Indeed, the court emphasized that it would be virtually impossible for the jury to see the waist chain when defendant was sitting down; that special care would be taken to ensure it was not seen when he moved\n\ninside the courtroom; and that the waist chain would not \"interfere with his ability to cooperate with [counsel].\" We reject defendant's claims of constitutional error and prejudice.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nB. Defendant's Tape-recorded Statements\n\nDefendant willingly participated in two separate interviews with detectives before his arrest. The interviews were tape-recorded and transcribed, and involved about six and one-half hours of dialogue. Defendant claims the court erred in denying his midtrial motion to play the tapes for the jury. As we will explain, no basis for reversal appears.\n\nOn direct examination, the prosecution asked Detective Biondi to recount defendant's statements on a narrow range of interview topics, particularly the time defendant left Progressive and arrived home the day of the crimes. According to Biondi, defendant consistently maintained that he left Progressive around 2 p.m., and stated at one point that he arrived home as early as 2:30 p.m. This information conflicted with testimony previously given by two prosecution witnesses (the gardener and Brenda) that defendant had not left Progressive by 3:30 p.m. and that he arrived home at 5 p.m.\n\nOn cross-examination of Biondi, defense counsel tried to elicit defendant's interview statements on two subjects not previously raised. The prosecutor objected on hearsay grounds. Outside the jury's presence, defense counsel explained he was \"laying a foundation\" for introduction of the entire tape-recorded interviews. Counsel asked that the tapes be played so that the jury could assess his \"state of mind.\" The prosecutor conceded that defendant could introduce any testimony or taped portion of the interviews that clarified excerpts already given by Biondi, but insisted no such clarification was necessary here.\n\nThe court ruled defendant's \"state of mind\" was not \"in issue\" and denied the motion to admit the tapes. The court also sustained the prosecutor's hearsay objections and limited cross-examination of Biondi to topics raised on direct examination.\n\nDefense counsel subsequently cross-examined Biondi at length concerning defendant's statements about the timing of his movements the day of the crimes. Related sections of the transcribed interviews were also read into\n\nevidence. On at least two subsequent occasions, defendant renewed his request to play the tapes. Each time, the court cited its prior ruling and denied the motion. Thereafter, defendant testified he was tired during the interviews and did not know when he left Progressive or arrived home on Labor Day.\n\nDefendant contends the tapes suggest that he was disoriented during the interviews and that his time estimates were \"mere guesses\" made in response to \"highly suggestive\" questioning. The court assertedly erred in excluding this evidence under state law because it rebutted any inference that he lied to police. Defendant also suggests the court's ruling violated various federal constitutional guarantees (due process, presentation of a defense, and reliable death judgment).\n\nDefendant correctly observes that where one party has introduced part of a conversation, the opposing party may admit any other part necessary to place the original excerpts in context. (Evid. Code, § 356; People v. Hamilton (1989) 48 Cal. 3d 1142, 1174 [259 Cal. Rptr. 701, 774 P.2d 730].) It follows that if excerpts of a recorded conversation are admitted in a form --such as participant testimony or written transcripts--that creates a misleading impression, the recording itself may be proffered as necessary to correct that misimpression. For several reasons, however, no reversible error occurred here.\n\nIn the first place, any claim that evidence was wrongly excluded cannot be raised on appeal absent an offer of proof in the trial court. (Evid. Code, § 354.) Defendant made no offer of proof as to how the tapes of his police interviews might correct any misimpressions allegedly created by the testimony and transcripts actually before the jury.\n\nIn addition, a trial court has broad discretion to exclude evidence it deems irrelevant, cumulative, or unduly prejudicial or time-consuming. (Evid. Code, § 352.) Here, the court heard the entire tape recording of defendant's interviews before trial. In denying defendant's midtrial motion to play the tapes, the court rejected a vague claim that the tapes were necessary to illustrate a pertinent \"state of mind.\" One reasonable inference is that the court implicitly exercised its discretion and concluded the tapes would not materially assist the defense.\n\nFinally, we have independently reviewed the tapes and conclude it would have been an abuse of discretion to admit them on the theory now urged. Defendant speaks in a relaxed and confident tone throughout, and no evidence of psychological coercion or strain appears. The tapes amply support\n\nDetective Biondi's testimony that defendant was \"adamant\" about the time he claimed to have left the crime scene. Thus, any failure by the court to exercise its discretion in excluding the tapes was harmless under any standard.\n\nC. The Complaint About Defendant's Work\n\nOver defendant's objection, his janitorial supervisor, Rubalcaba, testified that three days before the crimes, defendant learned Progressive had complained about his work and that defendant had angrily threatened to \"get\" the responsible party. Defendant claims the trial court erred in denying his motion to exclude this evidence under Evidence Code section 352. Defendant suggests here, as below, that the evidence unfavorably characterized him as a bad employee and had little bearing on whether he was guilty of first degree murder or any other charged crime.\n\nNo abuse of discretion occurred. The \"complaint\" and \"threat\" evidence tended to show a motive to harm Progressive and its employees. It bore powerfully on the prosecution's claim of first degree premeditated murder as to both victims, and was not inconsistent with the alternative theory of murder in the course of a rape or attempted rape. The trial court could reasonably conclude that such evidence was substantially more probative than prejudicial.\n\nDefendant next observes that Rubalcaba's supervisor, Leppington, was called as a prosecution witness immediately after Rubalcaba. Leppington stated on direct and cross-examination that he discussed the foregoing incident with Rubalcaba and defendant the next day; that Rubalcaba and defendant shouted at each other during the meeting; that defendant behaved civilly towards Leppington; and that Leppington decided not to fire defendant. When defense counsel asked Leppington what reason defendant gave during the meeting for his confrontation with Rubalcaba, the prosecution objected on hearsay grounds. Defense counsel argued that the evidence was being offered to prove the \"state of mind of the several parties.\" The trial court summarily sustained the objection.\n\nDefendant now claims Leppington's testimony would have disclosed a \"personality conflict\" between Rubalcaba and defendant, and would have rebutted any inference of a motive to harm Progressive or its employees. Defendant contends the court erroneously failed to apply the \"mental state\" exception to the hearsay rule (Evid. Code, § 1250), and that its ruling violated various federal constitutional guarantees (due process, confrontation of witnesses, presentation of a defense, and reliable death judgment).\n\nNo basis for reversal appears. Absent an offer of proof as to what Leppington's testimony would have been, defendant has not preserved any challenge to its exclusion on appeal. (Evid. Code, § 354.) In any event, the court's ruling was harmless under any standard now urged. Defendant explained at trial that he did not make any threats when presented with the Progressive complaint, and that he told Leppington the next day that he became angry as a result of Rubalcaba's \"attitude.\" Leppington's description of the meeting corroborated defendant's apparent theory that Rubalcaba and defendant disliked each other and that Leppington took that fact into account in deciding what employment action to take. The proffered evidence would have added little to the jury's understanding of the incident.\n\nD. Jeff's Testimony\n\nDefendant argues that restrictions on defense cross- examination of Kimele's husband, Jeff, violated rules governing admission of \"third-party culpability\" evidence. We disagree.\n\nBefore trial, the prosecution moved in limine to prevent Jeff from being asked about his remarriage and personal life after the crimes. The matter was argued at least twice before Jeff was called to the stand and again immediately before his cross-examination began. On each occasion, defendant offered to introduce circumstantial evidence of Jeff's \"motive\" to kill Kimele, e.g., that he received $40,000 in life insurance benefits, bought a house, traveled abroad at some point after her death, and remarried over a year later. Defendant insisted this evidence raised a reasonable doubt as to defendant's guilt when considered in light of Jeff's presence and \"bizarre\" behavior at the crime scene and the apparent lack of corroboration of his whereabouts between 2:15 and 4 p.m., when the victims most likely died. The prosecutor sought to exclude the evidence under Evidence Code section 352, suggesting it would trigger extensive rebuttal testimony. The court concluded that the proffered \"motive\" evidence was irrelevant and granted the prosecution's motion to exclude it.\n\nDefendant argues that the court's ruling violated People v. Hall (1986) 41 Cal. 3d 826 [226 Cal. Rptr. 112, 718 P.2d 99] and various federal constitutional guarantees (due process, confrontation of witnesses, presentation of a defense, and reliable death judgment). Hall refused to impose a distinct and elevated standard of admissibility on defense evidence of a third party's guilt of the charged crimes, and said such evidence \"need only be capable of raising a reasonable doubt of defendant's guilt.\" (Id., at p. 833.) Hall made clear, however, that commonsense relevance limits apply. \"[E]vidence of mere motive or opportunity to commit the crime in another person,\n\nwithout more, will not suffice to raise a reasonable doubt about a defendant's guilt: there must be direct or circumstantial evidence linking the third person to the actual perpetration of the crime.\" (Ibid., italics added.)\n\nHere, the court correctly found the proffered evidence raised no reasonable doubt as to defendant's guilt as a matter of law. Nothing in the purported motive evidence distinguishes Jeff from any other person who is named as a beneficiary under a working spouse's life insurance policy or who makes a fresh start after a painful loss. Jeff's behavior upon discovering Catherine's dead body--frantically searching for Kimele throughout the building and calling people who might know her whereabouts--is not remarkable in the slightest degree. And, contrary to defendant's implication, the lack of corroboration that Jeff was not present at the time of the crimes is not evidence that he was present. Absent any physical or other evidence linking Jeff to \"actual perpetration\" of the murders, the alleged third party evidence was irrelevant. There was no error under state or federal law.\n\nE. Hair Comparison Evidence\n\nCriminalist Garbutt testified that the pubic hair found underneath Kimele's body almost certainly came from a Black person; that it was \"inconsistent\" with pubic hair samples provided by the victims and Sean Collins; and that it was \"consistent\" with a sample of defendant's pubic hair. Garbutt explained that he microscopically compared the crime scene specimen with the various samples to determine whether they were similar in length, shape, pigment, damage, and component structure.\n\nBefore trial, defendant moved to exclude all hair comparison evidence on grounds it was irrelevant, prejudicial, and inadmissible under the Kelly/Frye rule. (Frye v. United States (D.C. Cir. 1923) 293 Fed. 1013, 1014 [54 App. D.C. 46, 34 A.L.R. 145]; People v. Kelly (1976) 17 Cal. 3d 24, 30 [130 Cal. Rptr. 144, 549 P.2d 1240].) The rule requires the proponent of evidence based on a \"new\" scientific technique to competently establish its general acceptance within the relevant scientific community. Here, the trial court explicitly overruled each of defendant's pretrial objections based on testimony by one expert--Garbutt--at an evidentiary hearing. The court also denied subsequent motions to strike Garbutt's trial testimony after it was admitted and after it was discussed during cross-examination of prosecution serologist Blake.\n\nOn appeal, defendant argues that use of hair comparison analysis to include a defendant in the class of possible donors is a new scientific technique, and that Garbutt, a career criminalist, was not qualified to testify\n\non whether it has been generally accepted for this purpose. Defendant also complains that admission of Garbutt's trial testimony violated certain federal constitutional guarantees (due process and reliable death judgment). However, no reversible error occurred.\n\nAs found by the court below, Garbutt's method was not \"new\" when offered at defendant's 1986 evidentiary hearing and trial. Hair comparison evidence that identifies a suspect or victim as a possible donor has been routinely admitted in California for many years without any suggestion that it is unreliable under Kelly/Frye. (People v. Cooper (1991) 53 Cal. 3d 771, 799 [281 Cal. Rptr. 90, 809 P.2d 865]; People v. Bonin (1989) 47 Cal. 3d 808, 823 [254 Cal. Rptr. 298, 765 P.2d 460]; People v. Wolff (1920) 182 Cal. 728, 738 [190 P. 22]; People v. Smith (1987) 188 Cal. App. 3d 1495, 1504 [234 Cal. Rptr. 142]; People v. Thomas (1986) 180 Cal. App. 3d 47, 51 [225 Cal. Rptr. 277]; People v. Bowen (1982) 137 Cal. App. 3d 1020, 1029 [187 Cal. Rptr. 614]; People v. De La Plane (1979) 88 Cal. App. 3d 223, 238 [151 Cal. Rptr. 843]; People v. Allen (1974) 41 Cal. App. 3d 196, 201-202 [115 Cal. Rptr. 839].) It would have been anomalous for the court to conclude that Garbutt's testimony involved an unfamiliar procedure \"at this late date.\" (People v. Stoll (1989) 49 Cal. 3d 1136, 1158 [265 Cal. Rptr. 111, 783 P.2d 698].) No Kelly/Frye showing was necessary, and Garbutt's qualifications to make such a showing were irrelevant.\n\nDefendant next claims that absent any indication defendant belonged to a \"small percentage\" of people who could have donated the pubic hair, Garbutt's trial testimony meant \"nothing at all.\" However, as noted above, California courts have long assumed that hair comparison evidence of the sort admitted here has some logical bearing on defendant's commission of the charged crimes. (See, e.g., People v. Cooper, supra, 53 Cal. 3d 771, 799 [Black pubic hair in victim's vehicle consistent with defendant's hair]; People v. Bonin, supra, 47 Cal. 3d 808, 823 [foreign hair on victim's body consistent with defendant's hair]; People v. Smith, supra, 188 Cal. App. 3d 1495, 1504 [foreign hair on victim's body consistent and inconsistent with defendant's hair]; People v. Thomas, supra, 180 Cal. App. 3d 47, 51 [pubic hair on victim's bed consistent with defendant's hair]; People v. Allen, supra, 41 Cal. 3d 196, 201-202 [hair at crime scene consistent with defendant's hair].) The court properly rejected defendant's claim that the evidence was irrelevant and unduly prejudicial.\n\nF. Evidence of Failure to Call Defense Expert\n\nDuring redirect examination one Wednesday morning, the prosecutor asked Garbutt whether hair \"obtained in th[e] case\" had been made \"available to any other experts for comparison.\" The witness answered in the\n\naffirmative, and said he had forwarded the evidence to Robert Ogle, an \"independent criminalist ... working for the defense.\" Defendant did not object, and no other questions or answers touched on the subject. Garbutt and a few other witnesses testified for the remainder of the day. Court was then recessed for the next four calendar days.\n\nThe following Monday, before the jury returned from recess, defendant moved to strike Garbutt's testimony about Ogle. Defense counsel said he originally intended to object outside the jury's presence at the first available opportunity but had suffered a \"lapse in memory.\" Counsel argued that the prosecutor had improperly revealed \"privileged\" information concerning the identity of a defense expert, and that the jury might mistakenly infer the defense was withholding important information. The court was also urged to instruct the jury to disregard the evidence. When counsel said he planned to file additional case authority, the court took the matter under submission for a few days.\n\nThe court ultimately ruled that even though defendant's motion to strike the reference to Ogle was \"untimely,\" it would be granted. The court indicated that it was reluctant to admonish the jury because the \"gist\" of the stricken testimony would have to be repeated. However, at counsel's insistence, the court instructed the jury in terms proposed by the defense.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nDefendant repeats his claim that the prosecutor improperly disclosed privileged information about a defense expert and thereby violated his right to effective representation under the federal and state Constitutions. Defendant also complains that the belated nature of the court's admonition highlighted, rather than minimized, the original prejudice.\n\nContrary to defendant's characterization of the issue, a prompt objection and admonition would have cured any harmful effect of the reference to defense expert Ogle. Defendant's substantive claims have therefore been waived on appeal. (Evid. Code, § 353; People v. Price, supra, 1 Cal. 4th 324, 440.)\n\nIn any event, we cannot find prejudice in the timing of the admonition. The late admonition was given at defense counsel's insistence and stemmed\n\nfrom counsel's admitted mistake in failing to raise the matter promptly. We assume the jury followed the court's instruction to disregard the reference to Ogle whenever given. And, the content of the admonition was far removed from issues raised at trial. Reversal is not required.\n\nG. \"GM\" Testing of Semen Stains\n\nDr. Schanfield basically testified that defendant belonged to a small percentage of the Black population who could have contributed semen found near Kimele's body. Defendant argues here, as below, that the evidence should have been excluded because it was irrelevant and prejudicial, and because no competent expert testimony established that \"GM\" typing of aged or dried semen stains is scientifically reliable under the Kelly/Frye rule. (Compare People v. Yorba (1989) 209 Cal. App. 3d 1017, 1024-1025 [257 Cal. Rptr. 641] [\"GM\" testing of dried bloodstains deemed reliable].) Defendant challenged Schanfield's testimony before it was admitted and after it was questioned by two experts at trial (Blake and Wraxall). The court overruled defendant's objections based on extensive testimony previously given by four experts at an evidentiary hearing (Schanfield, Blake, Tahir, and Divall).\n\nEven assuming the court erred in admitting Schanfield's testimony, the verdict would not have been different under any standard of prejudice now urged by defendant. First, we doubt the jury was persuaded by Dr. Schanfield's attempt to identify the donor of semen found near Kimele. Trial testimony established that the stained carpet and underwear were each subjected to several \"GM\" tests; that no two tests on either item produced the same results; and that Schanfield inexplicably combined the results of the various underpants tests to reach his critical Conclusions about defendant. All three experts who testified at trial, including Schanfield, agreed that the results of the various underpants tests were \"inconsistent\" or \"strange\" because dominant genetic markers were not detected even where weaker markers were said to be present. Defense and prosecution experts also observed--and Schanfield did not deny--that he failed to consider certain variables that could have affected test results. The most notable factor was whether the semen stains were so \"diluted\" that a positive \"GM\" reading of any kind suggested contamination by vaginal secretions, bacteria, urine, or cloth fibers.\n\nIn addition, evidence of defendant's guilt of both murders was strong. The testimony suggested defendant had recently threatened those Progressive employees--Kimele and her male supervisor--who were responsible for janitorial complaints. Defendant was evidently present at the scene when the\n\nmurders most likely occurred, and he made alibi statements to police and at trial that were uncorroborated, inconsistent, and/or refuted by other witnesses. Fingerprints, cigarette butts, and janitorial supplies connected defendant to the victims' bodies and/or their bloodstains, and testimony about defendant's knife linked him to the murder weapon.\n\nFinally, in accordance with the prosecution's theory of first degree felony murder, there was other convincing evidence that each victim was killed in the course of a rape or attempted rape. Catherine, a virgin, was found \"spreadeagle\" and naked from the waist down, with semen in her vagina. Kimele was found similarly disrobed in a position suggesting that a violent sexual assault had occurred. A pubic hair that could have belonged to defendant, but not to the victims or any other possible suspect, was found on a semen-stained portion of carpet underneath her body. Thus, any error in admitting Schanfield's testimony over defendant's Kelly/Frye or relevance objections was not prejudicial.\n\nDefendant separately claims that testimony placing him within a small group of Blacks (1 to 4 percent) who could have contributed the semen found on Kimele's underpants suggested a mathematical probability of guilt that misled the jury and deprived him of a fair trial and the right to be acquitted upon a reasonable doubt. (People v. Collins (1968) 68 Cal. 2d 319, 329-332 [66 Cal. Rptr. 497, 438 P.2d 33, 36 A.L.R.3d 1176].)\n\nDefendant's failure to challenge admission of this evidence under Collins at trial waives the issue on appeal. (Evid. Code, § 353; People v. Coleman, supra, 46 Cal. 3d 749, 776-777.) We also note that this claim conflicts with defendant's attack on the hair comparison evidence insofar as it purportedly lacked similar mathematical specificity (see Discussion, ante).\n\nIn any event, we find no error or prejudice. Statistical stain-typing evidence of the sort which includes the accused within the class of possible donors has long been admitted in California. (People v. Fierro (1991) 1 Cal. 4th 173, 215 [3 Cal. Rptr. 2d 426, 821 P.2d 1302]; People v. Poggi (1988) 45 Cal. 3d 306, 324 [246 Cal. Rptr. 886, 753 P.2d 1082]; People v. Brown (1985) 40 Cal. 3d 512, 536, fn. 6 [220 Cal. Rptr. 637, 709 P.2d 440], and cases cited.) Moreover, as already explained, Dr. Schanfield's testimony about the semen stains found in Kimele's panties was inherently weak, and the clearly valid evidence that defendant killed and sexually assaulted both victims was strong. Hence, it is not reasonably probable that the verdict was affected by Dr. Schanfield's calculations of \"mathematical probability\" about defendant and the stains.\n\nH. Crime Scene Photographs and Videotape\n\nDefendant claims the trial court erred in overruling his objections to three 8-by-10-inch color photographs taken of the victims at the crime scene. Two of the photos depicted the victims as initially encountered by detectives, and the third one showed Kimele rolled on her stomach to expose her back. Defendant contends here, as below, that this evidence was irrelevant in light of his offer to enter any \"reasonable\" stipulation to avoid its admission. He also repeats his claim that the photos were gruesome and inflammatory, and that less objectionable photographs were purportedly available.\n\nNo error occurred. As previously noted, the first degree murder charges were tried under the theory that the killings were premeditated or perpetrated during a rape or attempted rape. The photographs were pertinent because they showed the nature and placement of the fatal wounds (People v. Price, supra, 1 Cal. 4th 324, 441; People v. Fierro, supra, 1 Cal. 4th 173, 222) and the sexually suggestive position in which the women were found (People v. Coleman, supra, 46 Cal. 3d 749, 775-776). The prosecution \"was not obliged to prove these details solely from the testimony of live witnesses\" (People v. Turner (1990) 50 Cal. 3d 668, 706 [268 Cal. Rptr. 706, 789 P.2d 887]) or to accept antiseptic stipulations in lieu of photographic evidence. \"[T]he jury was entitled to see how the physical details of the scene and the bod[ies] supported the prosecution theory of [first degree murder].\" (Ibid.)\n\nNor did the court err in concluding that the probative value of the evidence outweighed its prejudicial impact. We have independently reviewed the photographs and conclude they were not unduly gruesome or inflammatory. (People v. Fierro, supra, 1 Cal. 4th 173, 223; People v. Turner, supra, 50 Cal. 3d 668, 707; People v. Coleman, supra, 46 Cal. 3d 749, 776.)\n\nDefendant next asserts the court erred in overruling his objections to a police videotape of the crime scene. He stresses here, as below, that portions of the color tape showing the dead bodies were inflammatory and cumulative, and should have been excised by the court.\n\nHowever, most of the 25-minute tape depicted the physical layout of the Progressive building and grounds, and helped clarify extensive, potentially confusing testimony about the scene. The three minutes of tape devoted to the victims similarly showed where they were found in relation to other physical evidence. Such details are relevant for the reasons stated in People v. Turner, supra, 50 Cal. 3d 668, 706. In addition, we have independently\n\nreviewed the videotape and agree with the trial court that it was substantially more probative than prejudicial.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nI. Handgun Testimony\n\nDefendant challenges references by three prosecution witnesses to a handgun he possessed at the time of his arrest. We find no prejudicial error.\n\nAt the end of cross-examination, defense counsel asked defendant's companion, Brenda, whether defendant had asked her to \"dispose of anything for him in this case.\" She replied that she removed a handgun from the house at his request and gave it to her sister, Latonya.\n\nThe prosecution elicited testimony about the gun on three subsequent occasions. In response to questions posed at the start of redirect examination, Brenda revealed that defendant requested disposal of the gun the day of his arrest; that he intended to hide it from police; and that Latonya forwarded the gun to a Detective Costello. Latonya and Costello confirmed this chain of events at trial.\n\nDefendant timely moved outside the jury's presence to strike each witness's testimony about the gun. The court summarily denied the requests.\n\nDefendant argues here, as below, that the court erroneously denied his motion to strike Brenda's original reference to the gun on grounds it was \"unexpected,\" nonresponsive and irrelevant. He insists the gun was unrelated to the capital charges and simply encouraged the jury to speculate about defendant's participation in other criminal endeavors.\n\nNo error occurred. Defense counsel's question about handling property \"in this case\" was not limited on its face to evidence ultimately introduced at trial, and logically encompassed Brenda's actions during the police investigation. Her answer was therefore responsive, and defendant had no right to strike it. (See generally Evid. Code, § 766; 1 Jefferson, Cal. Evidence Benchbook (2d ed. 1982) § 27.13, pp. 773-774.)\n\nDefendant is correct, however, that the gun had no bearing on defendant's guilt of the charged crimes, and that the prosecutor had no right to exploit its admission during subsequent examinations of Brenda and other witnesses. (See 1 Jefferson, supra, § 27.17, pp. 787-788.) The court erred in overruling defense objections at this stage.\n\nNevertheless, prosecution evidence about the gun could not have affected the verdict. It simply reiterated testimony already admitted on defense cross-examination, and was not mentioned in closing argument. The jury could readily conclude the gun had no bearing on the capital crimes. Any unfavorable character inferences were marginal in light of other strong evidence that defendant sexually assaulted and murdered Kimele and Catherine.\n\nJ. Sufficiency of Evidence--Identity\n\nDefendant contends the evidence was insufficient to identify him as the perpetrator of the charged crimes. We disagree.\n\nViewed most favorably to the People (People v. Johnson (1980) 26 Cal. 3d 557, 578 [162 Cal. Rptr. 431, 606 P.2d 738, 16 A.L.R.4th 1255]), the record discloses the following facts: Defendant, the janitor, had ample opportunity to commit the crimes. Testimony by the pathologist and the victims' relatives indicates that Kimele was probably killed between 2:15 and 3:30 p.m., and that Catherine was probably killed around 4 p.m. Other witnesses testified that defendant was working in the building from 9 a.m. until at least 1:30 p.m.; that his car was still there at 3:30 p.m.; and that he did not arrive home until 5 p.m. Defendant admitted that it usually took him only 30 minutes to drive home. The jury could reasonably infer that he was present at the scene when both murders occurred.\n\nRecent events in defendant's work history supplied a possible motive for the killings. It was undisputed that defendant's supervisor, Rubalcaba, told defendant about the Progressive complaint a few days before the crimes, and that Rubalcaba's supervisor, Leppington, discussed the problem with defendant as little as 45 minutes before Kimele was killed. Though defendant disputed the claim, Rubalcaba insisted defendant threatened to harm the person who had criticized his work--a person defendant knew was likely to be Kimele. The jury could reasonably conclude that Kimele's murder was not an amazing coincidence, and that defendant acted on the apparent threat at the earliest possible opportunity.\n\nThe jury could also have accepted the prosecutor's plausible claim that Catherine was killed because she surprised defendant while he was committing, or cleaning up after, the crimes against Kimele. This inference is supported by evidence that defendant believed he and Kimele were alone in the building when Leppington left at 1:30 p.m.; that Catherine did not arrive at work until sometime after 1:45 p.m. (according to her sister-in-law); and that Catherine was attacked in the women's restroom, near the janitor's\n\ncloset, anywhere from 30 minutes to an hour and 45 minutes after the crimes against Kimele.\n\nProsecution and defense witnesses basically agreed that defendant owned a knife similar to the one found near Progressive and identified as the probable murder weapon. The jury could infer from the distinctive appearance of the weapon that it was defendant's knife and that--contrary to his postarrest statements to Brenda--it had not been stolen before the crimes.\n\nIncriminating physical evidence also connected defendant to the crimes. The pubic hair found underneath Kimele could have belonged to defendant but not to the victims or any other possible suspect. Cigarette butts found near the victims' bloodstains were defendant's brand and tested positive for his blood type.\n\nOther evidence strongly suggested defendant attempted a hasty cleanup after the crimes. ABM manager Leppington testified that the building, including the women's restroom, was clean and that only the vacuuming remained to be done when he left at 1:30 p.m. However, investigators found janitorial supplies in apparent disarray in the women's restroom, where Catherine was evidently stabbed. A fingerprint positively identified as defendant's, and another print that could have been his, were discovered on each of two bloody paper towels crumpled together near Catherine's body. The jury was not required to draw the contrary and incredibly coincidental inference that one or both prints were placed on the towels when defendant stocked the dispensers earlier that day.\n\nFinally, defendant engaged in postcrime behavior from which the jury could infer a consciousness of guilt. He placed a jumpsuit over his work clothes before arriving home, and uncharacteristically laundered the same clothes immediately after Brenda left the house. In addition, his statements to police and the jury differed on several key issues, such as the time he left work the day of the crimes, whether he was still wearing the jumpsuit when he arrived home, the type of car problems he supposedly experienced along the way, and whether he owned or carried a knife near the time of the crimes. On balance, the jury could believe defendant was attempting to conform his trial testimony to facts discovered by detectives after he had spoken to them. We therefore find ample evidence to support the jury's identification of defendant as the perpetrator of the crimes.\n\nK. Sufficiency of Evidence--Premeditation\n\nDefendant contends there was insufficient evidence of premeditation and deliberation to support the first degree murder verdict as to each victim.\n\nDefendant relies on People v. Anderson (1968) 70 Cal. 2d 15, 26-27 [73 Cal. Rptr. 550, 447 P.2d 942], which identified three categories of evidence typically used to resolve this issue: planning activity, motive, and manner of killing. Contrary to defendant's suggestion, Anderson does not require that these factors be present in some special combination or that they be accorded a particular weight, nor is the list exhaustive. Anderson was simply intended to guide an appellate court's assessment whether the evidence supports an inference that the killing occurred as the result of preexisting reflection rather than unconsidered or rash impulse. (People v. Perez (1992) 2 Cal. 4th 1117, 1125 [9 Cal. Rptr. 2d 577, 831 P.2d 1159].)\n\nOf course, the appellate court does not substitute its judgment for that of the jury but affirms the verdict if a rational trier of fact could find premeditation and deliberation beyond a reasonable doubt. (Perez, supra, at p. 1124.) A violent and bloody death sustained as a result of multiple stab wounds can be consistent with a finding of premeditation. (See, e.g., Perez, supra.)\n\nHere, there was sufficient evidence from which the jury could infer that defendant premeditated Kimele's death. At least two plausible motives for the slaying appear. One inference is that defendant acted on his apparent threat to harm the person who had complained about his work--a person defendant knew was likely to be Kimele. The jury could also conclude defendant killed Kimele to silence her as a possible witness to her own sexual assault. As previously explained, the position of Kimele's nearly nude body and the presence of a Black pubic hair on a semen-stained portion of carpet underneath her body suggested that she had been killed during the course of a rape or attempted rape.\n\nDefendant may also have at least briefly planned the fatal confrontation with Kimele in the conference room. Three Progressive employees testified that they saw defendant cleaning inside the building on Labor Day and that they left by 12:45 p.m. Defendant remembered seeing at least one of them that morning, and believed he and Kimele were the only people remaining inside the building after ABM manager Leppington left at 1:30 p.m. The jury could infer that defendant waited until he thought everyone else was gone and then followed or forced Kimele into the conference room--the most secluded part of the building.\n\nThe manner of killing also evidences reflection. The prosecution established that Kimele was stabbed 18 times; that all but 1 of the wounds were located in her torso; and that no defensive knife wounds were found. The location of bloodstains, semen and the Black pubic hair suggests the fatal\n\nattack occurred on the conference room floor, where the body was found. The jury could infer defendant pinned Kimele down or otherwise rendered her helpless before the stabbing began. Under the circumstances, a rational trier of fact could conclude defendant premeditated and deliberated Kimele's death.\n\nWe reach the same Conclusion about Catherine. The record discloses at least two plausible motives for her murder. As noted, she apparently arrived on the scene after 1:45 p.m. and surprised defendant while he was committing, or cleaning up after, the crimes against Kimele. Catherine was ultimately found naked from the waist down, with her legs spread apart. Semen in her vagina was evidently deposited near the time of death. The jury could infer Catherine was killed to silence her as a possible witness to the sexual assault upon herself and/or to the crimes against Kimele.\n\nCatherine's injuries also evidence reflection. Over 40 of the 69 stab wounds were located on her chest and back. They were \"clustered\"--in some cases \"symmetrically\"--on the left side, near the heart. Based on the number and placement of the wounds and the apparent fact that Catherine was the second victim, the jury could infer her death was calculated and was not the product of an unconsidered explosion of violence. We reject defendant's sufficiency of evidence claim.\n\nL. CALJIC No. 2.04\n\nOver defendant's objection, the trial court instructed the jury with an essentially standard version of CALJIC No. 2.04, which permits the jury to infer a \"consciousness of guilt\" from any attempt by defendant to \"fabricate evidence\" at trial.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nDefendant focuses here, as the parties did below, on confusing testimony given by several witnesses, including defendant, concerning the shirt he wore to work the day of the crimes. Some of this testimony suggested that defendant had not properly identified the shirt at trial. Defendant insists that any conflicting testimony about the shirt is \"immaterial\" to his guilt as a matter of law and does not support the instructional inference. He also claims the court violated his federal constitutional rights (due process and reliable death judgment) by giving the instruction.\n\nEven assuming defendant's assessment of the \"shirt\" testimony is true, any error in giving CALJIC No. 2.04 was harmless. Defendant seems to\n\nconcede that, at worst, there was no evidence to support the instruction and that it was superfluous. As previously explained, evidence of defendant's guilt was strong. Under the circumstances, reversal on such a minor, tangential point is not warranted.\n\nM. Unanimity Instructions\n\nAs noted, both first degree murder charges were submitted to the jury under premeditation and rape-murder theories. In a special instruction requested by the prosecution, the jury was told that it must unanimously agree on any first degree murder verdict, but that it need not agree on the underlying theory.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Defendant objected to this instruction only on grounds the particular language was ambiguous and might mistakenly produce a less-than-unanimous first degree murder conviction. Elsewhere, the instructions stressed the need for jury unanimity as to any verdict in general, and as to any decision to convict defendant of a particular degree of homicide.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nDefendant does not challenge the propriety of these instructions on appeal. Instead, he claims the court erred in not instructing the jury sua sponte that it must unanimously agree on the particular sexual act underlying any first degree felony-murder verdict as to Catherine. Defendant argues that individual jurors might have based such a verdict on \"different acts\" (i.e., that defendant killed Catherine during the course of a rape or attempted rape upon either Catherine or Kimele), and that the Fifth, Sixth, and Eighth Amendments to the federal Constitution somehow preclude such a result.\n\nAs implicitly conceded by defendant at trial and on appeal, the jury was not required to decide which of the two proposed \"theories\" (premeditation versus rape-murder) governed the killings in this case. Each juror need only have found defendant guilty beyond a reasonable doubt of the single, statutory offense of first degree murder. (Schad v. Arizona (1991) 500 U.S. , , [115 L.Ed.2d 555, 514, 572- 573, 111 S.Ct. 2491, 2496, 2503]; People v. Beardslee (1991) 53 Cal. 3d 68, 92 [279 Cal. Rptr. 276, 806 P.2d 1311]; People v. Adcox, supra, 47 Cal. 3d 207, 243; People v. Guerra (1985)\n\n40 Cal. 3d 377, 386 [220 Cal. Rptr. 374, 708 P.2d 1252]; People v. Milan (1973) 9 Cal. 3d 185, 194-195 [107 Cal. Rptr. 68, 507 P.2d 956].) Whatever the basis for this long-standing rule (see Schad v. Arizona, supra, 500 U.S. at p. [115 L.Ed.2d at pp. 572-573, 111 S.Ct. at p. 2503]), it follows that the same jury need not have unanimously agreed on the precise factual details of how a killing under one or the other theory occurred in order to convict defendant of first degree murder.\n\nHere, the prosecution's claim that defendant killed Catherine during the course of a rape or attempted rape was relevant only as a possible basis for finding him guilty of first degree murder under a felony-murder theory. Contrary to defendant's claim, he was not entitled to a unanimous verdict as to the particular manner in which any such felony murder occurred. Thus, the court did not err in failing to instruct the jury sua sponte in the terms urged here.\n\nN. Failure to Instruct on Voluntary Manslaughter\n\nThe court instructed the jury on first and second degree murder, but denied defendant's request for instruction on the lesser included offense of voluntary manslaughter. Defendant argued at trial, as he does on appeal, that manslaughter instructions were warranted because there was sufficient evidence from which the jury could conclude that the killings, even if intentional, occurred \"upon a sudden quarrel or heat of passion\" in the absence of either malice or an underlying felony. (§ 192; see People v. Balderas (1985) 41 Cal. 3d 144, 196-197 [222 Cal. Rptr. 184, 711 P.2d 480]; People v. Wickersham (1982) 32 Cal. 3d 307, 325 [185 Cal. Rptr. 436, 650 P.2d 311]; People v. Sedeno (1974) 10 Cal. 3d 703, 719 [112 Cal. Rptr. 1, 518 P.2d 913].) Defendant also contends the failure to instruct violated certain federal constitutional guarantees (due process and reliable death judgment).\n\nThe record does not support these claims. To the extent defendant relies solely on criticism he received about his work performance three days before the crimes, such evidence is insufficient as a matter of law to arouse feelings of homicidal rage or passion in an ordinarily reasonable person. (See People v. Balderas, supra, 41 Cal. 3d 144, 196.) Defendant also suggests the killings may have occurred as the result of a \"bitter argument\" between him and Kimele immediately beforehand. This scenario is purely speculative. And, because the injuries inflicted upon the victims were consistent with either a provoked or a premeditated killing, we reject defendant's claim that such evidence in and of itself justified the requested instructions. On this record, failure to instruct on voluntary manslaughter was not error.\n\nO. Defendant's Presence at \"Readback\"\n\nDuring guilt deliberations, the jury asked that they be read certain portions of testimony by several witnesses, including defendant and investigating detectives. As previously stipulated, the court and all counsel thoroughly discussed the request and agreed upon the excerpts that would be presented. It was further agreed that neither the court nor counsel would attend the \"readback,\" and defense counsel waived defendant's right to be present. As requested by the defense, the court told the reporter to read from her actual notes, rather than the prepared transcripts. With counsel's approval, the reporter was also instructed not to \"editorialize or make any comment or answer any questions\" during the readback. The actual readback between the reporter and jury was not reported.\n\nDefendant first claims a capital defendant may never voluntarily absent himself from any stage of trial. He relies on the Fifth and Sixth Amendments to the federal Constitution, article I, section 15 of the state Constitution, and Penal Code sections 977 and 1043. It is settled, however, that a capital defendant's right to attend even \"critical stages\" of his trial may be waived. (People v. Price, supra, 1 Cal. 4th 324, 405; People v. Edwards, supra, 54 Cal. 3d 787, 810; People v. Sully (1991) 53 Cal. 3d 1195, 1239 [283 Cal. Rptr. 144]; People v. Robertson (1989) 48 Cal. 3d 18, 60-62 [255 Cal. Rptr. 631, 767 P.2d 1109].)\n\nDefendant insists he was required to personally waive any right to be present at the readback. However, our cases recognize that counsel has discretion to consent to a reading of testimony outside the presence of the court, counsel, and/or defendant. (See People v. Medina (1990) 51 Cal. 3d 870, 904 [274 Cal. Rptr. 849]; People v. Lang (1989) 49 Cal. 3d 991, 1028 [264 Cal. Rptr. 386, 782 P.2d 627]; People v. Bloyd (1987) 43 Cal. 3d 333, 361 [233 Cal. Rptr. 368, 729 P.2d 802].)\n\nDefendant also argues that his federal constitutional rights were violated (due process, effective assistance of counsel, and reliable death judgment) because no one was present (the court, counsel, or defendant) to monitor or report the readback. Contrary to defendant's suggestion, we will not presume that testimony was misread or that misconduct occurred, particularly in light of the precautions identified above. (People v. Medina, supra, 51 Cal. 3d 870, 904.) There is no basis for reversing the judgment on this ground.\n\nP. Cumulative Effect of Guilt Phase Errors\n\nDefendant argues that various alleged guilt phase errors, considered individually or in combination, were prejudicial. We have already rejected most\n\nof these claims on the merits and found that none was prejudicial. We also conclude that any errors, considered together, did not substantially prejudice defendant or preclude a fair trial. Contrary to defendant's view of the case, evidence supporting the guilt judgment was not \"close\" but was strong in many respects. We see no basis for reversal of the guilt judgment.\n\nV. Penalty Phase Issues\n\nA. Motion for Separate Juries\n\nDefendant moved for separate guilt and penalty juries before each phase of trial. The requests were denied.\n\nDefendant argues here, much as below, that his federal constitutional rights (due process and reliable death judgment) were violated because the same jury decided his guilt of the capital crimes and his commission of other offenses offered in aggravation at the penalty phase. The penalty jury was purportedly prejudiced by its knowledge of the capital crimes.\n\nWe rejected the same claim in People v. Balderas, supra, 41 Cal. 3d 144, 204. Even if a separate jury decides penalty, it is statutorily \"entitled to hear\" evidence of the circumstances of the capital crimes and the existence of any special circumstance found true at the guilt phase. (Ibid., citing § 190.3, factor (a).) Hence, the strong legislative preference for a unitary jury (§ 190.4, subd. (a)) outweighs any supposed disadvantage to defendant in the single jury system. (Balderas, supra, 41 Cal. 3d at p. 204.)\n\nDefendant also argues it was \"fundamentally unfair\" for the jury to learn for the first time at the penalty phase about his other violent crimes and prior felony conviction. He theorizes that the jury blamed the defense for withholding this information at the guilt phase, and that counsel's credibility at the penalty trial suffered as a result.\n\nWe rejected a similar claim in People v. Taylor (1990) 52 Cal. 3d 719, 737-738 [276 Cal. Rptr. 391, 801 P.2d 1142]. There, the trial court denied a defense motion for separate juries or for additional voir dire made on grounds the jury--having heard no defense evidence at the guilt phase--would question counsel's credibility when it heard evidence of defendant's mental condition at the penalty phase. We found no error. \"If defendant's argument were accepted, the trial court would be required to [empanel separate juries or] permit re-voir dire of the jury in every case in which there was any deviation between the defense strategy\" at the guilt and penalty phases. (Taylor, supra, at p. 738, italics added.) We reasoned that the\n\nspeculative nature of the alleged prejudice did not warrant such a drastic result.\n\nIt follows that the trial court did not err in denying the motion for separate juries here. It is the rare case in which the jury learns the full extent of a capital defendant's criminal background before the penalty trial. Defendant's \"credibility\" claim is speculative, and its acceptance would effectively require separate juries in the vast majority of capital cases. Such a scenario obviously contravenes the single-jury process contemplated by section 190.4, subdivision (c).\n\nB. Defendant's Presence at the Penalty Phase\n\nAt two in camera hearings held before the penalty trial began, defendant personally asked to be excused from all further proceedings in the case. He explained that he was not guilty of the charged crimes and did not want to watch family members \"plead for [his] life.\" Defendant said he would become \"angry\" and might \"go off\" if forced to attend. Defense counsel objected to defendant's absence from any portion of trial, but was concerned about his apparent threat to disrupt the proceedings. The trial court concluded that defendant need not attend hearings and arguments on questions of law, but that he must attend any portion of trial in which evidence was introduced.\n\nThereafter, defendant signed a form waiving his presence during nonevidentiary proceedings. When appearing in court on other occasions, he chose to protest his mandatory attendance by wearing jail clothes, instead of the business suit he had worn throughout the guilt phase. As a result, the waist chain was apparently visible to the jury. The court instructed the jury shortly before opening argument to \"disregard\" the physical restraints and jail clothes because they had \"no bearing whatsoever on [the] decision in this case.\" The court asked jurors whether they could follow the admonition, and they answered \"yes\" on the record.\n\nDefendant now argues the court improperly prevented him from boycotting the entire penalty trial. Even assuming error occurred (see People v. Sully, supra, 53 Cal. 3d 1195, 1238-1240), defendant's presence in and of itself cannot be deemed prejudicial. Indeed, counsel strongly suggested in camera that defendant was needed in the courtroom to assist in his defense.\n\nWe also reject defendant's claim that he was prejudiced insofar as he appeared at the penalty phase in jail clothes and shackles. Defendant voluntarily chose to protest the court's order in this manner and is estopped from\n\ncomplaining on appeal about his conduct. In any event, we assume the jury followed the court's instruction and disregarded defendant's appearance in reaching its decision. (See People v. Duran, supra, 16 Cal. 3d 282, 291-292.)\n\nC. Denial of Continuance\n\nDefendant moved for a continuance at an in camera hearing held 12 days after the guilt verdict was rendered and 5 days before the penalty trial was set to begin. One of defendant's attorneys, Peters, maintained that a four- to-six-week continuance of trial was necessary to determine \"whether or not we can present any kind of psychiatric defense.\" Counsel presented a letter from defense psychiatrist Globus, which said Globus had been working with defendant since \"long before his trial.\" Dr. Globus perceived hostile and paranoid tendencies in defendant, and suspected he was withholding critical information about his childhood. Dr. Globus estimated that the background investigation would take \"considerable time,\" not less than four to six weeks, but cautioned that a \"sufficient rapport\" with defendant might never be established.\n\nThe requested continuance was also based on statements made under oath at the hearing by defense investigator Barbara Jordan. She said defendant mentioned for the first time the previous day that he had endured \"brutal treatment\" by his father. Defendant's other attorney, Riley, then volunteered that defendant had \"confidentially\" revealed the same information to him several times during the preceding year, but that Riley did not repeat it to anyone, including cocounsel Peters.\n\nThe court denied the motion. The defense sought reconsideration of the ruling, offering to accept a two-week continuance. The request was again denied. The penalty trial began a few days after its originally scheduled time. Almost three weeks passed between the time the continuance was denied and the time the defense penalty case began.\n\nWe reject defendant's claim that the court abused its discretion or deprived him of his federal constitutional rights (due process and reliable death judgment). (See People v. Mickey (1991) 54 Cal. 3d 612, 660 [286 Cal. Rptr. 801, 818 P.2d 84].) The record discloses ample opportunity to investigate defendant's background by the time the request for a continuance was made.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e To the extent defendant was not cooperating in the investigation, the trial court could reasonably infer that further efforts were not likely to produce significant information in a reasonable amount of time. Indeed,\n\nDr. Globus's letter suggested that, despite his lengthy relationship with defendant, the investigation would take at least four to six more weeks and might not be fruitful. The court had reason to suspect defendant was effectively seeking an indefinite continuance, and it was not required to oblige.\n\nNo different result was warranted by evidence that defendant had recently conveyed \"new\" information about an abusive parent to Investigator Jordan. Counsel Riley had apparently known about this information for quite some time, but did not explain why he waited to reveal it to cocounsel and/or Dr. Globus. The court could reasonably conclude that the request for a continuance was brought solely for purposes of delay, and that it was not likely to uncover information that would materially assist the defense.\n\nD. Validity of Prior Felony Conviction\n\nBefore the penalty trial, defendant moved to declare his 1972 conviction for the forcible rape of Gloria G. invalid on grounds he did not knowingly waive his \" Boykin-Tahl \" rights (Boykin v. Alabama (1969) 395 U.S. 238 [23 L.Ed.2d 274, 89 S.Ct. 1709]; In re Tahl (1969) 1 Cal. 3d 122 [81 Cal. Rptr. 577, 460 P.2d 449]) before pleading guilty to the offense. The court held an evidentiary hearing on the motion. It ultimately concluded no constitutional violation had occurred at the plea hearing 15 years earlier. Defendant's request to preclude use of the conviction at the penalty trial was therefore denied.\n\nDefendant argues that he sustained his burden of proving the guilty plea was not taken under proper advisement and waiver (see Curl v. Superior Court (1990) 51 Cal. 3d 1292, 1303-1305 [276 Cal. Rptr. 49, 801 P.2d 292]), and that insufficient evidence supports the court's contrary ruling. The ruling also purportedly violates defendant's Fifth and Sixth Amendment rights under the federal Constitution. We disagree.\n\nDefendant emphasizes the following facts adduced at the evidentiary hearing: No reporter's transcript of the hearing at which defendant pled guilty apparently exists. The trial Judge (Galcagno) who took the plea is deceased, and the responsible prosecutor (Winkler) and principal public defender (Trefts) have no memory of the individual circumstances under which defendant's plea was taken. A copy of the minute order says defendant \"waived trial/jury,\" but does not refer to any other \" Boykin-Tahl \" advisements or waivers (e.g., privilege against self-incrimination and right to cross-examine and confront witnesses). Defendant testified at the evidentiary hearing that he \"did not remember\" anybody advising him of his constitutional rights before he pled guilty.\n\nNevertheless, the trial court could infer compliance with Boykin- Tahl on the basis of \"habit and custom\" evidence duly admitted at the evidentiary hearing. (See, e.g., Curl v. Superior Court, supra, 51 Cal. 3d 1292, 1297-1298.) Attorneys Winkler and Trefts testified that all defendants who pled guilty before Judge Galcagno were fully advised by their counsel of all constitutional rights and potential sentencing consequences, and that the Judge extracted a personal waiver on each issue from every accused. Both witnesses were adamant that the Judge--who always insisted on a \"perfect record\"--never deviated from this procedure. Substantial evidence therefore supports the court's decision to uphold the constitutional validity of the prior conviction.\n\nE. Expungement of Prior Felony Conviction\n\nAs noted, defendant forcibly raped Gloria G. shortly before his 18th birthday. He was charged as an adult, pled guilty in 1972, and was committed to the Youth Authority. He eventually received an honorable discharge. At trial and on appeal, the parties assume the conviction was formally set aside under Welfare and Institutions Code section 1772, which purports to remove \"all penalties and disabilities\" resulting from the conviction and commitment.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Defendant argues here, as he did before the start of the penalty trial, that the statute precluded use of the prior conviction against him for any purpose, including aggravation at the penalty phase. He is mistaken.\n\nIt is settled that Welfare and Institutions Code section 1772 does not eradicate a conviction for all purposes. (See, e.g., People v. Bell (1989) 49 Cal. 3d 502, 542-546 [262 Cal. Rptr. 1, 778 P.2d 129].) The Youth Authority Act is intended to benefit the public by providing youthful offenders with rehabilitative programs such as education, vocational training, work furloughs, and supervised parole. (Bell, supra, at pp. 543-544.) Expungement of the criminal record rewards an honorable discharge, encourages continued success, and protects a rehabilitated adult from the lifelong stigma of a youthful mistake.\n\nHowever, such rehabilitative goals are not at stake in a subsequent criminal proceeding. As a result, convictions otherwise forgiven or expunged under Welfare and Institutions Code section 1772 may be used to enhance a sentence imposed for a subsequent criminal offense. (People v. Shields (1991) 228 Cal. App. 3d 1239, 1243 [279 Cal. Rptr. 403], review denied June 19, 1991; People v. Jacob (1985) 174 Cal. App. 3d 1166, 1171-1172 [220 Cal. Rptr. 520].) \"[T]he enhancement is not an added punishment for the prior serious felony conviction, but instead 'is a stiffened penalty for the latest crime, which is considered to be an aggravated offense because [it is] a repetitive one.' [Citations.]\" (Jacob, supra, at p. 1172.)\n\nAnalogous reasoning applies here. The penalty jury was entitled to know that defendant committed the capital crime undeterred by a prior successful felony prosecution. (See People v. Balderas, supra, 41 Cal. 3d 144, 202.) Such propensity for criminal conduct is relevant even where Welfare and Institutions Code section 1772 applies to the prior offense. We therefore conclude defendant's prior felony conviction was admissible as such under section 190.3, factor (c). It was also admissible under factor (b) as proof that defendant committed other violent criminal activity, namely, forcible rape. No error occurred.\n\nF. Effect of Prior Plea Bargains\n\nDefendant notes that criminal charges concerning the forcible rape of Josephine H. in 1971 were apparently dismissed in exchange for defendant's plea of guilty to the forcible rape of Gloria G. He also apparently pled guilty to one count of breach of the peace, a misdemeanor, in exchange for dismissal of battery charges stemming from his 1976 confrontation with the Marks family.\n\nDefendant argues that prior violent crimes subject to a plea bargain are inadmissible in a subsequent capital trial. He claims a contrary rule would subject the defendant to \"adverse sentencing consequences\" beyond those agreed to at the time the bargains were made.\n\nDefendant admits we rejected the same claim in People v. Melton (1988) 44 Cal. 3d 713, 755 [244 Cal. Rptr. 867, 750 P.2d 741], on grounds there was no statutory, due process, or double jeopardy bar to admitting \"bargained\" violent crimes at the penalty trial for a subsequent offense. Defendant asks us to reconsider Melton because vague \"reliability\" and \"speedy trial\" concerns are allegedly at stake. As in other cases, we see no basis for doing so. (See People v. Taylor, supra, 52 Cal. 3d 719, 743; People v. Frank (1990) 51 Cal. 3d 718, 728-729 [274 Cal. Rptr. 372, 798 P.2d 1215]; People v. Douglas (1990) 50 Cal. 3d 468, 529 [268 Cal. Rptr. 126, 788 P.2d 640].)\n\nG. Notice of Other Violent Crimes\n\nDefendant contends he received inadequate notice under section 190.3 of certain circumstances surrounding the 1976 assault on the Marks family and the 1980 sexual assault on Leonie D.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Both claims lack merit.\n\nAs to the first incident, Sandy Marks testified that defendant became violent when he tried to collect rent from Sandy's sister, Jackie, and that defendant hit or pushed Jackie, Sandy, and Sandy's young son. Defendant timely objected outside the jury's presence on grounds the prosecution's written pretrial notice did not mention that defendant struck Sandy's son. The prosecutor noted that Sandy was not located until shortly before the penalty trial, and that she mentioned the assault on her son for the first time three days before her testimony. The prosecutor concededly \"forgot\" to report this information to the defense.\n\nDespite this apparent memory lapse, we agree with the trial court that no violation of section 190.3 occurred. A capital defendant is entitled to notice of other violent crimes or prior felony convictions offered in the prosecution's penalty case-in-chief before the cause is called to trial or as soon thereafter as the prosecution learns the evidence exists. (People v. Daniels (1991) 52 Cal. 3d 815, 879 [277 Cal. Rptr. 122, 802 P.2d 906]; People v. Jennings (1988) 46 Cal. 3d 963, 987 [251 Cal. Rptr. 278, 760 P.2d 475].) However, the prosecutor is not prevented from introducing all the circumstances of a duly noticed incident or transaction simply because each and every circumstantial fact was not recited therein. (See, e.g., People v. Howard (1988) 44 Cal. 3d 375, 424-425 [243 Cal. Rptr. 842, 749 P.2d 279].) The notice is sufficient if it gives defendant \"a reasonable opportunity\" to prepare a defense to the allegations. (Howard, supra, at p. 425.)\n\nHere, the written notice specifically referred to the \"[a]ssault on Jackie Marks\" at a particular place and time. It also referred to a police report of the incident included in discovery materials provided to the defense. Defendant concedes that because the assault on Sandy was mentioned in the referenced report, adequate notice of that act was provided. As noted by the trial court, the same report also apparently mentioned that children were present and that defendant threatened to beat them. Under the circumstances, the notice and related discovery materials alerted defendant to the\n\nfact that evidence of his violent or potentially violent conduct toward any person present at the scene would be admitted at trial. No error or impropriety occurred.\n\nDefendant also challenges notice of the unadjudicated sexual assault upon Leonie D. in 1980. The written pretrial notice said the prosecution would introduce evidence of a \"forcible rape\" upon this victim at a certain place and time. During direct examination, Leonie testified that defendant forcibly performed \"sexual acts[,] [i]ntercourse and other things,\" upon her. Defendant objected as soon as possible outside the jury's presence on grounds he had never been told about any sexual acts other than rape. The prosecution replied that it had learned from Leonie earlier in the day that she was \"raped and other things.\" The prosecutor observed that while information about \"other things\" was not forwarded to the defense, it was not explored at trial.\n\nThe trial court properly denied defendant's ensuing motion for a mistrial. The written notice sufficiently informed the defense that any forcible or otherwise unlawful sex acts performed on that occasion would be introduced at trial. Consistent with the principles stated above, the prosecution was not required to list every technically separate criminal offense or act occurring during a single, duly noticed transaction.\n\nH. Alleged Misconduct--Juror Spangler\n\nOn the first day of the penalty trial, the prosecutor made his opening statement and called Josephine H., who testified that defendant forcibly raped her in 1971. After the first recess that day, defendant asked that Investigator Jordan be allowed to relate certain courtroom events she purportedly witnessed during the prosecution's opening statement. Outside the jury's presence, Jordan stated under oath that she saw jury foreman Spangler shaking his head, rolling his eyes, and \"glaring\" at defendant. At one point, Spangler allegedly mouthed the phrase \"son-of-a-bitch,\" and then said something inaudible to neighboring Jurors Dean and Hartley. Jordan also said Spangler shook his head and glared at defendant as the jury left the courtroom at recess.\n\nDefendant contends the court erred in denying his ensuing motion to excuse Spangler or, in the alternative, for a mistrial. Defendant insists Spangler was biased against the defense, and that Spangler's presence on the jury violated defendant's federal constitutional rights (due process, impartial jury, and reliable death judgment).\n\nHowever, the trial court conducted an investigation and adduced facts which rebut defendant's claim. In response to questions by the court and\n\ncounsel, Spangler denied glaring at defendant and said that any other expressions he might have made were prompted by the upsetting nature of defendant's prior crimes. Spangler assured the court that he had not preJudged the penalty issue, apologized for any \"inappropriate\" conduct, and promised to avoid any recurrence. Spangler remembered saying something to Juror Dean, but did not think it had any bearing on defendant or the evidence. Jurors Dean and Hartley did not remember the incident and, like Spangler, said they still had an \"open mind\" about sentencing.\n\nThe court concluded that the defense had \"mischaracterized\" Spangler's conduct in the courtroom, and that no misconduct occurred. The court also found Spangler and the other jurors' assertions of impartiality to be sincere. As in all such matters, we defer to the court's observations and credibility determinations.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e No misconduct or error occurred.\n\nI. Nature of an Execution\n\nBefore the penalty trial began, defendant moved to inform the jury of the nature of an execution through the following means: (1) a jury view of death row and the gas chamber at San Quentin Prison, (2) presentation of an article during closing argument describing an apparent eyewitness account of an execution at the prison, and (3) a special instruction directing the jury to \"consider the method of execution\" in determining penalty. The court denied each request.\n\nContrary to what defendant argues, the court's ruling did not offend the federal Constitution (due process and reliable death judgment). Our cases make clear that information about administration of the death penalty does not aid the jury in making an individualized determination of the appropriate penalty in a particular case. (People v. Morris, supra, 53 Cal. 3d 152, 218 [jury view of San Quentin]; People v. Grant (1988) 45 Cal. 3d 829, 859-860 [248 Cal. Rptr. 444, 755 P.2d 894] [newspaper account of an execution].) Defendant asks us to reexamine these cases, but we decline to do so. \"[T]he jury was told a judgment of death means exactly that. The defendant will lose his life. Further dramatization makes no useful contribution to the\n\nprocess and serves to distract the jury's attention from the task at hand.\" (People v. Morris, supra, 53 Cal. 3d 152, 218.)\n\nJ. Survey of Other Capital Cases\n\nShortly before the defense penalty case began, defendant moved outside the jury's presence to introduce testimony by Dr. Radelet, a college professor. Dr. Radelet had purportedly conducted a survey of \"miscarriages of Justice\" in capital cases, i.e., cases in which the defendant was \"pardoned or found factually innocent because of circumstances that arose after trial.\" Defendant argued that this information would assist the jury in determining whether there was a lingering doubt as to defendant's guilt. The prosecutor objected primarily on relevance grounds. The court sustained the objection.\n\nAside from any foundational or other problems, the proffered evidence was irrelevant as a matter of law. Much like accounts of the executions of others (see Discussion, ante), information about trials, verdicts, and sentences in unrelated criminal cases had no bearing on the appropriate penalty in this particular case. As we have said many times, such a determination rests on the jury's individualized assessment of the circumstances of the capital crime, and the character and background of the defendant. No error occurred. (See People v. Grant, supra, 45 Cal. 3d 829, 860.)\n\nK. \"Victim Impact\" Argument\n\nIn closing argument at the penalty phase, the prosecutor briefly observed that the families of defendant and the victims deserved the jury's sympathy, but that defendant did not.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nDefendant argues that this comment invited the jury to consider the emotional impact of the crimes upon the victims' families, and that such a result is \"constitutionally irrelevant\" under Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529]. Defendant notes he did not object at the time the comment was made because Booth was not yet in existence. Defendant ultimately raised the issue in a new trial motion filed shortly after Booth was decided.\n\nEven assuming the challenged remark was proscribed by Booth, defendant's argument fails. The high court recently overruled Booth in large part,\n\nand concluded that \"victim impact\" evidence and argument does not offend the Eighth Amendment guaranty of an individualized and reliable penalty determination. (Payne v. Tennessee (1991) 501 U.S. [115 L.Ed.2d 720, 111 S.Ct. 2597].) We have also since held that evidence and argument concerning the specific harm caused by the defendant is generally admissible under state law as a circumstance of the capital crime. (People v. Edwards, supra, 54 Cal. 3d 787, 833-836.)\n\nAt most, the prosecutor's remark in this case implied that the victims' loved ones had suffered pain and grief--a predictable consequence of defendant's crimes. No impropriety occurred.\n\nL. Jury Note--Compassion\n\nOn the second day of penalty deliberations, the court received a note from the jury asking whether \"compassion for [defendant's] mother is sufficient reason to find for life imprisonment.\"\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe court and counsel discussed the request. Defense counsel suggested the jury be told, \"yes, [you] may consider compassion for Mrs. Pride.\" Counsel also asked that the court reread all or part of four instructions. One of the instructions requested in full, number 23, was a special defense instruction permitting the jury to spare defendant's life \"for any reasons you deem satisfactory, including humanitarian considerations, or for no reason, if you choose to do so.\" The second complete reinstruction defendant sought concerned number 33, which informed jurors of the individual nature of their penalty determination.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The court said it was reluctant to reread only a portion of any instruction, and that it preferred reading either the two instructions requested in full (23 and 33) or all instructions dealing with \"mitigation and aggravation.\" The defense replied that instruction number 23 was the \"crucial one,\" and that it would be satisfied if number 23 were reread with number 33. The prosecutor did not object. The court then reread numbers 23 and 33 to the jury. There were no further jury inquiries on compassion as a mitigating factor.\n\nDefendant now argues the court erred in not literally answering \"yes\" to the jury's question whether it could consider compassion for defendant's mother as a mitigating factor. However, as defense counsel implicitly recognized below, the court's response was pertinent, fair, and accurate in light of instructions already given. Instruction number 23 provided the affirmative response which defendant sought. Inclusion of the word \"yes\" would not have materially assisted the jury's understanding of the instructions reread to them. No error occurred. (See People v. Livaditis (1992) 2 Cal. 4th 759, 782 [9 Cal. Rptr. 2d 72, 831 P.2d 297] [no duty to instruct on a particular mitigating factor].)\n\nM. Ex Parte Communication With Juror Dean\n\nAfter evening recess was declared on the sixth day of penalty deliberations, the court discussed an employment issue with Juror Dean outside the presence of the other jurors. The conversation was reported and apparently was not attended by the prosecutor, defense counsel, or defendant. Juror Dean stated that his employer had questioned whether a particular day's absence from work was attributable to jury service. The court offered to call or write the employer to explain the full-time nature of Dean's obligation. The court showed Dean a copy of a letter it had drafted stressing the complex nature of the proceedings, the importance of Dean's continued participation, and the faithfulness of his service to date. Dean accepted the court's offer to telephone the employer. Dean also indicated he would physically present the letter to his employer the next day if it seemed necessary to do so.\n\nDefendant now contends the foregoing conversation violated his Sixth Amendment right to effective assistance of counsel. Defendant concedes the court's \"efforts to relieve [any] pressure [on Juror Dean] were not inappropriate,\" but suggests that counsel might have handled the situation differently by seeking to excuse Dean, explore his emotional state, or reword the court's letter.\n\nEven assuming some sort of technical error occurred, defendant was not prejudiced under any applicable standard. (See People v. Wright (1990) 52 Cal. 3d 367, 400-403 [276 Cal. Rptr. 731, 802 P.2d 221].) The challenged conversation was administrative in nature and had no bearing on issues raised at trial. Indeed, the court cautioned Dean at one point not to \"talk about anything in the juryroom,\" and defendant does not claim any improper disclosures were made. Defendant's arguments concerning what might have transpired if counsel had been present are tangential and speculative. Any suggestion that Dean might have been unfit to serve on the jury as a result of\n\nemployment pressure was belied by his assurance to the court that \"nothing is bothering me.\" No basis for reversal appears.\n\nN. \"Deadlock\" and \"Readback\" Issues\n\nDefendant bases three arguments--all of which we find unmeritorious--on the following events:\n\nOn April 27, 1987, after about eight full days of penalty deliberations, the jury apparently assembled at its usual 9:30 a.m. time to continue deliberating. Around 11 a.m., the court called the jury, counsel, and defendant into the courtroom and read a note it had received from the jury. The note, signed by Foreman Spangler, asked that the jurors be individually polled on penalty because they were \"unable to reach a unanimous verdict at this time.\" When the court asked Spangler to confirm whether the jury was unable to reach a unanimous verdict, he replied, \"Yes, your honor. We have been at 11-to-1 since the second day of deliberations.\"\n\nThe court directed Spangler not to disclose any details of the vote or deliberations, and asked whether further instruction or reading of testimony would assist the jury in reaching a verdict. Spangler essentially replied that instruction on a juror's general ability to impose death under any circumstances might be warranted because \"one particular individual\" seemed to be having difficulty in this regard.\n\nThe court then asked each juror whether it was reasonably probable a verdict might be reached if they continued deliberating. One juror was \"unsure,\" two jurors were somewhat \"hopeful,\" and the remaining nine were \"doubtful.\" The court announced it was \"not prepared to declare a mistrial at this time. It does not appear to me that the jury has come to a hopeless deadlock, counsel. Based upon the responses, I am going to ask the jury to continue their deliberations, and I would appreciate it if you would continue trying.\"\n\nDeliberations resumed. At some point the same day (April 27), the jury asked for a reading of virtually all penalty phase testimony and closing arguments of counsel. With counsel's approval, the court granted the portion of the request concerning testimony, but deferred any decision on closing argument.\n\nThe readback of testimony occurred over the course of the next two days (April 28 and 29). As stipulated by the prosecutor and defense counsel, it was conducted pursuant to the same procedure used at the guilt phase, i.e., with only the reporter and jury present.\n\nMeanwhile, on April 28, the court and counsel discussed the jury's request for a readback of closing arguments. Defense counsel said, among other things, that \"no prejudice\" would result as long as the jury was reminded that arguments were not evidence. However, the court ruled that closing arguments would not be read for reasons stated below.\n\nDuring the same exchange between the court and counsel, defense counsel asked the court to reconsider its earlier decision refusing to grant a mistrial. The defense insisted that the jury was deadlocked and that resumption of deliberations placed undue pressure on the minority juror.\n\nAfter the readback ended April 29, deliberations apparently resumed at 9:30 a.m. on May 4. At 11:15 a.m. that day, the jury informed the court of its verdict.\n\n1. Alleged coercion of deadlocked jury\n\nDefendant first suggests it is \"necessarily coercive\" to refuse to discharge the jury after the court learns about an 11-to-1 vote favoring a death sentence. Not so. (People v. Sheldon (1989) 48 Cal. 3d 935, 959-960 [258 Cal. Rptr. 242, 771 P.2d 1330].) The court may ask jurors to continue deliberating where, in the exercise of its discretion, it finds a \"reasonable probability\" of agreement. (§ 1140; People v. Breaux (1991) 1 Cal. 4th 281, 319 [3 Cal. Rptr. 2d 81, 821 P.2d 585]; People v. Sheldon, supra, 48 Cal. 3d 935, 959; People v. Rodriguez (1986) 42 Cal. 3d 730, 775 [230 Cal. Rptr. 667, 726 P.2d 113]; People v. Rojas (1975) 15 Cal. 3d 540, 546 [125 Cal. Rptr. 357, 542 P.2d 229, 92 A.L.R.3d 1127].)\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Any claim that the jury was pressured into reaching a verdict depends on the particular circumstances of the case. (See, e.g., People v. Breaux, supra, 1 Cal. 4th 281, 319- 320; People v. Sheldon, supra, 48 Cal. 3d 935, 959-960; People v. Rodriguez, supra, 42 Cal. 3d 730, 775-776.)\n\nDefendant emphasizes that the jury deliberated for more than an entire week, that the vote apparently remained at 11 to 1 for most of that time, and that Foreman Spangler publicly suggested the minority juror was breaching his or her duty to impose the appropriate penalty. Defendant insists that by ordering deliberations to continue under these circumstances, the court implied it agreed with Spangler's assessment. Defendant is mistaken.\n\nThe court avoided any comment on the status of the vote and strongly suggested it was irrelevant. The jury was never told it must reach a verdict,\n\nnor were any other constraints placed on their deliberations. A few days earlier, the court had reread the instruction describing the individual nature of the penalty determination. Moreover, given the length and complexity of the trial, the direction to continue deliberations could only have been perceived as giving jurors an opportunity to enhance their understanding of the case, rather than as pressure to reach a verdict. (People v. Rodriguez, supra, 42 Cal. 3d 730, 775.)\n\nPrior and subsequent events support this Conclusion. Spangler's \"deadlock\" note simply said the jury was unable to reach a verdict \"at this time.\" Two jurors told the court they believed a verdict might be reached, and no juror said unanimous agreement was impossible. Once deliberations resumed, the jury requested a reading of testimony and was obviously still focused on the evidence. We hold the court did not \"coerce\" a verdict or abuse its discretion under section 1140.\n\n2. Requested readback of closing arguments\n\nDefendant contends the court erred by denying the jury's request for counsel's summations.\n\nContrary to defendant's argument at trial and on appeal, section 1138 does not compel a contrary result.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e This section gives a deliberating jury the right to rehear evidence and instruction on request, but does not extend to argument of counsel. (People v. Gordon (1990) 50 Cal. 3d 1223, 1259-1260 [270 Cal. Rptr. 451, 792 P.2d 251].) While defendant correctly observes Gordon concerned a request by the guilt jury, he incorrectly argues section 190.3 compels a different result at the penalty phase. As noted by the trial court in this case, section 190.3 does not concern jury attempts to have argument repeated.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The court properly concluded it had discretion to deny such a request.\n\nWe also reject defendant's claim that the court abused its discretion. Here, as in Gordon, the court expressed appropriate concern over diverting the jury's attention from proper consideration of the evidence and instructions. It observed that any defects in counsel's argument might be \"compounded\" by repeating it. We reject defendant's suggestion that the court was required to\n\nreview counsel's argument, to anticipate any defects that might surface on appeal, and to excise them in order to grant the jury's request. No error occurred.\n\n3. Defendant's presence at readback of testimony\n\nDefendant claims various federal constitutional provisions were violated when the court permitted penalty testimony to be read to the jury outside the presence of defendant and his counsel without a personal waiver by defendant. Defendant raised the same argument in conjunction with the reading of testimony during guilt deliberations. As before, we reject the claim on grounds counsel duly consented to the procedure. (See Discussion, ante.) Moreover, defendant effectively waived his presence when he personally asked to be excused from the entire penalty phase. (See Discussion, ante.)\n\nO. Alleged Jury Misconduct--Discussions About Escape\n\nAfter the penalty verdict was returned, defendant moved for a new trial on grounds the jury committed misconduct during deliberations. Attached to the motion was a declaration by Juror Perez saying the jury discussed a recent violent escape from Vacaville Prison. According to a typewritten portion of the declaration, Juror McCarrel--who all jurors apparently knew was a cook at Vacaville Prison--volunteered that prisoners sentenced to death are \"watched\" 23 hours a day and \"allowed to exercise\" only 1 hour a day, whereas life prisoners are housed in a \"mainline setting\" and have a \"far greater opportunity to escape.\" In a handwritten portion of the declaration, Perez opined that the escape issue did not affect the verdict.\n\nAt defendant's request, the court struck the handwritten portion of the declaration because it concerned the jury's subjective deliberative process in violation of Evidence Code section 1150.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The court then denied a new trial on grounds no misconduct occurred. It reasoned that any Discussions about escape were based on \"common sense\" and general knowledge, and that McCarrel was not \"professing to be an expert on the subject of prison escapes and was [not] somehow bringing in outside law or making experiments ....\"\n\nWe agree with the court's reasoning and result. Defendant incorrectly suggests misconduct occurs whenever the jury, though instructed to consider only the evidence before it, nonetheless discusses speculative,\n\nirrelevant, and/or erroneous facts or opinions. Indeed, lay jurors are expected to bring their individual backgrounds and experiences to bear on the deliberative process. \"That they do so is one of the strengths of the jury system. It is also one of its weaknesses .... Such a weakness, however, must be tolerated.\" (People v. Marshall (1990) 50 Cal. 3d 907, 950 [269 Cal. Rptr. 269, 790 P.2d 676]; see People v. Fauber (1992) 2 Cal. 4th 792, 838-839 [9 Cal. Rptr. 2d 24, 831 P.2d 249].) Otherwise, few verdicts would stand.\n\nThese principles were not offended here. The average juror undoubtedly worries that a dangerous inmate might escape. While McCarrel's statements elaborating on this theme were purportedly based on his experience inside the prison system, he only said what any citizen might assume was true--that inmates sentenced to death are subjected to the tightest form of security and that they have fewer opportunities to escape than other inmates. No misconduct or presumption of prejudice appears.\n\nP. Miscellaneous Challenges to Death Penalty Law and Denial of Modification Motion\n\nDefendant challenges the capital sentencing scheme on various statutory and constitutional grounds. He concedes we have rejected these claims many times before, and raises them solely to preserve review in federal court. We affirm that, contrary to defendant's contentions:\n\n1. The death penalty law in California, including Sacramento County, is not presumptively applied in a racially discriminatory, arbitrary, or disproportionate manner. (People v. Ashmus, supra, 54 Cal. 3d 932, 980.)\n\n2. Evidence of other unadjudicated violent criminal activity is admissible in aggravation at the penalty phase. (People v. Balderas, supra, 41 Cal. 3d 144, 204-205.)\n\n3. Evidence of other unadjudicated violent criminal activity is admissible in aggravation even though prosecution for it would otherwise be time- barred. (People v. Robertson, supra, 48 Cal. 3d 18, 43-44.)\n\n4. The jury need not employ the beyond-a-reasonable-doubt standard in deciding whether aggravating factors (other than violent criminal conduct) are present, whether aggravation outweighs mitigation, and whether death is the appropriate sentence. (People v. Rodriguez, supra, 42 Cal. 3d 730, 777-779, 791.)\n\n5. The jury need not make written findings or agree unanimously on the presence of aggravating factors. (People v. Frierson (1979) 25 Cal. 3d 142, 178-180 [158 Cal. Rptr. 281, 599 P.2d 587].)\n\n6. The standard jury instruction does not inherently encourage \"double- counting\" under section 190.3, factors (a) (circumstances of the capital crimes) and (b) (criminal activity involving violence). (People v. Bonin, supra, 46 Cal. 3d 659, 703.)\n\n7. The court's consideration of the probation report before ruling on the automatic motion to modify the verdict (§ 190.4, subd. (e)) is not presumptively prejudicial. (People v. Livaditis, supra, 2 Cal. 4th 759, 787.) Defendant does not seriously contend, nor do we find, any such error affected the court's ruling. The court denied the motion based on its independent assessment of the aggravating and mitigating evidence.\n\nQ. Cumulative Effect of Alleged Guilt and Penalty Errors\n\nDefendant contends the cumulative effect of errors assertedly committed throughout the trial requires reversal of the death judgment. We have individually rejected most of his claims. Any errors that did occur, whether viewed singly or in combination, were inconsequential.\n\nR. Noncapital Sentencing\n\nDefendant argues the trial court erred in imposing more than one enhancement for use of a knife (§ 12022, subd. (b)), because the murders were purportedly committed during \"a single melee. There was but one occasion, one intent, one objective, one indivisible transaction.\" (In re Culbreth (1976) 17 Cal. 3d 330, 335 [130 Cal. Rptr. 719, 551 P.2d 23].) The record belies this claim.\n\nProsecution evidence indicated the stabbings occurred at least 30 minutes apart in different areas of the vast office building. Defendant had ample time to reflect between the attacks, and evidently killed each woman for different reasons. The evidence suggests Kimele was killed because defendant believed she betrayed him at work and/or to silence her as a possible witness to her own sexual assault. Catherine was killed, in turn, to silence her as a possible witness to the crimes against Kimele and/or to the sexual assault upon herself. The court could properly find no \"indivisible transaction\" barring imposition of separate weapon enhancements.\n\nVI. DISPOSITION\n\nThe judgment is affirmed in its entirety.\n\nLucas, C. J., Panelli, J., Kennard, J., Arabian, J., and George, J., concurred.\n\nDisposition\n\nThe judgment is affirmed in its entirety.\n\nI Dissent.\n\nThis case is but another example of the reluctance of many trial courts to conform to the letter and spirit of People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748], and the subsequently decided Batson v. Kentucky (1986) 476 U.S. 79 [90 L.Ed.2d 69, 106 S.Ct. 1712]. (See, e.g., People v. Johnson (1989) 47 Cal. 3d 1194 [255 Cal. Rptr. 569, 767 P.2d 1047], in which all Black, Jewish, and Asian prospective jurors were peremptorily challenged on invidious grounds; see also People v. Howard (1992) 1 Cal. 4th 1132, 1202-1210 [5 Cal. Rptr. 2d 268, 824 P.2d 1315] (dis. opn. of Kennard, J.).)\n\nHere, defendant, a Black man, was charged with killing two White women. The prosecutor peremptorily challenged six Black prospective jurors, including the last two on the panel. The result was that defendant was convicted and condemned to death by an all-White jury. As a matter of pure statistical probabilities, it would appear unlikely that in one of the most populous counties in the state, with more than a million residents and many of them members of minority groups, each and every one of the Black jurors could properly have been struck.\n\nThe prosecutor stated that he exercised peremptory challenges against the six Black prospective jurors because of what he perceived to be their reservations about the death penalty. I suggest that such a considered attitude on the part of Black jurors is altogether understandable in view of incontrovertible evidence that Blacks are more likely to be capitally prosecuted and to receive the ultimate sanction than persons of other races.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn February 1990, the United States General Accounting Office submitted a report to the Senate and House Committees on the Judiciary, entitled \"Death Penalty Sentencing: Research Indicates Pattern of Racial Disparities.\" Undoubtedly, most of the findings are implicitly known in minority communities and by minority group members called for jury duty. I cite only a few of the findings.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\n\"In 82 percent of the studies, race of victim was found to influence the likelihood of being charged with capital murder or receiving the death\n\npenalty, i.e., those who murdered whites were found to be more likely to be sentenced to death than those who murdered blacks. ...\n\n\"The race of victim influence was found at all stages of the criminal Justice system process ....\n\n\"Legally relevant variables, such as aggravating circumstances, were influential but did not explain fully the racial disparities researchers found. ... The analyses show that after controlling statistically for legally relevant variables and other factors thought to influence death penalty sentencing (e.g., region, jurisdiction) differences remain in the likelihood of receiving the death penalty based on race of victim.\n\n\"... In a few studies, analyses revealed that the black defendant/white victim combination was the most likely to receive the death penalty. ...\n\n\"Finally, more than three-fourths of the studies that identified a race of defendant effect found that black defendants were more likely to receive the death penalty.\" (U.S. General Accounting Office, Rep. to the Sen. and House Coms. on the Judiciary, Death Penalty Sentencing: Research Indicates Pattern of Racial Disparities (Feb. 1990) pp. 5-6.)\n\nThus, when a Black prospective juror expresses suspicion of the death penalty and reluctance to enthusiastically impose that punishment in a case in which the defendant is Black and the victim White, his or her words should be viewed with some tolerance and understanding. As we made plain in Wheeler, such suspicion and reluctance may not \"stem from individual biases related to the peculiar facts or the particular part[ies] at trial, but from [a] differing attitude[] toward the administration of Justice and the nature of criminal offenses.\" (22 Cal. 3d at p. 277, fn. 17, internal quotation marks omitted.) Perhaps the Black juror's perspective may be somewhat different from that of members of other groups. But it simply does not bar him or her from service on an equal footing. (See, e.g., People v. Sanders (1990) 51 Cal. 3d 471, 543 [273 Cal. Rptr. 537, 797 P.2d 561] (dis. opn. of Broussard, J.).) Indeed, in Wheeler we emphasized that \"[t]he representation on juries of [such] differences in juror attitudes is precisely what the representative cross-section standard ... is designed to foster.\" (22 Cal. 3d at p. 277, fn. 17 internal quotation marks omitted.)\n\nI must admit a certain reluctance to conclude that reversal is required here in view of the apparently strong inculpatory evidence. Nevertheless, as\n\nJustice Frankfurter reminded us in Offutt v. United States (1954) 348 U.S. 11, 14 [99 L.Ed. 11, 13, 75 S.Ct. 11], \"Justice must satisfy the appearance of Justice.\" Regrettably, in the selection of the jury in this case, the appearance of Justice was not satisfied.\n\nAppellant's petition for a rehearing was denied September 30, 1992, and the opinion was modified to read as printed. Mosk, J., was of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Detective Biondi testified that defendant did not become a suspect until after the first interview. Only then did detectives learn about the discrepancy between the time defendant said he left Progressive on Labor Day and the time his car was last seen there by the gardener. Also, defendant's live-in companion Brenda told officers between the two interviews that defendant did not arrive home until 5 p.m. This information conflicted with the 2:30 p.m. arrival time defendant had given detectives during the first interview. Defendant waived his Miranda rights before the second interview, and testified at trial that his waiver was voluntary. (Miranda v. Arizona (1966) 384 U.S. 436 [16 L.Ed.2d 694, 86 S.Ct. 1602, 10 A.L.R.3d 974].) Both interviews were tape-recorded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Brenda's brother Gerald was called by the prosecution. He said defendant's knife and the purported murder weapon were similar at trial, but admitted saying they were the same at the preliminary hearing. The defense called Brenda's other brother Clement (who sold the knife to defendant one or two months before the crimes) and defendant's friends, the two Hernandez brothers (who considered buying defendant's knife). These three men testified that defendant's knife and the purported murder weapon were not the same based largely on differences in the number of grooves, but even they disagreed over how many grooves defendant's knife had.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Several papers inside the checkbook cover bore the fingerprints of Sean Collins, who was called by the prosecution at trial. Collins, who is Caucasian, testified that he discovered a \"wallet\" while walking to his girlfriend's house a few miles from Progressive around Labor Day 1984. He thumbed through the papers inside, found no money or credit cards, and threw the wallet down. Collins denied any involvement in the Progressive crimes. He admitted, however, that in May 1985, he forced a teenage prostitute to orally copulate him at knife- point. He pled guilty to sexual penetration with a foreign object (§ 289), apparently had no other felony convictions, and was serving a prison sentence while testifying in this case. Collins's victim was called as a witness by defendant. She noted that Collins placed the knife on her buttocks and threatened to kill her, and that she escaped when he tried to force her--nude and bound--into the trunk of his car.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Like defendant, Kimele and Catherine were type A secretors. Kimele's husband, Jeff, is a type O nonsecretor. Sean Collins is apparently a type A nonsecretor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Schanfield acknowledged that Catherine's blood sample had been inexplicably contaminated in his laboratory. He apparently made no \"GM\" Conclusions about any crime scene specimens associated with her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The prosecution's modest case-in-rebuttal consisted largely of attempts to discredit the perceptions of these defense witnesses and will not be summarized further in the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant presented a different account of the incident through the testimony of his friend Steve Hernandez, who lived near the Marks sisters and approached their apartment when he heard a commotion. According to Hernandez, Jackie slapped defendant with one hand and tried to close the door on him with the other hand. Defendant purportedly pushed the door open, causing it to hit Jackie and knock her to the ground. The parties essentially stipulated that the foregoing portion of Hernandez's testimony was consistent with his prior statements to police. However, the parties also stipulated that another portion of Hernandez's testimony--that defendant held the broomstick in a defensive manner only--was inconsistent with Hernandez's prior out-of-court statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The entire exchange reads as follows: \"The Court: I have obtained a copy of the Wainwright versus Witt [case]. Have you all read that? [P] [Defense Counsel]: Yes, your Honor. [P] The Court: The more recent one, the one in 198[5]? [P] [The Prosecutor]: Yes. [P] The Court: That sort of changed some of the Witherspoon [analysis]. [P] [The Prosecutor]: Right. [P] [Defense Counsel]: Yes. [P] The Court: It would be--there are no cases in California that have interpreted that. [P] [Defense Counsel]: Yes, your honor. However, the Supreme Court is about to interpret that, the California Supreme Court, and our position is it really brought no substantial changes of any kind. [P] That's our position. [P] The Court: No. I'm just going to stick with the old way. [P] [Defense Counsel]: Yes, your honor. Thank you.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We recently observed that where, as here, the trial court inquires about the prosecutor's justifications, it has implicitly found defendant has made a prima facie showing that jurors are being excluded on the basis of \"group bias,\" i.e., because they are members of an identifiable group distinguished on racial, religious, ethnic, or similar grounds. (People v. Fuentes (1991) 54 Cal. 3d 707, 713, 716 [286 Cal. Rptr. 792, 818 P.2d 75].) As noted in Fuentes, however, rulings by implication are not favored because they might confuse the parties about their respective obligations under Wheeler and Batson. (Fuentes, supra, at p. 716, fn. 5.) In any event, once the trial court has ruled, expressly or by implication, that defendant has made a prima facie case, the burden shifts to the prosecution to present a race-neutral explanation related to the case. Because the trial court's assessment of these explanations rests largely upon evaluations of credibility, both this court and the high court generally give such assessments great deference. (Fuentes, supra, at pp. 714-715.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In April 1986, two months before the shackling hearing and order, the court and counsel informally agreed that physical restraints did not seem necessary. Over defendant's objection, the sheriff's department subsequently asked that he be shackled in court. The June 1986 hearing was held as a result of this request. Although many of the incidents ultimately cited in support of the shackling order occurred before April, the court apparently was not aware of them until the June hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defendant observes that the jury necessarily saw the restraints at the penalty phase because he decided to wear jail clothes instead of the business suit he had worn at the guilt phase. Defendant changed his attire to protest a court order requiring him to attend the penalty trial. Defendant's complaints about events occurring at the penalty trial will be discussed later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The court said, \"A few days ago ... there was testimony [by] Mr. Garbutt ... to the effect that [he] had made the hairs obtained in this case available to an independent criminalist named Robert Ogle, who was working for the defense. [P] Now, you are to disregard that testimony and to put it out of your mind as if you had never heard of it. [P] You are not to assume or infer that there is any such expert available or that the defense has called or consulted with an expert by the name of Robert Ogle, or any other expert. [P] And you are not to make any assumptions adverse to the defendant about any findings or Conclusions of any expert that has not been called as a witness in this case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. For the foregoing reasons, we also reject defendant's claim that admission of the photographs and videotape violated his federal constitutional rights (due process and reliable death judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The instruction provided, \"If you find that the defendant attempted to [or] did ... fabricate evidence to be produced at the trial, such attempt may be considered by you as a circumstance tending to show a consciousness of guilt. However, such attempt is not sufficient to prove guilt and its weight and significance, if any, are matters for your determination.\" (See CALJIC No. 2.04 (1979 rev.) (4th ed 1979 bound vol.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The special instruction said, \"In order to find the defendant guilty of murder in the first degree it is not necessary that the jury unanimously agree as to whether it is first degree murder based upon the felony murder rule or whether it is first degree murder based upon the fact that the killing was deliberate and premeditated. [P] It is only necessary that the jury unanimously agree that the killing was murder in the first degree under either theory.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. For example, the jury was told that \"[i]n order to reach a verdict, all twelve jurors must agree to the decision ....\" Another instruction said, \"Before you may return a verdict in this case, you must agree unanimously not only as to whether the defendant is guilty or not guilty, but also, if you should find him guilty of an unlawful killing, you must agree unanimously as to whether he is guilty of murder of the first degree, or murder of the second degree.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Two years and three months passed between the time the information was filed and the time the guilt verdict was returned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Welfare and Institutions Code section 1772 has undergone little substantive change since defendant was discharged from the Youth Authority. Subdivision (a) provides: \"Every person honorably discharged from control by the Youthful Offender Parole Board who has not, during the period of control by the authority been placed by the authority in a state prison shall thereafter be released from all penalties and disabilities resulting from the offense or crime for which he or she was committed, and every person discharged may petition the court which committed him or her, and the court may upon such petition set aside the verdict of guilty and dismiss the accusation or information against the petitioner who shall thereafter be released from all penalties and disabilities resulting from the offense or crime for which he or she was committed, including, but not limited to, any disqualification for any employment or occupational license, or both, created by any other provision of law. ...\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Section 190.3 states, in part: \"Except for evidence in proof of the offense or special circumstances which subject a defendant to the death penalty, no evidence may be presented by the prosecution in aggravation unless notice of the evidence to be introduced has been given to the defendant within a reasonable period of time as determined by the court, prior to trial. Evidence may be introduced without such notice in rebuttal to evidence introduced by the defendant in mitigation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The court said, \"I believe that there is a complete mischaracterization of [Spangler's] demeanor and conduct. [P] ... []The evidence is totally insufficient to justify a mistrial ... [or to] reliev[e] any of these jurors .... [P] I believe from ... my observations of their conduct and demeanor, the way they have conducted themselves during this trial, certainly they have completely honored their oath and duty in this case. ... [P] ... Mr. Spangler put it very well, he was surprised and shocked, and he let his facial expressions show. But I do believe him when he says that he has not come to a decision on penalty in this case, he has not made up his mind in advance. He has assured me that he will hold his oath and perform his duty, and, therefore, the motion is denied.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The prosecutor said, \"Certainly throughout the course of this case there are a number of people deserving of your sympathy. Mr. and Mrs. Pride. The defendant's other family members. The loved ones and family of Kimele S[.] and Catherine K[.] And I submit to you that the defendant Timothy Pride is not worthy of any sympathy.\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The jury's note requested, in full, \"Instruction from [the court] as to whether or not compassion for [defendant's] mother is sufficient reason to find for life imprisonment rather than compassion for [defendant] or is it only compassion for [defendant]. In other words may a juror vote for life in prison out of compassion for [defendant's] mother.\" (Italics in original.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Instruction number 33 said, \"Both the People and the defendant are entitled to the individual opinion of each juror. [P] It is the duty of each of you to consider the evidence for the purpose of arriving at a verdict if you can do so. Each of you must decide the case for yourself, but should do so only after a Discussion of the evidence and instructions with the other jurors. [P] You should not hesitate to change an opinion if you are convinced it is erroneous. However, you should not be influenced to decide any question in a particular way because a majority of the jurors, or any of them, favor such a decision.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Section 1140 states: \"Except as provided by law, the jury cannot be discharged after the cause is submitted to them until they have agreed upon their verdict and rendered it in open court, unless by consent of both parties, entered upon the minutes, or unless, at the expiration of such time as the court may deem proper, it satisfactorily appears that there is no reasonable probability that the jury can agree.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Section 1138 states: \"After the jury have retired for deliberation, if there be any disagreement between them as to the testimony, or if they desire to be informed on any point of law arising in the case, they must require the officer to conduct them into court. Upon being brought into court, the information required must be given in the presence of, or after notice to, the prosecuting attorney, and the defendant or his counsel, or after they have been called.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Defendant cites the portion of section 190.3 saying: \"After having heard and received all of the evidence, and after having heard and considered the arguments of counsel, the trier of fact shall consider, take into account and be guided by the aggravating and mitigating circumstances referred to in this section ....\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Evidence Code section 1150, subdivision (a) states, in part: \"No evidence is admissible to show the effect of [any] statement, conduct, condition, or event upon a juror either in influencing him to assent to or Dissent from the verdict or concerning the mental processes by which it was determined.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Although the California Department of Justice report entitled \"Adult Felony Arrest Dispositions in California, 1981-1990,\" does not distinguish between death cases and felony convictions, it concludes that \"The proportion of blacks among the convicted population was about four times as great as the proportion of blacks in the general population (26.2 versus 6.7 percent, respectively).\" (Cal. Dept. Justice, Div. of Law Enforcement, Adult Felony Arrest Dispositions in California 1981-1990 (1992) p. 38.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Contrary to usage in my text, \"black\" and \"white\" are not capitalized in the General Accounting Office and the California Department of Justice reports.\u003c/span\u003e\n\n",
    "body_length": 160647,
    "citedas": [
      "3 Cal. 4th 195",
      "10 Cal. Rptr. 2d 636",
      "833 P.2d 643"
    ],
    "attorneys": "Mark E. Cutler, under appointment by the Supreme Court, for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Richard B. Iglehart, Chief Assistant Attorney General, Arnold O. Overoye, Assistant Attorney General, Michael J. Weinberger and Robert D. Marshall, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Opinion by Baxter, J., with Lucas, C. J., Panelli, Kennard, Arabian and George, JJ., Concurring. Separate Dissenting opinion by Mosk, J.",
    "citation_count": 24
  }
}
