{
  "id": "fqJtR2YBTlTomsSBODBt",
  "document": {
    "title": "People v. Turner",
    "full_title": "THE PEOPLE AND v. MELVIN TURNER AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1994-08-15T00:00:00.000Z",
    "docket": "No. S006229",
    "body": "ARABIAN, J.:\n\nThis case reaches us again after a retrial following this court's reversal of defendant's conviction and death sentence. In reversing, we concluded that the prosecution failed to sustain its burden of showing that the challenged prospective jurors were not excluded because of group bias, and the trial court failed to discharge its duty to inquire into and carefully evaluate the prosecutor's proffered explanations, in violation of People v. Wheeler (1978) 22 Cal. 3d 258, 148 Cal. Rptr. 890, 583 P.2d 748. (People v. Turner (1986) 42 Cal. 3d 711, 728, 230 Cal. Rptr. 656, 726 P.2d 102 (Turner I).)\n\nAt the ensuing retrial in 1987, the jury found defendant guilty of two counts of first degree murder (Penal Code §§ 187, subd. (a), 189),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and further found that defendant had personally used a firearm (a handgun). ( §§ 12022.5, 1203.06, subd. (a)(1).) The jury also found true the multiple-murder and robbery-murder special-circumstance allegations. ( §§ 190.2, subd. (a)(3), 190.2, subd. (a)(17)(i).) Defendant was found guilty of two counts of robbery ( § 211), and personal-use of a firearm allegations as to those counts were found to be true. Defendant was also found guilty of one count of grand theft vehicle. (Vehicle Code § 10851.)\n\nDefendant personally waived his right to trial by jury as to three prior felony conviction allegations. The court found the allegations to be true. At the penalty phase, the jury fixed the penalty for murder in the first degree with special circumstances at death, and thereafter the court imposed a sentence of death.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe case is before us again on automatic appeal. (Cal. Const., art. VI, § 11; § 1239, subd. (b).) For the reasons that follow, we conclude that the judgment should be affirmed.\n\nI. FACTS\n\nA. Guilt Phase\n\n1. Prosecution Evidence\n\nOn the night of July 11, 1979, defendant drove codefendant Teague Hampton Scott to the Torrance Airport, where defendant had worked as a security guard. While at the airport, defendant followed a 1979 yellow Mazda RX7 that Scott wanted to steal. The vehicle stopped outside a hangar. When the victims, Dr. George S. Hill, Jr., a surgeon, and Ms. Joella Champion, a schoolteacher, got out of the Mazda and entered the hangar, defendant and Scott got out of their car and followed them. A robbery ensued, during which the victims' jewelry was taken at gunpoint. The victims were then bound hand and foot, gagged, and forced to sit against the wall of the hangar. Each victim was shot in the head once at close range by a .38 caliber gun. Death was immediate.\n\nThe victims' bodies were discovered at approximately 11 p.m. on July 12. The door to the hangar, which contained an airplane owned by Champion, was locked, and the light inside was on. The coroner estimated the times of death as late on the evening of July 11, or early morning July 12.\n\nAt the time of the murders, the Torrance Airport had recently installed a 24-hour noise monitoring system that included microphones at various locations in and around the airport. The July 11 tape recording indicated that two sharp noises, consistent with gun shots, were recorded approximately three seconds apart at 11:16 p.m. on that date in the area where the bodies were found.\n\nAfter taking the Mazda and driving to Los Angeles in separate cars, defendant and Scott divided the stolen property. Scott kept Hill's car and drove it around for two days before abandoning it. The car key was subsequently found on the ground near the car. Scott's fingerprints were found on the car and the key.\n\nEarly on the morning of July 12, 1979, defendant attempted to use Hill's Arco credit card to purchase gasoline. He was driving a Cadillac with a green body and white top. Defendant admitted using a stolen commercial plate on the vehicle, so that the card could not be traced to his car.\n\nDefendant gave the credit card to attendant Steven Burns, and signed the charge slip. The charge slip contained the vehicle's license number. The station manager, Willie Atterberry, said the card was good, but that he needed some identification. Defendant gave Atterberry Hill's driver's license. Hill had been White and approximately 34 years old. Defendant was Black and 22 years old. Atterberry said, \"No. I need your driver's license.\" Defendant responded that \"This is all I have.\" Atterberry said \"wait and let me check on it.\" While he was talking with the station owner, defendant drove off. The charge card was given to police. Hill's estranged wife later received the license and two charge slips in the mail.\n\nOn July 31, 1979, defendant and Scott were seen by police in a Chrysler owned by Nathaniel Tribet, defendant's stepfather, driving in and out of the valet parking lot at the Horseshoe Card Club in Gardena. After a high-speed chase, defendant abandoned the vehicle and escaped. Defendant's fingerprints were found on the car. Scott was arrested. Two handguns were taken from the car. One of these guns, a Smith \u0026 Wesson .38-special-caliber revolver, was subsequently determined by ballistics evidence to be the murder weapon. It was located under the seat where Scott had been sitting. Scott's fingerprints were found on the murder weapon, and he was in possession of Hill's gold Omega watch.\n\nNathaniel Tribet was the registered owner of the murder weapon, which he had used in his work as a security guard. Defendant's brother, Roy Turner, had retrieved the weapon from Tribet's van after Tribet had an accident a few months before the murders. Roy lent defendant the gun on several occasions. The last time Roy saw the gun was when he gave it to defendant and/or Scott with the expectation that it would be sold to Scott.\n\nSeveral items of Champion's jewelry that she had been seen wearing on the night of her murder were subsequently linked to defendant. On August 3, at the time of defendant's arrest, Champion's unique gold rope chain was found hanging from the rear view mirror in defendant's recently repainted Cadillac. Her engraved, custom made gold ring with a green turquoise stone was in the possession of defendant's friend, Reverta Austin, who was with him at the time of his arrest. Defendant gave Austin the ring to hold that night because he observed the police following him.\n\nDefendant's residence was searched early on August 4, 1979. In defendant's bedroom, Torrance Police Officer Emilio Paerels retrieved from a green jacket Champion's Inland Door and Gate condominium card, and her \"SAM Gold card\" from a discount store in Redondo Beach.\n\nDefendant made several inconsistent statements regarding his involvement in the Torrance murders. On August 5, 1979, defendant was interviewed by Compton Police Officer Kay Barger-Collins\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e regarding the unrelated Julia Marmor homicide.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e During this interview, defendant volunteered information regarding the Torrance murders. Defendant was then interviewed by Torrance Police Officer Green and his partner Officer Paerels. Officer Barger-Collins did not participate in this interview. Defendant waived his right to remain silent and to counsel, and stated that he was speaking to the officers of his own free will. He further stated that there had been no mention of Torrance offering him immunity or any other promises or threats with regard to the airport murders.\n\nDefendant stated that while he was at the airport when the murders occurred, he was not the one who pulled the trigger. Rather, he merely stood guard at the door of the hangar for Scott, and did not enter the hangar. Once Scott had bound the victims and placed them with their backs to the wall, defendant began running to the car because he thought they were leaving. Halfway to the car, defendant heard one shot and then another.\n\nDefendant and Scott subsequently divided the property. Defendant received $60 and the gold ring with a green stone he later gave to Austin. Scott told defendant he had shot the robbery victims in the head because he did not want to leave witnesses behind to testify against him. Defendant said he had learned Scott was trying to blame him for the crime. Defendant was then asked, \"I'm curious . . . the seriousness of an involvement in a double murder. Why . . . are you voluntarily talking to us?\" Defendant responded that he was \"not going to sit up and take no murder rap for nobody.\"\n\nOn August 7, at his request, defendant was interviewed again. The interview was conducted by Officer Barger-Collins and Gardena Police Officer Dale Pierce. Both of these officers were investigating the Marmor homicide. Defendant stated that he was aware of and freely and voluntarily waived his constitutional rights. Officer Barger-Collins noted that they were talking about the Torrance homicides and that there were \"some additional statements that need clarification, or statements that [defendant] wished to change.\"\n\nDefendant stated that on the night of the murders, he and Scott entered the hangar after defendant was unable to locate Champion's purse in the Mazda. Defendant bound the woman. Scott gave defendant the gun. Scott then tied up the man.\n\nScott told defendant to watch the victims, who were tied and sitting on their knees. After Scott had gathered all of the property, he told defendant to shoot. Defendant had already cocked the gun, which was pointed at the woman's ear and temple, and his finger was on the trigger. Scott said, \"Remember what I told you, anybody we rob, we got to shoot, cuz we can't leave a witness behind.\" Scott kept hollering, \"shoot her and get it over with so we can leave.\" Defendant stood shaking and trembling and would not pull the trigger. Scott grabbed defendant's hand, the gun went off, and Champion fell. Scott then took the gun and shot Hill in the head. Approximately one minute transpired between the two shootings.\n\nDefendant admitted at trial that after the August 5 interview tape was played for the jury, he told a bailiff that the statement defendant made on August 5 was \"not so bad\" as the one he made on August 7, but he thought he could \"get around that.\"\n\nOn August 13, 1979, Armand Vincent, who had been charged with misdemeanor violations of performing home repair and remodeling without a contractor's license, was on a jail bus to and from the Torrance courthouse with defendant and Scott as they conversed about the murders. Vincent, who was wearing a blue wristband, was handcuffed to defendant, who was wearing a red or orange wristband. Scott was separated from defendant and Vincent by a screen. When Scott said, \"I didn't have any idea we were going to kill anyone,\" defendant responded, \"Well, you know, man, dead witnesses don't talk.\" In response to Scott's question, \"How did you do it?\" defendant said he \"killed the man and then the woman\" with two shots, and that the victims were tied with their hands behind their back.\n\n2. Defense Evidence\n\nThe defense evidence consisted primarily of defendant's third version of events on the night in question, his explanation for earlier inconsistencies, and other witness testimony challenging Vincent's recollection.\n\nDefendant testified on his own behalf. He had previously been convicted of receiving stolen property and burglary. He spent time in prison, where he met Scott, who was in prison for robbery. Scott told defendant he would kill the people he robbed. Defendant considered Scott a friend.\n\nDefendant was released in April 1979. He was hired as a security guard, and worked part of the time at the Torrance Airport. He was fired sometime before the murders.\n\nScott was released several months after defendant. Upon his release, Scott called defendant. Scott and defendant saw each other a half-dozen to a dozen times before July 11. Defendant sold Scott the gun later used in the murders.\n\nOn the night of the murders, Hill and Champion left their car and entered the hangar. After examining the Mazda, Scott entered the hangar and pulled a gun on the victims. The gun had been in Scott's waistband. Scott had not told defendant, and defendant had not observed, that Scott had a gun. The gun \"had to have been\" covered by Scott's green jacket. Defendant stayed outside acting as a lookout for the security guard.\n\nScott had the victims lie on the ground and give him Hill's keys and Champion's purse. Scott then tore up rags into long strings of cloth and made Hill tie up Champion. Scott then tied up Hill. Defendant was still watching at the door.\n\nScott \"helped [the victims place] their backs up against the wall.\" Scott put everything in a blue bag Hill had been carrying, and went back to the wall for something. Defendant assumed Scott was leaving, and started running toward defendant's car. As defendant ran, he heard gunshots, about as far apart as on the noise monitoring recording.\n\nScott and defendant spent the night at defendant's friend Angie's. There, Scott gave defendant a turquoise ring and $60. Scott said he shot the victims because he needed the Mazda for a couple of days. Scott left his green jacket at Angie's. Defendant subsequently discovered Hill's gasoline credit card and license, which he unsuccessfully attempted to use, in the pocket of the jacket. Defendant modeled this jacket for the jury. Defendant later helped Scott get rid of the Mazda, and continued to spend time with Scott.\n\nDefendant claimed he changed his original story of being only a lookout to an admission of more extensive participation because of Officer Barger-Collins's threats and coercion. Defendant had known Barger-Collins for several years. He considered her a friend and had worked for her as an informant in the past.\n\nBefore making the August 5, 1979 statement, defendant spoke with Barger-Collins. She said she would talk to defendant's \"parole officer and get him to lift the parole hold and talk to the Judge to get me out.\"\n\nPrior to his August 7, 1979 statement, which was inconsistent with and more self-incriminating than his August 5 statement, Barger-Collins had \"applied pressure and threats on me, so I changed my statement.\" In particular, she threatened to expose him as a narcotics informant. \"She told me that she wanted more involvement in ] on my part in this in order to sound convincing and everything, and that if I did not cooperate with her, that was it, I was going to be exposed. She wouldn't help me.\" \"I basically got what she meant she wanted more participation on my behalf as far as being involved in the robbery and so forth.\" Accordingly, defendant changed his original story of being only a lookout to an admission of more extensive participation, lying about looking inside the Mazda, going into the hangar, tying the victims up, holding the murder weapon, and the time between the shots.\n\nDefendant cared \"a lot\" about Barger-Collins's threat because most of the people he had turned in were dealing drugs to his family. Such exposure would cause hardship in his relationships with his family and with other people. He also knew that most \"snitches\" get stabbed or killed in prison. Defendant, however, also testified that he \"admitted to shooting the woman\" not because of threatened exposure, but because Barger-Collins \"told me anything that I said it would not matter because she was going to get me out any way so if it meant involving myself to get out, that is what I was going to do.\"\n\nDefendant further testified that at some indeterminate time prior to the murders, Barger-Collins had paid him $250 for information, and that he had used this money to pay part of the cost to get his Cadillac repainted.\n\nDefendant denied ever seeing Vincent on the prison bus, or discussing the murders with Scott on the bus. Defendant did not recall ever being handcuffed to another person on the bus; rather, he was kept in a separate cage. Los Angeles County Sheriff's Department Captain Jerry West, who in August 1979 worked at the sheriff's transportation bureau, testified that a person wearing a blue wristband would not ordinarily be handcuffed to someone wearing a red wristband.\n\n3. Rebuttal Evidence\n\nLos Angeles County Sheriff's Deputy Joe Bond, a jail bus driver from 1972 to 1980, testified that it was possible that a prisoner charged with a misdemeanor would be handcuffed to a prisoner wearing a red wristband. He identified a Sheriff's Department inmate special handling request to keep Scott away from defendant, but stated that such a request would be satisfied by keeping defendant and Scott on different sides of a screen.\n\nBarger-Collins testified that her purpose in interviewing defendant on August 5 was in reference to the unrelated Marmor homicide. At the time, she knew nothing about the Torrance murders, and defendant volunteered everything she found out about the murders.\n\nBarger-Collins had not seen defendant from 1976 until August 5, 1979. She did, however, have numerous contacts with defendant in her official duties as a homicide detective between 1969 and 1976. She did not recall whether he had given her information regarding other people's drug dealings, and she had never worked in narcotics or drug detail. She never gave defendant money for information. While she had used informants in the past, she had never paid money for information. She did not consider defendant a friend, and never socialized with him. During these years she had developed a rapport with defendant, but she did not know if he trusted her.\n\nBarger-Collins denied threatening to expose defendant. She did tell him at some point prior to his August 7 statement that she would speak to his probation officer and to the Judge. While she told defendant she thought he was lying about the unrelated homicide she was investigating, she denied indicating that she was not pleased with what he was saying. Defendant was the one who requested the August 7 interview with Barger-Collins.\n\n4. Surrebuttal Evidence\n\nDefendant was five foot and two inches tall, and weighed approximately 144 pounds. Scott was approximately six feet tall, and weighed 175 pounds. Mr. Stan Perlo, who was six feet tall and weighed between 180 and 190 pounds, modeled the green jacket recovered from defendant's closet apparently to demonstrate that it would fit a person of Scott's size, and would have concealed a weapon on the night of the murders. Perlo found the jacket was binding him under his armpits, and that it was not large and loose fitting.\n\nB. Penalty Phase\n\n1. Prosecution Evidence\n\nPursuant to the prosecution's request, the trial court informed the jury that defendant had previously been convicted of three felonies for receiving stolen property, burglary, and attempted robbery. With the submission of the prior convictions, the People rested.\n\n2. Defense Evidence\n\nDefendant's mother and one of his sisters, Delores Honeywood, testified as to defendant's father's alcohol abuse. In addition, these witnesses, defendant, and another of defendant's sisters, Bettie Ann Turner, testified regarding the verbal and physical abuse defendant's father inflicted on his wife and children, and defendant's efforts to monetarily and otherwise support the family.\n\nDefendant further testified that his father disappeared when defendant was about 13 or 14 years old. Defendant remained in school until the 10th grade and then dropped out to help his mother and younger siblings. His older brothers or sisters did not often give his mother any money or help.\n\nDefendant began getting into trouble with the law as a teenager by shoplifting, stealing cars, and committing burglaries. He was convicted of receiving stolen property, attempted robbery, and burglary. He used marijuana when he was 16 or 17 years old, in prison, and on the night of the murders.\n\nDefendant testified as to his lack of notice that Scott intended to kill on July 11, and expressed remorse at his presence at the time of the murders. He continued to deny he shot the victims. In response to the prosecutor's inquiry regarding whether it would have been possible to see certain events defendant previously had made statements regarding from his vantage point at the hangar door, defendant modified his testimony to state that he had in fact entered the hangar \"a couple of times.\"\n\nSince his imprisonment on August 3, 1979, defendant had taken classes to raise his educational level and understand himself better. Defendant tried to help other young people who came to prison who were gang-affiliated, and expressed a desire to deter others from following in his footsteps.\n\nDr. Michael Paul Maloney, a clinical psychologist and clinical professor of psychiatry at the University of Southern California School of Medicine, testified that he performed a general psychological evaluation on defendant in November 1979. Dr. Maloney \"obtained [defendant's] history pretty much from birth on until the time I saw him.\" He administered a number of intelligence and academic achievement tests, used devices that gave information about defendant's \"perceptual motor processes,\" and performed a general evaluation of defendant's personality. Defendant evidenced no signs of significant mental disturbance and was not psychotic. His intelligence appeared to be potentially normal, but he had an \"academic experiential deficit.\"\n\nDr. Maloney had reexamined defendant approximately one month earlier. On another occasion, Dr. Maloney's psychological assistant readministered some of the same tests given in 1979. The test results were similar, and defendant's overall mental state did not seem \"grossly different\" than when Dr. Maloney examined him in 1979.\n\nDr. Maloney noted that according to some of defendant's prison records, defendant had taken several academic courses while in prison, receiving grades ranging from A to C minus. He opined that this indicated defendant's ability to make productive use of his time in prison because the classes were not mandatory. Dr. Maloney did not discover anything in his investigation regarding any \"violent attacks . . . in connection with\" defendant. Defendant's pre-1979 prison records, including counselor's reports, described defendant as a \"follower\" and \"not really problematic,\" one who was appropriate for medium security. Dr. Maloney had \"no data to indicate that [defendant] would not function appropriately\" in prison. In Dr. Maloney's opinion, defendant had the potential to make some sort of contribution in prison by using his time productively and serving as an example to other persons who were incarcerated.\n\nDr. Maloney observed that defendant had a \"chaotic history\" including multiple siblings, a broken home, an alcoholic father, and a possible learning disorder. He was of the opinion that defendant would have trouble functioning as a responsible person in society. If, however, defendant were imprisoned for his entire life, he probably would be nonproblematic.\n\nII. DISCUSSION\n\nA. Guilt Phase\n\n1. Pretrial Issues\n\na. Motion to Recuse Prosecutor\n\nDefendant contends that the trial court erred in denying his motion to recuse Deputy District Attorney Robert Martin, and that this error necessitates a new trial. This contention is without merit.\n\nDefendant moved to recuse Martin on the ground \"that a conflict of interest exists such as would render it unlikely that the defendant would receive a fair trial.\" Defendant relied on the fact that Martin was the prosecutor in defendant's first trial, in which the judgment, as noted above, was reversed for Wheeler error. Defendant also noted that Martin was the prosecutor in the then ongoing trial of Jose Fuentes. Defendant argued that \"Martin's use of peremptory challenges to limit the number of black potential jurors [in defendant's first trial] is in conflict with his duty not to challenge potential jurors solely on account of their race or on the presumption that black jurors as a group will be unable impartially to consider the State's case against a black defendant.\" Defendant further noted that Martin was currently \"trying a capital case [Fuentes] in which 10 of the 14 peremptory challenges he used in that case were against blacks.\" Defendant contended that he could not \"receive a fair trial if the jury is not drawn from a representative cross-section of the community . . . . Therefore, Mr. Martin must be recused in order to ensure a fair trial for the defendant.\" The trial court denied the motion without stating any reasons.\n\nSection 1424 provides that a motion to recuse a district attorney \"shall not be granted unless it is shown by the evidence that a conflict of interest exists such as would render it unlikely that the defendant would receive a fair trial.\" (See People v. Conner (1983) 34 Cal. 3d 141, 148, 193 Cal. Rptr. 148, 666 P.2d 5; People v. Breaux (1991) 1 Cal. 4th 281, 294, 821 P.2d 585.) A conflict, \"within the meaning of section 1424, exists whenever the circumstances of a case evidence a reasonable possibility that the [district attorney's] office may not exercise its discretionary function in an evenhanded manner.\" (People v. Conner, supra, 34 Cal. 3d at p. 148.) \"In determining whether a ruling on a motion to recuse was proper, a reviewing court applies the abuse-of-discretion standard.\" (People v. Hamilton (1988) 46 Cal. 3d 123, 140, 249 Cal. Rptr. 320, 756 P.2d 1348; People v. Breaux, supra, 1 Cal. 4th at pp. 293-294.)\n\nWe conclude that the trial court acted well within its discretion in denying the motion to recuse. Defendant's sole concern in making this motion was that Martin would, in the future, act to deny him a representative cross-section of the community in the jurors and thus a fair trial. However, we are not persuaded that Martin's earlier error meant that the district attorney would not \"exercise [his] discretionary function [in making peremptory challenges] in an evenhanded manner\" in this trial. (People v. Conner, supra, 34 Cal. 3d at p. 148.) To follow defendant's argument to its logical Conclusion, any time a prosecutor makes a mistake at a trial, he will automatically be subject to recusal at any subsequent retrial. We find no basis for this result in section 1424.\n\nMoreover, in Turner I, we concluded that while Martin failed to sustain his burden of showing that his peremptory challenges were not predicated on group bias, the \"inadequacy of the prosecutor's reasons was compounded by the court's apparent acceptance of those reasons at face value. In each instance the court listened to the prosecutor without question and promptly denied the motion without comment.\" (Turner I, supra, 42 Cal. 3d at pp. 727-728.) Thus, the trial court here was within its discretion in impliedly concluding that Martin's lack of adequate explanation in the first trial did not mean he possessed \"a vendetta against Black defendants and Black jurors,\" as defendant asserts.\n\nFinally, as discussed more fully in part II.A.1.b., post, a defendant has the remedy of responding to a perceived Wheeler violation by timely objecting and stating a prima facie case of group bias. The trial court could have reasonably concluded that the availability of this remedy was sufficient to curtail any possible iteration of Martin's first trial error.\n\nDefendant advances two additional reasons in support of his recusal motion. These arguments were not raised below and were therefore waived. Moreover, both of the alleged improprieties, that Martin made inconsistent arguments in defendant's and Scott's separate trials, and that he committed Wheeler error in this trial, occurred after the trial Judge's ruling on the recusal motion, and thus are not properly considered by us in reviewing the trial court's ruling on that motion.\n\nDefendant further claims, \"The actuality and appearance of a conflict and impropriety was increased by Martin's intervening similar conduct in\" People v. Fuentes. At the time of the motion, the Fuentes trial was ongoing. The verdict in that case was ultimately reversed by this court in People v. Fuentes (1991) 54 Cal. 3d 707, 721, 286 Cal. Rptr. 792, 818 P.2d 75. While Martin's actions were criticized in Justice Mosk's Concurring opinion, the basis for the majority's reversal was the trial court's failure to determine whether the prosecutor's asserted reasons actually applied to the particular jurors challenged, not misconduct on the part of the prosecutor. (Id. at pp. 721, 722) Moreover, our opinion appeared long after the court's ruling here.\n\nWe conclude that trial court did not abuse its discretion in denying defendant's recusal motion.\n\nb. Prosecutor's Exercise of Peremptory Challenges\n\nDefendant contends the prosecutor impermissibly used peremptory challenges to exclude members of a cognizable group from the jury in violation of his right to trial by a jury drawn from a representative cross-section of the community, guaranteed by article I, section 16, of the California Constitution, and the prospective jurors' right of equal protection. These claims are without merit.\n\nDefendant is Black, and both victims were White. The prosecutor used four of his six peremptory challenges against Black prospective jurors. Defendant used two of his seven peremptory challenges against Black prospective jurors, both of whom were identified by the prosecution as acceptable jurors. The jury that was ultimately impaneled contained five Black jurors.\n\nIt is well settled that the use of peremptory challenges to remove prospective jurors solely on the basis of a presumed group bias based on membership in a racial group violates both the state and federal Constitutions. (People v. Wheeler, supra, 22 Cal. 3d at pp. 276-277; Batson v. Kentucky (1986) 476 U.S. 79, 89, 90 L. Ed. 2d 69, 106 S. Ct. 1712; see J.E.B. v. Alabama ex rel. T.B. (1994) __ U.S. __, __ [114 S. Ct. 1419, 1421].) Under Wheeler and Batson, \"'if a party believes his opponent is using his peremptory challenges to strike jurors on the ground of group bias alone, he must raise the point in timely fashion and make a prima facie case of such discrimination to the satisfaction of the court. First, . . . he should make as complete a record of the circumstances as is feasible. Second, he must establish that the persons excluded are members of a cognizable group within the meaning of the representative cross-section rule. Third, from all the circumstances of the case he must show a strong likelihood that such persons are being challenged because of their group association.'\" (People v. Howard (1992) 1 Cal. 4th 1132, 1153-1154, 824 P.2d 1315, italics in original; People v. Garceau (1993) 6 Cal. 4th 140, 171, 862 P.2d 664.)\n\nIf the trial court finds that the defendant has established a prima facie case, the burden shifts to the prosecution to provide \"a race-neutral explanation related to the particular case to be tried\" for the peremptory challenge. (People v. Fuentes, supra, 54 Cal. 3d at p. 714; Batson v. Kentucky, supra, 476 U.S. at p. 97.) However, the explanation need not be sufficient to justify a challenge for cause. (Batson v. Kentucky, supra, 476 U.S. at p. 97; see People v. Johnson (1989) 47 Cal. 3d 1194, 1216, 255 Cal. Rptr. 569, 767 P.2d 1047.) Jurors may be excused based on \"hunches\" and even \"arbitrary\" exclusion is permissible, so long as the reasons are not based on impermissible group bias. (People v. Hall (1983) 35 Cal. 3d 161, 170, 197 Cal. Rptr. 71, 672 P.2d 854.)\n\nThere is a presumption that a prosecutor uses his or her peremptory challenges in a constitutional manner. (People v. Clair (1992) 2 Cal. 4th 629, 652, 828 P.2d 705.) We give great deference to the trial court in distinguishing bona fide reasons from sham excuses. (People v. Fuentes, supra, 54 Cal. 3d at p. 714; People v. Wheeler, supra, 22 Cal. 3d at p. 282.) Additionally, \"if the record 'suggests grounds upon which the prosecutor might reasonably have challenged' the jurors in question, we affirm.\" (People v. Howard, supra, 1 Cal. 4th at p. 1155, quoting People v. Bittaker (1989) 48 Cal. 3d 1046, 1092, 259 Cal. Rptr. 630, 774 P.2d 659.)\n\n(1) Prima Facie Case\n\nWe conclude that the trial court acted within its discretion in determining that no prima facie case had been established for prospective jurors Herman Palmer, Alice Shaw, and William Montgomery.\n\nAt the end of the voir dire session in which prospective jurors Palmer and Shaw were peremptorily challenged by the prosecutor, the trial Judge stated \"For the record, Juror Palmer and Juror Shaw were both Black.\" Defense counsel then made a Wheeler motion as to those two prospective jurors. In arguing that a prima facie case existed, defense counsel stated that both were Black, and had indicated that they could be fair and impartial.\n\nThe trial court stated, \"Let me indicate before I ask the prosecutor to respond that ] at this point, I'm not making a prima facie finding that there's been any systematic exclusion of blacks from the jury. But for the record in the case, I'm going to ask the prosecutor to give me ] to articulate the reasons why he excused those two jurors. ] But I want the record to be clear that I'm making that request not as a result of any prima facie finding of exclusion of the prospective jurors on the basis of color. Again, I'm doing it because of the reason that the case was reversed. And I just want the record to be as clear as it can be. So that's the reason why I'm asking for that response.\" The prosecutor responded, \"I think the law is clear that unless a prima facie case is made, there is no response required by the People.\" The court answered, \"I think the law is clear. I'm merely doing this for the reasons I've articulated.\" The prosecutor then complied with the court's request and delineated his reasons.\n\nAfter the prosecutor exercised a peremptory challenge against prospective Juror Montgomery, the trial Judge asked both counsel to approach the bench and stated, \"I want to put on the record that Mr. Montgomery is Black.\" Defense counsel moved for a mistrial, asserting that the \"district attorney has systematically dismissed minority groups,\" Montgomery was Black, and his answers \"appropriate.\" In addition, defense counsel noted that Montgomery's view on the death penalty appeared to favor the prosecution.\n\nThe Judge stated, \"Let me indicate for the record, again, I find no prima facie case for requiring the prosecution to respond as to why this juror was excused. And again, the record will reflect there are presently five Blacks on the jury who were present at the time the prosecutor did accept the jury panel. And I'm also taking into consideration . . . that one juror, . . . Turner, who [was] excused by the defense was a juror ] a Black juror whom the prosecution would have kept on the jury panel. . . . So at this point, . . . I am going to ask Mr. Martin, if you could state your reasons with regard to Mr. Montgomery.\" The prosecutor complied.\n\nWe first conclude that resolution of the issue of whether a prima facie case was made is not mooted by the trial court's subsequent solicitation of the prosecutor's justifications for his challenges. (Compare Hernandez v. New York (1991) 500 U.S. 352, 359, 114 L. Ed. 2d 395, 111 S. Ct. 1859 [prosecutor justified challenges although no express finding of a prima facie case had been made, hence issue of whether a prima facie case of discrimination had been made became moot]; People v. Fuentes, supra, 54 Cal. 3d at p. 717.) In People v. Fuentes, supra, 54 Cal. 3d 707, defense counsel made the first of several Wheeler motions \"after the prosecutor exercised each of his initial four challenges against Black prospective jurors.\" (Id. at p. 712.) \"The trial court asked the prosecutor for an explanation, but the prosecutor was not prepared to give one.\" (Ibid.) The court indicated that before trial commenced, it would \"'have the reasons set forth by the People.'\" (Ibid.) The prosecutor thereafter excused four more prospective jurors, three of whom were Black. (Ibid.) \"When defense counsel again objected on Wheeler grounds, the court stated that it would 'consider [counsel's objection] a continuing motion' but did not inquire further into the matter.\" (Ibid.)\n\n\"At the Conclusion of voir dire, the court finally addressed the Wheeler motion.\" (People v. Fuentes, supra, 54 Cal. 3d at p. 712.) After hearing approximately two hours of the prosecutor's justifications for his challenges, the court took the matter under submission. (Id. at pp. 712-713.) \"On the following morning, the court ruled that no prima facie showing had been made. Despite this ruling, however, the court [then] examined the prosecutor's purported reasons for excusing\" the prospective Black jurors. (Id. at p. 713, italics added.)\n\nWe concluded that the trial court's statement that before trial, it would \"have the reasons set forth by the People,\" and the court's instructions following voir dire that the prosecutor obtain his records and justify his challenges, \"clearly indicated that the court had implicitly found a prima facie case of improper exclusion on the basis of race,\" despite its contrary ruling on the following day. (People v. Fuentes, supra, 54 Cal. 3d at pp. 715-716, italics in original.) We instructed trial courts on the proper procedure: \"When a Wheeler motion is made, the party opposing the motion should be given an opportunity to respond to the motion, i.e., to argue that no prima facie case has been made. At this point no explanation for the exercise of the peremptory challenges need be given. After argument, the trial court should expressly rule on whether a prima facie showing has been made.\" (Id. at pp. 716-717, fn. 5, italics in original.)\n\nWith nearly clairvoyant accuracy, the trial court here followed these guidelines, even though the 1987 retrial preceded our decision in Fuentes. Prior to soliciting the prosecutor's reasons justifying his challenges, the court expressly ruled that it did not find a prima facie case, and that it only asked the prosecutor for his justifications for purposes of completing the record in case the court on appeal disagreed with its Conclusion. Under these circumstances, the issue of whether a prima facie case has been established is not moot, even though subsequent inquiry into the prosecutor's reasons occurs. Thus, when an appellate court is presented with such a record, and concludes that the trial court properly determined that no prima facie case was made, it need not review the adequacy of counsel's justifications for the peremptory challenges.\n\nSecond, we conclude that the trial court here acted within its discretion in determining that defendant had failed to state a prima facie case of discrimination. In particular, defendant failed to establish from all the circumstances of the case a strong likelihood that such persons were being challenged because of their group association. (People v. Howard, supra, 1 Cal. 4th at p. 1154.) Rather, the only bases for establishing a prima facie case cited by defense counsel were that all of the challenged prospective jurors were Black and either had indicated that they could be fair and impartial or in fact favored the prosecution. This is insufficient. (People v. Rousseau (1982) 129 Cal. App. 3d 526, 536-537, 179 Cal. Rptr. 892 [defense counsel's statement that \"'there were only two blacks on the whole panel, and they were both challenged by the district attorney'\" fails to establish a prima facie case]; see People v. Howard, supra, 1 Cal. 4th at pp. 1154-1155; People v. Dominick (1986) 182 Cal. App. 3d 1174, 1193-1196, 227 Cal. Rptr. 849.)\n\nOf course, a trial court should not \"blind itself to everything except defense counsel's presentation.\" (People v. Howard, supra, 1 Cal. 4th at p. 1155.) Here, the trial Judge, who had observed the voir dire, was in the best position to determine under \"all the relevant circumstances\" of the case whether there was a \"'strong likelihood'\" these prospective jurors were being challenged \"because of their group association.\" (People v. Howard, supra, 1 Cal. 4th at p. 1156; see People v. Johnson, supra, 47 Cal. 3d at p. 1221.) As we delineate below, the record clearly established specific nonrace-related reasons why a prosecutor might want to excuse the challenged prospective jurors. (People v. Bittaker, supra, 48 Cal. 3d at p. 1092.) Moreover, as the trial court expressly observed, both sides had excused Black jurors, and the prosecutor had accepted a jury that included, as did the jury ultimately impaneled, five Blacks. While the fact that the jury included members of a group allegedly discriminated against is not conclusive, it is an indication of good faith in exercising peremptories, and an appropriate factor for the trial Judge to consider in ruling on a Wheeler objection. (People v. Snow (1987) 44 Cal. 3d 216, 225, 746 P.2d 452, 242 Cal. Rptr. 477; see People v. Johnson, supra, 47 Cal. 3d at p. 1221, fn. 7.)\n\nCiting no authority, defendant urges us to conclude that \"because of prosecutor Martin's personal 'track record,'\" a \"lesser showing of possible group bias should be required here than in other cases.\" We reject this analysis. The trial court stated it was conscious of the basis for the earlier reversal and had this history in mind when it ruled that no prima facie case had been established. That is sufficient.\n\n(2) Race-Neutral Reasons\n\nWe have stated above that once an appellate court concludes that the trial court properly determined that no prima facie case was made it need not review the adequacy of counsel's justifications, if any, for the peremptory challenges. However, given the unique procedural history of this case, we have elected to perform such an evaluation. We conclude that the trial court acted within its discretion in determining that the reasons proffered by the prosecutor in support of his peremptory challenges, which were supported by the record, were race-neutral.\n\nProspective Juror Herman Palmer\n\nIn stating his reasons for excusing Mr. Palmer, the prosecution observed that Palmer \"had an extremely poor grasp of the English language. He had to deliberate exceedingly long and there were pauses between questions. He had a very poor comprehension. He couldn't understand the instructions given to him by the court.\" The prosecutor acknowledged that \"Witherspoon\" questions are somewhat difficult, but observed that he had repeated the questions for Palmer \"not once, not twice, but three times.\" (Witherspoon v. Illinois (1968) 391 U.S. 510, 20 L. Ed. 2d 776, 88 S. Ct. 1770; see Wainwright v. Witt (1985) 469 U.S. 412, 83 L. Ed. 2d 841, 105 S. Ct. 844; People v. Ghent (1987) 43 Cal. 3d 739, 767-769, 239 Cal. Rptr. 82, 739 P.2d 1250.)\n\nThe prosecutor stated that Palmer had then attempted to look up the word \"deterrent\" in the dictionary, and the court noted that he could not locate it. Palmer \"had many no answers in his questionnaire. And he sat on a hung jury.\" Finally, the prosecutor \"found him questionable as to being in favor of the death penalty.\" The prosecutor got the impression Palmer would modify his answers depending on who was questioning him. Because it was the early stage of challenges, the prosecutor thought he could locate a better juror than Palmer. After hearing argument by defense counsel, the court stated that it \"listened carefully to [the prosecutor's] explanation of why he made the challenge,\" found the reasons to be adequate, and denied the motion.\n\nOf course, where a prosecutor's concern for a juror's ability to understand is supported by the record, it is a proper basis for challenge. (People v. Barber (1988) 200 Cal. App. 3d 378, 397-399, 245 Cal. Rptr. 895.) Defendant argues, however, that this basis was insufficient here because the prosecutor did not excuse other non-Black jurors who displayed similar intellectual limitations. However, we have previously rejected a procedure that places an \"undue emphasis on comparisons of the stated reasons for the challenged excusals with similar characteristics of nonmembers of the group who were not challenged by the prosecutor,\" noting that such a comparison is one-sided and that it is not realistic to expect a trial Judge to make such detailed comparisons mid-trial. (People v. Johnson, supra, 47 Cal. 3d at p. 1220.)\n\nIn addition, we have observed that \"the same factors used in evaluating a juror may be given different weight depending on the number of peremptory challenges the lawyer has at the time of the exercise of the particular challenge.\" (People v. Johnson, supra, 47 Cal. 3d at p. 1220.) Thus, at the beginning of voir dire a prosecutor may exercise his challenges freely against a person who appears to have difficulty understanding or communicating, and later be more hesitant with his challenges on the ground that if he exhausts them too soon, he may be forced to go to trial with an even more problematic juror. (Ibid.) Moreover, \"the very dynamics of the jury selection process make it difficult, if not impossible, on a cold record, to evaluate or compare the peremptory challenge of one juror with the retention of another juror [who] on paper appears to be substantially similar.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e (Id. at p. 1221.)\n\nFinally, Palmer's experience of sitting on a hung jury constitutes a legitimate concern for the prosecution, which seeks a jury that can reach a unanimous verdict. In sum, the trial court did not abuse its discretion in finding these race-neutral explanations sufficient to satisfy the prosecution's burden.\n\nProspective Juror Alice Maureen Shaw\n\nIn stating his reasons for excusing Ms. Shaw, the prosecutor noted from Shaw's body language and way of expressing herself it seemed \"there's a great deal of hostility within her. She seems mad or hostile about something.\" The prosecutor conceded that the hostility might not be directed at him, but that he thought it would be \"very chancy\" to put her on the jury.\n\nThe prosecutor noted that Shaw \"said that she didn't think Justice was done on the murder of the father of her child.\" Martin could not ascertain whether that experience would favor the defense or prosecution. The more he questioned her, the more he got the feeling that \"there was a pot boiling within her.\" Shaw had also witnessed her fiance being shot and seriously injured. Martin was uncertain what effect this shooting had on her.\n\nIn Shaw's questionnaire, \"she described the defendant as a young man [who came] from an outstanding family. And when I asked her whether she knew the defendant, she then repeated that.\" On voir dire, Shaw ultimately stated that she did not know defendant.\n\nThe prosecutor also expressed concern that Shaw had trained with the Department of Social Services, because he at one time had been the \"Director of Welfare for the State of California.\" During the \"hottest period of the welfare events,\" he had a number of suits filed against him personally that were reported in the media. The prosecutor did not ask Shaw about this subject because he did not wish to announce that that had been his job. After hearing argument by defense counsel, the court stated that it \"listened carefully to [the prosecutor's] explanation of why he made the challenge,\" found the reasons to be adequate, and denied the motion.\n\nWe have repeatedly upheld peremptory challenges made on the basis of a prospective juror's negative experience with law enforcement. (See People v. Walker (1988) 47 Cal. 3d 605, 625-626, 253 Cal. Rptr. 863, 765 P.2d 70; People v. Wheeler, supra, 22 Cal. 3d at pp. 275, 277, fn. 18.) In addition, peremptory challenges are properly made in response to \"'bare looks and gestures'\" by a prospective juror that may alienate one side. (People v. Wheeler, supra, 22 Cal. 3d at p. 276.) The trial court acted within its discretion in finding the prosecutor's reasons race-neutral as to this juror.\n\nProspective Juror William Montgomery\n\nIn stating his reasons for excusing Mr. Montgomery, the prosecutor said, \"this juror is definitely against opposing the death penalty. He would never commit completely on that. . . . he said if he was faced with the issue, he would most likely vote for life rather than death.\" The prosecutor said that he did \"not wish to run the risk of putting somebody on that panel that feels strongly that life imprisonment without the possibility of parole would be what they would lean to and probably vote for.\" The trial court found that the prosecutor's explanations were \"adequate and sufficient to justify the use of the peremptory challenge.\" The court also observed that \"just prior to this challenge, the prosecutor did accept the jury panel which included five blacks.\"\n\nWe have previously upheld \"the prosecutor's exercise of peremptory challenges against death penalty skeptics ] i.e., prospective jurors who, although not excusable for cause under Witherspoon v. Illinois, supra, 391 U.S. 510, nevertheless expressed reservations about the death penalty. . . .\" (People v. Walker, supra, 47 Cal. 3d at p. 624; see People v. Pride (1992) 3 Cal. 4th 195, 230, 833 P.2d 643.) We see no reason to reconsider that Conclusion here. The trial court acted within its discretion in finding the prosecutor's reasons race-neutral as to this juror.\n\nProspective Juror William Erwin\n\nDefendant did not challenge the People's peremptory challenge of prospective juror William Erwin either at the time he was excused, or when the trial Judge later that day expressly stated for the record that Erwin was Black. The next day, defendant objected on Wheeler grounds to the prosecutor's peremptory challenge to prospective jurors Palmer and Shaw, and that motion was argued. Later that day, defendant objected to the prosecutor's peremptory challenge of prospective juror Montgomery. In the course of these proceedings, defense counsel stated that four Black prospective jurors had been excused by the prosecution, apparently including Erwin. The trial court responded that \"The last time there was articulation requested with regard to two [prospective jurors] who were excused.\" This statement appears to be the court's recognition that no objection had been made regarding Erwin. We conclude that defendant waived his objection, raised for the first time on appeal, to Erwin's excusal, and that the trial court did not err in failing to make findings or request reasons regarding the prospective juror's dismissal. (See People v. Howard, supra, 1 Cal. 4th at pp. 1157-1159; People v. Hayes (1990) 52 Cal. 3d 577, 605, 276 Cal. Rptr. 874, 802 P.2d 376.)\n\nBecause the trial court in denying the Wheeler motions based on these proffered reasons implicitly found at least one race-neutral explanation for each questioned peremptory challenge, no abuse of discretion occurred. (People v. Pride, supra, 3 Cal. 4th at p. 230.) Moreover, because no race-based peremptory challenges were made, the equal protection rights of the subject prospective jurors were not denied. (See Powers v. Ohio (1991) 499 U.S. 400, 409, 113 L. Ed. 2d 411, 111 S. Ct. 1364.)\n\nDefendant asserts that the trial court \"never made any finding concerning the adequacy of Martin's 'explanations' for his use of peremptory challenges.\" As set forth above, the record is otherwise. In addition, relying on People v. Fuentes, supra, 54 Cal. 3d 707, defendant asserts that the trial Judge failed to adequately inquire into the prosecutor's reasons. However, the basis for our reversal in Fuentes was the trial court's failure to determine whether the prosecutor's asserted reasons actually applied to the particular jurors challenged. (Id. at pp. 721, 722) Here, by contrast, the trial court carefully elicited the prosecutor's reasons for excusing each particular juror and engaged in extended Discussion with both counsel regarding these reasons before denying the Wheeler motions.\n\nFinally, defendant initially challenged on appeal the exclusion of two Black prospective alternate jurors. He has since expressly withdrawn that claim by letter brief and at oral argument. In any event, no alternate jurors were ever substituted in, and hence it is unnecessary to consider whether any Wheeler violation occurred in their selection. Moreover, any Batson violation could not possibly have prejudiced the defendant.\n\nc. Motions to Suppress Evidence\n\n(1) Suppression of Defendant's Statements\n\nDefendant contends that his August 7, 1979 statements should have been suppressed because they were the product of an illegal delay in arraigning and appointing counsel for him in violation of section 825,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and contravened the 48-hour rule for judicial determinations of probable cause set forth in County of Riverside v. McLaughlin (1991) 500 U.S. 44, 114 L. Ed. 2d 49, 111 S. Ct. 1661. Defendant asserts that \"a new trial should be ordered on this ground alone.\" We conclude that any delay in arraigning defendant was necessary and reasonable and did not prejudice him.\n\n(a) Factual Background\n\nDefendant was arrested on Friday August 3, 1979 on charges of conspiracy to commit robbery and being an ex-felon in possession of a gun. On the afternoon of Sunday, August 5, while still in custody on these charges, defendant was informed that he was under arrest for the Torrance Airport murders. He made the challenged statements on the afternoon of Tuesday, August 7, and was arraigned on the morning of August 8.\n\nDefendant moved to suppress both his August 5 and his August 7, 1979 statements on the grounds that the statements were not voluntary and that they were obtained while he was being illegally detained in violation of section 825. At the evidentiary hearing on this motion, Torrance Police Officer Green, the investigating officer of the Torrance Airport murders, testified in detail about his intense preparation of the case between Friday night and Tuesday at noon. Green observed that after defendant's Sunday statement, he now had two suspects who acknowledged being at the murder scene, but who were blaming each other. He felt \"obligated . . . to try and isolate who was the gun man. . . .\" Green's actual investigation of defendant concluded on Sunday night. He then spent most of Monday and Tuesday morning preparing the case to be presented to the district attorney's office and filed. This included coordinating interview transcripts and preparing reports regarding the investigation. Officer Green was under the impression that section 859 required him, in a case alleging special circumstances, to include two copies of all papers submitted to the district attorney's office for potential defense attorneys. The actual submission, not including copies, was approximately 500 pages.\n\nOfficer Green filed the complaint against defendant in South Bay Municipal Court Tuesday at noon. Green \"knew as a matter of policy, that . . . they wouldn't do afternoon arraignments,\" and defendant was arraigned on Wednesday morning. Green had requested that officers investigating the Marmor homicide not ask defendant \"any questions in reference to the Torrance murders.\" The August 7 interview was not done with Officer Green's knowledge or at his request, and no Torrance police officers attended the interview. No one at any time from any law enforcement agency requested that Officer Green put off the filing of the complaint.\n\nSouth Bay Municipal Court Judge Benjamin Aranda, called by the defense, testified as to the court's policies regarding felony arraignments in August 1979. In general, arraignments were not held after 10 o'clock in the morning. If an arraignment was needed after that time, a special request had to be made to the Judge then assigned to the arraignment court. Whether such a request was granted depended on the particular Judge and the number of cases already on calendar. The seriousness of the charge probably would not \"enter into it.\" Judge Aranda specifically recalled that there was no mention of any exception to the 10 a.m. arraignment rule in the directives sent to police departments in 1979.\n\nThe court denied the motion to suppress. The court first concluded that defendant was properly advised of his rights on three occasions, and knowingly and without coercion waived those rights. It interpreted section \"825 as allowing the arraignment of the defendant up to and including Tuesday.\" The court observed that the case was obviously very complicated. With regard to Officer Green's intent, the court stated that it did not interpret section 859 to require copies of all papers submitted to the district attorney's office to be provided to defense attorneys, but found that Officer Green had acted in the good faith belief that such copies were required by law. \"He was not taking that time for any untoward purpose or any illegal or nefarious personal attempt to delay . . . taking the case to the District Attorney's office.\"\n\nThe court also made \"a factual finding that Officer Green did not fail to take defendant for arraignment on the date that he had the case filed with the court in the South Bay because he was of the impression that there were no arraignments allowed in the afternoon by the South Bay Municipal Court,\" and that Officer Green's testimony had been substantiated by Judge Aranda's testimony to the same effect. The court found that \"at no point did Detective Green delay the taking of the case to the prosecutor's office nor did he delay the arraignment of the defendant for any purpose other than the purposes he testified to. I specifically find he did not delay either the taking of the case to the prosecutor's office nor the arraigning of the defendant for any purpose of keeping the defendant in custody longer so that he could interview the defendant.\" Finally, the court found that even if the arraignment was after the period prescribed in section 825, \"defendant's statements on [August 7] were not made as a result of any promises ] any coercion,\" but \"were made freely and voluntarily beyond a reasonable doubt.\"\n\n(b) Analysis\n\nOn appeal, defendant does not renew his challenge that his statements were involuntary. Rather, he contends that his August 7, 1979 statements should have been suppressed because they were the product of an unreasonable delay under section 825 and County of Riverside v. McLaughlin, supra, 500 U.S. 44.\n\nSection 825 requires that an arraignment be held within two days of defendant's arrest, excluding Sundays and holidays. Here, defendant argues, and the trial court ruled, that this two-day period expired on Tuesday. As noted above, defendant's statements were made within this period, although he was not arraigned until Wednesday morning. (See Youngblood v. Gates, supra, 200 Cal. App. 3d at p. 1315.)\n\nOf course, section 825 does not \"authorize a two-day detention in all cases. Instead, 'a limit [is placed] upon what may be considered a necessary delay, and a detention of less than two days, if unreasonable under the circumstances, is in violation of the statute' and of the Constitution.\" (People v. Thompson (1980) 27 Cal. 3d 303, 329, 611 P.2d 883, 165 Cal. Rptr. 289.) However, \"the charge of murder is generally considered to be the most serious of all criminal charges, and it should not be publicized lightly or casually.\" (People v. King (1969) 270 Cal. App. 2d 817, 823, 76 Cal. Rptr. 145.) Here, the case involved potential charges of double murder, robbery, and the concomitant special circumstances. In view of the complexity of the charging decisions involved, including the discernment of each suspect's level of culpability, the delay was not unreasonable. (People v. Bonillas, supra, 48 Cal. 3d at p. 787; People v. King, supra, 270 Cal. App. 2d at p. 823 [delay in arraignment \"for the purpose of untangling a skein of circumstantial evidence which implicated five suspects in varying degrees\" and deciding whom to charge with murder upheld].)\n\nIn addition, the record indicates that Officer Green used the time from Monday to Wednesday not to further investigate defendant, but rather to coordinate the necessary reports and transcripts for submission to the district attorney's office and complete the filing of the complaint. Indeed, he specifically requested that defendant not be interviewed about the Torrance murders by the Marmor murder investigators. Thus, there is no evidence that the arraignment was delayed for purposes of obtaining the challenged statements. (People v. Bonillas, supra, 48 Cal. 3d at pp. 787-788; People v. King, supra, 270 Cal. App. 2d at p. 823.)\n\nMoreover, defendant fails to assert how any delay in arraignment resulted in his August 7 statements. Defendant does not challenge the fact that he was fully informed of and waived his right to remain silent and to counsel. At trial, it was established that defendant requested the interview, and defendant does not now contend otherwise. Delay in arraignment is but one factor in determining the voluntariness of a statement. (People v. Morris (1991) 53 Cal. 3d 152, 200, 279 Cal. Rptr. 720, 807 P.2d 949; People v. Thompson, supra, 27 Cal. 3d at p. 329.) To justify exclusion of a statement, defendant must show that the delay produced his admissions or that there was an essential connection between the illegal detention and admissions of guilt. (See People v. Thompson, supra, 27 Cal. 3d at pp. 329-330; Rogers v. Superior Court (1955) 46 Cal. 2d 3, 10-11, 291 P.2d 929.) No such connection is demonstrated here.\n\nRather, defendant baldly asserts that it is \"nonsensical\" to believe he would have requested the August 7 interview and made the challenged statements if he had been arraigned and had counsel appointed, and that the statements were a direct product of the delay in arraignment. This is insufficient. (People v. Bonillas, supra, 48 Cal. 3d at pp. 788-789.)\n\nDefendant also argues that the delay in arraignment violated the 48-hour rule for judicial determinations of probable cause set forth in County of Riverside v. McLaughlin, supra, 500 U.S. at p. 56 and Gerstein v. Pugh (1975) 420 U.S. 103, 125, 43 L. Ed. 2d 54, 95 S. Ct. 854 (state \"must provide a fair and reliable determination of probable cause as a condition for any significant pretrial restraint of liberty, [fn. omitted] and this determination must be made by a judicial officer either before or promptly after arrest\"). (See Powell v. Nevada (1994) 128 L. Ed. 2d 1, 114 S. Ct. 1280, 1283 [McLaughlin retroactive to all cases not final when it was decided].) Defendant does not direct us to where in either his written motion to suppress his August 5 and 7 statements, or the 39-page oral argument on this motion, his Fourth Amendment challenge to the delay in either a probable cause determination or arraignment is raised. Our own review of the record indicates that this claim was not raised in defendant's written motion, and that counsel's oral argument overwhelmingly focused on whether sections 825 and 849 were violated, and what effect delay and other factors had on the making and voluntariness of defendant's statements.\n\nThe only statements at the oral argument on the motion that even remotely suggest a Gerstein claim are the following: \"The requirement is really recognized in both state and federal practices as being one to prevent unwarranted police interrogation. To make it possible for the accused to be promptly advised of his right to counsel and enable him to obtain bail and to have the issue of probable cause for his arrest determined by a judicial officer,\" and \"the failure to take the arrestee before a magistrate without unreasonable or unnecessary delay is, in fact, false imprisonment.\" It is apparent from the context of these statements that the reference to \"federal practice[]\" was to the McNabb-Mallory rule and rule 5(a) of the Federal Rules of Criminal Procedure, not the Fourth Amendment.\n\nMoreover, we decline to find that a Gerstein argument was made in this case when counsel made a single passing reference in a 39-page argument to the determination of probable cause by a judicial officer. We therefore conclude defendant waived his Fourth Amendment claim by not making a specific and timely objection on this ground below. (People v. Ashmus (1991) 54 Cal. 3d 932, 973, fn. 10, 820 P.2d 214 [general rule that questions relating to the admissibility of evidence will not be reviewed on appeal in the absence of a specific and timely objection in the trial court on the ground sought to be urged on appeal]; People v. Benson (1990) 52 Cal. 3d 754, 786, fn. 7, 276 Cal. Rptr. 827, 802 P.2d 330; People v. Rogers (1978) 21 Cal. 3d 542, 548, 146 Cal. Rptr. 732, 579 P.2d 1048.)\n\nIn sum, the trial court did not err in denying defendant's motion to suppress his August 7, 1979 statements.\n\n(2) Warrantless Detention\n\nDefendant contends that the threatened and actual detention of defendant and Scott was unlawful, and implicitly contends that evidence discovered in the Chrysler defendant abandoned should therefore have been suppressed. We conclude that the discovery of the evidence was not the product of an unlawful threatened or actual detention, and that the motion to suppress this evidence was therefore properly denied under both the Fourth and Fourteenth Amendments to the federal Constitution, and Article I, section 13 of the California Constitution. Because defendant's crimes occurred in 1979, they are not subject to the passage of Proposition 8 by the electorate in June 1982 and the consequent amendment to the California Constitution, article I, § 28, subdivision (d). (People v. Smith (1983) 34 Cal. 3d 251, 263, 193 Cal. Rptr. 692, 667 P.2d 149.)\n\n(a) Factual Background\n\nOfficer Michael Ard and Officer John Mitchell testified at the section 1538.5 hearing. On the evening of July 31, 1979, they were on patrol in a marked police vehicle. Officer Ard had 10 years' experience as a police officer, and had made 20 arrests in the same area over a one year period for robbery involving a particular modus operandi. Robbers would work in pairs at the card clubs; one would identify which patrons were leaving with substantial sums of money, and the other would apparently wait in a car outside the club. The pair would then follow one of these patrons home, and there rob the victim.\n\nThat evening, two men later identified as defendant and Scott were seen by Officers Ard and Mitchell driving a Chrysler out of the valet parking area of the Horseshoe Card Club in Gardena. Defendant was the driver, and Scott was the passenger. Officer Ard was familiar with the people who performed the valet service, and knew that neither person in the car worked at the club. The officers left the club, and returned five minutes later to see defendant and Scott reentering the Horseshoe Club parking lot. Officer Ard wondered if they were there to pick someone up or if they were \"cruising the club.\" The officers left again for approximately 15 minutes. When they returned, shortly before midnight, Officer Ard saw defendant driving out of the club's driveway. He was \"starting to wonder just exactly what they were doing in the parking lot.\"\n\nOfficer Ard was \"too late to get the front plate,\" so he stopped in order to wait for traffic to clear, so that he could back up and look at the rear plate. As soon as he stopped, he heard a loud engine noise and tires screeching. The Chrysler began accelerating rapidly away from the police vehicle.\n\nOfficer Ard backed up and pursued the Chrysler for approximately one and a half blocks. He turned on his red light but not the siren. Officer Ard followed the Chrysler because he thought a crime may have occurred, and the two men were leaving the scene. If he had stopped them, he would have asked them why they were driving in such a reckless manner.\n\nOfficer Ard proceeded generally in the direction he thought the Chrysler had gone. He spotted Scott walking on the street. He drove past Scott to locate the Chrysler. The car was parked and running, with the lights on, and appeared unoccupied. Both doors were unlocked. Officer Ard backed up, jumped out of the car, and told Scott to stop because he wanted to talk with him. Scott denied being in any car, or any knowledge of the Chrysler, and said he was coming from a local liquor store. When Officer Ard asserted that there was not an open liquor store nearby, Scott continued to insist he had been in a liquor store.\n\nIn the meantime, Officer Mitchell approached the vehicle to see if the other man was still in the car. He entered the vehicle to retrieve a piece of identification in plain sight on the center console in order to possibly identify who had been in the car. He also turned off the Chrysler's ignition and lights. The identification was Scott's state parole identification card.\n\nOfficer Mitchell gave the parole card to Officer Ard, who showed it to Scott. Officer Ard then went to retrieve the registration from the glove box of the car. When he opened the passenger door, he noticed a gun barrel protruding from under a floor mat on the passenger side of the front seat. This gun was later determined to be the murder weapon. Ard retrieved the gun and registration and placed Scott under arrest. Scott was in possession of Hill's gold Omega watch. The car was registered to Nathaniel Tribet.\n\nThe trial court denied the motion to suppress. The court found that the Chrysler accelerated out of the club's parking lot \"not as a result of any movement on the part of the police vehicle.\" \"That acceleration . . . occurred not as a result of anything other than perhaps the officers looking in their direction, and it was after that acceleration occurred that the officer then went in the same direction as the Chrysler. So that the acceleration of the Chrysler, the squealing of the wheels was not as a result of any action other than what was perfectly legitimate on the part of the officers. That is looking in the direction and viewing the Chrysler. After having heard the squealing of the wheels and observing what was acceleration of the vehicle, the officers then were quite proper in following that vehicle. So there was no illegal activity or improper activity on the part of the police officers.\"\n\nThe court further found that once the officers observed the car accelerating and then disappearing, \"they had a perfect right to detain who they viewed to be the occupant of that vehicle.\" The attempts to ascertain the registered owner of the abandoned vehicle (which led to the discovery of the evidence that defendant sought to suppress) were legal.\n\n(b) Analysis\n\nDefendant asserts an unlawful threatened and actual detention occurred when Officer Ard \"stopped his marked patrol car, backed up towards the Chrysler, and then followed it.\" While it is difficult to parse which claim defendant is actually asserting, and what facts he asserts support which contention, none of these claims has merit.\n\nNo threatened detention in violation of the California Constitution occurred when the officers stopped their vehicle. As noted above, Officer Ard testified that as soon as he stopped, he heard a loud engine noise and tires screeching, and the Chrysler began accelerating rapidly away from the police vehicle. However, the fact that a police vehicle had stopped near defendant's vehicle would not communicate to a reasonable person that the officers intended to detain defendant and Scott. (See People v. Menifee (1979) 100 Cal. App. 3d 235, 239, 160 Cal. Rptr. 682.) Thus, the trial court reasonably concluded that no threatened illegal detention had occurred. (Compare People v. Menifee, supra, 100 Cal. App. 3d at pp. 238-240 [reasonable for trial court to conclude that officer's act of walking briskly toward defendants threatened detention.].)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nNor did any actual detention in violation of the California Constitution occur when the officer merely stopped his vehicle. The officer did not stop or \"accost[] an individual on suspicion that the person 'may be personally involved in some criminal activity.'\" (People v. Bower (1979) 24 Cal. 3d 638, 643, 156 Cal. Rptr. 856, 597 P.2d 115, quoting In re Tony C. (1978) 21 Cal. 3d 888, 895, 582 P.2d 957, 148 Cal. Rptr. 366.) There was no use of sirens or flashing lights, no command to halt, and no use of the police vehicle to block defendant's vehicle or otherwise control the direction or speed of his movement. (See People v. Siegenthaler (1972) 7 Cal. 3d 465, 469, 103 Cal. Rptr. 243, 499 P.2d 499 [defendant's flight upon sight of officers' vehicle not induced by officers' infringement of defendant's rights]; People v. Rico (1979) 97 Cal. App. 3d 124, 128-130, 158 Cal. Rptr. 573 [momentarily spotlighting a moving car and following it for five minutes before driver voluntarily pulled over not a detention].) Moreover, Officer Ard testified that his purpose in stopping his police car was to back up in order to get a better view of defendant's vehicle's license plate.\n\nNor was there any detention under the Fourth and Fourteenth Amendments. Rather, a seizure \"requires either physical force . . . or, where that is absent, submission to the assertion of authority.\" (California v. Hodari D., supra, 499 U.S. at p. 626, italics in original.) None was present here.\n\nOf course, once defendant rapidly accelerated away from the police car, with his car making a loud engine noise and tires screeching, the police officers acted reasonably in following him. Under federal law, still no seizure occurred at this point. (California v. Hodari D., supra, 499 U.S. at p. 629 [police pursuit which constitutes a show of authority enjoining fleeing individual to stop is not a seizure].) Under applicable state law, any detention that occurred was based on specific and articulable facts causing Officer Ard to subjectively and reasonably \"suspect that (1) some activity relating to crime had taken place or [was] occurring or about to occur, and (2) the person he intended to stop or detain [was] involved in that activity.\" (In re Tony C., supra, 21 Cal. 3d at p. 893.)\n\nWe conclude that the discovery of evidence in the Chrysler abandoned by defendant was not the product of an unlawful threatened or actual detention, and defendant's motion to suppress this evidence was therefore properly denied.\n\n(3) Entry into Chrysler\n\nDefendant expressly concedes that the warrantless search of an automobile glove compartment may be lawfully conducted based on probable cause alone without any showing of actual exigency. However, defendant contends that Officer Ard's entry into the Chrysler solely to search the glove box for registration information was unlawful because the officer did not first attempt to obtain that same information through less intrusive electronic means. Accordingly, defendant asserts that the resulting discovery of the .38-caliber revolver was likewise unlawful and should have been suppressed. In addition, because defendant's arrest was the direct result of the revolver's discovery, all statements made by defendant following that unlawful arrest, and all physical evidence seized in conjunction with his arrest, must similarly be suppressed.\n\nAs recounted above, Officer Ard went to the Chrysler to retrieve its registration from the glove box. When he opened the passenger door, he noticed a gun barrel protruding from under a floor mat on the passenger side of the front seat. This gun was later determined to be the murder weapon. Ard retrieved the gun and registration and placed Scott under arrest. Defendant \"urges\" this court to adopt a rule that \"before an officer enters a vehicle to search for a registration certificate, the officer must try to obtain the information through radio checks, computer terminals or other technological means.\"\n\nWe rejected a similar claim in People v. Webster (1991) 54 Cal. 3d 411, 285 Cal. Rptr. 31, 814 P.2d 1273. Webster was stopped in 1981 by Officer Abbott for a speeding violation. (Id. at p. 429.) Abbott ascertained that Webster had an outstanding warrant and arrested him. (Ibid.) Webster and all of his passengers disclaimed ownership of the vehicle, also a Chrysler. (Ibid.) Abbott then searched the car's glove compartment and visor for registration papers. While in the car, the officer saw and retrieved a wallet lying in the middle of the front seat which ultimately linked defendant to a murder. (Id. at pp. 428-430.)\n\nWe concluded that \"Abbott acted properly when he . . . entered the car for the limited purpose of finding the registration. Then, as now, the Vehicle Code allowed a [California Highway Patrol] officer, among others, to inspect a registrable vehicle and its title in order to determine ownership. (Veh. Code, § 2805, subd. (a).)\" (People v. Webster, supra, 54 Cal. 3d at p. 430.) Within constitutional limits, this statute authorizes an officer to enter a stopped vehicle and conduct an immediate warrantless search for the required documents. (Ibid.)\n\nWe further observed that the car was validly detained on the highway for a moving traffic violation, all of its occupants disclaimed ownership, and Webster was subject to arrest for an outstanding warrant. (People v. Webster, supra, 54 Cal. 3d at pp. 430, 431.) Thus, in that \"uncertain situation, Abbott was amply entitled to inspect the Chrysler's registration to ascertain its owner before deciding whether to release or impound the vehicle. . . . [P] Moreover, . . . Abbott had every reason to believe that the occupants, who disclaimed ownership, would not be able to find or produce the registration on their own. (See People v. Martin [(1972)] 23 Cal. App. 3d 444, 447, 100 Cal. Rptr. 272; compare Jackson v. Superior Court [(1977)] 74 Cal. App. 3d 361, 368, 142 Cal. Rptr. 299.)\" (Id. at p. 431.)\n\nHere, the Chrysler was abandoned, and the person observed to have been a passenger disclaimed any knowledge, let alone ownership, of the vehicle. He also had been identified as a parolee, and it was the middle of the night. Under these circumstances, Officer Ard was entitled to search the vehicle for its registration. As in Webster, Officer Ard confined his search to the glove compartment, a traditional repository of auto registration. (People v. Webster, supra, 54 Cal. 3d at p. 431; see People v. Chavers (1983) 33 Cal. 3d 462, 470, 189 Cal. Rptr. 169, 658 P.2d 96.) While engaged in this appropriate activity, Officer Ard saw the gun in plain view on the floor. \"The observation and seizure of evidence in plain view from a position where the officer has a right to be is not constitutionally prohibited.\" (People v. Webster, supra, 54 Cal. 3d at p. 431.)\n\nRelying on Jackson v. Superior Court, supra, 74 Cal. App. 3d at pp. 367-368, and People v. Superior Court (Fishback) (1969) 2 Cal. App. 3d 304, 310, 82 Cal. Rptr. 766, defendant asserts that Officer Ard's entry into the Chrysler solely to search the glove box for registration information was unreasonable because the officer did not first attempt to obtain that same information through less intrusive electronic means. However, both Jackson and Fishback were premised on privacy concerns and expressly distinguished cases involving unoccupied or abandoned vehicles. (People v. Jackson, supra, 74 Cal. App. 3d at p. 368; People v. Superior Court (Fishback), supra, 2 Cal. App. 3d at pp. 308-309, see People v. Webster, supra, 54 Cal. 3d at p. 431.) Moreover, Officer Ard testified that he \"wanted the registration to see maybe if the car had been cold-plated or something. I don't know if the plates belonged on it.\" Thus, contrary to defendant's argument, there was no less intrusive means to ascertain the abandoned vehicle owner's identity. In sum, no illegal search and seizure occurred, and the motion to suppress the evidence was properly denied.\n\n(4) Reverta Austin's Arrest\n\nDefendant contends that the trial court erred in denying his motion to suppress evidence obtained as a result of the arrest of 15-year-old Reverta May Austin because she was arrested without probable cause and pursuant to an unconstitutionally vague curfew ordinance.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e This contention is without merit.\n\n(a) Factual Background\n\nSubsequent to Scott's arrest, Gardena Police Officer Pierce learned that according to Nathaniel Tribet, the Chrysler's registered owner, defendant, not Scott, was \"supposed to be in possession of the vehicle.\" Officer Pierce also learned that defendant was a recent parolee. Defendant's parole agent, Ed Collins, informed Pierce that if it was true, or if he had reasonable cause to believe, that defendant had been with another parolee in a vehicle which contained weapons, then defendant was in violation of his parole, and Pierce had Collins's permission to arrest defendant. On August 3, Officer Pierce showed Officer Ard a photo spread, and Ard identified defendant as the driver of the Chrysler who had fled.\n\nShortly after 10 p.m. on August 3, Pierce received information that a person matching defendant's description was driving a newly painted white Cadillac in the Compton area. He was provided the license plate number. Pierce also had learned that a person in a white-over-green Cadillac had tried to use Hill's credit card at a gas station after his murder, and that defendant had been issued a citation in late May 1979 while driving a white-over-green vehicle with the same license plate number observed on the Cadillac that evening.\n\nPierce and his partner Officer William Moreno located defendant and stopped his vehicle. Defendant was accompanied by a female passenger, later determined to be 15-year-old Reverta Austin. Pierce ordered defendant and Austin out of the vehicle. He then arrested defendant for conspiracy to commit robbery and for being a parolee in the possession or presence of a firearm.\n\nThe officers were joined by two Torrance police officers, including Officer Paerels, who had been following the Cadillac until Pierce arrived. Paerels was investigating the Hill/Champion murders. He had previously learned the description of the Cadillac used at the gas station, and that Champion had been in possession of a gold rope chain at the time of her death. Paerels noticed that the Cadillac's body but not roof paint was \"bright and shiny.\" The passenger door was open, and he observed that \"the interior of the doorjambs was green as opposed to the white outside paint of the body.\" He also observed bloodstains on the vehicle headliner and a gold rope chain suspended from the rear-view mirror.\n\nOfficer Paerels asked the female passenger for identification. She had none. She claimed that her name was Betty Turner and that she was married to defendant. She then said she was not married, but had known defendant for two months. She gave various birthdates and corresponding ages that did not match. These inconsistencies and her youthful appearance led Paerels \"to believe that she was lying to me.\" It was approximately 10:35 p.m. He arrested her for a City of Los Angeles curfew violation. He knew that the vehicle was going to be impounded, and that Austin had no driver's license or other identification. She told him that \"she resided at a location far from where we were at and that she had no phone number at home.\" Officer Paerels thought it was \"an unacceptable alternative to release her in that area, for her own safety. But I wanted to arrest her in any event.\"\n\nOfficer Paerels also arrested her because he was not yet certain how many people were involved in the Torrance Airport murders. He was concerned that Reverta Austin could be an accomplice because she was in the presence of an ex-felon \"who had a very, very strong link\" to the murders, the gold chain he saw in the interior of the vehicle matched the description of an item taken from the female homicide victim, and there was blood on the headliner of the vehicle. In his conversation with Austin, she said that she had known defendant for two months, or for a time period that included the date of the murders. She also said that she had accompanied defendant when he had picked up the repainted car that day. Paerels thought that Austin might have further evidence, and that it was necessary to take her into custody to investigate the possibility. He could not search her on the street because they were in a public place. In addition, she had lied to Paerels about her name, age, and date of birth. \"All of these factors led me to the Conclusion that it was necessary to take her into custody on the charge of receiving stolen property.\"\n\nDuring a routine booking search of Austin at the police station, an officer witnessed Austin remove Champion's custom made gold ring with a green turquoise stone from her clothing. Austin testified at trial that defendant gave her the ring that night to hold, and said, \"The police is watching us,\" or \"following us.\" She put the ring in her bra. Defendant testified that he gave Austin the ring \"because I knew I was being followed and I knew where that ring had came from.\"\n\nThe trial court determined that Austin's arrest was lawful. The court stated that it found \"the officer's testimony . . . to be completely truthful,\" and based on the totality of the circumstances, denied the motion to suppress.\n\n(b) Analysis\n\nDefendant contends that the trial court erred in denying his motion to suppress the ring found on Austin and her statements obtained as a result of her unlawful arrest. In particular, defendant claims that Austin was arrested without probable cause to believe that she had received stolen property and pursuant to an unconstitutionally vague curfew ordinance. These contentions are without merit.\n\n\"A peace officer may arrest a person without a warrant 'whenever [the officer] has reasonable cause to believe that the person to be arrested has committed a felony, . . .'\" (People v. Talley (1967) 65 Cal. 2d 830, 835, 56 Cal. Rptr. 492, 423 P.2d 564; see former section 836, subdivision (3).) \"Cause to arrest exists when the facts known to the arresting officer would lead a person of ordinary care and prudence to entertain an honest and strong suspicion that the person arrested is guilty of a crime.\" (People v. Price 1 Cal. 4th 324, 410, 821 P.2d 610; People v. Terry (1970) 2 Cal. 3d 362, 393, 85 Cal. Rptr. 409, 466 P.2d 961.)\n\nHere, the facts were sufficient to warrant Officer Paerels to strongly suspect that Austin had either received stolen property or was an accomplice or accessory to murder. Paerels was not yet certain how many people were involved in the Torrance Airport murders. Austin was in the presence of, and indeed, at one point claimed to be married to, an ex-felon strongly linked to the murders, a gold chain in the interior of the vehicle matched the description of an item taken from the female victim, and there was blood on the headliner of the vehicle. Austin had known defendant for a period of time that included the date of the murders and had picked up the repainted Cadillac, which matched the description of the vehicle used at the gas station, with him that day. In addition, Paerels believed Austin had lied to him about her age and date of birth. Given all of these factors, Paerels had probable cause to arrest Austin.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e (Cf. People v. Martin (1973) 9 Cal. 3d 687, 695-696, 108 Cal. Rptr. 809, 511 P.2d 1161; compare People v. Williams (1970) 9 Cal. App. 3d 565, 567-568, 88 Cal. Rptr. 349 [no evidence that officer had any conversation with defendant passenger in stolen car or knew anything of relationship between driver and passenger].)\n\nIn sum, we conclude that the trial court properly denied defendant's motion to suppress the ring and Austin's statements linking defendant to the ring adduced as a result of Austin's arrest.\n\nd. Trial Court's Failure to Rearraign\n\nDefendant contends that the trial court committed reversible error in failing to rearraign him on the original charges from his first trial, which were recharged upon retrial. This contention is meritless.\n\nIn the original information, defendant was charged with two counts of first degree murder (counts I and II), two counts of robbery (counts III and IV), and grand theft auto (count V). Firearm-use allegations were alleged as to counts I-IV. Robbery-murder and multiple-murder special circumstances were alleged.\n\nUpon reversal of defendant's conviction at the first trial, he was returned to the superior court for retrial. On March 20, 1987, the prosecution filed an amendment to the information alleging three prior convictions: receiving stolen property, burglary, and attempted robbery. Defendant was rearraigned on the convictions alleged in the amendment, waived further reading of the amendment and any statement of rights with respect to it, and personally denied the prior conviction allegations. Defendant did not object to the failure to rearraign him on the original information. Rather, he proceeded to trial as if his original plea of not guilty to these charges had been reentered. At trial, he waived a formal reading of the information.\n\n\"The purpose of an arraignment or a rearraignment is to inform the accused of the charge against him and to give him fairly the opportunity to plead to it . . . . If the defendant pleads to the basic charge, and a trial is had on it, the purpose of an arraignment has been served.\" (In re Mitchell (1961) 56 Cal. 2d 667, 670, 16 Cal. Rptr. 281, 365 P.2d 177.) Defendant cites no authority requiring rearraignment on the original charges as well as newly alleged prior convictions before a retrial. \"Nor do we perceive any logical or practical necessity for such a procedure.\" (People v. Tahtinen (1958) 50 Cal. 2d 127, 135, 323 P.2d 442 [defendant \"cites no authority requiring rearraignment after a mistrial\"].) The record in this case reveals that defendant clearly understood the charges against him on which he had successfully obtained a retrial, and was prepared to vigorously defend against those charges.\n\nIn any event, by not objecting below, defendant has waived the right to assert error on appeal with respect to the failure to rearraign. (See People v. Murphy (1963) 59 Cal. 2d 818, 828, fn. 3, 31 Cal. Rptr. 306, 382 P.2d 346 [defendants' substantial rights suffered no detriment when they made no demand for arraignment on amended information or objection for failure to so arraign, and went to trial impliedly on their prior pleas of not guilty]; People v. Collins (1963) 217 Cal. App. 2d 310, 313, 31 Cal. Rptr. 587; People v. Walker (1959) 170 Cal. App. 2d 159, 164-165, 338 P.2d 536.)\n\nDefendant asserts that the failure to rearraign was prejudicial because eight years had passed since defendant had been informed of his constitutional rights and the charges against him, and he should not be presumed to have understood in 1987 the charges against him and his rights in light of Dr. Maloney's testimony regarding his low intelligence and learning deficiencies. Because we have found no error in failing to rearraign, we need not address defendant's claim of prejudice. We note, however, that defendant's claim is purely speculative. Dr. Maloney did not testify, and defendant does not claim, that he did not, in fact, understand the charges against him or his rights at the retrial. His defense, including his own testimony at retrial, would belie such a claim.\n\n2. Trial Issues\n\na. Admissibility of Vincent's Testimony\n\n1) Factual Background\n\nDefendant contends that the trial court erred in permitting jailhouse informant Armand Vincent to testify regarding Scott's statements in a conversation with defendant, during which defendant admitted shooting both victims. Defendant does not contend that his own statements were inadmissible. We conclude that Scott's statements were not hearsay and were relevant to the issue of who actually shot the victims.\n\nPrior to Vincent's challenged testimony before the jury, the trial court examined a transcript of Vincent's police interview. After hearing argument, the trial court ruled that defendant's statements, as recounted by Vincent, were admissible under Evidence Code sections 1220 and 352, and that Scott's statements were admissible to give context and meaning to defendant's statements.\n\nBefore the jury, Vincent testified that on August 13, 1979, he rode on a county jail bus with defendant and Scott to and from the Torrance courthouse. Vincent was charged with misdemeanor violations of performing home repair and remodeling without a contractor's license. Defendant was handcuffed to Vincent, and Scott was seated across from Vincent. Scott was separated from defendant and Vincent by a wire screen.\n\nDuring the trip, defendant and Scott discussed the Torrance Airport murders. Scott began the conversation by saying, \"I'm in jail for a double murder that I knew nothing about. This is cold.\" Scott said, \"I thought that we were out just to do a little robbery at the Torrance Airport.\" \"I didn't have any idea we were going to kill anyone.\" Turner responded, \"Well, you know, man, dead witnesses don't talk.\"\n\nScott said, \"We had them tied up. . . . I am out in the car thinking that everything is . . . cool . . .Why did you do it?\" Defendant apparently repeated his response.\n\nScott asked, \"How did you do it?\" Defendant said, \"I killed the man and then the woman.\" He pointed his left index finger at his temple and said he shot them. Defendant said there were two shots. He also said that the victims were tied with their hands behind their back. Defendant never denied killing the victims.\n\nScott said, \"You left the gun in my car and my fingerprints are all over it.\" Defendant said, \"Well, you should have got rid of it.\" Defendant laughed and said, \"you take the rap for it, man.\"\n\nWith regard to Hill's gasoline credit card, Scott said, \"Why didn't you get rid of the card? Why did you use the credit card?\" Defendant responded, \"I thought it would be cool to use the card. I thought I had enough time because we had changed license plates on the car.\"\n\nDefendant threatened Vincent that \"You heard this conversation. You keep your mouth shut or you'll be dead.\" Vincent and Scott subsequently shared a cell.\n\nAfter Vincent testified, the trial court instructed the jury that they were to consider the statements attributed to Scott \"only to the extent that they give meaning to the statements of [defendant]. The statements of [Scott] are not to be considered for the truth of the matter asserted . . . you are the sole Judges as to whether [defendant] made the statements testified to and whether such statements are true in whole or in part.\" At the Conclusion of the guilt phase, the jury was further instructed that they were not to consider evidence admitted for any purpose except the purpose for which it was admitted. (CALJIC No. 2.09.) The jury was also instructed on admissions and confessions pursuant to CALJIC No. 2.70 (1980 rev.) and on admissions pursuant to CALJIC No. 2.71 (1980 rev.).\n\n2) Analysis\n\nDefendant asserts that Scott's statements were inadmissible hearsay, resulting in prejudice. As noted earlier, he does not assert that his own statements were improperly admitted. We conclude the trial court properly admitted Scott's statements to give meaning to defendant's statements admitted under Evidence Code section 1220,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and that allowing these statements for this limited purpose was within the trial court's discretion under Evidence Code section 352.\n\nAn out-of-court-statement is properly admitted if a nonhearsay purpose for admitting the statement is identified, and the nonhearsay purpose is relevant to an issue in dispute. (People v. Armendariz (1984) 37 Cal. 3d 573, 585, 209 Cal. Rptr. 664, 693 P.2d 243; People v. Bunyard (1988) 45 Cal. 3d 1189, 1204-1205, 249 Cal. Rptr. 71, 756 P.2d 795; see People v. Scalzi (1981) 126 Cal. App. 3d 901, 907, 179 Cal. Rptr. 61 [\"'one important category of nonhearsay evidence ] evidence of a declarant's statement that is offered to prove that the statement imparted certain information to the hearer and that the hearer, believing such information to be true, acted in conformity with that belief. The statement is not hearsay, since it is the hearer's reaction to the statement that is the relevant fact sought to be proved, not the truth of the matter asserted in the statement.'\"]\n\nHere, Scott's identification of the location of the robberies and murders as the Torrance Airport, and inquiries regarding why and how defendant shot the victims, gave context to defendant's statements and tethered them to the crimes at issue in this case. Defendant disagrees, arguing that \"recitation of [Scott's] statements was totally unnecessary to 'give meaning'\" to defendant's responses, and that the \"only effect of admission of Scott's statements was to provide the jury with the claim . . . that Scott 'didn't have any idea we were going to kill anyone.'\"\n\nHowever, standing alone, defendant's statements, \"Well, you know, man, dead witnesses don't talk,\" \"I killed the man and then the woman,\" that he had killed them with two shots, and that the victims were tied with their hands behind their back, and his gesture of putting his index finger to his temple and saying he shot them, referred simply to a shooting, not necessarily the shooting at issue in this case. Moreover, the jury was repeatedly instructed that they were not to consider Scott's statements for the truth of the matter asserted, but merely to give context to defendant's statements. We presume that the jury followed the court's instructions. (People v. Delgado (1993) 5 Cal. 4th 312, 331, 851 P.2d 811; People v. Mickey (1991) 54 Cal. 3d 612, 689, fn. 17, 286 Cal. Rptr. 801, 818 P.2d 84.) Finally, defense counsel was not precluded from arguing that Scott's public statements on the bus were entirely calculated and self-serving, and did in fact argue that Vincent fabricated the conversation on the basis of information deliberately relayed to Vincent by Scott when the two shared a jail cell.\n\nIn addition, Scott's statements were relevant to a central issue in this case, that is, the identification of the actual shooter. Accordingly, we conclude that Scott's statements were not hearsay and were relevant. We further conclude that the value of Scott's statements to give meaning to defendant's admissions substantially outweighed any probability of undue prejudice, or danger of confusing or misleading the jury.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nDefendant further contends that the admission of Scott's statements violated his Sixth Amendment right of confrontation under the United States Constitution. We have repeatedly rejected such an argument in the context of adoptive admissions on the ground that \"once the defendant has expressly or impliedly adopted the statements of another, the statements become his own admissions, and are admissible on that basis as a well-recognized exception to the hearsay rule.\" (People v. Silva (1988) 45 Cal. 3d 604, 624, 247 Cal. Rptr. 573, 754 P.2d 1070, italics in original; People v. Preston (1973) 9 Cal. 3d 308, 315-316, 107 Cal. Rptr. 300, 508 P.2d 300.) \"Being deemed the defendant's own admissions, we are no longer concerned with the veracity or credibility of the original declarant. Accordingly, no confrontation right is impinged when those statements are admitted as adoptive admissions without providing for cross-examination of the declarant.\" (People v. Silva, supra, 45 Cal. 3d at p. 624.) As we stated in People v. Preston, supra, \"We find no merit in the contention that the admission of this evidence [adoptive admissions] impaired defendant's Sixth Amendment right to confrontation, and to cross-examination of his accuser. The evidence was admitted not to prove the truth of the statements but to show defendant's response to them. Credibility of the witnesses who testified that they heard these accusations and observed defendant's response, and the weight to be given to their testimony were in issue and they were cross-examined on voir dire and before the jury.\" (People v. Preston, supra, 9 Cal. 3d at pp. 315-316.)\n\nWe find this reasoning persuasive in concluding that admission of Scott's statements similarly did not violate defendant's Sixth Amendment rights. Scott's statements were not admitted for the truth of the matter asserted, or as substantive evidence of defendant's admissions, but merely were nonhearsay that gave context to those admissions. Thus, only the credibility of the witness who testified that he heard these statements and defendant's response thereto was at issue.\n\nb. Prosecutor's Argument Regarding Scott's Statements\n\nDefendant contends that the prosecutor improperly argued to the jury that Scott's statements, as testified to by Vincent, were substantive evidence of defendant's intent to kill. In particular, defendant challenges Martin's opening argument in which the prosecutor argued that defendant's cocking the gun demonstrated he had the intent to shoot and to kill. Martin observed that the victims had already been tied up and said, \"So why cock the gun at this point? . . . Clearly this action by the defendant showed his intent to shoot and to kill. . . . When you pull that hammer back, you've done one-half of the shooting already. You don't have to have it pull and have it physically pull back and go forward. You've got it already cocked and you just touch it. (Indicating) I suggest that's exactly why the gun was cocked by the defendant. And it was consistent with what Scott said in his question on the bus. 'We had them tied up. Why did you have to kill them?' And the defendant said, 'Well, dead witnesses don't talk.'\" In his closing argument to the jury, Martin responded to defense counsel's summation regarding how the prison bus conversation began by reading from Vincent's testimony. \"Mr. Scott said to Mr. Turner, 'I'm in jail for a double murder that I know nothing about. This is cold. . . .I had no idea.. . . I thought we were out to do a little robbery. I didn't have any idea we were going to kill anyone.'\" Vincent testified that defendant responded, \"'Well, you know, . . . man, dead witnesses don't talk.'\"\n\nWe reject defendant's claims at the outset because he \"failed to satisfy the general rule requiring assignment of misconduct and request for admonition as to any of the comments by the prosecutor of which he now complains,\" and no exception is applicable. (People v. Berryman (1993) 6 Cal. 4th 1048, 1072, 864 P.2d 40.) Contrary to defendant's claim that \"simply no tactical basis . . . may be imagined for the failure to object under these circumstances\" and that accordingly \"the failure to object must be deemed to constitute ineffective representation by defense counsel,\" counsel may well have concluded that the jury would not construe the statements as argument that Scott's statements were substantive evidence of defendant's intent to kill, and thus determined that no objection was necessary.\n\nWe also reject defendant's claims on the merits. Martin's argument did not present Scott's statements alone as substantive evidence of defendant's intent to kill. Rather, the prosecutor argued that the accusation, as responded to by defendant, was indicative of such intent. This was consistent with the trial court's limitation of using Scott's statements solely to give meaning to the defendant's responses. There was no danger that the jury was confused or misled by the prosecutor's argument into believing that Scott's statements were substantive evidence of defendant's intent to kill. (See People v. Clair, supra, 2 Cal. 4th at pp. 686-687.) Indeed, as we have noted above, the jury was specifically and repeatedly admonished not to use Scott's statements for this purpose. Moreover, it was also instructed that statements made by attorneys were not evidence.\n\nDefendant further contends that the trial court erred in refusing to give a proposed instruction \"that might possibly have cured some of the prejudicial effects of Scott's statements.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The trial court concluded that this instruction was adequately addressed by instructions already given. Defendant asserts no reason why this ruling was erroneous, and none is apparent.\n\nc. Prosecutor's Inconsistent Arguments\n\nDefendant contends that the prosecutor committed prejudicial error by making a closing argument at his trial regarding codefendant Scott's intent to kill that was inconsistent with the argument he made at Scott's trial. In particular, defendant asserts that at Scott's trial, Martin argued that both Scott and defendant intended to kill the victims, whereas at defendant's trial, Martin argued that only defendant intended to kill the victims. According to defendant, such a position at defendant's trial allowed Martin to argue the substance of Scott's statements, as recounted by Vincent (see ante, part II.A.2.a.), that he had no idea defendant was going to kill the victims.\n\nAccording to defendant, Martin's closing argument in Scott's case was not transcribed. Rather, defendant infers from Martin's response to \"a defense motion concerning absence of evidence that Scott intentionally aided and abetted the murders\" that the prosecutor made such a closing argument.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAccording to defendant, Martin argued that \"'there was a great deal of evidence as to the subjective and objective intent that meets the requirement of the instructions which His Honor has approved to be given. We would certainly say it is a gross misstatement of both the facts and the argument to make the statements that [defense counsel] has, that there's no evidence to support the intent to aid and abet.'\" Defendant contrasts this argument with Martin's statements in closing argument at defendant's trial, which was subsequent to Scott's trial, in which Martin recounted defendant's statement that it was Scott's idea to tie up the victims. Martin argued, \"Scott clearly wanted to escape. That was the reason for tying the victims. But not to kill them. . . . It may well be that Scott wanted to tie the victims. But only to escape.\"\n\nDefendant asserts that these \"inconsistent\" arguments were prosecutorial misconduct because they violated the doctrine of judicial estoppel and various Rules of Professional Conduct. We reject defendant's claim at the outset because he \"failed to satisfy the general rule requiring assignment of misconduct and request for admonition as to any of the comments by the prosecutor of which he now complains,\" and no exception is applicable. (People v. Berryman, supra, 6 Cal. 4th at p. 1072.)\n\nWe also reject defendant's claims on the merits. Even assuming defendant's claim of inconsistency is properly premised on an inference drawn from a motion hearing in another case, any such error was not prejudicial. First, defendant's assertion that Martin's alleged misconduct allowed Martin to argue the substance of Scott's statements that he had no idea defendant was going to kill the victims is not demonstrated by the portion of the record on which defendant relies. Rather, in the quoted statements from this trial, the prosecutor is extrapolating from defendant's testimony that it was Scott's idea to tie up the victims. In any event, we have already concluded above that Martin did not argue that Scott's statements were substantive evidence of defendant's intent to kill.\n\nMoreover, to the extent defendant relies on these statements to show that Martin argued in this case that Scott lacked intent to kill, his claim of prejudicial misconduct remains unpersuasive. The record in this case reveals that the prosecutor's argument fairly reflected the evidence insofar as it related to defendant's culpability for the crimes. Moreover, according to defendant, Martin asserted in both trials that defendant was the actual killer, and that Scott was an aider and abettor. Accordingly, it is not reasonably probable that a result more favorable to defendant would have been reached in the absence of any alleged misconduct, or argument that Scott lacked intent to kill. (People v. Watson (1956) 46 Cal. 2d 818, 836, 299 P.2d 243.)\n\nd. Dr. Maloney's Proposed Testimony\n\nDefendant contends the trial court erred in excluding at the guilt phase testimony by Dr. Michael Paul Maloney, a clinical and forensic psychologist, that defendant was a \"follower\" and therefore less likely to have been the shooter. This contention is without merit.\n\nDr. Maloney testified that in November 1979, he interviewed defendant and subjected him to a series of tests. During a subsequent hearing conducted outside the presence of the jury, Dr. Maloney stated that these tests included a Wechsler Adult Intelligence Scale, a wide-range achievement test, an \"Amens\" picture vocabulary test, and a Bender Gestalt test. He concluded that defendant's intelligence quotient was 81, but that there was a fair amount of variability in his performance and that his native ability was probably normal. Defendant was deficient in his verbal expression, and had certain deficits in his education and experience.\n\nDr. Maloney caused these tests to be readministered to defendant in August 1987, and Dr. Maloney reinterviewed defendant in September 1987. The results were in the same general range. At no time in examining defendant did Dr. Maloney form the opinion that he suffered from either a mental illness other than a \"possible personality disorder.\" Dr. Maloney also testified that defendant did not have a \"mental defect\" or a \"primary mental disorder.\"\n\nThe trial court excluded the testimony on the grounds that it was not relevant, and that even if it was found to have some relevance, \"its probative value [was] substantially outweighed by the probability that its admission [would] necessitate undue consumption of time or create substantial danger of undue prejudice, of confusing the issues or of misleading the jury.\"\n\nAs a preliminary matter, our review of the above record reveals no testimony by Dr. Maloney at the hearing that defendant was generally a follower and therefore less likely to have been the shooter. Rather, defendant appears to loosely infer such a Conclusion from Dr. Maloney's statements regarding defendant's test results. More importantly, Dr. Maloney did not assert any opinion as to whether defendant had been a follower on the night of the murders, and what effect such a behavioral characteristic would have had on his ability to pull a trigger. As such, Dr. Maloney's testimony on voir dire failed to support the hypothesis defendant advanced.\n\nThe trial court therefore acted within its discretion in excluding the evidence as irrelevant under Evidence Code section 350, and in concluding in the alternative that any probative value was substantially outweighed by the probability that its admission would necessitate undue consumption of time, and create substantial danger of undue prejudice, confusing the issues, or of misleading the jury under Evidence Code section 352.\n\ne. Torrance Airport Taping Experiment\n\nDefendant contends that the trial court prejudicially erred in admitting evidence of a Torrance Airport taping experiment because of a lack of proper foundation for its admission, and that this error requires reversal of both the guilt and the penalty judgments. This contention is meritless.\n\n1) Factual Background\n\nAt the time of the murders, the Torrance Airport had recently installed an aircraft noise monitoring system that included microphones at various locations in and around the airport. The system was operational 24 hours a day. After the discovery of the victims, police ascertained that the July 11 tape contained two sharp noises, consistent with gun shots, approximately three seconds apart, made at approximately 11:16 p.m. The two sounds were picked up by microphones 6 and 11, the two microphones closest to the hangar where the victims were discovered, and not by more distant microphones.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The police and airport personnel subsequently performed a sound experiment in the hangar that was recorded on the noise monitoring system.\n\nA hearing on the admissibility of both the original and experimental tapes was held outside the presence of the jury. Jack Zimmerman, an expert on acoustical analysis, testified that he was instrumental in the design, development, and installation of the noise monitoring system. The system was installed at the Torrance Airport in May and June of 1979. At that time, the system was calibrated and test run to ensure it was operating properly. No instances of malfunction were found.\n\nEleven microphones reproduced sounds from various sites in and around the airport that were recorded on separate channels to a dictaphone tape recorder. Other channels on the recording were assigned to time-code and various aircraft radio frequencies. Each tape lasted approximately 25 hours. The system was accepted by the City of Torrance.\n\nAfter the victims were discovered, Charles Nay, the Torrance Airport noise abatement officer and noise specialist, listened to twelve hours of the July 11 and July 12 tapes. As a result of what he heard, he turned the July 11 tape over to the police.\n\nOn July 19, 1979, between 11:00 and 11:30 p.m., Officer Green, with Nay's assistance, performed an experiment in the hangar at the same location where the victims were discovered. Officer Green caused a .38-caliber gun to be fired eight times at close range into a mass of clay that had a bullet-proof vest as a backstop. Because the type of ammunition used in the murders was at that time uncertain, Officer Green used different types of bullets for the different shots. Some test shots were fired with the hangar door open, and in others it was closed.\n\nAnthony Pellicano, president of Forensic Audio Laboratory Limited, listened to both the original July 11 recording and the July 19 test recording. Pellicano had performed an audio examination and analysis of the tapes that recorded the assassination of President Kennedy, an analysis of the President Nixon tapes containing the infamous gap, and an analysis of the tapes used in the DeLorean case. He had been qualified to testify as an expert in federal and state court approximately 100 times. He was chairperson of the voice identification and audiotape examiners committee for the National Forensic Center. He was also a member of the Acoustical Society of America and had been involved with audiotape analysis and examinations for over 16 years.\n\nAll eight of the test shots were picked up by microphones 6 and 11, and not clearly by any other microphone. Pellicano aurally compared the sounds of the test shots with the sounds on the original recording. Pellicano also examined the information through \"an array of different algorithms with the computer and spectrum analyzer and other electronic devices\" and \"displayed them so you could graphically see an impulse.\" He compared the July 11 renderings to the renderings from the known shots and found that the impulses correlated. He determined that the impulses on the two different tapes appeared to be the same, that they emanated from approximately the same place, and that they \"appeared to be the results of gunshots and sounds from gunshots.\"\n\nDefendant argued that the July 11 tape lacked foundation and would cause the jury to speculate as to the identity of the sounds it contained. He objected to the July 19 tape and apparently Pellicano's graphic representation of the sounds on that tape on the grounds that the experiment was not conducted under circumstances sufficiently similar to those on July 11, the experiment should have included a variety of sounds, not merely gunshots, and Officer Green was not qualified to conduct the experiment.\n\nThe trial court ruled that the jury could hear both the July 11 and the July 19 tapes. With regard to the July 11 tape, the court found that the jury would not be speculating, but would be listening to sounds picked up by a sound recording system that was \"extremely efficient, effective, and reliable,\" and that the tape was relevant to the issue of \"the length of time between the shots,\" and \"what [the jury] believes caused those sounds.\" The court also on its own motion allowed the tape under Evidence Code section 352.\n\nAs for the July 19 tape, the court concluded that \"the experiment was properly conducted, had numerous touchstones of similarity between the evidence [before the court] with reference to the killings . . . to cause me to find that it's evidence that should go before the jury.\" In particular, the court observed that the evidence indicated that the victims were killed by contact wounds to the head at approximately 11 p.m. on July 11 at a particular location within the hangar. Likewise, the experiment was conducted at the same location within the hangar that the victims were discovered, at approximately the same time at night, the gun used was a .38-caliber revolver of the same barrel length as the murder weapon, the gun was placed in contact with or at most a 32nd or 16th of an inch away from the clay model, and the bullets \"were as close as the experimenters could come to the bullets that were . . . apparently used in the killings.\" On its own motion, the court also allowed the experiment evidence under Evidence Code section 352. The court also allowed use of Pellicano's graphic representations of the sounds on the July 11 tape and five of the shots on the July 19 tape on the ground that these graphs would also assist the jury in determining whether the sounds on the two tapes \"were made by similar impulse-causing devices.\"\n\nAt trial, Jack Zimmerman, Anthony Pellicano, and Charles Nay testified regarding the July 11 and July 19 tapes. Both tapes were played for the jury, and Pellicano's computer graphic representations of the sounds on these tapes and his time-comparison chart were introduced. Pellicano testified in part that the impulses on the July 11 tape were consistent with gunshots, and that the difference between the two sounds was \"3.0754 seconds.\" Defendant subsequently testified that the gunshots he heard as he was running toward his car on the night of the murders were about as far apart as the sounds on the July 11 tape.\n\n2) Analysis\n\nAs noted above, on appeal defendant challenges the admission the July 19 tape on the ground that it lacked foundation. The governing law is settled. \"The proponent of experimental evidence bears the burden of production and proof on the question whether such evidence rests on an adequate foundation.\" (People v. Bonin (1989) 47 Cal. 3d 808, 847, 254 Cal. Rptr. 298, 765 P.2d 460.) Admission of such evidence depends upon proof of the following foundational items: (1) The experiment must be relevant; (2) it must have been conducted under at least substantially similar, although not necessarily absolutely identical, conditions as those of the actual occurrence; (3) the qualifications of the individual testifying concerning the experimentation must be demonstrated with some particularity; and (4) evidence of the experiment will not consume undue time, confuse the issues, or mislead the jury. (Ibid.)\n\nWe conclude that the trial court properly determined that these foundational items were satisfied here. First, the experimental evidence was relevant to assist the jury in determining what the two sharp sounds on the July 11 tape were by allowing them the opportunity to compare the sounds with what were known to be actual .38-caliber gunshots. Identification of the sounds as gunshots undermined defendant's August 7 statements regarding the timing and circumstances of the murders, and supported the inference that there was only time for one person to fire both shots.\n\nSecond, the experiment was performed under substantially similar conditions as the actual occurrence. It was performed at the same location as the murders, at approximately the same time, using the same caliber gun and similar ammunition, and the same recording equipment.\n\nThird, Pellicano's qualifications in this area were well established. Finally, evidence of the experiment did not consume undue time, and assisted, not confused or misled, the jury.\n\nDefendant asserts, however, that the second criteria of substantial similarity was not satisfied. In particular, defendant argues that because it is not definitively known what caused the sounds on the July 11 tape, it is impossible to conduct an experiment under conditions similar to the actual occurrence. Of course, if it was definitively known what caused the sounds on the July 11 tape, the experiment would have been unnecessary. The purpose of the experiment was to assist the jury in making this factual determination by allowing them to compare the actual firing of a .38-caliber gun with the sounds on the July 11 tape. Contrary to defendant's assertion, the experiment was not rendered inadmissible because it could not conclusively \"prove\" that the July 11 sounds were gunshots.\n\nDefendant also argues that the experimental evidence was inadmissible and prejudicially misled the jury because it contained only the sound of a .38-caliber gun firing, not a car backfiring or a tire blowing out or a firecracker. However, the addition of such other sounds for the jury's comparison would do little to affect whether the circumstances under which the experiment was performed were substantially similar to those existing at the time of the murders, and was unnecessary to satisfy the prosecutor's burden of proof on this criterion. Moreover, defendant did not seek to introduce his own experimental evidence containing such other sounds. Finally, Officer Green subsequently conceded in front of the jury that there had been no \"testing to see if a firecracker or a hammer on metal or the closing of a hangar door or backfires [sic] of a car or anything of that nature would have made a sound on the monitoring system.\"\n\nf. Admission of Prior Convictions\n\nDefendant contends that the trial court failed to properly exercise its discretion in admitting defendant's prior convictions for receiving stolen property and second degree burglary. This claim is without merit.\n\nPrior to his trial testimony, defendant moved to exclude for purposes of impeachment his 1974 conviction for receiving stolen property, 1976 conviction for second degree burglary, and 1976 conviction for attempted robbery. Because defendant's crimes occurred prior to the adoption of Proposition 8 in June 1982, the parties and the trial court agreed that the governing law was People v. Beagle (1972) 6 Cal. 3d 441, 99 Cal. Rptr. 313, 492 P.2d 1, not People v. Castro (1985) 38 Cal. 3d 301, 211 Cal. Rptr. 719, 696 P.2d 111.\n\nThe trial court admitted the receipt of stolen property and burglary convictions for purposes of impeachment under Evidence Code sections 352 and 788. It excluded evidence of the attempted robbery conviction because it involved conduct substantially similar to that charged in the present case. In determining that the offenses were not too remote in time, the court used the date of either the first trial or of the Hill/Champion murders.\n\nDefendant asserts that the two prior convictions used to impeach him were too remote in time to be admissible. (See People v. Beagle, supra, 6 Cal. 3d at p. 453.) By his calculation, the convictions occurred either 10 and 11 or 12 and 13 years respectively before the 1987 retrial. He asserts that \"Beagle clearly indicates that the question of remoteness is to be determined by the length of time between the conviction and the date of testimony.\" Because defendant did not testify at the original trial, defendant contends the time period extends to the 1987 trial.\n\nBeagle in fact contains no such indication. Rather, it states that a conviction that \"'occurred long before and [which] has been followed by a legally blameless life, should generally be excluded on the ground of remoteness.'\" (People v. Beagle, supra, 6 Cal. 3d at p. 453.) We are hesitant to characterize defendant's diminished ability to commit crimes because of his imprisonment for all but several months from 1976 until the 1987 retrial as a \"legally blameless life.\" (See People v. Massey (1987) 192 Cal. App. 3d 819, 825, 237 Cal. Rptr. 734 [defendant apparently led \"legally blameless life\" because he was incarcerated for most of the relevant time].) Thus, even assuming, without deciding, that the appropriate time period is from the dates of the convictions until the 1987 retrial, and not the 1980 original trial as the trial court apparently ruled, we would still conclude that the trial court acted within its discretion in finding that the convictions were not too remote. (See People v. McFarland (1980) 108 Cal. App. 3d 211, 215-216, 166 Cal. Rptr. 429 [upholding admission of 7- and 9-year old convictions]; People v. Benton (1979) 100 Cal. App. 3d 92, 97, 161 Cal. Rptr. 12 [sustaining use of conviction at least 11-years-old].)\n\nDefendant also asserts that \"since [defendant's] credibility vis--vis Scott was a critical issue in the case, and since Scott's statements implicating Turner as the shooter were admitted without any opportunity for the defense to impeach Scott, the jury may likely have accorded Scott greater credibility than Turner on that critical issue.\" We are at a loss to discern how this assertion relates to the admissibility of defendant's prior convictions. To the extent defendant is arguing that their admission was unfair because defendant did not have an opportunity to impeach Scott with his prior convictions, we reject the argument. Defendant's prior convictions were admissible for impeachment solely because he elected to testify. As we stated in Beagle, \"We do not . . . encourage or countenance a form of blackmail by defendants. No witness including a defendant who elects to testify in his own behalf is entitled to a false aura of veracity.\" (People v. Beagle, supra, 6 Cal. 3d at p. 453.) Nor is there is any evidence that when defendant elected to testify, he was operating under the mistaken impression that Scott would be testifying and subject to impeachment.\n\nDefendant also argues that admission of the prior convictions was cumulative to evidence of defendant's criminal record already adduced during the trial. Defendant did not make this argument below, and it is therefore waived. On the merits, we conclude that evidence of the convictions was not cumulative to less specific references on which defendant relies that defendant had been on parole from the California Youth Authority, that he had been in prison with Scott, and that he had had several contacts with Officer Barger-Collins as a result of criminal activity.\n\nIn sum, we conclude that the trial court acted within its discretion in admitting for purposes of impeachment evidence of defendant's prior convictions.\n\ng. Instructional Error\n\n(1) Flight after Commission of a Crime\n\nDefendant contends the trial court committed prejudicial error by instructing the jury on flight because defendant's flight on July 31 did not occur immediately after the crime or immediately after being accused of the crime, and the identity of the perpetrator was at that time unresolved. We rejected an identical claim in People v. Mason (1991) 52 Cal. 3d 909, 277 Cal. Rptr. 166, 802 P.2d 950, and defendant asserts no reason for us to revisit the issue. (Id. at pp. 941-943; see also People v. Pensinger (1991) 52 Cal. 3d 1210, 1245, 278 Cal. Rptr. 640, 805 P.2d 899.)\n\n(2) Jailhouse Informant Testimony\n\nDefendant contends the trial court erred in failing to sua sponte instruct that the jury should view Armand Vincent's testimony with caution because the testimony of a jailhouse informant is inherently unreliable. Defendant acknowledges this court's contrary authority in People v. Pensinger, supra, 52 Cal. 3d at p. 1250, fn. 13, and asserts no reason for us to revisit the issue.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Moreover, defendant had ample opportunity to challenge Vincent's credibility, and did in fact strenuously challenge his memory and motive for coming forward.\n\n(3) Consciousness of Guilt by False Statements\n\nDefendant claims that he was prejudiced by the trial court's giving of CALJIC No. 2.03 concerning consciousness of guilt shown by willfully false statements because this instruction \"overemphasized credibility problems with [defendant's] testimony, although there were serious credibility problems with the testimony of several prosecution witnesses.\" Defendant asserts that the trial court should have only given CALJIC No. 2.21 regarding the right of the jury to reject all of the testimony of any witness who is willfully false in a material part of his or her testimony. Defendant also asserts that the trial court improperly refused to give a curative instruction requested by defendant. These contentions are without merit.\n\nThe jury was instructed in the language of CALJIC No. 2.03 (1984 rev.) as follows: \"If you find that before this trial the defendant made willfully false or deliberately misleading statements concerning the charge upon which he is now being tried, you may consider such statements as a circumstance tending to prove a consciousness of guilt, but it is not sufficient of itself to prove guilt. The weight to be given to such a circumstance and its significance, if any, are matters for your determination.\" Of course, this instruction has nothing to do with a defendant's trial testimony, but rather focuses on defendant's pretrial statements. Thus, defendant's contention that the instruction improperly highlights credibility problems revealed in his trial testimony is unfounded.\n\nMoreover, \"We have repeatedly upheld this instruction when based upon evidence.\" (People v. Kelly (1992) 1 Cal. 4th 495, 531, 822 P.2d 385.) Defendant does not assert that such evidence was lacking here. Indeed, in his trial testimony, defendant expressly stated certain portions of his August 7, 1979 statement were false. We conclude there was no error in giving the instruction.\n\nDefendant further asserts that the trial court improperly refused to give a \"possibly\" curative instruction requested by defendant.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The trial court refused to give the instruction on the ground that its content was \"covered more accurately and adequately by the present CALJIC instructions.\" A trial court may properly refuse to give requested instructions when they are either erroneous or repetitive of other instructions already given. Defendant asserts no reason why the trial court's Conclusion was erroneous, and none is apparent.\n\n(4) Proposed Reasonable Doubt Instruction\n\nThe trial court gave the standard CALJIC No. 2.90 jury instruction on reasonable doubt. Defendant proposed the following instruction, which the trial court refused: \"An abiding conviction is a belief with staying power. Even absolute positivism, if it wanes after some undetermined and undeterminable [sic] time, is insufficient. Therefore, not just any kind of conviction will dispel a reasonable doubt, it must be the abiding kind only.\" Defendant asserts that \"such an instruction should be given whenever requested by a defendant,\" and particularly in cases involving \"potential capital punishment and credibility issues.\"\n\nWe have, however, on numerous occasions, determined that CALJIC No. 2.90 is \"a constitutionally sound description of reasonable doubt,\" and that \"no additional instructions on reasonable doubt [are] necessary.\" (People v. Morris, supra, 53 Cal. 3d at p. 214; see Victor v. Nebraska (1994) __ U.S. __, __ [114 S. Ct. 1239, 1243, 1251].) We conclude that the jury was adequately instructed on this issue.\n\nB. Penalty Phase\n\n1. Juror Turner\n\nDefendant contends that the trial court erred in refusing his request to remove Juror Barry Turner when Turner's employer informed the court that he would not be paid for the remainder of his jury service. We conclude that the trial court properly exercised its discretion in keeping this juror on the jury.\n\nOn or about September 18, 1987, the court was sent a note from Juror Nine which read as follows: \"Judge McKee [P] Is there any way you can call my employer (Hughes Aircraft Co.) so that I may get an extension for my jury service? [P] The Current Policy is for the company to pay for 22 days[;] I have exceeded this by 3 days thus far. [P] Any help you can provide in this matter will greatly be appreciated. [P] Thank you Very Much. [P] Juror # 9 [P] Barry R. Turner.\"\n\nSubsequent inquiries by the court, not objected to by counsel, revealed that no extension would be granted by Hughes. After hearing argument from counsel, the court questioned Juror Turner without revealing his employer's response. The following colloquy occurred: \"Sir, you have sent a number of days ago a letter with regard to Hughes Aircraft and their policy with regard to jury service? . . . Let me ask you this, sir. With regard to that letter, would the outcome of my inquiry ] let's say it went one way or the other. If it went ] depending on the outcome, would the outcome affect your ability to serve as a fair and impartial juror in this matter at all?\" Turner responded, \"No, it would not.\" The court then asked, \"If they tell me that there is no extension or if they tell me there is an extension, would any of those types of responses affect your ability to serve as a fair and impartial juror in this matter.\" Turner responded, \"No, they would not.\" The court then asked, \"Would either of those responses cause you in any way to rush to any kind of decision in this matter?\" Turner responded again, \"No, they would not.\" There was no inquiry by counsel.\n\nThe court then ruled that \"Based upon my questions of the juror and observations of him during his answers to the questions, I find that he answered to me honestly and truthfully and knowingly. And that he would continue to stay as a proper juror. Therefore, the request that he be excused is denied.\"\n\nDefendant then moved for a mistrial. The trial court denied the motion, noting that he had observed the jurors through voir dire, the guilt proceedings, and part of the penalty proceedings, and had observed Turner in particular during the court's questioning of him regarding the letter. The court found that \"his answers were knowing answers, honest answers, responsive answers and that in no way that he would be affected by the outcome of Hughes denying or not denying any kind of an extension of the 22 days. That ] he made the inquiry in the letter to see if anything could be done and there was no indication that ] that if it was not done that he would in any way have to rush anything or fail to deliberate properly in this matter. . .\"\n\nSection 1089 provides in part, \"If at any time, whether before or after the final submission of the case to the jury, a juror . . . upon . . . good cause shown to the court is found to be unable to perform his duty, . . . the court may order him to be discharged and draw the name of an alternate, who shall then take his place in the jury box . . . .\" At the time of trial, section 1123, which has since been repealed, provided in part, \"If before the jury has returned its verdict into court, a juror . . . upon . . . good cause shown to the court is found to be unable to perform his duty, the court may order him to be discharged.\" A \"good cause\" determination is one calling for the exercise of the court's discretion, and if there is any substantial evidence supporting the decision, it will be upheld on appeal. (People v. Burgener (1986) 41 Cal. 3d 505, 520, 224 Cal. Rptr. 112, 714 P.2d 1251; see People v. Ashmus, supra, 54 Cal. 3d at p. 987 [trial court's ruling upheld absent abuse of discretion].)\n\nWe conclude that the trial court acted well within its discretion in determining that Juror Turner was able to perform his duties regardless of the outcome of his request for an extension by Hughes. Turner was unequivocal in his responses that the result would not affect his ability to deliberate, and the trial court was in the best position to observe his demeanor and assess his credibility.\n\nContrary to defendant's assertions, there is no rule that a trial Judge lacks discretion to refuse a request to replace a juror whenever alternate jurors are available to be substituted in. Such a per se rule would cause unnecessary disruption, particularly when, as in this case, the same jury has already deliberated during the guilt phase together, a process from which alternates are excluded. In sum, we discern no error.\n\n2. Instructional Error\n\nDefendant contends that the trial court should have sua sponte instructed the jury that it could not return a verdict of death unless it found beyond a reasonable doubt that the evidence supported death instead of life imprisonment without possibility of parole. We have repeatedly rejected this contention and defendant asserts no reason for us to revisit it now. (People v. McPeters (1992) 2 Cal. 4th 1148, 1195, 832 P.2d 146; People v. Williams (1988) 44 Cal. 3d 883, 960-961, 245 Cal. Rptr. 336, 751 P.2d 395; see People v. Gates (1987) 43 Cal. 3d 1168, 1201, 240 Cal. Rptr. 666, 743 P.2d 301.) Rather, \"Since the decision [of imposing the appropriate penalty] is a normative judgment reflecting the juror's individual moral assessment of the defendant's culpability . . ., application of a reasonable-doubt standard is neither appropriate nor constitutionally compelled.\" (People v. Williams, supra, 44 Cal. 3d at p. 960.)\n\n3. Reference to Charges Against Scott\n\nDefendant contends that the trial court erroneously forbade defense counsel from referring in closing argument to the fact that the prosecution did not seek the death penalty against Scott. This contention is meritless. The record is devoid of any evidence that counsel sought below to refer in closing argument to whether the prosecutor had sought the death penalty against Scott. That claim has therefore been waived.\n\nTo the extent defendant asserts that he sought to refer to Scott's sentence, that claim has been expressly waived. During a hearing outside the presence of the jury regarding parameters on closing argument, the court commented, \"I don't want any reference to any kind of sentence specifically related to this case or anything like that. For instance, I don't want any reference with regard to what Teague Hampton Scott received or such like that.\" Defense counsel responded, \"I would, of course, expect to mention that because the evidence is in. Teague Hampton Scott is alive and he's in prison and has not been executed. I will mention that part of the evidence and I will not mention that part of the sentence, but sentence is not evidence ] but in evidence is the fact he's alive and was in prison.\" The court subsequently stated, \"It appears to me the only relevance mentioning . . . that [Scott's] alive ] would be for the purpose of having the jury draw from that the Conclusion that he did not receive the death penalty.\" Defense counsel responded, \"Not at all, your honor. . . .The reason for it is when you give the person a death penalty you have no way of rectifying a mistake. When a person is given life without possibility of parole there is a way to rectify the mistake . . I am not going into sentencing. As a matter of fact, of course, [Scott] could have been on appeal. He could be given the death sentence and be on appeal. I don't know that and I don't believe that to be the case, but I am not going to bring it up before the jury. . . .I am not going to tell them Scott had a trial and he's convicted of anything . . . we are not going to go into [Scott's] sentence at all.\"\n\nEven if this claim had not been waived, the trial court acted appropriately in refusing to allow defense counsel to refer to Scott's sentence, and in implicitly refusing to allow reference to the fact that the prosecution had not sought the death penalty against Scott. It is well established that, \"The punishment meted out to a codefendant is irrelevant to the decision the jury must make at the penalty phase: whether the defendant before it should be sentenced to death.\" (People v. Carrera (1989) 49 Cal. 3d 291, 343, 261 Cal. Rptr. 348, 777 P.2d 121; People v. Beardslee (1991) 53 Cal. 3d 68, 111-112, 279 Cal. Rptr. 276, 806 P.2d 1311.) The jury here was fully informed of the parties' positions regarding the relative culpability of the two defendants, and defendant was not precluded from arguing that he played a minor role in the crimes. (See People v. Carrera, supra, 49 Cal. 3d at p. 343.)\n\nDefendant asserts that \"Several recent authorities have suggested that a jury may consider a sentence given to a codefendant.\" However, while the high court in Parker v. Dugger (1991) 498 U.S. 308, 313-318, 112 L. Ed. 2d 812, 111 S. Ct. 731, did conclude that the trial court had implicitly considered such evidence at sentencing, nothing in Parker compels consideration of a codefendant's sentence at the penalty phase. The remaining authorities defendant cites support the opposite proposition. (People v. Morris, supra, 53 Cal. 3d at p. 225 [\"We have repeatedly rejected the contention that capital juries must be directed to consider the relative severity of an accomplice's sentence as a mitigating factor.\"]; People v. Carrera, supra, 49 Cal. 3d at p. 343 [\"Nor is there any error in the fact that the jury was not advised of [codefendant's] sentence. The punishment meted out to a codefendant is irrelevant to the decision the jury must make at the penalty phase: whether the defendant before it should be sentenced to death.\"]; People v. Malone (1988) 47 Cal. 3d 1, 53-54, 252 Cal. Rptr. 525, 762 P.2d 1249 [upholding refusal to instruct jury to consider nature or Disposition of charges against defendant's crime partner].)\n\n4. Prosecutorial Error\n\nDefendant asserts that Martin's improper and inconsistent assertions concerning Scott's intent to kill also constituted prejudicial error at the penalty phase of defendant's trial. (See ante, part II.A.2.c.) Because we conclude above that the claim was waived and there was not, in any event, any prejudicial misconduct at the guilt phase, we further reject the claim that these \"improper and inconsistent assertions . . . had a bearing on the penalty phase of Turner's trial.\"\n\n5. Constitutionality of State Capital Sentencing Scheme\n\nIn summary fashion and without critical analysis, defendant asserts that several features of California's capital sentencing scheme violate the federal Constitution. Defendant acknowledges that we have previously rejected the following arguments, but states that they have not been finally adjudicated in the federal courts.\n\nDefendant asserts that the failure to delete inapplicable sentencing factors from instructions given in the language of section 190.3 violated the Eighth Amendment in that it deprived defendant of his right to an individualized sentencing determination based only on permissible factors. This argument has been repeatedly rejected by this court. (People v. Clark (1992) 3 Cal. 4th 41, 169, 833 P.2d 561; People v. Cooper (1991) 53 Cal. 3d 771, 843, 281 Cal. Rptr. 90, 809 P.2d 865; People v. Miranda (1987) 44 Cal. 3d 57, 104-105, 241 Cal. Rptr. 594, 744 P.2d 1127.)\n\nFurther, contrary to defendant's assertion, the prosecutor did not \"effectively suggest[] . . . to the jury how a factor which had nothing to do with the case could be considered as aggravation.\" To the contrary, the prosecutor emphasized the jury was to consider factors only \"if applicable.\"\n\nDefendant also contends that the failure to label each factor as aggravating or mitigating for the jurors as it applied to defendant rendered the factors unconstitutionally vague because the jury was left without guidance as to the meaning and application of the factor. Moreover, it allowed the jury to consider in aggravation such factors as age and mental or emotional disturbance which may constitutionally be considered only in mitigation.\n\nThe high court has recently upheld section 190.3, factors (a), (b), and (i), against a challenge that the factors were unconstitutionally vague. (Tuilaepa v. California (June 30, 1994) __ U.S. __, __ [62 U.S.L.W. 4720, 4724].) In so doing, the court stated that \"A capital sentencer need not be instructed how to weigh any particular fact in the capital sentencing decision.\" (Id. at p. 4723.) Indeed, we have repeatedly held that \"trial courts are not required to identify particular sentencing factors as aggravating or mitigating and that the 1978 death penalty law is constitutional despite the absence of such a requirement.\" (People v. Howard, supra, 1 Cal. 4th at p. 1196; People v. Pinholster (1992) 1 Cal. 4th 865, 973, 824 P.2d 571.)\n\nDefendant asserts that the inclusion in the list of potential mitigating factors of such adjectives as \"extreme\" and \"substantial\" in instructions given in the language of section 190.3, factors (d) and (g), acted as a barrier to the consideration of mitigation in violation of the Eighth Amendment. However, instructions in the language of section 190.3, factor (d), which allows the jury to consider whether the crime was committed while defendant suffered \"extreme mental or emotional disturbance\" does not unconstitutionally preclude the jury from considering mental or emotional disturbances that are not \"extreme.\" Rather, the \"catchall\" provisions in section 190.3, factor (k), \"referring to 'Any other circumstance which extenuates the gravity of the crime,' allows consideration of nonextreme mental or emotional conditions.\" (People v. Clark, supra, 3 Cal. 4th at p. 163; People v. Morales (1989) 48 Cal. 3d 527, 567-568, 257 Cal. Rptr. 64, 770 P.2d 244.)\n\nMoreover, instructions in the language of section 190.3, factor (g), which allows the jury to consider whether defendant acted under \"extreme\" duress or under \"substantial domination\" of another person, include lesser forms of duress and domination when read in conjunction with factor (k), and therefore do not act as a barrier to the consideration of mitigating evidence. (People v. Adcox (1988) 47 Cal. 3d 207, 270, 253 Cal. Rptr. 55, 763 P.2d 906; see People v. Morales, supra, 48 Cal. 3d at pp. 567-568.)\n\nDefendant next contends that the trial court's failure to require written findings by the jury on the aggravating factors selected by it deprived defendant of his due process and Eighth Amendment rights to meaningful appellate review. We have previously rejected this claim. (People v. Fauber (1992) 2 Cal. 4th 792, 859, 831 P.2d 249; People v. Cox (1991) 53 Cal. 3d 618, 692, 280 Cal. Rptr. 692, 809 P.2d 351.)\n\nDefendant contends that the lack of any requirement of intracase and intercase proportionality and of any such undertaking in this case at the time of trial or on appeal violates defendant's right to equal protection since such review is afforded to noncapital inmates, the Eighth Amendment requires that a death sentence not be imposed arbitrarily or capriciously, and potentially mitigating factors must be considered by the sentencer. We have, however, previously observed that \"'persons convicted under the death penalty are manifestly not similarly situated to persons convicted under the Determinate Sentencing Act and accordingly cannot assert a meritorious claim to the \"benefits\" of the act under the equal protection clause . . . .'\" (People v. Cox, supra, 53 Cal. 3d at p. 691.)\n\nDefendant contends that any use of unadjuduciated criminal activity by the jury during the sentencing phase violated his rights to due process and under the Eighth Amendment. Here, however, the jury was instructed that aside from defendant's three prior convictions, they could not consider \"any evidence of any other crime as an aggravating circumstance.\" We presume that the jury followed the court's instructions. (People v. Delgado, supra, 5 Cal. 4th at p. 331; People v. Mickey, supra, 54 Cal. 3d at p. 689, fn. 17.)\n\nC. Posttrial\n\n1. New Trial Motion\n\nDefendant claims that the trial court erred in denying his motion for new trial based on newly discovered evidence regarding Officer Barger-Collins's relationship with defendant. The newly discovered evidence consisted of both a 1976 probation report which defendant contended contained information that contrary to her trial testimony, Barger-Collins had used defendant as a paid informant, and the testimony of Mildred Hughes, the parole agent investigator who allegedly wrote the report. In fact, the probation report and the testimony were ambiguous as to the name of the officer to whom Hughes spoke, and whether that officer ever paid defendant money. We conclude that the trial court acted within its discretion in denying the motion for new trial.\n\na. Factual Background\n\nDefendant moved for a new trial in part on the basis of newly discovered evidence regarding Officer Barger-Collins's relationship with defendant. This evidence consisted of a 1976 supplemental violation report regarding defendant. The report was dictated by Mildred Hughes, then a parole agent investigator with the California Youth Authority, who testified at the hearing on the new trial motion. The document was not signed by Hughes. There was no indication on the report that Hughes had read the transcribed tape and made any corrections on the document. When Hughes reread the report in 1988, she discovered a name misspelled and the word \"collaborated\" used instead of \"corroborated.\"\n\nDefendant and Hughes had at one point \"had a relationship of parolee and parole agent.\" In 1976, defendant told her \"that he was working for some woman on the police department.\" She could not \"remember the name until I read the document.\" Hughes had two telephone conversations with a woman Compton police officer who told her defendant was working for her as an informant, \"and that he had given her some very valuable information regarding the certain robberies and things of this sort, but she felt like at this point that he was working on both sides. He was setting . . . up burglaries and also informing her about them.\" In response to the question, \"Did she relate to you that she was paying him for that information?\" Hughes said, \"Yes, she said he was being paid, but I don't know ] I never asked about anything like that. . . . What I recall is that she said Melvin was working for her, but I cannot recall her ever saying that she paid him money. But I guess I assumed she was paying him money.\" Hughes subsequently had a conversation with another Compton police officer who told her he had told \"Detective Barker\" she should not use defendant as an informant. In the report, Hughes had referred to a Detective Barker, not Barger.\n\nOfficer Barger-Collins also testified at the hearing.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In 1976, her name was Officer Barger. She worked with an Officer Richard Baker who had obtained information from defendant. She did not remember ever hearing of or being contacted by a parole office employee by the name of Mildred Hughes. She did not recall saying in July 1976 that defendant had been working for her for several months and had received money for various tips regarding crimes in the community. While Barger-Collins would not characterize defendant as an informant, he had given her information about alleged criminal activity by other persons. She did not recall ever paying defendant or anyone else for information during the time she worked for the Compton Police Department.\n\nThe trial court denied the motion for a new trial. The court stated that with regard to the \"supplemental violation report, to the extent that it's newly discovered evidence with regard to any and all phases of trial, . . . if it had been introduced, I would rule it would be irrelevant because it's [sic] relevancy would have to do to a great extent with regard who the money was paid by.\" Hughes \"was very unclear about that, and could only speculate . . . as to who paid the money. Therefore in my opinion it would be irrelevant.\n\n\"Assuming there was a determination made that it was relevant, because of the ambiguities in the document; that is, that the name was spelled wrong, it was 'Barker,'\" and because of the ambiguity as to who paid the money, \"I would have excluded it under 352. . . .\n\n\"Assuming arguendo, that I would have let the document in, and would not have excluded it under 352, with regard to the motion for new trial, I find that it would be of very little value in view of the overwhelming evidence against the defendant in this matter ] all of the evidence being fresh in my mind. . . . It would have been of so little value it would not have changed the outcome of any portion of the trial.\"\n\nb. Analysis\n\n\"'The determination of a motion for a new trial rests so completely within the court's discretion that its action will not be disturbed unless a manifest and unmistakable abuse of discretion clearly appears.'\" (People v. Williams (1988) 45 Cal. 3d 1268, 1318, 248 Cal. Rptr. 834, 756 P.2d 221; see People v. Delgado, supra, 5 Cal. 4th at p. 328.) \"'In determining whether there has been a proper exercise of discretion on such motion, each case must be Judged from its own factual background.'\" (People v. Dyer (1988) 45 Cal. 3d 26, 52, 246 Cal. Rptr. 209, 753 P.2d 1.)\n\nIn ruling on a motion for new trial based on newly discovered evidence, the trial court considers the following factors: \"'1. That the evidence, and not merely its materiality, be newly discovered; 2. That the evidence be not cumulative merely; 3. That it be such as to render a different result probable on a retrial of the cause; 4. That the party could not with reasonable diligence have discovered and produced it at the trial; and 5. That these facts be shown by the best evidence of which the case admits.'\" (People v. Sutton (1887) 73 Cal. 243, 247-248, 15 P. 86; People v. Delgado, supra, 5 Cal. 4th at p. 328.)\n\nHere, defendant asserts that the new impeaching evidence was critical to the issue of whether defendant or Scott was the actual shooter. Defendant notes that the People relied heavily on the inconsistencies in defendant's statements, and that defendant's only explanation for the inconsistencies was that Barger-Collins was able to persuade defendant on the basis of their relationship and her threats to acknowledge a greater role than he truly had. If the jury had been aware of the new evidence, the jury \"could likely have believed Turner's explanation of his inconsistent statements on August 5 and 7, 1979.\" The evidence \"likely would have provided the jury with a reasonable doubt . . . on the question of who was the shooter.\"\n\nWe conclude that the trial court acted within its discretion in denying the motion for new trial and in determining that the newly discovered evidence would not have been such as to render a different result probable on retrial. (See People v. Sutton, supra, 73 Cal. at p. 247.) The jury had heard defendant's explanation for his inconsistencies, and apparently chose to disbelieve his testimony that his August 7 statement implicating himself in a multiple-murder and robbery was procured by Barger-Collins's influence and coercion. Moreover, there was strong evidence of defendant's guilt in addition to his August 7 statement, including Vincent's testimony regarding defendant's admission of murder on the jail bus and defendant's possession and use of certain items belonging to the victims.\n\nBy contrast, the document and testimony defendant sought to introduce at the new trial hearing were ambiguous as to the name of the officer to whom Hughes spoke, and whether that officer ever paid defendant money. Thus, the evidence did not contradict the strongest evidence introduced against defendant; rather, it was at best speculative evidence of Barger-Collins's untruthfulness on a collateral point. In sum, we conclude that the trial court acted within its discretion in denying the motion for new trial based on Hughes's probation report and testimony.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n2. Reduction to Life Sentence\n\nDefendant contends that his sentence should be reduced to life imprisonment without possibility of parole because of Martin's \"unprofessional and inconsistent argument,\" the failure of the trial court to apply concepts of intracase proportionality, and because the reasons stated by the trial court for refusing to reduce the sentence failed to take these considerations into account.\n\nWe have already rejected on the merits defendant's claim that Martin committed prejudicial prosecutorial misconduct by making inconsistent arguments, and his claim that the lack of intracase proportionality violates his right to equal protection. Therefore, the trial court did not err in failing to expressly consider them in its ruling. (Cf. People v. Frierson (1991) 53 Cal. 3d 730, 752, 280 Cal. Rptr. 440, 808 P.2d 1197.)\n\nIn addition, defendant notes that the trial court stated that \"The evidence clearly and beyond any reasonable doubt established the defendant was not under duress nor was he under any domination of his crime partner or anyone else ] substantial domination or otherwise. There was absolutely no domination or duress at all. Because there was no evidence from which I could even infer such duress and/or domination, this factor is given absolutely no weight in mitigation.\" Defendant asserts that \"these justifications by the trial court should not be considered because the trial court had improperly excluded the proposed testimony of Dr. Maloney to the effect that Turner was a follower-type and could therefore have been induced to participate in the crimes by Scott and did not personally shoot the victims.\" We have already upheld the trial court's exclusion of this evidence at the guilt phase. We noted in this Discussion that our review of the record revealed no testimony by Dr. Maloney on voir dire that defendant was generally a follower and therefore less likely to have been the shooter. Moreover, Dr. Maloney did testify at the penalty phase, and still did not opine that defendant was a follower so dominated by Scott that he was induced to involve himself in criminal activity. In sum, we conclude that the trial court did not err in denying the motion to modify.\n\nD. Ineffective Assistance of Counsel\n\nDefendant contends that if this court should find that any of the issues raised by defendant were waived because his trial counsel failed to preserve them, we must also find that the representation provided to defendant by counsel on these issues was ineffective. He also asserts that the issue of whether he has made a sufficient showing to demonstrate ineffective assistance of counsel is \"simply immaterial at this time\" because he will address issues of ineffective assistance of counsel in his petition for writ of habeas corpus. We therefore do not consider this claim further.\n\nConclusion\n\nFor the reasons set forth above, the judgment is affirmed.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nLUCAS, C.J., KENNARD, J., BAXTER, J., GEORGE, J., and WERDEGAR, J., Concurring.\n\nMOSK, J., Concurring:\n\nI concur in the judgment.\n\nI also concur generally in the opinion of the court.\n\nI write separately to state that it seems plain to me that the \"remoteness\" of a prior felony conviction that a party seeks to use to impeach a witness as he testifies is measured from the date the witness suffered the conviction, or was released from imprisonment therefor, whichever is later, to the date the witness takes the stand. (Cf. Fed. Rules Evid., rule 609(b), 28 U.S.C. [measuring \"remoteness\" from \"the date of the conviction or of the release of the witness from the confinement imposed for that conviction, whichever is the later date\"].) The law deems relevant the comparison between the person as he was then and the person as he is now. It implicitly asks this question: \"The witness was a criminal once: Is he rehabilitated today?\" (Cf. 28 Wright \u0026 Gold, Federal Practice and Procedure (1993) § 6136, pp. 254-255 [under Fed. Rules Evid., rule 609(b), 28 U.S.C.].)\n\n\u003cspan class=\"fn\"\u003e1. All statutory references contained herein are to the California Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. As to the remaining counts, defendant was sentenced to a total term of 13 years, 8 months in state prison. This sentence was stayed pursuant to section 654.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In 1979, this Compton Police Officer was known as Officer Barger. At the time of trial, she had changed her name to Collins. For clarity, the parties in their briefs refer to her as Officer Barger-Collins, as she was at times referred to at the trial. We have adopted that reference for purposes of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The jury in this case never learned that defendant was at this time under investigation for the unrelated murder of Julia Marmor. They were simply informed that Officer Barger-Collins was interviewing defendant regarding an unrelated matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant similarly argues that we should reject Martin's other asserted justifications for excusing the challenged prospective jurors to the extent he did not excuse other non-Black jurors apparently exhibiting the same limitations. We likewise reject these arguments for the reasons just stated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In 1979, section 825 provided: \"The defendant must in all cases be taken before the magistrate without unnecessary delay, and in any event, within two days after his arrest, excluding Sundays and holidays; provided, however, that when the two days prescribed herein expire at a time when the court in which the magistrate is sitting is not in session, such time shall be extended to include the duration of the next regular court session on the judicial day immediately following.\" Section 849, subdivision (a), provided \"When an arrest is made without a warrant by a peace officer or private person, the person arrested, if not otherwise released, shall, without unnecessary delay, be taken before the nearest or most accessible magistrate in the county in which the offense is triable, and a complaint stating the charge against the arrested person shall be laid before such magistrate.\" While the parties do not point to, and the record does not reveal, an arrest warrant, the parties have assumed both below and on appeal that the two-day limitation of section 825 applies to a warrantless arrest. (See People v. Hughes (1974) 38 Cal. App. 3d 670, 673-674, 113 Cal. Rptr. 508; Youngblood v. Gates (1988) 200 Cal. App. 3d 1302, 1334, fn. 3, 246 Cal. Rptr. 775 (dis. opn. of George, J.); but see People v. Bonillas (1989) 48 Cal. 3d 757, 787, fn. 11, 257 Cal. Rptr. 895, 771 P.2d 844.) Because the parties have not raised the issue, we also assume without deciding that the two-day limitation is applicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Of course, People v. Menifee has no continuing validity in California. (See California v. Hodari D. (1991) 499 U.S. 621, 626 \u0026 fn. 2, 113 L. Ed. 2d 690, 111 S. Ct. 1547; Cal. Const., art. I, § 28, subd. (d).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. At the time of the crimes at issue, a defendant could invoke the exclusionary rule to challenge Fourth Amendment breaches when the Fourth Amendment rights of a person other than defendant were violated. (People v. Martin (1955) 45 Cal. 2d 755, 761, 290 P.2d 855.) The law today is otherwise. (In re Lance W. (1985) 37 Cal. 3d 873, 879, 210 Cal. Rptr. 631, 694 P.2d 744.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Because we conclude that Officer Paerels had probable cause to arrest Austin for receipt of stolen property, we need not address defendant's alternative argument that Austin's arrest was invalid because it was premised on an unconstitutionally vague curfew statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Section 1220 provides: \"Evidence of a statement is not made inadmissible by the hearsay rule when offered against the declarant in an action to which he is a party in either his individual or representative capacity, regardless of whether the statement was made in his individual or representative capacity.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It is therefore unnecessary to address respondent's further contention, on which the trial court neither ruled nor instructed the jury, that Scott's statements were also admissible as adoptive admissions under Evidence Code section 1221.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The proposed instruction provided: \"Evidence has been received of statements made by persons outside of the courtroom when not under oath. \"With respect to these statements your task is threefold. First, you must consider the credibility of the witness who testifies about the statement. In determining his credibility, you must be guided by the standards relating to the credibility of all witnesses. \"Second, you should view his testimony concerning the statement by another person with caution because witnesses having the best of motives are generally unable to state the exact language used by another person and are liable by the omission or the changing of words to convey a false impression of the language used. \"Third, you must determine the credibility of the person who made the out-of-court statement. In determining whether he is credibile [sic] you should be guided by the standards given to you concerning the credibility of witnesses and by the additional considerations that the person making the statement was not under oath, that you were unable to observe that person's demeanor or the manner in which he made the statement and that he was not subject to cross-examination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Defendant has separately filed a request for judicial notice of the Scott trial transcripts. We hereby deny that motion as moot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The parties stipulated that microphone 11 was approximately 825 feet from the hangar where the murders occurred, and microphone 6 was approximately 1425 feet from the hangar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We note that subsequent to the trial in this case, the Legislature enacted section 1127a, which provides in subdivision (b), \"In any criminal trial or proceeding in which an in-custody informant testifies as a witness, upon the request of a party, the court shall instruct the jury in part that 'The testimony of an in-custody informant should be viewed with caution and close scrutiny. . . .'\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The proposed instruction was as follows: \"The law makes the defendant a competent witness in his own behalf, and his testimony is entitled to full and fair consideration by you, the same as that of any other witness. You may not disregard his testimony merely because he is the defendant. He is presumed to be innocent until the prosecution establishes the contrary by convincing proof beyond a reasonable doubt. His testimony is entitled to full credit when you believe that he has spoken the truth, and his testimony is sufficient proof of any fact to which you believe he has truthfully testified. You should weigh his testimony by the same standards as you would weigh the testimony of any other witness.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Officer Barger-Collins retired as a police officer in 1980. Concomitant with his motion for new trial, defendant sought disclosure of Barger-Collins's Compton Police personnel file over her assertion of privilege. Defendant sought discovery for two purposes. First, the records might reveal a disability that could account for both her departure and her lack of recall, and would allow defendant to impeach Barger-Collins regarding her mental state. Second, defendant sought the records to the extent they contained any implicit or explicit references to defendant or contact with defendant. The trial court denied the motion pursuant to § 1045, subdivision (b)(3), stating that it had read the records, and that the information they contained was so remote as to make disclosure of little or no practical benefit with regard to the reasons defense counsel had asserted it needed the records. The court sealed the records as court's Exhibit No. 9. Defendant subsequently requested on appeal that we unseal the exhibit. Our independent review of the personnel records did not reveal a disability that could account for both Barger-Collins's departure and her lack of recall at trial. Nor did they contain any implicit or explicit reference to defendant or contact with defendant. Accordingly, we denied the request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Given our Disposition on the third factor, we need not reach the remaining factors of the Sutton test (People v. Delgado, supra, 5 Cal. 4th at p. 329, fn. 7), or review the trial court's other bases for denying the motion for new trial, i.e., that if the newly discovered evidence had been proffered at trial, the trial court would have concluded it was irrelevant, and if relevant, would have excluded it under Evidence Code section 352.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We discuss those arguments that are sufficiently developed to be cognizable. To the extent defendant perfunctorily asserts other claims, without development and, indeed, without a clear indication that they are intended to be discrete contentions, they are not properly made, and are rejected on that basis.\u003c/span\u003e\n\n",
    "body_length": 169206,
    "citedas": [
      "8 Cal.4th 137",
      "8 Cal.4th 440A",
      "878 P.2d 521",
      "32 Cal.Rptr.2d 762"
    ],
    "attorneys": "Edward J. Horowitz, under appointment by the Supreme Court, and Adrienne Dell for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Carol Wendelin Pollack, Assistant Attorney General, Robert S. Henry, Susan Lee Frierson, Linda C. Johnson, Sharon Wooden Richard and William H. Davis, Jr., Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Arabian, J.; Lucas, C.J., Kennard, J., Baxter, J., George, J., and Werdegar, J., Concurring. Mosque, J.; Concurring separately in the judgment only.",
    "citation_count": 931
  }
}
