{
  "id": "_oZkP2YBTlTomsSBNn8p",
  "document": {
    "title": "UNITED STATES AMERICA v. PHYLISS BRISCOE",
    "full_title": "UNITED STATES OF AMERICA v. PHYLISS BRISCOE, FOLORUNSHO, OGUNDIPE, ABDUL DISU, ISAAC ORIJA, OLADIPO, ERINLE, CHARLES DINA, KOLA AJIBADE, ALABA ZACH IJITOLA, SHERIFAT USMAN, FADEKE BELLO, MICHAEL OLUNDERE ALLI, IDRIS DUALE, LEONARD SMITH AND ALBERT DAVIES",
    "jurisdiction": "Seventh Circuit",
    "date": "1990-02-26T00:00:00.000Z",
    "docket": "Nos. 87-2553, 87-2583, 87-2584, 87-2585, 87-2586, 87-2601, 87-2602, 87-2603, 87-2604, 87-2605, 87-2612, 87-2613, 87-2614, 87-3068",
    "body": "COFFEY, Circuit Judge.\n\nThis is the consolidated appeal of fourteen individuals who, based on their involvement in a heroin importation and distribution conspiracy, were convicted of various offenses under the federal narcotics laws. On appeal, they raise a number of arguments challenging their convictions and/or sentences. We affirm.\n\nI. FACTUAL BACKGROUND\n\nThis case arises out of an extensive heroin network centered in Chicago, Illinois. Between 1984 and 1986 this drug enterprise imported approximately three kilograms of heroin having an estimated street value of over one million dollars into the United States from Pakistan, India and Nigeria. The heroin, most of which was smuggled into this country by female couriers concealing the drug in their body cavities, was then transported to the Chicago area for distribution. In addition to the importers and couriers, this organization employed a number of distributors who were responsible for the \"cutting\" and packaging of the heroin, as well as street dealers, the individuals within the organization ultimately charged with keeping a steady supply of heroin in Chicago.\n\nIn early 1986, confidential informants working with the Chicago Police Department (\"CPD\") and the United States Drug Enforcement Administration (\"DEA\") introduced undercover law enforcement officials to Folorunsho Ogundipe and Surakatu Shittu, the central figures controlling the drug network. On January 10, 1986, CPD Officer Nathaniel Reed met with Ogundipe and purchased approximately one-half ounce of heroin for $3,500. Two weeks later, on January 24, Officer Reed went to Ogundipe's apartment to make a second purchase of heroin. Upon his arrival, Reed encountered defendant Phyllis Briscoe, whom Ogundipe introduced as his wife. Shortly thereafter, Ogundipe told Briscoe to leave the apartment and get the package.\" Briscoe returned approximately fifteen minutes later carrying a small paper bag, informed Ogundipe that she \"got it,\" and went into the bedroom with him. Ogundipe returned with a one-ounce package of heroin, and Reed paid him $7,000. Between January and April 1986, Officer Reed also negotiated with Ogundipe for the purchase of a kilogram of heroin. Ogundipe informed Reed that a purchase of this size would involve a trip to Nigeria and that he (Ogundipe) could guarantee Reed safe passage to and from Nigeria by providing Reed with falsified passports and making the necessary arrangements, i.e., bribing, various \"U.S. customs officials on his payroll.\" During one of their meetings, Ogundipe drove Reed to the residence of Gbolahan Taiwo,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e who, according to Ogundipe, was the individual in charge of all the Nigerian heroin in Chicago. Ogundipe entered Taiwo's residence, returning approximately fifteen minutes later with a small package of heroin for Reed.\n\nAt approximately the same time, DEA Agent Robert Smith began purchasing heroin from Shittu. Shittu informed Agent Smith that he imported heroin from Nigeria through the use of female couriers and would be traveling to Nigeria himself to obtain a kilogram of heroin. Shittu also stated that he could supply Smith with as much heroin as he needed for a price of $6,500 to $7,500 an ounce. In March 1986, Agent Smith met with both Shittu and Ogundipe in Ogundipe's apartment and purchased one ounce of heroin for $7,500. While in Ogundipe's apartment, Agent Smith met Phyllis Briscoe, whom Ogundipe again introduced as his wife. At the close of this meeting, Shittu informed Smith that he was leaving for Nigeria and that while he was away, Ogundipe would be able to supply Smith with heroin. Smith entered into two subsequent transactions with Shittu, purchasing approximately four ounces of heroin for $25,500.\n\nBased on this evidence, the DEA obtained authorization to intercept and record telephone calls to and from the residences of Shittu, Ogundipe and Taiwo, located in Chicago. The government operated a wiretap on Shittu's telephone from September 22 to November 12, 1986. Ogundipe's calls were monitored from September 22 until October 22. The wiretap on Taiwo's telephone commenced on October 16 and terminated on November 12. Through this wiretap investigation, the DEA was able to monitor the conversations of Shittu, Ogundipe and Taiwo, as well as identify the individuals listed on telephone company records as the subscribers to the numbers making calls to or receiving calls from these residences. The majority of the intercepted conversations were conducted in Yoruba, a language spoken in Nigeria, thus necessitating that the DEA task force charged with monitoring the conversations of Shittu, Ogundipe and Taiwo include individuals who could provide English translations of the conversations occurring during the wiretap investigation.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Once these conversations were translated and combined with the subscriber information from the incoming and outgoing calls, the law enforcement officials learned of Shittu's, Ogundipe's and Taiwo's heroin dealings with defendants Abdul Disu, Kola Ajibade, Charles Dina, Isaac Orija, Idris Duale, Oladipo Erinle, Albert Davies, Alaba Zach Ijitola, Leonard Smith, James King, Alonzo Manning, and Jacqueline Simmons, all of whom were ultimately arrested and indicted as defendants in this case.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe wiretap investigation also led to the arrests of three drug couriers and their escort at O'Hare International Airport in Chicago on October 23, 1986. On October 22, Shittu received a call from an individual identifying himself as \"Kunle,\" who was later identified as defendant Adekunle Adefuye. Adefuye stated that he had been sent by \"Mrs. Agbabs\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and that he had just arrived in New York City from Nigeria. Adefuye asked Shittu if he could handle \"one door\" (one kilogram of heroin) and Shittu stated that he would take as much as Adefuye could bring with him. Adefuye made a second call to Shittu's residence in which the two discussed the price for the heroin Adefuye was transporting to Chicago. On October 23, Adefuye called Shittu a third time, stating that he and three female couriers would be arriving in Chicago that evening on American Airlines Flight 277. Upon their arrival in Chicago, Adefuye and the three couriers, defendants Sherifat Usman, Fadeke Bello and Aderemi Adefuye,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e were arrested by DEA agents who had been dispatched to O'Hare following Adefuye's third telephone conversation with Shittu. The three couriers were taken to a hospital near O'Hare where they were x-rayed. The x-rays revealed that each woman had a foreign object in her pelvic area. After DEA agents stated that they had obtained a court order authorizing the removal of the objects, Bello and Usman removed egg-shaped objects wrapped in black electrical tape from their vaginas. The agents opened these containers and discovered that Bello had been carrying 67.62 grams of heroin and Usman had been carrying 212.5 grams of the drug. After Aderemi refused to remove the object from her pelvic area, doctors surgically withdrew from her vagina a container similar in appearance to those of Usman and Bello in which 200.62 grams of heroin was discovered.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e After their arrest, Adefuye informed law enforcement officials that he and the three couriers had been sent to Chicago by defendant Michael Alli, an importer of heroin residing in New York City. Based on this information, DEA agents arrested Alli in his New York home on January 6, 1987.\n\nOn March 11, 1987, a federal grand jury returned a second superseding 162-count indictment charging twenty-five individuals, including the fourteen appellants, with numerous violations of the federal narcotics laws. Count One charged all defendants with participating in a heroin importation and distribution conspiracy in violation of 21 U.S.C. § 846. Specifically, the defendants were charged with conspiring; (1) to possess with intent to distribute and to distribute heroin; and (2) to use interstate telephone lines to facilitate the importation, possession, and distribution of heroin. Counts Two through Seventeen charged several of the defendants with possession, possession with intent to distribute, and distribution of heroin in violation of 21 U.S.C. §§ 841(a)(1) and 844, and 18 U.S.C. § 2. In the remaining counts, various defendants were charged with using the telephone to facilitate the conspiracy, as well as to facilitate the actual importation and distribution of heroin in violation of 21 U.S.C. § 843(b).\n\nOn May 13, 1987, a jury trial commenced as to fifteen of the defendants charged in the indictment, fourteen of whom are involved in this appeal.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e At trial, the government presented the testimony of CPD Officer Reed and DEA Agent Smith concerning their heroin transactions with defendants Ogundipe and Shittu, as well as the testimony from other law enforcement officials regarding the arrests of the various defendants. The government also elicited testimony from co-conspirators Shittu, Adefuye, King and Manning concerning their transactions with the other defendants in this case. Each of these individuals had pled guilty to certain charges in the indictment and testified pursuant to plea agreements in which the government agreed to drop the remaining charges against them. The bulk of the government's evidence consisted of 230 tape-recorded conversations, most of which were in Yoruba, and their corresponding English transcripts. As foundation for the admission of the tapes and transcripts, the government presented the testimony of defendant Shittu detailing the identification of the voices on the tapes. The government also presented and the trial court qualified Michael Afolayan as an expert witness to testify as to the English translations of the Yoruba tapes. Afolayan, a native Nigerian and an expert in the Yoruba language, had listened to the tapes of the conversations conducted in Yoruba and aided in translating the conversations into English and preparing the English transcripts which were ultimately submitted to the jury.\n\nAfter two months of trial, the case was submitted to the jury on July 16, 1987. On July 20, 1987, the jury returned a verdict finding all defendants guilty of conspiracy to distribute heroin in violation of 21 U.S.C. § 846. In addition to their convictions for conspiracy, all of the defendants involved in this appeal were convicted on at least one other count in the indictment. All of the appellants were sentenced on September 23, 1987, with the exception of Davies, who was sentenced on December 9, 1987. To the extent that further facts may be necessary to fully address the issues raised on appeal, such facts will be incorporated into our discussion of the merits of the appellants' challenges to their convictions and sentences.\n\nII. JURY SELECTION\n\nThe appellants, all of whom are black, initially contend that reversal of their convictions is required because the government violated their equal protection rights in using its peremptory challenges to exclude blacks from the trial jury. Specifically, the appellants argue that the government removed six black venirepersons from the jury based solely on their race and that the trial court's finding that the government did not commit purposeful discrimination in removing these members of the venire is clearly erroneous.\n\nIn Batson v. Kentucky, 476 U.S. 79, 90 L. Ed. 2d 69, 106 S. Ct. 1712 (1986), the Supreme Court held that the Equal Protection Clause forbids the government from exercising peremptory challenges to remove black venirepersons from the petit jury based solely on their race or on the assumption that black jurors will be unable to consider the case against a black defendant impartially. Id. at 89. In so holding, the Court set forth an evidentiary framework for assessing whether the prosecution's use of its peremptory challenges violates general principles of equal protection. Under this framework a defendant who is a member of a cognizable racial group \"may make out a prima facie case of purposeful discrimination by showing that the totality of the relevant facts gives rise to an inference of discriminatory purpose.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Id. at 93-94. Once the defendant establishes a prima facie case, the burden shifts to the government to articulate a neutral explanation for challenging the black venirepersons. Id. at 94. \"[The] prosecutor's explanation need not rise to the level justifying exercise of a challenge for cause.\" Id. at 97. However, the government may not satisfy its burden by merely denying any discriminatory motive and asserting its good faith in individual selections. Id. at 98. Rather, the government's explanation must be \"clear and reasonably specific\" and set forth \"legitimate reasons\" for the challenges, all of which must be \"related to the particular case to be tried.\" Id. at 98 and\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e If the government's explanation satisfies these requirements, \"[the] trial court then will have the duty to determine if the defendant has established purposeful discrimination.\" Id. at 98.\n\nIn the present case the trial court allotted twelve peremptory challenges to the government. The government exercised a total of seven strikes, six of which were against blacks. Defense counsel, citing Batson, objected to five of the six strikes exercised against blacks, arguing that the government was purposefully using its peremptories to remove blacks from the panel of prospective jurors. In response to the defendant's objections, the government articulated its reasons for striking the black venirepersons. The trial court found that the government's reasons were legitimate and, thus, that the defendants had failed to demonstrate a Batson violation.\n\nOn appeal, the parties do not dispute that the defendants established a prima facie case of racial discrimination under Batson nor do they dispute that the burden shifted to the government to articulate neutral explanations for its peremptory challenges. What is in dispute is whether the trial court erred in determining that the government did not commit purposeful discrimination based on its finding that the government's explanations for challenging the black veniremen were not racially motivated. The appellants argue that the court's finding is erroneous because the reasons the government articulated for striking the black veniremen were not legitimate, but rather were mere pretexts for discrimination. The appellants carry a heavy burden in challenging the findings of the trial court. As the Supreme Court recognized in Batson: \"Since the trial judge's findings in the context under consideration here largely will turn on evaluation of credibility, a reviewing court ordinarily should give those findings great deference.\" Id. at 98 n. 21. Thus, we may overturn the trial court's determination that the government's peremptory challenges were not motivated by intentional discrimination only if it is clearly erroneous. Id.\n\nApplying these standards to the facts of this case, we are convinced that the trial court properly found that the government did not use its peremptory challenges to exclude black veniremen from the petit jury based on racial considerations. The transcript of the jury selection proceedings reveals that after each of the defendants' objections to the peremptory challenges against black venirepersons, the government set forth its rationale for striking the particular juror.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The Assistant United States Attorneys representing the government explained that it challenged juror Karen Jackson, a black female, because she had previously worked as a youth supervisor at the Illinois Youth Correctional Center, a penal facility for young persons convicted of criminal violations, and feared she might have a tendency to be sympathetic toward the defendants and their reasons for engaging in criminal activity. The appellants argue that the government's reason for striking Jackson is pretextual because the government's assumption of bias is contradicted by Jackson's statement that her experience as a youth supervisor would not prejudice her and that she could be fair to both sides. This argument ignores the fact that the Supreme Court in Batson \"[emphasized] that the prosecutor's explanation need not rise to the level justifying exercise of a challenge for cause.\" 476 U.S. at 97. Had Jackson stated that she would be biased due to her previous employment at the Illinois Youth Correctional Center, she certainly would have been dismissed for cause. We agree with the trial court that the government articulated a legitimate, race-neutral explanation for the exercise of its peremptory challenge against juror Jackson.\n\nJuror Andrew Cooper, a black male, stated during the court's voir dire examination that he had been accused of assault and battery, but had been acquitted of the charge because the judge in his trial found the evidence to be \"too circumstantial.\" The government explained that due to Cooper's acquittal based on circumstantial evidence, \"he would empathize with the defendants unnaturally and possibly not consider the circumstantial evidence we present.\" Given the significance of circumstantial evidence in a conspiracy case such as this, see United States v. Vega, 860 F.2d 779, 793-94 (7th Cir. 1988), we are of the opinion that the government's reservations concerning juror Cooper were well founded and, in any case, were not motivated by racial concerns. Thus, we uphold the trial court's determination that the government's peremptory challenge against Cooper on this basis was proper.\n\nJuror Donald Jeffries, a black male, testified on voir dire that he was an unemployed student and that during the last five years he had resided at three different addresses on the west side of Chicago. The Assistant United States Attorneys stated that all three of these addresses were \"geographically close\" to the addresses of two individuals, Fanny Chambers and Joseph Henley, who were scheduled to testify that they had engaged in heroin transactions with defendant Shittu, and that, in their opinion, the government's interest would be disserved by allowing \"a juror who somehow may be personally familiar with, if not the people involved, certainly the area involved where these events have taken place.\" The appellants argue that the possibility that juror Jeffries was acquainted with the two government witnesses is too remote to justify Jeffries' removal from the venire. We disagree. At trial, Shittu testified that between 1984 and 1986 he distributed a significant amount of heroin to Fannie Chambers, a heroin dealer operating on the west side of Chicago. Given the widespread activities of the heroin distribution network in this case, coupled with the fact that Chambers conducted her own distribution operation in close proximity to the area where Mr. Jeffries resided, it is quite likely that Jeffries might very well have been familiar with, if not Chambers herself, the individuals involved as purchasers and/or distributors within Chambers' operation, thus justifying the government's peremptory challenge. Other courts have upheld peremptory challenges based on similar concerns. See United States v. Mitchell, 877 F.2d 294, 303 (4th Cir. 1989); United States v. Davis, 871 F.2d 71, 73-74 (8th Cir. 1989); United States v. Tindle, 860 F.2d 125, 129 (4th Cir. 1988). We are cognizant of the fact that the west side of Chicago is predominantly black and that exclusion of jurors based solely on their residence in this area of the city could be a pretext for discrimination. However, the government's explanation for its strike went well beyond a cursory statement that Mr. Jeffries resided on the west side of Chicago. The government explicitly stated that Jeffries' last three separate addresses where he had resided in the immediate past were geographically close to the addresses of Chambers and Henley. Defense counsel, both at trial and on appeal, failed to present any evidence that Jeffries' residences were not in close proximity to the area where these individuals conducted their illicit activities. In light of these circumstances, as well as our deference to the trial court's opportunity to assess the credibility of the prosecutors, we affirm the trial court's determination that the government's reasons for challenging Mr. Jeffries were legitimate.\n\nJuror Grant Owens, a black male, testified that he had been unjustly convicted of aggravated assault because the Cook County (Illinois) State's Attorney's Office persuaded him to plead guilty despite his representations of innocence. Owens stated that due to this conviction he had been denied employment with the federal government on two separate occasions. As with juror Jackson above, the defendants merely refer to Owens' statement that he could be a fair and impartial juror. In light of his past experience with the criminal justice system, this attempt to attack the government's reasons for challenging Mr. Owens borders on the frivolous. We affirm the trial court's finding that the government's peremptory challenge against Mr. Owens was properly exercised.\n\nJuror Jerry Beal, a black male, testified that he had been the victim of a crime involving armed violence and that no court proceeding occurred regarding this incident. The Assistant United States Attorneys stated that they \"detected in [Beal] some resentment over the fact that there was nobody charged in [the] crime and that this 'resentment' would inure to the detriment of the government.\" The appellants argue that the prosecutors' perception of resentment in Mr. Beal is a subjective determination based only on their own intuition and, thus, is insufficient to justify the peremptory challenge. This argument was rejected in United States v. Lance, 853 F.2d 1177, 1181 (5th Cir. 1988), where the Fifth Circuit stated: \"[The] vagarious process of choosing jurors need not be controlled by a simple equation; it may be influenced by intuitive assumptions that are not fairly quantifiable . . . and by the interplay of various factors.\" Accord United States v. Terrazas-Carrasco, 861 F.2d 93, 94 (5th Cir. 1989) (\"Valid reasons for exclusion may include 'intuitive assumptions' upon confronting a venireman.\"). See also Davis, supra, 871 F.2d at 73. The government articulated a facially valid explanation for excluding Beal. Giving due deference to the trial court's opportunity to observe the credibility of the prosecutors, we refuse to disturb the court's finding that the government articulated legitimate reasons under Batson for striking Beal.\n\nIn sum, we agree with the trial court that in light of the government's race-neutral explanations for peremptorily challenging the black venirepersons discussed above, the defendants failed to establish purposeful discrimination in the jury selection process. In addition to the facial validity of the government's explanations, we note that the jury ultimately empaneled consisted of six blacks, one Oriental, and five whites. Moreover, all four of the alternate jurors were black. Although \"the striking of a single black juror for racial reasons violates the equal protection clause, even though other black jurors are seated,\" United States v. Battle, 836 F.2d 1084, 1086 (8th Cir. 1987), the fact that ten black jurors were seated when the government left five of its twelve allotted peremptory challenges unused strongly supports the trial court's finding that the government did not act with discriminatory intent during jury selection. On this record, we are convinced that the court's finding is not clearly erroneous. Accordingly, we hold that the appellants' jury was selected in accordance with the Batson mandate.\n\nIII. EVIDENTIARY RULINGS\n\nThe appellants raise numerous arguments challenging the evidentiary rulings made by the district court during the course of the trial. We note that the appellants carry a heavy burden in challenging the trial court's evidentiary rulings on appeal because \"'a reviewing court gives special deference to the evidentiary rulings of the trial court.'\" United States v. Shukitis, 877 F.2d 1322, 1327 (7th Cir. 1989) (citation omitted). Thus, we will reverse such rulings only upon a showing that the trial court committed an abuse of discretion. United States v. Alvarez, 860 F.2d 801, 807 (7th Cir. 1988). With this standard in mind we address the appellants' arguments sertatim.\n\nA. Transcripts of Tape-Recorded Telephone Conversations\n\nDefendants Disu, Ajibade and Davies contend that the trial court erred in allowing the jury to use government-prepared transcripts containing English translations of tape-recorded telephone conversations in which they and the other defendants spoke almost exclusively in Yoruba. Specifically, the defendants contend that the government failed to establish that the transcripts were authentic versions of the recorded conversations because the methods used to translate the conversations and identify the parties thereto were inherently untrustworthy. We consider the defendants' argument in view of the well-established rule that \"[courts] possess wide discretion in determining whether to permit the jury to use written transcripts as aids in listening to tape recordings.\" United States v. Keck, 773 F.2d 759, 766 (7th Cir. 1985). Accord United States v. Carrasco, 887 F.2d 794, 804-07 (7th Cir. 1989); Vega, supra, 860 F.2d at 791; United States v. Zambrana, 841 F.2d 1320, 1335 (7th Cir. 1988).\n\nWith regard to the method used to identify the voices on the various tapes, DEA Agent Michael Streicher testified that after the conversations were recorded, he and Surukatu Shittu listened to the tapes, Shittu identified the participants in the conversations, and Streicher took notes as to Shittu's identifications which were later transferred to the transcripts. According to the defendants, this procedure was inherently untrustworthy because the government failed to establish Shittu's familiarity with their voices and failed to identify the individuals who affixed the names of the speakers to the transcripts. We disagree.\n\nAs an initial matter, we are of the opinion that the government clearly established Shittu's familiarity with the voices of the defendants alleged to be the speakers on the tape recordings. We recently set forth the standard of familiarity necessary for an authenticating witness to identify the voices of participants in conversations recorded on tape:\n\n\"Federal Rule of Evidence 901(b)(5) . . . permits voice identification . . . to be made 'by opinion based upon hearing the voice at any time under circumstances connecting it with the alleged speaker.' As long as the basic requirement of familiarity is met, lay opinion testimony is an acceptable means for establishing the speaker's identity.\"\n\nVega, 860 F.2d at 788. Shittu's identification of the defendants' voices comports with this standard. Shittu testified that he had spoken with all of the defendants prior to identifying the voices on the tapes. With respect to the particular defendants challenging the voice identification procedure on appeal, Shittu testified that he had spoken with Disu and Ajibade on at least 150 occasions. Although Shittu was not as familiar with Davies, he testified that he had known Davies for five years and that they had been involved in at least three heroin transactions together. Shittu also stated that he had spoken with Davies while they were incarcerated prior to trial. Thus, there is little question that the government established that Shittu was sufficiently familiar with the voices of Disu, Ajibade and Davies to identify their voices on tape.\n\nThe defendants also argue that the government failed to identify the individuals who affixed the names of the defendants onto the transcripts, thus precluding them from inquiring into the method used to identify the speakers. We recently rejected a similar challenge to the voice identifications on government-prepared transcripts in Alvarez, supra. In that case we dismissed the defendants' attack on the transcripts, also based on the government's failure to identify the individuals affixing speakers' names to the transcripts, in light of the testimony of voice identification witnesses who had substantial familiarity with the defendants implicated in the recorded conversations, as well as the extensive opportunity afforded defense counsel to cross-examine the witnesses concerning their identification of the defendants' voices. Alvarez, 860 F.2d at 812. As noted above, the government clearly established Shittu's familiarity with the voices of Disu, Ajibade and Davies. More importantly, defense counsel extensively cross-examined Shittu concerning statements allegedly made by the defendants in particular transcripts.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Thus, there was sufficient evidence elicited for the jury to assess the reliability of the government's method for assigning speakers' names to the various statements in the transcripts and determine the proper weight to be given to the various voice identifications.\n\nThe defendants also argue that the English transcripts of the tap-recorded Yoruba conversations were inaccurate because Michael Afolayan, the government's language expert, did not prepare the transcripts \"from scratch.\" Rather, Afolayan, while listening to the tapes, reviewed and corrected preliminary versions of the transcripts prepared by the Nigerians deputized as United States Marshals (\"Nigerian deputies\") who worked with DEA agents during the wiretap investigation. According to the defendants, Afolayan's method of preparing the final versions of the transcripts renders them inaccurate because of \"a person's propensity to hear what they [sic] see written.\"\n\nAt the outset, we note that the defendants failed to offer an alternate version of the transcript containing their own translations of the Yoruba conversations, nor did they present an expert witness to testify that Afolayan's translations were, in fact, inaccurate. In Zambrana, supra, we adopted the following procedure for resolving challenges to the accuracy of transcripts:\n\n\"'Initially, the district court and the parties should make an effort to produce an \"official\" or \"stipulated\" transcript, one which satisfies all sides. If such an \"official\" transcript cannot be produced, then each side should produce its own version of the disputed portions. In addition, each side may put on evidence supporting the accuracy of its version or challenging the accuracy of the other side's version.\n\nThis procedure is well suited to cases such as that before us, where the transcript is an English translation of a foreign language conversation. Such a procedure does not tie a defendant to an \"official\" transcript prepared by the prosecution, nor does it \"usurp\" the factfinder's function. If there is a dispute as to the contents of a foreign language recording the burden will lie with the respective parties to present transcripts or other evidence to support their version of the conversation.'\"\n\n841 F.2d at 1335-36 (quoting United States v. Llinas, 603 F.2d 506 (5th Cir. 1979)). Moreover, in Zambrana we agreed with the Llinas court's \"[holding] that '\"[once] we have concluded that the defendants could have challenged specific portions of the government's transcript or prepared an alternate version, it follows that they cannot be heard to complain on appeal because they failed to take advantage of their trial opportunity.\"' 603 F.2d at 509 (quoting United States v. Wilson, 578 F.2d 67, 70 (5th Cir. 1978)).\" Zambrana, 841 F.2d at 1335. In this case, because the defendants failed to present their own translation of the Yoruba conversations and also failed to present an expert witness to demonstrate possible inaccuracies in the translated transcripts, despite the trial court's explicit statement that defense counsel could do so, they have certainly limited their opportunity to challenge the accuracy of the government's transcripts on appeal. It is undisputed that Afolayan was an expert in the Yoruba language. Moreover, the defendants were given the opportunity to, and did in fact, cross-examine Afolayan regarding his translations. It is clear that the jury, like the trial court, was convinced that the government's translations in the transcripts were reliable and accurate. That the defendants were unable to cast doubt on the translations is due in large part to their own failure to present alternate translations or an expert witness of their own to discredit the testimony of the government's translator. Thus, we hold that the transcripts were properly provided to the jury as an aid while listening to the tape-recorded conversations.\n\nOn a related note, although the defendants extensively cross-examined Afolayan regarding his translations of the tape-recorded Yoruba conversations, they nonetheless argue on appeal that the trial court unduly restricted their opportunity to cross-examine Afolayan effectively in violation of the Confrontation Clause of the sixth amendment. Specifically, the defendants contend that their confrontation rights were violated by the trial court's ruling precluding them from questioning Afolayan about differences between the Nigerian deputies' preliminary drafts and the final drafts submitted to the jury which Afolayan had prepared, as well as the notes Afolayan made on the preliminary drafts regarding the translations contained therein. The trial court precluded the defendants from questioning Afolayan on the preliminary documents, ruling that Afolayan had not prepared the preliminary drafts and, thus, could not testify as to why the Nigerian deputies' translations differed from the translations Afolayan had prepared. The court went on to state that the preliminary transcripts constituted hearsay because, in effect, they were the statements of out-of-court declarants. With regard to Afolayan's notes, the court ruled that defense counsel could impeach Afolayan with the notes, provided counsel could establish that the notes were inconsistent with Afolayan's final translations. The main thrust of the defendants' argument that the trial court's ruling violated their confrontation rights is that without learning of the discrepancies between the preliminary and final versions of the transcripts, the jury could not possibly have reached an informed decision regarding the weight to be given the final transcripts.\n\nThe sixth amendment's Confrontation Clause provides: \"In all criminal prosecutions, the accused shall enjoy the right . . . to be confronted with the witnesses against him.\" Included within this right is the guarantee that a defendant will have an effective opportunity to test the accuracy of adverse evidence. Ohio v. Roberts, 448 U.S. 56, 65, 65 L. Ed. 2d 597, 100 S. Ct. 2531 (1980). However, this guarantee does not include the opportunity to test the evidence \"in whatever way, and to whatever extent the defense might wish.\" Delaware v. Fensterer, 474 U.S. 15, 20, 88 L. Ed. 2d 15, 106 S. Ct. 292 (1985) (per curiam). In the present case, the defendants sought to question Afolayan concerning documents which he had not prepared--namely, the preliminary transcripts prepared by the Nigerian deputies. As noted above, Afolayan, while listening to the tape-recorded conversations, reviewed, corrected and edited the translations contained in these documents. Although Afolayan was competent to testify as to his own translations, we agree with the trial court that he was not competent to testify as to the reasons why the Nigerian deputies translated the Yoruba conversations in the manner in which they did. Indeed, Afolayan was not present when the deputies listened to the Yoruba conversations, nor did he participate in the preparation of the preliminary transcripts. In any case, the fact that there may have been some discrepancies between Afolayan's translations and those of the Nigerian deputies does not somehow give the defendants the right to engage in unfettered cross-examination of Afolayan.\n\n\"[As] we observed in United States v. Zambrana, 841 F.2d [at] 1337 . . .:\n\n'In our view a foreign language translation is sufficiently accurate to assist the jury if the \"translation\" reasonably conveys the intent or idea of the thought spoken. It is axiomatic that a translation of most foreign languages to English (and vice versa) can never convey precisely and exactly the same idea and intent comprised in the original text, and it is unrealistic to impose an impossible requirement of exactness before allowing a translation to be considered by a jury.'\n\nDifferences in grammar between languages, for example, could preclude exact translation of sentences. Accordingly, we are most reluctant to disturb a district court's admission of a translated transcript without some clear demonstration of inaccuracy.\"\n\nCarrasco, supra, 887 F.2d at 806 n. 19. The defendants extensively cross-examined Afolayan regarding his translations -- the only version submitted to the jury -- as well as his expertise in Yoruba and the intricacies of the language itself. As noted above, the trial court informed defense counsel that if he wished to challenge Afolayan's translations, he was free to present an expert witness to testify that Afolayan's translations of the tape-recorded conversations were inaccurate. However, the defendants failed to present such expert witness. We agree with the previous holding of this court in which this court has been hesitant to find Confrontation Clause violations in situations where defendants have failed to take full advantage of the opportunity for cross-examination afforded them by the trial court. See United States v. Mayomi, 873 F.2d 1049, 1057 n. 9 (7th Cir. 1989). Under these circumstances we refuse to hold that the trial court violated the defendants' confrontation rights. Cf. Alvarez, 860 F.2d at 812.\n\nIn sum, the jury was presented with extensive testimony, including thorough direct and cross-examination regarding the procedures used to identify the voices on the tapes, as well as the methods employed to translate the Yoruba conversations into English. We are of the opinion that this extensive examination of the witnesses provided the jury with sufficient information to determine the accuracy of the voice identifications and translations, as well as the method used to attribute certain statements to the defendants. Thus, we hold that the defendant's challenge to the district court's decision to allow the jury to use the government's transcripts as an aid to listening to the taped conversations is without merit.\n\nB. Telephone Records\n\nDefendants Orija, Erinle, Duale and Smith challenge the admission of computerized telephone records under Fed.R.Evid. 803(6).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The telephone records listed the telephone numbers, the names of the subscribers placing calls to, as well as the subscribers receiving calls from, the three telephone numbers that were the subjects of the DEA wiretap investigation, the date, time and length of the call. The defendants allege that the trial court abused its discretion in admitting the telephone records because the government failed to present sufficient foundational evidence to establish that the computer records were accurate compilations of the telephone call data associated with the three \"wiretapped\" telephones.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIt is well established that computer data compilations are admissible as business records under Fed.R.Evid. 803(6) if a proper foundation as to the reliability of the records is established. United States v. Croft, 750 F.2d 1354 (7th Cir. 1984). A proper foundation is established if the government demonstrates that the business records, in this case, the computerized telephone records, \"are kept in the course of regularly conducted business activity, and [that it] was the regular practice of that business activity to make records, as shown by the testimony of the custodian or other qualified witness.\" United States v. Chappell, 698 F.2d 308, 311 (7th Cir.), cert. denied, 461 U.S. 931, 77 L. Ed. 2d 304, 103 S. Ct. 2095 (1983). \"Business records are reliable to the extent they are compiled consistently and conscientiously.\" United States v. Ramsey, 785 F.2d 184, 192 (7th Cir. 1986).\n\nAt trial, the government presented the testimony of Merny Miller, the keeper of the records at Illinois Bell Telephone Company. Miller testified that the telephone records proffered by the government were Automatic Message Accounting Interrogation sheets which are compilations of call data entered into a computer when an Illinois Bell subscriber places a telephone call prepared for billing purposes. According to Miller, it was the regular business practice of Illinois Bell to assemble and maintain the records of the subscriber's telephone calls.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Moreover, Miller also stated that the computer assembling the call data scanned itself for error every fifteen seconds. Finally, defense counsel were given an opportunity to, and did in fact, cross-examine Miller on all of the information concerning the telephone records presented at trial. In light of these facts, we are convinced that the government's foundation evidence established the reliability of Illinois Bell's computerized telephone records.\n\nDespite the government's extensive foundation evidence, as well as the defendants' opportunity to cross-examine Miller, the defendants argue that the foundation for the computer records is deficient because the government failed to establish that the computers were tested for internal programming errors on a monthly basis as were the computers in United States v. Weatherspoon, 581 F.2d 595, 598 (7th Cir. 1978). Although the government did, in fact, present such evidence in Weatherspoon, that case in no way requires that such a showing be made in every case as a prerequisite to the admission of computer records. As long as the government provides sufficient facts to warrant a finding that the records are trustworthy and the opposing party is afforded an opportunity to inquire into the accuracy thereof and how the records were maintained and produced, a proper foundation has been established. See Croft, 750 F.2d at 1365 n. 7. From our review of the testimony, we are convinced that the government's foundation in this case complies with this standard and hold that the trial court's admission of the telephone records was not an abuse of discretion.\n\nC. Transcript Cover Sheets\n\nDefendants Orija, Erinle, Duale and Smith argue that the district court erred in allowing the government to submit cover sheets with the transcripts of the tape-recorded telephone conversations. Each cover sheet listed the following information: (1) the date and time of the telephone call; (2) the identified parties to the conversation; and (3) the subscribers of the telephone numbers making and receiving the call. The court admitted the cover sheets as summaries under Fed.R.Evid. 1006, which provides: \"The contents of voluminous writings, recordings, or photographs which cannot conveniently be examined in court may be presented in the form of a chart, summary, or calculation.\" Specifically, the court ruled that because the jury would be considering 238 tapes and their corresponding transcripts, the cover sheets would be an aid to the jury in understanding the telephone record exhibits and testimony and would provide them with an efficient method for identifying the tapes and transcripts, most of which corresponded to specific counts in the indictment charging telephone facilitation in violation of 21 U.S.C. § 843(b). See infra section IV.B. The defendants argue that the court improperly admitted the cover sheets because the summaries did not accurately represent the evidence upon which they were based and because the tapes and transcripts were not too voluminous to present in their original form.\n\n\"The admission of a summary under Fed.R.Evid. 1006 requires 'a proper foundation as to the admissibility of the material that is summarized and . . . [a showing] that the summary is accurate;' however, the decision to admit or exclude the summary rests in the district court's sound discretion.\" United States v. Driver, 798 F.2d 248, 253 (7th Cir. 1986) (quoting Needham v. White Laboratories, Inc., 639 F.2d 394, 403 (7th Cir.), cert. denied, 454 U.S. 927, 70 L. Ed. 2d 237, 102 S. Ct. 427 (1981)). Our review of the court transcript reveals that the information contained in the cover sheets was corroborated by: evidence from the government's wiretap investigation (dates and times of the calls); Shittu's voice identification testimony (parties to the conversations); and Illinois Bell telephone records (subscriber information). Thus, we reject the defendants' contention that the information on the cover sheets did not accurately reflect the evidence presented at trial. We also reject the defendants' argument that the trial court erred in admitting the cover sheets because the tapes and transcripts were not too voluminous to present in their original form. The defendants are not aided by the fact that the tapes and transcripts were, in fact, presented in their original form. Rule 1006 \"does not require that it be literally impossible to examine all the underlying records, but only that in-court examination would be an inconvenience.\" United States v. Possick, 849 F.2d 332, 339 (8th Cir. 1988). In view of the numerous tapes and transcripts presented in this case, as well as the importance of separating this evidence as it pertained to each defendant, we hold that the district court's admission of the transcript cover sheets as an aid to the jury in interpreting the voluminous records and documents presented by the government was not an abuse of discretion.\n\nD. Shittu's Explanation of Narcotics Terms\n\nDefendants Disu, Ajibade and Davies argue that the trial court erred in allowing defendant Shittu to testify as to the meaning of certain words allegedly referring to narcotics used in the tape-recorded conversations in which he was not a participant. The district court ruled that Shittu was competent to testify as to the meaning of these terms under Fed.R.Evid. 602\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e based on the fact that he had personally dealt with many of the defendants alleged to be the speakers on tape. Furthermore, the court ruled that under Fed.R.Evid. 702\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and 703,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Shittu could testify as an expert witness based On his experience in the field of narcotics trafficking.\n\nThe defendants' attack on Shittu's testimony focuses almost solely on the Rule 602 aspect of the trial court's ruling. Essentially they argue that it was never established that Shittu and the other defendants formulated specific code words to signify terms relating to the distribution of narcotics. In our opinion the defendants interpret the trial court's ruling too narrowly. Whether or not Shittu and the other defendants formally established a narcotics code is irrelevant. The fact of the matter is that such code language was used. As we stated in Vega, supra:\n\n\"The fact that tapes of the conversations implicating Vega in the drug conspiracy may, in certain parts, have been somewhat unclear, does not preclude a determination that he participated in the conspiracy. As we observed in United States v. Zanin, 831 F.2d 740, 744 (7th Cir. 1987): 'Conversations regarding drug transactions are rarely clear. A fact-finder must always draw inferences from veiled allusions and code words.' In this case the jury was confronted with conversations which contained 'code words' that, when considered in isolation, might seem unclear, veiled and almost nonsensical, but when analyzed properly, in the context of the totality of the evidence, can be clearly seen to be 'code words' for drugs. See generally United States v. Abascal, 564 F.2d 821, 827 (2nd Cir. 1977) ('The conversing conspirators frequently discuss non-narcotic-related matters at the beginning of conversations, and often resorted to jargon and code words, a frequent practice in narcotics dealings'); United States v. Chavez, 533 F.2d 491, 494 (9th Cir. 1976) ('Jargon and code words are commonly used by those dealing in illicit drugs and were employed here') (citation omitted). It is true that, advisedly, no explicit mention was ever made of cocaine or other drugs in any of Vega's conversations with the Zambranas. However, a case was made, which was more than strong enough to convince the jury, the trier of fact, that Vega used terms like 'chickens,' 'roosters' and 'it' as code words for drugs. Not only are code words always used by drug conspirators when they realize, as they do in today's drug culture, that their telephone conversations are frequently intercepted, such terms were obviously used by the conspirators in this case. Tom Lovely, a convicted member of the . . . conspiracy, testified clearly and without qualification that he had been instructed to use code words for drugs when speaking on the telephone.\"\n\n860 F.2d at 795. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e It is most apparent that members of a narcotics organization are uniquely qualified to testify as to the code words used by their fellow conspirators. In this case, the record is replete with references to where the speakers on tape used such isolated terms as \"tar\" and \"show\" to mean heroin; \"red\" and \"white\" to signify the color of heroin; and \"one\" and \"two\" to signify the quantity of heroin being discussed. Thus, we reject the defendants' argument that the trial court improperly allowed Shittu to testify under Rule 602.\n\nIn any case, even if we agreed with the defendant's arguments under Rule 602, which we do not, we agree with the trial court's ruling that given Shittu's extensive knowledge and experience as a narcotics dealer, as well as his many dealings with the other defendants, Shittu was well qualified to offer his interpretation of the meaning of the code terms and phrases used in the tape-recorded conversations as an expert witness under Rules 702 and 703. These rules permit the admission of the opinion testimony of a witness qualified by the court as an expert if the \"witness' specialized knowledge will assist the trier of fact to understand the evidence in the case.\" United States v. Rollins, 862 F.2d 1282, 1292 (7th Cir. 1988). It is well-settled that the meaning of narcotics code words are an appropriate subject for expert testimony. Id.; United States v. Ramirez, 796 F.2d 212, 216 (7th Cir. 1986). See also Vega, 860 F.2d at 782-83. Thus, we hold that the district court did not abuse its discretion in permitting Shittu to express his opinion on the meaning of code words and phrases used during the course of the telephone conversations recorded on tape.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nE. Ajibade's Document Theft\n\nDefendants Dina, Ogundipe and Ijitola argue that the district court erred in admitting evidence of defendant Ajibade's attempt to remove an airline ticket to Puerto Rico issued in the name of Joseph Shobo and charged to Ajibade's credit card from the courtroom.\n\nDuring its case-in-chief, the government elicited testimony from Shittu that Ajibade was selling heroin in Puerto Rico and introduced an airline ticket to Puerto Rico issued in Ajibade's name, which was issued for the same flights and dates of travel as the ticket issued to Shobo. After Shittu's testimony, Ajibade and his attorney requested and received permission from the court to examine documents relating to Shittu's testimony concerning Ajibade's drug activities in Puerto Rico, including Shobo's airline ticket. During Ajibade's examination of the documents, United States Marshal Charles Wagner observed him remove the ticket from the evidence table and shove it into his sock. Wagner reported Ajibade's actions to his superior, Julian Styne, who searched Ajibade and found Shobo's ticket hidden in one of his socks. After learning of this series of events, the government sought on two occasions to introduce evidence of Ajibade's attempt to remove the ticket from the courtroom, arguing that it was evidence of Ajibade's consciousness of guilt. The court initially refused to allow the government to present this evidence, ruling that the probative value with respect to consciousness of guilt was substantially outweighed by the risk of unfair prejudice and that the jury might have difficulty considering the evidence only with respect to Ajibade and not the other defendants.\n\nDuring Ajibade's presentation of evidence, Ajibade's wife testified that she and her husband, accompanied by Shobo and his wife, traveled to Puerto Rico, but that their trip was unrelated to heroin trafficking. Following Mrs. Ajibade's testimony, the government again sought leave to introduce evidence of defendant Ajibade's attempt to remove Shobo's ticket from the courtroom. Over the objection of all defendants, the trial court reversed its prior ruling and admitted this evidence, concluding that Mrs. Ajibade's testimony had \"opened the door\" for the government to present evidence of Ajibade's consciousness of guilt concerning the trip to Puerto Rico. Prior to admitting this evidence the trial court instructed the jury that the government's rebuttal evidence applied only to Kola Ajibade and only for the limited purpose of demonstrating his consciousness of guilt. The defendants contend that this evidence was \"outrageously prejudicial\" to them, especially in light of the fact that this was the last evidence the jury heard before closing arguments, and thus, was inadmissible under Fed.R.Evid. 403, which provides, in relevant part: \"Although relevant, evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury. . . .\"\n\nIt is well established that \"a trial judge's assessment of relative probative value and unfair prejudice is generally accorded great deference because of his firsthand exposure to the evidence and his familiarity with the course of the trial proceeding.\" United States v. Liefer, 778 F.2d 1236, 1244 (7th Cir. 1985) (citation omitted). Accord United States v. Garner, 837 F.2d 1404, 1416 (7th Cir. 1987). In asserting that the evidence of Ajibade's document theft was inadmissible under Rule 403, the defendants place significant reliance on the trial court's initial determination that the unfair prejudicial effect of this evidence substantially outweighed its probative value. This reliance is misplaced because the probative value of this evidence dramatically increased after Mrs. Ajibade's testimony that the trip to Puerto Rico was not drug related. Assuming this were true, defendant Ajibade had no reason to fear the introduction of Shobo's ticket, and thus, had no reason to surreptitiously attempt to remove the ticket from the courtroom. Thus, in light of Mrs. Ajibade's testimony, we agree with the trial court's decision to allow the reception of the document theft evidence for the sole and limited purpose of establishing Ajibade's consciousness of guilt concerning his trip to Puerto Rico with Shobo.\n\nThe defendants argue that even if Ajibade's document theft is admissible under Rule 403, they were denied a fair trial because of the \"spillover\" prejudice inuring to them from the admission of this evidence. The defendants correctly point out that in joint trials the court must consider, and remain particularly sensitive to the possibility that the prejudicial effect of evidence admissible only as, to only one or a few defendants may have a \"spillover effect on the jury's consideration of the government's case against defendants to whom the evidence does not apply. United States v. Davis, 838 F.2d 909, 916 (7th Cir. 1988). \"Generally, a cautionary instruction will be sufficient to cure any unfair prejudice . . .; however, if the evidence creates an unacceptably high inference of wrongdoing against another defendant, the district court should either exclude the evidence or sever the trials.\" Id. The defendants argue that the trial court's cautionary instruction was insufficient to mitigate the unfair prejudice they suffered from the admission of Ajibade's document theft. This argument is based entirely on the defendants' speculative assertion that at the point in the trial when this evidence was introduced, \"the jury had become conditioned to the fact -- rightly or wrongly -- that what one defendant said or did was attributable to each and every defendant on trial.\" We refuse the defendants' invitation to engage in such speculation. Despite the fact that the circumstances surrounding Ajibade's document theft were presented to the jury immediately before closing argument, the evidence involved only Ajibade and his consciousness of guilt regarding activities -- namely, drug trafficking in Puerto Rico -- in which no defendant on trial other than Ajibade participated. In light of the trial court's clear and repeated instructions that the jury could consider this evidence only against Ajibade on the issue of consciousness of guilt, we refuse to hold that the district court's admission of this evidence was an abuse of discretion.\n\nF. \"Other Acts\" Evidence Against Alli\n\nDefendant Alli challenges the district court's admission of the testimony of defendant Adekunle Adefuye, who stated that in addition to the trip involving the heroin couriers arrested at O'Hare, Alli had arranged four other trips during 1986 in which couriers working for and on behalf of Alli smuggled heroin from foreign countries, including Nigeria, to New York in their body cavities. Alli also challenges the admission of the testimony of Internal Revenue Service Agent Patrick McDermott, who stated that Alli had substantial income during the years 1985 and 1986, but failed to file income tax returns for these years. Alli argues that the testimony of these witnesses was inadmissible because it involved acts not charged in the indictment falling outside the parameters of Fed.R.Evid. 404(b). That rule, which governs the admission of \"other acts\" evidence, provides:\n\n\"Evidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show action in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\"\n\nIn this circuit, district courts, before admitting \"other acts\" evidence under Rule 404(b), must analyze the evidence within the framework of a four-part test and determine that:\n\n\"(1) the evidence is directed toward establishing a matter in issue other than the defendant's propensity to commit the crime charged, (2) the evidence shows that the other act is similar enough and close enough in time to be relevant to the matter in issue, (3) the evidence is sufficient to support a jury finding that the defendant committed the similar act, and (4) the probative value of the evidence is not substantially outweighed by the danger of unfair prejudice.\"\n\nUnited States v. Zapata, 871 F.2d 616, 620 (7th Cir. 1989). We note that a trial court's decision to admit \"other acts\" evidence is reversible only upon a showing that the court committed a clear abuse of discretion. Id. at 621. With this standard in mind, we address Alli's arguments concerning his prior heroin trafficking activities and his failure to file income tax returns in 1985 and 1986.\n\n1. Prior Heroin Trafficking Activities\n\nAt trial, Adefuye testified that between January and August of 1986, Alli organized a number of trips in which female couriers transported heroin in their body cavities from foreign lands, including Nigeria, to Alli's home in New York. Adefuye also testified that defendant Aderemi had been a courier on two of these trips and that the defendants Usman and Bello acted as couriers on one of these trips. The government offered and the trial court admitted Adefuye's testimony as evidence of Alli's intent, knowledge and preparation regarding the October 1986 trip in which Adefuye, Aderemi, Usman and Bello were arrested for transporting heroin from New York to Chicago.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Alli's primary attack on the court's admission of this evidence is that he did not place his intent in issue, and thus, the government failed to comply with the first prong of the four-part test described in Zapata, supra. That is, the evidence was not \"directed toward establishing a matter in issue other than the defendant's propensity to commit the crime charged.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Alli overlooks the fact that the indictment charged him with, among others, conspiracy to possess with intent to distribute and to distribute heroin in violation 21 U.S.C. § 846, which is a crime requiring proof of specific criminal intent. Thus, Alli's intent was at issue in the present case regardless of whether or not he believed he placed his intent at issue, see United States v. Liefer, 778 F.2d 1236, 1242-43 (7th Cir. 1985), and his argument that the government was not entitled to introduce evidence on the issue of knowledge and intent is meritless.\n\n2. Failure to File Tax Returns\n\nAs noted above, IRS Agent Patrick McDermott concluded at trial, based on his examination of Alli's bank records, real estate purchases and travel expenditures, that Alli had substantial unreported income during the taxable years of 1985 and 1986, and failed to file income tax returns for these years. The trial court admitted this evidence on the issue of Alli's intent and knowledge of the criminal activities forming the basis of the charges against him. Alli argues that the government failed to demonstrate how his failure to file income tax returns is relevant to Alli's knowledge concerning the narcotics conspiracy alleged in this case. We disagree. Agent McDermott's conclusion that Alli was required, but failed, to file income tax returns during 1985 and 1986 was based on his analysis of Alli's financial records, which revealed that during the years in question, Alli made bank deposits of approximately $419,000 and, in addition to this money, made cash payments in excess of $100,000 on two parcels of real estate. It is well settled that in narcotics prosecutions, a defendant's possession and expenditure of large sums of money, as well as his or her failure to file tax returns, are relevant to establish that the defendant lacked a legitimate source of income and that, in all probability, the reason for the failure to report this income is due to the defendant's participation in illegal activities. See, e.g., United States v. Wood, 834 F.2d 1382, 1386 (8th Cir. 1987) (collecting cases); United States v. Saint Prix, 672 F.2d 1077, 1084 (2d Cir. 1982). See also United States v. Wilson, 715 F.2d 1164, 1171 (7th Cir.), cert. denied, 464 U.S. 986, 78 L. Ed. 2d 365, 104 S. Ct. 433 (1983). In the Rule 404(b) context, Alli's failure to file income tax returns evinced his knowledge and intent concerning his illicit narcotics trafficking activities. Thus, we hold that the district court's admission of Agent McDermott's testimony concerning Alli's financial records and failure to file tax returns in 1985 and 1986 was proper and, thus, its reception into evidence does not constitute an abuse of discretion.\n\nG. Bello's Post-Arrest Statement\n\nDefendant Usman contends that the district court improperly admitted the testimony of United States Customs Inspector Mary McCarthy reiterating a statement given by the defendant Bello after she and the other couriers were arrested at O'Hare Airport. Specifically, McCarthy testified that after Bello and Usman removed the packages containing heroin from their vaginal cavities, Bello made the following statement:\n\n\"We were given tickets in Lagos [Nigeria] to go to New York. We did not carry this through U.S. Customs. Three other females carried it. We were only to bring this from New York to Chicago.\"\n\nAfter relating Bello's statement, Customs Inspector McCarthy stated that she understood Bello's reference to \"we\" to mean Bello, Usman and Aderemi. Usman's counsel objected to the admission of McCarthy's testimony and subsequently moved for a mistrial,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e arguing that admission of Bello's statement through McCarthy violated Usman's right to confront witnesses under Bruton v. United States, 391 U.S. 123, 20 L. Ed. 2d 476, 88 S. Ct. 1620 (1968). The government argued that the statement was admissible under Fed.R.Evid. 801(d)(2)(E)\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e as a statement in furtherance of the conspiracy, and thus, was not required to be excluded under Bruton.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The trial court agreed, but decided to instruct the jury that they should consider the statement only as to defendant Bello.\n\nOn appeal, Usman persists in her argument that the trial court violated her Bruton rights in admitting Bello's statement. According to her, Bello's statement clearly identifies Usman as an accomplice in Bello's drug trafficking activities. The government argues that Bello's statement was not so \"powerfully incriminating\" on its face that it incriminated Usman, or for that matter Bello, in the context of this case. After reviewing the record, we agree with the government's position.\n\nIn Bruton, the Supreme Court held that a defendant's sixth amendment right to confront witnesses against him is violated when the confession of a nontestifying codefendant implicating him as a participant in the crime is admitted in the joint trial of the two defendants, even if the jury is instructed to consider the confession only against the confessing codefendant. Id. at 135-36. Bruton involved the out-of-court statement of one of two jointly tried defendants in which the first defendant, who did not testify at trial, admitted to committing armed robbery and specifically named the second defendant, petitioner, as his accomplice. Id. at 124. Thus, the nontestifying defendant's confession in Bruton was \"powerfully incriminating\" because it directly implicated the petitioner in the commission of a crime. See Richardson v. Marsh, 481 U.S. 200, 208, 95 L. Ed. 2d 176, 107 S. Ct. 1702 (1987). However, this court has previously stated that \"[when] a co-defendant's extra-judicial statement . . . does not directly implicate the defendant, the Bruton rule does not come into play.\" United States ex rel. Cole v. Lane, 752 F.2d 1210, 1216 (7th Cir. 1985). Accord United States v. Cirrincione, 780 F.2d 620, 632 (7th Cir. 1985).\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe statement of the defendant Bello is not the same type of statement the Bruton court found offensive. Bello did not confess to the crimes with which she was charged, nor did she state that Usman had committed the crimes charged in the indictment. On the other hand, the nontestifying codefendant in Bruton admitted to committing armed robbery and specifically implicated the petitioner, by name, in the crime as well. 391 U.S. at 124. We also note that in Bruton there were only two participants in the armed robbery and only two defendants. Thus, the codefendant's statement regarding his accomplice was an obvious reference to the petitioner. In the present case, there were three women charged with being heroin couriers within the conspiracy -- Bello, Usman and Aderemi -- and Bello's statement does not name any of the other couriers by name, but rather uses the term \"we.\" Unlike the concurring opinion, we do not consider Bello's references to \"we\" and her statement that \"[we] were only to bring this from New York to Chicago,\" to directly incriminate Usman in the commission of a crime. The reference to \"we\" could just as easily refer to only Bello and Aderemi as to Bello, Aderemi and Usman. Further, we disagree with the basic premise of the concurring opinion that the term \"we\" is just as incriminating to Usman as her own name would be. In Richardson, a case in which the Supreme Court upheld the admission of a nontestifying codefendant's confession because the petitioner was not identified therein, 481 U.S. at 211 n. 5, the Court refused to express an opinion on the admissibility of a redacted confession in which the defendant's name has been substituted with a neutral pronoun. Similarly, we refuse to expand the scope of the Bruton rule to situations where the defendant alleging a Confrontation Clause violation thereunder is not directly implicated in the nontestifying codefendant's confession by being specifically identified or by being the only other participant in the charged crime. See United States v. Espinoza-Seanez, 862 F.2d 526, 534 (5th Cir. 1988) (confessions of two codefendants did not identify, either by name or any other characteristic of the confession, the other jointly tried defendants and, thus, were not admitted in violation of Bruton); United States v. Bruno, 809 F.2d 1097, 1102 (5th Cir. 1987) (codefendant's guilty plea to conspiracy charge did not specifically allude to other conspiracy codefendants and could have referred to various unindicted coconspirators; thus, no Bruton violation).\n\nMoreover, Usman's and Bello's theory of defense was that they had no knowledge of the contents of the packages they were carrying and that someone else had carried them through customs in New York. Although Bello's statement admits that she and the other couriers were in physical possession of the packages and that they were to transport the packages from New York to Chicago, neither of these facts were in dispute at trial. What was in dispute was Bello's and Usman's knowledge of the contents of the packages that they were carrying. Given this fact, the concurring opinion's speculation that the term \"this\" could just as easily mean the heroin as opposed to the containers in which the heroin was carried is inappropriate. As discussed below, evidence of Usman's knowledge and intent of the heroin in the containers did not become apparent until Adekunle Adefuye testified that Usman had participated as a courier in prior drug shipments. Thus, the term \"this\" did not incriminate Usman in the commission of a crime until it was \"linked\" with other evidence and testimony presented at trial. In Richardson, the Supreme Court rejected this \"linkage\" theory, holding that a statement which did not facially incriminate the defendant was not excludable under Bruton merely because it became incriminating when \"linked\" with other evidence introduced at trial. Id. 481 U.S. at 208-09. Bello's statement, in and of itself, does not concede the couriers' knowledge of the heroin in the packages and, thus, does not directly incriminate Usman in the commission of a crime.\n\nEven assuming that Bello's statement somehow implicated Usman, we hold that the admission of the statement was harmless error. See Harrington v. California, 395 U.S. 250, 23 L. Ed. 2d 284, 89 S. Ct. 1726 (1969). The statement was cumulative of other evidence presented to establish Bello's and Usman's knowing participation in the conspiracy charged in this case. Specifically, the government elicited extensive testimony from the DEA agents and Customs officials, who described the events following the courier's arrest -- namely, the x-ray examinations revealing that the couriers had foreign objects in their pelvic areas, and the couriers' removal of the packages containing heroin from their vaginal cavities -- implicating Bello and Usman as couriers in the charged conspiracy. The government also presented the testimony of Adekunle Adefuye, who described in detail how he had recruited the three couriers to transport the heroin from Nigeria to New York and from New York to Chicago. Adefuye also stated that both Usman and Bello had been involved with him and Alli in another smuggling encounter prior to the one involved in this case. This testimony was admitted under Fed.R.Evid. 404(b) against Usman and Bello on the issue of their knowledge, intent and preparation.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e From our review of the record we are convinced that there was substantial evidence separate and apart from McCarthy's statement (assuming arguendo that it directly implicates Usman) from which the jury could reasonably conclude that Usman knowingly participated as a drug courier in the hierarchy of the conspiracy charged.\n\nThus, we conclude that the district court's action in receiving Bello's statement was proper because Usman's rights under Bruton were not violated by the admission of Bello's post-arrest statement. The statement in question did not serve to directly implicate Usman in the knowing possession of heroin, and even if it did, it was merely cumulative of other evidence presented to establish Usman's knowledge concerning the purpose of her trip to Chicago. See Cirrincione, 780 F.2d at 633. Under these circumstances, we refuse to hold that the court abused its discretion in admitting the statement.\n\nH. Exclusion of Adefuye's Wife's Medical Records\n\nAt trial, several of the defendants, including Alli and Bello, attempted to introduce medical records from a Los Angeles hospital involving the pregnancy of defendant Adefuye's wife. Adefuye had testified that he and his wife traveled to Los Angeles in April 1986 for the birth of their child. According to Adefuye, he and his wife went to Los Angeles in hopes that his wife might receive superior medical care during the delivery of their child because she had experienced complications during the births of their other children. The defendants attempted to introduce the testimony of a pediatric nurse who concluded that Mrs. Adefuye's records did not reflect that she had had such complications during her previous pregnancies. The defendants argued that these records established that Adefuye had lied concerning the true reasons for his trip to Los Angeles, thus impeaching his credibility as a government witness. The trial court refused to admit the records, ruling that the reasons for Adefuye's trip had been thoroughly covered on cross-examination and that the presentation of the records would result in an undue waste of court time. On appeal, defendants Alli and Bello argue that because much of the case against them was provided through Adefuye's testimony, attacking Adefuye's credibility was vitally important to their defense, and the trial court abused its discretion in denying the admission of the medical records. Trial courts are afforded broad discretion in refusing to admit evidence based on concerns of \"undue delay, waste of time, or needless presentation of cumulative evidence.\" Fed.R.Evid. 403; United States v. Davis, 772 F.2d 1339, 1342 (7th Cir. 1985). In light of the extensive cross-examination of Adefuye concerning his trip to Los Angeles, as well as his other drug-related activities, we are convinced that the jury had ample opportunity to assess his credibility and that the presentation of his wife's medical records would have been an unwarranted waste of precious judicial time in what was a long, protracted and tedious trial. Thus, we hold that the trial court did not abuse its discretion in refusing to admit Mrs. Adefuye's medical records.\n\nIV. SUFFICIENCY OF THE EVIDENCE\n\nSeveral of the defendants argue that their convictions on various counts in the indictment must be reversed because the government failed to present sufficient evidence to sustain the jury's verdict on these counts. Specifically, defendants Disu, Ajibade, Davies and Briscoe argue that the evidence presented at trial is insufficient to sustain their convictions on the conspiracy charge in Count One of the indictment. Defendants Orija, Erinle, Duale, Smith and Ajibade contend that there was insufficient proof that they used the telephone to facilitate a felony under the federal narcotics laws in violation of 21 U.S.C. § 843(b).\n\nBecause the jury had ample opportunity to view and weigh the evidence and the defendants were found guilty of participating in the charged conspiracy and/or facilitating a narcotics felony through the use of the telephone, they bear a heavy burden in overturning the jury's verdict on appeal. United States v. Grier, 866 F.2d 908, 922 (7th Cir. 1989). As we stated in United States v. Nesbitt: \"Initially, we 'review all the evidence and all the reasonable inferences that can be drawn from the evidence in the light most favorable to the government.'\" 852 F.2d 1502, 1509 (7th Cir. 1988) (quoting United States v. Pritchard, 745 F.2d 1112, 1122 (7th Cir. 1984)), cert. denied, 488 U.S. 1015, 109 S. Ct. 808, 102 L. Ed. 2d 798 (1989). \"Once a defendant has been found guilty of the crime charged, the factfinder's role as weigher of the evidence is preserved through a legal conclusion that upon judicial review all of the evidence is to be considered in the light most favorable to the prosecution.\" Jackson v. Virginia, 443 U.S. 307, 319, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979) (emphasis in original and footnote omitted). Thus, the relevant inquiry is whether, after viewing the evidence in this light, \"any rational trier of fact could have found the elements of the crime beyond a reasonable doubt.\" Id. at 319. \"Only when the record contains no evidence, regardless of how it is weighed, from which the jury could find guilt beyond a reasonable doubt, may an appellate court overturn the verdict.\" United States v. Whaley, 830 F.2d 1469, 1473 (7th Cir. 1987) (quoting United States v. Moore, 764 F.2d 476, 478 (7th Cir. 1985)), cert. denied, 486 U.S. 1009, 108 S. Ct. 1738, 100 L. Ed. 2d 201 (1988). After reviewing all of the evidence and the inferences drawn therefrom in the proper light, we are of the opinion that the defendants' various challenges to the sufficiency of the evidence are without merit.\n\nA. Conspiracy Count\n\nDefendants Disu, Ajibade, Davies and Briscoe contend that the evidence presented at trial is insufficient to sustain their convictions for conspiracy, alleging that the government failed to establish the existence of the single over-arching conspiracy charged in the indictment, as well as their participation in the conspiracy. They argue that the evidence adduced at trial demonstrates the existence of multiple conspiracies and that this variance between the charge in the indictment and the proof at trial requires reversal of their convictions.\n\nIn United States v. Varelli, 407 F.2d 735, 742 (7th Cir. 1969), this court explained the various elements necessary to establish a single conspiracy:\n\n\"Various people knowingly joining together in furtherance of a common design or purpose constitute a single conspiracy. While the conspiracy may have a small number of co-conspirators, other parties who knowingly participate with these co-conspirators and others to achieve a common goal may be members of an overall conspiracy.\n\nIn essence, the question is what is the nature of the agreement. If there is one overall agreement among the various parties to perform different functions in order to carry out the objectives of the conspiracy, the agreement among all the parties constitutes a single conspiracy.\"\n\n\"Once a conspiracy is shown to exist evidence that establishes a particular defendant's participation beyond a reasonable doubt, although the connection between defendant and conspiracy is slight, is sufficient to convict.\" United States v. Xheka, 704 F.2d 974, 988-89 (7th Cir.), cert. denied, 464 U.S. 993, 78 L. Ed. 2d 682, 104 S. Ct. 486 (1983) (citations omitted). Accord United States v. Diaz, 876 F.2d 1344, 1352 (7th Cir. 1989); Vega, 860 F.2d at 795. The government may establish a defendant's knowing participation in a single conspiracy by offering evidence that:\n\n\"[the] parties to the agreement were aware that others were participating in the scheme. The coconspirators must have 'knowingly embraced a common criminal objective.' . . . However, there is no requirement that the participants in the plan 'personally know the individuals involved . . . [as] long as the conspiracy continues and its goal is to achieve a common objective.'\"\n\nUnited States v. Boucher, 796 F.2d 972, 975 (7th Cir. 1986) (citations omitted). In other words, the government may establish that a defendant knowingly became a member of a single narcotics conspiracy \"'if each [defendant retailer] knew, or had reason to know, that other retailers were involved with the . . . organization in a broad project for the smuggling, distribution and retail sale of narcotics, and had reason to believe that their own benefits derived from the operation were probably dependent upon the success of the entire venture. . . .'\" United States v. Cerro, 775 F.2d 908, 911 (7th Cir. 1985) (emphasis in Cerro and citation omitted).\n\nIn establishing the existence of an overall conspiratorial agreement, as well as a particular defendant's participation therein, we note that it is perfectly legitimate for the government to offer and for the jury to consider circumstantial evidence. United States v. Vega, 860 F.2d 779, 793 (7th Cir. 1988). \"By its very nature, a conspiracy 'is conceived and carried out clandestinely, and direct evidence of the crime is rarely available.'\" United States v. Mayo, 721 F.2d 1084, 1088 (7th Cir. 1983) (quoting United States v. Washington, 586 F.2d 1147, 1153 (7th Cir. 1978)). Thus, \"'[not] only is the use of circumstantial evidence permissible, but circumstantial evidence may be the sole support for a conviction.\" United States v. Reed, 875 F.2d 107, 111 (7th Cir. 1989) (quoting Vega, 860 F.2d at 793-94) (emphasis in original and citations omitted). Although the jury's verdict may not rest \"solely on the piling of inference upon inference . . ., [the] view that the prosecution's case must answer all questions and remove all doubts . . . of course, is not the law because that would be impossible; the proof need only satisfy reasonable doubt.\" Nesbitt, 852 F.2d at 1511 (emphasis in original and citations omitted). Indeed, \"[juries] are allowed to draw upon their own experience in life as well as their common sense in reaching their verdict. . . . While '[common] sense is no substitute for evidence, . . . common sense should be used to evaluate what reasonably may be inferred from circumstantial evidence.'\" Id. (citations omitted).\n\nAfter reviewing the record in light of these standards, we are convinced that only one conspiracy existed in this case, the objects of which were to import heroin from Nigeria, and to a lesser extent Pakistan and India, and subsequently distribute this heroin in the Chicago area. In our opinion the evidence adduced at trial establishes a well-knit network of importers, couriers, distributors and dealers, with many of the participants acting in more than one capacity. After a review of the record, we are convinced that the testimony of the coconspirators who pled guilty, the substance of the intercepted telephone conversations among the coconspirators, the undercover purchases made by undercover agents, as well as other direct and circumstantial evidence, taken together, establish the growth of a single, albeit complex, well-organized, sophisticated and disciplined drug distribution network and the various defendants' roles therein. Shittu admitted that he began distributing heroin in 1984, using defendants Disu and Ajibade as his principle sources of supply. According to Shittu, both Disu and Ajibade obtained their heroin by importing it from Nigeria, as well as from domestic suppliers. By 1985, Shittu, Disu and Ajibade had established a substantial distribution operation, supplying many Chicago heroin dealers, including Fannie Chambers and defendant Leonard Smith, with the bulk of their heroin. During 1985, Ogundipe was brought into the business, eventually becoming the sole supplier to many of Shittu's customers. Also during 1985, Shittu and Ogundipe began obtaining heroin from defendant Taiwo (in addition to Disu and Ajibade), who informed them that he imported heroin from Pakistan through the use of body-cavity couriers. In 1986, Shittu and Ogundipe further increased their sources of supply, as well as the number of street dealers whom they themselves supplied. Specifically, they began obtaining heroin from defendants Davies, Orija, Erinle and Dina for resale to defendants Duale, King, Manning and Ijitola, in addition to Smith.\n\nIn the fall of 1986, Shittu traveled to Nigeria and met with defendants Alhaji Tunde Agbabs and Shade Ajimati, Agbabs' wife. The two informed Shittu that they wanted to establish a distribution connection in Chicago. In September of 1986, Agbabs traveled to Chicago to discuss the details of importing heroin with Shittu and Ogundipe. Thereafter, Agbabs and Ajimati began shipping heroin to Chicago via body-cavity couriers. The following month, they arranged, in conjunction with defendants Michael Alli and Adekunle Adefuye, the trip involving defendants Usman, Bello and Aderemi for the purpose of transporting a half kilogram of heroin to Shittu in Chicago. Even after Adefuye and the three couriers were arrested, Agbabs continued to supply Shittu and Ogundipe, as well as Disu, with heroin. In late October, Agbabs' wife, Shade Ajimati, delivered four ounces of heroin to Shittu in Chicago. Shortly after this trip took place, the defendants were arrested.\n\nThe defendants contend that this evidence, at best, establishes a \"wheel\" conspiracy, see Kotteakos v. United States, 328 U.S. 750, 90 L. Ed. 1557, 66 S. Ct. 1239 (1946), with Shittu as its hub and the other defendants as the spokes, all acting independently of one another. We consider this characterization of the hierarchy of the conspiracy to be an unusual view of the facts in this case. The evidence demonstrates a well-organized chain of distribution, from the importers through the street dealers, with each link in the distribution chain mutually dependent on the others. Such mutual dependence is indicative of a single conspiracy. See Percival, 756 F.2d at 607. The defendants, in an effort to establish approximately six conspiracy networks, dissect the various links in the distribution chain, arguing that each is a single conspiracy in its own right, formed pursuant to a separate agreement. However, the defendants' argument completely ignores the interdependence among the members of the organization: from the importers to the couriers to the distributors to the dealers. In any case, this strained interpretation of the facts is not well reasoned because separate agreements often form the basis for finding the existence of a single ongoing conspiracy if the parties to such agreements are \"joined by their knowledge of [the conspiracy's] essential features and broad scope, though not of its exact limits, and by their common goal.\" Blumenthal v. United States, 332 U.S. 539, 558, 92 L. Ed. 154, 68 S. Ct. 248 (1947). Although it is true that the defendant Shittu was the central figure in this distribution chain, with Ogundipe also playing a substantial role, the total picture of the enterprise, including but not limited to the transcripts of Shittu's and Ogundipe's telephone conversations with their suppliers, clearly establish that the suppliers were well aware that Shittu and Ogundipe were purchasing heroin for resale to the street dealers--namely, Smith, Ijitola, Manning and King--all of whom supported their heroin habits by selling to other heroin users. The fact that many of these suppliers, as well as the street dealers, may have been operating separately from and independently of one another at times, is irrelevant. It is well settled that a single conspiracy may consist of \"a small core of people with whom other conspirators knowingly participate to achieve the common purpose of the conspiracy.\" United States v. Noble, 754 F.2d 1324, 1329 (7th Cir.), cert. denied, 474 U.S. 818, 88 L. Ed. 2d 51, 106 S. Ct. 63 (1985). It is equally well established that the parties involved in a single conspiracy need not know one another or participate in every aspect of the conspiracy, id. at 1329, although the evidence in this case clearly elucidates the defendants' familiarity with one another, as well as, in many instances, their knowledge of the other defendants' roles within the operation. In any case, as long as the evidence demonstrates that the \"coconspirators . . . 'knowingly embraced a common criminal objective,'\" this is sufficient to establish the existence of a single overall conspiracy among the coconspirators. Boucher, supra, 796 F.2d at 975. The evidence presented in this case leaves no room for doubt that the defendants, performing various roles and operating through different individuals, embraced the common objective to import and distribute a large amount of heroin. Thus, we conclude that the government presented sufficient evidence from which the jury could conclude beyond a reasonable doubt that there existed a single conspiracy to import and distribute heroin in the Chicago, Illinois, area.\n\nWe are also convinced from our review of the record that a reasonable jury could find beyond a reasonable doubt that Disu, Ajibade and Davies knowingly became members of and actively participated in the heroin importation and distribution conspiracy charged in Count One of the indictment. As stated above, Disu and Ajibade began supplying Shittu with heroin in 1984. According to Shittu, both Disu and Ajibade obtained heroin from various suppliers, in addition to employing couriers to smuggle heroin from Nigeria. In 1985 and 1986, Disu and Ajibade continued to supply Shittu, as well as Ogundipe, with heroin. During 1986, Davies, who also imported heroin, began supplying the Shittu/Ogundipe distribution network with heroin. The evidence clearly establishes that these defendants were aware of the fact that Shittu and Ogundipe had other suppliers, such as Taiwo and Agbabs. Thus, the evidence demonstrates that these individuals had more than the required slight connection to the core group of conspirators and were obviously well aware of the fact that they were not the only suppliers providing Shittu and Ogundipe with heroin.\n\nThe defendants argue that much of the evidence against them was provided by Shittu, either through direct testimony of his transactions with them or through his identifying their voices on tape, and that Shittu was an extremely unreliable witness. As we have in the past, we again emphasize that\n\n\"we defer to the jury's determination of witnesses' credibility. As we noted in United Sites v. Ramirez, 796 F.2d 212, 214 (7th Cir. 1986): 'An appellate court will not weigh the evidence or assess the credibility of the witnesses.' Similarly, we have stated: '\"It is well settled law that a court of appeals does not stand in judgment of the credibility of the witnesses. Rather that question is left to the sound judgment of the trier of fact.\"' United States v. Perry, 747 F.2d 1165, 1170 (7th Cir. 1984) (quoting United States v. Roman, 728 F.2d 846, 856 (7th Cir. 1984)). Finally, 'the credibility of witnesses is peculiarly within the province of the jury and our review of credibility is prohibited absent extraordinary circumstances.' United States v. Noble, 754 F.2d 1324, 1332 (7th Cir. 1985).\"\n\nVega, 860 F.2d at 794. Shittu was extensively cross-examined by the respective defense counsel, both as to his direct testimony and his identifications of the voices on tape. Moreover, the jury was fully apprised of the details of Shittu's plea agreement with the government and, thus, his motives for testifying as a government witness. In our opinion, the jury had ample opportunity to determine Shittu's credibility. Thus, we reject the defendants' attack on the evidence against them based solely on Shittu's credibility. Such a determination was within the exclusive province of the jury. Based on the evidence discussed heretofore, as well as other evidence in the record, we are convinced that a jury, exercising well-reasoned judgment could and did conclude that Disu, Ajibade and Davies \"knowingly embraced a common criminal objective\" to import and distribute heroin in Chicago. Thus, we affirm the respective convictions of Disu, Ajibade and Davies on the conspiracy charge in Count One of the indictment.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe evidence with regard to defendant Briscoe, however, is not as overwhelming as that against Disu, Ajibade and Davies. Briscoe essentially concedes that the evidence demonstrates that she was well aware of the charged conspiracy based on the fact that she was living with Ogundipe and was present during two of his transactions with undercover law enforcement officials. Her specific contention is that she never became a knowing participant in the conspiracy and, thus, that her conviction must be reversed. The government candidly admits that the evidence tying Briscoe to the conspiracy in this case is \"unquestionably less extensive than that admitted against any other defendant.\" Nonetheless, the government argues that the evidence, viewed in the light most favorable to the government, demonstrates that Briscoe knowingly participated in the heroin distribution network in which Ogundipe was an integral part. We agree.\n\nOn January 24, 1986, CPD Officer Nathaniel Reed met Briscoe when he arrived at the apartment where she and Ogundipe resided. Officer Reed, in an undercover capacity, was attempting to, and did in fact, purchase heroin from Ogundipe. Reed testified at trial concerning the details of this transaction, including Briscoe's participation therein. Specifically, after Reed arrived, Ogundipe asked Briscoe to leave the apartment to go pick up a \"package.\" Although Officer Reed did not hear Ogundipe tell Briscoe to get heroin, he clearly understood that was her purpose because Ogundipe told him that Briscoe was picking up an additional half ounce of heroin for Reed. A short time later, Briscoe returned with a small paper bag, and Ogundipe asked if she \"got it,\" to which she replied, \"Yes.\" Briscoe and Ogundipe went into the bedroom, and Ogundipe returned a few minutes later with a plastic bag containing an ounce of heroin. Ogundipe weighed the heroin and sold it to Reed for $7,000. According to Reed, Briscoe was \"in and out\" of the bedroom during the course of the transaction, walking within \"a couple of feet\" of where the sale took place. Further, Shittu testified that Ogundipe used Briscoe as a decoy in order to hide the fact he kept the heroin in his apartment. That is, Ogundipe would send Briscoe out of the apartment and tell her to return a short time later. According to Shittu, Ogundipe did this in order to avoid a potential \"stickup\" if others found out about the location of the heroin. Two other circumstantial facts support the inference that Briscoe knowingly participated in the conspiracy. First, DEA Agent Robert Smith, also involved in an undercover operation, purchased one ounce of heroin for $7,500 from Shittu at Ogundipe's apartment on March 13, 1986. During the transaction Briscoe entered the apartment, and Smith attempted to hide the heroin. Ogundipe informed Smith that Briscoe was \"all right.\" Second, Shittu testified that Ogundipe kept some of his heroin supply at Briscoe's mother's house in Chicago.\n\nThe jury concluded, based on the totality of the evidence offered, that the evidence against Briscoe established that Briscoe knowingly participated in the overall conspiracy to distribute heroin. Based on this evidence, we cannot say on this record that the jury acted irrationally in reaching this conclusion. Under Jackson v. Virginia, supra, this determination ends our inquiry on this issue. See Vega, 860 F.2d at 800. Thus, we affirm Briscoe's conviction on the conspiracy charge.\n\nB. Telephone Facilitation Counts\n\nDefendants Orija, Erinle, Duale, Smith and Ajibade argue that the evidence was insufficient to establish their convictions under 21 U.S.C. § 843(b)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e for using the telephone to facilitate the violation of the federal narcotics laws. In order to prove a violation of this section, \"the Government must establish that the defendant knowingly and intentionally used a communications facility, e.g., a telephone, to facilitate the commission of a narcotics offense.\" United States v. Alvarez, 860 F.2d 801, 813 (7th Cir. 1988) (quoting United States v. Phillips, 664 F.2d 971, 1032 (5th Cir. Unit B 1981)). The government alleged at trial that the defendants used the telephone to facilitate the following offenses: importation of heroin, possession with intent to distribute heroin, distribution of heroin, as well as conspiracy and attempt to commit such offenses. The defendants present several arguments challenging the government's proof supporting their convictions under section 843(b). We address these arguments in turn.\n\nThe defendants initially contend that the government failed to establish that the telephone calls serving as the basis for the counts charging them with section 843(b) violations resulted in actual distributions of heroin, which, according to them, is a requirement of demonstrating a violation of that section. In support of this argument, the defendants cite the reasoning applied in United States v. Leslie, 411 F. Supp. 215 (D.Del. 1976), urging us to adopt the holding therein. In Leslie, the court held that proof of an underlying actual, consummated substantive offense under the federal narcotics laws is a necessary predicate for a section 843(b) conviction. In so holding, the court stated that a section 843(b) violation could not be premised upon an inchoate offense, such as attempt or conspiracy. The court reached this result by comparing section 843(b) with its predecessor, 18 U.S.C. § 1403(a) (1964), which proscribed the use of a communication facility \"in committing or in causing or facilitating the commission of, or in attempting to commit, any act or acts constituting an offense or a conspiracy to commit [various substantive narcotics offenses]. . . .\" The court concluded that the failure to carry over the conspiracy and attempt language of section 1403(a) to 21 U.S.C. § 843(b) evinced a congressional intent not to make narcotics conspiracies and attempts to commit substantive narcotics violations subject to communications facility charges. See United States v. Farrar, 470 F. Supp. 128, 129 (S.D.Miss. 1979). The government contends that the holding in Leslie has been uniformly rejected and that the defendants were properly convicted of the section 843(b) counts because the telephone calls facilitated the conspiracy to import and distribute heroin. We agree.\n\nA review of the case law from circuits that have addressed this issue demonstrate that appellants' reliance on Leslie is ill-advised due to the fact that its reasoning and holding have largely been abandoned. In United States v. Pierorazio, 578 F.2d 48, 51 (3d Cir.), cert. denied, 439 U.S. 981, 58 L. Ed. 2d 652, 99 S. Ct. 568 (1978), the Third Circuit rejected the reasoning in Leslie, stating that:\n\n\"Section 843(b) makes criminal the use of a telephone 'in committing, or in causing or facilitating the commission of any act or acts constituting a felony under any provision of this subchapter [subchapter I] or subchapter II of this chapter [chapter 13 of Title 21].' Included within subchapter I is section 846, which makes it a felony for a person to attempt or conspire to commit any offense defined in subchapter I (such as distribution or possession with intent to distribute, defined as offenses in section 841). In other words, attempt to distribute a controlled substance, conspiracy to distribute a controlled substance, attempt to possess a controlled substance with intent to distribute it, and conspiracy to possess a controlled substance with intent to distribute it, are all felonies under provisions of subchapter I. As such, they are plainly included within the terms of section 843(b).\n\nWe can discern nothing in the legislative history,[] nor has any policy been advanced, which would call for a different result.[] Hence, the fact that particular language found in former section 1403(a) was thereafter omitted from section 843(b) does not persuade us that Congress intended to preclude a section 843(b) facilitation conviction where the underlying felony is attempt or conspiracy under section 846.\"\n\n(Emphasis in original and footnotes omitted). Decisions from the Second, Fifth, Sixth, Ninth and Tenth Circuits are in accordance with the Third Circuit's holding in Pierorazio. See United States v. McGhee, 854 F.2d 905, 908 (6th Cir. 1988); United States v. Rey, 641 F.2d 222, 224 n. 6 (5th Cir.), cert. denied, 454 U.S. 861, 70 L. Ed. 2d 160, 102 S. Ct. 318 (1981); United States v. Watson, 594 F.2d 1330, 1343 (10th Cir.), cert. denied, 444 U.S. 840, 62 L. Ed. 2d 51, 100 S. Ct. 78 (1979); United States v. Rodriguez, 546 F.2d 302, 307-08 (9th Cir. 1976); United States v. Steinberg, 535 F.2d 1126, 1133 (2d Cir. 1975), cert. denied, 425 U.S. 971, 48 L. Ed. 2d 794, 96 S. Ct. 2167 (1976).\n\nAlthough this Court has not dealt expressly with this issue, it is worth noting that in United States v. Keck, 773 F.2d 759 (7th Cir. 1985), without expressly addressing the argument raised herein, we upheld a defendant's section 843(b) conviction where the underlying offense was conspiracy to distribute a controlled substance in violation of 21 U.S.C. § 846. In any case, we agree with the reasoning set forth in Pierorazio and the cases cited above and hold that a violation of 21 U.S.C. § 843(b) may be premised on the facilitation of a narcotics conspiracy, a felony under 21 U.S.C. § 846. In view of our holding in section IV.A. of this opinion that there was sufficient evidence to establish the existence of a conspiracy to import and distribute heroin, we conclude that the government established the required predicate offense for the defendants' section 843(b) convictions.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe defendants next argue that even if the conspiracy charge was an adequate underlying offense for their section 843(b) convictions, the government nevertheless failed to establish that the telephone calls \"facilitated\" the conspiracy. According to them, the calls could not have facilitated the conspiracy because they were short and innocuous, and because the word \"heroin\" was never specifically mentioned in any of the conversations.\n\nThe defendants conveniently overlook the fact that this court has stated on a number of occasions that the absence of an explicit reference to the name of the drug in question does not prevent a rational trier of fact from inferring that the conversations concerned the drug in question. Indeed, in Zambrana, supra, we stated:\n\n\"[The] content of the telephone conversations between Jesus and Jay Zambrana and the other co-conspirators provided direct evidence tying them to the attempted delivery of cocaine. . . . Although the word 'cocaine' was never referred to in any of the conversations, the trial judge could properly have accepted the government's contention that phrases such as 'metallic paint' were used as code words to allude to the illegal drugs.\"\n\n841 F.2d at 1346. Furthermore, in Vega, supra, we observed:\n\n\"In this case the jury was confronted with conversations which contained 'code words' that, when considered in isolation, might seem unclear, veiled, and almost nonsensical, but when analyzed properly, in the context of the totality of the evidence, can be clearly seen to be 'code words' for drugs.\n\nIt is true that, advisedly, no explicit mention was ever made of cocaine or other drugs in any of Vega's conversations with the Zambranas. However, a case was made, which was more than strong enough to convince the jury, the trier of fact, that Vega used terms like 'chickens,' 'roosters' and 'it' as code words for drugs.\"\n\n860 F.2d at 795. Finally, in United States v. Zanin, 831 F.2d 740, 744 (7th Cir. 1987), we stated:\n\n\"Conversations regarding drug transactions are rarely clear. A fact finder must always draw inferences from veiled illusions and code words.\n\nIn light of our recent holdings, we reject the defendants' argument that there was insufficient evidence to convict them on the telephone counts due to the absence of express references to \"heroin\" in the tape-recorded conversations in question. Thus, we hold that a rational jury could and did conclude based on the substance of the conversations, as well as the identifications of the various coconspirators during the course of the conversations, that the telephone calls facilitated the conspiracy to import and distribute heroin. Accordingly, we affirm the defendants' convictions under 21 U.S.C. § 843(b).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nV. JURY INSTRUCTIONS\n\nSeveral of the defendants contend that the district court erred in refusing to include their proposed instructions in the instructions submitted to the jury. Specifically, defendants Disu, Ajibade, Davies and Briscoe challenge the district court's refusal to instruct the jury that if the evidence established multiple conspiracies to its satisfaction, as opposed to the single conspiracy charged in the indictment, it was required to acquit them of the conspiracy charge in Count One. Defendants Orija, Erinle, Duale and Smith contend that it was error for the district court to reject their instruction that a person who merely buys narcotics for his own use is not guilty of conspiracy in favor of the government's instruction on that issue. The defendants argue that the trial court's refusal to submit their proposed jury instructions denigrated their respective theories of defense, thus denying them a fair trial.\n\nWe initially set forth the standards under which we evaluate the defendants' claims that they were entitled to their proposed jury instructions. \"'[The] defendant in a criminal case is entitled to have the jury consider any theory of the defense which is supported by the law and which has some foundation in the evidence, however tenuous.'\" United States v. Boucher, 796 F.2d 972, 975 (7th Cir. 1986) (quoting United States v. Grimes, 413 F.2d 1376, 1378 (7th Cir. 1969)). \"However, the defendant is not necessarily entitled to have his or her particular instruction presented to the jury . . .; rather, the defendant is only entitled to have his or her theory of defense presented to the jury.\" United States v. Douglas, 818 F.2d 1317, 1320 (7th Cir. 1987). In Douglas, this court held that a defendant is entitled to an instruction on his or her theory of defense if the following four-part test is satisfied:\n\n\"the defendant proposes a correct statement of the law; the defendant's theory is supported by the evidence; the defendant's theory of defense is not part of the charge; and the failure to include an instruction on the defendant's theory of defense in the jury charge would deny the defendant a fair trial.\"\n\nId. at 1320-21. In determining whether a trial court erred in refusing to tender a particular jury instruction, this court has repeatedly emphasized that we consider the jury instructions ultimately submitted in their entirety:\n\n\"When examining the sufficiency of jury instructions we must examine the jury charge as a whole, rather than focus on isolated passages. Moreover, because '\"a judgment of conviction is commonly the culmination of a trial which includes testimony of witnesses, argument of counsel, receipt of exhibits in evidence and instruction of the jury by the judge,\"' we review the instructions in the context of the overall trial and the arguments by counsel.\"\n\nUnited States v. Bailey, 859 F.2d 1265, 1277 (7th Cir. 1988) (citations omitted). With these standards in mind we turn to the merits of the defendants' arguments.\n\nA. Multiple Conspiracy Instruction\n\nDisu, Ajibade, Davies and Briscoe premise their challenge to the trial court's failure to tender a multiple conspiracy instruction largely on their contention that the evidence adduced at trial demonstrated the existence of multiple conspiracies, none of which involved them, rather than the single overall conspiracy charged in Count One. In the previous section of this opinion we rejected the defendants' challenge to the sufficiency of the government's proof, holding that the jury could properly conclude beyond a reasonable doubt that Disu, Ajibade, Davies and Briscoe were knowing participants in a single overall conspiracy. This holding, however, does not end our inquiry into the appellants' argument for a multiple conspiracy jury instruction because they contend that their theory of defense found at least some support in the evidence adduced at trial, which is all that is required under Boucher, supra.\n\nAt the outset, we note that of the above defendants-appellants, only Davies tendered a multiple conspiracy instruction to the trial court.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e This procedural background is important because it determines our standard of review. Our standard of review of the district court's refusal to give Davies' multiple conspiracy instruction is whether Davies alone was prejudiced by this refusal. Because Disu, Ajibade and Briscoe failed to propose multiple conspiracy instructions of their own or join in Davies' request for such an instruction, they have waived this argument on appeal and, thus, we review their claims under the more stringent \"plain error\" standard. See United States v. Grier, 866 F.2d 908, 932 (7th Cir. 1988); United States v. McGrath, 811 F.2d 1022, 1024 (7th Cir. 1987).\n\nThe main thrust of the defendants' argument is that the trial court's tendered instructions allowed the jury to consider against them evidence pertaining to other defendants without initially finding that they and the other defendants participated in the single conspiracy charged in the indictment. We disagree. The following Instructions were given to the jury regarding the conspiracy charge in Count One:\n\n\"In order to establish the offense of conspiracy, the government must prove these elements beyond a reasonable doubt :\n\n1. that the alleged conspiracy existed,\n\n2. that the defendant knowingly and intentionally became a member of the conspiracy.\n\nA conspiracy is a combination of two or more persons to accomplish an unlawful purpose. A conspiracy may be established if its purpose was not accomplished.\n\nIn determining whether the alleged conspiracy existed, you may consider the actions and statements of all the alleged participants.\n\nThe agreement may be inferred from all the circumstances and the conduct of all the alleged participants.\n\nIn determining whether the defendant became a member of the conspiracy you may consider only the acts and statements of that particular defendant.\n\nTo be a member of the conspiracy, the defendant need not join at the beginning or know all the other members or the means by which the purpose was to be accomplished. The government must prove beyond a reasonable doubt, from the defendant's own acts and statements, that he was aware of the common purpose and was a willing participant.\"\n\nThe district court also instructed the jury:\n\n\"Although the defendants are being tried jointly, you must give separate consideration to each defendant. In doing so you must analyze what the evidence in the case shows with respect to each defendant, leaving out of consideration any evidence admitted solely against some other defendant or defendants. Each defendant is entitled to have his or her case decided on the evidence and the law applicable to him or her.\"\n\nThese instructions make it clear that the jury could convict a defendant only if it found, as an initial matter, that the government had established the existence of the alleged (thus, a single) conspiracy and could consider the evidence of other defendants' actions against them only if they knowingly became a member of that conspiracy, a determination based solely on the \"acts and statements of that particular defendant.\" The second instruction set forth above reiterates the jury's duty to \"give separate consideration to each defendant.\" We have previously held similar instructions to be sufficient to apprise the jury on the necessity of determining whether an individual defendant was a knowing participant in a single overall conspiracy as charged in the indictment. See Grier, 866 F.2d at 933.\n\nIn addition, we are of the opinion that the defendants were not entitled to a multiple conspiracy instruction in this case because such an instruction was without support in the record. As noted above, the defendants' argument that they were entitled to such an instruction rests primarily on their argument, unsupported in the record, that there were six separate conspiracies among the defendants in this case. As we discussed in Section IV.A. of this opinion, this allegation is based on a tortured view of the evidence presented at trial. Although our prior cases require a multiple conspiracy instruction in certain cases, see, e.g., United States v. Abraham, 541 F.2d 1234, 1238-39 (7th Cir. 1976), cert. denied, 429 U.S. 1102, 51 L. Ed. 2d 553, 97 S. Ct. 1128 (1977), we believe that the trial court's determination that such an instruction was not required in this case was proper.\n\nThus, the trial court's refusal to tender a multiple conspiracy instruction to the jury did not prejudice Davies because the instructions, as given, sufficiently apprised the jury that they had to find that Davies had participated in the charged conspiracy before considering evidence pertaining to the other coconspirators against him, and, furthermore, because Davies' multiple conspiracy theory is without support in the record. It necessarily follows that Disu, Ajibade and Briscoe have failed to establish that the trial court's refusal to instruct the jury regarding the existence of multiple conspiracies was \"plain error.\" We affirm the decision of the experienced trial judge that the defendants were not entitled to a multiple conspiracy instruction.\n\nB. Buyer/Seller Instruction\n\nOrija, Erinle, Duale and Smith claim that the district court improperly rejected their proposed instruction concerning their theory of defense that they were mere purchasers from the conspiracy in favor of the government's instruction on the same theory. The defendants' proposed instruction read as follows:\n\n\"Mere proof of the existence of a buyer-seller relationship is not enough to convict one as a co-conspirator on drug conspiracy charges.\"\n\nThe government's instruction, which was submitted to the jury, provided:\n\n\"Mere proof of the existence of a buyer-seller relationship where the buyer does not intend to resell the drug is not enough to convict one as a co-conspirator on a drug conspiracy charge. Proof that a defendant merely purchased heroin for personal consumption, without more, is insufficient to prove that defendant is a member of an alleged conspiracy. One who buys from a conspirator for resale is a member of the conspiracy if he knows at least its general aims.\"\n\nIt is readily apparent from a comparison of these two instructions that the defendants' instruction is included, almost verbatim, within the instruction ultimately submitted to the jury. Based on this fact the government argues that the defendants have failed to meet the third prong of the Douglas test -- namely, that the defendants' theory of defense was not part of the trial court's charge to the jury. We agree. The defendants' contention that the proffered instruction \"denigrates\" their theory of defense is ridiculous. The instruction given the jury incorporates language taken directly from prior decisions of this court on the buyer/seller issue. See Douglas, 818 F.2d at 1321 (\"Proof of a mere buyer-seller relationship, without more, is inadequate to tie the buyer to a larger conspiracy\"); United States v. Marks, 816 F.2d 1207, 1212 (7th Cir. 1987) (\"[One] who buys from a conspirator for resale is a member of the conspiracy if he knows at least its general aims\"). Thus, because the buyer/seller instruction ultimately given to the jury includes the defendants' proffered instruction and, in any event, is a more complete statement of conspiracy law than the instruction proposed by the defendants, we hold that the defendants were in no way prejudiced by the buyer/seller instruction the trial court submitted to the jury.\n\nVI. JOINDER AND SEVERANCE\n\nDefendants Disu, Ajibade, Davies, Dina, Ogundipe and Ijitola allege that the trial court improperly denied their pretrial motions for relief from improper joinder under Fed.R.Crim.P. 8. These defendants, joined by defendants Orija, Erinle, Duale and Smith, further contend that the trial court erred in denying their motions for severance under Fed.R.Crim.P. 14.\n\nA. Joinder\n\nWhen two or more defendants are involved in a joint indictment, our analysis of the joinder question proceeds under Fed.R.Crim.P. 8(b). See United States v. Alvarez, 860 F.2d 801, 823-24 (7th Cir. 1988); United States v. Moya-Gomez, 860 F.2d 706, 766 (7th Cir. 1988), cert. denied, 492 U.S. 908, 106 L. Ed. 2d 571, 109 S. Ct. 3221 (1989); United States v. Velasquez, 772 F.2d 1348, 1352-53 (7th Cir. 1985). \"Rule 8(b) allows charging in the same indictment two or more offenders only 'if they are alleged to have participated in the same act or transaction or in the same series of acts or transactions constituting an offense or offenses.'\" Moya-Gomez, 860 F.2d at 766 (quoting Fed.R.Crim.P. 8(b). Proper joinder of defendants, thus, \"depends on the meaning of 'same series of acts or transactions.' The usual meaning is acts or transactions that are pursuant to a common plan or common scheme, which is to say (in the usual case) that the acts or transactions are parts of a single conspiracy.\" Velasquez, 772 F.2d at 1353 (citations omitted). As we have recognized: \"It is well established that a conspiracy charge is a proper basis for joinder under Rule 8(b).\" United States v. Garner, 837 F.2d 1404, 1412 (7th Cir. 1987), cert. denied, 486 U.S. 1035, 108 S. Ct. 2022, 100 L. Ed. 2d 608 (1988); United States v. Dounias, 777 F.2d 346, 348 (7th Cir. 1985) (\"Conspiracy charges . . . can provide the bond that links the divergent substantive crimes into a single transaction for Rule 8(b) purposes\").\n\n\"Proper joinder is determined from the face of the indictment.\" United States v. Bruun, 809 F.2d 397, 406 (7th Cir. 1987). \"Rule 8(b) only requires that the conspiracy be alleged -- there is no requirement that the government demonstrate, at the pleading stage, sufficient evidence to support joinder.\" Garner, 837 F.2d at 1412.\n\nThere is little doubt that the defendants in this case were properly joined. Count One of the indictment charges the defendants with conspiring to possess with intent to distribute and to distribute heroin and to facilitate through the use of the telephone the importation, possession with intent to distribute, and distribution of heroin. This count properly charges the existence of a single conspiracy as it covers all aspects of the conspiracy, from the importers to the couriers to the distributors to the street dealers. Thus, the conspiracy charge provides a sufficient basis to join the defendants in this case. See Garner, supra. Our conclusion is supported by our holding in section IV.A. that the government's proof at trial established the existence of a single overall conspiracy. Thus, we hold that the defendants' claims that they were improperly joined with the other defendants are without merit.\n\nB. Severance\n\n\"As the Supreme Court has said, 'once the Rule 8 requirements [are] met by the allegations in the indictment, severance thereafter is controlled entirely by Federal Rule of Criminal Procedure 14. . . ., United States v. Lane, 474 U.S. 438, 447, 88 L. Ed. 2d 814, 106 S. Ct. 725 (1986) (interpreting Schaffer v. United States, 362 U.S. 511, 4 L. Ed. 2d 921, 80 S. Ct. 945 (1960)).\" Garner, 837 F.2d at 1412. In Moya-Gomez, supra, 860 F.2d at 754, we recently summarized our standard for reviewing a district court's severance decision:\n\n\"Rule 14 permits the trial court in the exercise of its discretion to grant separate trials when the interests of justice so require. A district court's ruling on a Rule 14 severance motion will be overturned only upon a showing of abuse of discretion. Because the balancing of the cost of conducting separate trials and the possible prejudice inherent in a single trial is best conducted by the trial court, the defendant bears an extremely difficult burden of showing on appeal that the district court abused its discretion. In order to appeal successfully the denial of a severance motion, a defendant must establish actual prejudice resulting from the denial. Actual prejudice means that the defendant could not have a fair trial without severance, '\"not merely that a separate trial would offer him a better chance of acquittal.\"' [United States v. Peters, 791 F.2d 1270, 1301 (7th Cir.), cert. denied, 479 U.S. 847, 107 S. Ct. 168, 93 L. Ed. 2d 106 (1986)] (quoting United States v. Papia, 560 F.2d 827, 836 (7th Cir. 1977)).\"\n\n(Footnote and citations omitted). The defendants, in challenging the trial court's denial of their severance motions, allege two different reasons, which, in their view, required the district court to sever their trials. First, Disu, Ajibade, Davies, Dina, Ogundipe and Ijitola premise their severance claims on their contention that a large portion of the evidence presented had nothing whatsoever to do with them and that the \"spillover\" from this evidence prejudiced the jury in its consideration of their individual cases. Second, Disu, Ajibade, Davies and Orija allege that their motions for severance should have been granted because Ijitola's defense was allegedly \"mutually antagonistic\" to their own.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e We address each of these claims separately.\n\n1. \"Spillover\" Effect of Evidence\n\nThe primary contention of Disu, Ajibade, Davies, Dina, Ogundipe and Ijitola is that by virtue of their joint trial, they were substantially prejudiced through the introduction of evidence concerning the international drug trafficking activities of defendants Alli, Adefuye, Usman, Bello and Aderemi. The contention of the first three appellants is essentially a rehash of their multiple conspiracy argument. Although the latter three appellants do not raise a specific variance argument, their allegations in support of severance also rest on the theory that more than one conspiracy existed in this case. Thus, their argument, essentially, is that the trial court's admission of this evidence was improper because they were not \"tied\" to the smuggling activities of Alli, Adefuye and the couriers.\n\n\"In considering a motion for severance, the trial judge should give deference to the 'strong public interest in having persons jointly indicted tried together, particularly where, as here, a conspiracy is charged and may be proved by evidence that arises out of the same act or series of acts.'\" United States v. Percival, 756 F.2d 600, 610 (7th Cir. 1985) (quoting Papia, 560 F.2d at 836-37). We explained the policy underlying this rule in detail in United States v. Buljubasic, 808 F.2d 1260, 1263 (7th Cir. 1987):\n\n\"There is a strong interest in joint trials of those who engaged in a criminal enterprise. Joint trials reduce the expenditure of judicial and prosecutorial time; they reduce the claims the criminal justice system makes on witnesses, who need not return to court for additional trials; they reduce the chance that each defendant will try to create a reasonable doubt by blaming an absent colleague, even though one or the other (or both) undoubtedly committed a crime. The joint trial gives the jury the best perspective on all the evidence and therefore increases the likelihood of a correct outcome.\"\n\n(Citations omitted).\n\nPreviously in this opinion we have held that the evidence in this case establishes the existence of one, single, overall conspiracy and that the October 1986 trip involving Alli, Adefuye and the female couriers was an act in furtherance thereof. We have also held that Disu, Ajibade and Davies were knowing participants in this conspiracy. Although Ogundipe, Dina and Ijitola do not raise a sufficiency of the evidence argument on appeal, we are of the opinion that the evidence establishing their knowing participation in the heroin importation and distribution network is compelling. Ogundipe was clearly Shittu's right-hand man in the Chicago area of this operation. Both Dina and Ijitola had substantial contacts with the other members of the conspiracy, including \"core\" members Ogundipe and Shittu. More importantly, there is ample evidence in the record demonstrating that each had knowledge of Shittu's connection with Agbabs and their agreement to import heroin from Nigeria to Chicago. Indeed, Ogundipe was present during Agbabs' initial trip to Chicago. Based on these facts, the evidence of the October trip would in all probability have been admissible against any of these defendants in a separate trial. Thus, in terms of the alleged prejudice resulting from this evidence, we fall to comprehend how a separate trial would have differed significantly from the joint trial held in the trial court. See United States v. Diaz, 876 F.2d 1344, 1358 (7th Cir. 1989).\n\nWith regard to evidence which was admissible only against certain defendants, e.g., evidence of the drug trafficking activities of Alli, Adefuye and the couriers prior to the October 1986 trip and evidence of Ajibade's document theft, the trial court was meticulous in its effort to admonish the jury in each instance that it was to consider this evidence only against those individuals. These admonitions were reiterated in the court's final instructions to the jury.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Nonetheless the defendants contend that these instructions could not have cured the prejudice arising from this evidence. Simply stated, the defendants argue that the jury was unable to follow the court's limiting instructions. This contention directly contradicts this court's statement in United States v. Williams, 858 F.2d 1218, 1225 (7th Cir. 1988), that \"[juries] . . . are presumed capable of sorting through the evidence and considering the cause of each defendant separately.\" In this regard, the Supreme Court has observed: \"To say that the jury might have been confused amounts to nothing more than an unfounded speculation that the jurors disregarded clear instructions of the court in arriving at their verdict. Our theory of trial relies upon the ability of a jury to follow instructions.\" Opper v. United States, 348 U.S. 84, 95, 99 L. Ed. 101, 75 S. Ct. 158 (1954). In addition to the limiting instructions concerning the specific evidence, the trial court gave the very clear and unambiguous instruction to the jury mandating separate consideration of the evidence against each defendant:\n\n\"Although the defendants are being tried jointly, you must give separate consideration to each defendant. In doing so you must analyze what the evidence in the case shows with respect to each defendant, leaving out of consideration any evidence admitted solely against some other defendant or defendants. Each defendant is entitled to have his or her case decided on the evidence and the law applicable to him or her.\"\n\n(Emphasis added). In light of these instructions, as well as the defendants' unsupported speculation concerning the jury's inability to follow the instructions, we hold that the defendants have failed to demonstrate prejudice resulting from the admission of evidence pertaining solely to other defendants.\n\nIn sum, we hold that the severance motions of Disu, Ajibade, Davies, Dina, Ogundipe and Ijitola, based on the fact that evidence of international drug trafficking and evidence pertaining only to other defendants was admitted at their joint trial, were properly denied by the district court. The defendants failed to make the requisite showing of actual prejudice resulting from the introduction of this evidence at their joint trial. Thus, the district court properly determined that they were not entitled to separate trials based thereon.\n\n2. Ijitola's \"Mutually Antagonistic\" Defense\n\nDisu, Ajibade, Davies and Orija contend that remarks made by Ijitola's counsel during closing argument evinced a theory of defense so inconsistent with their own that they were entitled to separate trials. In the argument in question, counsel for Ijitola attempted to convince the jury that his client was a user, as opposed to a dealer, of heroin. At the outset, counsel argued that with respect to the tape recorded conversations, neither Shittu's voice identifications nor Afolayan's translations were correct. Counsel then proceeded to state that even if the jury believed the interpretations of the tape to be correct, the conversations in which Ijitola was allegedly a participant established the fact that his client was a heroin addict. Thus, counsel essentially conceded that these conversations were drug-related, a fact disputed by all of Ijitola's co-defendants. Immediately after this argument, many of the defendants moved for a mistrial or, in the alternative, a severance. These motions were denied. On appeal, the defendants argue that they were entitled to a severance because Ijitola's defense that the tapes reflected that he was an addict and their defense that the tapes were not drug-related were \"mutually antagonistic.\"\n\nIn this circuit, severance based on \"mutually antagonistic\" defenses is required only when the defenses are irreconcilable and so antagonistic that \"the acceptance of one party's defense will preclude the acquittal of the other.\" United States v. Hendrix, 752 F.2d 1226, 1232 (7th Cir.) (quoting United States v. Ziperstein, 601 F.2d 281, 285 (7th Cir. 1979), cert. denied, 444 U.S. 1031, 62 L. Ed. 2d 667, 100 S. Ct. 701 (1980)), cert. denied, 471 U.S. 1021, 85 L. Ed. 2d 313, 105 S. Ct. 2031 (1985). Accord United States v. Gironda, 758 F.2d 1201, 1220 (7th Cir.), cert. denied, 474 U.S. 1004, 88 L. Ed. 2d 456, 106 S. Ct. 523 (1985). The defendants have failed to establish that the alleged hostility between their defenses and that of Ijitola conforms to this standard of proof.\n\nAs an initial matter, we note that Ijitola's counsel's comments that the conversations in which his client was an alleged participant involved heroin were made in the alternative. Specifically, these comments were made only after counsel argued that the voice identifications and translations of the conversations were inaccurate -- an argument entirely consistent with the other defendants' respective theories of defense. To the extent counsel's comments conceded that the conversations were, in fact, drug-related, this was done in support of the proposition that Ijitola was an addict, rather than a street dealer within the conspiracy. This argument did not preclude a jury finding that Shittu's voice identifications of the participants in other conversations were inaccurate, nor did it preclude a finding that the government failed to establish that the conversations in which the defendants were the alleged participants involved heroin.\n\nIn any event, defense counsel's remarks boil down to an argument that Ijitola was not a coconspirator in any conspiracy that may have existed. The other defendants argued that the government had failed to establish the alleged conspiracy and, thus, its case against them. This court has repeatedly held that the defenses of non-participation and failure of proof are not mutually antagonistic. See United States v. Bruun, 809 F.2d 397, 407 (7th Cir. 1987); Gironda, 758 F.2d at 1220; United States v. Petullo, 709 F.2d 1178, 1181-82 (7th Cir. 1983). Indeed, in Gironda, we so held even where, as here, one defendant implies the existence of a conspiracy contrary to the defenses of the other alleged coconspirators. 758 F.2d at 1219-20. In light of these cases, it is clear that Ijitola's non-participation defense was not so antagonistic to the insufficiency of the evidence defenses presented by Disu, Ajibade, Davies and Orija that separate trials were required for these defendants. Thus, we conclude that their contentions to the contrary are without legal support and hold that the trial court's denial of the defendants' severance motions was not an abuse of discretion.\n\nVII. SENTENCING\n\nDefendants Usman, Bello, Alli, Disu and Ajibade challenge, for a variety of reasons, the sentences imposed by the district court. We note that it is well settled that \"a trial judge in the federal system generally has wide discretion in determining what sentence to impose.\" United States v. Tucker, 404 U.S. 443, 446, 30 L. Ed. 2d 592, 92 S. Ct. 589 (1972). \"A sentence which is within the limits established by the statute under which it is imposed will not be vacated upon review unless the sentencing judge relied upon improper considerations or unreliable information In exercising his discretion or failed to exercise any discretion at all in imposing the sentence.\" United States v. Harris, 761 F.2d 394, 402-03 (7th Cir. 1985). After reviewing the record, we conclude that the defendants' challenges to their sentences are meritless and thus require little discussion.\n\nA. Sherifat Usman and Fadeke Bello\n\nDefendants Usman and Bello were each convicted for conspiracy under 21 U.S.C. § 846 and one count of possession with intent to distribute heroin in violation of 21 U.S.C. § 841(a)(1). Both were sentenced to six years' imprisonment, four years on the conspiracy count and two years on the possession count. Usman and Bello contend that the sentences imposed are excessive in comparison to the four-year sentence received by defendant Aderemi, the third courier arrested at O'Hare. Usman and Bello argue that the trial court failed to explain the reasons for this disparity and that in light of the fact that Aderemi had acted as a courier on one more occasion than they had, the court's failure to explain the disparity was an abuse of discretion. This court has repeatedly held that\n\n\"[a] defendant who argues disparity alone has not made out a claim of improper exercise of the district court's discretion, let alone a claim that no discretion at all has been employed. . . . Only when a judge imposes disparate sentences on similar defendants without explanation does even an inference of impropriety arise.\"\n\nUnited States v. Neyens, 831 F.2d 156, 159 (7th Cir. 1987) (emphasis added). In arguing that they received excessive sentences in comparison to Aderemi's, Usman and Bello conveniently ignore the fact that Aderemi was convicted only of conspiracy. She was not convicted for possession with intent to distribute because the heroin surgically removed from her vagina was suppressed prior to trial.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Because Usman and Bello were convicted of two offenses as opposed to Aderemi's conviction on only one, the three were not \"similar defendants.\" Thus, we view their argument that they received excessive sentences in comparison to that imposed on Aderemi as frivolous and reject their contention that the trial court abused its discretion in sentencing them.\n\nB. Abdul Disu\n\nDisu was convicted of conspiracy under 21 U.S.C. § 846 and eleven counts of telephone facilitation in violation of 21 U.S.C. § 843(b). Disu was sentenced to twenty-one years' imprisonment, ten years on the conspiracy count and consecutive terms of one year on each of the section 843(b) counts. Disu attacks his sentence on a variety of grounds, only one of which merits discussion.\n\nPrior to trial, the government dismissed a number of counts contained in the second superseding indictment. Among these were four counts against Disu, numbered 39, 42, 43 and 151. However, the trial court's Judgment and Probation/Commitment Order reflects that Disu had been convicted and sentenced on Counts 39 and 42. Because he was sentenced to one year on each of these counts, Disu contends that he is entitled to a two-year reduction in his sentence. On its face, this argument seems most convincing. A careful examination of the record (something Disu's counsel obviously failed to do), however, leads to the conclusion that Disu, contrary to his argument, was not convicted and sentenced on counts which the government had previously dismissed.\n\nAfter the government dismissed the counts against Disu and various other defendants, the counts in the second superseding indictment were renumbered and the renumbered indictment was the document submitted to the jury. Thus, the jury could not have convicted Disu on the previously dismissed counts because the counts were not included in the indictment provided for their deliberations. On September 24, 1987, after the convictions and sentences of the defendants had been entered, the indictment submitted to the jury was renumbered a second time by order of the court to correspond to the numeration of the second superseding indictment in its original form. This order renumbered count \"39 as 41\" and count \"42 as 46.\" A comparison of counts 39 and 42 in the renumbered indictment with counts 41 and 46 in the second superseding indictment reveals that the respective counts are identical. In light of these facts, it is obvious that Disu was not convicted and sentenced on counts previously dismissed but rather on counts that had been renumbered. Thus, we hold that he does not merit a two-year reduction in his sentence. Because Disu raises no meritorious challenge to his sentence, we uphold the trial court's decision to sentence him to twenty-one years' incarceration.\n\nC. Kola Ajibade\n\nAjibade was convicted of conspiracy under 21 U.S.C. § 846 and three counts of telephone facilitation in violation of 21 U.S.C. § 843(b). Ajibade was sentenced to eighteen years' imprisonment, fifteen years on the conspiracy count and consecutive terms of one year on each of the section 843(b) counts. Ajibade argues that the trial court failed to comply with Fed.R.Crim.P. 32(c)(3)(D)\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e because it relied on information in the government's sentencing memorandum which was disputed at sentencing and, thus, he is entitled to be resentenced. We disagree.\n\nIn its sentencing memorandum, the government argued that the conspiracy in this case imported, possessed and/or distributed over seventeen kilograms of heroin having a street value of over nine million dollars. Defendant Erinle objected to the government's representations both as to the amount and value of the heroin involved. The trial court agreed that this was excessive and eventually entered a finding that the conspiracy involved three kilograms of heroin having a street value of one million dollars. Ajibade argues that these are inaccurate because they are estimates and the trial court entered his estimated findings, which were allegedly disputed at sentencing, in violation of Rule 32(c)(3)(D).\n\nWhen a defendant, before sentencing, alleges inaccuracies in his presentence report, Rule 32(c)(3)(D) requires that the sentencing judge make specific findings as to the contested facts or a determination that the disputed matters will not be relied upon in passing sentence. The rule also requires that the court attach a record of its findings or determination to the presentence report. This rule serves to protect \"a defendant's due process right to fair sentencing procedures, particularly the right to be sentenced based on accurate information.\" United States v. Eschweiler, 782 F.2d 1385, 1387 (7th Cir. 1986). Another purpose of this rule is to provide a clear record of the disposition and resolution of controverted facts in the presentence report. United States v. Perez, 858 F.2d 1272, 1276 (7th Cir. 1988). \"In order to be resentenced under Rule 32(c)(3)(D), the defendant must show that: '(1) the allegations of inaccuracy were before the sentencing court and (2) the court failed to make findings regarding the controverted matters or a determination that the disputed information would not be used in sentencing.'\" Id. at 1276-77 (quoting Eschweiler, 782 F.2d at 1389). There is no evidence in the record that Ajibade objected to the trial court's finding that the conspiracy in this case dealt with three kilograms of heroin valued in excess of one million dollars.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Because Ajibade failed to comply with the first requirement in Perez, our analysis need go no further. Ajibade failed to raise this issue before the sentencing court; thus, we reject his claim that he is entitled to be resentenced for a violation of Rule 32(c)(3)(D). See United States v. Mealy, 851 F.2d 890, 907 (7th Cir. 1988).\n\nD. Michael Alli\n\nAlli was convicted of conspiracy in violation of 21 U.S.C. § 846 and three counts of possession with intent to distribute heroin in violation of 21 U.S.C. § 841(a)(1). Alli was sentenced to twenty-two years' imprisonment (ten years on the conspiracy count, consecutive terms of five years on two of the section 841(a)(1) counts, and a consecutive two-year term on the third section 841(a)(1) count) with a special parole term of three years to follow. Like Ajibade, Alli argues that he was sentenced in violation of Fed.R.Crim.P. 32(c)(3)(D). Alli also argues that he improperly received consecutive sentences on the three section 841(a)(1) counts because they were multiplicitous.\n\nThe main thrust of Alli's Rule 32(c)(3)(D) claim is that the trial court failed to make findings regarding a statement he made at the time of his arrest. Essentially the statement was a threat to kill Adefuye and his family because Adefuye had given Alli's name to the authorities. During the sentencing hearing, Alli neither disputed nor denied that he had made the threat. On appeal, he claims that the district court violated Rule 32(c)(3)(D) in failing to make a finding as to whether Alli made the threat with the intent to carry it out. However, the record reflects that the only remark made by Alli's counsel at sentencing was as follows: \". . . the Government alludes to the fact that there was a death threat made. You can call it what you will. I think it has many different interpretations.\" This is not, as Alli contends, an allegation of inaccurate information sufficient to trigger the Rule 32(c)(3)(D) requirement that the trial court make findings regarding disputed information or determine that they were not relied upon in passing sentence. Because Alli, like Ajibade, failed to preserve his argument before the sentencing court, we reject his claim under Rule 32(c)(3)(D). See Perez, supra.\n\nAlli next claims that he was improperly sentenced to consecutive terms of imprisonment on the section 841(a)(1) counts (Counts Six, Seven and Eight in the indictment) because they are multiplicitous. Essentially, a claim of multiplicity alleges that separate counts in an indictment charge a single offense. United States v. Marquardt, 786 F.2d 771, 778 (7th Cir. 1986). \"As such, the indictment exposes a defendant to the threat of receiving multiple punishment for the same offense.\" United States v. Podell, 869 F.2d 328, 330 (7th Cir. 1989).\n\nAt the outset, we note that Alli failed to raise this issue at any time prior to this appeal. \"In this circuit a failure to raise a multiplicity claim constitutes a waiver. United States v. Griffin, 765 F.2d 677, 682 (7th Cir. 1985); United States v. Mosley, 786 F.2d 1330, 1333 (7th Cir.), cert. denied, 476 U.S. 1184, 106 S. Ct. 2919, 91 L. Ed. 2d 548 (1986). Consequently, we will evaluate defendant's multiplicity argument under the exacting standards of the plain error doctrine.\" Podell, 869 F.2d at 331. \"A plain error is one that results in 'an actual miscarriage of justice.'\" United States v. Wynn, 845 F.2d 1439, 1442 (7th Cir. 1988) (citation omitted). In Marquardt, supra, we set forth our standard for evaluating claims of multiplicity:\n\n\"The traditional test of multiplicity 'determines whether each count \"requires proof of a fact which the other does not.\"' United States v. Kennedy, 726 F.2d 546, 547-48 (9th Cir.), cert. denied, 469 U.S. 965, 105 S. Ct. 365, 83 L. Ed. 2d 301 (1984) (quoting United States v. Glanton, 707 F.2d 1238 (11th Cir. 1983)). 'If one element is required to prove the offense in one count which is not required to prove the offense in the second count, there is no multiplicity.' United States v. Briscoe, 742 F.2d 842, 845 (5th Cir. 1984).\"\n\n786 F.2d at 778.\n\nIn the present case, the basis for Counts Six, Seven and Eight is the heroin discovered in the body cavities of Aderemi, Usman and Bello on October 23, 1986: Count Six charged Alli, Aderemi and others with possession with intent to distribute 212.05 grams of a mixture containing heroin; Count Seven charged Alli, Usman and others with possession with intent to distribute 200.62 grams of a mixture containing heroin; and Count Eight charged Alli, Bello and others with possession with intent to distribute 67.62 grams of a mixture containing heroin. As noted in the factual section of this opinion, the heroin forming the basis for these counts was in the possession of the three couriers. The government alleged that Alli had committed the violations alleged in these counts based on a theory of constructive possession. We summarized this theory in United States v. Moya-Gomez, 860 F.2d 706, 756 (7th Cir. 1988), cert. denied, 492 U.S. 908, 106 L. Ed. 2d 571, 109 S. Ct. 3221 (1989):\n\n\"The rule of constructive possession holds that 'a person can be convicted for possessing [narcotics] though he does not possess it in a literal sense.' United States v. Manzella, 791 F.2d 1263, 1266 (7th Cir. 1986). 'To establish constructive possession of a controlled substance, the government must produce evidence demonstrating \"ownership, dominion, or control over the contraband. . . .\"' United States v. Galiffa, 734 F.2d 306, 316 (7th Cir. 1984) (quoting United States v. Ferg, 504 F.2d 914, 916-17 (5th Cir. 1974)).\"\n\nAs noted above, each of Counts Six, Seven and Eight involved a quantity of heroin carried by defendants Aderemi, Usman and Bello, respectively. In order to prove that Alli constructively possessed the heroin carried by these women, the government was required to establish that Alli had \"ownership, dominion or control\" over each quantity and some sort of control over or, at the very least, some sort of relationship with the courier carrying the heroin.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Thus, Counts Six, Seven and Eight, with respect to Alli, involved \"proof of a fact which the other does not\" and, therefore, are not multiplicious. Accordingly, we uphold Alli's consecutive sentences on these counts.\n\nVIII. CONCLUSION\n\nBased upon our review of the record and the controlling case law applicable to the facts of this case, we are convinced that the defendants' convictions and sentences must be\n\nAFFIRMED.\n\nCUDAHY, Circuit Judge, concurring:\n\nI concur in the judgment and write separately only with respect to Section III(G) of the majority's very thorough opinion. In my view, Bello's statement to Customs Inspector McCarthy on its face implicated Usman, and its admission into evidence therefore violated Usman's confrontation clause rights under Bruton v. United States, 391 U.S. 123, 20 L. Ed. 2d 476, 88 S. Ct. 1620 (1968). Although Bello did not refer to Usman by name, the pronoun \"we\" served the same function. It was certainly clear to the jury, as it was to Customs Inspector McCarthy, that \"we\" referred to Bello, Usman and Aderemi Adefuye. Further, a jury could easily infer that the antecedent of \"this\" (in the sentence, \"We were only to bring this from New York to Chicago.\") was the heroin itself, not the containers. The plain import of Bello's statement ascribes knowledge and intent to Usman. Such evidence is precisely the type that concerned the Supreme Court in Bruton and, more recently, in Cruz v. New York, 481 U.S. 186, 95 L. Ed. 2d 162, 107 S. Ct. 1714 (1987).\n\nIn Cruz, the Court considered the applicability of Bruton to cases involving so-called \"interlocking confessions,\" in which non-testifying co-defendants make pretrial confessions that implicate each other. Writing for the Court, Justice Scalia observed:\n\nWhile the \"devastating\" practical effect was one of the factors that Bruton considered in assessing whether the Confrontation Clause might sometimes require departure from the general rule that jury instructions suffice to exclude improper testimony, 391 U.S., at 136, it did not suggest that the existence of such an effect should be assessed on a case-by-case basis. Rather, that factor was one of the justifications for excepting from the general rule the entire category of codefendant confessions that implicate the defendant in the crime.\n\n481 U.S. at 191 (emphasis added).\n\nThe majority declines to recognize a Bruton problem here because it does not view Bello's statement as \"powerfully incriminating\" in light of the other evidence establishing Usman's knowing possession of and intent to transport heroin. This approach is not open to us in light of the Supreme Court's admonition in Cruz against undertaking a subjective assessment of the degree to which a particular co-defendant confession \"devastates\" the defendant's case. With greatest respect to the majority, I see no difference between \"devastating\" and \"powerfully incriminating\" in this context. The proper criterion for determining whether a Bruton problem exists is whether the implication of a co-defendant is \"facial\"--as by naming Usman or using the equivalent pronoun \"we.\"\n\nApparently in support of its view that Bello's statement was not \"powerfully incriminating\" against Usman, the majority cites Richardson v. Marsh, 481 U.S. 200, 95 L. Ed. 2d 176, 107 S. Ct. 1702 (1987), a case also authored by Justice Scalia and decided the same day as Cruz. In Richardson, however, the trial court redacted all references to Marsh before admitting her codefendant's confession. Marsh complained that when coupled with her own testimony, which placed her at the scene of events described in the co-defendant's confession, the redacted statement still violated Bruton. The Court rejected this contention, holding that \"the confession was not incriminating on its face, and became so only when linked with evidence later introduced at trial (the defendant's own testimony).\" 481 U.S. at 208 (emphasis added). In sharp contrast to the Richardson scenario, Bello's statement in this case was introduced through the customs officer who had just finished testifying about the post-arrest investigation of Bello, Usman and Aderemi Adefuye. Bello's statement, through the use of the pronoun \"we,\" did incriminate Usman (and Aderemi)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e on its face and cannot fairly be considered a \"neutral pronoun. \"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Cf. Monachelli v. Warden, SCI Graterford, 884 F.2d 749, 752-53 (3d Cir. 1989) (statement by non-testifying co-defendant inculpated defendant by use of terms \"my brother\" and \"he\" and therefore violated Bruton); United States v. Bennett, 848 F.2d 1134, 1141-42 \u0026 n. 8 (11th Cir. 1988) (\"Far from being neutral, the pronoun 'they' clearly referred to [defendants].\").\n\nDespite this disagreement, I am in complete accord with the majority's conclusion that, in any event, the Bruton violation was harmless. Bello's statement was merely cumulative of properly admitted evidence establishing Usman's knowing and intentional possession of heroin. I would affirm Usman's conviction on this basis.\n\n\u003cspan class=\"fn\"\u003e1. Defendant Taiwo was tried jointly with the defendants involved in this appeal and convicted of conspiracy. He is not a party to this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The translators were Nigerian nationals living in this country on resident alien status. All of these individuals were deputized as temporary United States Marshals for the duration of the government's wiretap investigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. All of the defendants were arrested on November 12, 1986, pursuant to the simultaneous execution of arrest warrants for the defendants charged in the first indictment, handed down on November 10, 1986.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \"Mrs. Agbabs\" was a reference to defendant Shade Ajimati, the wife of defendant Alhaji Tunde Agbabs. Ajimati pled guilty prior to trial and is not a party to this appeal. Agbabs has not yet been arrested.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant Aderemi Adefuye waived her right to a jury trial and consented to a bench trial. Due to the overlap in evidence, however, the government presented its case against Aderemi concurrently with its presentation of evidence at the jury trial of the other fifteen defendants. She has not appealed her conviction. Throughout this opinion, she will be referred to as \"Aderemi\" or \"defendant Aderemi.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The trial court found that the surgical procedure violated Aderemi's fourth amendment right to be free from unreasonable searches and seizures and suppressed the use of the 200.62 grams of heroin against Aderemi.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See supra note 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In Batson, the court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Alli also makes the conclusory statement that the government failed to establish that the four heroin trips occurring between January and August 1986 were similar enough and close enough in time to be relevant to his knowledge and intent of the October 1986 trip. In light of the fact that the trips occurred within a ten-month time span and involved couriers who smuggled heroin within their body cavities from Nigeria to Alli's home in New York, we view this as a frivolous assertion and refuse to consider it further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The government did not articulate a reason for challenging juror Rochelle Allen because the defendants failed to object at the time the government exercised its strike against her. Thus, the appellants have waived the question of whether the government's challenge to Allen was proper, and we decline to\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We note that both at trial and on appeal the defendants point to only one instance where the speaker listed in the transcript may have been misidentified. The defendants premise this speculative claim on the fact that in Government Exhibit T-56, a transcript in which Shittu and Disu were listed as the parties to the conversation, the statements attributed to Shittu and those attributed to Disu were reversed from the attributions made in a prior version of the transcripts. Our review of the record reveals that the government questioned Shittu regarding statements attributed to him in the final transcript, and Shittu corroborated the identification of Disu's voice, as well as his own, in the final version. We also note that Disu's attorney, who had objected to Shittu's testimony concerning Edit T-56, failed to cross-examine him on the reason for the inverted speaker attributions. Thus, the defendants' challenge to the voice identifications based on this transcript is not well taken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Fed.R.Evid. 803(6) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The defendants also argue that they were prejudiced by the admission of these documents into evidence because the government failed to give defense counsel adequate notice of its intention to introduce these documents at trial. The government asserts, as it did in the trial court, that the United States Attorney's Office notified defense counsel in two letters mailed prior to trial that all of the exhibits the government planned to present at trial were available for the defendants' inspection. Based on these letters, the trial court found that the defendants had been given an opportunity to review this evidence, but failed to avail themselves of the opportunity to do so, thus rejecting the defendants' claim of unfair surprise. We see no reason to disturb the determination of the experienced trial judge on this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. We note that the fact that the actual computer printouts presented at trial were prepared specifically for this case, thus not in the regular course of Illinois Bell's business, does not preclude their admission under Rule 803(6). It is sufficient that the data compiled in the printouts was entered into the computer contemporaneous with the placing of each telephone call and maintained in the regular course of business. See United States v. Sanders, 749 F.2d 195, 198 (5th Cir. 1984). As the Sixth Circuit aptly stated: \"It would restrict the admissibility of computerized records too severely to hold that the computer product as well as the input upon which it is based, must be produced at or within a reasonable time after each act or transaction to which it relates.\" United Sites v. Russo, 480 F.2d 1228, 1240 (6th Cir. 1973), cert. denied, 414 U.S. 1157, 39 L. Ed. 2d 109, 94 S. Ct. 915 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Fed.R.Evid. 602 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Fed.R.Evid. 702 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Fed.R.Evid. 703 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although our statement in Vega was made in the context of a sufficiency of the evidence analysis, it is instructive in the evidentiary context as well as it elucidates the extensive use of \"code words\" so frequently used among coconspirators within a narcotics conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We also note that the defendants were given the opportunity to extensively cross-examine Shittu regarding his opinion on the meanings of these code words and the basis therefor, including the extent of Shittu's dealings with each particular defendant. As such the jury was provided with sufficient information to assign the appropriate weight to Shittu's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Adefuye's testimony, to the extent it related the prior trips made by Usman, Bello and Aderemi, was also admitted against these defendants as evidence of their knowledge, intent and preparation under Fed.R.Evid. 404(b). Usman and Bello do not contest the court's admission of this evidence and, as noted above, Aderemi is not involved in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We note that at no point did Usman's attorney move the court to sever her trial from that of the other defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Fed.R.Evid. 801(d)(2)(E) provides: \"A statement is not hearsay if. . . [the] statement is offered against a party and is . . . a statement by a coconspirator of a party during the furtherance of the conspiracy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See United States v. Buishas, 791 F.2d 1310, 1315 (7th Cir. 1986) (\"Bruton . . . does not require the exclusion of statements by co-defendants made in the furtherance of the conspiracy.\"). Under this rationale, Bello's statement would have been admissible against Usman and Aderemi, as well as Bello. On appeal, the government does not argue that this evidence was admissible under Rule 801(d)(2)(E), focusing solely on whether the admission of Bello's statement violates Bruton and, if so, whether the violation was harmless error. Thus, we deem it unnecessary to address whether Bello's statement was admissible as a statement in furtherance of the conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In his concurrence, Judge Cudahy suggests that the majority improperly determines that no Bruton violation occurred \"because it does not view Bello's statement as 'powerfully incriminating' in light of the other evidence establishing Usman's knowing possession of and intent to transport heroin.\" Post, at 83-84. The concurring opinion goes on to state: \"This approach is not open to us in light of the Supreme Court's admonition in Cruz [v. New York, 481 U.S. 186, 95 L. Ed. 2d 162, 107 S. Ct. 1714 (1987)] against undertaking a subjective assessment of the degree to which a particular co-defendant confession 'devastates' the defendant's case.\" Post, at 84. Judge Cudahy improperly equates the analysis of whether a codefendant's confession is \"powerfully incriminating,\" the type of codefendant confession which Bruton prohibits as a violation of the Confrontation Clause, see id. 391 U.S. at 135-36, with the analysis of the \"devastating practical effect\" that the admission of a codefendant's confession has on the implicated defendant's case. It is true that in Cruz, 481 U.S. at 191, the Supreme Court stated that Bruton did not intend that courts evaluate the \"devastating practical effect\" of a codefendant's confession on a case-by-case basis in determining whether a Bruton violation has occurred. The Cruz case involved a situation where the confessions of two jointly tried codefendants were substantially identical and, thus, \"interlocked.\" The Supreme Court reversed the New York Court of Appeals' determination that in light of the fact that the implicated defendant had himself confessed, the admission of the codefendant's confession did not have a \"devastating\" effect on his case. Rather, the court held that \"where a nontestifying codefendant's confession incriminating the defendant is not directly admissible against the defendant, . . . the Confrontation Clause bars its admission at their joint trial, . . . even if the defendant's own confession is admitted against him.\" Cruz, 481 U.S. at 193 (emphasis added). Cruz thus prohibits courts from considering, in the context of whether a Bruton violation has occurred, whether a nontestifying codefendant's confession will have a \"devastating effect\" on the defendant's case in light of other evidence (e.g., the implicated defendant's own confession) admitted at trial, making clear that the admission of a codefendant's confession incriminating the defendant will always have such an effect. However, Cruz in no way changes the initial determination under Bruton as to whether the codefendant's confession so powerfully incriminates the defendant in the commission of a crime that it must be excluded as violative of the Confrontation Clause. Indeed, in Richardson v. Marsh, 481 U.S. at 208, the Court distinguished the case before it from Bruton based on the fact that references to the defendant in the confession of her codefendant had been redacted and, thus, were not so \"powerfully incriminating\" to require exclusion. The difference between the \"powerfully incriminating\" analysis and the \"devastating practical effect\" analysis is made even more clear by Justice Stevens, who, writing in dissent to the majority's per se rule concerning redacted confessions in Richardson, stated: \"Bruton has always required trial judges to answer the question whether a particular confession is or is not 'powerfully incriminating' on a case-by-case basis.\" Id. at 214. However, he joined the majority opinion in Cruz rejecting the notion that the \"devastating effect\" of a codefendant's confession implicating the defendant should be evaluated on a case-by-case basis. If the two analyses are equivalents, as Judge Cudahy seems to think, Justice Stevens' vote in Cruz would be totally anomalous to his dissenting views in Richardson. Thus, the issue remains whether Bello's statement so powerfully incriminates Usman in the commission of a crime that it should be excluded under Bruton. Contrary to the suggestion of the concurrence, our holding, infra, that the statement was not admitted in violation of Bruton because it was not powerfully incriminating is not based on the other evidence establishing Usman's knowing possession of and intent to transport heroin. Rather, our holding is based on an examination of the language of the statement in view of the fact that the only disputed issue in Usman's case involved her knowledge and intent regarding the contents of the package she was carrying. Consideration of evidence other than the statement itself occurs only in the harmless error portion of the Bruton analysis, which Cruz explicitly contemplates. See Cruz, 481 U.S. at 194.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. As noted in the previous section, neither Usman nor Bello challenge the admission of this testimony under Rule 404(b) on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In light of our holding that the evidence was sufficient to establish a single conspiracy, as well as the participation of Disu, Ajibade and Davies therein, we need not consider the defendants' argument that the trial court improperly admitted the statements of coconspirators under Fed.R.Evid. 801(d)(2)(E).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 21 U.S.C. § 843(b) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In a similar vein, Ajibade also contends that because \"the government alleged both inchoate offenses and the substantive object of the inchoate crimes\" as predicate offenses for the section 843(b) charge, the government was required to prove, by a preponderance of the evidence, each of the inchoate and substantive offenses alleged in each count. Although the indictment alleged in the conjunctive that the telephone calls facilitated the substantive narcotics offenses (importation, distribution and possession with intent to distribute), as well as the conspiracy to commit those offenses, it was sufficient for the government to prove that either the substantive offenses or the conspiracy to commit those offenses was facilitated. See Turner v. United States, 396 U.S. 398, 420, 24 L. Ed. 2d 610, 90 S. Ct. 642 (1970); United States v. Watson, 594 F.2d 1330, 1343 (10th Cir.), cert. denied, 444 U.S. 840, 62 L. Ed. 2d 51, 100 S. Ct. 78 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Although not a sufficiency of the evidence question, Ajibade also argues that his convictions under section 843(b) are invalid because there were no allegations in the counts based on that section from which he could determine what he allegedly facilitated through the use of a communications facility. Ajibade contends that this deficiency violates United States v. Hinkle, 637 F.2d 1154 (7th Cir. 1981), in which this court held that an indictment charging violations of 21 U.S.C. § 843(b) \"must specify the type of communication facility used, the date on which it was used, the controlled substance involved and some sort of statement of what is being facilitated with that controlled substance which constitutes a felony.\" Id. at 1158. Counts 87, 88 and 92 -- the counts in the indictment charging Ajibade with violations of section 843(b) -- allege that on a certain date and time, Ajibade\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Davies' proposed multiple conspiracy instruction provided:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. From their brief, it appears that Erinle, Duale and Smith also claim that they should have been severed because of Ijitola's \"mutually antagonistic\" defense. However, because they fail to assert prejudice from the denial of their severance motions, an integral part of their case on appeal, see Moya-Gomez, supra, we refuse to consider their claims and affirm the trial court's denial of their motions to sever.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Regarding the prior acts of Alli, Adefuye and the couriers, the trial court's instructions read:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See supra note 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Rule 32(c)(3)(D) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In his brief, Ajibade merely states that \"[an] objection was made to the amount, the purity of the total value [sic] of the heroin involved . . .\" and refers us to the statement of defendant Alli's counsel during Alli's sentencing that the government's total should not include 500 grams of heroin that was intended for Shittu, but was never delivered to him due to the arrest of Adefuye and the couriers. This statement is insufficient to overcome the fact the Ajibade failed to object to the trial court's finding concerning the value and quantity of the heroin involved in this conspiracy. \"Such a failure to raise an issue before the district court results in a waiver of that issue on appeal.\" United States v. Holguin, 868 F.2d 201, 205 (7th Cir. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The Ninth Circuit's holding in United States v. Palafox, 764 F.2d 558 (9th Cir. 1985), the only case Alli cites in support of his multiplicity claim, does not apply to the offenses charged in Counts Six, Seven and Eight. In Palafox, the Ninth Circuit stated that \"when more than one offense arises under § 841(a)(1) from a single criminal undertaking involving drugs and each offense is committed at virtually the same time, in the same place, and with the same participants, the punishments should not be compounded.\" Id. at 562 (emphasis added). Because the government was required to establish Alli's control and/or relationship over Aderemi, Usman and Bello, respectively, in order to convict him under Counts Six, Seven and Eight, the Palafox rule does not apply. See United States v. Monzon, 869 F.2d 338, 348 (7th Cir. 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. As noted by the majority, the evidence of Aderemi's possession of the heroin discovered in the post-arrest investigation was suppressed because it was obtained coercively in violation of the Fourth Amendment. Therefore, we are concerned only with whether the admission of Bello's statement violated Usman's confrontation clause rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority correctly indicates the Supreme Court's express reservation on the admissibility of a non-testifying co-defendant's confession \"in which the defendant's name has been replaced with a symbol or neutral pronoun.\" See Richardson, 481 U.S. at 211 n. 5. I cannot agree with the majority's conclusion, however, that \"we\" is \"neutral\" in the context of this case.\u003c/span\u003e\n\n",
    "body_length": 169915,
    "citedas": [
      "896 F.2d 1476"
    ],
    "attorneys": "Joel Bertocchi, AUSA, OFFICE OF THE UNITED STATES ATTORNEY, Chicago, Illinois, Anton R. Valukas, USA, OFFICE OF THE UNITED STATES ATTORNEY, Chicago, Illinois, David J. Stetler, AUSA, OFFICE OF THE UNITED STATES ATTORNEY, Criminal Receiving, Appellate Division, Chicago, Illinois, James R. Ferguson, AUSA, OFFICE OF THE UNITED STATES ATTORNEY, Criminal Receiving, Appellate Division, Chicago, Illinois, Victoria J. Peters, AUSA, OFFICE OF THE UNITED STATES ATTORNEY, Criminal Receiving, Appellate Division, Chicago, Illinois for Plaintiff-Appellee. David Bortman, BORTMAN, MEYER \u0026 BARASA, Chicago, Illinois, Saul R. Leibowitz, Chicago, Illinois for Phyliss Briscoe. Gerald J. Collins, Chicago, Illinois, for FOLORUNSHO OGUNDIPE. John P. DeRose, DEROSE \u0026 ASSOCIATES, Burr Ridge, Illinois, for ABDUL DISU. Gwendolyn D. Anderson, ANDERSON \u0026 ASSOCIATES, Chicago, Illinois, for ISAAC ORIJA. Lewis Myers, Jr., CHILDS, MYERS \u0026 WILLIS, Chicago, Illinois for OLADIPO ERINLE. June B. Fournier, Hillside, Illinois for CHARLES DINA, aka Mufatan Olatonji. Andrew B. Spiegel, Chicago, Illinois for KOLA AJIBADE. Miriam F. Miquelon, Chicago, Illinois for ALABA Z. IJITOLA. Luis M. Galvan, OFFICE OF THE FEDERAL DEFENDER PROGRAM, Chicago, Illinois for SHERIFAT USMAN. Paul M. Brayman, Chicago, Illinois for FADEKE BELLO. Jack Rimland, STAMOS, RIMLAND, HALPRIN \u0026 CLARK, Chicago, Illinois for MICHAEL O. ALLI. Antonio J. Curiel, CURIEL \u0026 JONES, Chicago, Illinois for IDRIS DUALE. Walter Jones, Jr., CURIEL \u0026 JONES, Chicago, Illinois for LEONARD SMITH. Janis D. Roberts, Chicago, Illinois, Thomas A. Durkin, Chicago, Illinois for Albert Davies.",
    "category": [
      "75"
    ],
    "judges": "Cudahy, Coffey and Manion, Circuit Judges.",
    "citation_count": 23
  }
}
