{
  "id": "JKFeR2YBTlTomsSBwf-4",
  "document": {
    "title": "People v. Diaz",
    "full_title": "THE PEOPLE AND v. ROBERT RUBANE DIAZ AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-08-31T00:00:00.000Z",
    "docket": "No. S004637. Crim. No. 23834",
    "body": "This is an automatic appeal from a judgment of death. (Pen. Code, § 1239, subd. (b).)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e After defendant Robert Rubane Diaz waived his right to a jury trial, the trial court convicted him of 12 counts of first degree murder (§ 187), and found to be true 12 multiple-murder special-circumstance allegations (§ 190.2, subd. (a)(3)). We shall order 11 of the 12 special-circumstance allegations stricken as duplicative, but otherwise affirm the judgment.\n\nI. FACTS\n\nOn March 29, 1981, defendant, a registered nurse, began work on the night shift in the cardiac care/intensive care unit (ICU) at Community Hospital of the Valleys (CHOV) in Perris, California. In the next three and one-half weeks, at least thirteen patients on the night shift suffered violent seizures, which were generally followed by cardiac and respiratory arrest. Nine of these patients died. The nurses who had observed the seizures described them as being similar to grand mal seizures suffered by epileptics; none of the nurses had ever seen such symptoms in cardiac patients. Following the closure of the ICU at CHOV, defendant accepted employment at San Gorgonio Pass Hospital. Within three days, while defendant was on duty, a patient died at that hospital after displaying the same symptoms as those observed in the patients who had died at CHOV. Within a day or so, defendant was arrested and charged with murdering a total of 12 patients (including 2 in whom seizures were not observed).\n\nAt trial, the prosecution contended that defendant had killed the 12 patients by injecting them with massive overdoses of lidocaine, a drug commonly used in hospitals to control rhythm disturbances in the heart. All but one of the deceased patients had been given therapeutic doses of lidocaine while in the hospital's ICU. The prosecution's evidence showed that defendant assisted in the care of the patients before their seizures, and thus was in a position to administer fatal doses of lidocaine; that on several occasions defendant exhibited unusual behavior on nights when patients died; that the patients' symptoms were consistent with having been given large overdoses of lidocaine; that the patients' tissues or blood had unusually\n\nhigh concentrations of lidocaine; that syringes containing high concentrations of lidocaine were found in the hospital; and that lidocaine was found in defendant's home.\n\nThe defense theorized that some of the deaths resulted from natural causes, while others were caused by adverse reactions to medications administered for therapeutic purposes.\n\nAlthough the deceased patients had suffered from serious medical problems, many of them were not regarded as terminally ill. The evidence presented at trial does not suggest that the deaths were \"mercy killings\"; the prosecution did not argue such a theory at trial, nor did it suggest any other motive for the slayings.\n\nII. GUILT ISSUES\n\nA. Motion to Suppress Evidence\n\nOn May 1, 1981, after obtaining a search warrant, police officers searched defendant's house and seized a number of items, some of which (syringes, an empty lidocaine box, and a vial containing lidocaine) were used against defendant at trial. Defendant unsuccessfully moved to suppress the seized items on several grounds, one of which was that the affidavit supporting the search warrant contained material misrepresentations and omissions. Defendant renews that argument here.\n\nThe affidavit supporting the search warrant was prepared by Marshall Tolford, an investigator with the Riverside County District Attorney's office. A summary of the 10-page affidavit follows.\n\nA confidential informant told the Riverside County District Attorney's Office that 17 patients had died at CHOV between March 8 and April 14, 1981, and that the circumstances surrounding the deaths were \"identical in many respects.\" As described in the affidavit: \"[A]ll patients suffered severe seizures prior to death. The patients suffered respiratory arrest, blood drawn prior to death was acidic and ... the patients were extremely blue from the chest area up.\"\n\nInvestigator Tolford, assisted by Riverside coroner's investigator Michael Worthington, obtained Riverside County Health Department records, which showed that 24 patients had died at CHOV between March 8 and April 20, 1981. Worthington told Tolford that CHOV usually had three deaths per month. Because the death records listed myocardial infarction (heart attack) as the cause of death for most of the patients, Tolford became suspicious.\n\nThe investigation revealed that the bodies of six of the patients who had recently died at CHOV had not yet been buried or cremated. Autopsies were performed on all six. Toxicological studies established lethal quantities of lidocaine in two of the six bodies. The pathologist who had performed the autopsies of the six patients told Tolford that an overdose of lidocaine would be accompanied by \"several symptoms including seizures, respiratory arrest, a bluish tint to the upper torso of the body and acidic blood.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThis led Tolford to examine 24 patient records that the police had seized from CHOV. Tolford discovered that defendant \"did in fact attend every patient who died exhibiting these symptoms [seizures, acidic blood, respiratory arrest and a bluish tint to the upper torso] in the intensive care unit,\" and that all of these patients had died in the hospital's ICU. Tolford also learned that defendant had stopped working at CHOV on April 23, 1981, the day after police seized the patient records, and immediately found employment at San Gorgonio Pass Hospital. There, two patients died on the night of April 24-25, while defendant was on duty. Medical records showed that these two patients suffered seizures and respiratory arrest, and that they had a bluish tint to the upper torso.\n\nInvestigator Tolford then interviewed Donna MacDonald, a licensed vocational nurse (LVN) working at CHOV. MacDonald said she and defendant had become known as the \"deadly duo,\" because a number of patients had died in the hospital's ICU while they were working the same shift. Because all of those patients exhibited similar symptoms at the time of death, MacDonald suspected a connection between the deaths and the medication defendant administered. MacDonald recalled one occasion when defendant handed her a syringe containing lidocaine and asked her to inject it into patient Castro. Because of her suspicions, MacDonald did not do so. The syringe was later sent to the manufacturer, Abbott Laboratories, which reported: the syringe \"had been tampered with, with lab results indicating a concentration slightly below standard concentration\";\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e that two other syringes from CHOV containing lidocaine had also been tampered with, and had concentrations much higher than that stated on the packaging; and that the tampering occurred after all three syringes had left Abbott Laboratories, but before the lidocaine was administered to the patients.\n\nIn an interview with investigator Tolford, defendant mentioned he had kept notes concerning the deaths of the patients. Defendant referred to these\n\nnotes during the interview, but retained possession of them. In a second interview the next day, defendant claimed he did not know where his notes were.\n\nTolford further stated in his affidavit that according to the medical records of four of the deceased patients (Boyce, Bayless, Patton and Swanson) whose blood samples contained lidocaine, these patients had \"never\" been prescribed lidocaine.\n\nDefendant asserts that investigator Tolford's affidavit was deficient in four respects: (1) it inaccurately described statements that Nurse MacDonald made to Tolford; (2) it falsely stated that lidocaine was never prescribed to patients Boyce, Bayless, Swanson and Patton; (3) it falsely stated that CHOV had an abnormally high death rate between March 9 and April 20, 1991; and (4) it falsely stated that defendant attended all of the ICU patients who died after exhibiting symptoms of an overdose of lidocaine.\n\nUnder the law applicable to this case,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e a defendant may seek to suppress evidence on the ground that the affidavit supporting the search warrant contained inaccurate statements. If, however, the affiant acted reasonably in including the misstatements in the warrant application, no sanction is imposed. If the affiant was negligent, or unreasonably believed the statements to be true, the reviewing court must correct the inaccurate information and \"retest\" the reformulated affidavit for probable cause. And if the affidavit contained reckless falsehoods or deliberate lies, the warrant must be quashed, regardless of whether the false statements were necessary to establish probable cause. (People v. Kurland (1980) 28 Cal. 3d 376, 385-386 [168 Cal. Rptr. 667, 618 P.2d 213]; People v. Cook (1978) 22 Cal. 3d 67, 75 [148 Cal. Rptr. 605, 583 P.2d 130]; Theodor v. Superior Court (1972) 8 Cal. 3d 77, 100-101 [104 Cal. Rptr. 226, 501 P.2d 234].) With these rules in mind, we consider defendant's challenge to the affidavit.\n\n1. Statements by Nurse MacDonald\n\nDefendant contends that investigator Tolford inaccurately described in his affidavit certain information that Nurse MacDonald had given to him. At the hearing to suppress evidence, defendant introduced tape recordings of the\n\nonly two interviews Tolford had conducted with Nurse MacDonald before preparing the affidavit in support of the search warrant. MacDonald's statements in these interviews are inconsistent with those statements attributed to her in Tolford's affidavit in three respects: (1) contrary to the affidavit, MacDonald did not say she was suspicious of defendant or thought there was a connection between the medication defendant had administered to the patients at CHOV's ICU and their subsequent deaths; rather, she said she had no opinion about the cause of the deaths; (2) although the affidavit said MacDonald had told Tolford that she and defendant were referred to as the \"deadly duo\" because of the number of patients who had died at CHOV's ICU while the two were on duty together, McDonald had not made such a statement to Tolford; and (3) contrary to the affidavit, MacDonald did not tell Tolford that the syringe defendant had asked her to administer to patient Castro contained lidocaine; instead, MacDonald said she did not want to inject the contents of the syringe because she did not know what was in it and she was not licensed to administer it.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAt the suppression hearing, investigator Tolford acknowledged the inaccuracy of his affidavit's statement that Nurse MacDonald had told him that the syringe defendant handed her contained lidocaine. Tolford explained that the statement was based on his recollection of interviews with MacDonald, and that he believed the statement to be accurate when he included it in the affidavit. He thought MacDonald had told him that she suspected the deaths were linked to the medication that defendant had given the patients. He was not questioned about the affidavit's statement that defendant and MacDonald were known as the \"deadly duo.\"\n\nThe trial court concluded that although Nurse MacDonald did not explicitly make the statements attributed to her in Tolford's affidavit, Tolford reasonably inferred them from the information MacDonald had given him. Defendant disagrees. He argues that because Tolford prepared the affidavit less than a day after he had interviewed MacDonald, at a time when her statements should have been fresh in Tolford's mind, his inaccurate account of those statements is unjustifiable. Defendant asserts that if Tolford doubted the accuracy of his recollection, he should have checked the tape recordings\n\nof the interviews, which were in his possession. At the very least, defendant contends, Tolford made the statements with reckless disregard for the truth, and therefore the trial court should have quashed the search warrant. (People v. Kurland, supra, 28 Cal. 3d 376.)\n\nWe see no reason to disturb the trial court's finding that the affidavit's inaccuracies regarding the statements of Nurse MacDonald were neither negligent nor intentional. The investigation into the deaths of patients at CHOV was extremely complicated. There was also an urgent need to expedite the inquiry: although the ICU at CHOV had been closed, Tolford had information that suspicious deaths were taking place at the hospital where defendant had found employment after leaving CHOV. In preparing the lengthy affidavit in support of the search warrant, it was reasonable for Tolford to rely on his recollection of the interviews; he was not obligated to listen to tape recordings of each of the interviews in which he had obtained information that he incorporated into the affidavit. Tolford's testimony at the suppression hearing provides substantial evidence to support the trial court's finding that the inaccuracies in Toldford's affidavit regarding statements by Nurse MacDonald were neither negligent nor intentional.\n\n2. Lidocaine Prescriptions for Patients Boyce, Bayless, Swanson, and Patton\n\nDefendant argues that the search warrant affidavit was either deliberately false or made with reckless disregard for the truth in stating: \"According to these [medical] records, lidocaine was never prescribed for administration to patients Boyce, Bayless, Patton and Swanson.\"\n\nAt the suppression hearing, defendant introduced medical records showing that lidocaine had been prescribed for patients Boyce and Patton, and that patient Swanson had been given therapeutic doses of lidocaine, apparently by nurses who were authorized to do so. (Patient Bayless's records showed no prescription for lidocaine.) When Tolford was questioned at the suppression hearing about this inaccuracy in his affidavit, he explained that coroner's investigator Worthington had examined the medical records of the four patients, and had told him that the records showed no prescription for lidocaine. Worthington corroborated Tolford's testimony, explaining that he had based his Conclusion that no lidocaine had been prescribed on the doctor's order sheets in the patients' files.\n\nNoting that Tolford had stated in the search warrant affidavit that both he and Worthington had reviewed the deceased patients' medical records, defendant maintains it is \"inherently unbelievable\" that neither of them saw the lidocaine prescriptions in the patients' charts.\n\nWe have reviewed the medical records of patients Boyce, Swanson, and Patton.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The only reference to lidocaine in Boyce's lengthy record appears on the fifth page of six pages of progress notes. It reads: \"PVC's--abolished by lidocaine.\" This cryptic notation seems to say that a doctor prescribed lidocaine for patient Boyce, but there is no reference to lidocaine in the five pages labeled \"Physician's Orders,\" in the three pages labeled \"Medication\" or \"IV Medication Sheet,\" in the six pages of nursing notes, or in the two-page \"Code Blue Sheet\" listing the medications given Boyce during a life-threatening emergency. The evidence supports the trial court's finding that Tolford's failure to notice the single brief reference to lidocaine in Patient Boyce's file was neither negligent nor intentional.\n\nPatient Swanson's medical records contain no reference to lidocaine in the three pages labeled \"Progress Notes,\" or in the five pages marked \"Physician Orders,\" but two references to lidocaine, both clearly legible, appear on the two sheets labeled \"Medication Record.\" They show that on the morning he died Swanson was given a lidocaine injection at 5:15 a.m., followed by an intravenous infusion of lidocaine. Another reference to lidocaine, signed by defendant, appears in the nine pages of nursing notes. It states that Swanson was given an injection of lidocaine at 6:32 a.m. that same morning. Finally, on a strip of paper recording Swanson's heartbeat were these notations: \"Lidocaine 50 mg bolus,\" and \"Started Lidocaine Drip.\" It appears that investigator Tolford overlooked these references to lidocaine because he and Worthington had examined only the physicians orders and progress notes, but not the medication record for Swanson. For purposes of this Discussion, we will assume that Tolford and Worthington were negligent in failing to discover the references to lidocaine in patient Swanson's file.\n\nWith respect to patient Patton, his medical file contains many entries stating that Patton was prescribed lidocaine: twice in the physician's orders, three times in the medication record, at least ten times in the nurses' notes, once in the doctor's progress notes, and on several of the strips of paper recording Patton's heartbeat. Presumably, Tolford and Worthington looked only at the first, typed, page of the physician's order sheet, and not at the second, handwritten page on which the physician's orders appeared. The failure to discover that Patton was prescribed lidocaine was clearly negligent.\n\nAs noted earlier, if a search warrant affidavit contains statements that are negligently inaccurate, we must excise those statements from the affidavit,\n\nand determine whether the remaining facts are sufficient to establish probable cause to search. (People v. Kurland, supra, 28 Cal. 3d at p. 386.) Here, defendant does not dispute that the remaining portions of the affidavit establish probable cause to search defendant's house. Rather, he argues that the affiant's inaccurate statement that none of the three patients discussed above were prescribed lidocaine was not merely negligent, but was reckless or intentional, requiring that the warrant be quashed without adherence to the \"excise and retest\" procedure. We disagree. The statements in question were only a small part of a lengthy affidavit, of necessity drawn up in haste, recounting a rapidly moving investigation in a highly technical field. Under the unique circumstances of this case, some inaccuracies in the drafting of the affidavit were to be expected, and there is no reason to infer from the statements at issue by investigator Tolford an intent to deceive the magistrate.\n\n3. Affidavit's Statement Concerning High Death Rate at CHOV\n\nInvestigator Tolford described as \"abnormally high\" the death rate at CHOV during the period March 8 to April 20, 1981, when the suspicious deaths occurred at the hospital. Tolford noted that in that time span there were 24 deaths at CHOV, compared to the usual death rate of 3 a month. According to defendant, however, the death rate at CHOV was generally much more than three per month. Defendant contends that before drafting the search warrant affidavit, Tolford knew, from information provided by coroner's investigator Worthington, that the three-death-per-month figure was inaccurate, but that Tolford nevertheless used this figure in the affidavit, either intentionally or recklessly.\n\nAt the evidence suppression hearing, coroner's investigator Worthington testified that he arrived at the figure of three deaths per month at CHOV after examining four months of coroner's records. But Worthington later discovered that these records were incomplete, and that records of the Riverside County Health Department showed a greater death rate at CHOV during those four months.\n\nIt is unclear from the record before us when Worthington learned that the three-deaths-per-month figure was incorrect, or when he mentioned this to Tolford. Worthington testified that he \"would have to guess\" the date on which he checked the Department of Health's records; his \"best recollection\" was that it occurred before Tolford prepared the affidavit. During Tolford's testimony, he was not asked when he discovered that the three-deaths-per- month figure was inaccurate. Given the uncertain state of the record before us, we uphold the trial court's finding that the affidavit's inaccuracy with respect to the usual death rate at CHOV was not intentional or reckless.\n\n4. Affidavit's Statement That Defendant Attended the Patients Who Died After Exhibiting Symptoms of Lidocaine Overdose\n\nDefendant challenges as false the affidavit's statement that he \"did in fact attend every patient who died exhibiting these symptoms [seizures, acidic blood, respiratory arrest, and a bluish tint to the upper torso] in the intensive care unit.\" He points out that his employment with CHOV did not start until March 29, 1981, and therefore he could not have attended any patients before that time; yet the affidavit stated that the deaths of patients exhibiting these symptoms occurred during a period of time commencing on March 8, 1981.\n\nAt the evidence suppression hearing, defendant failed to establish the falsity of the affidavit's statement quoted above. What defendant needed to show, but did not, was: (1) the identities of the patients described in the affidavit only as \"every patient who died exhibiting these symptoms\"; and (2) that he did not attend those patients, or that those patients did not display the symptoms described in the affidavit.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The testimony presented at the hearing did not identify the patients in question. Because of defendant's failure to establish that the challenged statement in the search warrant affidavit was false, we reject his contention that the trial court should have granted his motion to suppress the evidence seized.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nB. Reliability of Scientific Evidence\n\nDefendant contends that the prosecution's scientific evidence showing that the patients died from overdoses of lidocaine was inadmissible under the \" Kelly/Frye \" test. (People v. Kelly (1976) 17 Cal. 3d 24 [130 Cal. Rptr. 144, 549 P.2d 1240]; Frye v. United States (D.C. Cir. 1923) 293 Fed. 1013 [54 App.D.C. 46, 34 A.L.R. 145].)\n\nUnder the Kelly/Frye rule, evidence based on a new scientific method of proof must satisfy three requirements before it may be admitted. First, the party offering the evidence must show that the technique is \" 'sufficiently established to have gained general acceptance in the particular field in which it belongs.' \" (People v. Kelly, supra, 17 Cal. 3d at p. 30, quoting Frye v. United States, supra, 293 F. at p. 1014, italics omitted.) Second, the proponent of the evidence must establish that \"the witness furnishing such testimony\" is \"properly qualified as an expert to give [such] an opinion ....\" (Kelly, supra, at p. 30, italics omitted.) Third, the proponent must demonstrate that \"correct scientific procedures were used in the particular case.\" (; see also People v. Ashmus (1991) 54 Cal. 3d 932, 970 [2 Cal. Rptr. 2d 112, 820 P.2d 214]; People v. Morris (1991) 53 Cal. 3d 152, 206 [279 Cal. Rptr. 720, 807 P.2d 949]; People v. Stoll (1989) 49 Cal. 3d 1136, 1155 [265 Cal. Rptr. 111, 783 P.2d 698]; People v. McDonald (1984) 37 Cal. 3d 351, 372 [208 Cal. Rptr. 236, 690 P.2d 709, 46 A.L.R.4th 1011].) Defendant contends that the method used by prosecution experts to determine that the patients in this case were given large overdoses of lidocaine did not satisfy the first of these requirements.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn this case, the prosecution was unable to obtain postmortem samples of the blood of 10 of the 12 deceased patients. Therefore, experts at the University of Utah's Center for Human Toxicology used this procedure:\n\nAfter exhuming the patients' corpses, the experts took samples of tissue found in various organs of the \"central compartment\" of the body--the lungs, brain, liver, kidney, and vitreous humor. The experts then measured the quantity of lidocaine in each of the tissue samples. From these samples, the experts extrapolated the amount of lidocaine in the organ as a whole.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Based on the quantities of lidocaine in the various organs tested, the experts made a rough estimate of the amount of lidocaine in the entire body. From this estimate and the circumstances surrounding the patients' deaths, prosecution witnesses concluded that each patient had been given a massive overdose of lidocaine shortly before death.\n\nDefendant contends that the testimony of the prosecution's experts did not satisfy the Kelly/Frye test. Specifically, defendant argues that the trial court should have excluded the experts' testimony that: (1) inferred amounts of lidocaine present in the patients' bodies at death from amounts found in\n\ntissues tested long after death; (2) inferred amounts of lidocaine in entire organs from quantities found in small samples of organs; (3) inferred, from average organ weights, the quantity of lidocaine in the organs of decedents; (4) inferred amounts of lidocaine in the patients' entire body from amounts found in the patients' \"central compartment\" (the internal organs from which tissue samples were taken); and (5) inferred, from amounts of lidocaine found in the blood and tissues, that before death the patients received massive overdoses of lidocaine.\n\nAt trial, defendant never objected to any of the expert testimony on the ground that it violated the Kelly/Frye rule. Accordingly, the Attorney General argues that defendant has waived his right to argue on appeal that this testimony should not have been admitted. In response, defendant asserts four reasons why the waiver doctrine should not be applied to bar his claim.\n\nFirst, defendant asserts that he did object to admission of the expert testimony. He points out that he objected on the ground of \"lack of foundation\" when the prosecutor asked a witness to describe how lidocaine is administered in a hospital, and objected on hearsay grounds to admission of the data obtained from the Center for Human Toxicology, arguing that the data was recorded on documents that did not satisfy the business records exception to the hearsay rule. These objections were not based on the Kelly/Frye rule, and did not seek to exclude the type of evidence to which defendant now objects. Accordingly, neither objection preserved the Kelly/Frye issue.\n\nDefendant argues that because this is a capital case, we should disregard \"technical insufficiencies\" in objections to the admissibility of evidence, and examine the record to determine whether there has been a \"miscarriage of Justice.\" He relies on the lead opinion in People v. Frank (1985) 38 Cal. 3d 711, 729, footnote 3 [214 Cal. Rptr. 801, 700 P.2d 415]: \"On an appeal from a judgment imposing the penalty of death, a technical insufficiency in the form of an objection will be disregarded and the entire record will be examined to determine if a miscarriage of Justice resulted.\" The lead opinion in Frank was not signed by a majority of the court, and although later cases from this court have never disapproved its language, they have cited it only for the purpose of distinguishing it. (People v. Price (1991) 1 Cal. 4th 324, 417 [3 Cal. Rptr. 2d 106, 821 P.2d 610]; People v. Jennings (1991) 53 Cal. 3d 334, 357 [279 Cal. Rptr. 780, 807 P.2d 1009]; People v. Carrera (1989) 49 Cal. 3d 291, 324- 325 [261 Cal. Rptr. 348, 777 P.2d 121]; People v. Coleman (1988) 46 Cal. 3d 749, 777-778 [251 Cal. Rptr. 83, 759 P.2d 1260]; People v. Poggi (1988) 45 Cal. 3d 306, 331 [246 Cal. Rptr. 886, 753 P.2d 1082]; People v. Anderson (1987) 43 Cal. 3d 1104, 1129, fn. 3 [240 Cal. Rptr. 585, 742 P.2d 1306].) Moreover, here the objections in question were not merely technically insufficient, they had nothing to do with the issue complained about on appeal.\n\nDefendant also argues that even if his counsel's objections were not explicitly based on the Kelly/Frye rule, we should consider the issue preserved for appeal because the parties understood that the purpose of counsel's objections was to raise the Kelly/Frye issue. Defendant relies on People v. Boggess (1924) 194 Cal. 212, 232 [228 P. 448], in which we said: \"While it is true ordinarily that an objection to evidence must be sufficiently specific to inform the court of the scope of the objection, nevertheless, where the record shows ... that all the parties, including the court, must have understood the purpose of the objection, it will not be said that the objection failed of its purpose.\" (See also People v. Scott (1978) 21 Cal. 3d 284, 290 [145 Cal. Rptr. 876, 578 P.2d 123] [\"the objection will be deemed preserved if, despite inadequate phrasing, the record shows that the court understood the issue presented\"].) Here, however, the record does not show that either the prosecution or the trial court understood the objections in question to raise a Kelly/Frye challenge. Defendant's attempt to rely on the rule set forth in Boggess thus fails.\n\nEqually misplaced is defendant's reliance on People v. Shirley (1982) 31 Cal. 3d 18 [181 Cal. Rptr. 243, 723 P.2d 1354]. According to defendant, we disregarded in Shirley the failure of the defense to properly object on Kelly/Frye grounds to the use of hypnotically induced testimony. In Shirley, the defendant \"moved to exclude all testimony of the ... witness that was the result of her having been hypnotized,\" arguing that \"the People were attempting 'to expand hypnosis into an area [in] which they cannot lay adequate foundation for its reliability' as a tool for refreshing recollection.\" ( at p. 29.) By challenging the reliability of the scientific technique in question, the defendant in Shirley properly preserved the issue for appeal. There was no similar objection in this case.\n\nIn sum, defendant's failure at trial to challenge the testimony of the prosecution experts on Kelly/Frye grounds bars him from now raising the issue. (People v. Kaurish (1990) 52 Cal. 3d 648, 688 [276 Cal. Rptr. 788, 802 P.2d 278].)\n\nC. Corpus Delicti Rule\n\nAccording to defendant, this court's Discussion of the corpus delicti rule in People v. Ruiz (1988) 44 Cal. 3d 589 [244 Cal. Rptr. 200, 749 P.2d 854] is inconsistent with the due process guarantees of the federal Constitution. As a result, he contends, the trial court in this case may have misconstrued the scope of the rule, thereby violating his right to due process. Defendant makes no showing that our decision in Ruiz, whether right or wrong, had any effect on his case, which was tried before Ruiz was decided. On that basis alone, we could probably summarily reject defendant's claim. In any event, as shown below, the contention is without merit.\n\n\"In any criminal prosecution, the corpus delicti must be established by the prosecution independently from the extrajudicial statements, confessions or\n\nadmissions of the defendant. [Citations.] The elements of the corpus delicti are (1) the injury, loss or harm, and (2) the criminal agency that has caused the injury, loss or harm.\" (People v. Wright (1990) 52 Cal. 3d 367, 403-404 [276 Cal. Rptr. 731, 802 P.2d 221].) Proof of the corpus delicti need not be beyond a reasonable doubt; a slight or prima facie showing is sufficient. (People v. Jennings, supra, 53 Cal. 3d at p. 368.)\n\nIn People v. Ruiz, supra, 44 Cal. 3d 589, the defendant argued that, in view of the paucity of evidence of the victim's death, the evidence was insufficient not only to support the conviction, but also to establish the corpus delicti. We disagreed, pointing out that there was ample evidence of the victim's death by foul play, from which a reasonable inference of criminal agency could arise. In the course of our Discussion, we said: \"The corpus delicti 'may be [proved] by circumstantial evidence [citation], and it need not be beyond a reasonable doubt. A slight or prima facie showing, permitting the reasonable inference that a crime was committed, is sufficient.' ... [P] ... '[T]he corpus delicti rule is satisfied \"by the introduction of evidence which creates a reasonable inference that death could have been caused by a criminal agency ... even in the presence of an equally plausible noncriminal explanation of the event.\" ' \" ( at pp. 610-611, quoting People v. Alcala (1984) 36 Cal. 3d 604, 624-625 [205 Cal. Rptr. 775, 685 P.2d 1126], and People v. Towler (1982) 31 Cal. 3d 105, 117 [181 Cal. Rptr. 391, 641 P.2d 1253], brackets in original.) Seizing on this language, defendant accuses this court of weakening the prosecutor's burden of establishing every element of the offense beyond a reasonable doubt. He is wrong. The corpus delicti rule is a rule of law that governs the admissibility of evidence. (People v. Rogers (1943) 22 Cal. 2d 787, 806 [141 P.2d 722]; 1 Witkin \u0026 Epstein, Cal. Criminal Law (2d ed. 1988) Elements of Crime, § 140, p. 156.) It has no bearing on the prosecution's burden to prove beyond a reasonable doubt all elements of the offense; nothing that we said in People v. Ruiz, supra, 44 Cal. 3d 589 alters this. There is thus no merit to defendant's contention that our decision in Ruiz violated any federal due process requirements.\n\nD. Sufficiency of Evidence\n\nDefendant contends the evidence was insufficient to support his conviction for murdering the 12 patients. In an exhaustive analysis encompassing more than 250 pages of his 617-page opening brief, defendant argues that the evidence is insufficient to show: (1) that the patients were murdered at all; (2) assuming the patients were murdered, that defendant was the killer; or (3) assuming defendant killed the patients, that he acted with malice and with premeditation and deliberation. Although defendant has attacked the sufficiency of the evidence in general, defendant primarily focuses on the sufficiency of evidence as to each patient.\n\nDefendant's attempt to focus on the evidence relating to each individual patient is somewhat misleading, because much of the strength of the prosecution's case lay in the large number of patients on defendant's shift whose deaths were accompanied by similar, highly unusual, circumstances. Symptoms that might be written off as idiosyncratic in one or two patients become highly suspicious when repeated numerous times. Accordingly, we first discuss the evidence that was common to all, or nearly all, of the 12 victims. We then address defendant's challenges to the sufficiency of the evidence with respect to particular patients.\n\n1. Evidence That the Patients Were Murdered\n\nAs earlier stated, the theory of the prosecution was that the patients were murdered by means of massive overdoses of lidocaine. Expert witnesses testifying for the prosecution\u003cspan class=\"fnref\"\u003e10\u003c/span\u003ea relied largely on three types of evidence to conclude that each of the twelve patients died from lidocaine poisoning: evidence of lidocaine in the tissues of the deceased patients, evidence of seizure activity, and electrocardiograph evidence.\n\na. Lidocaine in the Tissues of the Deceased Patients\n\nBecause each of the 12 patients had been gravely ill at the time of death, there initially was no suspicion of foul play. Understandably, therefore, autopsies of most of the patients were not considered necessary, and either 9 or 10 of the 12 patients were embalmed and buried.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e As the number of deaths at CHOV mounted, and authorities became suspicious that the patients had not died from natural causes, the bodies of the patients that had already been buried were exhumed, autopsied, and tested for lidocaine and other drugs. The bodies of patients Bayless and Boyce, who were two of the last patients to have died and had not yet been embalmed when the autopsies began, were also examined and tested.\n\nBecause of the embalming, blood samples were unavailable for any of the patients except Bayless and Boyce. Accordingly, prosecution experts took tissue samples from the patients' internal organs (heart, brain, liver, lungs, kidneys, and in some cases the vitreous humor (a watery fluid in the eyeball)), and measured the quantity of lidocaine found in these samples. Based on these calculations, the experts concluded that each of the patients had been given a massive overdose of lidocaine. Although all of the patients (with the apparent exception of patient Bayless) had been given therapeutic doses of lidocaine during their hospitalization, according to prosecution experts the amount found in the tissue samples far exceeded that attributable to the therapeutic doses.\n\nLending additional support to the prosecution experts' Conclusion was the presence, in some patients, of relatively small quantities of MEGX, a metabolite into which lidocaine may decay, indicating that the lidocaine poisoning resulted from administration of a large overdose shortly before death, not from the buildup of lidocaine therapeutically administered over a period of time.\n\nb. Seizure Activity\n\nWitnesses observed seizures in all but two of the deceased patients, and in several other patients who did not die. These seizures (with the exception of patient Swanson's) were extremely violent. The nurses who witnessed them had never seen such seizures in heart patients; some of the nurses likened them to epileptic seizures. The fact that the patients shared this unusual common symptom suggests that their deaths had a common cause, and that the cause was atypical.\n\nAlmost all of the deaths were preceded by violent seizures, rapidly followed by cardiac and respiratory arrest. This highly unusual sequence of symptoms--seizure followed by cardiac and respiratory arrest--had few possible causes.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Although recorded cases involving massive overdoses of lidocaine are rare, prosecution experts, after reading the scanty literature on the subject, concluded that these symptoms, in the order mentioned, would be the most likely response to a massive overdose of lidocaine.\n\nBecause of differences in the elimination and distribution of lidocaine from one person to the next, mild overdoses of the drug are not uncommon. But they produce symptoms substantially different from those observed in the patients in this case. Here, the patients did not exhibit the symptoms of mild lidocaine toxicity that one would expect from a slow buildup of therapeutically administered lidocaine to lethal levels.\n\nc. Electrocardiograph Evidence\n\nEach of the patients was attached to an electrocardiograph (EKG) at the time of death. The EKG produced strips of paper recording the patients' heartbeat (rhythm strips). Some of these rhythm strips were preserved in the patients' files. After examining the strips, the prosecution experts discovered that for most of the patients a portion of the rhythm strip showing electrical activity from the ventricles (the lower chambers of the heart), known as the QRS complex, was unusually prolonged at the time of seizures and/or cardiac arrest. Although a prolonged QRS complex may result from a variety of causes, the prosecution's experts were of the opinion that the unusually prolonged or \"broad\" QRS complexes of the patients in this case were evidence that the patients were given lidocaine overdoses.\n\nNot surprisingly, experts testifying for the defense challenged the Conclusions of the prosecution's experts.\n\nPeter Ambrose, a clinical pharmacokineticist\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e who interprets drug tests at Memorial Hospital in Long Beach and teaches at the University of California Medical Center in San Francisco, explained that in this case some of the ailments of the patients, and some of the drugs administered to them, could have substantially impaired the patients' ability to metabolize and dispose of lidocaine. These factors, as well as the administration of cardiopulmonary resuscitation (CPR) could also have significantly affected the distribution of lidocaine in their bodies, so that instead of disbursing evenly throughout the body, the lidocaine was more likely to remain in the bloodstream and internal organs.\n\nFor these reasons, pharmacokinetecist Ambrose concluded that the therapeutic dosages of lidocaine given to the patients should have caused lidocaine concentrations in their blood and internal organs that were far greater than the amounts estimated by prosecution experts. In Ambrose's opinion, the concentrations of lidocaine found in the tissues of many of the patients were more or less consistent with the therapeutic doses administered to them.\n\nDr. Neal Benowitz, an associate professor of medicine at the University of California at San Francisco, head of the university's division of clinical pharmacology, and an expert in cardiovascular pharmacology, analyzed the medical records and rhythm strips of each of the deceased patients. In his opinion, each of the 12 patients could have died from natural causes, or from toxic reactions to medications therapeutically administered to them.\n\nDr. Bramah Singh, assistant chief of the cardiology sivision at the University of California at Los Angeles (UCLA) Medical Center and professor of internal medicine at the UCLA School of Medicine, testified that the scientific data available was too inconclusive for the prosecution experts to infer that, based on the levels of lidocaine found in the tissues of the deceased patients, the patients had been given overdoses of lidocaine. Like Dr. Benowitz, he testified that each of the patients could have died from other causes.\n\nDr. Stephen Salzman, director of cardiology and head of the coronary care and intensive care units at West Hills Hospital in the San Fernando Valley, and assistant clinical professor at the UCLA School of Medicine, testified that he had never relied on the concentration of lidocaine found in the tissues of a deceased patient as a basis from which to conclude that the patient had been given a toxic quantity of the drug. Dr. Salzman acknowledged, however, that he was not qualified to determine whether such a Conclusion could indeed be reached. Based on his review of the deceased patients' medical charts, he was of the opinion that various other causes might have led to the deaths of the patients.\n\nJohn Zeisler, an assistant professor of clinical pharmacy at the University of Southern California School of Pharmacy and a pharmacist at Presbyterian Intercommunity Hospital in Whittier, described two research studies he had done on the effects of lidocaine. According to him, under standard methods of lidocaine prescription a significant number of patients are given lidocaine in a dosage above the therapeutic level, and the likelihood of overdosage is particularly great with older patients.\n\nDefendant denied poisoning the 12 patients, and described at length his observations of the patients' symptoms before their deaths.\n\nRelying on the testimony of his own expert witnesses, defendant contends that the evidence of lidocaine in the patients' tissues does not support the prosecution's theory that lidocaine intoxication was the cause of death. He points out that Dr. Singh testified that evidence of lidocaine in tissue samples obtained from corpses was not a reliable indicator of the amount of lidocaine administered to the patients when they were alive. In a similar vein, Dr. Salzman testified that he had never used tissue levels of lidocaine for this purpose, and knew of no doctor who had. Other defense experts, Dr. Benowitz and pharmacokineticist Ambrose, while accepting the viability of using tissue samples to determine quantities of lidocaine administered before death, concluded that the quantities found in the deceased patients were consistent with the amounts therapeutically administered to them while they were alive.\n\nThe significance of the lidocaine concentrations found in the patients' tissues was hotly contested at trial. This dispute, however, was properly one for the trier of fact, not the reviewing court, to resolve. As a reviewing court, our role is limited to determining whether there is substantial evidence to support the decision of the trier of fact. Substantial evidence is defined as \"evidence which is reasonable, credible, and of solid value--such that a reasonable trier of fact could find the defendant guilty beyond a reasonable doubt.\" (People v. Johnson (1980) 26 Cal. 3d 557, 578 [162 Cal. Rptr. 431, 606 P.2d 738, 16 A.L.R.4th 1255].) In this case, the prosecution presented testimony by a number of highly qualified expert witnesses, who concluded from the lidocaine concentrations in the patients' tissue samples that the patients had been given massive overdoses of lidocaine. The trier of fact could reasonably credit this testimony.\n\nDefendant also argues that the prosecution experts improperly relied on the patients' broad QRS complexes as a factor indicative of lidocaine overdose. Defendant asserts that there are a number of possible causes of broad QRS complexes. But although the possibility of other causes may reduce the weight to be attached to the evidence that the patients had broad QRS complexes, this evidence was one link in the circumstantial chain of evidence that the patients died from overdoses of lidocaine, and was properly relied upon by the prosecution experts.\n\nDefendant minimizes the significance of the seizures suffered by the patients, asserting that in most cases the percipient witnesses disagreed as to whether the seizures occurred. This assertion is true only if defendant is included as one of the percipient witnesses. Except for defendant's testimony, there was no dispute that most of the seizures occurred, although in some cases witnesses who had arrived in the ICU after the seizures had begun testified that they could not remember whether they had seen seizures. The trial court could reasonably believe the ICU nurses who offered credible, convincing testimony that the seizures occurred.\n\nFinally, defendant contends that the patients' medical records, relied on by the experts for the prosecution (and, we note, the experts for the defense), were too unreliable to satisfy the business records exception to the hearsay rule (Evid. Code, § 1271), and that the trial court should have sustained defendant's objection to their introduction. Because this contention is raised as part of defendant's claim that the evidence was insufficient to support the verdict, we address it here.\n\nTo satisfy the business records exception to the hearsay rule, the proponent of the evidence must show, among other things, that \"[t]he sources of\n\ninformation and method and time of preparation were such as to indicate its trustworthiness.\" (Evid. Code, § 1271, subd. (d).) According to defendant, the medical records in this case were untrustworthy, inaccurate, and incomplete. He cites testimony by the custodian of the records that items were missing from most of the files, and that the nurses sometimes did not complete the patients' charts until the end of their shifts, hours after the events recorded actually occurred. Defendant also points to evidence that at times nurses gave patients medications but neglected to record that fact in the patients' charts.\n\nAlthough there were undoubtedly deficiencies in the patients' medical records (Nurse MacDonald testified that CHOV had a \"chronic problem\" with incomplete charts), these deficiencies were not so great as to require the trial court to exclude the records from evidence. Jean McCormick, CHOV's administrator, testified that the fact that certain items were missing from the files did not impair the accuracy of those items that were remaining; the defense offered no testimony to impeach her.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Furthermore, the trial court, as trier of fact, was aware of the deficiencies in the records, and could discount their weight accordingly. It is well established that, as a general rule, \"hospital records are business records and as such are admissible if properly authenticated.\" (People v. Moore (1970) 5 Cal. App. 3d 486, 492-493 [85 Cal. Rptr. 194].) In this case, the records were properly authenticated, and the trial court could reasonably conclude that the method of preparing them was sufficiently reliable to justify their admission.\n\nFor the reasons set forth above, we conclude there is substantial evidence to support the trial court's Conclusion that someone had administered large overdoses of lidocaine to the patients, causing their deaths.\n\n2. Evidence That Defendant Was the Killer\n\nIf we make the not-unreasonable assumption that all fatal overdoses were administered by the same person, defendant must be the killer. The patients were poisoned at night, in the hospital's ICU, where the presence of a stranger certainly would have attracted the staff's attention. At least two nurses were on duty on each of the nights when overdoses were administered, but defendant was the only nurse who was on duty on all of those nights. None of the other nurses was present on any more than five of the relevant nights. Although no one saw defendant inject the fatal overdoses, in each of the 12 instances he had the opportunity to do so, and many\n\nof the victims started having seizures soon after defendant announced that he was about to give them medication.\n\nMoreover, as we shall discuss below, other circumstantial evidence suggested that defendant was injecting patients with superconcentrated lidocaine: the \"Neble bolus,\" the \"Boyce bolus,\" evidence that defendant kept lidocaine in his pockets, and lidocaine found in defendant's home.\n\na. The Neble Bolus (Preloaded Syringe Found by Neble)\n\nOn April 24, 1981, one day after the death of the eleventh of the victims in this case, CHOV closed its ICU, which was never to reopen. Seven months later, a construction worker named Michael Neble was tearing down drywall in the ICU when he saw a bolus or preloaded syringe (the \"Neble bolus\") sticking out of one of the beds. The label on the bolus indicated a 2 percent solution of lidocaine, but expert analysis established that the bolus contained a 23 percent solution of lidocaine.\n\nNurse MacDonald's fingerprint was found on the bolus. According to the prosecution, defendant had asked Nurse MacDonald to inject the contents of this bolus into patient Castro on the morning of April 20, 1981. The prosecutor theorized that, knowing MacDonald's print was on the bolus and attempting to deflect suspicion onto MacDonald, defendant \"planted\" the bolus in the bed.\n\nb. The Boyce Boluses\n\nShortly before patient Boyce's death on April 23, 1981, CHOV, which was concerned about the high death rate in its ICU, adopted a policy that all syringes used to inject patients with medication were to be placed in a box. Among those syringes collected were two boluses (preloaded syringes) labeled \"Boyce, Bertha, 4-22-81,\" in defendant's handwriting. Each was nearly empty. According to the labels, one bolus should have contained a 2 percent solution of lidocaine while the other should have had a 1 percent solution. Expert analysis of the liquid remaining in the boluses established that one had 22.6 percent lidocaine and the other 20.9 percent lidocaine.\n\nc. Lidocaine and Syringes Observed in Defendant's Pockets\n\nNurse Cheville testified that every night while on duty with him, she saw defendant carry a box of lidocaine in his shirt pocket. When she asked him why, defendant replied that he wanted the lidocaine available in case it was needed.\n\nOn the morning of patient Silvera's death, Nurse Race saw a glass syringe and several plastic syringes in defendant's pocket; on another occasion she saw defendant take a vial of medicine from his pocket and draw the medicine into a plastic syringe. In shape and size, the vial resembled a two-gram vial of lidocaine.\n\nd. Evidence Found at Defendant's House\n\nActing under a warrant to search defendant's house, the police retrieved a garbage bag containing a brown paper bag that had a half-empty two-gram vial of 20 percent lidocaine. Also in the garbage bag were several syringes and an empty box designed to hold a 1 percent vial of lidocaine. In a closet in the master bedroom, the police found a box containing a sealed vial of 1 percent lidocaine.\n\nNotwithstanding the mass of circumstantial evidence linking defendant to the murders of the 12 patients, defendant maintains that the evidence was insufficient. He contends that being on duty the night each of the patients died merely places him at the scene of the crime. He argues that \"[m]ore is needed\" because the scene of the crime was \"a busy hospital, open to the public and staffed by a wide variety of people.\" But the patients' seizures occurred in the middle of the night, when a \"wide variety of people\" was not present. Also, the seizures took place in the hospital's ICU, where, because of the patients' fragile condition, visitors are generally limited to the patients' close relatives.\n\nDefendant also attempts to minimize the significance of the lidocaine found in his home, claiming it was \"no more than the ordinary medical debris a registered nurse might accumulate.\" Certainly, the presence of lidocaine in defendant's house, when considered in isolation, cannot be likened to a \"smoking gun\"; it was, however, a link in the circumstantial chain of evidence identifying defendant as the person who administered overdoses of lidocaine to the 12 patients. Considered in its entirety, the evidence pointed unerringly to defendant as the killer.\n\n3. Evidence of Malice and of Premeditation and Deliberation\n\nNext, defendant argues that even if the evidence established him to be the killer of the 12 patients, it does not show that he acted with malice, an element of the crime of murder. (§ 187.) He points out that both prosecution and defense experts testified regarding instances of accidental lidocaine overdoses in other hospitals, and he theorizes that perhaps this was the case here.\n\nThe contention borders on the frivolous. Defendant's own testimony establishes that he was a trained nurse and well aware of lidocaine's effects and proper dosages. Although conceivably defendant could have given an unintentional overdose of lidocaine to a single patient, it is inconceivable that defendant accidentally gave fatal overdoses of lidocaine to 12 patients in the short time span of 4 weeks.\n\nDefendant also contends the evidence was insufficient to show premeditation and deliberation, and therefore the murders were not shown to be of the first degree. Not so. The manner in which the 12 murders were committed shows that they could not have been spontaneous acts. More important, when a murder is accomplished by means of poison, additional proof of premeditation and deliberation is not required to establish it as first degree murder. (§ 189; 1 Witkin \u0026 Epstein, Cal. Criminal Law, supra, Crimes Against the Person, § 467, p. 527; see People v. Ruiz, supra, 44 Cal. 3d 589, 614 [lying in wait]; People v. Wiley (1976) 18 Cal. 3d 162, 168 [133 Cal. Rptr. 135, 554 P.2d 881] [murder by torture].) Because defendant murdered the 12 victims by poisoning them with lidocaine overdoses, the murders were necessarily of the first degree.\n\n4. Evidence Pertaining to Each of the Individual Patients\n\nIn addition to his claim, addressed above, that the evidence as a whole is insufficient to support the convictions, defendant also makes specific attacks on the sufficiency of the evidence that he killed each of the 12 patients. We reject the challenge.\n\nBefore discussing the facts of each killing, we summarize the procedures employed at CHOV's ICU, where 11 of the 12 victims died.\n\nThe ICU at CHOV contained six beds, but during most of the period relevant here was not fully occupied. Each bed was in a separate room with a large window to enable nurses to look in. During the night shift, between two and four nurses worked in the ICU, depending on the number of patients. Although no doctors worked in the ICU, one was always on duty in some other part of the hospital, and was thus available to render assistance in a life- threatening emergency, in hospital parlance a \"code\" or \"code blue.\"\n\nAs is customary in ICU's, the registered nurses (RN's) were given substantial authority to administer medication to the patients if the symptoms\n\nthey observed warranted it.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e This was done through the use of \"standing orders,\" which authorize the nursing staff of an ICU, when a doctor is not available, to administer prescribed dosages of specified medications when the patient exhibits certain described symptoms.\n\nCHOV's standing orders permitted RN's to administer lidocaine to patients when they observed specified cardiac irregularities. Patients were commonly given lidocaine in a two-step process: an initial injection of between 50 and 100 milligrams of lidocaine, followed by an intravenous (IV) drip. The initial injection was administered from a preloaded syringe, known as a bolus, containing a 2 percent solution of lidocaine. The IV drip or \"infusion\" was prepared by adding a vial of 20 percent lidocaine to a bottle of bulk fluid, which was then attached to a needle that had been inserted into a vein, and allowed to drip slowly into the patient's bloodstream at a rate of between one and four milligrams per minute. In theory, the amount of lidocaine infused would equal the amount eliminated by the body, and a constant, therapeutic level of lidocaine would be maintained in the bloodstream.\n\nIn this case, the prosecution theorized that defendant removed the 2 percent solution from boluses of lidocaine and replaced it with a 20 percent solution from the vials, and that defendant then administered this solution to the victims. As a result, the victims received 1,000 milligrams or more of lidocaine in a matter of minutes. According to prosecution experts, an injection of 1,000 milligrams was likely to be lethal. For a patient receiving a therapeutic lidocaine infusion, an additional injection of as little as 500 milligrams of lidocaine was potentially fatal.\n\nTo facilitate the rapid administration of medications, each patient was hooked to at least one and sometimes two IV lines, which normally flowed into veins in the patient's arm. When no medication was being administered, the bottles attached to the lines contained a solution of dextrose and water. To monitor their heartbeats, most of the patients were connected to EKG's.\n\nAlthough each nurse took primary responsibility for one or more patients in the ICU, the nurses functioned as a team; thus, it was not uncommon for a nurse to enter the room of another nurse's patient to check, assist, or give medication to the patient.\n\nWe now discuss, in chronological order, the facts surrounding the death of each of the 12 patients who died in the hospital's ICU while defendant was attending them as a nurse.\n\na. March 29, 1981: Death of Irene Graham\n\nAt 11:00 p.m. on March 29, 1981, three nurses began working the night shift\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e in CHOV's ICU: Dorothetta Ernest, Donna MacDonald, and defendant. The care of eighty-nine-year-old Irene Graham, one of six patients in the unit, was entrusted to Nurse Ernest. Graham had been admitted to the ICU earlier that evening for chest pains following a burglary at her home. She also suffered from congestive heart failure, a condition in which the heart is unable to pump efficiently, causing blood to build up in the lungs and other organs. EKG rhythm strips indicated that she had an ongoing myocardial infarction (heart attack).\n\nAccording to Nurse Ernest, for the first five hours after Graham's admission her vital signs were stable and her heartbeat was regular, with occasional premature ventricular contractions.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e While Ernest was on a lunch break between 4:30 and 5:00 a.m., defendant told Nurse MacDonald that Graham was having problems, and requested that she ask Nurse Ernest to return. When Ernest returned, Graham was sleeping, and defendant was injecting something into Graham's IV line. Defendant told Nurse Ernest that Graham had been experiencing ventricular tachycardia (a rapid heart beat arising from the heart ventricles), and that he was therefore giving her two boluses of lidocaine. (If these were indeed Graham's symptoms, the treatment was appropriate under the hospital's standing orders.)\n\nNurse Ernest called Graham's doctor to report Graham's ventricular tachycardia; the doctor ordered a lidocaine drip, which was commenced at 5:30 a.m. Fifteen minutes later, while Nurse Ernest was making entries in charts, patient Graham suddenly screamed and had a massive seizure, which Ernest described as similar to a grand mal epileptic seizure but more violent. Shortly thereafter, Graham stopped breathing, which was rapidly followed by cardiac arrest. Resuscitative efforts were unsuccessful, and Graham was pronounced dead at 6:15 a.m.\n\nDefendant maintains that Graham died from natural causes. He points out that Graham was 89 years old, and that she was admitted to CHOV after an apparent heart attack. He contends that the prosecution experts' testimony regarding the lidocaine concentrations in Graham's tissues is unreliable, and points out that even if that evidence could be properly\n\nconsidered as evidence of guilt, two defense experts (Peter Ambrose, a pharmacokineticist, and Neal Benowitz, a physician) testified that Graham's lidocaine levels were consistent with the therapeutic amounts given to her. Relying on testimony by three defense experts (Drs. Benowitz, Salzman, and Singh), defendant asserts that Graham's seizures could have been caused by a therapeutic dose of lidocaine, by low blood sugar, by a blood clot, or by myocardial infarction.\n\nDefendant's argument is nothing more than a request that we reweigh the evidence, which would be improper for us to do. Defense expert Ambrose's calculations were challenged by prosecution experts. With respect to Dr. Benowitz's Conclusion that the lidocaine levels in Graham's tissues were consistent with the amounts therapeutically given to her, his testimony was based on the assumption that the therapeutic lidocaine infusion (IV drip) that was begun before Graham's seizure continued to run during the efforts to revive her after the seizure occurred. This assumption was contradicted by Nurse Ernest, who testified that she turned off the lidocaine drip when Graham had her seizure.\n\nDr. Dale Isaeff, who had analyzed Graham's rhythm strips on behalf of the prosecution, found evidence of a prolonged QRS complex\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e in the half hour preceding Graham's seizures. In addition, analysis of Graham's tissues revealed the presence of concentrations of lidocaine that Dr. Isaeff and the prosecution's three toxicologists (Michael Peat, Alphonse Poklis, and Randell Baselt) found to be extremely high. Dr. Isaeff concluded that Graham's \"clinical picture\" could have been caused by someone injecting 500 or 1,000 milligrams of lidocaine into Graham's IV line at 5:15 a.m. Based on all of these facts, a pathologist testifying for the prosecution, Dr. Rene Modglin, concluded that Graham's death was the result of lidocaine poisoning, although her heart disease was a contributing factor. This substantial evidence supports the trial court's Conclusion that Graham died from an overdose of lidocaine.\n\nb. April 3, 1981: Death of Bernard Kean\n\nOn April 3, 1981, two nurses were on duty during the night shift at CHOV's ICU: Lois Cheville and defendant. At 1:00 a.m., Bernard Kean, age 52, was admitted to the ICU for chest pains and alcohol intoxication. In the opinion of Dr. Gillian DeRaad, who had earlier examined Kean in the emergency room, Kean might have suffered a myocardial infarction.\n\nNurse Cheville described Kean's condition at the time of admission to the ICU as drunk but alert, agitated and combative. At 1:40 a.m., Kean was sleeping soundly and his heartbeat was normal.\n\nAt 2:10 a.m., Kean suffered the first of three seizures. Nurse Cheville called Dr. DeRaad, who came over from the emergency room and ordered that Kean be given various drugs, including lidocaine. Defendant administered the medications. Kean's condition improved, but at 4:03 he had another seizure, followed by respiratory and cardiac arrest. Resuscitative efforts restored Kean's heartbeat, but he never regained consciousness. After yet another seizure, at 5:00, he died at 5:07 a.m.\n\nDefendant insists that Kean died from natural causes, not from a lidocaine overdose. He observes that both prosecution and defense experts agreed that Kean suffered from severe heart and liver disease. He attributes Kean's seizures to alcohol withdrawal, noting that all of the experts testified that such withdrawal could cause seizures. But Dr. Benowitz, testifying for the defense, conceded that such seizures are unusual when a patient is sleeping, and Nurse Cheville testified that Kean was sleeping when his seizures occurred; also, Dr. Isaeff testified for the prosecution that alcohol withdrawal does not cause violent seizures of the type Nurse Cheville had observed in Kean.\n\nAfter analyzing the cardiac rhythm strips taken between Kean's second and third seizures, Dr. Isaeff concluded that they showed a broad QRS complex. In his opinion, Kean's symptoms immediately before death were consistent with the administration of several massive overdoses of lidocaine during the night. In addition, based on a toxicological analysis, Dr. Modglin and toxicologists Peat, Poklis and Baselt concluded that the concentration of lidocaine in Kean's tissues was lethal; based on all the evidence, these experts were of the opinion that Kean was given a massive quantity of lidocaine just before he died. According to Dr. Modglin, although acute myocardial infarction, caused by an occluded coronary artery, was the primary cause of death, the lidocaine overdose shortened Kean's life. Based on this evidence, the trial court, sitting as trier of fact, had substantial evidence to support its Conclusion that Kean died from an overdose of lidocaine.\n\nDefendant points out that the prosecution retested the tissue samples of Kean's liver and kidney shortly before the trial began, and that those test results varied substantially from the first test results.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The variance on the retest, defendant asserts, indicates the unreliability of the testing procedure. Each of those tests, however, in the opinion of the prosecution experts,\n\nshowed lethal quantities of lidocaine in Kean's tissues. The differing results, which may have been attributable to the lengthy passage of time between the two tests, do not undermine the validity of the initial test.\n\nc. April 4, 1981: Death of Beatrice Cline\n\nOn April 4, 1981, defendant and Nurse MacDonald were on duty during the night shift at CHOV's ICU. One of the ICU patients was seventy-nine-year- old Beatrice Cline, who had been admitted because of chest pains. Cline had a history of heart problems and congestive heart failure. Nurse MacDonald found Cline to be alert and talkative; because Cline had been given morphine in the emergency room, she was no longer experiencing chest pain.\n\nDuring the night, Cline experienced renewed chest pain, as well as bradycardia (slow heart rate). Defendant administered morphine for the pain and atropine for the bradycardia. Three minutes later, at 1:55 a.m., Cline began having seizures. Nurse MacDonald described the seizures as similar to those suffered by ICU patient Graham a few days previously; never before had MacDonald seen cardiac patients have seizures of this nature.\n\nDr. Harold Kent, who was on duty in the emergency room, responded to the call from the ICU. When he arrived, Cline was unresponsive, and she was making slight shivering motions, which he did not interpret as indicative of a seizure; Cline was also having respiratory problems. Shortly thereafter Cline's heart stopped beating. Revival efforts, which included an injection and infusion of lidocaine, failed, and Cline was pronounced dead at 2:32 a.m.\n\nDefendant attributes Cline's death to either a myocardial infarction (as suggested by defense experts Drs. Salzman and Singh) or possibly to an excessive dose of digitalis, as suggested by defense expert Dr. Benowitz. Defendant also questions whether Cline did have a seizure, noting that no one other than Nurse MacDonald actually observed it. He also points to pharmacokineticist Ambrose's testimony that the amount of lidocaine found in Cline's tissues was consistent with the amount therapeutically administered to her, because she had many characteristics that would reduce her body's ability to metabolize the drug.\n\nDefendant's argument is refuted by the testimony of Nurse MacDonald and the prosecution's expert witnesses. Nurse MacDonald gave credible testimony that Cline suffered seizures before she died. According to prosecution expert Dr. Isaeff, rhythm strips that were apparently taken after the\n\nonset of Cline's seizures showed a broad QRS pattern; also, as was the case with the other victims, Cline's tissue samples contained large quantities of lidocaine. Based on this evidence, Dr. Isaeff concluded, as did Dr. Modglin and toxicologists Peat, Poklis and Baselt, that Cline was given a massive overdose of lidocaine; additionally, Dr. Modglin testified that Cline died from lidocaine poisoning, and that arteriosclerotic heart disease was an \"other significant condition.\" This evidence amply supports the trial court's Conclusion that defendant killed Cline by giving her a lethal overdose of lidocaine.\n\nd. April 5, 1981: Death of Minnie Dempsey\n\nOn April 5, 1981, defendant and Nurse Carl Chetlan were on the night shift when Minnie Dempsey, age 88, was admitted to the ICU because of chest pains, shortness of breath, and congestive heart failure. She was, however, conscious and able to speak.\n\nApproximately half an hour after her admission, at 4:39 a.m., Dempsey had seizures, followed by cardiac and respiratory arrest. Emergency treatment revived Dempsey, but her seizures continued for roughly 15 minutes. Eventually, she was stabilized and placed on a respirator.\n\nThat same night, another ICU patient, Helen Primakow, suffered seizures identical to Dempsey's, but Primakow survived. Nurse Chetlan described the seizures of both patients as \"very violent\" with \"total muscle involvement.\"\n\nAt 6:32 a.m., patient Dempsey again suffered cardiac arrest; again she was revived. When Nurse Lyn Race started her day shift at 7:00 a.m., defendant told her about Dempsey's seizures during the night and predicted that she was going to \"code.\" According to Race, defendant was \"hyper\" and \"excited,\" pacing rapidly between Dempsey's room and the nursing station. As the day shift nurses were being briefed on the condition of the ICU patients, defendant, who had remained with the patients, interrupted the meeting to summon emergency aid for Dempsey. Nurse Race rushed to Dempsey's bedside and saw that she was having seizures. Shortly thereafter, Dempsey's heart stopped beating. She died at 7:18 a.m.\n\nDefendant argues that the drug aminophylline may have caused Dempsey's initial seizure, and that an impaired blood supply to the brain, the result of Valium administered after the first seizure, may have caused the later seizures. Defendant points out that pharmacokineticist Ambrose, who testified for the defense, found the lidocaine levels in Dempsey's tissues to be consistent with the therapeutic amounts administered to her. Defendant\n\nalso relies on testimony by defense experts Drs. Benowitz and Singh that Dempsey's heart rhythm was not what one would expect following an overdose of lidocaine, and that Dempsey may have died of a heart attack.\n\nProsecution experts refuted these arguments. Dr. Roy Jutzy, who analyzed Dempsey's medical records for the prosecution, testified that rhythm strips taken shortly after Dempsey's first seizure showed a broad QRS complex. Dr. Jutzy concluded that Dempsey's physical symptoms were compatible with the administration of a large quantity of lidocaine before her initial seizure; her death could have been caused either by a second overdose of lidocaine or by heart damage resulting from the cardiac arrest that followed the initial seizure. Based on Dempsey's physical symptoms and the substantial quantities of lidocaine found in her tissues, toxicologists Peat, Poklis, and Baselt concluded that Dempsey had been given one and maybe two massive overdoses of lidocaine. The pathologist, Dr. Modglin, attributed Dempsey's death to lidocaine poisoning, listing her hypertensive arteriosclerotic heart disease as an \"other significant condition.\" This testimony provides substantial evidence to support the trial court's Conclusion that defendant killed Dempsey by injecting her with an overdose of lidocaine.\n\nDefendant also faults the prosecution for not calling as a witness Dempsey's husband, who, according to the medical records, was present at her bedside when the seizures began. The record does not reveal why Mr. Dempsey did not testify. In any event, the prosecution was not obligated to call him as a witness, nor, for that matter, was there such a duty on the defense. \"The prosecution is not required to call any particular witness, nor to put on all the evidence relating to a charge so long as all material evidence bearing thereon is fairly presented in such a manner as to accord to the defendant a fair trial.\" (People v. Stanley (1967) 67 Cal. 2d 812, 820 [63 Cal. Rptr. 825, 433 P.2d 913].)\n\ne. April 7, 1981: Death of Gertrude Bryant\n\nSharing night duty in the ICU at CHOV on April 7, 1981, were Nurse Cheville, Nurse Chetlan and defendant; they were later assisted by Nurse Wingo. One of the ICU patients was sixty-three-year-old Gertrude Bryant. She was suffering from high blood pressure and congestive heart failure; she was given Nipride to lower her blood pressure. At the beginning of the 11:00 p.m. shift, Bryant was coherent and able to talk; during the night, she lapsed into incoherent muttering.\n\nThereafter, around 5:00 a.m., another patient, Winnifred Hammond, had seizures, followed by cardiac and respiratory arrest. While emergency aid\n\nwas being given to Hammond (who survived), Bryant too began to have seizures. Shortly after receiving Valium for the seizures, Bryant suffered respiratory arrest.\n\nAt 7:00 a.m., when the day shift commenced, patient Bryant was still alive but unconscious. Defendant told a day nurse, Lyn Race, about Bryant's seizures, predicting that Bryant was \"going to code.\" Defendant appeared excited. As the day nurses were being briefed, defendant, who had remained with the patients, interrupted the meeting to report that Bryant was again having seizures. These seizures were followed within minutes by cardiac arrest. Emergency efforts to revive her were unsuccessful, and she was pronounced dead at 7:33 a.m.\n\nRelying on the testimony of his experts (Drs. Benowitz, Salzman, and Singh), defendant argues that Bryant's seizures were caused by a stroke, since Bryant had on previous occasions suffered seizures and a stroke. Defendant also speculates that the seizures might have resulted from the improper administration of the drug Nipride, which Nurse Cheville had given Bryant, and which can cause seizures if not administered properly. Finally, defendant cites the testimony of one of his experts, Dr. Singh, that rhythm strips showing the electrical activity in Bryant's heart immediately before her death strongly suggested that her death was not preceded by an overdose of lidocaine, and defendant cites testimony by other defense experts (pharmacokineticist Ambrose and Dr. Benowitz) that the lidocaine levels in the tissue samples taken from Bryant's internal organs were consistent with the therapeutic quantities therapeutically administered to her.\n\nBryant's medical records contained no rhythm strips for any time before 6:20 a.m.; the strips beginning at that time showed what might have been a broad QRS complex, but what might simply have been the effects of the CPR that was administered in an effort to revive Bryant. However, a nursing note in the file said that at 5:30 a.m., the EKG attached to Bryant showed that her heart had a \"nodal rhythm,\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e which, according to prosecution expert Dr. Jutzy, could have been caused by an overdose of lidocaine. Analysis of Bryant's tissues showed the presence of large quantities of lidocaine. Based on this evidence, prosecution experts concluded that Bryant had been given a substantial overdose of the drug, which caused her death. This testimony is sufficient to uphold defendant's conviction for murdering Bryant with an overdose of lidocaine.\n\nf. April 10, 1981: Death of John Rainwater\n\nOn the April 10, 1981 night shift, 95-year-old John Rainwater, an ICU patient at CHOV, was suffering from congestive heart failure, with symptoms of shortness of breath, irregular heart rhythm, and swelling of the legs. According to Nurse Cheville, who was on night duty with defendant and Nurse Duller, Rainwater was alert and in stable condition. At 4:00 a.m., defendant, who was watching the heart monitors of the ICU patients, told Nurse Cheville that Rainwater's heart rate had dropped, and that he was going to give Rainwater some atropine. After entering Rainwater's room, defendant called out that he intended to administer another dose of atropine. Soon thereafter, Rainwater began having seizures, which were followed by cardiac and respiratory arrest. Efforts to revive him failed, and Rainwater died at 4:45 a.m.\n\nDefendant points out that Rainwater was very old (95) and quite ill, suffering from severe congestive heart failure, and therefore his body would have had difficulty metabolizing the lidocaine that was given in therapeutic amounts. He argues, consistent with the testimony of his own experts, that Rainwater died from heart disease, possibly aggravated by therapeutically induced lidocaine toxicity. But in the opinion of prosecution experts Dr. Isaeff and toxicologist Baselt, the therapeutic dosage of lidocaine administered to Rainwater would not have caused the high levels of lidocaine found in Rainwater's tissues reported by toxicologist Peat.\n\nAccording to prosecution expert Dr. Isaeff, Rainwater's rhythm strips showed a prolonged QRS pattern from 4:29 to 4:41 a.m., and Rainwater's tissue samples contained large quantities of lidocaine. Based on this evidence, Dr. Isaeff concluded that Rainwater had been given a massive overdose of lidocaine, at least 1,000 milligrams, just before his death. This opinion was shared by toxicologists Peat and Baselt. In addition, there was testimony by Dr. Modglin that Rainwater's death was caused by lidocaine poisoning, \"associated\" with pulmonary arteriosclerotic heart disease. The testimony of the prosecution experts is substantial evidence supporting defendant's conviction for killing Rainwater.\n\ng. April 13, 1981: Deaths of Kenneth Silvera and Marian Stewart\n\nOn April 13, 1981, Kenneth Silvera and Marian Stewart were two of the ICU patients at CHOV. Silvera, age 82, had chest pain and heart palpitations; his diagnosis at admission was possible myocardial infarction and congestive heart failure with pulmonary edema (fluid in the lungs). Stewart, age 80, had been an ICU patient for several days. She was suffering from respiratory\n\nfailure from obstructive pulmonary disease, pneumonia, and possible congestive heart failure. The previous day, cardiac problems had caused her to stop breathing, but emergency aid revived her. She was receiving lidocaine for her irregular heartbeat.\n\nSometime that night, defendant visited Nurse Sandra Phenicie on CHOV's medical-surgical floor. He said that one of the ICU patients, whom he did not name, was \"going sour,\" and he predicted the need for emergency treatment.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAt 1:00 a.m., defendant injected ICU patient Silvera with a 100-milligram bolus of lidocaine for heart arrhythmia. At 1:26, defendant administered additional lidocaine to Silvera by IV drip. Half an hour later, defendant told Nurse Chetlan he was increasing the dosage of lidocaine. Within 10 minutes, Silvera began having violent seizures. Emergency treatment stabilized Silvera.\n\nMeanwhile, ICU patient Stewart, who was aware of the activity in Silvera's room, expressed fears of dying. While Nurse Cheville was on the telephone with Stewart's doctor to discuss Stewart's condition, defendant told her that Stewart was experiencing tachycardia and that he was going to give her lidocaine. About an hour and a half later, Stewart began experiencing ventricular fibrillation (chaotic, erratic electrical activity in the heart ventricles, associated with cessation of mechanical activity of the heart), followed by cardiac and respiratory arrest. Efforts to revive her were unsuccessful, and she died at 6:15 a.m. Witnesses did not observe any seizures.\n\nAround 7:15 a.m., ICU patient Silvera stopped breathing. Prosecution witnesses' accounts of the events immediately preceding the respiratory arrest varied. Some testified that Silvera again had seizures, while others did not recall such seizures. One witness testified that just before the seizures Silvera was given an IV containing lidocaine prepared by defendant, but another testified that Silvera was not given any lidocaine, while a third witness said that Silvera was given lidocaine for a brief period only and that the infusion of lidocaine was halted before there was any change in Silvera's condition. Resuscitation efforts initially revived Silvera. A third emergency arose 10 minutes later; Silvera succumbed at 7:32 a.m.\n\nDefendant challenges the testimony of Nurses Cheville, Chetlan, and Race that patient Silvera suffered seizures. Defendant notes that other nurses who were in the ICU at various times that night did not recall such\n\nseizures, and that, with one exception, the nursing notes in Silvera's file did not mention the seizures. He relies on testimony by his experts that Silvera died either from respiratory arrest secondary to severe congestive heart failure and hypoxia (Dr. Salzman), or from hypoxia with various contributing factors (Dr. Singh).\n\nThe trial court could, however, reasonably believe Nurses Cheville, Chetlan, and Race, who credibly testified that Silvera suffered seizures, and could believe prosecution experts who attributed Silvera's death to an overdose of lidocaine. From Silvera's symptoms, prosecution expert Dr. Isaeff concluded that the initial seizures were caused by a dose of more than 1,000 milligrams of lidocaine, and that Silvera was given a second overdose of at least 500 milligrams before the second emergency at 7:15 a.m. and at least another 500 milligrams before the emergency that resulted in his death at 7:32 a.m. Silvera's tissue samples contained quantities of lidocaine that prosecution experts found to be unusually high: before his death, Silvera, in the opinion of toxicologists Peat and Baselt, was given roughly 1,000 milligrams of lidocaine, a potentially lethal overdose. Another prosecution expert, Dr. Modglin, attributed Silvera's death to lidocaine poisoning, \"associated\" with hypertensive heart failure. This testimony is substantial evidence to uphold defendant's conviction for killing Silvera.\n\nDefendant also contends that the evidence did not establish that patient Stewart died from an overdose of lidocaine. Defendant points to testimony by two of his experts (Dr. Benowitz and pharmacokineticist Ambrose) that the lidocaine levels in Stewart's tissues were roughly consistent with the therapeutic amounts administered to her. But that testimony was premised on the assumption, contradicted by the testimony of Nurse Cheville and defendant himself, that Stewart continued to receive lidocaine during the efforts to revive her after the onset of ventricular fibrillation. Furthermore, toxicologist Baselt testified for the prosecution that the lidocaine concentrations found in Stewart's tissues could not be explained by the amount of lidocaine therapeutically given, even if Stewart did continue to receive lidocaine during the attempt to resuscitate her.\n\nThe prosecution's expert witnesses provide substantial evidence supporting defendant's conviction for murdering Stewart. Although, unlike almost all of the other victims, Stewart was not observed to have seizures, prosecution expert Dr. Isaeff noted that Stewart had broad QRS complexes on rhythm strips taken between the onset of ventricular fibrillation and her death, and that some of the strips also demonstrated an unusual phenomenon called \"torsade de pointes,\" an abnormal heart rhythm that, according to Dr. Isaeff, is caused by \"Class 1 antiarrhythmic agents\" such as lidocaine. Dr.\n\nIsaeff concluded that the rhythm strips and Stewart's symptoms were \"consistent with\" a large overdose of lidocaine just before death. Toxicologists Baselt and Peat, who testified for the prosecution, determined from the lidocaine concentrations in Stewart's tissue samples that she had been given 1,000 milligrams of lidocaine just before her death. Based on all of the evidence, Dr. Modglin attributed Stewart's death to lidocaine poisoning, with pulmonary hypertensive heart disease as a contributing condition. This evidence supports the trial court's Conclusion that defendant murdered Stewart by injecting her with an overdose of lidocaine.\n\nh. April 17-19, 1981: Deaths of Henry Castro and Virginia Bayless\n\nWhen defendant and Nurse MacDonald were on night shift duty in the ICU of CHOV on April 17, 1981, the only patient was 66-year-old Henry Castro, who had been admitted earlier that day. Castro complained of dizziness and pain in the chest, neck, and arm; the admitting physician suspected a myocardial infarction. Castro was alert and coherent when the 11:00 p.m. shift began. Within a few hours, however, he became increasingly agitated, experiencing severe chest pains, premature ventricular contractions, and ventricular tachycardia. He was given morphine and lidocaine.\n\nThat same night, respiratory technician Jesus Sinohui received a telephone call from defendant alerting him that an ICU patient was \"having problems\" and might have a seizure. Sinohui immediately went to the ICU. Within a few minutes, Castro suddenly sat up and began having seizures. Emergency treatment proved successful.\n\nTwo nights later, Castro was still a patient in the ICU, but had suffered no additional seizures. That night, another patient was admitted to the ICU, 84-year-old Virginia Bayless, who had suffered a stroke and a possible heart attack and was in a comatose state. When yet another patient, Ethel Shaw, was moved into the unit, Nurse Susan Stroman came from the medical-surgical floor to assist Nurse MacDonald and defendant in the ICU. When Nurse Sandra Phenicie from the medical-surgical floor later told defendant that she needed another nurse, he said that he needed Nurse Stroman in the ICU because he had \"several bad patients\" and he expected some life-threatening situations to occur.\n\nNurse Stroman rendered assistance in the ICU by, among other things, bathing and catheterizing patient Bayless. As Stroman was leaving Bayless's room after performing these tasks, defendant told her to check on patient Castro because he looked \"strange.\" As soon as she entered Castro's room, Castro began having seizures. They were similar to those he had suffered\n\ntwo nights before, and were followed by respiratory and cardiac arrest. While attempts were made to revive Castro, Nurse MacDonald left Castro's room and checked on Bayless; she had no heartbeat. Emergency treatment was unsuccessful, and Bayless died at 1:38 a.m.\n\nPatient Castro, meanwhile, was temporarily resuscitated. He continued to have seizures periodically, necessitating emergency aid throughout the night. During one of these seizures Nurse MacDonald and defendant were the only persons attending Castro. Defendant was giving Castro medication through an IV tube that was on defendant's side of the bed. Defendant then handed MacDonald a lidocaine bolus and asked her to inject half of it into a second IV line that was on her side of the bed. When MacDonald replied that as an LVN, she was not authorized to give injections, defendant replied he would \"cover\" for her. Instead of injecting the lidocaine into the IV line on her side, however, MacDonald emptied half of the lidocaine-filled syringe onto the bed, and then placed the syringe to one side. Castro eventually died at 4:53 a.m.\n\nAt 7:00 a.m., defendant asked Nurse Stroman to check on patient Shaw because she looked \"strange.\" Stroman, still shaken from the deaths of patients Castro and Bayless, refused to do so. After discussing Shaw's condition with a respiratory therapist, defendant went into Shaw's room. Shortly after defendant left her room, Shaw started screaming and having seizures. Resuscitative efforts were temporarily successful, but Shaw died the following night.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThere was additional evidence suggesting that defendant had given Castro an overdose of lidocaine. Several months after Castro's death, a construction worker named Neble found, in a bed in the then-closed ICU, a bolus bearing Nurse MacDonald's fingerprint. When tested, the Neble bolus contained a 23-percent concentration of lidocaine, which was far higher than the strength listed on the label. In addition, on the night of Castro's death, Nurse Stroman saw defendant, after injecting medication into Castro, discard the used syringe in a wastebasket; this was contrary to CHOV's normal procedure, which required nurses to cut the needles from the syringes and place them in a specially designated container for disposal.\n\nDefendant contends the evidence was insufficient to show that he killed either patient Bayless or patient Castro. We disagree.\n\nPatient Bayless was unique among the patients defendant was convicted of murdering in that there was no evidence either that she suffered seizure activity or that her rhythm strips showed a broad QRS complex. But Bayless was also unique in another respect: it appears that she was never given any lidocaine for therapeutic purposes while in the hospital. The treating physician and nurses did not recall giving Bayless lidocaine, and her medical chart did not indicate that lidocaine had been administered. Nevertheless, a blood sample from Bayless several days after her death showed very large quantities of lidocaine.\n\nIn an effort to show that Bayless was indeed given therapeutic doses of lidocaine and that this might explain the lidocaine levels in her blood, defendant minimizes the absence of any reference to the administration of lidocaine as \"more likely a flaw in the chart than a reflection of fact.\" He points out that the notes of one of the treating physicians had been removed from Bayless's file, and relies on a statement made by Nurse MacDonald before trial, admitted as a prior inconsistent statement, that she \"believe[d]\" Bayless had a lidocaine drip attached to her when she was transferred to the ICU from the emergency room. Defendant also cites his own testimony to the same effect. In addition, defendant draws attention to evidence he presented at trial that, although the medical chart of another patient who was treated in the emergency room on April 6, 1981, did not show the administration of any lidocaine, subsequent toxicological tests of the patient revealed the presence of lidocaine in the patient's body. Thus, defendant argues it is likely that Bayless was given a therapeutic dosage of lidocaine in the emergency room but that this was not recorded on her chart.\n\nThe trial court, however, was not required to accept the defense's speculation that Bayless might have been prescribed lidocaine in the emergency room. The quantities of lidocaine in her blood were so high that even Dr. Benowitz, who testified for the defense, agreed that Bayless received a \"massive\" dose of lidocaine, an amount that would kill her in minutes. Dr. Benowitz also conceded that the absence of seizures could be explained by Bayless's being in a coma from her arrival at CHOV until her death. Prosecution experts concluded, based on the lidocaine level in Bayless's blood, that Bayless had been given more than 1,000 milligrams of lidocaine just before her death, and that this overdose led to her demise. Their testimony provides substantial evidence supporting the trial court's Conclusion that defendant murdered patient Bayless.\n\nDefendant asserts that patient Castro's seizures could have been caused by hypoxia due to low blood pressure or by alcohol withdrawal, as\n\nsuggested by his expert, Dr. Singh, or could have been caused by the combination of morphine and Compazine that was given to Castro, as suggested by Dr. Salzman, another defense expert. Defendant also relies on the testimony of defense experts Dr. Benowitz and pharmacokineticist Ambrose that the lidocaine level found in Castro's tissues was generally consistent with therapeutic amounts administered to him.\n\nProsecution experts, however, rejected the Conclusions of the experts for the defense. Prosecution expert Dr. Jutzy testified that rhythm strips in Castro's medical file showed a prolonged QRS complex. In Dr. Jutzy's opinion, the initial seizures were caused by an overdose of perhaps 500 milligrams of lidocaine, and subsequent seizures were caused by one or more subsequent overdoses of more than 1,000 milligrams. Based on their analysis of samples of Castro's tissue samples, prosecution experts (toxicologists Baselt, Poklis, and Peat) believed Castro received more than 1,000 milligrams of lidocaine shortly before his death. Based on the toxicological evidence and Castro's symptoms, Dr. Modglin attributed Castro's death to lidocaine poisoning. The testimony of the prosecution's experts is substantial evidence supporting the trial court's Conclusion that defendant murdered Castro.\n\nDefendant contends that the circumstances surrounding the Neble bolus are so bizarre that it is worthless as evidence of guilt. He argues that it would have been very difficult for him to have \"planted\" the bolus in the bed where it was found, because the ICU was guarded by a security force after it was closed, and he was arrested soon afterward. Defendant suggests that the bolus could have been planted by Dr. Babeira, a supervisory physician at CHOV, and the attending physician for many of the victims in this case, who, defendant claims, has \"dropped out of sight.\" But even without the Neble bolus, there was substantial evidence, described above, to support the trial court's finding that Castro died from a lidocaine overdose administered by defendant.\n\ni. April 22, 1981: Death of Bertha Boyce\n\nOn April 22, 1981, when defendant and Nurse Wingo were on night duty in the ICU at CHOV, 75-year-old Bertha Boyce was a patient. Boyce was suffering from congestive heart failure, as well as respiratory distress caused by chronic pulmonary disease.\n\nAt the start of the 11:00 p.m. shift, defendant suggested to Nurse Wingo that they take their lunch breaks early, because he felt \"something was going to go wrong\"; he asked Wingo which patient she thought would \"go\" first.\n\nAt 2:00 a.m., shortly after Wingo returned from her lunch break, a patient by the name of Feitner had a seizure, followed by an extremely slow heartbeat and by respiratory arrest. Wingo, who had observed seizures in epileptics but never in cardiac patients, described Feitner's seizure as the worst she had ever seen: a total-body, grand mal seizure. Emergency treatment resuscitated Feitner.\n\nAbout 3:00 a.m., defendant telephoned patient Boyce's physician, Praphavadee Dharmapanij, to explain that Boyce's heart monitor had shown some PVC's (premature ventricular contractions); defendant asked for, and received, authorization to give Boyce some lidocaine. When Dr. Dharmapanij later called the hospital to find out her patient's condition, defendant said that Boyce was not responding well. Dr. Dharmapanij arrived at the hospital around 4:00 a.m. At that time, Boyce's heart rate seemed normal; she was drowsy but conscious. Dr. Dharmapanij left the room for five or ten minutes. When she returned, Boyce was not breathing, and 20 seconds later she had a seizure. Dr. Dharmapanij likened the seizure to an epileptic's grand mal seizure. Boyce died three hours later.\n\nEvidence discovered after Boyce's death linked defendant with the killing. Two syringes--one almost empty, the other half full--were deposited in a box designed for their collection as part of CHOV's investigation into the deaths that were occurring in the ICU. According to their labels, one should have contained a 1 percent concentration of lidocaine, and the other a 2 percent concentration. Instead, each contained lidocaine in a strength slightly greater than 20 percent. Each syringe was labeled \"Boyce, Bertha, 4/22/81\" in handwriting that defendant identified as his.\n\nDefendant points out that prosecution experts relied almost exclusively on Boyce's tissue and blood samples to support their Conclusion that she died from lidocaine poisoning. He claims that Dr. Benowitz, who testified for the defense, refuted that Conclusion when he testified that the quantity of lidocaine found in Boyce's blood was consistent with the therapeutic dosage administered to her. He argues that Boyce probably died from respiratory insufficiency (as suggested by defense experts Drs. Salzman, Singh, and Benowitz), which may have been caused by an overdose of aminophylline (as suggested by defense expert Dr. Salzman).\n\nAlthough Dr. Benowitz was of the opinion that the lidocaine concentration found in Boyce's blood could be explained by the therapeutic doses, he was unable to explain the higher quantities found in Boyce's lungs. Prosecution expert Dr. Isaeff reviewed Boyce's medical records and found that rhythm strips taken at 5:30 a.m. showed a prolonged QRS complex. Based on tests\n\nof Boyce's blood and tissues, prosecution experts concluded that she had been given a large overdose of lidocaine. In the opinion of prosecution expert Dr. Modglin, Boyce died from lidocaine intoxication, in \"association\" with arteriosclerotic heart disease. Defendant's conviction for murdering Boyce is thus supported by substantial evidence.\n\nj. April 25, 1981: Death of Clifford Swanson\n\nOn April 25, 1981, one day after the April 24 closure of the ICU at CHOV, defendant was working as a nurse at San Gorgonio Pass Hospital, where he was assigned to the night shift in the ICU. One of the patients was Clifford Swanson, age seventy-nine. Swanson had been admitted to the hospital four days earlier for a back injury; on April 23, when he became confused and disoriented as a result of serious diabetes problems, he was transferred to the ICU.\n\nAt 5:00 a.m. on April 26, 1981, when Swanson started having abnormal heart beats, the ICU's supervising nurse, Antoinette Warburton, gave Swanson 50 milligrams of lidocaine. An hour later, defendant administered an additional 75 milligrams of lidocaine. At 6:30 a.m., Warburton went to the nurse's lounge to take a 15-minute break. Upon her return to the ICU, she saw defendant standing next to Swanson's bed. Then, carrying a syringe, defendant went back to the nurse's desk, sat down, and began to write. At that point, Swanson began to have seizures. Although the seizures were not violent, Swanson's body was rigid, his jaw was clenched, and his arms were twitching. A few minutes later, he suffered cardiac and respiratory arrest, and died.\n\nDefendant points out that Swanson suffered from low blood sugar caused by his severe diabetes, and also hypoxia (oxygen deficiency) resulting from the congestion of his lungs, and that Dr. Modglin conceded that both of these conditions can cause seizures. He contends that Swanson died from a combination of low blood sugar and excessive potassium administered by hospital personnel after the seizures began, as testified to by Dr. Singh on behalf of the defense.\n\nThe trial court, however, was not obligated to accept the Conclusions of the defense experts. Prosecution expert Dr. Jutzy testified that Swanson's rhythm strips showed broadening QRS complexes from 5:32 a.m. onward. In Dr. Jutzy's opinion, Swanson's \"clinical picture\" could have been caused by an overdose of 1,000 milligrams or more of lidocaine. Samples of Swanson's tissues showed substantial quantities of lidocaine, leading the prosecution's toxicologists to conclude that he had been given a large overdose of the\n\ndrug. Prosecution expert Dr. Modglin testified that Swanson's death resulted from lidocaine poisoning, with diabetes and arteriosclerotic heart disease as contributing factors. The testimony of the prosecution experts provided substantial evidence to support the trial court's Conclusion that Swanson died from an overdose of lidocaine.\n\nRelying on ambiguous notes in Swanson's chart, defendant claims that an emergency room physician was present at Swanson's bedside before the seizures began, and that if defendant had attempted to administer a fatal dose of lidocaine the doctor would have noticed him. The trial court, however, could reasonably credit the testimony of Nurses Morford and Warburton, who testified that defendant, not an emergency room doctor, was standing next to Swanson shortly before the seizures began.\n\nk. Summary\n\nFor the reasons described above in our detailed review of the evidence, substantial evidence supports the finding of the trial court, which was sitting as the trier of fact, that an overdose of lidocaine caused the death of each of the 12 patients, and that in each case defendant administered the fatal dose.\n\nE. Notice of Prosecution's Reliance on Theory of Murder by Poison\n\nIn closing argument, the prosecutor argued that the trial court could find defendant guilty of first degree murder if it concluded that the murders were accomplished by the use of poison.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The information did not explicitly accuse defendant of murder by poison; it alleged that he \"did wilfully, unlawfully and with malice aforethought\" murder each victim. Defendant argues that the prosecution's failure to expressly inform him that it was relying on a theory of murder by poison deprived him of adequate notice of the charges against him, and therefore violated his right \"to be informed of the nature and cause of the accusation\" against him. (U.S. Const., 6th Amend.) This challenge by defendant pertains only to the prosecutor's statements in closing argument. Because defense counsel failed to object at trial to these statements, the issue may not be raised on appeal. (People v. Toro (1989) 47 Cal. 3d 966, 975- 976 [254 Cal. Rptr. 811, 766 P.2d 577]; see People v. Green (1980) 27 Cal. 3d 1, 34 [164 Cal. Rptr. 1, 609 P.2d 468].)\n\nEven if the issue were properly before us, defense counsel's decision not to object was appropriate. We have long held that under this state's statutory scheme, an accusatory pleading charging a defendant with murder need not specify the theory of murder on which the prosecution intends to rely. (People v. Gallego (1990) 52 Cal. 3d 115, 188 [276 Cal. Rptr. 679, 802 P.2d 169]; People v. Thomas (1987) 43 Cal. 3d 818, 829, fn. 5 [239 Cal. Rptr. 307, 740 P.2d 419]; People v. Murtishaw (1981) 29 Cal. 3d 733, 751, fn. 11 [175 Cal. Rptr. 738, 631 P.2d 446]; In re Walker (1974) 10 Cal. 3d 764, 781 [112 Cal. Rptr. 177, 518 P.2d 1129].) Although we have recognized that there are situations in which the United States Constitution may require greater specificity (Gallego, supra, at p. 189; Murtishaw, supra, at p. 751, fn. 11), generally the accused will receive adequate notice of the prosecution's theory of the case from the testimony presented at the preliminary hearing or at the indictment proceedings. (Thomas, supra, at p. 829.) Here, the testimony presented at the preliminary hearing put the defense on notice that the prosecution intended to show that defendant killed his victims by deliberately injecting them with overdoses of lidocaine. This testimony \"adequately inform[ed] the defendant of the prosecution's theory regarding the manner and degree of killing\" ( at p. 829, fn. 5), and thus complied with the notice requirements of the federal Constitution.\n\nF. Ineffective Assistance of Counsel\n\nDefendant complains that he received ineffective assistance of counsel at trial. To prevail, defendant must first show that \" 'counsel's representation fell below an objective standard of reasonableness ... under prevailing professional norms.' \" (People v. Ledesma (1987) 43 Cal. 3d 171, 216 [233 Cal. Rptr. 404, 729 P.2d 839], quoting Strickland v. Washington (1984) 466 U.S. 668, 688 [80 L.Ed.2d 674, 693-694, 104 S.Ct. 2052].) Second, defendant must show that the inadequacy was prejudicial, that is, \" 'there is a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome.' \" (People v. Ledesma, supra, at pp. 217-218, quoting Strickland v. Washington, supra, at p. 694 [80 L.Ed.2d at pp. 697-698].)\n\nIf \"counsel's omissions resulted from an informed tactical choice within the range of reasonable competence, the conviction must be affirmed.\" (People v. Pope (1979) 23 Cal. 3d 412, 425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1].) When, however, the record sheds no light on why counsel acted or failed to act in the manner challenged, the reviewing court should not speculate as to counsel's reasons. To engage in such speculations would involve the reviewing court \" 'in the perilous process of second-guessing.' \" ( at p. 426.) Because the appellate record ordinarily does not\n\nshow the reasons for defense counsel's actions or omissions, a claim of ineffective assistance of counsel should generally be made in a petition for writ of habeas corpus, rather than on appeal. ( at p. 426 and fn. 16.)\n\nDefendant accuses counsel of rendering inadequate assistance in several respects. As we shall explain, the record does not support defendant's contentions.\n\n1. Jury Trial Waiver\n\nDefendant characterizes as incompetence his counsel's advice that he waive right to a trial by jury. Defendant claims that his chief trial counsel, who headed the Riverside County Public Defender's office, had a \"conflict of interest\" because the burdens of his administrative duties at the public defender's office and his representation of defendant posed conflicting demands on the use of his time. These conflicting demands, according to defendant, could more easily be reconciled if defendant waived a jury, for the obvious reason that a court trial would take less time than a jury trial. Defendant contends that this \"conflict\" led counsel to recommend to defendant that he waive his right to a trial by jury.\n\nThe record before us, however, does not disclose why the defense decided to have the case tried by the court sitting without a jury. Perhaps defendant himself preferred not to have a jury, and counsel simply acceded to his client's wishes. Or, counsel may have had legitimate tactical reasons to suggest that defendant waive his right to a jury. Thus, counsel may have believed that the particular Judge to whom the case was assigned would be sympathetic to defendant: at the time defendant waived his right to jury trial, both defense counsel and defendant stated that the waiver was conditioned on having that Judge conduct the trial. Also, counsel may have believed that a jury would be less receptive than a Judge to the expert testimony that the defense intended to present in this complex, 12-count murder case. We can only speculate as to the reasons underlying defense counsel's decision to have his client waive the right to a trial by jury.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nWhen, as here, counsel's reasons are not apparent from the record, we will not assume inadequacy of representation unless counsel had no conceivable legitimate tactical purpose. (See People v. Pope, supra, 23 Cal. 3d at p. 425.) The defense's decision to have this case tried by a court sitting without a jury may have been based on the legitimate tactical grounds described above.\n\nDefendant contends that counsel should have advised defendant to defer the decision whether to waive a jury for the penalty phase of trial until\n\nafter the guilt phase. He argues that because the waiver of his right to a jury trial in the penalty phase occurred before the guilt phase, it is obvious that the waiver was designed to accommodate counsel's pressing time demands.\n\nBut if the defense had attempted to waive a jury for the guilt phase of the trial without also waiving a jury trial as to the penalty phase, it is highly unlikely that the prosecution would have agreed to the waiver. Acquiescence to such a procedure would have required the prosecution to recall as witnesses at the penalty phase most of the witnesses who had testified at the guilt phase, in order to explain to the penalty jury the circumstances surrounding the offenses. Rather than accept a procedure requiring it to call all its witnesses twice, the prosecution would probably have invoked its own right to a jury trial at the guilt phase, thus frustrating the desire of the defense to have the issue of guilt determined by the trial Judge. Thus, the jury waiver pertaining to the penalty phase was inextricably linked with the jury waiver pertaining to the guilt phase. The fact that the waiver occurred before the guilt phase began does not demonstrate inadequacy.\n\n2. Defense Counsel's Failure to Object to the Introduction of the Neble and Boyce Boluses\n\nDefendant contends counsel was inadequate for not objecting to the admission into evidence of the Neble and Boyce boluses (preloaded syringes). He argues that the prosecution failed to establish an unbroken chain of custody from the time the boluses were seized as evidence to the time they were introduced as evidence at trial.\n\nPeople v. Riser (1956) 47 Cal. 2d 566 [305 P.2d 1] sets forth the rules for establishing chain of custody: \"The burden on the party offering the evidence is to show to the satisfaction of the trial court that, taking all the circumstances into account including the ease or difficulty with which the particular evidence could have been altered, it is reasonably certain that there was no alteration. [P] The requirement of reasonable certainty is not met when some vital link in the chain of possession is not accounted for, because then it is as likely as not that the evidence analyzed was not the evidence originally received. Left to such speculation the court must exclude the evidence. [Citations.] Conversely, when it is the barest speculation that there was tampering, it is proper to admit the evidence and let what doubt remains go to its weight.\" ( at pp. 580- 581; see also People v. Williams (1989) 48 Cal. 3d 1112, 1134 [259 Cal. Rptr. 473, 774 P.2d 146].)\n\nAssuming for the sake of argument that the prosecution failed to establish the chain of custody for the Neble and Boyce boluses, we cannot\n\nconclude from the record before us that defense counsel was incompetent for failing to object to their introduction. Had counsel objected, the prosecution might well have been able to supply the links missing from the custody chain, so that the objection would not benefit defendant because the evidence would remain admissible. Defense counsel's realization of this may explain his decision not to register an objection that would slow down an already lengthy trial. Indeed, it is not uncommon or improper for counsel, in both civil and criminal trials, to avoid unnecessary delay by stipulating to the chain of custody.\n\nDefendant also contends that the defense should have sought sanctions for the prosecution's negligent handling of the Neble bolus. At the time of trial, such a motion would have been governed by the rule established in People v. Hitch (1974) 12 Cal. 3d 641 [117 Cal. Rptr. 9, 527 P.2d 361].\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Under Hitch, the defense was entitled to sanctions if evidence potentially favorable to the defense was lost or destroyed by investigative officials, and the government did not in good faith \"adhere to rigorous and systematic procedures\" designed to preserve the evidence. ( at pp. 652-653.) Here, although the Neble bolus was dropped and broken while in police custody, the record does not show that any evidence was lost or destroyed, let alone that the government's procedures for preserving evidence were improper. Thus, the record does not show that counsel rendered ineffective assistance in not asking for sanctions.\n\n3. Evidence Regarding Estel Jones\n\nDefendant faults his counsel for not objecting to the introduction of evidence regarding the death of Estel Jones, whose death occurred in the intensive care unit of Chino Community Hospital, where defendant was employed as a nurse before coming to CHOV.\n\nJones, age 62, was admitted to Chino Community Hospital after suffering a possible myocardial infarction on the morning of March 22, 1981, a week before defendant changed jobs and moved to CHOV. At the time, Jones also had congestive heart failure, chronic obstructive pulmonary disease, and severe coronary arteriosclerosis. Jones was placed in the ICU and given a lidocaine drip that was maintained for 48 hours.\n\nOn March 24, defendant and Nurse Rita Driver were on duty during the night shift. At the start of the shift, at 11:00 p.m., defendant predicted they\n\n\"would be having trouble\" with Jones that night. They were looking at the heart monitor when defendant spoke; to Driver, Jones's heart rhythm appeared normal. Later that night, Jones developed chest pains, and defendant told Driver he was going to administer some medication to ease the pain. Driver later spoke to Jones, who said the pain had eased; Jones was awake and alert.\n\nLater that night, Jones's blood pressure became unstable. Nurse Driver prepared a dopamine solution to give to Jones if his blood pressure continued to fluctuate. Driver then checked on other patients for about five minutes, leaving defendant in Jones's room. When Driver returned, she proceeded to take Jones's blood pressure. Immediately, Jones began having seizures, which Nurse Driver likened to an epileptic's grand mal seizures: Jones's body was rigid and stiff and jerking severely. Shortly thereafter, Jones developed cardiac and respiratory problems. Emergency treatment, in the course of which doctors gave Jones two 75-milligram doses of lidocaine, failed to revive him.\n\nProsecution witnesses testified that tissue samples taken from Jones's corpse showed a lidocaine level indicative of a massive overdose. In addition, EKG rhythm strips showed a broad QRS complex at the time of the seizures. Based on the tissue samples, the rhythm strips, and the seizures, prosecution experts attributed Jones's death to lidocaine toxicity, listing his preexisting medical problems as contributing factors.\n\nDefendant was not charged with killing Jones, but the prosecution, without objection, presented at the trial in this case the foregoing evidence of the circumstances surrounding the death of Jones at Chino Community Hospital. Defendant argues this was inadmissible character evidence that would have been excluded upon proper objection. He contends that his attorney's failure to object denied him the right to effective assistance of counsel.\n\nEvidence Code section 1101, subdivision (a) establishes a general rule that, subject to various exceptions, character evidence is inadmissible to prove a party's conduct on a specific occasion. One of the exceptions, set forth in Evidence Code section 1101, subdivision (b), permits the admission of evidence that a person committed specific acts of conduct \"when relevant to prove some fact (such as motive, opportunity, intent, preparation, plan, knowledge, identity ...) other than his or her Disposition to commit such an act.\" Here, the facts relating to Jones's death were admissible as evidence tending to show defendant's identity as the killer of the other 12 victims. As may be recalled, defendant denied giving any of the victims an overdose of lidocaine; the theory of the defense was that all of the victims had died as the\n\nresult of either natural causes or the negligence of hospital personnel. The evidence that Jones died from an overdose of lidocaine while attended by defendant at a different hospital from the two at which he was accused of killing patients served both to establish defendant's identity as the person who administered the lidocaine, and to refute the suggestion that the deaths of the eleven patients at CHOV and the patient at San Gorgonio Pass Hospital were caused by negligence.\n\nWe recently described the circumstances in which the prosecution may use evidence of uncharged criminal activity to identify the defendant as the perpetrator of a charged offense: \"Other-crimes evidence is admissible to prove the defendant's identity as the perpetrator of another alleged offense on the basis of similarity 'when the marks common to the charged and uncharged offenses, considered singly or in combination, logically operate to set the charged and uncharged offenses apart from other crimes of the same general variety and, in so doing, tend to suggest that the perpetrator of the uncharged offenses was the perpetrator of the charged offenses.' (People v. Haston (1968) 69 Cal. 2d 233, 246 [70 Cal. Rptr. 419, 444 P.2d 91].)\" (People v. Walker (1988) 47 Cal. 3d 605, 622 [253 Cal. Rptr. 863, 765 P.2d 70].) Here, the similarity between the charged and uncharged offenses is overwhelming. Each took place in the ICU of a hospital. More important, each victim was killed by administration of a massive overdose of lidocaine. This shared characteristic of the death of Jones at Chino Community Hospital and the deaths at CHOV and San Gorgonio Pass Hospital is highly distinctive. The murder of patients in ICU's by injecting them with large quantities of lidocaine is unprecedented.\n\nThus, the evidence of the circumstances surrounding the death of Jones was admissible to show a modus operandi by defendant of killing hospital patients by injecting them with lidocaine overdoses. Because any objection to the admission of the evidence pertaining to Jones's death would have been futile, defense counsel did not render ineffective assistance when he did not object to this evidence.\n\n4. Challenge to Scope of Search Warrant\n\nAs previously mentioned (ante, p. 518), defense counsel moved to suppress the evidence seized at defendant's home on several theories. Defendant faults counsel for presenting no evidence in support of one of those theories: that while the search warrant authorized the police to search for notes, memoranda, rhythm strips, and other documents, the officers used\n\nthe affidavit as a pretext to conduct an unauthorized general search for incriminatory items not listed in the warrant. Defendant points out that in a related case in San Bernardino County evidence supporting this ground was introduced by a different attorney representing defendant. At defendant's request, we take judicial notice of that case, People v. Diaz (Super. Ct. San Bernardino County, 1981, No. FCH 1813; hereafter No. FCH 1813). (Evid. Code, § 452, subd. (d).)\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe record in that case reveals that the police conducted a thorough search of defendant's house and seized a number of items not described in the search warrant. This does not mean, however, that the search of the house was illegal. The officers looked in places where they might expect to find the documents listed in the search warrant in the event defendant had attempted to hide them or throw them away; those places included trash receptacles and a bedroom closet in which the officers found the lidocaine that was used as evidence against defendant.\n\nWhen the searching officers found lidocaine while looking for the items listed in the warrant, they were entitled to seize it. \"When officers, in the course of a bona fide effort to execute a valid search warrant, discover articles which, although not included in the warrant, are reasonably identifiable as contraband, they may seize them whether they are initially in plain sight or come into plain sight subsequently, as the result of the officers' efforts.\" (Skelton v. Superior Court (1969) 1 Cal. 3d 144, 157 [81 Cal. Rptr. 613, 460 P.2d 485].) In this case, trial counsel could reasonably have concluded that an attack on the scope of the search would not be successful, and therefore could have decided to focus the defense's efforts on the theory that was actually successful in case No. FCH 1813: the argument that the warrant affidavit contained intentionally or recklessly false statements. Because there is thus a valid possible explanation for counsel's conduct, defendant has failed to establish ineffective assistance of counsel. (See People v. Ramirez (1990) 50 Cal. 3d 1158, 1189 [270 Cal. Rptr. 286, 791 P.2d 965].)\n\n5. Other Claimed Inadequacies\n\nDefendant cursorily recounts, without citation of authority or reference to the record, six other \"examples\" of counsel's ineffectiveness.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e No prejudicial inadequacy is demonstrated by the six \"examples,\" whether they are considered individually or collectively.\n\nIII. SPECIAL CIRCUMSTANCE ISSUES\n\nA. Jury Trial Waiver\n\nBefore trial, defendant personally waived his right to have his case heard by a jury. The trial court informed him: \"[Y]ou'll be giving up that right to have the jury in two different functions. First of all, first function is to decide the question of your guilt or innocence. Then the second function, similarly, assuming there are 12 of them and they would unanimously agree that you were guilty, then you would have 12 jurors who must unanimously agree as to the punishment. [P] They have a choice, life without possibility of parole or death. ... And you'll be giving up that right.\" Defendant answered, \"I'm giving it up.\" The court asked defendant if he understood that the waiver applied to \"both phases ... of the special circumstances case.\" Defendant assented.\n\nDefendant, relying on People v. Memro (1985) 38 Cal. 3d 658 [214 Cal. Rptr. 832, 700 P.2d 446], asserts that the trial court did not explicitly advise him that he had a right to a jury trial to determine the truth or falsity of the special circumstance allegations, and that he never explicitly waived this right. He contends that the failure to obtain such a waiver requires reversal of the special circumstance findings and the ensuing judgment of death. We disagree.\n\nIn People v. Memro, supra, 38 Cal. 3d 658, the defendant, who was charged with capital murder, waived his right to a jury trial at the guilt phase of his trial. At the Conclusion of the guilt phase, counsel stipulated that the trial court could determine the truth or falsity of the alleged special circumstance, based on the evidence that had been presented. Although we reversed\n\nMemro's conviction on other grounds, we addressed the propriety of the stipulation, finding it impermissible under section 190.4, subdivision (a).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e We held: \"[A]n accused whose special circumstance allegations are to be tried by a court must make a separate, personal waiver of the right to jury trial.\" (People v. Memro, supra, 38 Cal. 3d at p. 704.)\n\nUnder Memro, supra, 38 Cal. 3d 658, then, a waiver of a defendant's right to have a jury determine the truth or falsity of alleged special circumstances may not be accomplished by counsel's stipulation. The waiver must be made by the defendant personally, and must be \"separate\"--that is, if the defendant is to be deemed to have waived the right to jury trial on both guilt and special circumstances, the record must show that the defendant is aware that the waiver applies to each of these aspects of trial.\n\nIn this case, the trial court explained to defendant that the waiver of his right to trial by jury applied to all aspects of his special circumstances case, from beginning to end. Defendant also told the court that he had discussed the matter \"quite thoroughly\" with his counsel. Although the trial court's admonition was not a model of clarity, we believe it was sufficient to advise defendant that his waiver, which included all aspects of guilt and penalty, included within it a waiver of the right to jury trial on the truth or falsity of the special circumstance allegation.\n\nB. Duplicative Multiple-murder Special Circumstances\n\nThe prosecution charged defendant with 12 multiple-murder special circumstances, and the trial court found all of them to be true. Defendant argues that 11 of them should be stricken as duplicative. He is right. When a defendant kills more than one person, the prosecution should allege only one multiple-murder special circumstance; to charge more than one such special circumstance would improperly inflate the seriousness of the defendant's conduct. (People v. Harris (1984) 36 Cal. 3d 36, 67 [201 Cal. Rptr. 782, 679 P.2d 433] (plur. opn.).) Accordingly, 11 of the special circumstances found to be true in this case must be set aside. (People v. Jones (1991) 53 Cal. 3d 1115, 1148-1149 [282 Cal. Rptr. 465, 811 P.2d 757]; People v. Gallego, supra, 52 Cal. 3d 115, 201; People v. Caro (1988) 46 Cal. 3d 1035, 1051 [251 Cal. Rptr. 757, 761 P.2d 680].)\n\nIV. PENALTY ISSUES\n\nA. Failure to Present Mitigating Evidence\n\nAt the penalty phase of the trial, the parties stipulated that defendant was born on March 23, 1938. The defense presented no other evidence. Defendant argues that his counsel's failure to present any mitigating evidence at the penalty phase produced a constitutionally unreliable result, which did not satisfy the state's interest in a fair and balanced judgment, and that the failure to present any mitigating evidence denied him the effective assistance of counsel. He relies primarily on People v. Deere (1985) 41 Cal. 3d 353 [222 Cal. Rptr. 13, 710 P.2d 925] (Deere I). There, we held that the defendant was denied the adequate assistance of counsel because counsel, in deference to the defendant's wishes, presented no mitigating evidence at the penalty phase of the defendant's capital trial.\n\nDefendant's reliance on Deere I is unfounded. In People v. Bloom (1989) 48 Cal. 3d 1194 [259 Cal. Rptr. 669, 774 P.2d 698], we held that a verdict is constitutionally reliable \"when the prosecution has discharged its burden of proof at the guilt and penalty phases pursuant to the rules of evidence and within the guidelines of a constitutional death penalty statute, the death verdict has been returned under proper instructions and procedures, and the trier of penalty has duly considered the relevant mitigating evidence, if any, which the defendant has chosen to present.\" ( at p. 1228.) We disapproved Deere I to the extent that case \"suggests that failure to present mitigating evidence in and of itself is sufficient to make a death judgment unreliable.\" ( at p. 1228, fn. 9; see also People v. Lang (1989) 49 Cal. 3d 991, 1030 [264 Cal. Rptr. 386, 782 P.2d 627]; People v. Deere (1991) 53 Cal. 3d 705, 717 [280 Cal. Rptr. 424, 808 P.2d 1181].)\n\nDefendant argues that People v. Bloom, supra, 48 Cal. 3d 1194, and People v. Lang, supra, 49 Cal. 3d 991 are distinguishable. He points out that in those cases the defendant said he did not want counsel to present the mitigating evidence at issue. Here, by contrast, the record contains no such statement by defendant. The reasoning of Bloom and Lang is, however, not limited to situations in which the defendant makes an on- the-record objection to the presentation of mitigating evidence. Here, defendant may have told his counsel in private that he wanted no mitigating evidence presented. Alternatively, counsel may have had legitimate tactical reasons for failing to present such evidence. On a silent record, as we have here, we will not assume that the defense counsel's failure to present mitigating evidence rendered his assistance ineffective. Any assertion that counsel was inadequate in this regard must be raised on habeas corpus. (People v. Pope, supra, 23 Cal. 3d at p. 426.)\n\nB. Weighing Aggravating and Mitigating Circumstances\n\nIn People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440], we held that former CALJIC No. 8.84.2, which instructs the jury that if it finds that aggravating circumstances outweigh those in mitigation it \"shall\" impose the death penalty, was potentially misleading, because it might confuse the jury regarding the nature of the weighing process. We stated that we would examine each case on its own merits to determine whether the jury might have been misled as to the scope of its sentencing discretion. ( at p. 544, fn. 17.)\n\nBecause this case was tried before a court, not a jury, there were no jury instructions. Nevertheless, defendant argues, by analogy to People v. Brown, supra, 40 Cal. 3d 512, that the trial court may have been confused as to the scope of its sentencing discretion at the penalty phase of trial. Defendant notes that section 190.3, which explains the manner in which the trier of fact determines the appropriate penalty in a capital case, says that if aggravating circumstances outweigh those in mitigation, the trier of fact \"shall\" impose the death penalty; that language is essentially identical to the words of former CALJIC No. 8.84.2 that we found to be ambiguous in People v. Brown, supra. Therefore, defendant asserts, the trial court may have misconstrued section 190.3 and misunderstood the scope of its sentencing discretion at the penalty phase of the trial.\n\nAs a general rule, we presume that the trial court has properly followed established law. (Evid. Code, § 664; Ross v. Superior Court (1977) 19 Cal. 3d 899, 913 [141 Cal. Rptr. 133, 569 P.2d 727].) This presumption, however, does not apply \"where the law in question was unclear or uncertain when the lower court acted.\" (People v. Jeffers (1987) 43 Cal. 3d 984, 1000 [239 Cal. Rptr. 886, 741 P.2d 1127].) Here, the trial court itself recognized that the law regarding the proper construction of section 190.3 was uncertain at the time this case was tried.\n\nThe trial court's comments in the course of oral argument indicate that it understood its role as trier of penalty. The court correctly stated it did not agree with the prosecutor's argument that circumstances in aggravation could be derived from the absence of evidence of certain mitigating circumstances. The court then explained its understanding of section 190.3's use of the word \"shall\": \"The problem of 'may' or 'shall,' the last sentence of 190.3 is a problem of continuing interpretation in our state. [P] Easley [ People v. Easley (1983) 34 Cal. 3d 858 (196 Cal. Rptr. 309, 671 P.2d 813)], the most recent [case] I found on it, does not necessarily resolve that point. [P] I concur that it is not a mathematical point type of approach. However, the\n\nopposite of that is that I am a constitutional Judge. I have taken an oath to follow the law. As far as I am concerned with the provisions of the special circumstance in the state of California are constitutional, I will follow the law. [P] In other words, I will not arrive at a decision as a matter based upon a fact that I think the death penalty is unconstitutional or that I am philosophically against the death penalty. My evaluation will be of the factors in 190.3 that are brought forward in this argument. And I will weigh them, and I will arrive at a Conclusion, but not on some mathematical point system.\"\n\nThe court's comments accurately reflected the requirements of section 190.3. As the court observed, the weighing of the circumstances in aggravation and mitigation \"is not a mathematical ... type of approach\"; each factor is to be given the importance to which the trier of fact believes it is entitled. The court was also correct in concluding that the question whether it was \"philosophically against the death penalty\" should play no role in the penalty determination. The trier of fact's function is to determine, after weighing the aggravating and mitigating factors, the appropriate penalty under the facts of the particular case. (People v. Brown, supra, 40 Cal. 3d at p. 541; People v. Allen (1986) 42 Cal. 3d 1222, 1277 [232 Cal. Rptr. 849, 729 P.2d 115].) Here, it is clear from the trial court's comments that it properly understood this to be its role.\n\nDefendant accuses the prosecutor of misstating the law when, in his closing statement, he asserted that because the aggravating circumstances outweighed the mitigating circumstances, defendant \"must\" be sentenced to death. Defendant argues that the trial court should have corrected the prosecutor, and that the court's failure to do so underscores its misunderstanding of the nature of its duties. Even if we were to conclude that the prosecutor's comment was an erroneous statement of the law, the trial court was under no duty to correct the prosecutor; thus, the court's failure to do so does not demonstrate that it misunderstood its sentencing duties.\n\nC. Intent to Kill\n\nAs mentioned earlier (ante, p. 556), in closing argument at the guilt phase the prosecution argued that defendant should be convicted of first degree murder as to each victim because the killings were by poison. A defendant acting with implied malice who kills his or her victim with poison is guilty of first degree murder even if the defendant lacks the intent to kill. (People v. Mattison (1971) 4 Cal. 3d 177, 183 [93 Cal. Rptr. 185, 481 P.2d 193].) The trial court in this case may therefore have found defendant guilty and imposed the death penalty without finding that he intended to kill his victims.\n\nDefendant argues that the imposition of the death penalty upon one who lacks the intent to kill is cruel and unusual punishment, in violation of the Eighth Amendment of the United States Constitution. He recognizes that the United States Supreme Court has concluded otherwise (Tison v. Arizona (1987) 481 U.S. 137, 157-158 [95 Cal. Rptr. 127, 144-145, 107 S.Ct. 1676]), but argues that Tison was wrongly decided. This court, even if so inclined, has no power to overrule Tison. (Chesapeake \u0026 Ohio Ry. Co. v. Martin (1931) 283 U.S. 209, 220- 221 [75 L.Ed. 983, 989-990, 51 S.Ct. 453].)\n\nDefendant further argues that absent a requirement of intent to kill, the California death penalty law violates the constitutional guarantees of due process and equal protection because it furnishes no rational guidelines for differentiating killers who are death eligible from those who are not. He asks us to reconsider People v. Anderson, supra, 43 Cal. 3d 1104, 1149, in which we held that the multiple- murder special circumstance does not require an intent to kill, overruling our earlier decision to the contrary in People v. Turner (1984) 37 Cal. 3d 302, 328-329 [208 Cal. Rptr. 196, 690 P.2d 669]. Defendant offers no persuasive reason to reconsider Anderson, and we decline to do so.\n\nFinally, defendant contends that application of People v. Anderson, supra, 43 Cal. 3d 1104, to offenses committed before our decision in People v. Turner, supra, 37 Cal. 3d 302, violates \"the ex post facto provision of the due process clause\" of the Fourteenth Amendment to the federal Constitution.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e We have rejected essentially the same argument on numerous occasions. (People v. Kaurish, supra, 52 Cal. 3d 648, 697; People v. Malone (1988) 47 Cal. 3d 1, 25 [252 Cal. Rptr. 525, 762 P.2d 1249]; People v. Poggi, supra, 45 Cal. 3d 306, 327.)\n\nD. Standard of Proof at Penalty Phase\n\nAt one point in the proceedings, the trial court remarked that at the penalty phase the prosecution \"does not have the burden of proof beyond a reasonable doubt.\" Defendant disagrees.\n\nThe court was right. We have on numerous occasions held that the beyond-a-reasonable-doubt standard does not apply to the determination whether death is the appropriate penalty. (E.g., People v. Malone, supra, 47 Cal. 3d 1, 59; People v. Rodriguez (1986) 42 Cal. 3d 730, 779 [230 Cal. Rptr.\n\n667, 726 P.2d 113].) Defendant advances no convincing reason why we should reconsider our previous resolution of this issue.\n\nE. Jury Trial Waiver as to Penalty\n\nWhen defendant waived his right to a jury at the penalty phase, the trial court advised him that if he opted for a jury, he would have \"12 jurors who must unanimously agree as to the punishment. [P] They have a choice, life without parole or death.\"\n\nDefendant contends that the trial court's advice was inadequate, because the court did not explain to him what would happen if the jury could not agree on the penalty to be imposed. In support, defendant cites the second paragraph of section 190.4, subdivision (b), which provides: \"If the trier of fact is a jury and has been unable to reach a unanimous verdict as to what the penalty shall be, the court shall dismiss the jury and shall order a new jury impaneled to try the issue as to what the penalty shall be. If such new jury is unable to reach a unanimous verdict as to what the penalty shall be, the court in its discretion shall either order a new jury or impose a punishment of confinement in state prison for a term of life without the possibility of parole.\" Defendant argues that because the trial court did not so inform him, his waiver of a jury trial was not knowingly and intelligently made, and is therefore void.\n\nWe rejected a similar claim in People v. Robertson (1989) 48 Cal. 3d 18 [255 Cal. Rptr. 631, 767 P.2d 1109]. Defendant attempts to distinguish Robertson from his case, pointing out that in Robertson the defendant waived his right to a jury trial only on the issue of penalty, whereas here defendant waived his right to a jury trial on the issue of guilt as well. Because of this distinction, defendant argues, the trial court should have explained to him the differences between a hung jury at the guilt phase and a hung jury at the penalty phase. We do not agree. The differences between the effect of a hung jury at the guilt phase and a hung jury at the penalty phase are minimal, and there is no greater need to describe them when the defendant gives up his right to a jury at both phases of trial, as occurred here, than when the defendant only waives a jury at the penalty phase, as was the case in Robertson.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nDefendant also faults the trial court for not inquiring into the reasons for the jury trial waiver. In People v. Robertson, supra, 48 Cal. 3d 18, 36,\n\ndefendant notes, defense counsel gave an on-the-record explanation of the tactical reasons for the waiver. The law, however, does not impose on the trial court an obligation to explore a defendant's reasons for giving up the right to a jury. Thus, the court's failure to do so here does not undermine the validity of defendant's jury waiver. As in Robertson, defendant acknowledged that he had thoroughly discussed the jury waiver with his attorney. In addition, when the court asked whether he had any questions regarding the waiver, or wished to discuss it further with counsel, defendant answered in the negative. Under these circumstances, the trial court properly found that defendant's waiver of a jury trial as to penalty was knowingly, intelligently, and voluntarily made.\n\nF. Findings of Fact and Conclusions of Law\n\nWhen, at the Conclusion of the penalty phase, the trial court determined that defendant should be sentenced to death, it made no factual or legal findings. Defendant argues that such findings are essential to ensure meaningful appellate review, and that the trial court's failure to make them violated both his Fourteenth Amendment right to due process of law and his Eighth Amendment right to a reliable verdict in a capital case.\n\nWe rejected a similar contention in People v. Frierson (1979) 25 Cal. 3d 142 [158 Cal. Rptr. 281, 599 P.2d 587]. There, the defendant asserted that when a jury decides the penalty in a capital case, the jury is constitutionally obligated to prepare written findings explaining its decision to impose the death penalty. We disagreed, pointing out that \"the trier of fact must make a special finding of the truth of each alleged special circumstance,\" and that at the time of the automatic motion for modification of verdict (§ 190.4, subd. (e)), the trial court must make an independent evaluation of the evidence and state on the record the reasons for its findings. (25 Cal. 3d at p. 179.) These protections, we held, constituted \"adequate ... safeguards for assuring careful appellate review.\" (Ibid.) Although the defendant in Frierson was tried under the 1977 death penalty law, we have repeatedly applied its reasoning in cases involving the 1978 death penalty law under which this case was tried. (See, e.g., People v. Medina (1990) 51 Cal. 3d 870, 909- 910 [274 Cal. Rptr. 849, 799 P.2d 1282]; People v. Belmontes (1988) 45 Cal. 3d 744, 805 [248 Cal. Rptr. 126, 755 P.2d 310].)\n\nDefendant insists that his case is distinguishable from People v. Frierson, supra, 25 Cal. 3d 142, because here the penalty was determined by a Judge, not a jury. He claims the difference is significant because on appellate\n\nreview of a death sentence following a jury trial, the reviewing court will be able to examine the jury instructions, which may be helpful in ascertaining the jury's reasons for imposing the death sentence. But the availability of jury instructions was of no significance to our Conclusion in Frierson that the jury was not obligated to make findings of fact. As with a jury, a Judge sitting as the trier of fact must make a specific finding of the truth of each alleged special circumstance, and at the time of the automatic motion for modification, the court must state the reasons for its findings. (§ 190.4, subd. (e).) These protections are sufficient to ensure adequate appellate review.\n\nDefendant also contends that the trial court's failure to make findings of fact and Conclusions of law at the guilt phase of the trial deprived him of his right under the federal Constitution to \"guided discretion\" in the application of the death penalty. (See Gregg v. Georgia (1976) 428 U.S. 153, 166, 188-189 [49 L.Ed.2d 859, 870- 871, 883-884, 96 S.Ct. 2909].) Defendant argues that such findings are necessary to ensure adequate appellate review both of the trial court's guilt determination and its choice of the death penalty instead of imprisonment for life without possibility of parole. Noting that the prosecution's case-in- aggravation consisted almost entirely of the circumstances of the crimes as shown by the evidence presented at the guilt phase, defendant maintains that it is impossible to determine what exactly the trial court determined the circumstances of the crimes to be, and which aspects of the capital crimes the trial court thought to warrant the verdict of death.\n\nAssuming for the sake of argument that the issue is properly before us (defendant made no request for factual or legal findings), it is without merit. California law has never required a court, when it is sitting as the trier of fact in a criminal case, to make findings of fact or Conclusions of law at the guilt phase of trial (§ 1167; People v. Golston (1962) 58 Cal. 2d 535, 539-540 [25 Cal. Rptr. 83, 375 P.2d 51]), and no federal court has held that such findings are constitutionally mandated. Defendant relies on federal cases stressing the importance of such findings (United States v. Brown (7th Cir. 1983) 716 F.2d 457; United States v. Livingston (3d Cir. 1972) 459 F.2d 797). These cases, however, merely implement the Federal Rules of Criminal Procedure, which require the trial court to make such findings only when requested to do so by the defense (Fed. Rules Crim. Proc., rule 23(c)); they do not hold that findings of fact are constitutionally required. As we have just explained, the court need not make such findings at the penalty phase; we see no more compelling reason to require that they be made at the guilt phase.\n\nFinally, defendant argues that the trial court made inadequate findings of fact when it denied his motion to modify the sentence from death to\n\nlife without possibility of parole. When ruling on a modification motion, the trial court must \"state on the record the reasons for [its] findings.\" (§ 190.4, subd. (e).)\n\nThe trial court in this case adequately stated the reasons for its findings. The court, after briefly reviewing the possible mitigating circumstances, explained: \"The ... circumstances of the greatest weight are the circumstances of the crime of which the defendant is convicted. [P] While acting in his professional capacity as a nurse in charge of patients in great need of his special training and talents he murdered twelve. [P] While working with patients totally subject to his will and entrusted to his care and compassion he murdered them by an overdose of a drug.\" As these comments indicate, the trial court found several circumstances of the offense to be aggravating: the number of murder victims (12), the particular vulnerability of the victims, and the fact that defendant took advantage of a position of trust to commit the murders. These circumstances may appropriately be considered in aggravation under section 190.3, subdivision (a); they may also be relied on as circumstances in aggravation for sentences imposed under the determinate sentencing law. (§ 1170; Cal. Rules of Court, rule 421(a)(3), (7), (11).) By relying on these grounds, the trial court properly explained its reasons for denying defendant's motion to modify the death sentence.\n\nG. Motion to Relieve Counsel\n\nAfter the penalty phase, but before the hearing on defendant's motion to modify the penalty of death, defendant told the trial court that he believed his counsel had inadequately represented him at trial. On that ground, he moved for a new trial, and he asked the court to appoint new counsel to assist him with the motion. At an in camera hearing, the court asked defendant to explain why he believed counsel had been inadequate. Thereafter, the court continued the case for one week to consider the matter. At the next court appearance, the trial court held another in camera hearing to allow defendant to elaborate on his allegations of inadequate representation. After hearing from defendant, the court denied his motions to relieve counsel and for a new trial.\n\nDefendant argues that the trial court should have granted his motion for appointment of new counsel. We disagree.\n\nWhen, after trial, a defendant asks the trial court to appoint new counsel to prepare and present a motion for new trial on the ground of ineffective assistance of counsel, the court must conduct a hearing to explore the reasons underlying the request. (People v. Stewart (1985) 171 Cal. App. 3d 388, 395\n\n[217 Cal. Rptr. 306]; see People v. Marsden (1970) 2 Cal. 3d 118, 123 [84 Cal. Rptr. 156, 465 P.2d 44].) If the claim of inadequacy relates to courtroom events that the trial court observed, the court will generally be able to resolve the new trial motion without appointing new counsel for the defendant. (People v. Stewart, supra, 171 Cal. App. 3d at p. 396.) If, on the other hand, the defendant's claim of inadequacy relates to matters that occurred outside the courtroom, and the defendant makes a \"colorable claim\" of inadequacy of counsel, then the trial court may, in its discretion, appoint new counsel to assist the defendant in moving for a new trial. (; see People v. Marsden, supra, 2 Cal. 3d at p. 123.)\n\nIn this case, defendant's claims that his counsel had been inadequate were not persuasive. Some of defendant's allegations had nothing to do with counsel's abilities,\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e some were manifestly untrue,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and some related to matters occurring during trial, which the court was able to evaluate based on its own observations.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Defendant's most persistent allegation was that his counsel had failed to call witnesses who would have given favorable testimony, but he was able to name only a few potential witnesses, and failed to explain how their testimony would have exonerated him. Defense counsel also explained that one potentially favorable witness had dropped out of sight and the defense had been unable to find her.\n\nAfter listening to defendant's explanation of his reasons for concluding that his counsel had performed inadequately, the trial court reasonably concluded that defendant had not made a \"colorable claim\" that counsel's performance at trial was prejudicially inadequate. The trial court did not abuse its discretion in denying defendant's request for new counsel to argue the issue of inadequacy.\n\nDefendant also contends that the trial court conducted an inadequate inquiry into defendant's reasons for believing his counsel had inadequately represented him. We do not agree. The trial court gave defendant ample opportunity, in two in camera hearings, to explain why he wanted his counsel discharged. Defendant's primary reason for dissatisfaction was counsel's failure to call exculpatory witnesses. After questioning defense counsel, the court allowed defendant to make additional comments about the matter. Defendant responded with several additional allegations, which the\n\ncourt also considered. The court properly discharged its obligation to inquire into the nature of defendant's dissatisfaction with his counsel.\n\nH. Motion for Modification of Death Sentence\n\nAfter the trial court's determination at the penalty phase that defendant should be sentenced to death, defense counsel orally moved the court to modify the sentence to life without possibility of parole. (§ 190.4, subd. (e).) The defense filed no written points and authorities, and argued the motion only briefly; counsel's primary contention was that defendant had saved the county a substantial sum of money by waiving his right to a jury at both phases of his trial. The trial court denied the modification motion.\n\nDefendant asserts that defense counsel's chief argument in support of the modification motion (that defendant had saved the county money) was legally irrelevant, and that defendant essentially received no modification hearing at all. He contends that the trial court had a duty to demand a more substantial argument and a posttrial brief in support of the motion.\n\nWe have never decided whether a defendant who waives a jury trial on the issue of penalty is entitled to a modification hearing under section 190.4, subdivision (e).\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Assuming there is such entitlement, the trial court has no duty to demand written briefs on the question of whether to grant the modification motion. Although such briefs are permissible (People v. Belmontes, supra, 45 Cal. 3d 744, 817), they are not obligatory. During the penalty phase the trial court carefully considered the question of penalty, and heard argument from the parties on the subject. The trial court had no reason\n\nto believe that additional argument or a supporting brief would have been of any assistance to the court, particularly in light of the parties' failure to present any evidence (other than a stipulation to defendant's age) at the penalty phase.\n\nI. Constitutionality of California Death Penalty Law\n\nDefendant challenges the constitutionality of the California death penalty statute under which he was convicted. He asserts: (1) it fails to distinguish which penalty phase factors are aggravating and which are mitigating; (2) it fails to exclude from the sentencer's consideration inapplicable aggravating and mitigating factors; (3) it fails to require written findings as to the aggravating factors supporting a death sentence; (4) it fails to require proof beyond a reasonable doubt of each aggravating factor; (5) it fails in jury trials to require jury unanimity on the dispositive aggravating factors; (6) it fails to require appellate proportionality review and \"the equal protection disparity review conferred upon non-capital criminal defendants by Penal Code section 1170(f)\"; (7) it creates an unconstitutional presumption of death; (8) it fails to require that the sentencer be informed of its unfettered discretion to return a sentence less than death based on mercy.\n\nDefendant acknowledges that we have previously rejected essentially the same contentions in previous decisions. (See People v. Jones, supra, 53 Cal. 3d 1115, 1154-1155 [contentions 1-6]; People v. Andrews (1989) 49 Cal. 3d 200, 227-230 [260 Cal. Rptr. 583, 776 P.2d 285] [contentions 7-8].) We decline to reconsider these issues.\n\nV. CONCLUSION\n\nEleven of the twelve special circumstance allegations are ordered stricken as duplicative. In all other respects the judgment is affirmed.\n\nLucas, C. J., and Baxter, J., concurred.\n\nDisposition\n\nEleven of the twelve special circumstance allegations are ordered stricken as duplicative. In all other respects the judgment is affirmed.\n\nConcurring.\n\nI concur in the result reached by the court. However, I believe People v. Memro (1985) 38 Cal. 3d 658 [214 Cal. Rptr. 832, 700 P.2d 446] was wrongly decided and should be overruled insofar as it purports to require a \"separate\" waiver of the right to jury trial of special circumstance allegations.\n\nThere are two phases of a capital trial: guilt and penalty. Findings as to the defendant's guilt and any special circumstance allegations generally are made on the basis of the evidence adduced during the first phase. (Pen. Code, § 190.1, subd. (a) [\"If the trier of fact finds the defendant guilty of\n\nfirst degree murder, it shall at the same time determine the truth of all special circumstances\" charged, except as to an allegation under § 190.2, subd. (a)(2); italics added.], and § 190.4, subd. (a).) The sole exception relates to charged prior-murder special-circumstance allegations. (§ 190.1, subd. (b), 190.2, subd. (a)(2).) Apart from that limited exception, a valid waiver of jury trial in the guilt phase, in my view, suffices to waive jury trial of special circumstance allegations. In this case, defendant validly waived his right to a jury as to both phases of trial. No more was required.\n\nArabian, J., and George, J., concurred.\n\nConcurring and Dissenting.\n\n, , , , , , , , , , I concur in the judgment and also in the lead opinion on the issues of guilt and death eligibility. After review, I have found no reason to do otherwise.\n\nI Dissent, however, on the issue of penalty. Pursuant to People v. Deere (1985) 41 Cal. 3d 353, 360-368 [222 Cal. Rptr. 13, 710 P.2d 925], I would set aside the sentence of death as unreliable under the Eighth Amendment to the United States Constitution and article I, section 17 of the California Constitution because defense counsel failed to introduce available evidence in mitigation. Such evidence was real and substantial--as the record of the guilt phase strongly suggests and the People in this court essentially concede. But evidence of that sort was not presented. Hence, the sentence of death must fall.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAppellant's petition for a rehearing was denied October 21, 1992, and the opinion was modified to read as printed. Mosk, J., was of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. Unless otherwise stated, all further statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. At trial, there was no testimony suggesting that either acidic blood or a bluish tinge was a normal characteristic of patients suffering from an overdose of lidocaine. This apparent misdescription of the symptoms of a lidocaine overdose was not raised in defendant's suppression motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. At trial, the prosecution argued that the syringe that defendant handed to MacDonald on this occasion was a different syringe, the \"Neble bolus\" (see p. 536, post), which contained a strength of lidocaine far above the standard concentration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In 1982, Proposition 8 added article I, section 28, subdivision (d) to the California Constitution, thereby abrogating California's exclusionary remedy for evidence seized in violation of the state, but not the federal, Constitution. (In re Lance W. (1985) 37 Cal. 3d 873, 879 [210 Cal. Rptr. 631, 694 P.2d 744].) Because the offenses here were committed before Proposition 8 was adopted, its provisions are inapplicable to this case. (People v. Smith (1983) 34 Cal. 3d 251 [193 Cal. Rptr. 692, 667 P.2d 149].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Tolford's affidavit also said that the syringe had been sent to Abbott Laboratories, which reported that it had been tampered with. Defendant challenges the accuracy of this statement, because it was later discovered that the syringe sent to the laboratory was not the one that defendant had handed to Nurse MacDonald. At the suppression hearing, Tolford testified that the syringe in question had been marked with patient Castro's name, that a syringe marked with that name had been sent to the laboratory, and that the laboratory reported that the syringe had been tampered with. Tolford therefore reasonably inferred that the syringe sent to the laboratory was the syringe defendant had handed to McDonald, and so stated in the affidavit. While the statement later proved to be inaccurate, the inaccuracy was neither negligent nor intentional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Boyce was a patient in CHOV's ICU; Patton and Swanson were patients at San Gorgonio Pass Hospital. They were hospitalized for periods ranging from three to five days before their deaths. Defendant was charged and convicted of killing patients Boyce and Swanson, but was not charged with killing patient Patton.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The trial court assumed that the statement at issue referred to patients Castro, Boyce, Bayless, Greatrex, Wilson, and Shaw. Although the affidavit elsewhere states that an autopsy was performed on each of these six patients and that toxicological tests of patients Boyce and Bayless revealed lethal doses of lidocaine, nothing in the affidavit suggests that these were indeed the patients the affiant had in mind when he drafted the statement in question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In his reply brief, defendant argues for the first time that the affidavit was false in two additional respects. First, he contends that in the affidavit investigator Tolford \"falsely and knowingly implied that [defendant] left CHOV to avoid detection.\" We disagree. Although the affidavit says that defendant left CHOV, it does not explain why he departed, and the trial court correctly found that Tolford made no attempt to imply that defendant left CHOV to avoid detection. We also reject defendant's claim that the affidavit \"falsely states that [defendant] claimed to have lost notes that he had shown to investigators the day before.\" According to the affidavit, defendant \"claimed that he no longer knew where the notes kept on the deceased patients were and indicated that hey might have been thrown out ....\" No evidence at the suppression hearing directly contradicted this statement. Investigator Tolford testified at that hearing that defendant brought notes to an interview that seemed different from notes he had brought to an earlier interview; Tolford was never asked whether defendant had told him that the notes defendant had brought to the first interview were lost.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant also claims that the technique used to measure the concentration of lidocaine in the \"Neble bolus\" (see post, p. 536) and in a vial of lidocaine found in defendant's house has not gained acceptance in the scientific community.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. To use an illustration given by a prosecution expert: if a sample of lung tissue contained 134 micrograms of lidocaine per gram of lung tissue, and the patient's lungs weighed 800 grams, the expert's Conclusion was that (multiplying 134 by 800) the lungs contained roughly 107,000 micrograms or 107 milligrams of lidocaine. Some organ weights were based on an actual weighing of the organs in question; others were estimates based on the average weight of such organs. 10a The experts included Dr. Rene Modglin, a pathologist for the Riverside County coroner's office, who conducted the autopsies of the patients and testified regarding the causes of their deaths; Dr. Dale Isaeff, medical director of the ICU and assistant professor at Loma Linda University Medical Center, who analyzed the medical records and electrocardiograms of roughly half of the patients; and Dr. Roy Jutzy, chief of the cardiology section in the department of medicine at Loma Linda University, who analyzed the medical records and electrocardiograms of the other half of the patients. Also testifying for the prosecution were Michael Peat, the associate director of the Center for Human Toxicology at the University of Utah; Randall Baselt, an associate professor in the pathology department at the University of California at Davis Medical School, and director of the university's toxicology laboratory; and Alphonse Poklis, a forensic toxicologist and associate professor in the department of pathology and pharmacology at St. Louis University School of Medicine. Peat supervised the laboratory testing of the patients' tissues and testified that the tissues contained lethal quantities of lidocaine; Poklis and Baselt agreed with Peat's findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Patient Rainwater was buried, but prosecution witnesses offered conflicting testimony as to whether he was embalmed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. According to both prosecution and defense experts, cardiac arrest itself may sometimes cause seizures. But the seizures of almost all of the patients in this case preceded the arrests, thus ruling out cardiac arrest as a cause of the seizures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Ambrose defined pharmacokinetics as \"the study of the absorption, distribution, metabolism, and elimination of drugs in the body.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Defendant argues strenuously that the charts were deficient because they often did not state the exact time at which intravenous lidocaine infusions were discontinued, thus making it difficult for the experts to determine exactly how much lidocaine was administered to the patients. The absence of this information in the charts, however, did not affect the accuracy of the information that was recorded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Most of the nurses working in CHOV's ICU were RN's, but some were LVN's. Generally, LVN's are not authorized to administer medication intravenously.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The night shift at CHOV typically lasted from 11:00 p.m. to 7:00 a.m. This opinion identifies shifts by the day on which they began; e.g., the April 4 night shift began at 11:00 p.m. that day and ended at 7:00 a.m. on April 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. A premature ventricular contraction--an electrical impulse arising from the heart ventricles at a point before it would occur in a \"normal\" heartbeat--is at times a warning sign that the patient has serious heart problems.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See ante, page 532, for an explanation of the QRS complex and its significance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The initial test, performed in May 1981, showed 58 micrograms of lidocaine per gram of tissue in Kean's liver, and 92 micrograms per gram in his kidney. The retest, which took place in the summer of 1983, showed 75 micrograms per gram in Kean's liver and 83 micrograms per gram in his kidney.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Dr. Jutzy defined a nodal rhythm as follows: \"A nodal rhythm is a rhythm where one has a QRS complex but no evidence of atrial activity or atrial activity that is very close to the QRS complex, meaning that the rhythm is originating from the area of the AV node rather than originating from the sinus node.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Nurse Phenicie testified that she had worked with defendant in several life-threatening emergencies and that in those situations defendant was \"very excited,\" \"on an emotional high,\" and seemed to enjoy taking command.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Defendant was not charged with killing patient Shaw, probably because her death came long after he had any opportunity to inject her with lidocaine, and any injected lidocaine would by that time have been eliminated by her body. Defendant was also not charged with attempting to kill any of the patients who experienced seizures but survived; the reason for this may well have been the prosecution's inability to produce any blood or tissue samples indicative of a lidocaine overdose. Tissue samples are not obtainable from live patients, and by the time the authorities suspected that defendant was giving patients lidocaine overdoses, any lidocaine in the blood of surviving patients had long since been eliminated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Section 189 provides: \"All murder which is perpetrated by means of a destructive device or explosive, knowing use of ammunition designed primarily to penetrate metal or armor, poison, lying in wait, torture, or by any other kind of willful, deliberate, and premeditated killing, or which is committed in the perpetration of, or attempt to perpetrate, arson, rape, robbery, burglary, mayhem, kidnapping, train wrecking, or any act punishable under Section 286, 288, 288a, or 289, is murder of the first degree; and all other kinds of murder are of the second degree.\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Defendant also filed a petition for writ of habeas corpus in which he addressed the reasons for the jury trial waiver. We denied the petition on July 16, 1992.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. People v. Hitch, supra, 12 Cal. 3d 641, has since been superseded by California v. Trombetta (1984) 467 U.S. 479 [81 L.Ed.2d 413, 104 S.Ct. 2528]. (People v. Johnson (1989) 47 Cal. 3d 1194, 1233-1234 [255 Cal. Rptr. 569, 767 P.2d 1047].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The related case arose in the following manner. When the police searched defendant's house, located in San Bernardino County, they found not only the lidocaine that was used as evidence in this case, but also morphine and other prescription drugs. Defendant was charged with murder in Riverside County, the location of CHOV, and was charged in case No. FCH 1813 with possessing the drugs in San Bernardino County. At the preliminary hearing in case No. FCH 1813, the magistrate granted defendant's motion to suppress evidence and dismissed the case, ruling that the warrant affidavit contained intentionally or recklessly false information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The \"examples\" are: (1) Counsel's failure to explain to and secure from defendant a waiver of his right to a jury trial on the special circumstance allegations; (2) counsel's failure to present evidence and argument regarding the large number of deaths occurring at CHOV in the months just before defendant's arrival; (3) counsel's failure to brief the applicable law for the trial court at each stage of the proceedings and to request the court to give findings of fact and Conclusions of law; (4) counsel's failure to make an opening statement; (5) counsel's failure to recall Joel Poston, an RN whom the defense called as an expert witness and then withdrew after the prosecution objected to his expertise; (6) counsel's minimal effort in the motion to modify the death sentence (§ 190.4, subd. (e)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In relevant part, section 190.4, subdivision (a) states: \"If the defendant was convicted by the court sitting without a jury, the trier of fact [to determine the truth or falsity of the alleged special circumstance(s)] shall be a jury unless a jury is waived by the defendant and by the people, in which case the trier of fact shall be the court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The due process clause has no \"ex post facto provision,\" but an \"unforeseeable judicial enlargement of a criminal statute\" may violate due process because its effect is essentially the same as an ex post facto law. (Bouie v. City of Columbia (1964) 378 U.S. 347, 353-354 [12 L.Ed.2d 894, 899- 900, 84 S.Ct. 1697]; see also In re Baert (1988) 205 Cal. App. 3d 514 [252 Cal. Rptr. 418].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The differences between a hung jury at the penalty phase and a hung jury at the guilt phase were far greater in People v. Robertson, supra, 48 Cal. 3d 18. Under the law at that time, if the jury at the defendant's first penalty trial had been unable to reach a verdict, the trial court would have been obligated to impose a sentence of life without parole. (See former § 190.4, subd. (b).) Under present law, set forth in the text, there is no difference until two penalty phase juries have been unable to reach a verdict; even then, the court is not obligated to impose a sentence of life without parole, although it then has an option to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. For example, defendant complained that the district attorney had hampered the efforts of defense investigators to obtain information from witnesses. Even if true, this allegation had no bearing on the competence of defendant's attorneys.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant alleged that one of his \"lead attorneys\" was \"being pressured to throw the case by superiors.\" Defendant, however, was represented by the head of the public defender's office, who had no superior.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. For example, defendant complained that during trial, the district attorney misquoted him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The statutory language is ambiguous. Section 190.4, subdivision (e) states in relevant part: \"In every case in which the trier of fact has returned a verdict or finding imposing the death penalty, the defendant shall be deemed to have made an application for modification of such verdict or finding .... In ruling on the application, the Judge shall ... make a determination as to whether the jury's findings and verdicts that the aggravating circumstances outweigh the mitigating circumstances are contrary to law or the evidence presented.\" (Italics added.) The italicized reference to the \"trier of fact\" suggests that the statute applies regardless of whether the penalty phase was tried by a Judge or by a jury, but the italicized reference to the \"jury's findings\" suggests that the statute is applicable only when a jury has made the penalty determination. Although at first glance a modification motion after a penalty phase court trial appears to be an exercise in futility, there is one aspect of the modification motion that is significant even when the penalty issue has been determined by a court rather than a jury: the requirement in section 190.4, subdivision (e) that the trial court \"state on the record the reasons for his [or her] findings.\" As we have discussed (ante, p. 571), this requirement is one of the \"safeguards for assuring careful appellate review\" that played a significant role in our Conclusion that the federal Constitution does not require such findings at the penalty phase. (See People v. Frierson, supra, 25 Cal. 3d 142, 179.) The statutory requirement that the reasons be stated on the record enables us to review the propriety of the penalty determination made by the trial court sitting without a jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Compare People v. Howard (1992) 1 Cal. 4th 1132, 1197 [5 Cal. Rptr. 2d 268, 824 P.2d 1315] (conc. \u0026 dis. opn. of Mosk, J.) (finding a verdict of death constitutionally unreliable when available mitigating evidence was not introduced); People v. Sanders (1990) 51 Cal. 3d 471, 531-533 [273 Cal. Rptr. 537, 797 P.2d 561] (dis. opn. of Mosk, J.) (same); People v. Lang (1989) 49 Cal. 3d 991, 1059-1062 [264 Cal. Rptr. 386, 782 P.2d 627] (conc. \u0026 dis. opn. of Mosk, J.) (same); and People v. Williams (1988) 44 Cal. 3d 1127, 1158- 1061 [245 Cal. Rptr. 635, 751 P.2d 901] (conc. \u0026 dis. opn. of Mosk, J.) (same).\u003c/span\u003e\n\n",
    "body_length": 171975,
    "citedas": [
      "3 Cal. 4th 495",
      "834 P.2d 1171",
      "11 Cal. Rptr. 2d 353"
    ],
    "attorneys": "Robin B. Johansen, under appointment by the Supreme Court, Charles C. Marson, Julie M. Randolph, Steven D. Dopkin and Remcho, Johansen \u0026 Purcell for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Richard B. Iglehart and George Williamson, Chief Assistant Attorneys General, Harley D. Mayfield and Gary W. Schons, Assistant Attorneys General, Pat Zaharopoulos, Robert M. Foster, Frederick R. Millar, Jr., and Peter Quon, Jr., Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Opinion by Kennard, J., with Lucas, C. J., and Baxter, J., Concurring. Separate opinion by Panelli, J., with Arabian and George, JJ., Concurring. Separate Concurring and Dissenting opinion by Mosk, J.",
    "citation_count": 16
  }
}
