{
  "id": "xYZaP2YBTlTomsSBRl4H",
  "document": {
    "title": "Board of Trade v. Securities and Exchange Commission",
    "full_title": "BOARD OF TRADE OF THE CITY OF CHICAGO v. SECURITIES AND EXCHANGE COMMISSION AND CHICAGO BOARD OPTIONS EXCHANGE, INCORPORATED, INTERVENOR-RESPONDENT.",
    "jurisdiction": "Seventh Circuit",
    "date": "1982-03-24T00:00:00.000Z",
    "docket": "No. 81-1660",
    "body": "The issue in this case is whether the Securities and Exchange Commission (SEC) has authority to regulate trading in options on Government National Mortgage Association mortgage-backed pass-through certificates (GNMA's), given that GNMA's are both \"commodities\" and \"securities.\" We hold that pending further action by the Commodity Futures Trading Commission (CFTC), all trading of options on GNMA's is prohibited and that the SEC has no jurisdiction of its own to permit trading in GNMA options.\n\nI\n\nLast April the Board of Trade of the City of Chicago (Board of Trade) petitioned us to set aside an order of the SEC approving rule changes of the Chicago Board Options Exchange, Incorporated (CBOE). The CBOE rule changes would have allowed trading on the CBOE of exchange-formed off-set options on GNMA's. The underlying instruments, GNMA's or Ginnie Maes, are the product of a program administered by the Government National Mortgage Association, a Government corporation within the Department of Housing and Urban Development. See 12 U.S.C. §§ 1716 et seq.; 24 C.F.R. ch. III. The program is designed to increase liquidity in the secondary mortgage market and attract new private sources of funds into residential loans. Under this program, GNMA certificates are issued by private institutions (primarily mortgage bankers) to represent interests in pools of Government-underwritten residential mortgages. The owner of a GNMA certificate receives a proportion of the income generated as mortgagors in the pool repay their loans, and the timely payment of principal and interest to the GNMA owner is guaranteed by the Government National Mortgage Association. GNMA's, like most securities or commodities, are fully transferable from one investor to another. As the CBOE has advised us, \"Institutional investors of all types have been attracted to GNMA's because such investments have favorable yields, good liquidity and a high degree of safety\" (Br. 5). Although the regular payments of principal and interest are guaranteed, they are fixed for the life of the pooled mortgages, and consequently GNMA owners bear the risk that mortgage interest rates may fluctuate, making the GNMA certificates more or less valuable. The two derivative instruments at issue here, GNMA options and GNMA futures, allow GNMA traders to transfer the risks associated with value fluctuations to speculators.\n\nThe CBOE's proposed market in GNMA options differs from the market in the underlying GNMA's in that when an option contract is traded no GNMA's change hands. The purchaser or \"holder\" of a GNMA option acquires only the right to buy or sell a specified quantity and quality of GNMA's at a specified price prior to a specified date. Conversely, in return for a premium, the seller or \"writer\" of the option (here, the CBOE's clearing house) undertakes the obligation of either selling or buying the GNMA's in the event that the holder \"exercises\" the purchased option. Under the CBOE's proposed rule changes, however, neither party need ever own or deliver any GNMA's in order to profit from the option transaction. The writer of the option may liquidate his position prior to the holder's exercise by purchasing an identical option, in effect transferring the obligation to a new option writer. Likewise, the option holder may recover the value of his option without actually exercising it simply by purchasing an equal but opposite option (an option to buy to match an option to sell, or vice versa). The original option and its opposite, \"offsetting\" option are then cancelled through the CBOE clearing house. Thus the CBOE's proposed options market could exist and prosper without any of the traders ever exercising the options and buying or selling the GNMA's.\n\nThe Board of Trade, a separate market from the CBOE, has since 1975 traded a different GNMA derivative-futures on GNMA's-pursuant to the designation of the other regulatory agency involved in this case, the CFTC. GNMA futures are obligations to make or take delivery of a specified quantity and quality of GNMA's at a particular time in the future and at an agreed price. Both parties to a futures contract are obligated to perform; there is no choice by either party to exercise a right to performance as there is with options. Nevertheless, investors may deal in GNMA futures without ever intending to deliver or take delivery of GNMA's because, like the proposed options, futures contracts may be offset by purchase or sale of an equal and opposite contract. Indeed, futures markets generally are not used to obtain actual delivery of a commodity. Most contracts are fulfilled by entering into an offsetting contract, and fewer than 3% of all futures contracts are fulfilled by taking (or making) actual delivery of the underlying commodity. See Commodity Futures Trading Commission Act of 1974: Hearings on H.R. 11955 Before the House Committee on Agriculture, 93d Cong., 2d Sess. 238 (1974) (statement of Sen. R. Clark); G. Clark, Genealogy and Genetics of \"Contract of Sale of a Commodity For Future Delivery\" in the Commodity Exchange Act, 27 Emory L.J. 1175, 1176 (1978). The differences between options and futures may be quite technical, see, e.g., Moriarty, Phillips \u0026 Tosini, A Comparison of Options and Futures in the Management of Portfolio Risk, Financial Analysts J. 61 (Jan./Feb. 1981), but a complete understanding of the differences has not been necessary to decide this case.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nImportant for understanding the motivation behind this and related lawsuits, however, is the great similarity of functions served by the two GNMA derivatives and the tremendous revenue they may generate for the exchanges on which they are traded. Both options and futures allow GNMA traders to shift to speculators the risk of changing mortgage interest rates, Moriarty, Phillips \u0026 Tosini, supra, and the volume of risk-shifting and speculation has been tremendous. In 1981, for example, there were approximately 2,293,000 sales of GNMA futures contracts on the Board of Trade, each contract representing $100,000 in unpaid mortgage principal. Thus when the CBOE proposed rule changes with the SEC to accommodate the creation of a market in exchange-formed off-set options on GNMA's, the Board of Trade filed comments criticizing the CBOE proposal.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The Board of Trade argued to the SEC that the proposed options are prohibited under Section 4c(c) of the Commodity Exchange Act, 7 U.S.C. § 6c(c), and that they fall within the CFTC's exclusive jurisdiction over commodity options under Sections 2(a)(1) and 4c(b) of the Act, 7 U.S.C. §§ 2 and 6c(b).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe SEC nevertheless approved the proposed rule changes on February 28, 1981, and the Board of Trade filed this petition for review as a person \"aggrieved\" by the SEC order. Securities Exchange Act of 1934, § 25(a)(1), 15 U.S.C. § 78y(a)(1).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The Board of Trade's petition reiterates its objections to the SEC order based on the Commodity Exchange Act and various CFTC regulations. In addition, the petition for review urges that even apart from prohibitions of the Commodity Exchange Act, under Sections 3(a)(12), 9(b), and 9(f) of the Securities Exchange Act of 1934, 15 U.S.C. §§ 78c(a)(12), 78i(b) and 78i(f), the SEC has no authority to regulate options on GNMA certificates. We will consider the Board of Trade's claims based on the Securities Exchange Act of 1934 although arguably they were not raised before the SEC\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e because the SEC has not objected to our consideration of them and because if the claims are correct the SEC has clearly and unambiguously exceeded its statutory jurisdiction. See K.C. Davis, Administrative Law Treatise § 20.00 at 127-128 (Supp.1980) (\"No matter how clear the statutory or nonstatutory law may be that exhaustion is required, the reviewing court will not require exhaustion if the agency fails to oppose review on grounds of lack of exhaustion.\"); First Jersey Securities, Inc. v. Bergen, 605 F.2d 690, 696 (3d Cir. 1979). The Board of Trade's failure to raise these claims is therefore excusable under Section 25(c)(1) of the Securities Exchange Act of 1934, 15 U.S.C. § 78y(c)(1). Cf. Sartain v. Securities and Exchange Commission, 601 F.2d 1366, 1375 (9th Cir. 1979) (denial of due process need not have been raised before SEC).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWe permitted the CBOE to intervene as a respondent and have had the further benefit of amicus briefs filed by the CFTC, the North American Securities Administrators Association, the Philadelphia Stock Exchange, and the Securities Investor Protection Corporation. After hearing oral argument from both Government agencies and both exchanges on November 4, 1981, we stayed the SEC order pending our resolution of this dispute.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nII\n\nThe CFTC and SEC have taken opposite stands with respect to their jurisdiction to regulate GNMA options.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In its order under review, the SEC has taken the position that the Commodity Exchange Act (CEA) is inapplicable to the trading of options on securities on a national securities exchange such as the CBOE and that it has authority under the Securities Exchange Act of 1934 (SEA) to allow such trading. The CFTC, on the other hand, agrees with the Board of Trade that the attempted SEC designation of commodity options trading is flatly prohibited by Sections 4c(b) and 4c(c) of the CEA. Moreover, the CFTC and Board of Trade argue that the CEA provides a comprehensive and in this instance exclusive regulatory scheme for commodity futures and commodity options transactions. The dispute arises primarily because GNMA's are both \"securities\" under SEA § 3(a)(10), 15 U.S.C. § 78c(a)(10), and \"commodities\" under CEA § 2(a)(1), 7 U.S.C. § 2. In disentangling the agencies' jurisdictions, we begin with a review of their respective powers under the CEA.\n\nExpanded Definition of \"Commodity\"\n\nBefore 1974, the Commodity Exchange Act of 1936 applied mostly to agricultural commodities. Essentially all commodity options transactions were prohibited. CEA of 1936, § 4c (current version at § 4c(a), 7 U.S.C. § 6c(a)). In 1974, Congress enacted the Commodity Futures Trading Commission Act, which amended the CEA's definition of \"commodity\" to include \"all other goods and articles, except onions * * *, and all services, rights, and interests in which contracts for future delivery are presently or in the future dealt in * * *.\" CEA § 2(a)(1), 7 U.S.C. § 2. By this amendment, literally anything other than onions\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e could become a \"commodity\" and thereby subject to CFTC regulation simply by its futures being traded on some exchange. The legislative history shows that the purpose of the enlarged definition was to allow regulation of futures contracts and other transactions in a growing number of commodities such as coffee, sugar, and foreign currencies that were then being traded on and off commodity exchanges and that had been unregulated under the prior version of the CEA. This language was also meant to encompass futures markets that were expected to be expanded to cover non-traditional goods and services such as GNMA's. See S.Rep.No.1131, 93d Cong., 2d Sess. 19, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5859; H.R.Rep.No.975, 93d Cong., 2d Sess. 41-42, 62 (1974); Philip F. Johnson, The Commodity Futures Trading Commission Act: Preemption as Public Policy, 29 Vand.L.Rev. 1, 25 (1976) (\"Congress was well aware, for example, that a futures contract based upon mortgage interest rates was under development in 1973 and 1974.\"). Under the expanded definition, the SEC concedes that GNMA's became a commodity when the Board of Trade began trading GNMA futures in 1975.\n\nBans on Options Trading\n\nAt the same time that Congress expanded the definition of commodity, it gave the CFTC the power to regulate all options transactions involving any of the new commodities. CEA § 4c(b), 7 U.S.C. § 6c(b).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Section 4c(b) provides that \"no person\" may trade in the new commodity options except in accordance with the CFTC's rules. Thus \"Congress gave the Commission (CFTC) power to extend (the prior prohibition on \"old' commodities) to options involving the previously unregulated commodities and to any \"new' commodities or to allow the offer and sale of these options subject to terms and conditions prescribed by the Commission.\" S.Rep.No.850, 95th Cong., 2d Sess. 10, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2098. In 1976, the CFTC exercised this \"plenary rule-making power\" to promulgate comprehensive options regulations. British American Commodity Options Corp. v. Bagley, 552 F.2d 482, 486-487 (2d Cir. 1977), certiorari denied, 434 U.S. 938, 98 S. Ct. 427, 54 L. Ed. 2d 297. See 17 C.F.R. Part 32. The new regulations failed to check persistent commodity options abuses, however, and the CFTC reacted in the Spring of 1978 pursuant to its Section 4c(b) power by suspending all commodity options trading indefinitely. 17 C.F.R. § 32.11. Congress ratified the ban on options trading later that year by adding Section 4c(c) to the CEA, 7 U.S.C. § 6c(c). By Section 4c(c), \"no person\" may enter into \"any commodity option transaction involving any\" of the new commodities-including GNMA's\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e -until the CFTC lifts the ban on trading by submitting to Congress for thirty days any proposal for renewed options trading.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe CFTC has not lifted the ban on GNMA options trading\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and therefore the CBOE cannot trade GNMA options. Moreover, the proposed options trading would not conform with the regulations promulgated by the CFTC pursuant to Section 4c(b) that were in effect at the time of the SEC order,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and would also violate various of the new CFTC regulations that on a limited basis permit options trading on commodity futures.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e For these reasons, the SEC order under review must be set aside.\n\nThe CFTC Exclusive Jurisdiction and SEC Savings Clauses\n\nThe SEC and CBOE make several arguments that Section 4c(c) and the regulations promulgated under Section 4c(b) do not apply to GNMA options traded on a national securities exchange. The first argument is based upon Congress' attempt in 1974 to divide jurisdiction between the CFTC and SEC with two proviso clauses to Section 2(a)(1) of the CEA, 7 U.S.C. § 2, the \"CFTC exclusive jurisdiction\" and \"SEC savings\" clauses:\n\nProvided, That the Commission (CFTC) shall have exclusive jurisdiction with respect to accounts, agreements (including any transaction which is of the character of, or is commonly known to the trade as, an \"option\", \"privilege\", \"indemnity\", \"bid\", \"offer\", \"put\", \"call\", \"advance guaranty\", or \"decline guaranty\"), and transactions involving contracts of sale of a commodity for future delivery, traded or executed on a contract market designated pursuant to section 5 of this Act (7 U.S.C. § 7) or any other board of trade, exchange, or market\n\nAnd provided further, That except as hereinabove provided, nothing contained in this section shall (i) supersede or limit the jurisdiction at any time conferred on the Securities and Exchange Commission or other regulatory authorities under the laws of the United States or of any State, or (ii) restrict the Securities and Exchange Commission and such other authorities from carrying out their duties and responsibilities in accordance with such laws.\n\nThe SEC and CBOE contend that options on GNMA's do not fall within the CFTC exclusive jurisdiction clause and therefore are \"saved\" from the options ban by the SEC savings clause. The Board of Trade, to the contrary, asserts that because the savings clause is limited by the introductory phrase \"nothing contained in this section,\" any SEC jurisdiction over GNMA options is not saved to the extent it is taken away by other Sections, such as the options ban Sections 4c(b) and 4c(c). The \"thing\" contained in Section 2(a)(1) of concern to the SEC and CBOE, however, is the expanded definition of \"commodity.\" The SEC and CBOE would have us read Sections 4c(b) and 4c(c) as limited by the breadth of \"commodity,\" which being defined in \"this section\" (Section 2(a)(1)) cannot be used to derogate from \"jurisdiction at any time conferred\" on the SEC. We agree with this part of their interpretation; the options ban would not possibly impinge on SEC jurisdiction unless the definition of commodity grew to include \"securities\" regulated by the SEC. Since the definition of commodity occurs in \"this section,\" the savings clause may indeed limit the options ban. Furthermore, the other limiting introductory phrase-\"except as hereinabove provided\"-does not except the definition of commodity from the savings clause, although the definition occurs \"hereinabove.\" \"(Except) as hereinabove provided\" refers only to above-mentioned proviso clauses, of which there is but one in Section 2(a)(1), the exclusive jurisdiction clause.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThus we interpret the savings clause so that an expanded definition of commodity does not divest the SEC of jurisdiction, via the options ban or otherwise, except where SEC jurisdiction is divested by the CFTC exclusive jurisdiction clause. Our construction of the savings clause does not aid the SEC and CBOE position, however, because we conclude that GNMA options are within the exclusive jurisdiction of the CFTC and also that under the SEA, the SEC has no power to be saved over GNMA options.\n\nThe Exclusive Jurisdiction Clause Covers Commodity Options\n\nSince options are among the listed agreements with respect to which the CFTC has exclusive jurisdiction, GNMA options come within the exclusive jurisdiction clause provided they \"(involve) contracts of sale of a commodity for future delivery.\" CEA § 2(a)(1). The difficulty lies in the word \"involve.\" The SEC and CBOE argue that GNMA options do not \"involve\" futures contracts because by their interpretation of the exclusive jurisdiction clause, options can \"involve\" futures contracts only by being on futures contracts. That is, the CFTC would have exclusive jurisdiction for options on futures contracts, but not for options merely on the underlying commodity.\n\nWe disagree. Congress understood the difference between \"transactions in\" and \"transactions involving.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Had Congress meant to limit CFTC exclusive jurisdiction to transactions in commodity futures, it would have said so. See American Stock Exchange, Inc. v. CFTC, 528 F. Supp. 1145, 1151-1152 (S.D.N.Y.1982) (recognizing that commodity options are within CFTC exclusive jurisdiction).\n\nInstead, the legislative history clearly indicates that Congress intended \"transactions involving\" to import something more than \"transactions in\" (or options on) commodity futures. Following lobbying led by the Chicago Board of Trade to give a single agency exclusive jurisdiction over commodity transactions, the House Committee on Agriculture revised its draft bill to read: \"the Commission (CFTC) shall have exclusive jurisdiction of transactions dealing in, resulting in, or relating to contracts of sale of a commodity for future delivery * * *.\" Hearings on S. 2485, S. 2578, S. 2837 \u0026 H.R. 13,113 Before the Senate Committee on Agriculture \u0026 Forestry, 93d Cong., 2d Sess. pt. 1 at 140-141 (1974) (emphasis added). See Johnson, supra, 29 Vand.L.Rev. at 10-11.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Since \"transactions dealing in (and) resulting in\" futures contracts cover trading in both futures and options on futures, by including the third category \"transactions * * * relating to\" futures the House draft would have extended CFTC exclusive jurisdiction to trading of futures-related instruments such as commodity options. Similarly, the Senate committee, whose version of the exclusive jurisdiction clause was adopted by the conference committee\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and enacted, explained that \"(a) the Commission's (CFTC's) jurisdiction over futures contract markets or other exchanges is exclusive and includes the regulation of commodity accounts, commodity trading agreements, and commodity options ; (b) the Commission's jurisdiction, where applicable, supersedes State as well as Federal agencies * * *.\" S.Rep.No.1131, 93d Cong., 2d Sess. 6 (1974), reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5848 (emphasis added).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nOne difficulty in searching the legislative history for evidence of an intended distinction between options and options on futures is that the phrase \"commodity option\" may have been used ambiguously to mean either.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The only distinction between the two options was made by sponsoring Chairman Poage of the House Committee on Agriculture, who explained that the CFTC was created in order \"to fill all regulatory gaps-to regulate trading in futures and in options relating to commodities or commodity futures, because such trading is now poorly regulated if it is regulated at all.\" 120 Cong.Rec. 34736 (1974) (emphasis added).\n\nWe conclude that Congress chose the phrase \" \"option' * * * involving contracts of sale of a commodity for future delivery\" in order to give the CFTC exclusive jurisdiction over at least some commodity options, although it is less clear how far the exclusive jurisdiction was meant to extend into options on commodities like GNMA's that double as securities. Given the possible expansion of \"commodity\" to include even corporate securities on which options have traditionally been regulated by the SEC, the CFTC exclusive jurisdiction clause must have some limits.\n\nCongress Did Not Limit Power Over Commodities to Non-Securities\n\nThe SEC and CBOE argue that even if a distinction cannot be made between commodity options and options on commodity futures, Congress did not intend to give the CFTC exclusive jurisdiction over transactions involving securities. The SEC and CBOE base their argument upon snippets in the legislative history that purportedly suggest a clean jurisdictional division between commodities and securities. For example, the Senate Committee on Agriculture and Forestry discussed the scope of the CFTC's option authority under Section 4c(b) in these terms:\n\nThe Committee intends that options not be traded except on organized exchanges and in conformity with the rules and regulations of the Commission (CFTC). However, the Commission would not have authority to regulate trading in puts and calls for securities. Where traded on exchanges, these puts and calls are regulated by the Securities and Exchange Commission.\n\nS.Rep.No.1131, 93d Cong., 2d Sess. 26, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5866. This passage does not describe CFTC power under the exclusive jurisdiction clause of Section 2(a)(1), although it does describe an important grant of CFTC power regarding options regulation, Section 4c(b). But crucially the passage fails to define what is meant by \"securities\"; the Senate Committee makes no distinction between traditional, corporate stocks and the extension of \"security\" here to include non-traditional instruments traded and regulated under the CEA for some six years as \"commodities.\"\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Similarly, a passage such as \"The Commission will have exclusive jurisdiction over options trading in commodities (but not in securities)\" does not cleave the agencies' jurisdictions but instead perhaps reflects a committee member's belief that commodities and securities could remain mutually exclusive. Id. at 31, (1974) U.S.Code Cong. \u0026 Ad.News at 5870. The Senate Committee, of course, had no reason to make subtle distinctions between traditional stocks and their new commodities because in 1974 the SEC had not yet attempted to regulate trading of the latter.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe dissent argues that Congress did not intend to preempt SEC jurisdiction on national securities exchanges subject to its regulation. There are a few places in the legislative history that could be strained to suggest this interpretation. For example, House Committee Chairman Poage stated:\n\nThis grant of exclusive jurisdiction (to the CFTC) is not to be construed as preempting the jurisdiction of the Securities and Exchange Commission over securities, including stock options, traded on any national securities exchange or any other U.S. securities market.\n\n120 Cong.Rec. 34737 (1974) (emphasis supplied). If jurisdiction were to be assigned by market, the dissent does not state how it would then limit the SEC jurisdiction so that the CBOE could not trade wheat options or onion futures, but we need not speculate what the CBOE may do in order to refute the argument. The exclusive jurisdiction clause states specifically that the CFTC has exclusive jurisdiction over the enumerated transactions whenever \"traded or executed on a contract market designated pursuant to section 5 of this Act (7 U.S.C. § 7) or any other board of trade, exchange, or market * * *.\" 7 U.S.C. § 2 (emphasis added). The dissent thus reads the legislative history inconsistently with the clear words of the statute, which divide jurisdiction by transactions rather than markets, and the statute must control. The statute also suggests a more plausible reading of the legislative history: that Congress in 1974 meant to protect SEC jurisdiction over the sorts of corporate stock options then being traded on national securities exchanges. Accordingly, the legislative history's reference to national securities exchanges is only illustrative of the instruments within the SEC's saved jurisdiction and does not compel a division of power according to what market an instrument is traded on.\n\nOur construction of the exclusive jurisdiction clause as including power over at least some commodity/security options is reinforced by subsequent legislative events. In 1975, the SEC attempted to add a provision in the 1975 amendments to the SEA that would have repealed the CFTC's grant of exclusive jurisdiction with respect to all \"transactions involving a \"security.' \" Hearings on S. 249 Before the Senate Subcommittee on Banking, Housing, and Urban Affairs, 94th Cong., 1st Sess. 244 (1975). SEC Chairman Ray Garrett, Jr. stated in a letter of comment requested by Chairman Harley O. Staggers of the House Committee on Interstate and Foreign Commerce that without the amendment, the CFTC's exclusive jurisdiction \"may well call into question the continuing jurisdiction of the Securities and Exchange Commission over options trading, including that on the Chicago Board Options Exchange and the American Stock Exchange, Inc.\" Id. at 204, 209.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Congress rejected the proposed reduction of CFTC jurisdiction, and the CFTC retains its exclusive jurisdiction over options that \"involve\" commodity futures even though the commodities may also be securities.\n\nIn 1978, the SEC again attempted to have \"securities\" withdrawn from CFTC power and also to extend the definition of security in each of the five Federal securities laws. Extend Commodity Exchange Act: Hearings on H.R. 10285 Before the House Subcommittee on Conservation and Credit, 95th Cong., 2d Sess. 181-210 (1978) (testimony of SEC Chairman Harold M. Williams); H.R.Rep.No.1181, 95th Cong., 2d Sess. 12-14 (1978); S.Rep.No.850, 95th Cong., 2d Sess. 20, 21, 52-55, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2108, 2109, 2140-2143.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Congress again rejected the SEC proposals, but added 7 U.S.C. § 4a(g)(2) to the CEA, which directs the CFTC to \"maintain communications\" with the SEC and other agencies in order to keep \"such agencies fully informed of Commission activities\" relative to their responsibilities. See Bromberg, Securities Law-Relationship to Commodities Law, 35 Bus.Law. 787, 791 (1980) (\"(T)he SEC has never really accepted the (CFTC) exclusive jurisdiction language, and has continued to argue that the language does not say what it pretty obviously does say and what Congress said in 1978 it obviously meant.\"). As noted above, Congress in 1978 was aware that GNMA's were among the new commodities but made no distinctions when imposing the options ban between GNMA's (or other commodity/securities) and other new commodities. See International Trading, Ltd. v. Bell, 262 Ark. 244, 556 S.W.2d 420, 424-425 (1977) (In Banc) (\"The argument that (CFTC exclusive jurisdiction) relates only to regulation of commodities, not securities, is unavailing here because of the clear language of the act bringing commodity options within the purview of the act.\").\n\nThe above discussion does not mean there are no limits to CFTC power over options on securities but only that we reject (as did Congress) the SEC's and CBOE's contention that the CFTC has no power over options on securities. The need for some limits upon CFTC power, however, remains.\n\nLimits on the Exclusive Jurisdiction Clause\n\nSince this is only the first case construing the extension of CFTC exclusive jurisdiction into options on securities, we have not attempted to divine the limits that a series of cases involving different commodity/securities may better establish. Rather, we have considered several rationales for separating exclusive CFTC jurisdiction from that reserved to the SEC based in the legislative materials and the logic of the overall legislative scheme.\n\nOne set of limits for the options aspect of the exclusive jurisdiction clause arises from the 1974 legislative history suggestion that only \"traditional\" SEC authority over corporate securities was to be preserved. See note 22 supra. GNMA's are not traditional securities; the regular payments of principal and interest that they represent, unlike corporate dividends, are guaranteed by the Government for the life of the certificate. Accordingly, GNMA's are exempted from many of the provisions of the Federal Securities Acts that apply to traditional stocks. See pages 1154, 1159 infra. It would seem then Congress intended non-traditional securities such as GNMA's to be within the CFTC's exclusive jurisdiction once the underlying security became a commodity by the opening of a legitimate futures market.\n\nAnother reasoned limitation on the scope of the exclusive jurisdiction clause is based on the purposes for which the commodity future or commodity option is traded. The district court in Mullis v. Merrill Lynch, Pierce, Fenner \u0026 Smith, Inc., 492 F. Supp. 1345 (D.Nev.1980) took this tack. In summarizing the 1974 legislative history it stated:\n\nThe jurisdiction of the CFTC preempts all other agency regulation in the commodities field, even regulation of a security, so long as the dominant purpose for the existence of the security is to trade in commodity futures * * *.\n\n492 F. Supp. at 1350 (emphasis added). During the 1978 amendments to the CEA, the Senate Committee on Agriculture, Nutrition, and Forestry suggested a similar, functional approach:\n\nThe committee has followed with interest the changing nature of futures markets. The nature of the underlying commodity is not an adequate basis to divide regulatory authority. Further, the fact that a futures contract market does not fit into the traditional mold where there are both hedging and price-discovery functions should not be the determining factor in whether the contract is to be regulated by the CFTC. So long as the futures contract serves a legitimate function, Congress has vested the Commodity Futures Trading Commission with jurisdiction.\n\nS.Rep.No.850, 95th Cong., 2d Sess. 22, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2110 (emphasis added).\n\nNone of the parties suggests that GNMA's are not \"legitimate\" commodities.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The parties also agree that GNMA futures serve the legitimate and important functions of allowing mortgage bankers to better anticipate changes in mortgage interest rates and to transfer the risks due to fluctuation in mortgage interest rates to speculators willing to assume them. The \"dominant purpose\" for the existence of GNMA's is not that they be traded as futures, but a sort of converse is correct: \"by providing a degree of liquidity for mortgage investments,\" GNMA futures further the purposes for the existence of the underlying GNMA's. 12 U.S.C. § 1716(a). Indeed, the CBOE proposal under review was greeted with enthusiasm by both mortgage bankers and the Government National Mortgage Association as a new means to facilitate their activities in the housing market. SEA Release No. 17577, at 4-6 (Feb. 26, 1981); SEC Record 327-472. GNMA futures or options are in this respect functionally quite similar to soybean futures or options, in that their trading serves legitimate hedging and price discovery functions, thereby facilitating production of the underlying commodity. See S.Rep.No.850, 95th Cong., 2d Sess. 13 (quoted in note 11 supra).\n\nGNMA futures are not identical to GNMA options, however, and there is some indication that mortgage bankers would prefer to trade in GNMA options.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Nevertheless, both instruments are claimed to serve more or less the same purposes, and the prices in each market assumedly would affect one another.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Moreover, the fears that prompted the 1974 and earlier legislation, concerning manipulation of commodity prices by speculators in commodity derivatives, apply equally to both options and futures. 7 U.S.C. § 5; Hearings on H.R. 6772 Before the Senate Committee on Agriculture and Forestry 18-22, 172-173, 182-185, 186-187, 214 (1936); Greenstone, The CFTC and Government Reorganization: Preserving Regulatory Independence, 33 Bus.Law. 163, 177-181 (1977). And the evidence presented to the SEC overwhelmingly indicated that opportunities for manipulation would be increased by addition of a GNMA options market regulated by a separate agency, although the effects of increased attempts at manipulation could not be foreseen. See, e.g., SEC Record 527, 636-640.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Congress quite clearly intended \"to create one federal agency with the expertise to regulate the commodities industry,\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e and its prudent choice should be given effect here. Since GNMA's are not traditional stocks and GNMA options have the character of a legitimate commodity derivative, we hold that the proposed GNMA options \"involve\" the pre-existing GNMA futures and therefore are within the exclusive jurisdiction of the CFTC.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe Treasury Amendment\n\nThe SEC and CBOE make one final argument that the CFTC has no power over GNMA options based upon a clause within Section 2(a)(1) of the CEA, 7 U.S.C. § 2, known as the \"Treasury amendment.\" The Treasury amendment provides that:\n\nNothing in this Act shall be deemed to govern or in any way be applicable to transactions in foreign currency, security warrants, security rights, resales of installment loan contracts, repurchase options, government securities, or mortgages and mortgage purchase commitments, unless such transactions involve the sale thereof for future delivery conducted on a board of trade.\n\nThe SEC and CBOE argue that GNMA options come within this list of transactions excluded from CFTC power as either \"security rights\" or \"transactions in * * * government securities.\" The argument fails. \"Security rights\" might be characterizable as options to purchase securities (\"call\" options), but there is no similar exclusion from the CEA for the other half of the CBOE proposal, options to sell securities (\"put\" options). In fact, Congress refused to adopt that part of the Treasury amendment which would have excluded \"puts and calls for securities\" from the provisions of the Commodity Exchange Act. See S.Rep.No.1131, 93d Cong., 2d Sess. 51, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5889 (draft of the amendment submitted by the Treasury to the Senate Committee on Agriculture and Forestry).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e In effect, the SEC and CBOE are asking us to reinsert language in the Treasury amendment that Congress had before it but deleted prior to passage.\n\nNor are GNMA options \"transactions in * * * government securities.\" \"The option transaction is a long step removed from a transaction in the commodity involved, since the option purchaser, if he or she does nothing more when the specified date arrives, will simply see the option die.\" Commodity Futures Trading Commission v. American Board of Trade, 473 F. Supp. 1177, 1183 (S.D.N.Y.1979); see also Commodity Futures Trading Commission \u0026 State of Georgia v. Sterling Capital Co., 2 Comm.Fut.L.Rep. (CCH) P 21,169, at 24,783-24,784 (N.D.Ga.), modified, 2 Comm.Fut.L.Rep. (CCH) P 21,170 (N.D.Ga.1981). Only when the option holder exercises the option is there a transaction in a government security. Under the CBOE proposal, however, an option holder never has to exercise the option in order to profit from the position. Thus the options market may exist without any transactions in the commodity itself. Accordingly, the Treasury amendment does not affect CFTC power over GNMA options.\n\nOn the other hand, if one of the transactions listed in the Treasury amendment included GNMA options, the \"unless\" clause would apply. As we have already held, the GNMA options \"involve\" GNMA futures contracts presently being traded on the various contract markets including the Board of Trade. Thus the Treasury amendment does not affect CFTC jurisdiction over GNMA options.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e From the legislative history, it is quite clear that the Treasury amendment was adopted by Congress only to prevent dual regulation by the CFTC and bank regulatory agencies of the banks and other sophisticated institutions that ordinarily trade in the enumerated financial instruments. See S.Rep.No.1131, 93d Cong., 2d Sess. 6, 23, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5848, 5863-5864.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIII\n\nApart from whether GNMA options are within the CFTC's exclusive jurisdiction, we find that the SEC has no power under the SEA to approve the CBOE's proposed rule changes. Therefore the order under review is void for want of jurisdiction and also for violating the options ban of CEA § 4c(c) and 17 C.F.R. § 32.11.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nGNMA Options Are Not Securities\n\nThe SEC first claims that it has plenary power over the trading of securities on stock exchanges, and that GNMA options are securities. Indeed, SEC power is broad. Section 5 of the SEA, 15 U.S.C. § 78e, makes unlawful any exchange trading in any security unless the exchange has been registered under Section 6, 15 U.S.C. § 78f. Section 6, in turn, gives the SEC power to prescribe rules for exchange registration. Other Sections of the SEA give the SEC various powers to require registration of securities to be traded on particular exchanges (Section 12, 15 U.S.C. § 78l ), to prohibit manipulative and deceptive devices (Section 10, 15 U.S.C. § 78j), to regulate brokers and dealers (Section 15, 15 U.S.C. § 78o ), and to investigate and require public disclosures (Sections 21 and 13, 15 U.S.C. §§ 78u, 78m). Such power, however, is with respect to trading in securities, and the exchange-formed off-set GNMA options that would be traded on the CBOE are not securities.\n\nSection 3(a)(10) of the SEA, 15 U.S.C. § 78c(a)(10), defines \"security\":\n\nWhen used in this title, unless the context otherwise requires-\n\n(10) The term \"security\" means any note, stock, treasury stock, bond, debenture, certificate of interest or participation in any profit-sharing agreement or in any oil, gas, or other mineral royalty or lease, any collateral-trust certificate, preorganization certificate or subscription, transferable share, investment contract, voting-trust certificate, certificate of deposit, for a security, or in general, any instrument commonly known as a \"security\"; or any certificate of interest or participation in, temporary or interim certificate for, receipt for, or warrant or right to subscribe to or purchase, any of the foregoing; but shall not include currency or any note, draft, bill of exchange, or banker's acceptance which has a maturity at the time of issuance of not exceeding nine months, exclusive of days of grace, or any renewal thereof the maturity of which is likewise limited.\n\nThe commodity underlying the proposed options, the GNMA certificate, falls within the definition of \"security,\" being a \"note, * * * bond, (or) debenture\" with a maturity exceeding nine months. See Davidson v. Dean Witter Reynolds, Inc., 478 F. Supp. 494, 495 (D.Colo.1979) (anti-fraud provisions of SEA are applicable to GNMA's); but see Marine Bank v. Weaver, 455 U.S. 551, 102 S. Ct. 1220, 71 L. Ed. 2d 409 (1982) (certificates of deposit issued by FDIC-insured bank are not securities for anti-fraud purposes). Exchange-formed off-set options, however, are not within the definition.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe SEC argues that the proposed options are \"warrants or rights to subscribe to or purchase\" the GNMA's. Warrants and rights are distinguishable from the proposed options, however. Ordinarily, warrants or rights are issued in connection with a transaction in which there is a genuine probability that the subscriber or purchaser will exercise the option because of a special interest in the underlying security itself. In the proposed market for GNMA options, on the other hand, the interest more often would be in the price of the underlying security and the identity of the security would be secondary. \"The usual \"warrant' is \"issued with bonds and shares of stock,' \" for example, in connection with a corporate reorganization or merger, or as an incentive to employees of the company whose stock underlies the warrant. Miller v. General Outdoor Advertising Co., 223 F. Supp. 790, 794 (S.D.N.Y.1963) (quoting 1 Dewing, The Financial Policy of Corporations 265 (5th ed.)), reversed on other grounds, 337 F.2d 994 (2d Cir. 1964). \"The \"right to subscribe' properly refers to the right given by an issuer to its stockholders to buy additional stock; if the corporation is to issue new stock often these rights are required by law to be given to the old stockholders because they have preemptive rights to the new stock.\" Id.\n\n\"(Puts)\" and \"calls\" are in a different category from \"warrants\" and \"rights,\" although all are forms of options. * * * (The former) instruments are generally written in bearer form by more or less professional investors, endorsed by stock exchange houses, and then bought and sold in the market. * * * The( ) option dealers rarely write the options themselves. * * * (The put and call options') economic raison d' etre is to serve as insurance against future market movements. For example, a person who is long may purchase a put as insurance that he will be able to sell if the market falls to a certain level, and a person who is short may purchase a call to ensure that he will be able to cover (buy) if the market rises to a certain figure. At the same time, these instruments provide a cheap form of speculation. Since they have served as manipulative devices in the past, the Commission (SEC) was given authority in the Securities Exchange Act of 1934 * * * to regulate puts and calls by rule. (citing § 9(b)-(d) * * *.)\n\nI L. Loss, Securities Regulation 467-468 (2d ed. 1961). In contrast to put and call options, warrants and rights generally have the more limited economic function of facilitating actual transfers of particular securities.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nWhen Congress wrote \"warrant or right to subscribe to or purchase\" a security, it did not intend to include the exchange-formed off-set options that the CBOE would trade here. Congress knew what security options were\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e but did not see fit to include them in its listing as separate securities.\n\nMoreover, \"warrants or rights\" would cover only options to purchase (\"call\" options) and the CBOE off-set program requires the complementary trading of options to sell (\"put\" options). The SEC argues that the broad definitions of \"purchase\" and \"sale\" of a security under Sections 3(a)(13) and 3(a)(14) of the SEA, 15 U.S.C. §§ 78c(a)(13) and 78c(a)(14), remedy the disparity between puts and calls. But even supposing that call options are securities, no reasonable combination of buying or selling them turns the deal into the transfer of a put option. Cf. Marine Bank v. Weaver, 455 U.S. 551, 102 S. Ct. 1220, 1222 n.2, 1225 n.9, 71 L. Ed. 2d 409 (1982) (although \"a pledge of stock is equivalent to a sale for the purposes of the antifraud provisions of the Federal securities laws,\" argument rejected that a \"certificate of deposit (deemed not a security by itself) was somehow transformed into a security when it was pledged\"). Although the transfer of an option may be deemed a purchase or sale for some purposes, e.g., Bershad v. McDonough, 428 F.2d 693 (7th Cir. 1970), it is always the purchase or sale of the underlying security, not a purchase or sale of the option qua security. Thus we are in agreement with the Supreme Court's statement in Blue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 750-751, 95 S. Ct. 1917, 1932, 44 L. Ed. 2d 539 that option holders \"have been recognized as \"purchasers' or \"sellers' of securities for purposes of Rule 10b-5 * * *.\" Blue Chip Stamps stands for the proposition that § 10(b) of the SEA and Rule 10b-5 may be invoked only by purchasers or sellers of securities, and says nothing about the purchase or sale of security options except insofar as options may facilitate purchase or sale of the underlying security.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe SEC and CBOE also argue that the GNMA options are \"investment contracts\" or interests \"commonly known as a security.\" Their authority for this proposition is I L. Loss, Securities Regulation 469 (2d ed. 1961), which speculates with regard to whether options should be deemed securities for purposes of registration under the Securities Act of 1933 and the \"insider\" trading restrictions of SEA § 16: \"both (puts and calls) are such an integral part of securities trading that it seems entirely reasonable to subsume them under the phrases \"investment contract' and \"interest or instrument commonly known as a \"security.\" \" \" But GNMA's are \"exempted securities\" under both the Securities Act of 1933\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e and the SEA,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e and therefore need not be registered under the former Act\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e nor are subject to the insider rules of SEA § 16.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Accordingly, the purposes to be served by Professor Loss' analysis are inapplicable to the underlying GNMA's, and he suggests no reason for treating options on GNMA's any differently.\n\nFor purposes of this case, we need not distinguish\n\nbetween an \"investment contract\" and an \"instrument commonly known as a \"security.' \" In either case, the basic test for distinguishing the transaction from other commercial dealings is\n\n\"whether the scheme involves an investment of money in a common enterprise with profits to come solely from the efforts of others.\" (SEC v. W. J.) Howey, 328 U.S. (293,) 301 (328 U.S. 293, 66 S. Ct. 1100, 1104, 90 L. Ed. 1244).\n\nThis test, in shorthand form, embodies the essential attributes that run through all of the Court's decisions defining a security. The touchstone is the presence of an investment in a common venture premised on a reasonable expectation of profits to be derived from the entrepreneurial or managerial efforts of others.\n\nUnited Housing Foundation, Inc. v. Forman, 421 U.S. 837, 852, 95 S. Ct. 2051, 2060, 44 L. Ed. 2d 621 (footnote omitted) (holding that shares of stock in a cooperative apartment house are not \"securities\" within Securities Acts). Courts have consistently held that commodity futures are not \"investment contract\" securities. E.g., Milnarik v. M-S Commodities, Inc., 457 F.2d 274, 275 n.1 (7th Cir. 1972) (per then Circuit Judge Stevens), certiorari denied, 409 U.S. 887, 93 S. Ct. 113, 34 L. Ed. 2d 144; McCurnin v. Kohlmeyer \u0026 Co., 340 F. Supp. 1338, 1341 (E.D.La.1972), affirmed per curiam, 477 F.2d 113 (5th Cir. 1973); American Grain Ass'n v. Canfield, Burch \u0026 Mancuso, 530 F. Supp. 1339 (W.D.La.1982); Saitlin, Exclusive CFTC Jurisdiction of Commodity Trading Vehicles May Depend Upon Form Over Substance, 33 Bus. Law. 241, 241-242 (1977); Bromberg, Commodities Law and Securities Law-Overlaps and Preemptions, 1 J.Corp.L. 217, 243-245 (1976). Judge Higginbotham of the Northern District of Texas held recently that a \"standby commitment\" to take delivery of GNMA's-essentially a put option in GNMA's between two commercial GNMA traders\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e -is not an \"investment contract\" either. LTV Federal Credit Union v. UMIC Government Securities, Inc., 523 F. Supp. 819, 828-833 (N.D.Tex.1981). Judge Higginbotham stated:\n\nThis court here sees no functional distinction between the Standby Commitment and commodity contracts for future delivery, as regarding their possible status as \"investment contracts,\" that would justify a different holding here. The economic realities of this transaction are that there is no \"common enterprise\"-no common business venture from which both parties can hope to generate profits to be distributed among them. And even if there were a \"common enterprise,\" the profits each party can hope to derive, are derived solely from the movement of a market over which neither has control or the ability to influence. The Standby Commitment thus is not an \"investment contract\" within the meaning of the Securities Act or the Exchange Act.\n\nId. at 830. Exactly the same analysis applies to the GNMA options program proposed here.\n\nSEC v. G. Weeks Securities, Inc., 483 F. Supp. 1239 (W.D.Tenn.1980), cited by the SEC, is not to the contrary. The transaction in Weeks, known as a \"standby with pair-off,\" involved only a \"book\" transfer of GNMA's used to camouflage a loan from investor to issuer. See 483 F. Supp. at 1242 (hypothetical example explaining in steps how the \"standby with pair-off\" works). In substance, the investor would receive a stated amount of \"interest\" (plus some possibility of extra gain due to fluctuation in the price of GNMA's) in return for use of his funds, while taking the risk that the issuer might be unable to invest the loans profitably enough to meet the \"interest\" payments. The district court quite reasonably held this transaction to be both an \"investment contract\" and an \"evidence of indebtedness\" within the definition of security. Cf. Glazer v. National Commodity Research \u0026 Statistical Service, Inc., 547 F.2d 392, 393 (7th Cir. 1977) (rejecting SEC argument that options to buy or sell commodity futures are \"investment contracts,\" \"interests commonly known as securities,\" or \"evidence of indebtedness\").\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nThe Context Requires That GNMA Options Are Not Securities\n\nSection 3(a) of the SEA, 15 U.S.C. § 78c(a), states that the meaning of \"security\" will not be frozen in the terms of the listed transactions when \"the context otherwise requires.\" Similarly, the Supreme Court has cautioned that \"a \"literal approach' to defining a security is misplaced.\" United Housing Foundation, Inc. v. Forman, 421 U.S. 837, 849, 95 S. Ct. 2051, 2059, 44 L. Ed. 2d 621. Rather, \"one must apply a test in terms of the purposes of the Federal Acts * * *.\" Teamsters v. Daniel, 439 U.S. 551, 559, 99 S. Ct. 790, 796, 58 L. Ed. 2d 808 (quoting SEC v. Variable Annuity Life Ins. Co., 359 U.S. 65, 80, 79 S. Ct. 618, 626, 3 L. Ed. 2d 640 (Brennan, J., concurring)).\n\nIn Daniel, the Supreme Court considered the existence of an alternative, comprehensive regulatory framework relevant to how \"security\" should be construed. The Supreme Court held in effect that the Employment Retirement Income Security Act of 1974 (ERISA) preempted the application of the Securities Acts to certain pension plans. 439 U.S. at 557, 569-570, 99 S. Ct. at 795, 801-02. \"The existence of this comprehensive legislation governing the use and terms of employee pension plans severely undercuts all arguments for extending the Securities Acts to noncontributory, compulsory pension plans. Congress believed that it was filling a regulatory void when it enacted ERISA, * * * (and) in light of ERISA(, application of the Securities Acts) serves no general purpose.\" Id. at 569-570, 99 S. Ct. 801-02. See also Marine Bank v. Weaver, 455 U.S. 551, 102 S. Ct. 1220, 1224, 71 L. Ed. 2d 409 (1982) (even though a six-year bank certificate of deposit would appear to be a \"note * * * (or) bond\" within the statutory definition, comprehensive banking regulation and FDIC insurance \"otherwise required\" that it not be deemed a security).\n\nIn the same fashion here, the CEA and the CFTC's consistent regulation of GNMA futures have displaced any prior SEC authority over GNMA options. CFTC authority to regulate commodity options under CEA §§ 4c(b) and 4c(c) is plenary; there is no need for compounding the regulation by adding the SEC. In enacting the CEA, Congress believed it was filling a regulatory void, see, e.g., 120 Cong.Rec. 34736-34737 (1974) (remarks of Rep. Poage), and it intended the agencies' powers to be non-redundant, as is apparent from the complementary CFTC exclusive jurisdiction and SEC savings clauses in CEA § 2(a)(1), 7 U.S.C. § 2, and the legislative history. See, e.g., S.Rep.No.850, 95th Cong., 2d Sess. 22, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2110 (\"the basic conclusion reached in 1974 that there should be a single regulatory agency responsible for futures trading is as valid now as it was then\"). Consequently, \"security\" should be construed to exclude GNMA options in order to avoid duplicative regulation over them by the SEC.\n\nSEC Power Under Section Nine of the SEA\n\nAnother potential source of SEC power over options, SEA § 9, 15 U.S.C. § 78i, does not depend on the options being securities. Section 9(b), in particular, gives the SEC power to regulate exchange trading of \"any put, call, straddle, or other option.\" Since Section 9(f) withdraws SEC authority regarding options on exempted securities,\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e however, the SEC has no power to permit trading of GNMA options.\n\nThat authority over options is specifically granted under Section 9 is further evidence that the SEC lacks authority over options under other sections of the SEA. Indeed, the SEC consistently has relied upon Section 9 for its authority to regulate exchange-traded options. For example, in 1961, in its study on puts and calls, the SEC stated that its authority over such transactions came from Sections 9(b) and 9(c). SEC Division of Trading \u0026 Exchanges, Report on Put and Call Options 1 (1961); 17th Annual Report of the SEC 67 (1961). In 1973, when it first authorized the CBOE stock options market, the SEC relied on its authority under Sections 9(b) and 9(c) to permit stock options trading through promulgation of Rule 9b-1. SEA Release No. 9930, 38 Fed.Reg. 1646 (Jan. 17, 1973); SEA Release No. 10552, 38 Fed.Reg. 34665 (Dec. 17, 1973). In 1975, following Congress' 1975 amendments to the SEA, the SEC rescinded Rule 9b-1 and adopted the more general Rule 19b-4. Nevertheless, in the SEC's view, \"the 1975 Amendments have not affected the Commission's authority under Section 9 of the Act,\" and \"the Commission will, of course, continue to review option trading closely in light of its broad authority under Section 9 of the Act.\" SEA Release No. 11604, 40 Fed.Reg. 40509, 40511 (Sept. 3, 1975). Finally, as recently as 1980, the SEC stated: \"Pursuant to Section 9(b) of the Securities Exchange Act of 1934 (\"Act'), the Commission has been granted plenary authority to regulate all aspects of options trading on exchanges * * *.\" SEA Release No. 16701, 45 Fed.Reg. 21426 (April 1, 1980).\n\nIn enacting the SEA, Congress viewed security options not as securities themselves, but as dangerous mechanisms used primarily for manipulating the prices of the underlying securities. See S.Rep.No.1455, 73d Cong., 2d Sess. 37-39, 45-47, 51-52 (1934); S.Rep.No.792, 73d Cong., 2d Sess. 9 (1934); H.R.Rep.No.1383, 73d Cong., 2d Sess. 10-11 (1934). Congress also recognized that there would be less potential for manipulation with respect to exempted securities, since they are issued or guaranteed by the Government. See Stock Exchange Regulation: Hearings on H.R. 7852 and H.R. 8720 Before the House Committee on Interstate and Foreign Commerce, 73d Cong., 2d Sess. 818-820 (1934); Federal Securities Act: Hearings on H.R. 4314 Before the House Committee on Interstate and Foreign Commerce, 73d Cong., 1st Sess. 110 (1933).\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Accordingly, by Section 9(f), Congress removed SEC power over options on exempted securities because their regulation was unnecessary. Thus the forty-year history of securities and commodities legislation can be construed sensibly by recognizing that the \"guaranteed\" value of exempted securities makes them closer in nature to traditional commodities, such as corn or pork bellies, than to traditional corporate stocks.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e In 1934, there was no need for the SEC to monitor options on exempted securities such as GNMA's; in 1974, when the need arose for commodity option regulation generally, Congress endowed the CFTC with the necessary authority.\n\nOther Sources of Options Power\n\nThe SEC purported to approve the CBOE rule changes pursuant to SEA § 19(b)(1), 15 U.S.C. § 78s(b)(1), and Rule 19b-4 thereunder. SEA Release No. 17577 (Feb. 26, 1981). Section 19(b)(1) simply provides that exchanges may file rule changes with the SEC and that with exceptions, rule changes become effective upon SEC approval. Section 19(b)(2), 15 U.S.C. § 78s(b)(2), states in part that the SEC \"shall approve a proposed rule change of a self-regulatory organization if it finds that such proposed rule change is consistent with the requirements of this title * * *.\" Thus neither Section 19(b)(1) nor Section 19(b)(2) expands SEC jurisdiction with respect to rule changes beyond what has already been granted elsewhere in the SEA; otherwise, the rule changes would not be \"consistent with the requirements of this title.\"\n\nSection 23(a)(1), 15 U.S.C. § 78w(a)(1), which allows the SEC to promulgate \"such rules and regulations as may be necessary or appropriate to implement the provisions of this title,\" does not reach GNMA options either. Assuming that Section 23(a)(1) can ever enlarge SEC jurisdiction, we find it inapplicable here. It is unnecessary for the SEC to promulgate rules regarding GNMA options when the CFTC has the necessary statutory jurisdiction\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e and inappropriate in the face of the Congressional options ban of CEA § 4c(c). Our upholding the jurisdiction of the CFTC will not foreclose the CBOE from instituting a program of options on GNMA's once the CFTC promulgates appropriate rules and the options ban is lifted through a proper submission to and approval by Congress.\n\nAs already mentioned, pages 1149-1150 supra, Congress was given at least two opportunities since passage of the Commodity Futures Trading Commission Act of 1974 to adjust SEC jurisdiction, but each time Congress chose to make no adjustments. This Court would be remiss to do differently. The SEC simply is without power to authorize trading in GNMA options.\n\nIV\n\nThe statutes at issue in this case are complex enough to admit different opinions of their proper construction. The dissent, however, has shown itself to be motivated by more \"practical\" matters such as whether the CFTC is healthy enough to handle its statutory jurisdiction. Indeed the dissent notes that the CFTC has been criticized in testimony before Congress as unfit to regulate and that Congress may soon be legislating anew. That Congress presently is reconsidering the two agencies' jurisdictions, however, means there is less need for \"judicial first-aid\" and a greater need for telling Congress the plain meaning of the laws now in force.\n\nOur disposition of this case is based upon statutory construction and legislative history. Our task should not reflect a value judgment as to which of the competing agencies is best equipped to regulate these options. If Congress disagrees with our interpretation it can of course amend the applicable statutes. To approve the SEC's order of February 28, 1981, would be contrary to the present Congressional scheme giving the CFTC exclusive jurisdiction over GNMA options trading while giving no authority over such trading to the SEC. Therefore, the SEC order of February 28, 1981, is set aside and our prior stay is dissolved.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Our mandate shall issue forthwith, with costs to be taxed to respondents.\n\nAPPENDIX\n\nCEA § 2(a)(1), 7 U.S.C. § 2:\n\nDefinitions\n\nFor the purposes of this chapter \"contract of sale\" shall be held to include sales, agreements of sale, and agreements to sell. The word \"person\" shall be construed to import the plural or singular, and shall include individuals, associations, partnerships, corporations, and trusts. The word \"commodity\" shall mean wheat, cotton, rice, corn, oats, barley, rye, flaxseed, grain sorghums, mill feeds, butter, eggs, Solanum tuberosum (Irish potatoes), wool, wool tops, fats and oils (including lard, tallow, cottonseed oil, peanut oil, soybean oil and all other fats and oils), cottonseed meal, cottonseed, peanuts, soybeans, soybean meal, livestock, livestock products, and frozen concentrated orange juice, and all other goods and articles, except onions as provided in section 13-1 of this title, and all services, rights, and interests in which contracts for future delivery are presently or in the future dealt in: Provided, That the Commission shall have exclusive jurisdiction with respect to accounts, agreements (including any transaction which is of the character of, or is commonly known to the trade as, an \"option\", \"privilege\", \"indemnity\", \"bid\", \"offer\", \"put\", \"call\", \"advance guaranty\", or \"decline guaranty\"), and transactions involving contracts of sale of a commodity for future delivery, traded or executed on a contract market designated pursuant to section 7 of this title or any other board of trade, exchange, or market, and transactions subject to regulation by the Commission pursuant to section 23 of this title: And provided further, That, except as hereinabove provided, nothing contained in this section shall (i) supersede or limit the jurisdiction at any time conferred on the Securities and Exchange Commission or other regulatory authorities under the laws of the United States or of any State, or (ii) restrict the Securities and Exchange Commission and such other authorities from carrying out their duties and responsibilities in accordance with such laws. Nothing in this section shall supersede or limit the jurisdiction conferred on courts of the United States or any State. Nothing in this chapter shall be deemed to govern or in any way be applicable to transactions in foreign currency, security warrants, security rights, resales of installment loan contracts, repurchase options, government securities, or mortgages and mortgage purchase commitments, unless such transactions involve the sale thereof for future delivery conducted on a board of trade.\n\nCEA § 2(a)(8)(B), 7 U.S.C. § 4a(g)(2):\n\n(i) The Commission shall maintain communications with the Department of the Treasury, the Board of Governors of the Federal Reserve System, and the Securities and Exchange Commission for the purpose of keeping such agencies fully informed of Commission activities that relate to the responsibilities of those agencies, for the purpose of seeking the views of those agencies on such activities, and for considering the relationships between the volume and nature of investment and trading in contracts of sale of a commodity for future delivery and in securities and financial instruments under the jurisdiction of such agencies.\n\n(ii) When a board of trade applies for designation as a contract market involving transactions for future delivery of any security issued or guaranteed by the United States or any agency thereof, the Commission shall promptly deliver a copy of such application to the Department of the Treasury and the Board of Governors of the Federal Reserve System. The Commission may not designate a board of trade as a contract market based on such application until forty-five days after the date the Commission delivers the application to such agencies or until the Commission receives comments from each of such agencies on the application, whichever period is shorter. Any comments received by the Commission from such agencies shall be included as part of the public record of the Commission's designation proceeding. In designating, or refusing, suspending, or revoking the designation of, a board of trade as a contract market involving transactions for future delivery referred to in this clause or in considering possible emergency action under section 12a(9) of this title with respect to such transactions, the Commission shall take into consideration all comments it receives from the Department of the Treasury and the Board of Governors of the Federal Reserve System and shall consider the effect that any such designation, suspension, revocation, or emergency action may have on the debt financing requirements of the United States Government and the continued efficiency and integrity of the underlying market for government securities.\n\n(iii) The provisions of this paragraph shall not create any rights, liabilities, or obligations upon which actions may be brought against the Commission.\n\nCEA § 4c, 7 U.S.C. § 6c:\n\nProhibited transactions\n\nCommodities specifically listed\n\n(a) It shall be unlawful for any person to offer to enter into, enter into, or confirm the execution of, any transaction involving any commodity, which is or may be used for (1) hedging any transaction in interstate commerce in such commodity or the products or by-products thereof, or (2) determining the price basis of any such transaction in interstate commerce in such commodity, or (3) delivering any such commodity sold, shipped, or received in interstate commerce for the fulfillment thereof-\n\n(A) if such transaction is, is of the character of, or is commonly known to the trade as, a \"wash sale,\" \"cross trade,\" or \"accommodation trade,\" or is a fictitious sale;\n\n(B) if such transaction involves any commodity specifically set forth in section 2 of this title, prior to October 23, 1974, and if such transaction is of the character of, or is commonly known to the trade as, an \"option\", \"privilege\", \"indemnity\", \"bid\", \"offer\", \"put\", \"call\", \"advance guaranty\", or \"decline guaranty\", or\n\n(C) if such transaction is used to cause any price to be reported, registered or recorded which is not a true and bona fide price.\n\nNothing in this section shall be construed to prevent the exchange of futures in connection with cash commodity transactions or of futures for cash commodities, or of transfer trades or office trades if made in accordance with board of trade rules applying to such transactions and such rules shall have been approved by the Commission.\n\nCommodities regulated but not specifically listed\n\n(b) No person shall offer to enter into, enter into, or confirm the execution of, any transaction subject to the provisions of subsection (a) of this section involving any commodity regulated under this chapter, but not specifically set forth in section 2 of this title, prior to October 23, 1974, which is of the character of, or is commonly known to the trade as, an \"option\", \"privilege\", \"indemnity\", \"bid\", \"offer\", \"put\", \"call\", \"advance guaranty\", or \"decline guaranty\", contrary to any rule, regulation, or order of the Commission prohibiting any such transaction or allowing any such transaction under such terms and conditions as the Commission shall prescribe within one year after the effective date of the Commodity Futures Trading Commission Act of 1974 unless the Commission determines and notifies the Senate Committee on Agriculture, Nutrition, and Forestry and the House Committee on Agriculture that it is unable to prescribe such terms and conditions within such period of time: Provided, That any such order, rule, or regulation may be made only after notice and opportunity for hearing: And provided further, That the Commission may set different terms and conditions for different markets.\n\nCommodity option transaction; conditions ending prohibition; excepted persons\n\n(c) Notwithstanding the provisions of subsection (b) of this section, no person may, after September 30, 1978, offer to enter into, enter into, or confirm the execution of any commodity option transaction involving any commodity regulated under this chapter but not specifically set forth in section 2 of this title prior to October 23, 1974, until (1) the Commission transmits to the House Committee on Agriculture and the Senate Committee on Agriculture, Nutrition, and Forestry documentation of its ability to regulate successfully such transactions, including a copy of the Commission's proposed rules and regulations, and (2) the expiration of thirty calendar days of continuous session of Congress after the date of such transmittal. The Commission is not precluded from transmitting, at any time, documentation relating to its ability to regulate such transactions regarding individual commodities, classes of commodities, or regulation of such transactions on specific boards of trade. Nothing in this subsection shall affect any rights or obligations arising out of any transactions subject to the provisions of this subsection entered into, or the execution of which was confirmed, prior to October 1, 1978: Provided, That this prohibition shall not apply to any transaction expressly permitted under rules or regulations prescribed by the Commission, before or after September 30, 1978, to be offered to be entered into, entered into, or confirmed, in which the purchaser is a producer, processor, commercial user of, or a merchant handling, the commodity involved in the transaction, or the products or by-products thereof.\n\nSEA § 3(a), 15 U.S.C. § 78c(a):\n\nDefinitions and application\n\nDefinitions\n\nWhen used in this chapter, unless the context otherwise requires-\n\n(10) The term \"security\" means any note, stock, treasury stock, bond, debenture, certificate of interest or participation in any profit-sharing agreement or in any oil, gas, or other mineral royalty or lease, any collateral-trust certificate, preorganization certificate or subscription, transferable share, investment contract, voting-trust certificate, certificate of deposit, for a security, or in general, any instrument commonly known as a \"security\"; or any certificate of interest or participation in, temporary or interim certificate for, receipt for, or warrant or right to subscribe to or purchase, any of the foregoing; but shall not include currency or any note, draft, bill of exchange, or banker's acceptance which has a maturity at the time of issuance of not exceeding nine months, exclusive of days of grace, or any renewal thereof the maturity of which is likewise limited.\n\n(12) The term \"exempted security\" or \"exempted securities\" includes securities which are direct obligations of, or obligations guaranteed as to principal or interest by, the United States; such securities issued or guaranteed by corporations in which the United States has a direct or indirect interest as shall be designated for exemption by the Secretary of the Treasury as necessary or appropriate in the public interest or for the protection of investors; municipal securities, as defined in paragraph (29) of this subsection: Provided, however, That municipal securities shall not be deemed to be \"exempted securities\" for purposes of sections 78o, 78o-3 (except subsections (b)(6), (b)(11), and (g)(2) thereof), and 78q-1 of this title; any interest or participation in any common trust fund or similar fund maintained by a bank exclusively for the collective investment and reinvestment of assets contributed thereto by such bank in its capacity as trustee, executor, administrator, or guardian; any interest or participation in a single trust fund, or a collective trust fund maintained by a bank, or any security arising out of a contract issued by an insurance company, which interest, participation, or security is issued in connection with (A) a stock bonus, pension, or profit-sharing plan which meets the requirements for qualification under section 401 of Title 26, (B) an annuity plan which meets the requirements for the deduction of the employer's contribution under section 404(a)(2) of Title 26, or (C) a governmental plan as defined in section 414(d) of Title 26 which has been established by an employer for the exclusive benefit of its employees or their beneficiaries for the purpose of distributing to such employees or their beneficiaries the corpus and income of the funds accumulated under such plan, if under such plan it is impossible, prior to the satisfaction of all liabilities with respect to such employees and their beneficiaries, for any part of the corpus or income to be used for, or diverted to, purposes other than the exclusive benefit of such employees or their beneficiaries, other than any plan described in clause (A), (B), or (C) of this paragraph (i) which covers employees some or all of whom are employees within the meaning of section 401(c) of Title 26, or (ii) which is a plan funded by an annuity contract described in section 403(b) of Title 26; and such other securities (which may include, among others, unregistered securities, the market in which is predominantly intrastate) as the Commission may, by such rules and regulations as it deems consistent with the public interest and the protection of investors, either unconditionally or upon specified terms and conditions or for stated periods, exempt from the operation of any one or more provisions of this chapter which by their terms do not apply to an \"exempted security\" or to \"exempted securities\".\n\n(13) The terms \"buy\" and \"purchase\" each include any contract to buy, purchase, or otherwise acquire.\n\n(14) The terms \"sale\" and \"sell\" each include any contract to sell or otherwise dispose of.\n\nSEA § 9, 15 U.S.C. § 78i:\n\nManipulation of security prices\n\nTransactions relating to puts, calls, straddles, or options\n\n(b) It shall be unlawful for any person to effect, by use of any facility of a national securities exchange, in contravention of such rules and regulations as the Commission may prescribe as necessary or appropriate in the public interest or for the protection of investors-\n\n(1) any transaction in connection with any security whereby any party to such transaction acquires any put, call, straddle, or other option or privilege of buying the security from or selling the security to another without being bound to do so; or\n\n(2) any transaction in connection with any security with relation to which he has, directly or indirectly, any interest in any such put, call, straddle, option, or privilege; or\n\n(3) any transaction in any security for the account of any person who he has reason to believe has, and who actually has, directly or indirectly, any interest in any such put, call, straddle, option, or privilege with relation to such security.\n\nEndorsement or guarantee of puts, calls, straddles, or options\n\n(c) It shall be unlawful for any member of a national securities exchange directly or indirectly to endorse or guarantee the performance of any put, call, straddle, option, or privilege in relation to any security registered on a national securities exchange, in contravention of such rules and regulations as the Commission may prescribe as necessary or appropriate in the public interest or for the protection of investors.\n\nRegistered warrant, right, or convertible security not included in \"put\", \"call\", \"straddle\", or \"option\"\n\n(d) The terms \"put\", \"call\", \"straddle\", \"option\", or \"privilege\" as used in this section shall not include any registered warrant, right, or convertible security.\n\nSection not applicable to exempted securities\n\n(f) The provisions of this section shall not apply to an exempted security.\n\nSEA § 19(b), 15 U.S.C. § 78s(b):\n\nProposed rule changes; notice; proceedings\n\n(b)(1) Each self-regulatory organization shall file with the Commission, in accordance with such rules as the Commission may prescribe, copies of any proposed rule or any proposed change in, addition to, or deletion from the rules of such self-regulatory organization (hereinafter in this subsection collectively referred to as a \"proposed rule change\") accompanied by a concise general statement of the basis and purpose of such proposed rule change. The Commission shall, upon the filing of any proposed rule change, publish notice thereof together with the terms of substance of the proposed rule change or a description of the subjects and issues involved. The Commission shall give interested persons an opportunity to submit written data, views, and arguments concerning such proposed rule change. No proposed rule change shall take effect unless approved by the Commission or otherwise permitted in accordance with the provisions of this subsection.\n\n(2) Within thirty-five days of the date of publication of notice of the filing of a proposed rule change in accordance with paragraph (1) of this subsection, or within such longer period as the Commission may designate up to ninety days of such date if it finds such longer period to be appropriate and publishes its reasons for so finding or as to which the self-regulatory organization consents, the Commission shall-\n\n(A) by order approve such proposed rule change, or\n\n(B) institute proceedings to determine whether the proposed rule change should be disapproved. Such proceedings shall include notice of the grounds for disapproval under consideration and opportunity for hearing and be concluded within one hundred eighty days of the date of publication of notice of the filing of the proposed rule change. At the conclusion of such proceedings the Commission, by order, shall approve or disapprove such proposed rule change. The Commission may extend the time for conclusion of such proceedings for up to sixty days if it finds good cause for such extension and publishes its reasons for so finding or for such longer period as to which the self-regulatory organization consents.\n\nThe Commission shall approve a proposed rule change of a self-regulatory organization if it finds that such proposed rule change is consistent with the requirements of this chapter and the rules and regulations thereunder applicable to such organization. The Commission shall disapprove a proposed rule change of a self-regulatory organization if it does not make such finding. The Commission shall not approve any proposed rule change prior to the thirtieth day after the date of publication of notice of the filing thereof, unless the Commission finds good cause for so doing and publishes its reasons for so finding.\n\nSEA § 23(a)(1), 15 U.S.C. § 78w(a)(1):\n\nRules, regulations, and orders; annual reports\n\nPower to make rules and regulations; considerations; public disclosure\n\n(a)(1) The Commission, the Board of Governors of the Federal Reserve System, and the other agencies enumerated in section 78c(a)(34) of this title shall each have power to make such rules and regulations as may be necessary or appropriate to implement the provisions of this chapter for which they are responsible or for the execution of the functions vested in them by this chapter, and may for such purposes classify persons, securities, transactions, statements, applications, reports, and other matters within their respective jurisdictions, and prescribe greater, lesser, or different requirements for different classes thereof. No provision of this chapter imposing any liability shall apply to any act done or omitted in good faith in conformity with a rule, regulation, or order of the Commission, the Board of Governors of the Federal Reserve System, other agency enumerated in section 78c(a)(34) of this title, any self-regulatory organization, notwithstanding that such rule, regulation, or order may thereafter be amended or rescinded or determined by judicial or other authority to be invalid for any reason.\n\n17 C.F.R. § 32.11:\n\nSuspension of commodity option transactions.\n\n(a) Notwithstanding any other provision of this Part 32, it shall be unlawful on and after June 1, 1978, until further rule, regulation or order of the Commission, for any person to solicit or accept orders for, or to accept money, securities or property in connection with, the purchase or sale of any commodity option, or to supervise any person or persons so engaged.\n\n(b) The provisions of paragraph (a) of this section shall not apply to any commodity option offered or entered into in accordance with the provisions of § 32.4(a).\n\n(c) Nothing in this section shall apply to, or affect the rights, privileges or obligations of any person arising out of any commodity option transaction entered into prior to June 1, 1978.\n\nCFTC's new § 33.4 (to be codified at 17 C.F.R. § 33.4):\n\nDesignation as a contract market for the trading of commodity options.\n\nThe Commission may designate any board of trade located in the United States as a contract market for the trading of options on contracts of sale for future delivery * * *.\n\n17 C.F.R. § 32.2:\n\nProhibited transactions.\n\nNo person may offer to enter into, enter into, confirm the execution of, or maintain a position in, any transaction in interstate commerce involving:\n\n(a) Wheat, cotton, rice, corn, oats, barley, rye, flaxseed, grain sorghums, mill feeds, butter, eggs, onions, Solanum tuberosum (Irish potatoes), wool, wool tops, fats and oils (including lard, tallow, cottonseed oil, peanut oil, soybean oil and all other fats and oils), cottonseed meal, cottonseed, peanuts, soybeans, soybean meal, livestock, livestock products and frozen concentrated orange juice, or\n\n(b) Any contract of sale of any commodity for future delivery traded on or subject to the rules of any contract market or involving the prices of such contracts, except under such terms and conditions as the Commission shall prescribe; if the transaction is or is held out to be of the character of, or is commonly known to the trade as, an \"option\", \"privilege\", \"indemnity\", \"bid\", \"offer\", \"put\", \"call\", \"advance guaranty\", or \"decline guaranty\".\n\n17 C.F.R. § 32.4:\n\nExemptions.\n\n(a) Except for the provisions of §§ 32.2, 32.8 and 32.9, which shall in any event apply to all commodity option transactions, the provisions of this part shall not apply to a commodity option offered by a person which has a reasonable basis to believe that the option is offered to a producer, processor, or commercial user of, or a merchant handling, the commodity which is the subject of the commodity option transaction, or the products or by-products thereof, and that such producer, processor, commercial user or merchant is offered or enters into the commodity option transaction solely for purposes related to its business as such.\n\n(b) The Commission may, by order, upon written request or upon its own motion, exempt any other person, either unconditionally or on a temporary or other conditional basis, from any provisions of this part, other than §§ 32.2, 32.8 and 32.9, if it finds, in its discretion, that it would not be contrary to the public interest to grant such exemption.\n\nWILLIAM J. CAMPBELL, Senior District Judge, concurring.\n\nAs noted by Judge Cudahy in his opinion, I stated at oral argument that I did not appreciate seeing two federal agencies expend their time and resources fighting a jurisdictional dispute in court. I believe their efforts would be more wisely spent in utilizing their expertise to reach a solution which they would jointly recommend to Congress. Much like cases in which two labor unions fight a jurisdictional dispute, I believe the situation imposed on the Courts by the SEC's headstrong approval of GNMA options trading represents inexcusable intransigence and misguided priorities. (The SEC could at least have waited for the memorandum on jurisdiction due from the CFTC.) Apparently my comments were heeded because subsequently the agencies reached an agreement which will result in the submission of certain proposed legislation to Congress. This course could and should have been pursued at the inception of this controversy and the courts ignored.\n\nHowever, the agencies initially chose to \"dig in\" and litigate the issue. They presented this court with a task of statutory interpretation which presents the complexity of the \"Gordian Knot\" and which, once having been submitted, must be resolved by the court. Not only are we expected to become expert in securities and commodities, master a complex mass of regulatory legislation and historical development, but we must also discern Congressional intent and apply it to a market of financial instruments which did not exist at the time the relevant legislation was enacted. The difficulty of the task would not disturb me if I did not perceive our role in this matter as inappropriate. The proper authority to resolve this matter is, of course, Congress. The fact that Chief Judge Cummings and Judge Cudahy were able to fashion coherent and expert solutions to the problem is not due to the suitability of the task to judicial resolution, but to the individual brilliance and dedication of those men. As is apparent from my vote, I find Chief Judge Cummings' approach more persuasive. Although it is a close and difficult issue, I do not intend by this concurring opinion to qualify in any way my adherence to it. Among other things, I note that Judge Cudahy attaches some weight to \"practical considerations\" such as the belated compromise of the agencies and the enforcement capabilities of the CFTC. If I were a legislator these considerations might be paramount, but as a judge faced with an issue of statutory interpretation I am restricted to a more limited ambit of considerations. As noted in footnote 8 of the majority opinion, it is clear that the agencies cannot, through a bilateral agreement, alter the jurisdictional limitations set by Congress. Additionally, the issue of the viability of the CFTC as a regulatory body was never raised in this proceeding, and even if it were, this Court has neither the resources nor the authority to address it.\n\nWhile the agencies did reach an agreement, that compromise did not eliminate the necessity of this Court resolving the jurisdictional issue. This could have been done by agreeing to stay further action on the GNMA options market until Congress enacted clarifying legislation.\n\nAs I have made clear, I believe this dispute should be resolved by Congress and, in the exercise of sound judgment, should never have been brought to this Court. If Congress now chooses to resolve the matter differently it will not necessarily mean that we have erred but that considerations alien to a statutory construction analysis prevailed. However, as the situation stands now, we are relegated the task of unravelling this \"Gordian Knot\"; Congress can simply cut it.\n\nI have written this concurring opinion not to chastise the parties in this suit, but to highlight an aspect of this case that I believe is important. I would hope that in the future, government agencies would exercise their judgment and discretion to work to resolve their disputes quickly, efficiently, and in the proper forum. Their paramount concern should be the public interest and not their own aggrandizement or the financial interest of private parties.\n\nCUDAHY, Circuit Judge, dissenting.\n\nI commend Chief Judge Cummings for putting to such exemplary use his abundant resources of scholarship and analysis on behalf of what might be in theory a rational and symmetrical outcome of this jurisdictional muddle. But I regret that his opinion for the majority fails at almost every turn to meet the tests of plain language, congressional intent, historical context and practical result. The opinion throws into disarray the agreement just reached between the CFTC and the SEC which would allow GNMA options trading to go forward forthwith on the CBOE. By reaching the extreme conclusion that the Securities Exchange Commission is without power under its own statutes to regulate options trading in what is incontestably a \"security\"-GNMA's-, the majority seems to have returned all parties to \"square one\" in this unseemly regulatory debacle.\n\nI.\n\nIn the first place, had Congress wished to confer exclusive jurisdiction over options on actual commodities (in contrast to options on futures contracts) on the CFTC, it could have explicitly incorporated the term \"options\" at an appropriate place in the exclusive jurisdiction clause (section 2(a)(1) of the CEA, 7 U.S.C. § 2). Congress did just that, for example, in referring expressly to an \"option\" involving any commodity as one of the species of transactions regulated by section 4c(b) of the CEA (enacted contemporaneously with the exclusive jurisdiction proviso). Instead Congress, in section 2(a)(1) of the Act, used language classically crafted to grant exclusive jurisdiction over the trading of commodity futures, including options on such futures, to the Commodity Futures Trading Commission.\n\nThe sharp distinction between Congress' non-inclusion of options on GNMA's and other underlying actuals\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e in the exclusive jurisdiction clause and their inclusion in the contemporaneous provisions of section 4c(b) is highlighted in the 1978 Senate Report, which reviewed what Congress had done in 1974:\n\nAs to the newly-regulated commodities, section 201 of the CFTC Act amended section 2(a)(1) of the Act to grant the Commission exclusive jurisdiction over options involving commodity futures contracts. In addition, section 402 of the CFTC Act added section 4c(b) of the Act (7 U.S.C. 6c(b)). That section permits options transactions involving the newly-regulated commodities, subject to Commission rules and regulations ....\n\nS.Rep.No.850, 95th Cong., 2d Sess. 59, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2147 (emphasis added). If, as the majority contends, the phrase \"options involving commodity futures contracts\" included options on actuals as well as options on futures contracts, then the \"(i)n addition\" language, with which the second sentence of the quoted paragraph begins, would make no sense.\n\nAs the legislative history of the CEA makes clear, Congress enacted the exclusive jurisdiction proviso of § 2(a)(1) so that trading in commodity futures, and related activities with a direct nexus to futures trading, such as discretionary futures accounts, and options on futures contracts, would be subject to regulation by the CFTC only.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e But the same rationale does not apply to options on actuals, which, unlike options on futures, do not have any necessary connection with futures trading. Options on GNMA securities were traded over-the-counter for at least five years prior to the initiation of GNMA futures trading,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e just as options on stocks have been traded for eight years on the CBOE without the existence of any futures trading in stocks. See SEC Record 399-401, 661-68. The existence of such an autonomous GNMA options market both before and after enactment of the 1974 CEA, renders extremely dubious any claim that Congress intended to put such options under the CFTC's exclusive jurisdiction in 1974. This history of over-the-counter trading also casts considerable doubt on the thesis that options on GNMA securities are among the \"commodity options\" regulated by sections 4c(b) and 4c(c) of the CEA. See Part V infra.\n\nThe current Chairman of the CFTC, in a 1975 article, flatly and succinctly rejected the majority's conclusion that the CFTC has exclusive jurisdiction over options on commodity/securities such as GNMAs.\n\nThe CFTC's exclusive jurisdiction ... (does) not extend to securities options such as those traded on the Chicago Board Options Exchange, since such options when exercised, do not result in the delivery of a futures contract.\n\nJohnson, The Perimeters of Regulatory Jurisdiction Under the Commodity Futures Trading Commission Act, 25 Drake L.Rev. 61, 68 (1975) (emphasis supplied).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Other commentators have consistently construed the CFTC's exclusive jurisdiction under section 2(a)(1) to reach options on futures, but not options on the underlying tangibles or intangibles. See, e.g., Bromberg, Commodities Law and Securities Law-Overlaps and Preemptions, 1 J.Corp.L. 217, 313 (1976); Long, Commodity Options-Revisited, 25 Drake L.Rev. 75, 132 (1975); Guttman, The Futures Trading Act of 1978: The Reaffirmation of CFTC-SEC Coordinated Jurisdiction over Securities/Commodities, 28 Am.U.L.Rev. 1, 30 (1978).\n\nThe majority's almost total reliance on the word \"involving\" in the exclusive jurisdiction clause to bear the crushing burden of options on actuals is to rest the Rock of Gibraltar on a toothpick. The phrase \"transactions involving contracts of sale of a commodity for future delivery\" is of ancient origin and established meaning. In the Grain Futures Act of 1922 the phrase \"(t)ransactions in grain involving the sale thereof for future delivery as commonly conducted on boards of trade\" was used to distinguish futures transactions from certain other grain transactions.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e This section of the Grain Futures Act of 1922 (derived from the Futures Trading Act of 1921) applied only to futures contracts and options on futures. See Trusler v. Crooks, 269 U.S. 475, 481-82, 46 S. Ct. 165, 166, 70 L. Ed. 365 (1926). Moreover, the policy declaration currently found in § 5 of the CEA, which has survived intact\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e since the Grain Futures Act of 1922, contains the precise \"involving\" construction found in the CFTC's exclusive jurisdiction clause.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Certainly, it is reasonable to assume that by using an existing phraseology, derived from old statutes of clear meaning, Congress in 1974 intended to encompass only the type of options transactions which had previously been regulated under the CEA and predecessor statutes.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAn additional reason for Congress to use the term \"involving\" (rather than the preposition \"in\") in the exclusive jurisdiction clause is that such a construction was necessary to comport with the clause's earlier reference to \"accounts\" and \"agreements.\" As the current Chairman of the CFTC has explained, the Senate Agriculture and Forestry Committee in 1974 modified the proposed exclusive jurisdiction clause to apply to \"accounts\" and \"agreements\" as well as transactions in futures contracts. \"This important change extended the Act to the activities surrounding trading, such as the regulation of so-called \"discretionary accounts' or \"discretionary agreements' common in futures trading, which had sometimes been treated as \"securities' in the courts.\" Johnson, The Commodity Futures Trading Commission Act: Preemption as Public Policy, 29 Vand.L.Rev. 1, 14 (1976).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The Senate language prevailed in the Conference Committee. With the addition of \"accounts\" and \"agreements,\" it was necessary, to achieve any semblance of precision, to employ the term \"involving,\" rather than the preposition \"in,\" and there is no suggestion in the legislative history that this choice of preposition somehow acted to extend the CFTC's exclusive jurisdiction to options on actuals in contrast to options on futures contracts. In fact, by specifying that the term \"agreement\" in § 2(a)(1) includes an \"option,\" Congress indicated that the complementary phrase \"transactions involving contracts of sale ... for future delivery\" did not. Any other reading would render Congress' express reference to \"option\" wholly redundant and would thus violate the fundamental maxim of statutory construction that \"a Legislature is presumed to have used no superfluous words.\" Platt v. Union Pacific R. R. Co., 99 U.S. 48, 58, 25 L. Ed. 424 (1878).\n\nA more fundamental problem with relying on the term \"involving\" to drag in options on the actual underlying commodity/security is that such a construction proves far, far too much. If, as the majority contends, trading in commodity options necessarily \"involves\" commodity futures, then all security options could become subject to the CFTC's exclusive jurisdiction as soon as anyone commenced futures trading in the underlying financial instrument. This is not merely a parade of horribles argument since at least one commodities exchange has applied for permission to trade futures in American Telephone and Telegraph Company bonds. 46 Fed.Reg. 30,844 (1981).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The Chicago Board of Trade itself has applied for designation as a contract market to trade averages of groups of corporate stocks. 46 Fed.Reg. 7042 (1981).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe majority of course, recognizes some of the pitfalls into which its \"involving\" argument must lead. It responds with tortured and unsupportable distinctions between exempt and nonexempt securities and traditional and nontraditional commodities. See ante at 1150-1152. These distinctions are not to be found in the CEA, and they simply do not withstand serious analysis. Moreover, the very need to manufacture such \"limits\" demonstrates the implausibility of the majority's reliance on the term \"involving\" to revolutionize (and unfortunately, to disrupt) the jurisdictional relationships among federal security and commodity regulatory agencies.\n\nAs a practical matter, the view of the majority that trading in GNMA options necessarily \"involves\" GNMA futures is purely speculative (no pun intended) and finds no support in the record. The SEC in this administrative proceeding found as a fact that options and futures were separate and distinct instruments and that GNMA options could be regulated separately from GNMA futures.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e We must accept these findings unless they are unsupported by substantial evidence. See 15 U.S.C. § 78y(a).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In any event, even the majority admits that futures contracts and options are legally and historically distinct instruments. Ante at 1139, 1151-1152. An option on a GNMA security imposes a duty to perform on only one party, the writer of the option. The holder of the option, by contrast, is under no obligation to exercise the option or enter into any later transaction, having acquired this right through payment of a premium. The unique feature of an options contract is the ability of its holder to limit any potential for loss to the amount of the premium paid for the option. See generally, Moriarty, Phillips \u0026 Tossini, A Comparison of Options and Futures in the Management of Portfolio Risk, Financial Analysts Journal 61, 62 (Jan./Feb. 1981). In direct contrast to this feature, each party to a futures contract assumes an unconditional obligation to perform.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e To be sure, parties trading either options or futures in organized markets will, in practice, generally enter into off-setting transactions to liquidate their positions prior to the expiration of the option or futures contract. The availability of an off-set market, however, cannot duplicate the unique function performed by the option in limiting the extent of the holder's possible loss. See, e.g., SEC Record 350, 438, 466. Anyone who has sold futures in a market which subsequently rises inexorably has no difficulty distinguishing a futures contract from an option. Moreover, both the courts and the CFTC have recognized that commodity options are not the same thing as commodity futures. See Precious Metals Associates, Inc. v. CFTC, 620 F.2d 900, 905 (1st Cir. 1980) (distinguishing between commodity options and commodity futures contracts); CFTC v. U.S. Metals Depository Co., 468 F. Supp. 1149, 1155 (S.D.N.Y.1977) (same); CFTC v. Crown Colony Commodity Options, Ltd., 434 F. Supp. 911, 913-14 (S.D.N.Y.1977) (same); Reauthorization of the Commodity Futures Trading Commission, Hearings Before the Senate Subcomm. on Agricultural Research and General Legislation of the Comm. on Agriculture, Nutrition and Forestry, 95th Cong., 2d Sess. 361-62 (1978) (same distinction made by the then Chairman of the CFTC).\n\nI am willing to presume that there is some economic linkage between GNMA options and GNMA futures. The price of both is presumably linked to the inflation rate, the size of the federal deficit, the Federal Reserve Board's growth target for the money supply, prospects for growth or decline in the economy, etc. I am also willing to concede that both options and futures may be used to \"shift risks\"-to permit those who hold GNMA's in inventory to shift the risk of price decline. But none of this tells me that options and futures must therefore be traded under the roof of the same exchanges or that such trading must necessarily be regulated by the same government agency. It is not for us to torture the plain language of statutes or ignore traditional regulatory arrangements merely because we perceive economic linkages or similarities in economic function among various financial instruments.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Presumably Congress has the benefit of these economic insights and may dispose as it sees fit. But certainly there is nothing in the record or elsewhere requiring the conclusion that GNMA options inextricably \"involve\" GNMA futures and that the regulatory scheme must be recast to reflect such an \"involvement.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe majority's reliance on the statement of the 1974 Senate Committee that \"the (CFTC's) jurisdiction over futures contracts markets or other exchanges is exclusive and includes the regulation of commodity accounts, commodity agreements and commodity options,\" ante at 1146, 1147, is similarly misplaced. This statement expressly limits the CFTC's exclusive jurisdiction to options and trading agreements on commodity futures contracts, since those are the only types of collateral transactions which take place on a futures contract market or other exchange subject to the CFTC's regulatory jurisdiction.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Any other reading of the statement would produce unintended and extreme results, since it would give the CFTC exclusive jurisdiction over any commodity/security transaction taking place on any security exchange, a construction which would presumably include accounts and agreements relating to the trading of actual GNMA certificates as well as GNMA options.\n\nNor does the fact, that Congress, in 1975 and 1978, rejected the SEC's attempts to abolish CFTC jurisdiction over all transactions in GNMA's (and other security/commodities) support the majority's broad \"involving\" theory. The SEC proposals rejected by Congress in 1975 and 1978 would have prohibited the CFTC from exercising jurisdiction over any transaction, including a futures contract, involving any security.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e See, e.g., Hearings on H.R. 10285 Before the Subcommittee on Conservation and Credit of the House Committee on Agriculture, 95th Cong., 2d Sess. Ser. No. 95-QQ187-88, 209 (1978) (statement of SEC Chairman Harold Williams); Hearings Before the Senate Subcommittee on Banking, Housing and Urban Affairs on § 249, 94th Cong., 1st Sess. 244 (1975). It was this withdrawal of CFTC jurisdiction over futures trading, including options on such futures contracts, that Congress was unwilling to countenance.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The majority's attempt to use this Congressional decision to support its thesis that Congress intended to vest the CFTC with exclusive jurisdiction over options on the underlying securities themselves finds no support in the statute or its legislative history.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The majority's citation of International Trading, LTD v. Bell, 262 Ark. 244, 556 S.W.2d 420, 425-26 is similarly inapposite since the court, in that case, was concerned solely with the CFTC's jurisdiction over options on commodity futures contracts.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nEqually damaging to the majority's interpretation of the subsequent legislative history of the CEA is the fact that at the same time Congress rejected the SEC's attempts to remove CFTC jurisdiction over futures trading in the newly developing security/commodities, it adopted amendments to the CEA specifically directing the CFTC to \"maintain communications\" with the SEC regarding the potentially overlapping jurisdiction of those two agencies. 7 U.S.C.A. § 41a(g)(2) (1980). If, as the majority contends, the CFTC possessed exclusive jurisdiction over the trading of security options as well as security futures, there would seem to be little purpose in requiring the two agencies to confer and cooperate on jurisdictional matters. Indeed, the 1978 House Conference Report, explaining the import of this amendment, noted that it \"requires the (CFTC) to maintain communication with the Department of the Treasury, the Board of Governors of the Federal Reserve System, and the SEC (in order) ... to consider the relationship between the volume and nature of investment and trading in futures, compared to securities and financial instruments within their jurisdiction.\" H.Conf.Rep. 1628, 95th Cong., 2d Sess. 17 (1978), reprinted in (1978) U.S. Code Cong. \u0026 Ad. News 2178 (emphasis added). Such a choice of wording clearly reflects Congress' continuing awareness that only investment and trading in financial futures falls within the exclusive jurisdiction of the CFTC. At the very least, this statutory directive evinces Congress' strong desire that the SEC and the CFTC consult and cooperate for the purpose of devising an acceptable sharing of jurisdiction over instruments in which both agencies possess an interest. It is precisely this statutorily mandated process of cooperation and consultation that the majority opinion now seeks to dismantle.\n\nII.\n\nThe legislative history of both the 1974 and the 1978 amendments to the CEA indicates that the SEC \"Savings Clause\" was designed to preserve SEC jurisdiction over all security options, including options on GNMAs. Perhaps the clearest indication of this Congressional intent is found in the Senate Report accompanying the 1974 Amendments:\n\nThe committee intends that options not be traded except on organized exchanges and in conformity with the rules and regulations of the Commission. However, the Commission would not have the authority to regulate trading in puts and calls for securities. Where traded on exchanges, these puts and calls are regulated by the Securities and Exchange Commission. Where traded among banks, they are regulated by the bank regulatory agencies.\n\n1974 Senate Report at 26, reprinted in (1974) U.S. Code Cong. \u0026 Ad. News 5866 (emphasis supplied).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOther portions of the 1974 Senate Report confirm Congress' clear desire to exempt from the CFTC's exclusive jurisdiction all trading in securities and security options not conducted on a commodity futures exchange. Thus, in its \"Section-By-Section Analysis\" of the 1974 Amendments, the Senate Report states:\n\nSection (2(a)(1) ) ... enlarges the definition of \"commodity\" ... and provides for the exclusive jurisdiction of the Commission over all futures transactions which are executed on domestic boards of trade. The Commission will have exclusive jurisdiction over options trading in commodities (but not in securities).\n\n1974 Senate Report at 31, reprinted in (1974) U.S. Code Cong. \u0026 Ad. News 5870 (emphasis added).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Similarly, the 1974 Conference Report explains:\n\nUnder the exclusive grant of jurisdiction to the (CFTC), the authority in the Commodity Exchange Act ... would preempt the field insofar as futures regulation is concerned.\n\nS.Rep.No.1194, 93d Cong., 2d Sess. 35 (1974) (emphasis added).\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nNotwithstanding this careful limitation of the CFTC's exclusive jurisdiction, and Congress' repeated assertions that section 2(a)(1) of the CEA was not intended to usurp the SEC's jurisdiction over securities and security options, several legislators remained concerned about possible unintended effects on SEC jurisdiction. In a final effort to allay this concern, both House Committee Chairman Poage and Senate Committee Chairman Talmadge made the following clarifying statement immediately prior to the vote on the 1974 CEA Amendments:\n\nI understand that there is some concern that, in effectuating the intent to fill regulatory gaps, the conference substitute appears to have an unintended impact on the jurisdiction of the Securities and Exchange Commission.\n\nThis misconception apparently has arisen because of certain provisions in (Section 2(a)(1) ) ..., in particular, the revised definition of commodities, the limited grant of exclusive jurisdiction to the Commodity Futures Trading Commission, and the reference to trading in futures contracts and options, not only on designated contract markets, but also on \"any other board of trade, exchange or market.\"\n\nI wish to emphasize that the words \"any other board of trade, exchange or market\" were included only for the purpose of giving the Commodity Futures Trading Commission jurisdiction over futures contracts purchased and sold in the United States and executed on a foreign board of trade, exchange or market. This grant of exclusive jurisdiction is not to be construed as preempting the jurisdiction of the Securities and Exchange Commission over securities, including stock options, traded on any national securities exchange or any other U.S. securities market.\n\nWith respect to the definition of commodities, it was intended to apply to a broader class of goods, articles, rights and interests than previously were subject to the Commodity Exchange Act. It was not intended, however, to apply to trading in interests and rights traditionally known as securities, including, for example, stocks, corporate bonds, warrants, and debentures; nor was it intended to apply to trading in options to purchase any of the foregoing.\n\n120 Cong. Rec. 34,736-37, 34,997 (1974) (emphasis added).\n\nThe majority quotes only the final paragraph of this statement and seeks to interpret Chairman Poage's reference to \"interests and rights traditionally known as securities\" as being limited to \"corporate stocks and the like.\" Ante at 1176-1177 n.22. Such an interpretation is resoundingly wrong. The corporate securities specifically enumerated by Chairman Poage were meant only as illustrative examples of the SEC's traditional jurisdiction and were not in any way intended as limitations.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Indeed, the current Chairman of the CFTC (then outside counsel to the CBOT) has himself described GNMA certificates as \"traditional securities.\" Johnson, The Commodity Futures Trading Commission Reauthorization Process: A View from the Trenches, 1974 Det.C.L.Rev. 1, 12. Even the majority does not argue that GNMA's are not \"securities,\" and it seems clear that as a species of mortgage, they are unarguably \"traditional.\" Moreover, the three paragraphs that precede Chairman Poage's reference to trading in traditional security interests underscore the carefully circumscribed boundaries of the CFTC's exclusive jurisdiction.\n\nFinally, the CFTC's previous statements of position indicate that it has traditionally viewed the SEC \"Savings Clause\" as restricting to direct regulation of the futures market its own jurisdiction over security/commodities such as GNMAs. In 1975, in response to an SEC challenge, the CFTC vigorously defended its exclusive authority to approve the trading of GNMA futures on the CBOT. At the same time, however, the CFTC was careful to note that it possessed jurisdiction over government backed security/commodities such as GNMAs \"solely with respect to futures trading in those instruments.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Indeed, until it prepared its amicus brief in the instant proceeding, the CFTC clearly believed that trading in GNMA options was excluded from the coverage of the CEA. Thus, although GNMA \"standby\" options\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e have long existed in the over-the-counter markets, the CFTC has never regarded them as being subject to the prohibitions of CEA sections 4c(b) or 4c(c).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e In its comments to the SEC regarding the CBOE options proposal, the CFTC expressly recognized the existence of the over-the-counter GNMA options market and stated that the proposed CBOE options market would be likely to result in more efficient pricing, greater liquidity, more streamlined clearing and delivery procedures, improved regulation and greater financial integrity than the existing GNMA standby options market.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Proposed CFTC Regulation 34.1, which would exempt from the \"options ban\" in CEA section 4c(c) and from Parts 32 and 33 of the CFTC Regulations \"any transaction in an option on exempted securities ... if conducted on a national securities exchange registered with and regulated by the SEC\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e merely confirms the CFTC's longstanding recognition of this jurisdictional limitation.\n\nIII.\n\nEven if it were not clear from the language of section 2(a)(1) and from the SEC \"Savings Clause\" that the CFTC's exclusive jurisdiction does not extend to the trading of security options on a national security exchange, a closely related provision of section 2(a)(1) demonstrates that the CEA cannot be read to prohibit the CBOE's proposed options program:\n\nNothing in this Act shall be deemed to govern or in any way be applicable to transactions in ... security warrants, security rights, ... government securities, or mortgages and mortgage purchase commitments, unless such transactions involve the sale thereof for future delivery conducted on a board of trade.\n\nThis exclusionary sentence-the so-called Treasury Amendment-was added to the CEA in 1974 at the request of the Department of the Treasury, which feared that absent such a clarifying amendment, the new provisions of the CEA might be construed to apply to forward trading and other kinds of transactions in government-backed financial instruments. See 1974 Senate Report at 51, reprinted in (1974) U.S. Code Cong. \u0026 Ad. News 5889. As the 1974 Senate Report makes clear, the Treasury Amendment was designed to establish beyond dispute that trading in the enumerated financial instruments would not be subject to CFTC jurisdiction \"unless such trading is conducted on a formally organized futures exchange.\" 1974 Senate Report at 23, reprinted in (1974) U.S. Code Cong. \u0026 Ad. News 5863. The 1978 Senate Report re-emphasized this point:\n\nWhen the 1974 amendment was being considered by Congress, the Treasury recommended that the role of the CFTC with respect to Government securities be limited to futures contracts sold on organized exchanges. Congress adopted this recommendation.\n\n1978 Senate Report at 47, reprinted in (1978) U.S. Code Cong. \u0026 Ad. News 2135 (emphasis added).\n\nThe CBOE's proposed GNMA options fall within the plain language of the Treasury Amendment. First, an option is a right to purchase or sell the underlying security; it is, in short, a \"security right( ).\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Second, every GNMA option represents a \"mortgage purchase commitment\"-that is, a commitment by the writer of the option to purchase (in the case of a put) or to sell (in the case of a call) the pools of mortgages represented by the underlying GNMA. Finally, GNMA securities are unquestionably \"government securities.\" Thus, transactions in GNMA options are \"transactions in ... government securities\" under the Treasury Amendment. The majority's suggestion that \"transactions in ... government securities\" covers only transactions in which the underlying securities change hands in flatly contradicted by the structure of this passage. The Treasury Amendment provides that the CEA shall not apply \"to transactions in ... government securities, ... unless such transactions involve the sale thereof for future delivery conducted on a board of trade.\" (emphasis supplied). If, as the majority contends, \"transactions in ... government securities\" referred only to the purchase and sale of the underlying financial instruments, then the clause \"unless such transactions involve the sale thereof for future delivery ...\" would be both superfluous and contradictory. As the majority opinion itself makes clear, the GNMA futures market, like the GNMA options market, \"may exist without any transactions in the commodity itself.\" Ante at 1154. See id. at 1139.\n\nThe majority also seeks to avoid the plain language of the Treasury Amendment by arguing that the Amendment was adopted by Congress \"only to prevent dual regulation by the CFTC and bank regulatory agencies of the banks and other sophisticated institutions that ordinarily trade in the enumerated financial instruments.\" Ante at 1154. While it is true that the Treasury Department advised Congress that trading in the enumerated instruments \"generally\" took place between banks and other sophisticated institutions,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e the plain language of the amendment is not qualified in any respect to limit its application to transactions among institutional participants. Where, as here, the language of a statute is unambiguous, we should not hesitate to give the words employed by Congress \"their ordinary and common meaning,\" Perrin v. United States, 444 U.S. 37, 42, 100 S. Ct. 311, 314, 62 L. Ed. 2d 199 (1979), at least absent \"rare and exceptional circumstances.\" Rubin v. United States, 449 U.S. 424, 430, 101 S. Ct. 698, 701, 66 L. Ed. 2d 633 (1981). In the instant case, neither the language of the CEA nor its legislative history supports the engrafting of a \"sophisticated institution\" limitation onto the Treasury Amendment.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIV.\n\nIn Part III of its opinion the majority reaches the startling conclusion that the SEC is without jurisdiction-under its own statutes-to regulate options trading in GNMA securities, a contention which, if true, would render the first two sections of the opinion entirely gratuitous. In the first place, this contention should not even be considered on this appeal, since it was not presented in the administrative proceedings before the SEC. Section 78y(c)(1) of the Securities and Exchange Act of 1934 (SEA), 15 U.S.C.A. § 78y(c)(1) (1980 Supp.), explicitly provides:\n\nNo objection to an order or rule of the Commission, for which review is sought under this section, may be considered by the court unless it was urged before the Commission or there was reasonable grounds for failure to do so.\n\nAlthough the CBOT, both on its own and through its attorneys, submitted extensive comments to the SEC regarding CBOE's proposed rule change, the CBOT never contended that the SEC lacked jurisdiction, under the SEA, to regulate trading in GNMA options.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Indeed the CBOT comments implicitly acknowledge the SEC's jurisdiction. See SEC Record 473-89, 530. Since the CBOT has sought review in this court pursuant to section 78y of the SEA, its failure to object to SEC jurisdiction before that agency should be fatal to any such consideration here. Sartain v. Securities and Exchange Comm., 601 F.2d 1366, 1371-72 (9th Cir. 1979); Berdahl v. Securities and Exchange Comm., 572 F.2d 643, 648-49 (8th Cir. 1978).\n\nIn any event, despite the strenuous labors of the majority to establish the quite novel proposition that the SEC is without jurisdiction to regulate the trading of GNMA options on a national securities exchange, this thesis simply cannot withstand analysis. Essentially the majority argues that an option to buy or sell GNMA's is not a \"security\" as defined in the Securities and Exchange Act. But the instruments on which the CBOE proposes to trade options are certainly securities evidencing an interest in a pool of federally-insured mortgages. See Davidson v. Dean Witter Reynolds, Inc., 478 F. Supp. 494, 495 (D.Colo.1979). Section 3(a)(10) of the SEA, 15 U.S.C. § 78c(a)(10) (1976), provides that the term \"security\" includes \"any note, ... bond, (or) debenture ...,\" and GNMA's fall squarely within this definition. By virtue of the guarantee by GNMA of timely payment of interest and principal, backed by the full faith and credit of the United States government, GNMA certificates are also within the definition of \"exempted securities\" in section 3(a)(12) of the SEA, 15 U.S.C. § 78c(a)(12) (1976).\n\nAlthough it is true that the SEC does not have regulatory authority over the registration of \"exempted securities,\" and that a number of provisions of the SEA do not apply to them, the SEC does possess considerable authority over the trading of exempted securities. Thus, the provisions of the SEA which authorize the SEC to regulate trading on national securities exchanges apply to all securities, including exempted securities such as GNMAs. See 15 U.S.C. § 78e (unlawful \"to effect any transaction in a security\" on an unregulated exchange); 15 U.S.C. § 78k(a) (regulation of \"any transaction\" on an exchange by its members); 15 U.S.C. § 78k(b) (regulation of exchange specialists and odd lot dealers); 15 U.S.C. § 78s(b)(c) (SEC power to review, abrogate, or amend exchange rules). Moreover, the general antifraud provisions of the SEA apply to the purchase or sale of \"any\" security, whether the transaction is effected on an exchange or in the over-the-counter market. SEA §§ 10(b), 15(c) (1); 15 U.S.C. §§ 78j(b), 78o (c)(1) (1976).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Indeed, the SEC has been actively involved in enforcing the anti-fraud provisions of the SEA in connection with the trading of exempted securities, including over-the-counter trading in GNMAs and optional GNMA standbys.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Since GNMA options are contracts to buy or sell GNMA securities, and since the SEC has extensive jurisdiction to regulate the trading of exempted securities, these factors alone strongly support SEC authority to approve the CBOE's proposed GNMA options program. See Blue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 95 S. Ct. 1917, 44 L. Ed. 2d 539 (1975).\n\nNot only does the SEC have the statutory authority to regulate the trading of exempted securities, it has exercised (and is currently exercising) that authority. Exempted securities are listed and traded on several national securities exchanges,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e and those exchanges have adopted specific rules relating to the trading of exempted securities.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The SEC has plenary authority over the adoption and amendment of such rules, and it has consistently and carefully exercised that authority.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nIn addition, the GNMA options to be traded on the CBOE are themselves securities. Such options clearly fall within the statutory definition of \"any instrument commonly known as a \"security.' \" See I L. Loss Securities Regulation 469 (2d ed. 1961). Moreover, the definition of security in section 3(a)(10) of the Securities Exchange Act expressly encompasses any \"warrant or right to subscribe to or purchase\" any security, which the courts have consistently construed to include \"call\" options on securities. See, e.g., Blue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 750-51, 95 S. Ct. 1917, 1932, 44 L. Ed. 2d 539 (1975); Mansbach v. Prescott, Ball \u0026 Turben, 598 F.2d 1017, 1026 n.40 (6th Cir. 1979); Lutgert v. Vanderbilt Bank, 508 F.2d 1035, 1038 (5th Cir. 1975); Lloyd v. Industrial Bio-Test Laboratories, Inc., 454 F. Supp. 807, 810-11 (S.D.N.Y. 1978).\n\nBy the same token, \"put\" options-the writers of which undertake a contractual obligation to buy an underlying security upon exercise by the option holder-have a similar status as securities under the Securities Exchange Act. Sections 3(a)(13) and 3(a)(14) of that Act define the \"purchase\" and \"sale\" of a security to include, respectively, \"any contract to buy, purchase or otherwise acquire\" and \"any contract to sell or otherwise dispose of.\" As the Supreme Court has explained,\n\nthe holders of puts, calls, options and other contractual rights or duties to purchase or sell securities have been recognized as \"purchasers\" or \"sellers\" of securities * * * because the definitional provisions of the 1934 Act themselves grant them that status.\n\nBlue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 751, 95 S. Ct. 1917, 1932, 44 L. Ed. 2d 539 (1975) (emphasis supplied). Moreover, lower courts and commentators have consistently indicated that both put and call options on securities fall within the broad definition of securities under section 3(a) (10) of the SEA. Mansbach v. Prescott, Ball \u0026 Turben, 598 F.2d 1017, 1026 n.40 (6th Cir. 1979) (definition of security in section 3 of SEA \"clearly includes options to purchase or sell stock\"); Savino v. E.F. Hutton \u0026 Co., 507 F. Supp. 1225, 1235 (S.D.N.Y.1981) (stock options purchased and sold by defendants \"undoubtedly constituted \"securities' within the meaning of the federal securities' laws\"); Globus, Inc. v. Jaroff, 271 F. Supp. 378, 380 (S.D.N.Y.1967) (\"It is axiomatic ... that an option agreement is a security under the 1934 Act\"); I L. Loss, Securities Regulation 469 (2d ed. 1961) (both put and call options are subsumed under \"interest or instrument commonly known as \"security' \" in statutory definition). See also SEC Rule 3a11-1, 17 C.F.R. § 240.3a11-1 (1980) (defining the term \"equity security\" as including \"any put, call, straddle, or other option or privilege\").\n\nCommon sense strongly suggests that an option to buy or sell an interest in a pool of mortgages (traditional \"securities\" of impeccable credentials) must be a security by any reasonable test. I see no reason to pursue the question (which the majority harries around every twist and turn) whether options on GNMAs are \"investment contract\" securities (contemplating investment in a common enterprise with an expectation of profits). The essential flaw in the majority's analysis at this point is its failure to distinguish between options (and other transactions) relating to non-security commodities, which transactions may or may not qualify as \"investment contract securities\" for purposes of the SEA, and options on financial instruments such as GNMAs, in which the underlying \"commodity\" is incontestably a \"security\" within the meaning of the Securities Acts.\n\nThe majority's reliance on Teamsters v. Daniel, 439 U.S. 551, 99 S. Ct. 790, 58 L. Ed. 2d 808 (1979) and Marine Bank v. Weaver, 455 U.S. 551, 102 S. Ct. 1220, 71 L. Ed. 2d 409 (1982), to support the proposition that \"the context requires the GNMA options are not securities\" is similarly misplaced. In both Daniel and Weaver, the question before the Supreme Court was whether certain \"non-market\" financial interests fell within the definition of a \"security\" under the SEA.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e In the instant case, unlike Daniel and Weaver, there is no doubt that the underlying instrument-a GNMA-is itself a \"security.\" The only question is whether a particular derivative of that instrument-a GNMA option-is equally a security. Hence, in the present case, unlike Daniel and Weaver, where the share of the pension plan and the bank certificate of deposit, respectively, were not derived from an admitted \"security,\" we are concerned with something that is, at the very least, intimately tied to securities trading. One might well call one's broker to trade a GNMA option but surely not a pension plan share or a certificate of deposit.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nIn addition, in both Daniel and Weaver the Supreme Court relied heavily on the presence of an alternative \"comprehensive\" regulatory framework, governing the precise interest or instrument over which the SEC was attempting to assert jurisdiction. In the instant case, by contrast, as the majority itself points out, the \"alternative\" system of regulation has, in fact, authorized only the trading of GNMA futures and options on such futures; it does not purport to regulate options trading in the underlying GNMAs. See ante at 1144 \u0026 nn.13, 15. Indeed by its transmittal to Congress of proposed Exemptive Rule 34.1, the CFTC has indicated that it has neither the expertise nor the desire to regulate the trading of GNMA options on a national securities exchange. See note 30 supra. The \"contextual\" analysis employed by the Supreme Court in Daniel and Weaver is thus of little relevance to the instant case.\n\nV.\n\nHaving determined that trading in GNMA options does not fall within the exclusive jurisdiction of the CFTC, and that both GNMAs and GNMA options are clearly \"securities\" within the meaning of the SEA, the final question to be considered is whether sections 4c(b) and 4c(c) of the CEA give the CFTC the power to ban the trading of GNMA options on a national security exchange. By the majority's own logic, the answer must be \"No.\" The SEA \"Savings Clause\" contained in CEA § 2(a)(1) states that \"except as hereinabove provided, nothing contained in this section shall (limit the jurisdiction of the SEC).\" The language \"hereinabove provided\" refers specifically to the CFTC's exclusive jurisdiction clause and does not include the broad definition of \"commodity\" found in § 2(a)(1). See ante at 1145. Since the definition of \"commodity\" is \"in this section\" but not \"hereinabove provided,\" that definition cannot limit SEC jurisdiction. Thus, the expanded definition of commodity, which is incorporated in §§ 4c(b) and 4c(c), cannot be used to invalidate the SEC rule at issue here.\n\nI could be content with this logic (favored by the majority), which shuts the door tight on the CFTC. Alternatively, one could reach the same result via a plain-language interpretation of the Treasury Amendment. See p. 1178 supra. But even if we were to forego the majority's logic, and recognize the application of §§ 4c(b) and 4c(c) to the instant problem, we would come out at the same place as a practical matter. The CFTC has now carried out the mandate of these sections by authorizing the SEC to regulate options trading on the CBOE and other security exchanges. On February 19, 1982, pursuant to its authority under sections 4c(b), 4c(c), and 8a(5)\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e of the CEA, the CFTC submitted to Congress Proposed Rule 34.1 which, \"if adopted, would exempt from the prohibition of section 4c(c) and from Parts 32 and 33 of the (CFTC) Regulations, any transactions in an option on exempted securities, certificates of deposit, and foreign currency if conducted on a national securities exchange registered with and regulated by the SEC.\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Thus, if the CFTC has concurrent jurisdiction over trading in GNMA options by virtue of § 4c(b) or 4c(c), it has exercised that jurisdiction to clear the way for SEC regulation.\n\nVI.\n\nDuring oral argument of this case, Judge Campbell announced in no uncertain terms his view that, instead of cluttering the docket of this court, the SEC and the CFTC should carry out their statutory mandate to resolve among themselves any jurisdictional conflicts. They have now resolved their differences in a way which is consistent with almost any decision by us except the strained conclusion of the majority that the CFTC has exclusive jurisdiction and the SEC is wholly without jurisdiction to regulate the trading of GNMA options. Not only have we done our best to frustrate the efforts of the concerned regulatory agencies at compromise, but we have managed to conclude that an agency of long experience and high reputation must fully abandon its field of expertise in favor of a new and relatively untested regulatory body of uncertain prospects.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e As a practical matter, we have determined that the jurisdiction of the SEC is frozen and capped, and that the regulation of options trading on a host of newly developing security/commodities will fall to the exclusive jurisdiction of the CFTC.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Perhaps all of this will have a happy ending (and a warm reception from Congress). My own surmise is that the strained analysis of the majority will gain no more attractive practical result in the real world than it has achieved conceptual triumph in the world of theory.\n\nI therefore respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e* The Honorable William J. Campbell, Senior District Judge for the Northern District of Illinois, is sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Yet another GNMA derivative, options on GNMA futures, may soon be traded under new rules of the CFTC. See 46 Fed.Reg. 54500 (Nov. 3, 1981). The holder of an option on GNMA futures has the right, until a specified date, to buy from or sell to the option writer a futures contract in GNMA's. When the holder exercises such an option, he purchases (or sells) a futures \"position\" rather than the actual GNMA's. Although CFTC jurisdiction to permit trading in these instruments is undisputed and the SEC has not attempted to exercise jurisdiction with respect to them, options on commodity futures will be involved in arguments concerning statutory construction infra. Options on the underlying commodity are sometimes distinguished from options on commodity futures by an adjective such as \"actual,\" \"physical\" or \"tangible\" (e.g., \"option on actual commodity\"), see, e.g., 46 Fed.Reg. 54501; 120 Cong. Rec. 34737 (remarks of Rep. Poage), but we shall not adopt that convention. In this opinion, \"commodity option\" will mean an option on the underlying commodity and nothing else. For a lucid introduction to commodity futures trading and its impact on commodity production and consumer prices, see Greenstone, The CFTC and Government Reorganization: Preserving Regulatory Independence, 33 Bus. Law. 163, 164-177 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Much of the division between futures and options trading has been fortuitous. In the beginning, both futures and options were regulated together under the Future Trading Act of 1921. The two were then cast asunder in 1922 by the Supreme Court decision of Hill v. Wallace, 259 U.S. 44, 42 S. Ct. 453, 66 L. Ed. 822, which by happenstance invalidated only the futures portion of the 1921 Act. Following reenactment of the futures regulation in the Grain Futures Act of 1922 and invalidation in 1926 of the 1921 options remnant by Trusler v. Crooks, 269 U.S. 475, 46 S. Ct. 165, 70 L. Ed. 365, futures and options regulations were rejoined within the Commodity Exchange Act of 1936. For some 30 years, futures and options led a happy life together; futures being perceived as the legitimate hedging and price-discovery vehicle and options as the farmer-feared device of reckless speculators. Then the Board of Trade, long known as the premier commodity market, Chicago Board of Trade v. Olsen, 262 U.S. 1, 33, 43 S. Ct. 470, 476, 67 L. Ed. 839, decided to begin trading in securities derivatives. In its submissions to the SEC, the Board of Trade explained: The CBOE itself, the nation's first central market for securities options, evolved from an effort by the Chicago Board of Trade in the late 1960's to develop futures contracts in securities. At that time, however, such activity did not fall within the Commodity Exchange Act, the statute governing other Chicago Board of Trade activity. As a result, the plan was modified to qualify it as an options program under the Federal securities laws. Had the plan emerged after the 1974 amendments to the Commodity Exchange Act, when the term \"commodity\" was broadened to encompass securities and the CFTC was awarded exclusive regulatory jurisdiction, the Chicago Board of Trade could have retained its original objective of trading securities futures contracts on its own floor under the same statute-the Commodity Exchange Act-governing its other activities. The divergence of securities options trading from futures trading was fortuitous, therefore, due to a state of the law at the time that no longer applies. SEC Record 484. As will be explained infra, under the current statutes GNMA futures and options are to be regulated by a single agency, the CFTC, and we are setting aside the SEC's attempt to separate their regulation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Relevant statutory provisions are set forth in the Appendix.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Regarding the Board of Trade's standing to sue, see Hill v. Wallace, 259 U.S. 44, 61, 42 S. Ct. 453, 455, 66 L. Ed. 822 (since unconstitutional \"act, if enforced, (would) seriously injure the value of the Board of Trade to its members, and the pecuniary value of their memberships, * * * it was the duty of the Board of Directors to bring an action to resist (the act's) enforcement\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The underlying question of SEC jurisdiction over GNMA options was raised to the SEC by the Board of Trade, SEC Record 479-489, 530, and the CBOE also recognized the jurisdictional question, which it characterized first as \"which possible new options products (including GNMA options) appropriately fall within the Commission's jurisdiction and which, instead, come within the jurisdiction of the Commodities Futures Trading Commission (sic )\" and then again as \"whether options on what every one concedes is a security * * * are appropriately subject to the Commission's jurisdiction rather than that of some other agency * * *.\" SEC Record 283, 284. The latter characterization is precisely the question that the Board of Trade is raising, although the corresponding sections of the Securities Exchange Act are not cited. See also Comment Letter of Mortgage Bankers Ass'n of America, SEC Record 434 (\"the proposed contract represents a departure from the equity-based options contracts with which the SEC is familiar and hence requires regulators to venture into a new and technically quite different arena\"). Of course it would be irrelevant that other interested parties were more emphatic than the Board of Trade at raising the issue of the SEC's authority under the Securities Exchange Act over GNMA options. Wilson \u0026 Co. v. United States, 335 F.2d 788, 794 (7th Cir. 1964). Unfortunately, we are lacking the CFTC's comments to the SEC on jurisdiction. The CFTC had \"directed its Office of General Counsel to prepare a legal memorandum on this subject for submission to the Commission (SEC) in the near future,\" SEC Record 630 (Feb. 10, 1981), but the SEC approved the CBOE rule changes on February 26, 1981-too quickly for the memorandum to be finished.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Because of our disposition of this appeal based on the above provisions of the Commodity and Securities Exchange Acts we need not consider the Board of Trade's further assertions that the SEC failed to give sufficient consideration to (1) whether the proposed options would entail \"transactions involving contracts of sale of a commodity for future delivery\" within Section 2(a)(1) of the Commodity Exchange Act, 7 U.S.C. § 2, and (2) whether the proposed option transactions are transactions \"involving the prices of (futures) contracts\" prohibited by a CFTC regulation, 17 C.F.R. § 32.2(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Two related cases are also pending before this Court. The first, No. 81-2587, is the Board of Trade's petition for review of an SEC order approving rules of the Options Clearing Corporation (the CBOE's clearing house) that would empower it to issue GNMA options and to clear and settle GNMA options transactions and exercises of GNMA options. A second pending petition, No. 82-1097, was brought by the Board of Trade and the Chicago Mercantile Exchange to review an SEC order approving rule changes of the CBOE and American Stock Exchange that would allow trading on the latter of offset options contracts in Treasury bonds, notes, and bills. Unless the parties thereto can convince us otherwise by their briefs, No. 81-2587 is controlled by this decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. While this case was pending, the CFTC and SEC filed with us a copy of a news release announcing their provisional agreement purportedly resolving the jurisdictional dispute at issue in this case. The jurisdictional agreement has not made the case moot, however. Although Congress has provided that the CFTC \"maintain communications\" with the SEC regarding CFTC activities that \"relate\" to SEC responsibilities, 7 U.S.C. § 4a(g)(2), and that the CFTC \"may cooperate\" with the SEC, 7 U.S.C. § 16(a), the two agencies cannot thereby enlarge or relinquish their statutory jurisdictions. Atchison, Topeka and Santa Fe Ry. v. I.C.C., 607 F.2d 1199, 1203 (7th Cir. 1979); Fort Pierce Utilities Authority v. United States, 196 U.S. App. D.C. 79, 606 F.2d 986, 995 (D.C.Cir.1979), certiorari denied, 444 U.S. 842, 100 S. Ct. 83, 62 L. Ed. 2d 54. As noted by the dissent, Judge Campbell especially would have preferred not to decide a jurisdictional turf fight between two federal agencies and their constituents. Nevertheless we cannot allow the CFTC and SEC to reapportion their jurisdictions in the face of a clear, contrary statutory mandate. \"(T)he role of the agencies remains basically to execute legislative policy; they are no more authorized than are the courts to rewrite acts of Congress.\" Talley v. Mathews, 550 F.2d 911, 919 (4th Cir. 1977) (overturning the Secretary of HEW's ruling because \"in view of the plain language of the Act, (the ruling) is unduly restrictive of his own jurisdiction\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Onions were excepted from the amended definition pursuant to Pub.L. 85-839, § 1, 72 Stat. 1013 (1958) (codified at 7 U.S.C. § 13-1), which prohibited all trading in onion futures. Congress had passed the prohibition following complaints by onion producers that price fluctuations in the futures market adversely affected the cash price of onions. See S.Rep.No.1631, 85th Cong., 2d Sess. (1958); H.R.Rep.No.1036, 85th Cong., 1st Sess. (1957), reprinted in (1958) U.S.Code Cong. \u0026 Ad.News 4210-4215. But see Precious Metals Associates v. CFTC, 620 F.2d 900, 905 n.8 (1st Cir. 1980) (suggesting a physiological basis for the onion producers' crying).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The long-standing ban against trading options on the \"old\" (agricultural) commodities listed in CEA § 2(a)(1), 7 U.S.C. § 2, was continued under Section 4c(a), 7 U.S.C. § 6c(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As mentioned above, GNMA's had been a commodity since 1975. Congress was clearly aware at the time it enacted Section 4c(c) that GNMA's were a commodity and it made no distinctions among commodities in imposing the options ban. See, e.g., S.Rep.No.850, 95th Cong., 2d Sess. 13, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2101: Recent experience also supports the wisdom of Congress' decision in 1974 to expand the scope of commodities that could become the subject of regulated futures trading. Futures contracts based on these new commodities have enjoyed a rapid expansion. In fact, futures contracts on financial instruments-short term commercial paper, mortgaged-backed certificates guaranteed by the Government National Mortgage Association, Treasury bonds and Treasury bills-are among the most active new contracts currently traded. Many hedgers, including banks, businessmen, and home builders are attracted to these futures contracts as a method for planning their enterprises by ensuring against sudden and expensive decreases in value of the instruments used to finance their commercial operations. This experience establishes that the substantive economic value of futures trading is the same for a farmer, a manufacturer, or a financial institution. Participants in the futures markets utilize the hedging or risk-shifting element of futures contracts, whether the contracts involve soybeans or GNMA's.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The CFTC regulations and the Congressional options ban exempted a limited class of off-exchange options trading between mortgage bankers and other GNMA producers known as the GNMA \"standby\" market. 17 C.F.R. § 32.4; 7 U.S.C. § 4c(c) (proviso). The dissent notes that the CFTC exemption in Section 32.4 is qualified with the following introductory language: \"Except for the provisions of §§ 32.2, 32.8 and 32.9, which shall in any event apply to all commodity option transactions * * *.\" Section 32.2(b), in particular, provides that options \"involving the prices\" of commodity futures contracts are prohibited \"except under such terms and conditions as the Commission (CFTC) shall prescribe.\" Therefore, the dissent argues, the producer exemption of Section 32.4 (which specifically applies to options such as the GNMA \"standbys\") is inapplicable to GNMA standbys because they are \"absolutely prohibited\" under Section 32.2(b). On the contrary, we think that the \"terms and conditions\" that Section 32.2(b) addresses are fulfilled when the GNMA standbys meet the test of Section 32.4, since otherwise Section 32.4 would have no exempting effect at all. Most likely, in placing a Section 32.2 exception at the head of the Section 32.4 producer exemption, the CFTC was concerned with maintaining the absolute prohibition against options on agricultural commodities of Section 32.2(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The CFTC has met the prerequisites of Section 4c(c) to allow trading of options on GNMA futures. On September 8, 1981, the CFTC adopted regulations to govern a pilot program of trading in certain commodity transactions. 46 Fed.Reg. 54500 (Nov. 3, 1981). The new program and supporting memoranda were submitted to Congress as required by Section 4c(c), and the specified time period for Congressional objection has expired. See 46 Fed.Reg. 54570 (Nov. 3, 1981). The CBOE erroneously argues that the trading ban of Section 4c(c) is thereby lifted with respect to GNMA options. The statutory ban on entering into any particular commodity option transaction is lifted only when \"(1) the Commission (CFTC) transmits to the House Committee on Agriculture and the Senate Committee on Agriculture, Nutrition, and Forestry documentation of its ability to regulate successfully such transactions, including a copy of the Commission's proposed rules and regulations, and (2) (upon) the expiration of thirty calendar days of continuous session of Congress after the date of such transmittal.\" CEA § 4c(c), 7 U.S.C. § 6c(c). The question raised by the CBOE, then, is whether GNMA options are among the transactions that were impliedly approved by Congress when the CFTC submitted its pilot program of September 8, 1981. We regard the new regulations themselves to be the principal evidence of what transactions the CFTC claimed to be able to regulate and thus what transactions Congress approved. By its new Section 33.4, the CFTC's pilot program is limited to options on commodity futures. See 46 Fed.Reg. 54530 (Nov. 3, 1981). Similarly, the memorandum submitted to Congress in support of the CFTC's regulatory ability and CFTC Chairman Philip McBride Johnson's testimony before the House Subcommittee on Conservation, Credit and Rural Development were limited to CFTC regulation of options on commodity futures. Therefore the CFTC has not demonstrated nor has the Congress passed over the CFTC's ability to regulate commodity options, and the ban of Section 4c(c) remains. On February 16, 1982, the CFTC proposed for adoption a new regulation that purportedly \"would remove any possibility that the prohibitions in Section 4c(c) and CFTC Rule 32.11 (17 C.F.R. § 32.11) as well as Parts 32 and 33 of the CFTC's regulations would impede trading in options on exempted securities on national securities exchanges subject to regulation by the SEC.\" 47 Fed.Reg. 7677, 7678 n.2 (Feb. 22, 1982). The proposed regulation was submitted to the appropriate Congressional committees on February 19, 1982, and the CBOE has argued that the ban on GNMA options trading will be lifted should Congress take no action for the required thirty days of continuous session. The proposed regulation apparently does not, however, comply with the requirements for lifting the options ban of Section 4c(c). The proposed regulation states: s 34.1 Commodity Option Transactions on Exempted Securities, Certificates of Deposit and Foreign Currencies The provisions of Parts 32 and 33 of this chapter shall not apply to any commodity option transaction involving an option on any exempted security, (such as a GNMA certificate,) * * * that is traded on a national securities exchange registered with the Securities and Exchange Commission * * *. The proposed regulation evidently would only relinquish CFTC jurisdiction in favor of the SEC and would not, as Section 4c(c) requires, document the CFTC's ability to regulate options on exempted securities. Of course, the CFTC has not adopted this regulation and the required period for implied Congressional approval has not elapsed. We need not decide whether the options ban would be lifted because the CBOE argument is premature. The CBOE's motion to dismiss the petition as moot is therefore denied. To recapitulate, the Board of Trade trades GNMA futures and the CFTC has recently adopted a pilot program that will allow trading in options on GNMA futures, but the options ban is still in place regarding GNMA options.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In particular, the proposed trading would have violated 17 C.F.R. § 32.11, which prohibited all commodity options trading with only limited exceptions for merchants in the underlying commodity during the course of their business, 17 C.F.R. § 32.4(a), and for special cases of the public interest as determined by the CFTC. 17 C.F.R. § 32.4(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See, e.g., new § 33.4, 46 Fed.Reg. 54530 (Nov. 3, 1981) (limiting options trading to \"options on contracts of sale for future delivery\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Possibly \"provided\" could be given its ordinary meaning as anything at all that Congress has set down into legislation, rather than the special meaning of referring to proviso clauses. In particular, Congress might be deemed to have \"provided\" the CFTC with a broad definition of commodity. The SEC savings clause would then be limited to derogations of SEC jurisdiction that accrue within Section 2(a)(1) but typographically below the text of the savings clause itself. Since the only portions of Section 2(a)(1) that potentially intrude on SEC jurisdiction-the definition of commodity and the exclusive jurisdiction clause-are both located above the savings clause, the savings clause would become superfluous under this reading of \"provided.\" That is, the SEC would retain whatever jurisdiction the CFTC did not take away, with or without the savings clause. The maxim of construing each part of a statute to mean something and our understanding that Congress meant to safeguard traditional SEC jurisdiction, however, impel us to impart to the SEC savings clause the meaning given in the text. See Philip F. Johnson, The Commodity Futures Trading Commission Act: Preemption as Public Policy, 29 Vand.L.Rev. 1, 13-15 (1976) (arguing that \"except as hereinabove provided\" was added by Congress only in order to reconcile the exclusive jurisdiction and savings clauses); Greenstone, The CFTC and Government Reorganization: Preserving Regulatory Independence, 33 Bus.Law. 163, 208-209 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. For example, the so-called \"Treasury amendment\" of Section 2(a)(1), 7 U.S.C. § 2, distinguishes \"transactions in\" from \"transactions involving.\" See page 1154 infra. Similarly, the definition of commodity was expanded to include \"all other goods and articles, except onions * * *, and all services, rights, and interests in which contracts for future delivery are presently or in the future dealt in * * *.\" Pages 1142, 1143 supra (emphasis added). See also 7 U.S.C. § 6c(a)(B) (\"transaction involving any commodity\" useful for hedging and price-discovery includes \"option\"); 7 U.S.C. § 13(e) (\"transaction in commodity futures,\" \"transaction in an actual commodity,\" and \"transaction of the character of * * * an option\" distinguished). The dissent argues that we put too much stress upon prepositions with this analysis. The dissent has invented another explanation for Congress' use of the word \"involving\" (none of the parties were so clever): that although the preposition \"in\" might be fine for connecting \"transactions\" to \"contracts of sale of a commodity for future delivery,\" \"involving\" was grammatically the better connector for \"accounts\" and \"agreements.\" Dissent pages 1170-1171. But given the choice of drawing meaning from Congress' use of different terms or supposing that Congress drafted the statute imprecisely for the sake of grammar, we have chosen the former. The dissent also seems to argue that by placing the CFTC's authority to make options regulations and the options ban in a separate Section (4c) from the exclusive jurisdiction clause (2(a)(1)), Congress must not have intended the CFTC's options authority to be exclusive. Dissent page 1169. It does not seem \"nonsensical\" to us, however, that Congress delimited the CFTC's exclusive jurisdiction over all commodity transactions in one Section, while putting special controls on options trading in another Section. Options transactions were given special attention in a separate section because they historically had been abused and because the Congress chose to treat options on \"old\" commodities, options on \"new\" commodities, and trade options differently. Compare CEA § 4c(a), (b), and (c) (proviso), 7 U.S.C. § 6c(a), (b), and (c) (proviso). That options regulation is centered generally in Section 4c is hardly probative of the scope of CFTC exclusive jurisdiction regarding options just because the latter is in a different Section of the statute. Similarly, there is little probative to the scope of CFTC exclusive jurisdiction from Congress' using different standards in Sections 2(a)(1) (\" \"option' * * * involving contracts of sale of a commodity for future delivery\") and 4c(b) (\"any transaction * * * involving any * * * commodity which is of the character of, or is commonly known to the trade as, an \"option' \"). It is quite \"sensible\" to us that the CFTC's exclusive jurisdiction over commodity options should be more limited than its general, nonexclusive commodity options powers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Mr. Johnson, who has since become Chairman of the CFTC, reasoned later in his article that because \"options, when exercised, do not result in the delivery of a futures contract,\" they are not within CFTC exclusive jurisdiction. 29 Vand.L.Rev. at 15 n.45. Mr. Johnson thus supposed at one point that only options on futures are within the CFTC's exclusive jurisdiction, but he could cite no authority for this mistaken proposition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See S.Conf.Rep.No.1194, 93d Cong., 2d Sess. 35 (1974); H.Conf.Rep.No.1383, 93d Cong., 2d Sess. 35, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5894, 5897.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The identical language was reiterated in the House and Senate Conference Reports S.Conf.Rep.No.1194, 93d Cong., 2d Sess. 35 (1974); H.Conf.Rep.No.1383, 93d Cong., 2d Sess. 35, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5894, 5897. The dissent quotes language from these reports stating that CFTC jurisdiction preempts State law regulating futures trading, see dissent page 1176, but that is irrelevant here. See also 120 Cong.Rec. 34737 (1974) (remarks of Rep. Poage) (emphasis added): (Considering the) broad category of arrangements and contracts relating to investments (called \"investment contracts,\") there may be some apparent overlap between the jurisdiction of the Securities and Exchange Commission and the intended jurisdiction of the Commodity Futures Trading Commission over trading in futures contracts relating, or purporting to relate, to tangible commodities. It was not intended that the jurisdiction of the Securities and Exchange Commission with respect to investment contracts be superseded, except to the extent that jurisdiction is granted to the CFTC with respect to contracts for future delivery or options relating, or purporting to relate, to tangible commodities * * *. See note 1 supra regarding meaning of the phrase \"tangible commodity.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. For example, in its new regulations governing the pilot program for options on commodity futures, the CFTC has defined \"commodity option\" to include both options and options on futures. See new § 1.3(hh), 46 Fed.Reg. 54516 (Nov. 3, 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Senate Committee's failure to state explicitly that preserved SEC jurisdiction over \"securities\" should be read expansively is telling because there is also some language in the CEA legislative history to support the Board of Trade's argument that Congress intended to preserve only SEC authority over \"traditional\" corporate stocks and the like. For example, House Committee Chairman Poage stated on the House Floor: With respect to the definition of commodities, it was intended to apply to a broader class of goods, articles, rights and interests than previously were subject to the Commodity Exchange Act. It was not intended, however, to apply to trading in interests and rights traditionally known as securities, including, for example, stocks, corporate bonds, warrants, and debentures, nor was it intended to apply to trading in options to purchase any of the foregoing. 120 Cong.Rec. 34737 (1974) (emphasis added). See also 120 Cong.Rec. 34997 (1974) (identical remarks of Senate Committee Chairman Talmadge). Similarly, during the 1978 amendments to the CEA, the Senate Committee on Agriculture, Nutrition, and Forestry defused concern over expanding CFTC jurisdiction as follows: In order to avoid duplication and confusion in the regulation of futures trading, the Commission created by the 1974 Act was given exclusive jurisdiction over all accounts, agreements (including options) and transactions involving futures contracts. Futures contracts are not written on individual industrial equities. Put and call options to sell or purchase individual exchange-traded industrial equities are now traded on securities exchanges. Regulation of these options is under the jurisdiction of the SEC, which regulates the exchanges on which these options are traded and oversees a comprehensive system of disclosure by the issuers of the underlying industrial equities. S.Rep.No.850, 95th Cong., 2d Sess. 21-22, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2109-2110. GNMA's are not traditional, industrial stocks. See pages 1150, 1157 nn.40-41, 1159-1160 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Likewise, in a 1975 letter cited by the dissent (pages 1151-1153), the CFTC had been given no reason to consider the issue in this case. See (1975-1977 Transfer Binder) Comm.Fut.L.Rep. (CCH) P 20,117, at 20,834-20,835 (1975). In that letter, the CFTC stated that its exclusive jurisdiction over instruments such as GNMA's was \"solely with respect to futures trading in those instruments.\" But this statement was made only to show that it had no interest in regulating the underlying \"cash market,\" not to show that it thought it had no power over other commodity derivatives which were \"with respect to (pre-existing) futures trading.\" Compare 41 Fed.Reg. 51808 (Nov. 24, 1976) (\"The authority granted to the Commission (CFTC) to regulate commodity option transactions is extremely broad.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The letter refers to \"continuing jurisdiction\" because at the time it was written, February 14, 1975, the 1974 amendments to the CEA had not gone fully into effect. Pub.L. 93-463, § 418 (1974). Thus the SEC Chairman correctly anticipated some displacement of what he believed to be pre-existing SEC authority over options trading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In a letter from the SEC Chairman to Senator Leahy, the former specifically \"recommended that the SEC be granted jurisdiction over futures and options trading on any security * * *.\" S.Rep.No.850, 95th Cong., 2d Sess. 21, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The dissent suggests what it considers to be several \"illegitimate\" commodities (e.g., American Telephone and Telegraph bonds), but we need express no opinion here on that suggestion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See, e.g., SEC Record 350 (when quantity to be hedged is unknown, options preferred), 365-366 (futures are \"not a consistently useful vehicle for hedging the risks present in the conventional loan origination market\"), 426-427 (\"mandatory aspect\" of the futures contract undesirable). This would not be the first time, however, that Congress has frustrated would-be options traders out of concern for its larger constituency. Prior to enactment of the CEA in 1936, Mr. James J. Coughlin, a member of the Chicago Board of Trade, presented the Senate Committee on Agriculture and Forestry a petition \"signed by something in excess of 1,500 members of the contract grain markets\" requesting that the prohibition against trading \"indemnities\" be lifted. Hearings on H.R. 6772 Before the Senate Committee on Agriculture \u0026 Forestry 137-138 (1936). Indemnities were options on commodity futures whose trading would, in the judgment of Mr. Coughlin's petitioners, \"result in a substantial broadening of the capacity of the futures markets to absorb the great volume of hedges necessarily attendant upon crop movements and, to that extent, furnish an infinitely more liquid market than exists at present, thereby not only resulting in a higher price level but likewise reducing the necessary price differential between farm and terminal.\" Id. But there was also substantial testimony from farm organizations and others to the effect that \"this character of transaction (is) the cheapest form of gambling that can be practiced.\" Id. at 222 (statement of Mr. Clifford Thorne). In 1936, Congress sided with those wary of options by enacting the original Section 4c. CEA of 1936, ch. 545, § 5, 49 Stat. 1491, 1494 (now codified as § 4c(a), 7 U.S.C. § 6c(a)). In 1974, to the displeasure of putative options traders, Congress again sided with the cautious by placing all commodity options trading within the authority of a single independent agency. In 1978, Congress went even further by generally banning all options trading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. For example, in 1978, SEC Chairman Williams testified to the economic near-equivalence of options and futures: More specifically, futures on financial securities are directly comparable to options on securities. At the most fundamental level, financial futures and securities options are both devices for risk management in relation to price fluctuations in the underlying securities. They are both derivative financial instruments, because their prices are determined primarily by the prices of the underlying securities traded on other markets. By using financial futures or securities options, investors can pursue a high-risk investment strategy. They can pay a relatively small amount of money-a margin for a future, or a premium for an option-in return for the opportunity of reaping a proportionately large profit or suffering a proportionately large loss. Moreover, securities futures and securities options raise similar policy concerns from the perspective of their impact on the American economy. Neither securities futures nor options on securities lead directly to new capital formation. American businesses raise capital by selling the securities underlying these futures and options; these businesses do not obtain any input of capital when investors purchase futures or options on these securities. In fact, some investors may choose to purchase securities futures and securities options instead of purchasing the underlying securities. To be sure some differences do exist between securities futures and securities options. A futures contract represents a binding obligation which must be satisfied on the expiration date, unless it is liquidated by an offsetting transaction. An option constitutes a right exercisable at any time by the holder of the option. But, this difference is mitigated by the existence of a continuous market for futures before the expiration date. While investors may make a small deposit for a futures contract, and pay a premium for an options contract, the potential risk of loss assumed by investors is different. In an options contract, the maximum loss for the purchaser is the amount of the premium. In a futures contract, as the market moves against the participant, additional margin calls are made. But, again, this difference is mitigated by the ability of a holder of a futures contract to liquidate the contract at any time before the expiration date. Thus, despite the technical differences between futures on securities and options on securities, in a pragmatic vein the two investment vehicles are distinctly similar. At the most basic level, the prices of both futures on securities and options on securities are primarily dependent on the same factor-the price of the underlying security. The regulatory implications of the essentially derivative nature of the prices of securities futures and securities options are most important. * * * In short, since the prices of futures and options on securities are primarily dependent on the prices of the underlying securities, the regulation of the markets for these futures, options, and underlying securities needs to be integrated. Extend Commodity Exchange Act: Hearings on H.R. 10285 Before the House Subcommittee on Conservation and Credit, 95th Cong., 2d Sess. 193-196 (1978). See also id. at 217-219 (statement of CBOE President Joseph W. Sullivan); Moriarty, Phillips \u0026 Tosini, A Comparison of Options and Futures in the Management of Portfolio Risk, Financial Analysts J. 61 (Jan./Feb. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See also SEC Chairman Williams' 1978 testimony: The present bifurcated system-under which the CFTC claims regulatory authority over the markets for futures on securities, while this Commission regulates the markets for the underlying securities, and for options on these securities-creates surveillance difficulties for both agencies. For example, one market may be manipulated to benefit a position held in the other market. Detection of such a manipulation, and subsequent enforcement action, can only be effective if both markets are regulated by the same agency. Extend Commodity Exchange Act: Hearings on H.R. 10285 Before the House Subcommittee on Conservation and Credit, 95th Cong., 2d Sess. 196 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Russo \u0026 Lyon, The Exclusive Jurisdiction of the Commodity Futures Trading Commission, 6 Hofstra L.Rev. 57, 90 (1977). See 119 Cong.Rec. 41335 (1973) (remarks of House Chairman Poage); H.R.Rep.No.975, 93d Cong., 2d Sess. 69-71 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The dissent argues that GNMA options do not \"involve\" any futures contract because the word \"involving\" was borrowed from earlier commodities legislation, namely Section 3 of the Grain Futures Act of 1922, ch. 369, 42 Stat. 999. Section 3 of the 1922 Act did not cover options; ergo, the 1974 amendments to CEA § 2(a)(1) cannot either. The use of the word \"involving\" in Section 3 of the 1922 Act is not probative for two reasons. First, there is nothing to rebut the probability that \"involving\" was used in the two statutes only coincidentally. There are no statements in the 1974 legislative history indicating that Congress adopted the word used in 1922 for any purpose, let alone for incorporating its settled meaning. The 1974 House draft used \"relating\" rather than \"involving,\" the latter appearing only in the Senate version and without explanation for the change. See pages 1146-1147 supra. Whereas Section 2(a)(1) carefully delineates the scope of Congress' 1974 regulation, Section 3 was enacted only to explain why futures trading affects interstate commerce and therefore why futures trading should be regulable under the Commerce Clause. See Chicago Board of Trade v. Olsen, 262 U.S. 1, 43 S. Ct. 470, 67 L. Ed. 839 (1922 Act is constitutional under the Commerce Clause). The 1922 Act was passed in response to an earlier Supreme Court decision holding parts of the Future Trading Act of 1921 unconstitutional under Congress' taxing powers. Hill v. Wallace, 259 U.S. 44, 42 S. Ct. 453, 66 L. Ed. 822. Thus, Section 3 had only the limited purpose of placing Congress' futures regulation under the appropriate constitutional authority and since the Commerce Clause reaches all of the listed \"agreements\" of Section 2(a)(1), the former section is not likely to have been inspiration for the latter. Second, Section 3 of the 1922 Act did not apply to options not because Congress deemed \"involving\" too weak a word for the task but because options were already covered by the parts of the 1921 Act not invalidated by Hill v. Wallace. In holding the futures part of the 1921 Act unconstitutional under the taxing power, the Supreme Court specifically stated that the options part of the 1921 Act was unaffected. 259 U.S. at 71-72, 42 S. Ct. at 459. Although in 1926 the options regulation was held unconstitutional too, Trusler v. Crooks, 269 U.S. 475, 46 S. Ct. 165, 70 L. Ed. 365, Congress in 1922 repaired only the damage before it, reenacting the futures regulation under the Commerce Clause and leaving options to be covered by the 1921 Act. See S.Rep.No.871, 67th Cong., 2d Sess. 1 (1922); Hearings on H.R. 6772 Before the Senate Committee on Agriculture \u0026 Forestry, 223 (1936). The dissent would do better to make hash from old food than old statutes. The dissent also points out that the old Section 3 was retained in drafting the CEA of 1936 by substituting \"commodity\" for \"grain,\" and that the text of the old Section is presently in force and codified at 7 U.S.C. § 5. Supposing that we may draw light from 7 U.S.C. § 5 upon Congress' intention regarding the scope of CFTC exclusive jurisdiction (because, as the dissent notes, both use the word \"involving\"), we find that it supports our conclusion. The introductory, \"involving\" clause of 7 U.S.C. § 5 limits itself to futures contracts: Transactions in commodities involving the sale thereof for future delivery as commonly conducted on boards of trade and known as \"futures\" are affected with a national public interest; But the remainder of 7 U.S.C. § 5 details the effects of, purposes for, and problems with a class of commodity trading instruments that would include exchange-formed off-set options as well as futures: such transactions are carried on in large volume by the public generally and by persons engaged in the business of buying and selling commodities and the products and byproducts thereof in interstate commerce; the prices involved in such transactions are generally quoted and disseminated throughout the United States and in foreign countries as a basis for determining the prices to the producer and the consumer of commodities and the products and byproducts thereof and to facilitate the movements thereof in interstate commerce; such transactions are utilized by shippers, dealers, millers, and others engaged in handling commodities and the products and byproducts thereof in interstate commerce as a means of hedging themselves against possible loss through fluctuations in price; the transactions and prices of commodities on such boards of trade are susceptible to speculation, manipulation, and control, and sudden or unreasonable fluctuations in the prices thereof frequently occur as a result of such speculation, manipulation, or control, which are detrimental to the producer or the consumer and the persons handling commodities and products and byproducts thereof in interstate commerce, and such fluctuations in prices are an obstruction to and a burden upon interstate commerce in commodities and the products and byproducts thereof and render regulation imperative for the protection of such commerce and the national public interest therein. Since the exclusive jurisdiction clause unlike 7 U.S.C. § 5 is not specifically limited to \"transactions * * * commonly * * * known as \"futures,' \" and since it particularly lists \"options\" among the agreements that may \"involve\" the futures markets, we conclude that Congress did not limit the exclusive jurisdiction clause to futures by using the word \"involving\" rather than some synonym such as \"relating.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In the SEA, Congress has been careful to distinguish \"security rights\" from \"puts and calls for securities.\" See pages 1156-1157 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The purpose of the \"unless\" clause, however, is not to except GNMA options or futures from the Treasury amendment. Rather, the \"unless\" clause is needed (and was enacted) to except the transactions in security rights, etc. that occur when a futures contract is actually performed or an option is exercised. The futures or options contract is not a transaction in a commodity but insofar as it may presage some future transfer of the commodity, the latter is excepted from the Treasury amendment by the \"unless\" clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. For example, the Senate Report stated: Likewise, the Committee (Senate Committee on Agriculture \u0026 Forestry) believes that regulation by the Commission (CFTC) of transactions in the specified financial instruments (i.e., security warrants, security rights, resales of installment loan contracts, repurchase options, government securities, mortgages and mortgage purchase commitments), which generally are between banks and other sophisticated institutional participants, is unnecessary, unless executed on a formally organized futures exchange. S.Rep.No.1131, 93d Cong., 2d Sess. 23, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5843, 5863-5864. The dissent also cites legislative history on this point to a different conclusion, S.Rep.No.850, 95th Cong., 2d Sess. 47, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2135, but this is only the text of a letter to the Senate Committee from the Treasury Secretary. We have no grounds to believe that the Senate Committee adopted the opinion of the Treasury Secretary concerning the scope of the Treasury amendment and we doubt that such adoption would be relevant four years after passage of the Treasury amendment. The 1978 amendments to the CEA did not affect the Treasury amendment in any way. We draw no conclusion as to whether the Treasury amendment affects any CFTC jurisdiction over options on foreign currency, an apparent concern of the amicus Philadelphia Stock Exchange.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The options ban applies even if GNMA options are not within CFTC exclusive jurisdiction because if the SEC is without jurisdiction, the SEC savings clause is inapplicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Our holding that GNMA options are not securities does not depend on whether the GNMA's themselves are securities, although we shall assume without deciding that GNMA's are securities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. In a 1973 rule-making and its current Rule 12a-6, the SEC made a similar distinction between put and call options and warrants or rights. Rule 12a-6(a) (1), 17 C.F.R. § 240.12a-6(a)(1), provides: The term \"option\" shall include any put, call, spread, straddle, or other option or privilege of buying a security from or selling a security to another without being bound to do so, but such term shall not include any such option where the writer is: the issuer of the security which may be purchased or sold upon exercise of the option, or is a person that directly, or indirectly, through one or more intermediaries, controls, or is controlled by, or is under common control with such issuer. As the SEC explained, \"The definition of \"option' for the purposes of this rule has been revised to make clear that the rule does not apply to ordinary warrants, rights and convertible securities.\" SEA Release No. 10128, 38 Fed.Reg. 11448, 11449 (May 8, 1973). The exclusionary language in the Rule defining \"ordinary warrants, rights and convertible securities\" is essentially equivalent to our definition in the text, and clearly would not cover the proposed GNMA options since they would be \"written\" by the CBOE's clearing house rather than by the mortgage bankers who issue the underlying GNMA's.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See SEA § 9, 15 U.S.C. § 78i (entitled \"Manipulation of Security Prices\"). In particular, Section 9(d), 15 U.S.C. § 78i(d), distinguishes options from warrants and rights: \"The terms \"put', \"call', \"straddle', \"option', or \"privilege' as used in this section shall not include any registered warrant, right, or convertible security.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Therefore, Mansbach v. Prescott, Ball \u0026 Turben, 598 F.2d 1017, 1026 n.40 (6th Cir. 1979), cited by the SEC and CBOE, incorrectly reads Blue Chip Stamps as holding that options are securities. We of course have no occasion to question the holding in Mansbach that there may be liability under Rule 10b-5 for manipulative stock option transactions. On the other hand, Lutgert v. Vanderbilt Bank, 508 F.2d 1035, 1038 (5th Cir. 1975), cited by the SEC, involved subscription rights to purchase a security that we would agree come within the definition of a security.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. GNMA's are securities \"guaranteed by the United States * * * or (issued or guaranteed) by any person controlled or supervised by and acting as an instrumentality of the Government of the United States pursuant to authority granted by the Congress of the United States * * *.\" Section 3(a)(2) of the Securities Act of 1933, 15 U.S.C. § 77c(a)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. GNMA's are \"securities which are * * * obligations guaranteed as to principal or interest by ( ) the United States * * * (and) securities issued or guaranteed by corporations in which the United States has a direct or indirect interest * * *.\" SEA § 3(a)(12), 15 U.S.C. § 78c(a)(12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See Sections 3(a)(2) and 5(a) of the Securities Act of 1933, 15 U.S.C. §§ 77c(a)(2), 77e(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See SEA § 16(a), (b) and (c), 15 U.S.C. § 78p(a), (b) and (c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The parties to the standby commitment presumably came within the trade exemption to the options ban. CEA § 4c(c), 15 U.S.C. § 6c(c); 17 C.F.R. § 32.4(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The dissent suggests that Rule 3a11-1, 17 C.F.R. § 240.3a11-1, supports options being securities. We disagree. Rule 3a11-1 defines \"equity security\" to include \"any put, call, straddle, or other option or privilege of buying such (an equity) security.\" But \"equity security\" is defined in SEA § 3(a)(11), 15 U.S.C. § 78c(a)(11), to mean (unless the context otherwise requires) \"any stock or similar security * * *.\" This definition is used, for example, by the Williams Act, 15 U.S.C. §§ 78m(d)-(e), 78n(d)-(f), which regulates tender offers and large purchases of stock that may affect control of the corresponding corporation. GNMA's are not corporate stocks, and hence are not \"equity securities.\" See also pages 1150, 1157 supra. Thus Rule 3a11-1 has nothing to do with GNMA options.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Section 9(f), 15 U.S.C. § 78i(f), provides: \"The provisions of this section shall not apply to an exempted security.\" GNMA's are exempted securities under Section 3(a)(12), 15 U.S.C. § 78c(a)(12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In 1936, Congress thought exempted securities safe enough to be included among the instruments in which a futures commission merchant could invest his customers' margin accounts. CEA of 1936, § 4d(2). In its 1968 amendments to the CEA, Congress reaffirmed the soundness of exempted securities by retaining them as margin account investments while dropping others. Pub.L.No.90-258, § 6, 82 Stat. 27 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See S.Rep.No.850, 95th Cong., 2d Sess. 13 reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2087, 2101; LTV Federal Credit Union v. UMIC Government Securities, Inc., 523 F. Supp. 819, 832 (N.D.Tex.1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. In its proposed Rule 34.1 the CFTC would disown its jurisdiction over GNMA options, arguably making SEC jurisdiction over them \"necessary.\" See note 12 supra. This attempt to redraw the statutory lines of jurisdiction would seem ineffective in the absence of new legislation, but we do not decide the question because Rule 34.1 has not yet been adopted. See note 8 supra. The dissent suggests a similar argument, that because the CFTC \"has neither the expertise nor the desire to regulate the trading of GNMA options,\" we are \"otherwise required\" to deem them securities. Dissent pp. 1182-1183. But surely Congress did not intend us to play \"finders keepers\" with the CFTC's unexercised jurisdiction. Rather, while we wait for the CFTC to follow the procedures set out in CEA § 4c(c), GNMA options are to be banned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. We note that our opinion in this case is limited to the particular issue presented. This opinion is not intended to decide related questions, such as whether SEC anti-fraud rules may apply to commodity options transactions, whether the Federal Reserve Board may set margin requirements for options on exempted securities, to what extent CFTC jurisdiction may preempt state enforcement activity, and what responsibilities the Securities Investor Protection Corporation may have regarding GNMA options.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The term \"actual\" refers to the underlying commodity (corn, wheat, silver, pork bellies), security (General Motors stock) or security/commodity (GNMA's) in which futures contracts or option contracts are traded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See S.Rep.No.850, 95th Cong., 2d Sess. 5-13, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2093-2101 (detailing history of futures trading in United States and describing as purpose of the CFTC, the provision of a uniform regulatory structure covering all aspects of futures trading in both the regulated and unregulated commodities); S.Rep.No.1131, 93rd Cong., 2d Sess. 13-17, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5856-60 (describing mechanics of futures trading and detailing need for centralized regulatory agency to oversee such trading); Johnson, The Commodity Futures Trading Commission: Preemption as Public Policy, 29 Vand.L.Rev. 1, 18 (1976) (clear that 1974 Congress \"intended the CFTC to be the sole regulatory authority for the futures industry\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Trading in GNMA futures contracts began in 1975 when the CFTC designated the Chicago Board of Trade as a contract market for GNMA futures. SEC Record 634.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority attempts to minimize this explicit conclusion by one of the nation's foremost commodities experts by arguing that Johnson, in his 1975 article, \"could cite no authority for this mistaken conclusion.\" Ante at 1147 n.18. However, as outside counsel to the Chicago Board of Trade at the time the exclusive jurisdiction clause was enacted, Mr. Johnson was certainly in a favorable position to interpret the scope of the jurisdictional grant for which he and his client were primarily responsible. See ante at 1146, 1147. Moreover, it is, to say the least, inconsistent for the majority to use Johnson's legal analysis to support several aspects of their \"involving\" theory (see, e.g., ante at 1145 n.16; 1146, 1147), yet to dismiss so cavalierly by explicit conclusion regarding the limited scope of the CFTC's exclusive jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Act of Sept. 21, 1922, ch. 369, § 3, 42 Stat. 999.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Except for the substitution of \"commodity\" for \"grain\" in 1936. See Act of June 15, 1936, ch. 545, § 2, 49 Stat. 1491.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. 7 U.S.C. § 5 (1980) provides in pertinent part: Transactions in commodity involving the sale thereof for future delivery as commonly conducted on boards of trade and known as \"futures\" are affected with a national public interest; (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It may well be true, as both the majority and the CBOT have argued, that much of the divergence between securities options trading and futures trading \"has been fortuitous.\" Ante at 1140 n.2. Given this divergence, however, it is the job of Congress, not this court, to reunite the two markets if it so desires. Surely, not even the majority would suggest that the corporate stock options currently being traded on the CBOE have been brought within the CFTC's exclusive jurisdiction as a result of the trading in stock index futures recently inaugurated on the Kansas City Board of Trade. See note 11 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. This desire to extend the CFTC's exclusive jurisdiction to collateral activities surrounding futures trading also explains the \"relating to\" language proposed by the House Committee on Agriculture. See Johnson, 29 Vand.L.Rev. at 10-11; Majority Opinion at 1146-1147.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Unlike the majority, ante at 1151 \u0026 n.26, I do not purport to characterize American Telephone and Telegraph bonds as either \"legitimate\" or \"illegitimate\" commodities, whatever those terms may denote. Rather, I regard the potential for futures trading in AT\u0026T bonds as demonstrating the fundamental flaw in the majority's analysis. Under the clear definitional provisions of the CEA, AT\u0026T bonds will become \"commodities\" within the meaning of the Act as soon as futures trading on them has been authorized. And, according to the majority's \"involving\" theory, once AT\u0026T bonds have become \"commodities\" all options trading on the underlying financial instrument will be subject to the CFTC's exclusive jurisdiction, a result which I do not believe Congress could possibly have intended.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Indeed, trading in such stock-index futures has already begun on the Kansas City Board of Trade. Wall St. J., Feb. 25, 1982, at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See, e.g., SEC Record 2-4 (distinguishing between GNMA futures and GNMA options trading and rejecting CBOT contention that proposed GNMA options are within the jurisdiction of the CFTC). See also Comment Letters reprinted at Id. 365-66 (futures \"are not a consistently useful vehicle for hedging the risk present in the conventional loan origination market\"), and Id. 466 (GNMA futures market is a mandatory delivery market and, as such does not serve the same economic function as an options market).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The administrative history of the challenged SEC order demonstrates that the SEC carefully considered all aspects and implications of GNMA options trading before approving CBOE's requested rules change. On May 12, 1980, the SEC published notice of CBOE's proposed rules change and invited public comments to be filed by July 15, 1980. It also wrote to a number of Government agencies, including the CFTC, to inform them officially of CBOE's proposal and to furnish them with a copy of CBOE's proposed rules for trading GNMA options. The SEC again wrote to the same Government agencies on July 11, 1980, specifically to request comments on CBOE's proposal. On July 24, 1980, the SEC issued a news release extending the public comment period to September 1, 1980, and soliciting additional comments concerning particular features of CBOE's proposed options contract, including an evaluation of the market and regulatory environments within which these instruments would be traded. See SEC Record 116-27. The SEC received 85 comment letters concerning the CBOE proposal, all but one of which-the submission of the CBOT-were essentially supportive. SEC Record 4. These included comments from interested Government agencies-the Government National Mortgage Association, the Department of Housing and Urban Development, the Department of the Treasury, the Federal Reserve Bank of New York, the Board of Governors of the Federal Reserve System and the CFTC-as well as from a large number of mortgage bankers, the Mortgage Bankers Association of America, a number of investment bankers and securities dealers, and the Securities Industry Association. In general, these comments emphasized (1) that options on GNMA securities had been a traditional financing vehicle in the mortgage banking industry and were essential to sound construction financing; (2) that for a variety of economic reasons GNMA options had generally become unavailable in the dealer (over-the-counter) markets; (3) that GNMA options serve needs that are not filled by the availability of futures contracts; and (4) that there was an urgent public need for the prompt approval and implementation of the type of GNMA option market proposed by CBOE. The comment letters also noted that the proposed CBOE market would greatly enhance the regulatory environment for the trading of GNMA options and would be likely to cure the abuses that had been occurring in the over-the-counter GNMA options market. See SEC Record 471, 519, 522-27, 534-37, 635. On February 26, 1981, the SEC entered its order approving CBOE's proposed rules change. The SEC expressly found that \"it is appropriate for the CBOE to amend its rules to provide for trading of options on GNMA securities\" and that \"the proposed rule change is consistent with the requirements of the (Securities Exchange) Act and the rules and regulations thereunder and, in particular, the requirements of Section 6.\" SEC Record 13. The SEC considered the arguments raised by the CBOT that GNMA options were within the CFTC's jurisdiction and subject to the ban on commodity options provided in the CEA, but rejected these arguments on the ground that \"the CEA is not applicable to the trading of options on GNMA securities, particularly where the trading is on a national securities exchange.\" SEC Record 4 n.13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Congress, in both 1974 and 1978, was well aware of the difference between options and futures. The 1978 Senate Report defines \"Futures Contract\" as \"A firm commitment to deliver or receive a specified quantity and grade of a commodity during a designated month with price being determined by public auction among exchange members.\" S.Rep.No.850, 95th Cong., 1st Sess. 128 (1978), reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2165 (emphasis added). The same Senate Report defines an \"Option\" as (1) A term sometimes erroneously applied to a futures contract ... (2) The right, acquired for a price, to buy and sell a commodity at an agreed upon price within a specified time. Id. at 132, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2169 (emphasis supplied). See also 1974 House Report at 130 (defining futures contract as a \"legally binding commitment to deliver or take delivery of a given quantity and quality of a commodity at a price agreed upon when the contract is made....\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Moreover, as both Congress and the CFTC have recognized, there is also a strong economic linkage between futures trading and trading in the underlying actual commodities. See, e.g., 7 U.S.C. § 4a(g)(2) (1980). Indeed, one basic justification for a futures market is that futures trading in a central location performs a \"price discovery\" function for the underlying commodity, thereby furnishing producers and users a reference point for their pricing on the cash market. See 1974 Senate Report at 12; Majority Opinion at 1151. Congress has, in fact, required the CFTC, in determining whether to approve a proposed futures contract, to assess whether the contract will fulfill such a \"price discovery\" function for the interdependent cash market. See 1974 House Report at 12; 1974 Conference Report (H.R.Rep.No.1383, 93d Cong., 2d Sess.) at 36. The logical import of the majority's \"involving\" theory would thus appear to extend the CFTC's exclusive jurisdiction to transactions in the cash commodities themselves, notwithstanding Congress' clear intent to the contrary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Indeed it seems naive to argue, as the majority appears to, ante at 1151-1153, that giving exclusive jurisdiction over the trading of GNMA options to an agency already experiencing severe difficulties combating manipulation and deceptive trading practices in the commodities industry, see note 44 infra, rather than to an agency that has consistently demonstrated its ability to effectively regulate securities trading, will minimize the potential for manipulation and abuse. Nor do the portions of the SEC record cited by the majority support its anti-manipulation argument, since the opportunities for intra-market manipulation discussed in those comment letters (written in response to specific SEC inquiries) will exist regardless whether trading in GNMA options and GNMA futures is regulated by the same or different agencies. Finally, the 1978 testimony of then SEC Chairman Williams, quoted in footnote 27 of the majority opinion, runs directly counter to the majority's policy argument, since Williams, at the time, was advocating that jurisdiction over all forms of security trading-including futures trading-be vested in the SEC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See Securities and Exchange Comm. v. Weeks Securities, Inc., 483 F. Supp. 1239, 1245 (W.D.Tenn.1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Thus, in 1978, the proposed SEC amendment would have rendered illegal the extensive trading in GNMA futures then taking place on the CBOT.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. S.Rep.No.850, 95th Cong., 2d Sess. 22-23, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2110-11. The changing nature of futures markets has stimulated the proposals of the SEC and the Department of the Treasury for increased jurisdiction by them in specific areas of futures trading. In each case, their proposals stem from their interest in certain underlying \"commodities\" ... The committee understands the basis of the Securities and Exchange Commission proposal and appreciates the interest of the Department of the Treasury in examining the integrity of markets for Government securities. However, the basic conclusion reached in 1974 that there should be a single regulatory agency responsible for futures trading is as valid now as it was then. (emphasis added). See also Johnson, The Commodities Futures Trading Commission Reauthorization Process: A View From the Trenches, 1979 Det.Col.L.Rev. 1, 3-4, 13-14 (SEC proposal \"urged that all forms of trading in securities-futures, options and ordinary sales-should be \"vertically integrated' in one agency: the SEC.... The SEC's proposal was to redefine the term \"commodity' so that the CFTC would lose jurisdiction entirely and the SEC (and Treasury) would replace it.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The majority relies on a 1975 letter written by the SEC chairman Ray Garrett, Jr. stating that, without the SEC's proposed amendment, § 2(a)(1) of the CEA \"may well call into question the continuing jurisdiction of the SEC over options trading, including that on the CBOE and the American Stock Exchange, Inc.,\" ante at 1149. Congress quite reasonably concluded that these fears were unwarranted, since both the language and the legislative history of § 2(a)(1) preserved SEC jurisdiction over options trading in securities. See, e.g., 1974 Senate Report at 26, reprinted in, (1974) U.S.Code Cong. \u0026 Ad.News 5866; 120 Cong.Rec. 34, 736-37 (1974) (remarks of Representative Poage).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See 556 S.W.2d at 422 (defining relevant commodity option as \"a contract right ... to buy from or sell to the option seller, the underlying commodity futures contract at a fixed price ... at any time during the life of the option.\") (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Examination of this statement in its entirety renders untenable the majority's suggestion that the Senate Committee's reference to \"securities\" in this passage covers only \"traditional, corporate stocks\" and does not include \"nontraditional (financial) instruments\" such as GNMAs. Ante at 1148 \u0026 n.22. Under 12 U.S.C.A. § 24 (1980 Supp.) nationally chartered banks are generally prohibited from owning or dealing in corporate stocks and bonds. Most state banks are subject to similar restrictions. See, e.g., Ill.Rev.Stat. ch. 17, §§ 3130, 3131 (1981); Ind.Code § 28-1-11-4 (1976); 26 Wis.Stat.Ann. § 219.01 (1957 \u0026 1981 Supp.). Cf. Cal.Fin.Code § 1364 (1968 § 1981 Supp.) (allowing state banks to invest up to 10% of their savings deposits in debt instruments of U. S. corporations meeting strict financial requirements). Since the final sentence of the Senate Report explicitly refers to \"puts and calls for securities\" that are traded among banks, the phrase must necessarily include options on non-corporate financial instruments such as GNMAs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See also 1974 Senate Report at 23, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5863: While the Committee did wish the jurisdiction of the Commodity Futures Trading Commission to be exclusive with regard to the trading of the futures on organized contract markets, it did not wish to infringe on the jurisdiction of the Securities and Exchange Commission ....\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The suggestion of the majority, ante at 1149, that preserving SEC jurisdiction over the trading of security options on a national security exchange might somehow allow the CBOE to \"trade wheat options or onion futures\" is ridiculous since-unlike GNMAs-neither wheat nor onions can possibly be characterized as a security. The majority's further contention that \"the dissent thus reads the legislative history inconsistently with the clear words of the statute\" is similarly flawed, since the purportedly broad statutory reach to which the majority refers depends entirely on its strained construction of the term \"involving.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See P. C. Pfeiffer Co. v. Ford, 444 U.S. 69, 77-78 n.7, 100 S. Ct. 328, 334-335 n.7, 62 L. Ed. 2d 225 (1979) (\"including\" indicates that subsequent terms \"comprise a part of the larger group\"); Federal Land Bank v. Bismarck Lumber Co., 314 U.S. 95, 100, 62 S. Ct. 1, 4, 86 L. Ed. 65 (1941) (\"the term \"including' is not one of all-embracing definition, but connotes simply an illustrative application of the general principle\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Memorandum of the Office of the General Counsel of the CFTC Concerning the Exclusive Jurisdiction of the Commission over Futures Transactions, (1975-1977 Transfer Binder) Comm.Fut.L.Rep. (CCH) P 20,177, at 20,834 (Dec. 8, 1975) (emphasis added). See id. at 20,835 (CEA grants CFTC exclusive jurisdiction \"over futures transactions executed on any organized board of exchange or trade;\" SEC jurisdiction \"limited to activities not meeting the foregoing description.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. A \"standby\" option is a forward contract giving one party to the contract the option to make delivery of specified GNMA securities at or before a specified date. This arrangement is also denominated a \"put\" option. See SEC Record 376, 397, 435; Majority Opinion at -- .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. For example, in November, 1976, the CFTC adopted comprehensive commodity option regulations, 17 C.F.R. § 32.1 et seq., 41 Fed.Reg. 51808, et seq. (Nov. 24, 1976), to govern options transactions in the newly regulated commodities. Part 32.2 of these regulations absolutely prohibited all options transactions \"involving ... any contract of sale of any commodity for future delivery traded on or subject to the rules of any contract market\" (emphasis supplied). Although Part 32.4 of these regulations exempted so-called \"dealer options\" from some CFTC restrictions, this exemption did not apply to the absolute prohibition found in Part 32.2. Thus, if the majority's interpretation of the phrase \"transactions involving contracts of sale of a commodity for future delivery...\" were correct, these 1976 regulations would have completely shut down the then existing GNMA standby market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See SEC Record 631-35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. 47 Fed.Reg. 7677, 7678 (Feb. 22, 1982) (footnote omitted) (emphasis supplied). Pursuant to section 4c(c) of the CEA, the CFTC transmitted this proposed rule to the House and Senate Agriculture Committees on February 19, 1982. See also note 43 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The majority's rejection of this argument on the grounds that while a call option may be characterized as a security right, a put option cannot, would lead to the absurd result that the CFTC would have jurisdiction over one-half of the CBOE's proposed options market (the put options), but not the other. Moreover, courts and commentators have routinely held that both put and call options constitute \"security rights.\" See, e.g., Mansbach v. Prescott Ball \u0026 Turben, 598 F.2d 1017, 1026 n.40 (6th Cir. 1979); Securities \u0026 Exchange Comm. v. American Commodity Exchange, Inc., 546 F.2d 1361, 1366-67 (10th Cir. 1976); Securities \u0026 Exchange Comm. v. G. Weeks Securities, Inc., 483 F. Supp. 1239, 1242-44 (W.D.Tenn.1980); I L. Loss, Securities Regulation 469 (2d ed. 1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See Letter from Donald L. E. Ritger, Acting General Counsel, Department of the Treasury to Hon. Herman E. Talmadge, Chairman, Senate Comm. on Agriculture and Forestry, July 30, 1974, reprinted in 1974 Senate Report at 49-51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Indeed the legislative history strongly indicates that no such limitation was intended. See 1974 Senate Report at 31, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5870 (\"However, transactions in foreign currency, security warrants and rights ... government securities or ... mortgage commitments would not be subject to the act unless they involve the sale thereof for future delivery conducted on a Board of Trade\"); 1978 Senate Report at 47, reprinted in (1978) U.S.Code Cong. \u0026 Ad.News 2135 (role of CFTC with respect to Government securities \"limited to futures contracts sold on organized exchanges\"). The majority's suggestion, ante at 1154-1155 n.34, that the plain language of the Treasury Amendment is supported by \"only the text of a letter to the Senate Committee from the Treasury Secretary\" is thus incorrect, and is further refuted by the very portion of the 1974 Senate Report quoted by the majority. As that portion of the 1974 Senate Report explains: (R)egulation by the (CFTC) of transactions in the specific financial instruments ..., which generally are between banks and other financial institutions, is unnecessary unless executed on a formally organized futures exchange. Ante at 1154-1155 n.34, quoting 1974 Senate Report at 23, reprinted in (1974) U.S.Code Cong. \u0026 Ad.News 5863-64 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Nor did the CFTC raise this argument in its comments to the SEC. See SEC Record 630-41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. This result is sensible from a regulatory viewpoint since unscrupulous dealers may engage in fraudulent selling practices involving government-related securities even though the securities themselves are sound. See SEC Record 470-71. As GNMA itself recently noted, \"(w)hile the integrity of the (GNMA) securities is absolutely sound, abuses in the way in which the securities are sold, financed, and traded\" have occurred. 45 Fed.Reg. 40,556 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See, e.g., SEC v. G. Weeks Securities, Inc., 483 F. Supp. 1239 (W.D.Tenn.1980); SEC v. Harwell, SEC Lit.Rel. No. 8559 (1978); SEC v. Winters Gov't Sec. Corp., SEC Lit.Rel. No. 8202 (1977); In re Merrill Lynch, Pierce, Fenner \u0026 Smith, SEA Rel. No. 11515, reprinted in (1975-1976 Transfer Binder) Fed.Sec.L.Rep. (CCH) P 80,216 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See 1 Am. Stock Ex. Guide (CCH) 1401-09 (1979) (U.S. Government notes, bonds and bills); 1 NYSE Guide (CCH) 899-57 to 60 (1981) (U.S. Government bonds and notes); PHLX Guide (CCH) 776 (1981) (GNMA securities).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See Rules 120, 140, 2 Am. Stock Ex. Guide (CCH) PP 9270, 9288 (1981); Rules 62.10, 66, 2 NYSE Guide (CCH) PP 2062, 2066 (1978); Rules 150-54, PHLX Guide (CCH) PP 2150-54 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. For example, when the American Stock Exchange (\"Amex\") recently wished to amend its rules in order to trade GNMA securities, it was required to submit the proposed rules changes to the SEC for review pursuant to section 19(b) of the SEA. The SEC approved the rules changes after finding them to be consistent with the requirements of the SEA, particularly section 6 and the rules and regulations thereunder. 44 Fed.Reg. 50,942 (1979). In 1977, when the Amex and the CBOE filed separate proposals for instituting options trading on Government debt securities, the SEC exercised its regulatory authority by determining not to approve such proposals until after completion of a special study of the options market which the SEC had undertaken. 42 Fed.Reg. 56,711 (1977). Although the SEC published notice of these 1977 proposals, 42 Fed.Reg. 2734 (1977) (Amex) and 42 Fed.Reg. 32,236 (1977) (CBOE), no comments were filed suggesting either that the SEC lacked jurisdiction to authorize options trading on Government debt securities on a national security exchange, or that such trading was subject to the jurisdiction of the CFTC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In Daniel, the interest at issue was an employee's share in \"a noncontributory compulsory pension plan,\" 439 U.S. at 553, 99 S. Ct. at 793 while in Weaver, the disputed instruments were \"a conventional certificate of deposit and a business agreement between two families.\" -- - U.S. at -- , 102 S. Ct. at 1220. The Supreme Court in Weaver expressly reemphasized the broad scope of the definition of \"security\" found in § 3(a)(10) of the SEA, and stated that the term \"was meant to include \"the many types of instruments that in our commercial world fall within the ordinary conception of a security.' \" -- - U.S. at -- , 102 S. Ct. at 1222 quoting H.R.Rep.No.85, 73d Cong., 1st Sess. 11 (1933). The Supreme Court in Weaver also reaffirmed its holding in SEC v. Howey, Inc., 328 U.S. 293, 299, 66 S. Ct. 1100, 1103, 90 L. Ed. 1244 (1974), that the definition of security \"includes (not only) ordinary stocks and bonds, (but also) the \"countless and various schemes' devised by those who seek the use of the money of others in the promise of profits.\" -- - U.S. at -- , 102 S. Ct. at 1222. The Weaver Court concluded, however, that in the particular fact situation before it, see -- - U.S. at -- n.11, 102 S. Ct. at 1225 n.11, it was \"unnecessary to subject issuers of bank certificates of deposit to liability under the federal securities laws since the holders of bank certificates of deposit are abundantly protected under the federal banking laws.\" -- - U.S. at -- , 102 S. Ct. at 1224.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. I understand there is some exchange trading of futures on bank certificates of deposit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. CEA § 8a(5), 7 U.S.C.A. § 12a(5) (1980), gives the CFTC the authority \"to make and promulgate such rules and regulations as, in the judgment of the Commission, are reasonably necessary to effectuate any of the provisions or to accomplish any of the purposes of this chapter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. 47 Fed.Reg. 7677, 7678 (Feb. 22, 1982) (emphasis added). Despite the CFTC's express statement that Proposed Rule 34.1 \"would remove any possibility that the prohibitions in Section 4(c) ... would impede trading in options on exempted securities on national securities exchanges subject to regulation by the SEC,\" 47 Fed.Reg. at 7678 n.2, the majority argues that the proposed CFTC rule, even if approved by Congress, would not lift the options ban. Ante at 1144 n.13. The apparent basis for this argument is the majority's view that the proposed rule does not adequately \"document the CFTC's ability to regulate options on exempted securities.\" Id. at 1144 n.13. In light of the extensive evidence documenting the SEC \"s ability to regulate GNMA options trading, see note 13 supra, and the express provisions of the CEA directing the CFTC and the SEC to consult and cooperate on jurisdictional matters, see 7 U.S.C. § 4a(g) (2), the majority's view represents an extremely crabbed interpretation of section 4c(c)-an interpretation that is strikingly at odds with the majority's expansive notions of CFTC authority under other sections of the CEA. In any event, the submission to Congress of CFTC Proposed Rule 34.1, in conjunction with the recent jurisdictional agreement reached between the SEC and the CFTC, raises serious mootness and standing problems in the instant case. See generally Simon v. Eastern Kentucky Welfare Rights Organization, 426 U.S. 26, 37-39, 96 S. Ct. 1917, 1923-24, 48 L. Ed. 2d 450 (1976); Warth v. Seldin, 422 U.S. 490, 498-99, 95 S. Ct. 2197, 2204-05, 45 L. Ed. 2d 343 (1975). Although the CBOT has asserted standing both on its own and as representative of its members, it is difficult to understand how either the Board of Trade or its individual members will be injured by the SEC's decision to authorize the trading of GNMA options on a totally independent securities exchange. Indeed, because the options pilot program recently enacted by the CFTC \"is limited to options on commodity futures,\" ante at 1144 n.13, quoting 46 Fed.Reg. 54,530 (Nov. 3, 1981), the CBOE and the CBOT would not even be competing for the same trading business. Cf. Association of Data Processing Service Organizations v. Camp, 397 U.S. 150, 152-53, 90 S. Ct. 827, 829, 25 L. Ed. 2d 184 (1970). Moreover, Article V of the CBOE's Certificate of Incorporation provides that all present and future members of the Board of Trade may become members of the CBOE without the purchase of a seat, and a number of Board of Trade members have exercised this right. Such a dual membership provision further reduces the already attenuated potential for injury to CBOT members resulting from the trading of GNMA options on the CBOE. The majority's citation of Hill v. Wallace, 259 U.S. 44, 61, 42 S. Ct. 453, 455, 66 L. Ed. 822 (1922), ante at 1140-1141 n.4, to support the standing of the Board of Trade is not persuasive. The statute challenged in Hill imposed a confiscatory tax of 20 cents a bushel on all grain futures contracts then traded on the Chicago Board of Trade. Plaintiffs in Hill (who did not include the Board of Trade itself) specifically alleged that \"no member of the Board could afford to make contracts for future delivery and pay the tax thereon,\" and that \"the (challenged) law in effect prohibits all (Board of Trade members) from making any contracts of sale for future delivery.\" 259 U.S. at 47, 42 S. Ct. at 454. The contrast between the direct and immediate injury alleged in Hill and the merely abstract potential for harm alleged by the Board of Trade in the instant case could hardly be more distinct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The CFTC's regulatory authority is due to expire on September 30, 1982. 7 U.S.C.A. § 16(d) (1980). Currently, Congressional subcommittees in both the Senate and House are holding hearings to determine whether such authority should be renewed. Testimony given at these hearings has highlighted the CFTC's present inability to effectively police abuses in the commodities industry. In light of these enforcement problems, several congressional witnesses, including the current Chairman of the CFTC, have suggested that the CEA's exclusive jurisdiction proviso be modified to give state agencies and other federal authorities concurrent jurisdiction over the policing of commodities fraud. See Chicago Tribune, Feb. 24, 1982, § 2 (Business) at 1 (quoting testimony of CFTC Chairman Phillip Johnson and Senator William V. Roth, Jr.). Similar proposals have been endorsed by the General Accounting Office, Congress' investigative arm, which recently completed a highly critical study of the CFTC. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Such a determination, of course, runs directly counter to the oft repeated pronouncements of both the Supreme Court and this circuit that the provisions of the SEA (including the definition of a security) are to be liberally construed in order to carry out the broad remedial purposes of the Securities Acts. See, e.g., Tcherepnin v. Knight, 389 U.S. 332, 88 S. Ct. 548, 19 L. Ed. 2d 564 (1967); Canadian Imperial Bank of Commerce Trust Co. v. Fingland, 615 F.2d 465 (7th Cir. 1980); Goodman v. Epstein, 582 F.2d 388 (7th Cir. 1978), cert. denied, 440 U.S. 939, 99 S. Ct. 1289, 59 L. Ed. 2d 499 (1979).\u003c/span\u003e\n\n",
    "body_length": 213413,
    "citedas": [
      "677 F.2d 1137"
    ],
    "attorneys": "Mahlon M. Frankhauser, Kirkland \u0026 Ellis, Washington, D.C., for petitioner. Paul Gonson, Securities \u0026 Exchange Comm., Washington, D.C., for respondent. Burton R. Rissman, Schiff, Hardin \u0026 Waite, Chicago, Ill., for intervenor-respondent.",
    "category": [
      "251",
      "252"
    ],
    "judges": "Before Cummings, Chief Judge, Cudahy, Circuit Judge, and Campbell, Senior District Judge.*fn*",
    "citation_count": 15
  }
}
