{
  "id": "34HyPWYBTlTomsSBRG5J",
  "document": {
    "title": "Fineman v. Armstrong World Industries",
    "full_title": "ELLIOT FINEMAN; THE INDUSTRY NETWORK SYSTEM, INC. v. ARMSTRONG WORLD INDUSTRIES, INC.",
    "jurisdiction": "Third Circuit",
    "date": "1992-10-28T00:00:00.000Z",
    "docket": "No. 91-5613",
    "body": "Opinion OF THE COURT\n\nMANSMANN, Circuit Judge.\n\nIn a civil action brought in the United States District Court for the District of New Jersey, an entrepreneur, Elliot Fineman, and his corporation, The Industry Network System, Inc. (TINS), sought to recover against Armstrong World Industries, Inc., a prominent manufacturer of floor covering products, for losses sustained after TINS folded. Conceived in late 1983, the TINS concept employed novel video technology to produce a monthly videotape magazine for retailers of floor covering products to be sold through distributors. Fineman contended that Armstrong, anticipating the launching of its own videotape network, interfered with TINS' prospective contract with an Armstrong floor covering distributor to distribute the TINS video magazine. As a result of losing this contract, TINS lacked the cash flow necessary to continue in business and folded. Fineman, formerly an industry consultant, allegedly suffered injury to his reputation that destroyed his consulting business. Additionally, Fineman and TINS asserted that Armstrong, a leading manufacturer of resilient floor coverings, coerced its distributors to refuse to deal with TINS by employing its alleged leverage in the resilient floor covering market to eliminate TINS and to gain a competitive advantage in the secondary market of videotape magazines. Having cleared from the field an early competitor, Armstrong prepared, according to Fineman, to enter the videotape magazine market unencumbered by competition.\n\nArmstrong argued in defense that TINS' opportunities for success were specifically limited by its allegedly inferior product, high pressure sales tactics or poor business projections. In general, Armstrong implied that the risk inherent in starting any small business is further heightened in the magazine industry, where start-up costs and barriers to entry are low and competition is, consequently, stiff.\n\nThe jury agreed with TINS and Fineman, rendering a verdict for them on the tort and the antitrust claims, including the imposition of punitive damages. The district court, in part assessing the strength of the evidence differently, granted judgment notwithstanding the verdict,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and in the alternative, a new trial.\n\nWith respect to the judgment n.o.v., the parties dispute whether the plaintiffs have proven their tortious interference claims, are entitled to punitive damages on that claim and whether Armstrong exercises monopoly power in the resilient floor covering market, a prerequisite to TINS' Sherman Act section 2 claim. They also contest the district court's grant of a directed verdict for Armstrong on TINS' section 1 claim, specifically, whether the meeting of the minds required to establish a claim of concerted action under section 1 of the Sherman Act requires a shared motive. Finally, TINS challenges the grant of summary judgment to Armstrong on TINS' contract claim, disputing Armstrong's obligations under the 1984 TINS-Armstrong Settlement Agreement. We will address the judgment n.o.v., new trial, directed verdict and summary judgment orders in that sequence.\n\nI. Jurisdiction\n\nThe district court exercised subject matter jurisdiction over the Sherman Antitrust Act claims, 15 U.S.C. §§ 1 and 2 (Counts 1 and 2), and pendent jurisdiction over the remaining state law claims: breach of contract (Count 3); tortious interference with contract under New Jersey law (Count 4); New Jersey antitrust claims (Count 5) and Armstrong's counterclaim averring that the plaintiffs engaged in civil conspiracy.\n\nWe exercise appellate jurisdiction over the final order of the district court granting judgment n.o.v. for Armstrong on the tortious interference, Sherman Act section 2 and New Jersey antitrust claims; dismissing Fineman's individual monopoly claim, the Sherman Act section 1 claim, the breach of contract claim, and Armstrong's counterclaim; and alternatively granting a new trial on the tort and section 2 claims.\n\nII. Facts\n\nA. The Parties\n\nA brief introduction into the structure of the floor covering distribution scheme, and Armstrong's specific characteristics, will serve as useful background for understanding the discrete conflicts at issue here. Later, we will detail the facts relevant to each legal issue. A thorough review of the record is necessary because this appeal is so fact specific. The following recitation reviews undisputed facts or casts the facts in the light most favorable to the verdict winners, the plaintiffs.\n\nFloor coverings are distributed to retailers from manufacturers through distributors, also known as wholesalers. Floor covering distributors may often be \"captive\" to their manufacturers, carrying only that manufacturer's line of one particular product. This is frequently the case with Armstrong's distributors of its resilient floor coverings. This captivity appears to be limited to product lines; thus, a distributor may carry only Armstrong's resilient line but a different manufacturer's carpet or ceramic tile line. For purposes of this opinion, an \"Armstrong distributor\" denotes a distributor that is \"captive\" to Armstrong for its resilient line but may also carry non-Armstrong non-resilient lines. It also bears emphasis that Armstrong does not possess any ownership interest in its distributors. On this record, a typical Armstrong distributor depends upon Armstrong for 95% of its resilient business\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e but 50% of its overall business.\n\nBy contrast, retailers, who range from \"mom and pop\" outfits to chain floor covering retailers to other retailers that carry floor covering as a sideline, e.g., furniture, hardware, wallpaper and paint stores, and lumberyards, generally carry various brands; they purchase floor covering products from competing distributors. Depending upon the manufacturer and the specific product line, retailers may choose to buy from distributors competing within the same manufacturer's product line. Armstrong, for example, promotes intrabrand competition for its resilient line by supplying resilient to multiple distributors within any given territory. Thus distributors vigorously compete for retailer loyalty, floor space and displays, in large part because they have very little flexibility in pricing their products. Distributors vie for sales by offering \"specials\" or \"promotions\" on items, which are frequently financed by the manufacturers. In addition, some retailers purchase directly from manufacturers, although Armstrong deals exclusively through its distributors.\n\n1. Armstrong World Industries, Inc.\n\nDuring the relevant 1983-1984 time period, Armstrong World Industries, Inc., manufactured both carpet and resilient floor covering products.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e \"Resilient\" is the industry name for vinyl floor coverings, manufactured in either sheeting or tile form, and most commonly identified with the brand name \"linoleum.\" Resilient constitutes only one of many types of \"hard\" floor coverings, including wood, ceramic tile, and natural floor coverings such as stone and marble. In industry jargon, \"hard\" floor coverings are distinguished from \"soft\" floor coverings, familiarly referred to as carpeting.\n\nArmstrong's dual corporate structure flowed from its two floor covering products and consisted of twin carpet and resilient divisions. At the regional level, each division maintained its own district managers and sales force. During the relevant time period, Robert Roth served as the New York area district manager for Armstrong's resilient division and Robert Guzinsky was Roth's counterpart in Armstrong's carpet division. These men appear to have had little horizontal contact, except, for example, when a distributor carrying both lines required some financial counseling or advice from its respective district managers.\n\nAt the distributor level, however, one significant difference between the two Armstrong divisions is apparent. Armstrong sells to any number of resilient distributors within a defined geographic territory, which fosters keen competition among Armstrong's own distributors as well as with other manufacturer's distributors. Armstrong's carpet division, on the other hand, grants exclusive territorial rights to each of its carpet distributors, thereby insulating them from intrabrand competition.\n\n2. Elliot Fineman and TINS\n\nElliot Fineman began his career in the floor covering industry in 1963 as a salesman for a New York area carpet retail company, Benjamin Berman. During his fourteen year tenure at Berman, in which he worked his way up to the position of president, he developed a unique inventory control system. J.A. at 1565-7; 6398-6404. In 1977, Fineman left Berman to start a consulting business, Cost-Free Internal Profits Systems (CFIPS), largely premised on this inventory control system. As Gail Farrer, a TINS principal who followed Fineman from Berman to CFIPS explained, CFIPS aimed to achieve increased profitability from inside a floor covering distributor's company by reducing inventory and the costs associated with maintaining an excessive amount of inventory. J.A. at 3359-60. Fineman explained that a distributor's profits are a matter of pennies on the dollar so that reducing the cost of maintaining inventory could be quite profitable. Fineman testified that CFIPS charged an average consulting fee of $200,000 and guaranteed its client's satisfaction. J.A. at 1587-90.\n\nIn 1982, Fineman originated the TINS concept, a monthly magazine in the form of a videotape targeted to floor covering retailers. After conducting market studies confirming support for the idea, he launched the TINS magazine in August 1983. J.A. at 1646. The TINS magazine included four regular segments: 1) a journalist's report on industry trends; 2) Fineman's interview of an expert on key business topics; 3) Farrer's segment highlighting a successful retailer and its tips for success; and 4) the distributor's \"tag,\" a personalized segment in which each distributor would communicate with its retail customers. The advantage of the tag lay in offering promotions, or discounted specials, to the retailer. Retailers typically were supplied by several distributors, so that those offering retailers additional promotions could expect to reap a competitive advantage. According to Fineman, the tag also reduced overhead costs associated with promotions because it enabled distributors to reach their retailers efficiently and simultaneously, and eliminated the need for individual visits to each retail customer.\n\nFineman's corporation, The Industry Network System (TINS), marketed its monthly video magazine to floor covering retailers through their distributors. TINS conducted sales training for each distributor prior to \"launching\" an intensive four to six-week sales effort by that distributor's sales force. In exchange for paying a marketing rights fee to TINS, these distributors were promised commissions or royalties based upon subscriptions and video equipment sold.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In addition, Fineman assured the distributors that their tags would generate increased sales without additional overhead, thus yielding substantial \"incremental profits.\"\n\nBecause Armstrong distributors typically employ more salespersons than distributors of other floor covering products, TINS especially targeted them as its distributors. TINS asserts that signing up Armstrong distributors for TINS was critical: in addition to being a leading manufacturer of resilient, Armstrong distributors typically maintain a sales force specialized in selling only Armstrong products. For this reason, Armstrong distributors by and large employ more salespersons than non-Armstrong distributors, ensuring TINS access to a greater number of retailers through Armstrong distributors.\n\nTINS successfully signed up two Armstrong distributors. When a third prospect voiced concern that Armstrong might not approve of TINS, Fineman contacted Armstrong's Lancaster, Pennsylvania headquarters and on September 7, 1983, spoke to James Humphrey, Armstrong's general manager of Sales and Marketing for the Floor Division, to explain the TINS format and its potential for Armstrong distributors. See J.A. at 7518 (Humphrey's handwritten notes of conversation outlining TINS format and naming distributors contacted). Fineman testified that at this time he was unaware of Armstrong's plans to enter the video market but he later learned that Armstrong was several years behind TINS in the development of a video network. J.A. at 1898-1901.\n\nHumphrey voiced four concerns about TINS to his superior, Dennis Draeger, Armstrong's vice president of floor covering operations. First, TINS' offers of exclusive territory to distributors might conflict with Armstrong's policy of not favoring any single distributor within a geographic area, or maintaining a \"level playing field\" among its distributors. Second, Humphrey believed that involving Armstrong's distributor's salespersons in selling TINS would interfere with Armstrong's strong preference for maintaining specialized sales forces. Third, the TINS magazine would highlight many products that competed with Armstrong's. Fourth, Armstrong voiced concern over equipment incompatibility. It had plans for a video program that would employ Sony \"Betamax\" equipment whereas the TINS magazine used a VHS format. J.A. at 3735-36.\n\nSubsequent to this telephone call, Humphrey disseminated the following memorandum to Armstrong's Floor Division District Managers on September 12, 1983:\n\nThere is a possibility some of your wholesalers might contact you regarding a new video based retail floor covering communication program being introduced called \"TINS.\" The program is being presented to independent wholesalers throughout the country for sale to floor covering retailers in specific territories. The objective is to establish a network of retailers who will utilize various video based programs on a monthly basis. The system would also allow for some localized wholesaler presentation, which the wholesaler must produce locally.\n\nWe feel the \"TINS\" program will require a considerable amount of selling time on the part of wholesaler salesmen, which could be better utilized selling [Armstrong products]. At the same time, we feel this program conflicts with our future video plans and would not prove to be in our best interest.\n\nWe have heard that the organization selling \"TINS\" has stated that several Armstrong wholesalers have already purchased the system and will be selling it to their customers. To the best of our knowledge, no Armstrong Floor Division wholesaler has committed to the \"TINS\" system. Some have been approached; however, they haven't agreed to merchandise the system.\n\nJ.A. at 7280. A September 27, 1983 memo from Armstrong's New York Regional Manager of the Carpet Division, Robert Guzinsky, to his distributor sales managers parroted much of Humphrey's memo.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e A third memorandum sent to Armstrong marketing representatives in the Detroit area from their district manager, dated October 23, 1983, was largely excerpted from Humphrey's memo.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e J.A. at 7591.\n\nFineman responded, in the fall of 1983, by threatening Armstrong with an antitrust lawsuit. The dispute culminated in a settlement agreement. Drafted in January 1984, the settlement agreement was signed by Fineman in March of 1984, after a \"trial period\" in which Fineman signed up three Armstrong distributors and satisfied himself that Armstrong would not continue to interfere with his marketing of TINS. In general terms, the settlement agreement required Armstrong Vice President Dennis Draeger to notify Armstrong's district managers that it had no objection to TINS and required him to send a letter to a list of its distributors explaining that it had no objection to their distributing the TINS magazine. In addition, Fineman could request that Armstrong send a similar letter to prospective TINS distributors.\n\n3. Stern \u0026 Company\n\nAt the crux of this lawsuit is an Armstrong distributor's change of heart with respect to the TINS magazine. On May 24, 1984, after TINS' settlement negotiations with Armstrong, Fineman and TINS salesman John Wolfe met with Alan Abrahamson, president of Stern \u0026 Company, and with Stern's three sales managers: Ken Cloud, John Fischer, and Gray Owen. After receiving Fineman's sales pitch, Abrahamson and his sales managers conferred and agreed to distribute TINS. Abrahamson testified that his sales managers were divided in their support for TINS: Fischer, the resilient sales manager, did not favor TINS, Owen, the carpet manager, slightly favored TINS; and Cloud, the new ceramic manager, highly favored TINS. J.A. at 4286. Abrahamson favored TINS and agreed to sign the letter of intent. See J.A. at 7865.\n\nFineman assessed distributor marketing rights for Stern at $16,000. After Abrahamson explained that Stern was undergoing some financial difficulty, Fineman required only a 25 percent down payment on that day, J.A. at 1712, which constituted half of the standard 50 percent down payment ordinarily required at the time of the signing of the letter of intent. The balance was to be paid within four to six months. Abrahamson testified that he understood that the royalties from TINS sales received in the first six months would cover the initial $16,000 distributor rights fee. J.A. at 4290. There is no dispute that Stern would not receive exclusive marketing rights for TINS within its sales territory. J.A. at 4427. At that time Fineman and Abrahamson also discussed CFIPS and Abrahamson indicated his interest in receiving a proposal from Fineman for consulting work.\n\nAs will later be detailed at length, Abrahamson informed TINS' John Wolfe, following the TINS sales training of Stern's salesmen, that Stern was withdrawing from TINS. TINS relies heavily for its tortious interference and antitrust conspiracy claims on two communications from Armstrong that intervened between Stern's letter of intent and discontinuance of the TINS program. First, during a June 7th meeting, at which Abrahamson and Armstrong's regional sales manager for resilient Robert Roth were present, TINS was discussed for approximately 10-15 minutes, and Roth told Abrahamson that TINS would not \"make a lot of sense in the Armstrong scheme of things\" because Armstrong has an \"overlap program.\" J.A. at 4084.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Second, Armstrong executive Humphrey sent a memo dated June 12, 1984, to all Armstrong floor division managers explaining what field managers should tell distributors about Armstrong's \"participation\" with TINS: that Armstrong would be \"unable to offer any assistance\" to that distributor. J.A. at 7323.\n\nAs a result of Stern's withdrawal, TINS lacked the capital required to produce the videotapes already under contract. TINS ultimately was forced to dissolve its operations. Fineman then threatened to sue Stern for breach of contract and Stern threatened to counterclaim on the basis that TINS had violated the registration and disclosure requirements of the Connecticut Business Opportunity Investment Act, Conn. Gen. Stat. §§ 36-503 to 36-521, and that the Connecticut Act barred TINS from enforcing the letter of intent. J.A. at 8553-55. TINS and Stern settled their dispute on August 9, 1984, and executed a mutual release of liability. J.A. at 8557.\n\nB. Procedural History\n\nIn September of 1984, Fineman and TINS filed suit against Armstrong World Industries, Inc. in the United States District Court for the District of New Jersey, alleging generally that Armstrong had influenced Stern to breach its contract with TINS in an effort to drive TINS from the market for video magazines in the floor covering industry. In a five count complaint, the plaintiffs sought compensatory, punitive, and treble damages as well as interest, costs, attorneys fees and injunctive relief.\n\nCount One alleged that Armstrong had violated section 1 of the Sherman Act by \"pressuring, persuading and otherwise influencing its independent distributors not to deal with, and indeed to break agreements with, the plaintiffs, thereby cutting off a critical supply of distributors to the plaintiffs.\" Compl. P 25. Count Two alleged a violation of section 2 of the Sherman Act, asserting that Armstrong possessed monopoly power in the resilient floor covering market which it exercised in an attempt to monopolize a market defined as \"consisting of the sale of video magazines to retailers of the floor covering industry [and other interested entities].\" Compl. PP 8; 31-32. For the remaining counts, brought pursuant to the laws of New Jersey and Pennsylvania, the plaintiffs asserted the federal court's pendent or diversity jurisdiction. Count Three alleged that Armstrong's conduct constituted a breach of the 1984 settlement agreement between TINS and Armstrong. Compl. P 35. Counts Four and Five alleged intentional interference with contract, Compl. P 37, and a violation of the New Jersey antitrust laws, respectively. Compl. P 39. During trial, when Fineman pressed individual antitrust and tort claims that had not been clearly delineated as counts in the complaint, the district court ruled that the complaint fairly stated Fineman's individual tortious interference claim but rejected his individual antitrust claims.\n\nOn May 25, 1988, the district court granted partial summary judgment in favor of Armstrong, dismissing the breach of contract claim and all claims related to Armstrong distributor Nelson \u0026 Smallin. A lengthy jury trial then ensued and at the close of plaintiffs' case, the district court directed a verdict for Armstrong on the Sherman Act section 1 claim, concluding that as a matter of law, co-conspirators in a vertical relationship with one another could not share the requisite anticompetitive motive for an agreement prohibited under section 1. The district court dismissed Fineman's individual antitrust claims, a ruling which has not been appealed, but permitted the jury to decide Fineman's individual tort claim, although the court excluded punitive damages on that claim. J.A. at 6828-29.\n\nOn April 19, 1991, the jury returned a verdict for the plaintiffs on all the remaining counts. Specifically, it awarded $19.5 million to TINS on its section 2 antitrust claims and $17.7 million to TINS and $2.275 million to Fineman, individually, on their respective tortious interference claims.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The jury also awarded TINS punitive damages of $200 million. Subsequently, the district court ordered that when the judgment became completely final after all post-trial motions and appeals, TINS would have to elect to recover damages under either the antitrust or the tort causes of action. Finally, in a ruling not challenged on appeal, the district court dismissed Armstrong's counterclaims against TINS and Fineman. J.A. at 89-108.\n\nOn June 20, 1991, the district court granted Armstrong's motion for judgment n.o.v. on the tort and antitrust claims which the jury resolved in favor of the plaintiffs. Fineman v. Armstrong World Indus., Inc., 774 F. Supp. 225 (D.N.J. 1991). In the alternative, the district court also conditionally granted a new trial because it found that the verdict was against the weight of the evidence and that the plaintiffs' trial counsel's improper summation grossly prejudiced and inflamed the passions of the jury. The plaintiffs appeal from these final orders requesting essentially that we reinstate the jury's verdict. We turn, initially, to the entry of judgment n.o.v., which we will reverse in part, and then, in Part V, to the alternative grant of a new trial, which we will affirm.\n\nIII. Tortious Interference\n\nIn this section, we address the tortious interference claims. In Part A, we discuss the question of whether Armstrong waived its grounds for judgment n.o.v. In Part B, we deal with the defendant's contention that the TINS/Stern settlement bars any claims arising out of these facts. Part C begins our substantive Discussion of the tort claim and in Part D we examine a Connecticut statute to determine whether the plaintiffs have satisfied the element of reasonable expectation of economic advantage. In Part E, we reach the question of the sufficiency of the evidence on the tort claims, and in Part F, we address Fineman's individual tort claim; and finally, in Part G, we address punitive damages.\n\nA. Waiver\n\nThe plaintiffs pose a threshold procedural question: whether Armstrong properly preserved its contention that TINS and Fineman individually failed to present sufficient evidence of their tortious interference claims such that the district court's grant of judgment n.o.v. on these grounds violated the plaintiffs' Seventh Amendment right to a jury trial. Because the claims of each plaintiff were addressed separately at trial, we will discuss each in turn.\n\n1. TINS\n\nThe district court reasoned that judgment n.o.v. on TINS' tortious interference claim was appropriate because TINS had failed to prove that the Connecticut Business Opportunity Investment Act did not bar its tort claim and because TINS had not produced sufficient evidence of wrongful conduct by Armstrong nor that this conduct was the proximate cause of its injury. On appeal, TINS contends that Armstrong failed to preserve these issues in its oral motion for directed verdict. The district court concluded that it had preserved these grounds. Fineman, 774 F. Supp. at 230.\n\nIn order to preserve an issue for judgment n.o.v., the moving party must timely move for a directed verdict and specify the grounds for that motion. FRCP 50(a); Bonjorno v. Kaiser Aluminum \u0026 Chem. Corp., 752 F.2d 802, 814 (3d Cir. 1984), cert. denied, 477 U.S. 908, 91 L. Ed. 2d 572, 106 S. Ct. 3284 (1986); Mallick v. Int'l Bhd. of Elec. Workers, 644 F.2d 228 (3d Cir. 1981); Orlando v. Billcon Int'l, Inc., 822 F.2d 1294, 1298 (3d Cir. 1987). Absent a motion in accordance with Federal Rule of Civil Procedure 50(a), judicial reexamination of the evidence abridges the plaintiff's Seventh Amendment right to a trial by jury. As explained in Lowenstein v. Pepsi-Cola Bottling Co., 536 F.2d 9, 11 (3d Cir.), cert. denied, 429 U.S. 966, 50 L. Ed. 2d 334, 97 S. Ct. 396 (1976), to enter a judgment notwithstanding the verdict in the absence of a proper motion for a directed verdict \"is simply to ask the court to reexamine the facts already tried by the jury and this the court may not do without violating the Seventh Amendment.\"\n\nRequiring compliance with Rule 50(a)'s commandment that \"[a] motion for a directed verdict shall state the specific grounds therefor\" additionally ensures that the party bearing the burden of proof will have an opportunity to buttress its case before it goes to the jury and the moving party will not gain an unfair advantage through surprise. Orlando, 822 F.2d at 1294; see Levinson v. Prentice-Hall, Inc., 868 F.2d 558, 562 (3d Cir. 1989) (the purpose of moving for a directed verdict before judgment notwithstanding the verdict is to afford the opposing party an opportunity to cure defects in its proofs prior to submission of the case to the jury); see also Bradford-White Corp. v. Ernst \u0026 Whinney, 872 F.2d 1153, 1161 (3d Cir.), cert. denied, 493 U.S. 993, 107 L. Ed. 2d 539, 110 S. Ct. 542 (1989).\n\nTINS does not suggest that Armstrong failed to request a directed verdict timely; indeed the record reflects that Armstrong orally moved for a directed verdict at both the close of the plaintiffs' case and at the close of all of the evidence. J.A. at 3612; 6716. Rather TINS rests its waiver argument on the second requirement, namely that Armstrong failed to specify adequately that with respect to TINS' tortious interference claim, its motion rested partly upon insufficiency of the evidence.\n\nThe record reveals that Armstrong's counsel moved for a directed verdict at the close of the plaintiffs' case on grounds that the record was critically deficient of evidence of coercion and that the tort claims could not be maintained in light of the Connecticut Act. Although the oral argument on this directed verdict motion focused primarily on the effect of the Connecticut Act and the antitrust claims, Armstrong's counsel stated that \"I will come back to the factual aspects of our position [on] the inducement claim. We don't believe there is sufficient evidence of coercion here to sustain that claim.\" J.A. at 3587-88. During the course of that argument, Armstrong's counsel did not return to that contention in the context of discussing the tort claim. Later, during the oral argument on its renewed motion for directed verdict at the close of all of the evidence, Armstrong returned to the theme that the plaintiffs had not adduced evidence that Armstrong's conduct did not constitute legitimate business activity. J.A. at 9103. Although this issue was raised in connection with the antitrust claim, it also applied to the argument concerning the tort claims. The record thus clearly supports the district court's Conclusion that Armstrong had properly preserved each of these grounds. Fineman, 774 F. Supp. at 230.\n\nWhile it is true that Armstrong's counsel could more clearly have identified the grounds for directed verdict by intoning the words \"insufficiency of the evidence on the tortious interference claim,\" or more elaborately arguing that ground, we conclude that Armstrong's counsel did argue the factual components of an insufficiency of the evidence claim in terms which adequately apprised the district court and plaintiffs' counsel of the reasons for its motion. Because Armstrong raised the factual components, plaintiffs' counsel was clearly on notice of the legal rubric under which Armstrong planned to proceed.\n\nThis case is distinguishable from Orlando, in which the motion for directed verdict was premised solely upon a liability issue but judgment n.o.v. was sought on a damages issue. Orlando, 822 F.2d at 1298. Our reasoning in Orlando, that the plaintiff was not given notice that the adequacy of the proof of damages was disputed since the motion for directed verdict rested solely on the insufficiency of the evidence to prove unlawful interference, id., is not implicated here. Rather, this case more closely follows Acosta v. Honda Motor Co. Ltd., 717 F.2d 828 (3d Cir. 1983). In Acosta we recognized that defense counsel should have been more explicit in stating the grounds for its directed verdict motion. We nonetheless held that the communicative content, \"'specificity' and notice-giving function of an assertion should be Judged in context.\" Id. at 832 (citation omitted). Moreover, we noted that plaintiff's counsel and the district court had both \"understood and responded\" to defense counsel as if he had been more specific. Id. The same is true in this case where the district court ruled, prior to acquiring a transcript, that the issues had been preserved.\n\n2. Fineman Individually\n\nWith respect to his individual tortious interference claim, Fineman contends that Armstrong also failed to preserve the issue of insufficiency of the evidence in its motion for directed verdict. The resolution of this claim rests upon the unique factual circumstances here and the evolution of Fineman's individual tort claim during the trial. Armstrong responds that Fineman posed his individual claim for tortious interference for the first time after the district court dismissed his individual antitrust claims, which followed the close of the plaintiffs' case and Armstrong's initial timely motion for directed verdict. In support of this position, Armstrong contends that both the complaint and the pretrial statement contain only an individual antitrust claim and that Fineman retooled his individual claim to aver tortious interference after the district court dismissed his individual antitrust claim. Because the individual tort claim surfaced after Armstrong's initial directed verdict motion, Armstrong contends that it could not have waived its objections at that time.\n\nAlthough Fineman's individual tort claim may have been inartfully pleaded,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e by April 1, 1991, after several months of trial, the district court had ruled that it was a viable claim, prompting Armstrong, during its renewed motion for directed verdict at the close of all the evidence, to raise \"two main grounds\": (1) Fineman was not a party to the Stern-TINS contract, and (2) New Jersey law does not provide for a tortious interference claim by a non-party. J.A. at 9057-58.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Given the manner in which this claim developed at trial, we cannot fault Armstrong for having failed to move for directed verdict upon this claim until the close of the evidence and hold that these grounds for judgment n.o.v. on this claim were adequately preserved.\n\nB. The TINS-Stern Settlement\n\nBefore reaching the merits of the tortious interference claim, we must also briefly address Armstrong's contention that the plaintiffs' tort claims are barred by the TINS-Stern release executed in the fall of 1984. After Fineman threatened to sue Stern for the additional $4,000 unpaid deposit, Stern voided the letter of intent, threatened to report TINS to the Connecticut Commissioner of Banking for failing to register under the Connecticut Act, and threatened to counterclaim for the return of Stern's $4,000 deposit. J.A. at 4328-30; 8553-55. TINS and Stern ultimately executed a mutual release of all claims arising out of the letter of intent, in which TINS received $1.00 \"and other good and valuable consideration.\" J.A. at 8556-58; 8557. This settlement released Stern and its \"assigns\" without mention of Armstrong.\n\nArmstrong suggests that where two parties to a contract enter into a settlement agreement mutually discharging them from any liability under the contract, one of those parties may not then seek recovery against a third party for tortious interference with that contract. Armstrong has not provided any New Jersey caselaw to support its position and we conclude that the New Jersey Supreme Court would not bar this action.\n\nThe New Jersey Supreme Court has evidenced its preference to permit an injured plaintiff the opportunity to settle with one tortfeasor without jeopardizing its ability to seek nonduplicative recovery from another tortfeasor. In Breen v. Peck, 28 N.J. 351, 146 A.2d 665 (N.J. 1958), involving tortious interference with a brokerage agreement, the New Jersey Supreme Court ruled that the plaintiff could seek recovery against one joint tortfeasor after settling with the other joint tortfeasor. It rejected the English Release Rule, under which settlement with one tortfeasor precludes subsequent recovery from any other joint tortfeasors, reasoning that that rule shortchanges the claimant and overcharges the person who settles. Id. at 668. Adopting a view attuned to encouraging fair settlements, the court in Breen ruled that a plaintiff could sue non-settling tortfeasors until full satisfaction was obtained. Id. at 672-73. The rationale of Breen entitles a plaintiff \"to pursue all those who are independently liable to him for his harm until one full satisfaction is obtained.\" McFadden v. Turner, 159 N.J. Super. 360, 388 A.2d 244, 246 (N.J. App. Div. 1978).\n\nThere is no claim that TINS received full satisfaction from the release with Stern. Whereas TINS threatened suit against Stern for $4,000 (the half of Stern's deposit that had been deferred) and Stern threatened to counterclaim for the $4,000 it had paid, TINS sought much more than $4,000 in lost profits as consequential damages for the destruction of its business as an alleged result of Armstrong's interference. Thus Armstrong's reliance upon IMAF S.p.A. v. J.C. Penney Co., (S.D.N.Y. Apr. 24, 1991) in support of its theory of a bar is misplaced. There the identical damages had been sought against both the breaching party and the tortfeasor, and the court determined that by its own terms the settlement expressly provided that IMAF was fully compensated even though it had not received payment.\n\nGiven New Jersey's strong policy in favor of permitting an injured party to seek full recovery from each tortfeasor, we decline to invoke a contrary rule from a different jurisdiction. See Swift v. Beaty, 39 Tenn. App. 292, 282 S.W.2d 655, 659 (Tenn. App. 1954). We conclude that the plaintiffs are not barred by the TINS-Stern settlement from bringing their tortious interference claims against Armstrong.\n\nC. Tortious Interference Claims Under New Jersey Law\n\nWe turn now to the substance of the tortious interference claims, which are governed by New Jersey law. Under New Jersey law, the five elements of a claim of tortious interference with a prospective business relationship are: (1) a plaintiff's reasonable expectation of economic benefit or advantage, (2) the defendant's knowledge of that expectancy, (3) the defendant's wrongful, intentional interference with that expectancy, (4) in the absence of interference, the reasonable probability that the plaintiff would have received the anticipated economic benefit, and (5) damages resulting from the defendant's interference. Printing Mart-Morristown v. Sharp Elec. Corp., 116 N.J. 739, 563 A.2d 31, 37 (N.J. 1989); see Restatement (2d) of Torts § 766B.\n\nArmstrong does suggest, however, that in a competitive business context a plaintiff asserting a claim of tortious interference must meet a heightened evidentiary requirement akin to the proof required for an antitrust claim. See Matsushita Elec. Indus. Co. v. Zenith Radio Corp., 475 U.S. 574, 587-88, 89 L. Ed. 2d 538, 106 S. Ct. 1348 (1986); Edward J. Sweeney \u0026 Sons, Inc. v. Texaco, Inc., 637 F.2d 105 (3d Cir. 1980), cert. denied, 451 U.S. 911, 68 L. Ed. 2d 300, 101 S. Ct. 1981 (1981). In the antitrust arena, \"conduct as consistent with permissible competition as with illegal conspiracy does not, standing alone, support an inference of antitrust conspiracy.\" Matsushita, 475 U.S. at 588 (explaining the holding in Monsanto Co. v. Spray-Rite Serv. Corp., 465 U.S. 752, 764, 79 L. Ed. 2d 775, 104 S. Ct. 1464 (1984)). Where a defendant's allegedly illegal activity may stem from either procompetitive or anticompetitive objectives, inquiry must be made to determine whether a permissible inference can be drawn in favor of the plaintiff. See, e.g., Matsushita, 475 U.S. at 590 (a twenty-year conspiracy to set predatory prices could not be logically inferred because the losses sustained could never have been recouped); Monsanto, 465 U.S. at 765 (an illegal conspiracy to eliminate a competitor could be permissibly inferred on that record). Armstrong asserts that neither federal antitrust nor New Jersey tort laws were intended to stifle competitive activity; thus, a heightened evidentiary standard will provide protection from liability to defendants who simply engaged in the pursuit of legitimate marketplace competition.\n\nAnalogizing to antitrust cases, Armstrong alleges that the requirement of \"'wrongful' conduct involving 'malice', which is defined as the intentional doing of a wrongful act 'without justification or excuse'\" interjects a heightened standard into a tortious interference claim under New Jersey law. Appellee's Brief at 21 (citations omitted). See Printing Mart, 563 A.2d at 40 (identifying the pivotal question as whether the defendant's conduct is \"sanctioned by the rules of the game\"). Armstrong does not cite to any New Jersey caselaw directly supporting its heightened standard of proof, however, and we have found none. Assuming, arguendo, that antitrust law requires such a standard, cf. Eastman Kodak Co. v. Image Technical Services, Inc., 119 L. Ed. 2d 265, 112 S. Ct. 2072, 2083 (1992) (\"Matsushita demands only that the nonmoving party's inferences be reasonable in order to reach the jury, a requirement that was not invented, but merely articulated, in that decision\"), we are not persuaded that it should apply to a New Jersey tortious interference claim. Since the New Jersey courts examining this cause of action in a business context have not articulated a special burden of proof, we hesitate to do so.\n\nMoreover, we do not find New Jersey's cause of action for tortious interference to be unduly hostile to procompetitive conduct in any event. Indeed, the admittedly \"amorphus\" element of \"wrongful, unjustified conduct,\" is a flexible standard \"and must focus on a defendant's actions in the context of the case presented.\" Printing Mart, 563 A.2d at 40. This standard also includes directions to gauge the defendant's conduct against \"the rules of the game.\" Id. As formulated, New Jersey's wrongful conduct element adequately takes into consideration procompetitive conduct.\n\nWe reject Armstrong's assertion that \"it would be illogical to apply differing legal rules on permissible inferences for antitrust and tort claims where, as here, the very same conduct is challenged as both tortious interference and an antitrust violation.\" Although often applicable to a single dispute, tort and antitrust causes of action require widely divergent proofs. Moreover, these causes of action vindicate widely differing policies; the first is wholly personal to the plaintiff-competitor and the second requires the plaintiff to demonstrate harm to competition at large and antitrust injury. See Brunswick Corp. v. Pueblo Bowl-O-Mat, Inc., 429 U.S. 477, 486, 50 L. Ed. 2d 701, 97 S. Ct. 690 (1977). These divergent proofs and purposes readily account for any arguable differences in their standards of proof.\n\nD. TINS' Reasonable Expectation of Economic Advantage\n\nAlthough New Jersey law governs the tortious interference claim, the Connecticut Business Opportunity Investment Act, which requires registration and disclosure for certain kinds of business ventures, bears upon whether TINS could establish the first element of tortious interference: a reasonable expectation of economic advantage arising from TINS' agreement with Connecticut-based Stern. Because neither party challenges the ruling of the district court that New Jersey courts would look to the law of the situs of the contract in making that determination, we will examine the Connecticut Act to determine whether the agreement between TINS and Stern could have created a reasonable expectation of business advantage.\n\nThe district court held that the Connecticut Act applied to TINS and that because TINS had not registered with Connecticut's Banking Commissioner nor made other efforts to comply with the Act, the TINS-Stern letter of intent was void as a matter of public policy. Therefore it would have been unenforceable by TINS and could not support a claim for tortious inference with that prospective contract against a third party. The plaintiffs claim that the district court erred when it applied the Connecticut Act to defeat, as a legal matter, TINS' reasonable expectation of economic benefit in the Stern-TINS letter of intent.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In this appeal TINS raises only two discrete arguments with respect to the application of the Act; therefore, we will only consider those two issues.\n\n1. The Connecticut Business Opportunity\n\nInvestment Act\n\nThe Connecticut Act, effective in 1979, was enacted to prevent misrepresentations and fraudulent practices in business opportunity investment sales. Brian J. Woolf, Connecticut Business Opportunity Investment Act: An Overview of Its Regulatory Requirements and Its Interface with the Federal Trade Commission's Rule Entitled \"Disclosure Requirements and Prohibitions Concerning Franchising and Business Opportunity Ventures\", 54 Conn. Bar J. 415 (1980) (hereinafter \"Overview\"). In enacting the statute, the Connecticut legislature sought to regulate \"business opportunities\" that may be peddled by \"high pressure salesmen who flash in and out of motel rooms and are gone before an investor knows he's been fleeced,\" id. at 416 (quoting 12 Continental Franchises Rev. No. 10 at 1 and 2 (June 11, 1979)), by requiring \"sellers\" of \"business opportunities\" in Connecticut to register with the Connecticut Banking Commissioner and provide disclosure of specified information to prospective \"purchasers-investors.\" A \"business opportunity\" is defined as:\n\nConn. Gen. Stat. § 36-504(6) (emphasis added).\n\nA seller who fails to register under the Act is prohibited from selling business opportunities within Connecticut.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe Act also affords prospective protection and retrospective avenues of relief for a purchaser-investor of a business opportunity. For example, at a specified time prior to the sale of a business opportunity, the seller must disclose specific information to the purchaser-investor including a financial statement. Conn. Gen. Stat. § 36-506. In addition the Act requires that the seller document any representations of potential profits. Woolf, Overview, supra, at 427. Retrospective avenues of relief afforded an injured purchaser-investor include both civil and criminal remedies. Id. at 429-30. Specifically, an injured purchaser-investor may sue for recovery of damages including attorneys' fees or may bring an action against a bond or trust account which is a prerequisite for registration for certain sellers. Conn. Gen. Stat. § 36-517(a), (b), (d).\n\nIf the seller has violated the Act by failing to disclose, to perform, or by making misrepresentations, the Act expressly makes voidable at the purchaser-investor's option any contract entered into by a seller:\n\nIf a business opportunity seller . . . fails to give the proper disclosures in the manner required by § 36-506 . . . then within one year of the date of the contract, upon written notice to such business opportunity seller, the purchaser-investor may void the contract and shall be entitled to receive from such business opportunity seller all sums paid to such business opportunity seller.\n\nConn. Gen. Stat. § 36-517(a) (emphasis added).\n\n2. The Void-Voidable Distinction\n\nTINS contends that the Connecticut Act operates only to make voidable, at the purchaser-investor's option, a contract in violation of the Act's requirements. TINS argues that the district court improperly negated the distinction between void and voidable contracts under the Act in holding that the TINS-Stern letter of intent constituted a contract void as against the public policy enshrined in the Connecticut Act. The district court acknowledged that the Connecticut Act gives the purchaser an option to void the contract with a seller who failed to comply with the Act's requirements. Fineman, 774 F. Supp. at 241. According to the district court, \"the Connecticut Act specifically treats a contract voided at the option of the buyer as a void contract by eliminating all claims based thereon.\" Id. Thus it ruled that, lacking an enforceable economic expectation as a matter of law, TINS did not prove the requisite reasonable expectation of business advantage because Stern voided the letter of intent.\n\nNew Jersey law, which we apply to the claim of tortious interference, clearly provides that voidable contracts may still afford a basis for a tort action when the defendant interferes with their performance. Harris v. Perl, 41 N.J. 455, 197 A.2d 359, 363 (N.J. 1964). Given this rule, TINS' tortious interference claim against Armstrong is not defeated simply because Stern withdrew and voided the letter of intent. The facts of this case clearly demonstrate the wisdom of this rule; otherwise a third party could easily insulate itself from liability for its tortious acts.\n\nThe Connecticut Act implicitly distinguishes between voidable and void contracts. It eliminates all claims of the seller, rather than \"all claims\" as the district court inferred:\n\nNo person who has made or engaged in the performance of any contract in violation of any provision of this chapter or any regulation or order adopted or issued under this chapter, or who has acquired any purported right under such contract with knowledge of the facts by reason of which its making or performance was in violation, may base any cause of action on the contract.\n\nConn. Gen. Stat. § 36-517(h). While this provision might have precluded TINS from enforcing the letter of intent against Stern, it would not have precluded Stern from enforcing the letter of intent against TINS had Stern so wished. Supporting this construction of the Connecticut Act is section 36-517(i), which is the sole provision declaring a contract void:\n\nAny condition, stipulation or provision binding any person acquiring any business opportunity to waive compliance with any provision of this chapter or any regulation or order adopted or issued under this chapter is void.\n\nIf the incipient contract was not void but merely voidable at Stern's option, then it would not be impossible, as a matter of law, to prove that TINS could have reasonably expected Stern to carry out the contract. Although there was evidence that Stern had independent reasons to cancel the agreement, TINS presented evidence from which a jury could disbelieve those reasons and conclude instead that Stern's cancellation of the TINS program resulted from Armstrong's pressure. Stern's power to avoid the contract without legal liability would be irrelevant to TINS' economic expectations if, as the jury might have concluded, Stern lacked any independent intention of backing out of its agreement with TINS.\n\nAs nothing in the Connecticut Act would have precluded Stern from enforcing the letter of intent against TINS, and TINS has proffered sufficient evidence, if believed by a jury, that Stern voided the contract as a result of Armstrong's tortious interference, the Connecticut Act may not be applied to defeat the element of TINS' reasonable expectation of business advantage. Because the Connecticut Act did not deprive TINS as a matter of law of all expectations of economic gain, the district court erred in holding that TINS failed to prove a reasonably expected economic benefit.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nE. Sufficiency of the Evidence of Tortious Interference\n\nThe district court granted judgment notwithstanding the verdict on TINS' tortious interference claim, reasoning that the record lacked sufficient evidence of wrongful conduct by Armstrong and causation. While the plaintiffs' evidence is less than overwhelming, see infra at Part V.B., we do find that the plaintiffs have produced that minimum quantum of evidence necessary to withstand a motion for judgment n.o.v.\n\nWe apply a plenary scope of review to a judgment n.o.v. In so doing, we must be especially vigilant to keep foremost the question whether there is sufficient evidence of record to sustain the verdict of the jury. Acosta, 717 F.2d at 841-42. Reviewing the record in the light most favorable to the non-moving party, judgment n.o.v. may not stand \"unless the record is 'critically deficient of that minimum quantum of evidence from which the jury might reasonably afford relief.'\" Link v. Mercedes-Benz of N. Am., Inc., 788 F.2d 918, 921 (3d Cir. 1986) (citations omitted); see also Kinnel v. Mid-Atlantic Mausoleums, Inc., 850 F.2d 958, 961 (3d Cir. 1988). We must refrain from passing judgment on credibility issues; our task is to examine the record dispassionately for any evidence from which the jury may have rendered its verdict.\n\nIt is axiomatic that this scope of review requires that we draw all reasonable inferences in favor of the non-moving party, here the plaintiffs. Because the plaintiffs offer little direct evidence in this case, we are called upon to evaluate the reasonableness of inferences that may be drawn from circumstantial evidence. Adding to this already complex task, the plaintiffs seek to strengthen their largely circumstantial case with a theory that includes Armstrong's counsel in a conspiracy with Armstrong and Stern to cover-up their alleged wrongdoing.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The plaintiffs seek not only to discredit the credibility of Armstrong's witnesses and the defense's theory of the case, but actually to substantiate their case by decimating the credibility of Armstrong's counsel. In light of this situation, we realize our obligation to ascertain at each step of the way whether the plaintiffs have offered sufficient \"affirmative\" and \"concrete evidence\" to defeat judgment n.o.v. See Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 256, 91 L. Ed. 2d 202, 106 S. Ct. 2505 (1986). \"Discredited testimony is not considered a sufficient basis for drawing a contrary Conclusion.\" Bose Corp. v. Consumers Union of United States, Inc., 466 U.S. 485, 512, 80 L. Ed. 2d 502, 104 S. Ct. 1949 (1984); see also Tose v. First Pennsylvania Bank, N.A., 648 F.2d 879, 894 (3d Cir.), cert. denied, 454 U.S. 893, 70 L. Ed. 2d 208, 102 S. Ct. 390 (1981).\n\nAt trial, TINS portrayed Stern as a financially vulnerable company that was highly dependent upon Armstrong, who supplied Stern with 100 percent of its resilient inventory, and whose products contributed 90 percent of Stern's total revenue. J.A. at 4359-60. But see J.A. at 3022 (60-70% of Stern's resilient business was comprised of Armstrong products; 80-85% of Stern's total business derived from Armstrong). It is undisputed that Stern had undergone substantial growth preceding its involvement with TINS and was suffering from undercapitalization. As a result, Armstrong's credit department in Lancaster had listed Stern as a \"risk\" account from March through November of 1984, J.A. at 7519-57, had placed a lien on Stern's inventory in November of 1983, J.A. at 7557; 7563-68, and requested of Abrahamson a personal guarantee on all materials ordered from March of 1984 onward. J.A. at 7559. It is undisputed that Abrahamson did not give this personal guarantee until sometime in 1985.\n\nAgainst this backdrop, on May 24, 1984, Fineman approached Abrahamson to distribute the TINS magazine and suggested that Stern could make significant additional profit from the venture. Fineman promised Stern royalties of $29,000 in the first year\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and profit on additional sales generated by the tag advertisements at about 10 to 15 percent of Stern's $11 million annual sales. J.A. at 2517. Fineman testified that Abrahamson acted enthused about the TINS magazine and interested in the possibility of hiring CFIPS to perform consulting work as well. After negotiations, Abrahamson paid one quarter of the $16,000 distributor fee established by TINS and signed the letter of intent.\n\nFollowing this meeting, TINS' Director of Distributor Relations, Carolann Arena, furnished Stern with a \"critical step list\" outlining actions that Stern needed to take prior to and during the program \"launch,\" the four to six week sales blitz by distributors' salesmen to their retail customers. Although Stern fulfilled some of those steps, for example by ordering video equipment from RCA on May 31, the plaintiffs alleged it failed to follow through on others. They note that Abrahamson had not arranged for a local production studio to film Stern's monthly tag nor had Stern's sales force made appointments to present TINS to their retailers prior to the sales training. This greatly concerned Arena, who testified that no other distributor had disregarded these steps, and consequently she telephoned Abrahamson on several occasions between the end of May and June 20th to discuss these \"critical steps.\" J.A. at 8594-8601. Armstrong countered that Stern had complied with TINS' written instructions: 1) Stern salesmen planned to make appointments with their retailers on the Saturday, June 23, prior to the launch, and 2) because the critical step list specified that production studio arrangements were to be made during the launch, Abrahamson was not derelict in his responsibilities to TINS by Friday, June 22.\n\nOn June 5, 1984, Abrahamson and his three sales managers, Fischer, Owen and Cloud, traveled to TINS' Paramus, New Jersey headquarters for the shooting of their first TINS tag, which was to be placed at the end of the demonstration tape that Stern's salesmen would show potential retail subscribers during the sales launch. On their tag, the Stern people read scripted lines from a teleprompter that had been provided by TINS in which they portrayed Stern as an \"exclusive\" TINS distributor for their territory. See J.A. 7271-72. Fineman, Arena, and Gail Ferrar, vice president of TINS, all testified that the Stern group was shown the June 1984 edition of the TINS magazine during that visit and that they reacted positively to it. J.A. at 4296; 8677; 8593; 3512-14. To the contrary, Armstrong witnesses Abrahamson and Fischer testified that they viewed a TINS demonstration tape but deny having seen an actual edition of the TINS magazine at that time. J.A. at 4296; 5006. The trip was otherwise uneventful and the Stern group filmed its tag and returned to Connecticut.\n\nA crucial event in the alleged conspiracy between Stern and Armstrong took place just two days later on June 7, 1984, when Abrahamson met with his Armstrong district managers for the resilient division, Robert Roth, and carpet division, Robert Guzinsky, to discuss ways in which to increase Stern's profitability. During that meeting, Abrahamson mentioned that Stern had signed up to distribute the TINS magazine. J.A. at 4300. Guzinsky, who had written a previous memorandum describing TINS, asked \"What is it?\" J.A. at 4055. Abrahamson described the TINS concept. Guzinsky remarked that it \"sounded like a good idea,\" and expressed interest in obtaining video equipment from RCA at the discounted price. J.A. at 4048; 4302. Roth's comment is reflected in the following exchange:\n\nQ: Did you say to him Alan, I don't think this makes a lot of sense in the Armstrong scheme of things, given the fact that we do have our own video program that can help you increase your profitability, that type of thing?\n\n[Roth]: That's probably what I said because we have an overlap program.\n\nJ.A. at 4085. Abrahamson then explained that TINS filled a void in the Armstrong program. All parties to the meeting agree that the Discussion of TINS lasted no more than ten to fifteen minutes and Abrahamson did not recall any threat from Roth about Stern's participation. J.A. at 4301; 3052. TINS argues that Roth's comment violated the settlement agreement between TINS and Armstrong and supports a reasonable inference that Armstrong exercised improper influence and pressure upon Stern to withdraw from its agreement with TINS.\n\nTINS also suggested that a scheduled golf date between Abrahamson and Roth provided another opportunity for Roth to discourage Abrahamson from following through with TINS. Abrahamson's calendar indicates that he had planned to play golf with Roth on the following day although both Abrahamson and Roth denied playing golf. J.A. at 4298; 4050.\n\nOn June 12, 1984, James Humphrey, Armstrong's general manager of sales and marketing for the floor division, issued the following memorandum to Armstrong's district managers, which was marked \"confidential:\"\n\nWe are not in a position to evaluate the effectiveness of the TINS program; however, we feel that since all Armstrong wholesalers are not involved in the program, it would be improper [for] Armstrong to participate in the system. Therefore, if any wholesalers request Armstrong's participation, either on a local level or a national basis, you should inform them that we are unable to offer any assistance. You should make sure that your representatives are not involved in any sales presentations on this system or any other program not provided by Armstrong.\n\nJ.A. at 7323. TINS posits that this memorandum violated the terms of the TINS-Armstrong settlement agreement and sent a negative message to Armstrong distributors regarding TINS.\n\nThe TINS training of the Stern sales force began on Wednesday afternoon, June 20, 1984 and continued, as scheduled, until Friday, June 22. Prior to commencement of the Wednesday session, TINS' representative, John Wolfe, requested that Abrahamson add to the sales commission, or \"spiff,\" that TINS planned to offer Stern's sales force as an incentive to sign up more than five subscribers. J.A. at 4649. Abrahamson initially declined a proposal to contribute $20 toward a $50 spiff, which Wolfe testified was unusual, J.A. at 2273-75, but sensing his sales force's enthusiasm, Abrahamson softened and offered to pay $15 out of a $50 spiff to which Wolfe agreed. J.A. at 2355-58; 4307. According to Wolfe, Abrahamson explained to him that Stern was not receiving support from Armstrong. J.A. at 2277. The sales force was also shown a TINS \"demo tape,\" with which the sales force was pleased. J.A. at 4652. That evening, Wolfe showed some examples of distributor tags to Abrahamson and the managers. J.A. at 4308.\n\nThe following day, on Thursday, June 21st, Wolfe designated most of the day for training the sales force to sell retailers on the TINS program. This pitch included teaching Stern's sales force scripted responses to overcome potential objections and concerns of solicited retailers. Wolfe characterized Thursday as a \"typical, strong day.\" J.A. at 2278. Even by Abrahamson's account, the Stern sales force seemed \"very positive.\" J.A. at 4309; see also J.A. at 4653-54. Following the session, at 6:00 p.m., Wolfe played the June 1984 edition of the TINS magazine for Stern's sales force. After the showing, Stern's resilient manager Fischer warned Wolfe that he could anticipate questions the next day concerning the quality of the TINS magazine. J.A. at 2366; 5011-12.\n\nThat evening, per TINS' standard operating procedure, Stern's sales force and managers had arranged to meet at a restaurant for dinner and then to retire to a motel in order to practice roleplaying for the next day's session. Abrahamson testified that he joined the group at the restaurant but departed after being asked to leave so that the sales force could candidly discuss TINS. J.A. at 4311; 5012.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nOn Friday morning the sales training resumed, although Wolfe testified that Stern management no longer demonstrated involvement at that point. J.A. at 2279. The sales force raised concerns about the quality of the TINS magazine, but Wolfe characterized these as the usual sort of jitters, \"maybe more apprehension than normal, but nothing earth-shattering.\" J.A. at 2280-81. Wolfe responded to each concern in accordance with the TINS script; the sales force appeared to be satisfied and to regain their enthusiasm. One salesman, Phil Parizeau, even opined that TINS had \"tremendous value.\" J.A. at 2282-88.\n\nOne item outside the TINS script did arise that Friday morning, however, when Abrahamson demanded a non-negotiable, unconditional money back guarantee from TINS that Stern could offer to any unsatisfied retail customer. Wolfe and his assistant Paul Donofrio explained that they were not authorized to grant that request and, anxious to resume the seminar, Wolfe dodged the issue at that moment. J.A. at 5016-18. However, later, during the training seminar when the managers were not present, Wolfe represented to the sales force that if anyone had a problem with TINS, he could call Wolfe or Donofrio and either one would personally address those concerns and guarantee that customer's satisfaction -- \"whatever it took.\" J.A. at 2287; 2381-82. Wolfe promised the sales force \"satisfaction guaranteed\" and \"conditional money back,\" J.A. at 2379-83, but he admitted that he made no such promise to Abrahamson directly. J.A. at 2385-86.\n\nLate in the afternoon, after the sales force had met with Stern's management, Wolfe and Donofrio met with Stern's management for the last time. Abrahamson informed Wolfe, to his complete surprise, that TINS was \"dead in the water\" and Stern was withdrawing from the program. J.A. at 2293; 2385. Initially, Abrahamson provided two reasons: 1) lack of a money back guarantee and 2) his sales force's dissatisfaction with the program. J.A. at 4327. As Wolfe responded to each concern, Abrahamson voiced additional reasons. For example, Abrahamson explained that the sales force had been disappointed in the quality of the TINS magazine; Wolfe responded that one needed to evaluate the cumulative effect of a video medium. To address Abrahamson's concern that the program demanded too much managerial time, Wolfe responded that it would increase efficiency in the long run. J.A. at 2297-99. Abrahamson continued with a host of reasons until Wolfe despaired of winning him over. After approximately two hours, the meeting ended and Wolfe and Donofrio returned to New Jersey.\n\nThe following day, Fineman telephoned Abrahamson at his home and entreated him to reconsider his decision and even tried to entice Abrahamson with free CFIPS services to sweeten the deal. Abrahamson remained adamant and Fineman testified that Abrahamson indicated during their conversation that certain specials would not be made available to Stern by Armstrong. J.A. at 1908; 1911.\n\nViewing this evidence in the light most favorable to the plaintiffs, we conclude that TINS produced that minimum quantum of evidence required to sustain the jury's verdict. From the evidence produced at trial, the jury could draw an inference that Armstrong disapproved of its distributors engaging in selling the TINS magazine because it was several years behind in developing an \"overlap\" program and did not relish future competition for its video network. The jury could also have inferred that Stern's financial fragility led Abrahamson to perceive a threat in Roth's remarks about TINS as an \"overlap\" program and that Stern's financial dependence on Armstrong made Stern particularly susceptible to coercion. The jury may have inferred that Abrahamson's enthusiasm for TINS cooled after the June 7th meeting with Roth, as evidenced by Abrahamson's failure to procure a local production studio and the sales force's failure to make appointments with retail customers in advance of their training seminar. Given these inferences, the jury may also have disbelieved Armstrong's voluminous evidence that Stern's enthusiasm was chilled after viewing the June edition of TINS on Thursday evening and instead credited the plaintiffs' testimony that Stern management had viewed and enjoyed that edition of the TINS magazine on June 5th. Thus, the jury could have disbelieved that Abrahamson put the matter to a vote and followed the consensus, choosing rather to infer that Abrahamson simply trumped up a number of excuses and attempted to distance himself from responsibility for the decision.\n\nF. Fineman's Individual Tort Claim\n\nWe must next address whether Fineman may maintain an individual claim for tortious interference under the theory that Armstrong's alleged destruction of TINS damaged beyond repair Fineman's reputation as a floor covering industry consultant. The district court granted judgment n.o.v. on this claim, reasoning first, that it suffered derivatively from the same insufficiency of the evidence as TINS' tortious interference claim and alternatively, that Fineman had failed to prove \"either directly or by permissible inference, that Armstrong specifically intended to injure Fineman in his individual capacity when it allegedly interfered with the Stern/TINS relationship.\" Fineman, 774 F. Supp. at 250.\n\nAssuming for purposes of this Discussion that Fineman has produced, as he claims, sufficient evidence upon which to find that Armstrong specifically intended to drive Fineman out of the consulting business, see Restatement (Second) of Torts § 766, comment p (requiring specific intent to injure a third-party plaintiff); Printing Mart, 563 A.2d at 37 (noting substantial similarity between the Restatement's and New Jersey's formulation of the tort), we conclude as a matter of law that Fineman has failed to prove an additional element of tortious interference with a prospective contractual relation, namely, a sufficiently concrete prospective contractual relation.\n\nPrinting Mart, a case in which the New Jersey Supreme Court carefully delineated the elements of a tortious interference claim, makes clear that a plaintiff must establish injury to a prospective economic relation from the defendant's tortious interference. 563 A.2d at 38-39.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Even accounting for the distinction between that case and this -- in Printing Mart, the plaintiffs were parties to the contract (i.e., in TINS' position rather than Fineman's) -- we conclude that a third party to the contract must also establish with reasonable certainty a prospective economic relation in order to state a claim for tortious interference under New Jersey law. This Fineman has failed to do.\n\n\"Prospective economic relation\" is broadly defined under New Jersey law:\n\nThe expression, prospective contractual relation, is not used in this Section in a strict, technical sense. It is not necessary that the prospective relation be expected to be reduced to a formal, binding contract. It may include prospective quasi-contractual or other restitutionary rights or even the voluntary conferring of commercial benefits in recognition of a moral obligation.\n\nIncluded are interferences with the prospect of obtaining employment or employees, the opportunity of selling or buying land or chattels or services, and any other relations leading to potentially profitable contracts.\n\nPrinting Mart, 563 A.2d at 39 (quoting the Restatement (Second) of Torts § 766B, comment c). Arguably, the relevant prospective economic relation would be Stern's letter of intent with TINS. However, Fineman's individual claim rests upon losses sustained in his consulting business. Because his individual claim is premised upon injury to future consulting, it is equally appropriate to require Fineman to prove sufficient prospects for consulting contracts after the summer of 1984 when Armstrong allegedly coerced Stern into voiding its letter of intent with TINS.\n\nThe record is critically deficient with respect to Fineman's future consulting prospects. Although the record was replete with evidence of Fineman's fine reputation as an industry consultant, it was devoid of objective evidence that Fineman had any concrete plans for future consulting work. Fineman's consulting was conducted solely under the aegis of the CFIPS organization and on this record we are unable to find evidence of CFIPS's future consulting prospects. CFIPS disbanded shortly after TINS came to life, in part due to the departure of one of its primary consultants, Ron Friedman, which was unrelated to this litigation, and the fact that the rest of the CFIPS staff, including Fineman, Ferrar and Arena, redirected their attention to TINS exclusively. J.A. at 8814-15. By Fineman's own admission, CFIPS did not acquire any new clients after 1983, J.A. at 2614, nor did it sell consulting services to any clients in 1984. J.A. at 2993. Fineman's hope that TINS' eventual success would drum up later business for CFIPS amounts to speculation given the lapse of the CFIPS consulting business in 1984.\n\nBecause Fineman has failed to demonstrate a reasonable prospect of future consulting business in the floor covering industry, his individual claim for tortious interference with contract fails as a matter of law.\n\nG. Punitive Damages\n\nWe turn finally to address whether the district court properly granted judgment n.o.v. on the jury's award of punitive damages. We note that since we are affirming the judgment n.o.v. on Fineman's individual tortious interference claim, the judgment n.o.v. on his punitive damages follows suit. Nonetheless, with respect to TINS, this issue may arise upon retrial, so we will address its merits. The parties specifically dispute whether Armstrong's conduct rises to that level of misconduct subject to punitive damages. Although the jury awarded punitive damages in the amount of $200 million, the district court found as a matter of law that the record is \"critically devoid of that quantum of evidence as to the wrongfulness of the alleged conduct under the legal standard governing such awards.\" Fineman, 774 F. Supp. at 254.\n\nUnder New Jersey law, punitive damages \"can be awarded to punish [a defendant']s aggravated misconduct\" and to deter similar misconduct in the future. Nappe v. Anschelewitz, Barr, Ansell \u0026 Bonello, 97 N.J. 37, 477 A.2d 1224, 1230 (N.J. 1984) (citations omitted). The New Jersey Supreme Court has made clear that punitive damages may only be awarded where the wrongful conduct underlying tort liability exceeds the minimum threshold for a finding of liability. Berg v. Reaction Motors Div., 37 N.J. 396, 181 A.2d 487 (N.J. 1962). There the court articulated that the commission of a tort will not alone justify the imposition of punitive damages regardless of whether the tort be grounded on strict liability or fault. Id. at 496. As explained in Berg, which involved a nuisance:\n\nSomething more than the mere commission of a tort is always required for punitive damages. There must be circumstances of aggravation or outrage, such as spite or 'malice,' or a fraudulent or evil motive on the part of the defendant, or such a conscious and deliberate disregard of the interests of others that his conduct may be called wilful or wanton. Lacking this element, mere negligence, however 'gross,' is generally held not to be enough.\n\nId. (citing Prosser, Torts, 9-10 (2d ed. 1955)). The prerequisite misconduct \"may be satisfied upon a showing that there has been a deliberate act or omission with knowledge of a high degree of probability of harm and reckless indifference to consequences.\" Id.\n\nWhen assessing punitives attending an intentional, rather than a negligent tort, the New Jersey Supreme Court has termed the prerequisite misconduct as \"actual malice,\" defined as \"nothing more or less than intentional wrongdoing -- an evil-minded act . . . .\" Belinski v. Goodman, 139 N.J. Super. 351, 354 A.2d 92, 94 (N.J. Super. 1976) (citation omitted). In Belinski, which involved a claim of tortious interference with a brokerage agreement, the court concluded that evidence demonstrating the defendant's \"low moral fibre\" and motivation to commit the tort were relevant to the defendant's degree of actual malice. Id. at 95; see also Di Giovanni v. Pessel, 55 N.J. 188, 260 A.2d 510, 512 (N.J. 1970) (the defendant-doctor's failure to sign a certificate for confinement before a notary resulting in false imprisonment of the plaintiff lacked not only the prerequisite actual malice but failed even to equal wanton and reckless disregard).\n\nThe parties focus upon whether the evidence of Armstrong's wrongful interference with the TINS-Stern agreement alone suffices to prove the prerequisite misconduct for punitive damages. TINS contends that the legal malice necessary for proof of liability satisfies the actual malice prerequisite for punitive damages; understandably, Armstrong differentiates between the two. We cannot discern a clear rule under New Jersey law on this point. Indeed, it appears to be an unanswered question. See Nappe, 477 A.2d at 1237 n.3 (O'Hern, J., Concurring) (\"The majority says 'it is especially fitting to allow punitive damage [sic] for actions as legal fraud, since intent rather than mere negligence is the requisite state of mind'\" (citation omitted) . . . \"whether the threshold for punitive damages should be identical to that for compensatory damages is exactly the type of question we should resolve and not leave to the discretion of juries\").\n\nNevertheless, if TINS' theory is believed by the jury, then we conclude that TINS would be entitled to a jury charge on punitive damages upon retrial. Giving TINS the full benefit of every possible inference, the record supports a finding of actual malice in excess of the legal malice necessary for tortious interference. Because we need not, upon this factual record, reach the legal question unanswered by the New Jersey Supreme Court, we decline to predict whether New Jersey would rule that as a matter of law, the wrongful and intentional conduct necessary for tortious interference would, as a matter of law, entitle a plaintiff to punitive damages.\n\nTaken in the light most favorable to TINS, the evidence suggests sufficient actual malice or \"an evil-minded act.\" Aware of TINS' precarious financial position from Fineman's disclosure during the 1983 settlement negotiations, Armstrong recognized its opportunity to disrupt TINS' recovering, or to eliminate TINS entirely by destroying TINS' agreement with Stern. Armstrong accomplished this by wielding both the general authority it exercised over its captive distributors and by applying more specific coercive pressure, available because of Stern's precarious financial position. Actual malice is especially present here because of the history of this dispute; the jury could have found that despite a settlement agreement, Armstrong flagrantly disregarded its continuing obligations under the settlement agreement and deliberately reactivated its plan to clear out any competition for its future video network plans. Giving TINS the benefit of every possible inference, a jury could find that the record demonstrates that Armstrong harbored sufficient actual malice to award punitive damages. Thus we hold that the district court erred in granting judgment n.o.v. on TINS' punitive damage award.\n\nIV. Sherman Act Section 2\n\nA. Elements of a Leveraging Claim\n\nSection 2 of the Sherman Act makes it unlawful for \"every person [to] monopolize, or attempt to monopolize . . . any part of the trade or commerce among the several States . . .\" 15 U.S.C.A. § 2 (West Supp. 1992). This case presents both monopoly and attempted monopoly claims under section 2. We are called upon to evaluate whether the district court properly granted judgment n.o.v. for Armstrong on TINS' Sherman Act section 2 claims that Armstrong employed monopoly power in the resilient product market to \"perpetuate said monopoly and for the purpose and with the effect of attempting to monopolize the relevant [resilient and video magazine] markets . . . .\" Compl. at PP 31, 32.\n\nTo prove a monopoly claim under section 2, TINS must show: \"(1) the possession of monopoly power in the relevant market and (2) the willful acquisition or maintenance of that power as distinguished from growth or development as a consequence of a superior product, business acumen, or historical accident.\" United States v. Grinnell Corp., 384 U.S. 563, 570-71, 16 L. Ed. 2d 778, 86 S. Ct. 1698 (1966). To succeed on its claim of attempted monopoly, TINS must show that Armstrong possessed both specific intent to monopolize the video market and sufficient market power to create a dangerous probability of success. Harold Friedman, Inc. v. Kroger Co., 581 F.2d 1068, 1079 (3d Cir. 1978); see also American Tobacco Co. v. United States, 328 U.S. 781, 785, 90 L. Ed. 1575, 66 S. Ct. 1125 (1946).\n\nTINS premised both of its section 2 claims upon a leveraging theory, alleging that Armstrong employed monopoly power in the alleged resilient product market to gain a monopoly, or a dangerous probability of a monopoly, in the relevant video product market. Prior to submission of the case to the jury, TINS sought to alter its case theory to obviate its need to prove a resilient monopoly power lever, by challenging the district court's ruling that the section 2 claim requires proof of \"the alleged relevant market or sub-market for resilient floor covering alone\" and second, \"proof that in 1984 Armstrong possessed monopoly power in such alleged resilient market or sub-market.\" J.A. at 650-51.\n\nOur review of a district court's ruling on points for charge is conducted under an abuse of discretion standard. Bennis v. Gable, 823 F.2d 723, 727 (3d Cir. 1987). In this instance, the district court did not abuse its discretion in declining to permit a dramatic change in TINS's theory of the case at the end of trial. As the district court accurately noted, neither the pleadings nor the pre-trial statement even hinted that TINS intended to pursue a \"pure\" non-leveraging section 2 claims. In its pre-trial statement, TINS explicitly spelled out its theory that Armstrong leveraged monopoly power in the resilient product market to dominate the video magazine market:\n\nArmstrong used its dominance in the resilient floor covering market to drive TINS out of business in the retail floor covering video programming market by intimidating a number of independent firms, floor covering distributors, not to do business with plaintiffs, and with regard to a number of distributors, to back out of letters of intent that they had entered into with TINS.\n\nJ.A. at 717-18. Moreover, TINS identified only a single legal issue pertaining to its section 2 claims in the pre-trial statement:\n\nA firm that uses its dominance in one market (here the resilient floor covering market) to destroy competition in another market (here, the video programming for retail floor covering establishments sub-markets) violates the Sherman Act. Lorain Journal Co. v. United States, 342 U.S. 143, 96 L. Ed. 162, 72 S. Ct. 181 (1951).\n\nJ.A. at 780. The district court did not abuse its discretion in limiting TINS's section 2 claim to its leveraging theory.\n\nThree subsidiary elements are common to both TINS' monopoly and attempted monopoly claims: (1) a relevant product market consisting of resilient flooring; (2) a relevant product market limited to TINS' and Armstrong's videotapes; and (3) Armstrong's possession of monopoly power in the resilient flooring product market. We take up each of these elements in turn. The parties have stipulated to a relevant geographic market encompassing the United States. J.A. at 652.\n\n1. Relevant Product Market\n\nWe recently had occasion to set forth the legal contours of a relevant product market in Tunis Bros. Co. v. Ford Motor Co., 952 F.2d 715 (3d Cir. 1991), cert. denied, 120 L. Ed. 2d 864, 60 U.S.L.W. 3871, 112 S. Ct. 2986 (June 30, 1992). For brevity's sake, we reiterate that definition here:\n\nThe relevant product market is defined as those \"commodities reasonably interchangeable by consumers for the same purposes.\" United States v. E.I. Du Pont de Nemours \u0026 Co., 351 U.S. 377, 395, 100 L. Ed. 1264, 76 S. Ct. 994 (1956); SmithKline Corp. v. Eli Lilly \u0026 Co., 575 F.2d 1056, 1062-63 (3d Cir.), cert. denied, 439 U.S. 838, 58 L. Ed. 2d 134, 99 S. Ct. 123 (1978). Factors to be considered include price, use and qualities. Du Pont de Nemours, 351 U.S. at 404. Accordingly, the products in a relevant product market would be characterized by a cross-elasticity of demand, in other words, the rise in the price of a good within a relevant product market would tend to create a greater demand for other like goods in that market. Id. at 380, 400.\n\nId. at 722 (parallel citations omitted). Moreover, relevant product submarkets may also exist. Brown Shoe Co. v. United States, 370 U.S. 294, 325, 8 L. Ed. 2d 510, 82 S. Ct. 1502 (1962). These may be evidenced by \"such practical indicia as industry or public recognition of the submarket as a separate economic entity, the product's peculiar characteristics and uses, unique production facilities, distinct customers, distinct prices, sensitivity to price changes, and specialized vendors.\" Id. With this standard in mind, we turn to the evidence.\n\na. resilient\n\nAs the district court recognized when it left undisturbed the jury's finding of a resilient-only floor covering market, the determination of a relevant product market or submarket (\"market\") is a highly factual one best allocated to the trier of fact. See Weiss v. York Hospital, 745 F.2d 786, 825 (3d Cir. 1984), cert. denied, 470 U.S. 1060, 84 L. Ed. 2d 836, 105 S. Ct. 1777 (1985) (determination of the relevant product market is a question of fact). In light of the judgment n.o.v., we review the evidence pertinent to a relevant product market in the light most favorable to TINS, examining whether TINS has produced sufficient evidence that resilient floor covering is not \"reasonably interchangeable [with other floor coverings] by consumers for the same purposes.\" Id.\n\nTINS produced clearly sufficient evidence to support the jury's implicit finding that resilient and carpet are, by and large, not considered reasonably interchangeable by consumers. J.A. at 1570-73; 2826. For the most part, residential consumers desire carpeting in bedrooms and resilient in kitchens and baths. Although some areas of the home are subject to interchange-ability, e.g., family rooms and entryways, the differing characteristics of the two floor coverings as they pertain to comfort and maintenance dictate their location in any particular home. See The Carpet and Rug Institute, Economy of Carpet, J.A. at 8293-94 (describing the lower operating and maintenance costs associated with carpet as opposed to resilient and other hard surface floor coverings). This differentiation is substantiated by evidence that pricing of carpet and of resilient is independent of each other. See, e.g., J.A. at 3115 (Pomianoski: Congoleum, another resilient manufacturer, does not take into account carpet prices); J.A. at 2877 (Lerman, a carpet distributor, does not consider resilient prices when pricing carpet; he looks to carpet's competition and profitability). Finally, there was evidence of industry recognition of differences between carpet and resilient and vendor specialization. See, e.g., J.A. at 5089 (Crockett, a former Armstrong distributor, testified that the resilient and carpet markets are separate; resilient requires technical installation expertise unlike carpet).\n\nArmstrong contends that even given differences between resilient and carpet, a \"soft\" floor covering, there simply is no resilient-only relevant product market because resilient competes with all other hard surface floor coverings.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The strongest evidence of a resilient-only product market comes in the form of an Armstrong manual that touts the unique cushioning and spring-back characteristics of resilient as opposed to all other hard surface floor coverings. J.A. at 7784-87. Although less distinct than the preferences governing carpet versus resilient, according to the testimony of David Kolb, president of a carpet distributor, consumer trends generally govern the location of a given floor covering within residences, although there does exist an insignificant amount of crossover due to unusual consumer preference. J.A. at 2193-98; see also J.A. at 5957-58 (Armstrong's expert witness, Edwin DePodwin); cf. Tunis Bros., 952 F.2d at 724-26 (plaintiffs' witnesses universally testified to the interchangeability between Ford and other comparably prices tractors). Kolb further testified to industry recognition of the differences in hard surface floorings, opining that floor coverings constitute different product lines that require different marketing strategies. J.A. at 2194.\n\nWe conclude that this admittedly mixed record does support the jury's finding of a resilient-only product market.\n\nb. video\n\nLikewise, the record is sufficient to support the jury's finding that the relevant video market or submarket consisted of TINS' video magazine and Armstrong's video selling aids.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Armstrong's overall video plans encompassed a ten-year plan to develop a video network, according to Fineman, beginning with Armstrong's distributors in 1983, target its retailers by 1986, and eventually reach consumers through the Fashion Floor Center program. J.A. at 1813; 1846; 1899-1900; 1924-25. Fineman opined that Armstrong's video network for retailers was only in the planning stages in the fall of 1983 when TINS was launched and lagged three years behind TINS. J.A. at 1899-1900. In order to draw comparisons between the two networks, we will briefly detail Armstrong's video program.\n\nArmstrong announced its first formal videotape program, entitled the \"Take Charge\" series, in December of 1981. J.A. at 4735. See, e.g., J.A. at 8033; 4735-38. According to the manager of Armstrong's Bureau of Training and Development, Thomas Downey, Armstrong developed the Take Charge series as a training aid to train expeditiously many new Armstrong distributors who were added in response to Armstrong's loss of a large distributor.\n\nSubsequently, in May of 1982, Armstrong announced \"The Next Step,\" a distributor video communication network, with a threefold purpose: 1) to increase the effectiveness of training programs for both distributors and retailers; 2) to improve their ability to market new products and promotions; and 3) to provide an additional communication link within Armstrong's distribution system. J.A. at 7278-79. This program required distributor investment in an industrial grade of Sony betamax equipment capable of \"interactive/interruptive\" viewing; this system enabled viewers to select from multiple choice options and provided for varying screen responses depending upon the viewer's choice. Id.\n\nArmstrong also developed its Fashion Floor Center (FFC) program, which was in place by 1984 and was then available to interested retailers for an investment of $4,000. J.A. at 4452. In exchange for this fee, an FFC participating retailer would receive state of the art product displays, exclusive \"high-end\" products, management guides and sales training. J.A. at 4450-52. Eventually, the FFC program also included a videodisc kiosk installation for use by consumers to acquaint them with detailed knowledge about Armstrong products and their maintenance. J.A. at 4780. By the time of the trial, the initial FFC fee equalled $8,000. J.A. at 4452.\n\nArmstrong contends that its video network and the TINS magazine do not alone constitute a relevant video product market, primarily because Armstrong's videos were not in magazine form, but were videotaped selling aids indistinguishable from a host of other manufacturers' and commercial selling aid materials. Moreover, Armstrong distinguishes its video program, allegedly tailored toward its distributors, from the TINS magazine, tailored for all retailers. Last, Armstrong posits that its videos were limited in subject matter to Armstrong products and information about Armstrong product features, installation, and general selling techniques whereas the TINS magazine provided a comprehensive survey of the floor covering industry with information about divers and competitive products.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nFineman testified, however, that video magazines targeted at floor covering retailers differed from video magazines produced for other audiences. J.A. at 1962. Moreover, he opined that, with the sole exception that Armstrong's video exclusively focused upon Armstrong products, Armstrong's and TINS' video network were functionally equivalent. J.A. at 1644. Both video programs provided product information and sales techniques. Id.\n\nThe plaintiffs also refute Armstrong's suggestion that its videos were provided to distributors, explaining that consistent with its entire product distribution scheme, Armstrong channeled sales to retailers through its distributors. Armstrong's Draeger concurred, testifying, \"our wholesalers were showing video to retailers.\" J.A. at 6132; see also J.A. at 6140 (the Armstrong video network was designed largely for distributors with portions to be shown to retailers); J.A. at 4886 (Funsten testified that Armstrong made videos available for retailers in 1983-84); J.A. at 7358-59 (Armstrong memorandum outlining the functions of the FFC program). Draeger even admitted that Armstrong's video would be sold through distributors to retailers. J.A. at 6141.\n\nThus, the record supports the jury's inference that retailers may have perceived TINS' and Armstrong's video programs to be interchangeable. Both offered product information, sales training and techniques, and interviews with industry experts. Although Armstrong presented evidence of differences between the two video programs, the jury was free to disbelieve Armstrong's evidence.\n\n2. Monopoly Power in the Resilient Market\n\nCentral to TINS' leveraging theory is the predicate fact of Armstrong's monopoly power in the resilient market. Monopoly power has been defined as \"the power to control prices or exclude competition and may ordinarily be inferred from a predominant share of the relevant market.\" United States v. E. I. du Pont de Nemours \u0026 Co., 351 U.S. 377, 391, 100 L. Ed. 1264, 76 S. Ct. 994 (1956); see American Tobacco, 328 U.S. at 797. A predominant share of the market, or a lesser market share combined with other relevant factors, may suffice to demonstrate monopoly power. Weiss, 745 F.2d at 827 n.72. Armstrong's market share, if sufficiently high, may obviate the need to analyze other pertinent factors. Thus, our starting point must be to determine Armstrong's market share of the resilient product market. See Pennsylvania Dental Ass'n v. Medical Serv. Ass'n of PA, 745 F.2d 248, 260 (3d Cir. 1984) (\". . . the size of market share is a primary determinant of whether monopoly power exists\"), cert. denied, 471 U.S. 1016, 85 L. Ed. 2d 303, 105 S. Ct. 2021 (1985).\n\nAlthough estimates of Armstrong's market share of the resilient market differed widely, taking the evidence in the light most favorable to TINS, the jury could have credited Armstrong with as high a share as 55 percent of the resilient market. J.A. at 2904 (Albert Wahnon, the publisher of industry magazine Floor Covering News, placed Armstrong's market share as high as 55%); see also J.A. at 2629 (Fineman testifying that Armstrong possessed over 50% of the resilient market); J.A. at 3330 (Robert Starke, a former Congoleum employee, placed Armstrong's market share at 50%); J.A. at 1470 (giving Armstrong \"dominant market share for sheet goods of 45-50%\"). We must determine whether a 55 percent market share, combined with other factors, suffices for monopoly power.\n\nAs a matter of law, absent other relevant factors, a 55 percent market share will not prove the existence of monopoly power. See Domed Stadium Hotel, Inc. v. Holiday Inns, Inc., 732 F.2d 480, 489 (5th Cir. 1984) (referring to Judge Learned Hand's formulation that 90% is enough, 60% is not likely to suffice, and 33% is insufficient to constitute monopoly power) (citation omitted). A significantly larger market share than 55 percent has been required to demonstrate prima facie monopoly power. See American Tobacco, 328 U.S. at 797 (\"over two-thirds of the entire domestic field of cigarettes, and . . . over 80% of the field of comparable cigarettes\" constituted \"a substantial monopoly\"); Grinnell, 384 U.S. at 571 (87%); International Boxing Club v. United States, 358 U.S. 242, 3 L. Ed. 2d 270, 79 S. Ct. 245 (1959) (81%); see also Eastman Kodak Co. v. Image Technical Services, Inc., 119 L. Ed. 2d 265, 112 S. Ct. 2072, 2090 (1992) (100% and 80% to 95% of the relevant markets survives summary judgment).\n\nReazin v. Blue Cross and Blue Shield, Inc., 899 F.2d 951 (10th Cir.), cert. denied, 497 U.S. 1005, 110 S. Ct. 3241, 111 L. Ed. 2d 752 (1990), upon which TINS relies, does not advance its argument. Reazin concerned Blue Cross' decision to terminate its contracting provider agreement with a hospital that had contracted with a competitive insurer, effectively increasing patient costs at the terminated hospital. In Reazin the court suggested that given Blue Cross's relative dominance of a 47-62 percent market share as compared to a market share of less than 5 percent for its nearest competitor and given jury findings of actual anticompetitive restraint of trade, a finding of market power may be unnecessary. Id. at 968 n.24, 969 (citing FTC v. Indiana Fed'n of Dentists, 476 U.S. 447, 90 L. Ed. 2d 445, 106 S. Ct. 2009 (1986)). Indiana Fed'n of Dentists posits two situations in which market power may not need to be demonstrated in order to prove monopoly power: 1) a naked restriction on price or output without a competitive justification; or 2) \"proof of actual detrimental effects.\" Id. at 460-61. Neither is implicated in this case, and TINS does not contend otherwise.\n\nOther factors relevant to determining whether Armstrong exercised monopoly power, or \"the power to control prices or exclude competition\" in the resilient market, include:\n\nthe size and strength of competing firms, freedom of entry into the field, pricing trends and practices in the industry, ability of consumers to substitute comparable goods or services from outside the market, and consumer demand factors. A defendant's power either by itself or aided by these other factors must be enough to restrict entry, supply, or price. See L. Sullivan, Handbook of the Law of Antitrust §§ 22-32 (1977); see also Dolan \u0026 Ralston, supra note 4, at 767.\n\nWeiss, 745 F.2d at 827 n.72. An evaluation of the evidence pertaining to these other factors is necessary in order to determine whether Armstrong wielded power to control prices or to exclude competition in the resilient market.\n\nTINS produced persuasive evidence in the form of a market share analysis compiled by an Armstrong competitor, Mannington Mills, that Armstrong's market power in 1984 far exceeded that of its nearest three rivals. According to this report, Armstrong then possessed 48% of the resilient market share. J.A. at 7590. Its closest competitors were Congoleum with a market share of 15.2%, Tarkett with 7.8%, and Mannington Mills with 10.9%, respectively; all other competitors shared the remaining 18.1% share of the market. Thus Armstrong's market share exceeded even the combined market share of its three closest competitors and equalled over three times the market share of its nearest competitor. Armstrong, as well as a financial analyst, have described it as the \"dominant\" manufacturer in the resilient industry. See, e.g., J.A. at 7284-85; 7368. This \"dominance\" is reflected in Armstrong's superior brand recognition. See J.A. at 7368; 1622.\n\nIn addition to Armstrong's impressive market share, TINS presented evidence of significant barriers to entry in the resilient industry. A 1984 United States International Trade Commission report on the domestic sheet vinyl flooring industry\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e spelled out several key barriers to entry. See J.A. at 7444-50. First, the Commission reported that\n\n\"producers in the United States and Canada rely primarily on single-supplier distributors (captive suppliers) to sell the major portion of their production. Even without patent protection, this distribution systems [sic] renders quick penetration of the market impossible without purchasing an existing distribution network.\n\nJ.A. at 7446. Although Swedish and West German firms have overcome this barrier to enter the United States market, the options for competing in the United States are limited to buying an established distribution network, to developing a new distribution network, or to selling to retail outlets directly at a discounted price for the do-it-yourself market. Buying established networks is difficult because few are available; building one is \"a slower method that does not allow an immediate challenge to U.S. producers across the breadth of the market,\" J.A. at 745;, directing sales to the do-it-yourself market offers limited market penetration because of this group's small size and preference for vinyl tile, rather than vinyl sheeting that is typically sold in 12 foot rolls. Id.\n\nTransportation costs, the primary nonproduction cost factor, constitute another formidable barrier to entry by foreign firms, \"resulting in an almost universal advantage to the closest . . . producer.\" J.A. at 7446. The USITC adds, however, that\n\nthese costs primarily serve to reduce foreign competitors and that\n\ntransportation costs pose an approximately equal disadvantage for U.S. and Canadian producers in most of North America. Also, transportation costs is less a factor in competition between imports from Asia and the domestic product on the west coast, because the ocean freight costs for the imports roughly equal the inland transportation costs from domestic factories on the east coast.\n\nJ.A. at 7446.\n\nAssuming arguendo that the record might support an inference of monopoly power in the resilient market we find that TINS has not, however, proven a section 2 leverage claim, because, as we discuss below, (1) there is no evidence of a use of monopoly power in the video market and (2) a showing of an attempt to gain competitive advantage in the video market is insufficient as a matter of law.\n\nB. Leveraging\n\nTINS' leveraging claim cannot survive its failure to prove that Armstrong was able to convert power in the resilient market into either a monopoly or a dangerous probability of monopoly in the video market. Moreover, we hold as a matter of law that TINS may not advance a leveraging claim under section 2 premised upon Armstrong's having attained a mere competitive advantage in the relevant video market.\n\n1. Monopoly Power in The Video Market\n\nAs our starting point, we recognize that TINS need only to have proven the requisite assertion of power in the video market from 1984 through the time of the trial. We agree with the district court that to restrict the time period to 1984 would arbitrarily insulate from antitrust liability a defendant who may have acted prospectively to eliminate a competitor and who may have harbored future plans to overtake a relevant product market. Thus we have combed the extensive trial record in search of evidence that Armstrong has at any time since 1984 achieved either a monopoly, or dangerous probability of one, in the video market.\n\nMoreover, we also accept the implicit finding of the jury that both TINS' and Armstrong's videos were targeted to floor covering retailers. Because retailers carry various product lines and typically do business with several competing distributors, one cannot characterize the retailer market by extrapolating from data concerning distributors. We reject the district court's Conclusion that because Armstrong distributors constituted 15.5 percent of all floor covering distributors or at most 34 percent of the top 50 floor covering distributors, then TINS failed, as a matter of law, to prove a large enough market share in the video market. Rather, the evidence suggests that a 15 to 34 percent share of distributors could have reached a larger portion of retailers, especially given evidence that Armstrong distributors typically deploy larger sales forces than other resilient manufacturers.\n\nHaving thus far speculated, we are left without record support to discern precisely how extensively Armstrong has penetrated the video market for retailers. TINS merely explains that Armstrong targeted all retailers and that no replacement video magazine for TINS has emerged. There is no evidence to show how many retailers Armstrong has actually brought into its video network, or, alternatively, how many retailers sell Armstrong products and thus would be viable prospects to join Armstrong's video network.\n\nMoreover, even if Armstrong remains the only supplier in the relevant video market, the record clearly proves that barriers to entry in the video market are extremely low. In fact, upon TINS' demise, two Armstrong distributors produced their own substitute video magazine to satisfy their retailers' full year subscription. J.A. at 4227. They funnelled relatively little capital into the venture and needed minimal start-up time. See J.A. at 4227-29. Fineman's own plans to create a video network for the sports industry, as well as his contemplation of developing similar technology in additional markets, demonstrate the fallacy of Fineman's testimony that expertise in the particular industry constituted a barrier to entry; even if legally tenable, Fineman conceded he lacked any expertise in the sporting goods industry, thus factually defeating this contention. J.A. at 1800-01; see J.A. at 8408 (reserving contract rights with RCA to obtain discounted video equipment for ventures in the sporting goods, liquor, apparel and beauty aides industries).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The evidence falls short of demonstrating that Armstrong has at any time since 1984 captured monopoly power, or a dangerous probability of it, in the video market.\n\n2. Competitive Advantage in the Video Market\n\nTINS alternatively posits that a monopoly leveraging case may be proved by showing only a \"competitive advantage\" in the secondary market. Thus, assuming arguendo that it has proven that Armstrong flexed monopoly power over resilient, TINS suggests that it may prevail upon its section 2 claim even in the absence of proof that Armstrong acquired anything more than a \"competitive advantage\" in the video market. TINS derives this theory from Berkey Photo, Inc. v. Eastman Kodak Co., 603 F.2d 263, 276 (2d Cir. 1979), cert. denied, 444 U.S. 1093, 62 L. Ed. 2d 783, 100 S. Ct. 1061 (1980), in which the court of appeals stated that \"the use of monopoly power attained in one market to gain a competitive advantage in another is a violation of section 2, even if there has not been an attempt to monopolize the second market.\" Although monopoly leveraging claims are not entirely foreign to us, see Danny Kresky Enterprises, Corp. v. Magid, 716 F.2d 206 (3d Cir. 1983); SmithKline Corp. v. Eli Lilly \u0026 Co., 575 F.2d 1056 (3d Cir.), cert. denied, 439 U.S. 838, 58 L. Ed. 2d 134, 99 S. Ct. 123 (1978), we have not previously considered the viability of Berkey Photo's holding; we are now asked to do just that.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Berkey Photo has not been widely approved and has been adopted only by the Court of Appeals for the Sixth Circuit. See Kerasotes Michigan Theaters, Inc. v. National Amusements, Inc., 854 F.2d 135 (6th Cir. 1988) (adopting Berkey Photo's leverage theory in reversing the dismissal of a complaint for failure to state a claim).\n\nIn Berkey Photo, the plaintiff alleged that the defendant, Kodak, had leveraged its monopoly power in the camera and film markets to obtain a \"competitive advantage\" in the photofinishing equipment and services markets, which Kodak concededly did not pose any danger of monopolizing. 603 F.2d at 275. Monopoly power is tolerated under antitrust law only to the extent that it provides competitive incentives to a firm innocently possessing such power. Moreover, because it did not perceive any reason to distinguish between the destruction and the distortion of competition in the leveraged market, the court held that Kodak could be liable even if it exercised less than monopoly power, or even a dangerous probability of monopoly, in the downstream photofinishing market. Id. \"[A] firm violates section 2 by using its monopoly power in one market to gain a competitive advantage in another, albeit without an attempt to monopolize the second market.\" Id.\n\nRather than focusing upon broad premises of antitrust law, we begin with the text of the Sherman Act.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Two important distinctions between section 1 and section 2 of the Sherman Act surface upon examination of the language. Section 1 prohibits \"restraints of trade\" accomplished by means of concerted action; section 2 prohibits more severe monopoly and attempted monopoly resulting from unilateral action. As these distinctions make clear, the Sherman Act does not make unlawful the entire universe of anti-competitive conduct. It does not prescribe anti-competitive unilateral conduct that falls shy of threatened monopolization.\n\nThis was succinctly set forth by the Supreme Court in Copperweld Corp. v. Independence Tube Corp., 467 U.S. 752, 81 L. Ed. 2d 628, 104 S. Ct. 2731 (1984), in which the Court held that a wholly-owned subsidiary and its parent corporation could not engage in concerted action in violation of section 1 as a matter of law:\n\nIt cannot be denied that section 1's focus on concerted behavior leaves a \"gap\" in the Act's prescription against unreasonable restraints of trade. An unreasonable restraint of trade may be effected not only by two independent firms acting in concert; a single firm may restrain trade to precisely the same extent if it alone possesses the combined market power of those same two firms. Because the Sherman Act does not prohibit unreasonable restraints of trade as such -- but only restrains effected by a contract, combination, or conspiracy -- it leaves untouched a single firm's anti-competitive conduct (short of threatened monopolization) that may be indistinguishable in economic effect from the conduct of two firms subject to section 1 liability . . . .\n\nId. at 774. Berkey Photo's formulation of monopoly leveraging to proscribe unilateral restraints of trade does violence to the text of the Sherman Act and decimates this \"gap\" in liability.\n\nFor its holding, the court in Berkey Photo relied upon dicta in United States v. Griffith, 334 U.S. 100, 92 L. Ed. 1236, 68 S. Ct. 941 (1948). In Griffith, the Court broadly stated that \". . . the use of monopoly power, however lawfully acquired, to foreclose competition, to gain a competitive advantage, or to destroy a competitor, is unlawful.\" In Griffith, a monopoly leveraging case, the Court considered whether concerted action by several movie theater operators, who owned the only theaters in numerous \"closed towns,\" to enter into annual \"master agreements\" with movie distributors that resulted in restricting the number of films available to competing movie theaters in neighboring \"open towns\" constituted violations of sections 1 and 2 of the Sherman Act. Griffith, 334 U.S. at 102-03. The district court had granted summary judgment for the defendants because it believed that the evidence did not demonstrate a conspiracy in restraint of trade. Finding a pooling of buying power with anti-competitive effects, the Court reversed the district court, explaining that \"even if we accept the District Court's findings that appellees had no intent or purpose unreasonably to restrain trade or to monopolize, we are left with the question whether a necessary and direct result of the master agreements was the restraining or monopolizing of trade within the meaning of the Sherman Act.\" Id. at 106. On remand, the district court was instructed to determine the effect of these practices, a Conclusion it had not reached given its previous holding. Griffith did not reach the question of whether the several movie theater operators had leveraged their power in one market in order to gain a simple competitive advantage in another. Nor did Griffith determine whether that action would be unlawful. Thus, Griffith's broad statement, upon which Berkey Photo relied, should not control this case. This is especially true since, in contrast to the court in Berkey Photo, we have the benefit of Copperweld's explication of the Sherman Act's purposeful \"gap\" in liability.\n\nThe Court of Appeals for the Ninth Circuit has, likewise, expressly declined to follow Berkey Photo. Alaska Airlines, Inc. v. United Airlines, Inc., 948 F.2d 536 (9th Cir. 1991), cert. denied, 118 L. Ed. 2d 316, 112 S. Ct. 1603 (1992). In rejecting Berkey Photo's monopoly leveraging theory, the court gave weight to Copperweld's distinction between section 1 and section 2 claims, concluding that Berkey Photo's theory derived from a misapplication of the elements of a section 2 claim.\n\nIn concert with the Court of Appeals for the Ninth Circuit, we hold that in order to prevail upon a theory of monopoly leveraging, a plaintiff must prove threatened or actual monopoly in the leveraged market. We therefore reject TINS' proposition that it needed to prove only a competitive advantage in the relevant video market.\n\nV. New Trial\n\nHaving concluded that the district court's grant of judgment n.o.v. must be reversed in part, we now consider the district court's conditional grant of a new trial on the Sherman Act section 2 claim and the tortious interference claims.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e See Fed. R. Civ. P. 50(c)(1). The district court granted a new trial on two grounds: (1) the verdict was against the weight of the evidence, and (2) improper conduct by plaintiffs' trial counsel so pervaded the trial as to infect the jury's verdict. We review each of these rulings for an abuse of discretion. We discuss them in reverse order.\n\nA. Conduct of Counsel\n\nThe district court granted a conditional motion for a new trial premised upon its finding of improper conduct by plaintiffs' counsel during summation. In short, the district court found that the tenor of the summation was such that a strong probability existed that the verdict had been influenced by the improper conduct. In its judgment, the cautionary instructions given to the jury proved to be insufficient to immunize the jury from the improper and inflammatory remarks of plaintiffs' counsel. Fineman, 774 F. Supp. at 269. In brief, the district court concluded that, among other infractions which do not bear repeating here, see Fineman, 774 F. Supp. at 274-75, plaintiffs' trial counsel had improperly testified to his own truthfulness and trustworthiness, supplied \"facts\" not in evidence about the credibility of Armstrong witnesses, accused Armstrong's witnesses of being \"liars\" and \"perjurers,\" and levied \"an unadorned, disparaging attack\" upon defense counsel throughout his summation. Fineman, 774 F. Supp. at 270-72. This basis for a new trial has been adequately preserved.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nOur standard of review with respect to the award of a new trial for prejudicial conduct by counsel is deferential. \"We recognize that the trial Judge has considerable discretion in determining whether conduct by counsel is so prejudicial as to require a new trial.\" Draper v. Airco, Inc., 580 F.2d 91, 94 (3d Cir. 1978) (citations omitted). Because the trial Judge was present and able to Judge the impact of counsel's remarks, we defer to his assessment of the prejudicial impact. As we stated in Reed v. Philadelphia, Bethlehem \u0026 New England R.R. Co., 939 F.2d 128 (3d Cir. 1991), \"in matters of trial procedure such as that involved here, the trial Judge is entrusted with wide discretion because he is in a far better position than we to appraise the effect of the improper argument of counsel.\" Reed, 939 F.2d at 133. Thus we will defer to the district court's judgment that its curative instructions during the summation were insufficient to expunge the prejudicial impact of plaintiffs' trial counsel's closing remarks. J.A. at 6988.\n\nIn order for us to evaluate the plaintiffs' trial counsel's summation in context, a brief review of Armstrong's counsel's summation is useful. Armstrong had counterclaimed against TINS and Fineman, alleging a civil conspiracy to bring this lawsuit, and requesting as damages legal fees amounting to $1.1 million. In commencing his closing argument, Armstrong's counsel characterized Armstrong as the true victim in this case, stating: \"Armstrong is a million dollar victim because we did nothing wrong,\" and characterizing the case as a \"financial million dollar nightmare for Armstrong.\" J.A. at 6884; 6880. Subsequently, he uttered \"I believe . . .\", inviting a mild correction from the district court. J.A. at 6891. The balance of his summation focused upon the credibility of witnesses; he accused Fineman of lying and urged the jury to disbelieve the plaintiffs' theory of plot and conspiracy and to credit Armstrong's witnesses. J.A. at 6977; 6971-83. With this background laid, we turn to evaluate plaintiffs' trial counsel's remarks to the jury in light of our jurisprudence.\n\nAt the outset, we recognize that not all improper remarks will engender sufficient prejudice to mandate the granting of a new trial. Our test is whether the improper assertions have made it \"reasonably probable\" that the verdict was influenced by prejudicial statements. Draper, 580 F.2d at 97. Often, as in the seminal case of Draper, a combination of improper remarks are required to persuade us of prejudicial impact. There we held that the combination of the following improprieties by plaintiff's counsel constituted grounds for a new trial:\n\n1) he attempted to prejudice the jurors through repeated inappropriate references to the defendants' wealth; 2) he asserted his personal opinion of the justness of his client's cause; 3) he prejudicially referred to facts not in evidence; and 4) without provocation or basis in fact, he made several prejudicial, vituperative and insulting references to opposing counsel.\n\n580 F.2d at 95; cf. Salas v. Wang, 846 F.2d 897 (3d Cir. 1988) (an isolated improper remark will not support the grant of a new trial); Anastasio v. Schering Corp., 838 F.2d 701 (3d Cir. 1988) (same). Despite a curative instruction, which came a day after the offending summation, we concluded in Draper that \"it was more than 'reasonably probable' that the verdict was influenced by the prejudicial statements.\" Id. at 97. This Conclusion was compelled by the argument as a whole rather than a single instance or type of impropriety. Id.\n\nIn addition to our caselaw, the district court applied New Jersey Rule of Professional Conduct 3.4(e) which prescribes \"Fairness to Opposing Party and Counsel\" by prohibiting certain conduct:\n\nA lawyer shall not: . . . (e) in trial, allude to any matter that the lawyer does not reasonably believe is relevant or that will not be supported by admissible evidence, assert personal knowledge of facts in issue except when testifying as a witness, or state a personal opinion as to the justness of a cause, the credibility of a witness, the culpability of a civil litigant or the guilt or innocence of an accused\n\nRule of Professional Conduct 3.4(e); D.N.J. R. 6. As will be demonstrated, upon this record, we cannot second guess the district court's judgment that plaintiffs' trial counsel ran afoul of both the rule and our jurisprudence.\n\nPlaintiffs' trial counsel commenced his summation on the day following Armstrong's counsel's summation:\n\nOne thing [defense counsel] and I agree on, probably the only thing, is that credibility will decide this case, who's telling the truth.\n\nIf you believe [defense counsel's] telling the truth, then the plaintiff's [sic] don't deserve a penny.\n\nIf you believe we're telling the truth then I will show that the evidence justifies an award . . .\n\nHow are you going to determine who's telling the truth? Well, it seems to me that you have to start with lawyers because let's face it, [defense counsel] made a couple of very direct statements yesterday. You have to Judge whether he was being truthful to you or whether he wasn't.\n\nNow, last night I counted up, in going through his statements that he wanted you to believe, over 24 misrepresentations and I have backed them up with fact.\n\nJ.A. at 6987-88 (emphasis added). He expounded upon the first of his 24 \"misrepresentations\"\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e at which point defense counsel objected and the district court cautioned the jury that \"the lawyers in the case are not witnesses. The credibility of the lawyers is not an issue in this case as opposed to the credibility of the witnesses.\" J.A. at 6987-88.\n\nIn the course of describing the 24 misrepresentations that the defense counsel allegedly made, which served as plaintiffs' trial counsel's outlining theme, plaintiffs' counsel suggested that defense counsel either forgot or deliberately misrepresented the evidence. See, e.g., J.A. at 6993 (\"[Defense counsel] got up here with a straight face and he said that to you, hoping that you would believe him\"). Plaintiffs' trial counsel also provided the jury with a possible motive for defense counsel's alleged misrepresentations -- $1.1 million in legal fees, J.A. at 6993, and hammered home this theme repeatedly:\n\nWell, [defense counsel] has earned his million dollars, I couldn't do it, I really couldn't.\n\nJ.A. at 7024.\n\n[Defense counsel] has earned his million dollars. I give it to him. He has earned it. He has earned his million dollars. Let it not be said that he did not earn it.\n\nJ.A. at 7059.\n\nJ.A. at 7062.\n\nIt has long been a rule of this court that vituperative references to opposing counsel will not be tolerated. In Draper, 580 F.2d at 91, we so held in a case that involved plaintiff's counsel's repeated characterization of defense counsel and defendants collectively as \"his\" or \"this\" \"gang,\" \"chargeing\" defense counsel \"as part of the same conspiracy,\" and implying that defendants and their counsel had withheld documents: \"every time we get to a crucial spot, things disappear.\" Id. at 96. These repeated assertions in combination with other improprieties made it \"reasonably probable\" that the verdict was influenced by the prejudicial statements. Id. at 96-97. The improprieties apparent on the cold appellate record in Draper were sufficiently egregious to require reversal of the district court's denial of a new trial even under our deferential standard of review. The district court's assessment that plaintiffs' trial counsel exceeded the bounds of propriety established in Draper falls with its sound exercise of discretion.\n\nFurthermore, the district court found that plaintiffs' trial counsel also improperly provided his personal opinion as to the justness of his cause and injected his own credibility as an issue in the case:\n\nI have a certain calmness about me today because of you, that is because I trust you. I have come to know you over almost three months and I think I know what type of people you are and I know, I don't think, I don't hope, but I just know that you're going to do the right thing.\n\nI could show you all the documents . . . or, I said to myself, hopefully, by now after three months you trust me enough that if I tell you something that I've not lied to you yet, that I'm not about to start now. And I thought I could shorten it up a great deal on the hope that you will trust me, . . . you will trust me enough that I will be straight with you. . . . that's one of the reasons why yesterday I spent a lot of time\n\non the credibility of the people who were talking up here, myself and [defense counsel].\n\nJ.A. at 7085-87; see also J.A. at 7097. He also pledged his own truthfulness:\n\nI mean, after all, as the Judge told you and the Judge is absolutely right, it's not just so much the truthfulness of the lawyers, although I might remind you, if I may, that when I got up here a few months ago, I told you I would never lie to you. [Defense counsel] couldn't point out a single misrepresentation that I made to you over the three months because I didn't make one. That's not how I try cases.\n\nJ.A. at 7015 (emphasis added). And further:\n\nI said to you [at the onset of the trial], I make a pledge that I will not lie to you and I will prove everything on this [demonstrative aid] board.\n\nJ.A. at 7148.\n\nPlaintiffs' trial counsel's comments were not limited to Armstrong's counsel. When arguing the relative credibility of the witnesses, he repeatedly made a number of impassioned remarks. He spoke in terms of \"the nerve,\" J.A. at 7034; 7040; 7044; 7050; 7058, of Armstrong witnesses to lie on the stand or perjure themselves \"with a straight face,\" J.A at 7037; 7040, opining that he couldn't say it \"with a straight face\"; \"in front of a federal Judge and a federal jury,\" J.A. at 7034; 7038; 7050; 7058; 7139. He argued that the testimony of Armstrong's witnesses and its theory of the case was simply \"insulting\" to the intelligence of the jury, J.A. at 7039; 7047; 7048; 7057, and opined that Armstrong witnesses must have mistaken the jurors for people \"just off the boat\". J.A. at 7050.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Although we recognize that \"advocacy\" need not \"be devoid of passion,\" in context we are satisfied that the district court did not err in ruling that these remarks crossed the line dividing line proper from improper conduct. See Draper, 580 F.2d at 95.\n\nThe plaintiffs assert that their trial counsel's summation in this regard was no stronger than that warranted by the evidence of conspiracy between Armstrong's witnesses and counsel. They suggest that Anastasio, 838 F.2d at 701, stands for the proposition that a new trial is not warranted on the basis of counsel's questioning the credibility of a witness. In striking contrast to this case, however, our holding in Anastasio rested upon the fact that the trial counsel's improper statement was an isolated one in an otherwise proper summation. Id. at 706. This fact, combined with the district court's curative instruction to the jury that the statements of counsel are not evidence, was sufficient to ensure that no prejudicial impact had occurred. Id.; see also Salas, 846 F.2d at 907-910 (one impassioned comment in a highly emotionally charged trial was insufficient to prejudicially affect the defendant's substantial rights).\n\nThe district court also found that plaintiffs' trial counsel had made statements that arguably referred to extrinsic evidence. Fineman, 774 F. Supp. at 270. For example, he stated: \"I have more on Mr. Draeger, but I won't bore you with it. I hope by now you trust me that there's plenty more in here, but I'm not going to bore you with it.\" J.A. at 7051; see also J.A. at 7097. Although the plaintiffs contend that the statement was made in the context of summarizing the evidence and that plaintiffs' trial counsel was referring to record evidence, the district court found without elaborating that counsel had relied on facts outside the record. Fineman, 774 F. Supp. at 270. As we made clear in Ayoub v. Spencer, argument injecting prejudicial extraneous evidence constitutes reversible error. 550 F.2d 164 (3d Cir.), cert. denied, 432 U.S. 907 (1977).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nB. Weight of the Evidence\n\nWith respect to the court's ruling that the verdict was against the weight of the evidence, we caution that the district court ought only to grant a new trial on this basis where \"a miscarriage of Justice would result if the verdict were to stand.\" Williamson v. Consolidated Rail Corp., 926 F.2d 1344, 1352 (3d Cir. 1991). This limit upon the district court's power to grant a new trial seeks to ensure that a district court does not substitute its \"judgment of the facts and the credibility of the witnesses for that of the jury.\" Lind v. Schenley Indus. Inc., 278 F.2d 79, 90 (3d Cir.) (in banc), cert. denied, 364 U.S. 835, 5 L. Ed. 2d 60, 81 S. Ct. 58 (1960). \"Such an action effects a denigration of the jury system and to the extent that new trials are granted the Judge takes over, if he does not usurp, the prime function of the jury as the trier of facts. It then becomes the duty of the appellate tribunal to exercise a closer degree of scrutiny and supervision than is the case where a new trial is granted because of some undesirable or pernicious influence obtruding into the trial.\" Id.\n\nNevertheless, reversal of a judgment n.o.v. upon a finding of sufficient evidence to support the jury's verdict does not preclude affirmance of a new trial order arising from the Conclusion that the verdict is against the weight of the evidence. See, e.g., Roebuck v. Drexel University, 852 F.2d 715, 735 (3d Cir. 1988); American Bearing Co. v. Litton Indus., 729 F.2d 943, 948 n.11 (3d Cir.), cert. denied, 469 U.S. 854, 83 L. Ed. 2d 112, 105 S. Ct. 178 (1984). In Roebuck, we mandated just such a result, acknowledging that the evidence permitted a number of inferences which supported the plaintiff's cause of action but also recognizing that the weight of the evidence fell the other way. The comment we made in this regard is equally applicable here:\n\nWe must also acknowledge the extraordinary number of inferences that the jury must have drawn in order to reach the verdict that it did. Although we believe that each of the inferences that we have discussed are individually logically sound, we recognize that at some point too many inferences become mere speculation; this verdict plainly comes very close to that line.\n\nRoebuck, 852 F.2d at 736. When reviewed as a whole, even in the light most favorable to the nonmoving party, the record in this case as well allows for the inferences on which the plaintiffs rest their case. Nonetheless, we cannot find that the district court abused its discretion in concluding that the verdict was clearly against the weight of the evidence in view of the inferences the jury must have made despite contrary direct evidence, and especially in view of the district court's finding that plaintiffs' trial counsel advanced prejudicially improper arguments to the jury throughout the trial, culminating in a particularly offensive summation.\n\nGiven the wealth of questionable remarks made by plaintiffs' trial counsel and the highly inferential case, we are clearly convinced that the district court did not abuse its discretion in awarding Armstrong a new trial.\n\nVI. Directed Verdict and Summary Judgment Order\n\nBecause we will remand this case to the district court for a new trial on TINS' tortious interference claim, we now address two other dispositive orders of the district court: the directed verdict on TINS' section 1 claim and the summary judgment on its breach of contract claim.\n\nA. TINS' Sherman Act Section 1 Claim\n\nSection 1 of the Sherman Act prohibits \"every contract, combination . . ., or conspiracy in restraint of trade or [interstate] commerce. . . \" 15 U.S.C. § 1 (1982). A judicial gloss of reasonableness has been cast over section 1; to be actionable, a restraint of trade must be unreasonable. See Business Electronics, 485 U.S. at 723. A section 1 claim thus requires proof of two elements: concerted action and an unreasonable restraint of trade. Only the first element concerns us here.\n\nWe have variously formulated the meeting of minds requisite to an antitrust conspiracy.\n\nThe propriety of the directed verdict thus turns on whether, with regard to [Armstrong and Stern], \". . . the circumstances are such as to warrant [the trier of fact] in finding that the [alleged] conspirators had a unity of purpose or a common design and understanding or a meeting of minds in an unlawful arrangement.\n\nColumbia Metal Culvert Co. v. Kaiser Aluminum \u0026 Chem. Corp., 579 F.2d 20, 33 (3d Cir.), cert. denied, 439 U.S. 876, 58 L. Ed. 2d 190, 99 S. Ct. 214 (1978) (citations omitted). We have described the concerted action element of a section 1 claim as requiring proof of a \"conscious commitment to a common scheme designed to achieve an unlawful objective.\" Edward J. Sweeney, 637 F.2d at 111. TINS has here alleged that Armstrong and Stern conspired to destroy TINS' competitive threat to Armstrong in the relevant video market.\n\nAt the close of the plaintiffs' case, the district court orally granted a directed verdict to Armstrong on TINS' section 1 claim, determining that \"under no set of circumstances based on this record could the jury reasonably find that Stern shared Armstrong's purpose of eliminating TINS from competition in the video magazine market.\" J.A. at 3680. In so ruling, the district court rejected TINS' proposition that section 1 co-conspirators are held liable for their joint commitment to an unlawful purpose whether or not their motives for making that commitment are different. We conclude that the district court's novel approach is misplaced as it renders section 1 claims unavailable to private litigants suffering antitrust injury as a result of concerted action in a vertical matrix. Such a restrictive rule fails to recognize the difference between motive and objective and would dramatically alter the antitrust landscape in a manner unjustified by either precedent or policy considerations. As we set forth in Edward J. Sweeney, 637 F.2d at 111, the emphasis is upon the participant's \"commitment to [the] scheme [which is] designed to achieve an unlawful purpose\" (emphasis added) which is crucial. A rational factfinder could infer agreement with the objective from knowledge of the objective and action calculated to achieve the objective despite differing motives.\n\nAt the outset, it is critical to recognize that the conspirators sub judice are vertically aligned; their conspiracy consists of pressure brought by a manufacturer upon its distributor to aid it in driving a competitor out of business. In a typical vertical context, an alleged competitor to the manufacturer will not be perceived in the same light by the manufacturer's downstream distributor. Rather, any interest that a distributor might harbor in eliminating this competitor from the market would be derivative of its manufacturer. As demonstrated by this case, TINS did not pose a direct competitive threat to Stern; Stern lacked any independent motive to drive TINS from the relevant video market. Because Stern relied upon sales of Armstrong products for 90 percent of its gross revenues, however, it would naturally perceive that that which is in Armstrong's interest also inures to Stern's benefit. Stern's only possible motivation for destroying TINS would necessarily be derivative of Armstrong's desire to eliminate its competition. In this factual finding upon the record evidence, the district court was not clearly erroneous.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe parties have not suggested nor have we been able to find any authority for the proposition that vertically aligned co-conspirators must share an identical anticompetitive motive. Moreover, we cannot conceive of a situation in which vertically aligned co-conspirators seeking to destroy a competitor of only one could ever satisfy this requirement. We note that the Supreme Court has not carved out from section 1 liability a conspiracy to destroy a competitor by two firms at different levels of distribution. Although the Court has had more occasions to address per se price-fixing illegality in a section 1 context, see, e.g., Albrecht v. Herald Co., 390 U.S. 145, 19 L. Ed. 2d 998, 88 S. Ct. 869 (1968) (a vertical maximum price-fixing scheme is per se unlawful under section 1); Atlantic Richfield Co. v. USA Petroleum Co., 495 U.S. 328, 339, 109 L. Ed. 2d 333, 110 S. Ct. 1884 (1990) (same but requiring that plaintiff demonstrate antitrust injury to prevail); the same principle applies to vertical section 1 claims grounded in non-price restraints. See, e.g., Business Electronics, 485 U.S. at 724 (recognizing the viability of section 1 claims for vertical nonprice restraints under a rule of reason test).\n\nLikewise, we have not required previously an exact sharing of the anticompetitive motive for concerted action. Harold Friedman, Inc. v. Thorofare Markets, Inc., 587 F.2d 127, 143 n.64 (3d Cir. 1978) (\"Although there is no direct evidence that Union shared Thorofare's motive of eliminating a competitor, Union cannot automatically be absolved from liability on this ground, particularly since it might well have known of Thorofare's purpose and 'materially aided in the accomplishment of [its] plan'\"). In Harold Friedman, Inc. v. Kroger Co., 581 F.2d 1068 (3d Cir. 1978), we explained in some detail the contours of the factors provided by the Supreme Court in Albrecht, a vertical price-fixing case, for determining concerted action:\n\nFirst, both Milne and Kroner knew that the Herald's purpose was to assure its fixed price for the retail sale of the papers. Therefore, knowledge of the defendant's purpose to restrain trade is an important factor. Secondly, at least two members of the combination stood to benefit by the restraint of trade, the Herald by assuring the price it desired and Kroner by getting a profitable paper route. Thus, in a sense, two members of the combination shared a common purpose insofar as they both benefitted from the restraint of trade.\n\nA final important factor in Albrecht is that the agreement with Kroner was in no sense collateral to the purpose to restrain trade but went to the heart of the restraint.\n\nHarold Friedman v. Kroger, 581 F.2d at 1073.\n\nViewing the facts in the light most favorable to the plaintiffs as non-moving parties, we find that these factors were established in this case. Although the inference is broad, Roth's \"overlap\" statement,\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e could have been understood to demonstrate that Abrahamson recognized a conflict between Armstrong's and TINS' videotapes and recognized Armstrong's anticompetitive goal. Second, Armstrong clearly benefitted from eliminating TINS' competition in the video market and Stern benefitted from appeasing the supplier upon whom it was so dependent. Third, given the evidence that Armstrong executives knew of TINS' precarious financial position, the agreement between Armstrong and Stern would have been central to the demise of TINS. Thus we conclude that a rational factfinder could draw the inference that Armstrong wanted to eliminate TINS from the video market so that Armstrong would not have to compete with TINS, and that Stern knowingly aided in that effort, albeit from somewhat different motives. It is not likely that Stern believed that it was the only distributor Armstrong did not wish TINS to deal with; and a jury could find that Stern is chargeable with knowledge that if Armstrong succeeded, TINS would indeed be eliminated as a competitor in that market.\n\nThe district court erroneously relied upon Columbia Metal Culvert to hold that antitrust co-conspirators must share a common anticompetitive motive. Columbia Metal Culvert, in which a distributor brought suit under sections 1 and 2 of the Sherman Act against its former suppliers and one of its former employees for conspiring to destroy its business, differs from the case before us in a number of salient respects.\n\nFirst, in obvious contrast to Stern's role, the role of the former employee, Kennedy, was limited to leaving Columbia's employ to open a business in competition with Columbia. Although Kennedy and the supplier met on several occasions to discuss Kennedy's future plans, Kennedy's relationship with the supplier did not give rise to a reasonable inference that Kennedy was aware of his co-defendant's strategy and had knowingly associated himself with it. \"The record [was] devoid of evidence that Kennedy was privy to [the supplier's] broader machinations . . . [or] knew that the probable effect of [the supplier's] actions would be to eliminate Columbia.\" Columbia Metal Culvert, 579 F.2d at 36.\n\nFurther, and in striking contrast to the instant case, the evidence was not susceptible of an inference that Kennedy conspired with the supplier because Kennedy acted to his own economic advantage; he had thoroughly substantiated his financial need to seek a more remunerative employment. Had Kennedy acted in an economically disadvantageous manner, a factfinder could infer an anticompetitive motive instigated by a persuasive or coercive co-conspirator.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Moreover, while not explicitly stated, it is clear that when negotiating with the supplier Kennedy had not yet assumed a dependent position with respect to the supplier, investing the supplier with potentially coercive influence over Kennedy. Therefore, in Columbia Metal Culvert, we ruled that there was \"insufficient evidence from which a jury could find a 'unity of purpose, design or understanding' between Kennedy and the other defendants\". Id. at 36.\n\nOur Conclusion that a conspiracy in violation of section 1 does not require the sharing of an identical anticompetitive motive is also supported by distinguished commentators. Examining vertical conspiracies, one respected scholar, Phillip Areeda, distinguishes cases in which the two alleged co-conspirators are both named defendants (i.e., Columbia Metal Culvert) from those in which only one is named a defendant (i.e., the instant case). Areeda suggests that in a vertical situation involving an alleged conspiracy between a supplier and a coerced dealer, the subordinate dealer should not be subjected to antitrust liability. 6 Areeda, Antitrust Law P 1408d at 47-48 (1986). Accordingly, he opines:\n\nThe precedents are numerous that a § 1 conspiracy arises when an unwilling dealer, to avoid termination by [its] supplier, promises . . . to deal exclusively . . . . Of course, the vice of these vertical restraints, if there is one, is not that the coerced buyer, for example, agrees to the seller's demands, but that the seller has market power and uses it to restrain competition.\n\nId. Accord 2 Kintner: Federal Antitrust Law § 9.18 at 41-43 (unanimity of action is required and the co-conspirator's participation need only promote his own anticompetitive self-interest); Milgram v. Loew's, Inc., 192 F.2d 579, 585 (3d Cir. 1951), cert. denied, 343 U.S. 929, 96 L. Ed. 1339, 72 S. Ct. 762 (1952) (conspiracy is based upon three elements: 1) knowledge that concerted action in the scheme is contemplated; 2) uniform participation; and 3) pursuance of the scheme in apparent contradiction of the competitive interests of the participants). See also Delaware Valley Marine Supply Co. v. American Tobacco Co., 297 F.2d 199 (3d Cir. 1961), cert. denied, 369 U.S. 839, 7 L. Ed. 2d 843, 82 S. Ct. 867 (1962) (finding no conspiracy in a conscious parallelism action in which a co-conspirator did not act contrary to its economic needs).\n\nBoth Areeda and Kintner recognize that the motivations driving vertical co-conspirators will differ. Our caselaw does not controvert this sound reasoning. We conclude that although vertically aligned co-conspirators must share a commitment to a common scheme which has an anticompetitive objective, they need not share an identical motive for engaging in concerted action in violation of section 1 of the Sherman Act. We thus will vacate the directed verdict on TINS' section 1 claim and remand for a new trial on this count of the plaintiffs' complaint.\n\nB. Breach of Contract\n\nThe plaintiffs also challenge the district court's May 25, 1988 grant of summary judgment in favor of Armstrong on their breach of contract claim. This claim is governed by Pennsylvania law as stipulated in the TINS/Armstrong contract. Our review of a grant of summary judgment is plenary.\n\nAt Count 3 of their Complaint, the plaintiffs averred that Armstrong's conduct--allegedly \"improperly pressuring\" Stern to withdraw from TINS--constituted a breach of the settlement reached between TINS and Armstrong in early 1984. In granting summary judgment, the district court ruled that the settlement agreement did \"not place any continuing duty on Armstrong to instruct its representatives not to discuss the TINS program with Armstrong wholesalers.\" J.A. at 70. In this appeal, the plaintiffs contend that the district court's construction is legally unsound and renders the settlement agreement useless to TINS, \"eliminating any conceivable reason Fineman might have had to sign it.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nOur task must be to interpret the language of the settlement agreement in conformance with the intention of the parties at the time of contracting. Ress v. Barent, 378 Pa. Super. 397, 548 A.2d 1259, 1262 (Pa. Super. 1988). We glean further guidance from the Supreme Court of Pennsylvania:\n\nIn order to determine the meaning of the agreement, we must examine the entire contract since it is well settled that in construing a contract the intention of the parties governs and that intention must be ascertained from the entire instrument taking into consideration the surrounding circumstances, the situation of the parties when the contract was made and the objects they apparently had in view and the nature of the subject matter.\n\nLower Frederick Twp. v. Clemmer, 518 Pa. 313, 543 A.2d 502, 510 (Pa. 1988) (quoting Mather Estate, 410 Pa. 361, 189 A.2d 586, 589 (Pa. 1963)). The Pennsylvania Superior Court has instructed that \"the intention of the parties is the foremost consideration\" in construing a contract. Vogel v. Berkley, 354 Pa. Super. 291, 511 A.2d 878, 880 (Pa. Super. 1986). \"The court's interpretation must be one which indicates the most reasonable and natural conduct of the parties based upon the intended result of the contract.\" Id. at 880-81. With these principles of contract construction in mind, we turn to the TINS-Armstrong settlement agreement.\n\nThe settlement agreement required Armstrong's Floor Division Vice President Dennis Draeger to send a designated letter to five specifically identified Armstrong distributors to assure them that Armstrong had no objection to their distributing TINS.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Settlement Agreement P 1. J.A. at 7768. Draeger was also to follow-up those letters with personal telephone calls to confirm the substance of the letters. Id. Armstrong likewise agreed to provide a letter addressed to Fineman without restrictions as to its use.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Settlement Agreement P 2. A third letter was to be sent to any Armstrong distributor who questioned Armstrong's position with respect to TINS. Settlement Agreement P3. This letter is substantively the same as the letter Draeger was required to send to the five Armstrong distributors designated by Fineman pursuant to paragraph 1. Either Fineman or TINS could request such a letter from Armstrong, or they could inform the wholesaler to make the request. Id.\n\nArmstrong argues that, absent a request pursuant to paragraph 3, it did not owe a continuing obligation under the settlement agreement. The plaintiffs fail to meet this contention directly, implicitly recognizing that the plaintiffs failed to trigger Armstrong's obligation under paragraph 3. Nevertheless, they suggest that if the settlement agreement did not establish a continuing obligation, the plaintiffs gained nothing from signing it. Clearly, the unambiguous language of paragraph 3 imposed a continuing obligation upon Armstrong only in response to a triggering request.\n\nThe plaintiffs' more persuasive argument pertains to an alleged continuing obligation under paragraph 4. Appellant's Reply Brief at 17. Paragraph 4 of the settlement agreement provides:\n\nArmstrong represents that it has instructed all of its floor division district managers not to discuss the TINS program with Armstrong wholesalers and to refer any inquiries from wholesalers to senior sales management in Lancaster, Pennsylvania. Armstrong has further instructed its floor division district managers to inform their field representatives and personnel of said instruction.\n\nIf this language were susceptible to the district court's interpretation that it imposed only a one-time obligation upon Armstrong, according to TINS, the spirit of the agreement is undermined and TINS received inadequate consideration. For example, under this restrictive construction, Armstrong could have delivered a subsequent contradictory instruction and still have been deemed in compliance with the settlement agreement. Or, alternatively, Armstrong's district managers could have deliberately disobeyed their instructions without subjecting Armstrong to liability for breaching the agreement.\n\nThis restrictive interpretation of paragraph 4 reduces Armstrong's obligation to a hollow and meaningless exercise. The implicit assumption underlying paragraph 4 is that once instructed, Armstrong's district managers will prospectively comply with their instructions. The giving of a bare instruction divorced from any obligation to obey it would not have yielded anything of value to TINS. It follows that the only reasonable construction of paragraph 4 includes a continuing representation that Armstrong's district managers will abide by their instructions and that distributors' inquiries about TINS would be referred to Armstrong's Lancaster headquarters.\n\nArmstrong contends in this regard that a restrictive reading of paragraph 4 should stand because TINS received adequate quid pro quo in paragraph 3 (providing for an Armstrong letter upon request). We reject this contention because, read as a whole, the settlement agreement provided two prophylactic measures against prospective Armstrong interference: 1) the enunciation by Armstrong's Lancaster headquarters of a neutral position on TINS (paragraph 4); and 2) confirmation of that position upon request in the form of a letter (paragraph 3). The first measure, insofar as it dictated the silence of Armstrong's district managers, by its terms was expected to operate without a specific request. In combination, the two provisions cover all the bases. We conclude that paragraph 4 of the settlement agreement did impose a continuing obligation upon Armstrong. For this reason, we will vacate the grant of summary judgment and remand this claim for trial on the question of whether that obligation was breached.\n\nVII. Election of Remedies\n\nBecause we will remand this matter for a new trial upon TINS' tortious interference, Sherman Act section 1 and breach of contract claims, the district court may again confront the issue of an election of damages. Pursuant to the verdict, the district court entered judgment for TINS on the antitrust claims in the amount of $58,500,000, trebling the $19.5 million awarded by the jury, or at TINS' election, $217,700,000 for compensatory and punitive damages, plus prejudgment interest. J.A. at 89.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e TINS claims that it is entitled to recover both sums of damages. Since we have reinstated the contract claim, we will also address that count.\n\nThe district court accurately noted that TINS had premised both its antitrust and its tort damages upon its loss of future profits; we presume that the breach of contract damages would be predicated upon that same loss. For purposes of compensatory damages, then, the district court appropriately limited TINS to a single recovery for lost profits. We are unpersuaded that a plaintiff whose case concerns a single course of conduct (Armstrong's interference with Stern's and TINS' prospective contractual relationship) and a single injury (TINS' lost future profits) should recover those profits twice or thrice over for each legal theory advanced in favor of liability. This would yield an unwarranted windfall recovery. No matter how labeled, TINS presented a single loss of future profits to the jury. Simply because TINS was able to wrap that loss into several different legal theories of recovery does not entitle it to recoup twice. Thus the district court may appropriately award a single compensatory damage figure, which might, upon retrial represent the jury award arising from the breach of contract claim, compensatory tort damages, or the antitrust damages prior to trebling.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe same principle applies to the alternate punitive damage awards; TINS must elect between recovering under either tort law with any punitive damages or under its antitrust claim with its treble damages. TINS reasons that the recovery of both punitive damages and trebled antitrust damages would not constitute \"double recovery,\" citing differing purposes allegedly served by punitive and trebled damages. Whereas traditional punitive damages serve to deter wrongful conduct and punish a tortfeasor, TINS argues that Congress envisioned that an additional remedial purpose would be served by trebled antitrust damages, namely the encouragement of private damages actions. See Brunswick Corp., 429 U.S. at 485-86 \u0026 n.10. Accordingly, TINS suggests that recovery of both awards would not be duplicative and would promote remedial and desirable private antitrust actions. See American Soc'y of Mechanical Engineers Inc. v. Hydrolevel Corp., 456 U.S. 556, 575, 72 L. Ed. 2d 330, 102 S. Ct. 1935 (1982) (\". . . the antitrust private action was created primarily as a remedy for the victims of antitrust violations\").\n\nTINS is only partially correct in our view. Although treble damages are not solely punitive in character, they do serve a penal and deterrent function in addition to a remedial one, and as a consequence do overlap somewhat with punitive damages. See Brunswick Corp., 429 U.S. at 477; Perma Life Mufflers, Inc. v. International Parts Corp., 392 U.S. 134, 139, 20 L. Ed. 2d 982, 88 S. Ct. 1981 (1968). Moreover, we fail to discern how requiring an election of damages would undermine the remedial purpose of trebled antitrust damages. Under an election scheme, the plaintiff will simply choose the larger of the alternative damage awards. Where a plaintiff can predict that trebled antitrust damages may exceed a compensatory and punitive damage award, an election scheme will not diminish a private party's incentive to bring an antitrust claim.\n\nIn the event that TINS prevails upon more than one cause of action upon retrial, we hold that the district court may properly require it to elect either tort or antitrust recovery and that TINS may only recover once for compensatory damages.\n\nVIII. Conclusion\n\nWe will affirm those orders of the district court granting judgment n.o.v. to Armstrong on the Sherman Act section 2 claim and Fineman's individual tort claim. We will reverse the order of the district court granting judgment n.o.v. on TINS' tort claim and affirm the grant of a new trial on that claim. We will vacate the directed verdict on the Sherman Act section 1 claim and the summary judgment on the breach of contract claim.\n\nFinally, we will remand this matter to the district court for a new trial on TINS' tortious interference, breach of contract and Sherman Act section 1 claims.\n\nThe assignment of costs will be set forth in a separate order.\n\n\u003cspan class=\"fn\"\u003e* Honorable John P. Fullam of the United States District Court for the Eastern District of Pennsylvania, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Since this trial and all subsequent motions occurred prior to the amendment of Rule 50 providing for judgment as a matter of law, in this opinion we will employ the traditional terminology of directed verdict and judgment notwithstanding the verdict that was in effect until December 19, 1991.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The remaining 5% of its resilient business might consist of sales of adhesive products or other accessory products that are not supplied by Armstrong.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Armstrong has since sold its carpet division and has added a ceramic tile line.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. TINS entered into an agreement with RCA to have RCA supply televisions and video cassette recorders at a discounted price. Both the distributor and TINS received commissions on these equipment sales.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Guzinsky's memo read, in pertinent part: There is a possibility that some of you may be contacted regarding a new video based retail floorcovering communications program being introduced called \"TINS.\" The program is being presented to independent wholesalers throughout the country for sale to floorcovering retailers in specific markets. The objective is to establish a network of retailers who will utilize various video based programs on a monthly basis. The system would also allow for some localized wholesaler presentation, which the wholesaler must produce locally. We feel the \"TINS\" program will require a considerable amount of selling time on the part of your wholesaler salesmen, which I know you would agree, could be better utilized selling [Armstrong products]. At the same time, we feel this program conflicts with our mutual video plans and would not prove to be in our mutual best interest. We have heard that the organization selling \"TINS\" has stated that several Armstrong wholesalers have already purchased the system and will be selling it to their customers. To the best of our knowledge, no Armstrong wholesaler has committed to the \"TINS\" system. Therefore, if you receive any queries, you will have this information. We are working constantly to develop logical video systems such as the program you will be showing shortly to your carpet Studios and feel we can satisfy both our needs in this area. J.A. at 7286.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. District Manager Csrnko wrote: We have been advised via Lancaster that there is a possibility that some of our wholesalers, if not all, might be contacted regarding a new video based retail floor covering communication program being introduced called \"TINS.\" This program is being presented to independent wholesalers throughout the country for sale to floor covering retailers in specific territories. The objective is to establish a network of retailers who will utilize various video based programs on a monthly basis. The system would also allow for some localized wholesaler presentation, which the wholesaler must produce locally. We obviously feel the \"TINS\" program will require a considerable amount of selling time on the part of wholesaler salesmen, which could be better utilized selling [Armstrong products]. At the same time, we feel this program conflicts with the future video plans and certainly would not prove to be in our combined best interests. The organization selling \"TINS\" has stated that several Armstrong wholesalers have already purchased the system and will be selling it to their customers. To the best of our knowledge, no Armstrong Floor Division wholesaler has committed to the \"TINS\" system. Some have been approached; however, they haven't agreed to merchandise the system. Therefore, if you receive any inquiries regarding \"TINS,\" please try to discourage your wholesalers [sic.] participation and offer suggestions on how their time could be directed towards [sic.] a more important Armstrong sales effort. Additionally, please notify me as soon as the offer has been made to your wholesaler. I want to make sure we all stay on top of this competitive effort. J.A. at 7591.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Armstrong's local sales manager for carpet, Robert Guzinsky, also at the meeting, reportedly told Abrahamson that TINS \"sounds like a good idea\" J.A. at 4048.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court merged the state law antitrust claims with the Sherman Act claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Paragraph 28 of the Complaint, falling under a section entitled \"Count I\" (the section one antitrust claim) provides: [as a result of Armstrong's conduct], plaintiff Fineman's reputation as a management consultant, in fact one of the leading management consultants in the floor covering industry, was severely damaged. He was thus eliminated as a credible force in assisting distributors to reduce their inventory levels, thus permitting Armstrong to sell to its distributors more inventory than they actually needed. It is extremely damaging to a management consultant to have suffered an insolvency, given the nature of such a profession. Confidence in such a person is lost if it is known that the consultant's own business went under. In addition the pretrial statement includes in the plaintiffs' statement of legal issues the following: \"Plaintiff Fineman is entitled to an award of lost earnings or profits from his consulting business.\" J.A. at 780. The district court ruled that both the Complaint and pretrial statement adequately averred Fineman's individual tortious interference claim. J.A. at 6827.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Armstrong's counsel prefaced this statement of the issues with an assertion that he had \"nothing really to add that's not in our brief.\" A search of the docket sheet in the district court reveals that this document was not filed with the Clerk's office and therefore does not appear of record. For that reason we have before us only the oral statement of the two grounds for directed verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The plaintiffs also assert on appeal that the district court erred in resolving the issue of the application of the Connecticut Act because of the invited errordoctrine involving Armstrong's proposed jury instructions. We find that because Armstrong had consistently contended that the Connecticut Act barred any claim for tortious interference, this legal issue was consistently preserved. Thus we decline to address the invited error doctrine in this instance. In any case, because the Connecticut Act issue is likely to arise during a new trial, we will address it now.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Act specifically provides that: No person shall in connection with the sale or offer for sale of a business opportunity: (1) sell or offer for sale a business opportunity in this state or from this state unless it has first been registered with the Commissioner and declared effective by the Commissioner in accordance with the provisions of § 36-505; (2) represent that the business opportunity will provide income or earning potential of any kind unless the seller has documented data to substantiate the claims of income or earnings potential and discloses this data to the prospective purchaser-investor at the time such representations are made; . . . (5) make any claim or representation in advertising or promotional material, or in any oral sales presentation, solicitation or Discussion between the seller and a prospective purchaser-investor, which is inconsistent with the information required to be disclosed by this chapter; (6) directly or indirectly (A) employ any device, scheme or artifice to defraud, (B) make any untrue statement of material fact or omit to state a material fact necessary in order to make the statements made, in light of the circumstances under which they are made, not misleading, or (C) engage in any act, practice or course of business which operates or would operate as a fraud or deceit upon any person. Conn. Gen. Stat. § 36-510.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Because application of the Connecticut Act does not preclude TINS' recovery, we need not address TINS' second contention, that the Act does not apply at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Among other attacks, plaintiffs' trial counsel -- no longer counsel before this court -- sought to attribute inconsistencies and alleged inconsistencies in defense witnesses' depositions and trial testimony to counsel's coaching; we note that he caused the court to interrupt the progression of the trial prior to Armstrong's summation by alerting securities analysts to the pendency of this lawsuit and the \"probability of a multimillion dollar plaintiffs' verdict\" because he believed Armstrong and its lawyers had improperly failed to disclose this information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. This figure comports with Abrahamson's testimony that he expected to recoup the cost of the distributor fee of $16,000 within six months. J.A. at 4290. Although $29,000 was promised to Abrahamson, the record is cloudy as to how Fineman made the calculation. As will be detailed in some length in Part V.B. when we deal with the district court's grant of a new trial for the reason that the verdict was against the weight of the evidence, the record evidence casts doubt upon this rosy projection of $29,000. For example, charter distributors who had signed on before the settlement agreement received royalties of $8 per videotape sold. However, this royalty had been reduced to $5 by the time TINS was offered to Stern. J.A. at 2513. Fineman also testified that he estimated Stern would sell 200 subscriptions and Abrahamson more optimistically calculated 300. The $29,000 in promised royalties, however, appears to be rounded up from ($8/videotape) (12 months) (300 subscribers) = $28,800. J.A. at 2515. Fineman was not able to account for this discrepancy. Moreover, Fineman conceded that TINS distributors' salesmen had each averaged 11 subscriptions prior to the solicitation of Stern. Thus, given Stern's sales force of 13, a more reliable estimate of potential subscriptions might have been 143 rather than Fineman's 200, see J.A. at 2517, resulting in annual royalties of $8,580 or ($5) (12 months) (143 subscribers).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. TINS suggests that \"this restaurant story was simply concocted by Abrahamson both to reinforce his claim that the sales force opposed the program, and to distance himself from responsibility.\" Appellants' Brief at 16. A Stern employee, McGuire testified that he did not see Abrahamson at the restaurant at any time, J.A. at 5362, although there is evidence that the layout of the restaurant in several small rooms could account for this inconsistency.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The parties have not suggested, nor have we been able to find, any New Jersey cases addressing a claim for tortious interference brought by a plaintiff who was not a party to the contract. Assuming without deciding that New Jersey would permit such a claim, we must determine whether this record supports Fineman's individual claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. If this proposition were true, Armstrong's possession of a 21% market share in hard surface floor covering products would, as a matter of law, defeat TINS' section 2 claims. J.A. at 5956. See Domed Stadium Hotel, Inc. v. Holiday Inns, Inc., 732 F.2d 480, 489 (5th Cir. 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In so finding, we have combed the substantial trial transcript and concluded that it supports the jury's verdict in this respect. Thus we have not needed to view the actual videotapes and video disks supplied by the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. At trial, Armstrong advanced the theory that its video network did not differ from selling aids provided in different media forms. TINS produced sufficient evidence from which the jury may have reasonably concluded that the video medium was not reasonably interchangeable with print. See, e.g., J.A. at 1633 (Fineman testified that a picture is worth a thousand words); 2917 (Al Wahnon, publisher of Floor Covering News, explained that print magazines were \"faster breaking\" than video magazines).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The resilient industry referred to in this opinion encompasses both sheeting and tile forms of vinyl floor coverings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. TINS alluded to evidence that Hal Clark's supermarket industry video magazine start-up costs of $1.5 million proved a formidable barrier to entry. By Clark's own testimony, however, his \"Supermarket Insights\" differed significantly from TINS or Armstrong's videos. Clark's was gratuitously provided to a limited number of top industry executives and financed through paid advertising. TINS' revenue came from entirely different sources, i.e., subscribers, and its target audience was widely-based.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Danny Kresky involved the use of monopoly leveraging in one city to exclude a competitor from promoting concerts in another. SmithKline involved monopoly leveraging over sales of antibiotics to set prices in the cephalosporin drug market for cephalosporin drugs at a level at which competitors in the leveraged market could not compete. Because the plaintiffs had proven conduct traditionally proscribed by the Sherman Act, neither case implicated the issue with which we are faced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Section 1 proclaims that \"every contract, combination . . ., or conspiracy, in restraint of trade . . . is . . . illegal.\" Section 2 declares as illegal \"every person who shall monopolize, or attempt to monopolize, or combine or conspire with any other person or persons, to monopolize . . . .\" 15 U.S.C.A. §§ 1, 2 (West Supp. 1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We note that because of our Disposition of the Sherman Act section 2 claim on appeal, see supra Part IV, a new trial on remand would not include a section 2 claim. A new trial would, however, include a Sherman Act section 1 claim and a contract claim, discussed infra Part VI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Armstrong objected to plaintiffs' trial counsel's improper remarks by filing a motion in limine to limit his closing argument, moving for a restraining order, placing several objections on the record during his summation and moving for a mistrial following summation. J.A. at 6988; 7154; 7158-59; 7206. Although Armstrong's counsel did not object to each potentially improper remark, the district court concluded that it had adequately preserved its objections. J.A. at 229. The district court did not abuse its discretion in ruling that Armstrong was not required to object to each and every objectionable remark because requiring such action would have unnecessarily created even more prejudice to Armstrong in the eyes of the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. These \"misrepresentations\" consisted of Armstrong's version of disputed material facts. A demonstrative aid shown to the jury listed \"[Defense Counsel's] Significant Misrepresentations In Summation.\" J.A. at 1296-1303. These \"misrepresentations\" attributed to Armstrong and \"facts\" attributed to plaintiffs merely consisted of two versions of disputed factual issues. A brief excerpt demonstrates: MISREPRESENTATION FACTS 12. Donofrio said that there 12. By the end of the day Fridaywas a continuing the sales staff wasproblem with the quality fully in favor of goingof the June issue in the forward.eyes of the Stern's salesstaff. 14. Sterns was scheduled to 14. Sterns admits that nogo out on Monday after advance appointmentsthe sales training. were made. 15. Parties do not compete. 15. Armstrong's own documents show that they view TINS as competitor. 18. Armstrong has never 18. Floor Fashion Centersold a single sells for $8,000 to buysubscription to in and ongoing $1,000Armstrong's Video per year includesNetwork. Armstrong Video Network. 22. TINS and Armstrong 22. Armstrong's ownwere not competitors. documents reveal that Armstrong considered TINS to be a prime competitor. See, for example, Csnrko 10/25/83 memo (\"competitive effort\"). See Guzinsky 9/25/83 memo (\"TINS conflicts with future video plans\"). See Roth testimony (\"considered TINS to 'overlap' with Armstrong Video Network\"). 24. Contends Armstrong's 24. Mannington chart showsmarket share is only Armstrong market share25-30%. as 49%. J.A. at 1296-1303.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. One quote neatly capsulizes plaintiffs' trial counsel's summation in these respects. After recreating a question put to Armstrong witness Dennis Draeger concerning whether Roth's comments to Abrahamson \"[weren't] just a blatant, blatant, blatant disregard of what you were supposed to do?\", he argued, And God bless him, please, in front of a federal Judge and I ask him that question. He's in front of a federal jury and he's got the nerve to say, no, it's not inconsistent. God bless him. He's got a lot of nerve. Can you imagine he's looking you in the eye? I mean, does he think you just got off the boat? Who does he think he is? Really. That is insulting. J.A. at 7050.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In Ayoub, a personal injury case, we considered defense counsel's representation that the plaintiff's testimony was inconsistent with his medical history as contained in two sets of hospital records. One set of records was not submitted into evidence, although a doctor testified that in practice a medical history was based upon the patient's description. Thus, the effect of counsel's remark was to insinuate that Ayoub had given inconsistent statements about his medical condition. We ruled that \"reversible error is committed when counsel's closing argument to the jury introduces extraneous matter which has a reasonable probability of influencing the verdict.\" Id. at 170; see also Draper, 580 F.2d at 96 (in a wrongful death action, it was improper for plaintiff's counsel to speak of meeting with the decedent's children, who did not testify, and use that as an improper springboard to speculate as to the decedent's motivation for attempting the dangerous, and ultimately fatal, job). Even the district court's instruction, that the jury would have to \"recall the testimony about [the missing set of hospital records]\" did not suffice to cure the prejudice. Ayoub, 550 F.2d at 170 \u0026 n.10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Armstrong primarily reiterates an insufficiency of the evidence challenge to TINS' theory of conspiracy. If this were borne out by the record, then Armstrong's evidence that Stern acted independently and in accordance with its own business interests would prevail to defeat any conspiracy motive or theory. However, for the reasons provided above in Part III, we reject Armstrong's formulation of the reasonable inferences that may be garnered from the trial record. TINS' proposition that distributing the TINS magazine would have been highly profitable to Stern by enabling Stern to supplement its income with subscription royalties is amply supported in the record as is the inference of motivation on Stern's part to enter the conspiracy, namely, Stern's heavy reliance upon Armstrong as the supplier of 90% of its product. In addition, TINS produced evidence to show that Stern was not achieving a desired level of profitability and Armstrong had encumbered Stern with inventory liens. Although Armstrong vigorously contested the existence of, or permissible interpretation of, each of these alleged facts, because we may not tread on the jury's credibility determination function, we must presume in reviewing this directed verdict that the jury would believe TINS' factual contentions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Roth had testified that he perceived TINS would \"overlap\" with Armstrong's video program and \"probably\" had counseled Abrahamson that distributing TINS would not make \"a lot of sense.\" See supra Part III.E.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Armstrong inexplicably cites to a conscious parallelism case, Venzie Corp. v. United States Mineral Prod. Co., Inc., 521 F.2d 1309, 1314 (3d Cir. 1975), for the proposition that our precedent requires that \"proof of an antitrust conspiracy must include the 'satisfactory demonstration of a motivation to enter an agreement' reflecting the conspiracy.\" Appellee's Brief at 53. In order to find evidence of concerted action in a parallel refusal to deal situation, we required: 1) action contrary to the co-conspirator's economic interest; and 2) a satisfactory demonstration of a motivation to enter an agreement as required in First Nat'l Bank v. Cities Serv. Co., 391 U.S. 253, 287, 20 L. Ed. 2d 569, 88 S. Ct. 1575 (1968). These requirements insulate from liability coincidental, as opposed to concerted, parallel refusal to deal cases. The case sub judice arises in an altogether different factual context. In this vertical matrix and given our standard of review, we find that the record is replete with evidence of Armstrong's motive and Stern's dependence upon Armstrong, should the jury choose to credit TINS' evidence. Thus we need not require the same checks against speculation in a vertical case as we do in a conscious parallelism case. As a factual matter as well, the evidence, if it is credited by the jury, suggests that Stern acted against its economic interest in reneging on distributing TINS.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The plaintiffs also make mention of an implied duty of good faith and fair dealing. As Armstrong points out, this allegation appears to have arisen initially upon appeal. Therefore we decline to address it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In pertinent part, this letter represented Armstrong's position with respect to TINS as follows: We believe that specialization of sales management and sales personnel is the most effective way for a wholesaler to compete in the resilient flooring business. Mr. Fineman has assured us that it would be unnecessary to use the specialized selling staff on an ongoing basis to service or further promote his program. On that basis, we have become convinced that Mr. Fineman's program would not adversely affect this specialization when your Armstrong specialized selling force is used only for the initial presentations of TINS to potential TINS retail subscribers with a minimal time commitment of your selling force thereafter. Therefore, based upon Mr. Fineman's assurances, we advise you that Armstrong does not object to any Armstrong wholesaler utilizing the TINS program. You have my personal assurance, [insert name of addressee], that whatever independent business decision you make regarding the TINS program will not in any manner affect our goal of working together as a team. It is not the policy of Armstrong to express any opinions on products other than their own and, therefore, Armstrong expresses no opinion for or against the use of TINS. J.A. at 7772-73.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. This letter reads: Dear Mr. Fineman: Thank you for your time last week and your explanation of TINS. It is unfortunate that we have had a misunderstanding relating to the use of TINS by Armstrong wholesalers. As you know, Armstrong believes that specialization of sales management and sales personnel is the most effective method of distribution of our resilient flooring products. Thanks to your explanation and assurances, we now realize that the TINS program would not adversely affect this specialization concept. Our other concern was the degree of availability of the TINS program to our wholesalers. You have addressed this concern by assuring us that if TINS is made available to an Armstrong wholesaler in a particular trading area, TINS will be made available on a competitively equal basis to all other Armstrong wholesalers in that particular trading area. Therefore, Mr. Fineman, I have sent the attached letters to certain Armstrong wholesalers with which you are having negotiations. These letters are intended to clear up any misunderstandings and assure those wholesalers that Armstrong is not, in any way, attempting to influence their independent business decisions relating to the use of TINS. Of course, you must realize that Armstrong cannot, as a matter of policy, recommend a preference for any product which is neither manufactured nor marketed by Armstrong World Industries, Inc. We continue to follow this policy with respect to TINS. Sincerely, D. M. Draeger J.A. at 7775.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. This ruling was in part premised upon a concern that the jury had been unable to convey coherently whether any portion of the $17.7 million in antitrust damages and $19.5 million in tort damages awarded to TINS overlapped each other. The district court had instructed the jury as follows: If, but only if, you have awarded monetary damages as set forth in answers to both questions 4 and 10, does all or any part of each award represent the same damages, and if so, what sum of money is included in both awards? J.A. at 100. The jury first answered $37.2 million, revealing that it had simply added the two numbers, so the district court reinstructed the jury on that point: \". . . you can't recover twice for the same injury. . . . question number 11 asks you really, was there an overlap? . . . If there was commonality, if there was overlap, if there is potential for double recovery under both questions four [tort damages] and 10 [antitrust damages], then question 11 asks you to tell me what amount is common to both.\" J.A. at 7243-44. The jury then returned with an answer of $1.8 million, which, perhaps coincidentally, also represents the difference between $19.5 and $17.7 million. Concerned that the jury may have merely subtracted, and not understood the overlap instruction, the district pointed out that their figure equalled the difference between the two damage awards and explained that subtracting them would not have conformed to his instruction. J.A. at 7251. After retiring once again, the jury returned \"moments later\" with a note \"We stand by it.\" The district court concluded that the jury's $17.7 million tort award equalled the damage figure of lost profits claimed by TINS' expert witness James Kobak whereas the record lacks any substantiation for an additional $17.7 million in lost profits on the antitrust claims, as would be true if the \"overlap\" were truly $1.8 million. J.A. at 101-02. Our independent review of the record also compels this finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. We assume that because each would be based upon lost profits, these awards would be identical; if not, we suggest that the district court mold them to the conform to the evidence.\u003c/span\u003e\n\n",
    "body_length": 180232,
    "citedas": [
      "980 F.2d 171"
    ],
    "attorneys": "John J. Gibbons, Esq., Crummy, Del Deo, Dolan, Griffinger \u0026 Vecchione, One Riverfront Plaza, Newark, NJ 07102-5497, Laurence H. Tribe, Esq. (ARGUED), Griswold Hall 307, 1525 Massachusetts Avenue, Cambridge, MA 02138, COUNSEL FOR APPELLANTS. J. Randolph Wilson, Esq. (ARGUED), Theodore Voorhees, Jr., Esq., Covington \u0026 Burling, 1201 Pennsylvania Avenue, N.W., P.O. Box 7566, Washington, D.C. 20044, Arlin M. Adams, Esq. (ARGUED), Carl A. Solano, Esq., Schnader, Harrison, Segal \u0026 Lewis, Suite 3600, 1600 Market Street, Philadelphia, PA 19103, Edith K. Payne, Esq., Stryker, Tams \u0026 Dill, Two Penn Plaza East, Newark, NJ 07105, COUNSEL FOR APPELLEE.",
    "category": [
      "124",
      "252"
    ],
    "judges": "Before: Stapleton and Mansmann, Circuit Judges, and Fullam, District Judge.*fn*",
    "citation_count": 361
  }
}
