{
  "id": "MLPYTGYBTlTomsSB_f7U",
  "document": {
    "title": "06/24/75 DEARBORN FIRE FIGHTERS UNION LOCAL NO 412",
    "full_title": "DEARBORN FIRE FIGHTERS UNION LOCAL NO 412, IAFF v. CITY OF DEARBORN; POLICE OFFICERS ASSOCIATION OF DEARBORN V. CITY OF DEARBORN",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1975-06-24T00:00:00.000Z",
    "docket": "Docket Nos. 54308, 54309",
    "body": "The Dearborn Fire Fighters Union Local No. 412, IAFF, brought an action against the City of Dearborn for specific performance of an arbitration award and for mandamus to compel specific performance of an arbitration award. The Wayne Circuit Court, Theodore R. Bohn, J., granted summary judgment for plaintiff. The Police Officers Association of Dearborn brought an action against the City of Dearborn for injunction or mandamus to compel specific performance of an arbitration award. The Wayne Circuit Court, Charles Kaufman, J., granted summary judgment for plaintiff. In each case the defendant city had refused to appoint a delegate to the statutory arbitration panel on the ground that the statute providing for compulsory arbitration of labor disputes in municipal police and fire departments, MCLA 423.231 et seq.; MSA 17.455(31) et seq., is unconstitutional. Defendant appealed each case, and the appeals were consolidated. The Court of Appeals, Bronson, P. J., and O'Hara, J. (V. J. Brennan, J., Concurring in part and Dissenting in part), affirmed (Docket Nos. 11306, 11920). Defendant appeals. Held:\n\nThe decisions of the Court of Appeals and the circuit courts granting enforcement of the arbitration awards are affirmed. The four Justices participating in the decision are agreed that\n\n1) The compulsory arbitration statute does not unconstitutionally divest home-rule cities of their constitutional powers. The home-rule powers of cities conferred by the Constitution are \"subject to the constitution and law\", and the Constitution confers on the Legislature the power to provide for resolution of disputes concerning public employees.\n\n2) The statute does not surrender the power to tax to the arbitrators in violation of the Constitution.\n\n3) The refusal of the City of Dearborn to participate in the arbitration proceedings did not deprive the arbitration panels of jurisdiction.\n\nThe Justices are not agreed on the constitutionality of the statute. Levin, J., with whom T. G. Kavanagh, C. J., concurred, would hold the act unconstitutional as an unlawful delegation of legislative power, because it entrusts the chairman of the arbitration panel with the authority to decide major political questions concerning the conditions of public employment, the levels and standards of public services, and the allocation of public revenues, but insulates him from political accountability for his decision, a scheme which is not consonant with the constitutional exercise of political power in a representative democracy. The ruling of unconstitutionality would be given prospective effect; orders of arbitration panels heretofore entered will be enforced.\n\nT. G. Kavanagh, C. J., also wrote separately to emphasize that at least as long as the law prohibiting public employees from striking is maintained, some form of compulsory arbitration is a constitutionally permissible device to provide for the settlement of disputes between such employees and their employers. Although the present law's provision for arbitrators is constitutionally defective, a law providing for a continuing politically responsible arbitrator could meet the constitution's demands.\n\nM. S. Coleman, J., would hold the statute constitutional in its entirety as not being an unlawful delegation of legislative power. The duties of the arbitrator and the panel imposed by the statute require the acts of a public officer, and it must be concluded that the Legislature intended to vest in the panel that sovereignty necessary to accomplish its mandates: the panel is a public body performing public functions. The choice of short-term panels rather than a permanent arbitration board is a question of policy set by the Legislature. By the Public Employment Relations Act the Legislature has vested in both the public employer and public employees the power to shape the boundaries of the employment contract; the statute does not expand that power, but confines it within boundaries which have been established by the parties through bargaining, and, as a final safeguard, the findings of the panel are subject to the accountability of judicial review.\n\nWilliams, J., would hold the statute constitutional insofar as it provides for appointment of the arbitrator-chairman by the chairman of the Employment Relations Commission, as was done in the instant case. The proximity of the appointing authority to election by the people is sufficient in this case to assure public responsibility of a high order. On the other hand, the statutory scheme for selection of the arbitrator-chairman by the municipal and employee representatives does not satisfy the requirement of political accountability well, but the question should be left for future decision.\n\nAffirmed.\n\n42 Mich App 51; 210 NW2d 650 (1972) affirmed.\n\nLevin, J.\n\nThe City of Dearborn challenges the constitutionality of the act (1969 PA 312) which provides for compulsory arbitration of police and fire department labor disputes. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn 1970, the City of Dearborn and unions representing its policemen and firemen (Police Officers Association of Dearborn and Dearborn Fire Fighters Union) attempted to negotiate new labor agreements. When the negotiations and subsequent mediations failed, the unions initiated arbitration proceedings under the act.\n\nEach union chose a \"delegate\" to its respective arbitration panel. The city refused to name a delegate to either panel. The absence of the city's delegate precluded selection by delegates to the panels of a third person to act as \"arbitrator/chairman\". Pursuant to the act, the chairman of the Michigan Employment Relations Commission appointed the arbitrator/chairman of the panels.\n\nEach two-member panel conducted hearings and rendered a decision. Upon the city's refusal to comply with the decisions, the unions initiated these actions. The circuit court ordered enforcement. The Court of Appeals affirmed. 42 Mich App 51; 201 NW2d 650 (1972).\n\nWe hold the act to be unconstitutional. The arbitrator/chairman of the panel is entrusted with the authority to decide major questions of public policy concerning the conditions of public employment, the levels and standards of public services, and the allocation of public revenues. Those questions are legislative and political, not judicial or quasi-judicial. The act is structured to insulate the arbitrator/chairman's decision from review in the political process. It is not intended that he be, nor is he in fact, accountable within the political process for his decision. This is not consonant with the constitutional exercise of political power in a representative democracy.\n\nWe give this ruling prospective effect. Orders of arbitration panels heretofore entered will be enforced.\n\nI\n\nBecause we give our ruling on the constitutionality of the act prospective effect only, we consider the city's other challenges to the validity of the orders. We find that the arbitration panels proceeded in accordance with the provisions of the act. Their orders, accordingly, will be enforced.\n\nThe absence of the city's delegates from the arbitration panels did not deprive the panels of subject matter jurisdiction.\n\nThe act provides: \"the employees or employer may initiate binding arbitration proceedings\". \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e (Emphasis supplied.) \"Upon their [the city's and the union's delegates'] failure to agree upon and appoint the arbitrator * * * either of them may request the chairman of the state labor mediation board to appoint the arbitrator\". \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e (Emphasis supplied.)\n\nIt is apparent that once either party requests arbitration, \"the other party's participation is compulsory, and arbitration necessarily follows\". \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe city would require a union confronted with a recalcitrant public employer to seek a court order to compel the employer to submit to arbitration. This additional step would encourage dilatory practices and would be at odds with the act's policy of providing \"an alternate, expeditious, effective and binding procedure for the resolution of disputes\". \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAlso without merit is the city's challenge to the fire fighter order on the ground that the panel failed to issue its order within the 30-day period prescribed in the act. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nII\n\nThe city contends that compulsory arbitration unconstitutionally divests home-rule cities of their powers under the Constitution. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe powers reserved in the Constitution to home-rule cities are expressly \"subject to the constitution and law\". Const 1963, art 7, § 22 (see fn 7).\n\nThe power of the Legislature to provide for the resolution of disputes in public employment is explicitly stated in § 48 of article 4 of the Constitution: \"The legislature may enact laws providing for the resolution of disputes concerning public employees, except those in the state classified civil service\". The city contends that under this provision the Legislature may \"regulate\" but not \"control\" municipal labor relations. The proffered distinction between \"regulation\" and \"control\" eludes us.\n\nThis Court recently held \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e that the home-rule powers \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e of the Common Council of the City of Detroit to adopt a residency requirement and a retirement plan are subject to the City's obligations as a public employer under the public employment relations act \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and that both residency and retirement benefits are mandatory subjects of collective bargaining under the PERA. Referring to § 48 of article 4, we said: \"PERA is such a law [\"for the resolution of disputes concerning public employees\"] and we as a Court are required to follow the constitutional intent of the Legislature\". Detroit Police Officers Association v Detroit, 391 Mich 44, 59; 214 NW2d 803 (1974).\n\nRelying on § 48 of article 4, we previously had rejected claims of the Regents of the University of Michigan that the PERA infringes upon the constitutional autonomy of the Regents. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Regents of the University of Michigan v Employment Relations Commission, 389 Mich 96; 204 NW2d 218 (1973). Still earlier, this Court held that the \"authority and duty\" of the Wayne County Civil Service Commission under an act of the Legislature \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e \"was diminished pro tanto, by the\" enactment of the PERA. Wayne County Civil Service Commission v Board of Supervisors, 384 Mich 363, 374; 184 NW2d 201 (1971).\n\nThe constitutional and statutory powers of a home-rule city to establish the conditions of public employment are subject to the power of the Legislature. The Legislature may properly provide for the resolution of disputes concerning employees of home-rule cities -- as well as other public employees, except those in the state classified civil service -- and may impose the resolution on both the public employer and the public employees.\n\nThe city additionally contends that the challenged act \"indirectly, but undeniably, surrenders the power to tax\" in violation of the following constitutional prohibition: \"The power of taxation shall never be surrendered, suspended or contracted away\". Const 1963, art 9, § 2. The city premises that wage and benefit increases for policemen and firemen can only be paid by the imposition of new taxes. \"Accordingly, the power to grant such pay increases includes the power to increase taxes.\"\n\nThe orders of the arbitration panels do not in terms require an increase in taxes. Assuming the predicate of the city's argument, that existing revenues are insufficient to fund the cost of the increases in compensation and benefits awarded, the orders can be read as contemplating either an increase in taxes or a decrease in other municipal expenditures. Be that as it may, implicit in the power conferred by the Constitution on the Legislature to \"resolve\" disputes concerning public employees is legislative power to require, if need be, a public employer to provide the necessary funds subject to constitutional limitations, e.g., the 15-mill limitation. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The constitutional prohibition against surrender of the power of taxation has not been violated.\n\nIII\n\nThe constitutional principle restricting the delegation of legislative power is invoked against this delegation of the power to resolve a labor dispute to persons other than governmental officials or tribunals. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAlso implicit in the legislative power to enact laws providing for the \"resolution of disputes concerning public employees\" is the power to delegate the resolving authority; clearly it was not intended that the Legislature itself decide each and every dispute. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe non-delegation doctrine, Professor Davis has written, is \"almost a complete failure\". \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In his treatise, State Administrative Law, Professor Cooper demonstrated that it is not possible to devise a \"true test\" for determining whether a particular delegation will be sustained, one articulating and enumerating all the factors that motivate the judicial response. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e In the final analysis, courts, \"weighing the advantage of delegation against the hazards involved\", \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e make a pragmatic analysis of whether the consequences of the delegation are so undesirable as to require judicial intervention.\n\nAnother writer pertinently notes that while \"the old delegation doctrine\" has been rightly repudiated as an \"absolutist legal theory\", the \"doctrine has an underlying core of validity in that it requires that those who have been selected by a given process and from a given constituency retain the power to make ultimate policy decisions and override decisions made by others\". \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nCompulsory arbitration is viewed by some as the corollary of the statutory prohibition of strikes by public employees. Unless there is some constraint on public employers, they may ignore legitimate negotiation demands of the employees and illegal strikes may result.\n\nThe challenged act represents a legislative attempt to prevent the dire consequences of strikes or work stoppages by certain public employees -- policemen and firemen.\n\nThe experience in Michigan so far has been favorable. Work stoppages by policemen and firemen have been infrequent. But whether this is a function of compulsory arbitration or of the workers' general satisfaction with the decisions is unclear. Montreal, despite compulsory arbitration, has experienced illegal policemen and firemen strikes. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nA number of states have enacted legislation similar to Michigan's providing for binding arbitration as the terminal step in the bargaining process between municipalities and policemen, firemen and some other public employees. The highest courts of several states have upheld the constitutionality of compulsory arbitration. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nDespite the uniformity of the judicial response in upholding compulsory arbitration provisions, the analysis is neither consistent nor persuasive.\n\nThe Supreme Court of Wyoming avoided the real issue by refusing to characterize as a delegation of legislative power the arbitrator's power to decide \"wages, hours of service, and working conditions\". \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe Rhode Island Supreme Court acknowledged that the arbitrator's \"power to fix the salaries of public employees clearly a legislative function\", but analyzed a challenge to the constitutionality of the delegation in a manner which has been correctly criticized as \"wholly tautological\". \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIn Rhode Island, as in Michigan, the arbitration panel consists of three members. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Each party selects an \"arbitrator\" and the arbitrators \"agree upon and select and name a third arbitrator\" to serve as chairman of the panel. If the parties could not agree, the third arbitrator was selected by the Chief Justice of the Rhode Island Supreme Court. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe Rhode Island Supreme Court said that the determinative question was whether decisional authority had been delegated to public officials or improperly to private persons. It reasoned that since the panel enjoys the legislative \"power to fix the salaries of public employees, * * * without control or supervision from any superior\" and its term of service and duties are specified by statute, each member of the panel (including the union arbitrator and the public-employer arbitrator) is a \"public officer and that collectively the three constitute a public board or agency\". Such nominalistic reasoning both begs the question and reduces the analysis of the issue to a reason-free debate over labels. Such reasoning could countenance the syllogism that all enactments of the Legislature are constitutional because the Legislature cannot pass an unconstitutional law.\n\nIn Harney v Russo, 435 Pa 183; 255 A2d 560 (1969), the Pennsylvania Supreme Court upheld the constitutionality of a compulsory arbitration statute against a challenge based on the absence of statutory guidelines or standards. The Court's decision rested heavily on the passage, subsequent to a judicial decision striking down a compulsory arbitration statute, of a constitutional amendment authorizing the legislature to enact laws making the findings of panels or commissions in policemen and firemen disputes binding on public employers. Because of the unique constitutional history of the Pennsylvania statute, obviating analysis of the question before us, its opinion is of little assistance.\n\nIn Pleasant Ridge v Governor, 382 Mich 225; 169 NW2d 625 (1969), this Court sustained the constitutionality of a statute providing for compulsory arbitration to select a highway route. The principal challenges concerned the adequacy of the standards prescribed to guide the administrative commission/arbitration board in the exercise of the delegated power and the failure to provide for judicial review of the decision. This Court did not consider whether there was an unlawful delegation of legislative power to an independent and politically unaccountable person.\n\nIn Pleasant Ridge, in contrast to the broad-ranging power of a police or fire department arbitration panel, the power delegated -- to choose between alternative highway routes -- was limited. After the Legislature had itself made the decision to proceed with construction of the highway and to expend the necessary public funds and, after the location of the alternative routes was outlined, the Legislature delegated a narrow responsibility to the panel.\n\nThe decision of the Pleasant Ridge arbitration panel set no precedent affecting other communities in the selection of other highway routes. It was a unique situation immediately affecting a relatively small number of persons.\n\nAct 312 arbitration panels, in contrast, recurringly establish the level of wages and working conditions for firemen and policemen across the state. The awards granted by Act 312 panels establish guidelines affecting compensation packages of other policemen and firemen and establish precedents which are often advanced by other public employees. The attendant increase in the cost of public services and the possible effect on the level of services and taxes caused directly or indirectly by the awards of Act 312 panels concern the entire population of the state.\n\nIV\n\nThe injection of compulsory arbitration into municipal labor relations has been the subject of considerable critical comment. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nProfessor George W. Taylor wrote that third-person arbitration is a greater threat to the performance of the functions of representative government than the strike it seeks to forestall:\n\n\"Some persons would 'simplify' matters by 'forthrightly' adopting some form of compulsory arbitration in all the political jurisdictions. This course, until now, has been almost universally rejected in the private sector, because it would undermine private agreement-making, which is the cornerstone of the enterprise system. Compulsory arbitration is not more, and perhaps less, appropriate in the government sector. For reasons expressed heretofore, a strike of government employees interferes with the orderly performance of the functions of representative government. Compulsory arbitration is a greater threat -- it entails a delegation to 'outsiders' of the authority assigned by the electorate to elected officials, who are subject to the checks and balances of our governmental institutions.\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nA number of other commentators have questioned the propriety of government abdicating its responsibility to decide financial and other fundamental policy questions to a person who is not politically responsible and accountable, directly or even indirectly, to the electorate, locally or statewide:\n\n\"ompulsory arbitration amounts to a delegation of the responsibilities of public management and of the lawmakers to outsiders. In my view, this is incompatible with the basic principles of representative government. In fact, it can become a most convenient way to duck hard issues by passing them on to a board that is only temporarily in office and that is not responsible to the electorate.\" \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nA commentator wrote that compulsory arbitration of public-sector labor disputes \"preempt * * * public officials from deciding political issues\":\n\n\"Viewed mechanically, the arbitration process does not seem to allocate public resources: arbitrators fix equitable salaries for employees, and officials determine, given these cost figures, how much public service should be purchased. As a practical matter, however, employers rarely contemplate and unions would rarely permit curtailment of services and employment. Thus, the wage decision and the resource allocation decision are inevitably linked. Also, professional employees often bargain over programs. For example, teachers' unions may demand certain kinds of educational offerings or limits on class size. Even if arbitrators were capable of dealing with the complexities of budgeting and choosing programs, elected officials should not delegate the duty they owe the electorate to settle these questions. Deciding policy issues is the vocation of officials, not of arbitrators.\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nOthers have been impressed that \"lthough the effect may not necessarily be the raising of taxes by an unaccountable arbitrator, the decision may well affect the allocation of governmental expenditures within a political unit. Such a decision arguably should remain with those who are politically accountable for it\". \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nSome writers have suggested as an alternative the creation of a permanent governmental tribunal exercising the power entrusted under compulsory arbitration statutes to the \"outsider\".\n\nDaniel P. Sullivan, in his treatise Public Employee Labor Law, while writing that \"the delegation of governmental power to an outside body is in clear conflict with a democratic form of government\" (emphasis supplied), \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e suggests, as a \"safeguard for the electorate\", that issues that cannot be resolved by the parties \"be submitted to a tribunal for a binding decision. Under this plan, the people, through their representatives, would hire, pay and discharge the officers of this tribunal and also provide them with adequate safeguards to be used in making their decisions. The utilization of this system would render the tribunal responsive to the constituents through their elected representatives. Therefore, the electorate would retain its power to effectively determine the course of governmental actions, unlike the system in which an independent third party makes a decision which is enforceable by a court.\" (Emphasis supplied.) \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nV\n\nWhen the same term, here \"arbitration\", is used in different contexts, the analysis may become blurred. While both \"interest\" arbitration and \"grievance\" arbitration concern disputes, the nature of the dispute in one case is considerably different than the other.\n\nGrievance arbitration concerns disputes arising under written agreements negotiated and agreed upon by the parties. In grievance arbitration, the labor arbitrator acts in a judicial or quasi-judicial capacity. He determines the facts and seeks an interpretation of the agreement in accord with the understanding of the parties as gleaned from the writing and the relationship.\n\nIn interest arbitration, the functions and prerogatives of the arbitrator are significantly different. He is not bound by the agreement or understanding of the parties. He does not interpret a contract, he makes one. He then imposes his concept of what the \"agreement\" ought to be on the parties.\n\nGrievance arbitration is a familiar procedure for resolving disputes arising in the administration of a negotiated labor agreement.\n\nInterest arbitration is a new concept designed to avoid the disastrous economic and social consequences of labor strife arising from inability of the parties to reach an agreement. Strikes in public and private employment adversely affect not only the parties but also the public dependent on the continued supply of the affected goods and services.\n\nIt is the public interest which justifies governmental intervention and governmental imposition of a resolution upon the parties so that the flow of essential goods and services may continue and the economy and government can function in an orderly and productive manner.\n\nIn construing § 48 of article 4, authorizing the imposed resolution of disputes in public employment, we bear in mind its underlying rationale: the preservation and advancement of the public interest.\n\nVI\n\nSection 1 of article 1 of the Constitution states a fundamental principle:\n\n\"All political power is inherent in the people. Government is instituted for their equal benefit, security and protection.\"\n\nWe generally classify the powers of government as legislative, executive and judicial. Of the three kinds of public officers, only Judges are independent in the sense that they are not supposed to be accountable for their decisions through the political process. Persons who exercise legislative and executive power are, in contrast, expected to be politically accountable for their decisions.\n\nWhen a Judge considers a case, we expect independence and impartiality. We often speak of an independent judiciary, independent decision-makers in the adjudicatory function. When an arbitrator is called upon to resolve a grievance arising in the administration of a negotiated labor agreement, we also expect independence and impartiality.\n\nUnder the act, the arbitrator/chairman exercises delegated legislative power, political power, the kind of power the Legislature and the Governor possess. But, in contrast with the Legislature, the Governor, established agencies of government and other appointees who exercise a continuing responsibility for the administration of delegated legislative power, the arbitrator/chairman is not accountable through normal political processes for the critical decisions affecting the distribution and level of public services and the allocation of public revenues which he independently makes.\n\nWhat is sound in the exercise of judicial power and the quasi-judicial power of the grievance arbitrator, when applied to interest arbitration in the public sector, is not consonant with a core concept of a representative democracy: the political power which the people possess and confer on their elected representatives is to be exercised by persons responsible (not independent) and accountable to the people through the normal processes of the representative democracy.\n\nSome commentators consider the arbitrator/chairman's political unaccountability a virtue in that delegation to an outside person relieves both the union leaders and the public employer of the need to make an unpopular decision. \"Rather than accepting criticism for making critical concessions, the public employer and union leaders can explain to the public and union members respectively that the blame must be shouldered by the arbitrator. It was he, and not the parties, who formulated the final award.\" \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nOthers have recognized this aspect of the resolution of impasses by independent and politically unaccountable outsiders:\n\n\"By relying upon arbitration, a governmental official can avoid an unpleasant decision for which he would otherwise be politically accountable.\" \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\n\"he arbitration route is becoming more interesting to some public officials who see it cynically as a way out. The arbitration board can be blamed for the tax hike which follows the pay increase.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\n\"Public officials may prefer to use the arbitrator as a scapegoat rather than attempt to justify an agreement to a legislative body or the electorate.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nRobert G. Howlett, chairman of the MERC, the public official who, if the parties cannot agree, picks the arbitrator/chairman of the panel under the challenged act, has similarly observed:\n\n\"One advantage of legislated arbitration, as in grievance arbitration, is the post-award expendability of the arbitrator. An award, in an emotionally charged situation, may prevent criticism from constituents or remove the threat to the re-election of a mayor or union president.\" \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nDefenders of tripartite compulsory arbitration frequently cite the decision of the Rhode Island Supreme Court which concluded that the members of the panel are \"public officers\", a characterization at odds with the acknowledged political unaccountability of the independent arbitrator/chairman.\n\nWhile delegation of authority to resolve the dispute to an independent outsider may resolve the immediate crisis and relieves the public employer and union officials of the need to justify the result, this approach to legislative decision-making, precisely because it is designed to insulate and, in fact, does insulate the decision-making process and the results from accountability within the political process, is not consonant with proper governance and is not an appropriate method for resolving legislative-political issues in a representative democracy.\n\nVII\n\nGenerally, when legislation is challenged as an invalid delegation of legislative power, the controversy revolves around the adequacy of the standards \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e and whether there are other safeguards such as a hearing, opportunity to introduce evidence, a written statement of findings and Conclusions and judicial review. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe challenged act provides the traditional safeguards. A hearing is required; testimony and other evidence is received; a verbatim record is made; written findings of fact and a written opinion are issued; generalized standards to guide the exercise of this delegated power are stated; \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e and the decision is subject to judicial review. All that is generally required has been done.\n\nGenerally, however, discretionary power of this kind is vested in a governmental officer or agency with continuing responsibility for the day-to-day exercise of the delegated power in similar cases. The decision maker is not \"expendable\" but, rather, is responsible through the appointing authority to the electorate for the manner in which he exercises the delegated power.\n\nBecause decision making is concentrated in one person or agency exercising the delegated power on a continuing basis, the public can focus on the manner in which the power is exercised and can hold the appointing authority accountable.\n\nHere decision-making power has been dispersed through so many individual, independent arbitrators that it is not possible to hold any public official or authority responsible for the manner in which the delegated power has been exercised.\n\nA.\n\nIt is argued that while the act is susceptible of such an unconstitutional delegation, there is no unconstitutional delegation of power under the facts of this case because the arbitrator/chairman of each panel was appointed by the chairman of the MERC and if the city had named delegates to the panels, each panel would have consisted of a majority of publicly responsible arbitrators.\n\n(On the other hand, if the city had named a delegate and the delegates named by the union and the city had, as contemplated by the act, agreed on an arbitrator/chairman for each panel, the panels would not have consisted of a majority of publicly responsible arbitrators, and this legislation as applied would then, presumably, have been unconstitutional. In this analysis, the provision of Act 312 \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e authorizing the delegates selected by the parties to select the arbitrator/chairman is unconstitutional because if the delegates do in fact select the arbitrator/chairman there could not be a majority of publicly responsible arbitrators -- with the result that the act is constitutional to the extent it does not work as contemplated.)\n\nThe chairman of the MERC is indeed appointed by and accountable to the Governor. The chairman of the MERC, if the parties cannot agree on the arbitrator/chairman of the panel, is, however, required to choose as arbitrator/chairman an \"impartial\" person. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nPolitical intervention would be regarded as an unwarranted intrusion on the independence of the \"impartial\" decision maker. It would be regarded as improper for the chairman of the MERC or higher governmental authority to attempt to influence the arbitrator/chairman.\n\nAdditionally, as the present chairman of the MERC observed, the arbitrator/chairman appointed by him is \"expendable\". (See text accompanying fn 37.) The arbitrator/chairman's decision relieves city and union officials from responsibility for the result and, if the other publicly responsible arbitrator Dissents from the arbitrator/chairman's decision, also relieves him from responsibility for the result.\n\nThe chairman of the MERC and his superior, the Governor, properly do not regard themselves to be and are not generally regarded by the citizenry as responsible or accountable for the decisions of the ad hoc, outside arbitrator/chairman. The statutory duty of the chairman of the MERC is to appoint an \"impartial\" person as arbitrator/chairman. He is not expected to appoint an arbitrator/chairman who will render a decision which will have the support of the electorate or of their elected representatives.\n\nAfter the award is made, the arbitrator/chairman goes back to his other pursuits. He does not answer to the chairman of the MERC nor does his livelihood depend on retaining the chairman's favor. The ad hoc relationship between the arbitrator/chairman of an arbitration panel and the chairman of the MERC is too attenuated to provide political accountability. Interdependence and continuity -- not expendability -- are characteristic of accountability.\n\nB.\n\nIt has been contended that the arbitrator/chairman exercises quasi-judicial power.\n\nOne can accept the characterization that the arbitrator/chairman's decision is in the nature of an adjudication of the differences that exist between the parties without accepting the Conclusion that this delegation is constitutional.\n\nViewed as a method of determining the wages and working conditions of particular persons employed by a particular employer, the arbitrator/chairman's decision is indeed in the nature of an adjudication. As such, the process by which the decision is reached properly includes the procedural safeguards of a hearing, fact finding and judicial review.\n\nBut his decision does more than resolve the differences between the parties. It affects the allocation of public resources, the level of public services provided the community as a whole and the cost of government. It also establishes precedents affecting the terms and conditions of public employment generally in both the directly-affected and other units of government.\n\nThe arbitrator/chairman cannot formally mandate, but his decision may necessitate, an increase in taxes. In this instance, Dearborn being a \"city * * * the tax limitations of which are provided by charter or by general law\", \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e there is no constitutional impediment to levy by the city of additional taxes. But other taxing units to which this method of resolving collective bargaining impasses might be extended, e.g., school districts, are subject to the 15-mill limitation and the levy of additional millage ordinarily requires a vote of the people. Cf. Advisory Opinion re Constitutionality of 1973 PA 1 and 2, 390 Mich 166, 180 et seq.; 211 NW2d 28 (1973). \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nIt may not be prudent or possible to cut expenditures or reduce personnel. There is a level below which police and fire services cannot safely be reduced. Additionally, if in response to a wage increase awarded by the arbitrator/chairman, the city were to lay off, as an economy measure, policemen or firemen, a reduction in manpower so timed would no doubt be viewed by the unions as retaliatory, as a bad faith attempt to circumvent the arbitrator/chairman's decision, and could precipitate the strike which compulsory arbitration is said to \"foreclose\".\n\nViewed from the governmental perspective, from the perspective of the citizens/taxpayers, the decision is legislative-political.\n\nBecause the decision is also in the nature of an adjudication in the sense that it affects particular persons (the members of the union and the city as a juridical entity) differently than the citizenry at large, it is appropriate to structure the arbitrators' exercise of decision-making power with the safeguards traditionally surrounding the proper exercise by a governmental agency of quasi-judicial power -- a hearing, introduction of evidence, standards to guide decision, formal findings, opinion and judicial review.\n\nHowever, because of the strong public policy component in Act 312 arbitration decisions, such decisions cannot be shielded from review in the political forum.\n\nC.\n\nThe PERA, like the NLRA, provides that it is the mutual obligation of the employer and the representative of the employees to bargain collectively regarding \"wages, hours, and other terms and conditions of employment\". \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nMichigan has adopted a broad view of \"conditions of employment\", making most issues mandatory subjects of collective bargaining and, presumably, subject to arbitration under Act 312. See Detroit Police Officers Association v Detroit, supra, holding that residency and the employees' retirement plan are mandatory subjects of collective bargaining. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nAct 312 provides a means of resolving impasses in policemen and firemen collective bargaining. Act 312 arbitration panels decide the legislative-political questions involved in determining the wages, hours and the other terms and conditions of employment of policemen and firemen.\n\nThe only issue remaining unresolved in the pending Detroit police officers arbitration proceeding is the manifestly legislative \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e -political question whether Detroit residency should continue to be a condition of police employment. An arbitration panel recently concluded that supervisory police officers in the City of Inkster need no longer reside within the environs of that city. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThe Court of Appeals, relying \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e on Federal cases, which have held that work loads, work rules, management-right clauses and safety are among the conditions of employment, \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e ruled that an Act 312 arbitration panel has \"jurisdiction\" to make a \"manpower award\", to decide the number of firemen to be on duty at a particular time, on the rationale that such a decision affects \"the firemen's safety\". \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nA broad range of questions may affect the safety of firemen and policemen -- and concomitantly the safety of the entire community -- e.g., whether policemen shall patrol or ride in squad cars, alone, in pairs or in greater numbers, how many fire fighters shall be assigned to each pumper and what kind of firearms and fire fighting equipment shall be used. Act 312 panels have made precisely those kinds of decisions.\n\nThe arbitrator/chairman might, in making a decision regarding crew size, require an increase in the total work force and is in a position to preclude a reduction in force (assuming for the moment that such a reduction would otherwise be feasible) which would alleviate to some extent the costs of any wage increase or other benefits he has ordered.\n\nD.\n\nThere are innumerable \"disputes\" difficult of resolution which may become hot political issues -- e.g., zoning, the location of public buildings, school hours and school programs. These can all be viewed as \"disputes\" or \"differences\" between the property owners, parents or school teachers immediately affected and the government. It would be an enormous departure from present concepts of responsible exercise of governmental power if the practice were to develop of resolving difficult political issues in an arbitrator's conference room as an alternative to facing up to vexing problems in the halls of state and local legislatures.\n\nReposing power to resolve political issues in a person called an arbitrator and characterizing the issue a \"dispute\" or \"difference\" and his decision an \"adjudication\" does not obviate the need for political accountability of the manner in which political issues are resolved.\n\nE.\n\nThe unions rely on the provision for judicial review of the arbitrator's result.\n\nAlthough there have been more than a hundred awards, many of them controversial, there is no reported opinion of the Court of Appeals and we are aware of no circuit court opinion where \"court review\" resulted in modification of an arbitration award because it was not supported \"by competent, material and substantial evidence\". \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nJudicial review of the manner in which delegated legislative power is exercised is a safeguard against arbitrary exercise of discretionary power. Within the range of reasonableness, the choice of the Legislature or its delegate is not subject to judicial alteration.\n\nMost disputes in public employment will present a wide range of reasonable alternatives each of which is supported by \"competent, material and substantial evidence on the whole record\". \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Providing for judicial modification of those few decisions not so supported is not a substitute for political accountability and review of the choice between reasonable alternatives. Judicial review cannot fulfill the constitutional need for review and accountability through the political process.\n\nF.\n\nThe Legislature's ultimate political responsibility for the establishment and success of Act 312 cannot sustain this legislation. Such \"accountability\" is present in every legislative enactment. Similar logic would sustain legislation delegating any or all legislative power to any group or person.\n\nG.\n\nWe are the product of our experiences. Drawn at one time or another from private life to the public sector, many governmental officials return to private endeavors when their public service is concluded. While in office, however, it is expected that governmental officials will develop a quickening sense of their public responsibility transcending insular concerns and that they will eschew outside endeavors which may be or appear to be incompatible with their public responsibility.\n\nArbitrator/chairmen, only temporarily in office, all have \"nonpublic\" occupations. A number of them accept employment from labor unions and employers as labor grievance arbitrators interspersed between their temporary service on police and fire department panels. That is not wholly compatible with development of the kind of solitary concern for the public interest which the citizenry properly expects of its public officials.\n\nH.\n\nIt is the unique method of appointment, requiring independent decision makers without accountability to a governmental appointing authority, and the unique dispersal of decision-making power among numerous ad hoc decision makers, only temporarily in office, precluding assessment of responsibility for the consequences of their decisions on the level of public services, the allocation of public resources and the cost of government, \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e which renders invalid this particular delegation of legislative power.\n\nIn an apparent effort to meet the objection that compulsory arbitration hinders normal collective bargaining, and to narrow the differences between the parties on economic issues, the Legislature amended the act to provide for last-offer arbitration of economic issues. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Last-offer arbitration does not, however, address the constitutional deficiency we find in this act: the power of the decision maker, who does not have continuing responsibility, to make critical choices on economic and non-economic issues without political accountability.\n\nThe primary obligation of government is to govern. We seek to safeguard the final authority of government. Decision making by an independent outsider in operative effect excludes government as the final authority. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nVIII\n\nDecisions holding legislative acts unconstitutional have, on occasion, been given limited retroactivity in recognition of the necessities of governmental administration. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nLemon I (Lemon v Kurtzman, 403 U.S. 602; 91 S Ct 2105; 29 L Ed 2d 745 [1971]) held Pennsylvania's statutory program to reimburse nonpublic sectarian schools for certain secular educational programs violative of the Establishment Clause of the First Amendment. Lemon II (Lemon v Kurtzman, 411 U.S. 192; 93 S Ct 1463; 36 L Ed 2d 151 [1973]) questioned whether the payment of some 24 million dollars, already allocated to nonpublic sectarian schools for services rendered before the statute's invalidation, should be enjoined. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nThe majority in Lemon II, particularly concerned with the obligations incurred by the schools in reliance on the compensatory statute, affirmed the district court's allowance of the payments.\n\nIn addition to the almost insurmountable administrative, political, and judicial problems that would be created by any attempt to unravel and renegotiate the \"contracts\" imposed by police and fire department arbitration panels, application of this decision retroactively would cause hardship on employees and employers and would not be constructive. Michigan labor organizations, their members and municipalities have justifiably relied on a presumptively valid statute. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nIX\n\nTo avoid possible misunderstanding, we add that our holding does not preclude the Legislature from vesting the authority to resolve disputes concerning public employees in a governmental officer or agency with continuing responsibility for the day-to-day exercise of that delegated power. Such a decision-maker (arbitrator) would not be \"expendable\" but, rather, would be responsible through the appointing authority to the electorate for the manner in which the delegated power is exercised. See fn 32 and accompanying text.\n\n1969 PA 312 is unconstitutional. This ruling is given prospective effect only. Accordingly, we affirm the decisions of the Court of Appeals and the circuit court granting enforcement of the arbitration orders. No costs are awarded, a public question being presented.\n\nIn each of the consolidated cases this Court is called upon to examine issues concerning the constitutional validity of 1969 PA 312 (MCLA 423.231 et seq.; MSA 17.455 [31] et seq.),1a providing for compulsory arbitration of labor disputes in municipal police and fire departments. In each instance, I find the act constitutional.\n\nThe act provides for a three-member arbitration panel consisting of a delegate appointed by each party to the dispute. These delegates then may jointly appoint an \"arbitrator\" or \"chairman\". If they fail to do so, the panel chairman should be appointed by the head of the Michigan Employment Relations Commission (MERC).\n\n\"The expense of the proceedings, including a fee to the chairman, established in advance by the labor mediation board shall be borne equally by each of the parties to the dispute and the state. The delegates, if public officers or employees, shall continue on the payroll of the public employer at their usual rate of pay.\" MCLA 423.236; MSA 17.455(36).\n\nThe term of office, hearing procedures and standards for decision and review are statutorily provided.\n\nThe facts are easily stated:\n\nDearborn Fire Fighters\n\nDearborn Fire Fighters Union Local No. 412, IAFF, is the collective bargaining agent for Dearborn Fire Fighters. Collective bargaining negotiations between the union and the city began in early 1970. After the parties were unable to reach agreement on a contract and after intermediary procedures failed, the fire fighters initiated arbitration proceedings. The city, believing Act 312 to be unconstitutional, refused to appoint its delegate to the arbitration panel. This refusal required the chairman of the Michigan Employment Relations Commission, an appointee of the Governor, to designate a neutral arbitrator to serve on the panel along with the union's delegate. The arbitration hearing was conducted without a city delegate and an award was issued on November 11, 1970. The city refused to comply with the award and the union responded by seeking enforcement of the award in circuit court.\n\nPolice Officers Association of Dearborn\n\nSimilarly, when the 1970 collective bargaining negotiations between the police officers association and the city failed to produce an agreement, the police officers initiated Act 312 arbitration proceedings. The city again refused to name its delegate and MERC was again required to appoint the arbitrator. After the city declined to recognize the resulting March 22, 1971 arbitration award, the police officers asked the circuit court to enforce their award.\n\nThe Wayne Circuit Court rejected the city's arguments of unconstitutionality in the two separate enforcement proceedings and ordered it to comply with the arbitration awards. The Court of Appeals affirmed in a consolidated appeal. Dearborn Fire Fighters Union Local No 412, IAFF, v Dearborn, 42 Mich App 51; 201 NW2d 650 (1972). We granted leave to appeal, 388 Mich 785 (1972), and now examine the constitutional issues presented.2a\n\nAny challenge to the constitutionality of a legislative enactment must be subjected to certain well-established principles. For instance, it is well-settled that the Legislature intends to enact constitutional statutes and, therefore, the legislation comes before us clothed with a presumption of constitutional validity. A challenger cannot merely claim unconstitutionality, but carries the burden of firmly proving the claim. See W A Foote Memorial Hospital, Inc v City of Jackson Hospital Authority, 390 Mich 193; 211 NW2d 649 (1973). This burden entails more than preferable alternatives. The statute must be viewed in the context most favorable to a finding of constitutionality.\n\nThe Dearborn cases carry an extraordinarily heavy burden because Act 312 was enacted under the specific grant of authority in Const 1963, art 4, § 48:\n\n\"The legislature may enact laws providing for the resolution of disputes concerning public employees, except those in the state classified civil service.\"\n\nThe convention comment approved by the delegates states the article's purpose to be \"* * * to make it clear that the legislature has power to establish procedures for settling disputes in public employment\".\n\nIt is from this power vested in the Legislature by Const 1963, art 4, § 48, that the Public Employment Relations Act (PERA), MCLA 423.201 et seq.; MSA 17.455 (1) et seq., and its extension, Act 312, were enacted. In PERA the Legislature chose to follow the collective bargaining scheme established in the National Labor Relations Act. Under PERA employers and employees are required to enter into good faith collective bargaining over \"wages, hours and other terms and conditions of employment\". These are referred to as \"mandatory\" subjects of bargaining. As a necessary corollary of the duty to bargain over mandatory subjects of bargaining, PERA effected a pro tanto reduction of the home-rule cities' former unilateral control over these matters. Home-rule cities can no longer, for example, set the wages of public employees or the conditions of employment such as residency without first meeting the public employees' demands for collective negotiations. See, generally, Detroit Police Officers Ass'n v Detroit, 385 Mich 519; 190 NW2d 97 (1971).\n\nPERA on the other hand did not diminish home-rule political control over the municipal work force. The basic managerial and political decisions such as the appointment of a department head, the size of the department and recruitment requirements fall outside of the collective bargaining scheme and remain within the discretion of the local government.\n\nPERA procedurally requires the parties to meet at the bargaining table and confer in good faith with an open mind and a sincere desire to reach an agreement. It does not mandate agreement.3a If the parties fail to agree on one or more mandatory subjects, an \"impasse\" situation is reached and the employer may take unilateral action on an issue consistent with its final offer to the employees' representative. The duty to bargain is then suspended until there is a change in the surrounding conditions or circumstances.\n\nIn the private sector \"impasse\" often results in a strike. The employees refuse to accept the unilateral conditions imposed by the employer and withhold their services as a bargaining weapon. In the public sector strikes are prohibited but nevertheless occur. If the public employees do strike, the public employer may resort to the courts in order to return the labor situation to the status quo. By the time that court relief is obtained, however, the public may well have been left for a long period without the services and protection of the striking employees.\n\nWhen policemen engage in a strike, the community becomes immediately endangered by the withdrawal of their services. Likewise, our case law has often focused on the fact that fire fighters have a distinct and crucial employment relationship with a public employer.4a\n\nThe Legislature, with knowledge of the vital character of police and fire services and with reference to the specific recommendations of the Governor's Advisory Committee on Public Employee Relations (February, 1967)5a moved to foreclose strikes to police officers and fire fighters by enacting 1969 PA 312. In § 1, the Legislature made an explicit statement of its purpose:\n\n\"It is the public policy of this state that in public police and fire departments, where the right of employees to strike is by law prohibited, it is requisite to the high morale of such employees and the efficient operation of such departments to afford an alternate, expeditious, effective and binding procedure for the resolution of disputes, and to that end the provisions of this act, providing for compulsory arbitration, shall be liberally construed.\"\n\nUnder Act 312, if the public employer and the police officers' or fire fighters' bargaining unit have not reached an agreement concerning a mandatory subject of bargaining, and mediation proves unsuccessful, either party may initiate binding arbitration in order to avert a strike.\n\nThe arbitration process commences with § 4 of Act 312 which prescribes the method for selecting the employer and employee delegates to the panel of arbitration. Once selected, the employer and employee delegates \"designate an impartial, competent and reputable person to act as an arbitrator, hereafter called the arbitrator or chairman of the panel of arbitration * * *. Upon their failure to agree upon and appoint the arbitrator * * * either of them may request the chairman of the state labor mediation board to appoint the arbitrator * * *.\" MCLA 423.235; MSA 17.455(35).\n\nAfter the arbitrator is designated, the person so chosen becomes the functional decision-maker and presides over the arbitration hearing in accordance with §§ 6 and 7 of the act.\n\nThe final decision of the arbitrator is made pursuant to the adequate guidelines of § 9. The arbitrator resolves the dispute by selecting a bargaining position proposed by a party or by fashioning a compromise position. The arbitrator, acting as an adjunct to the PERA bargaining process, is not at liberty to impose his own solutions or to go beyond the boundaries established by the parties' bargaining positions. The arbitrator's singular duty is to fashion a workable resolution for the dispute in keeping with the limits set by the parties and the dynamics of the particular bargaining situation.6a Even this limited decision may be appealed to the courts.\n\nThree constitutional issues are raised.\n\nI\n\nDoes 1969 PA 312 usurp constitutionally vested home-rule powers?\n\nIn its first issue on appeal, the city contends that Act 312 constitutes an attempt by the Legislature to control facets of municipal affairs reserved to home-rule cities by Const 1963, art 7, §§ 22 and 34. These sections provide:\n\n\"Under general laws the electors of each city and village shall have the power and authority to frame, adopt and amend its charter, and to amend an existing charter of the city or village heretofore granted or enacted by the legislature for the government of the city or village. Each such city and village shall have power to adopt resolutions and ordinances relating to its municipal concerns, property and government, subject to the constitution and law. No enumeration of powers granted to cities and villages in this constitution shall limit or restrict the general grant of authority conferred by this section.\" Const 1963, art 7, § 22.\n\n\"The provisions of this constitution and law concerning counties, townships, cities and villages shall be liberally construed in their favor. Powers granted to counties and townships by this constitution and by law shall include those fairly implied and not prohibited by this constitution.\" Const 1963, art 7, § 34.\n\nThe city argues that in keeping with Michigan's tradition of strong home rule these sections \"vest in cities supreme power to govern their own local affairs\". It overlooks, however, the limitation of \"subject to the constitution and law\".\n\nThe city then continues:\n\n\"t is undisputed that the state has the power to regulate the rights of public employers and public employees in the collective bargaining process. Act 312, however, goes beyond the mere regulation of labor relations. It compels the cities to accept as binding arbitration decisions 'as to any matter in dispute'. These decisions may directly 'affect cities' fiscal and budgetary policies and allocations of city funds' and control their handling of the heretofore considered local matters pertaining to police and fire departments.\"\n\nThus, the city concludes that Act 312 \"controls\" purely local affairs and thereby violates the state Constitution.\n\nThe city's argument misperceives the constitutional relationship that exists between the Legislature and home-rule cities in the control of public-sector labor matters. It has long been established in our case law, and now by Const 1963, art 4, § 48,7a that the Legislature has the authority to regulate labor relations as a reasonable extension of its explicit power to provide for the resolution of disputes concerning public employees.8a The scope of the legislative jurisdiction over labor relations, if properly exercised, extends to subjects otherwise within the control of the home-rule cities and may indirectly affect the city's budgetary process.9a\n\nBecause this issue has been thoroughly discussed in other opinions of the Court, I will not belabor the point.\n\nAct 312 does not usurp constitutionally vested home-rule powers.\n\nII\n\nDoes 1969 PA 312 unlawfully delegate legislative power?\n\nThe city concedes that if its home-rule argument in issue I is not meritorious, it cannot contest the Legislature's power to impose some form of binding arbitration on the cities. The next question then becomes: Has the Legislature properly exercised its power?\n\nIn answering this question the city argues that the Legislature has adopted a constitutionally improper scheme of arbitration in Act 312. By providing for \"ad hoc\" arbitration panels, the city contends the Legislature has delegated its legislative power to the private sector in violation of Const 1963, art 3, § 210a and art 4, § 1.11a\n\nSection 4 of the act prescribes the method for selecting the city (employer) and firemen and policemen (employee) delegates to the panel. These delegates then \"designate an impartial, competent and reputable person to act as an arbitrator, hereafter called the arbitrator or chairman of the panel of arbitration * * *. Upon their failure to agree upon and appoint the arbitrator * * * either of them may request the chairman of the state labor mediation board to appoint the arbitrator.\"\n\nI am not convinced that Act 312 violates our state constitution. To the contrary, I am convinced that it is a balanced, reasonable and fair implementation of a constitutional directive.\n\nThe selection of the panel is through public officers.\n\nThe cost of the arbitration is evenly apportioned among the employer, employees and the state. MERC sets the arbitrator's salary. That person's tenure is set by the Legislature.\n\nThe duties of the arbitrator (chairman) are detailed in § 6 of the act. Within 15 days after appointment, he or she must call a hearing of the panel and give reasonable notice of the time and place. The arbitrator presides and may allow persons or groups having a \"substantial interest\" to intervene. Among other duties statutorily imposed upon the panel are:\n\n1. Administer oaths\n\n2. Provide for a verbatim record and transcript\n\n3. Issue subpoenas\n\n4. Initiate contempt proceedings\n\n5. Write an opinion (from which appeal can be taken to the circuit court).\n\nThese responsibilities require the acts of a public officer, so it must be concluded that the Legislature intended to vest in the panel that sovereignty necessary to accomplish its mandates.\n\nThe most ardent objection is made to the panel's tenure of office. Somehow a relatively short tenure is said to equal political irresponsibility. Although the Legislature could have established another bureaucracy, it chose short-term panels to meet impasses immediately -- no matter how many or where they might occur simultaneously. The duties do not require office work outside of the immediate arbitration activity, so a permanent staff could prove costly and unnecessary or inadequate. (There could be many or no impasses within a given span of time.) The Legislature also could have believed bias and corruption less likely to settle into these panels.\n\nFurther, it must be remembered that Act 312 is supplemental to PERA.\n\nToday's case is not the first time that this Court has confronted the question of whether binding public arbitration implemented by private sector arbitrators was an unlawful delegation of legislative power. In Pleasant Ridge v Governor, 382 Mich 225; 169 NW2d 625 (1969), the Court upheld the arbitration procedure there in issue, 1967 (Ex Sess) PA 12. The arbitrators were called upon to decide the route of a major highway and they ultimately decided that it should be built through geographically small communities. This decision had an immense impact on these communities, the effects of which could not be corrected or modified at the next contract bargaining session. The Court upheld the use of arbitration despite the lack of an explicit provision for judicial review.\n\nOther courts have directly addressed the issue of a state's delegation of its legislative power in the context of public-sector arbitration12a and have upheld the arbitration statutes. The Supreme Court of Rhode Island in Warwick v Warwick Regular Firemen's Ass'n 106 RI 109, 116-117; 256 A2d 206 (1969), simply found that the arbitrators by virtue of their responsibility to arbitrate the public questions received \"a portion of the sovereign and legislative power of the government\", and thus became public officers for the duration of the arbitration. A different approach was taken by the Supreme Court of Wyoming in State ex rel Fire Fighters Local No 946 v Laramie, 437 P2d 295 (Wyo, 1968). As succinctly described by one commentator:\n\n\"'The court in a sweeping decision found the compulsory arbitration statute constitutional and stated that the statute conferred on arbitrators the power to execute the law and not the power to make the law. The court reasoned that the state had the authority to fix the minimum salaries to be paid firemen and thus had equal authority to establish a \"formula through the medium of arbitration for fixing a specific amount above the minimum * * *.\"'\n\n\"The court cited with approval an earlier decision of the Pennsylvania Supreme Court which stated the distinction between delegable and non-delegable functions, 'If the delegation of power is to make the law, which involves the discretion of what the law shall be, then the power is nondelegable. If the conferred authority is the power of discretion to execute the law already determined and circumscribed, then the delegation is unobjectionable'. * * *\" Anderson A., Compulsory Arbitration Under State Statutes in 4 Labor Relations and Social Problems, 221 (Wallett \u0026 Sears ed 1971).\n\nAlthough almost any imaginable set of facts can bring forth a constitutional challenge in this expansive era, some restraint and some deference to the accumulated wisdom of the past is advisable.\n\nAct 312 passes the tests of constitutionality and specifically does not provide for the delegation of legislative power to private persons. It is reasonable and practical. Our legislators balanced the competing interests with admirable skill in responding to Const 1963, art 4, § 48.\n\nThe matter therefore resolves into a question of policy.\n\nThe Court agrees that some kind of binding arbitration is in the public interest. Through constitutional authority, the Legislature has set the state policy as to the method of arbitration and to that end the balance of considerations is revealing.\n\nThe arguments for a permanent arbitration board include:\n\n(a) The panel members may or may not have to remain to \"take the heat\" after a decision, dependent upon the persons selected,\n\n(b) They cannot be ejected from office after their terms are ended,\n\n(c) The governmental unit may be required to spend more money for wages than it deems desirable.\n\nOpposing considerations are:\n\n(a) Because of the shorter terms, the panel members are less likely to be subjected to intensive pressure or threats of reprisal from vested interests nor to conditions leading to bias or corruption. Further, the act provides for immediate action and an economical use of manpower and money.\n\n(b) Panel members can be expected to remain as objective as possible, particularly the neutral arbitrator. The MERC chairman has particular expertise in labor mediation and has available to him skilled arbitrators whose successive appointments depend upon their integrity and capabilities.\n\n(c) The alternative could be long and even more costly strikes. Prior negotiations already have narrowed the issues so that the panel is bound to act within the limits of last offers. The guidelines seek to protect against requiring more than the city can reasonably afford. The courts are available in the event of abuse.\n\nThe Legislature has fashioned a procedure which not only is relatively inexpensive and efficient, but also provides for immediate action when time is of the essence. The panel is a public body performing a public function. It is statutorily subject to mandates and prohibitions.\n\nUnder PERA the Legislature has vested in both the public employer and public employees the power to shape the boundaries of the employment contract. An Act 312 arbitration does not expand the already relinquished power, but is placed within boundaries which, in effect, are those which the parties have established through bargaining, the only task being to solve the \"impasse\". As a final safeguard, the findings are subject to the accountability of judicial review.13a\n\nOf peripheral importance is the fact that the scheme so far has worked. I know of no prohibited strike since this enactment.\n\nThere is no unconstitutional delegation of legislative power in Act 312.\n\nIII\n\nDoes Act 312 violate Const 1963, art 9, § 2 by surrendering the power to impose taxes to the arbitrator?\n\nThe city contends:\n\n\"Article IX, Section 2 of the 1963 Michigan Constitution provides as follows:\n\n\"'The power of taxation shall never be surrendered, suspended or contracted away.'\n\n\"In addition to delegating to ad hoc panels of arbitration the power to fix the terms and conditions of employment, Act 312 also vests in the panels the power to impose taxes. Increases in compensation and fringe benefits for municipal employees must inevitably be paid for by increases in taxes. Accordingly, the power to grant such pay increases includes the power to increase taxes. The legislative attempt to confer this power on ad hoc panel arbitrators constitutes a surrender of the power to tax.\"\n\nWe respond to the city's contention by quoting with approval a portion of the opinion delivered by judge Charles Kaufman during the circuit court proceedings in the police officers' case.\n\n\"The final thrust of Defendant's Motion is directed to the contention that Act 312 violates Article IX, Section 2 of the 1962 Michigan Constitution in that it surrenders the power to tax to private individuals. This particular section provides: 'The power of taxation shall never be surrendered, suspended or contracted away.' Defendant's claim that an award requiring funds constitutes at least an indirect power to tax. Since Act 312 does not directly give the panel the power to tax, the issue is whether by granting a body authority to raise wages does not constitute an indirect power to tax because the monies must ultimately come from taxation of the local citizens. It should be indicated here that Section 9(c) of Act 312 provides that criteria to be taken into account are the interests and welfare of the public and the financial ability of the defendant to meet those costs. By way of reductio ad absurdum it could be pointed out that a raise in price of commodities furnished a city by a private purveyor also indirectly is the imposition of a tax. No one can argue that even a city must pay the prevailing price whether it be to purchase a commodity or a service. The panel is the body to determine the fair cost of a policeman's services taking into account the standards and criteria set forth in the statute.\" Police Officers Association of Dearborn v Dearborn, Wayne Circuit Court No 180-061 (May 26, 1971).\n\nWe agree with Judge Kaufman that the arbitrator's powers do not conflict with Const 1963, art 9, § 2. If the award goes beyond the anticipated budget, the usual response is to set priorities, cut expenses or perhaps reduce the number of personnel involved. If the city believes the award to constitute an abuse of discretion because of the financial state of the governmental unit, appeal to the circuit court is available on that cause. However, taxes are raised only through the actions of the appropriate governing body after it assesses the needs, expenditures and income of all of its various units. The power remains in the City of Dearborn.\n\nIV\n\nI would find Act 312 constitutional, affirm the Court of Appeals and assess no costs, this involving a public question.\n\nWilliams, J. (upholding constitutionality on case facts).\n\nThe constitutionality of compulsory fire and police department employment arbitration is the subject of this opinion. The constitutional challenges considered are based on illegal delegation of legislative power and exercise of political power without proper political responsibility. It is held that compulsory fire and police department employment arbitration under 1969 PA 3121b is constitutional under the facts of this case where one arbitrator was appointed by the chairman of the Michigan Employment Relations Commission (MERC) and one by the representative of the union, but that proceedings under 1969 PA 312 with a chairman jointly chosen by the representatives of the parties would be unconstitutional. This opinion formulates criteria to determine whether the Legislature has made a delegation of power with sufficient standards and adequate political accountability or has unlawfully abdicated its power and failed to establish proper responsibility to the public.\n\nI -- Facts\n\nThe City of Dearborn refused to appoint arbitrators when the police and fire unions initiated arbitration under 1969 PA 312. As a consequence the chairman of MERC appointed an arbitrator/chairman pursuant to the statute. He and the union delegate held hearings and rendered a decision, with which the city refused to comply. The circuit court ordered enforcement and the Court of Appeals affirmed. 42 Mich App 51; 201 NW2d 650 (1972).\n\nII -- The Challenge\n\nThe City of Dearborn challenges the constitutionality of 1969 PA 312 on several bases, most of which are adequately answered in other opinions. Here we consider only whether the statute is an unconstitutional delegation of legislative power.\n\nAlthough not explicitly delineated in either the Federal or Michigan Constitutions, the prohibition of the delegation of governmental powers has served to shorten the lines between the people and law-administration, thereby keeping responsibility direct and facilitating identification of those actually making decisions. 1 Sutherland, Statutes \u0026 Statutory Construction (4th ed; Sands), § 4.02, p 73. A statute may fall within the scope of this prohibition if it improperly delegates legislative power to private parties, Shumway v Bennett, 29 Mich 451 (1874), or if the power is delegated to an appropriate body, but there are inadequate standards to regulate that body's conduct. State Highway Commission v Vanderkloot, 392 Mich 159; 220 NW2d 416 (1974). Both challenges have been made to the statute we review today.\n\nIII -- Role of Compulsory Arbitration\n\nCompulsory arbitration is a practical response to the impasse experienced from time to time in collective bargaining where the public welfare cannot endure the impact of a work stoppage while awaiting the resolution of problems through normal negotiations. Thus, where public employees are prohibited from striking, some states have chosen to experiment with legislated compulsory arbitration in order to develop some mechanism to settle disputes and keep labor peace in these sectors. The areas of fire and police protection are prime examples. Compulsory arbitration has won popular support because it has effectively resolved conflicts and minimized the interruption of services. It has the prestige of success.2b\n\nDeeper analysis has, however, questioned whether this efficiency, like the on-time performance of Mussolini's railroads, has been achieved at the cost of sacrificing democratic government, that is, removed the problem-solving, decision-making process too far from public scrutiny and control.\n\nAnalysis must begin with the fact that it is impossible to separate public-sector bargaining from other aspects of the political process.\n\nLabor relations experts present a persuasive thesis that collective bargaining for public employees has added a new dimension to the political process3b by requiring the introduction of special procedures for making decisions. Thus, unions achieve an input into the budget-making process which other groups do not have, accompanied by a requirement that a public official participate in a face-to-face bargaining exchange. Once the agreement is concluded, if it is valid according to existing law, it is, under the constitution and existing legislation, binding for the duration of the agreement, and, unlike ordinances or administrative pronouncements, may not be changed by the makers of the pronouncements or by vote of the people.\n\nIV -- Michigan Compulsory Arbitration Statute\n\nThe people of this state have spoken in support of resolutions of labor disputes involving public employees directly in the Michigan Constitution, and indirectly through their state representatives in the passage of the arbitration statute pursuant to the Constitution.\n\nThe Constitution provides:\n\n\"The legislature may enact laws providing for the resolution of disputes concerning public employees, except those in the state classified civil service.\" Const 1963, art 4, § 48.\n\nBased on this authority and the public policy contained therein,4b the Legislature developed 1969 PA 312, a statute to provide for compulsory arbitration of labor disputes in municipal police and fire departments. It was clear that the act was regarded as an experiment, for it was initially scheduled to expire June 30, 1972. This was extended to June 30, 1975, and then, in view of the record of success of procedures under the act, the expiration date was repealed altogether. 1975 PA 3.\n\nSeveral elements of the statutory scheme are significant to our current analysis.\n\nThere are two possible ways by which a panel may be selected. Ordinarily, each party chooses a delegate and then the two delegates select a mutually agreeable person to act as arbitrator/chairman of the panel. If they fail to agree, the chairman of MERC then appoints the third member.5b\n\nTenure of the panel is only for the period of the dispute and is carefully limited by legislative determinations of the duration of each stage of the proceeding. Thus, for example, hearings must begin within 15 days of impanelling the arbitration board, and the hearing itself, unless otherwise agreed by the parties, must be concluded within 30 days. MCLA 423.236; MSA 17.455(36). Unless the parties agree otherwise or the dispute has been remanded to the parties for further bargaining for a period not exceeding 3 weeks, MCLA 423.237a; MSA 17.455(37a), the decision must be rendered within 30 days after Conclusion of the hearing. MCLA 423.238; MSA 17.455(38).\n\nThe statute includes specific standards to which the arbitration panel must refer in rendering its decision.6b Factors relate to providing employees' wages, hours and other conditions of employment as good as but not out of line with persons in public and private employment in comparable communities. Panelists must consider the public welfare, not only because of the express mandate to do so, but in the requirement to review the financial ability of the governmental unit to meet proposed costs.\n\nA subsequent amendment provides a further constraint on the authority of the panel in the requirement to consider only the last offer of settlement made by each party for each economic issue.7b This also encourages good-faith bargaining by the parties, as it prevents submission of an offer so outlandish as to effectively require acceptance of the other's position. Not only is the panel restricted to accepting or rejecting the last proposal, it must base its determinations on these standards, (supra) , fn 6.\n\nFurther delimitation of the arbitration panel's authority is found in its restriction to disputes involving wage rates and other conditions of employment under a proposed new or amended labor agreement, (supra) , fn 6, and in provisions for judicial review.8b Although not specifically described in the statute, failure to follow legislatively-mandated criteria is always available as grounds for judicial review. 51A CJS, Labor Relations, § 481, p 490.\n\nV -- Case Law in Other States\n\nSimilar legislation providing for compulsory arbitration of labor disputes involving public employees has been enacted in other states.9b Currently, every statute which has been challenged has survived constitutional scrutiny, although the courts which have spoken have had different reasons. Two jurisdictions, Pennsylvania and Nebraska, have resolved the issue on specifically local grounds. Of the three which have faced the constitutional issue head-on, Wyoming said the power delegated was not governmental, Rhode Island said the party-designated arbitrators were public officials, and Maine sustained the delegation to arbitrators as a reasonable legislative decision, but could not agree on the kinds of standards which should be required.10b\n\nThe Pennsylvania and Nebraska decisions are of only limited precedential value because of peculiar local situations. Thus, for example, the Supreme Court of Pennsylvania relied on a state constitutional provision specifically providing for such panels to uphold the statute.11b Harney v Russo, 435 Pa 183; 255 A2d 560 (1969). In School Dist of Seward Education Assn v School Dist of Seward, 188 Neb 772; 199 NW2d 752 (1972), the Supreme Court of Nebraska reasoned that since the Court of Industrial Relations had been established by the Nebraska Constitution, it was not an unconstitutional delegation of legislative power. Further, since its activities related to matters particularly affected with a public interest and provision was made for appeal from its decisions to the courts, it was not an unconstitutional delegation of legislative power. 188 Neb 772, 780-781; 199 NW2d 752, 757-758.\n\nOn the other hand, the Wyoming, Rhode Island and Maine Courts faced the delegation issue headon. In State v City of Laramie, 437 P2d 295 (Wyo, 1968), the Wyoming Court found that the compulsory arbitration scheme did not involve a prohibited delegation of a municipal function to a commissioner since arbitration concerning public employees was no different from that in business and industrial affairs and therefore could not be considered a municipal function. There was no unconstitutional delegation of legislative power because arbitration panels did not make law, they only executed it. 437 P2d 295, 300-301.\n\nThis contrasts with the interpretation of the Supreme Court of Rhode Island which found no unconstitutional delegation to private persons since it held that the members of the tripartite party-designated arbitration panel were public officials and that they were performing a public function.12b Warwick v Warwick Regular Firemen's Assn, 106 RI 109; 256 A2d 206 (RI, 1969). The Court also considered the other part of the delegation problem and found the standards which are similar to those in the Michigan legislation to be constitutionally adequate.13b\n\nThe Supreme Judicial Court of Maine examined both aspects of the problem in greater detail in analyzing the statute as it applied to teachers in public schools. Biddeford v Biddeford Teachers Association, 304 A2d 387 (Me, 1973). Although experiencing some difficulty with determining whether legislative power could be exercised by arbitrators selected by the contesting parties, the Court found what they considered a \"rational reason\" for the legislative decision to choose this device, and therefore sustained it. The rational reason was that government aggrieved employees shouldn't have to look only to government for redress.14b\n\nThe Court presented two points of view on the question of what kind of standards was the right kind. One opinion indicated that generally \"intelligible principles\" were sufficient in view of the statutory requirement that the arbitrators act reasonably and fairly, and that the parties' positions were sharpened in negotiations including independent fact-finding, and later in a hearing with adequate due process safeguards. 304 A2d 387, 412. An equal number of Justices found that specific standards were necessary, especially in a context where the arbitrators were neither public officials nor \"required to answer to the electorate or to the elected representatives of the electorate\".15b 304 A2d 387, 402. They also found troublesome the case-by-case tenure \"which militates against an accumulation of experience and their development of standards\". 304 A2d 387, 402. All Justices found the presence of judicial review important.\n\nVI -- Relevant Michigan Cases\n\nThis case is one of first impression in Michigan, and there is no dispositive precedent.\n\nThere are, however, a number of cases dealing with compulsory arbitration that relate to both (A) the sufficiency of standards in the constitutional delegation of legislative power and (B) the constitutional prohibition against delegation of legislative power to a private person or a person not accountable to the public. In both the (A) and particularly the (B) category we are going to have to refer to some cases other than those involving compulsory arbitration to establish significant principles.\n\nA. Sufficiency of Standards of Delegation.\n\nThis Court straight-forwardly requires \"sufficient standards so as to obviate any delegation of legislative power\". A powerful example is People v Fields, 388 Mich 66; 199 NW2d 217 (1972), where the provision for waiver by the probate courts of 16-year-olds to the circuit courts for acts the nature of which constitutes felonies was held invalid for lack of sufficient standards.\n\nThis rule is followed in the cases dealing with compulsory arbitration. In Pleasant Ridge v Governor, 382 Mich 225; 169 NW2d 625 (1969), this Court found that \"Act 12, standing by itself, admittedly contains no standards within our constitutional rule\". 382 Mich 225, 243. However, we found that Act 12 referred to and incorporated a Federal statute, which \"sets forth a great plethora of specific standards to which all local functionaries * * * must conform * * *\". 382 Mich 225, 243.\n\nIn Local 170, TWU v Genesee Circuit Judge, 322 Mich 332; 34 NW2d 71 (1948), this Court, although finding the statute unconstitutional because it was contrary to the requirement of separation of powers, observed: \"Another fatal defect in the act in question is the failure of the legislature to designate the standards for the exercise of power which it has delegated to the arbitration board\".\n\nAs to the necessity of sufficient standards, the general law in Michigan that there must be such standards is quite clear and such compulsory arbitration cases as exist indicate this requirement applies equally in those cases.\n\nB. Delegation to Private or Non-Publicly Accountable Person.\n\nAs the brief of the City of Dearborn powerfully points out, Michigan jurisprudence strongly proscribes delegation of governmental power to nonaccountable private parties. That brief quotes our esteemed Justice Campbell in Shumway v Bennett, 29 Mich 451, 465 (1874):\n\n\"It is impossible to sustain a delegation of any sovereign power of government to private citizens * * *.\"\n\nInvolved was municipal incorporation of any chosen territory by citizen petition to a Judge who would thereupon call for a popular referendum.\n\nOf similar nature were more recent cases where governmental action was predicated upon decisions by private associations. Coffman v State Board of Examiners in Optometry, 331 Mich 582; 50 NW2d 322 (1951) (rating of optometric schools by international association of boards of examiners in optometry). People v Hall, 290 Mich 15, 29; 287 NW 361 (1939) (electrical wiring \"not less than the minimum standards described by the national electric code\").\n\nThe rule that evolves from these cases is that private citizens cannot be delegated public power to administer (Shumway) and a governmental agency may not exercise public power by reliance on private association decisions (Coffman and Hall).\n\nHowever, we come next to Pleasant Ridge which upholds a Governor-appointed arbitration panel selected \"from a list of members of the national panel of arbitrators * * * furnished to him by the American Arbitration Association\" to settle the location of an interstate highway route to be binding upon the communities affected and the state highway department. 382 Mich 225, 263. However, this opinion is not, as is argued, dispositive.\n\nWhat Pleasant Ridge specifically does is to hold that a panel of arbitrators appointed by the Governor from a list furnished him by a private association may be entrusted with governmental power under the conditions of 1967 (Ex Sess) PA 12. It does not cover the alternative where the local communities select the arbitrators. In any event, there is no factual congruence with the instant act's alternative of each party selecting a representative and they co-opting the third.\n\nThere is no question but that Pleasant Ridge is a precedent with large impact on our case but it is distinguishable and hence not controlling. First, in Pleasant Ridge the Governor appoints the entire panel; in our case only the arbitrator/chairman was named by the Governor's representative, the other two being party-appointed adversary representatives. Second, the power delegated is different. In Pleasant Ridge it was selection of a highway route, in our case, determination of wages, hours, and other conditions of work. Route selection is traditionally a power delegated to the executive, whereas wage, hours, and other conditions of work is, since the new constitutional provision, a collective bargaining decision. Third, the statutory standards of delegation may be different.\n\nAlong with Pleasant Ridge is another important case which seems to point in the opposite direction, People v Freedland, 308 Mich 449; 14 NW2d 62 (1944).\n\nIn Freedland, we combined several approaches to determining whether an individual was a public officer or public employee. We adopted the following definition of a public officer from State ex rel Barney v Hawkins, 79 Mont 506, 528, 529; 257 P 411 (1927).\n\n\"'After an exhaustive examination of the authorities we hold that five elements are indispensable in any position of public employment, in order to make it a public office of a civil nature: (1) It must be created by the Constitution or by the legislature or created by a municipality or other body through authority conferred by the legislature; (2) it must possess a delegation of a portion of the sovereign power of government, to be exercised for the benefit of the public; (3) the powers conferred, and the duties to be discharged, must be defined, directly or impliedly, by the legislature or through legislative authority; (4) the duties must be performed independently and without control of a superior power other than the law, unless they be those of an inferior or subordinate office, created or authorized by the legislature, and by it placed under the general control of a superior officer or body; (5) it must have some permanency and continuity, and not be only temporary or occasional.'\" 308 Mich 449, 457-458.\n\nWe also referred to, although we did not quote in toto, Justice Cooley's observation:\n\n\"The officer is distinguished from the employee in the greater importance, dignity and independence of his position; being required to take an official oath, and perhaps to give an official bond; in the liability to be called to account as a public offender for misfeasance or nonfeasance in office, and usually, though not necessarily, in the tenure of his position.\" Throop v Langdon, 40 Mich 673, 682-683 (1879).\n\nFurther, we stressed the rule, quoting State ex rel Hogan v Hunt, 84 Ohio St 143; 95 NE 666 (1911):\n\n\"'Manifestly, however, each case should be decided on its peculiar facts, and involves necessarily a consideration of the legislative intent in framing the particular statute by which the position, whatever it may be, is created.'\" 308 Mich 449, 457.\n\nApplying these precepts, we found that defendant, an account examiner of the state sales tax division, was not a public officer because he \"neither had the dignity nor the discretion usually vested in one holding a public office\". 308 Mich 449, 457.\n\nIn People v Leve, 309 Mich 557; 16 NW2d 72 (1944), the rule was applied to find that an auditor whose work was performed independently and was without power to determine policies was not a public officer. A deputy register of deeds was found to be such an officer in Kent County Register of Deeds v Kent County Pension Board, 342 Mich 548; 70 NW2d 765 (1955).16b Probate court stenographers were construed to be public employees, not public officers, in Meiland v Wayne Probate Judge, 359 Mich 78; 101 NW2d 336 (1960).\n\nIn addition to its use distinguishing between public employees and public officers, the rule has also been used to determine whether an individual held public office; for example, to determine that a civil defense director is a public officer,17b and that court commissioners appointed for condemnation appraisal purposes under 1925 PA 352 are not.18b\n\nIt is urged that Pleasant Ridge overrules Freedland sub silentio. We do not find it necessary to decide whether it does or not. The two cases, while dealing with overlapping and mutually interacting principles, nonetheless deal with two different rules. Pleasant Ridge deals with the rule relating to constitutionality of delegation of power to a private or non-publicly accountable person. Freedland deals with the rule differentiating between a public officer and a public employee who is not a public officer. While some of the language and even some of the principles may overlap, the basic question in each case is quite different.\n\nTwo problems in relating these two cases to each other help to confuse general consideration. First, Pleasant Ridge deals with a rule often stated in relation to the delegation of power to a \"private\" person. The Freedland connection semantically raises the question, therefore, whether or not the 1969 PA 312 alternate panels are public or private persons. As noted before, Rhode Island solved this important constitutional problem by a semantical tautological tour de force. It declared all the panelists including the exclusively union-appointed representative a public officer. But in the real world, is the union-appointed representative a public officer, although he has no public appointment of any kind? Perhaps, more importantly, is the union-appointed representative publicly accountable or is he accountable to the union, whether he is a public or private person? In other words, isn't the more important question whether there is adequate public accountability?\n\nThe second problem is that the five Freedland criteria may be taken as an all-or-nothing test. We do not believe Freedland should be so read, although some of the language adopted from another jurisdiction seems to so command (\"we hold that five elements are indispensable in any position of public employment, in order to make it a public office\" -- 308 Mich 449, 457). This Court in Freedland carefully examined all of the rules not only from the Montana case of State ex rel Barney v Hawkins with its five elements, but also the observation quoted from Cooley. We concluded:\n\n\"Applying the rules thus stated to the instant case, we are impressed with the fact that defendant neither had the dignity nor the discretion usually vested in one holding a public office.\" 308 Mich 449, 458.\n\nWe seem from the language of that Conclusion to be relying more heavily on the Cooley quote than the Montana decision. In any event, we hold that the length of tenure element is a significant but not dispositive factor. For example, the Attorney General might appoint a learned lawyer as a Special Assistant Attorney General and swear him in for one case alone. It would be difficult to say that that Special Assistant Attorney General was not a public officer.\n\nIn Conclusion, we believe the overall reality must be determined from an examination of all the factors applied to the instant situation.\n\nVII -- Criteria for Determining Valid Delegation\n\nSuperficially the Michigan and out-of-state precedents without further analysis could be said to uphold the constitutionality of our Michigan statute. The big problem is that most of the cases have not dug below the surface of the challenge of delegation to a private person, or better, to a non-publicly accountable person. Also, if we thought of using the Rhode Island method of finding the party-appointed arbitrators public officials we would be confronted by the simplistic tenure rule ascribed to the Freedland case. As we have seen, from the Rhode Island Court's attempt to grapple with the puzzle, it may be a medieval scholastic question whether an individual is a private or public person. The private or public label the person wears is not the whole answer by any means. We must reach the underlying reality.\n\nThere are, as this Discussion suggests, serious questions that have been raised by this experiment which have not yet been generally resolved. The implications for our system of government as we know it are great, when we consider the effect of an arbitration award made outside normal political channels on the social policy and economic well-being of an affected community. For example, what is there to prevent a just-for-one-case arbitrator from granting to public employees a benefit so great it might seriously jeopardize the economic or political stability of a community or to, without good reason, refuse to grant a reasonable request of the employees and incite a rebellious attitude among public servants, in either case redounding adversely upon the well-being of all citizens? It is therefore incumbent on this Court to carefully examine this aspect of the problem.\n\nThe cases, while not particularly helpful, do present a pattern of concerns from which we may extract appropriate criteria applicable to our current examination.\n\nWe find that the way delegates are selected is important. Thus, in Pleasant Ridge, the board was composed of three arbitrators appointed by the Governor from a list supplied by the American Arbitration Association. Penn District18c approved commissions made up of members from publicly elected school boards. Of the courts outside this jurisdiction, only the Supreme Court of Maine expressed interest in this aspect of the question, and resolved the problem by manifesting deference to legislative judgment, as long as a sufficient rationale was found.\n\nThe importance of the length of tenure of panelists was another concern of the Maine Court in Biddeford. It was, as well, an element in the Freedland line of cases from our state, with perhaps its greatest relevance to our analysis in the form of public visibility and control afforded by the tenure and job-importance of the person involved.\n\nThe need for adequate standards of delegation appears in most of the decisions, especially Pleasant Ridge and Penn District from our state. Rhode Island approved a list of standards very similar to those of our own statute. Perhaps the problem, however, was most eloquently expressed by the Biddeford decision where both opinions indicated that in the absence of a directly publicly appointed or elected official, the need for standards would be greater than otherwise.\n\nThe Maine Court's analysis really dealt with the kind of power exercised by the arbitrators, with part of the Court adopting the view that the delegation was sufficiently narrow so that even the absence of detailed standards was sufficient to satisfy constitutional requirements.\n\nProfessor Frank Cooper in his treatise, State Administrative Law, observed that courts \"weighing the advantage of delegation against the hazards involved make a pragmatic judgment as to whether the constitutional protections have been observed\". From the pragmatic judgments we have reviewed, (supra) , we find that, implicitly or explicitly, courts have tended to rely on certain criteria in making their determinations.\n\nThe criteria used in the balances to determine these pragmatic judgments can be clustered into four categories:\n\nFirst, how close by appointment is the person or agency to the elective process and political accountability? In other words, a person appointed by the Governor is going to have a high degree of responsibility and accountability because his actions will reflect directly on the chief elected official.\n\nSecond, how closely restricted is the operation of the person or agency by standards written into the law and the possibility of judicial review?\n\nThird, how much is the person or agency held to public accountability by the length of tenure on and the public exposure of the job?\n\nThere is a fourth criterion that as far as public accountability goes may act as kind of counter-weight to the other three. It is the importance and breadth of power granted. In other words, while a certain amount of public accountability in all things is required, greater accountability is probably desirable where important power and broad discretion are simulataneously granted.\n\nObviously from the \"scale of Justice\" metaphor, we suggest that the balances react to the total weight of all four criteria. We also suggest that if the constitutional importance and strength of one criterion is particularly great it might make up for a degree of weakness in another. In a word no single criterion is wholly dispositive. Rather it is the total effect of all the criteria that affects the balance of judgment.\n\nThese criteria in summary may be listed:\n\n1 -- Proximity of those performing the delegated duty to the elective process;\n\n2 -- Sufficiency of standards of delegation and judicial review;\n\n3 -- Length of tenure and character of job;\n\n4 -- Kind of power delegated.\n\nThese criteria may be combined to demonstrate two possible extremes, that of maximum accountability and therefore maximum constitutionality, and minimum accountability and therefore, patent unconstitutionality. For example, the paradigm of maximum accountability could be:\n\nGovernor appoints a panel of legislatively authorized arbitrators serving for a designated period of years. When there are public employee disputes, the parties are assigned, or may choose, arbitrators from this panel. Subject matter of arbitration is interpretation of written agreement with clear and comprehensive delimitation of rights and standards for interpretation, in short, a clear quasi-judicial function with ample standards. There is specific provision for judicial review.\n\nA plan difficult to sustain against constitutional challenge might look like this:\n\nCity and city employees each appoint an arbitrator and these together select the third. Arbitrators serve only for specific disputes and for not longer than a short period not determined by statute. Subject matter of arbitration is open-end problem solving without guidelines, limitations, or judicial review, in short, open-ended legislative or executive functioning.\n\nWhen viewed in this context it becomes clearer that in order to determine the validity of a delegation of governmental power, it becomes necessary to determine at what point within the accountability/constitutionality -- nonaccountability/unconstitutionality spectrum the statute belongs. Thus, no one aspect of the enactment is wholly dispositive and independent of the others. What judicial determinations become in fact is an analysis of how much control the Legislature can give away before it constitutes the type of abdication of its own authority which is antithetical to constitutional precepts and the ideal of democratic government, or, to put it another way, how far can the Legislature remove important power from public accountability. We will now apply this approach to the Michigan compulsory arbitration statute.\n\nVIII -- Application of Criteria\n\nA. Proximity to Elective Process.\n\nThe statute provides two means of appointing arbitrators. The first, which was not used in this case, permits each party to appoint a panelist, after which these two delegates will themselves select an arbitrator/chairman. If they fail to agree on the chairman selection, the second method comes into play. The chairman of MERC appoints the arbitrator/chairman. The second was the method used in the Dearborn arbitration. One representative was chosen by the union and the city refused to name theirs.\n\nB. Sufficiency of Standards of Delegation.\n\nThe statute contains extensive standards to which arbitrators are expected to refer when rendering their decisions, (supra) , fn 6. Further, the statute provides the right to judicial review in circuit court to a party dissatisfied with the arbitration result. MCLA 423.242; MSA 17.455(42).\n\nC. Tenure and Public Exposure.\n\nEach arbitration panel is selected only for the duration of the particular dispute. The period is set by statute and is, if there are no extensions (also statutorily limited), a maximum of 60 days after hearings begin. The likelihood of public exposure is considerable because of the public nature of and interest in the subject matter.\n\nD. Kind of Power Delegated.\n\nThe statute makes a well-defined, limited grant of power to the panels. Thus, in addition to the strictures on the ways in which panels may act, (supra) , the areas in which they act are fairly limited to wages and conditions of employment.\n\nIX -- Analysis of Application\n\nA. Proximity to Elective Process.\n\nCollective bargaining in the public sector is part of the public process, and thus persons bearing the ultimate political responsibility must not isolate themselves from the process. While it is not necessary that elected officials themselves do the arbitrating, citizens should be able to identify every elected official responsible for the result of the arbitration -- either because he was an arbitrator or appointed the arbitrator.\n\nThe present case presents two alternative approaches to appointment. First, the law provides that parties to the dispute may select their own arbitrators and these arbitrators may select the third. This would present a situation similar to our hypothetical of minimum accountability on this point. It would be a weak argument for constitutionality when weighed with the other criteria. Since, however, as a point of fact, the city did not select an arbitrator, making impossible the joint selection of the third, the chairman of MERC appointed the arbitrator/chairman, the second method.\n\nThe MERC chairman is an appointee of the Governor, making proximity of the appointing authority to election by the people very close. Although the appointing authority is not elected, he or she is appointed by the highest elected official in the state. Furthermore, the chairman of MERC is the Governor's primary representative in employment relations. Public responsibility therefore is of a high order.\n\nThe fact of the matter is that appointment by the chairman of MERC created considerable political accountability in this case. If the chairman of MERC had appointed as arbitrator/chairman a person who would have \"given away the store\", the possibility of either chairman or Governor not receiving complaints from the City of Dearborn or Dearborn citizens would be very remote indeed.\n\nWe end up with the situation then where one alternative method of appointment tends strongly to unconstitutionality but the other strongly toward constitutionality. However, in construing the constitutionality of statutes we must \"seek to save what we can\" of public policy expressed in the statute. People v Bricker, 389 Mich 524, 529; 208 NW2d 172 (1973). The public policy of this state as expressed in the arbitration statute has been to proscribe strikes of public employees and to substitute instead a system of binding arbitration. The Legislature, as the representative of the people, has offered two alternative methods of constituting the panel to help realize this goal. Thus, both are part and parcel of the same statute. Both are means to the end of achieving this legislative goal. We may, if we have to, sever the unconstitutional method without sacrificing the statute.\n\nB. Sufficiency of Standards of Delegation.\n\nThe task toward which the statute is directed is the resolution of complex contractual problems which have been somewhat refined by the process of collective bargaining and negotiation. The issues involved are as disparate as the towns and cities which are the battlegrounds of these labor disputes. While the area of labor arbitration by definition therefore assumes a situation where flexibility is essential, such flexibility must be maintained within the context of legislatively-defined standards.\n\nThe significance of legislative standards is appropriately seen as a check on the unfettered exercise of authority. Such restrictions not only serve to prevent arbitrators from imposing their own social and economic philosophies on the parties and therefore on other citizens, but also are an affirmative statement of what the people and their representatives in the Legislature deem important.\n\nProperly drawn, with appropriate directives as to their use, such standards are capable of providing much of the safeguard we need to prevent \"giving away the store\".\n\nOf statutes requiring arbitration upon request of one party, Michigan is one of only three states (the others are Nebraska and Wisconsin) containing criteria for guiding the arbitrators. As we noted in part IV, particularly note 6, we observed that the standards relate to providing wages, hours and other conditions of employment as good as but not out of line with persons in public and private employment in comparable communities. We noted particularly the requirement to review the financial ability of the governmental unit to meet proposed costs. 72 Col L Rev 1192, 1200, fn 41. While the Michigan law gives arbitrators a great deal of freedom in determining which criteria are most applicable to a particular case, the consensus is that the arbitration panels are using these standards and have, in written opinions, rationalized their decisions in terms of these categories. See, e.g., Smith, Edwards, Clark, Labor Relations Law in the Public Sector, 833-858.\n\nFurther restriction on the untrammelled exercise of power is the provision for judicial review. MCLA 423.242; MSA 17.455(42). While not as broad as the South Dakota \"appeal de novo\", 72 Col L Rev 1192, 1204, fn 73, the Michigan statute covers all appropriate bases for review from an arbitration award, without permitting the relitigation which would whittle away at the binding authority behind the arbitration concept.\n\nThus, it is clear, the restrictions on the authority of arbitrators are both apparent and real, and serve effectively to close the gap between the people and the arbitrators.\n\nC. Length of Tenure and Character of Job.\n\nIt is suggested that the statutory system gives rise to a kind of \"hit-and-run\" decision-making process which permits the city to first insulate itself from unpopular decisions by delegating them elsewhere, and then further insulating itself by leaving no one around to take the blame.\n\nHowever, long tenure does not guarantee publicly conscientious and accountable public servants, nor does short service automatically equate with irresponsibility. As we have seen too many times in the past, development and perpetuation of a bureaucracy may be but another method of insulating and camouflaging the real decision-maker. The issue is that of responsibility to the people. The Legislature has resolved this in the past, and may choose to do so in the future, with both long- and short-term bodies.\n\nWe should not have overmuch concern with the temporal nature of the arbitration panels. There is much to be said for selecting an arbitrator with particular expertise concerning a specific dispute, perhaps an arbitrator with roots in the community involved. Long terms in office could conceivably, by removing the arbitrators from everyday relationship to the parties, militate against this important type of responsibility.\n\nWhile all parties are working on an ad hoc short-term basis, all are engaged as well in long-term relationships in the field of arbitration with other employers and employees. The arbitrator is in a profession where his reputation for impartiality and reasonableness is important to future employment, whether by these parties or someone else. He has to maintain the short-term and long-term confidence of both sides, or else suffer an inability to perform well in this and other appointments. The public employer remains responsible for the quality of its labor negotiators, and in the event of arbitration, for the performance of its appointed representative, for the effectiveness of its presentation to the arbitration panel, for the reasonableness of its offer, and for its role in the maintenance of the type of employer-employee relations which avoid open warfare and extremism. Further, it is doubtful that the citizens of the governmental unit will long tolerate an administration which consistently proves itself unable to resolve labor problems without crisis. The union must maintain its long-term credibility, or else its demands will be met with a jaundiced eye and the union leadership itself will suffer because of a loss of confidence by its membership and the community.\n\nThe short period during which arbitrators operate is a period of high visibility, where publicity is focused on the process of bargaining. While their role in the appointment strengthens the accountability of the appointers, such public attention also serves to strengthen the accountability of appointees. They are the focal point of general interest during this intense session of activity, and attempts to do otherwise than follow the legislative mandate will be, at the very least, soundly criticized.\n\nThe tripartite arbitration setup is more properly thought of as a kind of adversary proceeding, rather than the type of labor court which results from a permanent tribunal setup.19b The latter was not the legislative intent in designating arbitration panels to achieve impasse resolution.\n\nThe Legislature was undoubtedly familiar with the success of compulsory arbitration by ad hoc panels specially chosen to cope with a given impending crisis. They were choosing from history rather than trying to make history.20b\n\nD. Kind of Power Delegated.\n\nThe Legislature made only a narrow grant of power, consisting of submission of unresolved issues on wages and working conditions to a panel and a decision by that panel made according to legislatively-mandated standards which is final and binding on both parties. It is apparent that by the time problems reach the arbitration panel, the issues already have been sharpened by the process of negotiation. The panels operate with a great deal of independence within this narrow spectrum, but a well-articulated series of standards and a broad provision for judicial review serve to channel these efforts.\n\nIndividuals to whom such limited discretion is delegated require less accountability than recipients of a broad, unlimited grant of power. The greatest discretion is properly exercised only by officials elected directly by the people, where accountability is accordingly greatest. Where less-independent operation is possible, accountability must still be present, but it may be less.\n\nThe three criteria we have discussed, (supra) , operate within the framework of this fourth one, and, at the same time, all four relate with one another. Ultimately, a subjective judgment is required to determine whether all four factors balance one another in a network which constitutes a delegation with sufficient accountability.\n\nThus, a statute delegating a narrow grant of power need not contain as direct lines to the electorate as one where the power was far broader. Further, if the narrow power is defined by well-drawn standards and adequate provision for judicial review, other requirements, such as permanence in office, are concomitantly lessened. Such is the scheme drawn by the Michigan compulsory arbitration statute.\n\nX -- Conclusion\n\nIn this case this Court is confronted with the possible unconstitutionality of a comparatively new but highly effective device in maintaining good public employer-employee relations and labor peace, on the one hand. On the other hand is the possibility of a significant erosion of our publicly accountable form of government by a device whose greatest effectiveness, some say, is its substitution of outside, non-politically accountable impartial experts to resolve conflicts by making decisions which could be embarrassing to responsible public officials whose everyday business is to deal with such matters.\n\nThis Court would be shirking its duty if, in heeding Chief Justice Bushnell's quote of Justice Brandeis, \"To stay experimentation in things social and economic is a grave responsibility\", 322 Mich 332, 340, we blindly gave a carte blanche to the introduction of any system of compulsory arbitration. On the other hand, it would be equally reprehensible not to make a serious effort to visualize the constitutional area in which the Legislature can properly operate to draw up compulsory arbitration schemes.\n\nIf we push through the thicket of language which has grown up around this issue, we find what we are all really concerned about is not what the Legislature can or cannot give away, and what the circumstances of such donations should be, but rather, what the people can or cannot give away. What the people cannot give away seems to be public responsibility and accountability in the management of its business, whatever the managers are called.\n\nWe feel that a sufficient combination of protection because of political accountability through the type of appointment, legal accountability through sufficient standards of delegation, and personal accountability of the manager through length of tenure and public exposure of the job, balanced by the importance and breadth of the power granted, safeguards the public in this respect.\n\nProfessor Frank Cooper's analysis, \"weighing the advantage of delegation against the hazards involved make a pragmatic judgment as to whether the constitutional protections have been observed\", could be applied in the actual facts of this case somewhat as follows:\n\nA. Advantages of Delegation.\n\n1 -- Continuation of successful and effective labor-management tool that has prevented costly work stoppages which could produce crisis situations.\n\n2 -- Support of important legislation responsive to a specific constitutional authorization.\n\nB. Hazards.\n\n1 -- Selection of the panels is outside ordinary political processes. However, appointment of the arbitrator chairman controlling the swing vote by the gubernatorially top appointed labor relations official, the chairman of MERC, guarantees high public visibility and accountability. That the employer and employee representatives can combine to outvote the arbitrator/chairman is really immaterial, for the only reason for arbitration was their previous inability to agree. The proximity of the appointment to the electoral process guarantees a high degree of political accountability.\n\n2 -- Arbitrators operate independently. However, the statute's very specific and ample standards of delegation of authority plus specifically provided judicial review insures a high degree of legal accountability.\n\n3 -- While the tenure of the job is brief, suggesting personal lack of accountability, there are several countervailing factors. First, arbitrators are a highly professional group, trained for and proud of their impartiality and professionalism. Their ability to acquire future employment requires sufficient impartiality to be acceptable to both labor and management. Second, fire and police compulsory arbitration most often takes place in the focus of intense public and media scrutiny. Third, the appointee while independent is constrained by the legal standards just considered and responsibility to his appointer to stay within the law. In sum, therefore, while the length of tenure is too short to impose any considerable degree of personal accountability, professionalism, the public atmosphere in which police/fire compulsory arbitration is usually carried out, the legal standards and respect for the appointing authority all tend to indicate there is probably a considerable degree of personal accountability.\n\n4 -- The job is important but the areas of discretion suitably delimited.\n\nSumming up we believe this case presents us an important and successful social experiment carefully drafted by the Legislature in specific response to the Constitution with the hazards of delegation carefully protected against by the provision of a high degree of political and legal accountability and substantial degree of personal accountability. We therefore feel that there has been no violation of the constitutional proscription against delegation of power to a non-publicly accountable person where the appointment to the panel of the arbitration/chairman is made by the chairman of MERC.\n\nWhile the other appointment alternative of co-option of the arbitrator/chairman by the municipal and employee representatives is not factually before us, our analysis indicates that the first hazard factor of political accountability is not at all well satisfied by this form of co-option. Except as the representative of the municipality may be an elected officer or appointed by one, the distance of the panel from the election process is apt to be considerable. It is doubtful whether the strong legal accountability plus some personal accountability presents a strong enough counterweight to the weakness of the political accountability factor. In any event that question is left for future appropriate decision.\n\nAs applicable to the instant facts, 1969 PA 312 is not an unconstitutional delegation to a non-publicly responsible arbitration panel. We would therefore affirm and permit the act to operate and industrial peace to reign under the stated condition.\n\nWe affirm. No costs a public question.\n\nT. G. Kavanagh, C. J. (concurring).\n\n[EDITOR'S NOTE: The page numbers of this document may appear to be out of sequence; however, this pagination accurately reflects the pagination of the original published documents.]\n\nI have signed Justice Levin's opinion because I am satisfied that he has correctly stated the law. I write separately to emphasize the observation he makes.\n\nAt least as long as the law prohibiting public employees from striking is maintained, some form of compulsory arbitration is a constitutionally permissible device to provide for the settlement of disputes between such employees and their employers.\n\nAlthough the present law's provision for hit-and-run arbitrators is constitutionally defective, a law providing for a continuing politically responsible arbitrator could meet the constitution's demands.\n\n\u003cspan class=\"fn\"\u003e1. MCLA 423.231, et seq.; MSA 17.455(31), et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. MCLA 423.233; MSA 17.455(33).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. MCLA 423.235; MSA 17.455(35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Note, Michigan Compulsory Arbitration Act for Essential Services, 3 J Law Ref 239, 243 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. MCLA 423.231; MSA 17.455(31).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The city concedes that the act permits, upon the parties' agreement, extensions beyond the 30-day limit (MCLA 423.238; MSA 17.455[38]) but argues that it, a \"party\", never gave the requisite permission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe panel's inability to complete its task within 30 days does not vitiate the order. The dominant cause of the delay was the nonparticipation of the city. The statutory purpose would not be served by requiring absolute compliance with these time limitations. Moreover, the city has not shown any prejudice to its interests resulting from the delay in decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Const 1963, art 7, §§ 22, 34:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 22. Under general laws the electors of each city and village shall have the power and authority to frame, adopt and amend its charter, and to amend an existing charter of the city or village heretofore granted or enacted by the legislature for the government of the city or village. Each such city and village shall have power to adopt resolutions and ordinances relating to its municipal concerns, property and government, subject to the constitution and law. No enumeration of powers granted to cities and villages in this constitution shall limit or restrict the general grant of authority conferred by this section.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 34. The provisions of this constitution and law concerning counties, townships, cities and villages shall be liberally construed in their favor. Powers granted to counties and townships by this constitution and by law shall include those fairly implied and not prohibited by this constitution.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See Detroit Police Officers Association v Detroit, 385 Mich 519; 190 NW2d 97 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. MCLA 117.1, et seq.; MSA 5.2071, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. MCLA 423.201, et seq.; MSA 17.455(1), et seq., authorizing public employees to select a collective bargaining representative and to engage in collective bargaining with their public employer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Const 1963, art 8, § 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. MCLA 38.401, et seq.; MSA 5.1191(1), et seq., providing for a civil service system in counties having a population of 1,000,000 or more.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Const 1963, art 9, § 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The Constitution provides that the \"legislative power\" is vested in a Senate and a House of Representatives. Const 1963, art 4, § 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. It is not claimed that this specifically conferred legislative authority is not subject to other constitutional limitations, explicit and implicit. The power is plenary, in the sense that the power is not shared, but it is not an unbridled power any more than countless other powers possessed by the Legislature. The Legislature could not, for example, provide for \"resolution\" by tossing a coin, by holding a turtle race, or by combat.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Davis, Administrative Law Treatise (1970 Supp), § 2.00, p 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. 1 Cooper, State Administrative Law, pp 53, 73 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. 1 Cooper, (supra) , p 53.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Goldstein, Book Commentary on Wellington \u0026 Winter, The Unions \u0026 the Cities, 22 Buffalo L Rev 603, 608 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See McAvoy, Binding Arbitration of Contract Terms: A New Approach to the Resolution of Disputes in the Public Sector, 72 Colum L Rev 1192, 1212 (1972): \"he Montreal strike provides clear evidence that when employees feel passionately that a binding award is unjust they are likely to strike, illegality notwithstanding\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne commentator has observed that \"o scheme of legislation can supply a foolproof strike preventative\". Witt, The Public Sector Strike: Dilemma of the Seventies, 8 Cal West L Rev 102, 116 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. State v Laramie, 437 P2d 295 (Wyo, 1968); Harney v Russo, 435 Pa 183; 255 A2d 560 (1969); City of Warwick v Warwick Regular Firemen's Association, 106 RI 109; 256 A2d 206 (1969). Contrast State v Johnson, 46 Wash 2d 114; 278 P2d 662 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The reasoning of the Wyoming Court has been described as \"superficial at best\". Smyser, Public Employees and Public Employees Unions: Their Rights and Limitations in South Dakota, 17 SD L Rev 65, 72 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Comment, Collective Bargaining for Public Employees and the Prevention of Strikes in the Public Sector, 68 Mich L Rev 260, 284 (1969). See, also, McAvoy, Binding Arbitration of Contract Terms: A New Approach to the Resolution of Disputes in the Public Sector, 72 Colum L Rev 1192, 1206 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. RI Gen Laws Anno, § 28-9.1-8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. By amendment, the Rhode Island Act now empowers the American Arbitration Association, if the arbitrators selected by the parties are unable to agree, to select the third arbitrator. RI Gen Laws Anno, § 28-9.1-8, § 28-9.2-8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. It has been asserted by some that compulsory arbitration inhibits the normal collective bargaining process. See Sullivan, Binding Arbitration in Public Employment Labor Disputes, 36 U of Cincinnati L Rev 666, 676 (1967); Comment, Collective Bargaining for Public Employees and the Prevention of Strikes in the Public Sector, 68 Mich L Rev 260, 287 (1969). Cf. Kheel, Strikes and Public Employment, 67 Mich L Rev 931, 941 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Taylor, Public Employment: Strikes or Procedures, 20 Industrial Labor Relations Rev 617, 632 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Hildebrand, The Resolution of Impasses, Proceedings of the 20th Annual Meeting, National Academy of Arbitrators, pp 287, 291 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Bernstein, Alternatives to the Strike in Public Labor Relations, 85 Harv L Rev 459, 467 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Comment, Collective Bargaining for Public Employees and the Prevention of Strikes in the Public Sector, 68 Mich L Rev 260, 288 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, see Shaw and Clark, The Need for Public Employee Labor Legislation in Illinois, 59 Ill Bar J 628, 642 (1971). See, also, Smyser, Public Employees and Public Employees Unions: Their Rights and Limitations in South Dakota, 17 SD L Rev 55, 68 (1972). The author argues that the power to fix the terms and conditions upon which government shall perform its governmental function cannot be delegated to non-governmental agents and that an attempt to vest such power in a non-governmental agent \"is an attempt to create a new and private government\". It is not entirely clear to what extent this author's argument rests on a South Dakota constitutional limitation which does not appear in the Michigan Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Sullivan, Public Employee Labor Law, § 13.4, p 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Sullivan, Binding Arbitration in Public Employment Labor Disputes, 36 U of Cincinnati L Rev 666, 678 (1967). Similarly, Sullivan, Public Employee Labor Law, § 13.17, p 102.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFor similar proposals, see Shenton, Compulsory Arbitration in the Public Service, 17 Labor Law J 138, 142 (1966); Note, Public Labor Disputes -- A Suggested Approach for New Mexico, 1 NM L Rev 281, 294 (1971); Witt, The Public Sector Strike: Dilemma of the Seventies, 8 Cal West L Rev 102, 114 (1971); Good, Public Employee Impasse Resolution by Judicial Order: The Nebraska Court of Industrial Relations, 2 J of Law \u0026 Education 253 (1973); Comment, Collective Bargaining for Public Employees and the Prevention of Strikes in the Public Sector, 68 Mich L Rev 260, 284 (1969): \"he objection might be raised that the higher governmental authority which has ordered the arbitration has itself abdicated its responsibility by delegating it to an outside party. To the extent that this objection has merit, however, it can be avoided if the arbitration is governmental in nature. Thus, arbitration might properly be conducted by a state labor board, by a public employment board, or perhaps a 'labor court'.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Garber, Compulsory Arbitration in the Public Sector: A Proposed Alternative, 26 The Arbitration J 226, 230 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Comment, Collective Bargaining for Public Employees and the Prevention of Strikes in the Public Sector, 68 Mich L Rev 260, 288 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Gershenfeld, Compulsory Arbitration is Ready When You Are, 23 Labor Law J 153, 155 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. McAvoy, Binding Arbitration of Contract Terms: A New Approach to the Resolution of Disputes in the Public Sector, 72 Colum L Rev 1192, 1209 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Howlett, Contract Negotiation Arbitration in the Public Sector, 42 U of Cincinnati L Rev 47, 71 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See majority and Dissenting opinions, People v Fields (On Rehearing), 391 Mich 206; 216 NW2d 51 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See the extensive writings of Professor Kenneth Culp Davis, e.g., Davis, Administrative Law Treatise (1970 Supp), § 2.00, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. \"Where there is no agreement between the parties, or where there is an agreement but the parties have begun negotiations or Discussions looking to a new agreement or amendment of the existing agreement, and wage rates or other conditions of employment under the proposed new or amended agreement are in dispute, the arbitration panel shall base its findings, opinions and order upon the following factors, as applicable:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) The lawful authority of the employer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Stipulations of the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) The interests and welfare of the public and the financial ability of the unit of government to meet these costs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Comparison of the wages, hours and conditions of employment of the employees involved in the arbitration proceeding with the wages, hours and conditions of employment of other employees performing similar services and with other employees generally:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) In public employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(ii) In private employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(e) The average consumer prices for goods and services, commonly known as the cost of living.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(f) The overall compensation presently received by the employees, including direct wage compensation, vacations, holidays and other excused time, insurance and pensions, medical and hospitalization benefits, the continuity and stability of employment, and all other benefits received.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(g) Changes in any of the foregoing circumstances during the pendency of the arbitration proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(h) Such other factors, not confined to the foregoing, which are normally or traditionally taken into consideration in the determination of wages, hours and conditions of employment through voluntary collective bargaining, mediation, fact-finding, arbitration or otherwise between the parties, in the public service or in private employment.\" MCLA 423.239; MSA 17.455(39).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. MCLA 423.235; MSA 17.455(35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. \"n impartial, competent and reputable citizen\". MCLA 423.235; MSA 17.455(35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Const 1963, art 9, § 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. We advised the Legislature that an act providing for repayment with non-voted millage of school district notes issued to fund accumulated operating deficits does not violate the 15-mill limitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe also noted (p 184) that \"he Legislature may impose whatever limitations it deems necessary to prevent deficit spending and the issuance of bonds and other evidence of indebtedness\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA statute provides that school districts receiving state school aid \"shall not adopt or operate under a deficit budget and a district shall not incur an operating deficit in any fund in any fiscal year. Each district shall submit its adopted budget for the current fiscal year to the department before November 1. If the department determines that the district is in violation of this section, the district shall not be allotted or paid any further sum under this act until a new budget is submitted and determined by the department to be in compliance with this section. However any district with a deficit as of June 30, 1973 that demonstrates progress in eliminating this deficit is not in violation of this section\". MCLA 388.1202; MSA 15.1919(602).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, also, Concurring opinion of Justice Williams at p 185.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. MCLA 423.215; MSA 17.455(15); § 8(d) of the NLRA (29 USC § 158).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Cf. Regents of the University of Michigan v Employment Relations Commission, 389 Mich 96, 109; 204 NW 2d 218 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. \"he question of whether or not to make residence within a city a condition of public employment is one which must be largely addressed to the legislative branch of government.\" Williams v Civil Service Commission of the City of Detroit, 383 Mich 507, 517; 176 NW2d 593 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The \"command\" officers of the Inkster Police Department were in a separate bargaining unit from the patrolmen. The arbitration panel's decision concerned the command officers' contract only. In the Matter of the Arbitration between The City of Inkster and Teamster Local #214 Police Command Unit, MERC Mich PA-312 -- Interest Arbitration opinion of M. David Keefe, Chairman, March 4, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. \"In construing the provisions and ramifications of the PERA, this Court has frequently looked to decisions of the Federal courts which construe and apply the National Labor Relations Act.\" Kaleva-Norman-Dickson School Dist v Kaleva-Norman-Dickson Teachers' Association, 393 Mich 583, 590-591; 227 NW2d 500 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See Morris, The Developing Labor Law, pp 404, 405, 409, 410.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. \"The union representative testified that the number of firemen on duty affected not only the public safety, but also the firemen's safety. This position was supported by extensive testimony concerning fire fighting practices and procedures. A safety practice is a condition of employment. [Emphasis supplied.] NLRB v Gulf Power Co, 384 F2d 822 (CA 5, 1967); NLRB v Miller Brewing Co, 408 F2d 12 (CA 9, 1969); Fibreboard Paper Products Corp v NLRB, 379 U.S. 203; 85 S Ct 398; 13 L Ed 2d 233 (1964), Mr. Justice Stewart Concurring; see Annotation, Subjects of mandatory collective bargaining under Federal Labor Relations Act, 12 ALR2d 265. We hold, therefore, that the manpower award was within the subject matter and jurisdiction of the arbitration panel.\" Alpena v Alpena Fire Fighters Association, AFL-CIO, 56 Mich App 568, 575; 224 NW2d 672 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, see Detroit Police Officers Ass'n v City of Detroit, 61 Mich App 487; 233 NW2d 49 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. MCLA 423.242; MSA 17.455(42).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The scope of judicial review under the act is narrow. The circuit court may interfere only when \"the order is unsupported by competent, material and substantial evidence on the whole record; or the order was procured by fraud, collusion or other similar and unlawful means\". MCLA 423.242; MSA 17.455(42). See Anderson, Compulsory Arbitration Under State Statutes, Proceedings of New York U Twenty-Second Annual Conference on Labor 259, 273 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNot only does the act fail to authorize, but the circuit court could not properly exercise a power of political review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Arbitrator/chairmen of a number of panels appear to have concluded that it is the obligation of government, local, state or national, to provide additional revenues or to make adjustments in other programs required to fund their orders. For the views of some arbitrator/chairmen who have decided controversies pursuant to the challenged Michigan act, see excerpts from their decisions reprinted in Smith, Edwards \u0026 Clark, Labor Relations Law in the Public Sector, Cases \u0026 Material, p 833, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSome commentators have stated that an arbitrator/chairman can properly require a greater \"fiscal effort\", that financial ability does not mean present resources but potential ability resulting from exploitation of additional revenue sources, i.e., raising taxes. McAvoy, Binding Arbitration of Contract Terms: A New Approach to the Resolution of Disputes in the Public Sector, 72 Colum L Rev 1192, 1200 (1972); Ross, The Arbitration of Public Employee Wage Disputes, 23 Ind \u0026 Labor Rel Rev 3, 6 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The amended act requires the arbitration panel to identify \"the economic issues in dispute, and direct each of the parties to submit * * * its last offer of settlement on each economic issue. * * * As to each economic issue, the arbitration panel shall adopt the last offer of settlement which, in the opinion of the arbitration panel, more nearly complies with the applicable factors prescribed\" in the act. MCLA 423.238; MSA 17.455(38).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The presented question does not require consideration of whether, apart from obligation imposed by statute, a unit of local government can freely agree with a union representing public employees to submit an impasse in negotiations to binding arbitration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhere such an agreement is made after the issues separating the parties have been narrowed, the authority of the arbitrator/chairman, freely chosen by the parties, can be confined to choosing between two alternatives, clearly defined before the public employer agrees to abide the result. Both alternatives may even be acceptable to the public employer. By agreeing to arbitrate, the public employer accepts a measure of responsibility for the scope of the decision. Cf. Pleasant Ridge v Governor, 382 Mich 225; 169 NW2d 625 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Cipriano v City of Houma, 395 U.S. 701; 89 S Ct 1897; 23 L Ed 2d 647 (1969); Phoenix v Kolodziejski, 399 U.S. 204; 90 S Ct 1990; 26 L Ed 2d 523 (1970); Allen v State Board of Elections, 393 U.S. 544; 89 S Ct 817; 22 L Ed 2d 1 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. There was no effort to effect the return of money that had already been paid for services rendered before Lemon I was decided. Lemon II considered only whether money allocated, but not yet paid, for services contracted before Lemon I should be paid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Chief Justice Burger, writing for the majority in Lemon II, analyzed the stifling effect a doctrine of undeviating full retroactivity would have on the prompt implementation of new governmental programs in the future:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Appellants would have state officials stay their hands until newly enacted state programs are 'ratified' by the federal courts, or risk draconian, retrospective decrees should the legislation fall. In our view, appellants' position could seriously undermine the initiative of state legislators and executive officials alike. Until Judges say otherwise, state officers -- the officers of Pennsylvania -- have the power to carry forward the directives of the state legislature. Those officials may, in some circumstances, elect to defer acting until an authoritative judicial pronouncement has been secured; but particularly when there are no fixed and clear constitutional precedents, the choice is essentially one of political discretion and one this Court has never conceived as an incident of judicial review.\" Lemon v Kurtzman, 411 U.S. 192, 207-208; 93 S Ct 1463; 36 L Ed 2d 151 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a The following sections are of particular relevance:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 1. It is the public policy of this state that in public police and fire departments, where the right of employees to strike is by law prohibited, it is requisite to the high morale of such employees and the efficient operation of such departments to afford an alternate, expeditious, effective and binding procedure for the resolution of disputes, and to that end the provisions of this act, providing for compulsory arbitration, shall be liberally construed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 3. Whenever in the course of mediation of a public police or fire department employee's dispute, the dispute has not been resolved to the agreement of both parties within 30 days of the submission of the dispute to mediation and fact-finding, or within such further additional periods to which the parties may agree, the employees or employer may initiate binding arbitration proceedings by prompt request therefor, in writing, to the other, with copy to the labor mediation board.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 4. Within 10 days thereafter, the employer shall choose a delegate and the employees' designated or selected exclusive collective bargaining representative, or if none, their previously designated representative in the prior mediation and fact-finding procedures, shall choose a delegate to a panel of arbitration as provided in this act. The employer and employees shall forthwith advise the other and the mediation board of their selections.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 5. Within 5 days thereafter, or within such further additional periods to which they may agree, the delegates shall designate an impartial, competent and reputable person to act as an arbitrator, hereafter called the arbitrator or chairman of the panel of arbitration, and with them to constitute an arbitration panel to further consider and order a settlement of all matters. Upon their failure to agree upon and appoint the arbitrator within such time, or mutually extended time, either of them may request the chairman of the state labor mediation board to appoint the arbitrator, and the chairman of the state mediation board shall appoint, in not more than 7 days, an impartial, competent and reputable citizen as the arbitrator.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 9. Where there is no agreement between the parties, or where there is an agreement but the parties have begun negotiations or Discussions looking to a new agreement or amendment of the existing agreement, and wage rates or other conditions of employment under the proposed new or amended agreement are in dispute, the arbitration panel shall base its findings, opinions and order upon the following factors, as applicable:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) The lawful authority of the employer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Stipulations of the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) The interests and welfare of the public and the financial ability of the unit of government to meet those costs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(d) Comparison of the wages, hours and conditions of employment of the employees involved in the arbitration proceeding with the wages, hours and conditions of employment of other employees performing similar services and with other employees generally:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(i) In public employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(ii) In private employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(e) The average consumer prices for goods and services, commonly known as the cost of living.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(f) The overall compensation presently received by the employees, including direct wage compensation, vacations, holidays and other excused time, insurance and pensions, medical and hospitalization benefits, the continuity and stability of employment, and all other benefits received.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(g) Changes in any of the foregoing circumstances during the pendency of the arbitration proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(h) Such other factors, not confined to the foregoing, which are normally or traditionally taken into consideration in the determination of wages, hours and conditions of employment through voluntary collective bargaining, mediation, fact-finding, arbitration or otherwise between the parties, in the public service or in private employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 12. Orders of the arbitration panel shall be reviewable by the circuit court for the county in which the dispute arose or in which a majority of the affected employees reside, but only for reasons that the arbitration panel was without or exceeded its jurisdiction; the order is unsupported by competent, material and substantial evidence on the whole record; or the order was procured by fraud, collusion or other similar and unlawful means. The pendency of such proceeding for review shall not automatically stay the order of the arbitration panel.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a The city also raises statutory issues concerning the fire fighters' arbitration. The city's arguments were adequately addressed by Judge O'Hara in the Court of Appeals and require no additional comment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a PERA does provide for mediation, MCLA 423.207(2); MSA 17.455(7)(2), but the parties are not bound to reach an agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a See, Grosse Pointe Park Fire Fighters Ass'n v Grosse Pointe Park, 303 Mich 405; 6 NW2d 725 (1942); Escanaba v Labor Mediation Board, 19 Mich App 273; 172 NW2d 836; 40 ALR3d 717 (1969); Detroit Board of Fire Commissioners v Detroit Fire Fighters Ass'n; 22 Mich App 137; 177 NW2d 216 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a The Governor's Advisory Committee on Public Employee Relations stated at pp 8, 9 of its report:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(4) In the case of police and firefighters all the procedures specified in (3) above (fact finding and mediation) should be applicable, except that the Case Panel's recommendations, with such modifications as it deems desirable after the 'show cause' hearing, should be made binding. This procedure is suggested as one to be undertaken, as a matter of public policy, on an experimental basis, for a three-year period. We believe it would be in the public interest to experiment with compulsory determination in this limited area in order the better, ultimately, to be able to assess its virtues and deficiencies as a method of dispute settlement in the public sector. (We assume that a determination of any issue by the Case Panel would be subject to judicial review of any claim that the determination would require action to be taken by the employer which, by virtue of some legal restriction, it is unable to take.)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a Indeed, the 1972 amendments to Act 312 have made the arbitrator's duty even more circumscribed. When resolving a disputed economic matter the arbitrator must select the \"last best offer\" that more closely reflects the guidelines found in § 9:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"At or before the Conclusion of the hearing held pursuant to section 6, the arbitration panel shall identify the economic issues in dispute, and direct each of the parties to submit * * * to the arbitration panel and to each other its last offer of settlement on each economic issue. * * * As to each economic issue, the arbitration panel shall adopt the last offer of settlement which, in the opinion of the arbitration panel, more nearly complies with the applicable factors prescribed in section 9.\" MCLA 423.238; MSA 17.455(38).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a \"The legislature may enact laws providing for the resolution of disputes concerning public employees, except those in the state classified civil service.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a See Local Union No 876, International Brotherhood of Electrical Workers v State Labor Mediation Board, 294 Mich 629, 634-638; 293 NW 809 (1940); Detroit v Division 26 of the Amalgamated Association of Street, Electric Railway \u0026 Motor Coach Employees of America, 332 Mich 237, 253; 51 NW2d 228 (1952); Board of Control of Eastern Michigan University v Labor Mediation Board, 384 Mich 561, 566; 184 NW2d 921 (1971); Grosse Pointe Park Fire Fighters Ass'n v Grosse Pointe Park, 303 Mich 405; 6 NW2d 725 (1942).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a See Detroit Police Officers Ass'n v Detroit, 391 Mich 44, 58, 67; 214 NW2d 803 (1974). Cf. National Labor Relations Board v Jones \u0026 Laughlin Steel Corp, 301 U.S. 1; 57 S Ct 615; 81 L Ed 893; 108 ALR 1352 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a \"The powers of government are divided into three branches; legislative, executive and judicial. No person exercising powers of one branch shall exercise powers properly belonging to another branch except as expressly provided in this constitution.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a \"The legislative power of the State of Michigan is vested in a senate and a house of representatives.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a In addition, two Courts have reviewed the power of a municipality to provide for binding arbitration through its city charter. In Washington ex rel Everett Fire Fighters Local No 350 v Johnson, 46 Wash 2d 114; 278 P2d 662 (1955), the Supreme Court of Washington struck down a local charter amendment allowing the city to arbitrate unresolved contract provisions with the fire department. The Court held that \"he charter amendment complained of contravenes and makes ineffective the state legislative act vesting the legislative powers, together with corresponding responsibilities, in the city council.\" 46 Wash 2d 114, 121.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMore recently, the California Supreme Court summarily dismissed in a footnote the argument that a local provision for binding arbitration constituted an unlawful delegation of legislative power to private arbitrators. Fire Fighters Union, Local 1186 v Vallejo, 12 Cal 3d 608; 526 P2d 971; 116 Cal Rptr 507 (1974), n 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13a The Legislature has proceeded with deliberate caution in charting the path of Act 312 compulsory arbitration. As originally enacted, the act, in accordance with the recommendations of the Governor's Committee (fn 6 (supra) ), carried a 1972 expiration date. In 1972 the Legislature reconsidered the act and with amendments extended its effective date until June 30, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1b MCLA 423.231 et seq.; MSA 17.455(31) et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2b Not only has compulsory arbitration been successful in virtually eliminating police and fire department strikes, but it apparently has not resulted in a deterioration of the collective bargaining process. In 1972-1973, at least three-quarters of such cases were resolved by the parties without going to arbitration. Kaye, Impasse Resolution Mechanisms and Teacher Strikes, 7 U of Mich J L Reform 575, 587, fn 81 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3b E.g., Summers, Public Employee Bargaining: A Political Perspective, 83 Yale LJ 1156 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4b The act itself contains a statement of public policy reflecting the legislative desire to accommodate the needs of both government and employees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is the public policy of this state that in public police and fire departments, where the right of employees to strike is by law prohibited, it is requisite to the high morale of such employees and the efficient operation of such departments to afford an alternate, expeditious, effective and binding procedure for the resolution of disputes, and to that end the provisions of this act, providing for compulsory arbitration, shall be liberally construed.\" MCLA 423.231; MSA 17.455(31).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5b \"he employer shall choose a delegate and the employees' designated or selected exclusive collective bargaining representative, or if none, their previously designated representative in the prior mediation and fact-finding procedures, shall choose a delegate to a panel of arbitration as provided in this act. The employer and employees shall forthwith advise the other and the mediation board of their selections.\" MCLA 423.234; MSA 17.455(34).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Within 5 days thereafter, or within such further additional periods to which they may agree, the delegates shall designate an impartial, competent and reputable person to act as an arbitrator, hereafter called the arbitrator or chairman of the panel of arbitration, and with them to constitute an arbitration panel to further consider and order a settlement of all matters. Upon their failure to agree upon and appoint the arbitrator within such time, or mutually extended time, either of them may request the chairman of the state labor mediation board to appoint the arbitrator, and the chairman of the state mediation board shall appoint, in not more than 7 days, an impartial, competent and reputable citizen as the arbitrator.\" MCLA 423.235; MSA 17.455(35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6b \"Where there is no agreement between the parties, or where there is an agreement but the parties have begun negotiations or Discussions looking to a new agreement or amendment of the existing agreement, and wage rates or other conditions of employment under the proposed new or amended agreement are in dispute, the arbitration panel shall base its findings, opinions and order upon the following factors, as applicable:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) The lawful authority of the employer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Stipulations of the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) The interests and welfare of the public and the financial ability of the unit of government to meet those costs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Comparison of the wages, hours and conditions of employment of the employees involved in the arbitration proceeding with the wages, hours and conditions of employment of other employees performing similar services and with other employees generally:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) In public employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(ii) In private employment in comparable communities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(e) The average consumer prices for goods and services, commonly known as the cost of living.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(f) The overall compensation presently received by the employees, including direct wage compensation, vacations, holidays and other excused time, insurance and pensions, medical and hospitalization benefits, the continuity and stability of employment, and all other benefits received.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(g) Changes in any of the foregoing circumstances during the pendency of the arbitration proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(h) Such other factors, not confined to the foregoing, which are normally or traditionally taken into consideration in the determination of wages, hours and conditions of employment through voluntary collective bargaining, mediation, fact-finding, arbitration or otherwise between the parties, in the public service or in private employment.\" MCLA 423.239; MSA 17.455(39).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7b \"At or before the Conclusion of the hearing held pursuant to section 6, the arbitration panel shall identify the economic issues in dispute, and direct each of the parties to submit, within such time limit as the panel shall prescribe, to the arbitration panel and to each other its last offer of settlement on each economic issue. The determination of the arbitration panel as to the issues in dispute and as to which of these issues are economic shall be conclusive. The arbitration panel, within 30 days after the Conclusion of the hearing, or such further additional periods to which the parties may agree, shall make written findings of fact and promulgate a written opinion and order upon the issues presented to it and upon the record made before it, and shall mail or otherwise deliver a true copy thereof to the parties and their representatives and to the employment relations commission. As to each economic issue, the arbitration panel shall adopt the last offer of settlement which, in the opinion of the arbitration panel, more nearly complies with the applicable factors prescribed in section 9. The findings, opinions and order as to all other issues shall be based upon the applicable factors prescribed in section 9. This section as amended shall be applicable only to arbitration proceedings initiated under section 3 on or after January 1, 1973.\" MCLA 423.238; MSA 17.455(38).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis provision is not applicable to the instant litigation as that occurred in 1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8b \"Orders of the arbitration panel shall be reviewable by the circuit court for the county in which the dispute arose or in which a majority of the affected employees reside, but only for reasons that the arbitration panel was without or exceeded its jurisdiction; the order is unsupported by competent, material and substantial evidence on the whole record; or the order was procured by fraud, collusion or other similar and unlawful means. The pendency of such proceeding for review shall not automatically stay the order of the arbitration panel.\" MCLA 423.242; MSA 17.455(42).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9b As of 1974, apparently 13 states were experimenting with forms of legislated interest arbitration in public sector employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"These states are Alaska, Maine, Michigan, Minnesota, Nebraska, Nevada, Oklahoma, Pennsylvania, Rhode Island, South Dakota, Vermont, Wisconsin, and Wyoming. Alaska Stat. § 23.40.200 (1972); Me. Rev. Stat. Ann. tit. 26, § 965 (Supp. 1973); Mich. Comp. Laws Ann. § 423.231 (Supp. 1973); Minn. Stat. Ann. § 179.72 (Supp. 1974); Neb. Rev. Stat. § 48-810 (1972); Nev. Rev. Stat. § 288.200 (1973); Okla. Stat. tit. 11, § 548.1 (1973); Pa. Stat. Ann. tit. 43 § 1101.101 (1973); R.I. Gen. Laws Ann. §§ 28-9.1-2, 28-9.2-2 (1969); S.D. Compiled Laws Ann. § 9-14A-1 (1973); Vt. Stat. Ann. tit. 21, § 1721 (1973); Wis. Stat. Ann. § 111.70(4)(jm) (Supp. 1973); Wyo. Stat. Ann. § 27-265 (1967).\" 7 U of Mich J L Reform 575, 585-586, fn 73 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10b Two Courts have divided on whether, in the absence of such a statute, a municipality may provide for binding arbitration through its city charter. See Washington ex rel Everett Fire Fighters Local No 350 v Johnson, 46 Wash 2d 114; 278 P2d 662 (1955) (city council had no legal right to abdicate its legislative responsibility to fix municipal wages); contra, Fire Fighters Union, Local 1186 v Vallejo, 12 Cal 3d 608; 526 P2d 971; 116 Cal Rptr 507 (1974) (citing Wyoming and Rhode Island decisions, (infra), found no unlawful delegation as long as arbitrators did not exceed charter provisions). See, also, Fellows v LaTronica, 151 Colo 300; 377 P2d 547 (1962) (illegal delegation in absence of both statute and charter provision permitting it.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11b The Court considered both aspects of the delegation problem. The delegation was valid both because the Pennsylvania Constitution specifically provided for it, and because, despite the lack of other standards, the mandate that arbitrators act \"in accordance with law\" was sufficient in view of the legislative policy to protect the public from strikes by policemen and firemen. Further, the Court said,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"To require a more explicit statement of legislative policy in a statute calling for labor arbitration would be sheer folly. The great advantage of arbitration is, after all, the ability of the arbitrators to deal with each case on its own merits in order to arrive at a compromise which is fair to both parties.\" 435 Pa 183, 189; 255 A2d 560, 563.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12b \"Upon full consideration we are persuaded that where the occupant of a particular office is vested by law with a portion of the sovereignty of the state and is authorized to exercise functions either of an executive, legislative, or judicial character, the primary indispensable element for the establishment of its character as a public office is present. As a secondary consideration, it is our opinion that another important factor is whether or not the incumbent of the office is free to exercise the powers vested in it free of the supervision or control of others, other than to conform to the provisions of law creating the office. See Francis v Iowa Employment Security Commission, 250 Iowa 1300; 93 NW2d 733.\" 106 RI 109, 116; 256 A2d 206, 210.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlso significant to that Court's definition of arbitrators as public officers was their fixed term and specific duties, as well as their ability to perform legislative functions without supervision. 106 RI 109, 116; 256 A2d 206, 210.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13b \"The legislature in § 28-9.1-10 sets out specifically a number of comprehensive limitations on the actions of a board of arbitration when exercising the power delegated. They require that certain factors '* * * be given weight by the arbitrators in arriving at a decision * * *.' These factors include specifically a comparison of wage rates or hourly conditions of employment of the fire department in question with prevailing wage rates or hourly conditions of employment of skilled employees of the building trades and industry in the local operating area. They require also that consideration and weight be given to the wage rates or hourly conditions of employment of the fire department in question in comparison to similar wage rates or hourly conditions of employment of other cities or towns of comparable size. They require that weight be given to the interest and welfare of the public and specifically spell out that weight be given to the hazards of the employment and physical and educational qualifications of the employees and the job training and skills. In our opinion, these standards clearly are sufficient to meet the constitutional requirement that the delegated power be confined by reasonable norms or standards.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"We would also direct attention to the obvious fact that these standards serve a dual purpose. They not only operate to direct or limit the action of the recipients of such delegated power, but they are standards pursuant to which on judicial review a court may determine whether the action taken by the recipients of such powers was capricious, arbitrary, or in excess of the delegated authority. In our opinion, this is an important consideration in determining the sufficiency of the standards prescribed in the legislation. In this case it is our opinion that they are sufficient for such purpose.\" 106 RI 109, 117-118; 256 A2d 206, 211.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14b \"Here we are of the opinion that the Legislature, mindful of the denial to municipal employees of such economic weapons as strikes and work stoppages which are available to employees in private employment, has sought to avoid the disruptive feelings of resentment and bitterness which may result if the governmental employee may look only to the government for redress of his grievances.\" 304 A2d 387, 398.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is interesting to note that the Maine Court found the reasoning of the Rhode Island Court to be \"tautological\". 304 A2d 387, 397.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15b This is apparently the only Court concerned with the method of appointment of arbitrators up to the present time. Of the statutes considered, one writer reports that all use a tripartite system, with the power to select a chairman vested, in the event the parties cannot agree, in different authorities. In Rhode Island and Wyoming, the selection is made by a Judge and in Nebraska by an executive department official. The chairman is selected from a list supplied by the American Arbitration Association in Maine and Pennsylvania. Howlett, Contract Negotiation Arbitration in the Public Sector, 42 U Cincinnati L Rev 47, 66 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16b \"We find that the office of deputy register of deeds was thus created by the legislature; that in certain contingencies he is to act as register of deeds, which office is without question beneficial to the public; that the duties and powers exercised are derived directly from legislative direction and not from the orders of the register; that it is a subordinate office created by the legislature; that while the tenure of the particular incumbent is at the pleasure of the register, the office cannot be abolished except by legislative action; and that he is required to take the constitutional oath. The deputy register of deeds is in the position of acting at times designated as the alter ego of the register of deeds. In addition, we have held that deputy officers may execute documents in their own names with the same official force and effect as if done in the name of the principal.\" 342 Mich 548, 552-553.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17b OAG, 1961-1962, No 3594, p 205 (November 6, 1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18b \"The position, however, does not possess the characteristics of permanency and continuity typical of public office. It is merely a temporary or occasional position. When the report is filed, no duties remain to be performed unless the report is referred back. The provisions of Act 352, P.A. 1925, cited above, seem clearly to require separate appointment of commissioners for each situation. There is no assurance that a commissioner appointed for one case will ever be appointed for another. A court commissioner under Act 352 is, therefore, not a public officer.\" OAG 1963-1964, No 4370, pp 482, 483 (October 8, 1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18c Penn School Dist No 7 v Lewis Cass Intermediate School Dist Board of Education, 14 Mich App 109; 165 NW2d 464 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19b Further, as the Biddeford Court recognized, (supra) , note 14, it may be anomalous for a group involved in a conflict with government to be forced to seek assistance only from government.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20b Additionally, the statute includes sufficient other safeguards to make it inappropriate that it stand or fall on the length of time an individual spends on the job.\u003c/span\u003e\n\n",
    "body_length": 169970,
    "citedas": [
      "231 N.W.2d 226",
      "394 Mich. 229"
    ],
    "attorneys": "Rothe, Marston, Mazey, Sachs, O'Connell, Nunn \u0026 Fried (by Theodore Sachs and Ronald R. Helveston), for plaintiff Dearborn Fire Fighters Union Local No. 412, Iaff. Winston L. Livingston and J. Douglas Korney, for plaintiff Police Officers Association of Dearborn. Joseph Burtell and Eugene A. Forbes, for defendant. Amicus Curiae: Frank J. Kelley, Attorney General, Robert A. Derengoski, Solicitor General, and Francis W. Edwards, Assistant Attorney General, for the Employment Relations Commission. Louis C. Andrews, Jr., Albin J. Schinderle, Duane Dunick, Peter Houk, and Hartman, Beier, Howlett, McConnell \u0026 Googasian, for the Michigan Association of Municipal Attorneys.",
    "category": [
      "243"
    ],
    "judges": "Levin, J. T. G. Kavanagh, C. J., concurred with Levin, J. M. S. Coleman, J. Williams, J. (upholding constitutionality on case facts). T. G. Kavanagh, C. J. (concurring). Swainson, J. W. Fitzgerald, and Lindemer, JJ., took no part in the decision of this case.",
    "citation_count": 2
  }
}
