{
  "id": "Xq4WS2YBTlTomsSBBWa3",
  "document": {
    "title": "05/03/85 STATE IDAHO v. GENE FRANCIS STUART",
    "full_title": "STATE OF IDAHO v. GENE FRANCIS STUART",
    "jurisdiction": "Idaho Supreme Court",
    "date": "1985-05-03T00:00:00.000Z",
    "docket": "No. 14865",
    "body": "Appellant was convicted of first degree murder by torture for the beating death of a three year old boy, the son of his live-in girlfriend. He was sentenced to death. He appeals both his conviction and his sentence. We affirm.\n\nAppellant and Kathy Miller, the mother of the deceased victim, Robert Miller, met in August, 1980, began dating, and subsequently moved in together on September 20, 1980. Robert Miller was at that time two years old, and he lived with appellant and his mother. Appellant then assumed control over Robert. At that time the child was not yet toilet trained, and much of the punishment imposed upon the child dealt with this problem.\n\nAppellant was a very dominant person and often critical of others in his presence. He was a strict disciplinarian who required almost adult behavior from Robert over the course of their relationship. Appellant and Kathy Miller often argued about his treatment of Robert, and Ms. Miller moved out of the premises several times after her child had been bruised and beaten by the defendant.\n\nIn the spring and summer of 1981, appellant assumed primary control over Robert, feeding, clothing and caring for him. Robert often accompanied appellant to his place of business.\n\nIn late summer and early fall of 1981, appellant and Ms. Miller began sharing the management duties at a small tavern near Orofino. Appellant and Ms. Miller would work separate shifts, with Miller working during the day and appellant working at night. Each would take care of Robert while the other was working.\n\nIn October of 1980, there suddenly appeared bruises and blisters on Robert's backside. In November of 1980, Robert had bruises across his forehead and a black eye. Later in November, Robert sustained a torn and cut ear. Various explanations were given by appellant for these injuries, including a spanking with a stick for the backside bruises, and a tricycle collision for the black eye. After the torn ear appeared, Ms. Miller moved out because of the injuries to her son. Appellant later apologized and convinced Miller to move\n\nback in. Ms. Miller apparently moved in and out several times, at least some of which moves resulted from the force used in Robert's discipline.\n\nIn March Robert's bottom, up to the middle of his back, was covered with bruises, which the defendant claimed resulted from a fall in the shower. In April, Robert had bruises on his chin. Robert had little round bruises on his chest in November of 1980 and September of 1981. These bruises appeared because of appellant's habit of jabbing him in the chest with a finger while scolding him.\n\nAppellant had other unique requirements. He attempted to teach Robert, a two year old, table manners, requiring that Robert learn to properly use his fork (pick it up with the left hand, transfer it to the right hand, etc.) and use his napkin to wipe his mouth after every bite. If Robert failed to perform correctly, he was often made to stand in a corner. Other requirements of Robert were that he look only at his plate, and replace his fork on the table after every bite. Appellant demanded these movements of Robert while failing to follow them himself. At one time appellant hit Robert on the hand with his fork when he picked up the fork with the wrong hand.\n\nThere were two behaviors exhibited by Robert that appellant punished in particular. One was \"boobing\", roughly translated as pouting or sulking. The other was wetting his pants. After Robert would wet his pants or exhibit any other unacceptable behavior, he would be given a cold shower from which he would emerge shaking with cold and blue lips.\n\nIn May of 1981, Robert's penis was darkly bruised on the top and bottom. There was no explanation for this injury. Also in May Robert's bottom and head were bruised and scratched. Appellant explained that Robert fell because the toilet seat broke when he sat on it. Also in May, a silver dollar size patch of hair was discovered as missing from Robert's head. In early spring Robert complained of a hurt left arm, although no visible marks were seen.\n\nOn September 19, 1981, Ms. Miller was working the day shift at the tavern with appellant caring for Robert. Appellant gave his version of the events of that day at trial -- the only version available, since appellant and Robert were alone during the day. Robert spent two hours at a friend's house, where appellant picked him up and took him home. He attempted to feed him lunch, but Robert refused to eat. According to appellant, he then began poking Robert in the chest as punishment. He then struck him in the chest with his fist, swatted him and directed him to eat. Robert then proceeded to eat with no complaints. After Robert finished eating, he was put down for a nap. According to appellant he later went to check on him and found that Robert had vomited on the bed. Appellant then bathed Robert and put him back down. However, he then noticed that Robert's breathing was unusual. Appellant testified that at this point Robert was still alive. He attempted mouth-to-mouth resuscitation, and Robert again vomited. Appellant then purportedly rushed Robert to the hospital. Robert was dead on arrival. Emergency room personnel noted that Robert's body was cold, indicating the possibility that he had been dead for longer than appellant's testimony would indicate.\n\nAn autopsy was conducted upon Robert, which disclosed the cause of death as internal hemorrhaging caused by the rupture of the liver. The pathologist felt that this rupture was caused by more than one blow; however, he admitted that a well placed single blow could have caused the rupture. The pathologist also testified that death would have occurred between one and one and a half hours after such an injury, contradicting appellant's testimony concerning the time frame of events of the afternoon. A number of bruises were found on the victim's body, both internal and external. These bruises were of differing ages. In addition, Robert had suffered a subdural hematoma in the head region, which the pathologist testified would have been caused only by a fair amount of blunt trauma to the head. Also, X-rays taken of\n\nRobert indicated that he had suffered a broken left arm several months before the date of death.\n\nAppellant was arrested and charged with first degree murder by torture. Because of extensive publicity, he asked for a change of venue from the Orofino area to a venue outside the circulation area of the Lewiston Morning Tribune, the paper responsible for most of the publicity. The trial court later agreed to change venue, but instead of changing it outside the circulation of the Lewiston Morning Tribune, the trial Judge changed venue to Moscow. In addition, the trial court refused to sequester the jury at trial.\n\nAppellant filed a motion in limine prior to trial in an attempt to exclude possible evidence to be presented by appellant's former wives and girlfriends indicating appellant's mistreatment of them. All of those witnesses were eventually allowed to testify, and their testimony indicated that appellant had inflicted continuous physical abuse on them as he had upon Robert Miller. All of this testimony allegedly supported the prosecution's theory that appellant's treatment of Robert did not indicate an intent to discipline, but rather indicated an intent to control the victim and inflict pain in order to cause suffering, the intent which is necessary under the murder by torture statutes.\n\nAfter a jury trial, appellant was found guilty of murder by torture in the first degree. After an aggravation/mitigation hearing, and the submission of findings of the trial court in considering the death penalty, appellant was sentenced to death.\n\nAppellant asserts numerous reasons why this Court should overturn his conviction, his sentence, or both. He alleges that (1) there was insufficient evidence to warrant a jury instruction and verdict based on first degree murder by torture, or that a jury instruction on second degree murder by torture should have been given; (2) the trial court erred in denying the motion in limine, and erred in failing to rule on the motion prior to trial; (3) the trial court erred in moving the venue of the trial to a site still within the circulation area of the source of prejudicial pretrial publicity; (4) he was denied his constitutional right to a speedy trial; (5) his sentence was unconstitutionally imposed either because of the vagueness of the aggravating circumstances relied upon or the failure to use a jury in the sentencing process; and (6) the sentence imposed in this case was disproportionate. We will consider the alleged errors in the above order.\n\nI\n\nA\n\nThe first question presented by appellant is: was there sufficient evidence to warrant a jury instruction and conviction on a murder by torture charge? Basically, appellant argues that the facts of this case do not rise to the level of murder by torture as this type of murder should be defined. We begin our analysis of this question by examining Idaho statutory law outlining the offense of which appellant was convicted.\n\nI.C. § 18-4001 defines murder and includes a death caused by the intentional application of torture. The statute also defines torture in two different ways:\n\n\" 18-4001. Murder defined. -- Murder is . . . the intentional application of torture to a human being, which results in the death of a human being. Torture is the intentional infliction of extreme and prolonged pain with the intent to cause suffering. It shall also be torture to inflict on a human being extreme and prolonged acts of brutality irrespective of proof of intent to cause suffering. The death of a human being caused by such torture is murder irrespective of proof of specific intent to kill; torture causing death shall be deemed the equivalent of intent to kill.\"\n\nI.C. § 18-4003 places murder by torture, as defined in I.C. § 18-4001, in the first degree murder category:\n\n\" 18-4003. Degrees of murder. -- (a) All murder which is perpetrated by means of . . . torture, when torture is inflicted with the intent to cause suffering, to execute\n\nvengeance, to extort something from the victim, or to satisfy some sadistic inclination, . . . is murder of the first degree. . . .\"\n\nOur extensive research has failed to uncover any Idaho case law dealing with the charge of murder by torture. Thus, with the statutory definition of the crime in mind, we turn to cases from other states with substantially similar statutes to examine further that category of crime which could be considered murder by torture.\n\nMost of the cases considering the murder by torture charge come out of California. Those cases indicate that initially there must be an intent on the part of the defendant that the victim suffer. People v. Caldwell, 43 Cal.2d 864, 279 P.2d 539 (1955). This is also the intent required by our statute. See I.C. § 18-4001. In proving a murder by torture charge, the key item of proof which must be shown by the prosecution is the state of mind of the defendant. People v. Steger, 16 Cal.3d 539, 128 Cal.Rptr. 161, 546 P.2d 665 (1976). However, the intent and state of mind of a defendant may be established by inferences, including inferences drawn from the condition of the decedent's body, State v. Gonzalez, 111 Ariz. 38, 523 P.2d 66 (1974); People v. Wylie, 18 Cal.3d 162, 133 Cal.Rptr. 135, 554 P.2d 881 (1976), the admissions of a defendant as to his or her treatment of the victim, People v. Lawhon, 220 Cal.App.2d 311, 33 Cal.Rptr. 718 (1963), and the acts and circumstances surrounding the killing, People v. Steger, supra. A defendant need not have intended that death occur. People v. Demond, 59 Cal.App.3d 574, 130 Cal.Rptr. 590 (1976); People v. Ross, 92 Cal.App.3d 391, 154 Cal.Rptr. 783 (1979). Many of the cases also require that a specific purpose behind the torturous conduct be shown, generally an untoward purpose such as revenge, persuasion, or extortion. People v. Lawhon, supra. The untoward purpose mentioned can also be the infliction of pain for personal gain or sadistic satisfaction. People v. Steger, supra; People v. Lawhon, supra. It was the latter which the trial court found in this case.\n\nAn examination of the cases themselves, and the factual situations involved, is also helpful in determining which situations involve a first degree murder by torture. In People v. Demond, supra, we find a factual situation somewhat similar to that involved in the present case. In Demond, the defendant was living with his girlfriend and her two children. One of the children was a three year old who died only two months after defendant moved in with the family. An examination of the child's body showed bumps and bruises of varying ages all over the body, two black eyes, bruises on the face, a skull fracture, an older fracture of one arm bone, and abdominal injuries. The court in Demond considered the circumstances surrounding the killing as well as the condition of the victim's body. They found that the evidence supported the inference that the defendant had a cold blooded intent to inflict pain for personal gain or satisfaction. They found the defendant's actions strongly suggestive of sadistic impulses. The court also considered the fact that the defendant was in control of his behavior and knew his actions would cause pain, but there remained no showing of heat of passion. From this evidence, the court concluded that a first degree murder by torture conviction was sustained by the evidence.\n\nIn People v. Lawhon, supra, the defendant was charged with the murder of his eight month old daughter. The child died of peritonitis, which was caused by the perforation of a bowel, which in turn was caused when the defendant hit the child in the stomach with his fists. Several months prior to the injury which caused death, the baby had suffered a subdural hemorrhage in the brain. There was also evidence of older healing rib fractures. The question before the court was whether there was sufficient evidence to support a first degree murder by torture conviction. The court ruled that intent could be inferred from the condition of the decedent's body and the admissions of the defendant that he hit the decedent. Also, although the court would require an untoward purpose for the torture, it ruled that the purpose\n\ncould be to satisfy some sadistic impulse of the defendant. Thus, the court ruled that there was more than sufficient evidence to support the conviction.\n\nIn People v. Butler, 205 Cal.App.2d 437, 23 Cal.Rptr. 118 (1962), the defendant was accused of murdering his wife's four year old daughter. At the time of her death, 70-80% of the girl's body was covered with bruises. Doctors also observed hundreds of lacerations on her body. The defendant admitted that he used a bullwhip to discipline the child. The court ruled that intent may be inferred from the condition of the body. In this case, the court ruled that the defendant's brutal treatment of the victim over a period of several months led inevitably to the Conclusion that the defendant intended to cause pain and suffering. Thus, a conviction of first degree murder by torture was justified.[Footnote 1] See also State v. Kountz, 108 Ariz. 459, 501 P.2d 931 (1972) (death of three year old from brain concussion, many bruises on body, more than sufficient evidence to support first degree murder conviction); People v. Aeschlimann, 28 Cal.App.3d 460, 104 Cal.Rptr. 689 (1972) (mother and father both observed to have beaten eleven month old severely before its death, no error in instructing the jury on first degree murder by torture); People v. Seastone, 3 Cal.App.3d 60, 82 Cal.Rptr. 907 (1969) (father committed a \"brutal and sadistic killing\" of his nine and one-half month old son, court upheld first degree murder by torture as one of theories of conviction); People v. Misquez, 152 Cal.App.2d 471, 313 P.2d 206 (1957) (two and one-half year old girl died from beatings inflicted by mother's live-in boyfriend, \"brutal and revolting manner\" of killing indicates intent to cause cruel pain and suffering, sufficient evidence to support first degree murder by torture conviction).\n\nWe now turn to the facts of this case. The evidence before us, and before the trial court, indicates that the victim in this case suffered numerous injuries at the hands of the defendant over a one year period. Bruises would appear upon the child's body with little or no explanation for their appearance. Appellant demanded behavior out of the child that was nearly impossible for him to achieve, and then \"punished\" him when he did not achieve it. Evidence presented as to appellant's relationships with others close to him dispelled any possible Conclusion that appellant's treatment of the victim was solely for purposes of discipline. From this evidence of brutal treatment of the victim and appellant's sadistic treatment of others, we conclude that there was more than enough evidence presented to justify a murder by torture instruction to the jury. In addition, there was substantial competent evidence to support the verdict.\n\nB.\n\nAppellant also argues that the statute quoted above, I.C. § 18-4001, and I.C. § 18-4003, should be read to contemplate the existence of a second degree murder by torture offense, and thus the trial court should have instructed the jury on second degree murder pursuant to its duty to instruct on lesser included offenses.[Footnote 2] We note that a second degree murder instruction was given, but a second degree murder by torture instruction was not requested or\n\ngiven. In addition, we note that appellant's counsel accepted the instructions as given by the court, and noted that he had no objection to the instructions the court intended to give. Thus, any error in failing to instruct on this charge, if indeed one exists, was invited error and will not be considered on appeal. State v. Lopez, 100 Idaho 99, 593 P.2d 1003 (1979).\n\nII\n\nAppellant alleges error in the trial court's denial of a motion in limine seeking to forbid introduction of evidence concerning appellant's relationships with former wives and girlfriends, and also argues prejudicial error in the trial court's failure to rule on the motion in limine prior to trial.\n\nA.\n\nTo obtain a first degree murder by torture conviction, the state is required to prove that the defendant had an intent to cause pain and suffering. In this case, appellant's major defense was that his actions only constituted an overabundance of discipline, without the intent to cause pain and suffering. The state's only chance to refute that defense, other than by showing the severity of the treatment of the victim, would be to introduce other evidence which might tend to show that appellant's treatment of this victim was for purposes other than discipline. In this case, the state presented an abundance of evidence concerning appellant's abuse of other women and their minor children with whom he had lived over a period of ten years. Appellant's treatment of these other persons was substantially similar to appellant's treatment of the victim. Thus, this evidence was relevant to show that appellant had an intent other than that of discipline in his treatment of the victim because he treated other persons close to him in a similar manner. It was also relevant to show appellant's sadistic nature, thus supporting the state's theory that appellant's treatment of the victim was torture, inflicted to satisfy the sadistic inclinations of appellant.\n\nAppellant argues that allowing proof of his relationships with women was error, in that this testimony constituted testimony of prior bad acts of a defendant, which is generally inadmissible. While this evidence is generally inadmissible, if it is introduced to prove certain enumerated elements, such as motive, it is admissible. See State v. Needs, 99 Idaho 883, 591 P.2d 130 (1979); State v. Wrenn, 99 Idaho 506, 584 P.2d 1231 (1978). One element of criminal conduct that can be proved by evidence of prior bad acts is the intent of the defendant. In this case the evidence presented of appellant's prior relationships was introduced for the specific purpose of showing sadistic intent and frame of mind of appellant at the time of the commission of the acts directed toward the victim. Thus, the evidence was admissible under our rule.\n\nIn this case, appellant also argues that the prejudicial effect of this evidence outweighs its relevancy, and thus it should have been excluded. In cases where evidence is claimed to be highly prejudicial, a balancing test is conducted where the probative value of the evidence is balanced against the prejudice to the defendant. Here, as we have already discussed, the evidence was relevant to show the intent of appellant in his treatment of the victim. See State v. Sanchez, 94 Idaho 125, 483 P.2d 173 (1971) (in child beating case, evidence of bad acts of defendant, in form of beating of other children, relevant to show defendant's attitude toward children). The evidence tended to support the existence of the intent to cause pain and suffering. The inclusion or exclusion of this type of evidence is a matter for the exercise of the sound discretion of the trial court. State v. Sharp, 101 Idaho 498, 616 P.2d 1034 (1980). The trial court in this case conducted a close analysis of the admissibility of this evidence. The trial court's comments are helpful in examining the issue to determine whether an abuse of discretion occurred.\n\n\"THE COURT: . . . In this particular case, the Prosecutor must convince the\n\ntrier of the fact that your client was engaged in a course of torture. And produced this child's death, not necessarily intending death but only intending torture. . . . And so this case, to a great extent, is going to turn upon what the jury thinks was going on in your client's mind during that interval when he dealt with this child. And as you yourself have said, the surface evidence indicates an effort to discipline. However, the evidence before me is such that that allegation or implication, I should say, of discipline is very questionable. . . . I think that the intent is not clear at this time. If I felt the intent was overwhelmingly clear in either direction -- in other words, that either the Prosecutor had failed or had totally succeeded to demonstrate his case at this point I would probably be very hesitant to allow evidence of past behavior which will in fact be prejudicial to this case. But I feel in fact what we have is an unclear situation and I think that the evidence of these other women in your client's life does bear directly on the underlying state of mind he has while he's acting with respect to this boy.\n\n\"I am convinced from reading the preliminary hearing transcript that the Prosecutor's assertion that he feels he can prove to a trier of the fact that your client simply needs someone to torture, something like a whipping board, for his own pleasure is actually something that he may in fact be able to prove beyond a reasonable doubt. . . . And I think the Prosecutor . . . should have the opportunity to prove the state of mind he alleges your client to have and that in fact it became this child's role to do the suffering for the benefit of your client. . . . I think he has the evidence that might allow the trier of the fact to conclude that beyond a reasonable doubt that that is what's going on with your client. \". . . It is unfortunate for your client that his reprehensible acts show the status of the mind in dealing with this child. And as prejudicial as they will be, I think giving the status of the law on Prosecutor's proving death by torture that the Prosecutor does have to show very clearly this was not a discipline situation. That the intent was in fact to torture. . . . So as reluctant as I am to go into these matters and as much as I understand they will lengthen these proceedings as well as possibly prejudice the jury against your client, I think I would in effect be depriving the State of highly relevant evidence which is so relevant that it overcomes any prejudicial effect it might have in terms of its being admissible.\"\n\nWe see no abuse of discretion in the trial court's handling of the admission of this evidence.\n\nB.\n\nAppellant also argues that the trial court erred in failing to rule before trial on the motion in limine. Although there has been no showing of how appellant was prejudiced by this failure, we have nevertheless examined the record to determine if the trial court's handling of this motion was proper. The trial court indicated his ruling on the motion in limine in a hearing on July 15, 1982.\n\n\"THE COURT: . . . It's not possible for me to pick and choose particular items in that transcript that I would not allow in the trial. It's only possible for me to give the defense and the State an accurate impression of what my likely behavior will be at the trial in ruling on the evidentiary questions that will surely come up. . . . But I am prepared to tell you that, first, I see the Prosecutor having a burden to demonstrate the motive that your client had in any actions the Prosecutor is going to prove that he took with respect to beating this child. And that in proving that motive it is possible that all of the Preliminary Hearing evidence may prove relevant and admissible. . . . I'm going to require the Prosecutor to first demonstrate that a crime of some kind has been committed. That justifies the trial at all. And, then, require the Prosecutor to try and demonstrate\n\na motive for the behavior of your client. As he begins to get into the evidence that relates to the motive, some of which comes just from the acts for which your client is specifically charged, then, it becomes possible for me and only then to determine how much additional evidence he has a right to present either to overcome any testimony you may produce, which places motive in question, or to overcome or meet the burden he has to prove the motive beyond a reasonable doubt. Because the intent is obviously a crucial element of this torture allegation.\"\n\nAdmission of this evidence was within the discretion of the trial court, and thus it was also within the discretion of the trial court to indicate its decision in a ruling prior to trial, or during trial when the evidence was introduced. We see no abuse of discretion in the trial court's handling of this motion, and in fact approve of the way the motion was handled. Both parties were specifically informed of the strict requirements imposed by the trial court for introduction of this evidence. The prosecution was held to a strict order of proof, and the defense was notified that if the strict order of proof was followed the trial court felt that at least most of the evidence would be admissible because its relevance would outweigh the prejudicial effect on the defendant. There was no error.\n\nIII\n\nIn this case appellant argues that there was error in the place of venue chosen for trial, in that the site chosen after the trial court granted defendant's motion for change of venue was a site still within the circulation area of the Lewiston Morning Tribune, the source of a majority of the pretrial publicity which appellant claims was prejudicial. We have many times outlined the rules upon which we will base our review of the trial court's ruling on change of venue motions. We see no reason for departing from those rules merely because the change of venue motion in this case was granted, but venue moved to a place unacceptable to appellant. As we have noted many times, where the defendant actually received a fair trial and there was no difficulty experienced in selecting a jury, a refusal to grant a change of venue is not grounds for reversal. State v. Thomas, 94 Idaho 430, 489 P.2d 1310 (1971); State v. Cypher, 92 Idaho 159, 438 P.2d 904 (1968); State v. McKeehan, 91 Idaho 808, 430 P.2d 886 (1967). This same rule would apply where the trial court failed to move the trial to a venue acceptable to appellant. Factors this Court will consider in determining whether a fair trial was received include testimony of jurors at voir dire as to whether they formed an opinion on guilt or innocence based upon adverse pretrial publicity, whether the defendant challenged for cause any of the jurors finally selected, the nature and content of the pretrial publicity, and the amount of time between the publicity and the trial itself. State v. Needs, 99 Idaho 883, 591 P.2d 130 (1979); see also State v. Bainbridge, 108 Idaho 273, 698 P.2d 335 (1985). In this case a majority of the jurors who actually sat on the jury had heard about the case, but knew very little about it. In fact, most indicated they knew only that it was a controversial Orofino murder case and had heard about it by a friend mentioning that the case was transferred to Moscow for the trial after the subject of jury duty arose. All of them indicated that they had formed no opinion on the guilt or innocence of the defendant. One of the actual jurors was challenged for cause by the defendant, but after further questioning by the court, the defendant withdrew his objection to that juror. After the exercise of only twelve peremptory challenges,[Footnote 3] the jury was finally accepted by both the state and the defense. There is nothing in this record to indicate that the defendant did not receive a fair trial, or that there\n\nwas any difficulty in selecting a jury. Thus, we see no error in the refusal of the trial court to change the venue of the trial to a place acceptable to appellant.\n\nAppellant also argues that the failure of the trial court to move the trial out of the circulation area of the Tribune was exacerbated by the failure of the trial court to sequester the jury. I.C. § 19-2126 now leaves within the discretion of the trial court the decision on whether a jury should be sequestered.[Footnote 4] The trial court instructed the jury during the trial not to listen to news reports or read newspapers because of the possibility that they could read or hear something about the trial with which they were involved. There is no indication that any juror was exposed to prejudicial publicity during the course of the trial. Thus, we see no abuse of discretion in the fact that the trial court failed to sequester this jury.\n\nIV\n\nAppellant also argues that he was denied his constitutional right to a speedy trial by the fact that he was incarcerated for nearly one year prior to his trial. The sixth amendment to the United States Constitution guarantees to criminal defendants the right to a speedy trial. This right is applicable to the states through the fourteenth amendment. In addition, the Idaho Constitution, in Art. 1, § 13, guarantees the accused the right to a speedy trial. The principal case which lays down the rules for determining when the federal constitutional right has been violated is Barker v. Wingo, 407 U.S. 514, 92 S.Ct. 2182, 33 L.Ed.2d 101 (1972). Although the state guarantee is not necessarily exactly like the federal guarantee, this Court has previously used the Barker test in determining whether the state constitutional guarantee has been violated, State v. Holtslander, 102 Idaho 306, 629 P.2d 702 (1981), and noted that the \"balancing test\" is consistent with the protection afforded by our state Constitution and statutes. State v. Carter, 103 Idaho 917, 655 P.2d 434 (1981). In addition, in determining whether the state right has been violated, we must consider the statutory law enacted to aid in interpretation of this guarantee. See I.C. § 19-3501 (if defendant not tried within six months of information, without good cause shown, entitled to dismissal of prosecution).\n\nUnder the federal rule, the right to a speedy trial is measured from the time formal indictment or information or actual restraint or arrest occurs. U.S. v. Marion, 404 U.S. 307, 92 S.Ct. 455, 30 L.Ed.2d 468 (1971). Under the Idaho speedy trial constitutional provision, the time of delay is measured from the point where formal charges are filed or when the defendant is arrested, whichever occurs first. State v. Holtslander, supra; State v. Lindsay, 96 Idaho 474, 531 P.2d 236 (1975).\n\nIn Barker v. Wingo, supra, the Supreme Court established a balancing test, wherein four enumerated factors are balanced together to determine whether an accused's constitutional right to a speedy trial has been violated. The four factors to be balanced are (1) the length of the delay, (2) the reason for the delay, (3) the assertion of accused's right to a speedy trial, and (4) the prejudice to the accused.\n\nWe would first note that, on the first issue, the length of delay between the time a criminal complaint was filed and defendant arrested, and the time the appellant first asserted his right to a speedy trial was somewhat over eleven months, three months of which were consumed by appellant's stay in the Idaho security medical facility undergoing psychiatric evaluations. This delay in and of itself does not indicate a violation of appellant's constitutional right. State v. Holtslander, 102 Idaho 306, 629 P.2d 702 (1981) (delay in prosecution not presumed prejudicial so as to violate rights of defendant).\n\nInsofar as the reason for the delay is concerned, we note that in this case the parties were involved in a complicated first degree murder case. It is helpful to examine the course of proceedings during this case. To aid in that inquiry we have developed the following outline of the course of proceedings with a notation indicating which party filed each motion:\n\nOctober 1, 1981 Criminal complaint filed\n\nOctober 2, 1981 Defendant appeared,\n\nattorney appointed\n\nNovember 2, 3, 4, 6,\n\n10, 1981 Preliminary hearing\n\nNovember 10, 1981 Bound over for trial\n\nNovember 25, 1981 Arraignment\n\nNovember 25, 1981 Information filed\n\nDecember 4, 1981 Notice of Intent to Rely on\n\nMental Disease or Defect --\n\nDefendant\n\nJanuary 13, 1982 Order for Appointment of\n\nPsychiatrist -- requested by\n\nDefendant\n\nJanuary 14, 1982 Motion to\n\nDismiss/Insufficient\n\nEvidence -- Defendant\n\nJanuary 18, 1982 Order setting date for\n\nargument on Motion to\n\nDismiss\n\nFebruary 11, 1982 Order of transport to ISMF\n\nFebruary 19, 1982 Amended Information\n\nFebruary 25, 1982 Hearing on Motion to\n\nDismiss State asked for\n\ncontinuance to review late\n\nbrief filed by Defendant\n\nMarch 11, 1982 Motion for Change of\n\nVenue -- Defendant\n\nMarch 11, 1982 Hearing on Motion to\n\nDismiss -- Motion denied.\n\nCt. set pretrial motion\n\nhearing\n\nMarch 25, 1982 Change of venue motion\n\nheard, granted\n\nMay 13, 1982 Defendant returned from\n\nISMF\n\nMay 27, 1982 Motion in limine filed --\n\nDefendant\n\nJune 10, 1982 Motion requesting order to\n\nset hearing on Motion in\n\nlimine for July 12, 1982\n\nJune 24, 1982 Order granting 2d\n\npsychiatric evaluation --\n\nrequested by Defendant\n\nJuly 15, 1982 Court set jury trial for\n\nOctober 4, 1982\n\nJuly 29, 1982 Motion for Investigative\n\nAssistance -- Defendant\n\nHearing same day -- granted\n\nwith additional showing\n\nAugust 12, 1982 Hearing on Motion for\n\nInvestigative Assistance\n\nAugust 30, 1982 Motion for Discovery --\n\nProsecution\n\nAugust 30, 1982 Order setting venue\n\nSeptember 10, 1982 Motion to Dismiss/Speedy\n\nTrial filed -- Defendant\n\nSeptember 21, 1982 Motion for Discovery --\n\nDefendant\n\nSeptember 30, 1982 Hearing on Motion to\n\nDismiss -- denied\n\nNearly all of the numerous motions filed in this case, which presumably were the reasons for the delay in trial setting, were filed by appellant. It does not appear that these motions were filed with the intent to delay the trial, but nevertheless the reasons for delay can be attributed to appellant.\n\nThe third factor to be balanced is the assertion of the defendant's right to a speedy trial. In this case appellant never urged his right until an eleven-month delay had occurred. Finally, we must examine the existence of any prejudice to the defendant caused by the delay. In this case appellant has not alleged any prejudice, nor do we find in this record the existence of any possible prejudice caused by the delay, and in fact the delay was most probably in appellant's best interests. Balancing all of these factors together, as required by Barker v. Wingo, supra, we find that there was no denial of appellant's right to a speedy trial.\n\nV\n\nAppellant argues that imposition of the death penalty was in this case erroneous in that (1) the aggravating circumstances relied upon by the trial court are unconstitutionally vague and not supported by the evidence, and (2) that participation of the jury in the sentencing process should have been required. We reject both of these arguments.\n\nThe trial court relied upon former I.C. §§ 19-2515(f)(5) and -(8)[Footnote 5] in imposing\n\nthe death sentence. We previously upheld the constitutionality of -(f)(5) in State v. Osborn, 102 Idaho 405, 631 P.2d 187 (1981), and need not consider this argument again. See State v. Sivak, 105 Idaho 900, 674 P.2d 396 (1983); State v. Creech, 105 Idaho 362, 670 P.2d 463 (1983). Additionally, arguments concerning the constitutionality of -(f)(8) were considered in our previous cases and do not again merit consideration. See State v. Aragon, 107 Idaho 358, 690 P.2d 293 (1984); State v. Sivak, supra; State v. Creech, supra; State v. Osborn, supra. In addition, both of these aggravating circumstances are amply supported by evidence of the cruel and brutal treatment of the victim by appellant, and appellant's similar treatment of persons close to him.\n\nWe have also considered the argument that the jury should participate in sentencing and have not found it to be constitutionally required. State v. Creech, supra (not required under federal constitution); State v. Sivak, supra (not required under state constitution). We see nothing presented by the facts of this case which would otherwise require jury participation.\n\nVI\n\nWe now reach that portion of our opinion where we must consider the proportionality of the sentence imposed in this case. Appellant urges that the sentence imposed is so disproportionate to the crime committed that it violates the cruel and unusual punishment clause of the eighth amendment. We also conduct a proportionality review in accordance with our duty to do so as mandated by I.C. § 19-2827. Under that statute we must also examine the record to ensure that the penalty was imposed without resort to passion or prejudice.\n\nIn examining appellant's eighth amendment claim, we look to the United States Supreme Court for guidance. In Solem v. Helm, 463 U.S. 277, 103 S.Ct. 3001, 77 L.Ed.2d 637 (1983), the United States Supreme Court set out the criteria to be used in determining whether a particular punishment is so disproportionate to the crime as to violate the cruel and unusual punishment clause. The criteria listed in Solem include: (1) the gravity of the offense and the harshness of the penalty; (2) the sentences imposed on other criminals in the same jurisdiction; (3) sentences imposed for the same crime. In this case the crime committed was the gravest offense under our system of criminal Justice, first degree murder. Thus, although the penalty imposed was also the harshest known to our system, it is not out of proportion in that the harshest penalty is imposed only for the gravest of offenses, and that is the offense committed in this case. Although there are no other murder by torture cases in this jurisdiction to compare this case to, we can compare this sentence to the sentences imposed for first degree murder. We note that many first degree murder convictions have garnered a sentence of death. Thus, we cannot conclude that the punishment imposed here is so disproportionate to the crime committed as to violate the cruel and unusual punishment clause.\n\nIn conducting our proportionality review under I.C. § 19-2827, we conduct a review of the sentence imposed, and the sentences imposed in similar cases, to assure that the sentence in this case was not excessive or disproportionate. We find nothing in the record of this case after a consideration of the nature of the crime, the character of the defendant, and the penalties imposed in similar cases which would indicate that the sentence imposed was disproportionate or unjust. The crime committed was unlike any other first degree murder previously committed in Idaho, in that it was the first case ever brought under the murder by\n\ntorture statute. In that sense, this case is unique and somewhat incomparable to other Idaho murder cases. However, although murder by torture does not require a showing of an intent to kill, making the crime unique, it does require a showing of the intent to torture, or the intent to inflict great pain and suffering upon the victim. The jury in this case found that such an intent was present, and that factual finding is supported by substantial competent evidence. The intent to inflict torture is comparable to the intent to kill in that both stem from a basic disrespect for the rights of others. It is this disrespect that the legislature has determined will be punished as a crime of first degree murder, ultimately punishable by death. Viewing this case in that light, it is more than possible to compare the nature of this crime, a torture murder, committed to satisfy the sadistic impulses of the defendant, to other murders which were committed to satisfy some other untoward motive, such as pecuniary gain.\n\nThe torture conducted by this defendant is similar to, if not more depraved than the conduct of other defendants who have been sentenced to death. It was stipulated at the sentencing hearing that when sentencing the defendant the court would consider evidence presented at the preliminary hearing and trial along with the presentence investigation report. While not all this information was available as evidence for the jury, the information was properly before the sentencing court. There was evidence that in his domination and abuse of his various victims the defendant committed at least three rapes. One rape was committed at defendant's place of employment against a woman acquaintance who attempted to collect some money owed to her by defendant. Defendant intimidated the woman into submission by feigning karate kicks and hits, one of which bruised and swelled her arm. Another rape was committed against a woman (at the time legally married to defendant) who was recovering in the hospital from a month-long coma resulting from a hit and run automobile incident. She had been run over and left on the road by an unknown driver while she was attempting to find a place to stay and hide from the defendant since he was just released from incarceration which was prompted by the wife's report to the police of defendant's beatings, burglary and auto thefts. The hospital had insisted that defendant stay away, but late at night he entered undetected and removed the victim's frail 86-pound body from her hospital bed, along with catheter, IV's, and drainage bags, to the bathroom where he raped her. On a previous occasion when the defendant learned of his wife's pregnancy, he bound her to the bed and beat her stomach with his fists and forced the handle of a spatula up her vagina in an attempt to abort her pregnancy. Another woman testified of defendant dragging her into a cold lake during the early morning hours of a day in November, where he repeatedly held her head under water, threatening to kill her. The evidence showed that defendant often choked his victims into submission, including his own son by a former marriage who was choked until the boy lapsed into unconsciousness. Additionally, defendant sodomized and forced oral sex upon his son.\n\nThe record before the sentencing court discloses a defendant with three prior convictions, one for rape, and a ten-year history of seemingly endless incidents of beatings, chokings, assaults, rapes and tortures, some at the point of a gun or knife, inflicted upon all the former wives, girlfriends and children whom the defendant was able to bring within his control. The sentencing court adequately stated:\n\n\"I feel this record shows this beyond a reasonable doubt, that this defendant is a person who is sadistic, is assaultive, he steals, he tortures, he rapes and ultimately he murders. . . . So as I examine his life as a whole I find no meaningful mitigating factors that could possibly outweigh the aggravating factors.\"\n\nThe sentencing court further stated in its written findings:\n\n\"The court is convinced beyond a reasonable doubt that if this defendant continues\n\nto exist, it will again be only a matter of time until another victim is murdered.\"\n\nViewing the nature of the crime committed and the character of the defendant, we find that the sentence imposed in this case is not disproportionate to that imposed in other first degree murder cases. We also find that there is no indication of a resort to passion or prejudice in the imposition of this penalty. At this point we note the trial court's superior ability to Judge the demeanor of witnesses and the character of the defendant, as opposed to our own view of the sentencing decision based upon a cold record.\n\nDuring the course of our proportionality review, we have examined numerous cases involving the killing of a human being.[Footnote 6] Following our extensive review of the record in considering this crime and the sentence imposed, we have determined that the sentence of death is not out of proportion to the sentences heretofore imposed. The judgment of conviction and sentence imposed by the trial court are affirmed.\n\nHUNTLEY, Justice, Concurring specially.\n\nI concur in the majority opinion and in the imposition of the death sentence with the caveat and reservation that I remain of the opinion that the Idaho capital sentencing process is unconstitutional in two respects:\n\n(1) It does not provide for utilization of the jury, which is in violation of both the Idaho and United States constitutions; and\n\n(2) The sentencing proceeding, as conducted by the trial courts with the approval of this court, by permitting the admission of the presentence investigation report and other hearsay evidence over objection of the accused deprives the accused of the right to cross-examine and confront witnesses.\n\nMy reasoning in this regard is set forth in detail in my Dissenting opinions in State of Idaho v. Creech, 105 Idaho 362, 670 P.2d 463 (1983), and State of Idaho v. Sivak, 105 Idaho 900, 674 P.2d 396 (1983).\n\nBISTLINE, Justice, Dissenting.\n\nRIGHT TO JURY TRIAL\n\nOnce again the majority of three, Justices Donaldson, Bakes, and Shepard, decline another opportunity to attempt a realistic explanation of their reasons for declaring that the legislature has not impermissibly delegated the awesome responsibility of capital sentencing to district Judges. In State v. Sivak, 105 Idaho 900, 903, 674 P.2d 396, 399 (1984), Justice Bakes made an attempt at refuting that which Justice Huntley and I had earlier written on the subject in State v. Creech, 105 Idaho 362, 375-419, 670 P.2d 463, 476-520 (1984). That attempt apparently satisfied Justices Donaldson and Shepard, who independently have not voiced any thoughts on this matter of extreme importance. That attempt failed to convince either Justice Huntley or myself, as is well witnessed by our separate Sivak opinions, Sivak, supra, 105 Idaho at 908-922, 674 P.2d at 404-418. In particular it was stated therein that:\n\nSome may consider it a deplorable state of affairs that in a matter of such grave moment the majority does not even attempt to comment upon the proceedings of the Constitutional Convention and the remarks of Mr. Heyburn, Mr. Claggett, and Mr. Ainslie in the drafting of Art. 1, section 7 -- which was thereafter adopted by the people. Instead the majority digresses into the wholly irrelevant field of the Judge's discretion where the jury's verdict was to convict of murder in the second degree.\n\nWith equal facility the majority facilely avoids discussing the teaching of State v. Miles, 43 Idaho 46, 248 P. 442 (1926), or attempting to explain away the words and wisdom of Justice Ailshie in In re Prout, 12 Idaho 494, 86 P. 275 (1906). Instead the majority opinion speaks of the sentencing discretion in, of all things, burglary cases. It gives us the remarkable pronouncement that the jury's determination of whether the defendant is guilty of first or second degree murder, or perhaps the included offense of petit larceny, \"will have a substantial impact upon the sentence . . . ,\" and that such \"does not mean that under our Constitution a defendant is entitled to have a jury impose the sentence.\" No one has ever contended that it did in other than murder cases; the statement of the majority only serves to show no knowledge of the documentation of the Creech Dissenting opinions, at the best, or, at the worst, a complete disregard for the irrefutable teaching of that documentation. In an ordinary case this would be thought regrettable. In a case where we review the imposition of a death sentence, it may well be regarded as unpardonable.\n\nMost disturbing is the knowledge that prior to Furman the capital death sentencing procedures in Idaho were within a small percentage of being those which the Woodson Court would later prescribe. Basically all that was needed, prior to Furman, was a bifurcation so that a person accused of first degree murder would not be prejudiced by attempting at a single trial to prove both that he did not deserve the death penalty and that he was not guilty of first degree murder -- a Catch 22 situation if ever there was one. For example, see State v. Clokey, 83 Idaho 322, 364 P.2d 159 (1961), and State v. Owen, 73 Idaho 394, 253 P.2d 203 (1953), both discussed in my Creech Dissent. Those cases, and others, make it clear that this Court earlier, and absent legislative involvement, recognized that the trial courts should properly instruct the jury in a capital case to the end that the jury did not arbitrarily or capriciously invoke the penalty of death. Sivak, supra, 105 Idaho at 909-10, 674 P.2d at 405-06.\n\nIt is time, however, to put aside any thought that jury sentencing may be mandated by the federal constitution. Notwithstanding its own observation that in only the four states of Arizona, Idaho,\n\nMontana, and Nebraska is it the court which alone imposes sentence, and notwithstanding that the issue presented was the more limited one of a Judge-override, the Supreme Court of the United States has finally taken the bull by the horns to put the matter to rest:\n\nIn light of the facts that the Sixth Amendment does not require jury sentencing, that the demands of fairness and reliability in capital cases do not require it, and that neither the nature of, nor the purpose behind, the death penalty requires jury sentencing, we cannot conclude that placing responsibility on the trial Judge to impose the sentence in a capital case is unconstitutional. Spaziano v. Florida, 468 U.S. 447, --, 104 S.Ct. 3154, 3165, 82 L.Ed.2d 340 (1984).\n\nFor my part, I am more persuaded by the views of Justice Stevens, with two Justices Concurring. Justice Stevens wrote in part:\n\n\"In the 12 years since Furman v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed.2d 346 (1972), every Member of this Court has written or joined at least one opinion endorsing the proposition that because of its severity and irrevocability, the death penalty is qualitatively different from any other punishment, and hence must be accompanied by unique safeguards to ensure that it is a justified response to a given offense. Because it is the one punishment that cannot be prescribed by a rule of law as Judges normally understand such rules, but rather is ultimately understood only as an expression of the community's outrage -- its sense that an individual has lost his moral entitlement to live -- I am convinced that the danger of an excessive response can only be avoided if the decision to impose the death penalty is made by a jury rather than by a single governmental official. This conviction is consistent with the judgment of history and the current consensus of opinion that juries are better equipped than Judges to make capital sentencing decisions. The basic explanation for that consensus lies in the fact that the question whether a sentence of death is excessive in the particular circumstances of any case is one that must be answered by the decisionmaker that is best able to 'express the conscience of the community on the ultimate question of life or death.' Witherspoon v. Illinois, 391 U.S. 510, 519, 88 S.Ct. 1770, 1775, 20 L.Ed.2d 776 (1968) (footnote omitted).\n\n\"Here the level of consensus is even greater, thereby demonstrating a strong community feeling that it is only decent and fair to leave the life-or-death decision to the authentic voice of the community -- the jury -- rather than to a single governmental official. Examination of the historical and contemporary evidence thus unequivocally supports the Conclusion reached by the Royal Commission on Capital Punishment three decades ago:\n\n'For our part, we have no hesitation in agreeing with the many witnesses who considered that, in this country at least, the responsibility of deciding whether a person convicted of murder should be sentenced to death or to a lesser punishment is too heavy a burden to impose on any single individual. The sentence of death differs absolutely, not in degree, from any other sentence; and it would be wholly inconsistent with our traditional approach to such issues to lay on the shoulders of the Judge a responsibility so grave and invidious. It is more in accord with the instinct of our people to entrust to the men and women of the jury a joint responsibility for decisions which will affect the life of the accused.' Royal Commission on Capital Punishment, Report 193-194 (1953).\n\nVI\n\n\"The authors of our federal and state constitutional guarantees uniformly recognized the special function of the jury in any exercise of plenary power over the life and liberty of the citizen. In our jurisprudence, the jury has always played an essential role in legitimating the system of criminal Justice.\n\n'The guarantees of jury trial in the Federal and State Constitutions reflect a profound judgment about the way in which law should be enforced and Justice administered. A right to jury trial is granted to criminal defendants in order to prevent oppression by the Government. Those who wrote our constitutions knew from history and experience that it was necessary to protect against unfounded criminal charges brought to eliminate enemies and against Judges too responsive to the voice of higher authority. The framers of the constitutions strove to create an independent judiciary but insisted upon further protection against arbitrary action. Providing an accused with the right to be tried by a jury of his peers gave him an inestimable safeguard against the corrupt or overzealous prosecutor and against the compliant, biased, or eccentric Judge. If the defendant preferred the common-sense judgment of a jury to the more tutored but perhaps less sympathetic reaction of the single Judge, he was to have it. Beyond this, the jury trial provisions of the Federal and State Constitutions reflect a fundamental decision about the exercise of official power -- a reluctance to entrust plenary powers over the life and liberty of the citizen to one Judge or to a group of Judges. Fear of unchecked power, so typical of our State and Federal Governments in other respects, found expression in the criminal law in this insistence upon community participation in the determination of guilt or innocence.' Duncan v. Louisiana, 391 U.S. 145, 155-156, 88 S.Ct. 1444, 1450-1451, 20 L.Ed.2d 491 (1968) (footnote omitted).\n\n\"Thus, the jury serves to ensure that the criminal process is not subject to the unchecked assertion of arbitrary governmental power; community participation is 'critical to public confidence in the fairness of the criminal Justice system.' Taylor v. Louisiana, 419 U.S. 522, 530, 95 S.Ct. 692, 698, 42 L.Ed.2d 690 (1975).\n\n\"The same consideration that supports a constitutional entitlement to a trial by a jury rather than a Judge at the guilt or innocence stage -- the right to have an authentic representative of the community apply its lay perspective to the determination that must precede a deprivation of liberty -- applies with special force to the determination that must precede a deprivation of life. In many respects capital sentencing resembles a trial on the question of guilt, involving as it does a prescribed burden of proof of given elements through the adversarial process. But more important than its procedural aspects, the life-or-death decision in capital cases depends upon its link to community values for its moral and constitutional legitimacy. In Witherspoon v. Illinois, 391 U.S. 510, 88 S.Ct. 1770, 20 L.Ed.2d 776 (1968), after observing that 'a jury that must choose between life imprisonment and capital punishment can do little more -- and must do nothing less -- than express the conscience of the community on the ultimate question of life or death,' id., at 519, 88 S.Ct., at 1775 (footnote omitted), the Court added:\n\n'[O]ne of the most important functions any jury can perform in making such a selection is to maintain a link between contemporary community values and the penal system -- a line without which the determination of punishment could hardly reflect \"the evolving standards of decency that mark the progress of a maturing society.\"' Id., at 519, n. 15, 88 S.Ct., at 1775, n. 15 (quoting Trop v. Dulles, 356 U.S. 86, 101, 78 S.Ct. 590, 598, 2 L.Ed.2d 630 (1958) (plurality opinion)).\n\n\"That the jury is central to the link between capital punishment and the standards of decency contained in the Eighth Amendment is amply demonstrated by history. Under the common law capital punishment was mandatory for all felonies, and even through the last century it was mandatory for large categories of offenses. '[O]ne of the most significant developments in our society's treatment of capital punishment has been the rejection of the commonlaw practice of inexorably imposing a death sentence upon every person convicted of a specified offense.' Woodson, 428 U.S., at 301, 96 S.Ct., at 2989 (plurality opinion).\n\nThe jury played a critical role in this process. Juries refused to convict in cases in which they felt the death penalty to be morally unjustified. This forced the adoption of more enlightened capital punishment statutes that were more in accord with the community's moral sensibilities:\n\n'At least since the Revolution, American jurors have, with some regularity, disregarded their oaths and refused to convict defendants where a death sentence was the automatic consequence of a guilty verdict. As we have seen, the initial movement to reduce the number of capital offenses and to separate murder into degrees was prompted in part by the reaction of jurors as well as by reformers who objected to the imposition of death as the penalty for any crime. Nineteenth century journalists, statesmen, and jurists repeatedly observed that jurors were often deterred from convicting palpably guilty men of first-degree murder under mandatory statutes. Thereafter, continuing evidence of jury reluctance to convict persons of capital offenses in mandatory death penalty jurisdictions resulted in legislative authorization of discretionary jury sentencing. . . .' Id., at 293, 96 S.Ct., at 2986 (footnote omitted).\n\n\"Thus the lesson history teaches is that the jury -- and in particular jury sentencing -- has played a critical role in ensuring that capital punishment is imposed in a manner consistent with evolving standards of decency. This is a lesson of constitutional magnitude, and one that was forgotten during the enactment of the Florida statute.\n\n\"That the jury provides a better link to community values than does a single Judge is supported not only by our cases, but by common sense. Juries -- comprised as they are of a fair cross-section of the community -- are more representative institutions than is the judiciary; they reflect more accurately the composition and experiences of the community as a whole, and inevitably make decisions based on community values more reliably, than can that segment of the community that is selected for service on the bench. Indeed, as the preceding Discussion demonstrates, the belief that juries more accurately reflect the conscience of the community than can a single Judge is the central reason that the jury right has been recognized at the guilt stage in our jurisprudence. This same belief firmly supports the use of juries in capital sentencing, in order to address the Eighth Amendment's concern that capital punishment be administered consistently with community values. In fact, the available empirical evidence indicates that Judges and juries do make sentencing decisions in capital cases in significantly different ways, thus supporting the Conclusion that entrusting the capital decision to a single Judge creates an unacceptable risk that the decision will not be consistent with community values.\n\n\"Thus, the legitimacy of capital punishment in light of the Eighth Amendment's mandate concerning the proportionality of punishment critically depends upon whether its imposition in a particular case is consistent with the community's sense of values. Juries have historically been, and continue to be, a much better indicator as to whether the death penalty is a disproportionate punishment for a given offense in light of community values than is a single Judge. If the prosecutor cannot convince a jury that the defendant deserves to die, there is an unjustifiable risk that the imposition of that punishment will not reflect the community's sense of the defendant's 'moral guilt.'\" Spaziano, supra, 104 S.Ct. at 3167-78 (footnotes omitted).\n\nFirst noting that many of the Judges who must be convinced by prosecutors have been prosecutors, I call attention to part VI, wherein are found almost the same observations as to the founding fathers of the federal Constitution which I brought to attention in regard to the Idaho Constitution in Creech and again in Sivak. In Creech it was not my thinking or my philosophy which I urged upon the majority of\n\nthree, but rather that which went into the creation of the Idaho Constitution long before anyone on this Court was born. Based upon recorded history, I wrote:\n\nIn reviewing their recorded considerations of that issue, we are fortunate today to have irrefutable evidence that those public leaders, of whom nearly one-half were practicing lawyers (Vol. I, Idaho Constitutional Convention, p. 160), were acutely aware that § 7 of Article I would guarantee forever that the legislature could not impinge upon the right of an accused to have a jury of his fellow men make the death penalty decision. Mr. Heyburn said it with an eloquence befitting a Thomas Jefferson or a James Madison:\n\n\"Mr. Chairman, I cannot agree with the gentleman in regard to the wisdom of changing entirely the system that is as old as government itself, that no man shall be deprived of his rights, of his liberty or his life, except by a unanimous verdict of a jury of his fellow citizens who have no interest other than to see that Justice is done him. This principle has been deemed so important that at one time the demand that man should be protected by right of trial by jury revolutionized the civilized world . . . . It is the strong arm of the law that stands between the weak and the strong, between rich and poor, between oppressed and oppressor . . . . [I]t is still not necessary for us to say that less than a unanimous verdict shall deprive any man of either his liberty or his personal rights. We cannot afford in the interest of economy nor in the interest of speedy Justice -- or of speedy trial, more properly speaking -- to lessen by one hair's breadth the safeguard, the insurance every man has that his property or his rights will not be taken away from him, unless it is clear, beyond a reasonable doubt that they do not belong to him, and that that reasonable doubt is to be determined by a unanimous verdict.\"\n\nId. at 152-53 (emphasis added).\n\nAlthough Mr. Claggett, the sponsor of the proposed 5/6 majority rule proposal contended that the requirement of unanimous verdicts in criminal cases paralyzed the law enforcement power of the state, even he recognized that capital cases are unique:\n\n\"MR. CLAGGETT . . . . We all know the defendant has every benefit from reasonable doubt. We all know he has a double advantage in impaneling the jury. We all know that when there has once been a verdict of acquittal he cannot be called in question again, no matter how wrong the verdict may be. And we all know in addition that the court has power to suspend judgment on the verdict after conviction, in order that application may be made to the governor for pardon in any case which may arise now and then, where the conviction is wrong, or where, if not wrong, the punishment is too severe, so that there is ample opportunity given before the execution of the judgment of the court for a review of the case by the governor or board of pardons. Now I ask whether all these things taken together, one and all, do not constitute too much advantage on the part of the defendant, and whether the strong arm of the state, which is stretched out and whose function is to protect the people, is not paralyzed by this system of a unanimous verdict.\n\n\"Mr. BATTEN. I will ask you, why make an exception in capital cases?\n\n\"Mr. CLAGGETT. Out of mere tenderness to human life, and because if the death penalty is once inflicted you can never rectify the error, but on the question of imprisonment you have the entire term of his imprisonment to correct it.\"\n\nId. at 251 (emphasis added).\n\nClearly the right, indeed the safeguard, to have a jury of fellow citizens make the decision of death was foremost in the minds of the framers when they assembled in the year 1899 and drafted\n\nthe Constitution of Idaho which was accepted by the people and the Union. Creech, supra, 105 Idaho 362,393-94, 670 P.2d 463, 494-95 (italics in original, underscoring added).\n\nIn Sivak, I lamented (as set forth earlier herein, but important enough to be worthy of repetition):\n\nSome may consider it a deplorable state of affairs that in a matter of such grave moment the majority does not even attempt to comment upon the proceedings of the Constitutional Convention and the remarks of Mr. Heyburn, Mr. Claggett, and Mr. Ainslie in the drafting of Art. 1, section 7 -- which was thereafter adopted by the people. Sivak, supra, 105 Idaho at 909, 674 P.2d at 405.\n\nUSE OF HEARSAY BY SENTENCER\n\nAnd, as Justice Huntley and I have consistently sought to show to our brethren, hand-in-glove with the present majority-approved one-Judge sentencing scheme is the widespread and grossly improper use of hearsay, even to the extent of newspaper editorials which, as self-appointed purported voices of the people, suggest to the sentencer which course he should take.\n\nJustice Bakes has defended this practice on the basis that at the two trials, first that of guilt or innocence, and second, that of life or death, it is only that the sentencer is provided with broader ranges of information than the jury.\n\nI continue to believe, as I have heretofore espoused in Sivak and Creech that any evidence which would be inadmissible before a jury as sentencer is equally inadmissible where the Judge performs that function. In this particular case, the presentence investigation report, a conglomeration of hearsay upon hearsay from all kinds of sources, together with the preliminary transcript, has had its effect upon the majority. See Part VI, Majority Opinion. It also had a like effect upon the sentencing Judge who, to his credit, wrote less emotionally than do today's majority. Judge Schwam wrote:\n\n19-2515(f)(8) THE DEFENDANT BY PRIOR CONDUCT OR CONDUCT IN THE COMMISSION OF THE MURDER AT HAND HAS EXHIBITED A PROPENSITY TO COMMIT MURDER WHICH WILL PROBABLY CONSTITUTE A CONTINUING THREAT TO SOCIETY. The Court finds this to be true beyond a reasonable doubt in this case. The facts adduced at the trial and at the preliminary hearing are that the defendant has brutalized, at times with the use of weapons, almost every person with whom he has become emotionally involved. The evidence demonstrates that it was only a matter of time until one of the defendant's victims died as a result of the defendant's brutal behavior. The Court is convinced beyond a reasonable doubt that if this defendant continues to exist, it will again be only a matter of time until another victim is murdered. The evidence demonstrates beyond a reasonable doubt that this defendant attempted to drown a woman as a means of torture and that this defendant inflicted brutal beatings upon his second wife and raped her while she was in the hospital recovering from an automobile accident. The defendant's brutal behavior toward so many different people over a period in excess of a decade demonstrates beyond a reasonable doubt a propensity to commit murder in the future.\n\nThe Court has chosen to impose the death penalty because the continued existence of this defendant poses a constant threat to all around him; and because only the most serious punishment is appropriate for such an atrocious, depraved and heinous crime as the one committed by this defendant. As the Court has indicated, it could find nothing in mitigation which would outweigh the aggravated circumstances of this crime and this defendant. (Emphasis added.)\n\nDefendant was not here charged or tried for attempting to drown a woman. The defendant was not here charged with beating and raping his second wife in the hospital. As far as my review shows, the defendant\n\nwas never so charged. The trial Judge, however, found him guilty of those unrelated crimes, and considered that guilt in passing sentence.\n\nMURDER BY TORTURE\n\nA perusal of the majority opinion should convince anyone that the defendant is a bad person. A brutal killing of a three-year-old boy is abhorrent to the senses. With the evidence admitted and the instructions given, concededly it would be a strange jury which would not have convicted him, and had the sentence been by jury instead of the Judge, the imposition of the death penalty would not have been startling. But, to say that is not to say that the defendant has had fair trials in both instances. Those are the questions which we have had presented to us. And, on our review mandated by the legislature, we are required to search the record for error, whether or not assigned by the defendant on his appeal. Our obligation is to ascertain that no prejudicial error has occurred. There is no further review after a defendant is executed. State v. Osborn, 104 Idaho 809, 663 P.2d 1111 (1983).\n\nThere is no doubt that the defendant was guilty of killing the boy. Attached to the presentence report, and apparently in the defendant's own handwriting, is an undated ten-page questionnaire signed by the defendant. In it he admits that he caused the death of the boy by striking him. The presentence investigator, after interviewing the defendant, wrote: \"According to Mr. Stuart on the day of the instant offense he became upset over the victim's 'whining,' struck the boy in the stomach with his fist, wheeled him around, 'swat him on the butt' and made him finish his lunch.\" The boy lay dead a short time later. At trial defendant's attorney acknowledged defendant's guilt, arguing only that it was not murder, but manslaughter.\n\nThe pathologist, Dr. Reay, a year prior to the trial, reported his findings to the sheriff's office:\n\nI am of the opinion that this boy came to his death as a result of multiple liver lacerations with the attendant hemorrhage resulting from those lacerations. The nature of the lacerations is such that a forceful blunt impact to the abdomen, multiple in character, are responsible for these lacerations. The type of force which is required to tear the liver includes a well placed blow with a fist, the pressure applied by a knee, or the violent movement of the body against an object striking the front of the abdomen. The type of lacerations described and demonstrated in the photographs are of the sort that are seen in traffic accidents which result from high velocity forces. Cardiopulmonary resuscitation has occasionally produced a superficial capsular tear but never to the extent, number or severity as demonstrated in the photographs and described in the autopsy protocol. The injuries as described and in the context of the report of investigation would indicate that the person(s) responsible for the care of the child on the afternoon of his death is likewise responsible for the injuries that were demonstrated at the time of autopsy.\n\nI think I have covered all the questions surrounding this death that are pertinent to the central issue. There may be peripheral questions which you desire to have answered and I will do my best to provide an answer. In summary, I would conclude that this child died as a result of blunt impact injuries to the abdomen with lethal tears to the liver\n\nand accompanied by massive internal bleeding. The inconsistency of the statements and the injuries along with the time sequence, indicates that whoever was responsible for this child's care is likewise responsible for these injuries and I would certainly view the death as a homicide.\n\nA court can certainly take judicial notice that well-muscled boxers have been killed by a severe blow in the area of the abdomen, even when struck by a gloved fist. Here, there was no glove, and the blow or blows delivered were killing blows delivered into the small body of a three-year-old. No evidence pointed to the guilt of anyone but the defendant. The defendant intended to strike the boy, he did strike, and he is criminally responsible for the result, whether he intended it or not. If there is any excuse for so killing a small child, I am unaware of it. I am certain twelve jurors were unaware of any excuse. Apology and even remorse do not suffice. The defendant's written expression of willingness to make restitution does not suffice. There can be no restitution.\n\nThe sentencing Judge was the same Judge who presided over the trial. He not only had the benefit of those factors which I have above-mentioned, but he also heard the same live testimony which the jury heard and relied upon. In December of 1982, he submitted to this Court his § 19-2827 Report on Imposition of the Death Penalty. To it he attached a copy of his § 19-2515 Findings which were made after the sentencing hearing which had been earlier conducted in that same month. Therein the Judge made a statement which has led to my having considerable problems with the majority Disposition. That statement is:\n\nThe evidence showed a systematic months long torture of a two to three year old child, culminating in a brutal and savage application of force that produced the death of the child. (Emphasis added.)\n\nThat portion underscored is amply sustained by Dr. Reay's report alone, and all of the evidence points to the inescapable fact that the defendant's use of deadly force killed the boy on the 19th day of September, 1982. Clearly, the prosecuting attorney had before him a prima facie case of first degree murder -- murder which may have resulted from willful, deliberate and premeditated actions of the defendant. See State v. Aragon, 107 Idaho 358, 690 P.2d 293 (1984). The prosecutor, however, did not so charge the defendant. Instead, electing to charge murder by torture, and notwithstanding that he could have charged in a two-count information, the whole case proceeded upon only the murder-by-torture charge -- from the time of filing the original criminal complaint which led to the preliminary hearing and the binding of defendant over to district court for trial. The charging part of the Amended Information upon which the defendant stood trial for first degree murder read as follows:\n\nThat Gene Francis Stuart of Orofino, Idaho, on or about the 19th day of September 1981, at Orofino, in the County of Clearwater, State of Idaho, then and there being, did then and there unlawfully and feloniously kill a human being, with the intentional application of torture to said human being, to wit: that the said Gene Francis Stuart did strike and hit Robert Miller, a human being, repeatedly with the intent to cause suffering or to satisfy some sadistic inclination of the said Gene Francis Stuart, thereby inflicting great bodily injury upon Robert Miller and mortally wounding Robert Miller, from which wounds the said Robert Miller, a three year old boy, sickened and died in the County of Clearwater, State of Idaho, on the 19th day of September 1981.\n\nA reading, and rereading, and re-rereading of that information that the crime allegedly committed by the defendant on the 19th day of September was that defendant inflicted great bodily injury upon the boy which mortally wounded him so that he died the same day, and, that the blows stricken, repeatedly, were delivered (1) with the intent to cause suffering, or, (2) with\n\nthe intent to satisfy \" some \" sadistic inclination of defendant's.\n\nMurder perpetrated by torture has been part of our criminal law since 1864. So has murder perpetrated by poison. For over a hundred years there was no problem. Everyone knew what murder by poison was, and everyone knew what murder by torture was. Torture was, and is, and has always been, the intentional infliction of extreme pain. The intent was not necessarily to kill, and may have been, and often was not to kill. Not too many years ago it was even utilized to persuade people to confess -- sometimes to crimes they had not committed. It was used during the Spanish Inquisition to persuade people to recant. Criminals have used it to compel people to open safes or disclose the location of valuables. Torture is a word which has needed no definition.\n\nMurder by torture similarly has not, over the years, been in need of any definition. Although some torturers do not intend the death of their victims, it is a known fact that extreme pain is a cause of death -- and where the pain causes the death, there is, and has always been, a case for murder by torture. In some torture murders the murderer is not content to kill his victim outright, but deliberately prolongs the life of his victim so as to insure that the victim does suffer and continues to suffer. A good example of legal torture murder was the execution of some classes of criminals in Merry Old England -- where executions were by prolonged near-hangings, disembowelings, and quarterings. One need not go on.\n\nWhen the legislature in 1977 provided a definition for the word \"torture,\" it came up with the same language that the various courts over the country have been using for years: \"Torture is the intentional infliction of extreme and prolonged pain with the intent to cause suffering.\" I.C. § 18-4001. It is a good definition, insofar as I have copied it above.\n\nBut, unfortunately, it goes beyond that which case law provided, and adds:\n\nIt shall also be torture to inflict upon a human being extreme and prolonged acts of brutality irrespective of proof of intent to cause suffering. (Emphasis added.)\n\nThis is language of doubtful validity, but with which initially I had no concern. The information did not charge the defendant with \"extreme and prolonged acts of brutality.\" When, on a second last review just before our opinions were about to be released, on reading the instructions, I found instruction No. 17 to be in the language of the charging part of the information:\n\nINSTRUCTION NO. 17\n\nThe State must prove all the material elements of the offense charged by the Information to be true beyond a reasonable doubt before the defendant can be found guilty of First Degree Murder. It is not necessary that every fact and circumstance put in evidence on behalf of the State be established beyond a reasonable doubt, but only that all facts and circumstances in evidence, when taken together, establish beyond a reasonable doubt all of the material elements of the offense charged. The material elements of the offense charged against the defendant are:\n\n1. That Gene Francis Stuart killed Robert Miller, a human being.\n\n2. That the killing was caused by the intentional application of torture.\n\n3. That the torture was inflicted with the intent to cause suffering or to satisfy some sadistic inclination of Gene Francis Stuart.\n\n4. That the killing occurred on or about the 19th day of September, 1981.\n\n5. That the killing occurred in Clearwater County, State of Idaho.\n\nUnless you find that the State has proven all the material elements of this offense beyond a reasonable doubt you may not find the defendant guilty of First Degree Murder. (Emphasis added.)\n\nI also found that the trial court had in the very next instruction, No. 18, deviated from No. 17, and here dropped any mention\n\nof the satisfying of a sadistic inclination, but included extreme and prolonged acts of brutality:\n\nINSTRUCTION NO. 18\n\nMurder is the unlawful killing of a human being with malice aforethought or the intentional application of torture to a human being, which results in the death of a human being. Torture is the intentional infliction of extreme and prolonged pain with the intent to cause suffering. It shall also be torture to inflict on a human being extreme and prolonged acts of brutality irrespective of proof of intent to cause suffering. The death of a human being caused by such torture is murder irrespective of proof of specific intent to kill; torture causing death shall be deemed the equivalent of intent to kill. (Emphasis added.)\n\nDefendant had not been so charged with extreme and prolonged acts of brutality, and this was fundamental error of the highest level. It allowed the jury to disregard that portion of Instruction 17 which required proof of intent.\n\nThe trial court also went beyond the charge of the information to instruct the jury as though there were an independent charge of willful, deliberate and premeditated killing:\n\nINSTRUCTION NO. 20\n\nAll murder which is perpetrated by means of poison, or lying in wait, or torture, when torture is inflicted with the intent to cause suffering, to execute vengeance, to extort something from the victim, or to satisfy some sadistic inclination, or which is perpetrated by any kind of wilful, deliberate and premeditated killing is murder of the first degree.\n\nAll other kinds of murder are of the second degree. (Emphasis added.)\n\nRecognizing that torture is inherently malicious, the legislature has never required any proof of malice in torture murders. But malice aforethought is an element of wilful and premeditated murder. Here the trial Judge instructed:\n\nINSTRUCTION NO. 19\n\nMalice may be express or implied. It is express when there is manifested a deliberate intention unlawfully to take away the life of a fellow creature. It is implied when no considerable provocation appears, or when the circumstances attending the killing show an abandoned and malignant heart.\n\nThe defendant, as I have suggested earlier, was only charged with first degree torture murder, although he could have been also charged with first degree willful, deliberate, and premeditated murder. (See People v. Lynn, 159 Cal.App.3d 715, 206 Cal.Rptr. 181 (4 Dist. 1984), where the defendant went to trial on three counts of first degree murder, that it was a premeditated and deliberate killing, that it was a torture murder, and that it was a felony murder.)\n\nNot only did the trial Judge not restrict himself to instructing within the confines of the charge of the information, but in his § 19-2515 findings, he did not, nor did the trial over which he presided, confine itself to the date alleged. Any extreme and prolonged acts of brutality were not proven to have taken place on the 19th. It was on that day that the defendant made \"a brutal and savage application of force [not torture] that produced the death.\" The torture which was the court's concern was a prior \"months long torture.\" The court went on to describe it:\n\nThe evidence shows that this lengthy application of torture and force was done to this small child in an alleged effort to cause this child to conform to the defendant's capricious and inconsistent ever changing whims; a task which was obviously impossible and was undertaken merely to provide an excuse to obtain sadistic pleasure by hurting the child over and over and over.\n\nIt is appropriate at this point to list some of the tortuous demands made upon this tiny child, which invariably provided an excuse to inflict pain upon the\n\nchild. The defendant demanded that the child eat pursuing a prescribed pattern of handling the silverware, the glasses and the napkin, which was so complex that most adults would have difficulty achieving satisfactory results and then upon the child's failure, would punish the child. These punishments would include withholding of food, cold showers and beatings. Defendant demanded that this tiny child not ever whine, cry or pout. If the child failed even in a small way the result would be beatings or cold showers.\n\nThe sentencing Judge, in imposing the death penalty, also relied upon the \"over-whelming evidence that defendant used this same tortuous method to deal with numerous adult women.\" The majority finds no error whatever in the trial admission of such evidence. To bolster an extremely weak position, the majority falls back upon and resorts to the trial court's reasoning -- which is fairly well set out in the opinion for the Court, for which reason I will not repeat it. Strangely, I must suppose, when I read those comments I see nothing but an outright, commendably can-did concession of the tremendous and unmeetable prejudicial impact. The evidence, in my view, was not here relevant. It was not highly relevant, and it only served to excite the jury into a belief that defendant tortured the boy to death over a long period of time, when in fact he was not so charged.\n\nFAILURE TO INSTRUCT\n\nThe majority in its part I.B. is guilty of a gross misapplication of State of Lopez, as is readily exposed. The majority states that appellant's counsel invited error in two ways, by merely accepting the court's instructions and by failing to request other instructions. This not only flies in the face of this Court's criminal rules of procedure, but is wholly contrary to existing case law.\n\nThe applicable rule reads:\n\nAt the close of the evidence or at such earlier time as the court reasonably directs, any party may file written requests that the court instructed the jury on the law as set forth in the request. At the same time, copies of such requested instructions shall be furnished to adverse parties. The court shall inform counsel of its proposed actions upon the requested instructions and shall allow counsel a reasonable time within which to examine and make objections outside the presence of the jury to such instructions or the failure to give requested instructions. The court shall read the instructions to the jury prior to final argument; but if all parties consent, it may read part or all of the instructions after final argument. [Adopted December 27, 1979, effective July 1, 1980.]\n\nPrior to the change made in 1979, it provided otherwise:\n\nThe court shall inform counsel of its proposed actions upon the requested instructions and shall allow counsel a reasonable time within which to examine and make objections outside the presence of the jury to such instructions or the failure to give requested instructions. Such objections shall state distinctly the matter to which he objects and the grounds of his objections, which objections shall be made a part of the record. No party may assign as error any portion of the [charge] or omission therefrom unless he objects thereto prior to the time that the jury is [charged]. (Emphasis added.)\n\nFailing to object or not requesting an instruction has never been held to be invited error. The majority language which seemingly perceives a distinction between \"failing to object\" and \"accepting\" is pure semantic sophistry. While ordinarily it might be thought of as an amusing diversion, it plays no part in a capital case where our review has a 99% chance of being the last and only meaningful review for error. I do not encounter any problem with the proposition of invited error, and am apparently more conversant with State v. Lopez than is Justice Bakes, who today relies upon it for a principle not here applicable.\n\nThe facts of Lopez may be taken directly from our opinion:\n\nLopez next argues that the trial court erred in not instructing the jury as to the lesser included offense of assault with a deadly weapon, battery or assault. The record indicates that the only instruction on a lesser included offense that was initially requested by defense counsel was on assault with a deadly weapon (I.C. § 18-906). However at the close of the trial, defense counsel stated that the defendant wished to withdraw his request for an instruction on the lesser included offense of assault with a deadly weapon. The trial Judge complied with the defendant's request stating that whether the jury is instructed as to lesser included offenses is \"not the prerogative of the Judge or the State but that it is a matter of the Defendant's decision.\"\n\nPrior to 1977, the law was clear in Idaho that the burden was upon the defendant to request the court to instruct on lesser included offenses. State v. Morris, 97 Idaho 420, 546 P.2d 375 (1976); State v. Herr, 97 Idaho 783, 554 P.2d 961 (1976); State v. Boyenger, 95 Idaho 396, 509 P.2d 1317 (1973). This Court recognized that in a situation where the state has requested that the defendant be convicted of a lesser included offense, the defendant, as a trial tactic, may not desire any instruction regarding a lesser included offense. See State v. Herr, supra; State v. Boyenger, supra. The case law was clear that no error could be predicated upon the failure of the trial court to give an instruction on a lesser included offense where defendant did not request such or as in the instant case withdraws such request.\n\nHowever, in 1977 the Idaho legislature enacted I.C. § 19-2132(b) which states: \"The court shall instruct the jury on lesser included offenses when they are supported by any reasonable view of the evidence.\" This Court on several occasions has construed the word \"shall\" as being mandatory and not discretionary. Hollingsworth v. Koelsch, 76 Idaho 203, 280 P.2d 415 (1955); Munroe v. Sullivan Mining Co., 69 Idaho 348, 207 P.2d 547 (1949); State v. Braun, 62 Idaho 258, 110 P.2d 835 (1941). It is clear that I.C. § 19-2132(b) makes it the duty of the trial court to instruct the jury on lesser included offenses when they are supported by a reasonable view of the evidence, even if the court is not requested to do so. To the extent that prior Idaho cases held that no error could be predicated upon the failure of the trial court to instruct the jury on lesser included offenses unless defendant requested such instructions, they are no longer applicable.\n\nThe record indicates that defense counsel opposed an instruction to the jury on assault with a deadly weapon in what appeared to be a tactical consideration to confront the jury with only two alternatives, acquittal or conviction of assault with intent to murder. The failure of the trial court to instruct on assault with a deadly weapon was caused by defendant's objection and therefore was invited error and will not be considered on appeal. People v. Ray, 14 Cal.3d 20, 120 Cal.Rptr. 377, 533 P.2d 1017 (1975); People v. Sedeno, 10 Cal.3d 703, 112 Cal.Rptr. 1, 518 P.2d 913 (1974); People v. Phillips, 64 Cal.2d 574, 51 Cal.Rptr. 225, 414 P.2d 353 (1966); cf. King v. State, 93 Idaho 87, 456 P.2d 254 (1969) (refusal of assistance of counsel).\n\nIn future cases the trial bench should be cognizant that under the mandatory terms of I.C. § 19-2132(b) the duty to instruct as to lesser included offenses exists even when as a matter of trial tactics a defendant fails to request the instruction. However, any failure by the trial court to meet this mandatory duty which is caused by defendant's express objection to or waiver of the trial court instructing as to lesser included offenses will be as in the instant case invited error and not considered on appeal. People v. Ray, supra; People v. Sedeno, supra; People v. Mosher, 1 Cal.3d 379, 82 Cal.Rptr. 379, 461 P.2d 659 (Cal.1969); State v. Weyer, 210 Kan. 721, 504 P.2d 178 (1972). 100 Idaho at 101-02, 593 P.2d at 1005-1006.\n\nWhat the Court held there is beyond any genuine dispute. We all recognized that the defendant had opted \"to go for broke,\" as it were, and to take the chance of getting convicted as charged, or acquitted. The defendant there affirmatively caused, and hence invited the failure to instruct as required by the statute.\n\nToday, only six short years since Lopez, a majority of the Court willingly misuse that case in order to turn aside an absolutely valid assignment of error. Not only is the defendant thusly denied a fair trial, but the law has once again made a shambles where a majority now rules that failure to object is invited error. It is in order to again borrow language which best expresses my view of the Court's irresponsibility:\n\nThe most intolerable evil, however, under which we have lived for the past twenty-five years, has been the changing and shifting character of our judicial decisions, by which we have been deprived of the inestimable benefit of judicial precedents as a safeguard to our rights of person and property.\n\nInasmuch as today's majority places reliance on Arizona case law, as well as on case law from California, it is noteworthy that the Supreme Court of Arizona, apparently even in the absence of a statute such as I.C. § 19-2132(b), held in a torture murder case that \"The trial court had a duty to correctly instruct the jury on the elements of murder by torture applicable to the case being tried and its failure to do so, though not assigned as error by the defendant, constitutes reversible error.\" State v. Brock, 101 Ariz. 168, 416 P.2d 601 (1966); see also on this Court's doctrine of fundamental error where error was not preserved, Phillips v. State, 108 Idaho 405, 700 P.2d 27 (1985) (Bistline, J., Dissenting.)\n\nSEQUESTERING THE JURY\n\nThe refusal of the district Judge to sequester the jury leaves no doubt in my mind that the defendant was denied a fair trial. On September 30, 1982 defendant's attorney moved that the jury in the forthcoming trial be sequestered. The district court summarily denied the motion at that time, but told defense counsel that after the jury was chosen he could renew the motion. This was a hollow promise. That opportunity never came. The court cut it off in a manner which precluded the defense from even making the motion. This arbitrary action took place in this manner, the court addressing the entire jury panel:\n\nIn fact, this is probably as good a time as any to explain that this a type of case in which the Defense can request that the jury be sequestered. That means that all during the trial whoever is chosen to be on the jury would have to be under the control of the bailiff at all times. That means you'd be placed in a motel and whatever you saw or heard would be censored. You'd be away from your families, you wouldn't have evenings to deal with any business matters you might have. It is, in other words, an enormous inconvenience. That's not going to happen in this case. The jury is not going to be sequestered. I am no longer required by law to do that. And so I generally don't do it. Each time I have not sequestered a jury it has worked out just fine because I find that jurors are very dedicated people and do what they're supposed to and it probably was a waste of time to be sequestering all these jurors these years. In this particular case, because I do expect it will get some publicity, I'm going to make some special requests of anyone who serves on this jury who's a prospective juror now.\n\nIt is much simpler to not be sequestered and give up reading newspapers and listening to television news broadcasts than it is to be sequestered and have access to censored newspapers and news broadcasts. Because I am so certain that this case will get publicity and because I am concerned that the publicity may contain assertions about the case over which none of us have control and which may be completely erroneous or untrue, I feel the best thing to do is to require of the jurors -- prospective jurors and those who ultimately may be chosen,\n\nthat while this case proceeds -- it will take about a week and a half to two weeks to finish it, while this case proceeds that you just not read any news papers from this area. By this area I mean published or distributed in Lewiston, Moscow, Spokane. If you receive the Wall Street Journal, for example, I don't suspect this matter will show up in that kind of a paper. But any local newspapers that might be covering this matter I'm going to rely on your intelligence, don't read them during this period because I'm so certain there will be publicity. The same I think you'll find will be true about television news broadcast that again emanate either from Spokane or Lewiston. I think that you can expect that there will be some publicity, don't know how extensive it will be. I would appreciate it and I will require that during the time of this trial while you are still involved in it, because many of you may be excused today, for example, if you are not chosen but while you are involved in this trial, I would again require that you not listen to any television broadcasts. That way I can avoid sequestering and yet running virtually no risk of having to do this trial over again and I would ask your cooperation in this matter. R., Vol. 1, pp. 7-9.\n\nClearly, after these remarks to the jury it not only would have been futile for defendant's attorney to renew his motion to sequester the jury, but he would have alienated every one of those jurors. Properly the court, in an exercise of due process, would have heard from counsel before ruling, and in ruling would have stated his reasons. The fashion in which the court acted precludes any meaningful review.\n\nMoreover, the district Judge could not have been deluded regarding the widespread nature of publicity and information about this case. Venue had already been changed from Clearwater County to Latah County -- the two counties being adjacent, and their county seats being but about 60 miles apart. The prospective jurors' answer to their knowledge of the case was an excellent measure of the amount of information already disseminated in Latah County:\n\nHave any of you heard of this case before?\n\n(All jurors in the jury box except juror No. 8 and 9 and many hands in the audience were raised.) R., Vol. 1, p. 13.\n\nAny doubts about the lack of need to sequester the jury should have been eliminated after this scenario. For the district Judge to assume that none of the jurors would read newspapers, or would ignore questions by family or friends, or hear news accounts on the television or the radio is an absurd refusal to acknowledge what is known to be just plain human nature. The tragic result which must be presumed is the denial of a fair trial to a defendant charged with the most serious crime under the laws of Idaho.\n\nThe trial court was simply unrealistic. Better the court should have requested the local newspapers and radio and television stations to refrain from printing and broadcasting. That route would have been as equally ineffective as against sequestering the jury.\n\nNonetheless, the majority today blithely states that \"There is no indication that any juror was exposed to prejudicial publicity during the course of the trial.\" Although this glib statement at first glance appears to be sound, a careful analysis of the majority's ruling demonstrates exactly how empty this proposition really is. What the majority intentionally obfuscates by this statement is the difficulty, if not impossibility of proving prejudice to the jury which would require a new trial. I.R.C.P. 59(a)(2) addresses the issue of jury misconduct:\n\n2. Misconduct of the jury; and when any one or more of the jurors have been induced to assent to any general or special verdict, or to a finding on any question submitted to them by the court, by a resort to the determination of chance, such misconduct may be proved by the affidavit of any one of the jurors.\n\nThis rule provides only one ground for jury misconduct -- if a jury determination was\n\nmade by chance. Hence, any other form of prejudicial influence cannot be used as a ground for challenging the verdict and the aggrieved party is completely foreclosed from inquiring into the existence of prejudice. See, G. Bell, Handbook of Evidence for the Idaho Lawyer 7-9 (1972). There is no method for an aggrieved party to determine if any juror was exposed to prejudicial publicity during the course of the trial, so clearly there can be no indication of such in the record. The majority's circuitous reasoning that there was no abuse of discretion by the trial court in failing to sequester the jury will leave even the most sophisticated legal mind completely bedazzled.\n\nThe majority contentedly declares that such matters are in the discretion of trial Judges. I am persuaded, however, to the better views of a unanimous Court of Appeals in Sheets v. Agro-West, Inc., 104 Idaho 880, 887, 664 P.2d 787 (1983), wherein it was said:\n\n\"Discretion\" has been defined as a power or privilege to act unhampered by legal rule. Black's Law Dictionary at 553 (rev. 4th ed. 1968). However, \"judicial discretion\" is a more restrained concept. Lord Coke is said to have defined judicial discretion as an inquiry into \"what would be just according to the laws in the premises.\" Id. Judicial discretion \"requires an actual exercise of judgment and a consideration of the facts and circumstances which are necessary to make a sound, fair, and just determination, and a knowledge of the facts upon which the discretion may properly operate.\" 27 C.J.S. Discretion at 289 (1959). Discretion which violates these restraints is discretion abused.\n\nTherefore, to determine whether discretion has been abused, an appellate court must ascertain whether the trial Judge has correctly perceived the \"law in the premises\" and has demonstrated due \"consideration of the facts and circumstances.\" In Lisher v. Krasselt, 96 Idaho 854, 857, 538 P.2d 783, 786 (1975), our Supreme Court said:\n\n\"We decline to ascribe a definitive meaning to the amorphous phrase 'abuse of discretion' solely for the purposes of this case, but it will suffice to say, that where the trial court has exercised such discretion after a careful consideration of the relevant factual circumstances and principles of law, and without arbitrary disregard for those facts and principles of Justice, we will not disturb that action.\"\n\nThe clear import of Lisher is that an appellate court should not substitute its discretion for that of a trial court. This may seem a statement of the obvious, but it carries a profound implication. Appellate review of judicial discretion should not be result-oriented. An appellate court should not focus primarily upon the outcome of a discretionary decision below, but upon the process by which the trial Judge reached his decision. In order for the appellate court to perform this function properly, it must be informed of the reasons for the trial court's decision. Unless those reasons are obvious from the record itself, they must be stated by the trial Judge. Where the reasons are neither obvious nor stated, the appellate court is left to speculate about the trial court's perception of the law and knowledge of the facts. As a practical matter, the appellate court finds itself locked into a result-oriented review.\n\nHere, the reasons for changing venue away from Orofino in Clearwater County are obvious. A strong showing presumably was made of excessive publicity. But, as to not sequestering the jury, we are given no inkling of any legal reasoning which guided\n\nthe trial court. The court mentioned a \"waste of time,\" but that makes no sense. Perhaps the court meant to say a waste of time and money. That would be some justification, but very slight. Attendant to any criminal trial it is inescapable that public moneys are going to be spent -- sometimes a small fortune. But that is the price to be paid for maintaining our criminal Justice system.\n\nAbsent any legal reasoning for not sequestering the jury, and where undue publicity by the Lewiston newspaper necessitated the change in venue from Orofino, presumptively it was error to try the case, whether the trial remained in Orofino or whether it was removed to Moscow in adjacent Latah County, without keeping that continuing publicity from the jury. The court's failure to conduct a hearing or to set out any reasons, plus the manner in which the decision was predetermined and announced to the jury, makes the decision highly suspect.\n\nMoreover, the publicity which preceded the trial and mandated the change of trial, then continued through the trial. And, unless I miss it from the record, the court made no request of the media that it not play up the trial. So, the trial proceeds with all of the publicity which had gone on before, some of which as concerns only the Lewiston Tribune[Footnote 1] counsel for defendant has documented in his brief, which is appended hereto as Appendix A. With that publicity and the trial involving other conduct of defendant and his wives and girl friends, going back as far as 13 years before the homicide, a goodly crowd was surely on hand. And, the trial Judge by his non-sequestering ruling was made to appear as the best of persons.\n\nTHE JUMP FROM OROFINO TO MOSCOW\n\nThe majority also asserts there was no error in the change of venue from Orofino to Moscow. On March 11, 1982, defense counsel moved for a change of venue based on the voluminous pre-trial publicity given by the Lewiston Morning Tribune and requested the court to set the cause in a location outside of the publication area of the Lewiston Morning Tribune. On March 25, 1982, the trial court heard argument on the motion for a change of venue and granted it, reserving for a later date the designation of a place for the trial. On August 30, 1982, the district court ordered the cause set for trial in Latah County, also located in the Second District. Hence, although the district court granted defendant's motion for a change of venue, the court completely ignored the reason the change of venue was requested: the defendant specifically requested the trial be held outside the distribution area of the Lewiston Morning Tribune. The district court moved the cause to a location within the circulation area of the Lewiston Morning Tribune -- in fact, to a location closer to Lewiston, and certainly more accessible to reporters for the paper. This change of venue undermined completely defendant's reason for requesting a change of venue. The only beneficiary discernible was the Judge himself -- who then presided over the trial in his own home town. Having some knowledge of the two areas involved, cultural, refined Moscow, and industrial Orofino, I cannot believe other than that the defendant was prejudiced by the change of venue which he had requested. As Justice Stevens well pointed out, a jury is the conscience of the community, the community being that from whence the jury is drawn.\n\nMoreover, the change of venue to Latah County, with Moscow being the location of the county courtroom, only exacerbated the adverse pre-trial publicity problem defense counsel was attempting to correct with his request for a change of venue. Not only would the Lewiston Morning Tribune have more convenient access to the courtroom in Moscow, but the local Moscow\n\nnewspaper, The Idahonian, also had easier access to trial; the combined circulation of these two newspapers is certainly much higher, hence, making the pre-trial, and then the trial, publicity much greater in Moscow than in Orofino. The district Judge's blatant disregard for the convergence of these factors made the granting of defendant's motion for a change of venue worse than meaningless. The change of venue to Moscow escalated the already voluminous pre-trial publicity. Not to forget that this was the first torture murder ever in Idaho.\n\nMoving the trial to Moscow, combined with the district court's flagrant disregard for the purpose and necessity of sequestering a jury, displays an abysmal lack of recognition by the trial court of the realities of human nature. The jury was asked to do that which the court should have done for them: place them in a location free from any outside influence of family, friends or news reports. Likewise, what will plainly appear to most observers is also ignored by the majority today when it states: \"There is no indication that any juror was exposed to prejudicial publicity during the course of the trial.\" Hence, the purported naivete of the majority astounds this old country practitioner.\n\nThere is a difference between a refusal to change venue and the granting of a change of venue to a location more adverse than the original location of the trial. The majority states that it was not reversible error for the lower court to not move the trial to a venue \"acceptable to the defendant\" -- if the defendant cannot establish that he did not actually receive a fair trial, and where there was no difficulty in selecting a jury. No one, not the defense counsel, and not this writer, contends that defendant can choose acceptable venue. The majority again is guilty of dealing in twisted phrases. Defendant did not attempt to dictate the place of new venue. His objection was to a trial at Moscow, or any place where the Lewiston paper had a large circulation. In other years the Court has not been so obtuse and unlistening.\n\nTHE CALIFORNIA CASE LAW AND THE CONSTITUTIONALITY OF I.C. § 18-4001 AS CONCERNS TORTURE MURDER\n\nThe majority, upon observing the lack of any case law in Idaho to guide the Court in reviewing its first torture-murder case, properly turns to California. It was from California that our first Idaho Criminal Practice Act of 1864 was borrowed by the First Territorial Legislature. People v. Ah Choy, 1 Idaho 317 (1870). Torture murder was declared to be murder in the first degree by § 189 of the California Penal Code in the same language as that now found in I.C. § 18-4001. As in Idaho, the California legislature, even in those early days, saw no reason to define torture. The California legislature to this day has not defined torture murder. However, the Supreme Court of California did do so. Where Idaho has accepted a California criminal statute, ordinarily it will accept an interpretation of that statute made by the Supreme Court of that state. Citations are unnecessary. But, this Court has also said that it is not bound to do so. Citations would be superfluous. Under present circumstances, where before this Court had cause to consider a proper definition of torture murder, the legislature intervened to furnish its definition.\n\nBecause some of that definition jibes with the judicial definition of the California court, there is good reason to apply the case law from California where we have no precedential case law to guide us. But, I am not in the least convinced that in doing so we can pick and choose. Rather, I firmly believe that where our legislative definition of torture murder, in part, obviously was borrowed from the California Supreme court's definition, we should look to all case law from California for guidance. And, where the Idaho legislature has manufactured some alternative definitions of murder by torture which do away with the essential element of intent, then it behooves this Court to become extremely concerned with the constitutionality of such\n\ndefinition. Here at stake is a legislative definition of murder by torture wholly unlike anything we see in the California case law, upon which great reliance is placed. This Court has heretofore not shirked its obligation to examine the constitutionality of a legislative definition which criminalizes certain conduct. Less than eight years ago, Justice Shepard, in writing the Court's opinion invalidating the legislature's definition of prostitution, reasoned thusly:\n\nAmong English speaking people the term prostitution has a meaning which is historic and may be said to be well understood by persons of common intellect. At common law, prostitution was generally understood to apply only as against women and usually only in connection with sexual intercourse for hire. 63 Am.Jur.2d, Prostitution § 1; State v. Clark, 78 Iowa 492, 43 N.W. 273 (1889). Therefore if our legislature had not attempted to define prostitution the position of the State might be sustainable. However, contrary to the position of the State, there is no longer in Idaho a traditional definition of prostitution since I.C. § 18-5613 clearly reflects a legislative attempt to redefine prostitution more expansively with application to male as well as female and to also expand the traditional definition to include a proscription against homosexual and other deviate conduct.\n\nThe concept of void-for-vagueness arose from a common law practice of refusing to enforce legislation deemed too indefinite to be applied. See, Amsterdam, \"The Void-for-Vagueness Doctrine in the Supreme Court,\" 109 U.Pa.L.Rev. 67 (1960). It has evolved to a protection generally regarded as embodied in a Due Process Clause and prohibits holding a person \"criminally responsible for conduct which he could not reasonably understand to be proscribed.\" U.S. v. Harriss, 347 U.S. 612, 617, 74 S.Ct. 808, 812, 98 L.Ed. 989 (1954). In addition to this notion of \"fair notice of warning\" the doctrine is said to require reasonably clear guidelines to prevent \"arbitrary and discriminating enforcement\" and to prescribe a precise standard for the adjudication of guilt. Smith v. Goguen, 415 U.S. 566, 94 S.Ct. 1242, 39 L.Ed.2d 605 (1974). See also, Amsterdam, supra, at 76. The principle consistently followed is that \"a statute which either forbids or requires the doing of an act in terms so vague that men of common intelligence must necessarily guess at its meaning and differ as to its application violates the first essential of due process of law.\" Connally v. General Constr. Co., 269 U.S. 385, 391, 46 S.Ct. 1256, 127, 70 L.Ed. 322 (1926); Lanzetta v. New Jersey, 306 U.S. 451, 453, 59 S.Ct. 618 [619], 83 L.Ed. 888 (1939); Papachristou v. City of Jacksonville, 405 U.S. 156, 92 S.Ct. 839, 31 L.Ed.2d 110 (1972); State v. Pigge, 79 Idaho 529, 532, 322 P.2d 703, 705 (1957); State v. Thomas, 94 Idaho 592, 594, 494 P.2d 1036 (1972).\n\nIn the instant statute as it existed at the time in question here, the legislature sought to define the term \"prostitution\" but failed to use clear and unambiguous language to provide notice of the proscribed conduct. State v. Lopez, 98 Idaho 581, 589-90, 570 P.2d 259, 267-68 (1977) (emphasis added).\n\nThe situation here is exactly that which the Court encountered in Lopez, with one difference. Here, we do not need to pass upon the constitutional issue if the Court is willing to concede the gross error earlier pointed out. I make reference to the charge of the complaint and the fatal (no play on words intended) variances there-from in the trial court's instructions. The defendant was charged with the fatal striking of the boy with the intent to inflict extreme pain, or with the intent to satisfy some sadistic inclination of the defendant, but the court instructed the jury that \" It shall also be torture to inflict on a human being extreme and prolonged acts of brutality irrespective of proof of intent to cause suffering \" -- language which is found in § 18-4001, but which was wholly not included in the charge upon which the defendant was put to trial. And, as earlier\n\npointed out, the trial court also, as though there were a two-count information, instructed the jury on the willful, deliberate and premeditated killing, the language of § 18-4003.\n\nNow, if the Court lives up to its responsibility, it will reverse and remand for that gross error. In that event a word to the legislature may well suffice, and it will not be necessary to invalidate portions of § 18-4001. But, if the Court had lived up to its responsibility, it would have some time ago ruled that the framers of our Idaho Constitution, as reflected in the historical documentation of their debates, painstakingly assured that no person's life would be taken as punishment for his crimes other than by a jury of his peers -- the conscience of the community, and not an elected government official, to use the language of Justice Stevens.\n\nSuch being the state of affairs, if enough has not been written to arouse the other members of the Court, there is little to be gained by a one-person dissertation on the subject. I mention only that the very language of the Court's 1977 Lopez opinion is clearly applicable. Beyond that, the legislative abolition of intent in its alternative definition of murder by torture is clearly in conflict with the first definition, that which was properly adopted from the California Supreme Court, and also in headlong conflict with § 18-114: \"In every crime or public offense there must exist a union, or joint operation, of act and intent, or criminal negligence.\" Under the following section, § 18-115, intent or intention may be established by circumstances, but it has always been required.\n\nReturning briefly to the California case law on torture murder, it is to be first noted that People v. Steger, 16 Cal.3d 539, 128 Cal.Rptr. 161, 546 P.2d 665 (1976) was the case which precipitated the prosecuting attorney's determination at the outset to attempt to bring in collateral acts of misconduct on defendant's part as somehow proving that defendant was guilty of murder by torture on the 19th day of September, 1982.[Footnote 2] What the Steger Court said is\n\nbest derived from the Pacific Reporter, complete with footnotes:\n\n\"Section 189 of the Penal Code provides in relevant part: 'All murder which is perpetrated by means of . . . torture, or by any other kind of willful, deliberate, and premeditated killing . . . is murder of the first degree. . . .'\n\n\"Three decades ago, this court strictly construed the definition of torture in section 189. In People v. Heslen (1945), Cal., 163 P.2d 21, 27, modified (1946), 27 Cal.2d 520, 165 P.2d 250, we said: 'Implicit in that definition is the requirement of an intent to cause pain and suffering in addition to death. That is, the killer is not satisfied with killing alone. He wishes to punish, execute vengeance on, or extort something from his victim, and in the course, or as the result of inflicting pain and suffering, the victim dies. That intent may be manifested by the nature of the acts and circumstances surrounding the homicide.'\n\n\"This restrictive definition of torture was reemphasized in People v. Tubby (1949), 34 Cal.2d 72, 77, 207 P.2d 51, 54: 'In determining whether the murder was perpetrated by means of torture the solution must rest upon whether the assailant's intent was to cause cruel suffering on the part of the object of the attack, either for the purpose of revenge, extortion, persuasion, or to satisfy some other untoward propensity. The test cannot be whether the victim merely suffered severe pain since presumably in most murders severe pain precedes death.'\n\n\"As will be shown below, we have consistently followed this strict construction of\n\ntorture in cases applying section 189. However, a few Courts of Appeal, in cases somewhat similar to the present, have upheld torture murder convictions by liberally construing the Heslen and Tubby holdings. n.1 These courts have inferred the presence of 'specific intent to cause cruel suffering' almost exclusively from the severity of the wounds on the victim's body. For example, the court in People v. Misquez (1957) supra, 152 Cal.App.2d 471, 480, 313 P.2d 206, 212, reasoned, 'The brutal and revolting manner in which defendant mistreated the child leads inevitably to the Conclusion that he intended to cause cruel pain and suffering.' To determine whether such a liberal construction of Heslen and Tubby is permissible we must examine how torture fits into the scheme of first degree murder in California.\n\nn.1 See, e.g., People v. Lawhon (1963), 220 Cal.App.2d 311, 33 Cal.Rptr. 718; People v. Butler (1962), 205 Cal.App.2d 437, 23 Cal.Rptr. 118; People v. Misquez (1957), 152 Cal.App.2d 471, 313 P.2d 206. See also State v. Kountz (1972), 108 Ariz. 459, 501 P.2d 931.\n\n\"Murder, the unlawful killing of another human being with malice aforethought, is undoubtedly one of the most heinous crimes that can be committed in a civilized society. Given the gravity of the act, it may not be readily apparent why the law should distinguish between degrees of murder. In fact, the early common law made no distinctions: murder, regardless of its characteristics, was punished with death. (1 Warren on Homicide (1914) § 77, p. 353.) But in 1794 Pennsylvania adopted a statute defining two degrees of murder, and other states soon followed.\n\n\"There appear to be two major reasons for delineating separate degrees of murder and imposing different punishments. (See Hart, Punishment and Responsibility (1968) pp. 60-61; Pike, What is Second Degree Murder in California? (1936) 9 So.Cal.L.Rev. 112, 133.) First, some murders can more easily be prevented than others by the deterrent effect of severe penalties: e.g., a hired assassin is more likely to reflect upon the possibility of imprisonment for life than an enraged husband who shoots his wife in a drunken Saturday night quarrel. (See Zimring \u0026 Hawkins, Deterrence (1973) pp. 194 ff.) Second, society draws a moral distinction between murders: as morally wrong as murder per se is, some murders are more deplorable than others. Society instinctively senses a greater revulsion for a calculated, deliberate murder than it does for any other type of killing. As Professor Hart puts it, there is a distinction 'universally felt between, e.g., the cold-blooded murderer out for gain and the woman who kills an imbecile child to whom she can no longer attend.' (Hart, op. cit. supra at p. 61.) Only by appropriately circumscribing the application of first degree murder can society preserve that pervasive moral distinction.\n\n\"These goals are a significant aspect of the law of homicide in California. Under section 189 of the Penal Code, first degree murder is primarily wilful, deliberate, and premeditated murder. With a few limited exceptions, all other unlawful killing is second degree murder or manslaughter.\n\n\"In interpreting the statutory standard of wilful, deliberate, and premeditated murder, this court, perhaps with greater consistency than courts in many states, 'affords more than lip service to the strict definitions.' (Note, Deliberation and Premeditation in First Degree Murder (1961) 21 Md.L.Rev. 349, 353.) Thus, the prosecution is required to prove not only the elements of murder, but also the aggravating elements of first degree murder. (People v. Thomas (1945) 25 Cal.2d 880, 895, 156 P.2d 7.) We have held, 'By conjoining the words \"willful, deliberate, and premeditated\" in its definition and limitation of the character of killings falling within murder of the first degree, the Legislature apparently emphasized its intention to require as an element of such crime substantially more reflection than may be involved in the mere formation of a specific intent to kill.' (Id. at p. 900, 156 P.2d at p. 18.) Further, we have declared that '\"Deliberation means careful consideration and examination of the reasons for and against a choice or measure.\" [Citation.]' (People v. Bender (1945) 27 Cal.2d 164, 183, 163 P.2d 8, 19.)\n\n\"In this perspective the phrasing of section 189 becomes clearer: 'All murder which is perpetrated by means of . . . torture, or by any other kind of willful, deliberate,\n\nand premeditated killing . . . is murder of the first degree. . . .' In labeling torture as a 'kind' of premeditated killing, the Legislature requires the same proof of deliberation and premeditation for first degree torture murder that it does for other types of first degree murder. n.2\n\nn.2 We have said that 'When a killing is perpetrated by means of torture, the means used is conclusive evidence of malice and premeditation, and the crime is murder of the first degree.' (People v. Turville (1959) 51 Cal.2d 620, 632, 335 P.2d 678, cert. den. 360 U.S. 939, 79 S.Ct. 1465, 3 L.Ed.2d 1551.) For each case, however, the question which must first be answered is whether there was 'torture' within the meaning of the statute. It is possible to inflict severe and prolonged pain on another without deliberation or premeditation, but it may not be torture under section 189. (Cf. People v. Mattison (1971) 4 Cal.3d 177, 93 Cal.Rptr. 185, 481 P.2d 193 (sale of lethal methyl alcohol to fellow prison inmate held not to be first degree murder by poison in absence of any proof of intent to kill or injure).)\n\n\"The element of calculated deliberation is required for a torture murder conviction for the same reasons that it is required for most other kinds of first degree murder. It is not the amount of pain inflicted which distinguishes a torturer from another murderer, as most killings involve significant pain. (People v. Tubby (1949) supra, 34 Cal.2d 72, 77, 207 P.2d 51.) Rather, it is the state of mind of the torturer -- the coldblooded intent to inflict pain for personal gain or satisfaction -- which society condemns. Such a crime is more susceptible to the deterrence of first degree murder sanctions and comparatively more deplorable than lesser categories of murder.\n\n\"Accordingly, we hold that murder by means of torture under section 189 is murder committed with a wilful, deliberate, and premeditated intent to inflict extreme and prolonged pain. In determining whether a murder was committed with that intent, the jury may of course consider all the circumstances surrounding the killing. Among those circumstances, in many cases, is the severity of the victim's wounds. We admonish against giving undue weight to such evidence, however, as the wounds could in fact have been inflicted in the course of a killing in the heat of passion rather than a calculated torture murder.\n\n\"We do not hold that a defendant must have had a premeditated intent to kill in order to be convicted of murder by means of torture; such an interpretation would render superfluous the specific inclusion of murder by torture in section 189. A defendant need not have any intent to kill to be convicted of this crime (People v. Mattison (1971) supra, 4 Cal.3d 177, 183, 93 Cal.Rptr. 185, 481 P.2d 193), but he or she must have the defined intent to inflict pain.\n\n\"Our Conclusion is consistent with the prior opinions of this court on torture murder. The cases affirming convictions for murder by means of torture have, with one possible exception, n.3 involved willful, deliberate, and premeditated infliction of pain by the defendants. For example, in People v. Daugherty (1953), 40 Cal.2d 876, 256 P.2d 911, cert. den., 346 U.S. 827, 74 S.Ct. 47, 98 L.Ed. 352, defendant, prior to killing his wife, repeatedly threatened to make her suffer for her alleged infidelity. 'He tore her nightgown from her, stabbed her several times and, from the dirt-filled abrasions on her thigh, must have dragged her along the ground. He evidently struck her in the face. And finally, when she was lying on the ground but still alive, he stood over her and kicked her.' (Id. at pp. 886-887, 256 P.2d at p. 917.) The evidence of defendant's planning and deliberation was held sufficient to convict him both of wilful, deliberate, and premeditated murder and murder by means of torture.\n\nn.3 In People v. Gilliam (1952), 39 Cal.2d 235, 246 P.2d 31, defendant, for no reason at all, beat and trampled to death a fellow prison inmate he had just met. It is arguable whether he had a calculated intent to inflict extreme pain on his victim or whether his attack was the type of explosion of violence born of 'hot anger' and 'animal fury' which the court in People v. Tubby classified as second degree murder. (34 Cal.2d at pp. 77-78, 207 P.2d 51.) The majority, upholding a torture murder conviction, emphasized that defendant gouged out his victim's eye and that the sadistic episode consumed considerable time. Justice Carter Dissented on the basis of Tubby.\n\n\" People v. Turville (1959) supra, 51 Cal.2d 620, 335 P.2d 678, represents perhaps the paradigm torture case. There the defendants repeatedly hit and kicked their victim in an effort to persuade him to open his safe. The pain was clearly inflicted in a calculated manner, and this court upheld a torture murder conviction.\n\n\"In contrast, the cases reversing torture murder convictions have focused on the lack of evidence of calculation. In People v. Bender (1945) supra, 27 Cal.2d 164, 163 P.2d 8, defendant, in a fit of anger, beat and choked his victim to death. We held, 'The killer who, heedless of the suffering of his victim, in hot anger and with the specific intent of killing, inflicts the severe pain which may be assumed to attend strangulation, has not in contemplation of the law the same intent as one who strangles with the intention that his victim shall suffer.' (Id. at p. 177, 163 P.2d at p. 16.)\n\n\"In Tubby, the defendant for no discernible reason beat his stepfather to death. According to the Dissent, 'The evidence clearly indicates that defendant chased his victim about the house inflicting terrific punishment upon him. There was blood on the porch, and on the walls and floor of\n\npractically every room in the house. The stove and stovepipe had been knocked out of place and some of the furniture had been broken during the affray. When the officers arrived, they found deceased had been beaten \"practically beyond recognition.\"' (34 Cal.2d at p. 81, 207 P.2d at p. 57.) Even so, the majority concluded that 'It is too apparent to admit of serious doubt that the unprovoked assault was an act of animal fury produced when inhibitions were removed by alcohol. The record dispels any hypothesis that the primary purpose of the attack was to cause the deceased to suffer. . . . The evidence is therefore insufficient as a matter of law to support the verdict on the theory that the homicide was murder by torture.' (Id. at p. 78, 207 P.2d at p. 55.)\n\n\"An even more gruesome murder was reviewed by this court in People v. Anderson (1965), 63 Cal.2d 351, 46 Cal.Rptr. 763, 406 P.2d 43, with similar results. In Anderson, defendant, angered at the 10-year-old daughter of his mistress, stabbed the child a total of 60 times. 'One of the cuts extended from the rectum through the vagina. Additionally, the tongue was cut.' (Id. at p. 356, 46 Cal.Rptr. at p. 766, 406 P.2d at p. 46.) Again, we held that 'the evidence in the instant case shows only an explosion of violence without the necessary intent that the victim shall suffer. . . . Accordingly, the evidence was not sufficient to convict defendant of murder in the first degree on the theory that death resulted from acts of torture.' (Id. at p. 360, 46 Cal.Rptr. at p. 768, 406 P.2d at p. 48.)\n\n\"It is clear from the foregoing analysis that on the record of the case at bar defendant cannot be guilty of first degree murder by torture. Viewed in the light most favorable to the People, the evidence shows that defendant severely beat her stepchild. But there is not one shred of evidence to support a finding that she did so with coldblooded intent to inflict extreme and prolonged pain. Rather, the evidence introduced by the People paints defendant as a tormented woman, continually frustrated by her inability to control her stepchild's behavior. The beatings were a misguided, irrational and totally unjustifiable attempt at discipline; but they were not in a criminal sense wilful, deliberate, or premeditated.\n\n\"The People emphasize that the child's wounds were inflicted over a long period of time. In some cases this fact might lend support to a torture murder conviction. For example, if a defendant had trussed up his victim, proof that pain was inflicted continuously for a lengthy period could well lead to a Conclusion that the victim was tortured. But in the present case the fact that Kristen was injured on numerous occasions only supports the theory that several distinct 'explosions of violence' took place, as an attempt to discipline a child by corporal punishment generally involves beating her whenever she is deemed to misbehave. n.4\n\nn.4 This theory is consistent with the literature on the battered child syndrome, which has been judicially recognized in this state. (People v. Jackson (1971) 18 Cal.App.3d 504, 506-508, 95 Cal.Rptr. 919.) While obviously it is impossible to typify all child-battering parents, one survey of the studies in the field concludes: 'the abuser tends to suffer from emotional pressures which are not directly related to the child himself, focuses his own general feelings of frustration and anger on the one child, and expresses his emotions through an immature and uncontrolled display of physical abuse of the child.' (Italics added.) (Note, The Battered Child: Logic in Search of Law (1971) 8 San Diego L.Rev. 364, 375.) The description seems applicable to the present defendant: her uncontrolled outbursts of frustration appear inconsistent with a theory of deliberate torture murder.\n\n\"Child-battering is a crime universally abhorred by civilized societies, particularly when it results in death. Yet our revulsion is based not so much on the means of killing, as on the realization that a defenseless, innocent life has been destroyed. If defendant, instead of repeatedly beating her stepchild, had fatally shot her once in the head, it could not be claimed seriously that the shooting would be any less subject to deterrence or any less morally offensive than the beating in the present case. Yet the shooting could not be categorized as murder by means of torture. Nor can defendant's conduct here, however, deplorable it appears to be.\n\n\"In holding the evidence does not support a conviction of first degree murder, we do not imply, of course, that a murder of a child can never be torture murder. In appropriate circumstances a child batterer can be found to be a torturer. All we hold is that here the prosecution did not prove defendant murdered her stepchild with a wilful, deliberate, and premeditated intent to inflict extreme and prolonged pain. It follows that the trial court erred in giving an instruction on torture murder. n.5 As stated in People v. Anderson (1965) supra, 63 Cal.2d 351, 360, 46 Cal.Rptr. 763, 768, 406\n\nP.2d 43, 48, '\"It is error to give an instruction which, although correctly stating a principle of law, has no application to the facts of the case.\"'\"\n\nn.5 The court also gave general first degree murder instructions on wilful, deliberate and premeditated killing. However there was no evidence of premeditation other than that related to torture. It was conceded on appeal that the prosecution tried the case entirely on a murder by torture theory.\n\nSteger, supra, 128 Cal.Rptr. at 163-67, 546 P.2d at 667-71 (emphasis added).\n\nIt is seen from reading the above that as the prosecutor noted at the preliminary hearings, intent of proof to kill is not required in a torture murder case. The proof that is required is proof of intent to inflict suffering from extreme pain -- which in and of itself proves the torture. Or, alternatively, and one supposes the language to be aimed at off-track sadistic religious cults, where the pain is not inflicted with the intent to cause suffering, or to execute vengeance, or to extort, but to satisfy some sadistic inclination. I.C. § 18-4003, Penal Code.\n\nINADMISSIBLE EVIDENCE OF UNRELATED CONDUCT\n\nThe prosecutor made a poor choice in not charging by a count for a deliberate, wilful and premeditated killing. A poorer choice was to attempt to bolster up a doubtful torture murder case by attempting to prove an intent to torture the boy by the use of unrelated antecedent conduct from which the intent might be inferred. Counsel for defendant's assessment of the admission of such evidence is: \"Clearly any small amount of probative value that the testimonies of Dally, Jacobson, and Nelson had to the crime with which Gene Stuart is charged, is far outweighed by the enormous prejudice that such testimony engendered against the defendant.\" I agree, adding only that such is an understatement. The senseless killing of a three-year-old boy would have in the first placed engendered as much jury antipathy toward the defendant as the prosecutor could have wanted. To \"try\" the defendant at the same time for uncharged bad conduct, whether criminal or not, makes it impossible to conclude that the jury might have convicted the defendant without having heard evidence unrelated to the alleged crime of torture murder.\n\nPROPORTIONALITY\n\nAs I wrote in Sivak or Bainbridge, the proportionality requirement prescribed by the Supreme Court and in turn adopted by the Idaho legislature is virtually meaningless. Proportionality in capital sentencing in Idaho will only result when first degree murder charges are all tried to a jury, and the jury also as the conscience of the community makes the awesome decision of life or death where a first degree murder verdict is returned.\n\nHow there can ever be any real proportionality continues to escape me where prosecutors exercise a divine right to reduce the charge and to ask or not ask for the death penalty, as may at the moment so move them. Recently the citizens of Ada County were given to understand that the prosecutor had decided that on a guilty plea to the execution-style murder of a girl in her twenties, he would not ask for the death penalty. Other defendants so accused do not fare so well. Such matters are not for mortal prosecutors, but for mortal jurors.\n\nAPPENDIX A\n\nThe following pages are true and correct photocopies of newspaper coverage given appellant's trial by the Lewiston Morning Tribune, a daily newspaper with its offices at Lewiston, Idaho and which circulates commonly in the Moscow, Ida ho area. Additionally, the following include photocopies of coverage given appellant's trial from October 5, 1982 until October 14, 1982 by the Daily Idahonian, a daily newspaper printed and circulated in Moscow, Idaho.\n\nLewiston Morning Tribune/Tuesday, October 5, 1982\n\nJury selection resumes in Stuart murder trial\n\nBy David Johnson of the Tribune\n\nMOSCOW -- Jury selection in the Gene Stuart murder trial will resume at 9 a.m. today, with prosecution and defense attorneys attempting to choose a 12-member panel from a group of some 50 prospective jurors.\n\nStuart, a 31-year-old auto-body repair man from Orofino, is charged with first-degree murder by torture in connection with the Sept. 19, 1981, death of 3-year-old Robert Miller, the son of the women with whom Stuart was living.\n\nAccording to the criminal complaint, which was read to all prospective jurors in Second District Court here Monday, Stuart allegedly caused the Miller child's death. An autopsy, according to testimony at the preliminary hearing last November, showed that the Miller boy died of internal bleeding from a severe blow or blows to the abdomen.\n\nA change of venue from Orofino to Moscow was granted earlier by District Judge Andrew Schwam after Stuart's attorney, Clearwater County Public Defender Robert Kinney, contended that pre-trial publicity would make it impossible to assemble an impartial jury at Orofino.\n\nKinney speculated that a jury may be selected today. He and Clearwater County Prosecutor Steve Calhoun carefully questioned prospective jurors throughout the day Monday.\n\nSchwam dismissed two prospective women jurors for cause. One woman said she had received information about the case through the news media, talked with her mother-in-law about the matter and at one time had formed an opinion about Stuart's innocence or guilt. The other woman said she was uncertain whether she could cope with the kind of evidence that is expected to be brought out at the trial and remain unbiased.\n\n\"Much of the evidence may be unpleasant,\" Calhoun warned each prospective juror questioned.\n\nKinney last week moved that the jury, once assembled, be sequestered. Schwam denied that motion, but has already admonished all prospective jurors to not discuss the case or read or listen to any news accounts about the trial.\n\nStuart appeared in court wearing a pinstriped gray suit and sat at Kinney's side throughout the questioning Monday. Kinney repeatedly asked the prospective jurors whether they agreed that Stuart, unless he is proven guilty beyond a reasonable doubt, must be considered innocent. All the jurors questioned said they would wait until after both the prosecution and defense rested their cases to form any opinions about the evidence.\n\nClearwater County authorities say the Stuart case has involved the most exhaustive investigation ever conducted in a criminal\n\nmatter there. Both the prosecution and defense have investigated circumstances not only surrounding the Miller child's death, but also involving Stuart's past.\n\nThe trial is expected to last about two weeks.\n\nBoth Kinney and Calhoun warned the prospective jurors that the trial may be \"highly emotional.\" They questioned each person about their feelings on child-rearing and discipline, corporal punishment, marital relationships, child abuse and physical violence. Most of the jurors questioned said they favored corporal punishment as a \"last resort\" and all said they had used it on their own children at one time or another.\n\nIn order for Stuart to be convicted of first-degree murder, the prosecution must prove that the defendant tortured the Miller boy and that death resulted, according to Idaho law.\n\nNorthwest\n\nDOUBLE CLICK TO VIEW PHOTO\n\nStuart\n\nNurse tells of efforts to save boy\n\nBy David Johnson of the Tribune\n\nMOSCOW -- Testimony in the Gene Francis Stuart murder trial began Tuesday in Second District Court here with a registered nurse identifying the defendant as the man who brought a \"lifeless\" 3-year-old Robert Miller to the emergency room at Orofino's Clearwater Valley Hospital on Sept. 19, 1981.\n\nStuart, a 31-year-old auto body repair man from Orofino, is charged with murder by torture in connection with the Miller child's death. He allegedly struck the boy repeatedly, according to the criminal complaint.\n\n\"I heard somebody yelling and shaking the door, trying to get in,\" said Jesse Mechling, a registered nurse who said he was working in the respiratory therapy section of the hospital when Stuart arrived, carrying the Miller child in his arms. Mechling described the boy as \"pale, lifeless and limp.\"\n\nThe testimony came shortly after a 12-member jury, made up of five men and seven women, was selected to hear the case. One man and a woman also were chosen as alternate jurors.\n\n\"The evidence is going to be unpleasant, but it is evidence that must be considered,\" Clearwater County Prosecutor Steve Calhoun told the jury during his opening statement.\n\nClearwater County Public Defender Robert Kinney reserved his opening comments for later in the trial.\n\nCalhoun told the jury that he will call more than a dozen witnesses in his effort to prove that Stuart had a history of abusive behavior toward others and that be intended to torture the Miller child. One of the witnesses will be Robert Miller's mother, Kathie Miller, who was living with Stuart at the time of the child's death.\n\nThe trial is being held in Moscow after Second District Judge Andrew Schwam ordered a change of venue from Orofino. Kinney moved for the venue change on grounds that it would be impossible to assemble an impartial jury within the circulation area of the Lewiston Tribune. The Tribune and several other news organizations gave extensive coverage to Stuart's preliminary hearing last November.\n\nKinney objected to the trial being held in Moscow, since the Tribune circulates here, but Schwam maintained that a jury could be found. Jury selection ultimately lasted just one and one half days, with the jurors taking their oath at 2:15 p.m. Tuesday.\n\nIn addition to Mechling, Calboun called nurse Mary Gay Cone as a witness. Cone was also on duty at Clearwater Valley Hospital when Stuart brought Miller child to the emergency room.\n\nMechling testified that he, Cone and other hospital staff members tried in vain for some 30 to 40 minutes to revive the Miller child. He said he checked for pulse and other vital signs, but found none. He also said the boy had a number of bruises, including some 20 small, round bruises on his chest. Mechling said there were additional bruises on the boy's right hip and his forehead.\n\nUnder cross examination by Kinney, Mechling said Stuart was \"very demanding and very scared.\" He said Stuart appeared to be concerned about the child and kept demanding that the emergency room staff do something.\n\nKinney questioned Mechling extensively about the boy's vital signs. Mechling said that at no time did he find any sign of life. He said that after the child was pronounced dead, he tried to get a temperature from the body but no temperature registered on the thermometer.\n\nCalhoun told the jury during his opening statement that the state will prove that Stuart used various means of severe punishment to discipline the Miller boy, including spankings and cold showers. The prosecutor said a pathologist who conducted an autopsy on the child will testify that the boy died of internal bleeding from a torn liver caused by a severe blow or blows to the abdomen by a blunt object.\n\nAccording to Idaho law, the prosecution must prove that Stuart tortured the Miller child and that death resulted. Much of the state's case is expected to revolve around the last three witnesses Calhoun said he will call. They are two of Stuart's former wives and a live-in girlfriend. The three women, Galhoun told the jury, will provide testimony that proves that Stuart hid a history of abusive behavior and intended to torture the child.\n\nThe women all testified almost one year ago at Stuart's preliminary hearing in Orofino. Kinney entered a continuing objection at the time, contending that the testimony was irrelevant and immaterial to the charge. The debate involves a question of law and will probably require that Schwam make a ruling on whether he will allow the women to testify.\n\nSchwam has admonished the jurors not to read or listen to any news reports on the trial or to discuss the case with anyone until after they deliberate. The trial is expected to last two weeks.\n\nWomen testify that Stuart beat, choked them\n\nBy David Johnson of the Tribune\n\nMOSCOW -- The prosecution rested its case Friday evening in the Gene Francis Stuart murder trial after four women testified that they were victims of repeated physical abuse by the defendant.\n\n\"He hit me when I was pregnant in the abdomen,\" said Sharie Dally, Stuart's first wife.\n\n\"He gave me what he called reasons (for the beatings), but to me, there were no reasons,\" said Stuart's second wife, Vicki Nelson.\n\n\"When Gene gets mad or loses his temper, you just don't know what he's going to do or what he has planned for you,\" said Theresa Jacobson, who lived with Stuart for about three months.\n\nThe fourth woman, Delores Strong, testified that Stuart assaulted and raped her in an auto body shop at Orofino.\n\nStuart, 31, is charged with first-degree murder by torture in connection with the Sept. 19, 1981, death of three-year-old Robert Miller of Orofino. Stuart struck the child repeatedly, according to the criminal complaint. Stuart was living with the boy's mother, Kathie Miller, at the time of the death and had assumed a parental role with the child.\n\nThe testimony from the four women, contends Clearwater County Prosecutor Steve Calhoun, is critical to show Stuart's propensity for violence and is directly linked to the defendant's alleged intention to torture the Miller boy.\n\nDefense attorney Robert Kinney, however, has objected to the testimony on grounds that it is prejudicial and not directly linked to the child's death.\n\nSecond District Judge Andrew Schwam, in an attempt to closely monitor the kind of testimony entered into evidence, instructed the jury of seven women and five men to consider the testimony only as it may relate to Stuart's intentions at the time of the boy's death. Schwam, Calhoun and Kinney held many private conferences throughout Friday's proceedings in an apparent effort to head off any testimony that may have fallen outside the scope of the Judge's instructions.\n\nThe defense is scheduled to begin its case at 9 a.m. Tuesday. Kinney told reporters he's \"still thinking\" about whether he'll call Stuart to the witness stand in his own defense. He said he may call as many as six other witnesses.\n\nDally testified that she married Stuart at the age of 17. She estimated that during their three years of marriage, Stuart physically abused her more than 30 times. She said he struck her about the head, arms and back, poked her in the chest with his finger and choked her.\n\n\"Usually the next day after he hit me, he'd cry,\" Dally said. Asked by Calhoun why she remained with Stuart, Dally said, \"At that time in my life I loved him. I had two children and I was young and innocent.\n\nI didn't know what to do.\"\n\nJacobson related several alleged incidents of physical abuse at Stuart's hands. She said he once tried to remove an intrauterine device from her and terrorized her with threats at other times.\n\nDuring one incident, Jacobson told the jury, Stuart cut clothing off of her with a butcher knife. On another occasion, she said, he tried to drown her in a lake.\n\n\"He said, 'You're not leaving me. I'm going to kill you,'\" Jacobson said. She said Stuart held her under until her lungs began to fill with water, then he released her.\n\n\"He stood up and said 'My mother doesn't even love me,'\" Jacobson said.\n\nUnder cross examination by Kinney, Jacobson said Stuart said he threw her in the lake to \"sober me up.\"\n\nNelson said the beatings she took from Stuart began about three weeks after they were married and became an \"every-other-day\" occurrence. She testified that she still has several scars and \"chipped teeth\" from the beatings. She said Stuart poked her in the chest with his finger, choked her, knocked her to the floor and struck her in the face with his fists.\n\nNelson said Stuart beat her for smoking, watching television or taking showers without him. Once at Christmas, she said, Stuart beat her because she had received a set of luggage from her parents.\n\nDuring one incident, Nelson said, Stuart locked her two-year-old daughter in the bathroom for nine hours.\n\n\"Gene kept me on the couch in the living room,\" she said, while her daughter cried from the bathroom. She said Stuart locked all the house doors and wouldn't allow her to move.\n\n\"I ended up urinating on myself,\" Nelson said, breaking into tears.\n\nAt that point in the testimony, Calhoun, shaken himself, asked for a recess, which Schwam granted.\n\nNelson resumed her testimony minutes later, describing yet another alleged incident when she said Stuart knocked her out and she woke, finding herself tied in bed. She was pregnant and Stuart was straddling her on the bed, she said.\n\n\"Gene was like he was in a rage. He said I could leave if I wanted to, but I wasn't going to take his baby. He kept saying it won't hurt, it will all be over soon.\" Nelson said Stuart then covered her face with a pillow and began hitting her in the abdomen. She said he would strike her several times, then take the pillow away and revive her with a wet washcloth.\n\n\"Then he'd cry,\" Nelson said, and resume striking her in the abdomen.\n\nAs with the other women, Calhoun asked Nelson why she continued to stay with Stuart. \"At first, it was because I loved him and then later it was because I was afraid of him,\" she said.\n\nNelson also testified that bruises shown in photographs of the dead Miller child's body matched the kind she sustained during beatings from Stuart.\n\nKinney, on cross examination, asked all of the women about slight discrepancies between their testimony Friday and the transcripts from the preliminary hearing one year ago. In each case, the women said they had had a year to think about what happened and they adhered to their trial testimony.\n\nStuart again remained silent throughout the proceedings, but during at least one recess turned around and carried on a conversation with people in the audience.\n\nDid Stuart mean to torture Miller boy? Legality stifles testimony\n\nBy David Johnson of the Tribune\n\nMOSCOW -- The central legal question that may decide the fate of accused murderer Gene Francis Stuart surfaced Wednesday during the second day of trial testimony here and left the prosecution reassessing its strategy.\n\nStuart, a 31-year-old auto body repairman from Orofino, is charged with first-degree murder by torture in connection with the Sept. 19, 1981, death of 3-year-old Robert Miller.\n\nMuch of the prosecution's case, as outlined by Clearwater County Prosecutor Steve Calhoun during his opening statement to the jury, will swing on testimony about Stuart's alleged abusive behavior in the past. The testimony, Calhoun told the jury, will support the state's contention that Stuart intended to torture the Miller boy, and death resulted.\n\nBut Clearwater County public defender Robert Kinney objected Wednesday when Calhoun began questioning Kathie Miller, the dead child's mother, about alleged abuse she sustained at Stuart's hands.\n\nKinney labeled the testimony \"irrelevant\" because it had no direct link to the child's death.\n\nDistrict Judge Andrew Schwam, after listening to arguments by each attorney outside the presence of the jury, sustained Kinney's objection. Schwam then suggested that Calhoun first dispose of all evidence directly linked to the Miller child's death before attempting to introduce testimony aimed at proving Stuart intended to torture the boy. Schwam said he would then rule again on whether to allow the testimony.\n\nBefore the defendant can be convicted of first-degree murder, Idaho law requires that the prosecution prove that Stuart intended to torture the Miller boy.\n\nCalhoun told Schwam that part of Kathie Miller's testimony and the testimony of two of Stuart's former wives and a live-in girlfriend is critical to establishing the intent to torture. Without the testimony, Calhoun contends, there would be little to differentiate between 'abuse versus an emotional outbreak.\"\n\nKinney has maintained since the preliminary hearing almost a year ago that the state lacks evidence to support the torture charge. At one point in the preliminary hearing, he moved that Stuart be bound over to district court on a charge of manslaughter, not first-degree murder. The motion was denied by Magistrate Ralph Haley.\n\nIn other trial testimony Wednesday, Lewiston pathologist Robert Cihak told the jury that the Miller boy died of internal bleeding from the liver, caused by a severe blow or blows to the abdomen by a blunt object.\n\nRobert Rears, a Clearwater County deputy sheriff at the time of the child's death, also testified that during three interviews he conducted with Stuart, the defendant admitted to disciplining. Robert Miller with spankings, striking the boy on the side of the head with the back of his hand and using his finger to poke the child in the chest.\n\nCalhoun, earlier in the day, introduced four photographs of the Miller boy's body, showing various bruises on the head, shoulder, chest, back and buttocks. The jury of five men, seven women and two alternates was allowed to view the photographs, but only after a lengthy review of the pictures by Schwam, who denied introduction of five other photographs.\n\nKinney objected to snowing the jury those photographs, saying they would have an \"inflammatory\" impact.\n\n\"This particular case, by its very nature, is volatile,\" Kinney said,\n\nKathie Miller told the jury that she met Stuart in June or July of 1980. They moved in together on Sept. 20, 1980. By mid-November, Miller said, she decided\n\nto move out.\n\n\"At the time, I thought he (Stuart) was too strict with my son,' Miller said. She said she and Stuart had a stormy relationship and that she moved in and out several times. She said Robert Miller carried a variety of bruises throughout the time she lived with Stuart. She said Stuart seemed to always have an explanation for the bruises and that at one time he admitted that he was too strict with the boy.\n\nKathie Miller is expected to take the witness stand again today at 9 a.m. The trial is being held in Moscow after Schwam granted a change of venue. Kinney had requested the venue change, contending that Stuart could not receive a fair trial in Orofino, where the case has attracted much public attention.\n\nIt is not clear at this point whether Stuart will take the stand in his own defense. The defendant has remained quietly seated beside his attorney throughout the proceedings, taking notes and on occasion conferring with Kinney.\n\nThe maximum penalty for first-degree murder by torture is death in Idaho.\n\nProsecution wins dispute in Stuart murder trial\n\nBy David Johnson of the Tribune\n\nMOSCOW -- The prosecution in the Gene Francis Stuart murder trial scored a significant legal victory Thursday and began to unfold the controversial evidence that will attempt to prove that the defendant intended to torture three-year-old Robert Miller.\n\nAn Orofino woman, who asked that her name not be published, is scheduled to take the witness stand at 9 a.m. today She is the first of several women expected to testify about Stuart's alleged propensity for violence.\n\nDistrict Judge Andrew Schwam opened the door for the evidence when he ruled that the jury of seven women and five men may consider such testimony, but only as it pertains to Stuart's alleged \"motive or intent to torture\" the Miller boy.\n\nStuart's attorney, Clearwater County public defender Robert Kinney, has objected to the testimony from the women, contending it is \"prejudicial, immaterial\" and not directly linked to the child's death.\n\nRobert Miller died Sept. 19, 1981, of internal bleeding from the liver, caused by a severe blow or blows to the abdomen with a blunt object, according to a pathologist who conducted an autopsy on the boy.\n\nStuart, according to the criminal complaint, allegedly struck the child repeatedly to satisfy a \"sadistic\" inclination.\n\nSchwam warned the jurors that some of the testimony will be \"heavily laden with emotion.\" He advised the panel to \"view critically the possible motives of the accusers\" when such testimony is entered into evidence.\n\nRobert Miller's mother, Kathie Miller, completed her testimony Thursday, some of it being offered to the jury under Schwam's strict guidelines for determining Stuart's intent at the time of the boy's death.\n\nAccording to Idaho law, the prosecution must prove that Stuart, 31, intended to torture the child and that death resulted. Several previous witnesses have testified that Stuart brought a \"limp, pale and lifeless\" Robert Miller to the emergency room at Clearwater Valley Hospital. Efforts to revive the boy, however, failed.\n\nKathie Miller, who was living with Stuart at the time of her son's death, testified Thursday morning that shortly after the boy was pronounced dead, Stuart asked her if she would come see him in jail. She also testified that on several occasions she returned home to find Robert Miller bruised and injured. She said Stuart gave the child cold showers as discipline and made the boy adhere to strict table manners. She said she found bruises on the boy's head, back, buttocks, penis and chest, as well as a silver-dollar size piece of hair missing\n\nfrom his head.\n\nMiller also was allowed by Schwam to testify about alleged acts of violence against her by Stuart. She said she had sustained dime-sized bruises on her chest, similar to those found on her son after his death. She said Stuart caused the bruises by poking her with his finger. During one altercation, she said, Stuart pushed her against a living room door, removed her glasses and slammed his fist into the wall next to her face.\n\n\"He told me that's how easy he could move my nose from one side of my face to the other,\" Miller said, talking in a quiet voice, her hands trembling through much of her testimony. She said Stuart also choked her and one time tried to snuff a cigarette on her head.\n\nDuring her one-year-long relationship with Stuart, Miller said she left him on three different occasions because of his violent behavior. Asked by Calhoun why she always came back, Miller said, \"Because I loved him and he always cried and convinced me that we could work things out.\"\n\nMiller's sister, Betsy McCroskey, also testified Thursday, telling the jury that she saw bruises on Robert Miller on several occasions.\n\nAnd a radiologist, Dr. Louis Blas, testified that x-rays taken of the Miller child's left arm on the night of his death showed two fractured bones. Blas said the fractures were probably less than one year old and had been caused by a \"direct blow.\"\n\nStill to take the witness stand for the prosecution are two of Stuart's former wives and a live-in girlfriend. All three testified at the preliminary hearing one year ago, under a standing objection from Kinney. The women, Calhoun told the jury during his opening statement, will describe how Stuart terrorized them with \"beating after beating after beating.\"\n\nKinney, during the preliminary hearing, objected repeatedly to the testimony, contending that it was prejudicial and not related to the Miller boy's death.\n\nBut Schwam has ruled that the number of incidents of alleged violent behavior by Stuart upon the Miller boy are central to the state's case and the defendant's past behavior could be at least \"circumstantially\" linked to the boy's death. He said the jury will have to ultimately make that decision.\n\nStuart has remained undaunted throughout the proceedings, sitting quietly beside Kinney, taking notes and conferring with his attorney routinely. The audience at the trial, small at first, has begun to grow as the prosecution's more critical evidence begins to unfold.\n\nIt is doubtful that the prosecution will complete its case today. The trial will not resume until next Tuesday, Monday being a legal holiday.\n\nStuart trial\n\nDefense admits to manslaughter\n\nBy David Johnson of the Tribune\n\nMOSCOW -- Clearwater County public defender Robert Kinney Tuesday began repainting what he called a \"more accurate\" picture of Gene Francis Stuart, and in an unusual courtroom move, told the jury that the defendant is guilty of manslaughter, but not first-degree murder.\n\n\"We will ask you to return a verdict of manslaughter,\" Kinney, of Orofino, said during his opening statement. \"Our evidence will show carelessness that approaches criminal negligence.\"\n\nStuart, a 31-year-old auto body repairman from Orofino is charged with murder by torture in connection with the Sept. 19, 1981, death of 3-year-old Robert Miller. Stuart allegedly caused the child's death by striking him repeatedly, according to the criminal complaint.\n\nStuart will take the stand in his own defense today, said Kinney, and will tell \"in vivid detail\" what happened the night the Miller boy died.\n\nKinney also told the jury that he will call a Spokane psychiatrist today who will testify that Stuart has a \"complex personality makeup\" and suffers from an \"intermittent explosive disorder.\"\n\n[ILLEGIBLE WORDS] meantime, Kinney attempted Tuesday to begin chipping away at the prosecution's case, calling several witnesses, including Stuart's mother, sister, half-sister, nephew, a former girlfriend and two fellow workers. All the witnesses testified that they never saw or heard Stuart abusing anyone.\n\nThe testimony was in sharp contrast to the state's witnesses, many of whom said Stuart routinely beat and abused the women in his life and administered severe reprimands to the Miller child. Stuart was living with the boy's mother, Kathie Miller, at the time of the child's death and had assumed a parental role.\n\n\"He (Stuart) never became physical. He was very caring . . . we were happy. I was happy,\" said Maureen Shale of Orofino, who said she and Stuart had developed a \"close\" relationship that ended just prior to when Stuart and Kathie Miller began living together.\n\nShale said she trusted Stuart to care for her own child during their relationship and she'd trust him with the child today. \"Gene replaced the father figure (in her son's life) for quite some time,\" she said. She said Stuart often read to her son and rocked him.\n\n\"He never posed a threat to my son in any way,\" Shale said.\n\nTwo of Stuart's fellow workers, David\n\nWhilhite and Don McDowell, both of Woodenville, Wash., where Stuart used to live, testified that the defendant appeared to have a \"normal\" marital relationship with one of his two wives and disciplined Robert Miller in a \"routine fashion.\"\n\nThe former wife, Vicki Nelson, testified last week that she was subjected to repeated beatings at Stuart's hands. Her testimony and that of other women in Stuart's life was allowed by District Judge Andrew Schwam over Kinney's objection. The Judge instructed the jury to consider the testimony only as it may pertain to Stuart's intentions at the time of the Miller boy's death.\n\nClearwater County Prosecutor Steve Calhoun said the testimony about Stuart's alleged physical abuse of other people is necessary to proving his case. He contends the testimony is evidence of Stuart's alleged \"sadistic\" inclination.\n\nBut Kinney refuted the idea that Stuart is a cruel, calculating killer. He described his client as a \"perfectionist\" with a \"compulsive personality,\" one who had trouble tolerating imperfection in himself or others.\n\nStuart's sister, Susan Stuart of Kooskia, described her brother as \"pretty strict\" with children, but not abusive. Susan Stuart said she knew several of the women in Stuart's life, including Kathie Miller, but she had no knowledge of the defendant abusing the women. She said she once took care of Robert Miller for three or four days and saw no bruises on the boy's body, other than a few on his lower legs, apparently caused by falling down during play.\n\nOn cross examination, Calhoun had all of the defense witnesses, except Stuart's mother, inspect the pictures of the dead Miller child that have been entered into evidence. All of the witnesses said they would be \"surprised\" to hear that the bruises on the boy were caused by Stuart.\n\n\"He (Stuart) is a basically nice person,\" McDowell said.\n\nSusan Stuart said people often told her that Gene Stuart was a \"hell of a guy.\"\n\nStuart's mother, Dorothy Stuart of Stites, testified briefly about some phone calls she received for Gene from Vicki Nelson. She also told the jury that she had not raised her son in a strict environment.\n\n\"I wouldn't consider it too strict,\" she said. Calhoun asked that Dorothy Stuart remain available for possible rebuttal testimony later in the trial.\n\nStuart, as he has throughout the entire trial, remained calmly seated during testimony Tuesday. After the trial was recessed, he was allowed to talk briefly with friends and relatives, exchanging embraces and smiles before being returned to the Latah County Jail.\n\nThe trial, now six days old, resumes at 9 a.m. today with more defense testimony.\n\nDOUBLE CLICK TO VIEW PHOTO\n\nStuart admits striking boy with his fist\n\nBy David Johnson of the Tribune\n\nMOSCOW -- Gene Francis Stuart testified Wednesday that he disciplined 3-year-old Robert Miller with the goal of making the boy a \"fine, upstanding young American.\"\n\nBut on the afternoon of Sept. 19, 1981, Stuart said he lost control and struck the child once with his fist.\n\n\"We were just kind of going back and forth and at some point . . . and I put this through my mind a thousand times . . . I just hit him. It was like a reflex action and he fell backward and I caught him,\" Stuart said.\n\nSome three hours later, Robert Miller lay dead in the emergency room of Orofino's Clearwater Valley Hospital where Short had brought him. The boy died, according to an autopsy report, of a lacerated liver, caused by a severe blow or blows from a blunt object.\n\n\"It was an instantaneous thing (the incident). It was over as fast as it happened,\" Stuart told the jury during the sixth day of testimony in his trial.\n\nStuart, a 31-year-old auto body repairman from Orofino is charged with first-degree murder by torture in connection with the Miller child's death.\n\nThe prosecution and defense rested their cases late Wednesday afternoon and final arguments are expected by noon today. The case would then go to the jury of seven men and five women.\n\nStuart's attorney, Clearwater County public defender Robert Kinney, has already told the jury that he will ask them to return a verdict of manslaughter, contending that his client did not intend\n\nto hurt the Miller boy.\n\nClearwater County Prosecutor Steve Calhoun, however, contends that Stuart intentionally tortured Robert Miller to satisfy a \"sadistic inclination\" and that death resulted.\n\nStuart, wearing the three-piece, gray suit and blue tie he's worn every day of the trial, spoke in a quiet, but clear voice while on the witness stand, appearing to choke back tears when he talked about the Miller child's death.\n\n\"At some point, I did punch him, in the belly,\" Stuart said under cross examination by Calhoun.\n\nStuart was living with the Miller boy's mother, Kathie Miller, at the time of the child's death and had assumed a parental role.\n\nEarlier Tuesday, Spokane psychiatrist Robert Wetzler testified that Stuart has a \"compulsive personality\" and suffers from an \"intermittent explosive disorder.\" What's more, Wetzler ruled out, in his opinion, the torture allegation.\n\n\"I can't see it as being torture. Torture is a deliberate intent to hurt or harm somebody over a period of time . . . I can't see this being torture at all,\" Wetzler said. \"He spanked him and spanked him harder than he anticipated.\"\n\nWetzler, who examined Stuart and reviewed the entire case file, said that Stuart knew what he was doing when he struck the boy and knew the difference between right and wrong. But the psychiatrist said Stuart's \"behavior would not be a deliberate intent to harm or hurt anyone.\"\n\nStuart also testified about his relationships with several women in his life, including two former wives, two live-in girlfriends and another woman he dated. All the women had testified that Stuart beat them on many occasions, poking them in the chest and striking them with his fists. Stuart refuted all the testimony, telling the jury that most of what the women said never happened.\n\n\"I have never in my life punched a woman,\" Stuart said.\n\nStuart, however, told the jury that during the week prior to Robert Miller's death he had caused many of the bruises that appeared on the dead child's body.\n\n\"I had been threatening to give him a hard spanking for a long time instead of the two or three swats . . . and I did,\" Stuart said. Stuart also said he had caused some of the small bruises on the boy's chest by poking the child with his finger.\n\n\"I didn't think I was poking him hard enough to cause bruises,\" he said. Stuart said he and Kathie Miller had agreed to give the boy cold showers as discipline, rather than spankings. He said he gave Robert two cold showers and Kathie Miller gave her son one.\n\nStuart, who was described by psychiatrist Wetzler as a perfectionist, said that when he first met Robert Miller the boy was unruly. \"It was like he never had any discipline at all,\" Stuart said. He said that when he disciplined the boy, he got down on one knee and looked the child in the eye, to be \"on his level.\"\n\nThat's the posture he had assumed, Stuart said, the day he struck Robert with his fist. He said there was no visible sign of injury after the incident. In fact, he said Robert finished eating his lunch and Stuart put the child to bed for a routine nap.\n\nAbout one and one half hours later, Stuart said he went in to check on the child.\n\n\"He was all scrunched up against the headboard like he was trying to crawl through it. There was vomit everywhere,\" Stuart said. He said he picked the child up, bathed him, blow-dried his hair and laid him back down on the child's bed. Then, Stuart said, he went to a nearby motel to call Kathie Miller (who was working) and told her that Robert was sick. When he returned home, Robert was crawling on the bed, Stuart said. He said he picked the child up and carried him into his and Kathie's room.\n\n\"When I laid him down, I asked how he felt and he said 'pretty good.'\" Stuart said. But he said he detected what sounded like an obstruction in the boy's throat. So he tried to perform mouth-to-mouth resuscitation, Stuart said.\n\n\"I exhaled into his mouth,\" he said. But the boy's stomach rose. So Stuart said he pushed the child's stomach down with his hand. \"The second time I did that, all kinds of green stuff came out of his mouth and nose. And when I saw that, I just picked him up and headed to the hospital,\" Stuart said.\n\nKathie Miller and several of the other women in Stuart's life wept throughout Stuart's testimony.\n\nCalhoun called Kathie Miller and Vicki Nelson, one of Stuart's former wives, for rebuttal testimony. Miller again told the jury that Stuart poked her in the chest, leaving bruises, and threatened once to hit her with his fist.\n\nNelson, struggling to check her emotions, reaffirmed her earlier testimony that Stuart beat her brutally many times.\n\n\"Gene struck me with his fists on many, many occasions. He almost always left bruises on me,\" Nelson said. Asked by Calhoun why she reported only a couple of the beatings to police, Nelson said, \"They always told me it was a civil matter and what they told me is that they really couldn't do anything unless he killed me.\"\n\nDistrict Judge Andrew Schwam, Calhoun and Kinney will be formulating jury instructions this morning and the jury has been instructed to reconvene at 10:30 a.m. today.\n\nTRIBUNE\n\nStuart guilty\n\nJury returns murder verdict\n\nBy David Johnson of the Tribune\n\nMOSCOW -- Gene Francis Stuart was found guilty of first-degree murder by torture Thursday night, bringing to an end one of the most controversial trials held in Idaho's Second Judicial District in years.\n\nA jury of seven women and five men returned their verdict at 9:30 p.m., exactly eight hours after they began deliberations. Stuart now faces a possible death sentence for the beating death of 3-year-old Robert Miller, the child over whom he had assumed a father role.\n\nDistrict Judge Andrew Schwam set sentencing for Nov. 24, at the Clearwater County Courthouse in Orofino.\n\nStuart also pleaded guilty immediately after the jury's decision had been read to being a habitual offender, for which he could receive a separate life sentence. The 31-year-old auto body repairman has three prior felony convictions for rape, telephone fraud and violation of the Uniform Controlled Substance Act.\n\nThe jury had not been informed of his record until after they reached a verdict.\n\nThe verdict appeared to unleash a week of pent-up emotion at the Latah County Courthouse. Stuart paled and slumped into his seat after the decision had been read.\n\nKathie Miller, the dead boy's mother, wept openly and then smiled.\n\n\"Praise the Lord,\" she said.\n\nVicki Nelson, one of Stuart's former wives who had testified that the defendant had beat her repeatedly over a one-year period, also cried.\n\n\"The jury brought back my faith in the legal system,\" Nelson said.\n\nTheresa Jacobson, another of Stuart's live-in girlfriends who testified about being abused by the defendant, said, \"I have nothing to say. The whole thing is sad.\"\n\nThe women, along with their friends and relatives who stayed by their sides during the trial, joined together in a loud victory whoop as they left the courthouse.\n\nGene Stuart's mother, Dorothy Stuart of Stites, stood by herself, crying on the courthouse steps.\n\nProsecutor Steve Calhoun of Orofino, who told the court that he will decide within the week whether to pursue the death penalty, shook hands with people outside the courtroom.\n\n\"I feel very pleased with the verdict,\" he said.\n\nClearwater County Public Defender Robert Kinney accompanied Stuart back to the defendant's cell in the Latah County Jail and was unavailable for comment. It is not certain whether he will appeal the case.\n\nAnd out in the darkened court-house parking lot, while court officials were taking care of formalities and returning the trial records to the public file, members of the jury, some of them with tears in their eyes, slipped silently into their cars and drove home.\n\n\"There's really not much to talk\n\nabout,\" said the jury foreman. \"The verdict speaks for itself.\"\n\nOther than innocent, the jury was given the choice of three verdicts -- guilty of first-degree murder, second-degree murder or involuntary manslaughter. A verdict of voluntary manslaughter, which calls for the element of the heat of passion, according to Idaho law, was not offered as an option.\n\nThe jurors were Wayne S. Alexander, Patricia J. Barkley, Janet T. Bobeck, Carolyn M. Gravelle, Bryon R. Henry, Marilyn K. Jenkins, Gary Francis Nial, Joseph D. Randall, Richard A. Rueppel, Dorothy Postlewait, Dorothy Thomas and Kathleen Walker.\n\nDuring final arguments, Calhoun and Kinney offered the jury opposing portraits of Stuart.\n\n\"If you want to see the picture that Gene Francis Stuart painted . . . he painted it of himself . . . a brutal, sadistic torturer,\" said Calhoun, calling for a first-degree murder conviction.\n\n\"There is no malice or wickedness in that man's heart,\" Kinney countered. \"He's not a murderer. I ask you to return a verdict of manslaughter.\"\n\nCalhoun contended that Stuart tortured Robert Miller in an attempt to make the child into \"the perfect little robot\" to fit \"Gene Stuart's demented picture of what a child should be.\"\n\nBut Kinney said the boy's death was the product of injuries administered by a person who did not know how to discipline a child.\n\n\"I'm not trying to minimize the tragic death of that boy,\" Kinney said. \"We have never, never attempted to convince you that a tragedy did not occur, that a crime did not happen. I will agree with Mr. Calhoun that the child was struck too often and too hard. I'm not asking that you excuse this man's conduct . . . we can't in a civilized society do that . . . but we can seek Justice.\"\n\nJustice, Calhoun said, can be served only if Stuart is made to pay for what he did to the Miller child.\n\n\"Those bruises you see on the body of Robert Miller,\" said Calhoun, referring to pictures of the battered child, \"are not the product of spanking. They're the product of beating.\"\n\nHe challenged Stuart's own testimony that he struck Robert Miller once with his fist. \"I submit that those tears in the (boy's) liver were caused by several pokes of the finger.\"\n\nRobert Miller died, according to an autopsy report, of internal bleeding from the liver, caused by a severe blow or blows to the abdomen. Stuart, according to testimony from several prosecution witnesses, had a habit of poking people in the chest when he became angry. Stuart denied that on the stand, but conceded that he had poked Robert Miller on the day the child died, but not hard enough to causes bruises.\n\nCalhoun said that the evidence showed that Robert Miller had been dead for perhaps two hurs before Stuart brought the boy to the Clearwater Valley Hospital emergency room. Stuart had testified that the boy was alive at the time.\n\nKinney suggested that the boy's liver did not rupture until Stuart tried in vain to perform cardiopulmonary resuscitation on the child.\n\nCalhoun accused Stuart of lying when the defendant testified that he had never punched a woman during his entire life. Several of Stuart's former wives and girlfriends testified that they received repeated brutal beatings at Stuart's hands.\n\n\"He's lied to us,\" Calhoun said.\n\n\"I'm not saying they (the women) lied,\" Kinney said. \"I'm saying all of their incidents began with a speck of truth and over a course of time, what one wants to believe is enhanced.\"\n\nStuart testified that he disciplined Robert Miller on the day the child died, for \"boobing,\" a word Stuart used to mean pouting or sulking.\n\n\"I don't understand boobing,\" Kinney said. He suggested that the word was a spinoff of Stuart's personality -- to discipline a child harshly for something most children do routinely.\n\n\"That's not right. That's not normal, but that's that man,\" Kinney said pointing to Stuart. Kinney asked the jury to \"remove all passion and emotion from the case\" and reach a verdict on the facts that were part of the evidence.\n\n\"The state can not prove intent (to commit torture) because there is no intent,\" he said. \"The elements of manslaughter have been met. The elements of murder are not present.\"\n\n\"The things that have been testified to here are incredible,\" Calhoun said. \"But they're all true.\" He said that Stuart tried to compensate for what a psychiatrist earlier described as a \"personality disorder\" by \"controlling, dominating and inflicting pain on others.\n\nMurder defendant claims CPR bruised child's body\n\nBy Jim Wright\n\nGene Stuart told Clearwater Valley Hospital emergency room workers he bruised the lifeless body of three-year-old Robert Miller while attempting to perform CPR on the child, the doctor who treated the child testified in Moscow today.\n\n\"I asked him (Stuart) how all the bruises got on the boy's chest,\" Dr. John Floyd said of his first conversation with Stuart in the emergency room.\n\n\"He (Stuart) said 'by poking him,\" 'Floyd told the court. \"I certainly got the impression that it (the poking) was related to CPR efforts.\"\n\nFloyd was the physician in charge of Orofino hospital's emergency room on the evening of Sept. 19, 1981, when Stuart, 33, an auto repairman, arrived at the hospital with the \"limp and lifeless\" body of the child in his arms.\n\nThe child was dead when Stuart arrived, but Floyd and other emergency room workers attempted to revive him with CPR and electro-shock for about 40 minutes after their arrival, Floyd said.\n\nFloyd said he noted between 15 and 25 small, round bruises on the boy's chest and his buttocks and under his chin during the efforts to revive the child.\n\nFloyd's call to the Clearwater County sheriff shortly after pronouncing boy dead lead to first-degree murder charges against Stuart and to the Moscow trial before a jury of five men and seven women selected earlier this week.\n\nStuart acted agitated and demanded that the emergency room doctor and nurses help the boy, Floyd said.\n\n\"But the amount of anxiety he was showing was probably appropriate for what was happening,\" Floyd said. \"But during the resuscitation efforts I became highly suspicious about (the origins) of the unusual cause of death and about possible child abuse.\"\n\nDuring cross-examination, defense attorney Robert Kinney questioned Floyd about the techniques used to revive the boy and if those techniques might have caused bruising or burns on the child's body.\n\nAlthough saying that some procedures might have caused bruising or burns, Floyd testified that he saw the bruises before the medics began working with the boy.\n\nThe origin of the bruises is expected to become an issue later in the case when the prosecution, headed by Clearwater County Prosecutor Steve Calhoun, will attempt to prove that Stuart intentionally tortured Miller to death with systematic and habitual beatings culminating in the child's death.\n\nCalhoun summed up his case for the newly selected jurors Tuesday afternoon:\n\n\"Kathy Miller, the mother of the child, will be here to testify,\" Calhoun said. \"She'll testify that she met him (Stuart) and started dating him about a year before the murder took place.\n\n\"She'll also testify about being pushed around by Mr. Stuart herself and about acts of violence committed by Mr. Stuart on Robert Miller,\" Calhoun said.\n\nStuart often disciplined Robert Miller by poking him in the chest with his forefinger, severe spankings and cold showers, Calhoun said in outlining Kathy Miller's testimony for the jury.\n\nThe beatings drove Miller to move out of the home she shared with Stuart on two occassions, Calhoun said. However, the two had reconciled and were living together at the time of her son's death, he said.\n\nThere'll be other children, defendant told Miller\n\nBy Jim Wright\n\nImmediately after the death of her son, Gene Stuart told Kathy Miller that they could get married and have other children and asked her if she'd visit him in jail, Miller testified in Second District Court today.\n\nStuart, 30, is on trial for the alleged murder-by-torture killing of 3-year-old Robert Miller, the son of Kathy Miller, when they were living with Stuart in Orofino Sept. 19, 1980.\n\nOften pausing to compose herself, Miller spent much of this morning recounting the events leading up to the death of her son. She broke into tears while describing her meeting with Stuart at the Clearwater Valley Hospital shortly after the death of her son.\n\n\"He told me that things would be all right, that we could still get married and we could have other children,\" Miller said. \"Then he asked me if I'd come and see him in jail. I told him that they wouldn't put him in jail for putting bruises (found by doctors) on Robbie's chest, but he said 'yes, they will.'\"\n\nLater, after he had been arrested and jailed, Stuart denied bruising the child's chest, Miller said.\n\nMiller testified that on several occasions she had returned home from work to find her son bruised and injured. Stuart, who was generally home alone with the child, attributed the injuries to accidents or disciplining, she told the Latah County jury of five men and seven women.\n\nMiller said on two occasions she returned home from running errands to find the 3-year-old cold, blue and shivering from cold showers administered by Stuart after the child wet his pants or disobeyed some order.\n\nStuart had taken over all care and bathing of the child for fear that he might become a \"sissy\" if attended to by a woman, Miller said. He also forced the child to eat with strict, peculiar manners Miller said.\n\n\"Once he picked up his fork with the wrong hand and Gene snapped him on the head with his fork,\" Miller said.\n\nMiller said that she seldom saw her son undressed, but on several occasions noticed bruising on his buttocks, penis and head and once discovered a \"silver dollar-size\" patch of hair missing from his head.\n\nHowever, Miller testified that she never saw Stuart abuse the child by jabbing him in the chest with his forefinger, an act Clearwater County Prosecutor Steve Calhoun hopes to prove indicative of Stuart's \"sadistic\" tendencies.\n\nCalhoun must convince the jury that Stuart intended to torture the child by acts such as poking him to secure a first-degree murder conviction.\n\nStuart may take stand in own defense\n\nBy Jim Wright\n\nThe defense of accused murderer Gene Francis Stuart will begin Tuesday morning with an opening statement from his attorney and may include testimony from the defendant as well.\n\nClearwater County Prosecutor Steve Calhoun finished the state's case late Friday afternoon after three and a half days of testimony from doctors, police investigators and former wives and girl friends of the 31-year-old Orofino auto body repairman.\n\nStuart is accused of the murder-by-torture of 3-year-old Robert Miller, but much of the state's testimony keyed on Stuart's past romantic relationships, which Calhoun hopes will convince the jury that Stuart intended to torture the child to satisfy his own \"sadistic tendencies.\"\n\nCalhoun called a total of 17 witnesses while presenting his case. One of the last witnesses to testify was Theresa Jacobson, who testified that Stuart often physically abused her while they were living together in the Seattle area.\n\nJacobson told the Latah County jury of five men and seven women that Stuart once became angry at a party and drove her to a nearby lake, where he pushed her into the water and held her head under until she started swallowing water.\n\n\"You're not leaving me because you're not coming out of this lake. I'm going to kill you,\" Jacobson quoted Stuart as saying.\n\nJacobson said Stuart eventually let her up from the water and told her \"my mother doesn't even love me.\"\n\nJacobson said that in another fight Stuart began smashing her belongings, then beat her and cut off her clothes with a butcher knife. Stuart allowed her to dress and leave their home, but dragged her back at knife-point and slashed her clothes away two more times before letting her leave, she testified.\n\nVicki Nelson, the state's final witness, told the jury that Stuart began beating her two weeks after their marriage in 1978. The beatings, which included punches to the face, choking and kicking as well as sharp jabs to the chest with his forefinger, were administered because she smoked cigarettes, watched television or took showers without him, Nelson said.\n\n\"He gave me what he said were reasons, but to me there were no reasons,\" Nelson said. \"He'd tell me a lot of the time that he was beating me because he knew I wanted to leave him because he was beating me.\"\n\nNelson said she left Stuart after four months of marriage and 20 to 25 serious beatings.\n\nNelson also described an incident where Stuart locked her 2-year-old daughter in a bathroom and would not allow her to let the child out for nine or ten hours. While the child screamed in the bathroom, Stuart held Nelson down on a couch and forced her to urinate in her clothes rather than let her use a toilet, she said.\n\nBoth Nelson and Jacobson broke into tears during their testimony and court was recessed to allow them to regain their composure.\n\nNelson became visibly agitated and could not speak when shown photographs of the bruised and battered body of Robert Miller. She later testified that 15 to 20 small, round bruises found on the boy's chest matched those Stuart would leave on her chest after poking her with his forefinger.\n\nWhen asked why she returned to Stuart after leaving him several times, Nelson said, \"At first it was because I loved him and later it was because I was afraid of him . . . It took\n\nme a whole year (to get away from him) but I finally did it.\"\n\nDefense attorney Robert Kinney of Orofino, limited his examination of the women to details of the incidents they recounted and questions aimed at testing their memories about their testimony in preliminary hearings.\n\nKinney told this newspaper that he has not yet decided if he'll place his client on the witness stand. He did say he will call four or five defense witnesses.\n\nFormer girlfriend says Stuart threatened, intimidated her\n\nBy Jim Wright\n\nA former girlfriend of Gene Francis Stuart testified Friday that Stuart threatened her with violence, intimidated her and forced her to have sex with him in the office of the Orofino bodyshop where he worked.\n\nStuart, 31, is on trial in Moscow for the murder-by-torture death of 3-year-old Robert Miller, the son of a woman with whom he was living in Orofino last year.\n\nThe former girlfriend, Delores Strong, said she had a short but \"serious\" romance with Stuart a few months before he moved in with Kathie Miller and her young son.\n\nStuart threatened her, pulled her hair and jabbed her in the chest several times during the relationship Strong said.\n\nStuart usually started the arguments over trivial matters, and the defendant seldom used physical violence, Strong said.\n\n\"It was more intimidation than anything,\" Strong told the Latah County jury of five men\n\nStrong said she eventually stopped seeing Stuart and moved away from the apartment building where they both lived because of the intimidation.\n\n\"I wouldn't be alone with him then,\" the woman said.\n\nShortly after she stopped seeing Stuart, Strong said she went to the Orofino body shop where he worked to ask if he could repay some money he owed her.\n\nAlthough friendly at first, Stuart became angry when the two were alone in the shop's office, Strong said.\n\n\"He looked very, very angry,\" Strong said. \"I'd seen this look before and I was very frightened.\"\n\nThe woman said she tried to leave the shop, but stopped when Stuart told he \"go ahead and try to make a run for it. You won't make it.\"\n\nStuart blocked the door out of the office, forced her against a wall and began lecturing her \"in a ranting tone\" while \"throwing extremely controlled karate kicks and hits that missed me -- just barely,\" Strong said.\n\n\"He had me totally dominated, he was totally in control and I was totally afraid and he knew it,\" Strong said. \"He told me that I didn't know what terror was.\"\n\nBreaking into tears on the witness stand, Strong said Stuart forced her to have sex with him in the office and then suddenly became friendly and let her go.\n\nUnder cross-examination from defense attorney Robert Kinney, Strong said that she didn't report the sexual assault out of fear the police would not believe her and that Stuart might harm her.\n\nStrong is one of four women expected to testify about their past relationships with Stuart in the years before the death of the Miller boy.\n\nClearwater County Prosecutor Steve Calhoun has said the women's testimony is crucial to the state's ability to prove that Stuart tortured the boy to death in keeping with his long-standing \"sadistic tendencies.\"\n\nThe state must prove that Stuart intended to torture the child to secure a first-degree murder conviction and a possible death sentence.\n\nStuart was charged with the murder after he arrived at the Clearwater Valley Hospital in Orofino with the lifeless body of the bruised and battered three-year-old in his arms on Sept. 19, 1981.\n\nKathie Miller, the mother of the boy, testified Thursday that Stuart often left bruises on her chest by poking her with his forefinger. Stuart also threatened her and, on one occasion, slammed his fist against a wall next to her head and told her it would be easy to move her nose to the other side of her face.\n\nAttorney: Stuart guilty of manslaughter only\n\nBy Jim Wright\n\nGene Francis Stuart is guilty of manslaughter in the beating death of 3-year-old Robert Miller but did not intentionally torture the boy, defense attorney Robert Kinney told a Latah County jury today.\n\n\"I'm not going to submit to you that a crime has not occurred,\" Kinney told the jury of five men and seven women in his opening statement. \"What I'm suggesting is that the state's evidence does not show that Mr. Stuart was a sadistic man, that the state's evidence does not show that he intended to torture anyone and that I'm suggesting that the tragedy of Sept. 19 (1981) did not happen at the hands of a demented person.\n\n\"There was some carelessness, and I'm asking you to approach this as criminal negligence,\" Kinney said. \"After presenting our evidence, we will ask you to return a verdict of manslaughter, which is what we feel occurred.\"\n\nStuart, who is charged with first-degree murder by torture, will take the witness stand to trace his life history and to talk about his disciplining of the son of Kathie Miller, with whom he lived in Orofino in 1981.\n\nStuart will testify Wednesday afternoon and will be the last defense witness, Kinney said. The defendant will be preceded by his mother; a Spokane psychiatrist who examined him in jail, and several relatives and friends who will rebut the testimony about beatings and sadistic behavior given by Stuart's former wives and girlfriends, Kinney said.\n\nSpokane psychiatrist Robert Wetzler will testify that Stuart, a 31-year-old auto body repairman, suffers from an \"intermittent explosive behavioral disorder manifested by impatience, intolerence of human error -- including his own -- that drives him to seek perfection that he can never attain . . . which causes built up frustration,\" Kinney said.\n\nWetzler's evaluation of the defendant will be crucial to the jury's understanding of the events leading up to the death of Robert Miller and the correct evaluation of the information to be given by Stuart, who was the only witness to the death, Kinney said.\n\nKinney also told the jurors that he will call eight witnesses who will testify that they knew Stuart and some or all of his former wives and girlfriends and that they never saw Stuart abuse them or witnessed bruises on their bodies.\n\nKathie Miller, mother of the dead boy, Stuart's two former wives and two former girl friends testified last week that Stuart beat, abused, and in one case, raped them during their relationships with him.\n\nThe testimony about Stuarts' allegedly sadistic and abusive nature toward the women in his life is crucial to the state's ability to prove that Stuart intended to torture the boy to death and should be found guilty of first-degree murder and made subject to a possible death sentence.\n\nKinney began presenting his witnesses this morning with David Wilhide, a Seattle-area man who said he knew Stuart during the mid-70s when the defendant was married to Vicki Nelson.\n\nNelson testified last week that Stuart often beat her and locked her in their home during the day.\n\n\"It was quite normal, I never saw any problems,\" Wilhide said of Stuart and Nelson's relationship. He also testified that he and Stuart could easily crawl in and out of windows to gain access to the house when locked out.\n\nWilhide also said that Stuart visited him at his home with both Robert and Kathie Miller and that he noticed no family problems.\n\n\"It was one, big happy family as far as I was concerned,\" Wilhide said.\n\nClearwater County Prosecutor Steve Calhoun showed Wilhide four photographs of the brusied and battered body of the Miller boy during cross examination.\n\n\"If you were to find out that Gene Stuart inflicted those bruises, would you be surprised?\" Calhoun asked.\n\n\"Yeah, I would be,\" Wilhide answered.\n\nThe Stuart trial is being held in Moscow because of defense assertions that coverage of pre-trial proceedings by the Lewiston Morning Tribune made a fair trial in Orofino impossible.\n\nThe case is expected to go to the jury Wednesday afternoon.\n\nStuart denies accusations he hit women\n\nBy Jim Wright\n\nAccused murderer Gene Francis Stuart testified today he never punched or struck any of the women who last week said he often beat them and psychologically abused them.\n\n\"I have never in my life punched a woman,\" Stuart told the Latah County jury of five men and seven women.\n\nStuart, of Orofino, is on trial in Moscow for the Sept. 19, 1981, beating death of 3-year-old Robert Miller.\n\nDefense attorney Robert Kinney admitted Stuart's guilt to the jury in an opening statement on Monday, but asked the jury to return a verdict of manslaughter rather than the first-degree murder charge sought by the state.\n\nThe state contends that Stuart is a sadist who tortured the boy to death for his own pleasure and should come under the first-degree murder statute which carries a possible death sentence.\n\nClearwater County Prosecutor Steve Calhoun last week called five women who were once romantically involved with the defendant -- including two former wives -- who testified that Stuart beat and abused them for little or no reason.\n\nCalhoun contends the testimony of the women shows Stuart has for years engaged in sadistic acts that eventually lead to the death of the son of Kathie Miller, with whom he was living in Orofino.\n\nKinney has so far keyed his defense on attemping to neutralize the women's testimony.\n\nStuart testified he never hit Shari Dally, his first wife, with his fist but did spank her for \"acting like a spoiled brat\" during their marriage 10 years ago.\n\nDally testified last week that Stuart often poked her and punched her for watching television or smoking cigarettes.\n\nThe 31-year-old auto body repairman also said he did not try to drown Theresa Jacobson, a former girlfriend, in a lake near Seattle as she testified last week.\n\nJacobson had become \"sloppy drunk\" at a party and had damaged some furniture and caused a scene, which lead to an argument while the two were driving to the house they were sharing in a Seattle suburb, Stuart said.\n\nStuart said he spotted a lake next to the highway and \"flipped a U-turn and dragged her into the lake\" to sober her up.\n\nWhen asked if he tried to drown the woman by holding her head underwater, Stuart flatly answered, \"No sir, I did not.\"\n\nJacobson last week testified that Stuart had once threatened her with a knife and had used the knife to cut her clothes off during another argument.\n\nStuart admitted that he smashed some lamps owned by Jacobson after she had come home drunk and smashed a window in his home but denied threatening her with the knife.\n\n\"She yelled something to the effect of \"I could just kill you\" (during the course of the argument) and I was to the point where I thought she'd try,\" Stuart said. \"So I grabbed a butcher knife out of a drawer and handed it to her . . . handle first . . . and told her to go ahead and try.\"\n\nJacobson dropped the knife and left the house unharmed, Stuart said.\n\nStuart was expected to testify for the balance of the afternoon. He is to be the last witness to testify before the defense rests.\n\nStuart's testimony was preceded by that of Spokane psychiatrist Robert Wetzler, who examined Stuart after his arrest.\n\nStuart has an intermittent explosive personality disorder and is a passive-aggressive compulsive personality which leads him to \"behave grossly out of proportion to stress or other stimulation,\" Wetzler said.\n\nStuart's personality disorder causes him to lose control and become angry in physical ways that can cause damage to property or harm to people, Wetzler said.\n\nHowever, Stuart does not suffer from a major disorder such as a mental disease and was fully aware of right and wrong at the time of the Miller child's death, Wetzler said.\n\nThe case was expected to go to the jury for deliberation sometime this afternoon.\n\nProsecutor says Stuart's insecurity led to torture\n\nBy Jim Wright\n\nAccused murderer Gene Francis Stuart consciously degraded, tortured and dominated people in his life to make up for his own insecurity and eventually tortured to death 3-year-old Robert Miller, Clearwater County Prosecutor Steve Calhoun said today.\n\n\"Mr. Kinney (the defense attorney) said in his opening statements that the state is trying to paint a picture about Mr. Stuart,\" Calhoun said in closing arguments before the jury. \"I view that differently. We've presented facts about Mr. Stuart and Mr. Stuart painted his own picture in the evidence that we've presented, in the pictures of the bruised and battered body of Robert Miller.\"\n\nStuart, 31, of Orofino, was accused of first-degree murder by torture after the Sept 19, 1981, beating death of the child, who was the son of a woman with whom he was living.\n\nStuart testified on Wednesday that he was disciplining the child for whining when he lost control and punched him in the stomach and spanked him. The child died later that afternoon from internal bleeding from a torn liver.\n\nDefense attorney Robert Kinney on Wednesday admitted Stuart's guilt, but asked the jury of Latah County residents to find his client guilty of manslaughter rather than the more serious first-degree murder charge.\n\nThe defense contends that Stuart did not intend to kill or torture the boy but struck him during an explosive rage caused by a personality disorder.\n\nHowever, Calhoun told the jury the facts of the case support the state's contention that Stuart intended to prolong the child's pain for his own \"sadistic inclinations.\"\n\n\"The evidence shows torture and pain and a living hell that Gene Francis Stuart put Robert Miller through,\" Calhoun said. \"Gene Francis Stuart did not intend to kill Robert Miller, that's not a question here. He wanted to keep (Miller) and these people around him alive. He went to great pains to keep them around so he could torture them to make up for his own lack of security and personality flaws.\"\n\nCalhoun also exhorted the jurors not to believe a defense pyschiatrist who testified that Stuart did not intend to hurt the child when punishing him.\n\n\"I can't believe that; that's not common sense,\" Calhoun told the jurors.\n\nThe jurors, who have the option of finding Stuart innocent, guilty of first-degree murder, second-degree murder or voluntary or involuntary manslaughter, were expected to begin deliberations this afternoon after the defense's closing statement.\n\n",
    "body_length": 205494,
    "citedas": [
      "715 P.2d 833",
      "110 Idaho 163"
    ],
    "attorneys": "Robert E. Kinney, Orofino, for defendant-appellant. Jim Jones, Atty. Gen., and Lynn E. Thomas, Sol. Gen., Boise, for plaintiff-respondent.",
    "category": [
      "78"
    ],
    "judges": "Bakes, Justice. Donaldson, C.j., and Shepard, J., concur. Huntley, Justice, Concurring specially. Bistline, Justice, Dissenting.",
    "citation_count": 1
  }
}
