{
  "id": "BM2MYWYBTlTomsSBNvby",
  "document": {
    "title": "State v. Stenson",
    "full_title": "STATE OF WASHINGTON v. DAROLD RAY STENSON, A/K/A DAROLD R. J. STENSON, A/K/A JAMES ALLEN ANDERSON, A/K/A LARRY JOE PRZYBYCIEN .",
    "jurisdiction": "Washington Supreme Court",
    "date": "1997-07-24T00:00:00.000Z",
    "docket": "No. 61965-4",
    "body": "EN BANC\n\nGUY, J. Darold R. Stenson appeals his sentence of death and the underlying convictions for the murders of his wife and his business associate. FACTS\n\nOn March 25, 1993, Darold (D.J.) Stenson and his wife, Denise Stenson, were living with their three young children on property they called Dakota Farms, which was their residence and the site of their business raising exotic birds. At 4:00 a.m., Stenson called \"911\" and stated: \"this is D.J. Stenson at Dakota Farms. . . . Frank has just shot my wife, and himself, I think.\"\n\nLaw enforcement personnel arrived at Dakota Farms within several minutes. Stenson met the officers outside and led them first to a downstairs guest bedroom in which the Stensons' friend and business associate, Frank Hoerner, lay face down on the floor, dead of a gunshot wound to his head. A revolver rested beside his hand next to his head. Stenson then directed the officers to the master bedroom upstairs where 28- year-old Denise Stenson lay in bed grievously wounded with a gunshot wound to her head. She was airlifted to Harborview Hospital but died the following day.\n\nStenson told the officers that the night before the shootings, he and his wife (Denise), and Frank Hoerner and his wife (also named Denise), had dinner together at a restaurant. Stenson told the officers that when he got home from dinner, he called Frank and told him that he should come to Stenson's house to sign some insurance forms for some ostriches which were to be purchased by Stenson for the two of them. Stenson told the officers that Frank said he was too tired but would come over at 3:30 in the morning on his way to catch the ferry to go to work. Stenson said that he called Frank back and told him to call before he came over in the morning.\n\nStenson told officers that Frank had come to the Stensons' house early on the morning of the shooting to sign insurance forms. According to Stenson, Frank had invested over $30,000 in the Stensons' exotic bird business, and Stenson had told Frank he was going to Texas to pick up Frank's ostriches and some for himself. Stenson told officers that Frank had not brought any cash that morning, but that he had given Stenson $6,850 for the insurance two weeks earlier.\n\nStenson told officers that when Frank came over to the Stensons' home a little after 3:30 a.m., the two men went to Stenson's office in a separate building behind the house and that Frank signed the insurance forms. Stenson said that Frank became \"glum\" when he told Frank that he should raise the ostriches Stenson was buying for him at his own home and not on the Stensons' farm. Stenson said that Frank then left the office building to go to the house to use the bathroom. Stenson said that when Frank did not return to the office, he went to the house to look for him and found him in the guest bedroom shot to death. Stenson said he did not hear any gun shots. Stenson said as he looked at Frank, he heard moaning from upstairs and went up to find his wife also shot in the head. He then called \"911\" and reported the shooting and suicide. Stenson told officers that his three children, aged six, four and one, were asleep upstairs when their mother was shot.\n\nWhen asked whether he knew any reason why anyone would kill Frank or Denise, Stenson responded there had been some problems in Frank and Denise Hoerner's sexual relationship. When Deputy Gates said to Stenson, \"you mentioned earlier that you . . . kind of thought that Frank was sweet on your Denise\" (Denise Stenson), Stenson answered he knew that Frank liked her and he said that Frank complained about his relationship with his own wife.\n\nAt 5:28 a.m. Stenson signed a consent for the officers to search the entire residence, all of the outbuildings and the vehicles. Stenson also voluntarily gave his clothing to one of the detectives. No other physical evidence was taken until later in the morning, after law enforcement officers had obtained a search warrant for the premises.\n\nAt 11:16 a.m. on March 25, a superior court Judge telephonically issued a search warrant for the premises called Dakota Farms at 55 Kane Lane in Clallam County. During the course of the investigation, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e search warrants were obtained to search the Stenson property and records, to obtain various bank account records, phone records, the bookkeeping records of Dakota Farms, and a storage locker.\n\nIn the request for the initial warrant, the officers sought permission to look for evidence of a relationship between the Stensons and the Hoerners. The officers seeking the warrant told the Judge that the physical evidence of blood spattering at the scene did not appear consistent with Stenson's story that an attempted murder and suicide had occurred. The officers also told the magistrate that Denise Hoerner had told officers the Hoerners were good friends with, and in a business partnership with, the Stensons. Denise Stenson's brother had told officers that Stenson was planning to end the partnership with Frank Hoerner and that there was an attraction between Frank Hoerner and Denise Stenson.\n\nThe subsequent investigation showed that Frank Hoerner had not committed suicide but had been beaten unconscious, dragged into the house from the gravel driveway, through the laundry room and into the guest bedroom where he was shot in the head at close range. Evidence showed that Frank's hand had come to rest and then the revolver came to rest on it or it was placed on the hand. Stenson had a collection of nun-chu-ka sticks on the wall of his office and the weapon (which was not found) used to render Frank unconscious was consistent with such a weapon. Dr. Brady, who performed the autopsy on Frank, opined that the appearance of Frank's wounds was consistent with having been caused by that type of weapon. Stenson had been a martial arts instructor. The investigation showed spatters of Frank's blood out in the driveway and in the laundry room, and a bloody fingerprint of Stenson's on the freezer in the laundry room. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Stenson's jeans had blood spatters on them which were consistent with Frank Hoerner's blood protein profile. Some of the blood spatters on Stenson's jeans were the type of stains which could not have been deposited on the pants after Frank came to his final resting place on the floor. Ammunition which fit the murder weapon was found in Stenson's garage. Particles of gunshot residue were found inside Stenson's right pants pocket.\n\nThe investigation also revealed that Stenson was in difficult financial circumstances. Frank had paid $50,000 to Stenson, which was listed on his business books as deposits on birds, but at the time of Frank's death the books showed that only one purchase for two smaller birds totaling under $2,000 had been made from that investment. The bank account of Dakota Farms had a balance of only approximately $3,400, and an audit of Stenson's accounts showed that investors' money had been spent on the Stensons' personal purchases. The owner of the Dakota Farms, Kit Eldridge, was pressuring Stenson to buy the property pursuant to their buy-sell agreement and Stenson had agreed to do so. Their last conversation was in February 1993, and Stenson had told Eldridge he would buy the property soon because business was going well. The murders occurred March 25, 1993. Evidence showed that Stenson had sought large loans shortly before the murders.\n\nLife insurance policies were found in Stenson's office which showed that D.J. Stenson had purchased a total of $400,000 of life insurance on Denise Stenson's life. A $300,000 policy on her life (naming the owner of Dakota Farms, Kit Eldridge, as the beneficiary) had become effective in May 1992. The insurance agent explained at trial that the $300,000 policy was the Stensons' mortgage insurance.\n\nStenson was arrested on April 8, 1993, and charged with two counts of first degree aggravated murder; the State filed a timely notice of intent to seek the death penalty. The case was tried to a jury in Clallam County in July and August 1994. The prosecution's theory of the case was that Stenson had killed his wife to collect the $400,000 of life insurance and then had killed Frank Hoerner to get out from under the $48,000 of debt he owed to Frank and to blame Frank for Denise Stenson's murder. The prosecution told the jury that the physical evidence made Stenson's murder- suicide story impossible.\n\nFrank's wife, Denise Hoerner, testified that Stenson had convinced Frank he could double his money by investing in Stenson's exotic bird business and that Frank could get rich and have a better life than working so hard as a carpet installer. In 1992, Frank had started investing in the bird business and had given Stenson over $50,000 from the sale of his house. The only birds which Stenson ever purchased on behalf of the Hoerners were two small rheas; the ostriches were never purchased. Denise Hoerner testified that about a month before he was killed, Frank had become worried about the money he had invested and had told Stenson that he wanted the birds or his money back. She testified that Stenson told her and Frank that he needed to keep their money in his account to show Asian investors that he had money so he could get a loan from them. Mrs. Hoerner testified that Frank became worried again when Stenson went to Texas to get birds for Frank and returned without birds. She testified that Stenson told Frank he was going back to Texas on March 25, 1993, to get birds. Mrs. Hoerner testified that Stenson had told Frank to come to his house the night of March 24 to sign insurance papers in case something happened to the birds on the way back from Texas. Denise Hoerner offered to come sign the papers, but Stenson told her only Frank could sign them. Frank agreed to come during the early morning hours of March 25.\n\nAt the Conclusion of trial, the jury found Stenson guilty of the crimes of premeditated murder in the first degree of Denise Stenson and Frank Hoerner. With regard to the murder of Denise Stenson, the jury found the aggravating circumstance that there was more than one person murdered and the murders were part of a common scheme or plan. With regard to the murder of Frank Hoerner, the jury found the aggravating circumstances that (1) the defendant committed the murder to conceal the commission of a crime or to protect or conceal the identity of any person committing a crime, and (2) more than one person was murdered and the murders were part of a common scheme or plan.\n\nOn appeal, the Defendant raises issues relating to the guilt phase and the penalty phase of the trial. Pertaining to the guilt phase, the Defendant raises: (1) search warrant issues; (2) evidentiary issues; (3) prosecutorial misconduct issues; and (4) issues regarding his right to change lawyers or proceed pro se. Pertaining to the penalty phase, he raises (1) the issue whether his criminal history was admissible; (2) the issues whether \"execution impact\" testimony from his family should have been admitted and whether victim impact evidence should have been admitted on behalf of his deceased wife or his children; and (3) proportionality issues. GUILT PHASE ISSUES Search and Seizure Issues 1. Did the initial search warrant limit the scope of the search sufficiently to comply with the particularity requirement of the Fourth Amendment?\n\n2. If the initial warrant was constitutional, did the search conducted pursuant to the warrant violate the Defendant's constitutional rights because the search was beyond the scope of the warrant?\n\n3. Did the expanded search warrant limit the scope of the search sufficiently to comply with the particularity requirement of the Fourth Amendment?\n\n4. Did the method in which the expanded search warrant was executed violate the Defendant's Fourth Amendment right to be free from unreasonable searches?\n\n5. Was the consent to search executed by the Defendant limited to the search of his clothing, or did it authorize a complete and broad search of his house and papers?\n\nEvidentiary Issues 1. Did the trial court err in allowing Denise Hoerner to testify that D.J. Stenson had told her that his wife's job was to remain in the home and that she was supposed to stay at the house?\n\n2. Did the trial court err in allowing evidence that the Defendant had told his wife several days before the murders that if anything happened to his new truck, she would be in a \"lot of trouble\"?\n\n3. Did the trial court err in allowing the owner of Dakota Farms to testify that the reason he transferred ownership of the property to the Stensons' company after the murders was that he was concerned for his family's safety?\n\n4. Were the Defendant's counsel ineffective because they did not seek to exclude from evidence certain life insurance policies on the victim's life?\n\n5. Did the trial court err in allowing the admission of the Defendant's marriage certificate and his children's birth certificates?\n\n6. Did the trial court err in refusing to admit into evidence a message which had been left on the Defendant's answering machine?\n\n7. Did the trial court err in allowing evidence regarding phenolphthalein blood testing?\n\nProsecutorial Misconduct Issues Did the prosecutor act improperly and prejudicially in the following instances:\n\n1. In eliciting testimony from a paramedic about the unusual response of the Defendant in the presence of his critically injured wife?\n\n2. In using the passive voice and the word \"reportedly\" when referring to the sinking of the Defendant's boat while questioning the insurance broker who insured the vessel?\n\n3. In stating in closing argument that the Defendant had not exhibited grief to the paramedic?\n\n4. In stating in closing argument that there was no evidence that Frank Hoerner had taken $10,000 in cash to the Stensons' on the morning of the murders?\n\n5. In stating in closing argument that there was no evidence D.J. Stenson had received insurance proceeds after Stenson's boat was sunk? Representation of Counsel Issues Did the trial court err:\n\n1. In denying the Defendant's motion for substitution of counsel and continuance of trial?\n\n2. In denying the Defendant's motion to proceed pro se?\n\n3. In denying defense counsel's motion to withdraw? PENALTY PHASE ISSUES\n\n1. Did the trial court err in allowing, as aggravating factors in the penalty phase of the trial, evidence of all the Defendant's prior criminal convictions, including his misdemeanor convictions?\n\n2. Did the trial court err in excluding victim impact statements and execution impact evidence?\n\n3. Did the trial court err in denying the Defendant's motion for a retrial due to the prosecutor's cross examination of the defense's mitigation specialist?\n\n4. Was there sufficient evidence for the jury to impose the death penalty, and was the imposition of the death penalty disproportionate? ANALYSIS Guilt Phase Search and Seizure Issues The Defendant challenges the validity of the search warrant, the scope of the searches conducted, and the seizure of evidence. The Defendant essentially argues:\n\n(1) The first search warrant, search warrant 561, did not meet the requirements of the Fourth Amendment because it did not state with particularity the things to be searched;\n\n(2) If the warrant is held to be constitutional, the search itself exceeded the scope of the warrant;\n\n(3) If the initial warrant and search are held constitutional, then the warrant, as expanded under the second addendum, violated the Fourth Amendment because it did not continue to limit the scope of the search or because it did not identify the crime under investigation;\n\n(4) If the warrant, as expanded under the second addendum, is found to be constitutional, the ensuing search exceeded the scope of the expanded warrant.\n\nThe State argues not only that the warrants are valid but that they were not necessary, because Darold Stenson had previously executed a general, unlimited consent to search which was never revoked.\n\nDefendant Stenson does not challenge the existence of probable cause to issue the warrants and he does not challenge the validity of his own consent to search, although he does challenge the State's interpretation of the scope of the consent. Facts Relating to Search and Seizure Issues At 5:28 a.m., approximately one hour after police arrived at his home on the day of the murders, Defendant Stenson signed a document entitled \"Permission to Search.\" The document states that Stenson understood his constitutional right to refuse to consent to a search of his property and that he voluntarily, without threat or promise of any kind, was giving written permission to the officers to conduct \"a complete search\" of his property and to take from the premises \"any letters, papers, materials, or any other items or things, which they require as evidence for criminal prosecution in the case or cases under investigation.\" Exhibit 5 (admitted March 14, 1994, at CrR 3.5/3.6 hearing). The permission to search form was explained and given to Defendant Stenson. He read it and filled out the form in his own handwriting before signing it. Near the time that this consent to search was signed, police also asked Defendant Stenson for the clothes he was wearing at the time of the shootings. Stenson voluntarily gave the officers his clothing at 6:35 a.m.\n\nA few hours later, at 10:50 a.m., police telephonically applied for the first of 11 search warrants. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The testimony given to the Judge in support of the warrant included the following information:\n\nThe officers were investigating a multiple shooting that resulted in critical injury to Denise Stenson and in the death of Frank Hoerner. The shootings occurred at Dakota Farms, the home and business of Darold Stenson and Denise Stenson. Darold Stenson was at Dakota Farms when Frank Hoerner and Denise Stenson were shot.\n\nFrank Hoerner and his wife and Darold Stenson and his wife were friends and had dined together on the evening before the shootings. Frank Hoerner and his wife reportedly had marital sex problems and Frank Hoerner and Denise Stenson reportedly had an unspoken physical attraction to each other.\n\nFrank Hoerner and Darold Stenson were business partners in an exotic bird venture located at the Stenson property. Frank Hoerner had invested heavily in the business. It appeared that Darold Stenson was planning to dissolve the partnership.\n\nAt the request of Darold Stenson, Frank Hoerner telephoned the Stenson home at 3:30 on the morning of the shootings and then went to the Stenson property to sign some insurance papers. Hoerner reportedly brought $10,000 in a black briefcase with him that morning. The shootings apparently occurred within 30 minutes of Frank Hoerner's arrival at Dakota Farms.\n\nThere were inconsistencies between the officers' initial observations and Darold Stenson's story of the shootings. For example, Darold Stenson had said he believed Frank Hoerner shot Mrs. Stenson and then shot himself. However, there appeared to be blood spatters in the entryway near the front door and near the stairs. Stenson reported that he called police immediately after discovering the bodies. However, it appeared the entryway to the body of Frank Hoerner had been cleaned.\n\nThe Judge determined there was probable cause to believe a crime had been committed and issued a warrant authorizing a search of Dakota Farms, including all buildings and outbuildings as well as all vehicles. The evidence to be seized is described in Addendum \"B\" to search warrant 561, as follows:\n\nThe body of Frank HOERNER, all firearms, bullets, other ammunition, all clothing of Mr. and Mrs. STENSON and Frank HOERNER wearing when the incident occurred. Trace evidence to include hair and fiber samples, gun powder residue, latent fingerprints, blood spatter evidence, carpet and floor samples, paint chips, the cleaner and sponge, evidence of a business relationship and financial records, cash brought to the location by Mr. HOERNER in a black brief case, personal records, correspondence, photographs and film which may indicate a relationship or association between the STENSONS and HOERNERS, bedding where the incident occurred, any other latent evidence that may be found during the forensic examination of the scene.\n\nExhibit 6. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe following day, police requested an addendum to search warrant 561 to expand the search to include a travel trailer on the property and an Apple MacIntosh computer that was found in the office at Dakota Farms. The officers requested permission to open the computer files to see if they contained information showing a business, financial or personal association between Stenson and Hoerner. This addendum is not challenged by the Defendant.\n\nOn March 30, 1993, five days after the initial warrant was issued, police officers requested another expansion of the scope of search warrant 561. The information submitted to the Judge in support of this second addendum was based on the results of the search to that date and on the autopsy reports of Frank Hoerner and of Denise Stenson, who died March 26, 1993. The affidavit in support of the expanded warrant requests that the court \"incorporate this addendum with those search warrants previously filed\" in this case. The affidavit, contained in exhibit 6, includes the following information:\n\nThe autopsy of Frank Hoerner showed that Mr. Hoerner had been assaulted before he was shot. He had been struck on the head with a rectangular shaped blunt instrument. The head injury would have rendered him unconscious or stunned. The autopsy report also noted that bits of gravel were embedded in Mr. Hoerner's back and buttocks. The gravel appeared to be from the driveway at the Stenson residence. The autopsy showed that Mr. Hoerner did not commit suicide but was killed by a single bullet wound to the head.\n\nPolice officers were informed that Denise Stenson's autopsy revealed marks on her wrists consistent with being tied or bound. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The life of Denise Stenson had been insured for more than $400,000 (including mortgage insurance). Statements from Mrs. Hoerner and documents reviewed at Dakota Farms indicated that Mr. Stenson had realized in excess of $100,000 some years earlier in an apparent insurance fraud. This previous insurance claim was based on the sinking of a large marine vessel, the \"Dragon Weyr.\" Items that had been reported missing, along with the ship, included an Apple MacIntosh computer and scuba gear. A seemingly identical computer and scuba gear matching the description of that lost on the ship, as well as other nautical equipment, were found at Dakota Farms.\n\nBusiness records indicated that Dakota Farms may have been in financial trouble. Other records, business cards, credit cards and legal papers indicated that Darold Stenson was currently or had been involved in several other unrelated businesses. Further, he used other names, was in debt, and had filed for bankruptcy in the past. Documents and interviews with Mrs. Hoerner indicated that Frank Hoerner had paid Stenson tens of thousands of dollars for exotic birds and had not realized any return on his money. The relationship between Frank Hoerner and Darold Stenson had recently been strained.\n\nIllegal drugs also were found in the home, as well as criminal information papers describing charges against Darold Stenson for possession of cocaine. The federal Drug Enforcement Administration (DEA) had interviewed Stenson, and a DEA affidavit apparently referred to in the information states that Stenson described a method for laundering profits from drug sales.\n\nStatements made by Darold Stenson were inconsistent with the results of the investigation.\n\nThe affidavit requesting the addendum stated the officers believed the relationship between Frank Hoerner, Dakota Farms and the Stensons was \"a key in identifying the motive behind these killings\" and, further, that it appeared that financial gain from the death of his wife could have been a prime motive for the double homicide.\n\nThe Judge found there was probable cause to believe that the crime of homicide had been committed. He also said:\n\nIt is certainly also possible to believe that other crimes may have been committed . . . and that the homicide is directly related to them either by means of a cover-up or by means of a motive and therefore, it would be appropriate to attempt to . . . examine and/or seize materials which might relate directly to those crimes. Exhibit 6.\n\nThe addendum was granted and warrant 561 was expanded to authorize seizure of the following evidence:\n\nAll business records written and on computer, insurance policies, records of financial judgments, bank records, loan records, indebtedness and income records, and any other financial records pertaining to the STENSONS and/or Dakota Farms. Lists of the STENSON'S associates, phone records for 206-683-5968, and bank records held by financial institutions relating to the STENSON'S\n\nand or Dakota Farms. Blunt instruments and binding material (ropes, wire, cord, etc.). Exhibit 6.\n\nThe affidavit in support of the addendum is attached to the warrant addendum and incorporated therein by reference.\n\nThe Defendant moved to suppress evidence seized pursuant to his consent and pursuant to the warrants issued in the case. The trial court denied the motion. Particularity of Warrant 561 The Defendant first argues that the initial search warrant issued in this case violated rights guaranteed him under the Fourth Amendment because search warrant 561 did not specifically describe the things to be seized.\n\nThe Fourth Amendment provides that \"no warrants shall issue, but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" U.S. Const. amend. IV.\n\nOne of the purposes of the search warrant particularity requirement is to prevent the issuance of a \"general warrant\" which would authorize an unlimited search for and seizure of any evidence of any crime. Andresen v. Maryland, 427 U.S. 463, 479-80, 96 S. Ct. 2737, 49 L. Ed. 2d 627 (1976); United States v. Holzman, 871 F.2d 1496, 1508 (9th Cir. 1989); State v. Perrone, 119 Wash. 2d 538, 545, 834 P.2d 611 (1992).\n\nGeneral warrants, of course, are prohibited by the Fourth Amendment. \"The problem [posed by the general warrant] is not that of intrusion per se, but of a general, exploratory rummaging in a person's belongings. . . . [The Fourth Amendment addresses the problem] by requiring a 'particular description' of the things to be seized.\" Coolidge v. New Hampshire, 403 U.S. 443, 467[, 91 S. Ct. 2022, 29 L. Ed. 2d 564] (1971). Andresen, 427 U.S. at 480. See generally 2 Wayne R. LaFave, Search and Seizure sec. 4.6(a), at 550-61 (3d ed. 1996).\n\nWhether a warrant meets the particularity requirement of the Fourth Amendment is reviewed de novo. Perrone, 119 Wash. 2d at 549.\n\nTo comply with the mandate of the Fourth Amendment particularity clause, a search warrant must be sufficiently definite so that the officer executing the warrant can identify the property sought with reasonable certainty. LaFave, supra, sec. 4.6(a), at 551 (citing State v. Muldowney, 60 N.J. 594, 292 A.2d 26 (1972)). Thus, search warrants are to be tested and interpreted in a common sense, practical manner, rather than in a hypertechnical sense. Perrone, 119 Wash. 2d at 549.\n\nIn general, the degree of specificity required varies according to the circumstances and the type of items involved. Perrone, 119 Wash. 2d at 546. A description is valid if it is as specific as the circumstances and the nature of the activity, or crime, under investigation permits. Perrone, 119 Wash. 2d at 547; State v. Riley, 121 Wash. 2d 22, 27-28, 846 P.2d 1365 (1993).\n\nThe fact that a warrant lists generic classifications, such as business records or certain kinds of documents, does not necessarily result in an impermissibly broad warrant. Riley, 121 Wash. 2d at 28. A search warrant for documents generally is given closer scrutiny than one for physical objects because of the potential for intrusion into personal privacy. Andresen, 427 U.S. at 482 n.11; LaFave, supra, sec. 4.6(d), at 569. However, where the precise identity of items sought cannot be determined when the warrant is issued, a generic or general description of items will be sufficient if probable cause is shown and a more specific description is impossible. Perrone, 119 Wash. 2d at 547; Andresen, 427 U.S. at 480; State v. Scott, 21 Wash. App. 113, 118, 584 P.2d 423 (1978) (warrant authorizing a search for and seizure of \"employment and business records\" was not impermissibly broad); United States v. Gomez-Soto, 723 F.2d 649, 653 (9th Cir. 1984) (search of records relating to international travel not impermissibly broad as it related to crimes under investigation).\n\nDefendant Stenson argues that search warrant 561 was broadly phrased and contained no limit upon officers in their search of Mr. Stenson's business records and personal papers and, thus, was a general warrant allowing officers to search for and to seize any evidence of any crime.\n\nHowever, the warrant does contain limiting language. The warrant states, in pertinent part:\n\nThe evidence to be seized is described as follows:\n\nEvidence of a business relationship and financial records, cash brought to the location by Mr. HOERNER in a black brief case, personal records, correspondence, photographs and film which may indicate a relationship or association between the STENSONS and HOERNERS . . . . Exhibit 6 (emphasis added).\n\nThe Defendant claims the warrant's limiting language (\"which may indicate a relationship or association between the STENSONS and HOERNERS\") applied only to the search of the Stensons' \"photographs and film.\" The Defendant appears to concede that if the warrant is interpreted as limiting the search of business and personal papers to those indicating a relationship or association between the Stensons and the Hoerners, then a meaningful limitation would have been placed on the scope of the warrant.\n\nA practical, commonsense interpretation of the warrant language, keeping in mind the circumstances of the case, is that the limiting phrase related to all of the evidence contained in the business, financial and personal records of Darold and Denise Stenson.\n\nHere there was probable cause to believe a crime had been committed and that evidence of the relationships between the Hoerners and the Stensons related to the crime. There was probable cause to seize (1) evidence associated with the shooting of Denise Stenson and of Frank Hoerner, and (2) evidence indicating relationships between the Hoerners and the Stensons. The description of documents to be seized was limited to those evincing a relationship between those who appeared to be involved in the crime.\n\nWe conclude search warrant 561 was not impermissibly broad, as it limited the search for, and seizure of, business, financial and personal records to those indicating a relationship between the Hoerners and the Stensons. The Scope of the Search Under Warrant 561 The Defendant argues that even if the court determines that search warrant 561 did not violate the Fourth Amendment particularity clause, the search conducted under the warrant was made without regard to the limitation set forth in the warrant.\n\nIn support of his argument, the Defendant states the record shows the police officers looked at records and documents that did not indicate a relationship between the Hoerners and the Stensons. These records and documents included life insurance policies on the life of Denise Stenson, records pertaining to possible insurance fraud, records indicating debt on the part of the Stensons, and records indicating possible involvement of Darold Stenson, Dakota Farms and others in illegal drug trade.\n\nBefore seizing any of the documents that did not obviously and specifically indicate a relationship between the Stensons and the Hoerners, officers sought an expanded warrant.\n\nThe United States Supreme Court recognized that officers executing a search warrant for documents related to certain transactions would, out of necessity, have to examine to some extent documents not specifically listed in the warrant. In Andresen, 427 U.S. at 482 n.11, the Court stated:\n\nWe recognize that there are grave dangers inherent in executing a warrant authorizing a search and seizure of a person's papers that are not necessarily present in executing a warrant to search for physical objects whose relevance is more easily ascertainable. In searches for papers, it is certain that some innocuous documents will be examined, at least cursorily, in order to determine whether they are, in fact, among those papers authorized to be seized. Similar dangers, of course, are present in executing a warrant for the \"seizure\" of telephone conversations. In both kinds of searches, responsible officials, including judicial officials, must take care to assure that they are conducted in a manner that minimizes unwarranted intrusions upon privacy.\n\nIn this case, the officers necessarily looked at documents to determine whether those documents indicated a relationship between the Stensons and the Hoerners. Under Andresen, that viewing of documents was not unreasonable or illegal.\n\nWhere officers executing a warrant find evidence not described in the warrant and not constituting contraband or instrumentalities of crime, the officers may seize the evidence if it will aid in a particular apprehension or conviction, or has a sufficient nexus with the crime under investigation. State v. Terrovona, 105 Wash. 2d 632, 648, 716 P.2d 295 (1986); State v. Turner, 18 Wash. App. 727, 729, 571 P.2d 955 (1977).\n\nWhen the officers searching the Stenson records found documents tending to show prior insurance fraud on the part of Mr. Stenson, and life insurance policies on Mrs. Stenson's life, they reasonably could believe these documents might relate to a motive for the shooting death of Denise Stenson. Similarly, documents tending to show that Darold Stenson was involved in illegal drug transactions and that he and Dakota Farms were in debt also could relate to motive or intent to murder Frank Hoerner. It thus appears the documents would aid in the investigation and conviction or that they had a sufficient nexus with the crime under investigation to justify the search. These documents were properly searched under Terrovona.\n\nWe conclude the officers executing search warrant 561 did not exceed the lawful scope of the search. The Sufficiency of the Expanded Warrant The Defendant argues that because the limitation contained in the original warrant was not repeated in Addendum E, the entire warrant was converted into a general warrant.\n\nThe expanded warrant was based on a 14-page affidavit which is incorporated into the warrant. The affidavit specifically relates the documents requested to the double homicide under investigation. It does not indicate that police were interested in searching for evidence of any other crime, except to the extent that additional crimes might show a motive for the murders. The trial court's ruling on the request for the expanded search warrant also related the evidence sought to the murders under investigation.\n\nAn overbroad warrant may be cured for the purposes of meeting the particularity requirement of the Fourth Amendment where the affidavit and the search warrant are physically attached, and the warrant expressly refers to the affidavit and incorporates it with \"suitable words of reference.\" Riley, 121 Wash. 2d at 29; State v. Kelley, 52 Wash. App. 581, 585, 762 P.2d 20 (1988).\n\nHere, the affidavit was both physically attached to the warrant and incorporated into the warrant by reference. That affidavit limited the scope of the search for and seizure of documents and records to those related to the double homicides.\n\nWe conclude the addendum to search warrant 561 was sufficiently limited to satisfy the requirements of the particularity clause of the Fourth Amendment. The Consent to Search The State argues that the searches here were conducted pursuant to both a valid consent to search and constitutionally valid search warrants. The Defendant did not assign error to the trial court's findings and Conclusions with respect to the consent to search. The unchallenged findings of fact include the following:\n\n9. At approximately 5:28 a.m., the Defendant executed a permission to search form, admitted as Exhibit 5 at this hearing.\n\nDeputy Fuchser and Detective Sgt. Monty Martin, CCSO, who had arrived at the scene at about 4:50 a.m. explained the form to the Defendant and witnessed his signature. The Defendant was not emotional, agitated, or excited. He appeared oriented, alert, and intelligent.\n\n10. At about 6:30 a.m. Sgt. Martin asked for and received the Defendant's clothing that he had been wearing prior to the arrival of law enforcement personnel. No other physical items of evidence were taken at that time. Clerk's Papers at 177.\n\nBecause the Defendant fails to challenge any of the findings of fact entered after the suppression hearing, they are treated as verities on appeal. State v. Gentry, 125 Wash. 2d 570, 605, 888 P.2d 1105 (1995). Additionally, the trial court's findings are supported by the evidence. The Defendant did not testify at the suppression hearing. The only evidence, from police officers, was to the effect that the request for permission to conduct a broad search and the request for Defendant Stenson's clothing were separate requests.\n\nBased on the evidence presented, the trial court determined that Defendant Stenson's permission to search was voluntary. The trial court's reasons and Conclusions relating to this determination included the following:\n\n5. Prior to signing the consent, Deputy Fuchser told the Defendant to carefully read the permission to search, which the Defendant did. The Defendant also filled in the blanks provided in the form before signing it. The Defendant asked no questions concerning his rights and there was no misunderstanding of the terms.\n\n6. The form itself contains a clear statement that the Defendant had \"the lawful right to refuse to consent to such a search.\"\n\n8. The Defendant displayed little emotional distress. What distress he did display was not so profound as to impair his ability or capacity for self determination or understanding of what the investigators were seeking by way of permission to search. Accordingly, the Court finds the consent was given freely and voluntarily by the Defendant with a full understanding of the nature of the question and of his right to refuse consent.\n\n9. At the time of the request for the clothing, the Defendant had been fully informed of his right to refuse consent.\n\nWith this knowledge, the Defendant freely consented to the seizure of his clothing. There was no coercion, threats, or intimidation of any kind. Clerk's Papers at 184-85.\n\nThe consent to conduct a complete search of the premises and to take \"any letters, papers, materials, or any other items or things\" required as evidence for criminal prosecution of the cases under investigation is a valid and broad consent. The State did not rely on the consent for the search, however, and additionally sought the warrants before any evidence was seized.\n\nThe trial court's CrR 3.6 rulings with respect to search and seizure were correct, and we affirm the trial court rulings on the search and seizure issues. Evidentiary Issues Statements Regarding Stenson's Relationship The Defendant argues that his statement that he didn't want his wife \"gallivanting\" around town when her job was to be in the home and she was going to stay there at the house was irrelevant. The Defendant also argues that testimony that he had told his wife that if anything happened to his truck, she would be in a \"lot of trouble\" was irrelevant. Even if relevant, the Defendant argues that the probative value of the evidence is substantially outweighed by unfair prejudice.\n\nDuring Denise Hoerner's testimony, she testified that \"DJ told her [Denise Stenson] she was only allowed to leave the house once a day.\" Report of Proceedings at 723. Defense counsel objected on relevancy and hearsay grounds, the prosecutor offered to rephrase his question, and the Judge sustained the objection and instructed the jury to disregard the remark. The Judge allowed the prosecutor to rephrase the question. When the prosecutor sought to rephrase, defense counsel objected again and the issue was discussed outside the presence of the jury.\n\nThe Judge asked for an offer of proof while the jury was out and allowed the prosecutor and defense counsel to argue their positions. The prosecutor characterized the statement as another bit of evidence about the relationship between Stenson and his wife and argued that evidence bearing on the relationship of the Defendant and the murder victim was relevant. Defense counsel argued the evidence was irrelevant and not probative of the relationship between Denise and D.J. Stenson. The trial court found the statement did have some relevance and that its probative value was not outweighed by its prejudicial impact. The court reasoned that there was some inference which would be relevant to the relationship between Stenson and his wife and that the relationship certainly was relevant to the ultimate issue of whether Stenson killed her. The following testimony was allowed:\n\nQ. . . . .\n\nAnd did the defendant ever mention to you why it was that you had to go to the Stenson house rather than Denise Stenson visiting you at your home?\n\nA. Yes. He told me just because my husband let me gallivant around town, he wasn't gonna -- that his wife -- her job was to be in the home and she was to stay there at the house. Report of Proceedings at 739-40.\n\nThe Defendant also objects to the admission of a conversation between the Defendant and his wife which was heard by another witness, Linda Stocker. Before Ms. Stocker (a bank loan officer) testified, the defense made a motion in limine to restrict her testimony. Three days before the murders, Ms. Stocker had come to the Stenson home to investigate the property as collateral for a loan which Stenson had sought. While on the property, Ms. Stocker observed an interchange between Stenson and his wife. When his wife asked if she could drive the truck to take the children to town, Stenson replied that she could, but if anything happened to his truck, she would be in a lot of trouble. The prosecutor argued that this evidence was relevant to the issue of their relationship.\n\nThe defense argued that the conversation was irrelevant and did not show any problems in their marital relationship, and that its prejudicial impact was higher than its probative value. The trial court allowed the evidence, finding that since the husband was accused of killing his wife, the nature of their relationship was relevant. The court balanced the probative value and prejudicial impact and concluded there could be an inference of antagonism shown by the interchange and that the testimony did not cause any unfair prejudice. Ms. Stocker was allowed to answer the prosecutor's question of how Stenson replied when Denise Stenson asked him if she could drive the pickup truck. She testified that:\n\nA. He [Stenson] said that yes she could take it but that if anything happened to his truck, she would be in a lot of trouble.\n\nQ. And what did she do when she was told this? Did she say anything or what did she do?\n\nA. She, she then disappeared from the group and went back into the house.\n\nQ. Did you ever see her leave in the pickup truck?\n\nA. No.\n\nQ. What was his tone of voice when he told her if anything happened you would be in trouble? Was he joking? Or serious?\n\nA. My interpretation of his tone of voice?\n\nQ. Yeah.\n\nA. I mean, he wasn't joking in my mind. He just --\n\n[Defense Counsel]: Your Honor, I'll object to the opinion being given. The question calls for a factual observation.\n\nTHE COURT: Sustained.\n\nQ. What was his tone of voice to his wife?\n\nA. He continued in the same business tone of voice that he had been using with us. Report of Proceedings at 390-91.\n\nThe defense argues that this testimony characterized Stenson as a controlling husband and a mean man and is not at all probative of whether he killed his wife three days later. On appeal, the Defendant argues both pieces of evidence were irrelevant and were prejudicial and should not have been admitted.\n\nThis Court reviews a trial court's decisions as to the admissibility of evidence under an abuse of discretion standard. E.g., State v. Pirtle, 127 Wash. 2d 628, 648, 904 P.2d 245 (1995), cert. denied, 135 L. Ed. 2d 1084, 116 S. Ct. 2568 (1996); State v. Powell, 126 Wash. 2d 244, 258, 893 P.2d 615 (1995) (this court will not disturb a trial court's rulings on a motion in limine or the admissibility of evidence absent an abuse of the court's discretion); State v. Swan, 114 Wash. 2d 613, 658, 790 P.2d 610 (1990) (the admission and exclusion of relevant evidence is within the sound discretion of the trial court and the court's decision will not be reversed absent a manifest abuse of discretion). When a trial court's exercise of its discretion is manifestly unreasonable or based upon untenable grounds or reasons, an abuse of discretion exists. Powell, 126 Wash. 2d at 258.\n\nER 401 defines relevant evidence as evidence having a tendency to make the existence of any fact that is of consequence to the determination of the action more or less probable than it would be without the evidence. Relevant evidence is admissible, ER 402, but may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice. ER 403. A trial Judge has wide discretion in balancing the probative value of evidence against its potentially prejudicial impact. State v. Rivers, 129 Wash. 2d 697, 710, 921 P.2d 495 (1996).\n\nEvidence of a defendant's motive is relevant in a homicide prosecution. E.g., State v. Osborne, 18 Wash. App. 318, 325, 569 P.2d 1176 (1977); Pirtle, 127 Wash. 2d at 644. We have held in a case involving the murder of a wife by her husband that evidence of quarrels and ill-feeling may be admissible to show motive, and evidence of prior threats is also admissible to show motive or malice if the evidence is of consequence to the action. Powell, 126 Wash. 2d at 260. In the Powell case, the trial court properly allowed testimony which established a hostile relationship between the defendant and his wife to show motive for the murder. Powell, 126 Wash. 2d at 260.\n\nIn Powell, we explained that evidence of previous disputes or quarrels between the accused and the deceased is generally admissible in murder cases, and that such evidence tends to show the relationship of the parties and their feelings one toward the other and often bears directly upon the state of mind of the accused with consequent bearing upon the question of malice or premeditation. In this case, the evidence of the \"gallivanting\" remark, which showed Stenson's controlling behavior toward his wife, does shed some light on his relationship with her. While the evidence was not as relevant as the evidence of assaults in the Powell case, the trial court in this case reasonably concluded that it did have some relevance and it was not nearly as prejudicial as the evidence which we found was properly admitted in Powell. While it is not clear what kind of \"trouble\" Denise Stenson would have been in had anything happened to the truck, the remark had a threatening tone and does have some relevance to show the relationship and Stenson's feelings for his wife. Additionally, there was other testimony that Stenson and his wife appeared to have a good relationship, and this evidence tended to refute that testimony. We conclude the trial court did not abuse its discretion in allowing the testimony. Kit Eldridge's Testimony of Why He Transferred Ownership of the Dakota Farms Property\n\nThe Defendant also argues that the trial court erred in admitting evidence that Kit Eldridge deeded the property to the Stensons' company \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e after the murders because he was afraid. Kit Eldridge had won the lottery and had asked Bill Perry (a friend of Stenson's) in 1990 how to invest the money. Mr. Perry suggested that he buy property and enter a \"buy-sell\" agreement with Stenson. Kit Eldridge entered into an agreement with Stenson wherein Eldridge purchased the property for $242,000 and Stenson was to pay the mortgage payment each month until he purchased the property from Eldridge. Mr. Eldridge had intended to hold the property for three to five years but began asking Stenson to buy him out in late 1992. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e One week after Denise Stenson was killed, Bill Perry went to Kit Eldridge as a \"messenger\" from D.J. Stenson to tell him that Stenson had a life insurance policy on his wife and that he was probably going to use the proceeds to buy the house. A few days later Bill Perry again went to see Kit Eldridge and took a beneficiary claim form. At that time Eldridge learned that he was the beneficiary of a $300,000 life insurance policy on Denise Stenson's life. Mr. Eldridge testified that he had no idea he was the beneficiary until after her death. Mr. Eldridge testified that his understanding from Bill Perry was that $250,000 of the insurance proceeds should be kept by Eldridge to pay off the house and the remainder was to go to Stenson or Dakota Farms.\n\nMr. Eldridge explained he was under no legal duty to transfer the property to Stenson. The defense agreed that the evidence that Mr. Eldridge was under no legal obligation to transfer the property to Stenson after he got the life insurance proceeds was admissible. However, the defense sought to exclude the evidence that Mr. Eldridge did deed the property over to \"Dakota Farms\" because he was afraid. The defense argued it was irrelevant why Kit Eldridge decided to give the property to the Defendant's company. The court ruled that whether Mr. Eldridge was required by the life insurance policy to deed the property to Stenson was clearly relevant. This relevant evidence raised the question as to his reasons for doing what was not legally required of him. The trial court reasoned that any negative implications could be addressed on cross- examination. Kit Eldridge was allowed to testify:\n\nQ. . . . .\n\nYou had testified that you were under no obligation to apply those insurance benefits to pay off the deed; was that correct?\n\nA. That's correct.\n\nQ. Why then did you pay off the deed on Dakota Farms and deed it to Dakota Farms?\n\nA. Because I was concerned for my family's safety at that time. Report of Proceedings at 939.\n\nThe defense then cross-examined Eldridge and established that no one had pressured him, made any promises to him, or made any threats to convince him to transfer the property.\n\nThe Defendant now argues that why Kit Eldridge deeded the property to Stenson was of no consequence. As noted above, the trial court has the discretion to decide if evidence is relevant and whether unfair prejudice outweighs the probative value. Here, Stenson had purchased a large life insurance policy on his wife's life and had named Kit Eldrige as the beneficiary. All parties agreed that the fact that Mr. Eldridge had no legal obligation to use the insurance proceeds to pay off the mortgage on the property and to deed it over to Stenson was relevant and admissible. In light of the relevance of that evidence, the trial court reasonably allowed Mr. Eldridge to testify as to why he gave Stenson property worth a quarter of a million dollars. It is reasonable that it might frighten someone to learn that he was the beneficiary of a large life insurance policy on a person he barely knew who had been murdered. A trial court abuses its discretion if its ruling is manifestly unreasonable or based upon untenable grounds or reasons. Powell, 126 Wash. 2d at 258. Under the facts here, we cannot find such an abuse of discretion. Leaving the jury to speculate as to why Mr. Eldridge would deed the valuable property to Stenson is likely to have caused more prejudice and confusion than admitting the testimony and allowing the defense to show a lack of threats by the Defendant. We find no error in the trial court's decision to allow the testimony. Ineffective Assistance of Counsel Regarding Life Insurance The Defendant contends his counsel were ineffective because they did not seek to exclude the evidence of the life insurance policy that Stenson bought on his wife's life which named Kit Eldridge as the beneficiary.\n\nA criminal defendant received constitutionally inadequate representation only if: (1) the defense attorney's performance was deficient, i.e., fell below an objective standard of reasonableness based on a consideration of all the circumstances, and (2) such deficient performance prejudiced the defendant, i.e., there is a reasonable probability that the outcome would have been different had the representation been adequate. State v. Brett, 126 Wash. 2d 136, 198-99, 892 P.2d 29 (1995), cert. denied, 133 L. Ed. 2d 858, 116 S. Ct. 931 (1996); Strickland v. Washington, 466 U.S. 668, 104 S. Ct. 2052, 80 L. Ed. 2d 674 (1984); State v. King, 130 Wash. 2d 517, 531, 925 P.2d 606 (1996).\n\nIn this case, the Defendant's argument fails the first prong of the test. Evidence of life insurance on the life of the victim which benefits the accused is relevant in a murder prosecution to show motive. State v. Crudup, 11 Wash. App. 583, 591, 524 P.2d 479 (1974); State v. Cole, 54 Wash. App. 93, 96, 772 P.2d 531 (1989) (where the existence of an insurance policy is relevant, as in showing the accused had a motive for killing in a homicide case, proof of the policy and its relationship to the accused must be shown); State v. Leuch, 198 Wash. 331, 337, 88 P.2d 440 (1939) (life insurance admissible if the State establishes or makes it a jury question whether the defendant knew the policy was in effect); 1 Charles E. Torcia, Wharton's Criminal Evidence sec. 115, at 402 (14th ed. 1985) (generally, testimony about insurance policies on the life of a decedent are admissible in homicide cases).\n\nThere is no question here that Stenson knew of the existence of the $300,000 and the $100,000 policies on his wife's life he purchased them. The Defendant argues that the life insurance was irrelevant because it named another besides himself as the beneficiary of the $300,000 policy. Yet, the record is clear that when the Defendant purchased the insurance, and when he made arrangements for collecting the insurance proceeds, he intended to be the actual beneficiary.\n\nThe insurance agent who sold the insurance to Stenson testified that the $100,000 policy named Stenson as the direct beneficiary and the $300,000 policy named Kit Eldridge and was for \"mortgage insurance because Darold told me he was starting to buy the property.\" Report of Proceedings at 703. The insurance agent testified that when the Defendant purchased the $300,000 policy on Denise's life, Stenson was leasing and planning to buy the property from Kit Eldridge, so the policy was to pay off the mortgage debt. The beneficiary of the $300,000 policy is listed on the policy as \"Christopher \u0026 Marlene Eldridge/Seller\" and the alternate, if Eldridge was deceased, as \"Countrywide Mortgage.\" Stenson's friend, Bill Perry, testified that he went to Kit Eldridge as a \"messenger\" from Stenson to give Eldridge the claim forms for the life insurance. As noted above, Kit Eldridge testified that his understanding from Bill Perry was that $250,000 of the insurance proceeds should be kept by Eldridge to pay off the house and the remainder was to go to Darold Stenson or Dakota Farms. The named beneficiary, Kit Eldridge, transferred the property to Dakota Farms (the Stensons' company) after he received the life insurance proceeds.\n\nThe record shows the Defendant knew about all $400,000 of insurance, and that he intended to be, and actually was, the ultimate beneficiary of that insurance. Therefore, his argument that the life insurance was irrelevant and would have been excluded had his attorneys so requested is without merit. Hence, his argument that his attorneys were ineffective in this regard fails under the Strickland test, as their performance did not fall below an objective standard of reasonableness based on a consideration of all the circumstances. Marriage and Birth Certificates The Defendant argues that the trial court erred in admitting the Stensons' marriage certificate and their children's birth certificates because they showed that two of the children had been born before the Stensons were married. The defense argued the documents were irrelevant or that any probative value was substantially outweighed by their prejudicial effect.\n\nWe find the record supports the trial court's Conclusion that the documents were relevant to show the relationship between the parties and how that might relate to the ownership of the Dakota Farms property, to the Defendant's prior statements, which the jury had heard, that he and his wife had been together \"off and on\" for seven or eight years, and to the prior evidence by Bill Perry that he had paid child support on behalf of Stenson and how that might have occurred. The court properly concluded the documents helped to explain some of the prior testimony and to explain the insurance policies and potential beneficiaries. The court noted that as the Defendant had more children, it made sense to buy more insurance, which is what had occurred. The trial court acted within its discretion in finding that the documents were relevant and not unfairly prejudicial.\n\nThe Defendant argues that evidence which showed he and Denise had two of their children before they were married might be considered bad character evidence under ER 404(b). ER 404(b) provides:\n\nEvidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show action in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\n\nThis evidence was not being admitted to prove character \"in order to show action in conformity therewith.\" Having fathered children before marriage does not tend to show he acted in conformity with his character when he killed his wife and friend. Rather, it was being admitted to clarify other testimony and to prove the relationship between the family members as it might relate to business arrangements or insurance policies. Evidence which is relevant and necessary to purposes other than proving character or propensity will not be excluded because it may also tend to show that the defendant committed another bad act unrelated to the crime charged. Powell, 126 Wash. 2d at 264.\n\nThe Defendant argues that the trial court erred in failing to balance on the record the probative value of the evidence with the prejudicial impact. Even if this evidence is considered to be ER 404 evidence, we disagree that the trial court failed to balance the probative value of the evidence with the prejudicial impact. The trial court dismissed the jury, heard arguments from both counsel, and carefully considered the inferences which might follow from the admission of the marriage and birth certificates. The court did not abuse its discretion, as the decision to admit the evidence was not manifestly unreasonable or based upon untenable grounds. See Powell, 126 Wash. 2d at 258; Davis v. Globe Mach. Mfg. Co, 102 Wash. 2d 68, 77, 684 P.2d 692 (1984).\n\nEven if it was error to admit the birth certificates, it does not warrant reversal. Any prejudicial aspects were neither particularly inflammatory nor similar to the crime at issue. See State v. Lord, 117 Wash. 2d 829, 873, 822 P.2d 177 (1991). An evidentiary error which is not of constitutional magnitude, such as erroneous admission of ER 404(b) evidence, requires reversal only if the error, within reasonable probability, materially affected the outcome. State v. Halstien, 122 Wash. 2d 109, 127, 857 P.2d 270 (1993). Here, the documents simply repeated facts which were already in evidence. Telephone Answering Machine Message The Defendant sought admission into evidence of the text of a tape recording from his telephone answering machine which one of the officers had listened to and copied. The officer testified it contained a phone message from a Michael Terelli of Frederick Ostrich Ranch in Texas. The prosecutor objected to the admission of the statement on the tape on the basis that it was hearsay evidence. The jury was excused and the defense made an offer of proof. The officer stated that the recording contained two messages:\n\nDJ: Trying to find out when you're coming. What's going on?\n\nExpected you Thursday [March 25, 1993]. And then Saturday and it's Monday. Call me. Let me know, uh, what your plans are. Sure would appreciate it. [phone number].\n\nbye. Report of Proceedings at 644, 645.\n\nHearsay is a statement, other than one made by the declarant while testifying at the trial or hearing, offered in evidence to prove the truth of the matter asserted and is not admissible except as provided by the evidence rules, other rules or statute. ER 801(c), 802. There is no argument that these statements fell under any of the exceptions to the hearsay rule; the only contention is that they were not hearsay because not asserted to prove the truth of the matter therein.\n\nThe defense argued the statements were admissible to show Stenson's intent to go to Texas. The State pointed out that this was ostensibly a Mr. Terelli on the tape who was making an assertion that he thought D.J. was coming to Texas at a given time and argued that this was a statement offered for the truth of the matter asserted. Presumably, the implication is that Stenson must have told Mr. Terelli he was coming to Texas. The trial court asked if this wasn't just Michael Terelli saying on the phone message that he had been told by someone else (perhaps Stenson) that Stenson intended to come to Texas. The court concluded that the statement was hearsay and would not have any relevance if not offered for the facts contained in the statement.\n\nOn appeal, the Defendant relies on State v. Collins, 76 Wash. App. 496, 886 P.2d 243 (1995). In that case the court allowed an officer to testify that while in the defendant's apartment, phone callers asked for \"Larry\" (the defendant's name) and indicated they wished to pick up drugs. The phone calls were found not to be inadmissible hearsay evidence because they showed Larry's dominion and control over the apartment (an issue in the case) and the implied belief of the callers that they could get drugs at that apartment, which supplied the evidentiary value of the statements. Collins, 76 Wash. App. at 498-99. Collins is distinguishable from the present case.\n\nHere, the issue was whether and when Stenson intended to go to Texas. Only if the statement of Michael Terelli was true, that he expected Stenson on a given date, are the statements relevant to Stenson's intent. Further, the implication of the caller's message is that Stenson must have told Mr. Terelli that he was coming to Texas. One of the reasons for the exclusion of hearsay evidence is because there is no way to cross-examine the witness. State v. Chapin, 118 Wash. 2d 681, 685, 826 P.2d 194 (1992) (theory of the hearsay rule is that cross examination is the best way to reveal whatever untrustworthiness lies beneath the assertions of a witness). If the statements had been admitted from the out-of-court declarant, the State would have had no opportunity to test the veracity or the accuracy of the declarant's statements or the source of his belief. In this instance, the implication is that Mr. Terelli was told (presumably by Stenson) that he was coming to Texas on Thursday (March 25, the day of the murders) and then was planning to come on Saturday (two days after the murders). This raises several questions. A number of witnesses testified that Stenson had planned to begin the drive to Texas in his new truck on March 25, while Mr. Terelli seemingly expected Stenson in Texas on that day. Also, Mr. Terelli said that he \"then\" understood Stenson would arrive on Saturday; this raises the question whether Stenson had called him after the murders to arrange a new date. The trial court did not err in concluding that the statements were inadmissible hearsay because offered to prove the truth of the matter asserted.\n\nAdmissibility of Phenolphthalein\n\nThe pants the Defendant was wearing at the time of the murders were an important piece of evidence. There were stains on the right leg and smaller stains on the left leg of the pants. The stains were visually identified as blood by the forensic scientist whose specialty was crime scene reconstruction and the interpretation of blood-stain patterns. The stains all reacted positively upon application of phenolphthalein (phenol), which is a catalytic color test that is a presumptive test for blood.\n\nPhenol causes blood and some other substances to turn a bright pink within a few seconds of application. Phenol is considered a presumptive test because there are other materials, besides human blood, that can cause a positive reaction. The larger stains on Stenson's pants were found to be human blood and further typed using phosphoglucomutase (PGM), haptoglobin and Gc testing. The proteins in the stains matched the protein profile of Frank Hoerner's blood. The results of those tests showed that only 2.2 percent of the white population shared the characteristics present in both the stains and in Frank's blood. Those tests are not challenged. The defense concedes that the stains on the right leg of Stenson's pants were Frank's blood. The smaller stains were not large enough to do further blood testing beyond the presumptive phenol testing. One of the State's experts, Michael Grubb, supervisor of the Washington State Patrol Crime Laboratory, testified that the smaller stains appeared to have been \"airborne droplets\" of blood which were traveling through the air when they struck Stenson's pants leg.\n\nAlthough the Defendant argues that only the very small stains on the left leg were strong evidence of his guilt, the evidence showed that the larger stains on the right knee which were shown by PGM, haptoglobin and Gc \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e testing to be Frank Hoerner's blood were also strong evidence against the Defendant. Mr. Grubb testified that the blood on the right knee could not have gotten there by Stenson touching the body after it was on the floor, or by kneeling next to the body, and that it had to have been deposited on Stenson's pants before Frank Hoerner's body came to rest on the floor. The forensic scientist concluded that the stains on the right leg of Stenson's pants (identified as Frank's blood) came to be on the pants while Frank Hoerner was in some other position than his final resting position at the scene, probably while he was up off the floor. This refuted the Defendant's story that he discovered Frank dead on the floor of the bedroom.\n\nThe Defendant argues that the trial court erred in admitting the presumptive phenol test which indicated the smaller stains on the left pants leg could be blood. He relies on an Arkansas case which held that admitting the results of luminol \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e testing, in the absence of follow-up testing to confirm the substances causing the reaction were human blood related to the victim or the crime, was reversible error. Brenk v. State, 311 Ark. 579, 847 S.W.2d 1, 7-10, 12 (1993). In that case, the luminol was used not at a known murder scene but on the suspect's vehicles and trailer and outbuilding.\n\nThe Brenk Dissent stated that the luminol test is probative as a preliminary screen for the presence of blood, that no one contended it is conclusive for human blood or that it does not show positive for other substances, and that these points were explored on cross examination by defense counsel and argued to the jury. Thus, the Dissent concludes the defendant's argument went to weight, rather than admissibility. Brenk, 847 S.W.2d at 13 (Brown, J., Dissenting) (citing Commonwealth v. Yesilciman, 406 Mass. 736, 550 N.E.2d 378, 383-84 (1990)) (occult blood which could not be confirmed to be human blood was not irrelevant or unduly prejudicial; in order to be considered admissible, evidence need not establish directly the proposition sought it must only provide a link in the chain of proof; evidence is not rendered prejudicial merely because it is inconclusive).\n\nOther jurisdictions have held that presumptive tests for blood are generally acceptable. People v. Coleman, 46 Cal. 3d 749, 759 P.2d 1260, 1277, 251 Cal. Rptr. 83 (1988) (presumptive tests for blood are generally accepted by California courts and have been used by criminologists and admitted into evidence in that state for over 40 years); State v. Moseley, 336 N.C. 710, 445 S.E.2d 906, 912 (1994) (phenolphthalein testing of blood spatters on defendant's clothing which could not be confirmed with positive blood testing was relevant and admissible); Johnston v. State, 497 So. 2d 863 (Fla. 1986) (jury determines credence and weight of testimony; jury can properly determine the value and accuracy of the results of the admittedly \"presumptive\" luminol blood test); Graham v. State, 374 So. 2d 929 (Ala. Crim. App. 1979) (jury was entitled to evidence of presumptive test of presence of blood). We agree. The results of presumptive tests for blood have been allowed into evidence in Washington when it was explained that the test was presumptive and not conclusive for the presence of blood. E.g., Lord, 117 Wash. 2d 829, 822 P.2d 177; Gentry, 125 Wash. 2d 570, 888 P.2d 1105. In the present case the jury repeatedly heard evidence that phenol was only a presumptive test for blood and could react with certain other substances besides blood.\n\nIn the present case, Stenson does not contend that phenol testing fails the Frye test. Frye v. United States, 54 App. D.C. 46, 293 F. 1013, 34 A.L.R. 145 (D.C. Cir. 1923). Rather, he argues that the results were inadmissible under ER 702 because, without further testing, the phenol tests would not be helpful to the jury because positive test results could not be interpreted as indicating the presence of human blood. Expert testimony is admissible when the underlying scientific principle satisfies the Frye requirements and the testimony meets the two-part test of ER 702. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e ER 702 provides:\n\nIf scientific, technical, or other specialized knowledge will assist the trier of fact to understand the evidence or to determine a fact in issue, a witness qualified as an expert by knowledge, skill, experience, training or education, may testify thereto in the form of an opinion or otherwise. See also State v. Cauthron, 120 Wash. 2d 879, 890, 846 P.2d 502 (1993). The determination of whether expert testimony is admissible is within the discretion of the trial court. Unless there has been an abuse of discretion, this Court will not disturb the trial court's decision. Cauthron, 120 Wash. 2d at 890; State v. Swan, 114 Wash. 2d 613, 655, 790 P.2d 610 (1990); State v. Ortiz, 119 Wash. 2d 294, 310, 831 P.2d 1060 (1992); Gentry, 125 Wash. 2d at 593-94.\n\nIn this case, the trial court invited an offer of proof and considered argument of counsel. The supervising forensic scientist at the Washington State Patrol Laboratory, Michael Grubb, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e told the Judge during the offer of proof that phenol is a presumptive chemical test for blood and when reacted with a blood stain causes an immediate color reaction which develops a very bright pink color. It is considered a presumptive test because there are other materials that can give a positive reaction, although in general not as immediate or as strong a reaction. He explained that phenol had been used in forensic science for over 40 years and was accepted as a presumptive test in other laboratories across the country. The trial court found there was no dispute about the effects of phenol or luminol in terms of how they work and that they do work as presumptive indicators in the presence of blood. No challenge is made to this finding. The trial court concluded the test results, when presented only as presumptive for blood, were admissible.\n\nMr. Grubb testified that he was experienced in viewing blood stains, that when he saw a stain that appeared to be blood and performed a chemical test with phenolphthalein, the positive chemical reaction for blood is sufficient for him to conclude that the stain is a blood stain. During Mr. Grubb's testimony, the Judge dismissed the jury and told counsel that the basis of his ruling was that testimony of visual inspection based on Mr. Grubb's experience and the positive phenol test allowed the expert witness to conclude that, in his opinion, a stain is blood. He told counsel that any testimony that the phenol testing was \"positive\" for blood would be subject to cross examination to show that phenol was positive for blood only in a limited sense. He ruled that the testimony could be that, in the expert's opinion, the stain was blood, but not that it was absolute. The court clarified that he was allowing the testimony based on two tests: the visual observations of Mr. Grubb and the phenol test, and that he would sustain a defense objection to the extent the testimony sounded absolute.\n\nAnother State's witness, Joseph Errera of the FBI, explained to the jury that phenol testing was very sensitive for blood but not a specific test for blood. He said he could not say when the phenol test is positive that blood is, in fact, found on a particular item because the test is merely a presumptive or screening test. He said if the color changes to pink, he would go on to subsequent testing to determine if it was absolutely blood. He explained the stains on the left leg of Stenson's pants did react positively to the presumptive phenol test and that the smaller stains on his left pants leg were too small to determine if, in fact, they were blood. He explained that a host of environmental materials having nothing to do with blood can trigger a positive reaction. He explained the FBI took a very conservative view of the phenol result and would never \"confirm\" blood on that test only. Mr. Errata did test the larger stains on the right pants leg using PGM, haptoglobin and Gc testing and determined them to be consistent with Frank Hoerner's blood.\n\nMichael Grubb also told the jury that the phenol test will react positively with substances other than blood. He opined that the luminol test does require some other confirmatory test to reach the Conclusion that it is blood, but in the phenol test, if accompanied by a visual observation of blood, the appearance of blood is considered specific by many, including himself. Defense counsel asked, \"But not by everyone?\" to which Mr. Grubb replied, \"Not by everyone, no.\" Report of Proceedings at 1394.\n\nWe conclude the trial court correctly admitted the results of the phenol testing, which were supported by the forensic scientist's testimony that the stains on the pants looked like blood by visual inspection and under a microscope. Testimony which relies on the practical experience and acquired knowledge of an expert may be admitted. Ortiz, 119 Wash. 2d at 311. Mr. Grubb testified that he examined Stenson's pants under a stereo microscope and that the small stains on the left pant leg had the appearance of blood and they also gave a positive reaction with phenolphthalein, the presumptive chemical test for blood. He testified that the stains in the knee area of the left pant leg appeared to have been airborne droplets of blood. Since the jury repeatedly heard that the phenol test was only presumptive for the presence of blood and did not confirm the stains were in fact human blood, the question was one of weight and not of admissibility. Lack of certainty in scientific tests (that are generally accepted by the scientific community) goes to the weight to be given the testimony, not to its admissibility. Lord, 117 Wash. 2d at 854-55. Similarly, the credibility of experts offering conflicting testimony is for the trier of fact. State v. Benn, 120 Wash. 2d 631, 662, 845 P.2d 289 (1993). So long as a jury is clearly told that the phenol test is only a presumptive test and may indicate a substance other than human blood, it is admissible under ER 702.\n\nWe affirm the trial court's decisions on the evidentiary issues. Prosecutorial Misconduct Issues The Defendant argues he was denied a fair trial because of five instances of prosecutorial misconduct. These include: a question on direct examination relating to the Defendant's lack of emotion or grief in the presence of his injured wife; use of the phrase \"reportedly sunk\" in cross examining an insurance agent testifying that the Defendant had received money on an insurance claim for loss of a boat; and three references in closing argument relating to the State's interpretation of evidence. Standard of Review/Defendant's Burden of Proof Trial court rulings based on allegations of prosecutorial misconduct are reviewed under an abuse of discretion standard. Brett, 126 Wash. 2d at 174; Lord, 117 Wash. 2d at 887.\n\nThe defendant bears the burden of establishing that the conduct complained of was both improper and prejudicial. State v. Mak, 105 Wash. 2d 692, 726, 718 P.2d 407 (1986); State v. Luvene, 127 Wash. 2d 690, 701, 903 P.2d 960 (1995). If the defendant proves the conduct was improper, the prosecutorial misconduct still does not constitute prejudicial error unless the appellate court determines there is a substantial likelihood the misconduct affected the jury's verdict. Brett, 126 Wash. 2d at 175.\n\nA defendant's failure to object to a prosecuting attorney's improper remark constitutes a waiver of such error, unless the remark is deemed so flagrant and ill-intentioned that it evinces an enduring and resulting prejudice that could not have been neutralized by an admonition to the jury. Gentry, 125 Wash. 2d at 596.\n\nWhere the defendant does object or moves for mistrial on the basis of alleged prosecutorial misconduct, this court will give deference to the trial court's ruling on the matter. \"'The trial court is in the best position to most effectively determine if prosecutorial misconduct prejudiced a defendant's right to a fair trial.'\" Luvene, 127 Wash. 2d at 701 (quoting Lord, 117 Wash. 2d at 887). Direct Examination of Paramedic The Defendant claims that an opinion elicited from a paramedic who treated Denise Stenson shortly after she was shot in the head was improper.\n\nThe specific opinion testimony is the following:\n\nQ. At the station did you learn who the defendant was?\n\nA. Yes, I did.\n\nQ. Did you learn then that he was the husband of the lady that you had been treating?\n\nA. Yes.\n\nQ. And what was your reaction to that news?\n\nA. I was surprised. Report of Proceedings at 245-46.\n\nBefore this testimony was elicited, the trial Judge had ruled that the paramedic could testify as to his opinion with respect to Defendant Stenson's reaction to Denise Stenson's injury only after a proper foundation had been laid. The trial Judge stated:\n\nTestimony as to defendant's behavior is admissible if it is prefaced with a proper foundation, personal observations of the defendant's conduct, factually recounted by the witness that directly and logically support the Conclusion. Report of Proceedings at 241.\n\nThe foundation laid by the prosecutor included the following:\n\nQ. Mr. Otman, do you recall the manner of dress or how the defendant was dressed on the morning of March 25th when you saw him?\n\nA. He was fully dressed.\n\nQ. And how about his hair, how did it appear to you?\n\nA. It was, it was not combed. It was messy.\n\nQ. And do you recall the color of his face or his facial color?\n\nA. No.\n\nQ. And do you know was he sweating?\n\nA I can't recall.\n\nQ. How about his voice, how would you describe his voice when he spoke?\n\nA. He was calm. Exciting way.\n\nQ. Was his voice clear?\n\nA. Yes.\n\nQ. Did he ever become hysterical?\n\nA. No.\n\nQ. Did he ever sob?\n\nA. No.\n\nQ. Did he ever cry?\n\nA. No.\n\nQ. Did he ever tremble?\n\nA. No.\n\nQ. Did he ever stutter?\n\nA. No.\n\nQ. Did you have difficulty understanding his words when he spoke?\n\nA. No.\n\nQ. And the tone of his voice you said, I believe, calm and what?\n\nA. Not completely calm. A little bit more. More, he was not really excited but he was not completely calm. I don't know how to -- it was -- I don't know how to make a better description.\n\nQ. All right. Did his facial expression when you saw it ever appear excited?\n\nA. No.\n\nQ. Did you ever -- did his facial expression ever show any fear?\n\nA. No.\n\nQ. He ever demand to be with his wife?\n\nA. No, he didn't.\n\nQ. Did he ever interfere with your treatment?\n\nA. Yes.\n\nQ. Did he ever physically interfere with your treatment? That is, did he ever physically touch you?\n\nA. No.\n\nQ. He ever physically get near to you?\n\nA. Near, yes.\n\nQ. He ever struggle with . . . medical personnel there at the scene?\n\nA. He didn't with me. I'm not aware that he did with anybody else.\n\nQ. Did he ever show any grief?\n\nA. Not to me. Report of Proceedings at 243-45.\n\nIt was after this examination that the paramedic was asked what his reaction was when he learned that Darold Stenson was the victim's husband. As soon as he responded that he was surprised, defense counsel objected. The trial court sustained the objection and stated, \"Jury will disregard that last remark which is stricken.\" Report of Proceedings at 246.\n\nTo prove prosecutorial misconduct, the Defendant must first establish that the question posed by the prosecutor was improper. Brett, 126 Wash. 2d at 175.\n\nThe Defendant relies on two Court of Appeals decisions to show that eliciting opinion testimony regarding the effect of a defendant's demeanor is improper. The first is State v. Haga, 8 Wash. App. 481, 507 P.2d 159 (1973), a case in which the Court of Appeals reversed a defendant's conviction for the murder of his wife and infant daughter. In that case an ambulance driver was permitted to testify that the defendant's reaction to the crime was unusual in that \"usually the husband or the wife will attempt to assist . . . . He was very calm and cool about it. And he didn't attempt to assist us. Usually a husband or wife usually is in the way when you are trying to revive them. And he offered no assistance in helping me whatsoever.\" Haga, 8 Wash. App. at 490. Haga held this statement was wrongfully admitted as it \"inferred [the ambulance driver's] opinion that the defendant was guilty.\" Haga, 8 Wash. App. at 492.\n\nThe second case relied on by the Defendant is State v. Sargent, 40 Wash. App. 340, 698 P.2d 598 (1985). There, the defendant's conviction for murdering his wife was reversed in part because of the testimony of a police officer. The officer testified to his reaction toward the defendant's response on hearing that his wife was dead. The officer stated that he believed the defendant's response of surprise was \"contrived.\" The Court of Appeals held that people react differently to sorrow or grief, and that in this instance the witness should have been limited to a statement of facts, leaving the jury free to form its own Conclusions. Sargent, 40 Wash. App. at 351.\n\nSince Sargent and Haga were decided, the Court of Appeals has twice reviewed the law regarding admissibility of opinion testimony regarding a defendant's demeanor. In State v. Allen, 50 Wash. App. 412, 749 P.2d 702 (1988), the Court of Appeals affirmed the conviction of a defendant for the first degree murder of her husband. The Court held that testimony by a police officer regarding the defendant's reaction on hearing the news of her husband's death was properly admitted. The officer testified that although the defendant \" 'appeared to be sobbing . . . her facial expression, the lack of tears, the lack of any redness in her face did not look genuine or sincere'.\" Allen, 50 Wash. App. at 416. The Court in Allen explained Haga as a case in which the witness, an ambulance driver, purported to testify as an expert on whether the defendant's reaction was that of a truly bereaved person. \"The court properly recognized that there was no such area of expertise.\" Allen, 50 Wash. App. at 417. The Court then went on to distinguish Sargent by stating that the police officer in Sargent based his opinion \"only on his unexplained, and very possibly erroneous, assumption that the defendant already knew that his wife was dead.\" Allen, 50 Wash. App. at 418.\n\nIn State v. Craven, 69 Wash. App. 581, 849 P.2d 681 (1993), the Court of Appeals affirmed the second degree assault conviction of a woman who had been found guilty of injuring a 16-month-old child. An emergency room social worker was permitted to testify in that case that the behavior of the defendant in the emergency room \"was somewhat unusual from what I normally saw.\" Craven, 69 Wash. App. at 585. The social worker had prefaced her opinion with testimony that the defendant was having difficulty making eye contact and that she looked at the floor a good deal of the time. She also testified that the defendant was not crying and that she seemed sort of withdrawn. The Court of Appeals found that a foundation for the opinion was properly made because the opinion testimony was preceded by factual observations which logically supported the Conclusion that the defendant's behavior was unusual. Craven, 69 Wash. App. at 586. See also State v. Day, 51 Wash. App. 544, 552, 754 P.2d 1021 (1988) (opinion testimony regarding a defendant's reaction is admissible if it is prefaced with a proper foundation: personal observations of the defendant's conduct, factually recounted by the witness, that directly and logically support the Conclusion).\n\nIn the present case, the paramedic was not testifying as an expert and was not testifying based on assumptions that were unsupported by his direct observation. Haga and Sargent therefore do not apply. Instead, the paramedic testified as to personal observations of the Defendant's conduct. The observations appear to directly and logically support his surprise at learning that the Defendant was Denise Stenson's husband. Thus, the testimony elicited by the prosecutor was not improper. Cross Examination of Insurance Broker The trial court granted the Defendant's motion in limine to exclude all evidence concerning \"the sinking of the sailing vessel Dragon Weyr in July 1989 and the filing of an insurance claim seeking reimbursement for the loss of the vessel and the equipment it contained.\" Clerk's Papers at 770-71.\n\nThe Dragon Weyr was a vessel owned by Defendant Stenson in 1989. The vessel sank in deep water near the Philippines and was apparently never recovered. The vessel was insured, and more than $300,000 was paid out on the insurance claim. During the search of the Defendant's home and business, police officers believed they found items that were listed as lost when the boat sank. The prosecutor believed that the insurance proceeds were fraudulently obtained.\n\nThe reason the motion in limine was granted was to preclude any allegations or testimony indicating that the sinking of the Dragon Weyr might not have been an accident.\n\nDavid Esqueda, an insurance broker for the company that insured the Dragon Weyr, testified on behalf of the Defendant. The purpose of Mr. Esqueda's testimony was to show that Defendant Stenson received substantial funds in late 1989 and early 1990 and thus was not in need of money, as the State implied. Although the State sought to fully explore the circumstances surrounding the loss of the Dragon Weyr, the trial court refused to rule in a manner that would be contrary to the order on the motion in limine. The trial court permitted the testimony elicited by defense counsel, distinguishing it from that addressed in the motion in limine, on the ground that Mr. Esqueda's testimony was not evidence concerning the sinking of the Dragon Weyr or the filing of an insurance claim but was evidence of the proceeds of that claim.\n\nOn cross examination, the prosecutor asked, \"the vessel we are talking about was reportedly sunk July 11, 1989?\" Report of Proceedings at 1579. The prosecutor's additional questions contained the phrases, \"when this craft was lost,\" \"and the boat was sunk in '89,\" the \"vessel was reportedly sunk somewhere in the Philippines,\" and \"reportedly sunk in deep water.\" Report of Proceedings at 1580, 1584.\n\nThe Defendant objected to questions posed by the prosecutor, but the objections were based on the prosecutor allegedly exceeding the scope of direct examination or on getting close to violating the order on the motion in limine. The prosecutor then made an offer of proof with respect to insurance fraud. This offer of proof was made outside the presence of the jury. The trial court said to the prosecutor:\n\nObjection is going to be sustained. It's not relevant. . . .\n\nYou have taken two steps towards violating the motion in limine. One more step, I'll consider a mistrial.\n\n[Prosecutor]: Your Honor, this is why I made this offer outside the presence of the jury.\n\nTHE COURT: I understand that. But I want to steer away from this area. We have a clean record to this point. This is going to screw it up. I'm not going to allow it. Report of Proceedings at 1589. The jury then returned and the prosecutor did not pursue the questioning.\n\nOn appeal the Defendant argues that the prosecutor's use of the word \"reportedly\" and the use of the passive voice (i.e., \"the vessel was reportedly sunk\") implied that Defendant Stenson had committed insurance fraud, was improper in light of the order on the motion in limine, and was highly prejudicial.\n\nThe trial court did not believe the prosecutor violated the order on the motion in limine, and we agree. From our review of the record, the prosecutor did not go beyond the scope of direct examination in discussing the proceeds of insurance that were issued as a result of the sinking of the Dragon Weyr.\n\nThe use of the word \"reportedly\" and the use of the passive voice were not improper. In fact, the prosecutor used the word \"reportedly\" in reference to the witness's writing of checks: \"reportedly these checks were not written until -- some of them until June of 1990?\" Report of Proceedings at 1580. Additionally, the Defendant did not object to the phrasing of the questions but instead objected to where the questions might lead. The Defendant is therefore deemed to have waived any error and appellate review is precluded, unless the remark is deemed so flagrant and ill-intentioned that it evinces an enduring and resulting prejudice that could not have been neutralized by an admonition to the jury. Gentry, 125 Wash. 2d at 596; State v. Fiallo-Lopez, 78 Wash. App. 717, 726, 899 P.2d 1294 (1995).\n\nThe use of the word \"reportedly\" in reference to a loss for insurance purposes was not flagrant or ill-intentioned or otherwise improper or prejudicial. Closing Argument The prosecutor has wide latitude in closing argument to draw reasonable inferences from the evidence and to express such inferences to the jury. State v. Hoffman, 116 Wash. 2d 51, 94-95, 804 P.2d 577 (1991); Fiallo-Lopez, 78 Wash. App. at 728.\n\nThe Defendant argues that the prosecutor made an improper closing argument when he (1) referred to the paramedic's testimony, (2) stated there was no evidence that Frank Hoerner brought $10,000 to Dakota Farms on the morning of the murders, and (3) stated that there was no evidence the Defendant ever received the money sent to him by the Roanoke Insurance Company.\n\nParamedic Testimony. In closing argument the prosecutor said:\n\nConsider the evidence of [the paramedic], the combat veteran who is an EMT, who was at the scene. And who talked about this defendant's demeanor. . . . Did this defendant's demeanor ever have the ring of grief to it? By sound or by the way he looked?\n\nWas there ever anything during that period of time, March 25th .\n\n. . that had the ring of truth?\n\nNow, ladies and gentlemen, people all react or people react to crisis, crises, disasters, grief in various ways.\n\nAnd I'm sure that [the paramedic] knew that being an experienced EMT. But he was struck by the defendant's lack of grief. Report of Proceedings at 1785-86.\n\nThe Defendant claims the above statement compounded the error at trial in which the paramedic was permitted to testify that he was surprised the Defendant was the victim's husband. However, the Defendant did not object to the paramedic's statement that the Defendant did not show grief in the paramedic's presence. All of the facts referred to in the prosecutor's closing argument with respect to the paramedic's testimony were properly in evidence. The prosecutor was within proper bounds in drawing inferences from those facts.\n\nThe $10,000. The Defendant next argues that the prosecutor misstated the evidence when he told the jury during closing argument that there was no evidence indicating Frank Hoerner had brought $10,000 to Dakota Farms on the morning of March 25, 1993.\n\nThe prosecutor stated:\n\nNow, Denise Hoerner didn't testify that Frank Hoerner took $10,000 over to [Dakota Farms] on the morning of March 25th. She didn't testify to that. She allowed as how maybe some money, there was going to be some talk about money, but she did not testify about her husband taking any money over to the defendant's residence on the morning of March 25th. Report of Proceedings at 1782.\n\nDenise Hoerner, Frank Hoerner's wife, testified that she had told Deputy Dunn on the morning of the murders that her husband had taken $10,000 over to the Stensons' the morning Frank was killed. However, at trial, she clarified that she did not see Frank take any money that morning but had been told by Frank that it would cost $10,000 for insurance for the birds. She explained she had told Deputy Dunn that Frank had taken the money because D.J. Stenson had told Frank to bring insurance money. She testified that Frank was going to talk to Stenson about the money. Defendant Stenson told officers that Frank had not brought any money with him the morning of the murders because Frank had given the money for the bird insurance to Stenson two weeks earlier.\n\nHere, the prosecutor drew reasonable inferences from the evidence before the jury when he stated that there was no evidence of $10,000 in cash being brought to Dakota Farms the morning of the murders. This is especially true in light of the Defendant's statement that Frank did not bring any money to Dakota Farms that morning but had paid him for the insurance premium weeks before.\n\nThe prosecutor's argument was within proper bounds in drawing inferences from the facts.\n\nThe Insurance Proceeds. The prosecutor argued that Defendant Stenson was in desperate financial straits at the time of the murders. He also rebutted the defense argument that the Defendant had received insurance proceeds, and thus had no significant financial problems, by arguing there was no evidence in the record that Defendant Stenson had received any of the insurance proceeds.\n\nThe Defendant argues that this statement of the prosecutor was improper and prejudicial.\n\nThere was evidence in the record that the checks were issued to the Defendant, the Dragon Weyr Trust and to William B. Perry. There also was evidence that the checks were cashed.\n\nThe prosecutor did not misstate the evidence when he argued the insurance company \"cut some checks for the defendant. That's all we know.\" Report of Proceedings at 1794. There was no proof the Defendant ever received any of the proceeds.\n\nThe argument appears to have been based on reasonable inferences drawn from the evidence presented at trial.\n\nAdditionally, the Defendant objected to the prosecutor's remarks and the trial Judge cautioned the jury that \"argument of counsel is just that.\" Report of Proceedings at 1796. The trial court told the jury that \"to the extent that your recollections differ as to the evidence, you are to disregard the statements of counsel and rely on your recollections of the evidence.\" Report of Proceedings at 1796. Even if the argument of the prosecutor was improper, the jury is presumed to have disregarded it, according to the trial Judge's instruction. Swan, 114 Wash. 2d at 661-62.\n\nWe conclude the Defendant did not show any improper conduct on the part of the prosecutor. Representation of Counsel Issue Defendant's Motion for a Continuance, for Substitution of Counsel or to Proceed Pro Se, and Motion to Withdraw On October 21, 1993, Fred Leatherman was appointed as one of Stenson's two court-appointed counsel. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Stenson's other counsel, Dave Neupert of the Clallam-Jefferson Public Defender's office, had been appointed earlier. A number of investigators worked on the defense team with Mr. Leatherman and Mr. Neupert. The record shows that at the time of trial Mr. Leatherman had been a criminal law attorney in Washington for almost 20 years and that he had extensive experience in death penalty litigation. The record reflects that it was Stenson's desire to have Mr. Leatherman appointed as lead counsel.\n\nIn March 1994, the court held lengthy and highly contested CrR 3.5 and 3.6 hearings regarding Stenson's statements to deputies and the admissibility of evidence found pursuant to the search warrants. In May 1994, Mr. Leatherman and Mr. Neupert participated in a complex Frye hearing successfully challenging the admissibility of RFLP DNA evidence. Numerous other pretrial motions were made by defense counsel. The voir dire process began on June 9, 1994.\n\nAfter 21 days of jury selection, on July 12, 1994, Stenson filed a motion entitled \"Defendant's Motion to Continue Trial, Appoint New Counsel, or, in the Alternative Allow Him to Proceed Pro Se.\" In that motion, Stenson sought to dismiss both Mr. Leatherman and Mr. Neupert and to appoint new counsel from Seattle, or to allow him to proceed pro se. Stenson told the Judge he had contacted a number of other lawyers and that two from Seattle were willing to take his case.\n\nOn July 13, 1994, the trial court held an in camera proceeding to hear Stenson's motion to substitute counsel or to proceed pro se. Mr. Leatherman explained to the Judge that the Defendant and the defense counsel had a conflict regarding the tactics to be employed during the guilt phase of trial. He explained that in light of the evidence of Frank Hoerner's blood on Stenson's pants, and particularly the fact that both the State's expert and the defense's forensic blood expert \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e agreed the blood could not have gotten on Stenson's pants after Frank Hoerner was lying dead on the floor, there was practically no possibility of the jury returning a \"not guilty\" verdict. Mr. Leatherman explained that the defense could not effectively refute the evidence that the blood spatters on the Defendant's pants were entirely inconsistent with Stenson's many statements to officers. The evidence showed the spatters of Frank Hoerner's blood on Stenson's pants could not have occurred by Stenson kneeling next to the body as he claimed. Mr. Leatherman said that when the defense's blood specialist told defense counsel his opinion, the defense team went to meet with Stenson to inform him of the findings. Stenson then made his motion for continuance, new counsel or to proceed pro se.\n\nMr. Leatherman told the trial court there had been a thorough investigation of guilt issues. He explained that Stenson wanted defense counsel to do something which counsel could not do. He explained that Stenson wanted counsel to put Denise Hoerner on trial, and that there was no legitimate basis to believe she had been involved in the crime. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Mr. Leatherman stated that if he employed Stenson's strategy and attempted to blame Frank Hoerner's wife, the jury would despise the Defendant and would bring in a death sentence in the penalty phase. Mr. Leatherman stated:\n\nI never stated to Mr. Stenson . . . it is my opinion to just lie down and quit and not do anything, not cross examine witnesses, just let the State's evidence roll over and bury him in the guilt phase. I'm not saying that.\n\nWe do plan to cross examine witnesses as effectively as we possibly can and pointing out whatever inconsistencies might exist in their testimony and if expert witnesses express opinions that we think go beyond what the evidence supports, we will bring that out.\n\nSo we are going to mount a defense. We are not talking about quitting here.\n\nBut what we are talking about is whether we are going to be a party to a strategy that puts another person on trial and tries to lay this crime at their feet because we don't think that is a proper strategy because of potential legal problems with that approach. And if the court is interested, you might want to take a look at the case of State vs. Downs. . . . It has to do with other suspect evidence . .\n\n. . Report of Proceedings at 3137-38.\n\nThe trial Judge said he was familiar with that law and recognized that is a defense that is rarely admissible.\n\nThe trial court concluded that the essential conflict between Stenson and his counsel was whether Mrs. Hoerner would be cross-examined in a fashion that would tend to make her look like a suspect. The trial court found there was not good cause for a continuance or for the appointment of new counsel.\n\nThe trial court found, with regard to the pro se request, that there had not been an unequivocal request to proceed pro se and that a new attorney was requested. The court also found that the motion to proceed pro se was not timely.\n\nThe jury was sworn on July 14, 1994. On July 18, 1994, Stenson told the trial court that, pursuant to the court's request following the July 14 hearing, he had prepared a petition in writing regarding his wishes. In that petition, Stenson stated that he had discussed his case with eight other attorneys, two of whom were willing to take the case with a continuance of two weeks or several months. In that petition, Stenson requested that the trial court release Mr. Leatherman as the lead counsel, appoint a new attorney (Mr. Marshall) to replace him, grant a two-week continuance, retain Mr. Neupert as the second counsel and, if the court thought it appropriate, retain Mr. Leatherman only for the penalty portion of the trial. In that petition, Stenson did not request that he be allowed to proceed pro se but rather requested that the Judge appoint \"effective council\" [sic]. Report of Proceedings (sealed) at 513. The trial court denied the motion without prejudice to allow the Defendant to renew the motion later in the trial.\n\nSubstitution of Counsel. A defendant does not have an absolute, Sixth Amendment right to choose any particular advocate. State v. DeWeese, 117 Wash. 2d 369, 375-76, 816 P.2d 1 (1991) (citing Wheat v. United States, 486 U.S. 153, 159 n.3, 108 S. Ct. 1692, 100 L. Ed. 2d 140 (1988)). Whether an indigent defendant's dissatisfaction with his court-appointed counsel is meritorious and justifies the appointment of new counsel is a matter within the discretion of the trial court. DeWeese, 117 Wash. 2d at 376; Wheat, 486 U.S. at 164; State v. Sinclair, 46 Wash. App. 433, 730 P.2d 742 (1986).\n\nA criminal defendant who is dissatisfied with appointed counsel must show good cause to warrant substitution of counsel, such as a conflict of interest, an irreconcilable conflict, or a complete breakdown in communication between the attorney and the defendant. Smith v. Lockhart, 923 F.2d 1314, 1320 (8th Cir. 1991). Attorney-client conflicts justify the grant of a substitution motion only when counsel and defendant are so at odds as to prevent presentation of an adequate defense. E.g., State v. Lopez, 79 Wash. App. 755, 766, 904 P.2d 1179 (1995) (citing United States v. Morrison, 946 F.2d 484, 498 (7th Cir. 1991)); United States v. Hillsberg, 812 F.2d 328, 333 (7th Cir. 1987). The general loss of confidence or trust alone is not sufficient to substitute new counsel. Johnston, 497 So. 2d 863.\n\nFactors to be considered in a decision to grant or deny a motion to substitute counsel are (1) the reasons given for the dissatisfaction, (2) the court's own evaluation of counsel, and (3) the effect of any substitution upon the scheduled proceedings. State v. Stark, 48 Wash. App. 245, 253, 738 P.2d 684 (1987).\n\nThe reason for Stenson's dissatisfaction was that the defense attorneys were unwilling to accuse Denise Hoerner of the murders. In light of existing Washington case law on this subject, we conclude this is not a meritorious reason for dismissing defense counsel. Evidence connecting another person with the crime charged is not admissible unless there is a train of facts or circumstances which tend clearly to point to someone other than the defendant as the guilty party. In re Lord, 123 Wash. 2d 296, 316, 868 P.2d 835 (1994); Mak, 105 Wash. 2d at 716-17; State v. Maupin, 128 Wash. 2d 918, 927-28, 913 P.2d 808 (1996) (motive alone or coupled with threats of such other person is inadmissible, unless coupled with other evidence tending to connect such other person with the actual commission of the crime). Nothing in the record before this Court, except for the unsubstantiated suspicions voiced by the Defendant, tends to point to anyone else as the murderer. The representations of defense counsel were that there had been a thorough investigation of the crimes and that there was no evidence of Denise Hoerner's involvement.\n\nThe record does not support the Defendant's allegation that the defense failed to vigorously represent him on the issue of guilt. Stenson complained that the defense team had not spent time on the guilt phase and had concentrated their efforts on motions, jury selection and the penalty phase. Stenson appears not to realize that the \"motions\" were to: exclude the DNA evidence \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e which indicated the victim's blood was on his clothes; to suppress the inculpatory statements he had made and the evidence which proved his motives for committing the murders; and to suppress other prejudicial evidence. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e These were all issues related to whether Stenson was guilty. The trial court found (after the State's case) that the defense's cross examinations of the State's witnesses had been excellent, and Stenson agreed. In both opening statement and in closing argument, the defense vigorously argued points which could support a finding of not guilty.\n\nAt the time of the Defendant's request for substitution of counsel, the trial court found that the defense counsel's representation had been \"excellent.\" Report of Proceedings at 3308. The court stated:\n\nCompetent counsel have been appointed to represent Mr. Stenson.\n\nThere's nothing in the case to date that would give rise to even the slightest suggestion that counsel has not been diligent, prepared or in any way acting other than in Mr. Stenson's best interest.\n\nTo the contrary, some six days of very complicated Frye hearings, 21 days of jury selection, other days spent on briefing and argument on numerous substantive issues including motions to dismiss the special sentencing proceeding and other motions provide ample evidence that those attorneys appointed to represent Mr. Stenson are acting with diligence and professionally and vigorously on the defendant's behalf. Report of Proceedings at 3306-07.\n\nThe trial court made detailed findings about the effect of substitution of counsel on the proceedings. The court found that new counsel could not fairly be expected to commence trial without at least 30 days for reviewing the complex materials and that long to prepare for a trial given the complex expert testimony anticipated. The court concluded that substitution of counsel would necessitate impaneling a new jury and that 21 days had already been spent selecting the present jury. He also stated that it was certainly conceivable new counsel would give the Defendant the same advice that present counsel were giving. He concluded there was no good cause for appointment of new counsel. He noted that more than 60 witnesses had been scheduled with great difficulty, and that great difficulty would occur if the trial were continued. We find no abuse of the trial court's discretion in refusing to appoint new counsel after a year of preparation and 21 days of jury selection, given the lack of any conflict of interest or other showing of the necessity for new counsel. See, e.g., United States v. Pomeroy, 485 F.2d 272 (9th Cir. 1973) (a trial Judge's refusal to appoint new counsel on the morning of the trial is not an abuse of discretion).\n\nIn light of the reasons given by the Defendant for his dissatisfaction with counsel, the court's own evaluation of counsel, and the effect of any substitution upon the scheduled proceedings, we conclude it was not an abuse of discretion for the trial court to deny Stenson's request for a continuance and for new counsel.\n\nPro Se. Criminal defendants have a constitutional right to waive assistance of counsel and represent themselves. Faretta v. California, 422 U.S. 806, 95 S. Ct. 2525, 45 L. Ed. 2d 562 (1975). The unjustified denial of this right requires reversal. State v. Breedlove, 79 Wash. App. 101, 111, 900 P.2d 586 (1995). However, a defendant's request to proceed pro se must be both timely made and stated unequivocally. E.g., DeWeese, 117 Wash. 2d at 376-77.\n\nThe Faretta right to self-representation is not absolute and the defendant's motion to proceed pro se must be made in a timely fashion or the right is relinquished and the matter of the defendant's representation is left to the discretion of the trial Judge. DeWeese, 117 Wash. 2d at 377; State v. Bebb, 108 Wash. 2d 515, 524, 740 P.2d 829 (1987). The Defendant relies on federal circuit cases which hold that a motion to proceed pro se is timely as a matter of law if it is made before the jury is sworn, unless it is shown to be a tactic to secure delay. E.g., Fritz v. Spalding, 682 F.2d 782, 784 (9th Cir. 1982); United States v. Price, 474 F.2d 1223, 1227 (9th Cir. 1973); United States v. Arlt, 41 F.3d 516, 519 (9th Cir. 1994).\n\nWe recognize that a number of state courts specifically decline to follow this federal rule. One case has succinctly summarized the state of the law on the definition of timeliness in a request to proceed pro se.\n\nA person accused of a crime enjoys the constitutional right to self-representation. . . .\n\nThe right, however, is not unqualified; it may not be used to impede the efficient administration of Justice. While the authorities agree that the right must be unequivocally and timely asserted, there is disagreement about what constitutes timeliness and about the consequences of an untimely request.\n\nSome federal courts, for example, hold that assertion of the right to self-representation even as late as the morning of trial, if it precedes selection of the jury, is timely as a matter of law, and is addressed to the sound discretion of the trial court. Other courts hold, as did the trial court here, that requests made prior to, but on the day of, trial are per se untimely.\n\nWe reject a categorical rule of either stripe. We decline to hold that a motion to proceed pro se made on the day of trial is timely as a matter of law so long as it precedes the selection of the jury. We also reject the rule that a motion delayed until the day of trial is per se untimely.\n\nIn exercising its discretion to grant or deny a defendant's request to proceed pro se, a trial court must first determine whether the request is timely. Unless a request is made in ample time before the date set for trial, it is incumbent upon the trial court to determine whether the request is made for purposes of delay or to gain tactical advantage, and whether the lateness of the request may hinder the administration of Justice. People v. Mogul, 812 P.2d 705, 708-09 (Colo. App. 1991) (citations omitted).\n\nThe California Supreme Court has repeatedly held that in order to invoke an unconditional right of self-representation, the defendant must assert the right within a reasonable time prior to the commencement of trial. People v. Burton, 48 Cal. 3d 843, 771 P.2d 1270, 1275, 258 Cal. Rptr. 184 (1989); People v. Horton, 11 Cal. 4th 1068, 906 P.2d 478, 47 Cal. Rptr. 2d 516 (1995), modified, reh'g denied, 12 Cal. 4th 783A, (1996), cert. denied, 136 L. Ed. 2d 25, 117 S. Ct. 63 (1996). A motion made after this period is addressed to the sound discretion of the trial court. While we read this record to support the trial court's Conclusion on timeliness, \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e we decline to decide this issue, given the split of authority, because it is unnecessary to the resolution of the issue. We need not resolve it in this case since Defendant Stenson's request was not unequivocal.\n\nAfter the trial court denied the Defendant's motion for new counsel, the following conversation ensued:\n\nTHE DEFENDANT: . . . I would formally make a motion then that I\n\nbe able to allow [sic] to represent myself. I do not want to do this but the court and the counsel that I currently have force me to do this.\n\nAs I said, I have been under the illusion that I was going to be defended. Not merely as Mr. Leatherman stated the other day, he would cross examine witnesses. That is not a defense.\n\nTHE COURT: Mr. Stenson, I do not consider the issue of the trial strategy or trial tactics which are going to be undertaken here as anything which is resolved.\n\nTHE DEFENDANT: Excuse me?\n\nTHE COURT: I don't consider that resolved. That's a decision between you and your counsel and that will have to be resolved as we get into the trial. And I can't resolve that for you.\n\nAs to a motion to represent yourself at this point in the trial, as I have indicated, certainly you have a constitutional right to do that if a motion is timely made.\n\nAt this point in time I find that that motion is not timely made and I also find based upon your indications that you really do not want to proceed pro se without counsel.\n\nTHE DEFENDANT: But likewise I do not proceed [sic] with counsel that I have.\n\nTHE COURT: I understand that. Based upon those considerations, I'm going to deny the motion to allow you to proceed pro se. Report of Proceedings at 3312-13 (emphasis added).\n\nThe written petition to the trial court drafted by the Defendant and filed with the court several days later requests the court to appoint new lead counsel, retain the existing second counsel, appoint Mr. Leatherman as counsel for the penalty phase, and grant a continuance.\n\nA request to proceed pro se must be both timely and unequivocal. Even if we decided, which we do not, that the request to proceed pro se so late in the proceedings was timely, we concur with the trial court's Conclusion that the request was equivocal.\n\nTo protect defendants from making capricious waivers of counsel and to protect trial courts from manipulative vacillations by defendants regarding representation, the defendant's request to proceed pro se must be unequivocal. While a request to proceed pro se as an alternative to substitution of new counsel does not necessarily make the request equivocal, Johnstone v. Kelly, 808 F.2d 214, 216, n.2 (2d Cir. 1986), such a request may be an indication to the trial court, in light of the whole record, that the request in not unequivocal. Hamilton v. Groose, 28 F.3d 859, 862 (8th Cir. 1994); see also Adams v. Carroll, 875 F.2d 1441, 1445 (9th Cir. 1989); People v. Williams, 220 Cal. App. 3d 1165, 269 Cal. Rptr. 705, 707-08 (1990).\n\nThe Eighth Circuit considered a similar factual situation in the Hamilton case where the defendant wanted new counsel but would proceed pro se if denied a change of counsel. The court concluded that the trial court must indulge in every reasonable presumption against a defendant's waiver of his right to an attorney and require the defendant to make a knowing, intelligent, voluntary and unequivocal request before concluding that he has waived his right to counsel and invoked his right to represent himself. The court explained:\n\nThe equivocal way in which [the defendant] made his motion to represent himself . . . would provide the basis for a colorable Sixth Amendment claim regardless of how the trial Judge had ruled. Had [the defendant] been found guilty after the trial Judge allowed him to proceed pro se, [he] undoubtedly would have sought to overturn his conviction by arguing that he was denied his Sixth Amendment right to counsel because his waiver of the right was equivocal and \"not very serious.\" . . . The probability that a defendant will appeal either decision of the trial Judge underscores the importance of requiring a defendant who wishes to waive his right to counsel to do so explicitly and unequivocally. Here, [the defendant's] asserted waiver of his right to counsel was far from explicit and unequivocal, and his Sixth Amendment right to represent himself was not denied. Hamilton, 28 F.3d at 862-63.\n\nThe request to represent oneself may be stated in the alternative of a request for new counsel. However, in such a situation where the request is conditional, the request must be unequivocal. In this case, the requests were both conditional and equivocal. The request to be pro se must be unequivocal in the context of the record as a whole. Luvene, 127 Wash. 2d at 698-99. Here, almost all of the conversation between the trial Judge and the Defendant concerned his wish for different counsel. He repeatedly discussed which new counsel should be assigned. He explained he had contacted a number of attorneys and had asked for permission to talk with his newly-selected counsel. He told the trial court he did not want to represent himself but that the court and his counsel had forced him to do that. More importantly, the Defendant did not refute the trial court's final Conclusion that he \"really [did] not want to proceed without counsel.\" Report of Proceedings at 3313. After the trial Judge denied the request for substitution of new counsel and the request to proceed pro se, the Defendant, pursuant to a request from the trial court to put his request in writing, filed a written request which sought appointment of new lead counsel, retention of the existing second counsel, appointment of Mr. Leatherman as counsel for the penalty phase, and a continuance. In that request, the Defendant did not mention proceeding pro se. While the Defendant's request was conditional, it was also equivocal based on the record as a whole. The trial court's refusal to allow the Defendant to proceed pro se was not an abuse of its discretion.\n\nMr. Leatherman's Motion to Withdraw. On August 3, 1994, 33 days after jury selection began and the day before the prosecution had stated its intention to rest its case, Mr. Leatherman, the Defendant's lead counsel, made a motion to withdraw as defense counsel. In an in camera proceeding, Mr. Leatherman explained that he was upset with Stenson because Stenson had contacted the media and an article under the headline, \"Family worried about defense's efforts during trial,\" had appeared in the local newspaper. The article said that Stenson was telling the press in telephone interviews that he and his family were not satisfied with his defense attorneys. Mr. Leatherman told the Judge:\n\nWe have advised him not to speak with the press during the pendency of this matter. And I'm very concerned about the nature of the attorney-client relationship.\n\nRight now I don't feel like I have an attorney-client relationship with Mr. Stenson. I'm extremely frustrated with him to the point of really not wanting to go on with this case. Put a lot of work and effort into this case on his behalf. And to read something like this at this point just, it's disgusting. Quite frankly, I can't stand the sight of him.\n\nIf the court orders me to continue, your Honor, I will. I have been a trial lawyer now . . . close to 20 years, but I -- the nature of my relationship with Mr. Stenson has been getting worse and worse and worse. To the point now where I don't think we are even communicating. I'm certainly not communicating with him and he's not communicating with me and we are heading in different directions on this case. Report of Proceedings at 1501-02.\n\nThe court noted that they were in the 33rd day of a scheduled 32-day trial, that Stenson had received very competent and professional counsel, and that there was high stress in a death penalty case. The court concluded that Mr. Leatherman could not withdraw as there was no basis of a conflict or any perceived lack of competence. Although Stenson complained about his communication with his lawyers, he agreed that their technique, expertise, and knowledge were exceptional.\n\nIn evaluating Sixth Amendment claims, the focus is on the adversarial process and not on the accused's relationship with his lawyer. Wheat, 486 U.S. at 159. Good cause for substitution of counsel is discussed above. The trial court did not abuse its discretion in refusing to substitute counsel so late in trial. Penalty Phase This court reviews claimed errors associated with the sentencing phase of a capital case under heightened scrutiny. This means a close, more careful review of the record; it does not entail a raised standard of review. E.g., Brett, 126 Wash. 2d at 182. Admissibility of Defendant's Criminal History In the penalty phase of the trial, the State introduced certified copies of Stenson's prior convictions including: a 1971 King County Superior Court felony conviction for possession of LSD, a 1974 federal felony conviction for distribution of cocaine, and two 1985 federal misdemeanors for failure to file an income tax return and possession of cocaine.\n\nThe Defendant argues none of his criminal record should have been admitted in the penalty phase of his trial. He argues his felony convictions should not have been admitted in the sentencing phase of the trial because they would have been considered \"washed out\" convictions under the Sentencing Reform Act of 1981 (SRA), RCW 9.94A.360(2), and therefore would not have been used to compute the standard range sentence if the crime had been other than a capital offense. He argues it violates equal protection to allow the convictions in a capital case to be considered when they would not be relevant to determine the offender score in a non-capital case. He also argues that, under the ER 403 balancing test, their probative value was outweighed by their prejudicial impact.\n\nThe Defendant also argues that his misdemeanor convictions should not have been admitted because they were irrelevant or their probative value was outweighed by their prejudicial impact. He asks this Court to hold that no misdemeanor conviction should ever be admitted at the penalty phase of a capital case or that the trial court should conduct a balancing under ER 403 before they are admitted.\n\nUnder the existing statutes and case law, the Defendant's prior criminal convictions were admissible in the penalty phase of the trial. RCW 10.95.070(1) provides:\n\nIn deciding the question posed by RCW 10.95.060(4), the jury . . . may consider any relevant factors, including but not limited to the following:\n\n(1) Whether the defendant has or does not have a significant history, either as a juvenile or an adult, of prior criminal activity . . . . We have held that proof of \"criminal activity\" is limited in a capital case to the defendant's record of convictions. State v. Bartholomew, 98 Wash. 2d 173, 196, 654 P.2d 1170 (1982) (Bartholomew I), State's cert. granted and remanded, 463 U.S. 1203, defendant's cert. denied, 463 U.S. 1212 (1983), adhered to on remand, 101 Wash. 2d 631, 641-42, 683 P.2d 1079 (1984) (Bartholomew II).\n\nIn Pirtle, 127 Wash. 2d at 667, we held that juvenile convictions for both misdemeanors and felonies may be admitted as aggravating evidence in the sentencing phase of a capital case. Since older juvenile misdemeanors are admissible, then adult misdemeanors, such as those of the Defendant here, are also admissible.\n\nIn Brett, we rejected the argument that prior convictions must be subject to a balancing test under ER 403 and ER 404 to be admissible at the penalty phase of a capital trial and held that admission of prior convictions does not necessitate a balancing test because such evidence is reasonably objective and reliable. Brett, 126 Wash. 2d at 183-84. Stenson argues that while reliable, misdemeanors and old convictions are irrelevant. In Brett, we held that even the use of pre-age-15 convictions is consistent with the purpose to guide and channel the jury's discretion because, along with evidence of mitigating circumstances, it provides the jury a broader understanding of the defendant's background and character. Brett, 126 Wash. 2d at 184.\n\nLike the Defendant here, the defendant in Brett argued that convictions not used under the SRA to compute the offender score in a noncapital case (RCW 9.94A.360) cannot be used in the penalty phase of a capital case. In Brett, the defendant argued that pre-age-15 juvenile adjudications are inadmissible in the penalty phase of a capital case because the SRA excludes those convictions from being considered by a sentencing Judge in a noncapital felony case. See RCW 9.94A360(4). We rejected that argument and held that the SRA does not govern the sentencing of capital defendants.\n\nThe SRA and RCW 10.95 serve two separate functions and are consistent. The SRA is a determinate sentencing system for felony offenders. . . . The statute, however, does not purport to govern or guide penalty phase juries in their sentencing decisions. This function is served by RCW 10.95, which guides and channels the jury's discretion in reaching an individualized sentencing decision for each defendant convicted of a capital offense. Brett, 126 Wash. 2d at 184 (citation omitted).\n\nBrett also made the same argument that Stenson makes, that singling out aggravated murder defendants as the sole group to be excluded from RCW 9.94A.360 violates equal protection. We have rejected that argument. Brett, 126 Wash. 2d at 185. See also Lord, 117 Wash. 2d at 896-97 (holding that the admission of his juvenile conviction did not violate equal protection).\n\nThe trial court properly admitted certified copies of the Defendant's prior convictions. Victim Impact and Execution Impact Evidence In the penalty phase of the trial, Frank Hoerner's mother was prepared to read a statement to the jury about the impact that Frank's death had on his family. Denise Stenson's father and sister \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e were prepared to testify about the impact that Stenson's execution would have on the three Stenson children. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The trial court did not allow either the victim impact statement or the execution impact statement.\n\nThe trial court stated that while there was no constitutional bar to such evidence, he questioned whether under Washington statutes it was relevant to the question the jury was to answer. The court held that the fact that Stenson had children who would be left without a parent if he were executed was certainly a factor about him which was relevant, and the fact that he had a caring family was also relevant and admissible. However, the trial court explained that the direct question of the impact on individual family members could not be asked but that the relationships with his family and his children would be admitted, and the defense could argue about the role Stenson could serve in those relationships. While all of the evidence of the relationships and the potential continuing relationships were admissible, the direct question whether an individual family member would be devastated by Stenson's execution was ruled to be too much of an appeal to emotion. The trial court stated:\n\nIt appears to me that the impact upon the family members of the defendant of a sentence of death is self-evident.\n\nTo the extent that there is testimony as to the specific impact upon any individual, that testimony would appear to go not to mitigation factor that has to do with the defendant but mitigation factor that has to do with another individual, which is why I have ruled that the direct question as to what the impact is on you would not be admissible.\n\nIn relation to the three children, there are some significant subtleties and differences. I believe that testimony that there are three children, testimony whose care they are in, testimony as to whether or not their relationship with their father could be maintained and testimony as to whether or not that relationship would be beneficial in some form would not be precluded, in my opinion, under the terms of my current order. Report of Proceedings (penalty phase) at 308-09.\n\nThe trial court granted the State's motion prohibiting any witnesses from testifying as to their opinion of what sentence the jury should impose. This ruling is not challenged and is correct. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The defense offered evidence from the Defendant's friends and family members that they loved him, had a close relationship with him, and would continue to have a relationship with him if he were in prison. The children's grandfather (Denise Stenson's father) testified that he and his wife were raising the children, that the children had been taken regularly to visit their father in jail, and that Stenson's children would be allowed to continue to have a relationship with him if he were in prison. A \"mitigation specialist,\" who had prepared a binder of materials about Stenson, was allowed to introduce the book, which included many family photos of him as a child and as an adult with his children.\n\nAt the time of Stenson's trial, this Court had not yet ruled on the admissibility of victim impact evidence in a death penalty case. Subsequently, in Gentry, 125 Wash. 2d at 617-633, we held there is no per se constitutional bar to the admission of victim impact evidence in a capital case; the trial court has discretion to admit victim impact evidence under Const. art. I, sec. 35 (amend. 84). Victim impact evidence refers to evidence given by the victim of the crime (or a representative) which describes the victim or the effect of the crime on the victim and his or her family. Gentry, 125 Wash. 2d at 617.\n\nThe Defendant in this case now argues: that the exclusion of the \"execution impact\" evidence violated his right to present mitigation evidence; that it violated equal protection to afford a murder victim's family member the right to present victim impact evidence if the defendant did not have a right to present execution impact evidence; that the rights of the Stenson children to make a victim impact statement under RCW 7.69.030 had been violated; and that the exclusion of the statement by Denise Stenson's father violated Denise Stenson's right under Const. art. I, sec. 35 (amend. 84) to make a statement at sentencing.\n\nIn a recent capital punishment case from this Court, we addressed the issue of whether the exclusion of victim impact evidence in a trial conducted prior to our decision in Gentry was reversible error. State v. Brown, No. 61320-6 (filed July 24, 1997). In Brown, the trial court had refused to admit the testimony of the victim's father as victim impact evidence. We explained:\n\nIf Gentry had been decided before the trial in this case, the trial court could have, in its discretion, admitted the testimony of [the victim's father] as victim impact evidence at the penalty phase.\n\nBut it would not have been error not to admit it. At any rate, the trial court did not commit error in denying victim impact evidence in this case. Brown, slip op. at 119.\n\nThis holding answers Defendant Stenson's contentions that his sentence should be reversed because the trial court refused to allow Frank Hoerner's mother's statement or any other victim impact statements on Denise Stenson's behalf or on behalf of her children. This decision comports with the state constitution and our state statute, since the right to make a victim impact statement at sentencing belongs not to the defendant but to the victim. Const. art. I, sec. 35 (amend. 84); \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e RCW 7.69.030.\n\nSince the trial court did not allow any victim impact evidence, Stenson's contention that it violates equal protection to disallow \"execution impact\" evidence when victim impact evidence is admitted is irrelevant in this case.\n\nThe question remaining is whether the exclusion of the \"execution impact\" evidence was reversible error in a case where victim impact evidence was properly excluded.\n\nWhile all relevant mitigating circumstances must be allowed in the sentencing phase of a capital case, the question is whether the effect the execution would have on the Defendant's family members is a relevant factor for the jury to consider. What mitigation evidence is admissible in a special sentencing proceeding is determined by RCW 10.95.060(3) and .070. RCW 10.95.060(3) states in part:\n\nThe court shall admit any relevant evidence which it deems to have probative value regardless of its admissibility under the rules of evidence, including hearsay evidence and evidence of the defendant's previous criminal activity . . . . RCW 10.95.070 provides:\n\nIn deciding the question posed by RCW 10.95.060(4) [\"Having in mind the crime of which the defendant has been found guilty, are you convinced beyond a reasonable doubt that there are not sufficient mitigating circumstances to merit leniency?\"], the jury . . . may consider any relevant factors, including but not limited to the following: [list of factors].\n\nThe list of factors in RCW 10.95.070 relates to facts about the defendant or to the circumstances of the crime and hence relates specifically to the defendant's culpability for the capital offense. Even victim impact evidence is about the direct harm caused by the crime which the defendant decided to commit. In Pirtle, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e we explained that despite [the defendant's] assertions to the contrary, \"mitigating evidence\" is not defined as any evidence, regardless of its content or relevance, that would disincline the jury to impose the penalty of death. Mitigating evidence is that which \"in fairness and mercy, may be considered as extenuating or reducing the degree of moral culpability.\" Pirtle, 127 Wash. 2d at 671 (quoting Bartholomew II, 101 Wash. 2d at 647).\n\nThe Supreme Court has held that the sentencer may not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any aspect of the offense that the defendant proffers. Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978) (plurality); see also Penry v. Lynaugh, 492 U.S. 302, 328, 109 S. Ct. 2934, 106 L. Ed. 2d 256 (1989) (jury must be able to consider any mitigating evidence relevant to a defendant's background and character or the circumstances of the crime); Eddings v. Oklahoma, 455 U.S. 104, 113-14, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982). However, nothing limits the traditional authority of a court to exclude, as irrelevant, evidence not bearing on the defendant's character, prior record, or the circumstances of his offense. Lockett, 438 U.S. at 604 n.12. We recognize there are cases in which the trial court has allowed evidence regarding the impact an execution would have on the defendant's family. E.g., Benn, 120 Wash. 2d at 647; Richmond v. Lewis, 506 U.S. 40, 43, 113 S. Ct. 528, 121 L. Ed. 2d 411 (1992). However, in those cases, the admissibility of such evidence was not an issue on appeal.\n\nThis Court has not addressed whether execution impact evidence must be admitted as a mitigating circumstance, but several other states' high courts have recently considered this issue. In People v. Sanders, 11 Cal. 4th 475, 905 P.2d 420, 46 Cal. Rptr. 2d 751 (1995), cert. denied, 136 L. Ed. 2d 66, 117 S. Ct. 115 (1996), the California Supreme Court found that the impact of the defendant's execution on his family may be excluded. In the Sanders case, the defendant argued that the defendant's sister should be allowed to testify about stigma to the family which would result from an execution and that the impact on the defendant's family, not only in grief, but in stigma, should be admitted. The trial court refused to admit the testimony. On appeal, the defendant relied on (1) Skipper v. South Carolina, 476 U.S. 1, 4, 106 S. Ct. 1669, 90 L. Ed. 2d 1 (1986), which held that the sentencer not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death, and (2) Payne v. Tennessee, 501 U.S. 808, 111 S. Ct. 2597, 115 L. Ed. 2d 720 (1991), \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e for the proposition that if victim impact evidence is relevant to the jury's sentencing choice, the impact of the defendant's execution on his family is equally pertinent and admissible. These are the arguments Stenson raises in this case. The Supreme Court of California found the cases inapposite and rejected the arguments. The Court said:\n\nThe specific questions whether family members would prefer that defendant not be executed or believe that a death sentence will stigmatize them are not, however, strictly relevant to the defendant's character, record, or individual personality. Moreover, while the impact on the victim's family is arguably relevant to show the specific harm caused by the crime and the blameworthiness of the defendant factors the United States Supreme Court has found relevant to the appropriate punishment the impact on the defendant's family is not comparably relevant to mitigate the specific harm of the crime or its blameworthiness. Sanders, 905 P.2d at 459.\n\nThe Supreme Court of New Jersey has also considered the question and concluded that mitigation evidence must be relevant to a defendant's character, record, or the circumstances of the offense, and that potential impact on a third party is not relevant to those issues and could therefore be excluded. The court explained that although testimony concerning the potential impact of an execution on a third party may be excluded, a defendant is nevertheless able to provide a wealth of character evidence as revealed by his relationships with his family members. The court went on to say that even if the trial court's refusal to allow the jury to consider the impact of the defendant's execution on his wife and children as mitigating factors was an error, the error would have been harmless because the defendant presented the jury with a multitude of character evidence that directly focused on his relationship with his wife and children. State v. Loftin, 146 N.J. 295, 680 A.2d 677, 713 (1996); see also State v. DiFrisco, 137 N.J. 434, 645 A.2d 734 (1994), cert. denied, 133 L. Ed. 2d 873, 116 S. Ct. 949 (1996) (whether the defendant's execution would cause excessive emotional hardship to his mother neither related to the defendant's character or record nor to the circumstances of the offense and rather focused on the potential impact on a third party and was properly excluded).\n\nIn the present case, the trial court did allow all character and background evidence, including evidence of Stenson's relationship with his family and friends and any circumstances of the crime which he wished to present. The court only excluded direct statements of how his execution might affect his family members. The witnesses' proposed testimony, which in fact was nothing more than their opinions as to the sentence for the Defendant that they thought might be best for the Stenson children, was not relevant to the Defendant's character or background and hence was properly excluded. As we concluded in Pirtle, this evidence does not relate to the Defendant's character, background or to the crime; it has nothing to do with extenuating circumstances and has no bearing on the Defendant's moral culpability. We agree with the California Supreme Court and the New Jersey Supreme Court that the potential impact of the Defendant's execution on third parties is not relevant. We hold there was no error in excluding both victim impact and execution impact evidence. Prosecutorial Misconduct in Penalty Phase The Defendant argues that the prosecutor's questioning of Mary Hudson, the \"mitigation specialist,\" was improper and constituted reversible error. Ms. Hudson explained to the jury that she was a type of investigator who investigates the background of defendants who are facing the death penalty. She testified she had been employed on the Stenson case since early Spring 1993, and that she had met with a number of witnesses and had prepared a book of materials which consisted of documents she had collected on Mr. Stenson's background. On cross examination, the following occurred:\n\nQ. That book does not contain all the information about the defendant, does it?\n\nA. No.\n\nQ. You are a mitigation specialist, that is your own self description; correct?\n\nA. Yes, and I am known in the industry as a mitigation specialist.\n\nQ. That's right. And so the information you are offering is just that, in mitigation.\n\nA. Yes, it is mitigation information.\n\nQ. But it does not contain everything there is to know about this defendant, does it?\n\nA. It does not contain everything there is to know about this defendant. Report of Proceedings (penalty phase) at 222-23.\n\nOn redirect, Ms. Hudson testified she had obtained a huge amount of materials on the Defendant and had decided to include some of them in the book to educate the jury about his background in support of mitigation. On recross, the following occurred:\n\nQ. In other words, you have collected data on the defendant and you have decided what you think that the jury ought to hear in mitigation?\n\nA. Yes. And I have consulted with the attorneys and we made the decision together.\n\nQ. And so I'm not just talking about volume, Miss Hudson, I'm talking about content. Necessarily this booklet that you wish to get into evidence does not contain everything there is to know about this defendant, does it?\n\nA. No.\n\nQ. Factors that might be considered not mitigating are not contained in that booklet, are they?\n\nA. I believe that there is some information in this booklet which is not entirely considered mitigating.\n\nQ. There is information -- that booklet lacks evidence that is not in mitigation, doesn't it? Report of Proceedings (penalty phase) at 225. Mr. Leatherman objected on the ground the question had been asked and answered.\n\nThe jury was dismissed and defense counsel argued that the prosecutor was trying to circumvent the court's prior order in limine regarding the Defendant's prior uncharged crimes or aliases. The trial court held that the question about whether the book contained all the information had been asked and answered and sustained the objection on that ground. When the jury returned, the court sustained the objection and the prosecutor said he had no further questions. The defense moved for a mistrial based on the cross examination of Ms. Hudson. The court denied the motion, concluding that no information had been elicited as to those matters on which there had been a ruling in limini. The court concluded that the questions did elicit appropriate cross examination responses that indicated the material submitted was not intended to be inclusive, but rather exclusive, to the issues of mitigation.\n\nThe scope of cross examination lies within the discretion of the trial Judge; the trial court's ruling will not be disturbed on appeal unless no reasonable person would take the position adopted by the trial court. Lord, 117 Wash. 2d at 870; Benn, 120 Wash. 2d at 651. The \"mitigation specialist\" had testified that she had been on the case for over a year and had collected volumes of material on Stenson's background. She told the jury she had collected medical records, school records, higher education records, previous court files, probation and parole records, photographs of Stenson and his family, evidence about his real estate license, FICA earnings, tax returns, interviews with witnesses, and affidavits from a number of witnesses. It was within proper cross examination to clarify that the materials being shown to the jury were in mitigation only. The trial court's denial of the motion for a mistrial was well within its discretion. Statutory Review of Death Penalty Under the Washington death penalty statute, this Court reviews the jury's decision to impose the death penalty by analyzing: whether there was sufficient evidence to justify the affirmative finding by the jury that there were not sufficient mitigating circumstances to merit leniency; whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant; whether the sentence of death was brought about by passion or prejudice; and whether the defendant was mentally retarded. RCW 10.95.130(2).\n\nThe Defendant does not claim that the death sentence was brought about through passion or prejudice or that the Defendant is mentally retarded, and there is no evidence in the record which would support such Conclusions.\n\nThe jury here concluded that the State had proved beyond a reasonable doubt that there were not sufficient mitigating circumstances to merit leniency for Darold Stenson. The test to review the sufficiency of the evidence is whether, after reviewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found sufficient evidence to justify that Conclusion beyond a reasonable doubt. Gentry, 125 Wash. 2d at 654; Lord, 117 Wash. 2d at 906.\n\nThe evidence introduced as mitigating factors was minimal. Stenson apparently had a normal childhood, grew up with his mother and father and sisters on a farm in the Midwest, and had experienced no abuse of any kind. All of his family expressed love for him and said they would continue to support him even if he were in prison. One defense expert witness testified that Stenson had high average mental ability and was not insane, but that his \"reasoning was impaired\" and he had a \"mental defect\" which the expert described as \"a difficulty in organizing, integrating, synthesizing complex material when he has no guidelines to do it.\" Report of Proceedings (penalty phase) at 342, 326, 328. On cross examination, the expert agreed there had been no medical diagnosis of a brain dysfunction. Stenson had above average intelligence and had attended college. There does not appear to be any motive for the murders except for financial gain. There was sufficient evidence for a rational trier of fact to have found that leniency was not merited.\n\nUnder RCW 10.95.130(2)(b), this Court must conduct proportionality review to determine \"whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e considering both the crime and the defendant.\"\n\nThe Defendant argues that this Court has defaulted on its statutory responsibility to conduct meaningful proportionality review in that the review conducted by this Court is too vague. We recently rejected this argument in Brown, slip op. at 20-21. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Stenson argues: (1) the jury found only two aggravating circumstances, and in more than 50 percent of the cases where the jury found only two circumstances, the defendant was not sentenced to death hence the sentence is disproportionate; (2) a defendant has not received a death sentence for killing a spouse or for killing a business partner and therefore the Defendant's sentence is unique, freakish and therefore constitutionally disproportionate. The Defendant urges the Court to adopt the \"majority case\" approach to proportionality review which would protect the person who has been sentenced to death if the majority (51 percent) of the defendants committing the same \"type\" of crime have not received a death sentence. We have repeatedly rejected such an analysis and have repeatedly refused to adopt a mathematical approach to proportionality review. Brown, slip op. at 22; Lord, 117 Wash. 2d at 910. We find no merit in the Defendant's argument that the death penalty is disproportionate because he murdered only his wife and his business associate. There is no authority for such a proposition and, under the facts of this case, we see no rationale for such a proposition. The Defendant killed his young wife, who was the mother of his three small children, and his business associate for financial gain. We can discern no reason why such murders are any less culpable than the murder of a stranger.\n\nThe concern in proportionality review is in avoiding two systemic problems in death sentences: random arbitrariness and imposition of the death sentence based on race. Lord, 117 Wash. 2d at 910; Benn, 120 Wash. 2d at 680; Gentry, 125 Wash. 2d at 655; Brown, slip op. at 21. There is no claim of racial discrimination; the Defendant and both victims are Caucasian.\n\nWe have examined the cases described in RCW 10.95.130(2)(b) and have concluded that the punishment in this case is not excessive or disproportionate. Under the proportionality statute, RCW 10.95.130(2)(b), this Court considers both the crime and the defendant in examining similar cases. In carrying this out, we examine four factors: (1) the nature of the crime, (2) the aggravating circumstances, (3) the defendant's criminal history, and (4) the defendant's personal history. E.g., Brown, slip op. at 22; Pirtle, 127 Wash. 2d at 686; Gentry, 125 Wash. 2d at 656; Benn, 120 Wash. 2d at 680; Lord, 117 Wash. 2d at 911-14.\n\nThe nature of the crime here involves the murder of two young adults. The evidence shows the crime was motivated by greed and was carefully planned with the aim of blaming Frank Hoerner for the murder of Denise Stenson. This case involved a greater degree of premeditation than in many other cases of first degree aggravated murder. The murderer here killed the mother of three young children while the children slept in the next rooms. Both victims suffered conscious pain and fear before they died. Although barely able to speak, Denise implored the paramedics to help her. The autopsy of Frank Hoerner shows that he was beat in the face and head, that he struggled to escape, and that he was dragged into the house and shot in the head. A brutal murder involving substantial conscious suffering of the victim makes the murderer more deserving of the death penalty. Gentry, 125 Wash. 2d at 657.\n\nThe aggravating circumstances are that there was more than one murder victim and that Frank's murder was committed to conceal the identity of Denise's murderer.\n\nThe Defendant did have some criminal history, including felony drug convictions, although none of the prior crimes were crimes of violence.\n\nThe Defendant's personal history shows almost nothing relevant to mitigation. He was raised by his mother and father with his three sisters, enjoying apparently a loving and stable home. He grew up on a farm and was active in 4-H, and has engaged in martial arts, scuba diving and flying. There is no evidence he was the subject of abuse, neglect or poverty. He is intelligent and has some college education. He had a wife and three young children. His parents and sisters testified to close relationships and that they continued to support him even after his convictions. The mitigating circumstances were not as deserving of mercy as in many of the cases where death was not imposed. Stenson was not lacking in normal intelligence, was not youthful, and was not the victim of a tragic background. We have compared this case and all the circumstances of the Defendant and his crime with other first degree aggravated murders which have and have not received the death penalty. Given the brutal, calculated nature of the crimes, the motivation of financial gain, and the lack of mitigating circumstances, we conclude the sentence was neither excessive nor disproportionate.\n\nConclusion\n\nWe affirm Darold Stenson's convictions for the aggravated first degree murders of Denise Stenson and Frank Hoerner and the imposition of the death sentence.\n\nWE CONCUR:\n\nBarbara Durham\n\nJames M. Dolliver\n\nCharles Z. Smith\n\nCharles W. Johnson\n\nBarbara A. Madsen\n\nGerry L. Alexander\n\nPhilip A. Talmadge\n\nSANDERS, J. (dissenting) Darold Stenson's conflict with his court- appointed attorney was irreconcilable as both parties admitted, yet he was denied substitute counsel. Stenson made a timely, unequivocal request to proceed pro se, yet the trial court denied this request as well. I would reverse Stenson's conviction and remand for a new trial. By affirming, the majority violates clear federal precedent and invites reversal in federal court when Stenson pursues habeas relief, as he inevitably will.\n\nOn July 12, 1994, two days before the jury was impaneled on July 14, Stenson filed \"DEFENDANT'S MOTION TO CONTINUE TRIAL, APPOINT NEW COUNSEL, OR, IN THE ALTERNATIVE, ALLOW HIM TO PROCEED PRO SE.\" Clerk's Papers (CP) at 590-92. Said motion stated:\n\nDefendant, Darold R. J. Stenson, moves this court to enter an order continuing the trial of this matter, dismiss his appointed attorneys, . . ., and appoint new counsel, or, in the alternative, allow him to proceed pro se in all further proceedings. This motion is based on the breakdown of the attorney client relationship between defendant and present counsel as defendant will explain on the record in court and the Sixth Amendment . . . . This motion is not being filed for the purpose of delay and is the first request for new counsel. CP at 591-92 (emphasis added) (citations omitted).\n\nThe trial court considered Stenson's motion in camera on July 13. Fred Leatherman, Stenson's lead appointed counsel, began the hearing by describing the conflict:\n\nIt is Mr. Neupert's and my opinion . . . that the guilt phase is not win-able and we do not want to do anything during the course of the guilt phase which in our professional judgment would create problems or prejudice Mr. Stenson's defense in the penalty phase.\n\nPut another way, from the perspective of the lawyers, the only issue in this case is whether Mr. Stenson lives or dies.\n\nFrom the perspective of Mr. Stenson, the only issue that is important to him is whether he is acquitted or not. Because we disagree over that fundamental decision, we have differing ideas about how we should proceed tactically in the guilty phase and that is, in summary, the nature of the conflict. Record of Proceedings (RP) (7/13/94) (Vol. XVII, Jury Voir Dire) at 3118- 19.\n\nThereafter, Stenson spoke:\n\nBasically my attorneys, after months of refusing to investigate certain things that I thought and my family thought were very important to this case, basically their, I, Mr. Leatherman, I\n\nattempted to fire him twice in the past. And each time I did that, I was just kind of poo pooed away and said no, things will be handled.\n\nAnd I want to state that I am not guilty of these charges that are against me. And we have many, many, many things to, that will corroborate this. But I was told that because of their views on my, the potential of me receiving the death penalty, that they would not fight for me. They set themselves up as my Judge and jury in this matter. And I will not basically what they wanted to do is pussy foot through the trial and concentrate on getting me a life sentence rather than saving me my life.\n\nI can not do that because I am not guilty of these charges. RP (7/13/94) at 3121-22.\n\nLeatherman responded, \"Your Honor, I believe as lead counsel it is my responsibility to make tactical decisions.\" RP (7/13/94) at 3122. He believed the bloodstain evidence presented at the guilt phase would be irrefutable. Leatherman concluded:\n\nSo he is very seriously handicapped. For that reason and my considered judgment I don't think that I don't think if I had to give a percentage of chances of winning in the guilt phase, I\n\nwould characterize it as one in a thousand at best. And for that reason tactically I will not do anything that is going to prejudice saving his life in the penalty phase.\n\nWe do have a strategy for the penalty phase. I won't go into that. I don't think it is necessary at this stage. Be we do have a strategy and I, it is my considered judgment that it has very significant chance of succeeding. But I do not want to alienate that jury.\n\nOut of respect for Mr. Stenson and in regard for his feelings in this matter . . . I consulted with other members of the defense team and we went and met with him the other evening and laid it out for him.\n\nAnd Mr. Stenson has consistently proclaimed his innocence from the very first day I met him and continues, as you can see even now, to claim his innocence. And so I think certainly from that perspective he's understandably upset that we are unwilling and, in fact, are refusing to do certain things during the course of the trial which he believes would be in his best interest and he believes would give him a legitimate shot at a not guilty verdict.\n\nBut I respectfully disagree with his judgment. I will not be a party to a strategy that is going to result in his conviction and sentencing to death. I didn't sign on to this case to watch him commit suicide. RP (7/13/94) at 3124-25.\n\nSuch is the conflict. Leatherman would attempt to save Stenson's life at the possible expense of allowing a finding of guilt. Stenson would contest guilt at the possible price of his life. The conflict could not be greater: it went to the very soul of the proceeding.\n\nStenson himself recognized the conflict and brought it clearly to the trial court's attention:\n\nHe also did not sign on to help me win this case. To help me prove my innocence. His sole motivation through all these months has been an attempt to save my life because of his death penalty views. Not because of his desire to fulfill his obligations as an attorney which is to defend his client to his utmost ability. RP (7/13/94) at 3125. Stenson stated he had two attorneys available who would be able to take the case within a short time, although it may be the time-table Stenson gave for their availability was somewhat unrealistic. But clearly Leatherman totally rejected Stenson's theory of defense. Stenson succinctly summed up the differences:\n\nWhat they are trying to do is put themselves in position of Judge and jury saying that they have decided this. That is not correct, your Honor. Their views on death penalty should, because they do radically differ from mine. I am in favor of the death penalty in certain cases. Obviously not in mine because I\n\nam not guilty. RP (7/13/94) at 3135.\n\nBut the trial court denied Stenson's motion to proceed pro se, stating it viewed the request as equivocal and untimely. The court also denied the motion to substitute counsel, stating \"The decision apparently is rightfully made by the attorney as to whether or not the client's instructions are reasonable and must be followed or unreasonable and must not be followed . . . .\" RP (7/14/94) at 3305. Weighing the issue, the trial court considered: the quality of counsels' representation up to that point; Stenson's prior proclivity to substitute counsel; the reasons for the request; the length and stage of the proceedings; and the disruption and delay which might reasonably be expected to follow granting such a motion. It concluded defense counsels' representation up to that point had been excellent; Stenson had no proclivity to file motions for substitution; the reasons for the request concerned differences in trial strategy; the trial was already under way; and if the motions were granted, the court anticipated a delay of at least 30 days for new counsel to adequately prepare for trial.\n\nAfter the trial court denied his election to proceed pro se because it was allegedly \"equivocal,\" Stenson again moved to simply represent himself. But the trial court denied this motion once again.\n\nAfter the jury was impaneled and trial commenced, Stenson presented a hand-written \"petition\" requesting permission to proceed pro se. There, Stenson repeated many of the claims stated in his oral presentation on the earlier motion and again claimed he had substitute counsel ready to proceed in a relatively short time. But the trial Judge denied this motion, claiming it was then untimely.\n\nFinally, Leatherman himself made a motion for leave to withdraw two and a half weeks later. Based on an article which had appeared in the Sequim Gazette he stated he could no longer represent Stenson in view of the Stenson family's dissatisfaction with the nature of Leatherman's representation. Leatherman had explicitly advised Stenson that he, Stenson, should not contact the media. Leatherman continued:\n\nAnd I'm very concerned about the nature of the attorney-client relationship.\n\nRight now I don't feel like I have an attorney-client relationship with Mr. Stenson. I'm extremely frustrated with him to the point of really not wanting to go on with this case. Put a lot of work and effort into this case on his behalf. And to read something like this as this point just, it's disgusting.\n\nQuite frankly, I can't stand the sight of him.\n\nIf the court orders me to continue, your Honor, I will. I\n\nhave been a trial lawyer now, oh, I guess close to 20 years, but I -- the nature of my relationship with Mr. Stenson has been getting worse and worse and worse. To the point now where I\n\ndon't think we are even communicating. I'm certainly not communicating with him and he's not communicating with me and we are heading in different directions on this case. RP (8/3/94) (Vol. IX, Trial Proceedings) at 1501-02. The trial court denied Leatherman's motion to withdraw. ANALYSIS Substitution of Counsel While a defendant has no constitutional right to his choice of appointed counsel, he does have the right to effective representation by any counsel, and this right may be endangered if the attorney-client relationship is bad enough. United States v. Graham, 319 U.S. App. D.C. 409, 91 F.3d 213, 221 (D.C. Cir. 1996), cert. denied, 117 S. Ct. 1003, 136 L. Ed. 2d 882 (1997). \"A criminal defendant who is dissatisfied with appointed counsel must show good cause to warrant substitution of counsel, such as a conflict of interest, an irreconcilable conflict, or a complete breakdown in communication between the attorney and the defendant.\" Smith v. Lockhart, 923 F.2d 1314, 1320 (8th Cir. 1991). Once a defendant demonstrates good cause, the trial court must appoint different counsel. Id.\n\nA review of the record demonstrates Leatherman and Stenson had an irreconcilable conflict, a fact recognized and repeatedly verbalized by both individuals. This conflict goes much further than the majority's assertion that the \"reason for Stenson's dissatisfaction was that the defense attorneys were unwilling to accuse Denise Hoerner of the murders.\" Majority at 73. Rather, the difference focused around the fact that Leatherman did not intend to vigorously contest the guilt phase of the trial but rather to focus on saving Stenson's life in the penalty phase. On the other hand, implication of Denise Hoerner in the murders was merely a part of Stenson's overall strategy to achieve a not guilty verdict.\n\nThe majority asserts Leatherman adequately represented Stenson because Leatherman did an adequate job during the guilt phase. However, the majority forgets the point of inquiry. The inquiry is not whether Leatherman did an adequate job presenting his case, but whether a conflict existed between counsel and the defendant. The record demonstrates Leatherman never tried to present Stenson's theory of the case to the jury. Whether this theory was viable or not, it was up to Stenson to decide whether Leatherman should attempt to advance it and it was up to the jury, not this court, to decide if the theory was believable.\n\n\"The client has the ultimate authority to determine the purposes to be served by legal representation, within the limits imposed by law and the lawyer's professional obligations.\" Annotated Model Rules of Prof'l Conduct 20, Rule 1.2 Comment (1984). \"Courts have long recognized that the Sixth Amendment right to counsel contains a correlative right to representation that is unimpaired by . . . divided loyalties. Counsel must be willing 'to advocate fearlessly and effectively' on behalf of the client.\" Smith, 923 F.2d at 1320 (citations omitted) (quoting United States v. Hurt, 177 U.S. App. D.C. 15, 543 F.2d 162, 167-68 (D.C. Cir. 1976)). Leatherman may have intelligently refused to present Stenson's full claim regarding absence of guilt to the jury; however, such was Stenson's choice and his Sixth Amendment right to counsel protects his personal right to make that choice. Leatherman recognized the conflict between his desire to prevent the jury from sentencing Stenson to death and Stenson's desire to vigorously argue his innocence. He appropriately put it on the record and observed the highest standards of the profession when he asked the court to permit his withdrawal from the case. The trial court erred when it denied these motions and substitution. Motion to Proceed Pro Se The majority, after lengthy Discussion, decides the claimed right to proceed is moot because Stenson did not unequivocally request same, and it was untimely as well. I disagree. Overwhelming authority holds a request to proceed pro se is timely if made before the jury is impaneled.\n\nFaretta v. California, 422 U.S. 806, 807, 95 S. Ct. 2525, 2527, 45 L. Ed. 2d 562 (1975) answered the question whether \"a State may constitutionally hale a person into its criminal courts and there force a lawyer upon him, even when he insists that he wants to conduct his own defense.\" The Court answered no:\n\nThe language and spirit of the Sixth Amendment contemplate that counsel, like the other defense tools guaranteed by the Amendment, shall be an aid to a willing defendant not an organ of the State interposed between an unwilling defendant and his right to defend himself personally. To thrust counsel upon the accused, against his considered wish, thus violates the logic of the Amendment. In such a case, counsel is not an assistant, but a master; and the right to make a defense is stripped of the personal character upon which the Amendment insists. It is true that when a defendant chooses to have a lawyer manage and present his case, law and tradition may allocate to the counsel the power to make binding decisions of trial strategy in many areas. This allocation can only be justified, however, by the defendant's consent, at the outset, to accept counsel as his representative.\n\nAn unwanted counsel \"represents\" the defendant only through a tenuous and unacceptable legal fiction. Unless the accused has acquiesced in such representation, the defense presented is not the defense guaranteed him by the Constitution, for, in a very real sense, it is not his defense. Id., at 820-21, 95 S. Ct. at 2533-34 (citations omitted).\n\nThe Sixth Amendment right to self-representation is demonstrative of \"the essential aim of the Amendment . . . to guarantee an effective advocate for each criminal defendant rather than to ensure that a defendant will inexorably be represented by the lawyer whom he prefers.\" Wheat v. United States, 486 U.S. 153 159, 108 S. Ct. 1692, 1697, 100 L. Ed. 2d 140 (1988). To facilitate this objective, the courts have placed a series of restrictions on a defendant's right to proceed pro se and thus \"to exercise the right to self-representation . . . a criminal defendant must negotiate a number of procedural obstacles.\" Adams v. Carroll, 875 F.2d 1441, 1444 (9th Cir. 1989). A criminal defendant's assertion of his right to proceed pro se therefore \"must be knowing and intelligent, timely and not for the purpose of delay, and unequivocal.\" Id. at 1442 (citations omitted). Timely Request Moore v. Calderon, 108 F.3d 261 (9th Cir. 1997) is directly on point. Moore definitively holds a request to proceed pro se is timely if made prior to the impaneling of the jury and Faretta continues to mandate this result.\n\nMoore applied the Antiterrorism and Effective Death Penalty Act of 1996 to habeas procedures in federal court. The 1996 amendments provide a federal court will not grant a writ of habeas corpus on behalf of any person in custody pursuant to the judgment on the merits by a state court unless \"the adjudication of the claim . . . resulted in a decision that was contrary to, or involved an unreasonable application of, clearly established Federal law, as determined by the Supreme Court of the United States . . . .\" 28 U.S.C.A. sec. 2254(d)(1) (1996).\n\nMoore was charged with double murder in state court. Two weeks before trial was set to begin Moore moved to proceed pro se. The trial court denied his request because it believed any delay would interfere with the orderly administration of Justice. The jury convicted Moore and sentenced him to death. The California Supreme Court affirmed Moore's direct appeal and denied eight habeas petitions.\n\nThe issue before the Ninth Circuit was whether the trial court's decision to deny Moore's request, as well as the California Supreme Court's affirmation of that decision, was contrary to or involved an unreasonable application of an authoritative decision of the Supreme Court. The court noted first that under previous Ninth Circuit opinions \"a request is timely if made before the jury is empaneled, unless it is shown to be a tactic to secure delay.\" Moore, 108 F.3d at 264. But the ultimate issue was whether this Conclusion was mandated by a decision of the United States Supreme Court. The court answered yes:\n\nThe only Supreme Court decision to discuss the timeliness of a request to proceed pro se is the Faretta decision itself. Our first inquiry is thus whether Faretta \"clearly established\" a rule of law regarding the timeliness of a request. In Faretta, the Court twice described the timing of Faretta's request to represent himself: it was made \"weeks before trial,\" 422 U.S. at 835, 95 S. Ct. at 2541, and \"well before the date of trial,\" id.\n\nat 807, 95 S. Ct. at 2527. The Court's acknowledgment of the timing of Faretta's request was neither a recitation of the background facts of the case nor obiter dictum; instead, it is mentioned not only in the opening paragraphs, but also in the very breadth with which the Court announced its decision. Id. at 835, 95 S. Ct. at 2541. It is properly considered necessary to the Court's decision, and therefore is a holding of the Court. .\n\n. As such, it is \"clearly established Federal law, as determined by the Supreme Court of the United States.\" Moore, 108 F.3d at 265 (second emphasis added). Consequently, the court held denial of Moore's request abridged his Sixth Amendment right to self- representation.\n\nThis holding conclusively demonstrates the Sixth Amendment mandates a defendant's request to proceed pro se is timely if made before the jury is impaneled and is not a tactic to secure delay. Stenson satisfies the first requirement of the rule. He moved to proceed pro se twice: first, two days before the jury was impaneled; and second, at the end of void dire, but still before the jury was impaneled.\n\nThe next question we must answer is whether Stenson made his motion to secure delay. We must keep in mind, though, that a defendant's assertion of his right to proceed pro se might stall or delay a trial is not dispositive. It is only when the defendant moves to proceed pro se solely to delay may the court deny the motion. \"Delay per se is not a sufficient ground for denying a defendant's constitutional right of self- representation. Any motion to proceed pro se that is made on the morning of trial is likely to cause delay; a defendant may nonetheless have bona fide reasons for not asserting his right until that time, and he may not be deprived of that right absent an affirmative showing of purpose to secure delay.\" Fritz v. Spalding, 682 F.2d 782, 784 (9th Cir. 1989).\n\nThe state may show a defendant makes a request to proceed pro se for purposes of delay in two ways. First, if a defendant accompanies his motion to proceed with a request for a continuance \"[this] would be strong evidence of a purpose to delay.\" Id. In State v. Breedlove, 79 Wash. App. 101, 107, 900 P.2d 586 (1995), the Court of Appeals considered a defendant's request made shortly before trial and which was accompanied by a motion to continue. The court rejected the State's contention that one could infer an improper purpose \"from the mere fact that the motions were made simultaneously. Such an inference [was] inappropriate because Breedlove did not condition his request to proceed pro se with a demand for a continuance and because the motion for continuance may, just as well, evince his expressed desire to prepare the defense his counsel had allegedly neglected to prepare.\" Id. at 109.\n\n\"The inquiry, however, does not stop there.\" Fritz, 682 F.2d at 784. The Ninth Circuit described what further inquiry the court must accomplish before it may conclude a motion for continuance is dispositive of the defendant's intent with respect to his request to proceed pro se: \"The court must also examine the events preceding the motion, to determine whether they are consistent with a good faith assertion of the Faretta right and whether the defendant could reasonably be expected to have made the motion at an earlier time.\" Fritz, 682 F.2d at 784-85.\n\nStenson filed his initial request to proceed pro se unaccompanied by a motion for continuance. He did, however, request a continuance with respect to his motion for substitution of counsel. See RP (7/13/94) at 3133.\n\nIt cannot be said Stenson made his motion to proceed pro se for purposes of delay as it was unaccompanied by a motion for continuance. While his subsequent requests for substitution of counsel were accompanied by motions to continue, it is also obvious that Stenson did not request said continuances to disrupt his trial but to allow any newly appointed counsel to become familiar with his case. As noted above, he had legitimate and considerable disagreements with Leatherman that led to his extreme position of requesting a new lawyer or proceeding by himself.\n\nSuch is not the situation in Hamilton (cited by the majority at 80). There, the Eighth Circuit considered defendant's request to proceed pro se untimely, although it was made three months before trial, because the defendant made his request in order to prepare his defense despite several months of trial preparation and a vague equivocation accompanied his request. Hamilton, 28 F.3d at 862. Moreover, Hamilton is inconsistent with the majority of cases which hold a request is timely if made prior to the jury's being impaneled. Even if we were to follow Hamilton, Stenson's request was far more reasonable than Hamilton's. Stenson clearly realized before trial his attorney had an agenda radically different from his own. Accordingly, Stenson made a timely and legitimate motion to proceed pro se.\n\nUnequivocal Request As noted above, the majority did not reach the issue of whether Stenson's request was timely because it found his request was equivocal. The record shows Stenson made a conditional but unequivocal request to proceed pro se. The majority hopelessly confuses the two concepts and thus decides the issue wrongly.\n\nThe majority relies heavily on Hamilton, but, as noted above, there are serious differences between that case and this. In Hamilton, the defendant had one public defender dismissed. He then moved to have another counsel appointed or to proceed pro se. The court, after receiving Hamilton's request, engaged the defendant in the following Discussion:\n\nThe Court: All right. Let me ask you, how serious are you about wanting to represent yourself?\n\nHamilton: I am not very serious about wanting to represent myself, but I will do that instead of having with all respect to Mr. Childress instead of having his assistance. I would rather represent myself. Hamilton, 28 F.3d at 861 (quoting Transcript on Appeal) (emphasis added). Hamilton also stated during the same colloquy that \"I am not asking to proceed pro se totally.\" Id.\n\nStenson evidenced no such equivocation here. He was clear and forceful: if he could not substitute another attorney for Leatherman, he wanted to try his own case. This was not the situation in Hamilton where Hamilton merely \"wanted [] yet another public defender, rather than [] represent himself.\" Hamilton, 28 F.3d at 862.\n\nAdams v. Carroll is dispositive. There, the Ninth Circuit examined whether \"a request to proceed without counsel [is] unequivocal where the defendant consistently wishes to invoke the right only as an alternative to the appointment of a particular defense attorney.\" Adams, 875 F.2d at 1442. The United States Court of Appeals held it is not equivocal. There the court appointed public defender Carroll to represent Adams. Citing a lack of trust and communication with Carroll, Adams requested the court appointment of another attorney, and stated that if he could not have another lawyer, \"'I will have to go pro per.'\" Id. The court permitted Adams to represent himself but denied his request for a new attorney. After six weeks of representing himself in pretrial motions, Adams again requested appointment of counsel other than Carroll, and the trial court denied said motion. Three weeks later, Adams requested appointment of co- counsel and the request was denied. Thereafter in January 1994, Adams moved for appointment of new counsel once again, and this time the trial Judge granted his motion and reappointed the Public Defender's office. Id. Notwithstanding Adams' continuing objection to Carroll and the fact that he had brought a malpractice suit against Carroll, the Public Defender's office reassigned Carroll to Adams' case. Id. at 1443.\n\nAt four subsequent hearings Adams asked to represent himself, each time making it clear that although he did not consider himself competent to proceed without counsel, he would rather proceed pro se than continue with Carroll. The trial Judge denied each request based on Adams' admission of incompetence and allowed the case to go to trial with Carroll as defense counsel. Adams, 875 F.2d at 1443. Not surprisingly, the jury convicted Adams, who appealed through the state court system and then to the Ninth Circuit.\n\nThe U.S. Court of Appeals began by noting the reasons why courts require an unequivocal request to proceed pro se.\n\nFirst, [the requirement] acts as a backstop for the defendant's right to counsel, by ensuring that the defendant does not inadvertently waive that right through occasional musings on the benefits of self-representation. . . . Because a defendant normally gives up more than he gains when he elects self-\n\nrepresentation, we must be reasonably certain that he in fact wishes to represent himself. . . .\n\nThe requirement that a request for self-representation be unequivocal also serves an institutional purpose: It prevents a defendant from taking advantage of the mutual exclusivity of the rights to counsel and self-representation. A defendant who vacillates at trial between wishing to be represented by counsel and wishing to represent himself could place the trial court in a difficult position: If the court appoints counsel, the defendant could, on appeal, rely on his intermittent requests for self-\n\nrepresentation in arguing that he had been denied the right to represent himself; if the court permits self-representation, the defendant could claim he had been denied the right to counsel. Adams, 875 F.2d at 1444.\n\nThe court observed Adams made his preference known from the start; that is, if he could not get other counsel appointed he wished to represent himself.\n\nAlthough his two self-representation requests were sandwiched around a request for counsel, this was not evidence of vacillation. To the contrary, each of these requests stemmed from one consistent position . . . . While his requests no doubt were conditional, they were not equivocal. Adams, 875 F.2d at 1444-45. The court continued:\n\nThis Conclusion is reinforced when tested against the purposes underlying the unequivocality requirement. Adams was not seeking to waive his right to counsel in a thoughtless manner; the trial court engaged him in extensive Discussion regarding the difficulties of proceeding in pro per. Adams nevertheless persisted, choosing to fend for himself rather than rely on counsel whom he mistrusted. Nor was his request a momentary caprice or the result of thinking out loud; he made the same request over and over again, at nearly every opportunity.\n\nHad the request been granted, an appeal based on the denial of the assistance of counsel would have been frivolous, in light of the earnestness and frequency of his requests to represent himself. None of the purposes served by the requirement would be furthered by treating a conditional request for self-\n\nrepresentation as equivocal.\n\nAdams . . . took one position and stuck to it: If the court would not order substitute counsel, he wished to represent himself. The sixth amendment, as interpreted in Faretta, required the trial court to honor this request. Adams, 875 F.2d at 1444-45.\n\nIf we apply these considerations to this case, the record clearly shows Stenson's request was thoughtful, sustained, repeated and legitimate. The trial court engaged Stenson in a lengthy Discussion about his wishes. Stenson was not thinking out loud or volunteering vague, capricious mumblings about wanting to represent himself. His request was clear: he wished to represent himself rather than rely upon counsel he mistrusted. As in Adams, had the court granted his request, an appeal on the basis of denial of assistance of counsel would have been frivolous. Denial of Stenson's request served no legitimate purpose.\n\nMost disturbing about the majority's rejection of Stenson's claim is the fact the majority cites nothing in the record upon which it could conceivably be argued Stenson equivocated in his request. The majority merely notes Stenson did not refute the trial court's Conclusion he did not really wish to proceed without counsel, as if the trial court's Conclusion stands as evidence of Stenson's state of mind. While Stenson's main objective in his motions was to remove Leatherman from his case, his desire in the event his motion for substitution was denied was clear: he wished to represent himself. A conditional request is not an equivocal one. The majority's decision, therefore, stands as the triumph of form over substance.\n\nThe denial of the right to self-representation is not amenable to a harmless error analysis: \"The right is either respected or denied; its deprivation cannot be harmless.\" McKaskle v. Wiggins, 465 U.S. 168, 177 n.8, 104 S. Ct. 944, 950 n.8, 79 L. Ed. 2d 122 (1984).\n\nConclusion\n\nI would reverse Stenson's conviction and remand for a new trial without consideration of other issues.\n\n\u003cspan class=\"fn\"\u003e1. The Defendant's brief claims that there was a \"bloody partial palm print\" on the dryer which was not that of the Defendant. Brief of Appellant at 24. This is not accurate. The palm print from the dryer was an older print, most probably from Denise Stenson, and there is no evidence it was bloody. In closing argument at trial, defense counsel acknowledged that the palm print discussed by the defense in its opening statement had been proved at trial to be consistent with Denise Stenson's palm print.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Officers testified they applied for the warrant, even though Darold Stenson had given them written permission to search and even though they believed the consent to search was valid, because the prosecuting attorney's office requests, in homicides, that the officers have search warrants in effect during the seizing of any evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. All references to Exhibit 6 contained in this opinion refer to the exhibit admitted on March 14, 1994, at a CrR 3.5/3.6 hearing. The exhibit consists of 83 pages of search warrants, transcripts, returns, and affidavits. The pages are unnumbered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. At trial the coroner testified that the binding marks on Denise Stenson's body resulted from her body being tied, after her death, to facilitate transport.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Dakota Farms was a corporation which was formed in 1990, and the major stockholder was Denise Stenson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Mr. Eldridge decided to accelerate the sale because an agent with the IRS had contacted him about some phone calls from the Sequim property (Dakota Farms) to a drug dealer they were investigating. Mr. Eldridge said he was afraid the property could be confiscated. The defense sought to exclude this evidence, the State agreed, and it was excluded by the trial court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. There is no challenge to the validity of these tests or the result that the blood stain on Stenson's right pants leg was Frank Hoerner's blood.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The evidence indicates that luminol is a presumptive test, like the phenolphthalein test, but that the luminol test is more likely to result in false positives because it is so sensitive and reacts to more non-blood substances (phenolphthalein is a much more specific test; it is not absolutely specific, but is more specific for blood than luminol).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Defendant also cites to the Mathews v. Eldridge, 424 U.S. 319, 335, 96 S. Ct. 893, 47 L. Ed. 2d 18 (1976) balancing test to argue that he did not have procedural due process. The Defendant does not cite any cases where the Mathews balancing test was used to determine if scientific evidence is admissible in a criminal proceeding. Under the due process clause of the Fourteenth Amendment, it must be demonstrated that the State's prosecution of a defendant comported with prevailing notions of fundamental fairness such that the defendant was afforded a meaningful opportunity to present a complete defense. Lord, 117 Wash. 2d at 867. Here, the Defendant was afforded opportunity for his own experts, was afforded wide latitude in cross examination, and brought out the fact that the phenol test was only a presumptive test for blood. The proper test for the admissibility of scientific evidence is ER 702, not the balancing test of Mathews v. Eldridge. The defense was clear at trial that it was not making a Frye argument and continues to reiterate that in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. There is no question that Mr. Grubb was a qualified expert. At the time of trial, he had worked as a forensic scientist in physical evidence for 20 years, had taught the forensic investigation course at the University of Washington, and had testified over 800 times on forensic issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Mr. Leatherman was substituted for Stenson's first appointed counsel because his first counsel was suspended from practice. Mr. Leatherman sought and was granted a continuance, and there is no allegation that substitution caused any prejudice to the Defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defense counsel sought and received funding to hire a nationally recognized expert in the field of forensic science to analyze the blood spatters on the Defendant's pants. Stuart James, a consulting blood analyst from the Florida Department of Law Enforcement, was hired by the defense, and his opinion was generally in agreement with that of the State's experts who said the spatter evidence was entirely inconsistent with Stenson's repeated statements to officers that he found Frank dead. Mr. James did not testify at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Counsel on appeal has told this Court he is aware of other evidence which could have been presented that would have implicated Mrs. Hoerner, as well as evidence that implicates another person. He acknowledges that since the evidence is not in the record, counsel cannot refer the Court to this evidence at this time and that in the event Stenson's conviction is affirmed, this additional evidence will be presented in a personal restraint petition. This is the correct procedure, because evidence outside the record in support of an ineffectiveness of counsel claim can be presented only in a personal restraint petition. State v. McFarland, 127 Wash. 2d 322, 338 n.5, 899 P.2d 1251 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The defense made a pretrial motion to exclude DNA evidence which indicated a match (based on the match criteria used at the FBI crime laboratory) between blood found on Stenson's pants and the blood of Frank Hoerner. In May 1994, the trial court conducted a Frye hearing on the admissibility of the RFLP DNA test results. The trial court did have this Court's opinion in Cauthron but did not have the Copeland or Jones opinions. Cauthron, 120 Wash. 2d 879, 846 P.2d 502; State v. Copeland, 130 Wash. 2d 244, 922 P.2d 1304 (1996); State v. Jones, 130 Wash. 2d 302, 922 P.2d 806 (1996). The trial court found that, given the scientific literature published after the Cauthron case, there was still significant dispute over the product rule and whether the equilibrium assumptions were valid. The court concluded that the product rule, as modified by the ceiling principle, was not yet generally accepted by the relevant scientific communities. The court therefore held that testimony as to exclusion of the stains on Stenson's pants being from Mr. Stenson or Mrs. Stenson could be given, but that testimony of a match with Frank Hoerner's blood could not be admitted. The court declined to rule on the ER 702 issues, finding them moot in light of the holding on the Frye issue. The jury therefore did not hear the DNA evidence that the blood on Stenson's pants matched Frank Hoerner's blood. It appears that such evidence would have passed the Frye test and, if admissible under ER 702, would have been admissible in light of our more recent cases. Copeland, 130 Wash. 2d 244, 922 P.2d 1304; Jones, 130 Wash. 2d 302, 922 P.2d 806. No one raises the DNA issue again on appeal since the trial court's decision worked to the Defendant's advantage. However, the exclusion of the inculpatory DNA evidence has some relevance to the issue of whether the Defendant's attorneys did, in fact, try to prove the Defendant to be not guilty in the guilt phase of his trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The defense made motions to suppress: (1) Stenson's use of aliases, (2) evidence that Stenson had collected public assistance, under an assumed name, which had ceased shortly before the murders, (3) any allegation or evidence that Stenson had in the past engaged in insurance fraud in relation to insurance proceeds he had collected from the sinking of his boat, (4) any evidence of his past criminal record in the guilt phase, (5) evidence that there was a stun gun in Stenson's desk drawer, and (6) evidence that Kit Eldridge (Stenson's landlord, the owner of Dakota Farms) had been contacted by the IRS and told they were investigating phone calls from the Dakota Farms to a drug dealer. The trial court granted all of these motions in limine to suppress this evidence. The defense also successfully argued against a jury view of the murder scene. The defense was also successful in having the Judge give a lesser included offense instruction on second degree murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The trial court's Conclusion that the request to proceed pro se was untimely is supported by the facts in this record. The trial court explained that 21 days had been spent in selecting the jury before the Defendant made his motion to continue the trial, have new counsel appointed or proceed pro se. If a significant continuance was granted, a new jury would have to be selected and the more than 60 witnesses rescheduled. Stenson told the trial court that he had met with his attorneys fewer than 10 times in the months before trial. The trial court recognized that there was a large amount of technical evidence necessitating expert testimony that was expected in the guilt phase of the trial. It is almost impossible to conceive the Defendant could have immediately assumed his own defense without a considerable delay for him to prepare himself to conduct an adequate defense. The record shows that granting the motion to proceed pro se would have delayed the trial and seriously hindered the administration of Justice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The defense made an offer of proof that Denise Stenson's sister would have testified that it would be a further tragedy for Stenson's children if he were executed and that she would have requested the jury not to impose the death penalty because of the trauma to the children.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The defense also proposed an instruction which told the jury they could consider, as a mitigating circumstance, the effect of the Defendant's execution on his family and friends and whether the execution would be likely to worsen the serious heart condition of D.J. Stenson's father. The court refused to give those instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This ruling was correct under Gentry and Payne, as a witness's opinion as to the proper sentence is not allowed under the federal constitution. Gentry, 125 Wash. 2d at 619, n.70; Payne v. Tennessee, 501 U.S. 808, 111 S. Ct. 2597, 115 L. Ed. 2d 720 (1991); Pirtle, 127 Wash. 2d at 627. It is clear neither the Defendant's family nor the victim's family may tell the jury what sentence should be imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Const. art. I, 35 (amend. 84) provides in relevant part: Upon notifying the prosecuting attorney, a victim of a crime charged as a felony shall have the right . . . to make a statement at sentencing . . . . In the event the victim is deceased . . . the prosecuting attorney may identify a representative to appear to exercise the victim's rights. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In Pirtle, this Court upheld the exclusion of an essay written by the murder victim expressing her opposition to the death penalty. The Court concluded that the essay had nothing to do with extenuating circumstances and had no bearing whatsoever on the defendant's moral culpability. Pirtle, 127 Wash. 2d at 671.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Supreme Court in Payne left to the states the determination whether victim impact evidence will be admissible in capital case sentencing proceedings. Payne, 501 U.S. at 824-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. \"Similar cases\" means cases reported in the Washington Reports or Washington Appellate Reports since January 1, 1965, in which the Judge or jury considered the imposition of capital punishment regardless of whether it was imposed or executed, and cases in which reports have been filed with the Supreme Court under RCW 10.95.120. RCW 10.95.130(2)(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We note the American Bar Association's House of Delegates recently called for a moratorium on executions in the United States until all jurisdictions implement policies to ensure that death penalty cases are administered fairly, impartially and in accordance with due process, and minimize the risk that innocent persons may be executed. While we agree with the goals stated by the ABA, we have previously held RCW 10.95.130(2) to be constitutional. Absent a finding of constitutional deficiency, we do not have authority to suspend the operation of the death penalty in this state.\u003c/span\u003e\n\n",
    "body_length": 196308,
    "citedas": [
      "940 P.2d 1239",
      "132 Wash.2d 668"
    ],
    "attorneys": "For Appellant: James E. Lobsenz, Carney Badley Smith \u0026 Spellman, Seattle, Wa, Darold R. Stenson (Appearing Pro Se), # 232018, Walla Walla, Wa. For Respondent: David H. Bruneau, Clallam Co Prosecuting Attorney, Port Angeles, Wa.",
    "category": [],
    "judges": "Authored by Richard P. Guy. Concurring: Barbara Durham, James M. Dolliver, Charles Z. Smith, Charles W. Johnson, Barbara A. Madsen, Gerry L. Alexander, Philip A. Talmadge. Dissenting: Richard B. Sanders.",
    "citation_count": 372
  }
}
