{
  "id": "MYgbQGYBTlTomsSBrftB",
  "document": {
    "title": "Environmental Defense Center",
    "full_title": "ENVIRONMENTAL DEFENSE CENTER, INC. NATURAL RESOURCES DEFENSE COUNCIL, INC. -INTERVENOR, v. UNITED STATES ENVIRONMENTAL PROTECTION AGENCY . AMERICAN FOREST \u0026 PAPER ASSOCIATION; NATIONAL ASSOCIATION OF HOME BUILDERS v. UNITED STATES ENVIRONMENTAL PROTECTION AGENCY NATURAL RESOURCES DEFENSE COUNCIL, INC., APPLICANT-INTERVENOR. TEXAS CITIES COALITION ON STORMWATER; TEXAS COUNTIES STORM WATER COALITION AMERICAN FOREST \u0026 PAPER ASSOCIATION, INTERVENOR, v. UNITED STATES ENVIRONMENTAL PROTECTION AGENCY NATURAL RESOURCES DEFENSE COUNCIL, INC. -INTERVENOR.",
    "jurisdiction": "Ninth Circuit",
    "date": "2003-01-14T00:00:00.000Z",
    "docket": "Nos. 00-70014, 00-70734, 00-70822",
    "body": "FOR PUBLICATION\n\nArgued and Submitted December 3, 2001--Pasadena, California\n\nOPINION\n\nPetitioners challenge a rule issued by the United States Environmental Protection Agency pursuant to the Clean Water Act, 33 U.S.C. §§ 1251-1387, to control pollutants introduced into the nation's waters by storm sewers.\n\nStorm sewers drain rainwater and melted snow from developed areas into water bodies that can handle the excess flow. Draining stormwater picks up a variety of contaminants as it filters through soil and over pavement on its way to sewers. Sewers are also used on occasion as an easy (if illicit) means for the direct discharge of unwanted contaminants. Since storm sewer systems generally channel collected runoff into federally protected water bodies, they are subject to the controls of the Clean Water Act.\n\nIn October of 1999, after thirteen years in process, the Environmental Protection Agency (\"EPA\") promulgated a final administrative rule (the \"Phase II Rule\" \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e or \"the Rule\") under § 402(p) of the Clean Water Act, 33 U.S.C. § 1342(p), mandating that discharges from small municipal separate storm sewer systems and from construction sites between one and five acres in size be subject to the permitting requirements of the National Pollutant Discharge Elimination System (\"NPDES\"), 33 U.S.C. §§ 1311(a), 1342. EPA preserved authority to regulate other harmful stormwater discharges in the future.\n\nIn the three cases consolidated here, petitioners and intervenors challenge the Phase II Rule on twenty-two constitutional, statutory, and procedural grounds. We remand three aspects of the Rule concerning the issuance of notices of intent under the Rule's general permitting scheme. We affirm the Rule against all other challenges.\n\nI. BACKGROUND\n\nA. The Problem of Stormwater Runoff\n\nStormwater runoff is one of the most significant sources of water pollution in the nation, at times \"comparable to, if not greater than, contamination from industrial and sewage sources.\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Storm sewer waters carry suspended metals, sediments, algae-promoting nutrients (nitrogen and phosphorus), floatable trash, used motor oil, raw sewage, pesticides, and other toxic contaminants into streams, rivers, lakes, and estuaries across the United States. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In 1985, three-quarters of the states cited urban stormwater runoff as a major cause of waterbody impairment, and forty percent reported construction site runoff as a major cause of impairment. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Urban runoff has been named as the foremost cause of impairment of surveyed ocean waters. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Among the sources of stormwater contamination are urban development, industrial facilities, construction sites, and illicit discharges and connections to storm sewer systems. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nB. Stormwater and the Clean Water Act\n\nCongress enacted the Clean Water Act in 1948 to \"restore and maintain the chemical, physical, and biological integrity of the Nation's waters.\" 33 U.S.C. § 1251(a) (originally codified as the Federal Water Pollution Control Act, 62 Stat. 1155). The Clean Water Act prohibits the discharge of pollutants from a \"point source\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e into the waters of the United States without a permit issued under the terms of the National Pollutant Discharge Elimination System, 33 U.S.C. §§ 1311(a), 1342, which requires dischargers to comply with technology-based pollution limitations (generally according to the \"best available technology economically achievable,\" or \"BAT\" standard). 33 U.S.C. § 1311(b)(2)(A). NPDES permits are issued by EPA or by states that have been authorized by EPA to act as NPDES permitting authorities. 33 U.S.C. § 1342(a)-(b). The permitting authority must make copies of all NPDES permits and permit applications available to the public, 33 U.S.C. §§ 1342(j), 1342(b)(3); state permitting authorities must provide EPA notice of each permit application, 33 U.S.C. § 1342(b)(4); and a permitting authority must provide an opportunity for a public hearing before issuing any permit, 33 U.S.C. §§ 1342(a)(1), 1342(b)(3); cf. 33 U.S.C. § 1251(e) (requiring public participation).\n\nStorm sewers are established point sources subject to NPDES permitting requirements. Natural Res. Def. Council v. Costle, 568 F.2d 1369, 1379 (D.C. Cir. 1977) (holding unlawful EPA's exemption of stormwater discharges from NPDES permitting requirements); Natural Res. Def. Council, 966 F.2d at 1295. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In 1987, to better regulate pollution conveyed by stormwater runoff, Congress enacted Clean Water Act § 402(p), 33 U.S.C. § 1342(p), \"Municipal and Industrial Stormwater Discharges.\" Sections 402(p)(2) and 402(p)(3) mandate NPDES permits for stormwater discharges \"associated with industrial activity,\" discharges from large and medium-sized municipal storm sewer systems, and certain other discharges. Section 402(p)(4) sets out a timetable for promulgation of the first of a two-phase overall program of stormwater regulation. Id. at § 1342(p)(2)-(4); Natural Res. Def. Council, 966 F.2d at 1296. In 1990, pursuant to § 402(p)(4), EPA issued the Phase I Rule regulating large discharge sources. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nC. The Phase II Stormwater Rule\n\nIn Clean Water Act § 402(p), Congress also directed a second stage of stormwater regulation by ordering EPA to identify and address sources of pollution not covered by the Phase I Rule. Section 402(p)(1) placed a temporary moratorium (expiring in 1994) on the permitting of other stormwater discharges pending the results of studies mandated in § 402(p)(5) to identify the sources and pollutant content of such discharges and to establish procedures and methods to control them as \"necessary to mitigate impacts on water quality.\" 33 U.S.C. § 1342(p)(5). Section 402(p)(6) required that EPA establish \"a comprehensive program to regulate\" these stormwater discharges \"to protect water quality,\" following the studies mandated in § 402(p)(5) and consultation with State and local officials. Id. at § 1342(p)(6).\n\nEPA proposed the Phase II Rule in January of 1998. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In October, 1999, Congress passed legislation precluding EPA from promulgating the new Rule until EPA submitted an additional report to Congress supporting certain anticipated aspects of the Rule. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e EPA was also required to publish its report in the Federal Register for public comment. Pub. L. No. 106-74, § 431(c), 113 Stat. at 1097. Later that month, EPA submitted the required (\"Appropriations Act\") study and promulgated the Rule. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nUnder the Phase II Rule, NPDES permits are required for discharges from small municipal separate storm sewer systems (\"small MS4s\") and stormwater discharges from construction activity disturbing between one and five acres (\"small construction sites\"). 40 C.F.R. §§ 122.26(a)(9)(i)(A)-(B). Small MS4s may seek permission to discharge by submitting an individualized set of best-management plans in six specified categories, id. at § 122.34, either in the form of an individual permit application, or in the form of a notice of intent to comply with a general permit. Id. at § 122.33(b). Small MS4s may also seek permission to discharge through an alternative process, under which a permit may be sought without requiring the operator to regulate third parties, id. at §§ 122.33(b)(2)(ii), 122.26(d). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Small construction sites may apply for individual NPDES permits or seek coverage under a promulgated general permit. Id. at § 122.26(c). EPA also preserved authority to regulate other categories of harmful stormwater discharges on a regional, as-needed basis. Id. at § 122.26(a)(9)(i)(C)-(D).\n\nD. Facial Challenges to the Phase II Rule\n\nThe Rule was challenged in the Fifth, Ninth, and D.C. Circuits in three separate actions ultimately consolidated before the Ninth Circuit.\n\nThe Texas Cities Coalition on Stormwater and the Texas Counties Stormwater Coalition (collectively, \"the Municipal Petitioners\") assert that EPA lacked authority to require permitting, that its promulgation of the Rule was procedurally defective, that the Rule establishes categories that are arbitrary and capricious, and that the Rule impermissibly requires municipalities to regulate their own citizens in contravention of the Tenth Amendment and to communicate a federally mandated message in contravention of the First Amendment. The Natural Resources Defense Council (\"NRDC\") intervened on behalf of EPA.\n\nEnvironmental Defense Center, joined by petitionerintervenor NRDC, (\"the Environmental Petitioners\") assert that the regulations fail to meet minimum Clean Water Act statutory requirements because they constitute a program of impermissible self-regulation, fail to provide required avenues of public participation, and neglect to address stormwater runoff associated with forest roads and other significant sources of runoff pollution.\n\nThe American Forest \u0026 Paper Association (\"AF\u0026PA\") and the National Association of Home Builders (\"the Industrial Petitioners\") assert that promulgation of the Rule was procedurally defective and violated the Regulatory Flexibility Act, that EPA's retention of authority to regulate future sources of runoff pollution is ultra vires, and that the decision to regulate discharge from construction sites one to five acres in size is arbitrary and capricious. NRDC again intervened on behalf of EPA.\n\nWe have jurisdiction pursuant to section 509(b)(1) of the Clean Water Act, 33 U.S.C. § 1369(b)(1) (assigning review of EPA effluent and permitting regulations to the Federal Courts of Appeals).\n\nII. DISCUSSION\n\nA. The Permit Requirements\n\nThe Municipal Petitioners' primary contention is that the Phase II Rule compels small MS4s to regulate citizens as a condition of receiving a permit to operate, and that EPA lacks both statutory and constitutional authority to impose such a requirement. Because we avoid considering constitutionality if an issue may be resolved on narrower grounds, Greater New Orleans Broadcasting Ass'n v. United States, 527 U.S. 173, 184 (1999), we first ask whether the Phase II Rule is supported by statutory authority.\n\n1. Statutory Authority\n\nThe Municipal Petitioners assert that the statutory command in Clean Water Act § 402(p)(6) that EPA develop a \"comprehensive program to regulate\" small MS4s did not authorize a program based on NPDES permits. Petitioners argue that because § 402(p)(6) explicitly indicates elements that the program may contain (performance standards, guidelines, etc.) without mentioning \"permits,\" Congress must have intended that the program exclude permitting. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe fact that \"permitting\" is not included on a statutory list of elements that the program \"may\" include is not determinative, because the list is manifestly nonexclusive. The only constraints are that the § 402(p)(6) regulations be based on the § 402(p)(5) studies, that they be issued in consultation with State and local officials, and that--\"at minimum\"--they establish priorities, requirements for State stormwater management programs, and expeditious deadlines, and constitute a comprehensive program \"to protect water quality.\" 33 U.S.C. § 1342(p)(6). EPA was free to adopt any regulatory program, including a permitting program, that included these elements. See Chevron, U.S.A. v. Natural Res. Def. Council, 467 U.S. 837, 842-43 (1984) (deference to an agency's reasonable interpretation is required unless Congress expressed its intent unambiguously). It is more reasonable to interpret congressional silence about permits as an indication of EPA's flexibility not to use them than as an outright prohibition. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe Municipal Petitioners further contend that their interpretation is supported by the structure of § 402(p), which expressly requires permits for large and medium sized MS4s in a separate section, § 402(p)(3)(B). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e However, as EPA counters, the language in § 402(p)(3) requiring permits for municipal storm sewers may be interpreted to apply both to Phase I and Phase II MS4s. Moreover, as respondentintervenor NRDC notes, the mere existence of the § 402(p)(1) permitting moratorium, designed to apply only to Phase II dischargers, necessarily implies that EPA has the authority to require permits from these sources after the 1994 expiration of the moratorium.\n\nSince there would have been no need to establish a permitting moratorium for these sources if the sources could never be subject to permitting requirements, petitioners' interpretation violates the bedrock principle that statutes not be interpreted to render any provision superfluous. See Burrey v. Pacific Gas \u0026 Elec. Co., 159 F.3d 388, 394 (9th Cir. 1998). EPA's interpretation of its mandate under § 402(p)(6) was reasonable and EPA acted within its statutory authority in formulating the Phase II Rule as a permitting program.\n\n2. The Tenth Amendment\n\nThe Municipal Petitioners contend that the Phase II Rule on its face compels operators of small MS4s to regulate third parties in contravention of the Tenth Amendment. We note that a facial challenge must show that there are no circumstances under which the challenged provisions would be constitutional. Legal Aid Soc'y v. Legal Serv. Corp., 145 F.3d 1017, 1023-24 (9th Cir. 1998). \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e We conclude that the Rule does not violate the Tenth Amendment, because it directs no unconstitutional coercion.\n\na. The Individual and General Permit Options.\n\nThe Phase II Rule requires any operator of a small MS4 applying for an individual permit or submitting a notice of intent for coverage under a general permit to specify plans for compliance with a series of six minimum control measures designed to protect water quality. 40 C.F.R. § 122.34. These \"Minimum Measures\" require an applicant to propose programs for: (1) conducting public education and outreach on stormwater impacts, id. at § 122.34(b)(1); (2) engaging public participation in the development of stormwater management programs, id. at § 122.34(b)(2); (3) detecting and eliminating illicit discharges to the MS4, id. at § 122.34(b)(3); (4) reducing pollution to the MS4 from construction activities disturbing one acre or more, id. at § 122.34(b)(4); (5) minimizing water quality impacts from development and redevelopment activities that disturb one acre or more, id. at § 122.34(b)(5); and (6) preventing or reducing pollutant runoff from municipal activities, id. at § 122.34(b)(6).\n\nThe Municipal Petitioners contend that the measures regulating illicit discharges, small construction sites, and development activities interfere excessively with local government functions and unconstitutionally compel small MS4 operators to regulate third parties, i.e. upstream dischargers. The Illicit Discharge Detection and Elimination measure requires that a permit seeker prohibit non-stormwater discharges to the MS4 and implement appropriate enforcement procedures. 40 C.F.R. § 122.34(b)(3)(ii)(B). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Construction Site Stormwater Runoff Control measure requires a permit seeker to implement and enforce a program to reduce stormwater pollutants from small construction sites. Id. at §§ 122.34(b)(4)(i)- (ii). \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e It mandates erosion and sedimentation controls, site plan reviews that take account of water quality impacts, site inspections, and the consideration of public comment, and requires that construction site operators implement erosion, sedimentation, and waste management best management practices. Id. The Post-Construction/New Development measure requires permit seekers to address post-construction runoff from new development and redevelopment projects disturbing one acre or more. Id. at § 122.34(b)(5)(ii)(B). \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Noting that most MS4s are operated by municipal governments, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and that \"[t]he drainage of a city in the interest of the public health and welfare is one of the most important purposes for which the police power can be exercised,\" New Orleans Gaslight Co. v. Drainage Comm'n, 197 U.S. 453, 460 (1905), the Municipal Petitioners argue that requiring Phase II permit applicants to enact \"ordinances or other regulatory measures\" amounts to federal commandeering in contravention of the Tenth Amendment. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See New York v. United States, 505 U.S. 144, 188 (1992).\n\nEPA counters that nothing in the Phase II Rule violates the Tenth Amendment, because it extends to small MS4s a generally applicable regulatory scheme \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e that does not excessively interfere with municipal functions. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e It argues that the Phase II Rule no more trespasses on state sovereignty than did the Driver's Privacy Protection Act (\"DPPA\") unanimously upheld in Reno v. Condon, 528 U.S. 141, 151 (2000), as a rule of general applicability that \"incidentally\" applied to states-- even though the universe of entities to which the DPPA could in fact apply included only states. 528 U.S. at 151 (declining to address whether general applicability is a constitutional requirement \"because the DPPA is generally applicable\"). EPA contends that the federal government need not avoid all requirements that cause States and localities to engage their legislative or executive processes, but only those that would \"excessively interfere\" with the functioning of those governments. Printz v. United States, 521 U.S. 898, 932 (1997). EPA argues that the federal government's great interest in preventing water pollution justifies the \"minimal interference\" with municipal functions that the Minimum Measures might occasion, and asserts that the Measures by definition could not interfere \"excessively\" with state or local governments, since MS4s are only required to reduce pollutants to the \"maximum extent practicable.\" 40 C.F.R. § 122.34(a).\n\n[1] b. Tenth Amendment Standards. The Tenth Amendment provides that \"all is retained [by the states] which has not been surrendered [to the federal government].\" New York, 505 U.S. at 156 (internal quotations omitted). If a power is delegated to Congress by the Constitution, the Tenth Amendment expressly disclaims any reservation of that power to the States, and Congress's exercise of that power does not intrude impermissibly on state sovereignty. Id.; Garcia v. San Antonio Metro. Transit Auth., 469 U.S. 528, 549 (1985). But the Tenth Amendment also signals constitutional protection for our system of dual sovereignty, confirming \"that the power of the Federal Government is subject to limits that may, in a given instance, reserve power to the States.\" New York, 505 U.S. at 157. Among the most important limits implied by the Tenth Amendment are the circumstances under which the federal government may not conscript state and local governments to regulate on its behalf--as petitioners contend EPA has inappropriately done in the Phase II Rule.\n\n[2] The Supreme Court has made clear that while Congress has substantial power under the Constitution to encourage the States to regulate according to federal preferences, \"the Constitution does not confer upon Congress the ability simply to compel the States to do so.\" New York, 505 U.S. at 149. Congress must not \"commandeer[ ] the legislative processes of the States by directly compelling them to enact and enforce a federal regulatory program.\" Hodel v. Virginia Surface Mining \u0026 Reclamation Ass'n, 452 U.S. 264, 288 (1981). See also Printz, 521 U.S. at 935 (\"The Federal Government may neither issue directives requiring the States to address particular problems, nor command the States' officers . . . to administer or enforce a federal regulatory program.\").\n\n[3] The key proscribed element is coercion. In New York, where the Court invalidated a federal law requiring states either to regulate radioactive waste according to a Congressional mandate or to take title to the waste, the Court held that \"[t]he Federal Government may not compel the States to enact or administer a federal regulatory program.\" 505 U.S. at 188 (invalidating part of the Low-Level Radioactive Waste Policy Amendment Act of 1985) (emphasis added). In contrast, Hodel sustained a federal law requiring states to choose between administering a federally-directed regulatory program or allowing federal authorities to regulate the mining activities of third parties within each state, because \"there can be no suggestion that the Act commandeers the legislative processes of the States by directly compelling them to enact and enforce a federal regulatory program.\" 452 U.S. at 288 (upholding the Surface Mining Control and Reclamation Act of 1977). Similarly, in Federal Energy Regulatory Comm'n v. Mississippi, 456 U.S. 742 (1982) (\"FERC\"), the Supreme Court sustained the Public Utility Regulatory Policies Act (PURPA), requiring States to follow certain procedures and consider adopting federally specified standards, because \"there is nothing in PURPA directly compelling the States to enact a legislative program.\" Id. at 765 (internal quotation omitted).\n\nWhile Congress may not coerce a State to regulate according to its terms, Congress may encourage a State to regulate in a manner consistent with federal interests. New York, 505 U.S. at 166-67. Under the spending power, Congress may seek to influence a State's policy choices by attaching conditions on the receipt of federal funds, as long as the conditions bear some relationship to the purpose of the federal spending. South Dakota v. Dole, 483 U.S. 203, 206-08 (1987) (upholding federal statute conditioning State receipt of certain federal highway funds on adoption of minimum drinking age of twenty-one). And where Congress is authorized to regulate private activity under the Commerce Clause, it may offer States the choice of regulating that activity according to federal standards or having state law preempted by federal regulation. Hodel, 452 U.S. at 288; FERC, 456 U.S. at 759, 76467 (Congress may require States that choose to regulate in a preemptible field to follow federally mandated procedures). As the Court has recognized, \"to hold that motive or temptation is equivalent to coercion is to plunge the law in endless difficulties.\" Charles C. Steward Mach. Co. v. Davis, 301 U.S. 548, 589-90 (1937).\n\nMoreover, the Court has distinguished between federal laws that unconstitutionally compel state regulation of third parties and generally applicable federal laws that permissibly regulate the activities of States that choose to act in the regulated field. South Carolina v. Baker, 485 U.S. 505, 514 (1988); Condon, 528 U.S. at 151. In South Carolina v. Baker, upholding an Internal Revenue Code provision that effectively forced States to issue bonds in registered form, the Supreme Court explained that the provision was permissible because it merely \"regulates state activities; it does not . . . seek to control or influence the manner in which States regulate private parties.\" 485 U.S. at 514. Responding to the claim that the provision commandeered state legislative and administrative process because many states had to enact legislation authorizing and administering the new bond registration program, the Court observed:\n\nSuch \"commandeering\" is, however, an inevitable consequence of regulating a state activity. Any federal regulation demands compliance. That a State wishing to engage in certain activity must take administrative and sometimes legislative action to comply with federal standards regulating that activity is a commonplace that presents no constitutional defect. Id. at 514-15.\n\nEven where state compliance with a generally applicable federal law \"thrusts upon the States all of the dayto-day responsibility for administering its complex provisions,\" no violation of the Tenth Amendment occurs when the federal law \"does not require the States in their sovereign capacity to regulate their own citizens.\" Condon, 528 U.S. at 149-50, 151 (upholding the DPPA because, though it clearly regulates state activity, it does not require the States to regulate their own citizens).\n\nWhere state action is incidentally burdened by a federal law of general applicability, the Court has indicated that the Tenth Amendment may still be implicated if the law \"excessively interfere[s] with the functioning of state governments.\" Printz, 521 U.S. at 932 (\"[W]here, as here, it is the whole object of the law to direct the functioning of the state executive, and hence to compromise the structural framework of dual sovereignty . . . a 'balancing' analysis is inappropriate. . . .\").\n\nThe Tenth Amendment thus requires that we evaluate whether the Phase II Rule coerces state action (leaving a State no choice but to comply with a federal mandate), whether the mandated action forces the state to regulate third parties (as opposed to regulating state activities legitimately subject to generally applicable federal law), and, if the federal law is generally applicable, whether it nevertheless excessively interferes with the functioning of state government.\n\nIn conducting this inquiry, however, we are sensitive to the fact that solving pressing environmental problems may require the formation of partnerships between federal and state authorities that the Supreme Court has referred to as \"program[s] of cooperative federalism.\" Hodel, 452 U.S. at 289 (\"[T]he Surface Mining Act establishes a program of cooperative federalism that allows the States, within limits established by federal minimum standards, to enact and administer their own regulatory programs, structured to meet their own particular needs. . . .\"). Although local governments have traditionally enjoyed broad authority over drainage activities, New Orleans Gaslight Co., 197 U.S. at 460, they do not enjoy exclusive sovereign authority over actions that contribute pollutants to the nation's waters.\n\nWe conclude that even if the Individual and General Permit options of the Phase II Rule require operators of small MS4s to regulate third parties, the Phase II Rule entrails no unconstitutional coercion because operators of small MS4s have two alternatives to the Individual and General Permit options: the option of not discharging and the Alternative Permit option.\n\nc. The Option of Not Discharging.\n\nThe boundary between federal and local water resources is uniquely permeable; state water generally becomes federal along its journey to the sea, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e while federal waters from sources other than rainfall always begin as local water somewhere. \"The Clean Water Act anticipates a partnership between the States and the Federal Government, animated by a shared objective: 'to restore and maintain the chemical, physical, and biological integrity of the Nation's waters.' \" Arkansas v. Oklahoma, 503 U.S. 91, 101 (1992) (quoting 33 U.S.C. § 1251(a)). For this reason, Congress required EPA to consult with state and local officials in mandating best management practices, 33 U.S.C. § 1342(p)(6) (in the context of the Phase II Rule); 33 U.S.C. § 1251(b) (highlighting the general Clean Water Act policy \"to recognize, preserve, and protect the primary responsibilities and rights of States to prevent, reduce, and eliminate pollution\").\n\n[4] If the Phase II Rule compelled state authorities to regulate third parties or involved excessive interference with local governance, it would transgress constitutional bounds regardless of the need for cooperative approaches to meet the important objectives of the Clean Water Act. But the Rule allows regulated MS4s flexibility within which to meet their obligations under federal law without unduly compromising local authority. The Rule does not coerce local governments to regulate third parties and does not excessively interfere with the state activities it regulates under legitimate commerce clause authority, but establishes a constitutional program of cooperative federalism like that upheld in Hodel.\n\nCompliance with the Minimum Measures should not \"excessively interfere\" with the functioning of municipalities. The public education requirement may be satisfied by distributing leaflets or making public service announcements; the public participation measure requires only that small MS4s comply with State, Tribal and local public notice requirements when implementing a public involvement/participation program; and the pollution prevention measure requires only that a permit-seeker train its staff to reduce runoff pollution from municipal operations. The illicit discharge, construction, and post-development measures may impose greater burdens, but each requires only that a small MS4 take reasonable steps to regulate the pollutant intake of their systems to minimize the introduction of pollutants to waters of the United States.\n\nThe Minimum Measures addressing illicit discharges, construction-related pollution, and post-development pollution each explicitly require compliance \"through ordinance, or other regulatory mechanism.\" 40 C.F.R. § 122.34(b)(3)- (b)(5). Compliance with the first and last of these Minimum Measures is possible by taking action entirely on the MS4 side of the interface. For example, an MS4 could manage the problem of illicit discharges by sealing off illicit connections at the point of entry to the MS4, rather than regulating the content of third party discharges. Similarly, nothing in the language of the post-development measure requires that the proposed best management plan addressing post-construction runoff regulate a third party. By contrast, the construction measure explicitly requires the permit-seeker to require construction site operators to implement appropriate erosion and sedimentation controls, and to control specified forms of waste products. 40 C.F.R. § 122.34(b)(4)(B)-(C). This langauge \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e appears to require what the federal government may not force a local government to do: enact and enforce a federal regulatory program. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nNevertheless, we cannot say that this Measure compels state authorities to regulate third parties, because local governments are not compelled to discharge collected stormwater to federal waters. Local governments make choices about how they wish to manage stormwater runoff, and in some cases take advantage of the presence of federal waters as a means of disposing of their own stormwater. While the Municipal Petitioners contend that municipalities cannot avoid discharging to federal waters, (because MS4s, broadly defined to include even roads with drainage systems, necessarily channel stormwater into downhill water bodies that ultimately enter the waters of the United States), alternative means for disposing of collected stormwater remain open to local governments that provide storm sewer services. Such alternatives include recycling programs and wetland construction. That these alternatives may prove more expensive does not alter the legal framework under which municipalities choose to discharge pollutants into the waters of the United States. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nBecause small MS4 operators discharge collected stormwater to federal waters voluntarily, they also accede to the requirements of Phase II permits voluntarily--if they wished to avoid those requirements, they could elect to stop discharging into federal waters. Thus small MS4 operators are not compelled by the terms of Phase II permits.\n\nJust as the Tenth Amendment does not prevent the federal government from persuading state action by conditioning the receipt of federal funds it is not required to bestow, the Tenth Amendment does not prevent the federal government from conditioning permission to discharge into federal waters on municipal adoption of a storm water management program. In both cases, federal authorities persuade state authorities to take action that might otherwise encroach upon state sovereignty because the action is exchanged, not compelled, for a good the federal government was not required to provide in the first place.\n\nIn this sense, the Phase II requirements are comparable in spirit to the mandate issued to the States under the DPPA and upheld in Condon. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The Clean Water Act has long been recognized as a valid exercise of Congressional power to regulate interstate commerce, see U.S. Const. art. I, § 8, cl. 3; Natural Res. Def. Council v. EPA, 863 F.2d 1420, 1436 (9th Cir. 1988), and a requirement that a state or municipality follow a generally applicable regulatory standard if it decides to engage in an activity legitimately regulated by the federal government does not usually violate the Tenth Amendment. See Condon, 528 U.S. at 151. As in Condon, where the federal government regulated states only to the extent that those states acted as database owners selling data, under Phase II, the operator of an MS4 need only comply with Phase II regulations to the extent that the MS4 receives pollutants from a third party and discharges them into the waters of the United States. 64 Fed. Reg. 68,765-66 (Dec. 8, 1999).\n\n[5] But even if we were to assume that states and localities have no choice but to discharge, and therefore no choice but to secure Phase II permits, a plain reading of the Phase II Rule demonstrates that they still would not face unconstitutional compulsion. A directive to enact a regulatory program is unconstitutionally coercive only if no constitutional alternative is provided. And the Phase II Rule offers an alternative means for obtaining permission to discharge.\n\nd. The Alternative Permit Option.\n\nOperators of small MS4s may opt to avoid the requirements of Phase II individual and general permits under an \"Alternative Permit\" option. 40 C.F.R. §§ 122.33(b)(2)(ii), 122.26(d). This Alternative Permit allows operators of small MS4 to seek individualized permission to discharge based on the permitting program established by the Phase I Rule for large and medium-sized MS4s. This option requires the permit seeker to propose management programs that address substantive concerns similar to those raised in the Minimum Measures, but does not require the permit seeker to regulate the actions of third parties upstream from the point of discharge to federal waters. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nEPA urges that the Minimum Measures are facially constitutional but that even if they were not, the Alternative Permit option relieves permit seekers of the obligation to take action that may approach the regulation of third parties. Because municipalities may choose an alternative that does not require regulation of third parties, EPA argues, the Phase II Rule does not run afoul of the Tenth Amendment. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe Municipal Petitioners maintain that the alternative program suffers from the same constitutional flaws as the general permit program, because the provisions addressing pollution from construction, development, illicit discharges, and municipal activities still functionally compel municipal authorities to administer a federal regulatory program. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nHowever, the requirements of the Alternative Permit option repeat generally applicable rules to which local governments are legitimately subject when they engage in the maintenance of storm sewers that discharge to federally protected waters, and for the reasons cited in discussing the Minimum Measures, they do not threaten excessive interference with local governance. \"[R]ather than seeking to control or influence the manner in which States regulate private parties,\" Condon, 528 U.S. at 150 (internal quotations omitted), the Alternative Permit requirements can be satisfied without obligating the operator of a small MS4 to regulate anyone.\n\nReducing \"the discharge of pollutants from an MS4 which receives discharges from areas of new development\" according to § 122.26(d)(2)(iv)(A) may be accomplished without any regulation of developers; an MS4 operator could reduce pollutant discharges by constructing artificial wetlands or implementing other structural treatment controls. An MS4 could prevent illicit discharges as required by § 122.26(d)(2) (iv)(B) simply by sealing off points of entry where illicit discharges are detected. Moreover, this option allows an MS4 simply to request a discharger to seek its own NPDES permitting arrangement, relieving the MS4 of any direct regulation of problem dischargers. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e An MS4 may similarly monitor and control pollutants from landfills and hazardous waste facilities in satisfaction of § 122.26(d)(2)(iv)(C) without directly regulating third parties. Finally, an MS4 may maintain structural and non-structural best management practices \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e regarding construction sites in satisfaction of § 122.26(d)(2)(iv)(D) without regulating third parties. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\n[6] Because the Alternative option provides applicants an avenue of securing a permit consistent with the Tenth Amendment, no permit seeker is compelled to negotiate the one questionable provision under the General Permit option (the Measure facially requiring municipal regulation of construction professionals). The Municipal Petitioners' claim that the Phase II Rule violates the Tenth Amendment therefore fails.\n\n3. Statutory Authority for the Minimum Measures\n\nThe Municipal Petitioners contend that, even if constitutional, the Minimum Measures of the General Permit option exceed EPA's statutory authority under § 402(p). Petitioners argue that nothing in the statute confers authority on EPA to require small MS4 operators to regulate third parties as a condition of receiving a permit, and that EPA's contrary interpretation is so constitutionally questionable that it is not entitled to Chevron deference. See Solid Waste Agency v. Army Corps of Engineers, 531 U.S. 159, 172-73 (2001). EPA argues that the nonexclusive list of statutory elements in § 402(p)(6) cannot be said to exclude a non-listed element, and that EPA's interpretation that the statute allows the Minimum Measures is thus reasonable and entitled to deference.\n\nWe agree that EPA's adoption of the Minimum Measures represents a permissible interpretation of its authority under § 402(p)(6). See Chevron, 467 U.S. at 843-44. The Rule does not violate the Tenth Amendment and the Measures are not inconsistent with the language or structure of § 402(p) or any other part of the Clean Water Act.\n\n4. The First Amendment and the Minimum Measures\n\nThe Municipal Petitioners contend that the Public Education and Illicit Discharge Minimum Measures compel municipalities to deliver EPA's political message in violation of the First Amendment. The Phase II Rule's \"Public Education and Outreach\" Minimum Measure directs regulated small MS4s to \"distribute educational materials to the community . . . about the impacts of stormwater discharges on water bodies and the steps the public can take to reduce pollutants in stormwater runoff.\" 40 C.F.R. § 122.34(b)(1)(i). The \"Illicit Discharge Detection and Elimination\" measure requires regulated small MS4s to \"[i]nform public employees, businesses, and the general public of hazards associated with illegal discharges and improper disposal of waste.\" 40 C.F.R. § 122.34(b)(3)(ii)(D).\n\nThe Municipal Petitioners argue that the First Amendment prohibits EPA from compelling small MS4s to communicate messages that they might not otherwise wish to deliver. They further contend that EPA's interpretation of § 402(p) as authorizing these Measures does not warrant Chevron deference because it raises serious constitutional issues, but that even if deference were given, the resulting rule is unconstitutional because neither Congress nor EPA may dictate the speech of MS4s. They contend that municipalities are protected by the First Amendment, Pacific Gas \u0026 Elec. v. Public Utilities Comm'n, 475 U.S. 1, 8 (1986) (\"Corporations and other associations, like individuals, contribute to the [discourse] that the First Amendment seeks to foster . . . .\"), which applies as much to compelled statements of \"fact\" as to those of \"opinion.\" Riley v. Nat'l Fed. of the Blind, 487 U.S. 781, 797-98 (1988).\n\nWe conclude that the purpose of the challenged provisions is legitimate and consistent with the regulatory goals of the overall scheme of the Clean Water Act, cf. Glickman v. Wileman Bros. \u0026 Elliott, Inc., 521 U.S. 457, 476 (1997), and does not offend the First Amendment. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The state may not constitutionally require an individual to disseminate an ideological message, Wooley v. Maynard, 430 U.S. 705, 713 (1976), but requiring a provider of storm sewers that discharge into national waters to educate the public about the impacts of storm water discharge on water bodies and to inform affected parties, including the public, about the hazards of improper waste disposal falls short of compelling such speech. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e These broad requirements do not dictate a specific message. They require appropriate educational and public information activities that need not include any specific speech at all. A regulation is facially unconstitutional only when every possible reading compels it, Meinhold v. U.S. Dep't of Def., 34 F.3d 1469, 1476 (1994), \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e but this is clearly not the case here.\n\nAs in Zauderer v. Office of Disciplinary Counsel of the Sup. Ct. of Ohio, 471 U.S. 626 (1985), where the Supreme Court upheld certain disclosure requirements in attorney advertising, \"[t]he interests at stake in this case are not of the same order as those discussed in Wooley [invalidating a law requiring that drivers display the motto \"Live Free or Die\" on New Hampshire license plates] . . . and Barnette [forbidding the requirement that public school students salute the flag because the state may not impose on the individual \"a ceremony so touching matters of opinion and political attitude\"].\" Id. at 651. EPA has not attempted to \"prescribe what shall be orthodox in politics, nationalism, religion, or other matters of opinion or force citizens to confess by word or act their faith therein.\" West Virginia State Bd. of Ed. v. Barnette, 319 U.S. 624, 642 (1943).\n\nInforming the public about safe toxin disposal is nonideological; it involves no \"compelled recitation of a message\" and no \"affirmation of belief.\" Pruneyard Shopping Ctr. v. Robins, 447 U.S. 74, 88 (1980) (upholding state law protecting petitioning in malls and noting that \"Barnette is inapposite because it involved the compelled recitation of a message containing an affirmation of belief\"). It does not prohibit the MS4 from stating its own views about the proper means of managing toxic materials, or even about the Phase II Rule itself. Nor is the MS4 prevented from identifying its dissemination of public information as required by federal law, or from making available federally produced informational materials on the subject and identifying them as such.\n\nEven if such a loosely defined public information requirement could be read as compelling speech, the regulation resembles another regulation that the Supreme Court has held permissible. In Glickman, 521 U.S. 457, the Court upheld a generic advertising assessment promulgated by the Department of Agriculture on behalf of California tree fruit growers because the order was consistent with an overall regulatory program that did not abridge protected speech:\n\nThree characteristics of the regulatory scheme at issue distinguish it from laws that we have found to abridge the freedom of speech protected by the First Amendment. First, the marketing orders impose no restraint on the freedom of any producer to communicate any message to any audience. Second, they do not compel any person to engage in any actual or symbolic speech. Third, they do not compel the producers to endorse or to finance any political or ideological views. Indeed, since all of the respondents are engaged in the business of marketing California nectarines, plums, and peaches, it is fair to presume that they agree with the central message of the speech that is generated by the generic program. Id. at 469-70 (footnotes omitted).\n\nHere, as in Glickman, the Phase II regulations impose no restraint on the freedom of any MS4 to communicate any message to any audience. They do not compel any specific speech, nor do they compel endorsement of political or ideological views. And since all permittees are engaged in the handling of stormwater runoff that must be conveyed in reasonably unpolluted form to national waters, it is similarly fair to presume that they will agree with the central message of a public safety alert encouraging proper disposal of toxic materials. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e The Phase II regulation departs only from the second element in the Glickman analysis, because the public information requirement may compel a regulated party to engage in some speech at some time; but unlike the offensive messages in Maynard and Barnette (and even the inoffensive advertising messages at issue in Glickman) that speech is not specified by the regulation. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nThe public information requirement does not impermissibly compel speech, and nothing else in the Phase II Rule offends the First Amendment. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e The Rule does not compel a recitation of a specific message, let alone an affirmation of belief. To the extent MS4s are regulated by the public information requirement, the regulation is consistent with the overall regulatory program of the Clean Water Act and the responsibilities of point source dischargers.\n\n5. Notice and Comment on the Alternative Permit\n\nOption\n\nThe Municipal Petitioners contend that, in adopting the Alternative Permit option, EPA did not comply with the minimum notice and comment procedures required in informal rulemaking by the Administrative Procedures Act (\"APA\"), 5 U.S.C. § 553. The APA requires an agency to publish notice of a proposed rulemaking that includes \"either the terms or substance of the proposed rule or a description of the subjects and issues involved.\" Id. at § 553(b)(3).\n\nWe have held that a \"final regulation that varies from the proposal, even substantially, will be valid as long as it is 'in character with the original proposal and a logical outgrowth of the notice and comments.' \" Hodge v. Dawson, 107 F.3d 705, 712 (9th Cir. 1997). In determining whether notice was adequate, we consider whether the complaining party should have anticipated that a particular requirement might be imposed. The test is whether a new round of notice and comment would provide the first opportunity for interested parties to offer comments that could persuade the agency to modify its rule. Am. Water Works Ass'n v. EPA, 40 F.3d 1266, 1274 (D.C. Cir. 1994).\n\nThe Municipal Petitioners argue that the Alternative Permit option is not a logical outgrowth of EPA's proposed rule because, although numerous alternatives were discussed in the Preamble to the proposed rule, 63 Fed. Reg. at 1554-1557, the Alternative Permit option eventually adopted was not. EPA counters that the proposed rule included a supplementary alternative permitting system based on concepts similar to those in the Minimum Measures, including \"simplified individual permit application requirements.\" \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e EPA contends that the Alternative Permit option was a logical outgrowth of the comments it received on the proposal expressing concern that the Minimum Measures might violate the Tenth Amendment. 64 Fed. Reg. at 68,765.\n\nThe Alternative Permit option passes the Hodge test. The proposed rule suggested an individualized permitting option to be developed in response to comments during the notice and comment period. The Alternative option contains no elements that were not part of the original rule, even if they are configured differently in the final rule. Petitioners had, and took, their opportunity to object to the aspects of the Rule that they did not support in their comments on the Minimum Measures.\n\nB. The General Permit Option and Notices of Intent\n\nThe Environmental Petitioners contend that the general permitting scheme of the Phase II Rule allows regulated small MS4s to design stormwater pollution control programs without adequate regulatory and public oversight, and that it contravenes the Clean Water Act because it does not require EPA to review the content of dischargers' notices of intent and does not contain express requirements for public participation in the NPDES permitting process.\n\n[7] In reviewing a federal administrative agency's interpretation of a statute it administers, we first determine whether Congress has expressed its intent unambiguously on the question before the court. See Chevron, 467 U.S. 837, 842-44 (\"If the intent of Congress is clear, that is the end of the matter; for the court, as well as the agency, must give effect to the unambiguously expressed intent of Congress.\"). \"If, instead, Congress has left a gap for the administrative agency to fill, we proceed to step two. At step two, we must uphold the administrative regulation unless it is arbitrary, capricious, or manifestly contrary to the statute.\" Defenders of Wildlife v. Browner, 191 F.3d 1159, 1162, amended by 197 F.3d 1035 (9th Cir. 1999) (citations and internal quotations omitted).\n\nWe conclude that the Phase II General Permit option violates the Clean Water Act's requirement that permits for discharges \"require controls to reduce the discharge of pollutants to the maximum extent practicable,\" 33 U.S.C. § 1342(p)(3)(B)(iii), because the Phase II rule does not provide for review of notices of intent. We also conclude that the Phase II General Permit option violates the Clean Water Act because it does not contain express requirements for public participation in the NPDES permitting process. We remand these aspects of the Phase II Rule.\n\n1. Phase II General Permits and Notices of Intent\n\n[8] Primary responsibility for enforcement of the requirements of the Clean Water Act is vested in the Administrator of the EPA. 33 U.S.C. § 1251(d); see also 33 U.S.C. § 1361(a) (\"The Administrator [of EPA] is authorized to prescribe such regulations as are necessary to carry out his functions under this chapter.\"). The Clean Water Act renders illegal any discharge of pollutants not specifically authorized by a permit. 33 U.S.C. § 1311(a) (\"Except in compliance with this section and [other sections detailing permitting requirements] of this title, the discharge of any pollutant by any person shall be unlawful.\"). Under the Phase II Rule, dischargers may apply for an individualized permit with the relevant permitting authority, or may file a \"Notice of Intent\" (\"NOI\") to seek coverage under a \"general permit.\" 40 C.F.R. § 122.33(b).\n\n[9] A general permit is a tool by which EPA regulates a large number of similar dischargers. Under the traditional general permitting model, each general permit identifies the output limitations and technology-based requirements necessary to adequately protect water quality from a class of dischargers. Those dischargers may then acquire permission to discharge under the Clean Water Act by filing NOIs, which embody each discharger's agreement to abide by the terms of the general permit. Because the NOI represents no more than a formal acceptance of terms elaborated elsewhere, EPA's approach does not require that permitting authorities review an NOI before the party who submitted the NOI is allowed to discharge. General permitting has long been recognized as a lawful means of authorizing discharges. Natural Res. Def. Council v. Costle, 568 F.2d 1369 (D.C. Cir. 1977).\n\n[10] The Phase II general permitting scheme differs from the traditional general permitting model. The Clean Water Act requires EPA not only to ensure that operators of small MS4s comply with the general effluent limitations of the Clean Water Act, but also that operators of small MS4s \"reduce the discharge of pollutants to the maximum extent practicable.\" 40 U.S.C. § 1342(p)(3)(B). To ensure that operators of small MS4s achieve this \"maximum extent practicable\" standard, the Phase II Rule requires that each NOI contain information on an individualized pollution control program that addresses each of the six general criteria specified in the Minimum Measures; thus, according to the Phase II Rule, submitting an NOI and implementing the Minimum Measures it contains \"constitutes compliance with the standard of reducing pollutants to the 'maximum extent practicable.' \" 40 C.F.R. § 122.34(a).\n\n[11] Because a Phase II NOI not only conveys assent to the broad effluent limitations of the Clean Water Act, but also establishes what the discharger will do to reduce discharges to the \"maximum extent practicable,\" the Phase II NOI crosses the threshold from being an item of procedural correspondence to being a substantive component of a regulatory regime. The text of the Rule itself acknowledges that a Phase II NOI is a permit application that is, at least in some regards, functionally equivalent to a detailed application for an individualized permit. See, e.g., 40 C.F.R. § 122.34(d)(1) (\"In your permit application (either a notice of intent for coverage under a general permit or an individual permit application), you must identify and submit to your NPDES permitting authority the following information . . . .\"). For this reason, EPA rejected the possibility of providing a \"form NOI\" to Phase II permittees, explaining that \"[w]hat will be required on an MS4's NOI . . . is more extensive than what is usually required on an NOI, so a 'form' NOI for MS4s may be impractical.\" 64 Fed. Reg. at 68,764.\n\n2. Failure to Regulate\n\nThe Environmental Petitioners argue that, by allowing NPDES authorities to grant dischargers permits based on unreviewed NOIs, the Rule creates an impermissible selfregulatory system. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Petitioners contend the Rule impermissibly fails to require that the permitting authority review an NOI to assure compliance with Clean Water Act standards, including the standard that municipal stormwater pollution be reduced to \"the maximum extent practicable.\" 33 U.S.C. § 1342(p)(3)(B)(iii). See 40 C.F.R. § 123.35 (setting out requirements for permitting authorities, but not requiring review of NOI); 64 Fed. Reg. at 68,764 (\"EPA disagrees that formal approval or disapproval by the permitting authority is needed\").\n\nEPA maintains that the Phase II permit system is fully consistent with the authorizing statute. It contends that § 402(p)(6) granted EPA flexibility in designing the Phase II \"comprehensive program,\" and notes that while the statute does not require general permits, neither does it preclude them. EPA contends that Congress delegated the task of designing the program to EPA, and that EPA reasonably adopted a \"flexible version\" of the NPDES permit program to suit the unique needs of the Phase II program. It disputes that the general permit program creates \"paper tigers,\" especially since EPA, states, and citizens may initiate enforcement actions. Finally, EPA argues that the Rule does not create a self-regulatory program, but that even if it did, nothing in § 402(p)(6) precludes such a program.\n\nReviewing the Phase II Rule under the first step of Chevron, we note that the plain language of § 402(p) of the Clean Water Act, 33 U.S.C. § 1342(p), expresses unambiguously Congress's intent that EPA issue no permits to discharge from municipal storm sewers unless those permits \"require controls to reduce the discharge of pollutants to the maximum extent practicable.\"\n\nPhase II general permits do impose requirements that ensure that operators of small MS4s comply with many of the effluent standards of the Clean Water Act. Thus, general permits issued under Phase II will contain numerous substantive requirements, just as did the permits issued under Phase I. See 40 C.F.R. §§ 123.35 \u0026 123.35(a) (\"§ 123.35 As the NPDES Permitting Authority for regulated small MS4s, what is my role? (a) You must comply with the requirements for all NPDES permitting authorities under Parts 122, 123, 124 and 125 of this chapter.\"); see also 40 C.F.R. § 122.28 (outlining requirements for NPDES authorities issuing general permits). In particular, each general permit must contain provisions to require compliance with § 307(a) of the Clean Water Act, 33 U.S.C. § 1317(a), which sets the effluent limitations that are the core of the NPDES program. See 40 C.F.R. § 122.44(b)(1) (\"If any applicable toxic effluent standard or prohibition . . . is promulgated under section 307(a) of [the Clean Water Act] for a toxic pollutant and that standard or prohibition is more stringent than any limitation on the pollutant in the permit, the Director shall institute proceedings under these regulations to modify or revoke and reissue the permit. . . .\").\n\nEvery operator of a small MS4 who files an NOI under Phase II \"must comply with other applicable NPDES permit requirements, standards, and conditions established in the . . . general permit.\" See 40 C.F.R. §§ 122.34 \u0026 122.34(f). Specifically, every operator of a small MS4 who files a Notice of Intent under Phase II must comply with the effluent standards and limitations promulgated under the Clean Water Act. See 40 C.F.R. § 122.34(f) (mandating compliance with the requirements, standards and conditions \"developed consistent with the provisions of §§ 122.41 through 122.49\"); see also 40 C.F.R. § 122.44 (mandating compliance with the effluent standards and limitations promulgated under the Clean Water Act).\n\nHowever, while each Phase II general permit will ensure that operators of small MS4s comply with the effluent standards of the Clean Water Act, they will not \"require controls to reduce the discharge of pollutants to the maximum extent practicable.\" According to the Phase II Rule, the operator of a small MS4 has complied with the requirement of reducing discharges to the \"maximum extent practicable\" when it implements its storm water management program, i.e. when it implements its Minimum Measures. 40 C.F.R. § 122.34(a). Nothing in the Phase II regulations requires that NPDES permitting authorities review these Minimum Measures to ensure that the measures that any given operator of a small MS4 has decided to undertake will in fact reduce discharges to the maximum extent practicable. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e See 40 C.F.R. § 123.35 (\"As the NPDES Permitting Authority for regulated small MS4s, what is my role?\"). Therefore, under the Phase II Rule, nothing prevents the operator of a small MS4 from misunderstanding or misrepresenting its own stormwater situation and proposing a set of minimum measures for itself that would reduce discharges by far less than the maximum extent practicable.\n\n[12] In fact, under the Phase II Rule, in order to receive the protection of a general permit, the operator of a small MS4 needs do nothing more than decide for itself what reduction in discharges would be the maximum practical reduction. No one will review that operator's decision to make sure that it was reasonable, or even good faith. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Therefore, as the Phase II Rule stands, EPA would allow permits to issue that would do less than require controls to reduce the discharge of pollutants to the maximum extent practicable. We therefore must reject this aspect of the Phase II Rule as contrary to the clear intent of Congress. Cf. Natural Res. Def. Council, 966 F.2d at 1305 (rejecting as arbitrary and capricious a permitting system that allowed regulated industrial stormwater dischargers to \"self-report\" whether they needed permit coverage).\n\n[13] Involving regulated parties in the development of individualized stormwater pollution control programs is a laudable step consistent with the directive to consult with state and local authorities in the development of the § 402(p)(6) comprehensive program. But EPA is still required to ensure that the individual programs adopted are consistent with the law. Our holding should not prevent the Phase II general permitting program from proceeding mostly as planned. Our holding does not preclude regulated parties from designing aspects of their own storm water management programs, as contemplated under the Phase II Rule. However, storm water management programs that are designed by regulated parties must, in every instance, be subject to meaningful review by an appropriate regulating entity to ensure that each such program reduces the discharge of pollutants to the maximum extent practicable. We therefore remand this aspect of the Rule.\n\n3. Public Participation\n\nThe Environmental Petitioners contend that the Phase II Rule fails to provide public participation as required by the Clean Water Act, because the public receives neither notice nor opportunity for hearing regarding an NOI. The EPA replies on the one hand by arguing that NOIs are not \"permits\" and therefore are not subject to the public availability and public hearing requirements of the Clean Water Act, and on the other hand by arguing that the combination of the public involvement minimum measure, 40 C.F.R. § 122.34(b)(2), the Federal Freedom of Information Act, 5 U.S.C. § 552, and state freedom of information acts would fulfill any such requirements if NOIs were permits.\n\n[14] Reviewing the Phase II Rule under Chevron step one, we conclude that clear Congressional intent requires that NOIs be subject to the Clean Water Act's public availability and public hearings requirements. The Clean Water Act requires that \"[a] copy of each permit application and each permit issued under [the NPDES permitting program] shall be available to the public,\" 33 U.S.C. § 1342(j), and that the public shall have an opportunity for a hearing before a permit application is approved, 33 U.S.C. § 1342(a)(1). Congress identified public participation rights as a critical means of advancing the goals of the Clean Water Act in its primary statement of the Act's approach and philosophy. See 33 U.S.C. § 1251(e); see also Costle v. Pacific Legal Found., 445 U.S. 198, 216 (1980) (noting the \"general policy of encouraging public participation is applicable to the administration of the NPDES permit program\"). EPA has acknowledged that technical issues relating to the issuance of NPDES permits should be decided in \"the most open, accessible forum possible, and at a stage where the [permitting authority] has the greatest flexibility to make appropriate modifications to the permit.\" 44 Fed. Reg. 32,854, 32,885 (Jun. 7, 1979).\n\n[15] As we noted above, under the Phase II Rule it is the NOIs, and not the general permits, that contain the substantive information about how the operator of a small MS4 will reduce discharges to the maximum extent practicable. Under the Phase II Rule, NOIs are functionally equivalent to the permit applications Congress envisioned when it created the Clean Water Act's public availability and public hearing requirements. Thus, if the Phase II Rule does not make NOIs \"available to the public,\" and does not provide for public hearings on NOIs, the Phase II Rule violates the clear intent of Congress. EPA's first argument--that NOIs are not subject to the public availability and public hearings requirements of the Clean Water Act--therefore fails.\n\n[16] We therefore reject the Phase II Rule as contrary to the clear intent of Congress insofar as it does not provide for public hearings on NOIs as required by 33 U.S.C. § 1342(a)(1). However, Congress has not directly addressed the question of what would constitute an NOI being \"available to the public\" as required by 33 U.S.C. § 1342(j). Under Chevron step two, we must defer to EPA's interpretation of \"available to the public\" unless it is arbitrary, capricious, or manifestly contrary to the statute.\n\nEPA argues that the NOIs are \"available to the public\" as a result of the combined effects of the public participation minimum measures, and of federal and state freedom of information acts. This argument is unconvincing. First, the public participation Minimum Measure only requires dischargers to design a program minimally consistent with State, Tribal and local requirements. 40 C.F.R. § 122.34(b)(2). Second, the federal Freedom of Information Act only applies to documents that are actually in EPA's possession, not to documents that are in the possession of state or tribal NPDES authorities, see 40 C.F.R. § 2 (providing EPA's policy for releasing documents under the federal Freedom of Information Act), and nothing in the Phase II Rule provides that EPA obtain possession of every NOI that is submitted to a NPDES permitting authority. See 40 C.F.R. §123.41(a) (making information provided to state NPDES authorities available to EPA only upon request). Thus, under the Phase II Rule, NOIs will only \"be available to the public\" subject to the vagaries of state and local freedom of information acts. We conclude that EPA's interpretation of 33 U.S.C. § 1342(j), as embodied in the provisions of the Phase II Rule providing for the public availability of NOIs, is manifestly contrary to the Clean Water Act, which contemplates greater scope, greater certainty, and greater uniformity of public availability than the Phase II Rule provides. We therefore reject this aspect of the Phase II Rule.\n\n[17] In sum, we remand the Phase II Rule to EPA on the grounds that the Phase II Rule must provide for the review of NOIs to ensure that those NOIs \"require controls\" upon operators of small MS4s \"that reduce the discharge of pollutants to the maximum extent practicable,\" 33 U.S.C. § 1342(p)(3)(B)(iii), must provide for public hearings on NOIs before any discharge is authorized as required by 33 U.S.C. § 1342(a)(1), and must provide for the public availability of NOIs as required by 33 U.S.C. § 1342(j).\n\nC. Failure to Designate\n\nWe reject the Environmental Petitioners' contention that EPA's failure to designate for Phase II regulation serious sources of stormwater pollution, including certain industrial (\"Group A\") sources and forest roads, was arbitrary and capricious. See Marsh v. Oregon Natural Res. Council, 490 U.S. 360, 378 (1989). \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\n1. \"Group A\" Facilities\n\nIn addition to the small MS4s and construction sites ultimately designated for regulation under the Phase II Rule, EPA evaluated a variety of other point-source discharge categories for potential Phase II regulation. One group of dischargers (referred to as the \"Group A\" facilities) included sources that \"are very similar, or identical\" to regulated stormwater discharges associated with industrial activity that were not designated for Phase I regulation for administrative reasons unrelated to their environmental impacts. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e 64 Fed. Reg. at 68,779. EPA estimates that Group A includes approximately 100,000 facilities, including auxiliary facilities and secondary activities (\"e.g., maintenance of construction equipment and vehicles, local trucking for an unregulated facility such as a grocery store,\" id.) and facilities intentionally omitted from Phase I designation (\"e.g., publicly owned treatment works with a design flow of less than 1 million gallons per day, landfills that have not received industrial waste,\" id.).\n\nThe Environmental Petitioners contend that EPA should have designated the Group A facilities for categorical Phase II regulation after finding (1) that stormwater discharges from these facilities are the same as those from the industrial sources regulated under Phase I, and (2) that such discharges may cause \"adverse water quality impacts.\" Id. Petitioners argue that these findings, and EPA's failure to provide individualized analysis regarding whether any specific source category within Group A requires regulation, render EPA's decision not to regulate any of these sources under the Rule arbitrary and capricious. They maintain that EPA's \"linedrawing,\" which regulates some pollution sources but leaves nearly identical sources unregulated without any persuasive rationale, is necessarily arbitrary and capricious. See Natural Res. Def. Council, 966 F.2d at 1306 (EPA's decision not to regulate construction sites smaller than five acres was arbitrary when EPA provided no data to justify the five-acre threshold and admitted that unregulated sites could have significant water quality impacts).\n\nPetitioners argue that § 402(p)(6) at least required EPA to make findings with respect to individual Group A categories, and that data collected from Phase I permit applications could be used to evaluate the pollutant potential of the identical Group A sources. They contend that these findings should have sufficed as a basis for designating at least some Group A sources, and that EPA's conclusion that it lacked adequate nationwide data upon which to designate any of these sources is not supported by the record evidence. Comparing EPA's identification of the serious polluting potential of some of these sources with its statutory mandate under § 402(p)(6) \"to protect water quality,\" they argue that EPA fails even the forgiving standard of arbitrary and capricious review in that it has \"offered an explanation for its decision that runs counter to the evidence before [it]\", and \"is so implausible that it could not be ascribed to a difference in view or the product of agency expertise.\" See Motor Vehicle Mfrs., 463 U.S. at 43.\n\nEPA maintains that it considered Group A facilities' similarity to already regulated sources as only one of several criteria that it used in designating sources for regulation under Phase II, 64 Fed. Reg. at 68,780, and that sources that appear \"similarly situated\" under one criterion are not necessarily similarly situated under all. EPA asserts that nothing in § 402(p)(6) implied a responsibility to make individualized findings regarding each Group A subcategory, and it maintains that it simply lacked sufficient data to support nationwide designation of the Group A facilities. EPA notes that, after failing to receive requested comment providing such data, it proposed instead \"to protect water quality\" by allowing regional regulation of problem Group A facilities under the residual designation authority. EPA contends that agencies must be afforded deference in determining the data necessary to support regulatory decision making and that it reasonably determined the quantum of data it would need to support the designation of additional sources on a nationwide basis. See Sierra Club v. EPA, 167 F.3d 658, 662 (D.C. Cir. 1999).\n\nWe conclude that sufficient evidence supports EPA's decision not to designate Group A sources on a nationwide basis, and instead to establish local and regional designation authority to account for these sources and protect water quality. Although we are troubled by the purely administrative basis for the distinction between facilities regulated under the Phase I Rule and the Group A facilities that remain unregulated under Phase II, \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e EPA's choice of the Phase I standard for designation is not the issue before us. Before us is whether EPA acted arbitrarily in declining to designate the Group A sources on a nationwide basis under the Phase II Rule, and we cannot say that it did.\n\nEPA has articulated a rational connection between record facts indicating insufficient data to categorically regulate Group A facilities and its corresponding conclusion not to do so, and we defer to that decision. See Washington v. Daley, 173 F.3d 1158, 1169 (9th Cir. 1999). In the text of the Rule, EPA explains that the process behind its decision not to nationally designate Group A sources for Phase II regulation focused not only on the likelihood of contamination from a source category but also on the sufficiency of national data about each category and whether pollution concerns were adequately addressed by existing environmental regulations. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e We cannot say that EPA relied on factors Congress had not intended it to consider, that it failed to consider an important aspect of the problem, or that its rationale is implausible. See Motor Vehicle Mfrs., 463 U.S. at 43. Nor did EPA's decision run counter to the evidence before it. Id. The Environmental Petitioners allege that its decision not to regulate Group A facilities runs counter to evidence that similar sources are highly polluting, but as EPA considered evidence beyond those similarities that persuaded it not to regulate, we cannot say that EPA's decision is unsupported by the record. Nothing in § 402(p)(6) unambiguously requires EPA to evaluate the Group A source categories individually, and we defer to EPA's interpretation of the statute it is charged with administering. See Royal Foods Co. v. RJR Holdings, 252 F.3d 1102, 1106 (9th Cir. 2001).\n\n2. Forest Roads\n\nThe Environmental Petitioners also contend that EPA arbitrarily failed to regulate forest roads under the Rule despite clear evidence in the record documenting the need for stormwater pollution control from these roads. Petitioners again contend that this agency action is arbitrary, because EPA has offered an explanation for its decision that runs counter to the evidence before it.\n\nPetitioners point to EPA's own conclusion that forest roads \"are considered to be the major source of erosion from forested lands, contributing up to 90 percent of the total sediment production from forestry operations.\" \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e They note that both unimproved forest roads and construction sites create large expanses of non-vegetated soil subject to stormwater erosion, and argue that construction site data thus also supports regulation of forest roads. Petitioners observe that EPA has cited no contrary evidence indicating that forest roads are not sources of stormwater pollutant discharges to U.S. waters, and they argue that Phase II regulation is necessary \"to protect water quality,\" because proper planning and road design can minimize erosion and prevent stream sedimentation. Petitioners note that this court has previously held that, in the absence of such \"supportable facts,\" EPA is not entitled to the usual assumption that it has \"rationally exercised the duties delegated to it by Congress.\" Natural Res. Def. Council, 966 F.2d at 1305.\n\nEPA maintains that this argument is time-barred by Clean Water Act § 509(b)(1), 33 U.S.C. § 1369(b)(1) (providing that \"application for review shall be made within 120 days from the date of [agency action]\"). EPA promulgated silviculture regulations in 1976 that exclude from NPDES permit requirements silvicultural activities that EPA has determined constitute non-point source activities, including \"surface drainage, or road construction and maintenance from which there is natural runoff.\" 40 C.F.R. § 122.27(b)(1). EPA notes that Petitioners missed yet another opportunity to seek review of EPA's regulation of silvicultural activities when EPA recently considered \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e but ultimately declined \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e to change the classification of forest roads to point sources subject to NPDES regulation. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nEPA's line of argument might be more persuasive if the Environmental Petitioners' contention could only be understood as a direct challenge to its 1976 silviculture (forestry) regulations, but this is not the case. The Petitioners assert that EPA's decision not to regulate forest roads under the Phase II rule is arbitrary, because EPA made the decision while aware that forest roads pose a recognized threat to water quality.\n\nThe fact that EPA exempted forest roads from NPDES permit requirements in 1976, 40 C.F.R. § 122.27(b), does not resolve the question whether EPA should have addressed forest roads in its \"comprehensive program . . . to protect water quality\" under § 402(p)(6), because § 402(p)(6) does not require that the \"comprehensive program\" be limited to the use of NPDES permits. Indeed, as EPA argued in response to the Municipal Petitioners' claim that it lacked statutory authority to regulate Phase II dischargers through the NPDES permitting program, EPA was \"free to adopt any regulatory program that was 'comprehensive' \" and included the other requisite elements (that the program be based on the § 402(p)(5) studies, etc.). EPA was not precluded from addressing forest roads in the Phase II program simply because forest roads are currently exempt from NPDES permitting requirements.\n\nHowever, we cannot say that EPA's decision not to designate forest roads for Phase II regulation was arbitrary, because EPA was asked by Congress to promulgate the Phase II Rule under the section of the Clean Water Act demarcated for regulating \"Municipal and Industrial Stormwater Discharges.\" 33 U.S.C. § 1342(p). The Phase II \"comprehensive program\" was thus specifically intended to address stormwater pollution from industrial and municipal sources, not agriculture. That EPA did not regulate forest roads under this program is consistent with its policy practice of treating silviculture as an agricultural, rather than an industrial, activity. This categorical distinction is supported in the text of the Clean Water Act, see, e.g., id. § 1314(e)-(f) (treating separately best management practices for industry, § 1314(e), and pollution control for \"agricultural and silvicultural activities,\" § 1314(f)(A)). \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e EPA's interpretation of the statutory provision it is charged with administering is entitled to deference. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e See Royal Foods Co., 252 F.3d at 1106.\n\nThe Environmental Petitioners argue that this aspect of the Rule is arbitrary because EPA \"offered an explanation for its decision that runs counter to the evidence before [it],\" Motor Vehicles Mfrs. Ass'n, 463 U.S. at 43, since EPA knew at the time of the rulemaking that forest roads threaten water quality. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e We agree that EPA was probably aware of the forest road sedimentation problem at the time of the rulemaking, just as it was aware of many other sources of water pollution that it also declined to regulate under the Phase II Rule, including agricultural activities responsible for even more serious water quality impairments of rivers and lakes. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e But EPA's awareness of the forest road sedimentation problem does not lead to the conclusion that the Phase II rulemaking runs counter to record evidence, when the evidence in question is only tangentially relevant to the Phase II regulatory agenda.\n\nIn accordance with its instructions from Congress, EPA based its decision about which sources to designate on the available evidence related to municipal and industrial sources of stormwater discharges. The Petitioners have offered no evidence, either in this appeal or during the long Phase II rulemaking process, that forest roads should be considered municipal or industrial enterprises. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Thus, available evidence about forest roads was irrelevant to this rulemaking, and cannot serve as a basis for asserting that EPA acted capriciously or arbitrarily.\n\nD. AF\u0026PA's Standing\n\nThe American Forestry \u0026 Paper Association (AF\u0026PA), a national trade association representing the forest, pulp, paperboard, and wood products industry, is one of the two Industry Petitioners asserting the remaining claims. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Before considering these challenges, however, we consider whether AF\u0026PA has standing to raise them.\n\nEPA argues that AF\u0026PA lacks standing because it cannot show that it represents entities that suffer a cognizable injury under the Phase II Rule as promulgated. EPA argues that the interests of AF\u0026PA entities might have supported standing had EPA decided to regulate forest roads as Phase II stormwater dischargers, but since EPA declined to do so, none of AF\u0026PA's members are currently subject to the Rule. AF\u0026PA contends that its members have a cognizable legal interest in the Rule because they risk becoming subject to regulation at any future time under the continuing designation authority.\n\nWe agree that AF\u0026PA lacks standing. A claimant meeting Article III standing requirements must show that \"(1) it has suffered an 'injury in fact'. . .; (2) the injury is fairly traceable to the challenged action of the defendant; and (3) it is likely, as opposed to merely speculative, that the injury will be redressed by a favorable decision.\" Friends of the Earth v. Laidlaw Envtl. Serv. (TOC), 528 U.S. 167, 180-81 (2000). Standing requires an injury that is \"actual or imminent, not 'conjectural or hypothetical.' \" Lujan v. Defenders of Wildlife, 504 U.S. 555, 560 (1992). AF\u0026PA's interest in avoiding future regulation of forest roads is not actually or imminently threatened by any potential result in this case. No ripe claim about misuse of the residual authority to regulate forest road discharge, or any other kind of discharge, is before the court. Should members of AF\u0026PA become subject to Phase II regulation through subsequent administrative action, it will have standing to challenge those actions at that time. In the meanwhile, we proceed to the merits of the remaining claims on behalf of AF\u0026PA's co-petitioner, the National Association of Home Builders, which has established its standing to raise them.\n\nE. Consultation with State and Local Officials\n\nThe Industry Petitioners contend that EPA failed to consult with the states on the Phase II Rule as required by § 402(p)(5), which instructs EPA to conduct studies \"in consultation with the States,\" and § 402(p)(6), which instructs the Administrator to issue regulations based on these studies \"in consultation with State and local officials.\" 33 U.S.C. §§ 1342(p)(5)-(6). We conclude that EPA satisfied its statutory duty of consultation. See Marsh, 490 U.S. at 378.\n\nPetitioners concede several instances in which EPA circulated drafts of the Phase II Rule to state and local authorities, but argue that these consultations were meaningless because (1) the reports were circulated too far in advance of the actual rulemaking, (2) the rulemaking wrongfully proceeded based on other sources of input, (3) standard APA notice and comment procedures could not suffice because Congress must have intended something more when it added the consultation requirements to the language of § 402, and (4) consultation at the final stage of rulemaking was inadequate because comment was sought on the final report only after it had been submitted to Congress and the Phase II Rule had been promulgated. Petitioners provide examples of state feedback that allegedly went unheeded by EPA in its promulgation of the final Rule.\n\nEPA maintains that it consulted extensively with states and localities in developing the Phase II Rule, discharging its obligations under §§ 402(p)(5) \u0026 (6). EPA contends that the comments Petitioners cite as unheeded by EPA demonstrate that EPA did consult with states concerning the Rule, even if some states did not concur in EPA's ultimate conclusion, and that the final rule adopted a good measure of the flexibility sought by state representatives. EPA argues that Industry Petitioners cannot complain that consultation was inadequate simply because it did not result in the adoption of Petitioners' preferred views.\n\nEPA also disputes Petitioners' allegation that while EPA did comply with the terms of the 1999 Appropriations Act (requiring EPA to defend the proposed Phase II Rule before Congress and then publish the final report for public comment), it demonstrated its failure to adequately consult by publishing the report for public comment after the Phase II Rule had been formally promulgated, rendering any subsequent public comment meaningless. EPA counters that these actions do not indicate that it failed to satisfy Congress's directive that it consult with state and local officials, because EPA had engaged in extensive consultation before Congress requested the Appropriations Act report, and Congress did not require further consultation when it conditioned promulgation of the Rule only on the submission of this final report. EPA claims that while Congress required it to publish the report after its submission, public comment on the report was not required before promulgation, and that the statutory deadline structure rendered any other interpretation impossible.\n\nWe conclude that the overall record indicates EPA met its statutory duty of consultation. A draft of the first report was circulated to states, EPA regional offices, the Association of State and Interstate Water Pollution Control Administrators (\"ASIWPCA\"), and other stakeholders in November of 1993, and was revised based on comments received. EPA established the Urban Wet Weather Flows Federal Advisory Committee (\"FACA Committee\"), balancing membership between EPA's various outside stakeholder interests, including representatives from states, municipalities, Tribes, commercial and industrial sectors, agriculture, and environmental and public interest groups. 64 Fed. Reg. 68,724. The 32 members of the Phase II FACA Subcommittee, reflecting the same balance of interests, met fourteen times over three years and state and municipal representatives provided substantial input regarding the draft reports, the ultimate Phase II Rule, and the supporting data. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Id. EPA instituted the Phase II Subcommittee meetings in addition to the standard APA notice and comment procedures, which EPA also followed.\n\nThe fact that the Rule did not conform to Petitioners' hopes and expectations does not bear on whether EPA adequately consulted state and local officials. Although required to consult with states and localities, EPA was free to chart the substantive course it saw fit. EPA was not required to consult with states on the Appropriations Act report. Even if EPA should have sought further comment at that late stage, failure to do so does not outweigh the evidence demonstrating extensive consultation and cooperation with local authorities on development of the Rule.\n\nF. Designation of Certain Small MS4s and Construction Sites\n\nThe Industry Petitioners contend that, in designating certain small MS4s and construction sites for regulation under the Phase II Rule, EPA failed to adhere to the statutorily required regulatory basis and misinterpreted record evidence. We disagree.\n\n1. Regulatory Basis\n\nThe Industry Petitioners and the Municipal Petitioners contend that EPA violated the statutory command to base the Phase II regulations on § 402(p)(5) studies. We review EPA's interpretation of its statutory authority under the Chevron standard, 467 U.S. at 842-44, and affirm.\n\nPetitioners argue that the studies mandated by § 402(p)(5) were intended to provide the sole substantive basis for the \"comprehensive program\" envisioned in § 402(p)(6), but that EPA also (and thus improperly) based its designation of small MS4s and construction sites on (1) public comment received in the aftermath of judicial invalidation of the scope of construction sites regulated by the Phase I Rule, \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e and (2) additional research discussed in the Preamble to the Phase II Rule. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nEPA contends that the statute did not require it to base its designations exclusively on the § 402(p)(5) studies, and that it was in fact required to take account of information from other sources in promulgating the regulations. It argues that it based the Phase II Rule on conclusions reported in the § 402(p)(5) studies, but then appropriately supported these results with data described in the additional study requested by Congress in the Appropriations Act, comments submitted during the statutorily required notice-and-comment process, and other available information. To read the authorizing statute as limiting reliance to the § 402(p)(5) studies, EPA claims, would preclude it from relying on recommendations received through the separate, post-study requirement to \"consult with State and local officials\" under § 402(p)(6), and through the notice and comment process mandated by the APA, 5 U.S.C. § 553(b).\n\nRespondent-intervenor NRDC adds that the Phase II Rule is consistent with the § 402(p)(5) studies reported in 1995, and moreover, that the Industry Petitioners lack standing to raise the \"regulatory basis\" claim because they cannot show the requisite injury. See Friends of the Earth, 528 U.S. at 18081.\n\na. Standing.\n\nIndustry Petitioners \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e contend that they have suffered injury in fact, because their members are now either automatically regulated by the permitting requirements or subject to future regulation (under the residual authority, discussed below) that otherwise would not have been authorized, and that this is a direct result of EPA's failure to adhere to the framework of the 1995 Report, which allegedly would have precluded these aspects of the Rule. NRDC contends that the Industry Petitioners lack standing because they cannot show that being subject to NPDES permitting is the causal result of the procedural injury they urge, and because they cannot base standing on hypothetical injury that may arise in the future.\n\nNRDC argues that the injuries Petitioners allege are not consistent with the guidelines laid out in Friends of the Earth. 528 U.S. at 180-81. It insists that Petitioners' only possible claims of injury from the alleged \"regulatory basis\" violation are purported harm to members caused by the final Phase II Rule itself or harm to members caused by EPA's alleged failure to provide adequate notice of future regulatory requirements in the 1995 Report. However, NRDC contends that Petitioners have not suffered the requisite injury, because they had actual notice that EPA might regulate small construction sites, 63 Fed. Reg. at 1583, and they can show no chain of causation linking their alleged injury from the Rule itself to the actions challenged here.\n\nNRDC's causation argument is complex. Although the Petitioners purport to challenge EPA's failure to follow all of the 1995 Report's recommendations in the final Phase II Rule, NRDC contends, they are really challenging the subsequent proceedings through which EPA developed the final Rule. Even if there were some unlawful variance between the 1995 report and final rule, NRDC continues, the cause of that variance would have been some failure to abide by rulemaking standards during administrative proceedings that produced the text of the final Rule--not EPA's attention to sources of input other than the 1995 Report. NRDC maintains that these intervening acts of rulemaking (e.g., Phase II Subcommittee activities and the notice-and-comment process) break the requisite chain of causation between EPA's alleged failure to adhere to recommendations in the 1995 report and the flaws Petitioners allege in the Phase II Rule, which NRDC claims would have been due to \"purportedly unlawful EPA decisions on the merits during the subsequent administrative proceedings.\" See Northside Sanitary Landfill v. Thomas, 804 F.2d 371, 381-84 (7th Cir. 1986) (finding no standing to challenge EPA statements concerning the fate of a hazardous waste facility when subsequent state administrative acts, not EPA comments, would determine the facility's actual fate.)\n\nWe note that NRDC's standing arguments apply equally to the Municipal Petitioners, who can also assert only the harms resulting to members from the Rule itself or from a lack of notice, and that we are thus not only considering the standing of the Industry Petitioners but also that of the Municipal Petitioners to raise the \"regulatory basis\" claim. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e That established, we find standing for both.\n\nNRDC essentially argues that petitioners lack standing because (1) they cannot show that being subject to NPDES permitting is the causal result of the procedural injury they urge, (2) they cannot claim any actual notice injury from the alleged procedural wrong because notice was actually given, and (3) they cannot claim standing based on hypothetical injury that may (or may not) arise from future regulation under the residual authority. We can readily agree with the latter two contentions. As discussed above, the \"actual injury\" requirement of Article III standing precludes judicial consideration of exactly the kind of hypothetical harm the Industry Petitioners allege may follow from use of Phase II authority for future designations of regional sources. Friends of the Earth, 528 U.S. at 180-81. If future Phase II designations cause identifiable injury to Petitioners, they will then be free to pursue that ripe claim. And because EPA clearly issued notice to all regulated parties that they may be subject to regulation under the proposed rule, 63 Fed. Reg. at 1568 (MS4s) and 1582 (construction), petitioners cannot show injury from lack of actual notice.\n\nHowever, NRDC's causation argument is less persuasive. NRDC correctly argues that the petitioners cannot establish a definite chain of causation between the EPA's alleged failure to limit their regulatory basis to the § 402(p)(5) studies and the fact that they now must obtain permits. But this will almost always be true of petitions challenging an agency's failure to abide by statutory procedural requirements. Because all administrative decision making following an alleged procedural irregularity could always be considered an intervening factor breaking the chain of causation, NRDC's interpretation of the requisite chain of causation would dubiously shield administrative decisions from procedural review.\n\nFor this reason, we have held that the failure of an administrative agency to comply with procedural requirements in itself establishes sufficient injury to confer standing, even though the administrative result might have been the same had proper procedure been followed. City of Davis v. Coleman, 521 F.2d 661, 671 (9th Cir. 1975) (agency's failure to comply with National Environmental Policy Act's procedural requirements constituted injury sufficient to support standing of a geographically related plaintiff regardless of potentially similar regulatory outcome). In City of Davis, we noted that the standing inquiry represents \"a broad test, but because the nature and scope of environmental consequences are often highly uncertain before study we think it an appropriate test.\" Id. A plaintiff who shows that a causal relation is \"probable\" has standing, even if the chain cannot be definitively established. Johnson v. Stuart, 702 F.2d 193, 195-96 (9th Cir. 1983) (school students and their parents had standing to challenge a statute that limited the texts that might be selected for teaching, even though it could not be shown whether any specific book had been rejected under this statute or for other reasons).\n\nThe Supreme Court has also acknowledged that standing may be established by harm resulting indirectly from the challenged acts, Warth v. Seldin, 422 U.S. 490, 504-05 (1975), and that causation may be established if the plaintiff shows a good probability that, absent the challenged action, the alleged harm would not have occurred, Arlington Heights v. Metro. Hous. Dev. Corp., 429 U.S. 252, 262-64 (1977).\n\nThus, although the petitioners cannot show with certainty that the alleged \"regulatory basis\" violation caused them to be wrongfully subjected to Phase II permitting requirements, we hold that they have alleged a procedural injury sufficient to support their standing to bring the claim.\n\nb. Merits.\n\nAlthough we resolve the standing issue in favor of the petitioners, we nevertheless affirm the Rule against their claim that EPA violated procedural constraints implied by the authorizing statute, § 402(p)(6).\n\nCongress intended EPA to use all sources of information in developing a comprehensive program to protect water quality to the maximum extent practicable. The statute unambiguously required EPA to base its regulations both on the § 402(p)(5) studies and on consultation with State and local officials. Congress enacted § 402 with full knowledge that EPA would also be required to take account of public comments during the notice and comment phase of administrative rulemaking prescribed by the APA. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\n2. MS4s in Urbanized Areas\n\nThe Municipal Petitioners contend that the designation of small MS4s for Phase II regulation according to CensusBureau defined areas of population density (\"urbanized areas\") is arbitrary and capricious. They argue that EPA has not established that the Census Bureau's designation of urbanized areas is correlated with actual levels of pollution runoff in stormwater, and that EPA adopted the designations simply for administrative convenience. We affirm, because the record reflects a reasoned basis for EPA's decision. See Marsh, 490 U.S. at 378.\n\nConceding that the Preamble cites studies purporting to establish \"a high correlation between the degree of development/urbanization and adverse impacts on receiving waters due to stormwater,\" 64 Fed. Reg. at 68,751, the Municipal Petitioners nevertheless contend that the record contains no \"demonstrably correlated, quantified basis on which EPA may reasonably have concluded that any particular population, or any population density, per se establishes that all urban areas having that same characteristic in gross are necessarily appropriate for inclusion as Phase II sources.\" Pointing to Leather Indus. of Am. v. EPA, 40 F.3d 392, 401 (D.C. Cir. 1994) (rejecting as arbitrary EPA's regulation of pollutant levels in the absence of data supporting a relationship between the caps and level of risk), Petitioners argue that EPA simply assumed the relationship Congress contemplated it would establish by the § 402(p)(5) studies.\n\nEPA responds that it extensively documented the relationship between urbanization and harmful water quality impacts from stormwater runoff, pointing to its findings that the degree of surface imperviousness in an area directly corresponds to the degree of harmful downstream pollution from stormwater runoff, 64 Fed. Reg. at 68,724-27, and that it articulated a rational connection between these record facts and its decision to designate small MS4s serving areas of high population density (\"urbanized areas\") to protect water quality.\n\nWe treat EPA's decision with great deference because we are reviewing the agency's technical analysis and judgments, based on an evaluation of complex scientific data within the agency's technical expertise. See Baltimore Gas \u0026 Elec. Co. v. NRDC, 462 U.S. 87, 103 (1983); see also Chem. Mfrs. Ass'n v. EPA, 919 F.2d 158, 167 (D.C. Cir. 1990) (\"It is not the role of courts to 'second-guess the scientific judgments of the EPA' \"). We conclude that the record supports EPA's choice.\n\nThe statute simply called upon EPA to \"designate stormwater discharges,\" other than those designated in Phase I, \"to be regulated to protect water quality.\" 33 U.S.C. § 1342(p)(6). EPA did so, based on record evidence showing a compelling and widespread correlation between urban stormwater runoff and deleterious impacts on water quality. Petitioners' assertion that EPA failed to establish a \"quantified\" basis for its designation is inapposite. The statute did not require EPA to establish with pinpoint precision a numeric population threshold within urbanized areas that would justify regulation under Phase II. In areas implicating technical expertise and judgment, courts do not require \"perfect stud[ies]\" or data. Sierra Club, 167 F.3d at 662. EPA satisfied the Leather Industries standard by adopting a threshold consistent with the criteria of \"protecting water quality,\" and did not assume, but instead sufficiently documented, the relationship between urbanization and harmful stormwater discharge.\n\n3. Small Construction Sites\n\nIndustry and Municipal Petitioners also argue that EPA's decision to regulate under Phase II all construction sites disturbing between one and five acres of land (\"small construction sites\") is arbitrary and unsupported by the record. We do not agree. See Marsh, 490 U.S. at 378.\n\na. Record Evidence.\n\nMunicipal Petitioners claim that EPA arrived at the one-acre standard based not on factual findings in the record but instead as a reaction to the earlier Ninth Circuit remand of the Phase I five-acre designation. They allege that the one-acre standard is no more based on supporting data than the rejected five-acre standard, and is thus quantitatively arbitrary.\n\nIndustry Petitioners argue that EPA's findings do not support regulation of all small construction sites, but indicate only that small construction sites, taken cumulatively, may cause effects similar to large sites in a given area. They contend that EPA's conclusion that adverse effects are possible under certain circumstances cannot support categorical designation of all small construction sites nationwide, and that the Rule is arbitrary because (1) it is based on an analysis that fails to take account of the frequency of negative impacts, (2) it fails to take account of acknowledged factors that determine whether small construction activities cumulatively cause harm (such as the degree of development in a watershed at any given time), and (3) EPA has acknowledged that the actual water quality impact of construction sites of all sizes varies widely from area to area depending on climatological, geological, geographical, and hydrological influences. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nIndustry Petitioners further contend that the record does not support the designation of small sites, because almost all of the technical papers EPA relied on focused on larger sites or failed to take account of size, \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e and because the lack of an adequate factual basis for nationwide regulation of small sites makes the Phase II Rule arbitrary and capricious. Am. Petroleum Inst. v. EPA, 216 F.3d 50, 58 (D.C. Cir. 2000) (invalidating a solid waste rule because EPA \"failed to provide a rational explanation for its decision\" declining to exclude oilbearing waste waters from the statutory definition of solid waste).\n\nEPA maintains that construction sites regulated under the Phase II Rule degrade water quality across the United States and that the administrative record unambiguously documents that harm. EPA disputes Petitioners' assertion that it failed to establish the need to regulate small sites nationwide, but also contends that it is not required to base every administrative decision on a precise quantitative analysis. See Sierra Club, 167 F.3d at 662 (\"EPA typically has wide latitude in determining the extent of data-gathering necessary to solve a problem\").\n\nEPA also disputes petitioners' assertions that data from studies involving larger construction sites are irrelevant to the Phase II Rule. EPA explains that discharges of sediment due to erosion are the result of the interaction of several factors including soils, slope, precipitation, and vegetation:\n\nFor construction sites that are one acre or more, none of the environmental factors contributing to sediment discharges is dependent on the size of the site disturbed. A one-acre site can have the same combination of soils, slope, degree of disturbance and precipitation as a 100-acre site, and consequently can lose soil at the same rate . . . and discharge sediments in the same concentrations . . . as a 100-acre site.\n\nEPA contends that it is thus reasonable to extrapolate data about small sites from studies of larger ones--and that such an extrapolation may even be forgiving, since small sites are currently less likely to have effective erosion and sedimentation control plans. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\n\nIndeed, EPA argues that although adverse water quality impacts of small construction sites have been widely recognized, effective local erosion and sedimentation control programs have not been adopted in many areas. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Though not all watersheds are currently adversely affected by small construction sites, \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e EPA notes that the Phase II Rule acts \"to protect water quality\" both remedially and preventively, and argues that it need not quantify the cumulative effects of discharges from these sites or identify all watersheds that are currently harmed before acting to limit pollution from small sites. \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\n\nWe reverse under the arbitrary and capricious standard only if the agency has relied on factors Congress did not intend it to consider, entirely failed to consider an important aspect of the problem, offered an explanation for its decision contrary to the evidence before the agency, or is so implausible that it could not be ascribed to a difference in view or the product of agency expertise. Motor Vehicle Mfrs. Ass'n, 463 U.S. at 43. Petitioners' contention that EPA relied on factors Congress did not intend it to consider was rejected in our earlier discussion of the regulatory basis challenge. They submit no evidence that EPA failed to consider an important aspect of the problem. We cannot say that EPA's designation of small construction sites is implausible (especially given the support of twenty-some-odd studies of sedimentation from construction sites that EPA reviewed in promulgating the challenged regulations, 64 Fed. Reg. 68,728-31). We could remand this aspect of the Rule only if, as the petitioners urge, EPA's explanation for its decision to regulate small construction sites were contrary to the record evidence, and it is not.\n\nPetitioners' primary contention is that evidence in the record suggests it is not possible to provide an explicit, quantitative link between small construction sites and an adverse effect on water quality. But even if this were so, EPA's decision to regulate preventively small construction sites \"to protect water quality\" is not inconsistent with the record. Petitioners contend that EPA's reliance on data from studies of large construction sites is insufficient to support EPA's designation of small sites, but EPA has adequately supported its contention that experts can reasonably extrapolate projected water quality impacts from large to small sites. We apply the substantial evidence standard when reviewing the factual findings of an agency, Dickinson v. Zurko, 527 U.S. 150, 156-58 (1999), \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e and find it satisfied here.\n\nMoreover, EPA is not required to conduct the \"perfect study.\" Sierra Club, 167 F.3d at 662. We defer to an agency decision not to invest the resources necessary to conduct the perfect study, and we defer to a decision to use available data unless there is no rational relationship between the means EPA uses to account for any imperfections in its data and the situation to which those means are applied. Id.; Am. Iron \u0026 Steel Inst. v. EPA, 115 F.3d 979, 1004 (D.C. Cir. 1997). The record indicates a reasoned basis for EPA's decision that regulating small construction sites was necessary \"to protect water quality\" as required by § 402(p)(6).\n\nb. Waivers.\n\nIndustry Petitioners further contend that EPA's allowance of regulatory waivers for small construction sites not likely to cause adverse water quality impacts inappropriately supplements the permitting regulations.\n\nPetitioners argue that EPA has the burden of establishing a comprehensive program to control sources as necessary to protect water quality, and that shifting the burden to individual contractors, businesses, and homeowners to prove they do not harm water quality falls short of meeting this statutory obligation. Citing National Mining Ass'n v. Babbitt, 172 F.3d 906, 910 (D.C. Cir. 1999), they argue that EPA's rebuttable regulatory presumption of water quality impact from small construction activity is unreasonable because the agency has established no scientific likelihood that any given small site will affect water quality. EPA defends the waiver approach as fair and efficient, and argues that the Industrial Petitioners are confusing arguments about the limits of presumptions in evidentiary hearings conducted under the APA. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nEPA is correct; the Phase II Rule creates no presumption applicable to an evidentiary hearing, and a regulation creating exemptions by waiver is reviewed under the familiar arbitrary and capricious standard. The use of waivers to allow permit exemptions for small sites unlikely to cause adverse impacts is reasonable under that standard.\n\nc. Consistency.\n\nIndustry Petitioners also argue that EPA's decision to regulate all small construction sites under the Phase II Rule is arbitrary and capricious because EPA applied a different standard in regulating small construction projects than it applied to other potential sources of stormwater runoff subject to Phase II regulation.\n\nPetitioners contend that EPA decided not to designate other potential sources identified in the § 402(p)(5) studies because it determined that there are not \"sufficient data . . . available at this time on which to make a determination of potential adverse water quality impacts for the category of sources.\" 64 Fed. Reg. at 68,780. Petitioners contend this standard should have been applied to small construction sites as well, but EPA opted to regulate these sources despite an alleged lack of coherent data on small site impacts as a general category.\n\nEPA counters, once again, that it did have adequate data to regulate small construction sites. It contends that construction sites of all sizes have greater erosion rates than almost any other land use, and thus are not similarly situated to the potential polluters that EPA chose not to regulate at this time. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e These sources include secondary industrial activities (for example, maintenance of construction equipment or local trucking for an unregulated facility such as a grocery store) and other unregulated commercial activities (for example, car and truck rental facilities). 64 Fed. Reg. at 68,779. EPA reports that it decided not to categorically regulate these potential sources based both on available data about water quality impacts and on the extent to which potentially adverse water quality impacts are mitigated by existing regulations to which these sources are already subject. Id. at 68,780.\n\nWe find no error. See Marsh, 490 U.S. at 378. EPA acted reasonably in designating all small construction sites for Phase II regulation, and Industry Petitioners point to no record evidence that the nature of pollutant contributions from small construction site discharge is sufficiently similar to pollutants from the non-regulated sources to support the analogy they seek to draw. New Orleans Channel 20 v. FCC, 830 F.2d 361, 366 (D.C. Cir. 1987) (an agency does not act irrationally when it treats parties differently, unless the parties are similarly situated). Sufficient evidence supports EPA's conclusion that small construction sites are not similar enough to these \"other sources\" to support petitioner's challenge.\n\nG. Continuing (\"Residual\") Designation Authority\n\nThe Industry Petitioners argue that EPA acted improperly in retaining authority to designate future sources of stormwater pollution for Phase II regulation as needed to protect federal waters. We disagree.\n\nThe Phase II Rule preserves authority for EPA and authorized states to designate currently unregulated stormwater dischargers as requiring permits under the Rule if future circumstances indicate that they warrant regulation \"to protect water quality\" under the terms of § 402(p)(6). 40 C.F.R. § 122.26(a)(9). In the Phase II Preamble, EPA explains this aspect of the Rule:\n\nUnder today's rule, EPA and authorized States continue to exercise the authority to designate remaining unregulated discharges composed entirely of stormwater for regulation on a case-by-case basis . . . . Individual sources are subject to regulation if EPA or the State, as the case may be, determines that the stormwater discharge from the source contributes to a violation of a water quality standard or is a significant contributor of pollutants to waters of the United States. This standard is based on the text of section CWA 402(p). In today's rule, EPA believes, as Congress did in drafting section CWA 402(p)(2)(E), that individual instances of stormwater discharge might warrant special regulatory attention, but do not fall neatly into a discrete, predetermined category. Today's rule preserves the regulatory authority to subsequently address a source (or category of sources) of stormwater discharges of concern on a localized or regional basis. 64 Fed. Reg. 68,781.\n\nThe text of the Rule requires a discharger to obtain a permit if the NPDES permit authority determines that \"stormwater controls are needed for the discharge based on wasteload allocations that are part of 'total maximum daily loads' (TMDLs \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e ) that address the pollutant(s) of concern\" or that \"the discharge, or category of discharges within a geographic area, contributes to a violation of a water quality standard or is a significant contributor of pollutants to waters of the United States.\" 40 C.F.R. §§ 122.26(a)(9)(i)(C)-(D).\n\n1. Statutory Authority\n\nThe Industry Petitioners contend that this \"residual\" designation authority, which would allow a NPDES permitting authority to require at any future time a permit from any stormwater discharge not already regulated, is ultra vires. Although they concede that Congress authorized case-by-case designation in § 402(p)(2)(E), \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e they argue that this authority attached only during the permitting moratorium that ended in 1994, prior to the Phase II rulemaking. They object that EPA has impermissibly designated a category of \"not yet identified\" sources and preserved authority to regulate them on a case-by-case basis indefinitely into the future. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nPetitioners contend that § 402(p)(6) \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e cannot rescue the residual authority because it does not authorize case-by-case identification of discharges to be regulated, and that Congress, had it intended otherwise, would have included language in § 402(p)(6) similar to the case-by-case authority explicitly granted in § 402(p)(2)(E). \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e They also contend that continuing authority to designate sources based on waste load allocations that are part of TMDLs exceeds the scope of authority in § 402(p)(2), which nowhere mentions TMDLs. Finally, they argue that the categorical designation authorized by § 402(p)(6) is only permissible when based on the § 402(p)(5) studies and carried out in consultation with state and local authorities, but that the Rule allows future designations based on agency discretion unaccompanied by adequate demonstration that the source itself is a significant threat to water quality.\n\nEPA counters that § 402(p)(6) authorized the designation, made on the basis of statutorily required sources of input and in consultation with the states, of a third class of discharges to be identified on location-specific bases by the NPDES permitting authority. EPA contends that Petitioners mistake the source of its authority for continuing designations as arising only from § 402(p)(2), discounting the full scope of its authority under § 402(p)(6). EPA argues that it permissibly interpreted § 402(p)(6) as allowing the residual designation authority because its language does not expressly preclude it, and because such authority is consistent with (and arguably required by) that section's mandate to establish a \"comprehensive program\" to protect water quality from adverse stormwater discharges. EPA maintains that the structure of § 402(p) reflects \"Congress' intent to assure regulation of all problematic stormwater discharges as expeditiously as reasonably possible--not to limit EPA to a one-time-only opportunity to designate discharges for regulation.\"\n\nWe review EPA's interpretation of the statute it administers with deference, Royal Foods Co., 252 F.3d at 1106, and affirm this aspect of the Phase II Rule as a legitimate exercise of regulatory authority conferred by § 402(p). The residual designation authority is grounded both on § 402(p)(6), which broadly authorizes a comprehensive program to protect water quality, and on § 402(p)(2)(5), which authorizes case-by-case designation of certain polluters and categories of polluters.\n\nWhile not a blank check, § 402(p)(6) authorizes a comprehensive program that allows regional designation of polluting discharges that compromise water quality locally, even if they have not been established as compromising water quality nationally at the time Phase II was promulgated. In allowing continuing designation authority, EPA permissibly designated a third category of dischargers subject to Phase II regulation --those established locally as polluting U.S. waters-- following all required studies and consultation with state and local officials. EPA reasonably determined that discharges other than those from small MS4s and construction sites were likely to require regulation \"to protect water quality\" in satisfaction of the § 402(p)(6) mandate. EPA reasonably determined that, although it lacked sufficient data to support nationwide, categorical designation of these sources, particularized data might support their designations on a more localized basis. EPA reasonably interpreted § 402(p)(6) as authorizing regional designation of sources and regional source categories, based on water quality standards including TMDLs.\n\nPetitioners' § 402(p)(2)(5) argument (that EPA could not draw support for the residual designation authority from § 402(p)(2)(5) because such authority expired in 1994) is contradicted by the plain language of the statute. Respondentintervenor NRDC correctly notes that § 402(p)(1) sets forth a permitting moratorium for stormwater discharges prior to 1994, and that § 402(p)(2) exempts certain categories of sources from that permitting moratorium, including those to be regulated on a case-by-case basis under § 402(p)(2)(5). Specifically, the statute provides that the 1994 date \"shall not apply\" to the five categories of discharges listed in § 402(p)(2). The termination of a moratorium that \"shall not apply\" to the continuing designation authority under § 402(p)(2)(5) cannot rescind EPA's authority to regulate sources in that category. Nothing in § 402(p) suggests that authority to designate these sources ends at any time, and EPA remains free to designate § 402(p)(2)(E) dischargers.\n\nFinally, although Petitioners may be legitimately concerned that a permitting authority may designate a source without adequately establishing its eligibility, this issue must be addressed in the context of an actual case or controversy. Whether a NPDES authority may impose permitting requirements on a discharger without an adequate finding of polluting activity is not yet ripe for judicial review. Thomas v. Anchorage Equal Rights Comm'n, 220 F.3d 1134, 1141 (9th Cir. 2000) (\"A concrete factual situation is necessary to delineate the boundaries of what conduct the government may or may not regulate.\").\n\n2. Non-delegation Doctrine\n\nIndustry Petitioners contend that EPA's interpretation of § 402(p) to allow the residual designation authority must be rejected because it would render the statute unconstitutional under the non-delegation doctrine. We deny petitioners' claim, both because it is not properly raised and because it rests on an interpretation explicitly overturned by the United States Supreme Court.\n\nPetitioners base their contention on American Trucking Ass'ns v. EPA, 175 F.3d 1027, 1034 (D.C. Cir. 1999), \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e in which the D.C. Circuit remanded a regulation under the non-delegation doctrine because, although EPA had applied reasonable factors in establishing the air quality standards in question, the agency had articulated no \"intelligible principle\" to channel its application of these factors. Id. Petitioners argue that if § 402(p) authorizes a NPDES permitting authority to require Phase II permitting of any stormwater source deemed to be a \"significant contributor\" of pollutants to U.S. waters, then that grant of authority likewise constitutes an unconstitutional delegation of legislative authority because--as did the American Trucking delegation--it \"leaves [EPA] free to pick any point\" at which a regulatory burden will attach. Id. at 1037.\n\nHowever, in reversing American Trucking, the Supreme Court rejected the notion that an agency has the power to interpret a statute so as to either save it from being, or transform it into, an unconstitutional delegation. Whitman v. Am. Trucking Ass'ns, 531 U.S. 457, 473 (2000). Whether a statute delegates legislative power \"is a question for the courts, and an agency's [interpretation] has no bearing upon the answer.\" Id. Petitioner's argument to the contrary rests on the very reasoning in American Trucking that was overturned in Whitman. The relevant question is not whether EPA's interpretation is unconstitutional, but whether the statute itself is unconstitutional--a challenge Industry Petitioners do not raise.\n\nBut even if the challenge were properly raised, § 402(p) would, like the Clean Air Act standard-setting provision at issue in Whitman, survive constitutional review. The Supreme Court has upheld against non-delegation attacks many similar statutes establishing nonquantitative standards. Am. Power \u0026 Light Co. v. SEC, 329 U.S. 90, 104 (1946) (upholding statute giving SEC authority to modify corporate structures so that they are not \"unduly or unnecessarily complicate[d]\" and do not \"unfairly or inequitably distribute voting power among security holders\"); Yakus v. United States, 321 U.S. 414, 419420, 423-27 (1944) (upholding statute giving agency power to set prices that \"will be generally fair and equitable\"). In Yakus, the Court held that a statutory command to \"effectuate the purposes\" of the overall statutory scheme withstood scrutiny. Id. Section 402(p)(6)'s directive \"to protect water quality\" summarizes the central purpose of the Clean Water Act \"to restore and maintain the chemical, physical, and biological integrity of the Nation's waters,\" 33 U.S.C. § 1251(a). It establishes a determinate criterion of the kind the Supreme Court upheld in Yakus and American Power \u0026 Light.\n\n3. Notice and Comment\n\nIndustry Petitioners also contend that, to the extent it allows the designation of entire categories of sources, rather than individual sources, the residual designation authority violates the APA, 5 U.S.C. § 553(b)(3), because EPA did not provide public notice that it was considering such a rule. Ober v. EPA, 84 F.3d 304, 315 (9th Cir. 1996) (invalidating EPA rule where it deviated from proposal); Shell Oil Co. v. EPA, 950 F.2d 741, 746-47 (D.C. Cir. 1991). Petitioners contend that while the proposed rule would have allowed case-by-case designation where an authority \"determines that the discharge contributes to a violation,\" 63 Fed. Reg. at 1635 (proposing 40 C.F.R. § 122.26(a)(9)(i)(D)), the final rule authorizes caseby-case designation where \"the discharge, or category of discharges within a geographic area, contributes to a violation,\" 40 C.F.R. § 122.26(a)(9)(i)(D).\n\nEPA notes that it had proposed to promulgate continuing designation authority in some form, and points to elements in the proposed rule that explicitly envision the categorical designation of sources at the local/watershed level. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\nAccording to the \"logical outgrowth\" standard, a final regulation must be \"in character with the original proposal and a logical outgrowth of the notice and comments.\" Hodge, 107 F.3d at 712. EPA emphasized that it was considering continuing designations based on watershed data rather than designating these sources on a national basis, and invited comment regarding this proposal. 63 Fed. Reg. at 1536. This supports the necessary relationship between the proposed and final rule.\n\nH. Regulatory Flexibility Act\n\nThe Industry Petitioners contend that the Phase II Rule will impose substantial compliance costs on their members and other small entities, but that EPA failed to conduct the analysis required by the Regulatory Flexibility Act (\"RFA\"), 5 U.S.C. §§ 601-11. They argue that EPA seeks to excuse its noncompliance by falsely certifying that the Rule does not have a significant impact on a substantial number of small entities. 64 Fed. Reg. at 68,800. We are not persuaded.\n\nThe RFA requires a federal agency to prepare a regulatory flexibility analysis and an assessment of the economic impact of a proposed rule on small business entities, 5 U.S.C. § 604, unless the agency certifies that the proposed rule will not have a \"significant economic impact on a substantial number of small entities\" and provides a factual basis for that certification, id. at § 605; N.W. Mining Ass'n v. Babbitt, 5 F. Supp. 2d. 9, 15-16 (D.D.C. 1998).\n\nEPA did certify that the Phase II Rule would not yield \"significant impacts,\" 64 Fed. Reg. at 68,800, but Petitioners contend this certification is erroneous because (1) EPA treats as \"not significant\" costs that are in fact significant, and (2) EPA failed to account for the entire universe of small entities affected (including small home construction contractors) and all significant costs to those entities. They urge that the failure to consider a significant segment of the affected small entity community requires invalidation of the Rule, citing North Carolina Fisheries Ass'n v. Daley, 27 F. Supp. 2d 650, 659 (E.D. Va. 1998) (certification failed to comply with RFA where agency ignored several categories of affected small entities), and Northwest Mining, 5 F. Supp. 2d at 15 (RFA was violated where improper definition of small entity excluded analysis of affected entities).\n\nEPA maintains that its certification was appropriate, and, moreover, that it has already voluntarily followed the additional RFA procedures that the Industry Petitioners now request. EPA argues that Petitioners have incorrectly specified the costs that the small entities they represent will bear, referring erroneously to EPA's total annual compliance costs estimates for all entities, rather than to costs estimated for small entities as defined under the RFA. EPA maintains that it did consider economic impacts on small home construction contractors who might be denied discharge permits, and that it evaluated the annual costs of Phase II compliance associated with any land disturbance between one and five acres. 64 Fed. Reg. at 68,800-01.\n\nRespondent-intervenor NRDC contends that Petitioners' reliance on measures of the aggregate impact of the Rule on small entities to determine compliance with the threshold test under the RFA fails as a matter of law because aggregate measures are not consistent with the statutory language setting out that test. NRDC notes that the plain language of § 605(b) sets out a three-component test indicating that EPA need not perform a regulatory flexibility analysis if it finds that the proposed rule will not have: (1) \"a significant economic impact\" on (2) \"a substantial number\" of (3) \"small entities.\" 5 U.S.C. § 605(b). NRDC contends that EPA satisfied the statutory test, and that Petitioners' interpretation, which rewrites the test to omit the \"substantial number\" component, is erroneous.\n\nWe believe NRDC correctly interprets the statute, Marsh, 490 U.S. at 378, and that EPA reasonably certified that the Phase II Rule would not have a significant economic impact in compliance with the Regulatory Flexibility Act. We also conclude that, even if EPA had failed to properly comply with the procedural requirements of the RFA, its actual assessment of the Rule's economic impacts renders any defective compliance harmless error. In granting relief under RFA § 611, a court may order an agency \"to take corrective action consistent with\" the RFA and APA, including remand to the agency, 5 U.S.C. § 611(a)(4)(A), but EPA has already conducted the economic analyses Petitioners seek when it convened the \"Small Business Advocacy Review Panel\" before publishing notice of the proposed rule. 64 Fed. Reg. at 68,801. That Panel evaluated the Rule and considered the comments of small entities on a number of issues, consistent with the procedures described in RFA § 603. Id. Appendix 5 of EPA's preamble to the proposed rule explained provisions that had been designed to minimize impacts on small entities, based on advice and recommendations from the Panel. 63 Fed. Reg. 1615, 64 Fed. Reg. 68,811. Modifications for small entities included alternative compliance and reporting mechanisms responsive to the resources of small entities, simplified procedures, performance rather than design standards, and waivers.\n\nAny hypothetical noncompliance would thus have been harmless, since the available remedy would simply require performance of the economic assessments that EPA actually made. Like the Notice and Comment process required in administrative rulemaking by the APA, the analyses required by RFA are essentially procedural hurdles; after considering the relevant impacts and alternatives, an administrative agency remains free to regulate as it sees fit. We affirm the Rule against this challenge. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\nIII. CONCLUSION\n\nWe conclude that the EPA's failure to require review of NOIs, which are the functional equivalents of permits under the Phase II General Permit option, and its failure to make NOIs available to the public or subject to public hearings contravene the express requirements of the Clean Water Act. We therefore remand these aspects of the Small MS4 General Permit option so that EPA may take appropriate action to comply with the Clean Water Act. We affirm all other aspects of the Phase II Rule against the statutory, administrative, and constitutional challenges raised in this action.\n\nPetitions for Review GRANTED IN PART and DENIED IN PART.\n\nTALLMAN, Circuit Judge, concurring in part and dissenting in part:\n\nI concur in some of the Court's conclusions, but I respectfully disagree with two significant sections of the majority's opinion. I cannot agree with Section II.A.2, which upholds the constitutionality of the Environmental Protection Agency's (\"EPA\") final administrative rule (the \"Phase II Rule\"), § 402(p) of the Clean Water Act, 33 U.S.C. § 1342(p), against the Municipal Petitioner's Tenth Amendment challenge. Because I believe that the Phase II Rule infringes upon state sovereignty by compelling the states to enact and administer a federal regulatory program that includes regulation of third parties, and that the Alternative Permit Option suffers from the same constitutional flaw, I respectfully dissent.\n\nI also dissent from Section II.B of the majority's opinion, which remands the Phase II Rule because its system of general permits is \"arbitrary and capricious.\" I believe EPA's design of a system of general permits supported by notices of intent was a reasonable exercise of EPA's administrative discretion.\n\nI.\n\nNo party disputes that the Phase II Rule is a federal regulatory scheme to be carried out by the states. At issue, however, is whether the states are being compelled to enact that scheme, whether the scheme requires the states to regulate third parties, and whether the Alternative Permit Option saves such regulation by creating a constitutionally sound alternative. The Court holds that the states are not compelled to regulate here because they have two choices: to stop municipal stormwater from discharging into federal waters, or to stop third parties from discharging into municipal stormwater systems. Majority Op. at 597-598, 602.\n\nThe states cannot choose to stop stormwater from entering federal waters, nor can they stop third parties or Mother Nature from discharging into municipal stormwater systems. To implement the scheme under the Phase II Rule, municipalities must regulate their citizens and businesses to ensure that the stormwater they discharge meets the pollutant standards of the Clean Water Act. The states are therefore being compelled to regulate third parties in furtherance of a federal regulatory scheme. The Alternative Permit Option is qualitatively indistinguishable.\n\nA.\n\nCongress has the power to regulate pollutants in navigable waters under Article I of the Constitution, and may lawfully delegate that regulatory function to EPA. The regulatory power of EPA, however, is limited by the Residual Powers Clause of the Tenth Amendment, which states that \"[t]he powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" U.S. CONST. amend. X. See United States v. Darby, 312 U.S. 100, 124 (1941) (acknowledging the extant truism \"that all is retained [by the states] which has not been surrendered\"). Thus, while the states retain a significant amount of power under the Tenth Amendment, where the constitutional line is drawn is unclear. We are therefore left with the arduous task of discerning the degree of sovereign authority reserved to the states.\n\nWe must examine United States Supreme Court case law to decide upon the appropriate division between state and federal spheres of power. The Supreme Court has made it clear that \"Congress has substantial powers to govern the Nation directly, including in areas of intimate concern to the States.\" New York v. United States, 505 U.S. 144, 162 (1992). Congress may not, however, require the states to enact or administer federal regulatory programs. See Printz v. United States, 521 U.S. 898, 925 (1997); FERC v. Mississippi, 456 U.S. 742, 762-65 (1982); Hodel v. Virginia Surface Mining \u0026 Reclamation Ass'n, Inc., 452 U.S. 264, 288 (1981). While EPA may directly regulate issues surrounding stormwater discharge, it may not compel the states to enact and enforce such regulation.\n\nThe federal government may persuade the states to adopt a regulatory scheme in a preempted field, but such persuasion must stop short of coercion. See South Dakota v. Dole, 483 U.S. 203, 211 (1987); New York, 505 U.S. at 176-77; Hodel, 452 U.S. at 288; Board of Natural Resources v. Brown, 992 F.2d 937, 947 (9th Cir. 1993). The fundamental distinction between persuasion and compulsion is whether the states have a choice to either participate and accept a federal regulatory scheme, or to not participate at all and allow the federal government itself to regulate. See Hodel, 452 U.S. at 288. The majority holds that the states have the choice of either adopting and enforcing the Phase II Rule or stopping municipal stormwater from discharging to federal waters by, for example, building wetlands or recycling stormwater. Majority Op. at 597-598. The majority asserts that because of this \"choice\" the Phase II Rule is not coercive, and is akin to the provision upheld by the Supreme Court in Hodel. Majority Op. at 594-595.\n\nContrary to the majority's conclusion, the \"choice\" not to discharge differs substantially from the choice the states faced in Hodel. In Hodel, the Supreme Court held that the states were not compelled \"in any manner whatsoever\" because if the states chose not to regulate, \"the full regulatory burden will be borne by the Federal Government.\" 452 U.S. at 288. EPA has included no such provision here, presumably because EPA does not have the resources to do the job alone. The states have been given only one option: regulating citizens in furtherance of a federal program. Thus, Hodel does not support the reasoning that the Phase II Rule is not coercive. To survive constitutional scrutiny under Hodel, EPA would need to offer the states the choice to adopt the Phase II Rule or to decline and allow EPA to regulate for itself.\n\nWhile the case at hand is clearly distinguishable from Hodel, it is strikingly analogous to our decision in Brown. The Phase II Rule bears a strong resemblance to the Forest Resources Conservation and Shortage Relief Act that we found to be coercive in Brown. The challenged legislation in Brown contained a provision that called for the states to issue regulations in accordance with an export ban on timber from federal lands. In Brown, we considered an argument much like that presented here: that Washington State was making a \"choice\" because it had the option to halt all sales of timber. Following the Supreme Court's decision in New York, we held that this was a Hobson's choice and that Congress did not have the authority to command such an option. Brown, 992 F.2d at 947. The \"choice\" being offered by EPA in this case is even more of a Hobson's choice than that in Brown or New York. Here, it is not that Congress lacks the power to command the alternative, but that the alternative cannot realistically be accomplished. As the states have no real choice but to adopt EPA's scheme, the Phase II Rule is unconstitutional.\n\nB.\n\nThe Phase II Rule also violates the Tenth Amendment by requiring the states to regulate third parties. As stated above, the federal government may not force the states to use their sovereign power to address federal issues. See Printz, 521 U.S. at 925, 935. Similarly, the federal government may not force the states to regulate third parties in furtherance of a federal program. See Reno v. Condon, 528 U.S. 141, 151 (2000) (upholding federal statutory scheme because it \"does not require the States in their sovereign capacity to regulate their own citizens\").\n\nThe majority concedes that the Construction Measure, 40 C.F.R. § 122.34(b)(4)(i)-(ii), requires an MS4 to \"enact and enforce a federal regulatory program,\" but contends that the other two contested Measures do not because the municipalities can block off the entry points to their stormwater system and avoid regulating the dischargers. Majority Op. at 595596. I agree that the Construction Measure forces municipalities to regulate third parties, but I believe that the other two contested Measures require the same unconstitutional regulation.\n\nThe Illicit Discharge Measure does so by requiring the states to prohibit illicit discharge \"through ordinance, or other regulatory mechanism . . . .\" 40 C.F.R. § 122.34(b)(3)(ii)(B). The Post-Construction Measure does so by requiring that permit seekers \"[u]se an ordinance or other regulatory mechanism to address post-construction runoff from new development . . . .\" Id. at § 122.34(b)(5)(ii)(B). Again, the majority contends that these mandates are not forced on the states because municipalities can choose not to accept discharge from illicit dischargers and runoff from construction sites. Majority Op. at 595. This is no more of a choice than whether or not the municipalities will discharge directly into federal waters. The law of gravity is inflexible; the stormwater will run downhill through the municipalities into federal waters whether the sewer system is open or blocked. No matter how much we may want to uphold EPA's regulatory scheme, we cannot change the law of gravity.\n\nWe need not consider such options, however, in determining if the Construction Site Measure requires municipalities to regulate third parties. The majority concedes that the language of the Construction Site Measure requires such regulation outright. It does so by mandating MS4s to develop and promulgate \"requirements for construction site operators to implement appropriate erosion and sediment control [and] to control waste . . . .\" 40 C.F.R. § 122.33(b)(4)(ii)(B)-(C). Whereas the other two contested Measures require the regulation of third parties by default, this Measure does so explicitly. The majority holds that the choice not to discharge removes this Measure from Tenth Amendment scrutiny. Majority Op. at 596-597. I cannot agree. The Phase II Rule violates the Tenth Amendment by compelling the states to enact and enforce a federal regulatory program that requires the states to regulate third parties. \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nC.\n\nFinally, the Court holds that the states are not compelled under the Phase II Rule because the Alternative Permit Option provides a constitutional choice for the states. Majority Op. at 598-599. I disagree. The Alternative Permit Option is not qualitatively different from the Phase II General Permit Option described above.\n\nUnder the Alternative Permit Option of the Phase II Rule, a permit applicant may also seek a permit under the previous Phase I Rule. 40 C.F.R. § 122.33(b)(2)(ii). Under the Phase I Rule, a petitioner must submit descriptions of programs that accomplish essentially the same regulation of third parties as do the three Minimum Measures of the Phase II Rule. See 40 C.F.R. § 122.26(d)(2)(iv)(B), (D). Under subsection (B) a petitioner must submit a program that will implement by ordinance or other regulatory device the detection and removal of \"illicit discharges and improper disposal into the storm sewer.\" Id. at § 122.26(d)(2)(iv)(B). This is essentially the same as the Illicit Discharge Minimum Measure and similarly compels the states to regulate third parties.\n\nSubsection (D) calls for municipalities to submit a program to \"implement and maintain structural and non-structural best management practices to reduce pollutants in storm water runoff from construction sites.\" Id. at § 122.26(d)(2)(iv)(D). This section is nearly identical to the Construction and PostConstruction Minimum Measures and runs afoul of the same constitutional restriction. In short, the Phase II Rule cannot defeat a facial challenge by pointing to an Alternative Permit Option that requires the same regulation of third parties as the General Permit Option.\n\nD.\n\nWhile I concede that one of our most difficult judicial undertakings may be to determine the appropriate exercise of state and federal power, I would hold in this case that the three contested Minimum Measures unconstitutionally compel the states to adopt a federal program that requires the states to regulate third parties, and that the Alternative Permit Option is similarly flawed. Because the Phase II Rule violates the principles of federalism embodied in the Tenth Amendment, I respectfully dissent.\n\nII.\n\nI also cannot agree with Section II.B of the Court's opinion, which remands the Phase II Rule because EPA acted arbitrarily and capriciously in creating a general permitting system supported by notices of intent (\"NOIs\"). Majority Op. at 611. This Court must give deference to EPA's interpretation of the laws it is charged with enforcing, so long as EPA's reading of those laws is permissible. Because EPA acted reasonably in designing a National Pollutant Discharge Elimination System (\"NPDES\") based on general permits and supported by NOIs, I respectfully dissent from the Court's decision to remand this portion of the Phase II Rule.\n\nA.\n\nAs the majority concedes, we evaluate EPA's interpretation of the Clean Water Act with deference. Majority Op. at 618. If Congress's intent is unclear as to whether a system of general permits supplemented by NOIs is allowed, we simply ask \"whether EPA's interpretation is permissible.\" Ober v. Whitman, 243 F.3d 1190, 1193 (9th Cir. 2001).\n\nB.\n\nAs an initial matter, then, we must ask if Congress was clear in its intent concerning the propriety of a system of general permits augmented by NOIs.\n\nFive legislative commands guide this inquiry. First, 33 U.S.C. § 1342(p)(6) charges EPA with creating a system to regulate stormwater discharges. Plainly, nothing in this section speaks to whether EPA may utilize a general permit approach in regulating stormwater discharge.\n\nSecond, 33 U.S.C. § 1311(a) makes it illegal to discharge pollutants \"except as in compliance\" with several sections of the Clean Water Act. Again, nothing in this section addresses whether EPA may make use of general permits reinforced by NOIs.\n\nThird, 33 U.S.C. § 1342 in general (as opposed to the limited charge in section 1342(p)(6) discussed above) authorizes EPA to issue NPDES permits, provided that the permits satisfy several conditions. But nothing in section 1342 prohibits the use of a system of general permits.\n\nFourth, the Clean Water Act mandates that \"a copy of each permit application and each permit issued under\" the NPDES permitting program be made available to the public for inspection and photocopying. 33 U.S.C. § 1342(j). The Act does not elaborate on this naked requirement. There is no explanation of the manner in which NPDES permits and applications are to be made publically available. Nor does the Act define what constitutes a \"permit\" that would trigger these requirements.\n\nAnd fifth, the Clean Water Act authorizes the issuance of an NPDES \"permit\" \"after opportunity for public hearing.\" 33 U.S.C. § 1342(a)(1). The Act does not provide a definition of \"permit,\" nor does it further detail what triggers the requirement of a public hearing.\n\nIn short, the Clean Water Act fails to address the propriety of a general permit system, or whether NOIs ought to be considered \"permits.\" Therefore, EPA's creation of a system of general permits buttressed by NOIs should be upheld by this Court so long as it is \"permissible.\" See Chevron, U.S.A., Inc. v. Natural Resources Defense Council, 467 U.S. 837, 843-44 (1984). Our duty to defer to EPA in such a situation is based on sound policy. Given the overwhelming challenge and complexity of the programs administered by federal agencies today, it is sensible to trust agencies with the design of those programs so long as the programs are reasonable interpretations of congressional mandates.\n\nThe central issues regarding EPA's general permit system are whether the Clean Water Act allows such a system and whether NOIs should be considered \"permits.\" The resolution of these issues requires a complicated weighing of policies (e.g., administrative streamlining v. robust inquiry) that is precisely what agencies are designed to do and courts are without the resources or expertise to do. \"[I]f the statute is silent or ambiguous with respect to the specific issue, the question for the court is whether the agency's answer is based on a permissible construction.\" Chevron, 467 U.S. at 843.\n\nC.\n\nThe Phase II Rule promulgates a system of general permits. EPA contemplated that these general permits will be issued on a watershed basis, with individual stormwater dischargers then filing NOIs to operate under general permits. The federal regulations implementing this system repeatedly emphasize that \"[t]he use of general permits, instead of individual permits, reduces the administrative burden of permitting authorities, while also limiting the paperwork burden on regulated parties.\" 64 Fed. Reg. 68,722, 68,737, 68,762 (Dec. 8, 1999).\n\nThe use of a general permit system for the administration of the NPDES system has been considered and approved before. In NRDC v. Costle, 568 F.2d 1369 (D.C. Cir. 1977), the District of Columbia Circuit considered a challenge to EPA's regulations under the Federal Water Pollution Control Act, which was the precursor to the Clean Water Act. In Costle, EPA sought approval of its design for the NPDES system. EPA had issued regulations exempting broad categories of point sources from the requirement that an NPDES permit be obtained before discharging into federal waters. Part of EPA's rationale in creating the exempted categories was that otherwise EPA would be overwhelmed by the administrative burden of issuing NPDES permits. Id. at 1377-79. The Costle court affirmed the lower court's rejection of these exemptions because the legislation in question plainly required that all point sources obtain some kind of NPDES permit. Id. But in rejecting EPA's regulations, the Costle court discussed the options available to EPA in promulgating an NPDES system that was considerate of the enormous burden such a system could impose on EPA. Id. at 1380-81. In particular, the court recommended \"the use of area or general permits. The Act allows such techniques. Area-wide regulation is one well-established means of coping with administrative exigency.\" Id. at 1381 (emphasis added).\n\nAgainst this backdrop, EPA's creation of a general permit system was entirely permissible. And if the creation of a general permit system is permissible, then it does not matter whether NOIs are given a public airing.\n\nThe majority contends that the general permit system prevents EPA from fulfilling its duty to make sure that municipalities do not discharge pollutants in violation of the Clean Water Act. The majority reasons that by failing to require EPA review of NOIs, the Rule fails to ensure that a regulated MS4's stormwater pollution control program will satisfy the Clean Water Act requirement that the MS4 \"reduce the discharge to the maximum extent practicable.\" Majority Op. at 616. But the majority's analysis ignores the effects of the general permit. By filing an NOI, a discharger obligates itself to comply with the limitations and controls imposed by the general permit under which it intends to operate. EPA mandates that all permits (including general permits) condition their issuance on satisfaction of pollution limitations imposed by the Clean Water Act. 40 C.F.R. § 122.44. In particular, EPA requires permits to satisfy the restrictions imposed by Clean Water Act section 307(a). Id. at § 122.44(b)(1). Therefore, the general permit imposes the obligations with which the discharger must comply (including applicable Clean Water Act standards), and EPA's decision not to review every NOI is not a failure to insure compliance with the Clean Water Act.\n\nThe Court also objects to EPA's general permit system because it fails to allow for sufficient public participation in the NOIs. Majority Op. at 617-619. The majority's position fails to give deference to EPA and imposes the majority's own wishes instead. EPA would have been justified in creating a system entirely reliant on general or area permits. Its imposition of NOIs is an indulgence to certain policy prerogatives, namely public involvement and the collection of additional information. But the power to create a general permit system necessarily implies the power to require subordinate steps for NOIs that do not quite reach the level of inquiry associated with actual permits.\n\nD.\n\nWe function as an adjudicator of disputes, not as a policymaking body. Where an agency promulgates rules after a deliberative process, it is incumbent upon us to respect the agency's decisions or else risk trivializing the function of that agency. In this case, EPA made a permissible decision to create a general permit program supported by NOIs. Therefore, I also respectfully dissent from Section II.B of the Court's opinion.\n\n\u003cspan class=\"fn\"\u003e1. The \"Phase II Rule\" reviewed here is the product of the second stage of EPA's two-phase stormwater rulemaking effort. The \"Phase I Rule,\" governing larger-scale stormwater discharges, was issued in 1990 and reviewed by this court in Natural Res. Def. Council v. EPA, 966 F.2d 1292 (9th Cir. 1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Richard G. Cohn-Lee and Diane M. Cameron, Urban Stormwater Runoff Contamination of the Chesapeake Bay: Sources and Mitigation, THE ENVIRONMENTAL PROFESSIONAL, Vol. 14, p. 10, at 10 (1992); see also Natural Res. Def. Council, 966 F.2d at 1295 (citing a study by the Nationwide Urban Runoff Program).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Regulation for Revision of the Water Pollution Control Program Addressing Storm Water, 64 Fed. Reg. 68,722, 68,724, 68,727 (Dec. 8, 1999) (codified at 40 C.F.R. pts. 9, 122, 123, and 124).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Id. at 68,726.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Id. at 68,725-31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. A point source is \"any discernible, confined and discrete conveyance, including but not limited to any pipe, ditch, channel, tunnel, conduit, well, discrete fissure, container, rolling stock, concentrated animal feeding operation, or vessel or other floating craft, from which pollutants are or may be discharged.\" 33 U.S.C. § 1362 (14).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Diffuse runoff, such as rainwater that is not channeled through a point source, is considered nonpoint source pollution and is not subject to federal regulation. Oregon Natural Desert Ass'n v. Dombek, 172 F.3d 1092, 1095 (9th Cir. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. National Pollutant Discharge Elimination System Permit Application Regulations for Stormwater Discharges, 55 Fed. Reg. 47,990 (Nov. 16, 1990) (codified at 40 C.F.R. pt. 122-124). The Phase I rule was challenged in this court in Natural Res. Def. Council, 966 F.2d at 1292. We held, inter alia, that EPA must impose deadlines for permit approvals, id. at 1300, that EPA's decision to regulate construction sites only over five acres in size was arbitrary and capricious, id. at 1306, and that EPA did not act capriciously in defining \"municipal,\" id. at 1304, or in placing differentlysized municipalities on different permitting schedules, id. at 1301.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Proposed Regulations for Revision of the Water Pollution Control Program Addressing Storm Water Discharges, 63 Fed. Reg. 1536 (proposed Jan. 9, 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Pub. L. No. 106-74, § 431(a), 113 Stat. 1047, 1096 (1999) (\"Appropriations, 2000 -- Department of Veterans Affairs and Housing and Urban Development, and Independent Agencies\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Regulations for Revision of the Water Pollution Control Program Addressing Storm Water Discharges, 64 Fed. Reg. 68,722 (Dec. 8, 1999) (codified at 40 C.F.R. pts. 9, 122, 123, and 124).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Rule also allows a small MS4 to be regulated under an individual NPDES permit covering a nearby large or medium MS4, with provisions adapted to address the small MS4. 40 C.F.R. § 122.33(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The text of that section reads: \"Not later than October 1, 1993, [EPA], in consultation with State and local officials, shall issue regulations (based on the results of the studies conducted under paragraph (5)) which designate stormwater discharges, other than those discharges described in paragraph (2), to be regulated to protect water quality and shall establish a comprehensive program to regulate such designated sources. The program shall, at a minimum, (A) establish priorities, (B) establish requirements for State stormwater management programs, and (C) establish expeditious deadlines. The program may include performance standards, guidelines, guidance, and management practices and treatment requirements, as appropriate.\" 33 U.S.C. § 1342(p)(6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The lesser category of \"permits\" may also be implied by the inclusion of \"performance standards\" in the list of possible program features.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. \"Where Congress includes particular language in one section of a statute but omits it in another section of the same Act, it is generally presumed that Congress acts intentionally and purposely in the disparate inclusion or exclusion.\" Bates v. United States, 522 U.S. 23, 29-30 (1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. A court may refuse to defer to an agency's interpretation of a statute that raises serious constitutional questions. Ma v. Reno, 208 F.3d 815, 821 n.13 (9th Cir. 2000), vacated on other grounds by Zadvydas v. Davis, 533 U.S. 678 (2001). The court continues to apply the Chevron standard so long as the agency's interpretation does not raise \"grave and doubtful\" constitutional issues. Williams v. Babbitt, 115 F.3d 657, 661-62 (9th Cir. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. This subsection provides that permit seekers must, \"[t]o the extent allowable under State, Tribal, or local law, effectively prohibit, through ordinance or other regulatory mechanism, non-stormwater discharges into your storm sewer systems and implement appropriate enforcement procedures and actions. . . .\" 40 C.F.R. § 122.34(b)(3)(ii)(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This subsection provides that permit seekers \"must develop, implement, and enforce a program to reduce pollutants in any storm water runoff to your small MS4 from construction activities that result in a land disturbance of greater than or equal to one acre . . . . [The proposed] program must include the development and implementation of, at a minimum: (A) An ordinance or other regulatory mechanism to require erosion and sediment controls, as well as sanctions to ensure compliance, to the extent allowable under State, Tribal, or local law; (B) Requirements for construction site operators to implement appropriate erosion and sediment control best management practices; (C) Requirements for construction site operators to control waste such as discarded building materials, concrete truck washout, chemicals, litter, and sanitary waste at the construction site that may cause adverse impacts to water quality; (D) Procedures for site plan review which incorporate consideration of potential water quality impacts; (E) Procedures for receipt and consideration of information submitted by the public, and (F) Procedures for site inspection and enforcement control measures.\" 40 C.F.R. §§ 122.34(b)(4)(i)-(ii).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. This subsection provides that permit seekers must \"[u]se an ordinance or other regulatory mechanism to address post-construction runoff from new development and redevelopment projects [disturbing one acre or more] to the extent allowable under State, Tribal or local law.\" 40 C.F.R. §§ 122.34(b)(5)(ii)(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Petitioners actually contend that all MS4s are operated by municipal governments, but this is untrue. The Phase II Rule regulates all authorities who operate small storm sewer systems, \"including but not limited to\" federal, State, Tribal, and local authorities. 40 C.F.R. § 122.32(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Support for this claim is also found in ACORN v. Edwards, 81 F.3d 1387, 1394 (5th Cir. 1996), in which the Fifth Circuit held in violation of the Tenth Amendment a provision of the Safe Drinking Water Act requiring that \"each state shall establish a program . . . to assist local educational agencies in testing for, and remedying, lead contamination in drinking water from coolers. . . .\" 42 U.S.C. § 300j-24(d)(1). EPA distinguishes the invalidated provision of the Safe Drinking Water Act from the Phase II Rule, arguing that the former directly targeted state police power and commanded the terms of its performance as its sole object, whereas the Phase II Rule is a neutral rule of general applicability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See 40 C.F.R. § 122.32(a) (applying the Rule to federal, state, local, and tribal MS4 operators). Petitioners do not contest EPA's assertion that Clean Water Act and NPDES regulations are generally applicable, prohibiting unpermitted discharges from point sources without regard to the government status of the discharger.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. EPA further argues that the alternative option, discussed in detail below, provides a lawful failsafe mechanism against any future \"as applied\" defects in the Minimum Measures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We note that this is often, but not always, the case. Contrary to Petitioners' assertion, state water does not inexorably become federal water by running downhill through a point source. For example, it may be channeled to a naturally or artificially created terminal basin, as with other forms of sewage, and there treated at the state's discretion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. A proposed management program must include \"[r]equirements for construction site operators to implement appropriate erosion and sediment control best management practices [and] for construction site operators to control waste such as discarded building materials, concrete truck washout, chemicals, litter, and sanitary waste at the construction site that may cause adverse impacts to water quality.\" 40 C.F.R. § 122.34(b)(4)(B)-(C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. EPA argues that, even if one of the Minimum Measures is constitutionally questionable, there is no compulsion cognizable under the Tenth Amendment because a municipality that lacks the authority to adopt regulations, pass ordinances, or otherwise exercise power to implement a Minimum Measure will be exempted from that measure. 64 Fed. Reg. at 68,766. However, the exemption applies only to permit-seekers who genuinely lack the authority to pass ordinances or regulate the targeted activity, not to permit-seekers who simply resist. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The dissent argues that the choice between abiding by Phase II and not discharging into federal waters at all is a Hobson's choice analogous to the choice facing Washington State in Board of Natural Res. v. Brown, 992 F.2d 937 (9th Cir. 1993). In Brown, we held that Congress did not have the power to command Washington State to choose between either regulating timber sales according to Congress's instructions, or halting timber sales altogether. Brown is inapposite, however, because while Brown assumed that Congress did not have the authority to command Washington to halt timber sales outright, Congress does have the authority to refuse outright to accept discharges from operators of small MS4s into federal waters.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. EPA correctly argues: \"[a]s in Condon, where the federal government permissibly regulated States as database owners selling data, even though the federal requirements applied to States exclusively, the Phase II regulations do not 'require' local governments 'in their sovereign capacity to regulate their own citizens.' 528 U.S. at 151. They require separate storm sewer system operators, in their capacity as dischargers of other entities' pollutants, to take steps to control the intake of pollutants into their systems. Requiring a small MS4 to take action to control additions of pollutants into its system, to reduce the pollutants in its ultimate stormwater discharge, no more makes the small MS4 a sovereign 'regulator' or 'law enforcer' than similar requirements would render a privately owned wastewater treatment works, private bulk trucking terminal, or other discharger such a 'regulator' or 'law enforcer.' Any discharger is responsible for the quality of its discharge.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Small MS4s seeking an individualized permit under the Phase I model are relieved of the requirements of § 122.26(d)(1)(ii) and § 122.26(d)(2) mandating that larger operators demonstrate their legal authority to control discharges to the MS4 through ordinance or other binding measures. 40 C.F.R. § 122.33(b)(2)(ii).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. EPA further argues that a facial constitutional challenge to the Alternative Permit option cannot lie, since the rules list application requirements, not permit requirements. EPA contends that any challenge would have to be made \"as applied,\" and that such a challenge would be unripe at this point, as the pertinent facts have not yet materialized. Abbot Laboratories v. Gardner, 387 U.S. 136, 148-49 (1967) (the ripeness doctrine protects \"agencies from judicial interference until an administrative decision has been formalized and its effects felt in a concrete way by the challenging parties\"), overruled on other grounds by Califano v. Sanders, 430 U.S. 99, 105 (1977). The Municipal Petitioners dispute this contention on the basis of the EPA Environmental Appeals Board's decision in In Re: City of Irving, Texas MS4, NPDES Appeal No. 00-18, but fail to demonstrate how the facts of that case apply here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Specifically, petitioners object to the requirements that a permit seeker must submit, with its application: (A)(2) A description of planning procedures including a comprehensive master plan to develop, implement and enforce controls to reduce the discharge of pollutants from municipal separate storm sewers which receive discharges from areas of new development and significant redevelopment. Such plan shall address controls to reduce pollutants in discharges from municipal separate storm sewers after construction is completed; . . . (B) A description of a program, including a schedule, to detect and remove (or require the discharger to the municipal separate storm sewer to obtain a separate NPDES permit for) illicit discharges and improper disposal into the storm sewer. The proposed program shall include: (1) A description of a program, including inspections, to implement and enforce an ordinance, orders or similar means to prevent illicit discharges to the municipal separate storm sewer system; . . . (C) A description of a program to monitor and control pollutants in storm water discharges to municipal systems from municipal landfills, hazardous waste treatment, disposal and recovery facilities, industrial facilities that are subject to section 313 of title III of the Superfund Amendments and Reauthorization Act of 1986 (SARA), and industrial facilities that the municipal permit applicant determines are contributing a substantial pollutant loading to the municipal storm sewer system [including control measures for such discharges]; . . . (D) A description of a program to implement and maintain structural and non-structural best management practices to reduce pollutants in storm water runoff from construction sites to the municipal storm sewer system [including a description of requirements for such controls]. 40 C.F.R. § 122.26(d)(2)(iv)(A)-(D).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. An MS4 that requests a discharger to seek its own NPDES permit may reasonably decline service to that discharger if it refuses to secure such permit, without implicating the Tenth Amendment. The decision not to provide storm sewer service is of the sort that the federal government may compel when a municipality elects to partake in an activity regulated by the federal government.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. According to § 122.34(b)(5)(iii), structural best management practices (\"BMPs\") include storage practices (such as wet ponds and extendeddetention outlet structures), filtration practices (such as grass swales and sand filters), and infiltration practices (such as infiltration basins and trenches). Non-structural BMPs are preventative actions, including smart growth policies, wetland preservation, and riparian buffering.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The nearest the Alternative Permit option comes to presenting a Tenth Amendment violation is the provision in § 122.26(d)(2)(iv)(D)(1) that best management practices include a \"description of procedures for site planning which incorporate consideration of potential water quality impacts[.]\" However, \"[w]hen the constitutional validity of a statute or regulation is called into question, it is a cardinal rule that courts must first determine whether a construction is possible by which the constitutional problem may be avoided.\" Meinhold v. U.S. Dep't of Defense, 34 F.3d 1469, 1476 (9th Cir. 1994); see also Williams v. Babbitt, 115 F.3d 657, 662 (9th Cir. 1997) (\"[J]ust as we will not infer from an ambiguous statute that Congress meant to encroach on constitutional boundaries, we will not presume from ambiguous language that Congress intended an agency to do so. . . .\"). And while it is possible to read the provision in § 122.26(d)(2)(iv) (D)(1) as requiring the regulation of site planning activities by third party construction professionals, a better reading of the provision is that it requires the MS4 operator to consider water quality impacts in planning MS4 connections at construction sites. Therefore, the provision poses no Tenth Amendment problem.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. We decline to address two further arguments raised by EPA: first, that municipalities do not receive full First Amendment protections, under Muir v. Ala. Educ. Television Comm'n, 688 F.2d 1033, 1038 n.12 (5th Cir. 1982) (en banc) (\"Government expression, being unprotected by the First Amendment, may be subject to legislative limitation which would be impermissible if sought to be applied to private expression . . . .\"), and Aldrich v. Knab, 858 F. Supp. 1480, 1491 (W.D. Wash. 1994) (holding that \"unlike private broadcasters, the state itself does not enjoy First Amendment rights\"), and second, that even if the First Amendment were fully applicable, the Phase II regulations would satisfy them because MS4s may avoid the compulsion to speak by seeking a permit under the Alternative option, 40 C.F.R. § 122.26(d)(2)(iv), rather than under the Minimum Measures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. As a subsidiary matter, we note that it also falls short of compelling the MS4 to \"regulate\" third parties in contravention of the Tenth Amendment. Dispensing information to facilitate public awareness about safe disposal of toxic materials constitutes \"encouragement,\" not regulation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. \"When the constitutional validity of a statute or regulation is called into question, it is a cardinal rule that courts must first determine whether a construction is possible by which the constitutional problem may be avoided.\" Meinhold, 34 F.3d at 1476.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In its most recent treatment of compelled speech, the Supreme Court held that a generic advertising campaign violated free speech where the message was specific and antagonistic to the preferred advertising message of the plaintiff, and the regulation compelling participation was not part of a broader regulatory apparatus already constraining the plaintiff's autonomy in the relevant arena. United States Dep't. of Agriculture v. United Foods, 533 U.S. 405, 410-17 (2001). The court distinguished this advertising program from the one in Glickman on the latter point: \"[t]he program sustained in Glickman differs from the one under review in a most fundamental respect. In Glickman the mandated assessments for speech were ancillary to a more comprehensive program restricting market autonomy.\" Id. at 411. Although the Phase II Rule is not an advertising or marketing regulation, it constitutes a \"comprehensive program\" restricting the autonomy of MS4s in the relevant arena of controlling toxic discharges to storm sewers that drain to U.S. waters.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In deciding the similar question of whether a regulation impermissibly compelled speech by requiring manufacturers of mercury-containing products to inform consumers how to dispose safely of the toxic material, the Second Circuit held that \"mandated disclosure of accurate, factual, commercial information does not offend the core First Amendment values of promoting efficient exchange of information or protecting individual liberty interests.\" Nat'l Elec. Mfrs. Ass'n v. Sorrell, 272 F.3d 104, 114 (2d Cir. 2001). What speech may follow from the Phase II directive will not be \"commercial\" in the same sense that manufacturer labeling is, but it will be similar in substance to Sorrell to the extent that it informs the public how to dispose safely of toxins. We think the policy considerations underlying the commercial speech treatment of labeling requirements, see, e.g., the Federal Cigarette Labeling and Advertising Act, 15 U.S.C. §§ 1333-39, apply similarly in the context of the market-participant municipal storm sewer provider.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The Alternative option contains a public education requirement that is similar but even less specific, and therefore even less burdensome, than the requirements in the Minimum Measures. See § 122.26(d)(2)(iv)(B)(6) (requiring permit seekers to propose programs to counter illicit discharges, including a \"description of educational activities, public information activities, and other appropriate activities to facilitate the proper management and disposal of used oil and toxic materials\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Municipal Petitioners concede that \"simplified individual permit application requirements\" were discussed, but they contend that the permit requirements discussed are not sufficiently similar to those promulgated to establish a logical outgrowth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Petitioners suggest that EPA should be held to the standard it espoused to procure judicial approval for the Phase I program. In 1991, responding to NRDC's assertion that the Phase I Rule failed to set \"hard criteria\" for review of MS4 stormwater programs, EPA responded that \"inadequate proposals will result in the denial of permit applications.\" Respondent's Brief at 67, Natural Res. Def. Council v. EPA, 966 F.2d 1292 (9th Cir. 1992) (Nos. 91-70200, 91-70176, \u0026 90-70671). Petitioners contend that this court relied on that representation in ruling for EPA on that issue. Natural Res. Def. Council v. EPA, 966 F.2d at 1308 n.17 (\"Individual NPDES permit writers . . . will decide whether application proposals are adequate . . . .\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. That the Rule allows a permitting authority to review an NOI is not enough; every permit must comply with the standards articulated by the Clean Water Act, and unless every NOI issued under a general permit is reviewed, there is no way to ensure that such compliance has been achieved. The regulations do require NPDES permitting authorities to provide operators of small MS4s with \"menus\" of management practices to assist in implementing their Minimum Measures, see 40 C.F.R. § 123.35(g), but again, nothing requires that the combination of items that the operator of a small MS4 selects from this \"menu\" will have the combined effect of reducing discharges to the maximum extent practicable. Nor is the availability of citizen enforcement actions a substitute for EPA's enforcement responsibility, especially because, as discussed below, the Rule does not require that NOIs be publically available. Absent review on the front end of permitting, the general permitting regulatory program loses meaning even as a procedural exercise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. EPA identifies no other general permitting program that leaves the choice of substantive pollution control requirements to the regulated entity, and we are not persuaded by the analogy it urges to the traditional model of general permitting (where NOIs routinely are not reviewed), because, as we have noted, the Phase II general permit model is substantially dissimilar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Agency determinations based on the record are reviewed under the \"arbitrary and capricious\" standard. 5 U.S.C. § 706(2)(A). The standard is narrow and the reviewing court may not substitute its judgment for that of the agency. Marsh, 490 U.S. at 378. However, the agency must articulate a rational connection between the facts found and the conclusions made. Washington v. Daley, 173 F.3d 1158, 1169 (9th Cir. 1999). The reviewing court must determine whether the decision was based on a consideration of the relevant factors and whether there has been a clear error of judgment. Marsh, 490 U.S. at 378. The court may reverse under the \"arbitrary and capricious\" standard only if the agency: has relied on factors which Congress has not intended it to consider, entirely failed to consider an important aspect of the problem, offered an explanation for its decision that runs counter to the evidence before the agency, or is so implausible that it could not be ascribed to a difference in view or the product of agency expertise. Motor Vehicle Mfrs. Ass'n, 463 U.S. at 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. EPA explains that the Group A facilities were not regulated with the other Phase I sources because EPA used Standard Industrial Classification Index (SIC) codes in defining the universe of regulated industrial activities: \"By relying on SIC codes, a classification system created to identify industries rather than environmental impacts from these industries [sic] discharges, some types of storm water discharges that might otherwise be considered 'industrial' were not included in the existing NPDES storm water program.\" 64 Fed. Reg. at 68,779.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. As discussed in footnote 47, Group A facilities were not regulated with other Phase I industrial sources based on a government coding system used to distinguish different types of industry (without reference to their similar environmental impacts). See 64 Fed. Reg. at 68,779.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. \"In identifying potential categories of sources for designation in today's notice, EPA considered designation of discharges from Group A and Group B facilities. EPA applied three criteria to each potential category in both groups to determine the need for designation: (1) The likelihood for exposure of pollutant sources included in that category, (2) whether such sources were adequately addressed by other environmental programs, and (3) whether sufficient data were available at this time on which to make a determination of potential adverse water quality impacts for the category of sources. As discussed previously, EPA searched for applicable nationwide data on the water quality impacts of such categories of facilities. . . . \"EPA's application of the first criterion showed that a number of Group A and B sources have a high likelihood of exposure of pollutants. . . . Application of the second criterion showed that some categories were likely to be adequately addressed by other programs. \"After application of the third criterion, availability of nationwide data on the various storm water discharge categories, EPA concluded that available data would not support any such nationwide designations. While such data could exist on a regional or local basis, EPA believes that permitting authorities should have flexibility to regulate only those categories of sources contributing to localized water quality impairments. . . . If sufficient regional or nationwide data become [sic] available in the future, the permitting authority could at that time designate a category of sources or individual sources on a case-by-case basis.\" 64 Fed. Reg. at 68,780.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Guidance Specifying Management Measures For Sources of Nonpoint Pollution in Coastal Waters, EPA guidance paper 840-B-93-001c (Jan. 1993), available at http://www.epa.gov/owow/nps/mmgi/index.html (last visited Sept. 18, 2002) (\"Coastal Waters\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Revisions to the NPDES Program and Federal Antidegradation Policy in Support of Revisions to the Water Quality Planning and Management Regulation, 64 Fed. Reg. 46,058, 46,088 (Aug. 23, 1999) (proposed rule).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Revisions to the Water Quality Planning and Management Regulation, 65 Fed. Reg. 43,586, 43,652 (July 13, 2000) (to be codified at 40 C.F.R. §§ 9, 122, 123, and 124).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Petitions for judicial review of that decision are currently pending in the D.C. Circuit. Am. Farm Bureau Fed'n. v. Whitman, Docket No. 001320 and consolidated cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. EPA has singled out several silvicultural activities for regulation as point sources, but forest roads are expressly excluded from the short list. 40 C.F.R. § 122.27 (requiring NPDES permits where pollutants are discharged in association with silvicultural rock crushing, gravel washing, log sorting, and log storage). Several agricultural activities have also been singled out for NPDES permitting, including concentrated animal feeding operations (but not forest roads). Id. at § 122.23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The legality of EPA's recent decision not to separate its general treatment of forest roads from its treatment of agricultural activities under the Clean Water Act is currently under review in the D.C. Circuit, Am. Farm Bureau Fed'n., Docket No. 00-1320, and must be resolved in that forum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See, e.g., Coastal Waters, supra note 50, (describing how forestry operations, including road construction and use, degrade water quality in water-bodies receiving drainage from forest lands).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Nonpoint Source Pollution: The Nation's Largest Water Quality Problem, EPA841-F-96-004A (\"Pointer #1\") (\"The latest National Water Quality Inventory indicates that agriculture is the leading contributor to water quality impairments, degrading 60 percent of the impaired river miles and half of the impaired lake acreage surveyed by states, territories, and tribes.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Petitioners can barely be regarded as having raised the issue of regulating forest roads at all during the Phase II notice and comment process. Their only comment on the matter was contained in a single sentence in a single footnote amidst forty-five single-spaced pages of general comments about the proposed Rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The Municipal Petitioners join in asserting the \"regulatory basis\" claim at Part II(F)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. NRDC argues that this claim is not only meritless for the reasons stated by EPA, but also frivolous, since industry petitioner National Association of Home Builders, as a member of the FACA Phase II Subcommittee, participated in and affirmed that such consultation took place.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. See Natural Res. Def. Council, 966 F.2d at 1306 (remanding EPA's decision to regulate only construction sites disturbing more than five acres, after EPA had initially proposed to regulate all sites disturbing more than one acre).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. The Industry Petitioners contend that EPA lacked authority to issue the Phase II regulation of construction sites based on a process EPA itself characterized as \"separate and distinct\" from the development of the Report to Congress. 64 Fed. Reg. at 68,732. They add that the Phase II Rule was not \"based on\" the 1999 Report ultimately requested by Congress in the Appropriations Act, since EPA's report in response was released on the very day that the final Phase II Rule was published.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Since we have already determined that AF\u0026PA lacks standing to raise any of its claims, see Section D above, this discussion pertains to the remaining Industry Petitioner, National Association of Home Builders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Although the issue of Municipal Petitioners' standing has not been raised by the parties, we are obliged to consider it to determine whether the case-or-controversy requirement of Article III is satisfied. See, e.g., Boeing Co. v. Van Gemert, 444 U.S. 472, 488 n.4 (1980); Juidice v. Vail, 430 U.S. 327, 331 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Even if the statute were ambiguous, we would defer to EPA's reasonable interpretation. Chevron, 467 U.S. 843-44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. The Industrial Petitioners argue that although the Phase I authorizing statute required EPA to regulate all sources associated with \"industrial activity,\" Congress expressly directed that the Phase II regulatory program be focused on sources that require regulation \"to protect water quality.\" They assert that because EPA's rule ignores the variability of water quality impacts nationwide, the Rule is not appropriately targeted on the protection of water quality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Petitioners heavily critique two studies relied on by EPA that dealt specifically with the water quality impacts of small construction sites, noting that one concludes it is impossible to generalize about the impacts of small sites, Lee H. MacDonald, Technical Justification for Regulating Construction Sites 1-5 Acres in Size, July 22, 1997, and that the other merely concludes that small sites \"can have\" significant effects if erosion controls are not implemented, David W. Owens, et al., Soil Erosion from Small Construction Sites. Petitioners contend that the latter study was managed with no erosion controls, intentionally producing worst-case sediment runoff and unreasonable estimates of actual sediment yields for small sites nationwide. EPA vigorously defends the studies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. NRDC adds that notwithstanding the clear interest of the National Association of Home Builders (\"NAHB,\" one of the Industry Petitioners), NAHB's multi-year participation in the FACA Phase II Subcommittee Small Construction and No-Exposure Sites Work Group, and NAHB's own submission of detailed comments on the proposed Rule, NAHB failed to enter into the administrative record any study contradicting the proposition that small construction sites cause water quality problems. NRDC points to the record's showing that NAHB had itself proposed that regulation of construction sites of two acres or greater was appropriate, and contends that this is thus not a dispute over whether small construction sites should be regulated on a nationwide basis, but instead a technical disagreement over whether EPA should establish a one-acre threshold or a different threshold on a similar small scale.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Whitney Brown and Deborah Caraco, Controlling Stormwater Runoff Discharges from Small Construction Sites: A National Review, Task 5 Final Report submitted by the Center for Watershed Protection to the EPA Office of Wastewater Management, March 1997, IP E.R. 633, 643.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. EPA adds that operators of small sites in areas unlikely to suffer adverse impacts may apply for a permit waiver if little or no rainfall is expected during the period of construction (the \"rainfall erosivity waiver\") or if regulation is unnecessary based on a location-specific evaluation of water quality (the \"water quality waiver\"). 64 Fed. Reg. at 68,776.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. EPA also implies permission to regulate for potential cumulative impacts of small sites from the past directive of this court. When the Phase I industrial discharge regulations were challenged, we found no record data to support that rule's exemption of construction activities on less than five acres and held that small sites did not categorically qualify for a de minimis exemption because \"even small construction sites can have a significant impact on local water quality.\" Natural Res. Def. Council, 966 F.2d at 1306.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. The \"substantial evidence\" standard requires a showing of such relevant evidence as a reasonable mind might accept as adequate to support a conclusion. Edlund v. Massanari, 253 F.3d 1152, 1156 (9th Cir. 2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. EPA further argues that even if the waiver provision were properly characterized as an evidentiary presumption, it should be sustained because the record demonstrates that the presumed fact of the water quality impact of small sites is more likely true than not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. EPA notes that the Phase II Rule empowers regional permitting authorities to regulate local sources of these types known to be responsible for harmful water quality impacts via the continuing \"residual designation\" authority (an aspect of the Rule that Petitioners also challenge).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. TMDLs are pollutant loading limits established by NPDES permitting authorities under the Clean Water Act for waters that do not meet a water quality standard due to the presence of a pollutant. See 33 U.S.C. § 1313(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. This section enables a NPDES permitting authority to designate for regulation: \"[a] discharge for which the Administrator or the State, as the case may be, determines that the stormwater discharge contributes to a violation of a water quality standard or is a significant contributor of pollutants to waters of the United States.\" 33 U.S.C. § 1342(p)(2)(E).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Notably, Industry Petitioner NAHB itself took the position during Phase II Subcommittee proceedings that the power to designate additional sources survived the promulgation of the Phase II Rule. In a 1996 comment letter to EPA, NAHB asserted its understanding that \"[t]he permitting authority still reserves the right to designate additional sources if they are shown to be a contributor of water quality impairment.\" NRDC Supplemental Excerpts of Record at 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. The full text of § 402(p)(6), which specifically authorizes the Phase II program, reads: \"Not later than October 1, 1993, the Administrator, in consultation with State and local officials, shall issue regulations (based on the results of the studies conducted under paragraph (5)) which designate stormwater discharges, other than those discharges described in paragraph (2), to be regulated to protect water quality and shall establish a comprehensive program to regulate such designated sources. The program shall, at a minimum, (A) establish priorities, (B) establish requirements for State stormwater management programs, and (C) establish expeditious deadlines. The program may include performance standards, guidelines, guidance, and management practices and treatment requirements, as appropriate.\" 33 U.S.C. § 1342(p)(6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Petitioners further argue that even if EPA could preserve the case-bycase authority conferred in § 402(p)(2)(E), that section confers authority only to regulate \"a discharge\" determined to threaten water quality, not a category of discharges. However, we agree with respondent-intervenor NRDC's argument that § 402(p)(2)(E) does not preclude EPA from designating entire categories of sources. Petitioners' argument follows from its reliance on the fact that § 402(p)(2)(E) refers to \"discharge\" in the singular rather than the plural to conclude that EPA may only designate sources meeting the § 402(p)(2)(E) description on a case-by-case basis. But all five of the § 402(p)(2)(5) categories refer to \"discharge\" in the singular, even in reference to discharges clearly intended for categorical regulation, like \"a discharge from a municipal separate storm sewer system serving a population of 250,000 or more.\" 33 U.S.C. § 1342(p)(2)(C). The error in petitioners' interpretation is exposed by 1 U.S.C. § 1, which provides that \"[i]n determining the meaning of any Act of Congress, unless the context indicates otherwise--words importing the singular include and apply to several persons, parties, or things.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. This case was reversed in relevant part by the Supreme Court in Whitman v. Am. Trucking Ass'ns, 531 U.S. 457, 476 (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. \"[T]oday's proposal would encourage [voluntary] control of stormwater discharges . . . unless the discharge (or category of discharges) is individually or locally designated as described in the following section. The necessary data to support designation could be available on a local, regional, or watershed basis and would allow the NPDES permitting authority to designate a category of sources or individual sources on a case-by-case basis. If sufficient nationwide data [becomes] available in the future, EPA could at that time designate additional categories of industrial or commercial sources on a national basis. EPA requests comment on the three-pronged analysis used to assess the need to designate additional industrial or commercial sources and invites suggestions regarding watershed-based designation.\" 63 Fed. Reg. at 1588.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. Our consideration of the issue at all may be gratuitous, since petitioners failed to submit timely comment disputing the adequacy of EPA's consideration of economic impacts on small businesses proposed at 63 Fed. Reg. at 1605-07. United States v. L.A. Tucker Truck Lines, 344 U.S. 33, 37 (1952) (\"[C]courts should not topple over administrative decisions unless the administrative body not only has erred but has erred against objection made at the time appropriate under its practice.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. The majority also contends that EPA's interference with state sovereignty is permissible because the Phase II Rule is a rule of general applicability. While I agree with this classification of the Phase II Rule, I disagree that it has any bearing on the outcome here because the question of coercion is a threshold determination. Both of the Supreme Court cases cited by the majority as examples of the rule of general applicability exception specifically mention the voluntary participation of the states in a field of federal preemption. See Condon, 528 U.S. at 150; South Carolina v. Baker, 485 U.S. 505, 514-515 (1988) (\"That a State wishing to engage in certain activity must take administrative and sometimes legislative action . . . .\") (emphasis added);. Thus, while the Phase II Rule is a rule of general applicability, it is still unconstitutional because it is coercive.\u003c/span\u003e\n\n",
    "body_length": 193403,
    "citedas": [
      "319 F.3d 398",
      "55 ERC 1833",
      "3 Cal. Daily Op. Serv. 369"
    ],
    "attorneys": "Counsel Victoria Clark, Environmental Defense Center, Santa Barbara,California, for petitioner Environmental Defense Center, Inc. Andrew G. Frank and Arlene Yang, Paul, Weiss, Rifkind, Wharton \u0026Garrison, New York, New York, and Nancy K. Stoner, Natural ResourcesDefense Council, Washington, D.C., for intervenor National ResourcesDefense Council, Inc. R. Timothy McCrum, Ellen B. Steen, and Donald J. Kochan, Crowell \u0026Moring, Washington, D.C., for petitioners American Forest \u0026 PaperAssociation and National Association of Home Builders. Steven P. Quarles and J. Michael Klise, Crowell \u0026 Moring, Washington,D.C., and William R. Murray, American Forest \u0026 Paper Association,Washington, D.C., for petitioner American Forest \u0026 Paper Association. Jim Mathews and Clarence Joe Freeland, Mathews \u0026 Freeland, Austin,Texas, for petitioner Texas Cities Coalition on Stormwater. Sydney W. Falk, Jr. and William D. Dugat III, Bickerstaff, Heath,Smiley, Pollan, Kever \u0026 McDaniel, Austin, Texas, for petitioner TexasCounties Storm Water Coalition. John C. Cruden, Daniel M. Flores and Kent E. Hanson, United StatesDepartment of Justice, Washington, D.C., and Stephen J. Sweeny, UnitedStates Environmental Protection Agency, Washington, D.C., for respondentUnited States Environmental Protection Agency.",
    "category": [
      "251"
    ],
    "judges": "Before: James R. Browning, Stephen Reinhardt, and Richard C. Tallman,Circuit Judges.",
    "citation_count": 3
  }
}
