{
  "id": "cqFKR2YBTlTomsSB98Qe",
  "document": {
    "title": "People v. Green",
    "full_title": "THE PEOPLE AND v. CHARLES ALAN GREEN AND . IN RE CHARLES ALAN GREEN ON HABEAS CORPUS",
    "jurisdiction": "California Supreme Court",
    "date": "1980-04-24T00:00:00.000Z",
    "docket": "Crim. Nos. 20555, 21068",
    "body": "Defendant appeals from a judgment sentencing him to death on his conviction of murder in the first degree, robbery, and kidnaping.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In a proceeding consolidated herewith he also petitions for a writ of habeas corpus, alleging principally that he was denied effective assistance of counsel. We have concluded that the judgment must be affirmed as to the convictions of first degree murder and robbery, but reversed as to kidnaping; that the findings of \"special circumstances\" elevating the murder to a capital offense must be set aside; and hence that the judgment must also be reversed insofar as it relates to penalty.\n\nDefendant was charged by information with murder in violation of section 187 (count I), robbery in violation of section 211 (count II), and kidnaping for the purpose of robbery in violation of section 209 (count III), all committed against his wife Karen Green on October 11, 1977.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Count I also charged two \"special circumstances,\" i.e., that the murder was willful, deliberate and premeditated and was personally committed by defendant (1) during the commission of a robbery in violation of section 211 (former § 190.2, subd. (c)(3)(i)) and (2) during the\n\ncommission of a kidnaping in violation of section 207 or section 209 (id., subd. (c)(3)(ii)). For enhancement purposes it was further charged that defendant used a firearm in all counts (§ 12022.5), and in counts II and III that defendant intentionally inflicted great bodily harm on the victim (§ 12022.7). No prior convictions were alleged.\n\nDefendant entered pleas of not guilty to the offenses charged, and denied the special circumstances and enhancement allegations. The jury found defendant guilty of first degree murder and robbery as charged in counts I and II; on count III the jury found defendant guilty of the lesser included offense of simple kidnaping in violation of section 207. The jury further found the special circumstances allegations true, except that the second of such circumstances was found to be murder committed during the commission of a simple kidnaping rather than a kidnaping in violation of section 209. The enhancement allegations were found true.\n\nThe jury subsequently fixed the penalty for the murder at death. The court denied motions for modification of the verdict (former § 190.4, subd. (e)) and for new trial, and on count I sentenced defendant to die.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nFacts\n\nOn the morning of October 12, 1977, an unclothed body of a young woman was found in a secluded area along the Feather River, near the town of Nicolaus in Sutter County. An autopsy established that the cause of death was a shotgun wound in the anterior portion of the head, and that death had been instantaneous and had occurred within the previous 24 hours. The woman was identified from a fingerprint as defendant's wife Karen.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAs there was no eyewitness to the actual killing, the prosecution's case was built largely on evidence that defendant had both a motive and an opportunity to murder his wife, and subsequently admitted the crime by word and deed. This evidence was presented in the form of testimony\n\nby a number of friends and acquaintances of defendant and Karen, all of whom lived in or about Sacramento. Viewing that testimony in the light most favorable to the People, as we must on this appeal (People v. Vann (1974) 12 Cal. 3d 220, 225 [115 Cal. Rptr. 352, 524 P.2d 824]), the following appear to be the principal events surrounding the murder.\n\nDefendant and Karen were married in August 1977, and lived with Laura Schmidt, Karen's sister, in September and the first part of October. Their marriage was unstable; conflicts between the parties became frequent, and defendant struck his wife on several occasions.\n\nAt midmorning on October 10, 1977, defendant and Karen drove in a borrowed pickup truck to the house of Larry Creech, an acquaintance who had a motorcycle repair shop on his premises. Karen left in due course with the pickup, but defendant remained all day working on his motorcycle. During this time defendant told Creech he thought his wife had been \"fooling around.\"\n\nThat night defendant slept at the Creech house and Karen slept at her parents' residence. At 4 a.m. defendant telephoned Laura Schmidt and asked, \"where the hell [is] Karen?\" Schmidt told him Karen was sleeping at their parents' house, and defendant asked her to have his wife call him. At 6:30 a.m. on October 11, 1977, Karen telephoned her friend Pamela Robison and asked if she could move in with her. She was crying and upset, and said she was leaving defendant. Robison agreed to take her in, and Karen arrived at her house about an hour later. She said to Robison that her marriage \"just wasn't working\"; that she had spoken with defendant that morning and told him she did not want to see him any more and intended to get an annulment, and that defendant had replied he would kill her if she left him.\n\nKaren and Robison then returned the pickup to the Creech house. Karen left it in the driveway with the keys in it, telling Robison she was afraid to go inside. Robison drove Karen back to her sister's house to pick up her clothes. Karen took only her personal belongings, leaving defendant's behind, then returned to the Robison house.\n\nMeanwhile, another acquaintance of defendant, David Khan, arrived at the Creech house about noon. Defendant asked Khan to locate Karen for him, saying she had \"ripped off\" $800 of his money and was \"fooling around on him.\" He gave Khan some telephone numbers to call and\n\n$5 for gas, and offered to pay him $50 if he found her. Defendant and Khan then drove to the Khan house in the latter's car.\n\nA substantial amount of testimony was directed to establishing that defendant acquired a sawed-off shotgun during the afternoon of October 11. At the Khan house defendant encountered Don Sheehan, who earlier that day had traded a pistol for such a shotgun owned by David's brother, Donnie. Defendant indicated an interest in buying or borrowing the weapon, and Sheehan agreed to sell it for a pound of marijuana to be delivered in a day or two. Defendant took possession of the gun, cleaned it, and wrapped it in a piece of white cloth. Several of the persons at the Khan house saw the wrapped weapon in defendant's possession during lunch. Later in the afternoon David Khan and defendant returned to the Creech house, and defendant carried the shotgun inside. Creech asked what the object was, and defendant replied it was \"a toy\" he took from someone and \"it might get somebody in trouble.\"\n\nDefendant and David Khan then continued on to the house of Diane Scott (Donnie Khan's girlfriend) and her sister Linda Reeves. There a number of witnesses saw defendant carry the wrapped gun into the house under his coat. Using a telephone on the premises, Khan called Linda Schmidt at defendant's request in an effort to reach Karen. Schmidt informed him Karen was at Pamela Robison's house, and furnished the number of the latter. Khan next called the Robison house and, at defendant's direction, told Karen that her husband was in trouble and needed her to pick up some of his belongings from her sister. Karen agreed to go with Khan for this purpose, and added that if he saw defendant he was to tell him she had an appointment for an annulment at 4:30 the next afternoon. Khan relayed this message to defendant as soon as the conversation ended. Defendant then instructed him to pick Karen up and bring her back to the Scott-Reeves house. He also told Khan that if it looked as if there were any police watching the place he should \"keep on going.\"\n\nTaking his brother Donnie with him, Khan then drove his car to the Robison house. There, Karen entered the vehicle and sat between David and Donnie on the front seat. Before she left, Robison asked her what to do about a man who was coming to visit her; Karen replied, \"just keep him company, I'll be right back.\" To explain his return route, Khan told Karen he was taking his brother to his girlfriend's house. Karen made no objection, and the trip proceeded normally.\n\nWhen they arrived at the Scott-Reeves residence, defendant was sitting on the front lawn. Upon seeing him Karen sat up in her seat, appeared excited, and asked Khan if he knew defendant was there; he replied he did not. Donnie got out of the car and went into the house. Khan's mother and Linda Reeves came over to the car and engaged David in conversation. Karen remained silent and made no attempt to leave the vehicle. Defendant got up from the lawn, went briefly to another parked car, then entered the front passenger seat of Khan's vehicle next to his wife. As he did so, he took the wrapped shotgun from underneath his coat and slid it beneath the seat. He said to Khan, \"let's drive somewhere,\" and indicated he wanted to go to a secluded place. The three then drove away.\n\nKhan proceeded towards the town of Nicolaus in southern Sutter County, driving for some 20 minutes. During this time Karen told defendant \"she had got a derringer,\" and he replied, \"well, I have a toy of my own.\" About five miles short of Nicolaus, Karen said to defendant that if he was going to beat her he had better make it \"a good one\" because \"it would be the last time.\" She then began to climb into the back seat, but defendant grabbed her by the hair and restrained her; she \"moaned a little bit\" and said she wanted to get in the back, but he told her to \"just sit there.\"\n\nShortly before reaching Nicolaus, Khan drove off the highway and into a secluded area along the Feather River. It was about 8 p.m. Khan parked the car, got out, and sat on the front fender drinking a beer. Defendant and Karen exited on their side and went behind the vehicle. Khan overheard parts of the ensuing conversation. Defendant first asked his wife about the annulment, and she replied that \"it wasn't true, that she just wanted him to come back.\" He reminded her he had told her once before that if she ever tried to leave him he would kill her. He then went to the passenger side of the car and leaned over the back seat. While he was thus occupied, Karen approached Khan, prodded him with her foot to get his attention, and turned her palms towards him in a gesture that he took to be a request for assistance. Khan looked at defendant, then at her, and did nothing.\n\nDefendant and Karen again went behind the car, and defendant directed her to take her clothes off. Khan heard a slapping sound, followed by the report of a shotgun being fired. Defendant repeated his demand that Karen take off her clothes; he said she had no reason to be embarrassed because Khan was at the front of the car and could not\n\nsee, and added something about \"some guy she hadn't been embarrassed in front of before.\"\n\nKhan next heard the noise of someone inside his car, followed by the sound of defendant and Karen talking and walking away from the vehicle. After a few moments he entered the car and noticed Karen's clothes lying on the back seat. He listened to the radio for 20 to 30 minutes, then heard a muffled noise \"like a pop.\" Defendant called his name and told him to \"Come here.\" Khan walked in the direction of the voice and found defendant standing over the nude body of his wife, who had been shot in the face. He was holding a lighter, and asked Khan to help him find the shotgun shell; Khan pointed it out on the ground, and defendant retrieved it. Khan next removed Karen's wedding rings at defendant's direction, and handed them to him. Defendant displayed a matchbook he had found in his wife's hand, and it bore the initials and telephone number of Larry Creech. Defendant then \"mentioned something about identification and something about shooting her hands and feet and tattoos off.\" He squatted by Karen's side and pointed the shotgun at the tattoo on her abdomen, but it failed to fire. He cursed, vainly worked the pump action of the weapon, then said \"we better get the hell out of here.\"\n\nDefendant and Khan walked to the car and drove off in the direction of Sacramento. En route, defendant told Khan he \"screwed her front and back,\" and claimed that \"she was in the middle of a sentence, laughing, smiling, when she went out.\" He asked if Khan was afraid he would be killed too, and Khan said he was not. Khan then inquired what should be done when the police talk to Pamela Robison, in view of the fact she last saw Karen in his company. Defendant instructed him to say he had dropped Karen off at the Stickey Wicket, a cocktail lounge where she had a job. Finally, Khan suggested to defendant that he get rid of the gun.\n\nAt 10 or 11 p.m. the two men arrived back at the Scott-Reeves house and went inside, defendant carrying the gun and his wife's clothes and purse. They entered the bathroom, closed the door, and defendant emptied the purse on the floor and went through its contents. He removed some pieces of paper bearing telephone numbers and a vehicle registration slip in the name of Karen's parents; he also found a total of three dollars and change, and remarked, \"This would have been a hell of a robbery, huh?\" He went through the pockets of his wife's clothing, then gave Khan the shotgun and told him to wipe it down; Khan complied,\n\nand reloaded the weapon. At defendant's direction Khan asked Linda Reeves for a paper bag, but accepted a pillowcase instead. Defendant placed his wife's purse and clothes in the pillowcase, and carried it and the wrapped shotgun into the living room. There he asked for a shovel, but none could be found.\n\nDefendant and Khan then drove to the house of Larry Creech. Defendant took Creech into a bedroom and said he had \"offed his wife.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e He told Creech \"he had to,\" that she was \"snitching\" or informing on some friends and had \"notes and documents\" of some sort. He then asked Creech if he should \"off\" Khan, and Creech replied that Khan was a friend and would not talk. After defendant and Creech came out of the bedroom, Don Sheehan arrived at the house. Defendant returned the shotgun to Sheehan and instructed him to clean it up, telling him the party who had originally wanted it no longer did. Defendant and Khan separated later that night.\n\nOn the morning of October 12 defendant drove with Khan to the Creech house. Linda Creech, Larry's wife, asked him the whereabouts of Karen, and he replied \"they were through and she was gone for good this time.\" He also showed Larry Creech Karen's rings and said he was going to get rid of them. He repeated that he had killed his wife because she was informing, and said he should have buried the body.\n\nLater that day defendant encountered Pamela Robison and told her he was \"worried\" about his wife; he said that the previous evening (Oct. 11) he talked to her by telephone at the Stickey Wicket and then spoke with the bartender there who said \"she left with some guy.\" Defendant then telephoned Laura Schmidt from the Robison house and asked where his wife was; Schmidt replied that the last time she heard from Karen she was staying with Robison.\n\nOn October 13, Khan returned to Larry Creech's house and the two men burned the pillowcase and its contents, i.e., the victim's clothing and purse, in a metal bucket. They mixed the debris with sand, and instructed a man who worked around the house to get rid of it. Eight days later, acting under a search warrant, the police found ashes containing the burned remains of a woman's purse and clothing outside Creech's workshop.\n\nOn October 15 defendant telephoned Sutter County Sheriff's Detective James Davis and said he wanted to meet with him that afternoon. At the ensuing meeting defendant told Davis that about 5 p.m. on October 11 Karen telephoned him and said she needed transportation to the Stickey Wicket for a job interview, and that he sent a friend named \"Dave\" to pick up his wife for this purpose. Later that day defendant gave a written statement to the same effect, and on the following morning he called Detective Davis and identified \"Dave\" as David Khan.\n\nOn October 18 defendant and Creech visited the apartment of Jill Doolittle, Sheehan's girlfriend, because defendant \"needed to see\" Sheehan. In due course Sheehan arrived and the three went into a bedroom. Defendant asked Sheehan if he still had the shotgun; learning that he did, defendant told him to get rid of it in a way that it would never be found. Sheehan thereupon took the gun, unloaded it, wiped it down, placed it inside two empty grocery bags, and threw it into a \"dumpster\" or large debris box in an alley not far away. When he returned to the Doolittle apartment and told defendant what he had done with the weapon, defendant became upset; he said things have been known to be found in places like that, and asked why Sheehan had not thrown the gun into the river as he had indicated. The gun was subsequently recovered by the police.\n\nAbout a week later, Larry and Linda Creech drove to Oregon for a vacation with defendant and another couple. There, defendant told Larry he was \"planning on letting David eat the murder.\" To Linda, however, defendant said she \"probably figured out who had did [ sic ] it\" and that \"David had killed his wife and unborn child and revenge was his.\" Defendant and Creech were arrested in Oregon and returned to the Sutter County jail. At the time of booking, defendant made a telephone call within the hearing of Detective Davis; in a state of rage, defendant said: \"Mom, I'm in the Sutter County Jail. I want you to contact Butch. I want that mother fucker David offed. I don't care what happens to me. The mother fucker has to be taken out. Tell Butch that I want him to take David out, he will take care of it. Tell him that David is on the streets.\"\n\nThe principal defense was alibi, presented through a witness who testified that at the time the murder was assertedly taking place she was speaking on the telephone with defendant and he was at his mother's house. Defendant also sought to implicate David Khan as the real murderer; in this connection he called Michele, David's estranged wife, who\n\ntestified that her husband was often under the influence of drugs and when in that state was given to acts of violence such as tying her up, beating her, and threatening to kill her.\n\nDefendant did not testify.\n\nI - Issues relating to the verdict of first degree murder.\n\nDefendant contends that in the guilt phase of the trial the court committed prejudicial error in certain of its rulings on evidentiary and instructional matters. As will appear, we conclude in each instance that either the ruling was not erroneous or the error was waived or was harmless.\n\nA\n\nA group of defendant's contentions present a broad claim that the trial court allowed into evidence numerous items of irrelevant testimony. We begin with the principles that except as otherwise provided by statute \"all relevant evidence is admissible\" (Evid. Code, § 351); that \"relevant evidence\" is all evidence \"including evidence relevant to the credibility of a witness or hearsay declarant, having any tendency in reason to prove or disprove any disputed fact that is of consequence to the determination of the action\" (id., § 210); and that the trial court is vested with wide discretion in determining relevance under this standard (People v. Warner (1969) 270 Cal. App. 2d 900, 908 [76 Cal. Rptr. 160], and cases cited).\n\nDefendant first points to testimony from which, he asserts, the jury could infer he had previously been incarcerated. On direct examination Don Sheehan testified he told the arresting officers he was afraid to go to prison on a pending parole violation charge; the district attorney asked why he was afraid, and Sheehan replied that defendant \"had a lot of friends there.\" Defendant's motion to strike this testimony on the ground of irrelevancy was correctly denied. To begin with, the remark referred only to unidentified \"friends\" of defendant; the case is obviously distinguishable from those in which the defendant himself was characterized as a former prisoner. (See, e.g., People v. Allen (1978) 77 Cal. App. 3d 924, 934-935 [144 Cal. Rptr. 6], and cases cited.)\n\nMore importantly, the testimony was not inadmissible as a matter of law. Among the evidence relevant to the issue of the credibility of a witness\n\nis \"The existence or nonexistence of a bias, interest, or other motive\" for his testimony. (Evid. Code, § 780, subd. (f).) Sheehan admitted the authorities promised him that he would not be sent to prison on his parole violation. It was apparent that defendant would attack Sheehan's credibility -- as he did on cross-examination -- by suggesting this promise was the motive for his testimony favorable to the prosecution. In anticipation thereof, the district attorney sought to show that the promise was given instead for the sole purpose of allaying Sheehan's justifiable fear of peer retaliation in prison. Also relevant to the issue of credibility is a witness' \"attitude toward the action\" or \"toward the giving of testimony.\" (Id., subd. (j).) Here the principal prosecution witnesses made it clear their peer group does not give information to the police and that to do so invites ostracism or worse; all such witnesses, including Sheehan, were self-admitted ex-felons. In the circumstances, the fact that Sheehan was willing to testify against a former member of the group despite his fear of retaliation was supportive of the credibility of his testimony. For both these reasons the trial court did not abuse its discretion in admitting the challenged evidence.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nSecond, defendant complains generally of several other instances in which prosecution witnesses spoke of their concern for their personal safety and of ensuing protective measures taken by the authorities. For the foregoing reasons, such testimony was relevant to the issue of their credibility. Defendant's contention that these threats must somehow be \"linked\" to him (see People v. Brooks (1979) 88 Cal. App. 3d 180, 187 [151 Cal. Rptr. 606]) is misdirected, as the prosecution never claimed that the witnesses' fear was the result of any effort on defendant's part to procure false testimony.\n\nThird, it is asserted that certain testimony of Larry Creech improperly disclosed other criminal activity by defendant. The witness testified that at midmorning of the day before the crime defendant and Karen visited him at his house; that after Karen left, defendant asked him to go to one Terry Sanders and pick up a quarter of a pound of \"crank\" (i.e., methedrine) and $800 in cash; and that the witness declined to do so for lack of time. Again defendant's motion to strike on the ground of irrelevancy was correctly denied. The testimony was relevant to an issue in the case, i.e., to defendant's theory that the murder\n\nwas committed by David Khan for the purpose of stealing money or drugs from the victim. Defendant had already elicited from Khan the admission that he needed money at the time he and his brother picked Karen up at the Robison house, and that he knew or had reason to know she might be in possession of a large amount of cash. The challenged testimony of Creech would support an inference that Karen did not in fact have the $800 or the drug in question on her person when she entered Khan's car because defendant had not yet obtained them from Sanders. The testimony thus had a \"tendency in reason to . . . disprove\" the proposed defense, and hence was relevant. (Evid. Code, § 210.)\n\nDefendant also criticizes a later colloquy on redirect examination of Creech. The witness admitted he had been engaged in criminal activities such as theft and drug traffic with \"different types of people,\" and that he feared retaliation by them because he was cooperating with the police. There ensued a brief inquiry in which the district attorney sought to make more specific the witness' reference to \"different types of people.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The trial court correctly overruled defendant's repeated objection that the inquiry was \"leading,\" as none of the questions \"suggests to the witness the answer that the examining party desires.\" (Evid. Code, § 764.) Changing his ground of objection, defendant now contends the testimony should have been excluded because it put before the jury evidence of \"other crimes\" he allegedly committed that was relevant\n\nsolely to show his general criminal disposition. (Id., § 1101, subd. (b).) Because of defendant's failure to make a timely and specific objection on this ground, however, the point must be deemed waived. (Id., § 353, subd. (a); People v. Welch (1972) 8 Cal. 3d 106, 114-115 [104 Cal. Rptr. 217, 501 P.2d 225], and cases cited.)\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nOn cross-examination defendant asked David Khan if to his knowledge Karen had been dealing in drugs. The district attorney objected on the ground of irrelevancy; and at a subsequent conference in chambers the court sustained the objection, finding that the question had no probative value on the issues of the case. Defendant's claim of error in this ruling is not well taken. He argues that an affirmative answer to the question would have tended to support his theory that Khan was the real murderer by providing a motive for the latter to have committed the crime. Defendant reasons that if Khan knew Karen was dealing in drugs he might have assumed she had either drugs or money in her possession when he picked her up on the day of the murder, and hence might have killed her for the purpose of robbery. It is settled, however, that evidence that a third person had a motive to commit the crime with which the defendant is charged is inadmissible if it simply affords a possible ground of suspicion against such person; rather, it must be coupled with substantial evidence tending to directly connect that person with the actual commission of the offense. (People v. Mendez (1924) 193 Cal. 39, 51-52 [223 P. 65], overruled on another point in People v. McCaughan (1957) 49 Cal. 2d 409, 420 [317 P.2d 974]; accord, People v. Whitney (1978) 76 Cal. App. 3d 863, 869 [143 Cal. Rptr. 301], and cases cited.) The rule is designed to place reasonable limits on the trial of collateral issues (Mendez, 193 Cal. at p. 52) and to avoid undue prejudice to the People from unsupported jury speculation as to the guilt of other suspects (People v. Arline (1970) 13 Cal. App. 3d 200, 204-205 [91 Cal. Rptr. 520]).\n\nThe record before us does not contain substantial evidence connecting Khan with Karen's murder, within the meaning of this rule. Defendant relies on testimony tending to show that Khan had an opportunity to kill Karen and was a man of violent propensities who used drugs. But such general proof of opportunity and criminal disposition raises at most a bare possibility that Khan might be the culprit. In Mendez this court approved of decisions holding that even evidence of threats made by the third person against the victim was insufficient for this purpose (193 Cal. at p. 51); a fortiori, evidence of mere opportunity and general disposition is inadequate. It follows that the court did not err in rejecting the testimony that defendant here sought to elicit.\n\nB\n\nThe next contention relates to an incident occurring during the direct testimony of Pamela Robison. According to police reports, the witness was prepared to testify that Karen stated to her she had a telephone conversation with defendant on the morning of October 11 in which she told defendant she intended to get an annulment and he replied he would kill her if she left him. Prior to the giving of such testimony, and outside the presence of the jury, defendant moved to exclude the evidence of Karen's statement reporting his threat to her life. He conceded the statement was not subject to a hearsay objection because it was not offered for the truth of the matter asserted, i.e., to prove that he actually uttered the threat; rather, it was offered as circumstantial evidence of the fact that Karen was in fear of him on the morning of the crime.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Evidence of Karen's fear, in turn, was relevant to an issue in the case, i.e., to the question whether she accompanied defendant later that day against her will and without her consent, within the meaning of the law of kidnaping. On its face, therefore, Karen's statement was admissible.\n\nDefendant's objection, however, was that because of the nature of the statement \"any probative value is greatly outweighed by its prejudicial effect.\" He thereby specifically invoked the discretion vested in the court by Evidence Code section 352 to exclude relevant evidence \"if its probative value is substantially outweighed by the probability that its admission will . . . create substantial danger of undue prejudice . . . .\" After arguing the point at some length, defendant reiterated that \"this statement is the essence of what the case is all about,\" and called on the court to \"exercise its jurisdiction, its authority to guarantee the fairness of the proceeding and exclude it.\"\n\nAs defendant correctly points out, the record does not show that the court did in fact discharge its statutory duty in these circumstances by weighing the statement's potential for prejudice against its probative value and concluding that the latter was not \"substantially outweighed\" by the former. Instead, the court simply ruled that it would deny defendant's motion and would admit the statement with a limiting admonition to the jury. The witness Robison was then permitted to recount Karen's statement relating defendant's threat. At the close of her direct testimony the court admonished the jurors that they could not consider the statement as proof of its truth, i.e., as proof that defendant actually made such a threat, but could consider it only for the limited purpose of showing Karen's state of mind at the time she related the statement to Robison.\n\nDefendant contends the ruling was error under People v. Ford (1964) 60 Cal. 2d 772 [36 Cal. Rptr. 620, 388 P.2d 892]. In that case the defendant urged that the trial court had abused its discretion in admitting six assertedly gruesome photographs of the murder victim's body; as to several of the photographs the court had expressly ruled that \"as long as it is material it can go in.\" Reversing on another ground, we addressed the issue for purposes of retrial: \"In the circumstances we need neither view these photographs nor determine whether their admission was prejudicial, for it appears on the face of the record that the trial court prima facie abused its discretion as a matter of law in failing to weigh the probative value of the photographs in resolving a material issue as against\n\nthe danger of prejudice to the defendant through needless arousal of the passions of the jurors.\" (Id. at p. 801; accord, People v. Davis (1965) 62 Cal. 2d 791, 797-798 [44 Cal. Rptr. 454, 402 P.2d 129].)\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe Attorney General responds that the record in the case at bar does not contain a similar affirmative showing that the trial court misunderstood its duty to weigh prejudice against probative value; here the record is simply silent on the point, and the Attorney General implies that in such event it should be assumed the court knew and performed its duty. The argument is untenable: in Ford (60 Cal. 2d at p. 801) we expressly directed that \"If these photographs are offered on retrial it will be the duty of the court to determine their admissibility in accordance with the above stated rule of law, and to make the fact apparent in the record.\" (Italics added.) It is true the case predated the adoption of the Evidence Code, but section 352 was merely a recodification of the existing statutory and decisional law applied in Ford. Moreover, since the enactment of section 352 the Ford requirement -- i.e., that on a motion invoking this ground the record must affirmatively show that the trial judge did in fact weigh prejudice against probative value -- has been reiterated both by the courts (People v. Holt (1972) 28 Cal. App. 3d 343, 353 [104 Cal. Rptr. 572] [disapproved on a different ground in Evans v. Superior Court (1974) 11 Cal. 3d 617, 625, fn. 6 [114 Cal. Rptr. 121, 522 P.2d 681]) and by the writers (e.g., Jefferson, op. cit. supra, § 22.1, pp. 289-290).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The cited authorities explain that the reason for the rule is to furnish the appellate courts with the record necessary for meaningful review of any ensuing claim of abuse of discretion; an additional reason is to ensure that the ruling on the motion \"be the product of a mature and careful reflection on the part of the judge,\" i.e., to \"promote judicial deliberation before judicial action\" (Mercer v. Perez (1968) 68 Cal. 2d 104, 113 [65 Cal. Rptr. 315, 436 P.2d 315] [requirement of written reasons for order granting new trial]).\n\nThe Attorney General next contends that the foregoing requirement was satisfied by the trial court's admonition to the jury (and later instruction\n\nto the same general effect) limiting consideration of Karen's statement to its nonhearsay use as circumstantial evidence of her state of mind. Again the argument is untenable. When evidence is admissible for one purpose but not for another, the decision of the trial court to give such an instruction is merely a prerequisite to admitting the evidence at all. (Evid. Code, § 355.) The party opponent is still entitled to have it excluded on motion under section 352 if the nature of the evidence is such that despite a cautionary instruction its limited probative value is substantially outweighed by the danger of undue prejudice from the jury's misuse thereof for an inadmissible purpose. (See, e.g., Hrnjack v. Graymar, Inc. (1971) 4 Cal. 3d 725, 729, 732-733 [94 Cal. Rptr. 623, 484 P.2d 599, 47 A.L.R.3d 224] [error to admit evidence that tort plaintiff received \"collateral source\" insurance payments, even though limited by instruction to plaintiff's motive in seeking medical help and his credibility as a witness]; People v. Gibson (1976) 56 Cal. App. 3d 119, 127, 129-131 [128 Cal. Rptr. 302] [error to admit evidence that murder defendant committed prior violent assaults, even though limited by instruction to defendant's state of mind -- i.e., his intent and motive -- at time of charged offense]; Cal. Law Revision Com., com. foll. Evid. Code, § 355; Jefferson, op.cit. supra, § 21.1, p. 255, caveat.)\n\nThat rule is applicable here. Testimony that a defendant threatened his victim prior to committing the crime charged is a particularly sensitive form of evidence of the victim's state of mind. In the case at bar it created a substantial danger that despite the limiting instruction, the jury -- consciously or otherwise -- might consider Karen's statement as evidence not only of her mental state but also of that of defendant, i.e., of the fact that defendant actually threatened to kill her if she left him and inferentially harbored an intent to do so; and the relevance of that intent to the crime charged should have been obvious. Accordingly, under the foregoing authorities the court erred in admitting Robison's testimony of Karen's statement without making an explicit determination that this risk of undue prejudice did not substantially outweigh the probative value of the evidence.\n\nDefendant nevertheless fails to demonstrate that the error resulted in a miscarriage of justice. (Cal. Const., art. VI, § 13.) Subsequent to the challenged testimony of Pamela Robison, David Khan took the stand and described in detail the events at the murder scene, including the conversation between defendant and Karen that he overheard while sitting on the front fender of his car. In that connection Khan testified,\n\ninter alia, that defendant demanded of his wife an explanation \"about the annulment,\" then reminded her \"he had told her once before\" that if she ever tried to leave him he would kill her. Because it was an admission of a party, this statement was not subject to a hearsay objection. (Evid. Code, § 1220.) It was therefore admitted for all purposes, including as proof of the fact asserted -- i.e., that defendant had indeed threatened to kill his wife. Thus the jury properly had before it in Khan's testimony the very statement that was erroneously admitted on an insufficient ruling in Robison's testimony. It has been held that an apparent Ford error is not prejudicial when the evidence in question is cumulative of other properly admitted evidence to the same effect. (People v. Bowen (1971) 22 Cal. App. 3d 267, 292-293 [99 Cal. Rptr. 498].) Defendant claims the testimony of Robison is not merely cumulative because she was a more credible witness than Khan and her testimony thus corroborated his.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Nevertheless, after a review of the entire record we are of the opinion that it is not reasonably probable that a result more favorable to defendant would have occurred in the absence of this error. (People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].)\n\nC\n\nDefendant assigns as prejudicial misconduct some nine remarks by the district attorney in the course of his closing argument to the jury. At trial, however, defendant failed to object to any of these remarks except the last. As to each of the first eight instances, therefore, defendant is deemed to have waived the objection and the point cannot be raised on appeal. (People v. Reyes (1974) 12 Cal. 3d 486, 505 [116 Cal. Rptr. 217, 526 P.2d 225]; People v. Brice (1957) 49 Cal. 2d 434, 437 [317 P.2d 961]; People v. Adamson (1946) 27 Cal. 2d 478, 494 [165 P.2d 3], affd. sub nom. Adamson v. California (1947) 332 U.S. 46 [91 L.Ed. 1903, 67 S.Ct. 1672, 171 A.L.R. 1223]; People v. Fleming (1913) 166 Cal. 357, 376-377 [136 P. 291]; People v. Simon (1927) 80 Cal. App. 675, 678-679 [252 P. 758], and cases cited.) The reason for this rule, of course, is that \"the trial court should be given an opportunity to correct the abuse and thus, if possible, prevent by suitable instructions the harmful effect upon the minds of the jury.\" (Simon, at p. 679 of 80 Cal. App.; accord, People v. MacDonald (1914) 167 Cal. 545, 551 [140 P. 256].)\n\nSeeking to surmount this barrier, defendant invokes a line of cases reciting that there are two exceptions to the general requirement of a timely objection to prosecutorial misconduct: first, when the case is \"closely balanced,\" the defendant's guilt is in \"grave doubt,\" and the misconduct \"contributed materially to the verdict\"; second, when an objection would be futile because in the circumstances a retraction by the prosecutor or an admonition by the court could not obviate the prejudicial effect of the misconduct on the jury. (People v. Chi Ko Wong (1976) 18 Cal. 3d 698, 723-724 [135 Cal. Rptr. 392, 557 P.2d 976]; People v. Chojnacky (1973) 8 Cal. 3d 759, 765-766 [106 Cal. Rptr. 106, 505 P.2d 530]; People v. Perry (1972) 7 Cal. 3d 756, 790-791 [103 Cal. Rptr. 161, 499 P.2d 129].) Defendant claims that both these exceptions apply in the case at bar; we conclude on the contrary that the first is not properly an exception to the objection requirement, and that the second is unsupported by the record.\n\nThe belief that a failure to object to prosecutorial misconduct is excused when the misconduct \"contributed materially to the verdict\" can be traced back to misleading language in the opinion of this court in People v. Berryman (1936) 6 Cal. 2d 331, 337 [57 P.2d 136]. Prior to that time, the cases had established two distinct rules of law on this topic. First, it was settled that a defendant cannot complain on appeal of prosecutorial misconduct at trial unless he made a timely objection thereto and requested that the jury be instructed to disregard the improper remark. (People v. Nakis (1920) 184 Cal. 105, 116 [193 P. 92]; People v. Beggs (1918) 178 Cal. 79, 92 [172 P. 152]; People v. Kromphold (1916) 172 Cal. 512, 522 [157 P. 599]; People v. Kizer (1913) 22 Cal. App. 10, 20 [133 P. 516, 521, 134 P. 346], and cases cited.) It was also clear that \"There is, however, a well-recognized exception to this general rule, and the exception is simply this: Where an examination of the entire record fairly shows that the acts complained of are of such a character as to have produced an effect which, as a reasonable probability, could not have been obviated by any instructions to the jury, then the absence of such assignment and request will not preclude the defendant from raising the point in this court.\" (Simon, at p. 679 of 80 Cal. App.; accord, People v. West (1932) 215 Cal. 87, 96 [8 P.2d 463].) The exception flowed logically from the purpose of the objection rule: if as noted above the requirement of an objection is intended to give the trial court the opportunity to cure the harm by an appropriate instruction, objection is an idle act when it is reasonably probable that no such cure will follow.\n\nThe second rule provided that if the defendant did object and the court gave the requested instruction, it would ordinarily be presumed that the jury heeded the admonition and the error was cured. (People v. Perry (1904) 144 Cal. 748, 752-753 [78 P. 284]; People v. Mathews (1903) 139 Cal. 527, 528 [73 P. 416]; People v. Ho Kim You (1914) 24 Cal. App. 451, 467 [141 P. 950], and cases cited.) Because he had preserved his record, however, the defendant in such a case was nevertheless entitled to raise the error on appeal and contend that despite the admonition the misconduct required reversal of his conviction. If he did so, the appellate court was bound to resolve his contention by application of the constitutional standard for review of a claim of prejudicial error (art. VI, § 4-1/2, now § 13), i.e., that the judgment will not be reversed unless the court is of the opinion on the whole record that the error resulted in a miscarriage of justice. (See, e.g., People v. Loomis (1915) 170 Cal. 347, 351 [149 P. 581] [judgment affirmed]; People v. Fleming (1913) supra, 166 Cal. 357, 381 [judgment reversed].) And in determining whether there was a miscarriage of justice, the court considered such factors as whether the evidence was close and the defendant's guilt in doubt, whether the misconduct was deliberate and repeated, and whether it was likely to have contributed materially to the verdict. (People v. Fleming, supra, 166 Cal. at p. 381; People v. Ho Kim You, supra, 24 Cal. App. at pp. 467-469; accord, People v. Anthony (1921) 185 Cal. 152, 159 [196 P. 47].) It is apparent that this inquiry is not so much an \"exception\" to the second rule as its corollary: if the defendant is permitted to complain on appeal that the misconduct requires reversal despite the admonition, the court must weigh that claim by settled standards of appellate review.\n\nIn People v. Berryman, however, this court adopted a method of analyzing such a claim that was both confused and confusing. In his closing argument in that case the district attorney exhorted the jury that \"this whole county, this whole state is watching what you do today upon this case.\" The defendant promptly assigned the remark as misconduct; the court agreed the argument was improper, directed counsel to refrain from such argument, and instructed the jury to disregard it. (6 Cal. 2d at pp. 336-337.) On appeal to this court, the defendant contended inter alia that the prosecutor's remark constituted such serious misconduct as to prejudice his right to a fair trial. Because the defendant had made a timely objection to the remark and obtained a cautionary instruction, there was no occasion for this court to invoke either the rule requiring such an objection or the exception thereto applicable when such an instruction would be futile; the defendant was manifestly entitled to\n\ncomplain of the remark on appeal, and the only true issue was whether despite the admonition the misconduct resulted in a miscarriage of justice when the evidence was viewed as a whole.\n\nNevertheless, the Berryman opinion began its analysis of the point (id. at p. 337) by reiterating the requirement of a timely objection and, what is worse, combining that requirement into a single so-called \"general rule\" with the above-discussed principle of cure by admonition. To compound the confusion, the opinion also combined the foregoing corollaries to each of these separate principles, characterizing them merely as \"two exceptions to this general rule.\" The paragraph that emerged is set forth in the margin.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nOn closer inspection this passage of Berryman turns out to be largely a paraphrase of one of the authorities it cites, section 603 of 8 California Jurisprudence, Criminal Law, and it demonstrates the pitfalls of uncritical reliance on such a secondary source. Section 603 states, correctly enough, the rule that prosecutorial misconduct is ordinarily presumed to be cured by a proper admonition. (Id. at p. 623.) It also correctly states the above-discussed corollary thereto, i.e., that despite such an admonition a miscarriage of justice requiring reversal may be found if there is grave doubt of guilt and the misconduct contributes materially to the verdict. (Id. at p. 625.)\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e But the section also asserts \"There may be cases\" in which the misconduct is \"of such a character\n\nthat a harmful result cannot be obviated\" by a cautionary instruction, and \"In such cases\" the misconduct will \"furnish ground for reversal\" despite the giving of that instruction. (Id. at pp. 623-624.)\n\nIt was the latter assertion that ultimately misled the courts. Upon analysis it appears that all the cases cited in section 603 that actually reversed a judgment on the latter ground predated the 1911 constitutional requirement of a miscarriage of justice.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e They were therefore decided under a very different rule of prejudice -- i.e., that every conviction after a trial in which prosecutorial misconduct occurred must be reversed \"unless it is clear that the verdict was not affected thereby.\" (Italics added.) (People v. Ah Len (1891) 92 Cal. 282, 285 [28 P. 286].) Under that test it was inevitable that any instance of misconduct \"of such a character that a harmful result cannot be obviated\" by instruction would be deemed reversible, regardless of the state of the record as a whole. Yet if there ever was such a separate ground of reversal in misconduct cases, it was superseded in 1911 by the new constitutional test of prejudice: thereafter an instance of misconduct not curable by instruction was not reversible unless the appellate court found on the whole record that it resulted in a miscarriage of justice. By ignoring this distinction section 603 was at best incomplete and at worst misleading; and by copying the language of section 603 and flatly declaring it to constitute an \"exception\" separate and distinct from the miscarriage of justice test, the Berryman court fell into the trap thus laid for it.\n\nFor our purposes, however, another consequence of this error was even more serious. Apparently because the \"exception\" for misconduct not curable by instruction was also a settled exception to the requirement of timely objection, the Berryman court decided to add the latter to the rule it was attempting to state. Thus the first sentence of the paragraph in question (fn. 13, ante), purporting to set forth the \"general rule\" governing appellate review of claims of prosecutorial misconduct, was a paraphrase of the first sentence of section 603; but whereas the latter was limited to a statement that such misconduct will ordinarily not result in reversal if the court gave a proper admonition (8\n\nCal.Jur. at p. 623), the Berryman version of that statement inserted as an alternative ground of affirmance, \"where no objection is made to such misconduct by the defendant . . . .\" The addition of this dictum was ill-advised. Without the dictum the sentence would have been wordy but correct; with the dictum it defies useful application. The reason that misconduct occurring without objection does not \"furnish ground\" for reversal is because the defendant is not allowed to raise the point on appeal; on the other hand, misconduct followed by a successful objection does not \"furnish ground\" for reversal for the very different reason that the ensuing admonition is presumed to cure the harm. To join these wholly distinct principles into a single \"rule\" is to make the rule so \"general\" as to be of virtually no practical value; it is as if a zoologist were to announce that an elephant resembles a mouse in that both are animals.\n\nBut the sentence was not only uninformative, it was also mischievous: it unwittingly set a second trap into which this court soon fell. In Berryman, as we have seen, the defendant voiced a prompt objection to the claimed misconduct and obtained a cautionary instruction; but by extending its \"general rule\" to include in dictum cases in which such an objection was not made, Berryman created the risk that when one of the latter cases arose the court would invoke the rule and apply to that situation both of these \"exceptions.\" And that is precisely what happened. In People v. Sampsell (1950) 34 Cal. 2d 757, 762-764 [214 P.2d 813], the defendant failed to object to misconduct at trial yet attempted to raise the claim on appeal. In rejecting the claim this court correctly held the omission was not excused on the ground that an objection would have been futile. But the court went on to hold, \"Nor does the case fall within another exception as stated in People v. Berryman, 6 Cal. 2d 331, 337 [57 P.2d 136]: '. . . where the case is closely balanced and there is grave doubt of defendant's guilt, and the acts of misconduct are such as to contribute materially to the verdict, a miscarriage of justice results requiring a reversal. (People v. Fleming, 166 Cal. 357 . . . . )'\"\n\nSimilar opinions followed (e.g., People v. Lyons (1958) 50 Cal. 2d 245, 261-262 [324 P.2d 556]; People v. Wein (1958) 50 Cal. 2d 383, 396 [326 P.2d 457] [overruled on another ground in People v. Daniels (1969) 71 Cal. 2d 1119, 1140 (80 Cal. Rptr. 897, 459 P.2d 225, 43 A.L.R.3d 677)]; People v. Perez (1962) 58 Cal. 2d 229, 247 [23 Cal. Rptr. 569, 373 P.2d 617, 3 A.L.R.3d 946]), until the now-truncated \"rule\" with its dual \"exceptions\" became reduced to a brief formula:\n\n\"Misconduct in argument may not be assigned on the appeal if it is not assigned at the trial, unless the misconduct contributed to the verdict or was so unredeemable that nothing whatever would have cured it. (People v. Berryman, 6 Cal. 2d 331, 337 [57 P.2d 136].)\" (Italics added.) (People v. Rosoto (1962) 58 Cal. 2d 304, 357 [23 Cal. Rptr. 779, 373 P.2d 867]; accord, People v. Golston (1962) 58 Cal. 2d 535, 541 [25 Cal. Rptr. 83, 375 P.2d 51]; People v. Mitchell (1966) 63 Cal. 2d 805, 809 [48 Cal. Rptr. 371, 409 P.2d 211]; People v. Beivelman (1968) 70 Cal. 2d 60, 75 [73 Cal. Rptr. 521, 447 P.2d 913].)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Such formulas tend to discourage inquiry into their validity, and acquire the air of impregnability that surrounds black-letter law.\n\nFinally, in its most recent manifestation the Berryman language was restated as follows: \"Such misconduct must be assigned as error at trial with a request that the jury be instructed to disregard its effect, unless (1) in a closely balanced case presenting grave doubt as to the defendant's guilt the misconduct contributed materially to the verdict or (2) the harmful results could not have been obviated by a timely admonition to the jury. [Citations, including Berryman.] The alleged misconduct was not assigned as error at trial and neither exception to the general rule is shown to be applicable in the instant case.\" (Italics added.) (People v. Chi Ko Wong (1976) supra, 18 Cal. 3d 698, 723-724.) We have thus come full circle: the \"general rule\" stated in the source that Berryman paraphrased (8 Cal.Jur. at p. 623) was the presumption of cure by admonition; the \"general rule\" stated in Berryman was that presumption or a waiver by failure to object; and the \"general rule\" now stated in the cases is the latter alone. The dictum, in short, has swallowed the rule, and at the end of this convoluted evolution two principles that originally were wholly unrelated -- the objection requirement and the constitutional test of a miscarriage of justice -- have not only become linked but the latter is now said to be an \"exception\" to the former.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nSeen in this light, it seems plain that the proposition that the miscarriage of justice test is an \"exception\" to the objection requirement has\n\nno historical legitimacy. Nor did it acquire that dignity through repetition: in virtually every case in which the court reiterated this \"exception\" to the objection requirement and actually excused a failure to object, the excusal was in fact premised on the other -- and correct -- exception to the requirement, i.e., that the misconduct was not curable by instruction. Moreover, throughout this same evolution of the Berryman \"rule,\" a parallel line of cases in this court ignored Berryman and discussed only the correct exception to the objection requirement.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Finally, the Berryman \"exception\" will not withstand analysis: it is not difficult to conceive of prosecutorial misconduct that if uncorrected would \"contribute materially to the verdict,\" yet remains easily curable by a prompt instruction to the jury; a misstatement by counsel of a controlling rule of law comes immediately to mind.\n\nOn the point here in issue, therefore, Berryman and its progeny should no longer be followed. Rather, the initial question to be decided in all cases in which a defendant complains of prosecutorial misconduct for the first time on appeal is whether a timely objection and admonition would have cured the harm. If it would, the contention must be rejected (see, e.g., People v. Nicolaus (1967) supra, 65 Cal. 2d 866, 881); if it would not, the court must then and only then reach the issue whether on the whole record the harm resulted in a miscarriage of justice within the meaning of the Constitution. (See, e.g., People v. Kirkes (1952) supra, 39 Cal. 2d 719, 726-727 [judgment reversed]; People v. Kizer (1913) supra, 22 Cal. App. 10, 20-21 [judgment affirmed].)\n\nTurning to the facts of the case at bar, we apply the foregoing analysis to the eight instances of alleged prosecutorial misconduct as to which defendant made no objection at trial. They include remarks in which the district attorney expressed his disbelief of defendant's alibi, his denial of a conspiracy between his office and the prosecution witnesses, and his reason for not calling certain persons to testify, together with his partial misstatement of the law of reasonable doubt. Without deciding whether those remarks constituted misconduct, we have examined\n\neach in context and are of the view that any harm flowing therefrom could have been cured by appropriate admonition. There is accordingly no ground to excuse defendant from the general requirement of a timely objection, and the point must be deemed waived.\n\nThe sole remark to which defendant did object occurred when the district attorney concluded his argument by saying to the jurors, \"I appreciate your attention, your being here, and I ask you to consider carefully all of that evidence, the instructions, and reach a fair, just, honest conclusion. I'm convinced in my mind it will be the same conclusion I reached several months ago.\" Defendant objected this was improper argument because the prosecutor \"expressed his opinion and his conclusion,\" but the objection was overruled.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Defendant now contends the prosecutor's reference to \"the same conclusion I reached several months ago\" caused a miscarriage of justice and requires that the judgment be reversed.\n\nA review of the prosecutor's entire argument to the jury persuades us that defendant exaggerates the effect of this remark. In contrast to the cases relied on by defendant, the district attorney did not expressly tell the jury that he would not have prosecuted defendant unless he personally believed him guilty. (See, e.g., People v. Bain (1971) 5 Cal. 3d 839, 848 [97 Cal. Rptr. 684, 489 P.2d 564]; People v. Kirkes (1952) supra, 39 Cal. 2d 719, 723; People v. Edgar (1917) supra, 34 Cal. App. 459, 468.) It is true that the remark, when viewed in isolation, implied that the district attorney believed in defendant's guilt prior to trial, and the cases just cited disapprove such an argument. But they do so because of the risk that the jury will infer that the prosecutor's belief is based at least in part on proof of guilt that was not -- and perhaps could not have been -- introduced at the trial. The record shows no such risk here. Throughout his argument, the district attorney repeatedly emphasized to the jurors that any opinion he expressed to them concerning defendant's guilt was based on the evidence and legitimate inferences therefrom,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and he reminded them again and again that they were the sole judges of the facts and their verdict must be based on their own\n\nconclusion as to the evidence. Thus just before making the statement now criticized, the district attorney told the jurors: \"Ladies and gentlemen, I would submit to you that a review, conscientious one, which I know you would do [of] all the evidence will leave you of the opinion the defendant is guilty beyond a reasonable doubt, not only of the first degree murder, but of robbery and kidnap in the commission of the offenses he engaged in that day.\" Finally, immediately after the challenged reference to his own \"conclusion,\" the district attorney added by way of explanation: \" If indeed that's your conclusion as I stated, I ask you to return a guilty verdict against the defendant as charged . . . .\" In these circumstances the remark in question cannot have misled the jury into believing the prosecutor was asking for a verdict based on his opinion and on evidence not introduced at trial. While assertions of this nature are fraught with risks and should be avoided, in the case at bar we conclude from the whole record that the remark did not result in a miscarriage of justice.\n\nD\n\nPenal Code section 1127c provides that when the prosecution relies on evidence of flight by the defendant after a crime is committed as tending to show his consciousness of guilt, the jury shall be instructed that it may consider that evidence in deciding guilt or innocence and shall give it such weight as it deserves. Urging in effect that the opposite rule should also prevail, defendant contends the trial court erred in refusing to give his proferred instruction that the absence of flight by a suspect may be considered by the jury as circumstantial evidence that he had an innocent frame of mind.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe Attorney General first responds that the instruction was properly refused in this case for lack of evidentiary support. (People v. Terry (1970) 2 Cal. 3d 362, 402 [85 Cal. Rptr. 409, 466 P.2d 961].) Following a suggestion of the trial court, he asserts there is in fact evidence of \"flight\" by defendant, to wit, that after attempting to obliterate all identifying marks on Karen's body defendant said to David Khan, \"we better get the hell out of here,\" and the two then drove back to Sacramento. The argument is unpersuasive. The homicide was committed in\n\na remote area and at night; it can hardly be expected that defendant would wait in that location until the victim was reported missing, a search was organized, and the crime was discovered, a process that might have taken days or longer. In these circumstances the fact that he and Khan left the scene and returned to their homes is of no sinister significance whatever. In urging otherwise, the Attorney General ignores the warning of the courts not to confuse a mere departure from the scene of the crime with a deliberate flight from the area in which the suspect is normally to be found. (See, e.g., People v. Brecker (1912) 20 Cal. App. 205, 216 [127 P. 666]; State v. Lincoln (1969) 183 Neb. 770 [164 N.W.2d 470, 472]; State v. Sullivan (1964) 43 N.J. 209 [203 A.2d 177, 192-193].) In the case at bar that area was Sacramento, and the evidence showed that defendant remained in his home surroundings for some two weeks after the crime. He did not go into hiding, but continued to visit his friends as before; indeed, during that period he even contacted the police and volunteered statements about his wife's movements on the day of the murder. It is this evidence upon which defendant based his request for an instruction on absence of flight.\n\nDefendant relies on the rule that he \"has a right to an instruction that directs attention to evidence from a consideration of which a reasonable doubt of his guilt could be engendered.\" (People v. Sears (1970) 2 Cal. 3d 180, 190 [84 Cal. Rptr. 711, 465 P.2d 847].) But the problem is not so much his right to an instruction on absence of flight as the admissibility of the evidence to support it. A century ago this court held such evidence inadmissible in People v. Montgomery (1879) 53 Cal. 576. There the defendant sought to prove, as circumstantial evidence of innocence, that while confined in jail awaiting trial he had an opportunity to escape but declined to do so. The evidence was excluded, and this court approved the ruling. The court held in effect that evidence that a suspect did not flee when he had the chance was of little value as tending to prove innocence because there are plausible reasons why a guilty person might also refrain from flight: \"He may very naturally have been deterred from making an effort to escape from a fear that he would be recaptured, and that his fruitless attempt to escape would be evidence of guilt; or he may have felt so strong a confidence of his acquittal, for want of the requisite proof of his guilt, that he deemed it unnecessary to flee.\" (Id. at pp. 577-578.)\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nDefendant seeks first to limit the holding of Montgomery to its facts, drawing a distinction between a postarrest refusal to escape from jail and a prearrest absence of flight to avoid such incarceration. But no such distinction appears tenable, as the significance of the latter is, if anything, even more speculative than the former. Although an accused awaiting trial may be concerned that an attempt at evasion will be used against him in court, a person not in custody may even more plausibly fear that his sudden departure from the jurisdiction will call police attention to him in the first place; and while a suspect in jail may not try to escape because he is confident of acquittal, a person still at large may refrain from fleeing because he is even more convinced that he will never be identified as the culprit. For these reasons the courts have uniformly declined to draw the line now proposed by defendant.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIt is next contended that even if absence of flight thus gives rise to several inferences, the evidence is admissible if at least one of such inferences -- i.e., defendant's innocent state of mind -- is relevant. The real issue here, however, is not whether this evidence is relevant but whether it should be excluded despite its relevance. As noted earlier, Evidence Code section 352 codifies the long-standing rule that relevant evidence may be excluded if its probative value is substantially outweighed by the risk of prejudice. The rule also applies if that value is outweighed by the probability that admission of the evidence will create a substantial danger \"of confusing the issues, or of misleading the jury.\" (Ibid.) Each of the latter consequences would be threatened by the introduction of evidence of absence of flight.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Against this manifest risk of\n\nconfusion and delay is to be weighed the probative value of the evidence in question: for the reasons given above the absence of flight is so ambiguous, so laden with conflicting interpretations, that its probative value on the issue of innocence is slight. Although such a weighing process is ordinarily performed by the trial court as a question of fact, the Montgomery rule thus embodies the view of this court that in all cases the scales tip so heavily against admission of evidence of absence of flight that it must be excluded as a matter of law.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nWe recognize that in the case at bar the evidence upon which defendant relies to show absence of flight was already in the case, having been introduced by prosecution witnesses as part of their narrative of the events following the crimes and leading to defendant's arrest. From the fact that such evidence may properly be admitted for one purpose, however, it does not follow that defendant is entitled to an instruction thereon for an entirely different purpose: the risk of confusing the issues or misleading the jury remains unabated. The trial court ruled on the request during the presentation of defendant's case; thus if the court had agreed to give the instruction, the prosecution could well have put on rebuttal evidence on the issue. (See fn. 24, ante.) And even without such evidence, the instruction would have injected a new issue into the jury's deliberations and invited the kind of speculation that the Montgomery rule seeks to avoid. We conclude that the trial court did not err in refusing to give the proferred instruction.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nE\n\nAt the request of the People the trial court gave CALJIC No. 2.03, which states that the jury may consider as evidence tending to prove consciousness of guilt any false or deliberately misleading statements the defendant made prior to trial concerning the crimes charged against him; the instruction adds that such evidence is not sufficient in itself to prove guilt, however, and its weight and significance remain for the jury to determine. Defendant contends it was error to give this instruction because it lacked evidentiary support. He claims the instruction was predicated solely on the pretrial oral and written statements he gave to Sutter County Sheriff's Detective Davis, in which he recounted that at 5 p.m. on the day of the murder he received a telephone call from Karen telling him she needed transportation to the Stickey Wicket bar and that he sent Dave Khan to pick her up for this purpose. Reliance is then placed on People v. Rubio (1977) 71 Cal. App. 3d 757, 769 [139 Cal. Rptr. 750] (disapproved on another ground in People v. Freeman (1978) 22 Cal. 3d 434, 438 [149 Cal. Rptr. 396]) for the proposition that it is error to give CALJIC No. 2.03 when the sole evidence that the defendant's pretrial statements are false is their inconsistency with the prosecution's case at trial.\n\nThe contention is both legally and factually untenable. Rubio does not stand for the broad proposition asserted, but rather for the more modest view that when a defendant testifies in a manner consistent with his pretrial statements to the police but inconsistent with the prosecution's case at trial, CALJIC No. 2.03 should not be given because in\n\nthat event it necessarily \"casts specific doubt on a defendant's credibility as a witness and singles out defendant's testimony as subject to more particular scrutiny than that attached to prosecution witnesses.\" (71 Cal. App. 3d at p. 769.) Inasmuch as defendant did not testify in the case at bar, the harm identified in Rubio could not have flowed from the giving of the instruction.\n\nNor is it true, as defendant asserts, that the instruction was based solely on his statements to Detective Davis. As we have seen, the record is replete with testimony by other witnesses relating different versions of the critical events told to them by defendant shortly after the murder.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e In one instance the witness (David Khan) actually described the fabrication of an alibi by defendant; while defendant's stories related by the other witnesses, including Detective Davis, were for the most part inconsistent with each other. In these circumstances the jury could reasonably infer they were all false and were deliberately invented by defendant to shift suspicion away from him. Such evidence supports an inference of consciousness of guilt (People v. Showers (1968) 68 Cal. 2d 639, 643 [68 Cal. Rptr. 459, 440 P.2d 939]; People v. Osslo (1958) 50 Cal. 2d 75, 93 [323 P.2d 397]; People v. Albertson (1944) 23 Cal. 2d 550, 581-582 [145 P.2d 7] (conc. opn. of Traynor, J.)) and hence warrants the giving of CALJIC No. 2.03.\n\nF\n\nOn February 15, 1978, prior to the start of trial, defendant subpoenaed Donnie Khan to testify in his behalf. Khan did not appear, and on March 2, during presentation of the People's case in chief, defendant obtained a bench warrant for his arrest. The next day the People rested and defendant began putting on his case while efforts to serve the warrant continued. On March 7 defendant advised the court he had no further witnesses to call and Khan had not yet been found; the court\n\nadjourned the proceedings and requested an offer of proof. On March 8 defendant made the offer, informing the court that prior to trial Khan told defense counsel in a tape-recorded statement that on the day of the murder he saw Karen and his brother David drive away from the Scott-Reeves house without defendant, and that he did not see defendant at the house at that time.\n\nThe court granted a continuance until Monday, March 13, to locate Khan and another missing witness. On the latter date the second witness appeared and testified, but Khan could still not be found. Defendant rested without requesting a further continuance, and after a brief rebuttal the parties made their closing arguments to the jury. On March 14 the court gave its instructions and the jury began deliberating. On the morning of March 15 defendant advised the court he had learned that Khan had reported to the Sacramento County jail on the previous day to begin serving a sentence. Defendant then moved to reopen the proceedings to take Khan's testimony. The prosecutor objected on two grounds, to wit, that the court has no authority to reopen after deliberations have begun and that in any event Khan's proposed testimony had already been put before the jury by other witnesses. The court denied the motion on the former ground, ruling that it lacked authority to reopen under the circumstances. Defendant now contends the ruling was both erroneous and prejudicial.\n\nThe Attorney General concedes it was erroneous. The trial court has authority to order a case reopened for good cause even after jury deliberations have begun. (Pen. Code, § 1094; People v. Christensen (1890) 85 Cal. 568, 578 [24 P. 888]; People v. Frohner (1976) 65 Cal. App. 3d 94, 109-111 [135 Cal. Rptr. 153]; People v. Newton (1970) 8 Cal. App. 3d 359, 383 [87 Cal. Rptr. 394]; see generally Annot., 87 A.L.R.2d 849, 851 et seq.) Although the decision to grant or deny a motion to reopen remains in the discretion of the trial court, there is no issue here, contrary to the cited cases, as to whether the court abused that discretion. Rather, the court simply did not exercise its discretion upon defendant's motion, and the error lay in its failure to do so.\n\nFor this reason the Attorney General's contention that defendant did not use due diligence to secure Khan's attendance at trial (by requesting one more continuance on Mar. 13) wholly misses the point. Whether a defendant exercised due diligence to locate a missing witness or discover new evidence is relevant to the issue of abuse of the court's discretion in denying a motion to reopen (People v. Newton, supra, at\n\np. 383 of 8 Cal. App. 3d); it is irrelevant, however, to the only question before us when the court errs in failing to exercise that discretion, i.e., whether the error resulted in a miscarriage of justice under article VI, section 13, of the Constitution.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nOn the record of the case at bar we find the error to be nonprejudicial. In his cross-examination of Larry Creech defendant established that after the preliminary hearing this witness arranged a meeting between Donnie Khan and defense counsel at the latter's request and in the latter's office; that Khan attended the meeting voluntarily, saying he wanted to talk with defendant's counsel about the events of the day of the murder (Oct. 11); and that Creech did not direct Khan to lie or in any way tell him what to say. Creech then testified that in his presence\n\ndefense counsel questioned Khan and tape-recorded his answers; and that in the course of listening to the exchange he heard Khan state to defense counsel that on October 11 he and his brother David brought Karen to the Scott-Reeves house, he got out of the car, and David and Karen drove away alone, and that he did not see defendant anywhere at the house at that time. Creech's testimony thus put before the jury the very statement that defendant offered to elicit from Donnie Khan if the proceedings were reopened. Defendant argues the latter testimony would not be merely cumulative because it would have a greater impact if presented by Khan. Nevertheless, after a review of the entire record we are of the opinion that it is not reasonably probable that a result more favorable to defendant would have occurred in the absence of the court's error in ruling on the motion to reopen. (People v. Watson (1956) supra, 46 Cal. 2d 818, 836.)\n\nG\n\nIn his petition for habeas corpus defendant contends he was deprived of the effective assistance of counsel because his trial attorney failed to move for a change of venue. The material factual allegations on this point are not in dispute, and we may therefore resolve the issue without resort to an evidentiary hearing. (People v. Frierson (1979) 25 Cal. 3d 142, 160 [158 Cal. Rptr. 281, 599 P.2d 587].)\n\nThere is no doubt that upon a proper showing a defendant is entitled to a writ of habeas corpus setting aside his judgment of conviction on the ground that his trial attorney's failure to make or support a motion for change of venue denied him effective assistance of counsel. (In re Miller (1973) 33 Cal. App. 3d 1005, 1011-1014 [109 Cal. Rptr. 648].) As in cases raising this issue on appeal, however, the burden is on the petitioner for the writ to demonstrate that a motion for change of venue would have been made in the circumstances by a reasonably competent attorney acting as a diligent, conscientious advocate. (People v. Pope (1979) 23 Cal. 3d 412, 423-425 [152 Cal. Rptr. 732, 590 P.2d 859] [appeal]; People v. Frierson, supra, 25 Cal. 3d at pp. 158-166 [habeas corpus].) Defendant fails to sustain that burden.\n\nAppended to the petition for habeas corpus is a declaration under penalty of perjury by defendant's trial counsel, David Weiner. On the present issue he states that he \"was aware of and read the pretrial newspaper publicity about the case and discussed it with Mr. Green [defendant] several times in considering filing a change of venue motion.\n\nOther factors discussed were increased costs of defense and my unavailability if the case were tried in a distant county.\" He concludes that it was \"Mr. Green's decision\" to proceed with a trial in Sutter County rather than seek a change of venue.\n\nDefendant contends the affidavit discloses two reasons for his counsel's inaction that support the claim of ineffective assistance. First, defendant attempts to bring the case within the rule that counsel's ignorance of \"easily discoverable case law\" is evidence of incompetent representation. (People v. Ibarra (1963) 60 Cal. 2d 460, 464-466 [34 Cal. Rptr. 863, 386 P.2d 487]; In re Greenfield (1970) 11 Cal. App. 3d 536, 544 [89 Cal. Rptr. 847].) In his affidavit, Mr. Weiner states he was \"not aware\" of the decision in McGown v. Superior Court (1977) 75 Cal. App. 3d 648 [142 Cal. Rptr. 262], which holds that after a motion for change of venue is granted the movant is entitled to an evidentiary hearing to determine the county to which the case will be transferred. Defendant argues that if Mr. Weiner had known of McGown he could have advised him that a change of venue might not in fact increase the costs of defense or affect their attorney-client relationship. The short answer is that the McGown decision was not rendered until December 5, 1977, and did not even appear in the advance sheets of the California Official Reports until December 20, 1977 -- i.e., one month after the newspaper coverage of the events herein ended and three weeks after defendant was formally charged with the crime. At the time when it might have been relevant, therefore, the McGown rule was manifestly not \"easily discoverable case law\" within the meaning of Ibarra.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nSecondly, defendant relies on the rule recently reiterated in People v. Corona (1978) 80 Cal. App. 3d 684, 720 [145 Cal. Rptr. 894], that effective assistance includes not only professional competence but also \"the requirement that the services of the attorney be devoted solely to the interest of his client undiminished by conflicting considerations . . . .\" Stressing Mr. Weiner's reference in his affidavit to his \"unavailability if the case were tried in a distant county,\" defendant implies that his\n\ncounsel's advice on the question of change of venue was tainted by his aversion to conducting a trial in such a county.\n\nDefendant again overstates the case. Of course it would be impermissible for an attorney to refrain from moving for a change of venue, or to advise against such a motion, simply because of an undisclosed desire to avoid any personal inconvenience resulting from an new place of trial. But there is nothing improper in a privately retained attorney discussing with his client, among other factors for the latter to weigh in making his decision, the fact that a change of venue to a distant county might make it difficult for counsel to continue with the representation. From the affidavit as a whole it fairly appears that defendant's decision to stand trial in Sutter County was reached voluntarily and on the basis of Mr. Weiner's full disclosure of the competing considerations. This is a far cry from Corona, in which defense counsel took a position virtually adverse to his allegedly mentally disturbed client while exploiting a sweeping grant of literary rights to the case extracted from the client as the price of his defense.\n\nIn the alternative, defendant in effect disregards the affidavit and contends that a competent attorney acting as a diligent advocate would have filed -- presumably over defendant's objection -- a motion for change of venue in this case. The record does not support the claim. Such a motion will lie when \"it appears there is a reasonable likelihood that a fair and impartial trial cannot be had\" in the county in which the action is pending. (Pen. Code, § 1033, subd. (a); Maine v. Superior Court (1968) 68 Cal. 2d 375, 383-384 [66 Cal. Rptr. 724, 438 P.2d 372].) Adverting to the factors identified in our decisions as bearing on this issue, we observe first that although the offense here in issue was doubtless very serious -- as indeed is every murder -- it did not have the sensational overtones of other killings that have been held to require a change of venue, such as an ongoing crime spree, multiple victims often related or acquainted, or sexual motivation. It is true the place of trial was not a large metropolitan center, but neither was it a rural outback.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Defendant was admittedly a stranger to the community; but so also was the victim, and her death did not trigger tangible manifestations of public sympathy and support. The local newspaper accounts of the crime were frequent during the few weeks following the event; yet the accounts were predominantly factual, and contained little potentially\n\ninflammatory matter\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e and no revelations of incriminating evidence that was not properly admitted at the trial. Moreover, the newspaper accounts ceased after defendant was arrested and charged with the crime, and there was virtually no publicity about the case during the ensuing three months until trial. At that time the voir dire disclosed that few prospective jurors had any significant recollection of the media coverage, and each of the jurors selected was either unfamiliar with the case or had formed no opinion as to defendant's guilt or innocence. Finally, defendant used only half of his allotted number of peremptory challenges, and accepted the jury as thus constituted.\n\nWe have recently held that a similar set of facts does not require a change of venue prior to trial (Bunnell v. Superior Court (1975) 13 Cal. 3d 592, 608-609 [119 Cal. Rptr. 302, 531 P.2d 1086]), nor does it justify reversal of a conviction on appeal because of the trial court's refusal to order such a change. (People v. Sommerhalder (1973) 9 Cal. 3d 290, 301-304 [107 Cal. Rptr. 289, 508 P.2d 289]; People v. Hathcock (1973) supra, 8 Cal. 3d 599, 618-620; People v. Welch (1972) supra, 8 Cal. 3d 106, 112-114; People v. Salas (1972) 7 Cal. 3d 812, 817-819 [103 Cal. Rptr. 431, 500 P.2d 7, 58 A.L.R.3d 832].) It follows a fortiori that in the case at bar counsel's decision not to make such a motion, in light of all the circumstances and after consultation with defendant, does not reflect any failure on his part to act as a competent, diligent advocate of his client's cause.\n\nII - Issues relating to the verdicts of robbery and kidnaping and the findings of special circumstances.\n\nIn part I of this opinion we have concluded there was no miscarriage of justice in the proceedings by which the jury found defendant guilty of the willful, deliberate, and premeditated murder of his wife. He therefore stands properly convicted of the crime of murder in the first degree. (Pen. Code, § 189.) In this portion we address the legal propriety of the verdicts convicting defendant of robbery and kidnaping and\n\nof the findings by the jury of \"special circumstances\" elevating the murder to a capital offense.\n\nA\n\nFor much of the history of this state the penalty for murder in the first degree was in the alternative either death or life imprisonment, with the choice being made by the jury in its \"absolute discretion.\" (See, e.g., People v. Green (1956) 47 Cal. 2d 209, 218-232 [302 P.2d 307], and cases cited [disapproved on another ground in People v. Morse (1964) 60 Cal. 2d 631, 648-649 [36 Cal. Rptr. 201, 388 P.2d 33, 12 A.L.R.3d 810__.) \"Today, by contrast, first degree murder is punished by life imprisonment except for extraordinary cases in which special circumstances are present.\" (Owen v. Superior Court (1979) 88 Cal. App. 3d 757, 760 [152 Cal. Rptr. 88].) This profound change in our law was brought about in response to the decisions of the United States Supreme Court in Furman v. Georgia (1972) 408 U.S. 238 [33 L.Ed.2d 346, 92 S.Ct. 2726], and Gregg v. Georgia (1976) 428 U.S. 153 [49 L.Ed.2d 859, 96 S.Ct. 2909], and its companion cases.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e We have previously analyzed in detail the contents of those opinions, and need not repeat the discussion here. (Rockwell v. Superior Court (1976) 18 Cal. 3d 420, 428-437 [134 Cal. Rptr. 650, 556 P.2d 1101]; People v. Frierson (1979) supra, 25 Cal. 3d 142, 173-182 [opn. of Richardson, J., Clark, J., and Manuel, J.]; id. at pp. 190-195 [opn. of Mosk, J., and Newman, J.].) For present purposes it is enough to recall that the principal thrust of the plurality view of the high court is that a death sentence imposed in the jury's absolute discretion constitutes cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments because of its arbitrariness: \"there is no meaningful basis for distinguishing the few cases in which it is imposed from the many cases in which it is not.\" (Furman, 408 U.S. at p. 313 [33 L.Ed.2d at p. 392] [conc. opn. of White, J.].) The solution adopted by the plurality is to mandate that such discretion \"be suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action\" (Gregg, 428 U.S. at p. 189 [49 L.Ed.2d at p. 883] [opn. of Stewart, J., Powell, J., and Stevens, J.]); and that guidance must be provided by objective sentencing standards designed to compel the jury to \"focus on the particularized circumstances of the crime and the defendant\" (fn. omitted; id. at p. 199 [49 L.Ed.2d at p. 889]).\n\nIn 1977 the California Legislature undertook to comply with the Furman-Gregg mandate by enacting the death penalty statute now before us. The heart of that statute was the concept of \"special circumstances.\" The jury's discretion to impose the death penalty was strictly limited to those cases of first degree murder presenting one or more of several enumerated special circumstances; in all other cases the murder, no matter how willful, deliberate and premeditated, was a noncapital offense. The permissible circumstances were defined in elaborate detail (former § 190.2); in summary, they included (1) murder for hire, (2) murder by means of explosives, (3) murder of a police officer or a witness, (4) murder by torture, (5) murder by a person previously or concurrently convicted of another murder, and (6) murder during the commission or attempted commission of five specified felonies, to wit, robbery, kidnaping, forcible rape, lewd act upon a child, or burglary.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The importance of the special circumstances was further underscored by the multiple procedural requirements erected around them: it was necessary that each and every circumstance relied upon be (1) charged in the accusatory pleading and (2) specially found by the jury; and that finding was required to be (3) unanimous and (4) beyond a reasonable doubt, no less than the verdict of guilt itself. (Former §§ 190.2, 190.4, subd. (a).)\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe intent of the Legislature in constructing this apparatus was manifestly to provide sentencing standards in capital cases adequately specific to satisfy the requirements of the federal Constitution enunciated by Furman and Gregg et al. Defendant contends the Legislature failed in this effort, and he advances a number of arguments attacking the validity of the statute. On the record before us, however, we need not reach the constitutional question:\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e whether or not the statutory\n\nscheme is sufficient to comply with Furman and Gregg et al., on the evidence and instructions in this case the findings of special circumstances must be set aside. In the absence of such findings the murder is not a capital offense, and for this reason alone the judgment of death cannot stand. The appeal can thus be decided on nonconstitutional grounds, and it is well settled that \"we do not reach constitutional questions unless absolutely required to do so to dispose of the matter before us.\" (People v. Williams (1976) 16 Cal. 3d 663, 667 [128 Cal. Rptr. 888, 547 P.2d 1000], and cases cited.) Nothing we say here, therefore, is meant to express any view whatever as to the validity of the 1977 death penalty statute or any subsequent measure on this topic. (See fn. 2, ante.)\n\nB\n\nThe first special circumstance found by the jury is that \"the murder was committed during the commission of a robbery in violation of section 211 of the Penal Code . . . .\" (See former § 190.2, subd. (c)(3)(i).)\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The finding does not identify the robbery in question; we must therefore consult count II of the information, which charged defendant with a violation of section 211 in that on October 11, 1977, in Sutter County, he took \"personal property\" from Karen Green. And we must turn to the record to learn what was the particular personal property the jury found he took from his wife.\n\nIn his closing argument the district attorney discussed this question at some length. He advised the jury that the court would instruct it that robbery is the taking of personal property of any value in the possession of another from his person or immediate presence and against his will, accomplished by means of force or fear, and with a specific intent to permanently deprive the owner of his property. (See CALJIC No. 9.10 (3d ed. 1970).) He then sought to apply this definition to the evidence, and asked the jury to return a verdict of guilty of robbery solely because defendant exercised dominion over three items of his wife's property at the scene of the crime: her clothes, her purse, and her wedding rings.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe relevant facts are essentially undisputed. When Karen left Pamela Robison's house on the day of the murder she was wearing blue jeans and a short-sleeved top and carrying a black purse. She entered David Khan's car and placed her purse on the floor of the front seat, where it remained throughout the ensuing events. At the scene of the crime, she went behind the car with defendant and he compelled her to take off her clothes; apparently he then placed them on the back seat of the car, as Khan heard a noise inside his vehicle and noticed the clothes there when he entered the front seat a few minutes later. After the killing, Khan removed Karen's rings at defendant's request and gave them to him. When the two men arrived back at the Scott-Reeves house later that evening, defendant carried the purse and clothes out of the car and subsequently put them in a pillowcase. The next day defendant informed Larry Creech he intended to get rid of the rings; and on the day after that Creech and Khan burned Karen's clothes and purse.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nFrom this evidence the district attorney argued that defendant was guilty of robbery in violation of section 211 because the three items taken -- the purse, the clothes, and the rings -- were each personal property of at least some value. He stated that under the law \"there was not any need to prove any value of the rings, the clothing, the purse, its contents. In fact, the matchbook cover [that defendant claimed he found in Karen's hand after shooting her] would have been sufficient if that was the only thing taken because that's an item of personal property of any value.\" He contended that defendant took the clothes and rings from his wife's person, and the purse from her \"immediate presence.\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e He next argued that defendant took Karen's clothes and rings\n\nagainst her will and by means of force or fear: the clothes, by the fear elicited when he slapped her and fired the shotgun; the rings, by the force used to kill her prior to removing them.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Finally he addressed the issue of the necessary intent to steal, and argued it could be found from the fact of the murder itself: \"If I were to remove something from you with the intent of handing it back to you, would I kill you in the interim? When you terminate a person's life, what more evidence can there be of an intent to permanently deprive that individual of property you have taken?\"\n\nThis is the evidence -- and presumably the reasoning -- on which the jury both found defendant guilty of the crime of robbery on count II and found true the robbery special circumstance charged in count I. We address first defendant's contention that the evidence is insufficient to support the robbery verdict on count II: as defendant correctly points out, if that evidence is insufficient the finding of the robbery special circumstance in count I must automatically be set aside as well. This effect follows from the statute itself, which provided that \"Wherever a special circumstance requires proof of the commission or attempted commission of a crime, such crime shall be charged and proved pursuant to the general law applying to the trial and conviction of the crime.\" (Italics added; former § 190.4, subd. (a).) In other words, under the statute a valid conviction of one of the listed crimes (or of an attempt to commit such crime) was a necessary condition to finding a special circumstance alleging that the murder took place during the commission (or attempted commission) of that crime.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nDefendant first posits the rule that a conviction of robbery cannot be sustained in the absence of evidence that the accused conceived his intent to steal either before committing the act of force against the victim\n\n(and the intent remained operative until the time of the taking) or during the commission of that act; if the intent arose only after he used force against the victim -- i.e., for a nonlarcenous purpose -- the taking will at most constitute a theft. The latter scenario will occur, for example, when an individual kills or renders another unconscious for reasons wholly unrelated to larceny -- e.g., because of anger, fear, jealousy, or revenge -- and then, seeing that his victim has been rendered defenseless, decides to take advantage of the situation by appropriating some item of value from his person.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nWe are cited to no case squarely declaring this rule in California. A contrary rule has been recognized in certain other jurisdictions, but with little analysis;\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e we are not persuaded by the opinions in those cases, and their result has been criticized on principle by the commentators. (E.g., LaFave \u0026 Scott, Criminal Law (1972) p. 702.) The rule urged by defendant, on the other hand, is consistent with the fundamental doctrine of criminal law codified in Penal Code section 20, to wit, that in every crime \"there must exist a union, or joint operation of act and intent . . . .\" (See People v. Mayberry (1975) 15 Cal. 3d 143, 154 [125 Cal. Rptr. 745, 542 P.2d 1337]; People v. Hernandez (1964) 61 Cal. 2d 529, 532 [39 Cal. Rptr. 361, 393 P.2d 673, 8 A.L.R.3d 1092]; People v. Stuart (1956) 47 Cal. 2d 167, 171 [302 P.2d 5, 55 A.L.R.2d 705].) \"So basic is this requirement that it is an invariable element of every crime unless excluded expressly or by necessary implication.\" (Fn. omitted.) (People v. Vogel (1956) 46 Cal. 2d 798, 801 [299 P.2d 850].) It is an element of robbery. (People v. Crowl (1938) 28 Cal. App. 2d 299, 308 [82 P.2d 507].)\n\nUnder section 20, the defendant's wrongful intent and his physical act must concur in the sense that the act must be motivated by the intent. Although troublesome questions of causation may arise when the act occurs in a manner different from that previously intended (see LaFave \u0026 Scott, op. cit. supra, p. 239 et seq.), \"The easiest cases are those in which the bad state of mind follows the physical conduct, for\n\nhere it is obvious that the subsequent mental state is in no sense legally related to the prior acts or omissions of the defendant.\" (Italics added; fn. omitted.) (Id. at p. 238.) Citing numerous out-of-state decisions (see also id. at pp. 642-643, fns. 32-34), the authors then apply this rule to the crime of larceny: \"It is not larceny for A to take possession of and carry off B's property with an innocent mind, although later A, overcome by temptation, converts the property with an intent to steal it.\" (Fn. omitted; id. at p. 238.)\n\nThe law of California is in accord, holding that to support a conviction of larceny the defendant must have intended to steal the property at the time he took it; if the intent arose after the act of taking, the crime may be embezzlement or a lesser offense but it cannot be larceny. (People v. Smith (1863) 23 Cal. 280; People v. Turner (1968) 267 Cal. App. 2d 440, 444 [73 Cal. Rptr. 263, 38 A.L.R.3d 940]; People v. Edwards (1925) 72 Cal. App. 102, 116-117 [236 P. 944] [disapproved on another ground in In re Estrada (1965) 63 Cal. 2d 740, 748] [48 Cal. Rptr. 172, 408 P.2d 948]; CALJIC No. 14.02 (1979 rev.).) The same rule must therefore apply to robbery: \"Since robbery is but larceny aggravated by the use of force or fear to accomplish the taking of property from the person or presence of the possessor [citation], the felonious intent requisite to robbery is the same intent common to those offenses that, like larceny, are grouped in the Penal Code designation of 'theft.'\" (Fn. omitted.) (People v. Butler (1967) 65 Cal. 2d 569, 572-573 [55 Cal. Rptr. 511, 421 P.2d 703].) We conclude that like the nonviolent taking in larceny, the act of force or intimidation by which the taking is accomplished in robbery must be motivated by the intent to steal in order to satisfy the requirement of section 20: if the larcenous purpose does not arise until after the force has been used against the victim, there is no \"joint operation of act and intent\" necessary to constitute robbery.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nDefendant next seeks to apply this rule to the facts, contending the evidence is insufficient to prove that he harbored an intent either before or during the killing to permanently deprive his wife of her clothes, rings, or purse, and that any such taking was therefore an afterthought at most constituting theft.\n\nWhen the sufficiency of the evidence is challenged on appeal, the court must review the whole record in the light most favorable to the judgment to determine whether it contains substantial evidence -- i.e., evidence that is credible and of solid value -- from which a rational trier of fact could have found the defendant guilty beyond a reasonable doubt. (People v. Johnson (1980) 26 Cal. 3d 557, 578 [162 Cal. Rptr. 431, 606 P.2d 738]; Jackson v. Virginia (1979) 443 U.S. 307, 317-320 [61 L.Ed.2d 560, 573-574, 99 S.Ct. 2781, 2789-2790]; In re Frederick G. (1979) 96 Cal. App. 3d 353, 362-365 [157 Cal. Rptr. 769].) Here the record establishes that defendant committed the murder for a nonlarcenous purpose: the only evidence on the question, introduced by the prosecution's own witnesses, shows that defendant killed his wife for either or both of two reasons -- jealousy, because he believed she was \"fooling around on him,\" and/or revenge or punishment, because he believed she was \"snitching\" on his friends. Neither of these reasons, of course, manifests in the slightest degree an intent to steal anything from the victim. It is equally beyond dispute, however, that defendant took his wife's clothes, rings, and purse as part of a deliberate effort to leave her unidentifiable so that he would not be connected with the murder if her body was found. The district attorney repeatedly argued the point to the jury, explaining that defendant took these items from his wife because he \"wanted to obliterate any means of identification, [to remove] everything that would in any way tie her to the people that are involved with the Defendant.\" The district attorney gave the same reason for defendant's seizure at the scene of the matchbook bearing Larry Creech's initials and telephone number, and added that on his return to the Scott-Reeves house \"Every single item when the Defendant went through the purse and clothing, papers were taken out, things with phone numbers on it, nothing was left in the Defendant's mind that could leave some kind of a trail as to identity.\" In their briefs on appeal both parties agree that was indeed defendant's purpose.\n\nDefendant nevertheless contends the evidence is insufficient to prove he conceived this intent -- to remove all identification from the victim -- before committing the murder. It is true that at no time prior to arriving at the scene of the crime did defendant express to any witness an\n\ninterest in, let alone an intent to steal, any of the three items of property here in issue.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e It is also true there is no direct evidence that prior to the murder defendant had decided to take two of those items, to wit, the rings and the purse, and neither was in fact removed until after the event.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e But the record does establish that defendant took the third item in question, Karen's clothing, before the murder; indeed, in slapping her and firing his shotgun for this purpose he compelled Karen to remove her clothes by means of a separate use of force or fear, sufficient in itself to furnish the element of compulsion necessary in robbery.\n\nDefendant relies, however, on evidence to the effect that after thus forcing Karen to disrobe he had sexual relations with her: not only did he so state to Khan, but the prosecution's expert witnesses confirmed the fact of intercourse by medical evidence. Defendant urges that such evidence \"strongly suggests\" that his purpose in directing his wife to undress was to facilitate their ensuing sexual activity. Although plausible, this is not the only reasonable inference it is possible to draw. The evidence also establishes that when Karen took off her clothes defendant immediately put them on the back seat of the car. The jury could have reasoned that if defendant had intended to restore the clothes to Karen after having intercourse with her, he would either have left them behind the car where she removed them or he would have taken them with her to the place where the intercourse occurred. From the fact that defendant instead put the clothes directly into the car, the jury could reasonably have drawn the inference that he meant to drive away with\n\nthem after the murder and hence that he took them from her for the purpose of keeping them and destroying them as evidence.\n\nIn turn, from a review of the whole record on this point we conclude that a rational jury could have so found beyond a reasonable doubt. As the Attorney General aptly sums up, \"it was all a part of the preconceived plan to leave Karen as an unidentifiable corpse. The murder and robbery took place in a remote area. The shotgun blast to the face, while rendering her face unidentifiable, also could be considered an attempt to eliminate any means of identification from dental charts. The unsuccessful attempt to blow off Karen's hands, feet, and tattoo was for no other purpose than to eliminate means of identification. Likewise, the removal of her wedding rings, as was the forced removal of her clothing earlier.\" The same record thus furnishes circumstantial evidence sufficient to prove that prior to the murder defendant had also formed the requisite intent to take Karen's rings and purse for the purpose of destroying them.\n\nFinally, defendant contends that the latter intent is insufficient as a matter of law to support a conviction of robbery. He emphasizes there is no evidence whatever that he had any desire for personal gain in taking this property -- no interest in possessing or wearing his wife's clothes, rings, or purse, and no purpose to convert them to his own benefit, e.g., by selling or pawning them. Yet although the vast majority of robberies are doubtless motivated by such desire, it is not an element of the crime in California.\n\nAs noted above, the felonious intent required for conviction of robbery is the same as that required for larceny. (People v. Butler, supra, 65 Cal. 2d 569.) It has long been recognized in the law of theft by larceny that \"'the felonious intent of the party taking need not necessarily be an intention to convert the property to his own use . . . .'\" (People v. Kunkin (1973) 9 Cal. 3d 245, 251 [107 Cal. Rptr. 184, 507 P.2d 1392, 57 A.L.R.3d 1199], quoting from People v. Brown (1894) 105 Cal. 66, 69 [38 P. 518].) More particularly, \"Despite early suggestions that the taking must have been for the purpose of gain ('lucri causa'), it is settled both at common law and under modern statutes that the intent to deprive the owner permanently is enough, even though the object of the taker is to destroy rather than to appropriate the property to his own use.\" (Italics added.) (1 Witkin, Cal. Crimes (1963) § 386, p. 359; accord, Clark \u0026 Marshall, Crimes (Wingersky ed. 1958) pp. 734-735, 784; 2 Wharton's Criminal Law and Procedure (Anderson ed. 1957)\n\n§§ 455, 549.) Although the authorities cite no California case in point,\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e a number of out-of-state decisions have held larcenous a taking with intent to destroy. (See, e.g., Delk v. State (1886) 64 Miss. 77 [1 So. 9] [defendant stole and killed a mule]; Warden v. State (1882) 60 Miss. 638 [same]; Dignowitty v. State (1856) 17 Tex. 521, 530 [defendant took and burned a contract to convey land]; Regina v. Jones (1846) 169 Eng.Rep. 205 [defendant stole and burned a letter].) The California statutes defining larceny and robbery (§§ 484, 211) do not require that the taking be for the purpose of gain, and we decline to read such a requirement into their plain terms: if the defendant intends to permanently deprive the owner of his property, the taking is larceny or robbery within the meaning of the Penal Code even if the defendant's sole intent is to destroy the property.\n\nWe recognize that defendant did not think he was committing a robbery, at least in the sense in which laymen ordinarily use that word. There is a sharp, clear ring of truth in David Khan's testimony that upon discovering a few dollars while going through Karen's purse for identification, defendant said, \"This would have been a hell of a robbery, huh?\" The evident meaning of this wry remark was that if this had been a traditional robbery for the purpose of stealing the victim's valuables -- for example, a holdup -- the proceeds would have been disappointingly small; and the inevitable inference from the making of the remark was that such was not in fact defendant's purpose.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e But as we have just seen, the technical legal concept of robbery is more inclusive than the public's common understanding of the term. \"We have heretofore recognized that words of common usage do not necessarily reflect the subtle distinctions they bear before bench and bar.\" (People v. Kunkin (1973) supra, 9 Cal. 3d 245, 252 [layman's acquiescence in use of word \"steal\" did not prove his intent to deprive permanently].) Although he was not motivated by a desire for gain, defendant\n\nnevertheless did certain acts -- he forcibly took a few items of personal property from his wife that were of some value, however slight -- and with a certain intent -- to permanently deprive her of that property by destroying it as evidence. Under the foregoing authorities we are compelled to conclude that these acts and intent add up to at least technical proof of the crime of robbery of which defendant was convicted on count II.\n\nAs will appear, however, it does not necessarily follow that the same evidence is sufficient to support the jury's finding of the truth of the robbery special circumstance alleged in count I. We turn next to that issue.\n\nC\n\nAs noted above (fn. 41, ante), in his closing argument the district attorney correctly told the jurors that in order to find the charged special circumstances to be true they must first find defendant guilty of the underlying crimes of robbery and kidnaping. After discussing the evidence bearing on those crimes, however, the district attorney in effect told the jurors that was all they needed to do: i.e., that if they found defendant guilty of the underlying crimes, the corresponding special circumstances were ipso facto proved as well. The latter reasoning was unsound, as it ignored key language of the statute: it was not enough for the jury to find the defendant guilty of a murder and one of the listed crimes; the statute also required that the jury find the defendant committed the murder \"during the commission or attempted commission of\" that crime. (Former § 190.2, subd. (c)(3).) In other words, a valid conviction of a listed crime was a necessary condition to finding a corresponding special circumstance, but it was not a sufficient condition: the murder must also have been committed \"during the commission\" of the underlying crime.\n\nThat this case cannot be fit within the statutory language was demonstrated by the manifest difficulty the jury experienced in attempting to do so. As to each of the two charged special circumstances the court gave an instruction (CALJIC Nos. 8.84.1 (1977 rev.) and 8.84.2 (1977 rev.)) stating only that to find the circumstance true the jury must find that the statutory prerequisites discussed above were met\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e and that the\n\nmurder was committed \"during the commission\" of the underlying crime, reiterating the standard CALJIC definition of that crime. At the outset of the second day of deliberations, however, the jurors sent the court a note asking for assistance in applying this law to the facts. The following colloquy then took place:\n\n\"Mr. Snelling [the foreman]: . . . we want to know if there was any difference as to whether or not a murder may have taken place and a robbery was just a second thing to it, or whether the murder . . . would be during the commission of a robbery. In other words, we felt that was different from a robbery taking place in the commission of a murder, do you see what our misunderstanding is?\n\n\"The Court: In other words, whether the robbery was pursuant to a murder or whether the murder was pursuant to a robbery?\n\n\"Mr. Snelling: That's correct.\"\n\nIn reply, the court merely repeated its instruction that to find the special circumstance the jury must find the murder was committed \"during the commission of a robbery.\" Again the foreman asked, \"Can there be any clarification given to us as far as during the commission of a robbery is concerned? In other words, as far as a time frame. In other words, the beginning of the act or the completion of the act. Maybe this is beyond what we should do here, I don't know, but that is where the confusion lies.\" The court declined to elaborate on the original instruction, and the jury was left to its own devices.\n\nAs this exchange shows, the jury perceptively sensed the truth of this case -- that it was not in fact a murder in the commission of a robbery but the exact opposite, a robbery in the commission of a murder. Yet the jury nevertheless found the robbery special circumstance to be true. The foreman's second question suggests that the jury ultimately based this finding on the relative \"time frames\" of the two crimes: i.e., as the Attorney General now argues, because the robbery \"began\" before the murder (by the removal of Karen's clothes) and \"ended\" after the murder (by the removal of her rings and the taking of her purse), it cannot be said to have occurred \"during\" the murder but rather the murder must have occurred \"during\" the robbery. We are not here concerned, however, with a matter of semantics or simple chronology: of course it took defendant longer to appropriate these items of his wife's belongings than to commit the actual killing, which was instantaneous. But in\n\nthe next case the reverse could well be true, and the Legislature cannot have intended that a consequence as serious as exposure to the penalty of death turn on such fortuitous events.\n\nRather, for the historical reasons reviewed above (part II A, ante), we infer that the purpose of the Legislature was to comply insofar as possible with what it understood to be the mandate of Furman and Gregg et al. At the very least, therefore, the Legislature must have intended that each special circumstance provide a rational basis for distinguishing between those murderers who deserve to be considered for the death penalty and those who do not.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e The Legislature declared that such a distinction could be drawn, inter alia, when the defendant committed a \"willful, deliberate and premeditated\" murder \"during the commission\" of a robbery or other listed felony. (Former § 190.2, subd. (c)(3).) The provision thus expressed a legislative belief that it was not unconstitutionally arbitrary to expose to the death penalty those defendants who killed in cold blood in order to advance an independent felonious purpose, e.g., who carried out an execution-style slaying of the victim of or witness to a holdup, a kidnaping, or a rape.\n\nThe Legislature's goal is not achieved, however, when the defendant's intent is not to steal but to kill and the robbery is merely incidental to the murder -- \"a second thing to it,\" as the jury foreman here said -- because its sole object is to facilitate or conceal the primary crime. In the case at hand, for example, it would not rationally distinguish between murderers to hold that this defendant can be subjected to the death penalty because he took his victim's clothing for the purpose of burning it later to prevent identification, when another defendant who committed an identical first degree murder could not be subjected to the death penalty if for the same purpose he buried the victim fully clothed -- or even if he doused the clothed body with gasoline and burned it at the scene instead.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e To permit a jury to choose who will live and who will die on the basis of whether in the course of committing a first degree murder the defendant happens to engage in ancillary conduct that technically constitutes robbery or one of the other listed felonies would be to revive \"the risk of wholly arbitrary and capricious\n\naction\" condemned by the high court plurality in Gregg. (428 U.S. at p. 189 [49 L.Ed.2d at p. 883].) We conclude that regardless of chronology such a crime is not a murder committed \"during the commission\" of a robbery within the meaning of the statute.\n\nThere is no doubt of the result of applying this rule to the facts of the case at bar. In his supplemental brief, the Attorney General is obliged to concede that \"It is true that this murder was the prime crime and that the robbery was incidental to that murder, since the underlying motive for the robbery was to leave Karen's corpse bereft of anything whatsoever by which she could be identified.\" For the reasons stated, we hold this evidence insufficient as a matter of law to support the jury's finding of the truth of the robbery special circumstance alleged in count I. The finding must therefore be set aside, and further proceedings on this allegation are barred by the double jeopardy clause. (Burks v. United States (1978) 437 U.S. 1 [57 L.Ed.2d 1, 98 S.Ct. 2141]; Greene v. Massey (1978) 437 U.S. 19 [57 L.Ed.2d 15, 98 S.Ct. 2151]; In re Johnny G. (1979) 25 Cal. 3d 543, 548-549 [159 Cal. Rptr. 180, 601 P.2d 196].)\n\nD\n\nThe second special circumstance found by the jury is that \"the murder was committed during the commission of a kidnapping in violation of Section 207 of the Penal Code . . . .\" (See former § 190.2, subd. (c)(3)(ii).)\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Again we must consult the record for details of the underlying crime. It will be remembered that on the afternoon of the murder David Khan telephoned to the house of Pamela Robison at defendant's direction and falsely told Karen that her husband needed her to pick up some of his belongings from her sister's house. Karen agreed to go with Khan for this purpose, and defendant instructed him and his brother Donnie to bring her instead to the Scott-Reeves house where he was awaiting her. The Khan brothers then went to pick Karen up, and she entered their car telling Robison she would \"be right back.\" To justify his return route, David falsely told Karen he was taking his brother to his girlfriend's house.\n\nThe second segment of the asportation began when the Khan brothers arrived at the Scott-Reeves house with Karen and defendant entered\n\nthe car in place of Donnie, instructing David to drive to a secluded spot. Khan drove for some 20 miles towards the town of Nicolaus in Sutter County. About five miles short of that destination Karen attempted to climb into the back seat but was forcibly restrained by defendant.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nThe third and last segment of the asportation began when Khan parked his car by the Feather River and all three got out. Defendant armed himself with his shotgun, compelled Karen to remove her clothes, and walked her for a short distance through the brush to the spot where the murder took place.\n\nIn his closing argument the district attorney asked the jury to find defendant guilty of the crime of kidnaping in count III -- and ipso facto to find true the kidnaping special circumstance alleged in count I -- on the basis of any or all segments of Karen's asportation. As will appear, however, different considerations govern each of those segments.\n\nWe begin with Karen's ride from the Robison house to the Scott-Reeves house. It is undisputed that Karen was not induced to go on that ride by force or fear, but by fraud: defendant tricked her into believing she was simply being taken on a quick trip to her sister's house and back. In his closing argument the district attorney told the jury it would be instructed that a kidnaping occurs when the victim is moved by force or fear for a substantial distance against his will and without his consent, and that a person does not consent to a criminal act if his agreement is obtained, inter alia, by fraud. Applying these definitions to the facts, the district attorney argued that Karen did not consent to being taken from the Robison house because her agreement to enter the car and ride with the Khan brothers was obtained by fraud.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e As the district attorney predicted, the trial court subsequently gave CALJIC No. 1.23 (3d ed. 1970), a general instruction on the topic, which told the jury in part that \"To constitute consent on the part of a person to a criminal act or transaction, he must act freely and voluntarily and not under the influence of fraud, threats, force or duress\" (italics added).\n\nThe Attorney General concedes it was error to give the latter instruction in this case: asportation by fraud alone does not constitute a general kidnaping offense in California. As we explained in People v. Rhoden (1972) 6 Cal. 3d 519, 526-527 [99 Cal. Rptr. 751, 492 P.2d 1143], in Penal Code section 207 the Legislature \"deliberately provided that whereas the two special types of kidnaping (transportation out of state for sale into slavery; unlawful transportation into state for any purpose) can be accomplished by means of fraud, a general act of kidnaping -- such as here charged -- can only be accomplished by the use or threat of force.\" (Accord, People v. Stanworth (1974) 11 Cal. 3d 588, 602-603 [114 Cal. Rptr. 250, 522 P.2d 1058].)\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nThe Attorney General contends, however, that our decision in People v. Camden (1976) 16 Cal. 3d 808 [129 Cal. Rptr. 438, 548 P.2d 1110], compels the conclusion that the error was harmless. The reliance is misplaced. In Camden the defendant was convicted of kidnaping on evidence that he lured the victim into his car with an offer of a ride, then prevented her from leaving while he attempted to take her home for sexual purposes. On appeal he contended he was denied effective assistance of counsel at trial because no objection was voiced when the court erroneously gave CALJIC No. 1.23. We rejected the contention, reasoning that \"the evidence that the victim was forcibly detained during asportation is so overwhelming that the trier of fact, having rejected defendant's alibi, must be deemed to have found inter alia that the asportation was accomplished by means of force, and thus no prejudice could have resulted from a permissible inference that defendant was also guilty of a fraudulent misrepresentation.\" (Fn. omitted; id. at p. 816.)\n\nCamden is clearly distinguishable on its facts. There, the victim realized shortly after entering the defendant's car that he was not driving in the direction promised, and she immediately protested that she wished to be taken home or permitted to leave the vehicle. Her first attempt to escape was frustrated when the defendant seized her by the arm and pulled her back. Next she was prevented from leaving because the defendant drove on a freeway at a high rate of speed, although she\n\ncontinued to plead with him to stop and allow her to get out. After more than half an hour the defendant left the freeway, and the victim succeeded in opening the door when he stopped at an intersection; but the defendant frustrated her second escape attempt by abruptly turning right and accelerating, causing the door to slam shut. Finally the victim jumped out at the next intersection, sustaining painful lacerations when she fell to the road. (Id. at pp. 811-812.)\n\nNo such \"overwhelming\" evidence of forcible asportation is present in the case at bar. The Attorney General points to evidence that defendant used force or fear to restrain or move his wife during the second and third segments of the asportation, i.e., between the Scott-Reeves house and the place of the actual murder. But this evidence is unavailing with respect to the first segment, i.e., Karen's ride with the Khan brothers from the Robison house to the Scott-Reeves house: as to that movement of the victim, evidence of fear is not only not \"overwhelming,\" it is nonexistent. Yet the jury, following the district attorney's argument and the court's instructions, could well have found that the ride constituted simple kidnaping because Karen's consent thereto was obtained \"under the influence of fraud.\" If such a finding was in fact the basis of the verdict of guilt on count III, the erroneous instruction would manifestly be prejudicial and the evidence would be insufficient as a matter of law to support that verdict.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nE\n\nPassing for the moment the second segment of the asportation, we address the question of the sufficiency of the evidence to support the last portion of the movement, i.e., from the place where defendant and Karen exited from Khan's car when he parked by the river to the spot where defendant killed her. No claim is made that such movement was anything other than involuntary, compelled by both force and fear. Here the defect in the proof is of a different but equally fatal nature -- the distance of the movement in question. The police officer who investigated the scene of the crime testified that the distance was only 90 feet, and the exhibits introduced at trial (e.g., aerial photographs) support his testimony. The question is whether so brief a movement will support a kidnaping conviction under our cases.\n\nMost of our decisions holding forcible movements of a victim to be \"substantial\" within the meaning of the law of kidnaping involved distances far in excess of that here shown.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e (See, e.g., People v. Camden (1976) supra, 16 Cal. 3d 808 [miles]; In re Earley (1975) 14 Cal. 3d 122 [120 Cal. Rptr. 881, 534 P.2d 721] [10-13 blocks]; People v. Lara (1974) 12 Cal. 3d 903 [117 Cal. Rptr. 549, 528 P.2d 365] [miles]; People v. Stanworth, supra, 11 Cal. 3d 588, 602-604 [from 1/4 mile to 5 to 10 miles]; People v. Milan (1973) 9 Cal. 3d 185 [107 Cal. Rptr. 68, 507 P.2d 956] [miles]; People v. Beamon (1973) supra, 8 Cal. 3d 625 [15 blocks].) The shortest distance this court has ever held to be \"substantial\" for this purpose was a full city block. (People v. Thornton (1974) 11 Cal. 3d 738, 768 [114 Cal. Rptr. 467, 523 P.2d 267].)\n\nOn the other hand, in a number of cases we have ruled that the distance that the victim was transported was inadequate as a matter of law to constitute movement \"into another part of the same county\" within the meaning of section 207 (fn. 55, ante). (See, e.g., People v. Caudillo (1978) 21 Cal. 3d 562 [146 Cal. Rptr. 859, 580 P.2d 274] [from an elevator to a storage room, down the hall to the victim's apartment, then around the apartment]; People v. Stanworth (1974) supra, 11 Cal. 3d at p. 597 [25 feet]; In re Crumpton (1973) 9 Cal. 3d 463 [106 Cal. Rptr. 770, 507 P.2d 74] [20-30 feet]; People v. Mutch (1971) 4 Cal. 3d 389 [93 Cal. Rptr. 721, 482 P.2d 633] [30-40 feet]; People v. Williams (1970) 2 Cal. 3d 894 [88 Cal. Rptr. 208, 471 P.2d 1008] [around a gas station]; People v. Daniels (1969) supra, 71 Cal. 2d 1119 [around several premises].)\n\nDirectly in point is People v. Brown (1974) 11 Cal. 3d 784 [114 Cal. Rptr. 426, 523 P.2d 226]. There the defendant broke into a house in the early morning hours, struck his victim and knocked her to the floor, then forcibly took her through the house in a room-to-room search for her husband, all the while committing improprieties indicating an intent to rape her; failing to find her husband, the defendant then dragged his victim through the back door and along a passageway outside the house for an additional distance of up to 75 feet, releasing her only when a neighbor intervened after hearing her screams. The defendant was convicted of kidnaping in violation of section 207, and appealed. In a unanimous opinion, we held that \"the evidence is insufficient\n\nto show that the movements were substantial. The asportation of the victim within her house and for a brief distance outside the house must be regarded as trivial. We therefore conclude that under the particular facts of this case the movement of the victim did not constitute a forcible taking 'into another part of the same county' and that the conviction of simple kidnaping must be reversed.\" (Fn. omitted; id. at p. 789.)\n\nThe record in Brown did not disclose the precise distance covered by the defendant's forcible movements of the victim inside the house, but it was undisputed that the defendant took her through a number of rooms in his search for her husband. It follows that the distance must have been significantly over 15 feet, which is not much more than the length of only one average room. When that distance is added to the 75 feet he dragged her outside the house, it is apparent that the asportation of the victim in Brown was at least equal to, if not greater than, the distance that defendant herein compelled his wife to walk at the scene of the crime. For the reasons stated in Brown, therefore, we conclude that the latter brief movement did not amount to a taking \"into another part of the same county\" and hence would be insufficient as a matter of law to support the verdict of guilt on count III.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nF\n\nWe do not know, of course, if the jury actually based its general verdict of guilt on count III on either of the foregoing legally insufficient segments of Karen's asportation, i.e., her ride from the Robison house or her walk from the parked car, rather than on the middle portion of that movement, i.e., the drive from the Scott-Reeves house to the scene of the crime. The Attorney General seeks to evade the difficulty by contending that the evidence supports \"but one reasonable conclusion,\" i.e., that \"a continuous kidnapping occurred,\" beginning when defendant entered Khan's car at the Scott-Reeves house and ending with the murder. He argues that from the evidence the jury could have reached only this one conclusion, and that as a matter of law it must have based its verdict on such a finding. The fatal flaw in this \"continuous kidnapping\" theory, however, is that it was simply not the theory on which the case was tried.\n\nIn his closing argument the district attorney divided the asportation after the parties left the Scott-Reeves house into three portions: the 20 miles that Khan drove before defendant restrained Karen from climbing into the back seat, the 5 miles he drove after that event until he parked by the river,\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e and the last 90 feet that defendant walked his wife to the spot where he killed her. The district attorney then emphasized repeatedly that the latter movement was itself sufficient to satisfy the \"substantial distance\" requirement and hence to constitute a kidnaping. Thus he focused the jury's attention on defendant's movement of the victim \"from the vehicle, even down to where the body was found, where the killing had actually taken place,\" and stated: \"Now, that distance, 90 feet, I believe the testimony was, approximately, seems rather insignificant in relation to 5 miles and 20 miles, but in other words, it's a movement of substantial distance in that it took the victim away from the immediate side of David Khan to the place where she was actually murdered.\"\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e (Italics added.) Later the prosecutor returned to this issue and told the jury to constitute kidnaping the distance of the asportation \"must be more than slight or trivial. We have three distances involved. Any one of the three is sufficient for a kidnap. The 20 miles, of course, absolutely no question. Five miles also. 90 feet, you have to conclude that was a substantial distance if for some reason you conclude the 20 and 5 [miles] were not or the other elements were not present during the portion of the move. Now, that of course, would give you the crime of simple kidnapping . . . .\" (Italics added.)\n\nNothing in the instructions, moreover, disabused the jury of this notion. The instructions on both kidnaping and the kidnaping special circumstance told the jury only that the crime is committed when the defendant moves a person by force or fear, against his will and without his consent, \"for a substantial distance, that is, a distance more than slight or trivial.\" No further guidance was provided on the latter issue, although it is \"the determining factor in the crime of kidnaping\" (People\n\nv. Stanworth (1974) supra, 11 Cal. 3d at p. 601). Finally, as noted above the jury's verdict was general, merely finding defendant guilty of the lesser included offense of kidnaping in violation of section 207.\n\nIn these circumstances the governing rule on appeal is both settled and clear: when the prosecution presents its case to the jury on alternate theories, some of which are legally correct and others legally incorrect, and the reviewing court cannot determine from the record on which theory the ensuing general verdict of guilt rested, the conviction cannot stand. The rule has been applied in various contexts. In People v. Robinson (1964) 61 Cal. 2d 373, 406 [38 Cal. Rptr. 890, 392 P.2d 970], the court explained that \"In civil appeals it has been the invariable rule that reversal is required when it is impossible to determine whether the verdict was based on admissible evidence submitted under correct instructions, or on erroneous determination of questions improperly submitted to the jury.\"\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e In language appropriate to the case at bar, we continued: \"It is equally (if not more) important to grant the same benefit of the doubt to a defendant on trial for his life.\"\n\nThe rule is perhaps most commonly invoked when the alternate theory is legally erroneous. Thus in Robinson we found the evidence \"clearly sufficient\" to support the murder conviction on one theory -- i.e., the defendant's confession, plus clear and convincing proof of the corpus delicti and a false alibi. (Id. at p. 405.) But we observed that the jury could also have returned the same verdict on any one of three other theories presented by the prosecution,\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e and that for different reasons -- inadmissible evidence, incorrect instructions -- a conviction on each of the latter theories would have been erroneous. We therefore reversed the judgment, reasoning that \"When, as in this instance, a reviewing court is unable to determine from the record whether a jury convicted on admissible evidence or rejected that evidence and convicted on inadmissible evidence improperly received, it must find the error to have been prejudicial. Under a different factual situation, but where the principle was equally applicable, this court said: 'However reprehensible\n\nthe conduct of an accused, he is entitled to have its legal consequences determined from competent evidence by a jury properly instructed . . . .'\" (Id. at p. 406, quoting from People v. Orcalles (1948) 32 Cal. 2d 562, 573 [197 P.2d 26].)\n\nThe same rule applies when the defect in the alternate theory is not legal but factual, i.e., when the reviewing court holds the evidence insufficient to support the conviction on that ground. Thus in People v. Anderson (1965) 63 Cal. 2d 351 [46 Cal. Rptr. 763, 406 P.2d 43], the defendant was convicted of first degree murder after a brutal sex-slaying. In addition to presenting a case of premeditation and deliberation, however, the prosecution asked the jury to convict the defendant on theories of murder in the perpetration of mayhem and murder by torture. Although the number and nature of the victim's wounds undoubtedly constituted some evidence suggesting that the defendant committed acts of mayhem or torture at least in the lay meaning of those words, we held the evidence insufficient to show that such conduct was animated by the particular specific intent required to support a conviction on either theory. (Id. at pp. 359-360.) We recognized that on such a record \"We are unable to determine which of the prosecution's theories served as the basis for the jury's verdict.\" (Id. at p. 360.) Under the foregoing general rule it was therefore necessary to reverse the judgment in its entirety, and we so ordered.\n\nAgain, in People v. Houts (1978) 86 Cal. App. 3d 1012 [150 Cal. Rptr. 589], the defendant was convicted of second degree murder. The prosecutor had argued two alternate theories to the jury: a malicious but unpremeditated killing, and a second degree felony murder committed in the course of an attempted sodomy. The Court of Appeal observed (at p. 1022) that \"the record is very clear that the prosecutor vigorously argued to the jury on the felony-murder theory and the jury was instructed on that theory,\" and stressed (at p. 1019) that there was \" some evidence on which the jury could have tried to apply the felony-murder instruction to reach their verdict.\" Yet the court nevertheless held that the testimony on attempted sodomy showed only a \"mere possibility\" of the commission of that crime, and hence that there was no substantial evidence to support the verdict on the felony-murder theory. (Id. at p. 1019.) On the other hand, the court acknowledged (at p. 1021) that if the prosecution had proceeded exclusively on the malicious killing theory, it would have held the verdict \"clearly supported by the evidence.\" On this record the court concluded that \"as a reviewing court, we simply are unable to determine under what theory the verdict was reached.\n\nIf made under the felony-murder rule, the verdict cannot stand. If made under the other theory in this case, the verdict was proper. Unfortunately, we are unable to determine what theory was followed by the jury and we are required to reverse.\" (Id. at p. 1020.) To speculate on the basis of the verdict, the court recognized, would \"usurp the factfinding function of the jury.\" (Id. at p. 1021.)\n\nIn the case at bar, as we have seen, the record likewise contains evidence that could have led the jury to predicate its kidnaping verdict on the legally sufficient portion of Karen's asportation. But it also contains evidence that could have led the jury to rely instead on either of the legally insufficient portions of that movement. The instructions permitted the jury to take the latter course; and the district attorney expressly urged such a verdict in his argument, at least with respect to the final 90 feet that the victim was transported. We simply cannot tell from this record which theory the jury in fact adopted. Indeed, we cannot even be sure that all the jurors agreed on the same theory: following the district attorney's advice, some jurors may have found that one segment of the asportation constituted the kidnaping, while others may have rested their verdict on a different -- and legally insufficient -- portion of the movement.\n\nOur doubt in the matter is enhanced by the particular facts of the case at bar. A review of the entire record demonstrates there were ample reasons for the jury not to rely on the evidence relating to the legally sufficient portion of the asportation, i.e., from the Scott-Reeves house to the place where the car stopped by the riverbank. To begin with, the testimony bearing on the crucial issue of whether Karen was in fear of her husband during that portion of the movement was not unambiguous, but rather gave rise to conflicting inferences. Linda Reeves testified that when the Khan brothers arrived at her house with Karen in the front seat, Donnie got out but the car remained there for approximately five minutes while David chatted with her and his mother, Patty Khan. During that period Karen did not ask for help, say she did not want to be there, claim she was being kidnaped, or act in any unusual or abnormal way. Nor was there any commotion inside the car, or any evidence that someone was trying to get out. In corroboration, Mrs. Khan testified that while she was standing next to David on the driver's side she noticed nothing unusual about Karen. Karen did not ask her for help, tell her she was being kidnaped, or make any plea at all. After Donnie left the car, there was nothing to stop her from moving over to\n\nthe passenger door and getting out, as David was not holding her in any way.\n\nIn turn, David Khan testified that while he was parked at the Scott-Reeves house there were five to seven people in the front yard, but Karen never protested, screamed, or otherwise indicated she wanted to get out of the car. No one had exercised any force against her, and he had no reason to believe she was not free to go. Thereafter, during the ride towards Nicolaus, the conversation between Karen and her husband was of \"a fairly congenial nature,\" and was \"pretty calm, cool and collected.\" She was \"talking about washing clothes\" and about the fact that \"an aunt and uncle owned a boat somewhere along the river there\" where they were driving. At no time did she ask David to take her back or let her out, or tell him she did not want to be with him and her husband. Indeed, the witness testified \"there was nothing that occurred\" during the entire ride from the Scott-Reeves house to the riverbank that caused him to believe a kidnaping was taking place.\n\nIt is true that the record contains other evidence -- such as Karen's reaction to first seeing defendant at the Scott-Reeves house, the subsequent mention of beatings and weapons, and the hair-pulling incident -- from which the jury could infer that Karen did not remain in the car voluntarily but instead through fear of her husband. Yet all that evidence came from a single source -- the testimony of David Khan -- that cannot have inspired much confidence. Not only did Khan's testimony on these points remain wholly uncorroborated, but on both direct and cross-examination his credibility was thrown into serious question. Thus on direct examination he admitted that he repeatedly lied to the authorities in the days following his arrest.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e On cross-examination Khan conceded that he changed his story and began accusing defendant of the crime when the authorities told him that he would be charged with the murder himself. He acknowledged that during\n\nthe trial he was in custody for his own protection and had been promised by the authorities that as soon as the trial was over he would be \"placed,\" i.e., he would be provided with a place to live of his own choosing. In addition, he admitted that he was himself a criminal,\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e and that other felony charges had been filed against him but had not been disposed of adversely while his testimony in the case at bar remained uncompleted.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\nIn sharp contrast, the evidence relating to the first and last segments of Karen's asportation was unambiguous and did not depend on Khan's credibility; rather, it derived as well from the testimony of untainted witnesses (e.g., Pamela Robison) and from indisputable objective proof (e.g., the location and condition of the body). As to each such segment, moreover, the record left no question whatever concerning Karen's reason for submitting to the asportation -- at the beginning, fraud; at the end, force or fear. In these circumstances the jury had substantial incentives to take the easier path urged by the district attorney, i.e., to predicate its kidnaping verdict on \"any one\" of the segments of Karen's asportation, and in particular on her 90-foot movement from the parked car to the place of her death. Such a finding would have spared the jury from grappling with the much closer question of Karen's mental state presented by the evidence discussed hereinabove. As we have repeatedly observed in a related context, an error that relieves the jury from the necessity of making a difficult but crucial finding as to state of mind is especially likely to be prejudicial. (People v. Henderson (1977) 19 Cal. 3d 86, 96 [137 Cal. Rptr. 1, 560 P.2d 1180], and cases cited.)\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nOn such a record we are compelled to conclude that a miscarriage of justice has occurred, and hence that the judgment must be reversed insofar as it convicts defendant of kidnaping on count III. (Cal. Const., art. VI, § 13.)\n\nMoreover, for the reason explained above (see fn. 41, ante, and accompanying text), the governing statute required a valid conviction of the underlying offense of kidnaping as a necessary condition to the jury's finding of the kidnaping special circumstance charged in count I. In the absence of such a conviction, that finding must be set aside as well.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nFinally, because both of the special circumstances findings must thus be vacated, the punishment of death likewise cannot stand under the statute. We therefore need not reach defendant's claims of error relating to the penalty phase of the trial.\n\nIn Crim. 20555 the judgment is reversed as to count III; on count I the findings of special circumstances are set aside and the judgment is reversed insofar as it relates to penalty; in all other respects the judgment is affirmed.\n\nIn Crim. 21068 the motion to strike is granted, the order to show cause is discharged, and the petition for habeas corpus is denied.\n\nDisposition\n\nIn Crim. 20555 the judgment is reversed as to count III; on count I the findings of special circumstances are set aside and the judgment is reversed insofar as it relates to penalty; in all other respects the judgment is affirmed.\n\nIn Crim. 21068 the motion to strike is granted, the order to show cause is discharged, and the petition for habeas corpus is denied.\n\nRICHARDSON, J., Concurring and Dissenting. I fully concur in that portion of the majority opinion (part I) which upholds defendant's conviction of first degree murder. I further concur in the majority's extended discussion and determination (parts II B and C) that although defendant was properly convicted of robbery, the evidence was probably insufficient to demonstrate that the murder occurred during the commission of a robbery. Accordingly, there was no special circumstance\n\npermitting the imposition of the death penalty (see former Pen. Code, § 190.2, subd. (c)(3)(i)) on that ground.\n\nI respectfully dissent, however, from the entirety of that portion of the majority's opinion (parts II D, E, and F) which reverses defendant's conviction for kidnaping and which further vacates the jury's finding of special circumstances based upon the commission of a murder during a kidnaping. In my view, the jury had before it overwhelming evidence establishing that the defendant killed his victim while he was kidnaping her. I am further convinced that even had the asserted instructional errors not occurred the jury undoubtedly would have returned a similar conviction of murder during a kidnaping.\n\nFocusing entirely on some statements by the prosecutor during his lengthy closing argument, and on one isolated phrase in a kidnaping instruction, the majority holds that the findings of special circumstances must be reversed because the jury might have based its verdict on an erroneous application of kidnaping principles. From a reading of the trial record, I am convinced that it is not reasonably probable that a verdict more favorable to defendant would have resulted if the claimed errors had not occurred. What were these claimed errors?\n\nDuring the closing arguments, the prosecutor observed that kidnaping required a nonconsensual movement of the victim, and he argued that as Karen's agreement to enter the car was induced by fraud, it was thereby nonconsensual in nature. The trial court so instructed the jury, and this was improper according to the majority. Assuming that error was thereby committed, however, these brief references to kidnaping by fraud could not possibly have misled the jury, for as I explain below, the evidence was overwhelming that, during the critical portion of the asportation of Karen, defendant kidnaped his victim through force or the threat of force, not through fraud.\n\nNext, during his closing argument as to the kidnaping count, the district attorney asserted as follows: \"Now, what about the movement of the Defendant -- of the victim, excuse me, by the Defendant from the vehicle, even down to where the body was found, where the killing had actually taken place. Now, that distance, 90 feet, I believe the testimony was, approximately, seems rather insignificant in relation to 5 miles and 20 miles, but in other words, it's a movement of substantial distance in that it took the victim away from the immediate side of David Khan to the place where she was actually murdered.\"\n\nShortly thereafter the prosecutor added: \"Distance, I've already made reference to, must be more than slight or trivial. We have three distances involved. Any one of the three is sufficient for a kidnap. The 20 miles, of course, absolutely no question. Five miles also. 90 feet, you have to conclude that was a substantial distance if for some reason you conclude the 20 and 5 [miles] were not or the other elements were not present during the portion of the move.\"\n\nExtracting from the lengthy argument these isolated references, the majority concludes that the People irrevocably rejected any contention that the case was one of a \"continuous kidnapping,\" and that it was \"not the theory on which the case was tried.\" (Ante, p. 67.) The majority errs.\n\nInitially, it should be noted that the jury, of course, could totally disregard all the arguments of counsel. The prosecutor told the jury early and often that the arguments were not evidence, and that the jury was free to disregard them. \"The comments made by myself and Mr. Weiner are not evidence . . . . What we say is not evidence, merely a presentation of our opinion of evidence as we see it. It's important that you bear in mind throughout your deliberations.\" He also informed the jurors that they were the exclusive judges of the facts and were to be guided by the court's instructions. Similarly, the court so instructed the jury.\n\nMoreover, the majority misreads the record in insisting that the reality of a continuing kidnap was \"not the theory on which the case was tried.\" To the contrary, it was the central theme of the prosecution argument, and was urged repeatedly throughout its closing presentation. I cite a few examples. Early in his argument the prosecutor urged that defendant's conduct demonstrated \"a continuing deliberate intent to accomplish specific acts.\" Further, he argued that \"All the circumstances, the acquisition of that victim, the transportation of that victim, the events that occurred at the scene, the slap, the order to take off the clothes, the fire of shotgun all indicate a movement by force or fear in that she reasonably had apprehension that she would face harm.\" Again, the prosecutor contended: \"All the factors which I have been discussing would indicate threats, duress, if you will, throughout the entire transportation of that victim up to the point she was killed.\" (Italics added.) Later, the prosecutor said \" The movement to the location up in Nicholas was not merely incidental to the robbery in that the defendant wanted to move a victim where he could more easily rob her,\n\nbut he was moving a defendant or -- the victim to a spot he could actually accomplish not only the removal of identifying property, thereby robbery, he could murder her free of any detection or other witnesses and perhaps even murder of Daniel Khan if he deemed it necessary.\" (Italics added.) And again, \"had the Defendant been stopped short of his final destination, then the killing hopefully would not have occurred. But the further they got away from where they were at, the Reeves residence, the greater likelihood was that the victim was going to meet the fate she did in fact meet. When they got to a safe location, safe in the mind of the Defendant where no one was really around except David Khan, then the full force of the harm was then put onto the victim.\" (Italics added.) Again, the district attorney urged, \"After the defendant acquired the shotgun, the shells, and possession of the victim, he then had her driven to a secluded spot, none of this indicates just a rash impulse or reaction to a situation, but a planned, deliberate sequence of events to get the victim in a location where he could accomplish the acts he had in mind.\" (Italics added.)\n\nFrom the beginning to end the prosecutor urged upon the jury that defendant engaged in a prearranged plan to obtain physical possession of his wife, initially by trick, then subsequently to detain her through fear of force, and to carry her, continuously and without interruption, \"to a secluded spot\" (defendant's words) where he could first satisfy himself sexually and then execute her, finally attempting to destroy any evidence of her identity and of his own connection with the crimes.\n\nDespite brief references in the argument by the prosecutor to the sufficiency of the first or last \"segments\" of the asportation, the unalterable fact is that the overwhelming weight of uncontradicted evidence established a continuous kidnaping beginning when defendant entered the car and ending when defendant murdered his wife. As previously noted, a fair reading of the entire record establishes beyond reasonable doubt that the jury would have so found, as in fact it did find, even had the asserted instructional errors not occurred. It follows, under very well established and constitutionally ordained rules for determining prejudicial error, that we should affirm defendant's kidnaping conviction, as well as the special circumstances finding based upon a murder committed during the course of a kidnaping.\n\nI begin by emphasizing that the sovereign people of this state in their California Constitution have mandated the following important, but perhaps frequently ignored, standard governing our appellate review:\n\n\" No judgment shall be set aside, or new trial granted, in any cause, on the ground of misdirection of the jury, or of the improper admission or rejection of evidence, or for any error as to any matter of pleading, or for any error as to any matter of procedure, unless, after an examination of the entire cause, including the evidence, the court shall be of the opinion that the error complained of has resulted in a miscarriage of justice.\" (Art. VI, § 13, italics added.) Interpreting this vital command of the people we have consistently held that if a claimed instructional error has occurred, such as the failure of a trial court to instruct sua sponte regarding the legal issues, the judgment nevertheless must be affirmed if \"it is not reasonably probable that a result more favorable to defendant would have been reached in the absence of the error . . . .\" (People v. Bradford (1976) 17 Cal. 3d 8, 18 [130 Cal. Rptr. 129, 549 P.2d 1225]; accord People v. Williams (1975) 13 Cal. 3d 559, 563-564 [119 Cal. Rptr. 210, 531 P.2d 778]; People v. Gordon (1973) 10 Cal. 3d 460, 470 [110 Cal. Rptr. 906, 516 P.2d 298]; People v. Welch (1972) 8 Cal. 3d 106, 119 [104 Cal. Rptr. 217, 501 P.2d 225]; see also People v. Wheeler (1977) 71 Cal. App. 3d 902, 907 [139 Cal. Rptr. 737].) Significantly, most of these cases (Bradford, Williams, Welch, and Wheeler) involved a failure by a trial court to define the legal terms referred to in other instructions, an omission very comparable to the trial court's supposed failure herein to define further or clarify what constitutes a \"substantial\" distance for purposes of measuring the sufficiency of the last asportation of the victim, Karen.\n\nThe following factual circumstances described in the trial record, many of them recited in the majority opinion, and largely unchallenged, persuade me that no \"miscarriage of justice\" has occurred in this case. The marriage of defendant and his wife Karen was very short and stormy. At the time of her death, she was only 16 years of age, and defendant had physically beaten her several times. Explaining that she was leaving defendant and intended to seek an annulment of her marriage, Karen asked her friend Pamela Robison if she could move in with her. When informed of Karen's decision to leave him, defendant threatened to kill her if she left, and Karen expressed fear for her safety.\n\nUnable to locate Karen himself, and because \"she ripped off $800 and was fooling around,\" defendant offered his friend David Khan $50 and $5 \"for gas\" if David would find and bring Karen to the Scott-Reeves house where defendant would be waiting, but to \"keep on going\" if he observed any police in the vicinity. Defendant further directed David to tell Karen that defendant was \"in trouble\" and needed to pick up\n\nsome things. In the interim, defendant obtained, and wrapped in a white cloth covering, a shotgun and some shells. Accompanied by his brother Donnie, David then found Karen at Pam's home and, as ordered by defendant, explained that defendant was \"in trouble\" and needed some things. At David's request, Karen then accompanied him and Donnie to the Scott-Reeves residence where defendant awaited her. Upon observing defendant, Karen became excited, sat up in the car, and inquired of David \"What's he doing here?\" She also asked David if he had known defendant was to be there, but David denied any such knowledge.\n\nKaren was thereby delivered into the hands of the defendant. The $50 was earned. The ruse was successful. The trap was sprung. After a few moments, Donnie left the car and defendant, carrying his carefully wrapped shotgun and shells, took his place in the front seat of the vehicle next to his wife, and slid the weapon under the front seat. The record is crystal-clear as previously noted that from that moment on she was under defendant's complete dominion and control. Defendant's kidnap of Karen began, and during that kidnap he murdered her. With his friend David at the wheel defendant directed him to proceed to \"a secluded area.\" Karen sat in the front seat. On her left was her husband's accomplice, who had brought her by a trick to this meeting with her husband. On her right was her husband, who had threatened her life, who had physically beaten her several times during their short marriage, and who brought with him the deadly weapon recently obtained and loaded by him. Thereafter, part of her confinement was on wheels. Part of it was on foot. But from the moment defendant entered the car until the moment of her death 25 miles away, whether in the front seat of the moving vehicle or at the site of her death, her actions, and the course and direction of her movement, were wholly subject to his will.\n\nThe record further amply demonstrates that defendant's complete domination of Karen was instilled through force, threat of force, and fear for her physical safety. During the 25-mile automobile ride, Karen told defendant she had a derringer. He responded that he had a \"toy\" of his own. This discussion of weapons sets the tone and atmosphere of violence and threat that characterizes the car ride. Apparently fearing a repetition of earlier acts of violence, at one point Karen told her husband \"If you're going to beat me, you better make it good, because it's going to be the last time.\" At a point approximately five miles from their ultimate destination, and apparently with a growing sense of the deadly peril that was rapidly enveloping her, she attempted to climb\n\ninto the back seat perhaps as a preliminary to an escape attempt. Defendant forcibly restrained her in the front seat by violently jerking on her hair, causing her to moan either in pain or fear.\n\nUpon arrival at their destination in a secluded area, defendant ordered Karen from the car, escorted her to the back of the vehicle and asked her \"What the [expletive] was about the annulment?\" Karen's reply, in apparent desperation, was that \"it wasn't true, that she just wanted him to come back.\" Defendant then told Karen that he was going to kill her, and ordered her to remove her clothing. Defendant went to the car at which time Karen approached David in a frantic but futile effort to save herself, kicked toward David's leg to attract his attention, and extended her hands in a further appeal for David's assistance. Having previously betrayed her and apparently feeling that he was in no position to help her, David ignored the overtures and declined to intervene.\n\nThereafter, defendant instructed her again in a \"commanding voice\" to remove her clothes. She did so and David then heard defendant slap Karen a few times. Defendant thereupon fired his shotgun, presumably thereby dramatically emphasizing both his intent and his authority. He then ordered her on foot to her place of execution approximately 90 feet away from both the car and from David's presence. Apparently, defendant had one other matter on his mind besides killing Karen, because at some point en route he satisfied himself sexually with her one last time, in his words, \"both front and back.\" Having done so, he thereupon dispatched her with a single charge of his .12 gauge sawed-off shotgun aimed at close range and directly at her face.\n\nFrom the foregoing record it appears to me inescapable that Karen was confined not by fraud but by force and the threat of force from the time defendant entered the car through the last few moments of her life and culminating in her death. If anything, her fear was intensified after the trio arrived at its destination. In referring to the very last portion of Karen's journey the majority concedes as much, acknowledging \"No claim is made that such movement was anything other than involuntary, compelled by both force and fear.\" (Ante, p. 65.) Most assuredly she was not free to leave. This is amply evidenced by defendant's language, his statement to her of his intent to kill her, the slaps which he administered, the discharge of the shotgun, and Karen's desperate but rejected appeal for David's help. Her confinement by the overpowering, threatening, deadly force both possessed and speedily used by the defendant\n\nwas uninterrupted and unquestionably it was substantial. (People v. Camden (1976) 16 Cal. 3d 808, 814 [129 Cal. Rptr. 438, 548 P.2d 1110].)\n\nIn People v. Stanworth (1974) 11 Cal. 3d 588, 601 [114 Cal. Rptr. 250, 522 P.2d 1058], referring to section 207, we stressed that \"'The statute is to be given effect in its commonsense meaning.'\" So interpreting this section in the light of the foregoing record, I am convinced beyond any doubt that defendant kidnaped Karen and killed her during the kidnaping.\n\nThe majority asserts, in justification of its reversal of the kidnaping conviction, that \"We simply cannot tell from this record which theory [of kidnaping] the jury in fact adopted. Indeed, we cannot even be sure that all the jurors agreed on the same theory . . . .\" (Ante, p. 71.) But, in measuring a record for prejudicial error we need not demand such unachievable certainty. Under the above cited authorities, so long as no miscarriage of justice has occurred, and it is not reasonably probable that the jury would have reached a more favorable verdict, then we must affirm the conviction under the constitutional mandate to us which the people have imbedded in article VI, section 13. Furthermore, the record discloses no confusion whatever in the minds of the jurors in the matter of the kidnaping, as to the charges, evidence, arguments, instructions or conviction. While, as noted by the majority, they were troubled by the robbery aspects of the crimes, they made no inquiry nor did they voice any uncertainties or doubts as to the kidnaping. With due deference, from the uncontradicted facts in the record before us, it is hardly conceivable that the jury, having convicted defendant of murdering Karen, nevertheless would have acquitted him of kidnaping her.\n\nThe majority suggests that had the jury been properly instructed regarding the law of kidnaping, and particularly had it been told that neither a fraudulent asportation nor a 90-foot movement would constitute kidnaping, it might have acquitted defendant of that offense. The majority asserts that the jury might have rejected David Khan's testimony regarding the events which occurred during the transit from the Scott-Reeves home to the death scene. (In passing, it should be observed that even though Karen's original entry into the vehicle at Pam's residence was voluntary, being induced by the fraud of defendant and David in concert, this would not dilute the criminal nature of her subsequent ride after leaving the Scott-Reeves residence. As we carefully explained in Camden, \". . . it would be unreasonable to conclude that\n\nthe Legislature intended to exclude from the scope of section 207 those asportations which although voluntarily initiated are continued by means of threat or force.\" (16 Cal. 3d at p. 814.)) Moreover, David's description of events was uncontradicted and not inherently unbelievable. Is it reasonably probable that the jury would have disbelieved his testimony in which, in essence, he admitted his own complicity in a kidnaping? Moreover, by its verdict which convicted defendant of Karen's murder, the jury necessarily accepted David's testimony of the circumstances of Karen's death and rejected defendant's own defense theory that it was David rather than defendant who murdered Karen. At the same time it also rejected the alibi contention partially advanced by defense counsel and also brushed aside the defense suggestion advanced in closing argument, referring to those who discovered Karen's body, \". . . when you are in that room deliberating remember the fishermen.\" The jury discarded all of these defenses and convicted defendant of the murder.\n\nFurthermore, and I believe this is very significant, the majority itself affirms defendant's murder conviction. It follows, accordingly, that the majority accepts the record as containing substantial evidence establishing defendant as the killer. It is self-evident that defendant not having taken the stand, all of the circumstances of that murder, other than the acquisition of the weapon, came entirely from the mouth of David. Is it \"reasonably probable\" that the jury which accepted David's murder testimony would have rejected his kidnaping testimony if it had been instructed, sua sponte, that, standing alone, neither the victim's asportation to the Scott-Reeves residence nor the \"last 90 feet,\" constituted a kidnap? Emphatically, no.\n\nIt stultifies the record of this three-week jury trial to speculate that the jury may have been misled by not having been told that the trip to the Scott-Reeves home was not a kidnap, or that, alternatively, the 90-foot movement on foot from the car to the death scene was not a kidnap. The jury was entitled under the applicable law and under the court's instructions to take into consideration the entirety of defendant's continued confinement of Karen by threat or force. The kidnaping began during the car ride with defendant and continued through the period after she arrived in the car, exited the car, conversed with defendant at the rear of the car and disrobed, and took her last walk, the \"90 feet.\" If instead of walking on foot to her death she had ridden on horseback with defendant, she would have been kidnaped during that portion of her journey. The mode of transportation was immaterial.\n\nThere was an uninterrupted continuum of conduct and of movement, commencing with her departure in the car from the Scott-Reeves residence up to the moment of death. The kidnap was continuous in intent, purpose, design and act.\n\nThe jury heard all of this evidence and deliberated under careful instructions from the trial court. The record demonstrates overwhelmingly a vicious, carefully premeditated murder by defendant of his wife under circumstances of almost unbelievable brutality, committed during the course of his kidnap of the victim. His movements of Karen were substantial and not trivial and they were carefully planned and executed to accomplish his purpose and to conceal his connection with both his victim and his crimes.\n\nIn my view, there unquestionably was no \"miscarriage of justice\" in this case. Accordingly, with the majority I would affirm defendant's conviction of first degree murder (count I) and of robbery (count II), and I would also strike the findings of special circumstances charged in count I; i.e., that the murder was wilful, deliberate, and premeditated and was personally committed in the course of a robbery. However, unlike the majority, I would affirm the judgment of conviction of kidnaping, and also that portion of the judgment which finds the \"special circumstances,\" namely, that the murder was wilful, deliberate and premeditated and was personally committed by defendant during the commission of a kidnaping in violation of section 207 of the Penal Code (§ 190.2, subd. (c)(3)(ii)).\n\n\u003cspan class=\"fn\"\u003e1. The appeal is automatic. (Pen. Code, § 1239, subd. (b).) Statutory references hereinafter that bear no code designation are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The law governing the penalty for murder in this case is therefore to be found in sections 190 to 190.5 as enacted by the Statutes of 1977, chapter 316, sections 4 to 13, pages 1256 to 1262. Because those provisions were amended by initiative in the following year (Prop. 7, Gen. Elec. (Nov. 7, 1978)), all references thereto in this opinion will be designated \"former\" section 190 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. On counts II and III the court sentenced defendant to state prison for the terms prescribed by law. Execution of these sentences was stayed pending completion of the sentence on count I.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. She also had a distinctive tattoo on her lower abdomen. Although Karen was 16 years old at the time of her death, the autopsy surgeon testified she had the physical appearance of a woman of 20 to 24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Creech testified that \"offed\" meant \"killed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Later in the trial the prosecutor asked Larry Creech how he came to be acquainted with defendant, Sheehan, Donnie Khan, and others of their group, and the witness replied he had been in jail with \"some of them.\" The remark was admissible on the same grounds as the above-quoted testimony of Sheehan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"Q. [by the district attorney]. Any of those people connected with this case? A. Besides [defendant], I don't think that -- not connected with the case, no. \"Q. When you say connected, you mean as a charged defendant or witness, correct? A. Right. \"Q. Were any of these other people besides the Defendant friends of the Defendant? A. Yes, they were. \"Mr. Weiner: Objection, leading. \"The Court: Overruled. \"By Mr. Hansen: Q. Were any of these other people associates of the Defendant? A. Yes. \"Q. Were they people the Defendant ran around with? A. Every day. \"Q. Were they people the Defendant did business with? A. Every day. \"Q. Now, you've been asked a lot of questions concerning who you have done business [with] in various criminal activity? A. Yes, I have. \"Q. Were these people that the Defendant did business with, he was friends with? Were they some of the individuals you did business with? A. Yes, sir. \"Q. Were they the same individuals? A. Yes, sir. \"Mr. Weiner: I'm going to object to the leading line of questioning. \"The Court: Overruled. \"By Mr. Hansen: Q. Were they the same individuals you engaged in criminal activities with? A. Yes. \"Q. Did this include the Defendant? A. Yes, sir.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant's objection to the testimony on the sole ground that the questions were \"leading\" did not preserve a claim of a wholly different basis of exclusion such as he now raises. (See, e.g., People v. Stuller (1970) 10 Cal. App. 3d 582, 598-599 [89 Cal. Rptr. 158, 41 A.L.R.3d 712]; People v. Gamble (1970) 8 Cal. App. 3d 142, 148-149 [87 Cal. Rptr. 333]; People v. Lint (1960) 182 Cal. App. 2d 402, 414 [6 Cal. Rptr. 95].) And the record does not support his further assertion that he was excused from making an \"other crimes\" objection because he had previously taken a continuing exception to this same line of testimony from the witness Creech. (See, e.g., Green v. Southern Pac. Co. (1898) 122 Cal. 563, 565 [55 P. 577]; People v. Brooks (1979) supra, 88 Cal. App. 3d 180, 186.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. When offered for such purpose the statement was simply not hearsay. (Evid. Code, § 1200; People v. Duran (1976) 16 Cal. 3d 282, 295 [127 Cal. Rptr. 618, 545 P.2d 1322, 90 A.L.R.3d 1].) Both parties make the common mistake of treating this statement as an item of hearsay that is saved by an exception to the hearsay rule for statements of a declarant's then-existing \"state of mind.\" (Evid. Code, § 1250.) Yet the writers have long pointed out the distinction between (1) using an out-of-court declarant's assertion of his state of mind (e.g., A testifies that he heard the declarant B say, \"I am afraid of C\") to prove that mental state directly, and (2) using his assertion of other facts (e.g., A testifies that he heard B say, \"C threatened to kill me\") to prove the same mental state indirectly. The first is hearsay because it is used testimonially, i.e., it is offered for the purpose of inducing the trier of fact to believe in the truth of the assertion itself, just as if the declarant had so testified on the witness stand. The second is not hearsay because it is used circumstantially, i.e., it is offered as evidence of conduct on the part of the declarant (B reported that C threatened to kill him) from which the trier of fact is asked to draw an inference as to the declarant's state of mind at the time (B fears C). (See, e.g., 6 Wigmore, Evidence (Chadbourn rev. ed. 1976) §§ 1715, 1790; Assem. Com. on Judiciary, com. foll. Evid. Code, § 1250, 2d par.; Jefferson, Cal. Evidence Benchbook (1972) § 14.1, p. 168, caveat; Witkin, Cal. Evidence (1966) §§ 466-467, 556.) For present purposes, however, the failure to observe this distinction is immaterial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Although Ford and Davis happened to involve photographs, neither section 352 nor the Ford rule is restricted to demonstrative evidence, but applies rather to all evidence including testimony. (See Evid. Code, § 140.) Language to the contrary in People v. Braun (1973) 29 Cal. App. 3d 949, 966 [106 Cal. Rptr. 56], is disapproved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. An alternative holding apparently to the contrary in People v. Parks (1968) 263 Cal. App. 2d 490, 494-495 [69 Cal. Rptr. 368], is disapproved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Robison was one of the few prosecution witnesses who did not admit to being involved in criminal activities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. \"The general rule regarding misconduct of the district attorney which tends to and is likely to result in prejudice to the defendant is that where no objection is made to such misconduct by the defendant, or where objection is made and the court sustains the objection and properly admonishes the jury, the misconduct claimed to be prejudicial to defendant's rights will not furnish grounds sufficient to justify the granting of a new trial or the reversal of the judgment. (8 Cal.Jur., sec. 603, p. 623, and cases there cited.) There are two exceptions to this general rule. One is where the case is closely balanced and there is grave doubt of defendant's guilt, and the acts of misconduct are such as to contribute materially to the verdict, a miscarriage of justice results requiring a reversal. (People v. Fleming, 166 Cal. 357, 381 [136 Pac. 291, Ann. Cas. 1915B, 881].) The other exception is where the act done or remark made is of such a character that a harmful result cannot be obviated or cured by any retraction of counsel or instruction of the court. In such cases the misconduct will furnish ground for a reversal of the judgment, even where proper admonitions are given by the court. (People v. MacDonald, 167 Cal. 545, 551 [140 Pac. 256]; People v. Derwae, 155 Cal. 592, 597 [102 Pac. 266].)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The cases cited in support of this proposition all postdate the adoption in 1911 of the constitutional requirement of a showing of miscarriage of justice (former art. VI, § 4-1/2), and expressly or impliedly apply that test of prejudice. (People v. Fleming, supra ; People v. Ho Kim You, supra ; People v. Edgar (1917) 34 Cal. App. 459 [167 P. 891]; People v. Kilfoil (1915) 27 Cal. App. 29, 34-35 [148 P. 812].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. E.g., People v. Derwae (1909) 155 Cal. 592 [102 P. 266]; People v. Derbert (1903) 138 Cal. 467 [71 P. 564]; People v. Bowers (1889) 79 Cal. 415 [21 P. 752]. The case of People v. MacDonald (1914) 167 Cal. 545 [140 P. 256], came after the constitutional requirement, but its restatement of this ground (at p. 551) was wholly dictum. Unfortunately, the dictum was reproduced verbatim in section 603 (at pp. 623-624 of 8 Cal.Jur.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. For another version, slightly longer but equally formalistic, see People v. Varnum (1969) 70 Cal. 2d 480, 488 [75 Cal. Rptr. 161, 450 P.2d 553], and its progeny (e.g., People v. Washington (1969) 71 Cal. 2d 1061, 1083-1084 [80 Cal. Rptr. 567, 458 P.2d 479]; People v. Hathcock (1973) 8 Cal. 3d 599, 609 [95 Cal. Rptr. 221]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Courts of Appeal, of course, have dutifully followed this same evolution in decisions too numerous to list.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See, e.g., People v. Cook (1952) 39 Cal. 2d 496, 500 [247 P.2d 567]; People v. Kirkes (1952) 39 Cal. 2d 719, 726-727 [249 P.2d 1]; People v. Hampton (1956) 47 Cal. 2d 239, 240-241 [302 P.2d 300]; People v. Brice (1957) supra, 49 Cal. 2d 434, 437; People v. Seiterle (1963) 59 Cal. 2d 703, 710 [31 Cal. Rptr. 67, 381 P.2d 947]; People v. Ing (1967) 65 Cal. 2d 603, 613 [55 Cal. Rptr. 902, 422 P.2d 590]; People v. Nicolaus (1967) 65 Cal. 2d 866, 881 [56 Cal. Rptr. 635, 423 P.2d 787] [disapproved on another ground in People v. Wetmore (1978) 22 Cal. 3d 318, 327, fn. 7 (149 Cal. Rptr. 265, 583 P.2d 1308)]; People v. Cruz (1980) 26 Cal. 3d 233, 255 [162 Cal. Rptr. 1, 605 P.2d 830].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. There is no merit to the People's argument that defendant cannot raise this point on appeal because he failed to make a concomitant request for a cautionary instruction. When, as here, the court immediately overrules an objection to alleged prosecutorial misconduct, the defendant has no opportunity to make such a request and his failure to do so obviously cannot be held against him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Such expressions of opinion are, of course, perfectly proper. (People v. Beivelman (1968) supra, 70 Cal. 2d 60, 76-77, and cases cited.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The instruction, modeled closely on section 1127c, provided: \"The absence of flight by a person immediately after a crime has been committed is not sufficient in itself to establish his innocence, but it is a fact which, if proved, may be considered by you in the light of all other proved facts in deciding the question of his innocence or guilt. The weight to which such circumstance is entitled is a matter for the jury to determine.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This rule was followed, and the Montgomery language quoted with approval, in People v. Doran (1972) 24 Cal. App. 3d 316, 321, footnote 4 [100 Cal. Rptr. 886] (disapproved on different grounds in Evans v. Superior Court (1974) supra, 11 Cal. 3d 617, 625, fn. 6, and People v. Beamon (1973) 8 Cal. 3d 625, 629, fn. 2 [105 Cal. Rptr. 681, 504 P.2d 905]). (See also People v. Herrera (1917) 32 Cal. App. 610, 614 [163 P. 879].) Despite the opposition of Dean Wigmore (2 Wigmore, Evidence (3d ed. 1940) § 293, p. 190) it is also the general rule in our sister states. (See 1 Wharton's Criminal Evidence (13th ed. 1972) § 214, p. 456.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In flight cases it is settled that the distinction is nonexistent: \"There can be no well grounded difference, so far as the act evidences consciousness of guilt, between flight before and after the arrest.\" (People v. Ellis (1922) 188 Cal. 682, 693 [206 P. 753].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Thus it has been held that when evidence of flight is admitted, the surrounding \"events and circumstances\" are also admissible: \"The accused may explain his flight and may show that it was entirely consistent with his innocence; and in a like manner the people may introduce evidence of the circumstances connected with the flight which will strengthen its probative value as tending to show the guilt of the accused.\" (People v. Anderson (1922) 57 Cal. App. 721, 727-728 [208 P. 204].) If evidence of an absence of flight were admitted, presumably the parties would demand the right to introduce similar evidence: the prosecution would seek to prove that the defendant's failure to flee was entirely consistent with his guilt, while the defendant would attempt to bolster the inference of innocence by showing, for example, why his departure would have gone wholly unnoticed. In addition, within the limits of the doctrine of People v. Mendez (1924) supra, 193 Cal. 39, 51-52, discussed above (part I A, ante), the defendant might even try to establish for this purpose that a third person did abruptly leave the jurisdiction at the critical time -- evidence that would doubtless trigger prosecution demands for a further round of rebuttal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Two recent Court of Appeal opinions have sought to explain this rule as it was reiterated in People v. Doran (1972) supra, 24 Cal. App. 3d 316, 324 (see fn. 22, ante), by asserting that evidence of absence of flight is excluded because it has no \"tendency in reason\" to prove that the defendant had an innocent state of mind and hence is simply not \"relevant evidence\" within the meaning of Evidence Code section 210. (People v. De La Plane (1979) 88 Cal. App. 3d 223, 244 [151 Cal. Rptr. 843]; People v. Allen (1976) 65 Cal. App. 3d 426, 434 [135 Cal. Rptr. 276]; but see Jefferson, op cit. supra (supp. 1978) § 20.3, pp. 174-175.) We do not agree: the evidence has some \"tendency in reason\" to prove this fact, but its limited probative value is substantially outweighed by the danger that it will confuse the issues or mislead the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We further recognize that most of the foregoing criticisms of the use of evidence of absence of flight to show an innocent state of mind have also been leveled against evidence of flight as proof of consciousness of guilt. In particular, in the leading case of Wong Sun v. United States (1963) 371 U.S. 471, 483, footnote 10 [9 L.E.2d 441, 452, 83 S.Ct. 407], the United States Supreme Court observed that it had \"consistently doubted the probative value in criminal trials of evidence that the accused fled the scene of an actual or supposed crime.\" The court quoted with approval an earlier decision (Alberty v. United States (1896) 162 U.S. 499, 511 [40 L.Ed. 1051, 1056, 16 S.Ct. 864]) declaring it to be \"a matter of common knowledge\" that after a crime innocent persons may also flee \"through fear of being apprehended as the guilty parties, or from an unwillingness to appear as witnesses.\" (See also People v. Marquez (1968) 259 Cal. App. 2d 593, 605 [66 Cal. Rptr. 615], cert. den. 393 U.S. 955 [21 L.Ed.2d 367, 89 S.Ct. 386].) In California the prosecution is entitled to an instruction on flight not because such evidence is free of ambiguities or will not complicate the jury's task, but simply because Penal Code section 1127c makes the instruction mandatory when supported by the record. (People v. Cannady (1972) 8 Cal. 3d 379, 391 [105 Cal. Rptr. 129, 503 P.2d 585].) The combined result of section 1127c and the Montgomery rule may offend one's sense of logical symmetry, but it does not support defendant's final argument that it is \"unfair\" to instruct on flight as consciousness of guilt without permitting him to call the jurors' attention to evidence that may persuade them of his innocence. It is highly unlikely that in a single trial the record would support instructions on both flight and absence of flight by the same defendant; and as noted above (fn. 24, ante), if evidence of flight is admitted the defendant is entitled to explain it and show the jury that it is wholly consistent with innocence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Thus David Khan testified that as he drove away from the scene of the murder with defendant he asked the latter what should be done when the police talk to Pamela Robison, in view of the fact she last saw Karen in his company when he and Donnie picked Karen up at defendant's request; defendant instructed him to tell the police he had dropped Karen off at the Stickey Wicket. Robison testified, however, that on the following day (Oct. 12) defendant told her he was \"worried\" about Karen and on the previous evening had talked with her by telephone at the Stickey Wicket and then with a bartender who said \"she left with some guy.\" Laura Schmidt, Karen's sister, testified that on October 12 defendant telephoned her from Robison's house and asked where his wife was -- implying, of course, that he did not know. And Linda Creech testified that during their trip to Oregon two weeks later defendant told her that it was David Khan who had killed Karen and that he intended to get revenge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Not surprisingly, defendant takes the position that his counsel did use due diligence in his efforts to locate Khan. Nevertheless, in his brief on appeal the Attorney General suggests that on this point defendant \"should\" claim incompetency of counsel; and in his return to the order to show cause filed in the companion habeas corpus proceeding, the Attorney General undertakes to refute such a \"claim.\" He argues that \"despite his trial counsel's failings in this regard,\" defendant suffered no prejudice because if Khan had been called as a witness he would in fact have testified adversely to defendant; and to support this statement the Attorney General appends an affidavit by Khan reciting what his testimony assertedly would be. Defendant has filed a motion in this court to strike this portion of the return (part I E) and Khan's affidavit (exh. 10). Pointing out that he has never claimed his trial counsel was incompetent for failing to locate Khan, defendant contends the \"issue\" thus raised and answered by the Attorney General is wholly outside the scope of the habeas corpus proceeding; he further charges that the Attorney General's purpose in this maneuver is to bring before this court damaging material that was not introduced at trial and is therefore not properly part of the record on appeal. The point is well taken. In a habeas corpus proceeding it is the function of the petition to specify the grounds upon which the petitioner believes his restraint is unlawful. (Pen. Code, § 1474, subd. 2 [the petition must state \"in what the alleged illegality consists\"].) It is true that if an order to show cause is granted the return thereto may \"set up any authority or cause for the petitioner's imprisonment and restraint\" (In re Cleaver (1968) 266 Cal. App. 2d 143, 156 [72 Cal. Rptr. 20]; Pen. Code, § 1480, subd. 2), and that as to any factual allegations it makes for that purpose the return \"becomes the principal pleading, analogous to a complaint in a civil proceeding\" (In re Lawler (1979) 23 Cal. 3d 190, 194 [150 Cal. Rptr. 833, 588 P.2d 1257]). But such authority or facts must nonetheless be responsive to the grounds actually presented in the petition. It is settled that in a habeas corpus proceeding \"the court considers only those grounds of illegality alleged in the petition for issuance of the writ\" (In re Connor (1940) 16 Cal. 2d 701, 711 [180 P.2d 10]), or in any supplemental petition filed with permission of the court (see, e.g., In re Haygood (1975) 14 Cal. 3d 802, 805 [122 Cal. Rptr. 760, 537 P.2d 880]). It is therefore manifestly improper for the respondent to raise in his return a new ground of possible illegality for the sole purpose of introducing factual matter to refute it. We will not countenance the use of such a straw man to subvert either the orderly process of framing the issues in a habeas corpus proceeding or the established rules governing the content of a record on appeal. The motion to strike will accordingly be granted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Even if Mr. Weiner had somehow learned of McGown in time for the case to be of any use to defendant, it does not follow from the mere possibility of an evidentiary hearing on place of transfer that a change of venue will not affect defense costs or counsel's continued representation. The purpose of such a hearing is to ensure that the case is transferred not merely to the court most convenient to the parties but to (1) an available court in which (2) a fair trial is reasonably likely; and the courts that are available for this purpose are determined not by the parties but by the Administrative Director of the Courts. (Cal. Rules of Court, rule 842; see generally Pen. Code, § 1038.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. As of July 1, 1977, the population of Sutter County was approximately 48,000; 21 counties in the state have a smaller population. (Cal. Statistical Abstract (1979) p. 9, table B-3.) Defendant claims that Sutter County has been \"judicially recognized\" as a place where extensive pretrial publicity \"could easily jeopardize\" the right to an impartial jury. But he refers again to the Corona case (Corona v. Superior Court (1972) 24 Cal. App. 3d 872, 883 [101 Cal. Rptr. 411]), distinguishable here by the enormity of the crime charged against the accused -- the mass murder of 25 persons. Corona certainly does not stand for the proposition that no defendant charged with homicide can get a fair trial in Sutter County.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. On several occasions the reports indicated that defendant was marginally involved with the Hell's Angels motorcycle gang and had used the alias \"Charles Manson.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Proffitt v. Florida (1976) 428 U.S. 242 [49 L.Ed.2d 913, 96 S.Ct. 2960], Jurek v. Texas (1976) 428 U.S. 262 [49 L.Ed.2d 929, 96 S.Ct. 2950], Woodson v. North Carolina (1976) 428 U.S. 280 [49 L.Ed.2d 944, 96 S.Ct. 2978], and Roberts v. Louisiana (1976) 428 U.S. 325 [49 L.Ed.2d 974, 96 S.Ct. 3001]. References hereinafter to Gregg et al. are to Gregg and these four cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In addition, with the exception of murder for hire or by explosives, in all cases it was required that the defendant have been personally present during the fatal act and have physically committed or aided such act with intent to cause death. (Id., subd. (c); see also subd. (d) and former § 190.5, subds. (b) and (c).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. If the jury found one or more such circumstances to be true, a further hearing was held -- the penalty phase -- at which a wide range of evidence in \"aggravation\" or \"mitigation\" could be introduced, including the nature and circumstances of the offense, prior criminal activity by the defendant involving force or violence, and \"the defendant's character, background, history, mental condition and physical condition.\" (Former § 190.3.) At the conclusion of that hearing the jury was called upon to \"consider, take into account and be guided by\" such evidence and determine whether the penalty should be death or life imprisonment without possibility of parole. (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The question is still open, as a majority of this court declined to reach similar constitutional arguments in People v. Frierson (1979) supra, 25 Cal. 3d 142, 188 (opn. of Mosk, J., and Newman, J.), page 196 (opn. of Bird, C. J.), and page 199 (opn. of Tobriner, J).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. For convenience we shall hereinafter refer to this finding as the robbery special circumstance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. A spouse may be convicted of stealing the separate property of his or her spouse. (People v. Graff (1922) 59 Cal. App. 706 [211 P. 829].) The record is silent as to whether the items here in issue were separate property or community property. It is reasonable to assume, however, that defendant purchased these rings with his separate funds before the marriage and gave them to Karen at their wedding; in that event, of course, the rings would have been her separate property. And in view of the extreme brevity of the marriage -- approximately two months -- it is also reasonable to assume that Karen acquired her purse and clothing while still single; if so, they too remained her separate property at the time of her death. (Cf. Estate of Jolly (1925) 196 Cal. 547, 555 [238 P. 353] [personal property in the possession of a spouse at the end of a long marital relationship is presumed to be community property].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Creech also claimed that a couple of days later he drove defendant to the house of Garry Harman, and assertedly saw defendant give the latter the rings with instructions to conceal them until he sent word. Harman, designated by the municipal court to act as an investigator in this case, testified on the contrary that defendant never gave him these rings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The prosecutor had some difficulty in fitting the purse into his argument. He admitted there was no evidence that Karen took her purse with her when she alighted from the car at the scene of the crime, and he warned the jury that \"I don't want you to speculate on the issue.\" He was therefore compelled to argue that \"in any event, the purse was in the car and ended up in the possession of the Defendant all in the same general area, the person or immediate presence of the victim.\" In other words, he asked the jury to find that the car and its contents, including the purse, remained within Karen's \"immediate presence\" at all times until her death. Given the definition of the offense codified in section 211, such a finding would be mandatory to support a verdict that defendant robbed Karen of her purse.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The prosecutor made no attempt to suggest how defendant might be found to have used either force or fear to take Karen's purse, and the Attorney General is equally silent on the point in his briefs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The jurors were so informed by the prosecutor, who told them that \"it would have to be your conclusion before you could find either or both of those [special] circumstances to be true that the defendant is also guilty of either or both of the second or third counts, which allege robbery and kidnaping.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. If the victim is alive at the time of the taking, that offense will be grand theft from the person (§ 487, subd. 2); if he is not, it will be grand or petty theft from a dead body (§ 642). The defendant will also be guilty, of course, of any crime constituted by the act of force itself, e.g., assault, battery, or homicide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. E.g., Alaniz v. State (1944) 147 Tex.Crim. 1 [177 S.W.2d 965, 967]; State v. Covington (1930) 169 La. 939 [126 So. 431, 433]; People v. Jordan (1922) 303 Ill. 316 [135 N.E. 729, 730]; cf. Carey v. United States (D.C.Cir. 1961) 296 F.2d 422, 426-427.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Further support for this conclusion may be found, by analogy, in the settled rule that when the force used against the victim results in his death, the defendant's intent to rob will not support a conviction of felony murder (§ 189) if it arose after the infliction of the fatal wound. (People v. Gonzales (1967) 66 Cal. 2d 482, 486 [58 Cal. Rptr. 361, 426 P.2d 929]; People v. Jeter (1964) 60 Cal. 2d 671, 676-677 [36 Cal. Rptr. 323, 388 P.2d 355]; People v. Carnine (1953) 41 Cal. 2d 384, 388 [260 P.2d 16]; People v. Hardy (1948) 33 Cal. 2d 52, 59 [198 P.2d 865].) As we summarized in People v. Anderson (1968) 70 Cal. 2d 15, 34 [73 Cal. Rptr. 550, 447 P.2d 942], \"the evidence must establish that the defendant harbored the felonious intent either prior to or during the commission of the acts which resulted in the victim's death; evidence which establishes that the defendant formed the intent only after engaging in the fatal acts cannot support a verdict of first degree murder based on section 189.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The district attorney urged in argument that defendant planned to steal Karen's property from the very beginning of the kidnaping. But the jury did not accept this view of the evidence when it impliedly acquitted him on count III of kidnaping Karen for the purpose of robbery in violation of section 209. The jury was correctly instructed that section 209 is not violated unless the intent to rob exists at the time the asportation begins. (People v. Tribble (1971) 4 Cal. 3d 826, 829 [94 Cal. Rptr. 613, 484 P.2d 589].) By refusing to find defendant guilty as charged on that count, the jury may have found that he did not in fact harbor an intent to steal any of Karen's property when the kidnaping commenced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Just as the prosecutor failed to tell the jury how defendant might be found to have used force or fear to take the purse (fn. 40, ante), so also he failed to explain when defendant should be deemed to have taken it; and again the Attorney General is silent on the point. Yet the answer is plain. On this matter Khan testified only that when he stopped by the river \"Charlie [i.e., defendant] and Karen got out of the car.\" The record is devoid of evidence that defendant compelled Karen to leave her purse behind as she did so. Defendant cannot therefore be found to have \"taken\" the purse at that time, i.e., by forcibly separating her from it. The sole possible inference from the evidence is that all the parties simply forgot about the purse until defendant and Khan found it on reentering the car after the killing. It follows that defendant did not \"take\" the purse until he and Khan drove away with it as they left the area to return to Sacramento.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. But see People v. Ojeda (1933) 132 Cal. App. 593 [23 P.2d 316], in which the defendant and three others were convicted of grand theft for stealing and killing a hog and dividing its meat among themselves. The court said in dictum, \"The participation in the transaction with a felonious intent to kill the hog and wrongfully deprive the owner of the animal constitutes the crime of grand theft, even though the accused shares in only a small portion of the carcass or obtains no part of it at all.\" (Italics added; id. at p. 599.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The district attorney apparently drew the same inference in his argument to the jury: \"I think the Defendant's comment after killing the victim and going through her belongings at the Reeves residence indicates that his sole [actions] that day were not motivated by the attempt to commit a robbery. I believe his comments in finding approximately $3 in the clothing to David Khan, this would have been a hell of a robbery.\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. I.e., the murder was willful, deliberate and premeditated, and the defendant was personally present during the fatal act and intentionally committed or aided such act. (See fn. 33, ante.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The three members of this court who did reach the constitutional question in Frierson emphasized this function of the special circumstances requirement when they rejected claims of unguided jury discretion (25 Cal. 3d at p. 177) and lack of written findings (id. at p. 179).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Concealment of the victim's identity, even by partial or total destruction of the corpse, is not a special circumstance under the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. For convenience we shall hereinafter refer to this finding as the kidnaping special circumstance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. As will appear, in his argument to the jury the district attorney further divided this segment at the point at which Karen attempted unsuccessfully to climb into the back seat.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Thus the district attorney reasoned that \"The acquisition [of the victim] was by fraud . . . . [If] the Defendant honestly believed that the victim would go with him to the places that he took her, why was it necessary to acquire possession of her through the false . . . story, through something to mislead her in thinking she was going to her sister's place to pick up some stuff that belonged to him and in fact bringing her directly to him. That in and of itself refutes any kind of argument that the Defendant reasonably believed there was consent from the victim.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Under section 207 a defendant is guilty of a general kidnaping only if he \"forcibly steals, takes, or arrests any person in this state, and carries him into another country, state, or county, or into another part of the same county . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The Attorney General concedes as much in his supplemental brief, stating that \"Since Karen entered David Khan's car initially of her own volition and voluntarily rode with him to the Scott-Reeves residence, despite the fact her presence was secured by fraud, there clearly was no kidnaping prior to their meeting up with [defendant] at the Scott-Reeves residence . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Because the statute declaring the crime of kidnaping for the purpose of robbery (Pen. Code, § 209) is deemed to incorporate the definition of \"kidnaping\" set forth in section 207 (People v. Daniels (1969) supra, 71 Cal. 2d 1119, 1131), cases decided under both statutes are apposite for this purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. This conclusion is consistent with the district attorney's argument that the parked car and its contents remained within Karen's \"immediate presence\" at all times until her death. (See fn. 39, ante.) Obviously an object that is within a person's \"immediate presence\" cannot also be in \"another part of the same county.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The latter figure should probably be part of the larger figure of 20 miles, which was the total distance that Khan estimated he drove. The discrepancy, however, is immaterial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. The implication that \"the immediate side of David Khan\" was a place of safety is refuted, of course, by the undisputed fact that Khan was a close friend of defendant and was obviously cooperating with him in the events of the day: at defendant's direction Khan had lured Karen into his car by fraud, had brought her to defendant, and had driven both of them to the secluded place where defendant intended to kill her. More importantly, Khan already had callously refused a mute but unmistakable appeal for help by Karen.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. See, e.g., Henderson v. Harnischfeger Corp. (1974) 12 Cal. 3d 663, 671-674 [117 Cal. Rptr. 1, 527 P.2d 353]; Miller v. Peters (1951) 37 Cal. 2d 89, 95 [230 P.2d 803]; Huebotter v. Follett (1946) 27 Cal. 2d 765, 770-771 [167 P.2d 193]; Oettinger v. Stewart (1944) 24 Cal. 2d 133, 140 [148 P.2d 19, 156 A.L.R. 1221].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. I.e., on a confession by an accomplice whose testimony was corroborated by evidence placing the defendant at the scene of the crime; on the latter confession but on a theory that he was not an accomplice; or on extrajudicial statements of alleged coconspirators.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. He was arrested on October 16, 1977, and falsely told the investigating detectives that on the day of the murder he dropped Karen off at the Stickey Wicket. On October 18 he gave another statement in which he falsely stated that it was defendant who removed the rings from Karen's hand and that he, Khan, did not know what became of Karen's clothes. About the same time he wrote a letter to a police captain in effect confessing to Karen's murder, but on October 19 he denied the contents of the letter were true. At the preliminary examination he testified that after he and Creech had burned Karen's clothes and purse, his girlfriend Sandy put water in the bucket to extinguish the fire; at the trial, however, he denied on cross-examination that the latter was present at the burning, and lamely sought to explain away the inconsistency by claiming the court reporter wrote \"Sandy\" when he had really said \"sand\" -- although admitting his prior testimony makes no sense with that \"correction.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Thus he acknowledged that for a substantial period of time prior to these events he had been \"involved in criminal activities\"; that on occasions he and Larry Creech were \"crime partners,\" primarily in drug dealing; and that he had previously been convicted on a guilty plea of robbing a gas station with a sawed-off shotgun, and had served time in prison for that crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Thus he admitted that at the time of trial herein eight felony charges were pending against him in Yolo County, accusing him and his brother Donnie of assaulting their own aunt and uncle with a gun in an attempt to extort money; that although those charges were filed in August 1977 he had not yet been brought to trial thereon at the time he was called to testify (Feb. 1978), and he could offer no explanation for that fact. He also conceded that when he was arrested on October 16, 1977, it was because he was driving under the influence of drugs -- he had wrecked the car in which he was carrying as passengers his brother Donnie, Linda Reeves, Diane Scott, and the latter's son -- yet he was never prosecuted for that offense and the charges were subsequently dropped.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. In Henderson, the case went to the jury on two alternate theories of second degree murder: an unintentional killing resulting from a reckless act highly likely to cause death, and second degree felony murder based on felony false imprisonment. We held the latter theory erroneous because false imprisonment is not an offense inherently dangerous to human life; and we found the error prejudicial because an opportunity to convict the defendant on a felony-murder theory \"'relieved the jury of the necessity of finding malice aforethought in the circumstances.'\" (Id. at p. 96, quoting from People v. Lopez (1971) 6 Cal. 3d 45, 52 [98 Cal. Rptr. 44, 489 P.2d 1372].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. In these circumstances we need not reach the question whether the murder was committed \"during the commission\" of a kidnaping. (Cf. part II C, ante.)\u003c/span\u003e\n\n",
    "body_length": 203817,
    "citedas": [
      "164 Cal. Rptr. 1",
      "609 P.2d 468",
      "27 Cal. 3d 1"
    ],
    "attorneys": "Quin Denvir, State Public Defender, under appointment by the Supreme Court, Ezra Hendon, Chief Assistant State Public Defender, and Richard E. Shapiro, Deputy State Public Defender, for Defendant and Appellant and Petitioner. George Deukmejian, Attorney General, Robert H. Philibosian, Chief Assistant Attorney General, Arnold O. Overoye, Assistant Attorney General, Willard F. Jones, Arthur G. Scotland, Roger E. Venturi and Edmund D. McMurray, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Opinion by Mosk, J., with Bird, C. J., Tobriner and Newman, JJ. concurring. Separate concurring and dissenting opinion by Richardson, J., with Clark and Manuel, JJ., concurring.",
    "citation_count": 35
  }
}
