{
  "id": "9bhmTmYBTlTomsSBj6rB",
  "document": {
    "title": "In re Baby",
    "full_title": "IN THE MATTER OF BABY \"M\", A PSEUDONYM FOR AN ACTUAL PERSON",
    "jurisdiction": "New Jersey Superior Court",
    "date": "1987-03-31T00:00:00.000Z",
    "docket": "No. FM-25314-86E",
    "body": "The Issue.\n\nThe primary issue to be determined by this litigation is what are the best interests of a child until now called \"Baby M.\" All other concerns raised by counsel constitute commentary.\n\nThat commentary includes the need to determine if a unique arrangement between a man and woman, unmarried to each other, creates a contract. If so, is the contract enforceable; and if so, by what criteria, means and manner. If not, what are the rights and duties of the parties with regard to custody, visitation and support.\n\nJurisdiction.\n\nThere can be no solution satisfactory to all in this kind of case. Justice, our desired objective, to the child and the mother, to the child and the father, cannot be obtained for both parents. The court will seek to achieve justice for the child. This court's fact finding and application of relevant law must mitigate against the heartfelt desires of one or the other of the natural parents.\n\nWhere courts are forced to choose between a parent's rights and a child's welfare, the choice is and must be the child's welfare and best interest by virtue of the court's responsibility as parens patriae. In re J.R. Guardianship, 174 N.J. Super. 211, 224 (App.Div.1980).\n\nProbably the most important authority of the court is the exercise of its parens patriae jurisdiction. Jurisdiction is a word of broad and comprehensive impact. It means the authority by which courts and judicial officers take cognizance of and\n\ndecide cases. It means the authority to act, to find, define and apply the law.\n\nParens patriae is that power of the sovereign (in this case the State of New Jersey by its judicial branch) to watch over the interests of those who are incapable of protecting themselves. Black's Law Dictionary (4 ed. 1975). The case of Lippincott v. Lippincott, 97 N.J. Eq. 517, 519 (E. \u0026 A.1925) is further instructive. Justice Minturn writes that parens patriae was known in varying terms from the time of early Greek civilization. In Greece, a child was a charge of the state. After infancy the state took the child into its control and educated him to the will of the state. Early English common law conceded to the parent absolute control of the child subject to the power of the king in the interest of the child as well as in the interest of the state. 1 Blackstone's Commentaries 451. In our nation, early decisions defining the jurisdiction of the court of equity hold that a court's right to intervene for the protection of an infant is an inherent power of the court. People v. Mercein, 8 Paige Ch. 55 (Ch.N.Y.1883). It appears well settled that courts having historic chancery or equity jurisdiction exercise and control the sovereign power called parens patriae.\n\nThis historic jurisdiction was developing in 13th- and 14th-century England. In early English common law, all judicial authority reposed in the crown. Ultimately, as the population expanded and society's problems grew complex, the crown delegated these problems to courts of law for resolution. The king retained certain prerogatives to insure that ultimate equity was done. When an injustice was found at law, or perhaps the law had no remedy for a particular circumstance, a plea to the crown or to its lord chancellor led to the creation of a separate system of law -- one where the chancellor (hence chancery) as keeper of the king's conscience sought to do equity and cure the injustice and inequities often caused by the inflexible forms of the common law. As this alternate system grew, its hallmark became one of flexibility and invention to meet new\n\nsituations and circumstances. Conflict arose between equity and law creating, rather than ameliorating, injustice. This caused Parliament, by 1875, to enact laws abolishing the separate court system. This merger of systems did not occur in New Jersey until some 75 years later when, in the New Jersey Constitution of 1947, a unified court system was created. While Article III of the State Constitution created a unified Superior Court, a Chancery Division within the court continued to exercise the historic powers of the original courts of equity. Kimmelman, I., \"Chancery: Introduction and Perspective,\" New Jersey State Bar Journal (Summer 1977).\n\nThus, it is pursuant to R. 5:2-1, which defines actions cognizable in the Superior Court, Chancery Division, Family Part, that this court, as the present day successor to a part of that historic legacy of equity jurisdiction, applies said jurisdiction to the issues herein presented; to wit, the best interest of a child and contractual rights, if any, of the litigating parties.\n\nVenue.\n\nVenue is a concept of place -- in this context, where should a lawsuit be brought. Jurisdiction defines the court's authority; venue defines in which geographic area the suit should be instituted. Mr. and Mrs. William Stern\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e live in Bergen County, New Jersey. Mr. and Mrs. Richard Whitehead live in Ocean County, New Jersey. The child was taken from Bergen County to Ocean County and returned to Bergen County ultimately from the State of Florida. At the time of the institution of this suit, Mr. and Mrs. Stern believed they had the right to have the child returned to them in Bergen County. They believed \"Baby M\" was a resident of Bergen County; hence, Mr. and Mrs. Stern began their action here. R. 5:2-1 provides that an action involving status of children should be\n\nbrought in the county of domicile. There never was a challenge to this placement of venue. This court concludes that venue is properly in Bergen County.\n\nProcedural History.\n\nThis litigation began on May 5, 1986, when Mr. and Mrs. William Stern filed an ex-parte application for an order to show cause why this court should not issue an order for a summary judgment to enforce a surrogate-parenting contract. The order to show cause was returnable on May 27, 1986.\n\nAt the same time a verified complaint was filed seeking to enforce a surrogate-parenting agreement, compel the surrender to plaintiffs of the infant child born to Mrs. Mary Beth Whitehead, restrain any interference with plaintiffs' custody of the infant, terminate Mrs. Whitehead's parental rights and allow adoption of the child by Mrs. Stern.\n\nMuch has been made by Mr. and Mrs. Whitehead that the court ordered a return of the child without notice (ex-parte) to them. All of defendants' arguments in this regard fail because it is clear that R. 4:52-1, which provides for orders to show cause with temporary restraints, specifically allows for a temporary restraint to issue if the facts alleged in a verified complaint or affidavit allow the court to conclude that immediate and irreparable harm or damage will result to plaintiff before notice can be served and a hearing had thereon. The court's fact finding will show clear support for such a conclusion. Indeed, the anticipation by the Sterns of the Whiteheads' flight from New Jersey after service upon them of the restraining order is proof that the Sterns' pleadings contained credible and convincing evidence of immediate and irreparable harm, if not to plaintiffs-Stern than certainly to the infant.\n\nNotwithstanding defendants-Whiteheads' protestations about the lack of knowledge of the order's contents and about the lack of service of the order upon them, valid and credible proof of service of process on defendants-Whitehead appears from\n\nthe certification of a Brick Township police officer dated May 28, 1986, attesting to his having personally left the complaint and order to show cause with defendants-Whitehead on May 5, 1986. Pursuant to R. 4:4-4, defendants were lawfully and properly served and this court then obtained in personam jurisdiction over them.\n\nOn May 27, 1986, the return day of the order to show cause, no one appeared for defendants-Whitehead and this court continued the temporary restraint order until July 17, 1986. After proof of service was filed and no appearance was entered by the defendants-Whitehead on July 17, 1986, some 2 1/2 months after initial service, this court made an order requiring surrender of the infant to plaintiff William Stern, the natural father, who was also granted temporary custody. The order further provided for restraints against defendants-Whiteheads' interfering with plaintiff William Stern's custody of the infant, authorized Mr. Stern to get the child's birth records and pursuant to the Uniform Child Custody Jurisdiction Act, N.J.S.A. 2A:34-28 et seq., authorized the filing of the New Jersey custody order in Florida. Parenthetically, it is noted that on the day following May 5, 1986, when this court gave temporary custody to plaintiff William Stern, the Whiteheads removed the child from New Jersey and plaintiff William Stern instituted proceedings pursuant to N.J.S.A. 2C:13-4a, unlawful interference with custody. That law makes it a criminal offense to interfere with or remove a child from its custodial parent. Disposition of this complaint to this court's knowledge is still pending.\n\nOn August 6, 1986, the first of the Whiteheads' three lawyers entered an appearance on their behalf. On August 16, 1986, the second of defendants' three attorneys entered his appearance. After notice to all counsel, including counsel about to be substituted, on its own motion the court entertained argument on August 13, 1986, on the appointment of a guardian ad litem for the infant. Over the objection of plaintiffs-Stern, after reviewing briefs of counsel and hearing argument, this court\n\nentered an order calling for the appointment of a guardian ad litem.\n\nThe need for the appointment of the guardian ad litem was clear to this court. Each of the principal litigants was concerned with their own agenda; to wit, the return of the child to their permanent custody to the total exclusion of the other. None of their attorneys could wholly and/or ably represent their client and independently represent the infant. The child is also a real party in interest to this litigation. It is with her welfare that this court is concerned and that welfare may be viewed differently by the principal litigants, thus necessitating independent representation. Another reason is of possible constitutional proportions. If a case proceeds and a real party in interest is not permitted independent representation, this fact could very well be a denial of procedural due process. Good social authority for the appointment of an independent attorney for the child is cited in Goldstein, Freud and Solnit, Beyond the Best Interests of a Child (1973), at 66, in which the authors write that every child must be recognized as a necessary indispensable party. The child has a direct personal interest in the result of the litigation. As such, the child must have its interests independently interpreted. Finally, this court wrote some six years ago that the impact of a court decision on custody affects a total lifetime. There is seldom a greater interest before any court than a child's interest. Sorkow, \"Functions of a Guardian ad Litem,\" New Jersey Lawyer (May 1981), at 11.\n\nContinuing with the procedural history, on August 22, 1986, based on representations by Mrs. Whitehead that she had uncontracepted intercourse with her husband prior to conceiving \"Baby M\" and that plaintiff Mr. Stern was not the father of the subject child, this court ordered an HLA blood test to determine paternity. Mrs. Whitehead failed to make known to the court at that time that her husband Richard Whitehead had a vasectomy nine years ago. The results of the test proved conclusively that Richard Whitehead was not and could not be\n\nthe biological father, but rather the probability of paternity of William Stern was 99.96% as compared to an untested man of the North American Caucasian population. It must be noted that the HLA test is accepted in our court as scientifically reliable. Malvasi v. Malvasi, 167 N.J. Super. 513 (Ch.Div.1979). The court subsequently ruled that plaintiff William Stern was the natural biological father of the infant child born to defendant Mary Beth Whitehead. This court also concludes that defendant Mary Beth Whitehead is the biological mother of \"Baby M.\"\n\nOn September 2, 1986, Mr. and Mrs. Whitehead filed an answer to the complaint and a counterclaim seeking custody and damages for fraud.\n\nAnother ancillary issue was addressed by the court when its order to seal the proceedings was attacked by several newspapers. This court, in its discretion as provided by R. 5:3-2, sealed the record and ordered in camera hearings to protect the infant child, whose origins are unique, from the stigmata of uncontrolled publicity. Furthermore, statutes dealing with termination of parental rights and adoption call for closed door hearings. By reason of the maternal grandmother giving all of the background facts as she perceived them to the St. Petersburg (Florida) Times after \"Baby M\" was recovered by Florida authorities, which information was copied by the metropolitan New York area media, confidentiality, to protect the child's welfare, became a moot and impossible issue. The matter proceeded thereafter, by order dated September 25, 1986, in open court. So much for the balancing of the competing concepts of freedom of information against the welfare of a child. But for the prior publication by Mrs. Messer of the facts as she saw them, this case would have proceeded in camera to protect the infant child. Only the issue of Mrs. Stern's medical history required further attention. The Appellate Division of the Superior Court by order dated November 21, 1986, reversed this trial court's order which sealed Mrs. Stern's deposition as\n\nto her medical condition and thus permitted the press access to -- hence public knowledge of -- those personal facts.\n\nOn September 10, 1986, an order was entered calling for limited visitation with the child called \"Baby M\" by only Mrs. Whitehead. The visitation was expanded by order of October 7, 1986. It was in this order that the court requested a Bergen County probation report on the pending custody issue. On September 7, 1986, in an ex-parte order, this court permitted defendant Mrs. Whitehead to take photographs of the child but restrained her from distributing them to the press. The court also denied defendant Mrs. Whitehead's request to permit her dog to visit with the then six-month-old child. On October 20, 1986, supervised visitation was increased to two hours twice weekly.\n\nOn September 18, 1986, an order was entered discharging writs of attachment against the Whiteheads' personal property. Writs had been filed against real and personal property of the Whiteheads when it was apparent that they had fled the jurisdiction of this court. The realty was cleared from the lien of the writs on or about October 20, 1986.\n\nOn September 25, 1986, a court order required $10,000, which was to be paid pursuant to the surrogate-parenting agreement, to be deposited with the Clerk of the Superior Court. This was accomplished by October 22, 1986.\n\nA motion for pendente lite visitation by the maternal grandparents was denied without prejudice. They were instructed to file a complaint for visitation since they had no standing to file a motion in a law suit in which they were not parties. On October 7, 1986, the maternal grandparents filed such a complaint. Their right to intervene was confirmed on October 14, 1986. Their motion for pendente lite visitation was denied on October 30, 1986, and the ultimate question of their right to visitation was deferred to the plenary trial.\n\nOn October 17, 1986, by consent order, the third attorney for Mr. and Mrs. Whitehead was substituted for prior counsel.\n\nOn November 6, 1986, the court entered its pretrial order which, inter alia, defined the trial issues.\n\nOn November 18, 1986, this court directed that the trial would commence on January 5, 1987, in a bifurcated manner. First to be tried would be the contract issues which, it was believed, would then be reviewed by appellate courts. Having their determination and instruction, the trial would then proceed with appropriate direction on the best-interests issues. The Appellate Division on December 3, 1986, reversed the trial court's order for bifurcated proceedings and required the trial on all issues to begin January 5, 1987. All discovery was required to be completed prior to trial. Faced with the critical scheduling required by this order, plaintiff William Stern appealed to the New Jersey Supreme Court which on December 3, 1986, ordered a non-bifurcated trial to begin as scheduled, but permitted the trial court to define the discovery schedule and further gave the trial court authority to enter its final judgment on less than all issues pleaded.\n\nThe trial commenced on January 5, 1987.\n\nFindings of Fact, Conclusions of Law and Opinion.\n\nAn estimated 10% to 15% of all married couples are involuntarily childless. This calculation represents a three-fold increase of childless married couples over the last 20 years. It is estimated that between five-hundred thousand and one million married women are unable to have a child related to them genetically or gestationally without some kind of assisted fertilization or uterine implant. National Center for Health Statistics, Vital and Health Statistics (December 1982) ยง 23 # 11 at 13-16, 32.\n\nThe demand for this aid is more than the physical act of gestating and birthing a child. It follows from the social and psychological importance people attach to the ideal of having children who are genetically theirs. The desire to reproduce blood lines to connect future generations through one's genes\n\ncontinues to exert a powerful and pervasive influence. Being unable to bear a child excludes women and men from a range of human activity associated with child bearing and rearing. Hollinger, \"From Coitus to Commerce: Legal and Social Consequences of Non-coital Reproduction,\" 18.4 Journal of Law Reform 865 (1985).\n\nAdoption is often considered, but for reasons of age, religion or unavailability of an adoptable child, it is more and more often deemed impracticable. Nationwide, the wait for an adoptable infant is from three to seven years. Hearings on Baby Selling before the Subcomm. on Children and Youth of the Senate Comm. on Labor and Public Welfare, 94th Cong., 1st Sess. (1975). In 1984, two million couples contended for the 58,000 children placed for adoption. This was a 35 to 1 ratio. Wilson, \"Adoption, It's Not Impossible,\" Business Week (July 8, 1985) at 112.\n\nThe dearth of adoptable children is the result of several circumstances. One of the most ironic reasons for the adoptable child shortage is woman's successful effort to have free choice to prevent conception. This had led to increased sexual activity giving rise to greater use of birth-control means as well as the increase of sexually-transmitted disease all to the harm of the female reproductive capability. Couples postpone child bearing until an age when it is more difficult to conceive. A woman's constitutionally protected right to choose abortion has also served to reduce the number of available adoptable children. A final reason for this adoptable child shortage is that changing social mores lead to greater numbers of unwed mothers electing to keep and rear their children in one-parent households. Handel and Sherwyn, \"Surrogate Parenting,\" 18 Trial 57 (1982).\n\nIt should be apparent from the foregoing that a large segment of our potential childbearing population is unable to bear a child naturally. Adoption is not available. These facts oblige many people to turn to alternative methods of reproduction to\n\nobtain a family. One method of collaborative reproduction is in vitro fertilization. The basic process of in vitro fertilization is where a wife's egg is removed and introduced to the husband's sperm. The then fertilized embryo is replaced in the wife's womb for gestation. Medical science has developed eight variations of this process including the use of third parties for the donation of egg, sperm and/or gestational capability. Another alternative method of reproduction is artificial insemination. This method provides for the introduction of either a spouse's or a stranger's sperm into the spouse or third-party gestator.\n\nNeither of the foregoing methods involve genetic manipulation -- involved only are conception, gestation and birth -- so we are not dealing with Huxley's Brave New World. A common element in either of the two alternative reproductive methods is the use, where required and appropriate, of a surrogate.\n\nUse of a surrogate calls for the gestator to be artificially inseminated or implanted with a fertilized egg, carry the child to term and after delivery relinquish all parental rights and give the child to its natural father who was, of course, the sperm donor. (In some variations of alternative reproduction even this basic assumption need not be so.). The wife of the biological father then adopts the child.\n\nThe development of new techniques and alternatives for non-coital reproduction have given society awesome opportunities. The transformation of the family will continue in the coming years because of these new techniques. As Doctor Judith Greif testified, \"We are already dealing with a new family form.\" Unfortunately, the law is slow to react to the rapid advance of science and changing human behavior. J. Mandler, \"Developing a Concept of the Modern Family,\" 73 Georgetown Law Review 1283 (1985). This minimal pace is made apparent when it is realized that as of this date not one state in this nation has adopted a law that specifically addresses either affirmatively or negatively the concept of surrogate parenting although many studies are in process and legislation\n\nhas been introduced. There are two bills pending in the New Jersey Legislature.\n\nIt took years of legislative debate and judicial inquiry to define and develop today's laws of abortion and artificial insemination. The issues and dimensions of surrogacy are still evolving, but it is necessary that laws be adopted to give our society a sense of definition and direction if the concept is to be allowed to further develop. With an increasing number of surrogate births, legislation can avoid harm to society, the family and the child. Some of the issues that need legislation are: establishing standards for sperm donors, legitimacy of the child, rights of the biological father's spouse, rights of the biological mother's spouse, rights of the two biological actors as to each other and to the child, qualifications for the surrogate, the allowance of compensation to the surrogate and concerns regarding the imperfect child. Many questions must be answered; answers must come from legislation. If there is no law then society will suffer the negative aspects of this alternative reproduction vehicle that appears to hold out so much hope to the childless who make up a substantial segment of our society.\n\nToday, however, this court can only decide what is before it. France v. A.P.A. Transport Corp., 56 N.J. 500, 504 (1970). It will decide on legal principles alone. This court must not manage morality or temper theology. Its charge is to examine what law there is and apply it to the facts proven in this cause.\n\nThis is a nonjury trial. At law, it is the jury that makes the findings of fact. As in all chancery proceedings, the court is the fact finder.\n\nThis court has spent six weeks in the actual trial of the issues before it. The parties, with their 38 expert and lay witnesses, have testified. The admissible evidence has been marked. The testimony and the tangible evidence have been carefully listened to, noted and reviewed by this court. The credibility of the witnesses has been examined, tested and weighed.\n\nThis court makes the following findings of fact: William Stern was born in Berlin, Germany, on January 27, 1946. His parents were the sole surviving members of his family to escape the Holocaust. Shortly after his birth, the family settled in Pittsburgh, Pennsylvania, where he grew up in the midst of loving parents and financial insecurity. He became a United States citizen when his parents became citizens in 1954. His father, a banker in Germany, worked as a factory hand and short-order cook. His mother worked in a storm window factory. William Stern contributed to the support of his family by working at various after-school jobs. His father died when the boy was 12 years-of-age leaving his mother as his only surviving relative. Ultimately, Mr. Stern and his mother moved to New York where Mr. Stern began college. He graduated New York University and then attended graduate school at the University of Michigan. He has worked in the public sector and in private industry as a research scientist.\n\nMr. and Mrs. Stern met when they were both graduate students at the University of Michigan and began dating in 1969. The couple was married in East Lansing, Michigan, on July 27, 1974, by a minister friend of the family. By now each had earned a Ph.D. -- Mr. Stern in bio-chemistry and Mrs. Stern in human genetics.\n\nWith the death of his mother in 1983, Mr. Stern became the only surviving member of all branches in his family.\n\nElizabeth Stern is presently 41 years-of-age. She was born and grew up in East Lansing, Michigan, where her father was a professor of bio-chemistry at Michigan State University. Her father died in 1986. Her mother, who is in ill health, and her brother, who is unmarried, continue to live in East Lansing. After receiving her Ph.D., Mrs. Stern decided to go to medical school in order to work in a more people-oriented profession. She testified to being tired of \"talking to test tubes.\" Her pediatric residency was completed in 1978. Mrs. Stern comes from a family background where religion and education have\n\nplayed important roles. As noted, her father was on the faculty at Michigan State University and was for a time, a lay reader at the family church.\n\nThe Sterns had discussed having children prior to and after their marriage but mutually concluded that until Mrs. Stern's pediatric residency was completed, her time to devote to family would be inadequate and thus unfair to the child. It was also concluded that post-residency earnings would make the family more economically secure.\n\nIn 1972 and 1978, Mrs. Stern had experienced several episodes of numbness in her fingers and toes and some leg weakness. In December 1979, while she was in her residency, a sharp turn in the progression of Mrs. Stern's malady occurred when she suffered what was ultimately diagnosed as optic neuritis. This is a symptom of multiple sclerosis. Being medically trained and aware of her symptoms, she concluded that she had multiple sclerosis. She sought confirmation from her ophthalmologist who would not confirm her self-diagnosis but rather referred her to a neuro-ophthalmologist, who, after clinical examination, concluded and advised Mrs. Stern that, indeed, she probably had multiple sclerosis. She was dissuaded from further treatment by this doctor who advised there is no known treatment for the disease. After receiving this devastating diagnosis, Mrs. Stern sought professional and peer counseling on the question of whether to continue her medical training. She concluded that she would continue. The Sterns made themselves aware of the current literature on multiple sclerosis and learned that according to the then available information, the disease would be exacerbated during pregnancy. Knowing of her disease and the possibility of exacerbation which could be in several forms such as loss of hearing or vision, bladder control and paralysis, and also learning that a colleague's wife who had multiple sclerosis became paralyzed as a result of the disease and pregnancy, the Sterns concluded that she would not risk debilitating illness by becoming pregnant.\n\nThe four experts called by the parties, both hypothetical and clinical, all concluded that Mrs. Stern has multiple sclerosis -- albeit, in a mild form and the possibility of progression is limited to unknown. All experts agreed that current knowledge of the disease instructs that possibility of exacerbation during pregnancy is remote but in the late 1970's, the opposite was the prevailing view. However, in the post-partum period, the doctors now say the risk of exacerbation is from 5% to 40%. Exacerbation was defined as a chance of the disease symptoms worsening, that is, development of a new set of clinical symptoms. Dr. James Donaldson of the University of Connecticut Medical School testified that the type of exacerbation and whether the new symptoms would be temporary or permanent could not be determined. As well, the older a person gets, the higher the risk of a disability.\n\nWith regard to Mrs. Stern's disease, all the experts called on this issue, concluded that her decision not to become pregnant in light of her knowledge of her disease, her experienced symptomology, the accepted medical understanding of the medical profession at the time that risk of exacerbation was attendant to pregnancy was a medically reasonable and understandable decision. Once again, there is no apparent preventative -- only treatment after onset. While she testified to being willing to accept all risks of pregnancy for a 36-year old woman, she was not willing to accept the added risks to her health that potential exacerbation of the multiple sclerosis would bring. For Mrs. Stern, onset of the disease would be too late. And while it appears that her disease is presently of the non-progressive type, there is no predictability of the course the disease will take. In Mrs. Stern's mind, there was fixed an understanding that she could not carry a child without great risk to her physical well-being. This understanding is well supported by the credible evidence in this case.\n\nThe Sterns explored the possibility of adoption but were discouraged in their inquiries. They learned that because they were of different religions and they were an \"older couple,\"\n\nadoption of a newborn infant would be extremely difficult. Indeed, the multi-year wait would have them in their very late 30's to early 40's if a child were to become available. Moreover, following the death of William Stern's mother in 1983, the desirability of having his own biological offspring became compelling to William Stern, thus making adoption a less desirable alternative.\n\nThis court finds that the Sterns have a close network of friends and neighbors who function as an extended family and provide the Sterns with love and support which is returned in kind by the Sterns. Their friends live in reasonable proximity to plaintiffs, share family joys and sorrows and celebrate family milestones and holidays together.\n\nIn 1984, Mr. Stern read an ad from the Infertility Center of New York (hereinafter ICNY) and with the consent of Mrs. Stern, they decided to pursue surrogate parenting. ICNY is an agency that provides surrogate mother candidates to applicants seeking a child through an alternative means of reproduction.\n\nMary Beth Whitehead is presently 29 years old and is the sixth of eight children born to Joseph and Catherine Messer. Mrs. Whitehead decided to leave high school in mid-tenth grade at the age of 15 1/2 against the advice of her parents. While in school, she held a part-time job primarily as a hand in a pizza-deli shop. She began working at her brother's delicatessen where she met Richard Whitehead. The Whiteheads were married on December 3, 1973. Mrs. Whitehead was 16 years old. Mr. Whitehead was 24 years old.\n\nRichard Whitehead is 37 years old. He is employed as a driver for a waste carting company. He is one of four children born to Edward and June Whitehead. His parents separated about eight years ago. His father, a retired police officer, lives in Florida. His mother continues to live in New Jersey. Shortly after high school graduation, Mr. Whitehead was drafted into the United States Army, served 13 months in Viet Nam and was honorably discharged as a specialist 4th class in 1971. As\n\na result of a non-alcohol related accident, Mr. Whitehead lost the sight in his left eye.\n\nTheir first child, Ryan, was born on July 7, 1974. The Whiteheads had their second child, whom they named Tuesday, on January 27, 1976. Within several months after their daughter's birth, Richard and Mary Beth Whitehead decided that they did not want to have any more children, that they were \"content\" with the two children and thought they had the \"perfect family.\" There was mutual agreement that Mr. Whitehead should have a vasectomy to prevent further impregnation of Mrs. Whitehead. The Whiteheads had created their family and wanted no further children.\n\nFrom the date of the marriage in 1973, until moving in 1981 to the home in which they now live in Brick Township, the Whiteheads resided in many places. Indeed, from the date of their marriage through 1981 the Whiteheads moved at least 12 times, frequently living in the homes of other family members.\n\nIn or about 1978, the Whiteheads separated during which time Mrs. Whitehead received public assistance. The Monmouth County Welfare Board sued Mr. Whitehead to recover payments made to Mrs. Whitehead. An order for payment was entered against Mr. Whitehead. Eventually, after a warrant was issued for his arrest for non-payment, Mr. Whitehead repaid the monies owed to the Monmouth County Welfare Board.\n\nThe Whiteheads filed bankruptcy in or about 1983. The bankruptcy petition, made under oath, failed to disclose an interest the Whiteheads had in real estate and to list ownership of an automobile. To this day, Mrs. Whitehead drives a 1985 Honda registered in her maiden name in the State of Florida. It must be noted that this court document, made under oath and filed in the United States District Court, was, on cross-examination of Mrs. Whitehead, admitted not to be totally truthful and accurate, at least as to those two entries.\n\nThere are two mortgages on the Whiteheads' residence. The first mortgage is held by a financial institution. The second is a privately held second purchase money mortgage held by Mrs. Whitehead's sister and brother-in-law. When this suit started, both mortgages were in default and indeed foreclosure actions had begun on both of them. Mrs. Whitehead testified to obtaining a loan to bring the first mortgage current and out of foreclosure. The second mortgage continues in default and suit.\n\nMr. Whitehead has had various employments during the course of the marriage. Until obtaining his present employment in 1981, Mr. Whitehead has had seven different jobs in the last 13 years. There has also been at least one period of unemployment during which time Mr. Whitehead collected unemployment compensation.\n\nThroughout the marriage and continuing to the present time, Mr. Whitehead has been an alcohol abuser. On two occasions, his driver's license has been suspended for alcohol-related accidents resulting in convictions for violating the motor vehicle laws of New Jersey. On two other occasions, his driving privileges were revoked for failing to comply with an alcoholic rehabilitation program. The revocation of Mr. Whitehead's driving privileges has affected his employment status. Uncontradicted is the fact that Mr. Whitehead has not actively pursued assistance to control his alcohol abuse for some time. Also uncontroverted is the fact that he admitted to a mental health expert that he had gone on two week binges at approximately six-month intervals. His last attendance at a meeting of AA appears to have been in 1980.\n\nEqually of concern to this court is the finding that Mrs. Whitehead has characterized Mr. Whitehead's alcohol abuse as being \"his problem.\" If she has concern that it may affect the family unit and its security, it was not apparent throughout her testimony. She minimized the effect by saying Mr. Whitehead is not a violent or abusive drunk.\n\nDespite recommendations by the professionals who comprise her son's school district child study team, Mrs. Whitehead requested that their recommendations be disregarded and that her wishes be adopted. Dr. Metnick, the school psychologist, testified that in seven years only ten parents, out of hundreds of students tested, have rejected the child study team recommendations.\n\n\"Baby M\" was born on March 27, 1986. On September 15, 1986 she was examined medically by a pediatrician, Dr. Donald I. Schiffman, and found to be in good health despite allegations by Mrs. Whitehead to the contrary. Dr. Donald Brodzinsky, Dr. Marshall Schechter and Dr. Harold Koplewicz evaluated the infant in December 1986, and January 1987. She has been found to be in the 97th percentile of development for height and weight; her gross and fine motor development are age appropriate and she is, in fact, advanced in several areas. She is a mellow, alert, easy-to-care-for child who is blessed with a \"sunniness of disposition that is a delight to see.\" \"Baby M\" is a curious and social baby and adjusts to strangers and her social situations easily.\n\nMr. and Mrs. Whitehead have a son, age 12 and a daughter, age 11. Whether it is through the parents or counsel for the parents, from the early days of this litigation, there have been efforts to infuse these children into the dispute. Indeed, a motion was made for the court to grant leave to have the children intervene as parties and have one other than their father be appointed guardian ad litem. This application was denied. Mrs. Whitehead has on at least two occasions brought her daughter to the courthouse where she was caught up in a media crush -- the child's anguish and fear forever captured in a graphic photo published in many newspapers. She sought to have her daughter testify about her feelings about the baby. This court finds that the issues raised by Mr. and Mrs. Whitehead -- that is, the effect on the Whiteheads' children of the removal of \"Baby M\" and her possible placement with Mr. and\n\nMrs. Stern are non-issues. They relate neither to the issue of contract nor to the issue of \"Baby M's\" best interest. It is for this reason that there will be no fact finding about the two older Whitehead children. The treatment, attention and reaction of the Whiteheads to the care, education and welfare of their children will be of concern to this court and will be developed infra.\n\nIn or about August or September 1984, Mr. and Mrs. Stern made inquiries into several surrogate parenting programs throughout the United States. Initially, they had hoped to find a woman who would function as a gestational surrogate only; that is, a woman who would be implanted with an egg of Mrs. Stern fertilized by the sperm of Mr. Stern. At that time, however, in vitro fertilization was largely experimental and not a generally available option.\n\nMr. and Mrs. Stern contacted the Infertility Center of New York and were sent a brochure. The brochure explained in general terms the surrogate parenting procedure and the services which ICNY offered, including the screening of potential surrogate candidates. On December 3, 1984 Mr. Stern entered into an agreement with ICNY.\n\nOver the next several months Mr. and Mrs. Stern were provided with various biographical data concerning potential surrogate candidates. Mr. and Mrs. Stern reviewed the material and attempted to set up interviews with several candidates. They were eventually told of a potential surrogate enrolled in the program who had been unsuccessful working with another couple for approximately eight months. The woman was described as being very dedicated and anxious to work with another couple. The candidate was Mary Beth Whitehead.\n\nMrs. Whitehead was enrolled in the ICNY surrogate program since the spring 1984. Mrs. Whitehead testified she was motivated to join the program in the hopes of \"giving the most loving gift of happiness to an unfortunate couple.\" Mrs. Whitehead also felt that the surrogate's fee would assist her in\n\nproviding for her children's long range educational goals. Her signed application also reveals these reasons.\n\nMrs. Whitehead had learned of surrogate parenting through an advertisement in The Asbury Park Press. Mrs. Whitehead spoke of her interest in the surrogacy program to no one other than Mr. Whitehead over the next week. Although Mr. Whitehead was initially opposed to Mrs. Whitehead's involvement in the surrogate program, he ultimately deferred to his wife's wishes. Mrs. Whitehead contacted ICNY and was provided with an application form which she filled out and submitted to the center.\n\nIn or about April 1984 Mrs. Whitehead submitted to a psychological evaluation to determine her suitability as a potential surrogate. She was evaluated by interview and testing. The examiner reported that although Mrs. Whitehead expected to have strong feelings about giving up the baby at birth, she was sincere in her plan to become a surrogate mother and has thought extensively about the plan. Although the examiner noted that it would be important to explore with Mrs. Whitehead in more depth whether she would be able to relinquish the child in final analysis, Mrs. Whitehead was recommended as an appropriate candidate for a surrogate volunteer. This report was made for ICNY prior to Mrs. Whitehead working for her first childless couple. It was this fact of prior evaluation that the Sterns relied on. Mrs. Whitehead testified to receiving two counseling sessions at ICNY.\n\nIn or about May 1984 ICNY matched Mrs. Whitehead with a married couple (not Mr. and Mrs. Stern) who sought to engage Mrs. Whitehead as a surrogate. The prospective surrogate was presented with a proposed form of surrogate parenting agreement. The proposed agreement was almost identical to the agreement Mrs. Whitehead would later sign with Mr. Stern. As required by the center, she consulted independent counsel on May 24, 1984, who after spending several hours discussing the possible legal ramifications of the agreement with both Mr.\n\nand Mrs. Whitehead, negotiated at Mrs. Whitehead's request several minor changes in the contract. The contract was signed by the Whiteheads and shortly thereafter, she began her efforts to conceive by artificial insemination. Her effort for this couple was unsuccessful. She was then introduced to Mr. and Mrs. Stern.\n\nMr. and Mrs. Stern met with Mr. and Mrs. Whitehead in January 1985 in New Brunswick, New Jersey. The site was chosen because it is approximately mid-way between the respective residences. The parties discussed the proposed surrogacy arrangement and other elements of their contemplated relationship, including Mrs. Whitehead's duty to relinquish custody of the child to Mr. and Mrs. Stern. Mrs. Whitehead made it clear she would not appear on the Sterns' doorstep. All she wanted was an annual picture and letter report of progress. At the conclusion of the meeting, it was agreed that Mrs. Whitehead would be the surrogate mother of a child to be born for Mr. and Mrs. Stern.\n\nOn February 6, 1986 Mr. Stern and Mr. and Mrs. Whitehead signed the surrogate parenting agreement. It was in all material respects the same contract that Mrs. Whitehead signed the spring of 1984. At that time, Mr. and Mrs. Whitehead had consulted with an attorney. As already noted, he read and explained the contract to them. Several minor changes were negotiated. Mrs. Whitehead believed the second contract to be as the first and thus, although able to do so, chose not to seek legal advice prior to signing the subject agreement. It is noted with more than passing importance that Mrs. Stern was not a signatory to the agreement. Mrs. Whitehead testified that her obligation was to attempt conception by artificial insemination, upon conception to carry the child to term, deliver and surrender the child to Mr. Stern renouncing at that time all of her parental rights and acknowledging that doing so would be in the child's best interest. It was also agreed that Mr. Stern's name would appear on the child's birth certificate.\n\nIn addition, the contract provided the following: Mrs. Whitehead would assume the risks of the pregnancy and child birth. She would submit to a psychiatric evaluation for which Mr. Stern would pay. Mr. Stern had the right to name the child. That in the event of the death of Mr. Stern, the child would be placed in the custody of Mr. Stern's wife. Mrs. Whitehead would not abort the child. In addition, she would undergo amniocentesis; and if the child were found to have a genetic or congenital abnormality, it would be aborted if Mr. Stern requested it.\n\nThat in the event the child possessed genetic or congenital abnormalities William Stern would assume legal responsibility for the child once it was born. The agreement also contained a severability clause.\n\nThe Whiteheads and the Sterns clearly understood the terms of the agreement and their obligations.\n\nMr. Whitehead acknowledged pursuant to N.J.S.A. 9:17-44 that he refused to consent to the artificial insemination of his wife, and thus, pursuant to statute, he is not to be considered the father of the child born to his wife. Reference is made to the results of the HLA blood test (supra) which further confirms the issue of paternity.\n\nMrs. Whitehead was to be paid $10,000 and all medical expenses including dental expenses for performing her contractual obligations.\n\nUnder the present medical definition, Mrs. Whitehead had informed consent as to the procedure, if indeed, such consent was required. She was competent at the time of entering into the contract and was aware of its terms.\n\nSubsequent to entering into the surrogate parenting agreement of February 6, 1985, Mrs. Whitehead was inseminated with the semenal fluid of Mr. Stern nine times. Finally, in July 1985 she conceived.\n\nMr. and Mrs. Stern were overjoyed with Mrs. Whitehead's pregnancy. They met with Mr. and Mrs. Whitehead and took them to dinner to celebrate.\n\nShortly after the pregnancy, in or about August 1985, Mr. Stern and Mrs. Stern, in anticipation of the birth of the child, executed new last wills and testaments naming the yet unborn child as a contingent beneficiary of their respective estates.\n\nOver the next several months of Mrs. Whitehead's pregnancy, Mr. and Mrs. Stern papered and painted a room in their home that was to be the nursery.\n\nThroughout the pregnancy Mr. and Mrs. Stern kept in close contact with Mrs. Whitehead telephonically and even visited on several occasions.\n\nWhile the relationship between Mrs. Whitehead and Mr. Stern grew distant, her relationship with Mrs. Stern grew closer. The relationship subsequently deteriorated as Mrs. Stern insisted that Mrs. Whitehead undergo amniocentesis, take a prescription pharmaceutical in order to control the effects of the difference in blood type between Mr. Stern and Mrs. Whitehead and take certain precautions when Mrs. Whitehead reported an elevation in blood pressure in the last months of pregnancy.\n\nApproximately one month prior to the birth of the child, in February 1986, Mr. and Mrs. Stern learned that Mrs. Whitehead had delayed signing the papers acknowledging Mr. Stern's paternity of the child. Mrs. Whitehead, nevertheless, indicated that she had no intention of repudiating her contract with Mr. Stern. Eventually, Mr. and Mrs. Whitehead signed the acknowledgment of paternity.\n\n\"Baby M\" was born on March 27, 1986 at Monmouth Medical Center, Long Branch, New Jersey. Mr. and Mrs. Whitehead never told anyone at the hospital that Mrs. Whitehead was a surrogate mother. They prevailed on Mr. and Mrs. Stern not to reveal their relationship to the child. On March 27, 1986 Mr. and Mrs. Stern went to the hospital to see the infant and Mr. and Mrs. Whitehead. Because he was not identified as the\n\nchild's father, Mr. Stern could not hold his newborn daughter. He could only view the infant through the nursery window. Mr. Whitehead's name appeared on the birth certificate as the child's father as did the name Sara Elizabeth Whitehead. This information was given to the hospital by either or both of the Whiteheads. Their unilateral action without consulting Mr. Stern was a violation of their understanding with Mr. and Mrs. Stern.\n\nMrs. Whitehead testified that throughout her pregnancy, she recognized the child being carried was not to be hers but was Mr. Stern's. This view was maintained throughout the pregnancy. Perhaps the delay in signing the adoption consents should have been a clue to a growing ambivalence on the part of Mrs. Whitehead. She testified that at the moment of birth she realized that she could not and would not give up the child. Until then, she understood what she promised to do, understood what she had to do, but when the time came to perform Mrs. Whitehead refused to perform her promise to give Mr. Stern his daughter.\n\nWhen Mr. and Mrs. Stern visited Mrs. Whitehead and the baby in the hospital on March 28, 1986, Mrs. Whitehead informed them that she was not sure whether she could relinquish the child. Mr. and Mrs. Stern also testified that Mrs. Whitehead expressed sentiments to them to the effect that if she could not keep the child she could not go on living. Because of a failure to execute certain documents needed to adopt the child in Florida, Mr. and Mrs. Whitehead took the baby home to their house in Bricktown, New Jersey, on Sunday, March 30, 1986. Mr. and Mrs. Stern came to take the child in what has been described as an extremely emotional scene in which Mr. and Mrs. Stern expressed gratitude to Mr. and Mrs. Whitehead for what they had done for them and Mrs. Whitehead expressed her difficulties in relinquishing the child to Mr. and Mrs. Stern. There were indications that Mrs. Whitehead was extremely depressed and they questioned her ability to continue living without the child.\n\nMrs. Whitehead tells of passing a very restless emotional and depressed night. Mr. Whitehead, who said he never experienced such a night, finally told his wife to go to Tenafly and \"get our baby.\"\n\nOn March 31, 1986, Mrs. Whitehead telephoned Mr. and Mrs. Stern and requested permission to visit the child. Mr. and Mrs. Stern agreed. At approximately 11:00 a.m. Mrs. Whitehead arrived at the Sterns' home with her sister, Joanne Cahill, a social worker. Mrs. Whitehead alternated between crying and speaking with a flat affectation. She told Mr. and Mrs. Stern that she did not want to live and that she had considered taking the entire bottle of valium pills the night before. Mrs. Whitehead said she wanted to take \"Baby M\" home with her for a one-week visit. Residence for the one week was offered by the Sterns but was rejected. Out of concern for Mrs. Whitehead's mental health, Mr. and Mrs. Stern acquiesced.\n\nAfter listening to and observing Mr. Stern who testified about this wrenching moment, this court had no doubt that he fully expected to have his daughter returned to him after the week. His immense concern for Mrs. Whitehead and an almost naive belief in her good will was soon to be destroyed.\n\nOn April 1, 1986 Mrs. Whitehead telephoned Mr. and Mrs. Stern and indicated that she was going to be visiting with an aunt. She indicated that she would be unreachable. In fact, Mrs. Whitehead left the State of New Jersey on April 3, 1986 with the five-day old child and traveled to Florida to visit her parents.\n\nThe ostensible purpose of the visit was to show the infant to her parents and her son who was living with them. Mr. and Mrs. Stern did not know the five-day old was taken out of the State. They called the Whitehead house and Mr. Whitehead put off their inquiries and asked for their patience.\n\nOn April 4, 1986 Mrs. Whitehead telephoned Mrs. Stern. She indicated that she needed time to think about whether she\n\nwanted to keep the child. She told Mr. and Mrs. Stern that Mr. Whitehead had threatened to leave her if she kept the baby.\n\nMrs. Whitehead remained in Florida, unbeknownst to Mr. and Mrs. Stern, until April 8 or 9, 1986. During this period of time Mrs. Whitehead never indicated to her parents that she was considering keeping the child. Mrs. Whitehead returned to the State of New Jersey on or about April 9, 1986.\n\nOn April 9, 1986 Mrs. Stern telephoned the home of Mrs. Whitehead who advised Mrs. Stern that she would surrender custody of the child on Saturday, April 12, 1986. On April 11, 1986, however, Mrs. Whitehead telephoned the Sterns' household and advised Mr. Stern that she needed more time to consider her decision.\n\nOn April 12, 1986, Mr. and Mrs. Stern telephoned Mrs. Whitehead at approximately 6:00 a.m. They requested that they be permitted to visit the baby and Mrs. Whitehead agreed. Later that morning, Mr. and Mrs. Stern did, in fact, visit with the child.\n\nDuring the visit of April 12, 1986 Mrs. Whitehead announced that she had decided to keep the child. Mrs. Whitehead indicated that if threatened with court intervention she would leave the country. Before leaving, Mrs. Stern requested that Mrs. Whitehead permit Mr. Stern to hold the baby one more time. Mrs. Whitehead refused and threatened to telephone the police. Mr. and Mrs. Stern left the Whitehead home without Mr. Stern's daughter.\n\nOn or about April 20, 1986 Mr. and Mrs. Whitehead listed their home for sale, indicating in the listing that they might be relocating to Florida.\n\nOn May 5, 1986, this court signed an order to show cause directing Mrs. Whitehead to deliver the infant to Mr. Stern. (See Procedural History, supra, for details).\n\nOn that same day Mr. and Mrs. Stern accompanied the Bricktown police to the Whitehead residence. They brought\n\nwith them the court order giving temporary custody of the child to Mr. and Mrs. Stern. The contents of this order were made known to Mr. and Mrs. Whitehead. Mr. Whitehead admitted his knowledge of the order. Mrs. Whitehead spoke to an attorney during the time when the police were attempting to enforce this court's order. Although Mr. and Mrs. Whitehead understood that they were being ordered by a court to return the child to Mr. and Mrs. Stern, during ensuing confusion Mrs. Whitehead took the child into a bedroom at the rear of the house and passed the child out the window to her waiting husband. That evening Mr. Whitehead took the child, first to his mother's house, and then to his sister's house in Neptune, New Jersey. After the police left, Mrs. Whitehead packed the belongings of the family, and was driven to the home of Mr. Whitehead's sister where the family remained overnight. The following morning, the Whitehead family: Mary Beth Whitehead, Richard Whitehead, their ten-year old daughter and the baby disappeared. Their whereabouts remained unknown to Mr. and Mrs. Stern for 87 days.\n\nOn May 6, 1986 Mr. and Mrs. Whitehead, their daughter and the infant child flew to the State of Florida where they were met by Mrs. Whitehead's parents (Catherine and Joseph Messer). Mr. and Mrs. Whitehead remained with the Messers until on or about May 20, 1986, at which time Mr. and Mrs. Whitehead and the infant child left the Messer household. Mr. and Mrs. Whitehead left the Messer household because they were afraid the local authorities would attempt to enforce the court order.\n\nMr. and Mrs. Stern hired a private detective in an effort to locate Mr. and Mrs. Whitehead and \"Baby M.\" During their almost three months in Florida, Mr. and Mrs. Whitehead lived with Mr. and Mrs. Messer for approximately two to three weeks. They left their son and daughter in the care of the Messers and began a fugitive existence, staying in no less than 15 hotels, motels, and as well as with an assortment of relatives and friends. No pediatric care for the child was sought nor\n\nwas she immunized against any of the childhood diseases during this period.\n\nOn May 20, 1986 Mr. Messer enrolled the Whiteheads' daughter in the Holiday, Florida, school system for the final two weeks of the school year. It was not yet decided whether the child would be attending school in Florida in September 1986, as such attendance was dependent upon whether Mr. and Mrs. Whitehead would be residing in the State of Florida or the State of New Jersey.\n\nOn or about July 15, 1986 Mr. Stern received a telephone call at his place of employment from Mrs. Whitehead. In addition to making demands for relief on Mr. Stern, Mrs. Whitehead threatened to kill herself and to take the life of the child, stating, \"I'd rather see me and her (the infant child) dead before you get her,\" and \"I gave her life. I can take her life away,\" in addition to numerous other threats to the child's well-being. Another telephone call was received by Mr. Stern from Mrs. Whitehead on the following day, July 16, 1986. At that time, Mrs. Whitehead threatened to accuse Mr. Stern of sexually molesting her 10-year old daughter. No evidence of any abuse was offered by Mr. and Mrs. Whitehead and Mrs. Whitehead admitted her threat and accusations were false and without the slightest measure of foundation.\n\nMrs. Whitehead was hospitalized on or about July 28, 1986 in Stuart, Florida. On or about that date, Mr. Whitehead returned to the Messer home in Holiday, Florida, with the infant child.\n\nOn July 31, 1986 the child was taken into the care of Florida authorities and out of the Messer household by local law enforcement officials pursuant to a court order obtained in Florida under the Uniform Child Custody Jurisdiction Act. Physical custody of the child was subsequently transferred to Mr. and Mrs. Stern.\n\nOn July 31, 1986, following the removal of the child from the Messer household, Mrs. Messer, after consulting with Mr. Whitehead, contacted the St. Petersburg (Florida) Times regarding\n\nthe events which had transpired to date. She did not attempt to contact an attorney.\n\nOn August 1, 1986, while still hospitalized, Mrs. Whitehead signed various authorizations to permit media personnel, including television reporters and cameras to interview her in her hospital room.\n\nAll of the parties ultimately returned to New Jersey and Mr. and Mrs. Whitehead began to defend against the complaint of Mr. and Mrs. Stern. At their home, they set up an infant's crib in their daughter's room. Baseless allegations of poor care by the Sterns were made by Mrs. Whitehead after several visitation periods. It was these unfounded allegations that led to the medical exam by Dr. Schiffman and his finding the child was in good health. The Whitehead family was referred to a family counselor by the National Adoption Service. They attended 1 1/2 hours of counseling, and made another appointment for further counseling but never kept it. In fact, three appointments were made, none of which were kept by the Whitehead family.\n\nMr. and Mrs. Whitehead were married, as noted above, on December 3, 1973. According to Mrs. Whitehead, she was the \"sitter\" and older sister for some of her brothers and sisters, helping to care for them when her parents were working. Her attention to these children was corroborated by Ms. Camile Tomaini, owner of the pizza-sub shop where Mrs. Whitehead worked after school. Since the Whitehead house was around the corner, Ms. Tomaini, who visited there often, saw how well Mrs. Whitehead cared for her younger siblings.\n\nMrs. Barbara Anderson tells of Mrs. Whitehead's good capabilities as a caring mother. The Whitehead children were always turned out with great care and attention. The children are well behaved. It was this witness who, as a realtor, took the sale listing of the Whitehead house when Mrs. Whitehead indicated in April that the family may move south.\n\nSherri Messer tells of a close loving relationship that the Whiteheads have with each other. She knew Mrs. Whitehead\n\nwanted a child for a childless couple. She was found to have no knowledge of any lawsuits by any of Mrs. Whitehead's brothers or sisters against Mrs. Whitehead and is found to be unconvincing about her talks with Mrs. Whitehead about the custody question, visitation and what to tell the child about her origins. There was a pointed absence of certainty in her testimony on these subjects.\n\nAnother witness called by the Whiteheads was Susan Hergenhan. The testimony of this woman is totally discounted because of her admission, while testifying, that she wrote a letter to this court and signed Mrs. Whitehead's name which led the court to believe it was a letter from Mrs. Whitehead. The letter contains specific information about the contents of the May 5, 1986 certification of Mr. Stern. Her testimony closed with the remark that she would do anything to help a friend, even lie under oath in a court of law. She admitted her deception and a transcript of her apparently perjurious testimony was referred to the Bergen County Prosecutor.\n\nThe mother of Sharon Simmons and Mrs. Messer are best friends. Ms. Simmons and Mrs. Whitehead grew up together. She holds a B.A. degree and a teachers certificate. Her only classroom experience is with adults seeking general equivalency diplomas. The results of the Brick child study team were told to Ms. Simmons by Mrs. Whitehead. They discussed the report in terms of self-image, emotional impact and education. The witness admits to no expertise in this area. She has been out of teaching for the last three years. She never read any reports or spoke with any school professionals about the Whiteheads' son. The witness acknowledges being supportive of social promotion not promotion because of achievement. It is this witness, with her lack of expertise, who told Mrs. Whitehead to get a second opinion about the child study evaluations and if the school would not give the boy another teacher then take him out of school. Mrs. Whitehead followed this advice.\n\nThe Whiteheads' present house is described as having a living room, kitchen and back porch with three bedrooms and bath. There is a crib set up in the daughter's room for \"baby M.\" Mrs. Whitehead does not see this as being harmful to her daughter either by way of heightened anticipation, constant reminder or trauma of loss if the child is not placed with Mr. and Mrs. Whitehead.\n\nMrs. Whitehead has infused her children into this case by taking them to ICNY, bringing her daughter to court on two occasions, permitting her 11-year old daughter to sign a certification filed with this court and permitting her to be on television and to be a subject in a photo layout in several popular magazines. Mrs. Whitehead says her attorney suggested those acts. As of the date of her testimony, she was unable to say how she would protect \"Baby M\" from publicity.\n\nMrs. Whitehead maintains she should receive custody because she is the mother.\n\nMrs. Whitehead said that if she was given custody the infant would be taught kindness and understanding. She would be supportive of the child's educational wishes. The court questions the measure of this mother's emphasis about the importance of education in light of her actions and attitude with her son's school and her own limited high school experience.\n\nMr. and Mrs. Stern testified that they moved to their present home because it is easy to commute to New York and thinking ahead to having a family, Mr. Stern said that the town has a good school system. The Stern home is located near parks, the library, and is a short walk to the shopping area. The Sterns are economically able to provide for \"Baby M.\" Mrs. Stern will be working part time as a pediatrician on the staff at Albert Einstein Medical School. Her earnings will supplement the family economy. She will not work full time because she is aware of the infant's needs that will require her presence. The Sterns espouse different religions but plan to participate in a Unitarian or a non-denominational religion with the child. They\n\nplan to enroll \"Baby M\" in a nursery school at about age three not for learning purposes, but for socialization. As she grows up, opportunity for music lessons and athletics will be made available. With the strong emphasis on education already exhibited by the Sterns, it is understood and expected that \"Baby M\" would attend college.\n\nThe Sterns have a close, loving and very supportive relationship with each other. This is evident to the court from observations over the six-week period of the trial, listening to their testimony and the testimony of their circle of friends and neighbors.\n\nThe Sterns want the child to grow up as a private person -- secure in a loving home. Both agree professional counseling is required and will be obtained as the child matures so as to meet her special needs.\n\nA total of 38 witnesses testified at this trial, 23 fact witnesses and 15 experts. Four of the experts dealt with Mrs. Stern's multiple sclerosis and 11 dealt with the issue of best interests of the child. The Sterns presented two such experts: Drs. L Salk and A. Levine. The guardian ad litem presented three such experts: Drs. M. Schecter, D. Brodzinsky and J. Greif. The Whiteheads presented six such experts, to wit: Drs. H. Koplewicz, P. Silverman, S. Nickman, B. Sokoloff, J. Vetter and B. Klein.\n\nIn one of only three factual stipulations by counsel in this proceeding, all agreed on the qualifications of the mental health experts called as witnesses.\n\nThe court is constrained to give minimal weight to the testimony of Dr. Phyllis Silverman, a professor of social work at Massachusetts General Hospital Institute of Health Professionals. She began with a stated bias against men and questioned whether male and even female mental health professionals can properly evaluate women. She was offered as an expert in the psychology of women, particularly to bereavement created by death of a spouse or surrender of a child through adoption.\n\nShe reported on only two birth-mother studies, one with a sample of 50 and another study using a mail questionnaire. No evidence was offered as to the statistical quality and validity of the sample used in the studies. Her curriculum vitae lists three pages of publications not one item of which dealt with birth mothers. For the record, Dr. Silverman stated that Mrs. Whitehead realized she had made a mistake in agreeing to surrender the child. Dr. Silverman further stated that Mrs. Whitehead's attachment to the child was appropriate and her perceived role in life was as a mother and wife. If the child were removed, the sense of who she was would be compromised and Mrs. Whitehead would have a difficult time in reconstructing her place in the world.\n\nThe court must say this is hardly the basis for a grant of custody. Her testimony centered on the adult while the only concern of the court is the child.\n\nDr. J. Vetter, a private psychiatrist, was called to testify on informed consent. His only experience is with adoptive mothers -- not surrogate mothers. He interviewed Mrs. Whitehead for one hour. He testified to Mrs. Whitehead being competent to sign the consent and acknowledged his interview with her led him to conclude that she understood its terms. He defined informed consent as a simple awareness of the risks and benefits to a purported treatment and said that Mrs. Whitehead could not have given informed consent.\n\nThis court holds that informed consent is another of the non-issues presented to the court. Informed consent is a concept used in the trial of medical malpractice cases. It is a negligence law concept. The patient has a right to decide on a course of treatment with as much information as possible. Counsel for the Whiteheads says that until Mrs. Whitehead felt the emotion of birth and sensed the child, she could not give informed consent at the time she signed the contract. Would he have all contracts remain in limbo until the result of the intended agreement is available and the makers could then\n\nconclude whether the result is what was intended and the contract then made enforceable? How would one handle the marriage contract, the property settlement agreement or any other contract of common experience?\n\nFurthermore, informed consent is bottomed on the unequal information between doctor and patient. It is rectified by sharing information. The parties hereto are in no such relationship.\n\nInformed consent is a negligence concept predicated on the duty of a physician to disclose to a patient information that will enable the patient to evaluate, knowledgeably, options available and risks attendant upon each before subjecting the patient to treatment. Perna v. Pirozzi, 92 N.J. 446 (1983). Skripek v. Bergamo, 200 N.J. Super. 620 (App.Div.1985).\n\nSuch a concept does not have a place in the present case and it is rejected.\n\nDr. Harold Koplewicz, Director of Child Psychiatry at Long Island Jewish Hospital, was presented by the Whiteheads as a child psychiatrist. He and Mrs. Stern both interned at the same medical school during the same academic year. Apparently, there was a confrontation between them in that year and counsel for the Sterns sought to show bias of the witness against Mrs. Stern. This court finds no evidence of bias. It also finds that the expert has no knowledge of the fundamental criteria that must be first established before a court in New Jersey may order joint custody. Notwithstanding, he finds each party to be a capable parent and unequivocally recommends joint custody saying that the parties should be able to deal with each other after six months or so of court mandated family therapy.\n\nThese people are not former spouses. They are strangers to each other. Their hurt and enmity is sincere and deep. Their former cordial relationship arose within a contract and fell when the contract was breached.\n\nThe hurt to each of these parties as perceived by each of them at the hands of the other is genuine. Therapy is minimally successful when spouses have many years of common experience. That therapy could be successful for these parties is doubted. A prerequisite for the success of therapy is a desire for help. A court order will not create such a desire.\n\nBeck v. Beck, 86 N.J. 480 (1981) holds that for there to be a viable joint custody order, the following criteria must be found to exist: 1) court determination of whether the children have established such a relationship with both parents that they would benefit from joint custody; 2) are the parents fully capable of physically and psychologically fulfilling the role of a joint custodial parent; 3) each parent must be willing to accept custody; 4) each parent must exhibit a potential for cooperation in matters of child rearing. This does not require an amiable relationship, but it does require the parents be able to isolate their personal conflicts from their parental roles.\n\nThis court finds that the criteria of Beck, supra, do not exist and cannot be created with these litigants. Initially, the concept has only been applied as an alternative remedy to routine custody arrangements. The application of the concept presupposes an ongoing parental relationship. This is not the case here.\n\nThe testimony of the parties indicates conflict on whether they are capable of being joint custodians of \"Baby M.\" They have different life styles, social values and standards. Mrs. Whitehead has complained, without basis, of Mrs. Stern's care in the several months that Mr. Stern has had custody.\n\nEach parent here is not willing to share custody. While Mrs. Whitehead claims to be willing, Mr. Stern is not. His belief is that shared custody will create conflict presently and in the future for the child.\n\nFinally, as has been noted above, the hurt perceived by these litigants, at the hands of the other, is too great to premise a joint custody award. The rancor is too great. This court\n\ndoubts that they can isolate their personal animosity and \"all of a sudden\" cooperate for the child's benefit.\n\nFor the record, Dr. Koplewicz defined best interest as equalling the best placement. He maintained that the best custodial placement will limit risk of psychiatric trouble for \"Baby M.\" He held that there must be continued attachment to both parents.\n\nHe found that under great stress, Mrs. Whitehead reacts impulsively and needs a lot of people to help her. He found that she acted under such stress with regard to her financial and legal problems, i.e., eloping to Florida with the child and her son's school problems. Dr. Koplewicz' recommendations are without persuasive effect on this court.\n\nDr. M. Schecter of the University of Pennsylvania Medical School, a psychiatrist, was presented by the guardian ad litem. He was the only health professional to find a diagnosable mental health disorder in Mrs. Whitehead. The other ten mental health professionals found some symptoms or some traits but nothing as definite as a disorder as found in the Diagnostic and Statistical Manual III (hereinafter DSM III). DSM III is the standard guide of the mental health field used to define mental disorders. In view of the decidedly minority view of Dr. Schecter's findings of mixed personality disorder, the court will give no weight to his diagnostic conclusion. Certainly, he is entitled to his opinion as is the court entitled to give greater or less weight to it.\n\nFor the record, he found no remarkable condition in Mr. Whitehead or Mr. and Mrs. Stern. The traits he found in Mrs. Whitehead upon which he based his conclusion were: impulsivity, manipulative behavior, a sense of self-importance, exploitiveness, lack of sympathy and justification through provocation. Dr. Schecter said that Mrs. Whitehead exhibited the following symptoms among others that led to his conclusions:\n\nimpulsivity -- removing her son from his second grade class without first discussing the removal with the school teacher or principal; eloping to Florida and defying a court order; taking the children to ICNY.\n\nself-importance -- her attitude that since she is the mother and therefore, the child belongs to her; giving no value to genetic contribution of Mr. Stern, the father; believing, or at least expressing the view that God will reward her surrogacy.\n\nexploitiveness -- use of the media for her own satisfaction;\n\nlack of empathy -- giving no apparent thought to her children in undertaking a surrogate role; no thought to effect on daughter in making allegation of sexual abuse; no concern or help to her husband in dealing with his alcohol problem.\n\nDr. Schecter saw in Mrs. Whitehead a person unable to accept responsibility for any of her actions. He concluded that Mrs. Whitehead was a fit mother but that the least detrimental alternative for \"Baby M\" was to sever her relationship with the Whiteheads and give custody to the Sterns. He gave no opinion as to access.\n\nDr. Donald Klein, a professor of psychiatry at the Columbia University College of Physicians and Surgeons, was a witness for the Whiteheads. He was on the editorial committee that wrote the section for the DSM III that is relied on by Dr. Schecter. Dr. Klein maintained that a fundamental flaw in Dr. Schecter's diagnosis was that the criteria used were not of sufficiently long duration but were symptoms of the present life crisis being experienced by Mrs. Whitehead.\n\nAfter one hour of personal interview and only reading the transcript of the July 15 and July 16 tapes -- not listening to them -- he concluded that Mrs. Whitehead was not suicidal.\n\nHe acknowledged that her domination of Mr. Whitehead was a chronic issue. In situations of great stress, she will lie. He diagnosed an adjustment reaction with depressive symptoms. He said he found no incredible statements made to him by Mrs. Whitehead. Her self-reporting history was accepted. He admitted a patient's self-report, if untrue or incomplete, would skew his results. Dr. Klein then acknowledged not knowing of Mr. Whitehead's alcohol abuse, the financial difficulties of the family or the surrogate arrangement. To confirm credibility,\n\nthis witness checked Mrs. Whitehead's story with Mr. Whitehead. Dr. Klein believed this to be sufficient. The court suggests that this was expedient but not sufficient. The better confirmation would be from independent records but the doctor never took the time to inquire. This witness administered a personality test to Mrs. Whitehead to show she was without blemish. It was established to this court's satisfaction that the test administered was in a developmental state and not accepted by the mental health profession. This court will not rely on the results thereof and will give minimal weight to Dr. Klein's conclusions.\n\nDr. B. Sokoloff, a private practitioner of pediatrics from California, was presented on the issue of separation of child from mother. This doctor relied heavily on his adoption and foster care experience. He has had no experience in surrogacy. Indeed, his experience was in extra-familial adoptions; that is, where both adopting parents are strangers to the child. The doctor here perceives the child as being sold. He has never participated in the trial of a custody dispute. He defined the psychological mother as the one who raises a child. The psychological mother and the natural father can give nurturance with a fair degree as compared with the natural mother. While he believed that the birth mother bond to child should not be broken, he acknowledged that there would be minimal harm to a child in the care of a natural parent and a nurturing step-parent. He also testified that he could not define bonding because it is such a subjective factor.\n\nThe doctor has espoused a position -- favoring the Whiteheads -- but readily neutralized himself as a result of his testimony on cross-examination when he recited to having no special training on early development. He assumed without scientific basis, for example, that a high percentage of children in the foster care system are abused. Giving no authority for this conclusion it was his view that he could render a best-interests opinion without knowing the parties, his statistics based on extra-familial adoptions, and acknowledging there is no known\n\ncorrelation to problems of the adoptee and those of a surrogate child.\n\nDr. Sokoloff defined best interest as everything that is most suitable for a child's proper growth and development with a minimum of disability.\n\nThe doctor has effectively acknowledged the limitations of his testimony and so does this court.\n\nDr. L. Salk is a clinical professor of psychology, psychiatry and pediatrics at New York Hospital-Cornell Medical Center. He was offered by the Sterns as a hypothetical expert witness on the issue of best interests of the child including factors that relate to best interests and to define key words relevant to this inquiry.\n\nHe defined parent as a fundamental parent -- one who cares for a child after its birth. He decried the use of the word \"custody\" as it leads to competition and provocation. He used, instead, the word \"responsibility,\" i.e., who is more responsible to meet the child's best interests.\n\nDr. Salk defined best interests by listing determinants for evaluating the subject. These were:\n\na) was the child wanted and planned for;\n\nb) what is the emotional stability of the people in her home environment;\n\nc) the stability, consistency and peacefulness in the lifestyle of the family;\n\nd) the capacity of the adults in the child's life to recognize and respond to her emotional and physical needs;\n\ne) the familial attitudes towards education and their motivation to encourage curiosity and learning;\n\nf) the capacity of the adults in her life to make rational judgments from day to day and particularly in times of crisis;\n\ng) the capacity of the adults in her life to instill positive attitudes about matters concerning health, nutrition and the avoidance of hazards and substance abuse;\n\nh) the capacity of the adults in her life to explain the circumstances of her conception, birth and the subsequent events with the least confusion and the most emotional support;\n\ni) the capacity of the adults in her life to help her develop the resources for coping with life's problems and the responsibility and independence to enable her to become a productive member of society.\n\nExplaining several of the criteria, Dr. Salk noted:\n\na) The Sterns really wanted the baby -- to be parents. Mrs. Whitehead's motivation was to give life to one who could not have a child.\n\nb) Relying on Dr. Schecter's report, he said that there are personality problems in Mrs. Whitehead's character. She sees herself as a victim and rejects her own role in many circumstances. She denies facts that should be known to her. He concluded that she has a selective memory or she is engaging in a deliberate attempt to conceal information or she has a deficit in the ability to adequately process conflictual information.\n\nc) Stability: The doctor compared the life histories of the parties and the reporting of all of the other mental health professionals. Citing Dr. Vetter, he found that Mrs. Whitehead denies and does not accept responsibility for her own acts.\n\nd) The child will need adults willing to subordinate their own needs to the child's needs. Citing the reports, Dr. Salk noted that Mrs. Whitehead's needs her children as self subordinates.\n\ne) Education: Clearly, the Sterns' attitude toward education is stronger than the Whiteheads. Mrs. Whitehead did not graduate from high school. She dropped out in the 10th grade. The Sterns each hold graduate degrees.\n\nf) Ability to make rational judgments day-to-day and especially in times of stress: The doctor noted that the weakness here could put the child at risk, He questioned her ability to do so based on her impulsivity.\n\ng) Role model requirements for parents: He saw a problem with Rick's alcoholism and her need for absolute control.\n\nh) Ability to inform child of origins truthfully: Is this possible where her reporting ability has been so sorely tested by the doctors presented here by all sides and the results show serious credibility problems\n\ni) To help a child cope and function: Dr. Salk maintained that Mrs. Whitehead's own emotional needs belie her ability to do this.\n\nThe doctor noted that a child's reaction to a totality of circumstances will depend on the child's trust in the people who have raised her, not the circumstances of birth or transfer of custody.\n\nHe believed continued contact once the custody is fixed would be harmful to the child.\n\nHe commented that the July 15 and July 16 tapes, if not evidence of suicidal intent, then, at a minimum, were clear evidence of a manipulative effort.\n\nDr. Salk's most weighty testimony was his recommendation for \"Baby M.\" He said she needed to have an end to the litigation, have her parentage fixed, be afforded protection from anyone who would threaten her, so she would not be manipulated or threatened. Her privacy will require a strong support system.\n\nDr. S. Nickman is an instructor in psychiatry at Harvard Medical School and is an assistant in psychiatry at Massachusetts General Hospital, Boston. He was presented as defendant's expert to testify to the risks of a surrogate child.\n\nThe doctor's direct testimony involved extra-familial adoptions of children. He spoke of the need for honesty with children as being important in their lives. Not to be honest could, inter alia, close off a child's ability to learn and strain parental relations. He analogized from the adoptive child to the surrogate child. Without criteria, because there is no research regarding surrogate children, the doctor attributed the same problems of the adoptive child to the surrogate child. He concluded that the earlier the placement of a child, the less probability of problems. He saw the child as property, or considering itself property, if the child learned of the surrogate origin. The doctor analogized surrogacy to societal life disruptions, war or social oppression.\n\nIn his cross-examination, he acknowledged that his testimony was not to define with whom the child should live, that there is no research or literature on a child's feelings of self-worth depending on the manner of conception, but that the earlier a child is placed the better it is for the child. The child's self-esteem would be enhanced with truthful statements of origin. It is important that a child be protected from continuing litigation. This witness made no recommendation for either party. Decreasing risks for the child come from early placement, the ability to have a trusting relationship and the child's ability to be free of debilitating depression. The risks that do not diminish with early placement are geneological bewilderment,\n\nlow self-esteem and continued preoccupation with \"other parent\" fantasy. The doctor espoused full disclosure by age-appropriate means between five and eight years of age. If the relator is capable of answering the child's questions in a clear and sympathetic manner, the risk of psycho-pathology will be greatly reduced.\n\nDr. A. Levine, a psychiatrist in private practice was presented on the issue of which set of parents would be best for the child. His definition of \"best interest\" was a psychological milieu and environment best conducive to healthy normal relationships.\n\nHe concluded his analysis of the parties as follows:\n\nMrs. Whitehead -- Since she maintains to know her son's problems better than the professional staff in his school and because she says she knows the meaning of the child's cries, he says she is omniscient. She believes she is being used by God to show people the wrong of surrogacy but acknowledges she is not especially religious. She is very controlling of her children and husband. He found an exaggerated sense of aggrandizement and self-importance. He attributes impulsivity to her dropping out of school, the Florida flight without thinking about education consequences for the daughter or economic consequences for her husband who needs her support to conquer his alcoholism.\n\nMr. Whitehead -- He presents as a passive individual permitting his wife to make many decisions. He has a long history of alcohol abuse and is making no effort to control it.\n\nMr. Stern -- He presents a somewhat introverted person who contains his feelings. He is deeply invested in his daughter. He is not adverse to the use of professional help in appropriate circumstances.\n\nMrs. Stern -- Presents as a warm, open person. There is no psychiatric involvement by way of thought disorder, delusions impairments of reality. She could be diagnosed as having an adjustment disorder with depressive features.\n\nConclusively, Dr. Levine believed that Mrs. Whitehead's psychopathology posed major problems for \"Baby M.\" In the absence of duress, she functions well but when her anxiety level is elevated, she reacts without reflection and in a manner demonstrating poor judgment. Perhaps she sees her children as an extension of herself so any problem of the child is perceived as an affront to herself. This doctor recommends full custody to Mr. and Mrs. Stern.\n\nDr. David Brodzinsky is a psychologist in private practice. He is also an associate professor in developmental and clinical psychology at Rutgers University.\n\nOf more than passing note is the fact that Dr. Brodzinsky was solicited by the Whiteheads, the Sterns and the guardian ad litem for \"Baby M.\" He chose to serve the child and work for the guardian ad litem. His was a threefold focus: 1) who should have what manner of custody; 2) should parental rights be severed; and 3) if not, what form should the relationship take.\n\nIn testimony, the witness moved from his written recommendation of no termination and declined to express an opinion or recommendation about terminating parental rights.\n\nHe saw the infant child as at risk meaning she is more vulnerable to emotional problems than the average child because of her unique origins and the publicity attendant to this trial. Therefore, she needs a secure environment which will help her overcome the risk.\n\nHe compared the dynamics of the two families as follows:\n\nBill and Betsy Stern have a stable and financially secure household. Their marital relationship appears to be a warm and loving one. There is evidence of mutual respect, empathy, and support for one another. Furthermore, there is a sense of appreciation for the boundary between these two individuals. Each respects the uniqueness of the other -- in terms of needs, desires, goals, etc. -- and understands the importance of allowing the other person the freedom to express that uniqueness.\n\nMr. and Mrs. Stern also display evidence of successful cooperative parenting of Baby M. There is sharing of the practical aspects of caregiving (e.g. feeding, bathing, changing diapers, etc.) as well as the emotional aspects. No evidence of possessiveness with regard to the baby is apparent. In summary, Mr. and Mrs. Stern offer a secure and loving home environment for Baby M.\n\nObservations of the Whitehead family indicated that Mrs. Whitehead is clearly the controlling parent. Her rules and decisions are the law in the family. Mr. Whitehead appears to be somewhat unavailable as a parent. Both Ryan and Tuesday confirm this belief. Undoubtedly, this pattern is due, in part, to Mr. Whitehead's work schedule. Yet even when he is present in the family, he tends to take a \"back seat\" to his wife.\n\nMrs. Whitehead also displayed an overinvolved or enmeshed pattern with her children. In this regard, she has difficulty separating her needs, desires, thoughts, goals, etc. from those of her children. For example, in the family\n\ninterviews she constantly answered for her children, projecting her beliefs and feelings for theirs. The Whitehead children clearly are aware of Mrs. Whitehead's intolerance of disagreement. Many of the responses they gave in family interviews were either preceeded or followed by a furtive glance toward their mother. Mrs. Whitehead's enmeshed pattern also was seen in relation to Baby M.\n\nIn summary, the Whitehead marriage currently is stable, although financial pressures continue to plague the family. Observations suggest that Mrs. Whitehead dominates the family, with Mr. Whitehead assuming a subordinate parenting role. Mrs. Whitehead also has developed an enmeshed pattern with her children which is inhibiting their development of independence.\n\nThe doctor said that termination would ensure stability and continued litigation could hurt the child. He concluded that Mrs. Stern genuinely believed she was functionally infertile.\n\nMrs. Whitehead was seen as acting intuitively rather than thoughtfully. Her caring serves herself not those served.\n\nAs to the need for siblings such as the two Whitehead children the doctor noted that when \"Baby M\" needs them in eight to ten years they will be 19 and 20 years of age -- already of another generation. He also stated that Mrs. Whitehead had done a good job parenting her son and daughter.\n\nThis is not the usual custody situation because there is no shared parenting, no history of any relationship of consequence between the natural parents. It is all about a child with special needs because of her origin.\n\nDr. Judith Greif is a doctor of social work in private practice. She is also an assistant clinical professor at Albert Einstein Medical School. (She never met or knew of Mrs. Stern, who is on the staff of the same teaching hospital, until retained in this cause.).\n\nShe defined a child's best interests as being two basic needs: 1) a closeness to be loved, to love and feel nurtured; and 2) a sense of oneness and opportunity to be separate.\n\nHer purpose was to make an evaluation and recommendation as to which child custodial arrangement would best meet the needs of the baby.\n\nMr. Stern presents an intelligent, articulate and thoughtful man. Although somewhat reserved initially, he was able to share his thoughts and feelings and to reflect on his behavior. He appears to have some conflict about asserting himself in confrontational situations. Although Mr. Stern may appear to others to be somewhat distant, he impresses me as a person with a range of emotions of which he is aware; however, he is a private person and somewhat selective about those with whom he will share his feelings. Mr. Stern's emotions were most readily apparent when discussing his daughter. At those times, he became openly animated. He is clearly attached to her, both in terms of what he verbalizes about their relationship as well as in his observable interactions with her.\n\nMrs. Stern presents as a personable, intelligent, highly articulate woman with a somewhat obsessive style. She is ambitious and apparently quite accomplished. However, she has an understanding of the limits of what she knows. She is quite candid in acknowledging that although she is a pediatrician, the affective experience of parenting a child has brought her new insights. She gives evidence of a strong attachment to Baby M. She is very caring and affectionate with her, while at the same time respecting Baby M's need for space.\n\nMrs. Whitehead presents as a friendly, though somewhat tense woman. She is quite verbal, although there are noted inconsistencies in her presentation and discussion of facts (e.g. her level of education) as well as a lack of recall of potentially conflictual events (e.g. her false allegations that Mr. Stern had sexually abused her daughter, Tuesday). Although her selective memory is apparent, it is unclear to me whether that is a deliberate attempt to conceal information or a deficit in her ability to adequately process information of a conflictual nature. Although Mrs. Whitehead is clearly attached to Baby M, I am concerned about inappropriate aspects of that attachment. Mrs. Whitehead presents herself as a parent who always puts the needs of her children ahead of her own. However, there is evidence to suggest that her wish to care for Baby M may, in fact, derive from a need to nurture herself. She seems driven, even at the expense of the feelings of her other children, to prove that she is the most important person in Baby M's life. In addition, Mrs. Whitehead appears unable to acknowledge Baby M as a person with an identity and needs separate from her own. Her need for having possession of this baby is overwhelming. One example is seen in her decision to abscond with the baby. An even more striking example is seen in her pronouncement that she would rather see the baby dead than in the care of its father. There is also evidence to suggest that when she feels threatened or her needs are not met, Mrs. Whitehead is capable of exploiting her children to achieve her goals (sex abuse threat, use of media).\n\nMr. Whitehead presents as a somewhat reserved and guarded man, though cooperative throughout the evaluation process. He is articulate though not loquacious and there is a direct, \"down to earth\" quality about him. In family interviews, he tended to defer to his wife, letting her handle the children and do most of the talking. Although he acknowledges a problem with alcohol, I think he tends to minimize its importance in his life and therefore, has not fully resolved it.\n\nMr. and Mrs. Whitehead report a marital relationship that was strained in the past but is now strong, due in part to their shared ordeal of the past year or more. When seen together, they give evidence of a relaxed and caring relationship, one in which Mrs. Whitehead clearly dominates. Despite the pressures of the current custodial dispute, and additional financial pressures, they both have adopted a very positive attitude toward their family's future. Such an attitude they feel has helped them weather recent events, but also seems indicative of a sense of denial which they both share.\n\nDr. Greif saw the primary issue as parenting skills -- a capacity for empathy, ability to understand the feelings and needs of the child and to separate one's own needs from the child to encourage automony.\n\nDr. Greif made a point worthy of mention and that was that it is not in the best interests of any child to have such public attention and scrutiny of her life revealed in the media. Common sense and decency demand this response. What the child has to learn about her origin and this litigation should only be done in a private way. The doctor, a recognized expert on the subject of joint custody, absolutely rejected that concept for this case.\n\nContinued litigation would be harmful to the child.\n\nThe doctor perceived Mrs. Whitehead as a woman who would stop at nothing to get her child back.\n\nShe noted that Mrs. Whitehead did not have time to go to family therapy but did have the time to pose for media pictures.\n\nWhile she was against termination of parental rights, noting present statutory prerequisites not having been met, she acknowledged that because we are dealing with a new family form, it may require new definitions of unfitness for purposes of termination.\n\nDr. Greif made two final points. One was that it is confusing for a child to grow up with parents separate from each other; and two, Mr. Stern would subordinate his wishes for his daughter and give up visitation because he sees it as damaging to a child to grow up in two families. It would be in the best interests of the child to have one set of parents and one home.\n\nThe court has now concluded a rather voluminous review of the salient testimony of 11 mental health professionals. The court notes that it is free, pursuant to New Jersey case law, to accept or reject all or part of the testimony given at the trial. It must be emphasized that expert testimony is adduced only to aid the trier of fact in reaching a decision.\n\nWe are instructed that a judge, acting here, as trier of fact, is free to act on his own responsibility to decide the question of fact. State by Commissioner of Trans. v. Laino, 193 N.J. Super. 713 (App.Div.1984).\n\nEvid.R. 56(2) provides, inter alia, that the purpose of expert testimony is to aid the trier of fact to understand the evidence.\n\nThis court notes that the testimony of experts deserves respect. Their testimony must, however, be submitted to the judgment and consideration of, and be weighed by, the trier of fact. Experts are to aid and assist the trier of fact, not to dominate or control him in the decision of the disputed question. Port of N.Y. Authority v. Howell, 59 N.J. Super. 343 (Law Div.1960).\n\nAnd so it will be as the court makes its conclusions. It will not slavishly parrot this opinion or that conclusion but will weigh the expert testimony and use it where appropriate to reach its decision.\n\nThis court is confronted with circumstances in which on February 6, 1985, the parties to this litigation, with great joy and expectation, entered into a surrogate arrangement. It was an arrangement where both -- the prospective family and the surrogate mother -- wanted the child; albeit, for different purposes. Even though the insemination is artificial, the parental attitude is real. Rosenblatt, \"The Baby in the Factory,\" Time (February 14, 1983). The couple sought to bring into existence a child by conscious pre-arrangement which, as far as biologically possible, would be genetically their own. The surrogate consciously chose to bear a child for another couple with the\n\nunderstanding that she would not contest but would consent to their adoption of it.\n\nThe adverse pressure and exploitation of the unplanned pregnancy is not present. When the child arrives, it has a home waiting for it with a biological father and his wife. Keane, \"Surrogate Motherhood,\" 1980 So.Ill.L.J. 155.\n\nConcerns have been expressed about the efficacy of surrogate arrangements. They are: 1) that the child will not be protected; 2) the potential for exploitation of the surrogate mother; 3) the alleged denigration of human dignity by recognizing any agreement in which a child is produced for money; 4) surrogacy is invalid because it is contrary to adoption statutes and other child benefit laws such as statutes establishing standards for termination of parental rights; 5) it will undermine traditional notions of family; and 6) surrogacy allows an elite economic group to use a poorer group of people to achieve their purposes.\n\nIt is argued that the child will not be protected. So long as there is no legislation and some court action in surrogacy arrangements is required, the child born of surrogacy will be protected in New Jersey. If there is compliance with the contract terms, adoption will be necessary; hence, court inquiry about best interests must take place. If there is non-compliance with the contract, as in this case, best interests is still litigated with protection to the child, with its own guardian and experts retained to aid the court in its best interests determination.\n\nThe second argument against surrogacy is that the surrogate mother will be exploited. To the contrary. It is the private adoption that has that great potential for, if not actual, exploitation of the mother. In the private adoption, the woman is already pregnant. The biological father may be unknown or at best uninterested in his obligations. The woman may want to keep the child but cannot do so for financial reasons. There is the risk of illegal consideration being paid to the mother. In\n\nsurrogacy, none of these \"downside\" elements appear. The arrangement is made when the desire and intention to have a family exist on the couples part. The surrogate has an opportunity to consult, take advice and consider her act and is not forced into the relationship. She is not yet pregnant.\n\nThe third argument is that to produce or deal with a child for money denigrates human dignity. With that premise, this court urgently agrees. The 13th Amendment to the United States Constitution is still valid law. The law of adoption in New Jersey does prohibit the exchange of any consideration for obtaining a child. The fact is, however, that the money to be paid to the surrogate is not being paid for the surrender of the child to the father. And that is just the point -- at birth, mother and father have equal rights to the child absent any other agreement. The biological father pays the surrogate for her willingness to be impregnated and carry his child to term. At birth, the father does not purchase the child. It is his own biological genetically related child. He cannot purchase what is already his.\n\nThe fourth argument against surrogacy is that it is a concept running contrary to the laws of adoption in New Jersey. It is in this court's view that the laws of adoption in this State do not apply to surrogacy contracts. Adoption is a concept unknown at common law. It is a statutory remedy and must be strictly construed. It is submitted that at the time that even the most current adoption laws were adopted, no thought or consideration was given to the law's effect or relevance to surrogacy. Surrogacy was not a viable procreation alternative and was unknown when the laws of adoption were passed. A review of the adoption statute's legislative history reveals this fact. The same rationale must attach to laws dealing with termination of parental rights. Indeed, it is held that the only concept of law that can presently attach to surrogacy arrangements are contract law principles and parens patriae concepts for the benefit of the child. These are the only polestars\n\navailable for this court to chart its course on the issues of surrogacy.\n\nIndeed, a careful review of all decisions to date in this country on the issue of surrogacy, shows the factual circumstances in each case to have arisen out of an adoption proceeding. Courts have had to torturously reason to their conclusions. This court in suggesting that there is no law applicable, save common law principles, that will take care not to misallocate rights and obligations or create interpretations where none were intended.\n\nThe fifth argument against surrogacy is that it will undermine traditional notions of family. How can that be when the childless husband and wife so very much want a child? They seek to make a family. They intend to have a family. The surrogate mother could not make a valid contract without her husband's consent to her act. This statement should not be construed as antifeminist. It means that if the surrogate is married, her husband will, in all probability, have to sign the contract to establish his non-paternity pursuant to the New Jersey Parentage Law. Both sides of the equation must agree.\n\nThe sixth and final argument suggests that an elite upper economic group of people will use the lower economic group of woman to \"make their babies.\" This argument is insensitive and offensive to the intense drive to procreate naturally and when that is impossible, to use what lawful means are possible to gain a child. This intense desire to propagate the species is fundamental. It is within the soul of all men and women regardless of economic status.\n\nDuring the course of the testimony offered by the principals to this writing, the court was told on several occasions that a writing was executed by them. Indeed, that writing was marked into evidence. The court was further told by the parties that they all understood their obligations under the contract. Specifically, it was understood by all that Mr. Stern's sperm would be used to artificially inseminate Mrs. Whitehead.\n\nUpon conception, Mrs. Whitehead would carry the child and when she gave birth, she would then surrender the infant to the biological father and his wife. Mrs. Whitehead would also voluntarily renounce her parental rights to permit Mrs. Stern to adopt the infant. Mrs. Stern, it must be noted, is not a party to the contract. This was to avoid any possible inference that there is a violation of N.J.S.A. 9:3-54 (which prohibits giving a consideration to obtain an adoptable child). Mr. Whitehead signed a certification pursuant to N.J.S.A. 9:17-44 establishing his non-paternity. Mr. Stern agreed to pay Mrs. Whitehead $10,000 for conceiving and bearing his child.\n\nFundamentally, when there were no time constraints, when Mrs. Whitehead was not pregnant, when each party had the opportunity to obtain advice (legal, medical and/or psychological), the parties expressed their respective offers and acceptances to each other and reduced their understanding to a writing. If the mutual promises were not sufficient to establish a valid consideration, then certainly there was consideration when there was conception. The male gave his sperm; the female gave her egg in their pre-planned effort to create a child -- thus, a contract.\n\nFor the past year, there has been a child in being. She is alive and well. She is tangible proof of that which the Whiteheads and Mr. Stern in concert agreed to do. The child was conceived with a mutual understanding by the parties of her future life. Except now, Mrs. Whitehead has failed to perform one of her last promises, which was to surrender the child and renounce parental rights. She has otherwise performed the personal service that she had undertaken -- conception and carrying the child to term. The terms of the contract have been executed but for the surrender.\n\nIt is argued that Mrs. Whitehead should have a time period after delivery to determine if she wants to surrender the child. Such a rule has been developed in Kentucky by the use of Kentucky's private placement adoption statute. Use of laws\n\nnot intended for their intended purpose creates forced and confusing results. There should be no use of the New Jersey adoption statutes to accommodate or deny surrogacy contracts. Indeed, again it is held that there is no law governing surrogacy contracts in New Jersey and the laws of adoption do not apply to surrogacy contracts. The sole legal concepts that control are parens patriae and best interests of the child. To wait for birth, to plan, pray and dream of the joy it will bring and then be told that the child will not come home, that a new set of rules applies and to ask a court to approve such a result deeply offends the conscience of this court. A person who has promised is entitled to rely on the concomitant promise of the other promisor. This court holds therefore that in New Jersey, although the surrogacy contract is signed, the surrogate may nevertheless renounce and terminate the contract until the time of conception. She may be subject then for such monetary damages as may be proven. Specific performance to compel the promised conception, gestation, and birth shall not be available to the male promisor. However, once conception has occurred the parties rights are fixed, the terms of the contract are firm and performance will be anticipated with the joy that only a newborn can bring.\n\nHaving defined a new rule of law, this court hastens to add an exception. After conception, only the surrogate shall have the right, to the exclusion of the sperm donor, to decide whether to abort the fetus. Her decision to abort must comply with the guidelines set forth in Roe v. Wade, 410 U.S. 113, 93 S. Ct. 705, 35 L. Ed. 2d 147 (1973).\n\nRoe, supra, establishes and recognizes the unique and singular quality of woman. That only woman has the constitutionally protected right to determine the manner in which her body and person shall be used. The surrogate parenting agreement fails to recognize this fact; hence, the clause it contains prohibiting abortion except as allowed by the male promisor is void and unenforceable.\n\nIt is argued that the contract in this case is one of adhesion. It was a writing printed by and supplied by ICNY. That its terms were not immutable is shown by the testimony of the attorney, Saul Radow, who by deposition reported negotiating changes to the written contract; albeit, minor changes. By definition, a contract of adhesion is one in which one party has no alternative but to accept or reject the other party's terms and there are no options by which the party may obtain the product or service. Here, neither party has a superior bargaining position. Each had what the other wanted. A price for the service each was to perform was struck and a bargain reached. One did not force the other. Neither had expertise that left the other at a disadvantage. Neither had disproportionate bargaining power. Although the contract was a form, there is no proof that it was absolute and could not be altered. Defendant offered no proof to this end. Mrs. Whitehead, acknowledged that minor changes were bargained for. There is no evidence of an absence of good faith or fair dealing. This is not a contract of adhesion. Henningsen v. Bloomfield Motors, Inc., 32 N.J. 358 (1960).\n\nDefendants argue unconscionability. They claim the terms are manifestly unfair or oppressive. These terms were known to Mrs. Whitehead from her earlier surrogate contracting experience. She read the second contract, albeit briefly, prior to signing it. She was aware of her compensation. She had been pregnant before and had to be aware of the risks of pregnancy. Her obligation included physical examination for her own welfare as well as the welfare of the fetus. Mrs. Whitehead says that Mr. Stern undertook no risks. To compare the risk of pregnancy in a woman to the donation of sperm by the man would be unconscionable. This, however, is the bargain Mrs. Whitehead sought and obtained. Mr. Stern did take a risk, however, whether the child would be normal or abnormal, whether accepted or rejected he would have a lifetime obligation and responsibility to the child as its natural and biological father.\n\nTo the issue of unconscionability, defendants fail to show proof of overreaching or disproportionate bargaining that result in an unfair contract. Mrs. Whitehead was anxious to contract. At the New Brunswick meeting, she pressed for a definitive statement by the Sterns. She knew just what she was bargaining for. This court finds that she has changed her mind, reneged on her promise and now seeks to avoid her obligations. Unconscionability claims arise, more often than not, in consumer contracts for products or services. The seller is in the dominant position and the buyer must comply or there is no deal. Not so here -- either party could have walked away from the other. Either party would then have continued on ICNY's roster of available surrogates and childless families seeking a surrogate. They chose not to do so. The bargain here was one for totally personal service. It was a very scarce service Mrs. Whitehead was providing. Indeed, it might even be said she had the dominant bargaining position for without her Mr. Stern had no other immediate source available. Each party sought each other to fulfill their needs.\n\nIt is argued by amicus that the $10,000 to be paid Mrs. Whitehead is so low as to be unconscionable. In counterpoint, it is stated that not all services can be compensated by money. Millions of men and women work for each other in their marital relationship. There may even be mutual inequality in the value of the work performed but the benefits obtained from the relationship serve to reject the concept of equating societal acts to a monetary balancing. Perhaps the risk was great for the money to be paid but the risk was what Mrs. Whitehead chose to assume and at the agreed upon fee. And it is assumed she received other intangible benefits and satisfaction from doing what she did. Her original application set forth her highly altruistic purpose. Notwithstanding amicus ' position, all in this world cannot be equated to money.\n\nIt is defendants' claim of unconscionability. They must show such unfairness, overreaching, bargaining disparity or\n\npatent unfairness that no reasonable person acting without duress would accept the contract terms. Toker v. Westerman, 113 N.J. Super. 452, 454 (Cty.D.Ct.1970). This, defendants have failed to do.\n\nDefendants next claim relief from the contract because the Whiteheads had no attorney at the time they entered the contract. It is hornbook law that any person who possesses legal capacity may be bound by a contract even when it is entered without representation unless there is fraud, overreaching or undue influence which caused the party to enter the contract.\n\nIt was Dr. Vetter, one of defendants' own psychiatrists, who testified unequivocally that the Whiteheads had legal capacity to contract. There were no mental disabilities. They understood what they were doing. They understood the contract terms. That there was capacity to contract was proven by a preponderance of the credible evidence. Furthermore, Mr. Whitehead testified they signed the contract at their New Jersey home because they did not wish to travel to New York. Their prior counsel was available to them. They chose not to call him. In a misguided attempt to show influence, it is said Mr. Stern paid for that lawyer -- but that was his obligation under the surrogate parenting agreement; that is, pay the ancillary expenses of the Whiteheads. It is well settled that disparity of education or sophistication is not considered grounds for avoidance of a contract. Dundee Chemical Works v. Connor, 46 N.J. Eq. 576 (E. \u0026 A.1890). In Dundee, the adversaries were a homemaker-executrix and an attorney. The Court held it would not weigh the disparate skills to void a contract. This leaves just fraud, undue influence or illegality. As to the latter two factors this court says no evidence has been shown of illegality or undue influence. This court has a sense that Mrs. Whitehead would be a very difficult person to unduly influence once her mind is made up.\n\nAs to the claim of fraud, defendants allege they may rescind the contract because of the fraud perpetrated by plaintiffs. The court first defines the terms with which we are to treat. Legal fraud has four elements: 1) a material misrepresentation of a fact; 2) known to be false; 3) upon which a party relied; and 4) to its damage. Equitable fraud eliminates the element of knowledge. Thus, even if the promisor did not know of the fact being false, it would be inequitable to permit contractual recovery and the injured party should be allowed the option to sustain the contract or rescind. Jewish Center of Sussex County v. Whale, 86 N.J. 619 (1981).\n\nDefendants claim three circumstances constitute the Sterns' fraud. The first is the issue of her infertility. The second and third are frauds of omission; that is, not making known to the Whiteheads that Mrs. Stern has multiple sclerosis; and not making known to the Whiteheads the contents of the psychological evaluation by the ICNY psychologist.\n\nThe first representation alleged by defendants concerns the medical condition of Mrs. Stern. Defendants based their argument upon a recital contained in the surrogate parenting agreement which refers to Mrs. Stern as the \"infertile wife\" of plaintiff, William Stern. In characterizing this representation as false, defendants have urged the court to adopt a very narrow definition of the term \"infertility.\"\n\nInfertility is a concept whose definition has no consensus. It has been defined as: 1) an inability to conceive, 2) unprotected coitus for a period in excess of one year without conception and 3) as the inability to conceive, carry or bear a child without significant risk to either the mother or the fetus. Where language contained in the contract is susceptible to several meanings, it is the court's function to consider what was written in the context of circumstances under which it was written and accord to the language a rational meaning in keeping with the manifest general purpose of the contract. Harker v. McKissock, 12 N.J. 310 (1953). Thus, the definition\n\nto be attributed to a word employed in a contract is obtained from its use in the particular instrument, from the language of the contract as a whole, and from the intent of the parties and circumstances surrounding the execution of the contract. Hudson County Newspaper Guild v. Jersey Pub. Co., 23 N.J. Super. 419 (App.Div.1953). Upon construing the contract as a whole, reviewing the testimony of the parties and taking into account other surrounding circumstances, this court concludes that the word \"infertility\" must be given a broad meaning -- something more than the ability to conceive. \"Infertility,\" as applied in this case, shall mean the inability to conceive and carry to term without serious threat of harm to one's physical well-being. This court is satisfied that Mrs. Stern had a sound sense of threat to her well-being if she were to become pregnant. She is a physician who testified to treating a helpless multiple sclerosis patient early in her medical training. She knew of the paralysis of a colleague's wife. She believed the medical knowledge of the time -- that the risks of exacerbation which could include loss of sensory function or even paralysis during pregnancy -- were high. A risk, though minimal, remains a risk to one who is faced with it and so it was a genuine risk to Mrs. Stern. Certainly, it is a subjective test that is being allowed to determine inability to carry without risk of harm.\n\nThis is not the only time in New Jersey law that subjective tests have been permitted. To establish extreme cruelty grounds for divorce, case law permits the wronged spouse to use subjective standards; that is, whether the acts complained of in the mind of the spouse are so cruel as to not require continued marriage. Gazzillo v. Gazzillo, 153 N.J. Super. 159 (Ch.Div.1977). In a non-family area subjectivity is allowed, too. An injured person is usually obliged to exercise ordinary care to seek medical or surgical treatment so as to effect a cure and minimize damages. Failure to do so could bar recovery. However, the injured person has the right to avoid, if he chooses, peril to life however slight and undue risks to health and\n\nanguish that go beyond the bounds of reason. Robinson v. Jackson, 116 N.J.L. 476 (E. \u0026 A.1936); Budden v. Goldstein, 43 N.J. Super. 340 (App.Div.1957).\n\nThe surrogate parenting agreement itself, when construed as a whole, sheds light upon the meaning of \"infertile wife\" as used in the agreement. In the contractual statement of intent, defendant Mrs. Whitehead acknowledges that the agreement is being entered into because the wife of William Stern is \"unable to bear a child.\" Plainly, the agreement itself does not limit any definition of \"infertility\" to the inability to conceive.\n\nReference must be made to the information supplied to Mrs. Whitehead by ICNY prior to her entering the contractual relationship with the first couple in 1984. As she has testified, Mrs. Whitehead learned of ICNY through an advertisement in the Asbury Park Press. The only advertisement placed by ICNY in the Asbury Park Press during this time period solicited potential surrogate mothers for a \"couple unable to have a child.\" The advertisement read as follows:\n\nSURROGATE MOTHER WANTED. Couple unable to have child willing to pay $10,000.00 fee and expenses to woman to carry husband's child. Conception by artificial insemination. All replies strictly confidential.\n\nAfter responding to this advertisement, ICNY provided Mrs. Whitehead with a brochure which defined female infertility as \"when the female partner in a couple is unable for medical reasons to conceive and carry a child to term.\" Thus, prior to entering into any contractual relationship, Mrs. Whitehead could not reasonably have believed that infertility would be limited to the inability to conceive a child.\n\nThe testimony of the parties and the prior statements of Mrs. Whitehead are noted. According to the Sterns, Mrs. Whitehead was advised that it was \"risky\" for Mrs. Stern to become pregnant. Indeed, Mrs. Whitehead in her own testimony acknowledged that she was aware of the general nature of Mrs. Stern's medical problem, although she did not know of the precise malady from which she suffered.\n\nFinally, before being represented by counsel, in the Hergenhan/Whitehead letter to the court of May 18, 1986, which these two women probably wrote in concert, the authors acknowledged that Mrs. Stern was \"not sterile.\" It is significant that this statement was made before it was learned that Mrs. Stern was a victim of multiple sclerosis.\n\nThe second fraud alleged to have been perpetrated upon the Whiteheads derives from the fact that Mrs. Whitehead was not advised as to the exact nature of Mrs. Stern's medical condition which, according to the Whiteheads, \"bears directly upon her ability to raise and care for a child and upon her fitness as a parent.\" Of course, the Whiteheads are speaking of Mrs. Stern's multiple sclerosis. Since the Whiteheads have taken this position, however, they have had the opportunity to have Mrs. Stern examined by their own expert, Dr. Dressner, who has concluded that there is \"no chance of her [Elizabeth Stern] getting into a position with her multiple sclerosis that she could not care for a child because of the disease.\" Mrs. Stern says she is capable of caring for the child.\n\nThe third alleged fraud perpetrated upon Mrs. Whitehead concerns a psychological evaluation conducted by a clinical psychologist at ICNY. This evaluation was designed to determine whether Mrs. Whitehead would be an acceptable surrogate. Despite the fact that Mrs. Whitehead was recommended as a candidate for the surrogate program as a result of this evaluation, defendants suggest that Mrs. Whitehead should have been advised of the psychologist's findings which contained a reservation regarding Mrs. Whitehead's tendency to deny her feelings. Defendants allege that ICNY was the agent for the Sterns and ICNY's failure to advise is all attributable to the Sterns.\n\nThe essential element of any agency relationship is the right of the principal to control the conduct of the agent. Arcell v. Ashland Chemical Co., Inc., 152 N.J. Super. 471 (Law Div.1977). Thus, in order to impute any liability to the Sterns\n\nas a result of any alleged negligent acts on the part of third persons not parties to this suit, defendants have the burden of proving that the Sterns exercised control over ICNY. They have not done so.\n\nThat the Sterns exercised no control over ICNY is manifest. Indeed, the release and hold-harmless agreement, which comprised a part of the agreement, acknowledged that ICNY was acting as an independent contractor and not as the agent for either the surrogate or for the commissioning couple. Most compelling, however, is the fact that the psychological evaluation which was conducted actually took place approximately 1 1/2 years before the Sterns ever contacted ICNY. It is also significant that in the pending suit for damages filed by the Whiteheads against ICNY, in the United States District Court for New Jersey, the Whiteheads have found it fit not to join the Sterns herein as parties, the implication being that the Whiteheads did not believe that such an agency relationship existed. Having failed to establish such an agency relationship, Whiteheads' allegations of fraud cannot be sustained against the Sterns.\n\nEven assuming arguendo that one, two or three of all of the aforementioned circumstances were misrepresented to defendant or that the omissions were damaging, defendant has failed to show reliance on each or any of them to her damage. It is this court's belief that Mrs. Whitehead wanted to enter a surrogate contract. She had just finished with an unsuccessful surrogacy effort. She wanted to become pregnant. The arguments of fraud are raised after the fact. These elements did not induce her to enter the contract. Furthermore, none of the individual issues can be deemed to be material. Mrs. Whitehead did not inquire of Mrs. Stern about her fecundity. She first began artificial insemination and subsequently asked Mr. Stern about his wife's health. By no measure can it be said that ICNY is an agent of the Sterns. Executed documents signed by both the Sterns and Whiteheads specifically reject\n\nthis position. And finally, Mrs. Whitehead contracted with Mr. Stern who sought Mrs. Whitehead to give him a child because his wife was infertile as defined above. No prior inquiry was made by Mrs. Whitehead and even if she did not have to, Mrs. Stern was not a party to the surrogate parenting agreement.\n\nFurthermore, Mrs. Whitehead's medical experts on multiple sclerosis have testified, as did Mrs. Stern's, that multiple sclerosis would not interfere with Mrs. Stern's care of the child; hence, this court holds this fact not to be material.\n\nThere is no fraud, legal or equitable, that would allow Mr. and Mrs. Whitehead to rescind their contract.\n\nIt is further argued that the contract is illusory; that is to say, that only one of the parties has an obligation, the other only benefits, that there is no mutuality of obligation. This does not mean equality of obligation. See Friedmann v. Tappan Development Corp., 22 N.J. 523 (1956); Williston, Contracts, ยง 105A at 421 (year?). Such is not the case. Mr. Stern gave his sperm; Mrs. Whitehead gave her egg. Together the miracle of a new life was obtained. Mrs. Whitehead argues Mr. Stern does not have to take the child under certain circumstances which have not happened and are not before this court. She is arguing, hypothetically, \"if.\" It is suggested again that this court is dealing with the facts before it. Even assuming arguendo, that the court were to address the issue of the illusory contract as stated by defendants, the conclusion would be the same. The Whiteheads argue that Mr. Stern does not have to take the baby if it is imperfect; but the fact is the contract does provide that there is an obligation and responsibility, that there is a life long responsibility by Mr. Stern for the child's support and welfare. The contract is not illusory.\n\nThe proponents of this surrogate-parenting agreement argue that their right to enter such a contract is protected by a fundamental right to procreate. This right of procreation is bottomed on an individual's constitutional right of privacy secured by the 14th Amendment of the U.S. Constitution's substantive\n\ndue process protections. Since the contract itself is being tested, as much as can be determined, for the first time in American jurisprudence, an analysis of the constitutional rights that attach to the contracting parties is appropriate.\n\nIn 1923, the United States Supreme Court held that an individual in this country has a constitutional right to \"marry, establish a home and bring up children.\" Meyer v. Nebraska, 262 U.S. 390, 399, 43 S. Ct. 625, 626, 67 L. Ed. 2d 1042 (1923). While one might read into Meyer, a right to procreate so as to bring up children, the issue was faced squarely 19 years later, when in 1942, the United States Supreme Court struck down Oklahoma's statute permitting sterilization of certain criminals and held that the right to procreate was among the \"basic civil rights of man.\" Skinner v. Oklahoma, 316 U.S. 535, 541, 62 S. Ct. 1110, 1113, 86 L. Ed. 2d 1655 (1942). These rights were later deemed by the Court to be \"rights far more precious . . . than property rights.\" Stanley v. Illinois, 405 U.S. 645, 651, 92 S. Ct. 1208, 1212, 31 L. Ed. 2d 551 (1972). In Cleveland Board of Education v. LaFleur, 414 U.S. 632, 639, 94 S. Ct. 791, 796, 39 L. Ed. 2d 52 (1973), it was settled that \"freedom of personal choice in matters of marriage and family life is one of the liberties protected by the due process clause of the 14th Amendment.\"\n\nAt the same time these fundamental family rights were being secured in our constitutional matrix, the court held that individuals had a right of privacy entitled to constitutional protection. Griswold v. Connecticut, 381 U.S. 479, 485, 85 S. Ct. 1678, 1682, 14 L. Ed. 2d 510 (1985). And finally in 1972, Justice William Brennan wrote in Eisenstadt v. Baird, 405 U.S. 438, 92 S. Ct. 1029, 31 L. Ed. 2d 349 (1972): \"If the right of privacy means anything it is the right of the individual, married or single, to be free from unwarranted governmental intrusion into matters so fundamentally affecting a person as the decision whether to bear or beget a child.\" Id. at 453, 92 S. Ct. at 1038.\n\nWhile it may appear from a reading of these cases that no mention of alternative reproductive methods means non-coital reproduction is excluded from the constitution's protections, this court does not so hold. Rather it must be reasoned that if one has a right to procreate coitally, then one has the right to reproduce non-coitally. If it is the reproduction that is protected, then the means of reproduction are also to be protected. The value and interests underlying the creation of family are the same by whatever means obtained. This court holds that the protected means extends to the use of surrogates. The contract cannot fall because of the use of a third party. It is reasoned that the donor or surrogate aids the childless couple by contributing a factor for conception and gestation that the couple lacks. The third party is essential if the couple is to rear a genetically related child. While a state could regulate, indeed, should and must regulate, the circumstances under which parties enter into reproductive contracts, it could not ban or refuse to enforce such transactions altogether without compelling reason. It might even be argued that refusal to enforce these contracts and prohibition of money payments would constitute an unconstitutional interference with procreative liberty since it would prevent childless couples from obtaining the means with which to have families. Robertson, \"Embryos, Families and Procreative Liberty: The Legal Structure of New Reproduction,\" 59 S.Cal.L.Rev. 501 (1986).\n\nContinuing the analysis, the right of privacy was further expanded in Roe v. Wade, supra, where inter alia it was held to be solely the woman's decision in the first trimester whether to terminate pregnancy. If the law of our land sanctions a means to end life then that same law may be used to create and celebrate life. Noteworthy is the recent use of the right of privacy to sanction the termination of life supporting medical treatment. See In Re Quinlan, 70 N.J. 10 (1976). Again, if the concept can be used to ease the end of life it shall be used to protect the creation of life. A woman and her husband have the right to procreate and rear a family. The\n\nmeans to do so can be withheld from them only upon a showing of a compelling state interest. Such an interest exists because the contract deals inter alia with creation of new life and an infant's rights. Any restriction or limitation on use must be narrowly drawn. The State's legitimate interest must insure there is no exploitation of family, mother or child.\n\nThis position on privacy flows into the substantive due process area where fundamental rights such as the right to \"bear and beget\" may only be addressed by the State upon a showing of compelling interest.\n\nThe constitutional test is to balance whether there is \"a fair, reasonable and appropriate exercise of the police power of the state as to an unreasonable unnecessary and arbitrary interference with the right of the individual to his personal liberty to enter into these contracts. . . .\" Lochner v. New York, 198 U.S. 45, 25 S. Ct. 539, 49 L. Ed. 2d 937 (1905). Legislation or court action that denies the surrogate contract impedes a couple's liberty that is otherwise constitutionally protected. The surrogate who voluntarily chooses to enter such a contract is deprived of a constitutionally protected right to perform services.\n\nLegislation must bear a reasonable relation to a legitimate legislative end. Protection of the child, health standards, legitimacy and protection against exploitation of and by a surrogate would be legitimate legislative ends. This court's inquiry constitutes state action. In the absence of legislative direction then this judicial inquiry is appropriate state action, the same as would be allowed and for the same reasons that would sustain legislation governing this constitutionally protected area. This inquiry is protective of the parties' substantive due process rights.\n\nA final constitutional premise requires scrutiny and that is the Equal Protection Clause of the United States Constitution's 14th Amendment.\n\nClassifications of persons to be sustained for equal protection purposes \"must be reasonable, not arbitrary and must rest upon some ground of difference having a fair and substantial relation to the object of the legislation so that all persons similarly circumstanced shall be treated alike.\" Reed v. Reed, 404 U.S. 71, 76, 92 S. Ct. 251, 254, 30 L. Ed. 2d 225 (1976). This is the test to be applied to classifications dealing with gender and legitimacy. Currently, males may sell their sperm. The \"surrogate father\" sperm donor is legally recognized in all states. The surrogate mother is not. If a man may offer the means for procreation then a woman must equally be allowed to do so. To rule otherwise denies equal protection of the law to the childless couple, the surrogate, whether male or female, and the unborn child. K. M. Sly, \"Baby Sitting Consideration: Surrogate Mother's Right to 'Rent her Womb' for a Fee,\" 18 Gonz.L.Rev. 539 (1982/83).\n\nJohn A. Robertson, in his article \"Surrogate Mothers: The Case For and Against\" published in 13 Hastings Center Rep. 5, in October 1983 wrote:\n\nWhat stance should public policy and the law take toward surrogate mothering? As with all collaborative reproduction, a range of choices exists, from prohibition and regulation to active encouragement.\n\nHowever, there may be constitutional limits to the state's power to restrict collaborative reproduction. The right not to procreate, through contraception and abortion, is now firmly established. A likely implication of these cases, supported by rulings in other cases, is that married persons . . . have a right to bear, beget, birth, and parent children by natural coital means using such technological aids . . . as are medically available. It should follow that married persons also have a right to engage in noncoital, collaborative reproduction, at least where natural reproduction is not possible. The right of a couple to raise a child should not depend on their luck in the natural lottery, if they can obtain the missing factor of reproduction from others. [at\n\nFor the foregoing reasons, this court concludes and holds that the surrogate-parenting agreement is a valid and enforceable contract pursuant to the laws of New Jersey. The rights of the parties to contract are constitutionally protected under the 14th Amendment of the United States Constitution. This court further finds that Mrs. Whitehead has breached her\n\ncontract in two ways: 1) by failing to surrender to Mr. Stern the child born to her and Mr. Stern and 2) by failing to renounce her parental rights to that child.\n\nWhat are the remedies available to the plaintiff? The remedies that exist for breach of a contract are an award of money damages or specific enforcement of the terms of the contract. There are, of course, other remedies but they are neither relevant nor applicable here. Monetary damages cannot possibly compensate plaintiff for the loss of his bargain because of defendant's breach. The singular subject of the contract further mitigates against an award of damages.\n\nPlaintiff acknowledges that before the remedy of specific performance can be used it must be shown that the contract was entered into with understanding and free will. Dr. Vetter, the Whitehead psychiatric expert, testified that the Whiteheads were competent when the contract was signed and they understood the terms. It must also be shown that the contract was entered in good faith, without fraud and is not unenforceable because of public policy. By reason of the findings heretofore made, to wit: there is no evidence of fraud and the parties voluntarily entered the agreement, indeed they were all very anxious to do so, such contracts are not contrary to public policy. Indeed New Jersey has no stated public policy on surrogacy and this type of contract is constitutionally protected. There is no reason why this court should not order specific performance.\n\nSpecific performance is a discretionary remedy. It should only be exercised in accordance with principles of equity. In each case the evaluation of the equities must be left to the judgment and good conscience of the trial court. Stehr v. Sawyer, 40 N.J. 352 (1963). This means that the court must adjudge and weigh whether the parties' conduct was fair and reasonable. Will the relief afforded by the remedy be unreasonable? If specific performance is ordered, the result will be just what the parties bargained for and the contract contemplated.\n\nMr. Stern wanted progeny, a child. Mrs. Whitehead wanted to give the child she would bear to a childless couple. His sperm fertilized her egg. A child was born. Until the child was placed in his home he never knew the stress and bliss, the responsibilities and rewards of a child. The Whiteheads have two children. They did not want any more. Theirs was the perfect family, Mr. Whitehead testified. The Whiteheads agreed that Mr. Whitehead should get a vasectomy to prevent further conception. It is suggested that Mrs. Whitehead wanted a baby, now that she is older than when her first two children were born, to experience and fulfill herself again as a woman. She found the opportunity in a newspaper advertisement. She received her fulfillment. Mr. Stern did not.\n\nAt this point the court would enter its order for specific performance, but an additional inquiry is necessary. Since we here deal with a human life of only one year, since we treat with, as the guardian ad litem has said \"the most precious and unique thing on this earth, a small vulnerable and lovable child,\" inquiry must be made to determine if the result of such an order for specific performance would be in the child's best interest. This court holds that whether there will be specific performance of this surrogacy contract depends on whether doing so is in the child's best interest. Again, as the guardian ad litem has asserted \"the child's best interest is the only aspect of man's law that must be applied in fashioning a remedy for this contract . . . for any contract that deals with the children of our society. . . .\" Any other result would indeed conflict with the court's role as parens patriae. Thus, in the absence of a public policy regarding surrogacy in New Jersey, with the rule as aforesaid that the laws of adoption, custody and parental termination were never intended to apply and do not apply to surrogacy, the only rule of law by which this court may be guided is the application of the doctrine of a child's best interests in the exercise of its parens patriae jurisdiction.\n\nAn agreement between parents is inevitably subservient to the considerations of best interests of the child. The welfare of a child cannot be circumscribed by an agreement of the parents. Gulick v. Gulick, 113 N.J. Super. 366, 371 (Ch.Div.1971) and Sheehan v. Sheehan, 38 N.J. Super. 120 (App.Div.1955). It must follow that \"best interests\" are paramount to the contract and this court must answer a best interests inquiry if it is to specifically perform the surrogate-parenting agreement.\n\nWhat does \"best interests of the child\" mean? The concept is the most important one to be addressed herein. Its meaning is amorphous. It has many meanings for it is a concept general in meaning but specific in application. It is more than a child's happiness, physical, mental and moral welfare. Fantony v. Fantony, 21 N.J. 525 (1956). A seminal case on best interests is Finlay v. Finlay, 240 N.Y. 429, 148 N.E. 624 (Ct. of App.1925), in which Justice Cardozo wrote the chancellor does not determine the rights as between parent and child or as between either parent but rather \"interferes for the protection of infants.\" Justice Cardozo cited Matter of Spence, 2 Phil.Ch. 247 (1847), an English chancery case where the chancellor held \"There is no concern for the disputants, its concern being only for the child.\" Id. at\n\nBest interests has been variously defined by expert witnesses in this case as follows:\n\nDr. H. Koplewicz: The best interest is the best placement, the best custody.\n\nDr. B. Sokoloff: Everything that is most suitable for a child's proper growth, development with a minimum amount of disability.\n\nDr. A. Levine: A psychological milieu and environment best conducive to healthy normal relationships.\n\nDr. J. Greif: Best interests are two basic needs, themes interwoven during the developmental stage. They are a closeness to be loved and to love -- to feel nurtured and a sense of\n\noneness with the opportunity to be separate -- to develop ones own ideas and feeling, to be independent.\n\nBut perhaps Dr. Salk gives the most quantified definition. He establishes nine criteria in defining \"best interests of a child.\"\n\n1) Was the child wanted and planned for? We now know the Sterns desperately wanted a child. They intended by the contract to have a child. They previously planned for the child by considering Mrs. Stern's own capability, inquiring about adoption and exploring surrogacy. They resolved in favor of surrogacy as the only viable vehicle for them to have a family. Mr. and Mrs. Stern contracted for Mrs. Whitehead's services. They created a nursery and made new wills to provide for the expected child. Mrs. Whitehead wanted to carry a child for a childless couple. It is clear that the Sterns planned for and wanted the child. Mrs. Whitehead did not. Her testimony is quite to that effect.\n\n2) What is the emotional stability of the people in the child's home environment? The Sterns are found to have a strong and mutually supportive relationship. Any familial difficulties are handled through rational decision making. This is good evidence of mutual respect and empathy. Each recognizes and respects the other's needs, desires and goals. There is evidence of successful cooperative parenting of the infant child.\n\nThe Whiteheads appear to have a stable marriage now. It was earlier plagued with separations, domestic violence and severe financial difficulties requiring numerous house moves. There was a bankruptcy. Mrs. Whitehead dominates the family. Mr. Whitehead is clearly in a subordinate role. He has little to do with the subject child. Mrs. Whitehead is found to be thoroughly enmeshed with Baby M, unable to separate her own needs from the baby's. This overbearing could inhibit the child's development of independence. The mental health professionals called by the guardian ad litem agree that Mrs. Whitehead may have trouble subordinating her own needs to the child's needs. Mrs. Whitehead has been shown, by clear\n\nand convincing proof to this court's satisfaction, to be impulsive, as shown by her unplanned future when dropping out of high school and the removal of her son from a second grade classroom without first making inquiry of the teacher and principal. Another example of impulsiveness is her flight to Florida in violation of a court order. She has been shown, by clear and convincing proof to this court's satisfaction, to be manipulative. Reference need only be made to the tapes of July 15 and 16, 1986. If she was not suicidal, she was certainly manipulative in making the threats to take her life and the baby's life. She has been shown by clear and convincing proof to this court's satisfaction, to be exploitive also. She uses her children for her own ends: witness the bringing of her older daughter to court where the child was terrorized by the crush of media and her fawning use of the media to her own narcissistic ends. It appears she totally failed to consider the impact of the false sex abuse charge on her daughter. The placement of an infant's crib in Tuesday's room is without sensitivity or regard to Tuesday's feelings.\n\n3) What is the stability and peacefulness of the families? Again, the Sterns are found to be living private unremarkable lives. The Whiteheads have known marital discord, domestic violence and many residential moves, although things are tranquil now.\n\n4) What is the ability of the subject adults to recognize and respond to the child's physical and emotional needs? This court finds from clear and convincing proofs presented to it that Mrs. Whitehead has been shown to impose herself on her children. Her emphasis with the infant may impair the parenting of her other two children for whom she has been, with limited exception until now, a good mother. She exhibits an emotional over-investment. It was argued by defendant's counsel that Mrs. Whitehead loved her children too much. This is not necessarily a strength. Too much love can smother a child's independence. Even an infant needs her own space.\n\nThe Sterns show sensitivity to the child's needs but at the same time allow her to develop independently. Both families recognize and satisfy the infant's physical needs.\n\n5) What are the family attitudes towards education and their motivation to encourage curiosity and learning? The Sterns have demonstrated the strong role that education has played in their lives. They both hold doctoral degrees in the sciences. Mrs. Stern is a medical doctor. Mrs. Whitehead dropped out of the tenth grade in high school. Mr. Whitehead graduated high school doing enough, as he said, \"to get by.\" Mrs. Whitehead has interposed herself in her son's education, denying the finding of a professional child study team and rejecting their recommendations.\n\n6) What is the ability of the adults to make rational judgements? Mr. Whitehead permits his wife to make most of the important decisions in their family. His active participation in the May 5, 1986 elopement is hardly evidence of cogent thought. Mrs. Whitehead is found to be impulsive especially in crisis circumstances or moments of heightened concern. She doesn't think of the consequences: at age 15 1/2 she dropped out of school; she withdrew her son from second grade for what she perceived to be an affront to him without first inquiring of the teacher or principal; she eloped to Florida in direct violation of a court order, without considering the economic and emotional consequences. She impulsively, not to say maliciously, made an untruthful allegation about Mr. Stern. Mr. \u0026 Mrs. Stern have shown a capability to make logical reasoned decisions in all circumstances.\n\n7) What is the capacity of the adults in the child's life to instill positive attitudes about matters concerning health? It is already noted that Mrs. Stern is a pediatrician. The court assumes her skill can but benefit the child. Other than failing to have the child vaccinated when Mrs. Whitehead was in Florida for the first few months of the child's life, which is not to be minimized, there is no evidence that she would convey\n\npoor health habits to the child. Mr. Whitehead has been shown to be an episodic alcoholic \"binging\" for two-week periods approximately every six months. He is doing nothing to eliminate this concern. To infuse a child into such a milieu is problematic.\n\n8) What is the capacity of the adults in the baby's life to explain the circumstances of origin with least confusion and greatest emotional support? Mrs. Whitehead being the parent most invested with the infant's care, in all likelihood would be charged with the task of telling the child of her origin. This court doubts her capability to truthfully report Baby M's origin. She has shown little empathy for the Sterns and their role and even less ability to acknowledge the facts surrounding the original contract. Insofar as emotional support is concerned, the court doubts Mrs. Whitehead could or would subordinate herself for the child's benefit when there is a conflictual circumstance such as relating the child's origin to her. To this day she still appears to reject any role Mr. Stern played in the conception. She chooses to forget that but for him there would be no child. The quality of her reporting capabilities have been tested in these proceedings and are found generally wanting. The Sterns have indicated a willingness to obtain professional advice on how and when to tell his daughter. Important in this equation is the child's trust that will have been constructed between custodial parent and child.\n\n9) Which adults would better help the child cope with her own life? It has been shown that Mrs. Whitehead has trouble coping in crisis. She can manage the routine. The Sterns have shown no aberration in either circumstance.\n\nThe court also evaluates the climate in which the child may be exposed with the Whiteheads. In addition to a history of economic and domestic instability with another house move imminent, the reduced level of importance given to education in the Whitehead home and the character trait problems defined by almost all the mental health professionals including Mrs.\n\nWhitehead's own chosen experts, Mrs. Whitehead has a genuine problem in recognizing and reporting the truth.\n\nWhile we here address best interests it is relevant to her entire posture before the court. Doctor Klein, her own expert, said she lies under stress. Dr. Schecter said she is a faulty reporter because of her \"I don't know, I can't recall\" answers; especially the number of such answers. The court found this to be so to such an extent it became apparent that Mrs. Whitehead testified to what she chose to, exercising a selective memory, intentionally not recalling or outright lying on the witness stand. This court is thoroughly satisfied that Mrs. Whitehead fully knew of the contents of this court's May 5, 1986 order. She testified on oath to the contrary but the content of her father's letter and Hergenhan's letter prove the contrary and it is Hergenhan's letter that also mitigates against Mrs. Whitehead for Mrs. Whitehead knew a lie was being perpetrated on the court; she knew it, participated in it and never acknowledged it. This fundamental inability to speak the truth establishes a tarnished Whitehead environment.\n\nThe foregoing recital shows that Mr. Whitehead is a benign force in the Whitehead household. The drive and direction are solely Mrs. Whitehead's prerogatives. This court is satisfied by clear and convincing proofs that Mrs. Whitehead is unreliable insofar as her promise is concerned. She breached her contract without regard to her legal obligations. There had been domestic violence in her household that she could not recall until the court documents refreshed her recollection. She should have known of these facts as she is the one who called the police. There were many house moves in the earlier years of marriage and another move appears imminent. The Whiteheads have had severe economic difficulties including a bankruptcy. In those court papers there appears to be a flawed statement of assets in that the Whiteheads omitted two assets thus misleading the court and their creditors. Mrs. Whitehead has been found too enmeshed with this infant child and unable to separate her own needs from those of the child. She tends to\n\nsmother the child with her presence even to the exclusion of access by her other two children. She does not have the ability to subordinate herself to the needs of this child. The court is satisfied that based on the details above, Mrs. Whitehead is manipulative, impulsive and exploitive. She is also for the most part, untruthful, choosing only to remember what may enhance her position, or altering the facts about which she is testifying or intentionally not remembering. Education plays a subordinate role in the Whitehead's milieu. The judgment-making ability of Mrs. Whitehead is sorely tested. One outstanding example was her decision to run away in the face of a court order. While she claims fear of the system made her do it this court sees it, minimally, as a disregard of her legal and civic obligation to respond to a court's order, and, maximally, as a contempt of the court order. She does not concern herself with consequences of her acts. Her lack of candor makes her a poor candidate to report to the child in an age appropriate manner and time, the facts of the child's origin. She is a woman without empathy. She expresses none for her husband's problems with alcohol and her infusion of her other children into this process, exposing them rather than protecting them from the searing scrutiny of the media, mitigates against her claim for custody. She is a good mother for and to her older children. She would not be a good custodian for Baby M.\n\nThis court is satisfied by clear and convincing proof that Mr. and Mrs. Stern wanted and planned for this child. They intended to be parents of the child. They have a strong and mutually supportive relationship wherein each respects the other and there is a balancing of obligations. There is proof of a successful cooperative parenting effort. The Sterns have a private, quiet and unremarkable life which augers well for a stable household environment. Mr. and Mrs. Stern show sensitivity to the child's physical and emotional needs. They would be supportive of education and have shown, at least in their own lives, a motivation for learning. It can be concluded that they would initiate and encourage intellectual curiosity and learning for the\n\nchild. They have shown an ability to make rational judgments in the face of most trying emotional circumstances. They have obeyed the law. With the health and medical education of Mrs. Stern and the scientific training of Mr. Stern, the child's health will not be jeopardized. Mr. and Mrs. Stern have been presented as credible, sincere and truthful people. They have expressed a willingness, and a history of obtaining professional help, to address the child's unique problems. Finally, they have shown no difficulty in coping with crisis. It may be anticipated that because the child is unique and at risk, crisis for the next several years will be part of their lives. Mr. and Mrs. Stern have shown an ability to deal with such exigencies. It is for all these reasons and because of all of the facts found by this court as the trier of fact that we find by clear and convincing evidence, indeed by a measure of evidence reaching beyond reasonable doubt, that Melissa's best interests will be served by being placed in her father's sole custody.\n\nNow having found that the best interests of the child will be enhanced and served in paternal custody, that there is no evidence of fraud, overreaching or violation of any other principle of equity by Mr. Stern, this court having evaluated the equities finds them weighted in favor of Mr. Stern. Enforcing the contract will leave Mr. and Mrs. Whitehead in the same position that they were in when the contract was made. To not enforce the contract will give them the child and deprive Mr. Stern of his promised benefits. This court therefore will specifically enforce the surrogate-parenting agreement to compel delivery of the child to the father and to terminate the mother's parental rights.\n\nIn addition to specific performance another principle of equity relevant hereto is that equity regards and treats as done that which in fairness and good conscience should or ought to have been done. The maxim's basis is the existence of a duty. There is a duty because the court has found a valid and enforceable contract. As with all equitable maxims, imposition is discretionary.\n\nSpecifically enforcing the contract and/or the aforesaid maxim will automatically sever and terminate all parental rights of Mrs. Whitehead. By definition, termination of parental rights is an extraordinary judicial remedy which is to be granted only after intensive consideration of parental conduct and the needs of the child. Judicial caution in granting termination arises from the permanent and irreversible nature of the order. In re N., 96 N.J. Super. 415, (App.Div.1967). Termination involves the elimination of any legal recognition of a continuing parent-child relationship and usually, the end of any social recognition of the relationship.\n\nThe court early on in this opinion indicated that existing laws did not apply to the facts sub judice. The concept being tried here did not exist or was not considered when those statutes, be they adoption, termination of parental rights or custody, were legislated. To make a new concept fit into an old statute makes tortured law with equally tortured results.\n\nThis court has sufficient authority to accomplish a result. So long as procedural and substantive due process have been served, and that is the case here with notice to defendants, their appearance and active participation. Compare Stanley v. Illinois, 405 U.S. 645, 92 S. Ct. 1208, 31 L. Ed. 2d 551 (1972); Santosky v. Kramer, 455 U.S. 745, 102 S. Ct. 1388, 71 L. Ed. 2d 599 (1982). So long as this court may exercise its inherent equitable parens patriae jurisdiction this court may terminate parental rights. (Note that parens patriae continues to exist with a power even greater than specific statutory grants. In re Erving, 109 N.J. Eq. 294, 297 (Ch.1931)). The parens patriae power to determine the status of a child according to his or her best interests is a viable independent standard for termination of parental rights. Since it is not dependent on statutory standards such as forsaken parental obligations, this power is a potent authority to be exercised in furthering the welfare of the child. In applying this power, courts should be cognizant of the relative importance of the factors derived from behavioral\n\nstudies. These studies also demonstrate the need to develop a termination standard by emphasizing the importance of the child's psychological well-being in any best interests determination. Boskey and McCue, \"Alternative Standards for the Termination of Parental Rights,\" 9 Seton Hall L.Rev. 1 (1978). Here 11 mental health experts have testified regarding the best interests of the child. All of the foregoing criteria have been met.\n\nIt cannot be denied that under any approach to contractual interpretations, Melissa's pre-and post-natal care, home environment and general welfare were the major concerns of the agreement between the parties. One purpose of the contract was to ensure the baby's future. One cannot deny that Melissa was the intended beneficiary of the contract.\n\nIt is argued that although she was not in being at the time the contract was entered into it was created for her benefit. New Jersey case law has long held that a third-party beneficiary need not be in existence or identifiable at the time of the contracting. Ironically, the case citation is Whitehead v. Burgess, 61 N.J.L. 75, 77 (1897).\n\nThe question, in deciding if a third party has enforceable contractual rights, is whether the parties intended to confer a benefit on the third party. At the very least the contracting parties sought to bestow life and provide for the child's best interests. It is undisputed, therefore, that Melissa has standing in the matter to seek every benefit possible.\n\nPremised on the historic equitable principle of parens patriae, this court invokes the maxim of treating as done that which ought to have been done and this court, as noted above, orders specific performance of the surrogate-parenting agreement. The result of these conclusions is to terminate all parental rights that Mary Beth Whitehead has or had in the child to be known as Melissa Stern. She agreed to terminate. This court gives effect to her agreement.\n\nThe court finds that Melissa is a third-party beneficiary of the surrogate-parenting agreement and may seek her own redress.\n\nIn conclusion, some final findings and adjudications are required.\n\nOf great concern to this court was the non-appearance as a witness of Mr. Whitehead on the best interests aspect of this case. It was, therefore, not possible to make inquiry of him about his parenting views, the disabilities testified to about him by others and fundamentally, would he be a viable, concerned, providing and supportive step-father for this child with such special needs. It is a family that this court must address. His absence unexplained -- although available, deprived the court of testing the entire Whitehead family equation on the issue of the best interests of the child. So too from the failure of any sibling of either defendant to appear and testify in their own behalf. The court can only draw the most adverse of conclusions from their non-appearance.\n\nThe application of the maternal grandparents for visitation is next addressed.\n\nWhen Melissa was born on March 27, 1986, there were no, attendant to the circumstances of her birth, family gatherings, family celebrations or family worship services that usually accompany such a happy family event. The facts found by this court (supra) tell quite a different story.\n\nIn reality, the fact of family was undefined if non-existent. The mother and father are known but they are not family. The interposition of their spouses will not serve to create family without further court intervention. There were no paternal grandparents. The maternal grandparents were over a thousand miles away somewhat aware of their daughter's pregnancy but not expecting to see the new baby.\n\nThese same maternal grandparents, now parties to this suit seek visitation with their daughter's child.\n\nTwo issues are presented: 1) what application shall be made of N.J.S.A. 9:2-7.1 which provides for grandparental visitation and 2) whether this court, exercising its inherent equity jurisdiction, can order the requested visitation as being within the child's best interests.\n\nJoseph Messer is a 67-year-old retired school teacher in apparent good health. He holds a bachelor of science in business administration degree from Seton Hall University and a master of science in school administration degree from Rutgers University. Throughout most of his married life he held a part-time job in a bank. His primary vocation was teaching seventh and eighth grades in New Jersey public schools. He has been married to his wife Catherine for 44 years. Upon retirement in 1983, he and his wife moved to Holiday, Florida. They have eight children who have given them 15 grandchildren, including Melissa.\n\nWhen told by his daughter, Mrs. Whitehead, of her surrogate pregnancy, he believed she was carrying the fertilized embryo of another couple. He approved of this act by his daughter. Mrs. Whitehead told her father of her surrogacy in 1985 when she became pregnant. Mrs. Whitehead told her father she would be paid for her services in carrying the child. She told him that the baby would be given away at birth. She never told him she was carrying her own fertilized egg. She never disabused him of his belief as to the surrogacy or the nature of her pregnancy. When he learned of her pregnancy and later of Melissa's birth, Mr. Messer testified that he never, on either occasion, expected to see the child.\n\nCatherine Messer is 65 years of age. For all of her married life, she has worked as a mother and housekeeper. For many of those years, she also worked as a woman's hairdresser. When told of her daughter's surrogate efforts and ultimate pregnancy, Mrs. Messer testified that she believed her daughter to be old enough to know what she was doing. It appears Mrs. Messer was not fully informed by her daughter since she\n\ntestified to never having been told that Mrs. Whitehead had agreed to give up the child for adoption by Mr. Stern's wife.\n\nThis court finds these two people to be the genealogical maternal grandparents of Melissa who, at first view, seem to have been somewhat casual and aloof about their daughter's extraordinary agreement. Their emphasis seems to have changed with the advent of this litigation.\n\nAs grandparents, does N.J.S.A. 9:2-7.1 automatically allow for their visitation? The answer is no.\n\nN.J.S.A. 9:2-7.1 reads as follows:\n\nWhen either or both of the parents of a minor child, residing within this State, is or are deceased, or divorced, or living separate and apart in different habitats, regardless of the existence of a court order or agreement a grandparent or the grandparents of such child, who is or are the parents of such deceased, separated or divorced parent or parents, may apply to the Superior Court, in accordance with the Rules of Court, to have such child brought before such court; and the court may make such order or judgment, as the best interest of the child may require, for visitation rights for such grandparent or grandparents in respect to such child.\n\nPrior to its 1972 amendment, the statute provided only for the maintenance of habeas corpus proceedings by grandparents to obtain visitation with their grandchildren where either or both parents of said grandchild was deceased. The 1972 amendment signed by Governor Cahill on February 1, 1972, provided for grandparental visitation in two other circumstances in addition to parental death. One was for grandparents to visit a grandchild whose parents were divorced and the second circumstance was for grandparents to visit a grandchild whose parents were living separate and apart regardless of a court order or agreement.\n\nThis statute, while creating a right of grandparental visitation and indeed an independent -- not derivative -- right of visitation (see DYFS v. Torres, 185 N.J. Super. 234 (Cty.Ct.1980)) nevertheless, does not apply to the fact situation sub judice.\n\nThe statute is for the benefit of grandparents whose child's family is disintegrating or in dysfunction. It provides grandparents\n\nwith a right to their continued contact with a grandchild with whom important relationships have been or may be developed notwithstanding the problems in the grandchild's family. The grandchild's family must be divorced. The grandchild's family must be separating or living apart. Here, no such facts exist. Mrs. Whitehead and Mr. Stern were never a family unit. Thus, they could not separate or divorce or obtain a court order to do so. Counsel for the Messers would have a narrow and literal meaning applied to the words of the subject law. He cites the phrase \"living separate and apart\" to qualify his clients. After all, he says the Sterns and Whiteheads are living separate and apart. The fact is -- Melissa's parents have never lived together; thus, they could not separate and live apart in the sense intended by the Legislature. Indeed, at the time of the law's adoption, surrogate parenting, let alone surrogate grandparents, was unknown to society. Hence, it cannot be said that surrogate grandparental visitation was even contemplated by the Legislature in adopting this law and the Governor of New Jersey in signing it.\n\nCounsel for Mr. and Mrs. Messer further relies on Mimkon v. Ford, 66 N.J. 426 (1975). Justice Morris Pashman in a majority opinion wrote eloquently and with a poet's pen of the very special relationship between a grandparent and grandchild.\n\nIt is biological fact that grandparents are bound to their grandchildren by the unbreakable links of heredity. It is common human experience that the concern and interest grandparents take in the welfare of their grandchildren far exceeds anything explicable in purely biological terms. A very special relationship often arises and continues between grandparents and grandchildren. The tensions and conflicts which commonly mar relations between parents and children are often absent between those very same parents and their grandchildren. Visits with a grandparent are often a precious part of a child's experience and there are benefits which devolve upon the grandchild from the relationship with his grandparents which he cannot derive from any other relationship. Neither the Legislature nor this Court is blind to human truths which grandparents and grandchildren have always known. [at 437]\n\nHe also wrote that the apparent absolute right of grandparental visitation must be tempered as the statute allows by court orders made in the best interests of the child. Id. at 438. He\n\nnoted that at common law a grandparent had no right of visitation. Access to a grandchild was derivative through the grandparent's child. With this statute, for the first time in New Jersey, an independent cause of action was afforded grandparents who were being barred from access to their grandchildren. It is axiomatic that statutes in derogation of the common law must be strictly construed. Accordingly, for the reasons noted above, this court holds that N.J.S.A. 9:2-7.1 is not applicable to the request by Mr. and Mrs. Messer for grandparental visitation.\n\nThe other basis upon which to found an order of grandparental visitation is this court's inherent equity jurisdiction. Here now is another example of the application by the court of its historic chancery authority. There is no statutory remedy and counsel for the grandparents argues that fairness and equity demand that his clients obtain their sought relief. In the absence of statute, there is no doubt but that this court with its parens patriae authority could grant the requested relief if it is in the best interests of Melissa to do so.\n\nIt is necessary at all times, in using any measure for Melissa, to note with emphasis and concern that she is a special child -- at risk -- because of her origin and the extraordinary publicity attendant to the trial of this case. Melissa will need protection at all times whether it be from inappropriate or inadvertent remarks made by family, friends or strangers or from an intrusion into her privacy. This protection will require a superior sense of responsibility and obligation. It requires placing the welfare of the child paramount to one's self or one's children. Do the Messers measure up to such stringent standards? The only measure available is what they have told this court in their testimony. Mr. Messer tells us he recognizes he is the grandfather -- not a parent. He would abide the custodial parents' wishes. He says visitation would afford Melissa his background, experience and his grandparental nurturing. He testifies that he will not violate any court order. He has\n\nspoken all the correct words. This court must balance the testimony against his actions. Mr. Messer would have this court believe that in the 45-minute drive from the airport in Tampa, Florida, to his home in Holiday, Florida, that there was only very limited conversation about the traumatic incidents of the previous day when his daughter was confronted with arrest because an infant child was surreptiously passed out of a house window and spirited by night from house-to-house by his son-in-law so as to avoid police detection and ultimately flight from New Jersey for the same reason. He would have this court believe only several sentences were spoken about this scene. He would have us believe that, even to the day of his courtroom testimony, he never saw this court's original restraining order and the attached certification of Mr. Stern. Then, how, it must be asked, does he write a letter to this court shortly after the Whitehead elopement addressing in detail five specific allegations contained in those original pleadings. While he says he was told of the documents' contents, he cannot recall by whom or where he was told. Mr. Messer was selective in his recall of Richard Whitehead's return to New Jersey and subsequent return trip to Florida. And even though his daughter never told him she did not want to be found by law enforcement authorities, he believed that to be the fact gleaned from the way they were moving about from place-to-place in Florida. Mr. Messer saw no harm in telling Mr. Stern where Melissa was, indeed, he believed it necessary to contact Mr. Stern to do so, but he never did. He never did and he failed to compel his daughter or his wife to do so.\n\nMrs. Messer would have the court believe that she, too, has never seen this court's original order with Mr. Stern's certification. She also acknowledges being told of its content but cannot recall by whom. Mrs. Messer does not even recall the conversation in the car on May 6, 1986, while driving from the airport to home. She does not recall if telephone calls were made to, or received from, New Jersey. She made no inquiry of her daughter and son-in-law as to where they were going in\n\nFlorida. She testifies to not wanting to know. She testifies to not asking where the Whiteheads were when they called every two or three days during their hegira. Mrs. Messer acknowledges that the Whiteheads left her home out of fear that the police would appear. It was Mrs. Messer who, by her call to the local press, was initially instrumental in generating publicity about an issue which this court ordered sealed for the child's best interests.\n\nBoth Mr. and Mrs. Messer have exhibited something less than candor in their testimony to the court. Furthermore, by doing nothing, by seeing nothing, by seeking to know nothing about their daughter's activities with the child, they became participants in efforts to thwart this court's orders and by their acts or failure to act, they have proven themselves unworthy of the benefit and relief they seek from this court.\n\nIn this court's view, people who claim their rights under the law or pursuant to the law must also serve the law as any abiding citizen would. The Messers had to know of their daughter's involvement with the law. They chose to do nothing to help the law, but if they had they could only have helped their daughter.\n\nIn this court's view, they have failed to exhibit minimum requisite responsibility for Melissa's welfare and best interests. They do not deserve this court's confidence that they will be concerned in the future. It is clear that when tested they supported their daughter without consideration for others, even the subject child that they now seek to visit. They disregarded their obligations under the law of our society. One does not go into hiding when confronted by a problem with the law. One properly lets the problem be examined and tested by the light of truth in a court proceeding. The Messers cannot be relied upon to do this. They cannot be relied upon to abide by court orders.\n\nFurthermore, in view of this court's enforcing the surrogate-parenting agreement and terminating the parental rights of\n\nMrs. Whitehead, to allow grandparental visitation would be divisive of parental authority. It could place Melissa at greater risk than now exists.\n\nAccordingly, for the facts found and reasons stated herein, this court denies grandparental visitation as being contrary to Melissa's best interests.\n\nThis court enters judgment in favor of plaintiffs as follows:\n\n1) The surrogate parenting agreement of February 6, 1985, will be specifically enforced.\n\n2) The prior order of the court giving temporary custody to Mr. Stern is herewith made permanent. Prior orders of visitation are vacated.\n\n3) The parental rights of defendant Mary Beth Whitehead are terminated.\n\n4) Mr. Stern is formally adjudged the father of Melissa Stern.\n\n5) The New Jersey Department of Health, Bureau of Vital Statistics and its ancillary and/or subordinate state or county agencies are directed to amend all records of birth to reflect the paternity and name of the child to be Melissa Stern.\n\n6) Defendants, Mary Beth Whitehead, Richard Whitehead, Joseph Messer and Catherine Messer, their relatives, friends, agents, servants, employees or any person acting for and/or on their behalf are restrained from interfering with the parental and custodial rights of plaintiff, his wife or their agents, servants, employees or any other persons acting for and/or on their behalf.\n\n7) As heretofore ordered unpleaded claims for money damages are reserved to plaintiffs.\n\n8) Counsel for plaintiffs will submit a certification of services pursuant to R. 4:42-9 in support of their application for counsel fees.\n\n9) The court will enter judgment against defendants on all prayers for relief in the first and second counts of their counterclaim.\n\n10) The guardian ad litem shall file a certification of services pursuant to R 4:42-9 to support her application for fees. She shall also submit to the court the statements of fees from her experts for allocation by the court.\n\n11) The sum of $10,000, being held by the Clerk of the Superior Court, shall be the property of Mary Beth Whitehead.\n\n12) The guardian ad litem shall be discharged herewith except for the purposes of appeal.\n\nAnd finally, all should listen again to the plea of the infant as voiced so poignantly by several of the professional witnesses, statements with which this court agrees to such an extent that it will use its total authority if required to accomplish these ends.\n\nIt was said Melissa needs an end to litigation, she needs to have her parentage fixed, she needs protection from anyone who would threaten her, protection from manipulation and a strong support system to protect her privacy.\n\nIt was also said it is not in Melissa's best interests to have such public attention and scrutiny of her life. Common sense and common decency require that what Melissa must learn, she must learn in a very private manner.\n\nMelissa needs stability and peace, so that she can be nurtured in a loving environment free from chaos and sheltered from the public eye.\n\nThis court says that Melissa deserves nothing less -- stability and peace.\n\nJUDGMENT\n\nThis action coming on to be heard on the 31st day of March, 1987, before the Hon. Harvey R. Sorkow, J.S.C., Presiding Judge Family Part, and in the presence of Skoloff and Wolfe,\n\nEsqs., (Gary N. Skoloff, Esq., attorney for the plaintiffs Stern); Cassidy, Despo, Foss \u0026 SanFilippo, Esqs., (Harold J. Cassidy, Esq., attorney for the defendants Whitehead); Lorraine A. Abraham, Esq., Guardian ad Litem; and Hellring, Lindeman, Goldstein, Siegal \u0026 Stern, Esqs. (Joel S. Siegal, Esq. attorney for plaintiffs/intervenor Messer) upon complaint and proofs being taken in open Court and the Court having heard and considered the proofs in this action and the argument of counsel;\n\nIt is on this 31 day of MARCH, 1987, by the Superior Court of New Jersey, Chancery Division, Family Part, Bergen County, ORDERED and ADJUDGED that a Judgment shall be entered in accordance with the Findings and Directions contained in the Opinion of the Court which is attached herewith and made a part hereof and incorporated as if set forth at length herein. Defendants' application for a stay of this judgment is denied.\n\n\u003cspan class=\"fn\"\u003e1. Both Sterns hold Ph.D. degrees. In addition, Mrs. Stern has an M.D. degree. They are both properly called Doctor. However, for clarity, they will be referred to as Mr. Stern and Mrs. Stern.\u003c/span\u003e\n\n",
    "body_length": 180682,
    "citedas": [
      "525 A.2d 1128",
      "217 N.J.Super. 313"
    ],
    "attorneys": "Gary N. Skoloff, Francis W. Donahue and Edward J. O'Donnell for plaintiffs Stern (Skoloff \u0026 Wolfe, attorneys). Harold J. Cassidy, Robert W. Ruggieri and Randolph H. Wolf for defendants Whitehead (Cassidy, Despo, Foss \u0026 San Filippo, attorneys). Lorraine A. Abraham, guardian ad litem. Joel D. Siegal for plaintiffs \u0026 intervenor Messer (Hellring, Lindeman, Goldstein, Siegal \u0026 Stern, attorneys).",
    "category": [],
    "judges": "Sorkow, P.J.F.P.",
    "citation_count": 5
  }
}
