{
  "id": "eLToTGYBTlTomsSBJzJD",
  "document": {
    "title": "01/19/88 PEOPLE STATE MICHIGAN v. MARK ANTHONY",
    "full_title": "PEOPLE OF THE STATE OF MICHIGAN v. MARK ANTHONY ALLEN ; PEOPLE OF THE STATE OF MICHIGAN V. JAMES BROOKS ; PEOPLE OF THE STATE OF MICHIGAN V. DENNIS LEE GRAY ; PEOPLE OF THE STATE OF MICHIGAN V. JACKIE HAGAN SMITH ; PEOPLE OF THE STATE OF MICHIGAN V. JEFFREY ALLEN PEDRIN",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1988-01-19T00:00:00.000Z",
    "docket": "Docket Nos. 70740, 71633, 72346, 72753, 73297",
    "body": "These cases were consolidated in order to resolve differing interpretations of the application of MRE 609(a) to the practice of impeaching criminal defendants by prior conviction.\n\nWe find that MRE 609(a), as presently constituted, leads to an interpretation that encourages the use of \"bad man\" evidence without a commensurate gain in the evaluation of a witness' testimony. More specifically, the central element in the exercise of discretion in this area, i.e., the extent to which the prior conviction is probative of credibility, has been greatly de-emphasized. The lower courts have focused instead on other issues such as the need for credibility evidence. The resulting difficulty in interpreting this important rule of evidence more often acts to the detriment of the defendant's right to testify than to the service of the jury's ability to evaluate a witness' credibility.\n\nThe approach of the Dissenting opinions, in our view, does not clarify the present confusion and, in one respect, adds a standard that creates an irreconcilable conflict in the application of MRE 609.\n\nIn order to resolve the cases before us, we therefore set forth a more specific procedure for the exercise of discretion under the present MRE 609(a) which we think more fully comports with its original intent. We also take this opportunity to promulgate an amendment to MRE 609(a) which will apply to all cases tried after March 1, 1988. (See appendix A.) It provides for bright-line rules that recognize and exclude certain prior convictions which are inherently more prejudicial than probative and allows admission of those convictions which are inherently more probative than prejudicial. For those crimes that fall in between, because their relationship to credibility is less clear, the amendment adopts the same standard for the exercise of judicial discretion as is set forth herein for the resolution of these cases and for cases yet to be resolved under MRE 609(a) prior to its amendment.\n\nI\n\nThe facts of these cases are succinctly set forth in the opinion of Chief Justice Riley.\n\nII\n\nThe use of prior convictions to impeach a witness-accused has long been controversial. This controversy is apparent in the debates surrounding the adoption of Michigan Rule of Evidence 609, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e as well as the relevant federal rule. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The question has been the source of more scholarly commentaries than can be cited here. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e What underlies this controversy is the clash between the fundamental principle defined in MRE 404 that character evidence (including prior conviction evidence) may not be admitted to prove that a defendant acted in conformity therewith and the practice of permitting the admission of prior conviction evidence as contained in MRE 609 for purposes of impeaching a witness-accused's credibility when he testifies in his own behalf. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nA\n\nThere can be little doubt that an individual with a substantial criminal history is more likely to have committed a crime than is an individual free of past criminal activity. Nevertheless, in our system of jurisprudence, we try cases, rather than persons, and thus a jury may look only to the evidence of the events in question, not defendant's prior acts in reaching its verdict. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See United States v Mitchell, 2 U.S. (2 Dall) 348, 357; 1 L Ed 410 (1795). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nHowever, when a defendant testifies, he takes on a second role, that of a witness. And the question of the reliability of a witness' testimony, though a collateral issue, may play an important role in a jury's decision. We therefore permit the introduction of evidence to prove that a witness is not worthy of belief. For example, the witness' ability to perceive or understand events may be questioned. (MRE 601.) Similarly, the witness' testimony may be disallowed if he has no personal knowledge of the events about which he testifies. (MRE 602.) In addition, the witness' reputation for dishonesty may be introduced or specific instances of conduct demonstrating a lack of veracity elicited on cross-examination. (MRE 608.) These methods of impeachment may be used against all witnesses, and their use against a witness-accused has not been challenged. However, when a defendant takes on the role of witness, the rule permitting impeachment of witnesses by prior conviction presents a special problem, i.e., the danger that evidence admitted to impeach the defendant-as-witness will be used by the jury in evaluating defendant-as-defendant. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nA jury should not be allowed to consider the defendant's guilt of the crime before it on the basis of evidence of his propensity for crime. Finding a person guilty of a crime is not a pleasant or easy assignment for a representative group of twelve people. It is much easier to conclude that a person is bad than that he did something bad. Hence the appetite for more knowledge of the defendant's background and the slippery slope toward general \"bad man\" evidence. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThis appetite presents three types of impropriety. First, that jurors may determine that although defendant's guilt in the case before them is in doubt, he is a bad man and should therefore be punished. Second, the character evidence may lead the jury to lower the burden of proof against the defendant, since, even if the guilty verdict is incorrect, no \"innocent\" man will be forced to endure punishment. Third, the jury may determine that on the basis of his prior actions, the defendant has a propensity to commit crimes, and therefore he probably is guilty of the crime with which he is charged. Beaver \u0026 Marques, A proposal to modify the rule on criminal conviction impeachment, 58 Temple L Q 585, 592-593 (1985). All three of these dimensions suggest a likelihood that innocent persons may be convicted.\n\nThe danger then is that a jury will misuse prior conviction evidence by focusing on the defendant's general bad character, rather than solely on his character for truthtelling.\n\nB\n\nJudge Weinstein has described the basis for MRE 609 admissions as follows:\n\nThe theory that all convictions are relevant to credibility depends on a two-fold assumption: (1) that a person with a criminal past has a bad general character and (2) that a person with a bad general character is the sort of person who would disregard the obligation to testify truthfully. [3 Weinstein, Evidence, para. 609[02] at 609-59. Emphasis added.]\n\nSimilarly, Judge Holmes stated in Gertz v Fitchburg R Co, 137 Mass 77, 78 (1884), that\n\nwhen it is proved that a witness has been convicted of a crime, the only ground for disbelieving him which such proof affords is the general readiness to do evil which the conviction may be supposed to show. It is from that general Disposition alone that the jury is asked to infer a readiness to lie in the particular case, and thence that he has lied in fact. The evidence has no tendency to prove that he was mistaken, but only that he has perjured himself, and it reaches that Conclusion solely through the general proposition that he is of bad character and unworthy of credit.\n\nThe same analysis was offered in the Advisory Committee notes to the first draft of federal rule 609 which permitted impeachment by all prior felony convictions:\n\nA demonstrated instance of willingness to engage in conduct in disregard of accepted patterns is translatable into willingness to give false testimony. [46 FRD 161, 297.]\n\nThus, jurors are not directly informed through impeachment evidence, with the exceptions described above, that a witness may not be truthful. That understanding is derived indirectly through the mediation of the belief that the witness has a \"general readiness to do evil.\" Gertz, supra, p 78. In other words, for example, the commission of an assault does not involve the telling of a lie.\n\nThe Dissent's reference to the diagnostic criteria of the antisocial personality disorder described in the Diagnostic and Statistical Manual of Mental Disorders (3d ed) (DSM III R), (Washington, DC: American Psychiatric Association, 1987), further demonstrates this phenomenon. While the manual does not indicate that violent behavior is an example of a lack of veracity, it explains instead that the presence of a certain set of behaviors categorize an individual as antisocial, and that an antisocial person often is a liar, e.g., that an assaultive individual is a bad person or of bad general character and that such people have a tendency to lie. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nMost crimes can, therefore, be seen as evidence of a lack of veracity only when mediated through the belief that the individual has a bad general character. This results in both a low probative value and a strong potential for prejudice, as it will be difficult for jurors to put out of their minds the very step which allowed them to reach their Conclusion as to veracity. On the other hand, crimes having an element of dishonesty or false statement are directly probative of a witness' truthfulness and at the same time present little possibility for prejudice since they can be understood as such, absent the mediation of the Conclusion that the witness-accused is of bad general character.\n\nIn spite of the likelihood of prejudice, it can be argued, and indeed the Dissent does so eloquently, that a limiting instruction will suffice. As the United States Supreme Court stated in Delli Paoli v United States, 352 U.S. 232, 242; 77 S Ct 294; 1 L Ed 2d 278 (1957):\n\nUnless we proceed on the basis that the jury will follow the court's instructions where those instructions are clear and the circumstances are such that the jury can reasonably be expected to follow them, the jury system makes little sense.\n\nHowever, as the United States Supreme Court later stated in Bruton v United States, 391 U.S. 123, 135; 88 S Ct 1620; 20 L Ed 2d 476 (1968), when overturning the holding in Delli Paoli :\n\nare some contexts in which the risk that the jury will not, or cannot, follow instructions is so great, and the consequences of failure so vital to the defendant, that the practical and human limitations of the jury system cannot be ignored. Compare Hopt v Utah, [120 U.S. 430, 438; 7 S Ct 614; 30 L Ed 708 (1887)]; Throckmorton v Holt, 180 U.S. 552, 567[; 21 S Ct 474; 45 L Ed 663 (1901)]; Mora v United States, 190 F2d 749 [CA 5, 1951]; Holt v United States, 94 F2d 90 [CA 10, 1937]. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWe believe that we are now presented with such an exceptional circumstance. Limiting instructions are generally employed where more than one fact may be derived from a given piece of evidence, but not all are permissible considerations. This is not always easy for a jury to do, but we must sometimes rely on limiting instructions if our system is to function. However, as explained above, in the case of most prior conviction evidence the permissible consideration can only be understood by first recognizing the impermissible consideration. Where the two factors are so inextricably linked, we do not believe that a jury can be reasonably expected to follow the instruction.\n\nWe do not believe, however, that jurors are by any means deficient because they are unable to ignore general character evidence. To look to such evidence is natural, and many \"experts\" have done the same.\n\nOur own Court of Appeals has at times been unable to resist doing so, and, indeed, it is sliding further along the slope to complete elimination of MRE 404 protection. In People v Jones, 98 Mich App 421, 428-429; 296 NW2d 268 (1980), the Court opined:\n\nthe probative value of a conviction, or series of convictions, is increased, proportionally or greater, on the issue of credibility because of similarity [to the present charge].\n\nis more probable that a person has committed a crime if he has done it before, maybe several times. . . . When it comes to whom to believe, it should not benefit the defendant that he is a repeater, perhaps specializing in this kind of crime, or that his record is so bad that it will weigh heavily against him. After all, he committed the previous crimes and they tell a great deal about him and about whether he is lying now. [Emphasis added.]\n\nA similar view of prior conviction evidence was expressed by Congressman Hogan in his Dissent to the House Judiciary Committee's version of the rule which would have allowed impeachment only by crimes involving dishonesty or false statement. He argued that \"it would be misleading to permit the accused to appear as a witness of blameless life on those occasions when the accused chooses to take the stand.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe notion that a limiting instruction can prevent misuse of prior conviction evidence is simply mistaken, as it asks the jury to do what it cannot. This view is supported by a number of empirical studies. A Canadian study concluded that\n\npresent research leaves little doubt that knowledge of a previous conviction biases a case against the defendant. The likelihood that a jury will convict the defendant is significantly higher if the defendant's record is made known to the jury. The fact that the defendant has a record permeates the entire Discussion of the case, and appears to affect the juror's perception and interpretation of the evidence in the case.\n\nPerhaps most disturbing was the study's Conclusion that\n\njurors used [prior conviction evidence] only minimally in considering the issue of credibility. [ Id. at 247.]\n\nThus, the intended use of the evidence was of little actual importance.\n\nAnother study observed that the notion of a successful limiting instruction, with respect to character evidence, runs counter to the basic evaluative mechanisms discussed above.\n\nThe assumption that people can differentiate the use of information goes directly against what is known as the \"halo\" effect: the phenomenon by which a person will infer positive characteristics about a person where favourable information has been received and will infer negative characteristics about someone where unfavourable information has been received. As Rosenberg and Olshan (1970) [citing Rosenberg \u0026 Olshan, Evaluative and descriptive aspects in personality perception, J of Personality and Soc Psyc, 16, 619-626 (1970)] have pointed out, \"Studies using [the technique by which a subject is asked to infer characteristics about an individual on the basis of information about other characteristics] . . . have consistently shown that subjects infer favourable traits from one or more favourable stimulus traits and infer unfavourable traits from unfavourable stimulus traits\" (p 619). Thus, if a person is told one negative thing about another person, he is going to assume other negative things. With respect to s. 12 of the Canada Evidence Act, it follows that we would expect that if a juror hears that an accused has one unfavourable characteristic (e.g., that he has a criminal record) he will then think of that accused as a generally bad person. If this same juror is then asked to Judge the guilt of the accused, he will be likely to infer that the accused is guilty of the crime in question. [Doob \u0026 Kirshenbaum, Some empirical evidence on the effect of s. 12 of the Canada Evidence Act upon an accused, 15 Crim L Q 88, 89-90 (1972-1973).]\n\nOne of the researchers in the University of Chicago report leading to publication of The American Jury stated that the jury examinations revealed\n\n\"almost universal inability and/or unwillingness either to understand or follow the court's instruction on the use of defendant's prior criminal record for impeachment purposes. The jurors almost universally used defendant's record to conclude that he was a bad man and hence was more likely than not guilty of the crime for which he was then standing trial.\"\n\nLetter from Dale W. Broeder, Associate Professor, the University of Nebraska College of Law, who conducted intensive jury interviews, to Yale Law Journal, dated March 14, 1960, on file in Yale Law Library. [Note, Other crimes evidence at trial: Of balancing and other matters, 70 Yale L J 763, 777, n 89 (1961).]\n\nIn a far less scientific study, the Columbia Journal of Law and Social Problems conducted a random national survey of trial Judges and criminal defense attorneys. When asked whether they believed jurors were able to follow limiting instructions concerning the use of prior conviction evidence, ninety-eight percent of the responding attorneys answered negatively, and, even more disturbingly, forty-three percent of the responding Judges agreed. Note, To take the stand or not to take the stand: The dilemma of the defendant with a criminal record, 4 Colum J of Law \u0026 Social Problems 215, 218 (1968).\n\nThe most recent study of this problem concluded that mock jurors used prior conviction evidence to \"help them Judge the likelihood that the defendant committed the crime charged\" in spite of limiting instructions. Wissler \u0026 Saks, On the inefficacy of limiting instructions: When jurors use prior conviction evidence to decide on guilt, 9 Law \u0026 Human Behavior 37, 44 (1985). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Most telling was the fact that a higher conviction rate was found where, all else being the same, the impeaching crime was murder than where the impeaching crime was perjury. Id. at 43. The only explanation for this last result is that the prior conviction evidence was not used exclusively to evaluate credibility. This is emphasized by the fact that the researchers found that there was no significant difference between the mock jurors' ratings of defendant's credibility when a prior conviction was introduced and when one was not. Id. at 41. They concluded that \" credibility ratings of defendant did not vary as a function of prior conviction,\" while \" rates [did vary] as a function of prior conviction. . . .\" Id.\n\nIn State v McAboy, 160 W Va 497; 236 SE2d 431 (1977), the Supreme Court of West Virginia barred impeachment of a defendant's credibility by prior conviction except where the prior convictions were for perjury or false swearing as \" of these crimes goes directly to the credibility of the defendant and . . . their relevancy has a priority over their prejudicial effect.\" Id. at 508. Responding to the argument that we must rely on jurors' ability to distinguish between impeachment of a defendant's credibility as a witness and impeachment of his character in general, the court stated:\n\nWe are not unaware of the contention that such a rationale is pure sophistry and that the State, under the guise of testing credibility, relies upon the hope that the jury, in spite of being instructed by the court as to the purpose for which the evidence is admissible, will nonetheless consider the revelation of other convictions as indicating guilt in the case being tried. [ Id. at 502 (quoting State v McGee, 160 W Va 1, 9; 230 SE2d 832 (1976).]\n\nThe McAboy court also pointed out that most prior convictions were of dubious relevancy to credibility, stating that the relevancy proposition \"is based on the premise that all persons convicted of a crime are disposed not to tell the truth. . . .\" Id. at 504. The court footnoted a hypothetical situation which bears repeating:\n\nThe ultimate paradox of the relevancy premise can be illustrated by altering slightly the example given in Bentham, Rationale of Judicial Evidence (Bowring's ed. 1827), and quoted in 2 Wigmore, Evidence, § 519 at 610 (3rd ed, 1940). It concerns a man so proud of his truthfulness that he challenges a person who called him a liar to a duel. He wins the duel but is subsequently convicted of murder. Several years later, after release from prison, he is indicted on another crime. If he elects to testify, he knows that his propensity to lie will be evidenced by his prior conviction. [ Id. at 504, n 6.]\n\nEven if relevancy was assumed, the court continued, the chilling effect on defendant's right to testify is overarching. In addition,\n\nthe presumption of innocence is impaired in the eyes of the jury, which conceives that his failure to testify, notwithstanding instructions to the contrary, is an indication of guilt. [ Id. at 505.]\n\nIn light of the overwhelming tendency for jurors, and even trial and appellate Judges to misuse prior conviction evidence, it is our view that there is an \"overwhelming probability\" that most prior conviction evidence introduced for the purpose of impeachment will be considered as if it had been introduced to show that the defendant acted in conformity with his criminal past. See Richardson v Marsh, 481 U.S. ; 107 S Ct 1702; 95 L Ed 2d 176 (1987).\n\nThe Dissenters criticize us for making behavioral judgments and relying on studies in reaching this determination. They critique at length the Conclusions and methodologies of the studies we have cited. We do not agree with their Conclusions, but welcome their critique of these materials as social science experiments cannot serve as the primary basis for judicial decision. Many fundamental principles of our jurisprudence are based on assumptions of human behavior that have never been, and in most cases cannot be, scientifically tested. We also note that the rule we modify today, and that the Dissent urges us to leave as is, was the result of assumptions about jury behavior and the effectiveness of limiting instructions that were accompanied by relatively little analysis or study.\n\nThe studies cited are nevertheless relevant, support our view, and deserve consideration. In citing them, however, we do not suggest that the amendment of MRE 609 is based solely upon them. The rule change is instead based upon the underlying principles of our legal system and our perception that these principles are not served by the scope of prior-conviction impeachment which is presently permitted.\n\nSome of the most cherished and well-accepted of these principles have been defined by jurists who were willing to state the obvious. The obvious in this area is that criminal defendants are prejudiced by prior conviction evidence as presently allowed and that leaving the question to trial Judges has not been successful. As the cases on abeyance (see appendix B) demonstrate, the appellate burden resulting from the present scope of discretion is great; defendants are often impeached with crimes similar or identical to the ones with which they are charged, and in many cases these defendants choose not to testify rather than risk impeachment. Further, in most cases, the standard of appellate review prevents correction of error, and, in those cases where the error amounts to an abuse of discretion, the time and expense of a new trial is required.\n\nWe, therefore, in the words of the Dissent, act not on the basis of studies, but on the \"commonsense premise\" (post, p 678) that some prior convictions are more probative than others, that some are inherently more prejudicial, and that it is absurd to suggest that jurors will be able to avoid improper consideration of a defendant's criminal character once it has become known to them. As will be explored in the following section, we are not alone in these Conclusions.\n\nIII\n\nThe foregoing Discussion indicates that prior conviction impeachment of a witness-accused presents significant difficulties. Juries will often misuse this evidence and a limiting instruction is of dubious benefit. The amendment of MRE 609 which we adopt today creates a framework which responds to the realities just described and also takes into account the case law defining the purpose and practice of MRE 609 as well as that of the comparable federal rule. A brief overview of both standards will be helpful in determining which types of prior convictions should be excluded from evidence, which types should be included, and what factors should be employed in the exercise of trial court discretion in this area.\n\nA\n\nThe traditional rule in the federal courts permitted impeachment of witnesses by prior felony convictions or by any convictions involving dishonesty (crimen falsi). This rule underwent its first major change in 1965 in the District of Columbia Circuit case Luck v United States, 121 U.S. App DC 151; 348 F2d 763 (1965). In that case, the District of Columbia Circuit Court held that evidence of a conviction could not automatically be introduced to impeach a witness-accused. The relevant provision of the District of Columbia Code read in pertinent part:\n\nNo person shall be incompetent to testify, in either civil or criminal proceedings, by reason of his having been convicted of crime, but such fact may be given in evidence to affect his credit as a witness, either upon the cross-examination of the witness or by evidence aliunde; and the party cross-examining him shall not be concluded by his answers as to such matters. [DC Code Ann, § 14-305 (1961) (amended 1973). Emphasis added.]\n\nThe court held that the word \"may\" provided discretion not only to the prosecutor, but also to the trial court to exclude such evidence\n\nwhere the trial Judge believes the prejudicial effect of impeachment far outweighs the probative relevance of the prior conviction to the issue of credibility. [121 U.S. App DC 156.]\n\nIn order to assist trial court Judges, the circuit court defined a nonexhaustive list of factors relevant to this exercise of discretion:\n\nthe nature of the prior crimes, the length of the criminal record, the age and circumstances of the defendant, and, above all, the extent to which it is more important to the search for truth in a particular case for the jury to hear the defendant's story than to know of a prior conviction. [ Id. at 157.]\n\nTwo years later, the District of Columbia Circuit Court further explored this issue in Gordon v United States, 127 U.S. App DC 343; 383 F2d 936 (1967), with Judge Warren Burger writing for the court. First, the court held that the burden of persuasion in such a matter is on the accused. Second, Judge Burger expanded upon the passage found in Luck, quoted above, describing the relevant factors:\n\nIn common human experience acts of deceit, fraud, cheating, or stealing, for example, are universally regarded as conduct which reflects adversely on a man's honesty and integrity. Acts of violence on the other hand, which may result from a short temper, a combative nature, extreme provocation, or other causes, generally have little or no direct bearing on honesty and veracity. A \"rule of thumb\" thus should be that convictions which rest on dishonest conduct relate to credibility whereas those of violent or assaultive crimes generally do not; traffic violations, however serious, are in the same category. The nearness or remoteness of the prior conviction is also a factor of no small importance. Even one involving fraud or stealing, for example, if it occurred long before and has been followed by a legally blameless life, should generally be excluded on the ground of remoteness.\n\nA special and even more difficult problem arises when the prior conviction is for the same or substantially the same conduct for which the accused is on trial. Where multiple convictions of various kinds can be shown, strong reasons arise for excluding those which are for the same crime because of the inevitable pressure on lay jurors to believe that \"if he did it before he probably did so this time.\" As a general guide, those convictions which are for the same crime should be admitted sparingly; one solution might well be that discretion be exercised to limit the impeachment by way of a similar crime to a single conviction and then only when the circumstances indicate strong reasons for disclosure, and where the conviction directly relates to veracity.\n\nOf course, there are many other factors that may be relevant in deciding whether or not to exclude prior convictions in a particular case. See Luck, supra at 157, 348 F2d at 769. One important consideration is what the effect will be if the defendant does not testify out of fear of being prejudiced because of impeachment by prior convictions. Even though a Judge might find that the prior convictions are relevant to credibility and the risk of prejudice to the defendant does not warrant their exclusion, he may nevertheless conclude that it is more important that the jury have the benefit of the defendant's version of the case than to have the defendant remain silent out of fear of impeachment. [127 U.S. App DC 347-348.]\n\nThe Gordon factors enumerated above thus include: the vintage of the relevant conviction, the need for defendant's testimony, the similarity to the crime charged, and the nature of the prior offenses, with assaultive crimes and traffic violations being presumptively inadmissible and acts involving crimen falsi (including stealing) presumptively admissible. While not specifically enumerated as a factor in the balance, the Gordon court also stated that the defendant's prior record had been received into evidence \"because the case had narrowed to the credibility of two persons -- the accused and his accuser -- and in those circumstances there was greater, not less, compelling reason for exploring all avenues which would shed light on which of the two witnesses was to be believed.\" Id. at 348. This statement would later prove to be a cause of confusion and contradiction in Michigan law. See post, pp 587-593.\n\nGordon also took note of the fundamental problem with this type of impeachment observing that its legitimate purpose\n\nis, of course, not to show that the accused who takes the stand is a \"bad\" person but rather to show background facts which bear directly on whether jurors ought to believe him rather than other and conflicting witnesses. [ Id. at 347.]\n\nFinally, Judge Burger expressed his belief that the task of trial Judges in this area would be \"extremely difficult\" and that\n\nit would be much simpler if prior convictions of an accused were totally admissible or totally excludable as impeachment . . . . [ Id. at 348.]\n\nHowever, he felt that the language of the evidentiary statute (see ante, p 582) foreclosed a bright-line rule barring all such impeachment, while Luck foreclosed a return to the traditional rule allowing all prior-conviction impeachment.\n\nThe Luck-Gordon doctrine began to have an effect on other circuits and some states, including our own, in spite of the fact that Congress ultimately amended the relevant statute so as to read \"shall be admitted,\" rather than \"may be admitted\" (PL 91-358, § 133, DC Code Ann, § 14-305[1] [1973]), thus eliminating the doctrine in the jurisdiction in which it had been created.\n\nMeanwhile, Congress was moving toward adopting a federal code of evidence.\n\nThe evolution of FRE 609(a) was somewhat tortured, with the text being substantially revised at virtually every level of consideration. For our purposes, it is sufficient to note that the rule ultimately adopted by Congress reads as follows:\n\n(a) General rule. For the purpose of attacking the credibility of a witness, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if the crime (1) was punishable by death or imprisonment in excess of one year under the law under which he was convicted, and the court determines that the probative value of admitting this evidence outweighs its prejudicial effect to the defendant, or (2) involved dishonesty or false statement, regardless of the punishment.\n\nContrary to MRE 609 and the Luck standard, FRE 609 balancing is not engaged in where the prior offense involved dishonesty or false statement and those words, supplying a bright-line rule for admissibility, were intended to be clearly related to credibility:\n\nBy the phrase \"dishonesty and false statement\" the Conference means crimes such as perjury or subornation of perjury, false statement, criminal fraud, embezzlement, or false pretense, or any other offense in the nature of crimen falsi, the commission of which involves some element of deceit, untruthfulness, or falsification bearing on the accused's propensity to testify truthfully. [Conference Report, HR No 93-1597, reprinted at 120 Cong Rec, H 39939, 39941 (December 14, 1974).]\n\nSince the federal Rules of Evidence have been codified, the federal courts have used those factors described in Gordon in determining the outcome of the balancing test for felonies. These factors have been repeatedly summarized as follows:\n\n(1) The impeachment value of the prior crime.\n\n(2) The point in time of the conviction and the witness' subsequent history.\n\n(3) The similarity between the past crime and the charged crime.\n\n(4) The importance of the defendant's testimony.\n\n(5) The centrality of the credibility issue.\n\nUnited States v Jackson, 696 F2d 578 (CA 8, 1982); United States v Preston, 608 F2d 626 (CA 5, 1979); United States v Mahone, 537 F2d 922, 929 (CA 7, 1976); United States v Paige, 464 F Supp 99 (ED Pa, 1978); 3 Weinstein, Evidence, para. 609[04] at 609-77 to 609-78.\n\nB\n\nIt was not until the passage of 1861 PA 125 that a criminal defendant in Michigan could make a statement at his own trial. Even after the passage of that act, criminal defendants could not testify under oath. People v Thomas, 9 Mich 314 (1861). It took an additional twenty years before the Legislature, with the passage of 1881 PA 245, removed all obstacles to a criminal defendant testifying on his own behalf. In People v Cummins, 47 Mich 334, 336; 11 NW 184 (1882), decided shortly after the Legislature so acted, this Court held that when criminal defendants testify, they may be impeached by their prior convictions. Impeachment of witnesses, including criminal defendants, by introduction of prior convictions was, for approximately the next ninety years, allowed at the desire of the prosecutor. Finally, in 1974, this Court, in People v Jackson, 391 Mich 323; 217 NW2d 22 (1974), adopted the Luck rule of discretionary exclusion of such evidence.\n\nJustice Swainson concurred in Jackson, but called for a bright line barring all impeachment of criminal defendants by prior conviction:\n\nI think that it is now time for this Court to recognize a fact that has been well illustrated by commentators and confirmed by the facts in the present case. When the prospective witness is a criminal defendant with a prior record, there is often no real distinction between the common-law prohibition from testifying and our present rule. Rather than expose his prior record to the trier of fact the defendant must forego his right to testify in his own behalf. State v Santiago, 53 Hawaii 254, 258; 492 P2d 657, 660 (1971); H. Kalven and H. Zeisel, The American Jury 146 (1966); McCormick, Law of Evidence (2d ed), § 43, p 84.\n\nIf we expect the trier of facts to intelligently and impartially decide if a defendant has committed the crime for which he is standing trial, it makes no sense to permit artificial barriers to remain in the fact-finding process. A total understanding of the events in question at an adversary trial cannot logically be achieved unless the defendant is able to freely testify as to his recollection of them. Conversely, if a defendant with a record does elect to testify, we ask the jury to perform unattainable feats of \"mental gymnastics\" by exposing it to a defendant's record for the stated purpose of weighing his credibility and then asking the jury to totally disregard the criminal record when passing on the defendant's guilt or innocence of the present charge. E. Griswold, The Long View, 51 ABAJ 1017, 1021 (1965); 70 Yale L J 763, 777 (1961).\n\nI find it undeniable at this time that the prejudice resulting from allowing impeachment of a defendant by prior conviction evidence clearly outweighs whatever small probative value might result from the practice. I believe that under our duty to supervise the administration of Justice in the State of Michigan we would promote fairness and uniformity by setting forth a clear rule prohibiting impeachment of a criminal defendant by his prior convictions rather than leaving the decision to be made in each case at the trial court level. [ Id. at 343-345.]\n\nThe majority, however, rejected the bright-line approach and instead referred to the Gordon factors regarding discretionary admission. However, the Court did not simply state verbatim the factors listed in Gordon. Instead, it stated:\n\nAmong the factors to be considered are the nature of the prior offense, whether it is for substantially the same conduct for which the accused is on trial, and the effect on the decisional process if the accused does not testify from fear of impeachment by prior convictions. [ Id. at 333.]\n\nFour years after Jackson, the Michigan rule, as originally proposed, was developed by a committee established by this Court to draft a code of evidence. By that time the federal rules were largely adopted and Michigan, like many other states at that time, looked to those rules for guidance. In addition, the committee saw Jackson as the basis for any rule in this difficult area. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nFour months after the Michigan Rules of Evidence were promulgated, the Court of Appeals decided People v Crawford, 83 Mich App 35; 268 NW2d 275 (1978), which, along with Jackson, has been consistently cited in MRE 609(a) cases. In that case, defendant was charged with six counts of armed robbery, and the trial court allowed him to be impeached by two prior armed robbery convictions. The Court of Appeals explained the balancing test as follows:\n\nThe factors which the Judge must weigh in making his determination include: (1) the nature of the prior offense (did it involve an offense which directly bears on credibility, such as perjury?), (2) whether it is for substantially the same conduct for which the defendant is on trial (are the offenses so closely related that the danger that the jury will consider the defendant a \"bad man\" or infer that because he was previously convicted he likely committed this crime, and therefore create prejudice which outweighs the probative value on the issue of credibility?), and (3) the effect on the decisional process if the accused does not testify out of fear of impeachment by prior convictions (are there alternative means of presenting a defense which would not require the defendant's testimony, i.e., can his side of the story be presented, or are there alternative, less prejudicial means of impeaching the defendant?). [83 Mich App 39.]\n\nThe Court held that the trial court erred by not excluding the evidence of prior convictions. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn People v Kelly, 66 Mich App 634, 637; 239 NW2d 691 (1976), the Court of Appeals enunciated for the first time the Gordon factor not mentioned in either Jackson or MRE 609, but which the Dissenters, in their analyses of the cases before us, would elevate to dispositive status:\n\nA consideration not discussed in People v Jackson, supra, but central to Gordon v United States, supra, was the fact that there was a direct conflict between the testimony of the complainant and the defendant. The verdict in Gordon necessarily turned on how the jury resolved the credibility contest between the complainant and the defendant. . . .\n\nThis is precisely the situation in the instant case. There was a direct conflict in the testimony between the security guard who testified that he saw the defendant leave with a box of dishes and the defendant who testified that he carried trash out of the store. This conflict in testimony was as compelling as in Gordon for exploring all avenues which would shed light on the credibility of the two witnesses. The trial Judge correctly denied the defendant's motion to suppress his prior felony convictions.\n\nThis Court has never, until these cases, addressed this particular holding in Kelly.\n\nIn People v Hughes, 411 Mich 517, 520-521; 309 NW2d 525 (1981), we described the procedure under 609(a) as follows:\n\nIn People v Jackson, 391 Mich 323, 333; 217 NW2d 22 (1974), and People v Baldwin, 405 Mich 550, 552-553; 275 NW2d 253 (1979), we set forth guidelines for the exercise of the trial court's discretion in balancing the prejudicial effect of evidence of prior convictions against their probative value on the issue of credibility. Among the factors to be considered are the nature of the prior offense, whether the conviction was for substantially the same conduct as that for which the accused is on trial, and the effect on the decisional process if the accused does not testify for fear of impeachment by prior convictions. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe purpose of this inquiry is two-fold:\n\n1) To put before the jury only those prior convictions indicative of the defendant's Disposition toward truthfulness and veracity; and\n\n2) To keep from the jury those convictions which, although they may be indicative of defendant's Disposition toward truthfulness, may interfere with the jury's ability to determine the defendant's guilt or innocence on the basis of the evidence. Such interference is what is meant by \"prejudice.\" [Emphasis added.]\n\nNot only is the Kelly credibility-contest factor not mentioned here, but the \"purpose of the inquiry,\" as described in the passage above, indicates that the process is a two-step process of elimination rather than simply a two-factor balancing; i.e., first, nonprobative convictions are excluded, and, second, of the probative offenses, those which would cause prejudice should also be excluded. This description does not seem to encompass a consideration of the need to compare the credibility of defendant with that of a prosecution witness.\n\nSimilarly, People v Woods, 416 Mich 581; 331 NW2d 707 (1982), does not address Kelly or the credibility-contest factor, citing only Luck and Gordon \"as adopted by Jackson.\" In addition, People v Wakeford, 418 Mich 95; 341 NW2d 68 (1983), this Court's most recent statement on 609(a), states that \"among\" the factors are:\n\n-- The nature of the prior offense, whether similar or dissimilar to the offense charged, similarity standing as a factor weighing against admissibility, but not conclusive of the matter;\n\n-- Recency of the prior offense as probative of the defendant's veracity at the time of trial, should he elect to testify;\n\n-- The importance to the truth-seeking process, not merely the prospects for acquittal, of obtaining the defendant's version of the events in question. The notion here is that otherwise presumptively admissible prior convictions should be excluded if the price of a ruling of admissibility is to keep the defendant from the witness stand when the testimony he would offer would be central to the matters seriously controverted. [418 Mich 116-117. Emphasis in original.]\n\nWhile this Court's description of the third factor, particularly in light of the emphasized phrase, is opposite to the Kelly view, we did not at that time explicitly reject it, and in some decisions of the Court of Appeals that factor has continued to prove dispositive. In People v Jones, supra, the defendant was charged with larceny from a building and was impeached with two convictions of the same crime and one conviction of attempted larceny from a building. The Court of Appeals in that case extended the Kelly factor so that it would apply even where there was not a one-to-one credibility contest. There were two eyewitnesses who testified against defendant, but the panel stated that \" the defendant testifies, the trial often becomes a contest as to who is telling the truth.\" 98 Mich App 428. See People v Monasterski, 105 Mich App 645; 307 NW2d 394 (1981), People v Casey, 120 Mich App 690; 327 NW2d 337 (1982), and People v Holmes, 132 Mich App 730; 349 NW2d 230 (1984), where the Kelly credibility-contest factor was also employed.\n\nIV\n\nAs this historical survey indicates, our jurisprudence in this area has long recognized that certain crimes are more strongly related to truthfulness than others. Moreover, as discussed above, the relationship of the commission of a crime to veracity is often present only when seen through the prejudicial Conclusion that the witness-accused is of bad general character. The amendment of MRE 609 addresses these realities by dividing the range of prior convictions into three categories.\n\nAs previously described, crimes having an element of dishonesty or false statement \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nNo crimes, other than those including elements of false statement or dishonesty are directly probative of veracity. It may seem, therefore, that evidence of a prior conviction for any other crime should always be excluded. We are, however, mindful that theft offenses have traditionally been viewed as strongly probative of veracity.\n\nIn adopting our code of evidence this Court chose to treat theft crimes as it did crimes involving dishonesty or false statement, thus indicating a belief that theft crimes are more probative of veracity than other crimes. Similarly, as noted ante, p 583, Judge Burger, in Gordon v United States, stated:\n\nIn common human experience acts of deceit, fraud, cheating, or stealing, for example, are universally regarded as conduct which reflects adversely on a man's honesty and integrity. Acts of violence on the other hand, which may result from a short temper, a combative nature, extreme provocation, or other causes, generally have little or no direct bearing on honesty and veracity. A \"rule of thumb\" thus should be that convictions which rest on dishonest conduct relate to credibility whereas those of violent or assaultive crimes generally do not . . . . [Emphasis added.]\n\nJudge Burger's analysis and MRE 609, as originally adopted, suggest that crimes having an element of theft should be treated in the same manner as false statement crimes. At the same time, however, the fact that jurors will invariably use evidence of theft convictions to draw Conclusions about defendant's general character suggests that these convictions always be excluded. Rather than adopt one approach or the other, the amendment of MRE 609 leaves the admission of most theft crimes to the trial court's discretion. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWe do not see countervailing grounds to exclusion where other crimes are involved. Those crimes do not bear an equally strong relationship to credibility. Moreover, their relationship to this trait is mediated through the determination that defendant has a bad general character and thus possess a strong potential for prejudice. Therefore, prior convictions for non-theft crimes which do not contain elements of dishonesty or false statement should never be admitted into evidence.\n\nIt could be argued that this three-part division is purely arbitrary. We do not agree. The division is based upon our understanding of which prior convictions are most probative of credibility and which are most prejudicial. It is, however, interesting to note in examining MRE 609 that most of the provisions are arbitrary. Certainly the dividing line between those crimes which are punishable by more than a year's imprisonment and those which are not will not always divide those prior convictions which should or should not be admitted. Similarly, ten years does not finely divide those prior convictions that are probative from those that are not. Therefore, if there is an element of arbitrariness in the scheme we have defined, it is of a degree inherent in defining practicable evidentiary rules. While the Dissent criticizes us for categorizing \"classes of evidence\" (post, p 671), excluding classes of relevant evidence is the very essence of defining evidentiary rules. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e We are also mindful of the appellate burden created by the present rule which the Dissent points out \"results in the greatest percentage of appeals . . . .\" (Post, p 701.) The bright-line rules will facilitate trial court determinations and greatly reduce the number of appeals. In addition, an examination of other jurisdictions demonstrates that in this area the use of trial court discretion is generally circumscribed and that bright-line rules are used much more extensively than has been the case in Michigan.\n\nThe federal rule of evidence imposes a bright-line rule on the clearly probative end of the spectrum and a probative versus prejudice balancing for remaining crimes. Approximately thirteen states have adopted the federal approach. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Five other states have drawn bright lines which permit automatic admission of evidence of all or nearly all prior convictions. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In addition, eight jurisdictions have bright lines permitting automatic impeachment by certain prior convictions, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and three other states allow impeachment as long as the prior convictions bear some relevancy to credibility. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e At the same time, four states altogether bar the impeachment of criminal defendants by prior conviction, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and one has barred such impeachment unless the prior conviction was for perjury or false swearing. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThere are, therefore, thirty-five jurisdictions (including the federal and the District of Columbia) which employ bright lines in addressing the impeachment problem. Of those thirty-five, twenty do not permit the probative/prejudice balance to ever be considered by the court. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Only sixteen states grant their trial courts discretion over the admission of those prior convictions which may be admitted, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e and of those sixteen, five limit, to a greater degree than Michigan, those prior convictions which may even be considered for admission. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nWhile this survey demonstrates that there is a wide range of evidentiary rules governing the question of impeachment of a witness-accused, it also indicates that bright-line rules, to one extent or another, are employed in the majority of jurisdictions and that the extent of probative/prejudice discretion exercised by trial Judges in our state stands at one extreme of the range of approaches now in practice.\n\nThe bright-line approach was also favored by the drafters of the 1953 Uniform Rules of Evidence and the Model Code of Evidence. The 1953 Uniform Rule 21 would have permitted impeachment of witnesses who were not criminal defendants only where the prior conviction involved dishonesty or false statement. Where the witness was a criminal defendant, it would have, with one exception, completely barred any such impeachment:\n\nIf the witness be the accused in a criminal proceeding, no evidence of his conviction of a crime shall be admissible for the sole purpose of impairing his credibility unless he has first introduced evidence admissible solely for the purpose of supporting his credibility.\n\nThe Model Code Rule 106 states in pertinent part:\n\nIf an accused who testifies at the trial introduces no evidence for the sole purpose of supporting his credibility, no evidence concerning his commission or conviction of crime shall, for the sole purpose of impairing his credibility, be elicited on his cross-examination or be otherwise introduced against him . . . .\n\nV\n\nHaving left the admission of theft convictions to the Judge's discretion, it is necessary to clarify the manner in which this discretion should be exercised. At the present time there is a split in the Court of Appeals as to what factors are properly considered in the balancing test conducted under MRE 609 prior to the amendment adopted today. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nIn light of this split in the Court of Appeals and the contradictory nature of some of the factors employed in the past, we define a more specific probative versus prejudice balancing test consistent with what we feel was the original intent of the existing MRE 609, and our prior decisions on this subject. It will be used to resolve the cases at hand, as well as to serve as the balancing test pursuant to the amended MRE 609.\n\nIn enumerating his criteria in Gordon, Judge Burger observed that \" important consideration is what the effect will be if the defendant does not testify out of fear of being prejudiced because of impeachment by prior convictions.\" Id. at 347. The subsequent application of the Gordon guidelines makes clear that the credibility-contest factor contradicts this consideration since the defendant's testimony is never more crucial, a failure to testify more damaging, and the decision to admit prior convictions more prejudicial than when \"the case . . . to the credibility of two persons -- the accused and his accuser . . . .\" Id. at 348. This contradiction lends great credence to Judge Burger's prophecy that employing the Luck-Gordon rule was \"extremely difficult.\" Id. Indeed, as one writer has observed, \"When one [of these two factors] increases in importance, the other does also, and there appears to be no principled way to determine which factor should prevail.\" Surratt, Prior-conviction impeachment under the federal rules of evidence: A suggested approach to applying the \"balancing\" provision of Rule 609(a), 31 Syracuse L R 907, 945 (1980).\n\nThe Dissenters' focus on the credibility-contest factor in two of the cases before us, Allen and Gray, without any balancing of the \"important\" and countervailing standard of the \"effect on the decisional process if the accused does not testify from fear of impeachment by prior convictions,\" Jackson, supra at 333, is the latest example of the fluidity and unpredictability of attempts to apply our current rule to these questions. The Dissenters would not only employ a factor that has not been previously utilized by this Court or in the oft-cited Court of Appeals Crawford case, but would do so in such a manner as to strip the probative/prejudice balance of any real meaning. The Dissenters discard the most-cited balancing test and the only test for judicial discretion actually set forth in MRE 609 -- probativeness versus prejudice \"on the issue of credibility.\" It has not heretofore been suggested that the \"probative value of admitting this evidence\" escalated with its need or that \"its prejudicial effect\" decreased with its need.\n\nIn the remaining three cases before us, the Dissenters would find error, again, not based principally on an analysis of the \"probative value of admitting this evidence on the issue of credibility\" and \"its prejudicial effect,\" but rather on the need or lack thereof for evaluating the defendants' credibility. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nIt is our view that it is the effect on the decisional process if the defendant does not testify which must predominate and so the contradicting \"credibility contest\" factor must therefore be eliminated. We note, initially, that both the first federal case and the first Michigan case dealing with the prior impeachment question failed to cite the credibility-contest factor. Luck, supra at 157, instead cited \" above all, the extent to which it is more important to the search for truth in a particular case for the jury to hear the defendant's story than to know of a prior conviction.\" (Emphasis added.) Similarly, Jackson, supra at 333, cited \"the effect on the decisional process if the accused does not testify from fear of impeachment by prior convictions.\"\n\nWe also acknowledge that when a criminal defendant testifies jurors are quite aware that he has a unique concern with the outcome of the trial and is more likely to have fabricated his testimony than any other witness. His testimony is therefore likely to be given diminished weight irrespective of impeachment. Note, Procedural protections of the criminal defendant -- A reevaluation of the privilege against self-incrimination and the rule excluding evidence of propensity to commit crime, 78 Harv L R 426, 440, 450 (1964); 9 Law \u0026 Human Behavior, (supra) at 43.\n\nIn addition, as pointed out in Crawford, excluding evidence of prior convictions does not mean that a defendant's testimony will reach the jury unassailed. The prosecutor on cross-examination may draw out contradictions or indications of unreliability in defendant's testimony. The prosecutor may also bring forward prior inconsistent statements or challenge the defendant's sensory capabilities. Assuming, as the Dissent seems to do, that the defendant is almost certainly guilty, and thus fabricating his story, it is quite likely that defendant's story will not hold up under these less prejudicial forms of impeachment.\n\nFinally, unless one were to take the position that a defendant's testimony is not relevant to truth finding, in which case there is little need for criminal trials at all, we cannot ignore the burden placed upon truth finding when a defendant chooses not to testify out of fear of prior conviction impeachment. Only the Dissenters' assumption that \"ninety percent of those charged are guilty\" \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e (post, p 672, n 6) explains their failure to apply the same rigorous analysis to this burden that they apply to the burden of barring impeachment by prior conviction.\n\nIn sum, the trial Judge's first task, under the amended MRE 609, will be to determine whether the crime contains elements of dishonesty or false statement. If so, it would be admitted without further consideration. If not, then the Judge must determine whether the crime contains an element of theft. If it is not a theft crime, then it is to be excluded from evidence without further consideration. If it is a theft crime and it is punishable by more than one year's imprisonment, \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e the trial judge would exercise his discretion in determining the admissibility of the evidence by examining the degree of probativeness and prejudice inherent in the admission of the prior conviction. For purposes of the probativeness side of the equation, only an objective analysis of the degree to which the crime is indicative of veracity and the vintage \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e of the conviction would be considered, \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e not either party's need for the evidence. For purposes of the prejudice factor, only the similarity to the charged offense and the importance of the defendant's testimony to the decisional process would be considered. The prejudice factor would, of course, escalate with increased similarity and increased importance of the testimony to the decisional process. Finally, unless the probativeness outweighs the prejudice, the prior conviction would be inadmissible.\n\nVI\n\nThe bright-line aspects of the amendment of MRE 609 will, with the exception of the execution of the balancing test, apply to witnesses called by the prosecution and non-defendant witnesses called by the defense in the same way they apply to defendants. We recognize that symmetry is \"neither an object of criminal procedure nor a proper criterion of fairness.\" People v Hayes, 410 Mich 422, 425; 301 NW2d 828 (1981). However, since we have eliminated the credibility contest factor in the balancing test and barred the introduction of most prior convictions against the defendant, it would skew the decisional process if prosecution witnesses, including the complaining witness, were subject to the level of impeachment permitted prior to today's amendment. Similarly, since the new rule will apply to all prosecution witnesses, it should, in fairness, also apply to all defense witnesses.\n\nUnfortunately, perfect symmetry cannot be attained. While the bright lines can be easily applied to non-defendant witnesses, \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e the application of the balancing test for theft crimes poses a problem as the factors relevant to prejudice do not arise where the witness is not the defendant. No one is prejudiced where the offense used to impeach a non-defendant witness is similar to the offense with which defendant is charged. Similarly, since, in general, the only individual who can refuse to testify is the defendant, the specter of impeachment cannot result in the loss of a nondefendant's testimony. The \"effect on the decisional process\" factor is, therefore, irrelevant. The Dissent would argue that prejudice also lies in the possibility that a prosecution witness will be impeached for a theft crime while the defendant is not.\n\nWe agree that this represents an imbalance, but do not consider it to be prejudice as we have described it. Assymetry has long been present in this area of the law. For example, under the federal rule a prosecution witness can never escape impeachment with a timely felony or false statement conviction. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Moreover, today's amendment does not permit consideration of possible prejudice to defendant if a non-defendant defense witness is to be impeached. As with impeachment of prosecution witnesses, the only \"prejudice\" arises out of the fact that the witness may not be believed, as the non-defendant witness' general character will not be considered by the jury.\n\nTherefore, where a party seeks to impeach a nonaccused witness, the bright lines will apply. Where the relevant offense is a theft crime, the Judge need only determine that the prior offense, in light of its nature and vintage, is significantly probative \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e of veracity. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e If so, the impeachment evidence should be admitted. If not, it should be excluded.\n\nVII\n\nThe bright-line test substantially revises our approach to impeachment by prior conviction. Trial Judges have, in good faith, attempted to follow the framework described in MRE 609 prior to the amendment we now announce. Thus, parts of the amendment of MRE 609 are \"clear breaks\" in our jurisprudence, and we will apply them only prospectively. See, e.g., Tebo v Havlik, 418 Mich 350; 343 NW2d 181 (1984). Accordingly, the amendment of MRE 609 will take effect March 1, 1988. Trials begun before that date will be governed by the existing version of MRE 609 as interpreted by this opinion.\n\nWe do not believe, however, that our clarification of the balancing test represents a \"clear break\" in our jurisprudence. The balancing test, as such, has long been in place, and, as described above, there has been a split in the Court of Appeals regarding its proper exercise. Resolution of the many cases now on appeal requires clarification of that test. Therefore, the clarified balancing test, as described in this opinion and in the amendment of MRE 609, will be given limited retroactivity as follows: 1) to the instant cases; 2) all cases pending on initial and direct appeal in which the issue of impeachment by prior conviction under the then-existing MRE 609(a) has been raised and preserved; \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e 3) currently pending appeals in which the appellant's initial brief has not yet been filed, but the issue was raised and preserved in the trial court; and 4) cases in which the issue has been raised and preserved in the trial court, but no first appeal from the original judgment has yet been filed.\n\nIn Conclusion, the bright-line tests will become effective March 1, 1988 and will apply to cases begun on that date and thereafter. The balancing test, although part of the amendment of MRE 609, should also be understood as a clarification of the proper procedure pursuant to MRE 609 prior to its amendment. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e It will, therefore, be given the limited retroactive application just described. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nWe therefore review the instant cases in the context of the clarified balancing test, but not in the context of the bright-line rules.\n\nIn Gray, defendant was convicted of first-degree felony murder and felony-firearm. The trial court ruled that he could be impeached with three prior concealed weapons convictions, as well as with a conviction for possession of heroin. The convictions occurred from five to nine years prior to the instant trial and all were for possessory crimes which have a low degree of probativeness. At the same time, the concealed weapon convictions were similar to the felony-firearm charge, and Gray's own testimony was the only evidence presented in the defense's case. His testimony was therefore very important to the decisional process. In light of the low probative value of the evidence and its very high level of prejudice, we find that the prejudice outweighed the probativeness of the evidence of prior convictions. Its admission was, therefore, error, and we reverse the conviction and remand for a new trial.\n\nIn Pedrin, defendant was, in 1982, tried and convicted of breaking and entering an unoccupied building with the intent to unlawfully drive away an automobile. The trial court ruled that defendant could be impeached with a prior 1981 conviction for breaking and entering with intent to commit larceny. Such a theft crime is moderately probative of veracity, and the recentness of the crime accents that probative value. The level of prejudice was, however, significantly greater. The charged offense was very similar to the prior conviction. In addition, defendant's testimony was very important to the decisional process, as he had no other means of presenting his version of events. Accordingly, we reverse and remand for a new trial.\n\nIn Allen, defendant was tried and convicted of first-degree criminal sexual conduct. He was impeached with a conviction for second-degree criminal sexual conduct which occurred less than three years before the case in question. While the conviction was of recent vintage, the probative value of assaultive crimes is low. As to the level of prejudice, the prior crime and the charged offense were extremely similar. In addition, although the defense presented a witness who testified as to the defense claim of prior consensual sexual activity, the only evidence as to defendant's version of events regarding the charged incident was defendant's own testimony. We therefore reverse and remand for a new trial.\n\nIn Brooks, defendant was, in 1981, convicted of armed robbery and felony-firearm. He was impeached with two 1975 armed robbery convictions and a 1981 unarmed robbery conviction. Since robbery, although it contains an element of theft, is primarily an assaultive crime (People v Wakeford, 418 Mich 95; 341 NW2d 68 [1983]), and does not involve stealth, it has a lower probative value on the issue of credibility than would other theft crimes. At the same time, the recentness of the last conviction heightens its probative value. However, the similarity of the prior convictions to the charged crime was highly prejudicial, and defendant was the only witness presented by the defense. The evidence of prior convictions should therefore have been excluded. Nevertheless, for the reasons described in Chief Justice Riley's opinion, we find that the error was harmless. We also agree with the Chief Justice that it was not error for the trial court to fail to give a limiting instruction sua sponte on the use of prior convictions. We therefore affirm the conviction.\n\nIn Smith, defendant was convicted of two counts of first-degree criminal sexual conduct and one count of assault with intent to murder. The trial court ruled that defendant could be impeached with an eight-year-old manslaughter conviction. Manslaughter, an assaultive offense, is of low probative value, and the conviction was of relatively late vintage. The level of prejudice was high, since manslaughter is similar to the charge of assault with intent to murder. In addition, although the defense presented three witnesses whose testimony lent some credence to defendant's theory of the case, only defendant's own testimony could have put his version of events into evidence, since his co-defendants testified against him. The high level of prejudice and low level of probativeness lead us to conclude that the trial court's ruling that the evidence of prior convictions could be admitted was erroneous. Nevertheless, the prosecutor's case was so strong that we do not believe a reasonable juror could have voted to acquit defendant, even if he had testified and not been impeached. We therefore find that the error was harmless. Defendant also raises four other issues which are described and carefully examined in Chief Justice Riley's opinion. We agree with the Chief Justice's analyses of these issues, and thus we affirm the conviction. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nVIII\n\nBecause the Court is unable to achieve a majority position on the merits of the rule announced in Luce v United States, 469 U.S. 38; 105 S Ct 460; 83 L Ed 2d 443 (1984), we decline to address its proposed applicability in Michigan, reserving that question for another day.\n\nAPPENDIX A\n\nREVISED MRE 609\n\nIMPEACHMENT BY EVIDENCE OF CONVICTION OF CRIME\n\n(a) General rule. For the purpose of attacking the credibility of a witness, evidence that the witness has been convicted of a crime shall not be admitted unless the evidence has been elicited from the witness or established by public record during cross-examination, and\n\n(1) the crime contained an element of dishonesty or false statement, or\n\n(2) the crime contained an element of theft, and\n\n(A) the crime was punishable by imprisonment in excess of one year or death under the law under which the witness was convicted, and\n\n(B) the court determines that the evidence has significant probative value on the issue of credibility and, if the witness is the defendant in a criminal trial, the court further determines that the probative value of the evidence outweighs its prejudicial effect.\n\n(b) Determining probative value and prejudicial effect. For purposes of the probative value determination required by subrule (a)(2)(B), the court shall consider only the age of the conviction and the degree to which a conviction of the crime is indicative of veracity. If a determination of prejudicial effect is required, the court shall consider only the conviction's similarity to the charged offense and the possible effects on the decisional process if admitting the evidence causes the defendant to elect not to testify. The court must articulate, on the record, the analysis of each factor.\n\n(c)-(f) [(b)-(e) redesignated but otherwise unchanged.]\n\nAPPENDIX B\n\nSUMMARY OF ABEYANCES FOR PEOPLE v ALLEN\n\nAbeyance Summary Abbreviation Key\n\nA Assault\n\nA\u0026B Assault and battery\n\nAR Armed robbery\n\nAtt Attempted\n\nAWI Assault with intent, plus suffixes for:\n\nGBH Great bodily harm\n\nM Murder\n\nRA Robbery while armed\n\nRU Robbery while not armed\n\nB\u0026E Breaking and entering\n\nCCW Carrying a concealed weapon\n\nCSC Criminal sexual conduct, plus\n\nsuffixes I-III\n\nEntry w/B Entry without breaking\n\nFA Felonious assault\n\nFF Felony firearm\n\nFPF Felon in possession of firearm\n\nGL Grand larceny\n\nHO Habitual offender, plus suffixes I-IV\n\nK Kidnapping\n\nL Larceny\n\nLIB Larceny in a building\n\nLIMV Larceny in a motor vehicle\n\nLP Larceny from a person\n\n$100L Larceny over $100\n\n$100MD Malicious destruction over $100\n\nM1 First-degree murder\n\nM1 Felony first-degree murder\n\nM2 Second-degree murder\n\nNSF Non-sufficient funds\n\nPoss cocaine Possession of cocaine\n\nR\u0026C Receiving and concealing\n\nSA Simple assault\n\nU\u0026P Uttering and publishing\n\nUR Unarmed robbery\n\nExample: \"AR (x3)\" -- defendant had three armed\n\nrobbery convictions.\n\nAbbreviations pertinent\n\nto defendants' testimony:\n\nT Testified\n\nDNT Did not testify\n\nSUMMARY OF ABEYANCES FOR PEOPLE v ALLEN\n\nDOCKET PEOPLE v ORIGINAL CHARGE(S)PRIOR CONVICTIONS IMPEACHMENT WITH\n\n71228 Casey AWIM; CSC I (x3) (1) Manslaughter (2); DNT\n\n(2) FA\n\n72219 Newman M1; AWIM (1) Bank robbery (2); T\n\n(2) Possession of\n\nillegal firearm\n\n[(1)\u0026(2) both\n\nin federal\n\ncourt]\n\n73034 Baker M1; FF (1) AR (x3) (1); DNT\n\nThe enumerated\n\nfelony was AR.\n\n73049 Owens Incitement M1 [most from other (1); (3); (5);\n\n(x2);\n\n73050 Conspiracy M1 (x2)states] (7); DNT\n\n(Prosecutor's (1) Burglary (x2)\n\n(2) Poss cocaine\n\nAppeal) (3) GL\n\n(4) CCW (x2)\n\n(5) Falsification\n\n(6) CSC II (att)\n\n(7) NSF\n\n74216 Stokes AWIM (1) A\u0026B (x2) (3); T\n\n(2) SA\n\n(3) AWIM\n\n74321 McDuffie M2; FF (1) CSC III (1); T\n\n74725 Swartz LIB; HO II (1) LP (1); DNT\n\n75320 Schock CSC I (x2); (1) R \u0026 C (1); (2);\n\n75321 FF (x2) (2) AWIGBH DNT\n\n75593 Durham AWIGBH; FA; (1) CCW (1); DNT\n\nB\u0026E (AWIGBH);\n\nFF\n\n76128 Cope CSC III (1) Gross sexual (1), (2); T\n\nimposition\n\n(Ohio)\n\n(2) UR (Ohio)\n\n(3) CSC III\n\n76132 LaBadie B\u0026E (L) (1) Federal (1); DNT\n\nfirearms\n\nconviction\n\n(exact nature\n\nunspecified)\n\n78343 Times M1 (1) AWIRU (1); DNT\n\n78359 Lee M2; AWIM; FF (1) CCW (Att) (1); T\n\n78451 Walker CSC I; HO IV (1) Extortion (1); (2); (3); T\n\n(2) U\u0026P\n\n(3) LIB (Att)\n\n78831 Aldridge B\u0026E (L); (1-5) Theft (1-5); (7); T\n\nHO II (or III ?) misdemeanors\n\n(6) B\u0026E\n\n(7) B\u0026E (Att)\n\n78952 Minor AR; FF (1) AWIR (armed) (2); (4); T\n\n(2) AWIGBH\n\n(3) AR\n\n(4) AR\n\n78990 Lake $100L; HO IV (1) $100L (1); DNT\n\n(2) $100L\n\n(3) LIB\n\n(4) LIB\n\n79116 O'Rourke B\u0026E (L) (1) B\u0026E (2); (3); T\n\nHO IV (2) FA\n\n(3) $100MD\n\n(4) CSC III\n\n79234 Bell B\u0026E; HO IV (1) LIB (Att) (1); (2); (3);\n\n(2) CSC II (4); T\n\n(3) Entry w/B\n\n(4) R\u0026C 1$100\n\n79340 Crawford K; CSC I; (1) AR (1); T\n\nUR\n\n79378 Brown K; UR; CSC I (1) AR (Att) (2); T\n\n(2) AWIRA\n\n79399 McGee AR; CCW (1) B\u0026E (2); DNT\n\n79400 (2) AR\n\n(3) FPF\n\n(4) CCW (Att)\n\n79522 Duncan CSC III (1) AWIM (1); (2); DNT\n\n(2) CCW\n\n80333 Jones B\u0026E (1) LIB (1); (2); (3);\n\n(2) LIMV T\n\n(3) L (misdemeanor)\n\n80377 Johnson R\u0026C (1) Manslaughter (1); T\n\n80555 Cannon LIB; HO II (1) LIB (1); DNT\n\n(Prosecutor's\n\nAppeal)\n\n(Defendant's\n\nCross-appeal)\n\n80592 Belanger AR; B\u0026E; (1) B\u0026E (3); DNT\n\n(Prosecutor's AWIRA (2) FA\n\n(3) FF\n\nAppeal)\n\n80839 Wesley CSC I (1) M2 (1); DNT\n\nAR\n\nFF\n\nDOCKET CONVICTED OF COA RULING\n\n71228 AWIGBH AFF'D;\n\n120 Mich App 690\n\n(1982)\n\n72219 M1; AWIM AFF'D\n\n73034 M1; FF AFF'D\n\n73049 Incitement REVERSED\n\n73050 M1 (x2); 131 Mich App 76\n\nProsecutor's Conspiracy M1 (1983)\n\n(x2)\n\nAppeal)\n\n74216 AWIGBH AFF'D\n\n134 Mich App 146\n\n(1984)\n\n74321 Manslaughter; AFF'D\n\nFF\n\n74725 LIB; HO II AFF'D\n\n75320 CSC I (x2); AFF'D\n\n75321 FF (x2)\n\n75593 AWIGBH; FA; AFF'D\n\nB\u0026E (AWIGBH);\n\nFF\n\n76128 CSC III AFF'D\n\n76132 B\u0026E (L) AFF'D\n\n78343 M2 AFF'D\n\n78359 Manslaughter; AFF'D\n\nAWIGBH: FF\n\n78451 CSC I AFF'D\n\n(jur);\n\nHO IV (plea)\n\n78831 B\u0026E (L) AFF'D\n\n(jury);\n\nHO II (plea)\n\n78952 AR; FF AFF'D\n\n78990 $100L AFF'D\n\n(jury);\n\nHO IV (plea)\n\n79116 B\u0026E (L) AFF'D\n\n(jury);\n\nHO IV (plea)\n\n79234 Entry w/B AFF'D\n\n(jury);\n\nHO IV (plea)\n\n79340 CSC I; UR AFF'D\n\n79378 K; LP; CSC I AFF'D\n\n79399 AR; CCW AFF'D\n\n79400\n\n79522 CSC III AFF'D\n\n80333 B\u0026E AFF'D\n\n80377 R\u0026C AFF'D\n\n157 Mich App 248\n\n(1987)\n\n80555 LIB (jury); REVERSED\n\n(Prosecutor's HO II (plea)\n\nAppeal)\n\n(Defendant's\n\nCross-appeal)\n\n80592 AR ; B\u0026E; REVERSED\n\n(Prosecutor's AWIRA 158 Mich App 522\n\n(1987)\n\nAppeal)\n\n80839 CSC I AFF'D\n\nAR 159 Mich App 801\n\nFF (1987)\n\nAPPENDIX A\n\nPercentage Not Percent Overall\n\nGuilty of Guilty Guilty Guilty Guilty Guilty\n\nYear Pleas Pleas at Trial at Trial at Trial Percent\n\n1969 5522 84% 820 195 81% 97%\n\n1970 6899 86% 773 342 69% 96%\n\n1971 8144 90% 590 340 63% 96%\n\n1972 7955 90% 489 393 55% 96%\n\n1973 6432 86% 537 492 52% 93%\n\n1974 6723 88% 505 446 53% 94%\n\n1975 5907 83% 759 468 62% 93%\n\n1976 5894 88% 488 314 61% 95%\n\n1977 8970 83% 911 908 50% 92%\n\n1978 5833 81% 810 544 60% 92%\n\nTOTAL\n\n68,279 86% 6,682 4,442 60% 94%\n\nAPPENDIX B\n\nTABLE 52\n\nJury Acquittal Rate and Strength of Evidence\n\n(Per cent jury acquittals of all verdicts in each cell)*\n\nBalance of Contradictions\n\nPro-defendant Neutral Pro-prosecution\n\nNo No No\n\nStrength of Record/ Record/ Record/ Record/ Record/ Record/\n\nProsecution's\n\nCase Stand No Stand Stand No Stand Stand No Stand Average\n\nNormal 65 38 49 30 26 28 40\n\nStrong 45 44 40 21 18 9 30\n\nVery strong 31 13 30 17 21 12 21\n\n(confession)\n\nAverage 44 35 20 33\n\nTotal No Record/Stand Total Record/No Stand\n\n42 25\n\nJudge Acquittal Rate and Strength of the Evidence\n\n(Per cent Judge Acquittals of all Verdicts in each Cell)\n\nBalance of Contradictions\n\nStrength of\n\nProsecution Pro-defendant Neutral Pro-prosecution Average\n\nCase No Record Record No Record Record No Record Record\n\nNormal 29 37 31 22 6 6 24\n\nStrong 19 28 20 11 4 5 15\n\nVery 13 0 10 3 3 0 5\n\nstrong\n\nAverage 25 19 4 17\n\nNo Record Record\n\nTotal 21 14\n\nSee Kalven \u0026 Zeisel, (supra) , pp 160, 162.\n\n[EDITOR'S NOTE: The page numbers of this document may appear to be out of sequence; however, this pagination accurately reflects the pagination of the original published document.]\n\nRiley, C.J. (dissenting).\n\nI disagree with the majority's adoption of the \"bright-line\" rule contained in revised MRE 609(a). I share the concerns and criticisms expressed by Justice Boyle and concur in parts I, II, III, and IV of her Dissent.\n\nFurthermore, in granting leave in People v Allen, People v Pedrin, and People v Smith, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e we directed the parties to include among the issues to be briefed whether this Court should adopt the rule announced in Luce v United States, 469 U.S. 38; 105 S Ct 460; 83 L Ed 2d 443 (1984), that to preserve for appellate review a claim of improper impeachment with a prior conviction, a defendant must testify. In my view, the Court should address this issue and follow the lead of the United States Supreme Court in Luce, by requiring a defendant to testify to preserve a claim of improper impeachment with a prior conviction. However, due to considerations of fundamental fairness, I would opt to apply this rule prospectively.\n\nI\n\nFACTS\n\nA. PEOPLE v GRAY\n\nOn March 25, 1981, the jury convicted the defendant, Dennis Gray, of first-degree felony murder, MCL 750.316; MSA 28.548, and possession of a firearm during the commission of a felony, MCL 750.227b; MSA 28.424(2). The defendant was sentenced to life imprisonment for the first-degree murder conviction, and to a consecutive two-year term for the felony-firearm conviction. His convictions were affirmed by the Court of Appeals on August 3, 1983. People v Gray, unpublished opinion per curiam (Docket No. 59085).\n\nDefendant brought a pretrial motion to suppress evidence of his criminal record for impeachment purposes. Defendant had five prior felony convictions, including a 1969 conviction of assault with intent to rob, a 1972 conviction of attempting to carry a concealed weapon, a 1975 conviction of carrying a concealed weapon, and a 1976 conviction of possession of heroin. The trial Judge suppressed the 1969 conviction of assault with intent to rob, noting the similarity between that offense and the felony-murder charge, but declined to suppress the four other convictions.\n\nDuring the trial, prosecution witness Matta Morgan testified that sometime between 8:30 p.m. and 9:00 p.m. on March 13, 1980, her boyfriend, Lewis Carter, came to her home to visit. The defendant, Morgan's cousin, arrived at her home sometime after midnight. Morgan asked defendant to drive Carter home and agreed to go with them. As Morgan was getting ready to leave, the defendant approached her and inquired whether Carter was carrying any money. Morgan replied, \"He should. He is a numbers man.\" All three then left in defendant's car.\n\nAfter driving for a while, defendant stopped the car, produced a handgun, and demanded money from Carter. After Carter gave defendant his money, defendant shot him several times, fatally wounding him. Defendant drove the vehicle a short distance further, disposed of Carter's body, and drove home, where he gave Morgan $150. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDefendant, testifying on his own behalf, denied robbing or shooting Carter, accused Morgan of being Carter's murderer, and admitted to the four prior convictions. According to defendant's version, Morgan summoned him to her residence during the early morning hours of March 14, 1980. When he arrived he saw Carter's body on the kitchen floor. Morgan told him that she killed Carter because \" didn't think I was serious.\" Defendant then allegedly helped Morgan get rid of the body by putting it into his car and driving around until they found a place to dispose of it.\n\nB. PEOPLE v BROOKS\n\nOn July 30, 1981, the jury convicted defendant, James R. Brooks, of armed robbery, MCL 750.529; MSA 28.797, and felony-firearm, MCL 750.227b; MSA 28.424(2). The defendant was sentenced to imprisonment for a term of fifteen to fifty years for the armed robbery conviction and to the mandatory two years for the felony-firearm conviction. His convictions were affirmed by the Court of Appeals on April 11, 1983. People v Brooks, unpublished opinion per curiam (Docket No. 60075).\n\nDefendant brought a pretrial motion to suppress evidence of his criminal record. Pursuant to MRE 609(b), the trial court excluded defendant's 1967 conviction of carrying a concealed weapon. However, the court denied the motion with respect to defendant's two prior convictions of armed robbery and one prior conviction of unarmed robbery.\n\nThe evidence advanced at trial by the prosecution showed that on November 15, 1980, at approximately 4:00 p.m., defendant entered the Professional Arts Pharmacy in Ferndale, produced a handgun, and ordered the clerk, Anne Nastas, and the pharmacist, Edward Lis, to lie down on the floor. Defendant then took various prescription medicines, drugs, money, and a gun from the premises.\n\nDefendant was identified by Lis, Nastas, and a customer who saw the defendant as he was leaving the store. The customer found Lis and Nastas lying on the floor behind the counter. They told the customer that they had just been robbed.\n\nThe prosecution also presented Leslie Parker, who had been located by the police through a license plate number given them by an unidentified person who had observed Parker's car driving away from the store near the time of the robbery. Parker testified that he had driven a person known to him as \"Tony\" to a drugstore in Ferndale on November 15, 1980, at approximately 4:00 p.m. Parker stated that defendant looked very similar to \"Tony,\" but he could not positively identify him as the same person he had driven to the store.\n\nOn direct examination, defendant testified that he had previously been convicted of armed robbery, that he was in custody for another robbery, and that he knew Edward Lis because they \"did business\" together. Defendant's relationship with Lis started with prescription sales, but Lis eventually agreed to sell defendant pills without a prescription and sometimes gave him pills on consignment which defendant would sell on the street.\n\nDefendant admitted that, at approximately 1:00 p.m. on the day in question, he went to the Professional Arts Pharmacy to obtain Talwin pills. Lis refused to give him the pills and asked defendant for money owed him for pills previously taken on consignment. Defendant denied perpetrating the robbery and maintained that he did not have a firearm in his possession when he was in the pharmacy earlier that day.\n\nC. PEOPLE v PEDRIN\n\nOn July 21, 1982, the jury convicted the defendant, Jeffrey Pedrin, of breaking and entering an unoccupied building with intent to commit larceny. MCL 750.110; MSA 28.305. Defendant was sentenced to a term of imprisonment of four to ten years. His conviction was affirmed by the Court of Appeals on October 25, 1983. People v Pedrin, 130 Mich App 86; 343 NW2d 243 (1983).\n\nThe prosecutor filed a pretrial motion seeking permission to impeach the defendant with evidence of his prior conviction of breaking and entering with the intent to commit larceny. The court determined that the probative value of admitting the prior conviction on the issue of defendant's credibility outweighed its prejudicial effect and granted the motion.\n\nThe defendant's former wife testified that defendant came to her home in Munising at 6:00 a.m. on June 8, 1982, and attempted to open the door. He told her that \"he just took a car.\" Defendant then fell asleep on the front porch, at which time, his former wife called the police. Defendant was arrested on her porch sometime between 8:15 a.m. and 8:30 a.m.\n\nAn automobile dealer testified that a 1983 Ranger pickup truck was stolen from his garage in Newberry on the evening of June 7, 1982.\n\nA state trooper testified that the stolen vehicle was recovered one and three-quarters blocks away from the home of defendant's former wife, and that the keys to the vehicle were found ten to fifteen feet from her side porch. Defendant did not testify and presented no evidence.\n\nD. PEOPLE v ALLEN\n\nOn July 2, 1981, the jury convicted the defendant, Mark Anthony Allen, of first-degree criminal sexual conduct. MCL 750.520b; MSA 28.788(2). Defendant was sentenced to life imprisonment. His conviction was affirmed by the Court of Appeals on November 24, 1982. People v Allen, unpublished opinion per curiam (Docket No. 59151).\n\nOn the first day of trial, defendant moved in limine to suppress evidence of his prior conviction of second-degree criminal sexual conduct. MCL 750.520c; MSA 28.788(3). Stating that defendant would not dispute having sexual relations with the complainant, but would maintain that those relations were consensual, defense counsel argued that the prejudicial effect of prior conviction evidence would far outweigh its probative value on the issue of defendant's credibility.\n\nIn exercising his discretion to determine whether to admit the evidence, the trial Judge considered the similarity of the prior conviction to the instant charge and the fact that the crime involved a one-on-one confrontation between the complainant and the defendant. The court, noting that defendant's credibility would be an important issue, concluded that the probative value of evidence of the prior conviction on the issue of defendant's credibility outweighed its prejudicial effect and denied the motion to suppress.\n\nThe complaining witness, Stacy Dougherty, testified that on March 24, 1981, she was working at Arby's Restaurant on Ford Road in Garden City. At approximately 8:15 p.m., Dougherty took her evening work break and went to the ladies' restroom, where she was confronted by the defendant who was armed with a knife, and who forced her to perform an act of fellatio.\n\nAnother Arby's employee, Kathy Bedford, testified that she went into the ladies' restroom shortly after the assault allegedly occurred and found Dougherty crouched beneath the sink, \"all curled up crying really hard, hyperventilating.\"\n\nThe defendant, who did not testify, presented Kevin Young as his only witness. Young's testimony implied that both he and the defendant had had consensual sexual relations with the complainant in the men's restroom at Arby's prior to the day of the alleged assault.\n\nE. PEOPLE v SMITH\n\nOn June 30, 1981, the jury convicted defendant, Jackie Hagan Smith, of two counts of first-degree criminal sexual conduct, MCL 750.520b; MSA 28.788(2), and one count of assault with intent to murder, MCL 750.83; MSA 28.278. Defendant was sentenced to two terms of sixty to ninety years imprisonment for the criminal sexual conduct convictions, and to life imprisonment for the assault conviction. His convictions were affirmed by the Court of Appeals on August 15, 1983. People v Smith, memorandum opinion (Docket No. 61883).\n\nDefendant moved in limine to suppress evidence of a 1969 breaking and entering conviction and a 1973 manslaughter conviction. The prosecutor stipulated to suppressing the breaking and entering conviction because it was more than ten years old. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The trial Judge granted the motion to suppress that conviction, but denied suppression of the manslaughter conviction.\n\nDefendant also moved in limine to suppress evidence of the complaining witness' line-up identification and any subsequent in-court identification. Defendant argued that his arrest was illegal because it was made without probable cause and that the line-up identification should be suppressed as a fruit of the illegal arrest, as well as any subsequent in-court identification. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The trial court denied the motion based upon its determination that the arresting officers did have probable cause for the arrest. The defendant did not testify.\n\nThe complaining witness, Robin Northover, testified that at approximately 6:00 p.m., on January 21, 1981, she left her aunt's house in Taylor and went with three friends to the Arcade on Beech-Daly Road in Dearborn Heights. At approximately 8:45 p.m., Northover left the Arcade and, on her return walk to her aunt's house, the defendant and two codefendants, Phillip Panik and Dana Minkler, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e drove up alongside her. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Panik leaned out of the car window and asked Northover if she had any \"papers.\" When Northover responded \"no,\" Panik got out of the vehicle and offered her a ride.\n\nNorthover accepted the offer and got into the front seat of the car between the defendant, who was driving the vehicle, and Panik. Minkler was sitting in the back seat. After purchasing some beer, they drove around drinking and smoking marijuana that was mixed with \"crystal.\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Northover smoked a marijuana cigarette with the men, drank one sixteen-ounce beer, and snorted some \"tea.\"\n\nAfter driving around for approximately two hours, the defendant drove to a Seven-Eleven store on Wayne Road to purchase more beer. Panik testified that while they were parked outside the store, two Wayne County Sheriff's deputies drove into the lot. As the deputies were walking into the store, they looked at the defendant's vehicle. Panik was smoking marijuana at the time, and he testified that seeing the police made him feel somewhat uneasy, and that \"we didn't need them to come up to the car.\" The defendants then drove away from the store.\n\nShortly after the parties drove away from the Seven-Eleven store, Minkler reached over the front seat and started grabbing Northover's breasts. Northover pushed Minkler's arm away and then began struggling with Panik and Minkler. Minkler then pulled Northover into the back seat with Panik's assistance. Minkler removed the bottom half of Northover's clothing and unsuccessfully attempted to have sexual intercourse with her. While Smith was still driving, Panik and Minkler traded places. Panik also unsuccessfully attempted to have sexual intercourse with Northover. Smith then stopped the car, got into the back seat while Minkler drove, and had sexual intercourse with Northover. All three of the men subsequently forced Northover to perform fellatio on them which was followed by a third round of sexual activity with the three defendants.\n\nAfter the trio finished sexually abusing Northover, Minkler stated, \"we've got to get rid of her.\" Smith pulled the car over on a dirt road in a wooded area of western Wayne County. Smith grabbed Northover who was naked and dragged her into the woods. When they were out of sight of the car, defendant put his arm around Northover's neck and choked her until she was unconscious.\n\nWhen Northover awoke, she was bleeding profusely from a stab wound to her neck. She packed the wound with snow and walked to a nearby residence where the police were summoned.\n\nFollowing defendant's arrest, he was incarcerated in a local \"lockup\" with co-defendant Panik. Prosecution witness Donald Perdue was also incarcerated there at that time on charges of nonpayment of child support. The prosecutor moved in limine to suppress evidence of Perdue's twenty-six-year-old conviction for assault with intent to do great bodily harm less than murder. The court granted the motion because the conviction was outside the ten-year time limit of MRE 609(b). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Perdue testified regarding various incriminating statements he overheard defendant make during a conversation between defendant and Panik while they were confined.\n\nOn redirect examination, the prosecutor asked Panik several questions about what happened in front of the Seven-Eleven store in an apparent attempt to clarify how well the sheriff's deputies had seen the defendants. The prosecutor asked Panik what he did when he saw the deputies. Panik responded, \" had beer, you know, we was all on parole, we didn't need them to come up to the car.\" Defendant moved for a mistrial due to Panik's statement \"we was all on parole.\" The court denied the motion without explanation. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nII\n\nLUCE v UNITED STATES\n\nIn granting leave to appeal in People v Allen, People v Pedrin, and People v Smith, we directed the parties to include among the issues to be briefed whether this Court should adopt the rule announced in Luce, supra, that to preserve for appellate review the claim of improper impeachment with a prior conviction, a defendant must testify.\n\nIn Luce, the defendant was charged with conspiracy and possession of cocaine with intent to distribute. The trial court denied defendant's motion to preclude the prosecution from using evidence of defendant's prior state conviction of possession of a controlled substance. On appeal, the defendant contended that the trial court abused its discretion under MRE 609(a) in allowing evidence of the prior conviction. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The Sixth Circuit Court of Appeals held that the issue was not reviewable because defendant did not testify at trial.\n\nThe United States Supreme Court affirmed in a unanimous decision, holding \"that to raise and preserve for review the claim of improper impeachment with a prior conviction, a defendant must testify.\" Id., 469 U.S. 43. In so ruling, the Court reasoned:\n\nA reviewing court is handicapped in any effort to rule on subtle evidentiary questions outside a factual context. This is particularly true under Rule 609(a)(1), which directs the court to weigh the probative value of a prior conviction against the prejudicial effect to the defendant. To perform this balancing, the court must know the precise nature of the defendant's testimony, which is unknowable when, as here, the defendant does not testify. [ Id., 41.]\n\nThe Luce Court further explained that \"any possible harm\" flowing from such a ruling in limine is wholly speculative. The Court noted that a trial court can change its ruling in limine after the evidence unfolds, particularly where the defendant's testimony differs from that which was stated in the proffer. Moreover, the Court noted that a reviewing court has no way of knowing whether the prosecution would have actually used the prior conviction to impeach the defendant. A prosecutor may choose not to use an arguably inadmissible prior conviction, particularly where the defendant's testimony can be impeached by other means or when the prosecution's case is strong. Id.\n\nThe defendants essentially argue that the Luce rule is unnecessary, that the concerns expressed by the Luce Court are exaggerated, and that its underlying rationale is contrary to well-established principles in this jurisdiction. I disagree.\n\nMRE 609(a) was derived from FRE 609(a) and similarly requires the court to engage in a balancing process in determining whether the probative value of admitting a prior conviction for impeachment purposes outweighs its prejudicial effect upon the defendant. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Our Court of Appeals has recognized the difficulty inherent in reviewing claims that a trial court erred in allowing a defendant to be impeached with prior convictions outside of a concrete factual context.\n\nThe case of People v Jones, 98 Mich App 421; 296 NW2d 268 (1980), illustrates the difficulty encountered. In balancing the probative value against the prejudicial effect on the issue of credibility, the court must consider, inter alia, the effect on the decisional process if the accused does not testify out of fear of impeachment by prior convictions. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In Jones, the Court recognized that in most cases, a trial Judge is in no position to conclusively rule on that factor until he has heard the prosecution's proofs, learned the substance of the defendant's proposed testimony, and has some idea of what other proofs the defendant will present. The Jones Court keenly observed that the following questions represent a partial list of factors crucial in determining the effect on the decisional process of a defendant's decision not to testify:\n\n(1) Will the defendant's testimony directly contradict the testimony of one or more key prosecution witnesses? When the trial becomes a credibility contest, background information about the disputants is essential to a jury. (2) Will the defendant claim or imply good character, by his own testimony or by a character witness, that his hidden record would refute? MRE 609 does not entitle a defendant to \"pull the wool\" over the jury's eyes. (3) Will the defendant claim a defense such as diminished capacity due to intoxication, mistake, ignorance or accident that becomes far less probable in the light of his prior criminal conduct? A claim by a defendant, for example, that he left the store without paying for an item because he forgot he had put it in his pocket does not go over so well when it becomes known, on cross-examination, that the defendant has been convicted of several thefts before. [ Id., 430.]\n\nThe Jones Court further recognized that, in some cases, defense counsel will make a motion in limine under MRE 609(a), although the defendant had nothing reasonable to say in his own defense and will not testify regardless of the ruling; that he may even prefer an adverse ruling to gain an appealable issue out of an otherwise hopeless trial. Id.\n\nIn light of these inherent problems, the Court of Appeals adopted the following rule expressed in United States v Cook, 608 F2d 1175, 1186 (CA 9, 1979):\n\n\"In future cases, to preserve the issue for review, a defendant must at least, by a statement of his attorney: (1) establish on the record that he will in fact take the stand and testify if his challenged prior convictions are excluded; and (2) sufficiently outline the nature of his testimony so that the trial court, and the reviewing court, can do the necessary balancing contemplated in Rule 609.\" [ Jones, supra, 431.]\n\nThe Luce Court rejected the above procedure because \" a defendant to make a proffer of testimony is no answer; his trial testimony could, for any number of reasons, differ from the proffer.\" Luce, supra, 41, n 5. The Luce Court was also concerned with the potential for planting error requiring reversal. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nI share the concerns of the Luce Court. Furthermore, from my review of the cases, I note that in the overwhelming majority of jurisdictions that have addressed this issue, the rule enunciated in Luce has been adopted. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Moreover, some federal circuits have extended application of the Luce rule to other rulings in limine outside the context of FRE 609(a). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e I am persuaded that the rationale underlying the Supreme Court's adoption of the Luce rule is sound and that it is equally applicable to Michigan practice. Therefore, I would hold that to preserve a claim of error as to the admission of evidence of a prior conviction for impeachment purposes, a defendant must testify.\n\nIt does not follow, however, that the Luce rule should govern the cases before us. This Court has held that three factors must be considered in determining whether a judicially created rule of law should be applied retroactively.\n\n[1] the purpose of the new rule,\n\n[2] the general reliance on the old rule, and\n\n[3] the effect on the administration of Justice. [ People v Nixon, 421 Mich 79, 85; 364 NW2d 593 (1984).]\n\nI believe that the defendants' reliance on the old rule outweighs other considerations favoring retroactive application. The defendants have done everything necessary to preserve the issue under the old rule. Adoption of the Luce rule was not even reasonably foreseeable at the time of their trials. Under these circumstances, I believe it would be unduly harsh to apply the Luce rule to these defendants. Therefore, I would apply the rule only prospectively, i.e., to trials beginning after this decision is final.\n\nIII\n\nANALYSIS\n\nMRE 609(a) pertinently provides:\n\nGeneral rule. For the purpose of attacking the credibility of a witness, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if\n\n(1) the crime was punishable by death or imprisonment in excess of one year under the law under which he was convicted, or the crime involved theft, dishonesty or false statement, regardless of the punishment, and\n\n(2) the court determines that the probative value of admitting this evidence on the issue of credibility outweighs its prejudicial effect and articulates on the record the factors considered in making the determination.\n\nAs noted by the majority, the factors to be considered in performing the balancing required by MRE 609(a)(2) have been gleaned from case law which predated adoption of the Michigan and federal Rules of Evidence. Five factors have repeatedly emerged as the appropriate criteria to be considered in determining whether to allow a defendant witness to be impeached with prior conviction evidence:\n\n(1) the impeachment value of the prior offense (i.e., to what degree does the prior offense relate to the witness' propensity for truthfulness?);\n\n(2) the vintage of the prior offense (the probative value is enhanced with the recency of the prior offense);\n\n(3) the similarity of the prior offense to the crime charged (the greater the similarity the greater the prejudicial effect);\n\n(4) the effect on the decisional process should the accused choose not to testify out of the fear of impeachment;\n\n(5) the centrality of the credibility issue. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThis Court has stated that the underlying purpose in balancing these factors is:\n\n1) put before the jury only those prior convictions indicative of the defendant's Disposition toward truthfulness and veracity; and\n\n2) keep from the jury those convictions which, although they may be indicative of defendant's Disposition towards truthfulness, may interfere with the jury's ability to determine the defendant's guilt or innocence on the basis of the evidence. Such interference is what is meant by \"prejudice.\" [ People v Hughes, 411 Mich 517, 520-521; 309 NW2d 525 (1981).]\n\nI believe that a further purpose properly served by this inquiry is to assure that the jury is not deprived of this traditional device for assessing a witness' credibility when its value to the truth-seeking process is crucial.\n\nAlthough credibility is virtually always at issue in any trial, its significance is critically magnified, and often becomes the dispositive issue, when the trial is essentially reduced to a swearing contest between two opposing witnesses. I believe that this situation may tip the balance in favor of allowing the defendant to be impeached with evidence of prior convictions if the question is otherwise close.\n\nI believe that the existing factors utilized in making determinations under MRE 609(a) constitute appropriate and adequate criteria. The following analyses of the cases sub judice illustrate how these factors should be applied, under varying circumstances, to best serve the purposes behind the sometimes difficult balancing process required by MRE 609(a)(2).\n\nA. PEOPLE v GRAY\n\nIn ruling on defendant Gray's motion to suppress evidence of his five prior felony convictions, the trial court stressed that the case primarily involved a credibility contest between the prosecution's chief witness, Matta Morgan, and the defendant. The court determined that it would be important for the jury to be aware of both the defendant's and the witness' prior criminal records in determining who was telling the truth. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Therefore, the court denied the motion with regard to the three prior convictions of carrying a concealed weapon and the possession of heroin conviction. The court suppressed the assault with intent to rob conviction, recognizing the similarity between that offense and the felony-murder charge, the underlying felony being robbery. Defendant admitted to the four prior convictions on direct examination.\n\nThe Court of Appeals held that the trial Judge properly considered the relevant factors in allowing defendant to be impeached with his prior convictions and that she did not abuse her discretion in doing so.\n\nI agree that the trial Judge did not abuse her discretion in allowing the defendant to be impeached with his four prior felony convictions. The principal issue at trial was the identity of the murderer. Resolution of that issue necessarily depended upon whether the jury believed defendant's or Morgan's version of what happened.\n\nMorgan testified that the defendant robbed and then fatally shot the victim as they were driving in the defendant's car. Defendant maintained that Morgan had murdered the victim in her house and then asked him to help her dispose of the body.\n\nStanding alone, evidence of convictions of carrying a concealed weapon and possession of heroin may not be highly probative of an individual's credibility. However, the value of such evidence to the truth-seeking process was critical because the trial had boiled down to a swearing contest between two opposing witnesses. Thus, it was essential that the jury be aided by any evidence that was probative of credibility. It would indeed have been deceptive to permit the defendant to portray himself as a person who has led a blameless life and as worthy of belief as one who has. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn light of the foregoing, I cannot say that the trial Judge abused her discretion in allowing the defendant to be impeached with the evidence of the prior convictions. Therefore, I would affirm the decision of the Court of Appeals.\n\nB. PEOPLE v BROOKS\n\nDefendant Brooks similarly argues that the trial court erred in admitting evidence of his two prior convictions of armed robbery and one prior conviction of unarmed robbery. In People v Baldwin, 405 Mich 550, 553; 275 NW2d 253 (1979), we held that it was error for a trial Judge to consider the similarity of a prior offense as a factor weighing in favor of admissibility. Although evidence of prior similar offenses is not inadmissible per se for impeachment purposes, such offenses should be admitted for that purpose only when there is a compelling need for such evidence, and then only sparingly. The danger inherent in admitting evidence of a prior conviction for impeachment purposes is particularly acute when the prior offense is the same or similar to the charged offense. The court in Gordon v United States, 127 U.S. App DC 343, 347; 383 F2d 936 (1967), stated:\n\nA special and even more difficult problem arises when the prior conviction is for the same or substantially the same conduct for which the accused is on trial. Where multiple convictions of various kinds can be shown, strong reasons arise for excluding those which are for the same crime because of the inevitable pressure on lay jurors to believe that \"if he did it before he probably did so this time.\" As a general guide, those convictions which are for the same crime should be admitted sparingly; one solution might well be that discretion be exercised to limit the impeachment by way of a similar crime to a single conviction and then only when the circumstances indicate strong reasons for disclosure, and where the conviction directly relates to veracity.\n\nIn the instant case, there were no compelling reasons to impeach the defendant with three prior robbery convictions. I believe that once the jury learned that defendant had committed three prior robberies, the danger that the jury would draw the impermissible inference, i.e., he did it three times before so he probably did it again this time, is too substantial to allow such evidence to be used. The prejudicial effect of the error was exacerbated by its cumulative nature. The admission of two prior convictions of the very same offense and one prior conviction of a very similar offense was unwarranted.\n\nI am persuaded, however, that, although the court clearly abused its discretion in allowing the prior convictions for impeachment purposes, the error was harmless beyond a reasonable doubt under the particular facts of this case.\n\nIt was the defendant's theory that the pharmacist fabricated the robbery allegations because the defendant was in arrears on payments he owed the pharmacist for prescription drugs he had taken on an earlier consignment. However, my review of the record compels the Conclusion that defendant's theory is wholly incredible. Were defendant's story true, the pharmacist and the clerk would have to have been uncommonly good actors. Three different police officers testified that the pharmacist was visibly shaken when he reported the robbery. Furthermore, the question left unanswered by defendant is, why would the pharmacist wait until 4:00 p.m. to report the robbery if the defendant, by his own admission, was in the store at approximately 1:30 p.m. the same day?\n\nDefendant's story also does not posit any explanation as to why the clerk, who had only been working at the store for two months, would perjure herself. There was never any suggestion that she was involved in the alleged illicit business. The clerk corroborated the pharmacist's testimony that an armed robbery had occurred and positively identified the defendant as the perpetrator.\n\nMost importantly, there is absolutely no reason to believe that the customer who entered the pharmacy immediately after the robbery allegedly occurred would have perjured herself. The customer positively identified defendant as the person she had observed in the pharmacy immediately before she approached the counter and found the pharmacist and clerk lying on the floor.\n\nTherefore, in light of the totally unbelievable nature of the defendant's testimony and the overwhelming strength of the prosecution's case, I would find that the error in admitting evidence of defendant's prior convictions for impeachment purposes was harmless beyond a reasonable doubt.\n\nDefendant further argues that the trial court erred in failing, sua sponte, to give a limiting instruction on the use of prior convictions for impeachment purposes pursuant to CJI 3:1:08. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The defendant did not request such an instruction; nor did he object to the trial court's failure to so instruct.\n\nA trial court is under no obligation to give, sua sponte, a limiting instruction to the jury. People v Chism, 390 Mich 104; 211 NW2d 193 (1973); People v DerMartzex, 390 Mich 410; 213 NW2d 97 (1973). This Court held in Chism and DerMartzex that \"in the absence of request or proper objection under present Michigan case law, there is no absolute requirement that the trial Judge give limiting instructions, even though such an instruction should have been given.\" Id., 416. At issue in both cases was the trial court's failure, sua sponte, to give a limiting instruction regarding evidence of other crimes offered for purposes other than impeachment. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In DerMartzex, this Court noted that defense counsel may have declined to request a limiting instruction to avoid highlighting the prior acts to the jury. That rationale is similarly applicable to limiting instructions regarding evidence of prior convictions offered for impeachment purposes. Therefore, the trial court did not err in failing, sua sponte, to give the limiting instruction on the use of prior conviction evidence.\n\nI would affirm the defendant's conviction.\n\nC. PEOPLE v PEDRIN\n\nThe sole issue raised by defendant Pedrin is whether the trial court erred in granting the prosecutor's motion in limine to allow impeachment of defendant with evidence of his October, 1981, conviction of breaking and entering. At the hearing on the prosecutor's motion to allow impeachment with evidence of defendant's prior breaking and entering conviction, defense counsel proffered that, if defendant testified, he would deny breaking into the garage and stealing the truck, and would testify that he had hitchhiked to his former wife's residence in Munising. Defense counsel stated that defendant had no alternative method of presenting his defense because he did not know who drove him to Munising.\n\nThe trial Judge noted that the similarity of the prior conviction to the charged offense, and the defendant's inability to present his defense other than by testifying, militated against its admissibility. Nevertheless, the Judge determined that the probative value of evidence of the prior conviction on the issue of defendant's credibility outweighed the prejudicial effect because the prior offense involved \"moral turpitude\" and \"dishonesty.\" Defendant maintains that he did not testify as a result of that ruling.\n\nThe Court of Appeals, emphasizing that the prior conviction was a theft offense, held that the trial court's decision to admit the evidence was not an abuse of discretion.\n\nI disagree and conclude that the trial court did abuse its discretion in ruling that defendant could be impeached with evidence of the prior breaking and entering conviction. As in Brooks, supra, the similarity of the prior conviction to the charged offense was a factor weighing heavily against its admission, and there were no compelling reasons to permit such impeachment. Gordon, supra. The effect on the decisional process of the defendant's failure to testify out of fear of impeachment similarly weighed against admissibility. There was no alternative way for defendant to present his story that he had hitchhiked to his former wife's residence, and there were less prejudicial means of impeaching the defendant, e.g., by evidence of his statement to his former wife that he \"just took a car.\"\n\nFurthermore, I cannot conclude that the error was harmless. The prosecutor's case was not overwhelming, being based primarily on circumstantial evidence. I cannot say that not even one juror would have voted for acquittal had defendant testified. Therefore, I would reverse defendant's conviction and remand the matter for a new trial.\n\nD. PEOPLE v ALLEN\n\nDefendant Allen argues that the trial court erred in denying his motion to suppress evidence of his conviction of second-degree criminal sexual conduct. Defense counsel proffered that defendant would admit to having had sexual relations with the victim in the women's lavatory at Arby's and that he would maintain that the relations were consensual. The trial Judge noted that the similarity between the prior conviction and the charged offense militated against admissibility. However, recognizing that the crime involved a one-to-one confrontation of the defendant and the victim, and the centrality of the credibility issue, the court denied the motion to suppress.\n\nThe Court of Appeals affirmed, holding that it was not an abuse of discretion to admit the prior conviction under the particular circumstances presented. I agree. The similarity of the prior offense and the fact that it is not an offense like perjury which bears directly on credibility weigh against its admission. Nevertheless, the rationale underlying our decision in Gray, supra, is similarly applicable here where the question of guilt or innocence rests on the credibility of opposing witnesses. Had defendant testified, his credibility, as well as the victim's, would have been the dispositive issue which had narrowed to the question whether the complaining witness had consented to sexual relations. Furthermore, it does not appear that there were any less prejudicial means to impeach the defendant, and he was able to present his consent defense, in part, through the testimony of Kevin Young.\n\nYoung testified that on a previous occasion, he and the defendant had met the victim at the restaurant, at which time both of them engaged in consensual sexual relations with her. The defendant was able to inferentially raise his consent defense and mitigate the prejudicial effect of his failure to testify, while simultaneously impeaching the victim's assertion that the sexual relations were in fact nonconsensual. Had the defendant testified, his testimony would have directly contradicted the victim's testimony on the consent issue. Under these circumstances, I cannot say that the trial Judge abused his discretion in allowing impeachment with evidence of the prior conviction.\n\nDefendant Allen argues further that the trial court erred in denying him the opportunity to impeach the complaining witness, Stacy Dougherty, with her testimony at the preliminary examination. Defendant argues that Dougherty's testimony at the examination was inconsistent with her testimony at trial.\n\nAt the preliminary examination, Dougherty testified that when she walked into the ladies' restroom the door to the stall for handicapped persons was open and she noticed someone standing in that stall. She could not tell whether the person standing there was a male or female, being able to see only the person's backside, tan corduroy pants, and an orange kinky hairdo. After entering the stall adjacent to the handicapped stall and latching the door, she came back out immediately because she thought that something was \"fishy.\" Witness Dougherty was washing her glasses at the sink when the defendant approached her and told her to perform an oral sex act. She said \"no\" and the defendant then forced her to do so. Defense counsel asked if defendant had asked her to perform the sex act with the understanding that he would reciprocate by engaging in oral sex with her. Dougherty stated that she could not recall.\n\nAt trial, Dougherty testified that when she walked into the ladies' restroom she could only see the person in the handicapped stall from approximately the knee down on one leg and that she did not notice what color pants the person was wearing. She also testified that when she first went into the restroom, she thought the person standing in the handicapped stall may have been sick. She denied that she had agreed to engage in a mutual sex act with defendant.\n\nDuring cross-examination, defendant attempted to impeach Dougherty with the preliminary examination transcript in regard to the above differences in her testimony. Pursuant to the prosecutor's objection, the trial court declined to allow defense counsel to impeach Dougherty with her preliminary examination testimony as a prior inconsistent statement. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe Court of Appeals held that there was no inconsistency between Dougherty's preliminary examination testimony and her testimony at trial; thus, the trial Judge did not abuse his discretion in denying the admission of Dougherty's examination testimony.\n\nAs a general rule, the only contradictory evidence that is admissible for impeachment purposes is that which directly tends to disprove the exact testimony of the witness. People v McGillen #1, 392 Mich 251; 220 NW2d 667 (1974); People v Johnson, 113 Mich App 575, 579; 317 NW2d 689 (1982). The question of inconsistency is one within the discretion of the trial Judge. People v Graham, 386 Mich 452, 457; 192 NW2d 255 (1971). In the instant case, I am not persuaded that the trial Judge abused his discretion in ruling that Dougherty's trial testimony was not inconsistent with her testimony at the preliminary examination. Although Dougherty's preliminary examination testimony contained certain details about defendant's clothing which she was unable to recall at trial, her trial testimony was not inconsistent, but rather, it appears to reflect a lapse in memory. Similarly, at the preliminary examination, complainant testified that she could not recall if defendant had asked her to consent to a sexual act and subsequently testified at trial that he did not. Considered in the total context of Dougherty's testimony, I do not view these two variances in the testimony as contradictory. Therefore, I conclude that the trial Judge's refusal to allow impeachment with the preliminary examination testimony was not an abuse of discretion, thus I would affirm defendant's conviction.\n\nE. PEOPLE v SMITH\n\nDefendant Smith argues that the trial court erred in denying his motion to suppress evidence of his prior manslaughter conviction. The trial court ruled that the prior conviction would be admissible for impeachment purposes without explanation.\n\nThe Court of Appeals affirmed defendant's conviction finding no error on this issue.\n\nDefendant first argues that the trial Judge erred by failing to state, on the record, the factors he considered in deciding to admit the manslaughter conviction and that reversal is required. MRE 609(a)(2) provides in part that the court must articulate on the record the factors it considered in making its determination. The trial Judge in the instant case did not comply with that requirement. Nevertheless, the record establishes that the trial Judge was aware of his discretionary power to exclude use of prior convictions to impeach defendant and that he considered the relevant factors in reaching his decision to admit the manslaughter conviction. I would deem the error to be harmless under these circumstances. People v Eggleston, 148 Mich App 494; 384 NW2d 811 (1986), lv den 426 Mich 862 (1986).\n\nDefendant further argues that the trial Judge misapplied the relevant factors and abused his discretion in denying the motion to suppress. I agree. Defendant aptly notes that all of the pertinent factors militate against admissibility. Manslaughter is not an offense which is very probative of credibility. Such convictions should only be admitted when the weight of the other factors tips the balance in favor of admissibility.\n\nIn this case, all of the remaining relevant factors militate against admissibility. Manslaughter is sufficiently similar to the charged offense of assault with intent to murder to be deemed a factor weighing against admissibility. There were no compelling reasons to justify the use of a similar conviction. The offense did not involve a one-to-one confrontation of the defendant and the victim, nor did the determination of defendant's guilt or innocence reduce itself to a credibility contest between two key witnesses. Thus, the need for such impeachment evidence was marginal.\n\nIn light of the foregoing, I believe the trial Judge abused his discretion in declining to suppress the manslaughter conviction. Nevertheless, I conclude that the error was harmless beyond a reasonable doubt due to the overwhelming strength of the prosecution's case. The victim's positive identification of the defendant was well substantiated in light of the face-to-face confrontation she had with her assailants over several hours. Most importantly, the two codefendants, Panik and Minkler, consistently testified in minute detail of defendant's complicity in perpetrating the offense. Under these circumstances, I find it inconceivable that the jury would have acquitted defendant on the basis of his tenuous purported defense of misidentification. Thus, the trial Judge's erroneous ruling on defendant's motion to suppress use of his prior manslaughter conviction does not constitute grounds for reversal of defendant's conviction.\n\nSmith raises several other issues which I believe merit Discussion. First, defendant argues that the trial court erred in denying his motion to suppress evidence of the line-up identification and any subsequent in-court identification. At trial, defendant argued that he had been arrested without probable cause, that his line-up identification should be suppressed as a product of the illegal arrest, and that any subsequent in-court identification would be the product of the illegal line-up identification which similarly should be suppressed. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The trial court denied the motion. Detective Kohlstrand subsequently testified to the line-up identification of the defendant by the complaining witness, Robin Northover, who also identified defendant at trial as one of her assailants.\n\nOn this appeal, defendant has abandoned his theory that the arrest was illegal because it was made without probable cause. Defendant now argues that the arrest was illegal because there were no exigent circumstances justifying an arrest without a warrant, relying on Payton v New York, 445 U.S. 573; 100 S Ct 1371; 63 L Ed 2d 639 (1980).\n\nGenerally, issues not raised in the trial court will not be considered on appeal. People v Lynch, 410 Mich 343, 351; 301 NW2d 796 (1981); People v Snow, 386 Mich 586, 591; 194 NW2d 314 (1972). While exception to the general rule has been made on numerous occasions in both civil and criminal cases, a prerequisite to having new issues considered on appeal is that there must be a sufficient record to allow for thorough judicial review. Id.; Meek v Wilson, 283 Mich 679, 689; 278 NW 731 (1938).\n\nIn the instant case, an adequate record was not established to resolve the new arguments raised by the appellant here. Defendant's contention that the police made an illegal warrantless entry into his home to effect his arrest is clearly not supported by the record. The evidence and arguments advanced on defendant's motion to suppress the identification evidence related solely to whether there was probable cause for the arrest. No evidence was presented concerning the circumstances surrounding defendant's arrest, nor can such evidence be gleaned from elsewhere in the record. Although there is no question that the defendant's arrest was made without a warrant, it cannot be determined from the record whether the arrest was justified by one of the various exceptions to the warrant requirement. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Therefore, the issue has not been properly preserved for appellate review. Id.\n\nDefendant next argues that the trial court erred in admitting photographs and slides of the victim's wounds. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e It is well-settled that the admission of photographic evidence lies within the sound discretion of the trial Judge. People v Eddington, 387 Mich 551, 562; 198 NW2d 297 (1972). The court's decision to admit photographs will be upheld if they were substantially necessary or instructive to show material facts and it does not appear that they were offered in an attempt to excite passion or prejudice. People v Falkner, 389 Mich 682, 685; 209 NW2d 193 (1973). Assuming relevance of the photographs, it must still be determined whether the probative value of admitting the photographs outweighs the prejudicial effect. Id.\n\nIn the instant case, defendant argues that the photographs and slides admitted into evidence were gory, inflammatory, and irrelevant to any issue in dispute. Defense counsel indicated that he would stipulate to the sexual assault and the assault with intent to murder because the defense was that the defendant was not the perpetrator.\n\nThe prosecutor argues that the photographs were relevant to proving the intent element of the assault with intent to murder charge notwithstanding defendant's offer to stipulate to that element. There is no rule that stipulations per se negate admissibility. People v Green, 74 Mich App 351, 357; 253 NW2d 763 (1977), aff'd 405 Mich 273; 274 NW2d 448 (1979). The prosecution bears the burden of establishing each and every element of the charged offense beyond a reasonable doubt, and the jury must be instructed to consider each element regardless of stipulation. Id. See also People v Reed, 393 Mich 342; 224 NW2d 867 (1975), cert den 422 U.S. 1044, 1048 (1975). Therefore, defendant's argument that the offer to stipulate to the elements of the crime rendered admission of the photographs irrelevant to proving the element of intent is without merit.\n\nFurthermore, I believe the probative value in admitting the photographs outweighed the danger of unfair prejudice. There were no witnesses to the slashing of the victim's neck. The victim was herself rendered unconscious before her neck was cut. The photographs and slides at issue depict the location of the wound and its severity. Coupled with the treating physician's testimony, I believe the photographs and slides were highly probative of defendant's intention to kill the victim. Photographs that are admissible for a proper purpose are not rendered inadmissible merely because they vividly depict a gruesome injury, even though they may arouse the passions or prejudice of the jurors. Eddington, supra, 563. Thus, I cannot conclude that the trial Judge abused his discretion in admitting the photographs and slides at issue.\n\nNext, defendant contends that the trial court erred in denying his motion for a mistrial. Defendant argues that he was entitled to a mistrial when witness Panik testified on redirect examination that \"we was all on parole\" when the prosecutor was questioning him about the encounter with two Wayne County Sheriff's deputies in front of the Seven-Eleven store. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIt is well settled that the decision to grant or deny a motion for mistrial rests within the sound discretion of the trial court. People v Kelsey, 303 Mich 715; 7 NW2d 120 (1942); People v Holly, 129 Mich App 405, 415; 341 NW2d 823 (1983). To constitute error requiring reversal in a criminal trial, the error complained of must have been so extreme that it deprived the defendant of a fair trial and resulted in a conviction that was a miscarriage of Justice. People v Ritholz, 359 Mich 539, 559; 103 NW2d 481 (1960); MCL 769.26; MSA 28.1096. A volunteered and unresponsive answer to a proper question is generally not cause for granting a mistrial. Kelsey, supra.\n\nFrom my review of the record, I am not persuaded that Panik's volunteered and unresponsive answer to the prosecutor's question deprived defendant of a fair trial. The statement \"we was all on parole\" was ambiguous, and it cannot be said that it was an improper and prejudicial reference to the defendant's prior record. It is highly unlikely that this one isolated, ambiguous, and unresponsive comment resulted in significant prejudice to defendant. Therefore, I cannot say that the trial court abused its discretion in denying the motion for a mistrial.\n\nFinally, the defendant also argues that reversal is warranted because he was not permitted to impeach prosecution witness Donald Perdue with evidence of Perdue's 1955 conviction of assault with intent to do great bodily harm less than murder. He relies on the Court of Appeals decision in People v Redmon, 112 Mich App 246; 315 NW2d 909 (1982). \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The trial court agreed with the prosecutor that such impeachment was precluded under MRE 609(b) because of the age of the conviction.\n\nMRE 609(b) provides:\n\nEvidence of a conviction under this rule is not admissible if a period of more than ten years has elapsed since the date of the conviction or of the release of the witness from the confinement imposed for that conviction, whichever is the later date.\n\nCrucial to our analysis of this issue is an examination of the unique facts in Redmon. Defendant Redmon was charged with inciting, inducing, or exhorting prosecution witness Russell Haynes to commit murder. At her 1980 trial, the defendant sought to put before the jury the fact that between 1940 and 1967 Haynes had been convicted eight times of larceny and fraud-related activities. The trial court reluctantly disallowed such impeachment under authority of MRE 609(b).\n\nThe Court of Appeals reversed, stating that the Sixth Amendment right to confrontation took precedence over the court rule, as applied to a prosecution witness, under the peculiar facts in Redmon. The Court emphasized that the defendant's theory was that Haynes had lied to authorities about the defendant's involvement in an effort to ward off a severe sentence, which he feared because of his past extensive criminal record.\n\nThe instant case is clearly distinguishable. The compelling need for admission of the evidence of the prior conviction which was present in Redmon is not present here. Perdue's prior conviction was not relevant to the defense theory; indeed, it had nothing to do with the facts of the instant case. Further, I note that Perdue's twenty-six-year-old conviction was not for an offense bearing on truthfulness, and that defendant was permitted to explain fully the reason for Perdue being in jail with defendant, i.e., nonpayment of child support.\n\nOur Conclusion that Redmon is distinguishable makes it unnecessary for us to discuss the correctness of the Court of Appeals opinion in Redmon. Nonetheless, I emphasize the narrowness of that decision, and further observe that nothing in MRE 609(b) restricts its applicability to defendants who testify as opposed to other witnesses.\n\nFinding no error, I would decline to extend the Redmon decision to encompass the facts in this case, and would affirm the decision of the Court of Appeals.\n\nIV\n\nSUMMARY\n\nOn the issue for which leave was granted, I would hold that to preserve a claim of improper impeachment with a prior conviction for appellate review, a defendant must testify. However, because considerations of fundamental fairness compel prospective application of the rule, it should not govern the cases at bar.\n\nIn People v Gray, I would hold that the trial court did not abuse its discretion in allowing the defendant to be impeached with evidence of three prior convictions of carrying a concealed weapon, and one prior conviction of possession of heroin.\n\nIn People v Brooks, I would hold that the trial court abused its discretion in allowing the defendant to be impeached with two prior robbery convictions and one prior unarmed robbery conviction due to the similarity of those offenses and the charged offense of armed robbery. However, I find the error harmless beyond a reasonable doubt. I find no merit in the remaining issue raised in Brooks.\n\nIn People v Pedrin, I would hold that the trial court abused its discretion in allowing the defendant to be impeached with a prior breaking and entering conviction due to the similarity of that offense and the charged offense of breaking and entering.\n\nIn People v Allen, I would hold that the trial court did not abuse its discretion in allowing the defendant to be impeached with a prior conviction of second-degree criminal sexual conduct, notwithstanding the similarity of that offense to the charged offense of first-degree criminal sexual conduct. The impeachment evidence was properly ruled admissible due to the one-to-one nature of the offense, the centrality of the credibility issue, the lack of an alternative method of impeachment, and the defendant's ability to present his theory of defense without testifying. I find no merit in the remaining issue raised in Allen.\n\nIn People v Smith, I would hold that the trial court abused its discretion in ruling that defendant could be impeached with evidence of his prior conviction of manslaughter. However, I find the error harmless beyond a reasonable doubt. Further, after careful consideration of the remaining issues raised in Smith, I conclude that there is no basis for reversal.\n\nBoyle, J. (dissenting).\n\nI\n\nThe majority has today replaced the trial Judge's discretionary authority to advance the truth-seeking process with its own view of the proper use of impeachment evidence. The majority's opinion would, for example, categorically prevent an accused drug seller from being impeached with evidence of prior convictions of the sale of drugs, and a defendant accused of sexual offenses from being impeached with prior convictions of sexual offenses. As a result, the majority's limitation of trial-Judge discretion will multiply the opportunity for even the guilty defendant to escape punishment and make the discovery of truth more difficult.\n\nThe majority imposes this policy choice on the criminal Justice problems of this state on the basis of its \"perception\" of the need for a new rule. It does so with a citation to the law of West Virginia and on the basis of social science studies of mock jurors, without analysis of the impact on the factual accuracy of jury verdicts and without consideration of existing safeguards protecting the innocent. If our \"relatively low regard for truth-seeking is perhaps the chief reason for the dubious esteem in which the legal profession is held,\" today's decision will provide further reason \"to question our service in the quest for truth,\" Frankel, The search for truth: An umpireal view, 123 U Pa L R 1031, 1040, 1041 (1975).\n\nThe prosecution must be held to the burden of proving guilt beyond a reasonable doubt, and safeguards must exist permitting post-conviction review of claims of erroneous conviction. The issue here, however, does not involve a question of effectuating a constitutional right or of assuring review of a claim of innocence. The only issue addressed today is that of a new policy regarding impeachment with prior convictions. I disagree with the majority's determination to impose upon our jurisprudence a policy that automatically excludes or includes1a categories of prior convictions for impeachment. In my judgment, a policy rule that takes relevant and reliable evidence away from the factfinder is justifiable only if it advances countervailing interests equal or superior to the truth-finding function. The revised interpretation of MRE 609 here announced and the new version of MRE 609 here adopted do not attempt such an analysis and perforce do not meet that burden.\n\nThe rules of automatic exclusion and admission and the artificially circumscribed discretion adopted today create a conclusive presumption against the admission of certain prior convictions and a conclusive presumption in favor of the admission of others. Despite the failure to establish a deficiency in the system that requires this result,2a the opinion suppresses relevant and unquestionably reliable evidence, proof beyond a reasonable doubt of the commission of a prior felony by the defendant.\n\nBecause the \"clarified\" balancing test is applied to cases which antedate today's decision, validly obtained convictions will be reversed, and appellate resources will be taxed as the parameters of the new \"rules\" are developed. Neither this clarification nor the bright-line rules can, in good faith, be justified by rule-making authority. No comment, no input, no weighing of policy concerns by the bench and bar, has been allowed. The Court has simply created new law not even argued by the parties in these cases. Cases are reversed today and will be reversed hereafter, not because our current rule was violated, or because the constitution was violated, or because juries have returned verdicts that are not supported by the evidence. These cases will be reversed solely because a majority of this Court believes that trial Judges cannot be trusted to appropriately exercise Rule 609 discretion and lay jurors inevitably misuse prior-conviction evidence.\n\nAs with other experiments, the system will stagger and lurch through a period of adjustment silently attended by the human and social costs that are the price of today's undertaking. In the interim, before the imperatives of the system gain the approval of a new majority of this Court, today's opinion will have impeded truth finding and undermined the institutional integrity of the trial judiciary and of the jury system.\n\nThe suggestion that these per se rules advance \"the integrity of fact finding\" is on an intellectual par with a claim that book burning advances knowledge. The essence of every censor's position is that readers cannot be trusted to properly use the knowledge they might obtain.\n\nII\n\nCross-examination, \"the greatest legal engine ever invented for the discovery of truth,\" 5 Wigmore, Evidence (Chadbourn rev, 1974), § 1367, p 32, is derailed today because of a policy decision that eschews legal analysis in favor of the majority's \"perception\" of the need for a new rule. The result is the replacement of trial-Judge discretion with the majority's value system; the cost is making the discovery of truth more difficult.\n\n1\n\nThe deficiency in the majority's jurisprudential approach to this issue is aptly illustrated by Professor Grano's explanation of the analogous objectives of rules of criminal procedure:\n\nWhen the guilty are convicted and the innocent are acquitted, the result does \"accord with substantive law,\" but when the innocent are convicted or the guilty escape, the substantive law is defeated. Truth, therefore, must be the primary goal of procedure. Indeed, truth must be the goal of any rational procedural system, whether accusatorial or inquisitorial. Reasonable persons may disagree about the better method of determining truth, but no rational person touts a procedural system because it makes discovery of truth more difficult.\n\nComplexity is introduced, however, by an unavoidable dilemma: \"the easier it is . . . to prove guilt, the more difficult does it become to establish innocence.\" While the prevalence of truth is preferable, if error is inevitable, a guilty person should escape before an innocent one is convicted. Thus, despite the desire for truth, we sometimes deliberately increase the risk of error to ensure that the innocent are acquitted. For example, the standard of proof beyond a reasonable doubt undoubtedly helps more guilty than innocent defendants. Nevertheless, we appropriately would resist any effort to lower the burden of proof, for the overall gain in the number of correct verdicts would come at an unacceptable cost.\n\nappropriate focus must be on the anticipated benefits to be derived from the rule, the scope of the risk [of convicting innocent persons], and the existence of other safeguards to counter the risk. . . .\n\nBecause truth is the primary goal, we should prefer those procedures for protecting the innocent that do not increase the risk of erroneous acquittal. [Grano, Implementing the objectives of procedural reform: The proposed Michigan rules of criminal procedure -- part I, 32 Wayne L R 1007, 1011-1012, 1014-1015 (1986).]\n\nThe majority does not attempt to evaluate truth seeking against competing concerns or consider alternative safeguards for both truth seeking and a competing concern. It wholly fails to acknowledge the fact that the legal system presumes that juries will follow instructions, and that, where that presumption has been overcome, it has been where the inadmissible evidence contained elements of unreliability or unlawfulness and was offered in the case in chief to create an \"overwhelming probability\" of improper substantive use. Jackson v Denno, 378 U.S. 368; 84 S Ct 1774; 12 L Ed 2d 908 (1964).\n\nThus, in Bruton v United States, 391 U.S. 123; 88 S Ct 1620; 20 L Ed 2d 476 (1968), the Court rejected the government's argument that in a joint trial use of a confession to prove the confessor's guilt promoted truth, because severance was an alternative means to achieve truth, because arguments of speed, economy, and convenience were insufficient to justify infringement on the non-testifying defendant's right of confrontation, and because evidence of the confession became \"intolerably\" unreliable when the confessing accomplice did not testify.\n\nThe balancing analysis produced a different result in the Court's unanimous opinion in Tennessee v Street, 471 U.S. 409; 105 S Ct 2078; 85 L Ed 2d 425 (1985), where the Court held that the defendant's rights under the Confrontation Clause were not violated by the introduction of the accomplice's confession. Here, by contrast with Bruton, and as in this situation, the evidence was not introduced in the case in chief. Rather, the defendant took the stand and testified that his own confession had been coercively derived from the accomplice's statement. The state called the sheriff who testified in rebuttal that respondent was not read the accomplice's confession and then read that confession to the jury. The trial Judge instructed the jury that the confession was not admitted for the purpose of proving its truthfulness, but solely for the purpose of rebuttal. The Court noted that, because the accomplice's confession was not introduced in the case in chief on the issue of guilt, the only similarity to Bruton was the fact that the confession could have been misused by the jury as evidence of the defendant's guilt. The jury, however, was \"pointedly\" told not to consider the truthfulness of the statement. Thus, the critical question for the Court was \"whether, in light of the competing values at stake, may we rely on the 'crucial assumption' that the jurors followed the 'instructions given them by the trial Judge?'\"\n\nThe Court concluded:\n\nHad the prosecutor been denied the opportunity to present Peele's confession in rebuttal so as to enable the jury to make the relevant comparison, the jury would have been impeded in its task of evaluating the truth of respondent's testimony and handicapped in weighing the reliability of his confession. Such a result would have been at odds with the Confrontation Clause's very mission -- to advance \"the accuracy of the truth-determining process in criminal trials.\" [ Tennessee v Street, supra, p 415.]\n\nMoreover, unlike the situation in Bruton, in Street there were no alternatives that would have both assured the integrity of the trial's truth-seeking function and eliminated the risk of the jury's improper use of evidence.\n\nThe majority's attempt to distinguish Street does not come to grips with the fact that the evidence there was not offered in the case in chief or that the Court concluded that the jurors could be relied upon to follow instructions. The fact is that the defendant had denied the truth of his confession, and it is simply incorrect to assert that the evidence provided little if any inculpatory information \"that was not already before [the jury] in defendant's own confession.\" Ante, p 573, n 10. The improper purpose prohibited by the instruction was the jurors' misuse of the accomplice's confession implicating the defendant. That is, the potential prejudice to the defendant was that the jury would use the accomplice's confession not solely to find that defendant's denial was untrue, but also to conclude that the accomplice's statement was substantive evidence of defendant's guilt. To use the majority's terminology, the veracity of defendant's denial of his confession had to be \"mediated\" through the knowledge that the absent accomplice had confessed and incriminated the defendant as an active participant in the decedent's hanging, an obviously far more damaging \"independent and improper basis for a guilty verdict,\" ante, p 572, n 10, than the situation presented by impeachment with prior convictions.\n\nThe Court has also upheld the efficacy of limiting instructions and concluded that evidence of a defendant's prior criminal convictions could be introduced for the purpose of sentence enhancement, so long as the jury is instructed it could not be used to determine guilt, Spencer v Texas, 385 U.S. 554; 87 S Ct 648; 17 L Ed 2d 606 (1967).\n\nIn Spencer, supra, p 561, Justice Harlan noted that the \"conceded possibility of prejudice\" was \"outweighed by the validity of the State's purpose in permitting introduction of the evidence\" and that \" defendants' interests are protected by limiting instructions . . . and by the discretion residing with the trial Judge to limit or forbid the admission of particularly prejudicial evidence . . . .\" Justice Harlan further noted that instructions to a jury limiting the proper use of evidence elicited on cross-examination of defense witnesses as to defendant's character and a prior conviction \"are no more difficult to comprehend or apply than those upon various other subjects,\" id., p 563. The Court has also permitted illegally seized evidence, Walder v United States, 347 U.S. 62; 74 S Ct 354; 98 L Ed 503 (1954), and improperly obtained confessions, Harris v New York, 401 U.S. 222; 91 S Ct 643; 28 L Ed 2d 1 (1971), to be used by the jury in assessing credibility, so long as the jury is properly instructed. Thus, the United States Supreme Court has created a narrow exception to the rule that juries are presumed to follow instructions where there is an \"overwhelming probability\" that the jury cannot follow the instruction and the result would be devastating to the defendant's case, Richardson v Marsh, 481 U.S. ; 107 S Ct 1702; 95 L Ed 2d 176 (1987), a proposition that the majority has here failed to demonstrate.\n\nThese cases illustrate that a proper approach to the problem of potential prejudice requires an inquiry as to: whether the possibility of prejudice is protected by trial-Judge discretion and limiting instructions; whether there is no alternative short of suppression of evidence to uphold the competing concern; and whether, if alternatives exist, the value underlying the competing concern has been fairly served. Application of these principles to the question of potential prejudice from impeachment with prior convictions demonstrates that there are existing safeguards against the misuse of prior convictions, and that there is no alternative to the suppression of truthful evidence relevant to the credibility question other than trial-Judge discretion and the limiting instruction.\n\nIt might be observed, as the majority at one point does, ante, p 572, n 10, that the law is itself rendered irrelevant because this decision is based not on constitutional grounds, but on policy. The majority does not, however, evaluate the very factors most crucial to the adoption of a wise policy. The majority's policy does not balance the negative effect on the truth-finding function against the benefit of the elimination of potential prejudice. Nor does the majority evaluate the significant alternative barriers to the improper use of \"bad man\" evidence that the system has erected,3a barriers that both protect against the risk that innocent persons are convicted and insure that the fact-finding process is not emasculated.\n\nThe majority does not weigh the fact that a magistrate must determine that there is probable cause to believe a defendant is guilty, that a trial Judge must assure through motion practice that the evidence has been obtained through lawful means, that Rule 404(a) precludes the use of \"bad man\" evidence as substantive proof of guilt, that the prosecutor must present in the case in chief evidence sufficient to permit a rational jury to find guilt beyond a reasonable doubt, or be directed out of court, People v Hampton, 407 Mich 354; 285 NW2d 284 (1979), and Jackson v Virginia, 443 U.S. 307; 99 S Ct 2781; 61 L Ed 2d 560 (1979), that the prosecutor may not comment on the defendant's failure to testify, Griffin v California, 380 U.S. 609; 85 S Ct 1229; 14 L Ed 2d 106 (1965), and that a trial court has discretion to grant a new trial where it has concluded that the verdict is against the great weight of the evidence, People v Hampton, supra, p 375.\n\nThe majority further fails to focus on the fact that it is only where a defendant exercises a right that a defendant alone possesses, and elects to testify, that the credibility issue is presented. Before this point in the process, the safeguards in the system assure us of that which every trial Judge and lawyer knows, that \"the preponderant majority,\" Frankel, (supra) , p 1037, of defendants are guilty of the charged offense or a lesser or related offense. At the point in a trial where the issue is the credibility of the defendant's testimony, the prosecution has carried the burden of proving guilt in the case in chief without resorting to prior record evidence, and the risk of convicting an innocent person has been tempered. Reliance on the discretion of the trial Judge and the limiting instruction to curb a potential for prejudice more effectively advances the goal of protecting the innocent while not increasing the risk of erroneous acquittal than suppressing truthful evidence relevant to the very issue the jury must decide.\n\nThe cogent analysis of the United States Supreme Court teaches that when a reason for erecting a barrier against truth is advanced, the burden on truth seeking and the risk of erroneous conviction must be evaluated. The majority simply ignores the fact that when the prosecution has carried the burden of proving guilt beyond a reasonable doubt without resort to the use of prior conviction evidence, the risk of convicting the innocent through misuse of the evidence has been diminished, and the issue is whether the factfinder should be deprived of relevant and reliable evidence when a defendant takes the stand and denies guilt.\n\nThe majority's lack of assessment of the alternative means to suppressing reliable and relevant evidence also explains the failure to acknowledge that the Legislature of this state has given defendants an additional protection against the possibility that a lay jury might misuse evidence of prior convictions. In Michigan, the defendant has the sole right to select a bench trial or a trial by jury, MCL 763.3; MSA 28.856; People v Stoeckl, 347 Mich 1; 78 NW2d 640 (1956). Given the choice between a Judge who until today was presumed to have the ability to limit prior conviction evidence to its proper purpose or an untrained and inexperienced jury, it is simply illogical and unfair to permit a defendant to select a lay jury and then to claim that its inability to properly assess reliable evidence requires suppression.\n\nEach exception to the truth-finding function bears a heavy burden. Contrary to the majority's assumption, the fact that one exception exists is no evidence that another should be created. The majority itself slides along the \"slippery slope\" from the exclusion of prior convictions in the case in chief to exclusion of convictions on cross-examination without a clear understanding of the protection already afforded a defendant, or a persuasive answer to the question as to why, even if jurors might in a given case not be able to restrict use of prior conviction evidence to the issue of credibility, truthful evidence should be subject to generic suppression in the forum that exists for its determination.\n\nIn sum, the majority does not carry the burden of establishing the need for rules which generally exclude classes of evidence. If that need is indeed established by the jury's inability to \"mediate\" a proper use through a potential misuse, the need is revealed as an attack on the fact-finding system itself because, clearly, both jurors and Judges as factfinders are called upon to \"mediate\" in every situation where evidence is admitted for a limited purpose.\n\nThe majority has ignored the policy expressed in a state statute, distorted the rule-making process, and rejected the approach to this issue which is followed by the overwhelming majority of other states,4a by the federal courts, and by this state until today.\n\nThe majority has not only failed to consider the protections against potential prejudice that exist in our system, it has wholly failed to balance the likelihood of a negative effect on the judicial system, the risk of erroneous acquittal, against the systemic gains to be achieved by the new rules. The majority analysis indicates that of the twenty-five cases in abeyance, eighteen defendants were to be, or were, impeached with bright-line5a excludable convictions.\n\nThe majority accuses the Dissent of \" . . . that the defendant is almost certainly guilty . . . .\" (Ante, p 603.) I have not assumed that any given defendant is guilty, but, rather, have attempted to urge the majority to a rational examination of the implications of its new policy6a for the criminal Justice system.\n\nIf an innocent person is convicted despite all the current protections of the system, the system has, in that instance, failed. Thus, a just system must provide a method to insure that an arguably wrongfully convicted individual has an avenue for redress. By contrast, the majority has converted a potential for an undesirable and deplorable consequence in individual instances into a presumption of prejudice mandating a systemic revision that prevents juries from learning of generic types of prior convictions.\n\nThe rules announced today impede the task of weighing and evaluating the truth of testimony. Here, unlike the situation in Bruton, or in Cruz v New York, 481 U.S. ; 107 S Ct 1714; 95 L Ed 2d 162 (1987), the prosecutor's obligation to prove guilt beyond a reasonable doubt in the case in chief, Rule 404 itself, and the right to waive a jury, provide alternative means to protect the legitimate interest in avoiding misuse of \"bad man\" evidence. Categorical denial of impeachment evidence impedes the jury \"in its task of evaluating the truth of respondent's testimony\" in opposition to \"the Confrontation Clause's very mission -- to advance 'the accuracy of the truth-determining process in criminal trials.'\" Tennessee v Street, supra, p 415.\n\n2\n\nThe majority's preference for bright-line rules also constricts the trial court's responsibility to \"exercise reasonable control over the mode and order of interrogating witnesses and presenting evidence so as to (1) make the interrogation and presentation effective for the ascertainment of the truth . . . .\" MRE 611; see MRE 102. To a person who is or has been a trial Judge, this is the most disturbing aspect of the new rules, and the dimension of the rules most revealing of the majority's lack of experience with the trial court's role.\n\nThe majority fails to understand that the principal business of the trial Judge in a jury trial is ruling on evidence. With few exceptions, these rulings are not either/or decisions. Relevancy decisions are judgment calls committed to the trial court's discretion. The rules of the game would consume the purpose of a trial if trial Judges did not assess the purpose and value of the evidence in the evolving context of the trial. To a trial Judge, the trial is not an abstraction, but an evolving process requiring ongoing evaluation. It was to that evolving reality that Justice Ryan spoke in observing that, as with other rulings on relevancy, the Rule 609 decision requires assessment of \" importance to the truth-seeking process, not merely the prospects for acquittal, of obtaining the defendant's version of the events in question.\" People v Wakeford, 418 Mich 95, 116; 341 NW2d 68 (1983).\n\nSkillful lawyers on both sides of the counsel table know that advance bright-line rulings from a trial Judge can benefit their client's theory of the case. The responsibility of the trial Judge, however, is not to monitor the gladiators' battle, but rather to assure that the advocates' perspectives do not unfairly blindside the truth-finding process. The trial Judge occupies an area within the arena of effective representation by defense counsel and zealous but evenhanded presentation by the prosecution. In this area, the primary obligation of the Judge is not to the adversaries, but to the trial process and to the twelve persons who are sworn to determine the truth.\n\nAs the Supreme Court explained in Luce v United States, 469 U.S. 38, 41-42; 105 S Ct 460; 83 L Ed 2d 443 (1984),\n\nThe ruling [regarding impeachment] is subject to change when the case unfolds, particularly if the actual testimony differs from what was contained in the defendant's [in limine] proffer. Indeed even if nothing unexpected happens at trial, the district Judge is free, in the exercise of sound judicial discretion, to alter a previous in limine ruling.\n\nThe majority's failure to appreciate the role of a Judge in a jury trial is more remarkable because it squarely contradicts the rationale of a case on which the majority purportedly relies, Gordon v United States, 127 U.S. App DC 343, 348; 383 F2d 936 (1967). In Gordon, Judge Warren Burger wrote that an admission of prior convictions for impeachment was proper, partially\n\nbecause the case had narrowed to the credibility of two persons -- the accused and his accuser -- and in those circumstances there were greater, not less, compelling reasons for exploring all avenues which would shed light on which of the two witnesses was to be believed.\n\nThus, in the very case in which a prior conviction's relation to credibility is most important to the truth-seeking process, the majority would ban it.7a It is true that in a credibility contest the \"prejudice\" to the defendant of such a prior conviction will be high. However, in many such contests, the Court now mandates that the full dimension of the credibility issue can never be disclosed to the jury.8a\n\nThe majority prevents the trial Judge from evaluating the context and purpose of the cross-examination and leaves the jury to falsely conclude that since it has not learned of a prior conviction of the defendant, defendant's crime-free life entitles his testimony to more credibility than that of the impeached witness. This result contravenes, as described by Judge Burger, \"the very nature of judicial discretion precludes rigid standards for its exercise . . . .\"9a Gordon v United States, supra, p 348. In these situations the majority dictates that only the need to include the testimony and never the need to permit impeachment can be considered. The result is obvious: the trial court is stripped of its authority, the jury is barred from access to the facts, and the victim and society lose.\n\nContrary to the majority's suggestion, it is not the Dissent which \" the probative/prejudice balance of any real meaning,\" ante, p 602. It is the majority's inhibition of the trial judiciary that drastically limits the authority to evaluate the proffered impeachment evidence in the context of the purpose and situation in which it is offered.10a The result is exclusion of generic classes of evidence regardless of probativeness in a given case and inclusion of generic classes of evidence regardless of existential prejudice in a given case. In effect, these rules determine probativeness without regard to prejudice and prejudice without regard to probativeness.\n\nRule 609 reflected the decision of a committee of lawyers and Judges adopting the common-sense premise that any past felony committed by a witness is to some extent relevant to credibility. This premise was as simple and as profound as the observation that if the far more imperative social obligation not to commit crime does not prevent criminal conduct, a defendant is far less likely to have inhibitions against lying.11a\n\nWhile it has not been proven, it may be safely assumed that some jurors misuse prior conviction evidence admitted only for credibility. Rule 609 thus does not guarantee that an innocent person will never be convicted. It is one thing, however, to provide a procedure to protect against the possibility of an erroneous conviction in isolated cases;12a it is quite another to create a rule on the basis of supposition or personal perception that suppresses logically relevant evidence and increases the risk of erroneous acquittal.\n\nNonetheless, because of the perceived \"low probative value\" of all bright-line excludable convictions, the majority denies a relationship between believability and prior felonious conduct and refuses to allow Judges the discretion to permit lay factfinders to draw an inference that a person who has previously flaunted society's conventions by violating the of the state may also be willing to lie under oath.13a\n\nThe majority's answer to a potential for juror misuse is the creation of an analytical rule.14a On the basis of speculation as to the effect on the process caused by jurors' inability to follow a limiting instruction, the majority imposes an administrative solution for what is in fact an existential problem. This solution ignores the fact that these problems are quintessentially ad hoc and call for ad hoc solutions. Therefore, the wise course for an appellate court is to recognize a wide discretion in the trial court with a correspondingly narrow scope of appellate review. As the United States Supreme Court instructs, fixed and arbitrary rules that suppress truth should be adopted only for compelling constitutional or societal reasons.\n\nI am persuaded that the vast majority of the trial judiciary believes that it is desirable that a defendant have a fair opportunity to present a defense, and that it is frequently appropriate to limit attack on a defendant in order to encourage him to take the stand. I would trust these judgments, made with a \"vision not vouchsafed to us, as we scan the printed page . . . .\" People v Stoeckl, supra, 7 (Smith, J., Dissenting), to the integrity of trial Judges, their fidelity to the rules we have already created, and to the wisdom of juries.15a\n\nThe majority has looked to empirical studies16a of mock jurors by behavioral psychologists to design these new rules. The very use of the concept that jurors \"mediate\"17a their Conclusions through other perceptions bespeaks the majority's application of behavioral decision theory to the jury system. The majority fails to acknowledge, however, that simulations of the jury process are conceded even by proponents of \"psycholegal\" research to be \"imperfect tools for answering empirical questions,\" Kerr \u0026 Bray, The Psychology of the Courtroom (New York: Academic Press, 1982), p 318. Notwithstanding such reservations and ignoring the fact that the prosecution must introduce sufficient evidence in the case in chief to support guilt beyond a reasonable doubt, the majority states that it is much easier for a jury to conclude that \"a person is bad than that he did something bad,\" ante, p 568, and then flatly asserts that the limiting instructions do not accomplish their purpose.\n\nOne study the majority believes deserves consideration involves forty-eight mock jurors being advised of seven prior similar convictions, Doob \u0026 Kirshenbaum, Some empirical evidence on the effect of s. 12 of the Canada Evidence Act upon an accused, 15 Crim L Q 88, 93 (1972-73). It is this study which provides the \"halo effect\" explanation in the majority opinion.18a\n\nThe second study cited used both individual verdicts and four-person mock juries and was performed with forty individuals and thirty four-person groups who read a hypothetical burglary scenario in which half the persons were informed that the defendant had a prior conviction for burglary and were given a single written instruction that read:\n\n\" accused person's prior criminal record should not be used to determine whether or not the defendant is guilty. Prior record should be used only to determine the credibility of the defendant, that is, whether he is to be believed as a witness.\" [Hans \u0026 Doob, Section 12 of the Canada Evidence Act and the deliberations of simulated juries, 18 Crim L Q 235, 240 (1975-76).]\n\nThe results from the individual verdicts \"did not replicate\" Doob \u0026 Kirshenbaum's original findings, that is, the presence of a record did not seem to make a difference in the percentage of guilty verdicts when the verdicts were made individually. The presence of the record did appear to make a difference in the four-person groups, in which forty percent of the group knowing of a record found the defendant guilty and none of the fifteen groups not advised of a record found the defendant guilty. In evaluating the results, the authors conclude that knowledge of a previous conviction biases a jury against the defendant. They also note, however, that in the absence of a record, the \"No Record groups discredited the evidence significantly and consistently more per unit time than Record groups did.\" (Emphasis in original.) Id., p 245. While crediting the portion of the study that supports its result, the majority has failed to observe, as it formulates new policy for this state, that without any factual basis in the hypothetical problem the no-record mock jurors were more likely to be biased against the state by observing that the law was biased against the defendant, that police line-ups were biased, or that the evidence was only circumstantial.19a\n\nThe most recent study cited by the majority is based on observations of 160 persons approached in Laundromats, supermarkets, bus terminals, and private homes who were asked to determine guilt or innocence of a hypothetical defendant from a two-page case summation. This study concludes that mock jurors are more likely to convict a defendant when advised of conviction of a prior similar crime, not, as the majority implies, of any prior conviction -- a result that supports the current approach of our jurisprudence to this category of case, People v Crawford, 83 Mich App 35; 268 NW2d 275 (1978). Similarly, the study's observation that the participants' rating of the hypothetical defendant's credibility did not vary as a function of prior conviction is used by the majority to support its Conclusion that a limiting instruction has no effect on how jurors use prior conviction evidence. It is obvious even to the untutored, however, that the fact that there was no significant variation in the mock jurors' evaluation of the \"defendant's\" credibility is equally explained by the fact that there was no real defendant to evaluate. As the authors of this study themselves note:\n\nOne should be cautious in generalizing from the results of this study to jurors in a real trial. First, the ratio of trial evidence to prior conviction information is much lower in simulations than in actual trials. In an actual trial, the greater richness of evidence and actors probably provides jurors with more bases for forming credibility judgments than the subjects in our simulation had. [Wissler \u0026 Saks, On the inefficacy of limiting instructions: When jurors use prior conviction evidence to decide on guilt, 9 Law \u0026 Human Behavior 37, 46 (1985).]\n\nFinally, not only was there no real defendant, no actual deliberation or explanation of the limiting instruction, the most telling indication of the absence of persuasive weight in this study is the fact that the observation the majority finds most important, ante, p 577, that is, that all else being the same, the \"conviction\" rate was higher where the impeaching crime was murder, is a Conclusion drawn from a survey of twenty people, fourteen of whom opined that the defendant was guilty.20a\n\nThe Kalven \u0026 Zeisel study, The American Jury (Boston: Little, Brown \u0026 Co, 1966), which is the only attempt to measure the decisional processes of actual juries does not support the majority's result and is, therefore, not dealt with in the survey of empirical studies. Given the majority's reliance on hypotheticals presented to mock jurors to support its assumptions, and because The American Jury is the seminal study of actual jurors, it is appropriate to examine its findings in depth.\n\nThe Kalven \u0026 Zeisel study measured the trial Judge's assessment of guilt against the jury's verdict in 3,576 jury trials and assumed the performance of the Judge as a baseline of expertise in understanding the facts and applying the law. The importance of the study for purposes of examining the majority's Conclusion that there is a \"likelihood\" that jurors convict the innocent is that in 3,576 trials there was overwhelming Judge and jury agreement; in sixty-four percent of the cases both would convict, and in fourteen percent both would acquit. The study found that Judges and jurors reached contradictory results in twenty-two percent of the cases. Of this twenty-two percent, in nineteen percent the Judge would convict where the jury would acquit, and in three percent the Judge would acquit where the jury would convict.\n\nThe study concludes that the jury's disagreement is \"massively in one direction,\" that is, for acquittal. Id., p 58. The Kalven \u0026 Zeisel work does provide evidence that jurors are influenced by personal characteristics of defendants and witnesses and by perceptions that do not relate to the issue of guilt or innocence. The study does not prove that juries are more likely than a Judge to convict where the defendant takes the stand and is impeached, but, rather, supports the view that jurors are twice as likely to reach what the study assumes are outcomes that are not controlled by formal law or professional evaluation of evidence because of jury sentiments about the law and the defendant. Thus, Kalven \u0026 Zeisel substantiate the view that where juries do not reach \"correct\" results, they are engaged in the historic function of jury equity, erring on the side of acquittal.\n\nNor does the Kalven \u0026 Zeisel study support the majority's observation that it is \"much easier\" for a jury \"to conclude that a person is bad than that he did something bad.\" Ante, p 568. The majority fails to observe that Kalven \u0026 Zeisel do not suggest that the jurors' higher acquittal rate is because the defendant is innocent. The majority thus erroneously implies that because a jury finds guilt at a higher rate where prior records are introduced, the verdicts are less likely to be factually accurate. In fact, as noted, the Kalven \u0026 Zeisel statistics assume the Judge's evaluation as the standard of competence. Where Judges and juries disagree (as they do less in cases of prior records) the disagreement describes not a factual inaccuracy suggesting conviction of innocent defendants, but a jury sentiment toward equity for a defendant despite factual accuracy and the rules of law.21a\n\nHaving noted the phenomenon and the direction of Judge and jury disagreement, the focus of the study turns to identification of the source and cause of the disagreement. The majority opinion neglects one entire chapter of the study devoted to the credibility hypothesis (chapter 13, pp 168-181). This chapter explores and rejects the existence of a defendant's repudiated confession as a source of disagreement (p 174), it explores and rejects the effect of accomplice testimony as a source of disagreement (p 177), and it examines in detail the precise issue raised by the majority in this opinion, the \"defendant-as-witness,\" ante, p 567, that is, the effect of the credibility of the defendant as a source of disagreement.\n\nThe study proves in table 56, p 179, that twenty-three percent of all disagreements in these trials are attributable to a defendant's taking the stand and testifying where either he had no record or his record had been suppressed. Specifically, in twenty-three percent of all cases of disagreement, the Judge would have convicted, but the jury acquitted, where the defendant did not have a record or his record had been suppressed. Table 57, p 180, proves that the bulk of the effect of this defendant factor stems from the defendant having been charged with a serious crime. In other words, the more serious the crime, the more likely the jury is to disagree with the Judge.\n\nThe jury's broad rule of thumb here, presumably, is that as a matter of human experience it is especially unlikely that a person with no prior record will commit a serious crime, and that this is relevant to evaluating his testimony when he denies his guilt on the stand. [ Id., p 179.]\n\nThus, assuming the factual accuracy of the trial Judge's verdict,22a the credibility hypothesis suggests that jurors are likely to give disproportionate weight to an unblemished record to reach incorrect results. Id., p 180.\n\nThe study also focuses on the credibility issue in the evaluation of the \"cross-over phenomenon\" -- cases in which the Judge is more lenient than the jury. Id., p 375. The issue here is whether there are cases in which a jury convicts and a Judge would acquit that are statistically traceable to the use of a record for impeachment. Assuming, as the majority does, ante, p 568, n 8, that the study's grouping23a produces data relevant to our debate, the study concluded that in a total of five cases out of 3,576 trials, a jury convicts where a Judge would have acquitted either because a defendant testified and was impeached with a criminal record or did not testify at all (whether he had a record or not).\n\nThis study deals, of course, only with trials and not with all cases. However, if the Kalven \u0026 Zeisel results are applied on the basis of current data of all cases at the adjudicative level, fifteen percent will result in a trial, see Discussion, n 12.\n\nIn the world of Kalven \u0026 Zeisel, there would be 23,840 defendants at the adjudicative level, of which 20,264 would admit guilt and plead guilty. Of the remaining 3,576 cases, even assuming all defendants chose a jury trial, in five cases, a defendant would be convicted by a jury who would have been acquitted by a Judge (whether that result is attributable to the fact that the defendant testified and was impeached with a criminal record or did not testify).\n\nThus, the study proves that the risk of \"erroneous\" conviction by a jury due to use of a criminal record for impeachment (whether by use of a criminal record or by the defendant not taking the stand) is .0013982 or .13982 percent of the cases. Applied to all cases at the adjudicative level, the risk of erroneous conviction is .0002097 or .02097 percent of all cases. In fact, the study supports the Conclusion that in roughly one out of a thousand trials,24a the jury may misuse the evidence.\n\nThe data cited by Kalven \u0026 Zeisel25a not only refutes the majority's proposition that it is \"likely\" that misuse of the evidence leads to conviction of innocent defendants, but flatly contradicts it both ways. The study demonstrates that the risk of erroneous acquittal is greatest where a criminal record is suppressed and that the risk of erroneous conviction where a prior record is used is roughly one in a thousand cases.26a\n\nFinally, one additional matter, also neglected by the majority, is the role of the trial Judge, id., ch 32, p 411. As earlier noted, a trial Judge must dismiss a case at the close of the prosecution's proofs if the prosecution has failed to carry its constitutional burden. The issue may be raised again at the close of the case prior to jury submission. After a jury renders a verdict, the issue of sufficiency of the evidence can be raised by motions for a new trial or for judgment notwithstanding the verdict.\n\nMoreover, and most importantly, in this state, although not constitutionally required, the trial Judge may grant a new trial even when the evidence is constitutionally sufficient to prove guilt beyond a reasonable doubt, Hampton, supra.\n\nThus, there is a last resort to prevent the unjust conviction of the innocent. Chapter 32 of the Kalven \u0026 Zeisel study shows that of the cases in which the jury convicted and the Judge would have acquitted, the Judge respected the jury verdict in only forty-eight percent of the cases. The Judge either set aside the verdict or gave a minimum penalty in over half the cases. In the forty-three cases involving serious crimes, the trial Judge either set aside the verdict or gave a minimum penalty in sixty-one percent of the cases.27a\n\nThe study concludes its analysis of the cross-over phenomenon as follows:\n\nIn the end the institutional arrangement is impressive. It gives the jury autonomy to do equity on behalf of the criminal defendant. Where the jury's freedom leads to \"illegally\" harsh results, the Judge is at hand, ready to erase them. [ Id., p 413.]\n\nFor purposes of examining the premises of the majority's new policy, the most significant observations in The American Jury can be summarized as follows: If there is a bias in the system by juries, it is massively toward acquittal; the bias leads to erroneous acquittals if the standard for \"erroneous\" is whether the trial Judges' presumptive competence represents a valid judgment that the defendant's guilt has been factually established in accordance with law; the likelihood of \"erroneous\" acquittal is greatest where the defendant testifies and does not have a record or the record is suppressed; the risk of erroneous conviction by a jury is seventy-seven out of 3,576 trials, or 2.2 percent; in only five of these trials was the result traceable to impeachment with a criminal record (or the defendant's failure to testify); and the risk of error is offset by the trial Judge's intervention at the post-conviction stage in over half of the cases in which the jury presumably erroneously convicted.\n\nIt is not surprising that the majority has chosen to ignore these observations. The American Jury study does not support what the majority does today; indeed, it contradicts every assumption in which the majority indulges.\n\nThe fact is that there is no demonstrable evidence that juries resolve doubtful cases on the basis that the defendant is a \"bad man\" and should be punished, that juries lower the burden of proof even if a guilty verdict would be incorrect, that juries convict because of a belief that the defendant's convictions indicate that he is probably guilty of the crime charged, or that juries incorrectly convict where a defendant does not take the stand because of fear of impeachment.28a Thus, there is no basis other than the majority's preference for its own rules for the statements that there is an \"overwhelming tendency for jurors . . . to misuse prior conviction evidence,\" ante, p 579, or that MRE 609 presents a \"likelihood that innocent persons may be convicted.\"29a (Ante, p 569.)\n\nThe majority uses decisionmaking theory to support its result while ignoring the only actual evidence30a of juror performance and federal law, as well as the law in the overwhelming number of sister states. That it has done so can only be understood as the measure of its determination to impose its values on the legal process.\n\nThe obvious risk in such an approach is the threat of a loss of faith in the system itself. Legal rules must appear to function both to advance factual accuracy and to reflect the normative values of society, not the values of the lawgivers themselves. Thus, to the extent that jury verdicts are attributable not to factual accuracy, due process requirements, or mercy dispensation, but to rules of law that do not reflect society's normative values, the jury process becomes more alien and more suspect to the citizenry.\n\nAmong the societal values the American legal system has consistently reflected is the value in a trial by one's peers and the value of a crime-free life. While the majority may assume that the experience of other jurisdictions with impeachment by prior convictions represents an absence of enlightenment, the fact that forty-six other jurisdictions have adopted rules of inclusion or trial-Judge discretion may instead represent a collective understanding that the societal value of a crime-free life must be reflected in rules of law.\n\nThe rules of the system cannot be dictated by popular opinion. The vitality of the institution is, however, appropriately gauged by the community's judgment that the law is reflecting values that are not merely those of the decisionmakers. See, generally, Tribe, Trial by mathematics: Precision and ritual in the legal process, 84 Harv L R 1329, 1392-1393 (1971).\n\nIII\n\nThe majority classifies prior convictions into three categories: the automatically admissible, the automatically excluded, and those requiring an exercise of modified discretion by the trial court. Those offenses which would be automatically admissible are offenses involving dishonesty or false statement. Those offenses which are automatically excluded are all other offenses, except theft offenses which would fall in a mid-range balancing area. In my judgment, the majority has seriously erred in disallowing the trial-Judge discretion to exclude the former or admit the latter.\n\nIn a given case, a crime involving dishonesty or false statement could be so unfairly prejudicial as to require exclusion from a sense of Justice, despite probative bearing on veracity. Similarly, crimes other than theft could, in a given case, be more probative of veracity than prejudicial. Rule 609 as currently drafted recognizes that there are cases in which a trial court must, for the sake of Justice, have the discretion to balance probativeness against prejudice. Without such discretion, the trial process will surely produce exceptions to the rules in order to admit or exclude evidence because the facts in a certain case seem to demand it. See, e.g. , note, Prior conviction impeachment in the District of Columbia: What happened when the courts ran out of luck ?, 35 Cath U L R 1157 (1986). The purpose of retaining any discretionary element is to avoid possible inJustice under a given set of facts. To secure truth while screening prejudice, one should seek to broaden the scope of discretion and avoid the wooden strictures that a \"bright-line\" test creates.\n\nWhen the Michigan Rules of Evidence were adopted, the question of a trial Judge's discretion in relation to impeachment by prior convictions was clearly presented and considered. MRE 609(a), as originally proposed,31a and as ultimately adopted, included a protection for criminal defendants that was not part of FRE 609(a):32a Under MRE 609(a), prior convictions of crimes involving dishonesty or false statement were not automatically admissible. Instead, the trial Judge was entrusted with the discretion to exclude even these convictions when prejudice outweighed the probative value. As adopted by this Court, the balancing approach was applied not just to criminal defendants, but to all witnesses in civil and criminal cases faced with impeachment with prior crimes involving dishonesty or false statement. Wade \u0026 Strom, Michigan Courtroom Evidence, R 609, p 234.\n\nRequiring the exercise of discretion before admitting either felonies or crimes of theft, dishonesty or false statement, has been described as an improvement over the Federal Rules by the Chairman of this Court's Committee on Rules of Evidence, James K. Robinson, because of the trial Judge's control over unfair prejudice:\n\nFor example, MRE 609 . . . solved several drafting problems of the counterpart federal rule and authorized the trial Judge to exercise more control over unfairly prejudicial prior convictions offered for impeachment. [Robinson, Current issues in Michigan evidence law, 61 Mich B J 330, 333 (1982).]\n\nThis very innovation over FRE 609(a) is swept away by the proposed \"bright line\" rule requiring automatic admission, regardless of the amount of prejudice, of crimes involving dishonesty or false statement.33a\n\nIV\n\nThe concerns discussed above are the tip of the iceberg.\n\nAlthough the newly adopted \"bright line\" rule will be solely prospective in operation, the majority applies the \"clarified\" balancing test to the \"cases at hand\" on the ground that the balancing test does not represent a \"clear break\" in our jurisprudence. The Court thus creates a rule of general application in a field of law which results in the greatest percentage of appeals and which could affect virtually every trial begun in the years these cases have been pending and not concluded on direct appeal. The introduction of the low probative/presumptive exclusion analysis which is the heart of both the \"bright line\" and \"non-bright line\" tests is a substitute for the abuse of discretion standard which the trial Judges of this state have relied upon in hundreds and perhaps thousands of cases.\n\nMoreover, the new \"vintage\" analysis is a heretofore unknown MRE 609 consideration. It simply cannot fairly be said that today's decision is simply a clarification of MRE 609. This fact demonstrates that the decision should be given purely prospective effect. This fact also demonstrates that the \"modification\" of Rule 609 should have been accomplished through the rulemaking process, making application wholly prospective. When the Court creates a rule, all courts of this state, including this Court, are bound by it. To pronounce this \"clarification\" of Rule 609 by case decision is, in fact, to retroactively amend a rule which bound us, no less than the Court of Appeals and trial court. The result is that cases that were unquestionably correctly decided under the rule the lower courts were duty-bound to follow now contain error. If the lower courts cannot rely on this Court to uphold them when they comply with our rules, the process of rulemaking is undermined. If the purpose of the rule is to encourage defendants to take the stand, that purpose can be effected without retroactive application. The reliance by the trial judiciary on Rule 609 is clear, as is the burden on the administration of Justice of judicial reexamination of all non-final cases in which the impeachment issue has been raised, People v Nixon, 421 Mich 79; 364 NW2d 593 (1984).34a\n\nProspective application would have been accomplished through the rulemaking procedure. An honest appraisal of the effect of applying the \"clarified\" balancing test would dictate prospective application. The cost to society due to reversed convictions and the concomitant strain on victims, witnesses, and public resources occasioned by retrials would be avoided, and the bench and bar would be allowed an opportunity to accommodate the change in procedure.\n\nV\n\nIn resolving the appeals in the instant cases, I agree with Chief Justice Riley's holding that we should address the issue whether this Court should adopt the rule in Luce v United States, 469 U.S. 38; 105 S Ct 460; 83 L Ed 2d 443 (1984), and hold that, \"to preserve a claim of error as to the admission of evidence of a prior conviction for impeachment purposes, a defendant must testify,\" ante, p 637. I also agree that MRE 609(a) is the appropriate test governing the admissibility of prior convictions for impeaching a witness' credibility.\n\nA. PEOPLE v GRAY\n\nI agree with Chief Justice Riley's reasoning and result with regard to Gray. The trial Judge did not abuse her discretion in allowing impeachment with the defendant's prior convictions for carrying a concealed weapon and possession of heroin. While the facial relation of these offenses to credibility is not as great as others, the value of the evidence was great. As the Chief Justice states, \"the value of such evidence to the truth-seeking process was critical because the trial had boiled down to a swearing contest between two opposing witnesses.\" Ante, pp 641-642.\n\nB. PEOPLE v ALLEN\n\nI also agree with Chief Justice Riley's reasoning and result in Allen. In Allen, as in Gray, the question of guilt or innocence rested upon the credibility of the complainant and the defendant. The sexual act was admitted by the defendant -- the question was whether the act was consensual. This is the epitome of the one-to-one swearing contest in which credibility of the witnesses is crucial. I would affirm the decision of the Court of Appeals.\n\nC. PEOPLE v SMITH\n\nI concur with Chief Justice Riley's determination that the trial court erred in failing to state the factors it considered in admitting the defendant's prior conviction of manslaughter for impeachment, and I agree that the error was harmless. However, because the error is a non-constitutional evidentiary error, I believe that the proper standard for determining whether error which requires reversal occurred is \"whether the defendant was unfairly prejudiced by the evidence.\" People v Allen, 424 Mich 109, 110; 378 NW2d 481 (1985). In light of the otherwise overwhelming evidence of the defendant's guilt, there was no unfair prejudice to the defendant. I concur in Chief Justice Riley's resolution of the remaining issues. Thus, I also would affirm the decision of the Court of Appeals.\n\nD. PEOPLE v PEDRIN\n\nIn this case, the defendant, charged with breaking and entering with intent to commit larceny, was impeached with evidence of a prior conviction of breaking and entering with intent to commit larceny. The trial Judge decided that the probative value of the prior conviction outweighed its prejudicial effect. Because I see no abuse of the trial court's discretion, I would affirm the conviction.\n\nThe prior offense included the intent to commit larceny, a theft offense. As the trial Judge noted, the prior offense involved dishonesty. While the prejudicial effect of impeachment with a conviction of the same prior offense is appreciable, the balance is, in the first instance, properly placed in the hands of the trial Judge. This Court, when it adopted MRE 609(a) in 1978, acknowledged the probativeness of theft offenses by adding theft offenses to those misdemeanors which can be used for impeachment under the rule. The trial Judge acknowledged the prejudicial effect, and balanced prejudice and probative value, noting that the defendant's credibility upon testifying would be a very important issue because his proposed testimony presented a story with no other corroboration or support. Thus, the need for the testimony was heightened. Under these circumstances, I see no abuse of discretion.\n\nE. PEOPLE v BROOKS\n\nWhile I am not convinced that the impeachment in this case was error, I agree that any error was harmless. Therefore, I would affirm the conviction in this case.\n\nConclusion\n\nThe \"bright-line\" rule of automatic admission and exclusion of certain prior convictions, combined with the drastically circumscribed discretion allowed trial Judges in relation to remaining offenses, will not serve the fair administration of Justice in this state.\n\n[EDITOR'S NOTE: The page numbers of this document may appear to be out of sequence; however, this pagination accurately reflects the pagination of the original published document.]\n\nI disagree with the majority's adoption of the \"bright-line\" rule contained in revised MRE 609(a). I share the concerns and criticisms expressed by Justice Boyle and concur in parts I, II, III, and IV of her Dissent.\n\n\u003cspan class=\"fn\"\u003e1. MRE 609 reads in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) General rule. For the purpose of attacking the credibility of a witness, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the crime was punishable by death or imprisonment in excess of one year under the law under which he was convicted, or the crime involved theft, dishonesty or false statement, regardless of the punishment, and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the court determines that the probative value of admitting this evidence on the issue of credibility outweighs its prejudicial effect and articulates on the record the factors considered in making the determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. According to the recent report of the Michigan Rules of Evidence Committee, \" the federal rules were being considered by Congress, Rule 609 drew the most heated comments; and the Michigan Committee, meeting in 1976, spent more time on this rule than on any other.\" Report of the Committee on the Rules of Evidence, December 23, 1983, p 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., note, Other crimes evidence at trial: Of balancing and other matters, 70 Yale L J 763 (1961); note, Procedural protections of the criminal defendant -- A reevaluation of the privilege against self-incrimination and the rule excluding evidence of propensity to commit crime, 78 Harv L R 426 (1964); comment, Use of bad character and prior convictions to impeach a defendant-witness, 34 Fordham L R 107 (1965-66); note, To take the stand or not to take the stand: The dilemma of the defendant with a criminal record, 4 Colum J of L \u0026 Social Problems 215 (1968); Glick, Impeachment by prior convictions: A critique of Rule 6-09 of the proposed rules of evidence for US district courts, 6 Crim L Bull 330 (1970); Spector, Impeaching the defendant by his prior convictions and the proposed federal rules of evidence: A half step forward and three steps backward, 1 Loyola Univ L J 247 (1970); Krauser, The use of prior convictions as credibility evidence: A proposal for Pennsylvania, 46 Temple L Q 291 (1972); note, An eclectic approach to impeachment by prior convictions, 5 J of L Reform 522 (1972); Spector, Rule 609: A last plea for its withdrawal, 32 Okla L R 334 (1979); Nichol, Prior crime impeachment of criminal defendants: A constitutional analysis of Rule 609, 82 W Va L R 391 (1980); Surratt, Prior-conviction impeachment under the federal rules of evidence: A suggested approach to applying the \"balancing\" provision of Rule 609(a), 31 Syracuse L R 907 (1980); Beaver \u0026 Marques, A proposal to modify the rule on criminal conviction impeachment, 58 Temple L Q 585 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Much of the Dissent's argument appears to rest on the erroneous assumption that the relevancy of MRE 404 protections disappears at the close of the prosecution's case in chief and that therefore there is no practical contradiction between the purposes of MRE 404 and MRE 609. We find this approach flawed since the language of MRE 404 explicitly lists MRE 609 as an exception.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This fundamental principle is the basis for MRE 404 which provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) Character evidence generally. Evidence of a person's character or a trait of his character is not admissible for the purpose of proving that he acted in conformity therewith on a particular occasion, except:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) Character of witness. Evidence of the character of a witness, as provided in Rules 607, 608, and 609.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Other crimes, wrongs, or acts. Evidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show that he acted in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, scheme, plan, or system in doing an act, knowledge, identity, or absence of mistake or accident when the same is material, whether such other crime, wrongs, or acts are contemporaneous with, or prior or subsequent to the crime charged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis rule bars a prosecutor, with specific and narrow exceptions, from introducing evidence of an accused's prior convictions in order to show that he acted in conformity with such prior activities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This is in marked contrast to civil law jurisdictions where the prosecutor, as part of his case in chief may introduce evidence of the accused's character, past activities, and criminal convictions. Comment, Use of bad character and prior convictions to impeach a defendant-witness, 34 Fordham L R 107, 108-109 (1965-66).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Dissent seems to suggest that a defendant who does not have a criminal record will be prejudiced by today's decision and the adoption of the amendment of MRE 609. We do not agree. It is unreasonable to suggest that typical jurors will be sufficiently versed in the law to know that a witness-accused may have a criminal past which is not raised due to a rule of evidence. Even if this were to occur in an isolated case, it would not raise new problems. Any juror who is so informed as to the revised rule that he may suspect the bona fides of an apparently crime-free history would certainly do the same under the present rule, as it too results in the exclusion of evidence of some prior convictions. In addition, the suggestion that we must evaluate rules of exclusion on the grounds that jurors might suspect exclusion where none has occurred is, in fact, an argument for never allowing exclusion of evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The American Jury by Kalven and Zeisel (Boston: Little, Brown \u0026 Co, 1966), involved a study of jury behavior and indicates that the introduction of a defendant's prior convictions substantially increases the conviction rate. At one point, the authors divided defendants into two groups. The first group was composed of those defendants who took the stand and either had no record or were able to keep it from the jury as well as those defendants who did not take the stand but of whom the jury learned that they had no record. The second group was comprised of all other defendants, i.e., those who the jury learned had a criminal record and those who did not take the stand and of whom the jury received no information as to their record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe acquittal rate of the first group was forty-two percent while that of the second group was twenty-five percent. In trial settings where the evidence suggested the highest probability of acquittal, the acquittal rate of the first group was sixty-five percent and that of the second group, thirty-eight percent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile the study did not determine what percentage of those choosing not to take the stand did so out of fear of impeachment by prior conviction, it did conclude that defendants without records testify in ninety-one percent of the cases, those with records testify in only seventy-four percent. Kalven \u0026 Zeisel, (supra) at 146. Where the case is clear for acquittal, only fifty-three percent of defendants with records testify, apparently not wishing to risk their high chance of acquittal on impeachment. Id. If it were true that impeachment went only to defendants' credibility, there would be little reason for defendants to shy away from testifying. At worst, their testimony would be disbelieved. It would appear, however, that the fact that the risks created by impeachment go far beyond its legitimate purpose is not lost on defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Dissent ascribes the higher conviction rate to the use of prior conviction evidence in determining credibility. A recent study addressed that question and found that \"prior conviction evidence does not have its impact on verdicts by way of an intervening impact on perceptions of credibility\" and that mock jurors \"were willing to state that the prior conviction evidence increased the likelihood of the defendants' guilt and was the reason they found him guilty, even though they had been instructed not to use the information for that purpose.\" Wissler \u0026 Saks, On the inefficacy of limiting instructions: When jurors use prior conviction evidence to decide on guilt, 9 Law \u0026 Human Behavior 34, 44 (1985). Thus, juries exposed to prior conviction evidence may decide on a defendant's guilt upon the basis of the inference that prior criminal activity indicates guilt of a charged crime. What the Dissent views as contradictory results in this study are in fact consistent. See, id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We also note that at least one commentator takes issue with the psychological assumptions upon which even this notion is based. Spector, Rule 609: A last plea for its withdrawal, 32 Okla L R 334 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Dissenters cite Bruton, supra, Tennessee v Street, 471 U.S. 409; 105 S Ct 2078; 85 L Ed 2d 425 (1985), and Richardson v Marsh, 481 U.S. ; 107 S Ct 1702; 95 L Ed 2d 176 (1987), as the basis for the analysis described in section II(2), post, p 667 of the Dissent. Initially, we note that the three-step \"proper approach\" (post, p 667) has never been so defined by the United States Supreme Court, nor was it employed in the determination of the federal or Michigan Rules of Evidence. Moreover, in Street, the defendant claimed that his confession was coerced and that it was based upon his accomplice's statement. The fact that his confession contained details of the crime not described in the codefendant's statement was extremely probative of the inaccuracy of defendant's explanation of his confession. Indeed, it is difficult to imagine more probative evidence of such a claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe do not view prior conviction evidence in the same light. It does not, as did the evidence in Street, go directly to the heart of defendant's explanation. Prior conviction evidence, on the other hand, is, in general, probative of the truthfulness of a defendant's claim only when mediated through the notion that defendant is of general bad character. (See above.) Consistent with this is the fact that prior conviction evidence, unlike the evidence in Street, may provide a jury with an independent and improper basis for a guilty verdict. The admission of Street's codefendant's statement did not serve to convince the jury that defendant was a bad man deserving of imprisonment regardless of his guilt in the tried case, or that the burden of proof would be lowered, or that defendant was the type of man who would have likely committed the charged offense. The evidence in Street provided little, if any, inculpatory information to the jury that was not already before them in defendant's own confession. The degree of prejudice was, as was the degree of probativeness, of a different magnitude than in the cases before us today which involve a very different type of evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Dissenters also cite Spencer v Texas, 385 U.S. 554; 87 S Ct 648; 17 L Ed 2d 606 (1967). In that case, the United States Supreme Court held that introducing a defendant's prior convictions did not violate the Due Process Clause of the United States Constitution. However, our decision today is not based on constitutional grounds, but rather on policy. Policy, not constitutional limitations, underlies most of Michigan's evidentiary code, and the determination of that policy has been explicitly left to this Court by art 6, § 5, of the 1963 Constitution. Moreover, the Spencer Court based its decision in part upon its belief that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ewould be a wholly unjustifiable encroachment by this Court upon the constitutional power of States to promulgate their own rules of evidence to try their own state-created crimes in their own state courts, so long as their rules are not prohibited by any provision of the United States Constitution. . . . [385 U.S. 568-569.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe rule which we today adopt is not, in our view, prohibited by any provision of the United States Constitution. It is also worth noting that four Justices in Spencer believed that the procedure in that case was unconstitutional, and a fifth Justice, while agreeing with the majority that there was no constitutional violation, viewed the procedure as bad policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 120 Cong Rec, H 1414 (January 30, 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Dissent incorrectly states (post, p 685) that this study concluded that conviction was more likely only when the prior conviction was for a crime similar to the one charged. To the contrary, while similar crimes were the most prejudicial, the study resulted in a finding of jury bias where the prior conviction was for a dissimilar offense as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Professor John Reed's memorandum of November 11, 1975, to the evidence committee summarizing its initial rule 609(a) activities stated that the proposed rule as to a witness-accused \"was in accord with People v Jackson, supra, in directing the trial court to make a determination that probative value outweighs prejudicial effect . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. While Crawford was initiated prior to the enactment of the Rules of Evidence, the Court of Appeals noted that \" similar analysis is appropriate under new MRE 609 and the result in a case such as this would be identical.\" 83 Mich App 40, n 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The trial in this case preceded the March 1, 1978 effective date of the Michigan Rules of Evidence. The listed factors continue to be relevant in the balancing required by MRE 609(a)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15a While a small number of federal courts have interpreted the phrase \"involving dishonesty or false statement\" broadly, e.g., United States v Del Toro Soto, 676 F2d 13 (CA 1, 1982), most have adhered to the House Conference Report's explanation that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eby the phrase \"dishonesty and false statement\" the Conference means crimes such as perjury or subornation of perjury, false statement, criminal fraud, embezzlement, or false pretense, or any other offense in the nature of crimen falsi, the commission of which involves some element of deceit, untruthfulness, or falsification bearing on the accused's propensity to testify truthfully. [Conference Report, HR No 93-1597, reprinted at 120 Cong Rec, H 39939, 39941 (December 14, 1974). Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, e.g., United States v Lewis, 200 U.S. App DC 76, 82; 626 F2d 942 (1980); United States v Donoho, 575 F2d 718 (CA 9, 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn order to avoid any confusion in our courts, we have drafted the new rule so as to make clear that prior convictions are only to be admitted where dishonesty or false statement is an actual element of the offense in question. This is consistent with the fact that juries do not reach decisions as to how a crime was committed unless such is an element of the offense, e.g., larceny by false pretenses. In this regard, it is also worth noting that the committee which drafted the proposed Michigan Rules of Evidence \"agreed that the Comments [to Rule 609] will urge strict construction of the phrase 'dishonesty or false statement . . . .'\" Memorandum of John Reed to the Michigan Rules of Evidence Committee (November 11, 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe also approve of the view expressed in the House Conference Report and nearly all federal cases that \"dishonesty\" is not demonstrated by a mere willingness to engage in criminal conduct. The term refers specifically to lying, deceit, misrepresentation or a lack of veracity. See United States v Ashley, 569 F2d 975 (CA 5, 1978); United States v Fearwell, 193 U.S. App DC 386; 595 F2d 771 (1978); Government of Virgin Islands v Toto, 529 F2d 278 (CA 3, 1976); United States v Smith, 179 U.S. App DC 162; 551 F2d 346 (1976); United States v Barnes, 622 F2d 107 (CA 5, 1980); United States v Entrekin, 624 F2d 597 (CA 5, 1980); United States v Yeo, 739 F2d 385 (CA 8, 1984); United States v Glen, 667 F2d 1269 (CA 9, 1982); United States v Lane, 708 F2d 1394 (CA 9, 1983); United States v Mansaw, 714 F2d 785 (CA 8, 1983); United States v Bay, 762 F2d 1314 (CA 9, 1984); United States v McClintock, 748 F2d 1278 (CA 9, 1984); United States v Hans, 738 F2d 88 (CA 3, 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This bright-line rule is, in essence, based upon our view that impeachment through reference to crimes for which false statement or dishonesty is an element is inherently more probative than prejudicial. Therefore, defendants who are so impeached may not claim that such impeachment violates MRE 403. That rule requires that the probative value of the evidence be \"substantially outweighed\" by prejudice. Since we find that as a matter of law prior convictions of crimes involving dishonesty or false statement are more probative than prejudicial, it obviously cannot be argued that the probative value is \"substantially outweighed\" by prejudice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis view has been accepted in every federal Court of Appeals which has addressed the question, and six federal circuits now bar exclusion of prior convictions involving dishonesty or false statement on FRE 403 grounds. United States v Kuecker, 740 F2d 496 (CA 7, 1984); United States v Wong, 703 F2d 65 (CA 3, 1983); United States v Kiendra, 663 F2d 65 (CA 1, 1981); United States v Leyva, 659 F2d 118 (CA 9, 1981); United States v Coats, 209 U.S. App DC 205; 652 F2d 1002 (1981); United States v Toney, 615 F2d 277 (CA 5, 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Where a theft crime includes an element of dishonesty or false statement, e.g., larceny by false pretenses, it will be treated as an automatically admissible prior offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The exclusion of classes of relevant evidence is the effect of many evidentiary rules including MRE 404, as well as the rules excluding: evidence of subsequent remedial measures (MRE 407); evidence of withdrawn guilty or nolo contendere pleas (MRE 410); evidence of the existence of liability insurance (MRE 411); opinion testimony by lay witnesses (MRE 701); hearsay (MRE 802).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The following states have adopted the federal approach: Arkansas (ARE 609); Delaware (DRE 609); Minnesota (MRE 609); Nebraska (NRE 609); New Mexico (NMRE 609); North Dakota (see State v Eugene, 340 NW2d 18, 30 [ND, 1983]); Ohio (ORE 609); Oklahoma (OEC 2609); Oregon (OEC 40.355); Tennessee (see State v Morgan, 541 SW2d 385 [Tenn, 1976]); Utah (URE 609); Washington (see State v Anderson, 31 Wash App 352; 641 F2d 728 [1982]); Wyoming (WRE 609).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The states permitting automatic admission of evidence of all or nearly all prior convictions are: Louisiana (La Stat Ann -- Rev Stat 15:495); Mississippi (see Sanders v State, 352 So 2d 822 [Miss, 1977]); Missouri (Mo Ann Stat, § 491.050); Rhode Island (see State v Lombardi, 113 RI 206; 319 A2d 346 [1974]) (the trial court may exclude a prior conviction only on the basis of remoteness in time); Indiana (see Ashton v Anderson, 258 Ind 51; 279 NE2d 210 [1972]) (prior convictions are automatically admissible if they involved dishonesty or false statement or were for treason, murder, rape, arson, burglary, robbery, kidnapping, forgery, or wilful perjury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The states allowing for automatic admission of certain types of prior conviction evidence of a witness-accused are: Alabama (Ala Code 12-12-162); Colorado (§ 13-90-101, CRS 1973); District of Columbia (DC Code Ann, § 14-305); Florida (Fla Stat Ann 90.610); Maryland (Md Code 10-905); Nevada (Nev Rev Stat 50.095); North Carolina (NC Gen Stat 609); Virginia (see Hackman v Commonwealth, 220 Va 710; 261 SE2d 555 [1980]; Sadoski v Commonwealth, 219 Va 1069; 254 SE2d 100 [1979]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The three states allowing impeachment providing the prior convictions bear some relevance to credibility are: California (see People v Miles, 153 Cal App 3d 652; 200 Cal Rptr 553 [1984]); Idaho (Idaho R Civ P 43[6]); South Carolina (see Taylor v State, 258 SC 369; 188 SE2d 850 [1972]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The states barring any impeachment of a criminal defendant by prior convictions are: Georgia (Ga Code Ann, § 38-415) (prior convictions are admissible only if defendant first puts his character in evidence or where prior felonies have been \"alleged in the indictment as provided by law\"); Hawaii (see State v Santiago, 53 Hawaii 254; 492 P2d 657 [1971]) (prior conviction impeachment of a criminal defendant violates his due process right to testify); Kansas (Kan Stat Ann 60-421); Montana (MRE 609).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In State v McAboy, supra at 508, the West Virginia Supreme Court limited prior conviction impeachment of criminal defendants to convictions for perjury or false swearing as \" of these crimes goes directly to the credibility of the defendant . . . .\" See also State v Clements, W Va ; 334 SE2d 600 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The jurisdictions which completely reject the probative/prejudice balancing approach are: California, Colorado, District of Columbia, Florida, Georgia, Hawaii, Idaho, Indiana, Kansas, Louisiana, Maryland, Massachusetts, Mississippi, Missouri, Montana, Nevada, North Carolina, Rhode Island, South Carolina, and Virginia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The states in which trial Judges employ the probative/prejudice balancing whenever prior convictions impeachment of a witness-accused is sought are: Alaska (see Frankson v State, 645 P2d 225, 227 [Alas, 1982]); Arizona (ARE 609); Connecticut (see State v Bitting, 162 Conn 1; 291 A2d 240 [1971]); Illinois (see People v Montgomery, 47 Ill 2d 510; 268 NE2d 695 [1971]); Iowa (IRE 609); Kentucky (see Cotton v Commonwealth, 454 SW2d 698 [Ky, 1970]); Maine (see State v Grover, 518 A2d 1039, 1049 [Me, 1986]); Massachusetts (Mass Ann Laws, ch 233, § 21); New Hampshire (see State v Staples, 120 NH 278; 415 A2d 320 [1980]); New Jersey (NJSA 2A.81-12); New York (see People v Sandoval, 34 NY2d 371; 314 NE2d 413 [1974]); Pennsylvania (see Commonwealth v Bighum, 452 Pa 554; 307 A2d 255 [1973]); South Dakota (SD Codified Laws Ann, § 19-14-12); Texas (TRE 609); Vermont (VRE 609); Wisconsin (WRE 906.09).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. These five states are Alaska, Connecticut, Kentucky, Pennsylvania, and Vermont.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Compare People v Crawford with People v Kelly. See ante, pp 585-593.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. While the Dissenters claim they prefer to leave MRE 609 jurisprudence unchanged, their Disposition of the instant cases demonstrates their view that the credibility-contest factor should predominate over the effect-on-the-decisional-process factor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Gray, Chief Justice Riley's opinion states: \"Standing alone, evidence of convictions of carrying a concealed weapon and possession of heroin may not be highly probative of an individual's credibility. However, the value of such evidence to the truth-seeking process was critical because the trial had boiled down to a swearing contest between two opposing witnesses.\" (Post, pp 641-642.) And in Allen, Chief Justice Riley's opinion states: \"The similarity of the prior offense and the fact that it is not an offense like perjury which bears directly on credibility weigh against its admission. Nevertheless, the rationale underlying our decision in Gray, supra, is similarly applicable here where the question of guilt or innocence rests on the credibility of opposing witnesses.\" (Post, p 648.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The Dissent's emphasis on the numbers of criminal defendants who are convicted indicates an approach to rulemaking based upon probabilistics methods and mathematical techniques. This approach is utilized by the Dissent most pointedly and erroneously in its analysis of the Kalven \u0026 Zeisel materials cited ante, p 568, n 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Dissent states that the Kalven \u0026 Zeisel study \"assumed\" that the Judges' findings as to guilt or innocence of defendants were correct. However, the study did not make any such assumption. It instead compared Judge and jury decisions and attempted to discern the reasons for the differences. The only assumption made was that the Judges were able to accurately explain why they and the juries disagreed. Never in the work did the authors make the assumption that the Judges' evaluations of the defendants' guilt were correct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEven assuming that the statistical analysis is correct, it represents no more than a Conclusion that such a number represents the difference in Judge and jury conviction rates where the same prejudicial material is made known to each. The fact that Judges may also have difficulty ignoring the prejudicial aspects of this evidence does not run counter to our analysis. In other words, some of what the Dissent terms \"the most significant observations in The American Jury \" (post, p 695 were not, in fact, observed by its authors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEven more important, however, is that apart from the accuracy of the Dissent's statistics, it proposes that in order to gauge the effectiveness of procedural rules we must first and foremost consider what percentage of defendants are guilty. However, as pointed out by Professor Tribe:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eone is precise and calculating about rulemaking, one can no longer so easily enjoy the benefits of those profoundly useful notions -- like the \"presumption of innocence\" and \"acquittal in all cases of doubt\" -- that threatened by mathematical proof. After deciding in a deliberate and calculated way that it is willing to convict twelve innocent defendants out of 1000 in order to convict 800 who are guilty -- because that is thought to be preferable to convicting just six who are innocent but only 500 who are guilty -- a community would be hard pressed to insist in its culture and rhetoric that the rights of innocent persons must not be deliberately sacrificed for social gain. [Tribe, Trial by mathematics: Precision and ritual in the legal process, 84 Harv L R 1329, 1390 (1971).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Dissent, in essence, argues that rules should be determined in the context of the fact that according to its statistics, at least ninety-four percent of all defendants are guilty (not found guilty, but are guilty). While the Dissent does not by any means suggest the altering of the presumption of innocence in any given case, this approach would create a general presumption of guilt where the drafting of procedural and evidentiary rules are concerned. Carried to its logical consequences, this approach would result in less protective rules, more convictions, and therefore a self-fulfilling stronger presumption of guilt suggesting even less protective rules. Such a focus on trial outcome entails dangers for innocent defendants and for society at large.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eof trial procedure in particular have importance largely as [expression of certain ends and values] and only in part as means of influencing independently significant conduct and outcomes. Some of those rules, to be sure, reflect only \"an arid ritual of meaningless form,\" but others express profoundly significant moral relationships and principles -- principles too subtle to be translated into anything less complex than the intricate symbolism of the trial process. Far from being either barren or obsolete, much of what goes on in the trial of a lawsuit -- particularly in a criminal case -- is partly ceremonial or ritualistic in this deeply positive sense, and partly educational as well; procedure can serve a vital role as conventionalized communication among a trial's participants, and as something like a reminder to the community of the principles it holds important. The presumption of innocence, the rights to counsel and confrontation, the privilege against self-incrimination, and a variety of other trial rights, matter not only as devices for achieving or avoiding certain kinds of trial outcomes, but also as affirmations of respect for the accused as a human being -- affirmations that remind him and the public about the sort of society we want to become and, indeed, about the sort of society we are. [ Id., pp 1391-1392.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe agree with the Dissenters that the integrity of the fact-finding process is fundamental to rulemaking. However, we do not agree that the integrity of that process is to be measured by conviction rates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The amendment we adopt today bars impeachment by a prior conviction not punishable by more than one year's imprisonment unless dishonesty or false statement was an element of that prior offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. We continue the ten-year cutoff for the use of any prior convictions. In addition, for those theft convictions occurring less than ten years prior to the relevant case, the vintage of the prior conviction and the defendant's behavior subsequent to that conviction are relevant to probativeness. Contrary to the Dissent's assertion, as recently as People v Wakeford, 418 Mich 95; 341 NW2d 68 (1983), we indicated that the vintage of the prior conviction is a proper consideration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Even though the only crimes falling within the balancing test under the new rule are theft crimes and we have indicated that theft crimes are more probative of credibility than most other prior convictions, the determination of probative value must still be made in each case governed by the balancing test. We are not prepared to say that all theft crimes are of equal probativeness. In addition, the vintage of convictions will vary from case to case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. We note that application of the bright line mandating admission may be improper where the witness is an accomplice of the defendant and impeachment is sought upon the basis of conviction for crimes growing out of the events for which defendant is on trial. People v Lytal, 415 Mich 603; 329 NW2d 738 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. FRE 609 allows the trial Judge to consider only prejudice \"to the defendant\" when a prior conviction is introduced. We note that while this phrase is not included in the Michigan rule, its absence is not reported in the committee note to MRE 609, as are other differences from the federal rule, indicating that the original intent of the Michigan rule may not have differed in this regard from its federal counterpart.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. While crimes having an element of theft are probative of veracity, we recognize that there are variations within this category (see n 33) and that the probative value of a particular prior conviction may be insignificant and so it should not be admitted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. An independent problem may arise where the witness was an accomplice of the defendant. See n 34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The clarified balancing test shall not apply where an initial and direct appeal has been concluded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. After March 1, 1988, only theft crimes will fall within the balancing test. See n 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The Dissent points out that retroactive application of this decision cannot, \"in good faith, be justified by rule-making authority.\" (Post, p 661.) We agree, and we do not rely on such authority. The sole portion of this opinion which has retroactive effect is the clarification of the existing balancing test. This portion resolves a split in the lower courts and does not require amendment of MRE 609.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. We note that application of the bright-line tests would have resulted in the same Dispositions in these cases. In Allen, Smith, and Gray, the admission of the prior convictions would have been deemed error, since criminal sexual conduct, the carrying of a concealed weapon, and possession of heroin are not theft crimes, nor do they involve dishonesty or false statement. They therefore would have been excluded pursuant to the amended MRE 609(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Pedrin and Brooks, since the prior convictions were theft offenses, we would have applied the balancing test just as we have today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, in both Brooks and Smith, the error would still have been held to be harmless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Sample II only.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 422 Mich 972, 973 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Morgan admitted that she initially lied to the police and told them that Carter had been over to her house on the night in question, that she fed him two hot dogs, that they were drinking Crown Royal, and that he left her house on foot. She stated that she lied to the police out of fear. She subsequently recanted that story and told the police substantially the same facts that she testified to in court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 MRE 609(b) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Time Limit. Evidence of a conviction under this rule is not admissible if a period of more than ten years has elapsed since the date of the conviction or of the release of the witness from the confinement imposed for that conviction, whichever is the later date.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 See Wong Sun v United States, 371 U.S. 471; 83 S Ct 407; 9 L Ed 2d 441 (1963); People v Kachar, 400 Mich 78; 252 NW2d 807 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Before the trial began, Minkler pled guilty of two counts of criminal sexual conduct (the degree is not clear from the record). Panik also pled guilty of criminal sexual conduct (the degree or number of counts is similarly not clear on the record).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Earlier that day, Panik, Minkler, and Smith drank some whiskey, smoked marijuana, and ingested some \"crystal\" (PCP). Panik testified that they originally left Smith's house with a general intention of perpetrating a burglary. Minkler testified that they intended to steal tape decks out of cars.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Other evidence showed that the term \"crystal\" and \"tea\" are slang for the controlled substance phencyclidine which is also referred to as \"PCP.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 See n 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The response to which the defendant objected arose during the following colloquy which occurred after it was established that the deputies were approximately thirty to thirty-five feet from the defendants' vehicle when they looked at it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. [ Prosecuting Attorney ]: When they got that close to you -- you said you were smoking, is that right?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. [ Panik ]: Yeah.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Did you let the joint stay out so that they could see it?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. What did you do?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. We had beer, you know, we was all on parole, we didn't need them to come up to the car.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. All right. So, you didn't act in a way that would attract attention?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. All right. Did you say anything to the officers?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Was anybody struggling, or moving around, or doing anything in the car?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Did they come over to the car?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. They just went into the store?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yeah.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. You remember them, because they were police officers, and you were on parole, is that right?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 FRE 609(a) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGeneral rule. For the purpose of attacking the credibility of a witness, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if the crime (1) was punishable by death or imprisonment in excess of one year under the law under which he was convicted, and the court determines that the probative value of admitting this evidence outweighs its prejudicial effect to the defendant, or (2) involved dishonesty or false statement, regardless of the punishment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMRE 609(a) modified the federal rule by inserting the word \"theft\" before the phrase \"dishonesty or false statement,\" and by requiring a determination that probative value outweighs prejudicial effect \"as a condition of admissibility as to all convictions used for impeachment.\" Note to MRE 609(a). Effective May 14, 1980, MRE 609(a)(2) was amended to require that the trial court \"articulate[] on the record the factors considered in making determination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 People v Hughes, 411 Mich 517; 309 NW2d 525 (1981); People v Crawford, 83 Mich App 35, 39; 268 NW2d 275 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 \"Requiring that a defendant testify in order to preserve Rule 609(a) claims, . . . will also tend to discourage making such motions solely to 'plant' reversible error in the event of conviction.\" Luce, supra, 469 U.S. 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also People v Owens, 131 Mich App 76, 82-83; 345 NW2d 904 (1983); People v Sanders, 130 Mich App 246; 343 NW2d 513 (1983); People v Casey, 120 Mich App 690; 327 NW2d 337 (1982); People v Wilson, 107 Mich App 470; 309 NW2d 584 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 See People v Collins, 228 Cal Rptr 899; 722 P2d 173 (1986); People v Brewer, 720 P2d 583 (Colo App, 1985); Vaupel v State, 708 P2d 1248 (Wy, 1985); State v Allie, 147 Ariz 320; 710 P2d 430 (1985); State v Means, 363 NW2d 565 (SD, 1985); State v Glenn, 285 SC 384; 330 SE2d 285 (1985); State v Harrell, 199 Conn 255; 506 A2d 1041 (1986); State v Garza, 109 Idaho 40; 704 P2d 944 (1985); State v Whitehead, 203 NJ Super 509; 497 A2d 548 (1985); People v Hartfield, 137 Ill App 3d 679; 484 NE2d 1136 (1985); People v Redman, 141 Ill App 3d 691; 490 NE2d 958 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Jimenez v State, 480 So 2d 705 (Fla App, 1985); State v Chapman, 496 A2d 297 (Me, 1985); State v White, 43 Wash App 580; 718 P2d 841 (1986); State v Banner, 717 P2d 1325 (Utah, 1986); McBride v State, unpublished opinion of the Texas Court of Appeals, decided August 28, 1986 (Docket No. 01-85-0301-CR); Page v State, 725 P2d 1082 (Alas App, 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eContra State v McClure, 298 Or 336; 692 P2d 579 (1984); State v Ford, 381 NW2d 30 (Minn App, 1986); Commonwealth v Richardson, 347 Pa Super 564; 500 A2d 1200 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 In United States v Johnson, 767 F2d 1259, 1270 (CA 8, 1985), the court, citing Luce, supra, declined to review defendants' contention that the trial court erred in denying their motions in limine to exclude evidence of other crimes (FRE 404) the government indicated it intended to introduce during cross-examination and in rebuttal if the defendants testified. In United States v Weichert, 783 F2d 23, 25 (CA 2, 1986), the court held that defendant failed to preserve for review the correctness of the trial court's ruling in limine that the government could impeach him under FRE 608(b) due to his failure to testify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, in Spell v McDaniel, 606 F Supp 1416 (ED NC, 1985), the court ruled that Luce precluded review of defendant's contention that the court's advisory ruling that plaintiff could not be impeached with a prior narcotics conviction was erroneous because defendant failed to call plaintiff as a hostile witness. See also United States v Sebetich, 776 F2d 412 (CA 3, 1985) (implying that a party's objection to failure to allow impeachment of a witness with hearsay statements was not preserved due to failure to call the witness).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 This Court initially suggested that these were the relevant factors in People v Jackson, 391 Mich 323, 333; 217 NW2d 22 (1974), citing Gordon v United States, 127 U.S. App DC 343; 383 F2d 936 (1967). Although Jackson preceded the March 1, 1978, effective date of the Michigan Rules of Evidence, it is well established that these factors continue to be the appropriate criteria relevant to the balancing required by MRE 609(a)(2). See People v Hughes, 411 Mich 517, 520; 309 NW2d 525 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 The trial Judge initially indicated that Morgan could also be impeached with her prior record to show that neither the defendant nor the witness had \"clean slates.\" However, it was later discovered that Morgan's prior record consisted primarily of misdemeanor convictions of accosting and soliciting which were suppressed because that offense does not involve theft, dishonesty, or false statement. A 1969 conviction of preparation to burn was also suppressed because it fell outside the ten-year time limit. See MRE 609(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 In addition to emphasizing the centrality of the credibility issue, the court also considered the lack of similarity between the prior convictions and the charged offense. The fourth factor, the effect of the court's ruling on the decisional process if the accused does not testify out of fear of impeachment, is not relevant because the defendant testified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 CJI 3:1:08 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) There is evidence that the defendant has prior criminal .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) This evidence is to be considered by you only insofar as it may affect the defendant's credibility as a witness. It must not be considered by you as evidence of his guilt of this crime, nor should it be considered by you as increasing the probability of his having committed the crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 The Court of Appeals has held that a trial court is not required, sua sponte, to give a limiting instruction regarding use of a defendant's prior record for impeachment. People v Haukom, 56 Mich App 244, 245; 223 NW2d 648 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 See MRE 613.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 See n 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 Entry into a private home without a warrant to effect the arrest of a defendant is justified either by consent or exigent circumstances. Steagald v United States, 451 U.S. 204; 101 S Ct 1642; 68 L Ed 2d 38 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 Defendant specifically objects to the admission of four slides of the victim's neck wound that were photographed by the treating physician prior to suturing and three photographs which depict the victim's neck and face after the wound was treated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 See n 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 Redmon was decided subsequent to defendant's conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a While I have focused the first two sections of this Dissent on bright-line exclusion because of its potential effect on factual accuracy, I wish to state at the outset that I also do not regard bright-line rules of inclusion as wise policy for our jurisprudence. Both rules artificially restrict the appropriate functions of juries and trial Judges, see part II(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a The Court posits a deficiency in the current application of Rule 609 and proceeds to remedy it despite the facts that we have a standing committee on the Rules of Evidence and that we have just completed the comment phase of our rulemaking process with regard to other amendments. The Court has thus interdicted the expression of other views and the self-education that the rulemaking process contemplates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a Some of the analysis in the majority opinion is apparently the result of the failure to understand the distinct purposes of MRE 404 and MRE 609. MRE 404(a) prevents the use of character evidence as substantive proof of guilt. Where the evidence is sufficient to survive a motion for directed verdict, MRE 404(a) interests have been served, the rule of exclusion has been satisfied, and the general rule of admission of relevant evidence again obtains (subject to MRE 403 considerations). Properly understood, there is no basis for a contention that there is a \"practical contradiction\" between MRE 404(a), which applies to the use of character evidence for the substantive purpose of proving guilt and MRE 609, which governs the use of evidence offered to impeach credibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a The majority seems to suggest that the favored view among the states is to restrict the admission of criminal conviction impeachment evidence. Careful examination of the relevant statutes and rules of evidence points to a contrary Conclusion. In fact, it appears that the federal rule and the rule in forty-five states permit the type of impeachment the majority here precludes, Beaver \u0026 Marques, A proposal to modify the rule on criminal conviction impeachment, 58 Temple L Q 585 (1985). With narrow exceptions, the clear majority of states employing bright-line rules favor the admission of prior conviction evidence. When viewed in the aggregate, the overwhelming majority of states have favored bright-line tests of inclusion or have left to the discretion of the trial Judge the task of probative/prejudice balancing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a The majority view has also failed to consider the effect of \"bright line\" rules on the system which, as we have seen with the rule in People v Kreiner, 415 Mich 372; 329 NW2d 716 (1982), and the rape shield statute, MCL 750.520j; MSA 28.788(10), frequently have the effect of compelling the judiciary to evade the harshness of a \"bright line\" rule that smacks of inJustice in a particular application to reality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a Justice Brickley appears to take issue with the assumption that ninety percent of those charged are guilty of some offense related to the facts upon which they are charged. Judge Frankel's observation that the \"preponderant majority\" are guilty does not stand alone. In one study of the attitudes of public defenders, Mather, Some determinants of the method of case Disposition: Decision-making by public defenders in Los Angeles, 8 Law \u0026 Society 187, 209-210 (1973), they reported that, \"' of the cases we get are pretty hopeless -- really not much chance of an acquittal.'\" These cases were described as \"deadbang,\" that is, no credible defense could even be devised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the most recent compilation of national data from thirty-seven urban jurisdictions, including three counties in Michigan, Wayne, Ingham, and Kalamazoo, Boland \u0026 Sones, The prosecution of felony arrests, 1981, U S Dep't of Justice (July, 1986), for every one hundred felony arrests disposed of in felony court, seventeen are dismissed, two are diverted, sixty-eight result in a guilty plea, and thirteen go to trial. Of the trials alone, nine are convicted and four are acquitted. Id., p 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOf critical importance is the explanation of the dismissals. Dismissals occur not only on the basis of insufficient evidence, but primarily because a plea was taken on another case, the complainant refused to prosecute, referral for different charges on the same case, evidence was illegally seized, and there were witness problems in general. Id., pp 12-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOf all cases after screening which reach the adjudicative level of determining the guilt of the defendant, that is, the very cases with which we are dealing in this opinion, eighty-four percent of all defendants admit their guilt, and ninety-five percent are found guilty by trial or plea.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNor is the data significantly different for Detroit Recorder's Court which handles a vastly disproportionately higher percentage of criminal cases than other jurisdictions within this state. Attached is a table compiled from the published annual reports of that court. (See appendix A.) The table would have been carried forward, but official publicly published reports are not available after 1979.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs the table clearly indicates, in Recorder's Court, over a ten-year reporting period, eighty-six percent of all defendants at the adjudicative stage admit their guilt and ninety-four percent of all defendants at that stage are found guilty. The local data do not vary from the national data.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne can only speculate from studying the table as to why the percentage of persons pleading guilty, the conviction rate at trial, and the overall conviction rate tended to drop over the ten years. Perhaps, judicial intervention at the \"policy making\" level changes the fulcrum of values for decisionmaking by defense counsel, see Boland \u0026 Sones, (supra) , p 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne thing is clear. \"Deadbang\" cases become less \"deadbang\" as a result of today's decision. A \"credible\" defense can always be devised in a jury trial if the defendant is allowed to present it and the jury is deprived of truthful evidence by which to test his credibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eToday's decision portends the following consequences: the percentage of persons pleading guilty will decline, the percentage opting for a jury trial over a bench trial will increase, the percentage found guilty by a jury will decline, and the overall percentage of persons found guilty will decline, all of which has nothing to do with whether defendants are guilty or not, and, in the face of national and local data, that at least ninety-four percent of those charged at the adjudicative level are guilty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a Justice Brickley has rewritten history by reading Rule 609 as if it were a rule of exclusion. In 1974, the Court had indicated in People v Jackson, 391 Mich 323; 217 NW2d 22 (1974), that it was disposed to limit the admission of prior convictions. In the atmosphere created by Jackson, this Court's committee, on which I served, clearly refused to limit admissibility and promulgated a rule of general admission giving authority for the evidentiary decision to the trial Judge to be tested on review by an abuse of discretion standard. Justice Brickley's insistence that the rationale in People v Kelly, 66 Mich App 634; 239 NW2d 691 (1976), cannot be squared with Rule 609 thus rests on his incorrect view of 609 as a rule of limitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a People v Kelly focused resolution of the impeachment issue on the effect on the truth-seeking process itself, \"not merely the prospects for acquittal,\" People v Wakeford, 418 Mich 95, 116-117 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe focus of Kelly and Wakeford is not the effect on the defendant if the defendant is impeached, but the effect on the jury if it does not hear all that it can properly be told in a one-to-one credibility situation. While the majority states that it is not the defendant's need for the evidence that is to be evaluated in the new balancing process, it is apparent from the majority's analysis of the cases before us that that is the definition of \"effect on the decisional process.\" Indeed, while purportedly resolving a split in the Court of Appeals on the propriety of impeachment in a one-to-one credibility situation, the majority's resolution of these cases in fact reveals that this rule is far more than a clarification of the existing balancing test. Error is found, not only in the one-to-one credibility situation (Gray), but also where there are two defense witnesses against one complainant (Allen), and where there are four prosecution witnesses against the defendant (Brooks and Smith). What the trial court Judge is apparently to conclude from these results is that the effect on the decisional process is defined by a defendant's need for the testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a This approach becomes even more problematic given the majority's failure to agree on adoption of the Luce rule, Luce v United States, 469 U.S. 38; 105 S Ct 460; 83 L Ed 2d 443 (1984). As Justice Ryan noted in People v Wakeford, 418 Mich 117,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the absence of some indication as to what the defendant's testimony would have been, we can only speculate as to how the trial would have been different and the \"decisional process\" affected . . . had the defendant testified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a The majority also appears to overrule two prior pronouncements of this Court establishing the parameters for impeachment of non-defendant witnesses. People v Atkins #2, 406 Mich 958 (1979); People v Tait, 136 Mich App 475; 356 NW2d 33 (1984). The question of the proper rule for non-defendant witnesses has neither been briefed nor argued here. Like the rule adopted by the Court today for criminal defendants, the rule adopted for non-defendant witnesses is informed by the rare air of the appellate forum rather than an understanding of the reality of the trial court arena.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a In fact, if we are to look for guidance to the behavioral sciences, lying is one of the diagnostic characteristics of persons classified as having antisocial (criminal) personalities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe diagnosis of antisocial personality disorder is reserved for persons whose behavior is said to demonstrate a persistence into adult life of a pattern of childhood antisocial behaviors. These behaviors include lying, stealing, fighting, and resisting authority; they are behaviors any moderately observant mother should be able to identify. In adulthood, the person with antisocial personality is described as having [among many other characteristics] an inconsistent work performance, an inability to maintain interpersonal attachments, . . . unlawful behavior, lying . . . . [Kaplan \u0026 Sadock, Comprehensive Textbook of Psychiatry (4th ed, 1985), p 1866.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is true that people engaging in these behaviors may be useful and even successful citizens. The fact remains that the medical approach to understanding crime supports the intuitive lay sense that there is a relationship between the behaviors, Halleck, Sociopathy: Ethical aspects of diagnosis and treatment, 20 Current Psychiatric Therapies 167 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Diagnostic and Statistical Manual of Mental Disorders (3d ed) (DSM III R) of the American Psychiatric Association also lists among the diagnostic criteria \"(2) fails to conform to social norms with respect to lawful behavior, as indicated by repeatedly performing antisocial acts that are grounds for arrest (whether arrested or not), e.g., destroying property, harassing others, stealing, pursuing an illegal occupation, (3) is irritable and aggressive, as indicated by repeated physical fights or assaults (not required by one's job or to defend someone or oneself) including spouse- or child-beating . . ., (b) has no regard for the truth, as indicated by repeated lying, use of aliases, or 'conning' others for personal profit or pleasure.\" Diagnostic and Statistical Manual of Mental Disorders (3d ed), (Washington, DC: American Psychiatric Association, 1987), p 345.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a Indeed, existing rules of procedure, including MCR 2.610 -- Motion for Judgment Notwithstanding the Verdict and MCR 2.611 -- New Trials, provide the accused with protection against erroneous conviction. See, also, Proposed Michigan Court Rule 6.412(A), 422A Mich 170 (no time limit on motions for new trial based on newly discovered evidence). These rules stand not merely as surplusage to the rules of evidence, but rather as additional shields to the wrongfully convicted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13a If, generically, a class of evidence has no probative value to attack credibility, the absence of the identical class of evidence has no probative value in support of credibility. Of course, the majority's observation that perfect symmetry (read fairness to both sides) cannot be obtained can in a future case explain why absence of conviction is relevant to support credibility, but proof of conviction is not relevant to impeach credibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14a The flaw in the majority's faith in bright-line rules is already evidenced in the opinion that creates the rules. The majority adopts a bright-line rule which by definition excludes trial court evaluation of the issue. At the same time, the majority is forced to recognize in ns 34 and 37 the existence of an \"independent problem\" trial courts will be required to resolve without guidance from this Court. To formulate a rule based on the principle that there are no exceptions and to recognize in the same opinion that there may be some exceptions is to reveal the ultimate fallacy of bright-line tests. The noted problem itself demonstrates that \"always\" cannot mean always and \"never\" cannot mean never. The problem noted is direct evidence that bright-line rules should not be adopted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15a Trusting the jury to follow instructions which limit the use of the prior convictions accords with what Justice Scalia, in Richardson v Marsh, 107 S Ct 1707, has recently described as \"the almost invariable assumption of the law that jurors follow their instructions . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs Justice Rehnquist observed, if it is is pointless to give a jury limiting instructions, it is \"pointless for a trial court to instruct a jury, and even more pointless for an appellate court to reverse a criminal conviction because the jury was improperly instructed.\" Parker v Randolph, 442 U.S. 62, 73; 99 S Ct 2132; 60 L Ed 2d 713 (1979). See, also, Cruz v New York, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16a If the studies were deemed to be reliable by the majority, they would no doubt form the basis for the Conclusion that there is an \"overwhelming probability\" for jurors to misuse prior conviction evidence. If they are not reliable, they do not deserve consideration and should not be cited. In fact, they appear to have been included because, as the majority observes, they \"support our view.\" Indeed, as the majority ultimately acknowledges, the Conclusion that there is an \"overwhelming probability\" that jurors misuse evidence rests solely on the majority's \"perception\" of the \"obvious.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe statement that the \"standard of appellate review prevents correction of error\" itself refutes the majority's \"perception\" of the obvious. Prejudicial misuse is defined by the majority as a \"likelihood\" of conviction of the innocent. The standard of review permits reversal when after a review of the other evidence of guilt, the appellate court can say the conviction constituted a miscarriage of Justice. People v Robinson, 386 Mich 551; 194 NW2d 709 (1972). The standard of review establishes that, apart from the \"error,\" the conviction is supported by other evidence, sufficient to convince the reviewing tribunal that a conviction of an innocent person has not occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI do not suggest that jurors universally avoid improper consideration of prior-conviction evidence. Rather, what I suggest is that it is not sound policy to impose this burden on the legal system given the existing protection of the innocent and the effect on the truth-finding function.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17a Since the majority defines low probative value and strong potential for prejudice by reference to whether the factfinder is able to understand a permissible consideration by first recognizing the impermissible consideration, it should logically follow that any evidence admitted for a limited purpose will have low probative value and strong potential for prejudice. If this result does not follow, it must be because there is a distinction between direct mediation and indirect mediation that the majority has as yet not explained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18a The majority quotes at length from this study, ante, pp 575-576. Forty-eight persons were individually approached in and around various public buildings. Each was read a four-hundred-word description of a case of breaking and entering. Each was asked, \"How likely do you think it is that he is guilty?\" Each was asked to respond on a scale that ran from one (definitely guilty) to seven (definitely not guilty). Points three and five were labeled as \"probably guilty\" and \"probably not guilty,\" respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwelve persons read the case and rated (Group 1); twelve persons read, in addition, that the defense attorney decided not to put his client on the stand because there was no purpose (Group 2); twelve persons were told that the defendant testified \"but did not give any important evidence\" and that the defendant was impeached with five prior felonies for breaking and entering an occupied dwelling and twice for possession of stolen property (Group 3); and twelve persons were told, in addition to the convictions, the limiting instruction of the Judge (Group 4). The results were:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAverage Ratings of Guilt\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGroup 1 4.00\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGroup 2 4.33\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGroup 3 3.25\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGroup 4 3.00\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe study concludes on the basis of the data that the presence of a record has a dramatic effect. I would expect that random disagreement in so small a sample could account for all of the difference, but, regardless, this study can hardly be urged as support for the majority's result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is simply no real basis for comparison between the methodology of this study and that of the courtroom. These are forty-eight individual ratings without a trial, evidence, voir dire, argument, witnesses, instructions, or deliberation, and the prior conviction evidence is overwhelming and unrepresentative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19a This study, in one respect, comes closer to reality. It has four-person groups actually deliberate. In all other respects, it shares the defects of the other studies: No voir dire, no live witnesses to evaluate, no evidence as we understand the term, no cross-examination, no argument, no instructions -- in a word, no trial. It is difficult to analytically measure effects of evidence in a trial when there is no trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe description of the case for individual jurors and four-person groups was as follows. A woman's home had been broken into and two-hundred dollars had been stolen. As the woman arrived home, she saw the burglar fleeing through the back yard. While the time was brief, she saw the burglar turn around while he was on the fence giving her a view of his face. She immediately reported the crime and the defendant's description. The police arrested a man in the vicinity of the crime who matched the description and who had two-hundred dollars in the glove compartment of his car. The woman positively identified the man in a line-up.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe survey participants were told that, at the trial, the defendant and his girlfriend testified that they were at the movies at the time of the burglary. Half of the subjects received the fact that the defendant had previously been convicted of burglary and a limiting instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe results of both individual and group \"verdicts\" are as follows, p 243:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePERCENTAGES OF GUILTY VERDICTS IN EACH OF THE FOUR\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONDITIONS\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIndividual Group\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003everdict verdict\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eRecord\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003econdition 45% 40%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(N = 20) (N = 15 groups)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNo Record\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003econdition 40% 0%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(N = 20) (N = 15 groups)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe study analyzes this data as well as tapes of deliberations and concludes that what is a \" weak manipulation (one prior conviction) in the individual verdict condition proves to be a strong manipulation in the group verdict condition.\" It concludes that there is little doubt that knowledge of a previous conviction biases a case against the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhat the data above illustrates is that conviction rates fall as between individual verdicts and group verdicts regardless of record or no record condition, that is, the jury is more disposed as a group to acquit than individuals are.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSecond, the data suggest that on the facts given, hardly a weak case, all four-person groups will acquit absent a record and that tapes of their deliberations reflect distortions of fact unrelated to the evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThird, on the evidence and the criminal record, only forty percent of the four-person groups convicted, a percentage likely to drop substantially where unanimous twelve-person groups are required.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20a I would not make reference to a study based on a two-page summary for formulation of a rule interdicting trial court discretion. Since the majority does, the study should be explained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEighty persons received an auto theft case, and eighty persons received a murder case. For each crime, the groups were subdivided into groups of twenty for tabulation of four different record conditions: 1) no record, 2) previous conviction of the same crime, 3) previous conviction of a dissimilar crime (murder in the auto theft case and auto theft in the murder case), and 4) previous conviction of perjury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe subject would read the two pages and answer, essentially, whether the defendant was guilty or not, why he had reached that verdict, and whether the defendant's prior conviction had influenced his guilty/not guilty verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe results were as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONVICTION RATE\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCASE\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePRIOR CONVICTION AUTO THEFT MURDER\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNone 35% (7 of 20) 50% (10 of 20)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSame 80% (16 of 20) 70% (14 of 20)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDissimilar 70% (14 of 20) 35% (7 of 20)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePerjury 70% (14 of 20) 50% (10 of 20)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThus, in all auto theft cases under a variety of prior record conditions, eighty persons split fifty-one to twenty-nine for conviction, and, in all murder cases under similar conditions, eighty persons split forty-one to thirty-nine for conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe study's disclaimer (see ante, p 568) is an enormous understatement. These are not mock jurors. This is a public opinion survey.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere was no trial, no evidence, no witnesses, no voir dire, no instructions, no deliberation, and, most importantly, no adverse effect on a living person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the study produced reliable results, it suggests that impeachment by a perjury conviction in a murder case means nothing, but, in an auto theft case, it doubles the conviction rate. It suggests that use of a conviction of auto theft in a murder trial lowers the conviction rate by a third. That these surprising results are selectively ignored by the majority underscores the paucity of the relied upon data.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn truth, this study has no value for policymaking in this area. The number in the sample is so low, the margin for error so high, and the conditions so removed from those in an actual jury trial, that the majority cannot be serious in placing any reliance on this slender reed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21a While the study does indicate that the rate of conviction of defendants who either were impeached with a prior conviction or did not take the stand is higher than that of those who were not impeached either because they had no record or because their record was suppressed (see n 23), the missing element in this analysis, as in all juror research, is obvious: How many of the defendants were, in fact, guilty? Various estimates of this number exist. Assuming that ninety percent are guilty of the offense charged or a related offense, see n 6, these results are, in fact, an argument against the majority result. Read in the light of that assumption, what the statistics prove is that jurors deprived of evidence that bears on credibility are twice as likely (forty-two percent to twenty-five percent) to acquit a guilty defendant. Moreover, if twenty-five percent of juries who heard former conviction evidence acquit, the presumption of prejudice espoused by the majority is refuted. This figure demonstrates that jurors do require the prosecution to present proof beyond a reasonable doubt. The Kalven \u0026 Zeisel study does not support the Conclusion that juries convict the innocent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22a The Kalven \u0026 Zeisel study does not in terms state that it assumes that the trial Judge's verdict is correct, that is, that all defendants found guilty by a Judge were, in reality, guilty. It does proceed from the assumption that Judges follow the law and assess the facts with a degree of competence that calls for examination of the reasons for the difference between Judge and jury. Thus, as the authors observe \"as a matter of both theoretical interest and methodological convenience, we study the performance of the Judge as a baseline . . . . The result is a systematic view of how often the jury disagrees with the Judge, of the direction of such Dissent, and an assessment of the reasons for it,\" id., p 10. Of course, if, as the majority suggests, we are now to reject the assumption that Judges have special competence in applying the law to the facts, there is no empirical measure for evaluating the likely accuracy of jury verdicts since neither mock studies nor Kalven \u0026 Zeisel provide meaningful information on the question. These studies are used by the majority to the extent they \"support\" the majority view and are rejected where they do not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI did not introduce them into this Discussion, and I do not rely on them. I have undertaken this critique only because the majority has asserted that the studies deserve consideration, in the hope that close analysis would prompt the majority to a more rigorous examination of the premises and the potential consequences of its new rules.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23a First, the purpose of table 52, p 160, and the companion table, p 162, was not to demonstrate erroneous reliance on impeachment evidence. The authors of the study used both tables as evidence that \"the jury by and large does understand the case and get it straight . . . .\" Id., p 162.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe table distributes all trials in sample II (1191) into nine cells by strength of the prosecution's case vertically and by balance of contradictions horizontally. Thus, the weakest case for the prosecution is in the upper left cell and the strongest is in the bottom right cell. Each cell is further subdivided by the factor \"No record/stand\" and \"Record/no stand.\" The two groups are composed of the following: 1) The first group is comprised of all cases in which the defendant took the stand and had no record or had his record suppressed plus those cases in which the defendant did not take the stand but the jury learned that he had no prior criminal record. 2) The second group is comprised of all cases in which the defendant did testify and was impeached with his record or did not take the stand at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis grouping blunts the effectiveness of drawing Conclusions on the basis of impeachment alone. Moreover, the total differential acquittal rate is forty-two percent versus twenty-five percent on the basis of all cases in the cells.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBy comparing the jury acquittal rate with the Judge acquittal rate, in no cell does the jury convict at a higher rate than the Judge even where the jury learns of a prior criminal record. See appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFinally, the study concludes its examination of the defendant's credibility as affected by the absence of a record or by its suppression by concluding that twenty-three percent of all disagreements between a jury and a Judge (a jury acquittal versus a Judge conviction) are due to the jury's attachment of weight to an unblemished record. Id., p 180.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOn the second point, ante, p 568, n 8, the majority places reliance upon the data which reflect that while ninety-one percent of all defendants without a record testify, only seventy-four percent of those with a record do so. The majority mistakenly attributes the difference to the existence of the record alone. If the value or need for the defendant's testimony were as great as the majority assumes and the damage of impeachment so great, one would expect a significantly greater differential.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt must be assumed that all factors which operate in the matrix of values for decisionmaking which keeps record-free defendants off the stand similarly operate for those with records. Thus, the existence of a prior record is a cumulative factor whose value is not arithmetically deducible by simple subtraction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24a The majority's resort to the accusation that I have resorted to statistics, n 30, is ironic. Unable to find support in law for what it does, the majority introduces statistics. When confronted with the fact that the studies either do not withstand scrutiny or refute the majority's premises, the majority responds by asserting that trial Judges are as corrupted by the taint of the evidence as it assumes juries are. When challenged to consider the impact on the fact-finding process in light of the protections surrounding the competing value at stake, the majority retreats to the proposition that its view advances the integrity of fact finding. The majority thus ultimately reveals its only basis -- the conviction that its views should be imposed on the system.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25a Id., pp 160, 162, and 389.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26a While it is a hallowed principle of our system that it is better that ten guilty persons go free than that one innocent person is convicted, it is another matter entirely to formulate policy on a basis that suggests that 999 guilty persons should go free rather than one innocent person be convicted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27a It may be legitimately observed that imposition of a minimum penalty is scant comfort to an innocent defendant. It must be remembered, however, that The American Jury study was conducted before the United States Supreme Court held that evidence sufficient to support a verdict of guilty beyond a reasonable doubt in the case in chief was constitutionally required, see Discussion, § II(1), ante, pp 668-669. Thus, the current law provides the accused with additional protection against erroneous conviction. Moreover, our current rules of procedure, MCR 2.610 and MCR 2.611, provide for post-conviction relief, which, assuming the good faith of our trial judiciary, stand as additional barriers against even the arguably incorrect jury verdict. See also Proposed Michigan Court Rule 6.412(A), 422A Mich 170 (no time limit on motions for new trial based on newly discovered evidence).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28a In fact, if the majority premise is correct that Rule 609 presents a \"likelihood\" that innocent persons are convicted, it should logically follow that all prior convictions for impeachment should be eliminated. As Judge Weinstein observed in commenting on a proposal to limit impeachment to those crimes which indicate a direct tendency to falsify,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile this approach possibly ensures that the conviction will have a higher probative value re credibility, it does nothing to lessen prejudice to the defendant who is being tried for a crime involving an element of falsehood, since the jury may well assume that he is guilty again. [3 Weinstein, Evidence, para. 609[02], pp 609-62 to 609-63.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere are only two wholly logical alternatives to this approach, all in or all out. Thus, if it is \"absurd to suggest that jurors will be able to avoid improper consideration of a defendant's criminal character once it has become known to them,\" it is \"absurd\" to permit the introduction, with limiting instructions, of bright-line inclusions or theft offenses, since a jury presumably is, in these cases, equally unlikely to follow instructions, and thus, equally likely to convict innocent defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThat the majority apparently finds the logical consequence of its own rationale too great a burden to impose on the system underscores the arbitrary nature of the \"solution\" that today replaces trial court discretion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29a The intuitive sense that jurors may misuse evidence, like the presumption that jurors follow instructions, makes the rule of trial court discretion a sometimes uneasy compromise, rooted finally in the belief \"that it represents a reasonable practical accommodation of the interests of the state and the defendant in the criminal Justice process,\" Richardson v Marsh, 481 U.S. , ; 107 S Ct 1702, 1709; 95 L Ed 2d 176 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUntil today, however, only the courts of Hawaii and West Virginia have had such confidence in the wisdom of their perceptions that they would create a policy that systemically skews factual accuracy and prevents the trial court from protecting a defendant against undue prejudice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe issue at last comes down to this: Assuming a potential for prejudice from misuse of prior conviction evidence, what law, data, studies, or experience, support the proposition that there is an \"overwhelming probability\" that jurors misuse the evidence to \"convict innocent persons?\" The majority's assertion that \"it is absurd to suggest that jurors will be able to avoid improper consideration\" is, in fact, a rhetorical substitute for a lack of substance both in its premise (that there is an \"overwhelming probability\" that jurors misuse evidence) and its Conclusion (that innocent persons are convicted); a proposition the majority tautologically proves by resort to its perceptions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30a The majority accuses me of having argued that rules should be formulated on the basis of statistics. What has been suggested is, that if the majority opts to resort to scientific data to support its new rules, that mode of analysis, which I would not adopt, should at the least accord consideration to the current operation of the system (including both the existing data, and the existing legal protections against misuse of evidence). It would seem more logical to determine rules in the context of what we know about our own system, rather than on the basis of three studies of simulated jurors or alternatively, on unsupported perceptions. I have not suggested that we should \"first and foremost\" consider what percentage of defendants are guilty. I have advanced the modest proposition that procedural rules should be formulated with concern for the burden on factual accuracy, see ante, p 604.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31a MRE 609(a) as originally proposed to this Court provided as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eRule 609. Impeachment by Evidence of Conviction of Crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) General rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) Criminal defendants. For the purpose of attacking the credibility of a witness-accused in a criminal case, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(A) the crime was punishable by death or imprisonment in excess of one year under the law under which he was convicted or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(B) the crime involved dishonesty or false statement, regardless of the punishment, and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(C) the court determines that the probative value of admitting this evidence on the issue of credibility outweighs its prejudicial effect on the witness-accused.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) All witnesses other than criminal defendants. For the purpose of attacking the credibility of any witness other than a witness-accused in a criminal case, evidence that he has been convicted of a crime shall be admitted if elicited from him or established by public record during cross-examination but only if\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(A) the crime was punishable by death or imprisonment in excess of one year under the law under which he was convicted and the court determines that the probative value of admitting this evidence on the issue of credibility outweighs its prejudicial effect or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(B) the crime involved dishonesty or false statement, regardless of the punishment. [399 Mich 987-988 (1977).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32a For a Discussion of the battle over judicial discretion in relation to FRE 609(a), see note, Impeachment with prior convictions under Federal Rule of Evidence 609(a)(1): A plea for balance, 63 Wash U L Q 469, 474-478 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33a It should be noted, also, that while the majority has ostensibly created a category of automatically admissible convictions, it has narrowed significantly the admissibility of both felonies and misdemeanors involving dishonesty, or false statement. The majority defines as automatically admissible crimes which involve dishonest or false statements as an \"actual element of the offense in question.\" (Ante, p 594, n 15.) No authority is cited in support of the requirement that the dishonesty and false statement category include only those crimes \"where dishonesty or false statement is an actual element of the offense . . . .\" Id. While it is suggested that the federal rule requires dishonesty or false statement as an actual element of the impeaching offense, the meaning of the terms \"dishonesty\" or \"false statement\" in FRE 609(a)(2) is an issue that has divided the federal circuits, United States v Wilson, 536 F2d 883, 885 (CA 9, 1976); United States v Smith, 179 U.S. App DC 162; 551 F2d 348 (1976); Weinstein, Evidence, para. 609[04]. The majority has thus imposed additional limitations on impeachment evidence for the avowed purpose of limiting trial court discretion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34a The newly announced witness rule is such a clear break with prior jurisprudence that the parties in those cases never thought of nor argued it.\u003c/span\u003e\n\n",
    "body_length": 276685,
    "citedas": [
      "420 N.W.2d 499",
      "429 Mich. 558"
    ],
    "attorneys": "Frank J. Kelley, Attorney General, Louis J. Caruso, Solicitor General, John D. O'Hair, Prosecuting Attorney, Timothy A. Baughman, Chief, Criminal Division, Research, Training and Appeals, and Jeffrey Caminsky, Assistant Prosecuting Attorney, for the people in Allen and Gray, and Rosemary A. Gordon, Assistant Prosecuting Attorney, Detroit, Michigan, for the people in Smith; L. Brooks Patterson, Prosecuting Attorney, Robert C. Williams, Chief Appellate Counsel, and Richard H. Browne, Assistant Prosecuting Attorney, Pontiac, Michigan, for the people in Brooks; James P. Hoy, Prosecuting Attorney, and Thomas C. Johnson, Assistant Attorney General, Lansing, Michigan, for the people in Pedrin. Bell \u0026 Hudson, P.C. (by Glen R. Warn), Detroit, Michigan, for defendant Allen. Faintuck, Shwedel \u0026 Wolfram (by William G. Wolfram), Michigan, for defendant Brooks. State Appellate Defender, Detroit, Michigan, (by Derrick A. Carter) for defendant Gray; (by F. Michael Schuck) for defendant Smith; (by Rolf E. Berg) for defendant Pedrin.",
    "category": [
      "242",
      "36",
      "75"
    ],
    "judges": "James H. Brickley, J. Charles L. Levin, Michael F. Cavanagh, and Dennis W. Archer, JJ., concurred with Brickley, J. Riley, C.j. (minority OPINION(S)ing). Boyle, J. (minority OPINION(S)ing). Riley, C.j., concurred with Boyle, J. Griffin, J., took no part in the decision of these cases.",
    "citation_count": 1
  }
}
