{
  "id": "DLhwTmYBTlTomsSB_MB4",
  "document": {
    "title": "State v. Brown",
    "full_title": "STATE OF NEW JERSEY AND CROSS-APPELLANT, v. BOBBY LEE BROWN AND CROSS-RESPONDENT.",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1994-12-21T00:00:00.000Z",
    "docket": "No. A-20/21",
    "body": "The opinion of the Court was delivered by STEIN, J.\n\nIn January 1993, a Warren County jury convicted defendant, Bobby Lee Brown, of two counts of purposeful or knowing murder in the deaths of Alice Skov and her brother John Bell. It also convicted Brown on felony-murder, robbery, weapon-possession, and conspiracy charges. Because the jury found that Brown had committed the homicides \"by his own conduct,\" N.J.S.A. 2C:11-3c, a penalty-phase hearing followed the jury's verdict in the guilt phase of the trial. At the penalty phase, the same jury unanimously found in respect of the murder of Alice Skov that the\n\naggravating factors outweighed the mitigating factors beyond a reasonable doubt and that defendant should be sentenced to death. Concerning the murder of John Bell, the jury could not unanimously agree on the punishment. The trial court sentenced defendant to death for the murder of Alice Skov and imposed a consecutive sentence of life imprisonment with a mandatory thirty-year term for the murder of John Bell. All other counts were merged into those murder convictions.\n\nIn July 1992, co-defendant Coleen Alexander had pled guilty to felony-murder, robbery, and conspiracy charges in return for dismissal of murder charges and for her agreement to testify for the State at defendant's trial. The court sentenced Coleen Alexander to a life term with a thirty-year parole disqualifier on those charges.\n\nDefendant appealed his convictions and sentence. We now affirm defendant's convictions but vacate his death sentence because of errors in the trial court's instructions concerning the jury's duty to find unanimously that defendant had committed the homicides by his own conduct. Our Disposition does not affect defendant's life sentence with thirty-years parole ineligibility for the murder of John Bell. If the State elects not to seek the death sentence on remand, defendant's conviction for the murder of Alice Skov will stand undisturbed and the trial court shall impose sentence in accordance with N.J.S.A. 2C:11-3b. If the State elects again to seek the death penalty for that offense, defendant's murder conviction will be vacated and defendant will be retried on the murder charges.\n\nI\n\nWe base our narrative of the facts primarily on the State's version as presented at the trial and reflected in the jury's guilt-phase verdict. We include references to conflicts in the testimony only to the extent that they are relevant to our resolution of the issues.\n\nA. Events Leading Up to the Murders\n\nDefendant, Bobby Lee Brown, met co-defendant, Coleen Alexander, at a picnic in Pennsylvania on July 4, 1990. At that time, Alexander had been married for several years and had two small children. Since September 1989, Alexander, her husband, and children had been living in an apartment in Bangor, Pennsylvania, although during their marriage Alexander and her husband lived primarily with Alexander's adoptive parents, Violet and Stephen Krouch, at the Krouch's home in Pen Argyl, Pennsylvania. Alexander and her husband had a turbulent and at times abusive relationship.\n\nDefendant and Alexander became romantically involved. Defendant moved into Alexander's apartment on the day of the picnic and Alexander's husband moved out three days later. Neither defendant nor Alexander appeared to be employed during the first few months of their relationship. The couple experienced continuous financial problems, described by Alexander as \"bounced checks all over[,] bills, [and] loan payments.\" As a result of their financial straits, Alexander had nine bad-check charges and a theft charge outstanding against her in Pennsylvania by the time defendant's trial commenced. The theft charge concerned $5,000 that was stolen from the house of Alexander's grandmother on September 4, 1990. The theft occurred when defendant, Alexander, and defendant's sister visited the grandmother's house. Alexander testified that she learned about the theft only when she saw defendant counting the money after the visit. At trial, defendant's sister refuted Alexander's version of the incident, testifying that only she and Alexander had gone into the grandmother's house, and that Alexander had taken the money from her grandmother's bedroom while defendant's sister unwittingly distracted Alexander's grandmother with conversation in the living room. Defendant and Alexander used $1800 of the proceeds from the theft to purchase a used red Pontiac Fiero for defendant.\n\nOn September 24, 1990, defendant and Alexander visited Alexander's great aunt, Alice Skov, at her home in Oxford Township.\n\nSkov, eighty-two years old, had suffered a stroke in the winter of 1989, and had set up a makeshift bedroom on the first floor in the front of the house. The visit was purportedly urged by Alexander's parents because Skov had just injured herself in a fall. Also at the house was John Bell, Skov's sixty-four-year-old brother and Alexander's great uncle. Since Skov's stroke, Bell had been sleeping at Skov's house to look after her. The visit on September 24 lasted less than an hour, during which defendant and Alexander chatted with Skov and defendant played religious music on an organ in the house.\n\nDefendant and Alexander visited the Skov residence again one day later, ostensibly to ask John Bell directions to Hackettstown, New Jersey, where defendant intended to apply for a job. However, when they arrived, Bell's pick-up truck was not in the driveway. They knocked on the door, and Alice Skov let them in and told them that Bell had gone for a haircut. Alexander explained why they had come and asked to use the bathroom. While defendant continued to speak to Skov, Alexander used the bathroom, and while returning, noticed a change purse on top of a television set. Recalling that defendant had stated that the car was low on gas, Alexander stole ten to fifteen dollars from the purse. According to a version of the visit that defendant gave to police after his arrest for murder, Alexander actually took around $350.\n\nAlexander testified that defendant had overheard a telephone conversation between Alexander and her cousin after the second visit to the Skov home, during which Alexander had discussed a safe in Skov's house that contained a large amount of cash. Alexander further testified that she subsequently had overheard defendant having a conversation with three other friends in the kitchen of Alexander's Bangor apartment regarding \"getting money in New Jersey.\" Alexander also related that defendant made efforts at that time to acquire a gun. Specifically, she stated that she and defendant had stopped at a gas station in East Bangor that also operated as a bar and gun shop. Once inside, defendant\n\nbegan pointing out guns on display and asked Alexander to get a price on a particular model.\n\nTwo other witnesses testified regarding defendant's interest at that time in \"money in New Jersey\" and in obtaining a gun. One witness, Robert Lohman, whom defendant later falsely implicated in the murders, testified that he had had a conversation with defendant in the kitchen of the Bangor apartment during which defendant stated that \"he needed a gun to do a job in Jersey with easy money.\" When Lohman replied that he was not interested, the conversation ended. Another witness, Jeffrey Lambert, testified that he had overheard defendant and Alexander talking about a safe in New Jersey, containing approximately $40,000, while Lambert, Lohman, and another man were in the process of helping defendant, Alexander, and Alexander's children move to the home of Alexander's parents, Violet and Stephen Krouch.\n\nDefendant and Alexander moved in with the Krouches on October 4, 1990. On October 9, the day before the murders, defendant traveled to a Pontiac automobile dealership in Wind Gap, Pennsylvania. A salesperson from the dealership testified that defendant had shown interest in a new car on the lot and had taken the car for a test drive. Defendant had stated that his Pontiac Fiero was available as a trade-in. The salesperson informed defendant that the cost of the new vehicle would be approximately $17,800. Defendant and the salesperson filled out a loan application, which the salesperson then forwarded for approval. Defendant returned to the dealership with Alexander late in the afternoon and learned that the lender had rejected defendant's loan application. After discussing other loan alternatives with the salesperson, defendant stated that he either would make alternative loan arrangements or simply come back the next day and pay for the car in cash.\n\nAccording to the State's evidence, defendant and Alexander returned to the Krouches' home after leaving the dealership. Violet and Stephen Krouch went to the store with Alexander's daughter, and Alexander went down to the basement to do laundry.\n\nAccording to Alexander, defendant came down to the basement, pointed a \"long gun\" at her, and said \"stick 'em up.\" Alexander recognized the gun as her father's rifle and told defendant to put the rifle back. The rifle was kept in the closet in Stephen and Violet Krouch's room. Stephen Krouch testified that he had told defendant about the rifle after Krouch had been informed that defendant was beating Alexander.\n\nLater that evening, defendant and Alexander went to the neighborhood in Bangor in which they previously had lived to visit a former neighbor. Defendant encountered Jeffrey Lambert in the street and stated that he wanted to visit David Bittner, a mutual friend in the neighborhood. On reaching Bittner's apartment, defendant told Bittner that he wanted to talk to him privately, whereupon defendant and Bittner went into Bittner's bedroom. Defendant asked Bittner where defendant could get a gun because he wanted to commit a burglary \"in the country\" in New Jersey involving \"a lot\" of money. According to his testimony, Bittner told defendant that \"he was crazy\" and believed that he had defendant \"talked out of it.\"\n\nDefendant and Alexander next went to the Sportsman's bar, a pub that they frequented in Bangor. Inside, they encountered a friend of Alexander, Tina Meixsell, and her boyfriend, David Runyon. According to Runyon, defendant asked him if they could step outside and talk. Defendant then inquired whether Runyon could get defendant a gun, and said that he would be willing to pay Runyon $2,000 for it. Defendant stated that he wanted the gun that night for use the following day, and would be able to pay Runyon the following day \"after he pulled off the * * * scam.\" When asked to describe the so-called \"scam,\" Runyon testified that defendant had said \"there was a large amount of cash in a safe that was left open\" at the home of a relative of Coleen Alexander \"down in New Jersey somewhere.\" Defendant stated that he needed the gun \"for protection in case, just in case of an emergency, in case something happened.\" Enticed by the offer, Runyon took defendant's phone number and called defendant at\n\napproximately 7:30 the next morning, asking if the offer was still good. Defendant told Runyon that he would call him back. Runyon asked if defendant needed a ride or other assistance, and defendant replied that he did not.\n\nB. The Events Surrounding the Murders\n\nThe murders occurred on October 10. After getting Alexander's children up and off to school, Violet Krouch told defendant that he had a phone call. Both Krouch and Alexander testified that defendant had stated that the call was from \"Dave\" (presumably David Runyon), and that Dave wanted to meet defendant and Alexander for breakfast, but that defendant declined because he did not have the money. Defendant then told Alexander, who had gone back to bed, to get up and get ready. Violet Krouch testified that the couple left at 10:15 a.m., purportedly to go to Bethlehem, Pennsylvania, so that defendant could get a drug test for prospective employment at Grand Central Sanitation, a carting company.\n\nAlexander's testimony changed three times at trial concerning when she had become aware of the criminal purpose of the trip and that defendant had taken her father's rifle. At first, she testified that she too had thought that the couple was going to Bethlehem for a drug test, and had learned of the real purpose and the rifle only after she and defendant were in defendant's car on the way to the Skov home in Oxford. However, when Alexander resumed her direct testimony the following day, she stated that she had learned that the couple was \"going to Oxford for money\" after defendant took the early-morning phone call from David Runyon. However, Alexander maintained that she had learned about the rifle's presence in the car only after the couple was on the way to Oxford, when she discovered it behind the driver's seat of defendant's car wrapped in a gray and black striped dress shirt that belonged to defendant. Finally, after Alexander had finished her testimony, the State recalled her to the stand because she had informed the prosecutor that she remembered additional details. She then testified that defendant\n\ntold her of the true purpose of the trip on the morning of the crime, after which he had directed her to get her father's rifle from her bedroom closet, where Alexander found it wrapped in the striped shirt. She handed defendant the rifle before they left the house.\n\nOn reaching the Skov home, the couple saw John Bell's truck in the driveway. Alexander testified that she had implored defendant to \"just turn around and go home,\" but he had refused. They pulled in behind Bell's truck and knocked at the back door. John Bell was in the kitchen making breakfast, and told Alexander and defendant to come in. They proceeded into the day room to visit with Alice Skov. After going back to the kitchen to make instant coffee, they resumed their conversation with Skov in the day room. Approximately ten minutes later, defendant stated that he felt sick and that he needed to step outside. Alexander followed defendant out of the house through the kitchen entrance, passing John Bell who was sitting in a chair in the dining room reading a book. Once outside, the couple sat by defendant's car and smoked cigarettes. Alexander again pleaded for defendant to leave. He responded, \"You ruined it for me,\" apparently referring to her having followed him outside. Defendant instructed Alexander to \"shut up and get back in there before I leave you lay alongside the road.\"\n\nThe pair then went back into the house, through the kitchen and past Bell, who was still reading in the dining room. They again entered the day room and talked to Alice Skov. Alexander went into the living room, adjacent to the day room, and began playing the organ. When defendant joined her, she again asked that they leave. Defendant replied, \"no,\" and the pair went back into the day room to talk with Skov. Again, defendant stated that he did not feel well and needed to get some air. Alexander shook her head at him, but defendant returned that gesture with \"a nasty look\" and proceeded outside.\n\nAccording to Alexander, after ten minutes had passed, she heard a gunshot. Alice Skov stated, \"oh, my goodness, Uncle\n\nJohn must have killed a squirrel.\" Defendant then entered the day room and stated, \"it's dead all right.\" He left the room for a few minutes and then returned, telling Alexander that she could go outside for a few minutes and smoke a cigarette while he continued to talk with Alice Skov. Apparently, that direction was intended to give Alexander an opportunity to search for cash in the Skov house, which she knew well.\n\nAlexander testified that when she walked into the dining room, she saw John Bell lying in a pool of blood on the kitchen floor. Alexander stated that she had been scared and unsure of what to do, and had sat on the steps leading to the upstairs portion of the house for several minutes. Alexander then returned to the day room where Skov and defendant were located. Defendant left the room and Alexander sat on the floor. Skov was in her rocking chair. According to Alexander, defendant returned with the rifle, stated, \"this is the gun Uncle John used to kill the squirrel,\" and pointed the rifle at Skov, who told him to put it down. Defendant fired a shot that grazed the top of Skov's head, causing a fracture, and then lodged in a wall behind Skov. Alexander got up to leave, but defendant came over to her and pulled her to his side with his left hand around her shoulder. Defendant then fired the rifle a second time from approximately the same position that he had fired the first shot. The second bullet entered the top rear portion of Skov's head and exited through her mouth, knocking out a tooth that landed in Skov's lap.\n\nAlexander testified that she then broke away from defendant and went through the kitchen and out the door, with defendant instructing her to make sure that she stepped over the blood. Initially, Alexander testified that defendant had come out a few minutes later carrying the rifle wrapped in the striped shirt. However, when Alexander later returned to the witness stand, she testified that defendant had handed her the rifle as she headed out the door and that she had taken the rifle out to the car.\n\nAlexander recalled that after defendant started the car, he said \"oh, my gosh,\" and then explained that he had left behind the\n\nscissors with which he had stabbed John Bell. Defendant stated that Bell had been \"hard to kill[].\" Alexander testified that she said to defendant, \"Why?\" apparently referring to the reason for the whole episode, and that defendant had replied that he had killed Alice Skov because she would have been able to identify who had killed John Bell. He then warned Alexander that if she persisted in asking questions, he would leave her \"alongside of the road and go after [her] kids and [her] family.\"\n\nDuring the ride back to Pen Argyl, Pennsylvania, defendant handed Bell's truck keys and wallet to Alexander, who threw them out the car window into a wooded area. Defendant netted approximately $300 from the crime.\n\nC. The Aftermath of the Murders\n\nDefendant and Alexander returned to the Krouches' home around noon. Violet Krouch informed defendant that an employee of the car dealership had called and wanted defendant to call back when he returned home. Defendant stated that he was going out to McDonald's and would stop by the dealership on his way. Violet Krouch testified that defendant had later returned with a bag of food from McDonald's and spent the afternoon installing a radio in his car. Defendant informed Krouch that he had gone to a Radio Shack in Bangor because he was having trouble with the installation.\n\nThe State produced witnesses who corroborated that account. An assistant manager from McDonald's testified that Brown, who had just started working for the restaurant, had come there that afternoon and had seemed depressed, a departure from his usually upbeat personality. He mumbled that \"a family tragedy\" had occurred. In addition, the State produced an employee from the Radio Shack store who testified that defendant had purchased a $170 car stereo that afternoon and had returned later because he was having difficulty with the installation. Finally, the salesperson from the car dealership testified that he had called the Krouch\n\nresidence that morning and had left a message for defendant to call back the dealership.\n\nThe following night, October 11, defendant went out with Robert Lohman and another acquaintance. According to Lohman, defendant appeared to be uneasy while the three were outdoors drinking beer, at one point peering into the surrounding woods with a flashlight. Defendant then showed Lohman a passport and asked him if he wanted to go to Canada to look for \"a new atmosphere.\" Lohman declined the offer.\n\nPolice discovered the bodies of Alice Skov and John Bell on October 11. Their first contact with defendant, Coleen Alexander, and the Krouches occurred the following evening, on October 12, when officers from the Warren County Prosecutor's Office went to the Krouch home and informed them of the murders. The officers briefly questioned the group and were told by defendant and Alexander that they had visited the Skov home approximately two weeks before. The police asked if defendant and Alexander would submit to fingerprinting so that police could eliminate their prints if they were found at the scene. Defendant and Alexander agreed and were fingerprinted at the local police station. The police also requested that they go to the Warren County Prosecutor's Office to make statements. Defendant and Alexander asked to go in the following morning because Violet Krouch had seemed too upset to put Alexander's children to bed.\n\nThe following morning, October 13, Stephen Krouch drove his wife, defendant, Alexander, and her two children to the Warren County Prosecutor's Office. Alexander gave police a statement claiming that on October 10, the day of the murders, she and defendant had gone to Bethlehem for defendant's drug test. Alexander testified at trial that that was the alibi that defendant had instructed her to offer. Alexander also told police that she and defendant had been to the Skov house together on only one occasion. She left the Prosecutor's office at approximately 3:00 that afternoon.\n\nIn the meantime, defendant had given police a statement offering the same alibi. He subsequently agreed to take a polygraph test administered by officers from the State Police. The test involved a sequence of interviews, during which one of the detectives took copious notes. The detective testified about the contents of the interviews, although the jury was not informed that the interviews had occurred during a polygraph test. In the course of those interviews defendant revised his claim that he had been at the Skov home only once before, and admitted to a subsequent visit during which Alexander had stolen money. The detective informed defendant that he had been seen at the Skov home in the past week. He then suggested a scenario in which defendant and Alexander had gone to the house and a struggle had ensued with John Bell, perhaps even after Bell had threatened defendant with a BB gun that Bell owned. Defendant neither denied nor agreed with the detectives suggestions.\n\nIn the early evening, after the interview had been proceeding for approximately five to six hours, both detectives were out of the room discussing whether Alexander should be brought back to the office for further questioning. When one of the detectives reentered the room, defendant was crying \"pretty hard.\" Defendant then \"confessed\" to the detectives that he had in fact been involved in the crime along with Robert Lohman, his acquaintance from Bangor, Pennsylvania. Defendant's general version of the crime, as told to detectives in that interview, a subsequent videotaped statement to police, and a tape-recorded conversation with the Krouches at the Prosecutor's office, was that Lohman had overheard defendant and Coleen Alexander at the Sportsman's bar discussing the money in the Skov house. Lohman allegedly approached defendant and demanded that defendant help him steal the money or Lohman would harm the Krouches, Alexander, and her children. Defendant claimed that that threat had compelled him to help Lohman. Defendant's version of the crime was that he drove Lohman to the Skov house, but that Lohman did the shooting and stealing. Although defendant's original account placed him outside the house while Lohman committed the murders\n\ninside, defendant eventually admitted to having witnessed the shooting of John Bell. Indeed, the State used defendant's detailed description of Lohman's purported shooting of Bell as evidence that defendant was personally familiar with the circumstances of that shooting, including the manner in which Bell fell and the gunshot wound that he suffered.\n\nFollowing defendant's confession, the police resumed the questioning of Coleen Alexander. Realizing that her original alibi no longer was credible, Alexander told police that she had left the house with defendant on the morning of the murder but that he had dropped her off at the home of Sheri Manger, a friend in the Bangor area. Alexander testified at trial that she had tendered that alibi because she knew from the Krouches that it was consistent with statements defendant had made concerning her whereabouts. While police were at the Krouch home, they asked whether the Krouches owned a gun. Stephen Krouch showed them the .22 caliber rifle that he kept in his bedroom closet. Officers briefly examined it and returned it to Krouch. They did, however, retain .22 caliber bullets that they found in the bedroom that Alexander and defendant shared.\n\nRobert Lohman, the man implicated by defendant, was arrested in the early morning hours of Sunday, October 14. Police confiscated a holstered .22 caliber handgun, which defendant had described as the murder weapon. The following day, however, when officers visited defendant at the Warren County Jail to interview him further, defendant told the officers that the statement he had given was not true and that he wanted a lawyer before he would speak to them.\n\nApparently, defendant had decided to pursue other strategies. From defendant's arrest on October 13, defendant and Alexander were in constant communication by telephone as Alexander attempted to establish different alibis. On or about Wednesday, October 17, one week after the murders, Coleen Alexander travelled to the drug-test laboratory in Bethlehem and unsuccessfully attempted to obtain documentation stating that she and defendant\n\nhad been to the laboratory on the day of the murders. In addition, she forged a letter purporting to be from an acquaintance of David Runyon that implied that Runyon had been involved in the Skov and Bell murders; she told an acquaintance that Robert Lohman had committed the murders; and she maintained defendant's innocence in repeated conversations with his mother.\n\nPolice received the ballistics report on Robert Lohman's gun on November 1 and learned that it was not the murder weapon. They immediately went to the Krouch home and retrieved Stephen Krouch's .22 caliber rifle, as well as the T-shirt and stone-washed jeans that defendant had worn on the day of the murders. Alexander had already washed the shirt.\n\nOn November 8, members of the State Police interviewed Alexander at the Prosecutor's Office regarding her activities on the day of the murder. She \"started out\" with the alibi regarding the drug-test visit in Bethlehem, and then offered \"numerous\" alternative alibis. According to Alexander, \"then after I couldn't deal with any more lies I came forth and told the truth. Bits and pieces of the truth in which I had at that time wanted them to know. * * * That [defendant] is the one who shot and killed both my aunt and uncle and stabbed my uncle.\" She also told the police that she had been at the scene. Following the interview, the police arrested Alexander.\n\nAfter her incarceration, Alexander continued to communicate with defendant by letter through the in-house prison mail system. Because defendant and Alexander knew that such letters were read by prison officials, the pair used code words to communicate. From the witness stand, Alexander read several of the letters that defendant had written to her and explained their meaning. A main theme of the letters, besides protestations of love and devotion, was that defendant wanted Alexander to assume responsibility for the murders so that defendant could gain his release, obtain Alexander's release with bail money from loan sharks that\n\nhe knew in Trenton, and then flee with Alexander and her children.\n\nIn addition, the State introduced statements made to police by two inmates, Michael Merlo and Peter Lesando, which recounted conversations that each had had with defendant around the time of Alexander's arrest. In those conversations, defendant allegedly stated that he had shot John Bell because the situation in the house had become \"agitated\" when defendant learned that the safe had been plastered over. Defendant purportedly told Merlo and Lesando that he had shot Alice Skov as she sat in her rocking chair, missing with the first shot and hitting her in the head with the second. Defendant allegedly stated that Coleen Alexander had stabbed John Bell, and noted as well that she had once stabbed her husband. Defendant also explained that because he did not know the location of the bullets for Alexander's father's rifle, she had obtained them from her parent's bedroom. Merlo reported that defendant had a notebook with information written in it, but the police found no such notebook in a search of defendant's cell. At trial, both Lesando and Merlo claimed that they could not recall having made such statements or having had such conversations with defendant. Following evidentiary hearings, the trial court determined that both were feigning their lack of recall, and permitted the State to introduce the statements as substantive evidence under the hearsay exception for prior inconsistent statements.\n\nOn May 16, 1991, a Warren County grand jury returned a seventeen-count indictment charging both defendant and Coleen Alexander with murder in the deaths of John Bell and Alice Skov, alleging that both had purposely or knowingly killed Bell and Skov by their own conduct. The indictment also charged the pair with purposeful or knowing murder in the deaths of Bell and Skov, based on allegations that defendant \"and/or\" Alexander had purposely or knowingly killed or inflicted serious bodily injury on Bell and Skov while acting in the capacity of an accomplice or co-conspirator. Other counts charged defendant and Alexander with\n\nfelony murder, two types of first-degree armed robbery, possession of the rifle for an unlawful purpose, possession of the scissors for an unlawful purpose, third-degree unlawful possession of the rifle, fourth-degree unlawful possession of the scissors, and conspiracy to commit first-degree murder and first-degree robbery.\n\nThe Warren County Prosecutor's Office supplied defendant's attorneys with a notice of aggravating factors on June 14, 1991. The notice set forth two factors that the State intended to prove with regard to the murder charges in the indictment: (1) that the murder had been committed to escape detection for another \"robbery and/or murder,\" N.J.S.A. 2C:11-3c(4)(f), and (2) that the murder had been committed in the course of the commission of another felony, N.J.S.A. 2C:11-3c(4)(g).\n\nIn the summer of 1992 Coleen Alexander entered into a plea agreement with the Warren County Prosecutor's Office. She agreed to plead guilty to two counts of felony murder, two counts of robbery, and one count of conspiracy to commit robbery. She also agreed to give interviews to the Prosecutor's office and to testify truthfully against defendant at trial. In return, the State agree to recommend a sentence of thirty years without parole and to dismiss the remaining charges. Alexander entered a plea in accordance with the agreement on July 2, 1992, and the court sentenced her to the recommended term on August 14, 1992.\n\nJury selection for defendant's trial began on November 2, 1992, and ended on November 18, encompassing nine days during that period. The nineteen- day guilt-phase trial began on December 1, 1992, and concluded on January 8, 1993, with the State presenting thirty-three witnesses and defendant presenting eight. After deliberating approximately eleven hours, the jury convicted defendant of the purposeful and knowing murders of Alice Skov and John Bell, and unanimously determined beyond a reasonable doubt that defendant had purposely and knowingly caused the deaths of Skov and Bell by his own conduct. In addition, the jury convicted defendant on the felony-murder, conspiracy, armed-robbery counts, and the weapons-possession counts concerning the\n\n.22 caliber rifle. It acquitted defendant of the weapons-possession counts regarding the scissors.\n\nDefendant presented three motions prior to the penalty-phase trial. First, he requested that the court set aside the jury's finding that he had committed the murders by his own conduct. The court denied the motion, determining that sufficient evidence existed to support the jury's determination that defendant had killed by his own conduct. Defendant next requested that the court empanel a new jury for the penalty phase, pursuant to N.J.S.A. 2C:11-3c(1), claiming that certain evidence presented at the guilt phase would be inadmissible and prejudicial in the penalty phase, including testimony that defendant had threatened and assaulted Alexander, photographs of the victims' bodies, testimony regarding the age and physical frailties of Skov, and testimony that defendant and Alexander had referred to themselves as \"Bonnie and Clyde.\" The court denied defendant's motion, determining that the evidence either was admissible to prove the aggravating factors alleged or that its admission in the guilt phase did not compel the empaneling of a new penalty-phase jury. Finally, defendant made several arguments regarding the aggravating factors. Generally, those arguments were based on the failure of the notice of aggravating factors to specify the murder to which each factor applied or the underlying felony on which each factor was based. Defendant also claimed that the factors constituted improper double-counting of the evidence. The court determined that the notice was not misleading regarding the murders and underlying offenses to which the factors applied, and that basing both factors on the same events was permissible provided the jury received an appropriate instruction regarding the weighing of the evidence in accordance with State v. Bey, 112 N.J. 123, 174-77 (1988) (Bey II).\n\nThe penalty-phase proceeding spanned three days, January 12 through January 14. The State moved to admit its evidence from the guilt phase into the penalty phase and presented no new evidence. Defendant presented five witnesses and gave a brief\n\nstatement in allocution. Jury deliberations took place primarily during the entire second day of the proceeding. On the morning of January 14, the jury returned a verdict in which it unanimously found beyond a reasonable doubt that in regard to the murder of Alice Skov the State had proved the existence of both aggravating factors, that each factor outweighed the mitigating factors, and that both factors outweighed the mitigating factors. Regarding the murder of John Bell, the jury unanimously found beyond a reasonable doubt the existence of only the c(4)(g) aggravating factor, that the murder had been committed while defendant was committing another offense. The jury decided that after due deliberation it could not agree on punishment, an option offered on the verdict sheet.\n\nIn accordance with the jury's verdict, the court sentenced defendant to death for the murder of Alice Skov. After conducting a separate sentencing proceeding on April 13, 1993, concerning defendant's other convictions, the court sentenced defendant to a consecutive term of life imprisonment with a thirty-year period of parole ineligibility for the purposeful or knowing murder of John Bell. On the remaining counts, the court merged the felony-murder counts into the respective murder convictions, merged the armed-robbery counts into the felony-murder counts, and merged the weapons-possession offenses into the armed-robbery counts.\n\nDefendant appealed his conviction and death sentence to this Court, pursuant to N.J.S.A. 2C:11-3e. Defendant advances numerous contentions on appeal, some of which relate solely to his death sentence, others of which relate to his convictions as well, and one focussing on his sentence of imprisonment. The State cross-appeals, contending that merger of certain convictions was improper. Defendant concedes the State's claim.\n\nWe affirm defendant's convictions, concluding that the alleged errors either did not constitute error or were harmless. We vacate defendant's death sentence because the trial court did not instruct the jury that it had the option of returning a non-unanimous verdict on the question whether defendant had committed\n\nthe murders by his own conduct. Although we affirm defendant's prison sentence for the murder of John Bell, we remand the matter for resentencing in view of our decision vacating the death sentence and the court's improper merger of defendant's other convictions. We note that the State may again seek the death penalty for the murder of Alice Skov by retrying defendant on that charge.\n\nII\n\nDefendant contends that the court's charge and verdict sheet incorrectly instructed the jury that if it convicted defendant of purposeful or knowing murder, it then had to reach a unanimous decision that defendant had committed the murders by his own conduct or a unanimous decision that defendant had committed the murders as an accomplice or co-conspirator. Defendant claims that the court should have instructed the jury instead to decide only whether it unanimously found beyond a reasonable doubt that defendant had committed the murders by his own conduct, informing the jury that a non-unanimous verdict on that issue was acceptable and would not affect the murder conviction. Defendant asserts that an affirmative determination of that question would result in a penalty-phase hearing, and a negative determination, which encompasses a non-unanimous verdict, would result in the imposition of a sentence of thirty years to life imprisonment with a mandatory thirty-year term for each murder.\n\nA\n\nIn 1982, the Legislature enacted the New Jersey Death Penalty Act (Act), L. 1982, c. 111, and \"resurrected the distinction between a principal and an accomplice\" for the purpose of determining a defendant's eligibility for the death penalty. State v. Gerald, 113 N.J. 40, 93 (1988). More precisely, the Act makes death-eligible only those defendants who are convicted of purposeful or knowing murder and either \"committed the homicidal\n\nact by [their] own conduct\" or procured its commission through payment. N.J.S.A. 2C:11-3c.\n\nIn Gerald, supra, we adopted the view that the \"by his own conduct\" (own-conduct) requirement \"'is not an element of the offense of murder . . . [but] is merely a triggering device for the death penalty phase of the trial.'\" 113 N.J. at 99 (quoting State v. Moore, 207 N.J. Super. 561, 576 (Law Div. 1985)). See also State v. Biegenwald, 126 N.J. 1, 18 (1991) (recognizing own-conduct as triggering device for death-eligibility rather than element of crime); accord State v. Moore, 113 N.J. 239, 300 (1988) (Moore (Marie)); State v. Koedatich, 112 N.J. 225, 338-40 (1988) (distinguishing between own-conduct finding and elements of purposeful or knowing murder in concluding that failure of jury to make own-conduct finding was harmless error), cert. denied, 488 U.S. 1017, 109 S. Ct. 813, 102 L. Ed. 803 (1989). We described the requirements of the own-conduct finding as follows: \"The relevant inquiry is whether or not the defendant actively and directly participated in the homicidal act, i.e., in the infliction of the injuries from which the victim died. The critical elements are that [the] defendant in fact acted, and the immediacy of his conduct to the victim's demise.\" Gerald, supra, 113 N.J. at 97.\n\nIn Moore (Marie), supra, we explained that \"to satisfy the 'own conduct' requirement, the State had to prove beyond a reasonable doubt that defendant's conduct was the direct and immediate cause of death.\" 113 N.J. at 299 (emphasis added) (emphasis omitted). We perceive the requirement of proof beyond a reasonable doubt as practically, if not theoretically, synonymous with the requirement of unanimity. In the context of the State's burden to prove aggravating factors beyond a reasonable doubt, see N.J.S.A. 2C:11-3c(2)(a), we observed in Bey II, supra : \"Although the Act does not expressly require the jury to be unanimous in finding the existence of an aggravating factor or factors, the lack of unanimity suggests that the factor has not been established beyond a reasonable doubt * * *.\" 112 N.J. at 159.\n\nSee also R. 1:8-9 (\"The verdict shall be unanimous in all criminal actions * * *.\") Thus, we now conclude that inherent in the requirement that the State prove the own-conduct criterion beyond a reasonable doubt is the reciprocal requirement that a jury unanimously agree that the State has met that burden.\n\nB\n\nAlthough a jury verdict that a defendant committed a murder by his own conduct must be unanimous, unanimity is not required to support a verdict that a defendant guilty of murder did not commit the murder by his own conduct. Rather, the inability of the jury to reach a unanimous decision on the own-conduct determination constitutes a final verdict that results in the imposition of a sentence of imprisonment of at least a thirty-year mandatory term, pursuant to N.J.S.A. 2C:11-3b.\n\nIn Bey II, supra, we expressed our \"awareness of the qualitative difference between the death penalty and other penalties, a difference that makes it unthinkable for jurors to impose the death penalty when they harbor a 'reasonable doubt as to its justness.'\" 112 N.J. at 156 (quoting State v. Biegenwald, 106 N.J. 13, 60 (1987)). See Assembly Judiciary, Law, Public Safety and Defense Committee, Statement to Senate Bill No. 112, at 2 (May 20, 1982) (noting that \"to aid a defendant facing the possibility of a death sentence\" amendments to death-penalty bill increased State's burden of proof on aggravating factors to beyond reasonable doubt and lowered defendant's burden on mitigating factors to burden of production). That difference is apparent throughout death-penalty legislation and jurisprudence, and perhaps is most clearly reflected in the recognition that non-unanimous findings should be given legal effect when those findings weigh in favor of the imposition of a life sentence. \"The unanimity requirement extends only to verdicts adverse to the defendant, and the Legislature may provide for the return of a verdict favorable to the defendant on less than unanimity.\" Bey II, supra, 112 N.J. at 159.\n\nIndeed, in some circumstances, recognition of the principle of nonunanimity is constitutionally required. The United States Supreme Court has determined that unanimity requirements concerning findings of mitigating factors in death-penalty proceedings violate the Eighth Amendment of the United States Constitution. See McKoy v. North Carolina, 494 U.S. 433, 110 S. Ct. 1227, 108 L. Ed. 2d 369 (1990); Mills v. Maryland, 486 U.S. 367, 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988). Justice Blackmun, Concurring in McKoy, supra, noted that the requirement in federal cases of jury unanimity on certain preliminary factual issues supported the requirement in capital cases of jury unanimity on findings that weighed against the defendant, such as findings of aggravating factors. 494 U.S. at 449 n.5, 110 S. Ct. at 1237 n.5, 108 L. Ed. 2d at 385 n.5 (Blackmun, J., Concurring). However, as Justice Blackmun pointed out, the principle advanced in those federal cases did not apply to support a requirement of unanimity in regard to jury findings favoring a defendant:\n\n[That] principle is a protection for the defendant * * *; its premise is that \"requiring the vote of twelve jurors to convict a defendant does little to insure that his right to a unanimous verdict is protected unless this prerequisite of jury consensus as to the defendant's course of action is also required.\" [United States v. Gipson, 553 F.2d 453, 458 (5th Cir. 1977)]. There is no analogous principle requiring that jurors voting to acquit must agree upon the basis for their reasonable doubt.\n\n[Ibid. (second alteration in original).]\n\nIn addition to the constitutional requirement that jurors be permitted to consider mitigating factors even when those factors are not unanimously found by the jury, numerous state death-penalty statutes, including our own, require the trial court to impose a life sentence if the jury is unable to render a unanimous final verdict at the penalty phase. See, e.g., Ark. Code Ann. § 5-4-603(c) (Michie 1993); Colo. Rev. Stat. Ann. § 16-11-802(2)(d) (West Supp. 1994); Ga. Code Ann. § 17-10-31.1(c) (Michie Supp. 1994); N.H. Rev. Stat. Ann. § 630:5.IX (Supp. 1993); N.J.S.A. 2C:11-3c(3)(c); N.M. Rev. Stat. Ann. § 31-20A-3 (Michie 1994); N.C. Gen. Stat. § 15A-2000(b) (Supp. 1994); Ohio Rev. Code Ann. § 2929.03(D)(2) (Anderson 1993); Okla. Stat. tit. 21, § 701.11\n\n(Supp. 1995); 42 Pa. Cons. Stat. Ann. § 9711(c)(1)(v) (1982); S.C. Code Ann. § 16-3-20(C) (Law. Co-op. Supp. 1993); Tenn. Code Ann. § 39-13-204(h) (Supp. 1994); Tex. Crim. Proc. Code Ann. art. 37.071, sec. 2(g) (West Supp. 1995); Utah Code Ann. § 76-3-207(4) (Supp. 1994); Va. Code Ann. § 19.2-264.4E (Michie 1990); Wash. Rev. Code Ann. § 10.95.080(2) (West 1990); Wyo. Stat. § 6-2-102(e) (Supp. 1994). That procedure departs from the customary practice in criminal trials that a hung jury results in a mistrial, after which the State has the option of instituting new proceedings against the defendant. See N.J.S.A. 2A:80-3; McKoy, supra, 494 U.S. at 449 n.4, 110 S. Ct. at 1237 n.4, 108 L. Ed. 2d at 385 n.4; State v. Hunt, 115 N.J. 330, 382-83) 1989).\n\nFurthermore, in 1985 the Legislature amended the death-penalty statute to require the court in a penalty-phase proceeding expressly to inform the jury that its failure to reach a unanimous verdict will result in the imposition of a life sentence. See L. 1985, c. 178 (codified at N.J.S.A. 2C:11-3f). In State v. Ramseur, 106 N.J. 123 (1987), we discussed that statutory requirement in the context of supplemental instructions that the trial court had given to the jury after the jury had indicated it could not reach a unanimous verdict on the penalty. We concluded that the court's supplemental instructions had coerced the jury, as prohibited by our decision in State v. Czachor, 82 N.J. 392 (1980), and improperly had stressed the need to reach a unanimous verdict rather than the need to deliberate with a view toward reaching a verdict. Ramseur, supra, 106 N.J. at 306 n.74; see also Hunt, supra, 115 N.J. at 384 (\"The purpose of deliberations in the penalty phase is not to reach agreement but to deliberate.\"). Most significantly, we determined that constitutional considerations, the mandate of N.J.S.A. 2C:11-3f, and our decision in Czachor required the court to remind jurors in supplemental instructions that they are \"free to exercise[] their statutory option to return a final, non-unanimous verdict resulting in imprisonment if, after a reasonable period of deliberations, they are unable to agree.\" Ramseur, supra, 106 N.J. at 312.\n\nWe note that other state courts have recognized the propriety of such an instruction even in the absence of an express statutory authorization. See, e.g., Whalen v. State, 492 A.2d 552, 562 (Del. 1985) (concluding that instructions that failed clearly to inform jury of effect of non-unanimous option prejudiced defendant); State v. Loyd, 459 So. 2d 498, 502-03 (La. 1984) (holding that failure to instruct jury at its request about consequences of nonunanimity was reversible error); Commonwealth v. Baker, 511 A.2d 777, 789 n.8 (Pa. 1986) (noting potential for defense counsel to request special instruction to deadlocked jury informing them of option of non-unanimous verdict); State v. Jeffries, 717 P.2d 722, 736 (Wash.) (upholding instruction that informed jury that inability to agree on death sentence or unanimous agreement against death sentence would result in life sentence), cert. denied, 479 U.S. 922, 107 S. Ct. 328, 93 L. Ed. 2d 301 (1986).\n\nC\n\nApplying those principles to defendant's claim, we conclude that the court's charge to the jury on the own-conduct determination was flawed for two related reasons. First, the court failed to convey to the jury that its inability to reach a unanimous decision that defendant had committed the homicides \"by his own conduct\" was a permissible final verdict that would result in the imposition of at least a thirty-year mandatory prison term on each murder. Second, the court's instruction suggested to the jury that if it could not unanimously agree beyond a reasonable doubt that defendant had committed the murder by his own conduct, it instead had to find unanimously and beyond a reasonable doubt that defendant had committed the murder as an accomplice or co-conspirator.\n\nAt an early stage in the trial court's original charge on the murder counts, the court informed the jury that \"the only type of murder eligible for the death penalty is purposeful or knowing murder by his own conduct as is alleged in counts one and two of the indictment.\" The court also informed the jury that \"an\n\naccomplice who does not take part in the infliction of fatal wounds is not subject to the death penalty.\" In addition, at that stage of the original instruction, the court referred to the verdict sheet and informed the jury that it would have to determine whether defendant had committed the murder by his own conduct or as an accomplice:\n\nThere will be a verdict sheet that you'll have, all of you, when you deliberate and the verdict sheet will have places for you to answer one or both of these questions.\n\nWith respect to the first question, before you may conclude that the defendant committed the murder by his own conduct, you must be convinced of this fact beyond a reasonable doubt. If you have a reasonable doubt as to whether the killing was by his own conduct but you're satisfied beyond a reasonable doubt that he was an accomplice, then you should indicate that he was an accomplice.\n\nThe trial court made no additional references to death eligibility in its original charge.\n\nAfter completing its instructions on the substantive offenses, the trial court instructed the jury concerning certain general principles, including the significance of expert opinion and defendant's constitutional right to remain silent. The trial court then instructed the jury on the requirement of unanimity: \"Now since this is a criminal case, your verdict must be unanimous, all 12 jurors deliberating must agree.\"\n\nImmediately following that instruction, the trial court, referring to the verdict sheet, instructed the jury about the possible verdicts it could return on the murder charges:\n\nThe possible verdicts are as follows: On the charge of murder of Alice Skov, your verdict can either be not guilty or guilty. On the charge of murder of John Donald Bell, your verdict can be either not guilty of murder or guilty of murder.\n\nNow if you find Bobby Lee Brown guilty of murder of Alice Skov you are going to have to check a box, one box, you'll have to determine whether or not he purposely or knowingly caused her death or purposely or knowingly caused serious bodily injury resulting in her death. Same thing with John Donald Bell, if you found -- if you find Mr. Brown guilty of murder of John Donald Bell, you'll have to answer the question did he purposely or knowingly cause death, or purposely or knowingly cause serious bodily injury resulting in death.\n\nNow if you find Bobby Lee Brown guilty of murder of Alice Skov, then you'll have to make the following determination, and check one of these boxes, by his own conduct or as an accomplice or co-conspirator. If you find the defendant Bobby Lee Brown guilty of murder of John Donald Bell, you have to make the determination\n\nas to whether or not it was by his own conduct or as an accomplice or co-conspirator. There's boxes for that.\n\nThe trial court completed its original charge without further reference to the requirement of unanimity.\n\nThe following day the jury presented a note to the trial court seeking further guidance concerning the meaning of \"by his own conduct\" and \"as an accomplice or co-conspirator.\" In response the trial court instructed the jury that it had three options: to find defendant guilty \"by his own conduct, or as an accomplice or co-conspirator.\" The court did not redefine accomplice liability and instructed the jury on the substantive crime of conspiracy but did not inform the jury that defendant could be guilty of murder as a co-conspirator. The trial court did not discuss the unanimity requirement in its supplemental instruction, nor did it inform the jury that a non-unanimous verdict concerning the own-conduct issue would be acceptable. The court repeated its prior instruction that the jury would have to determine whether defendant had \"committed the murder or is guilty of the murder by his own conduct or as an accomplice or co-conspirator.\"\n\nDefendant maintains that the court should have instructed the jury that its failure to reach agreement on the own-conduct determination was a permissible verdict that would result in the imposition of at least a mandatory thirty-year term for each murder. As discussed, N.J.S.A. 2C:11-3f expressly provides for such an instruction to the jury regarding the final verdict in the penalty phase. In Ramseur, supra, we determined that such an instruction was also supported by constitutional requirements, because a jury could exercise its sentencing discretion in a rational and consistent manner only if it was informed of its deliberative options and the sentencing consequences of those options. 106 N.J. at 311.\n\nWe acknowledge that the death-penalty statute does not expressly provide for a non-unanimous option in regard to the own-conduct determination, although it specifically authorizes a non-unanimous verdict with respect to the weighing of aggravating and\n\nmitigating factors. N.J.S.A. 2C:11-3c(3)(c). Nevertheless, the considerations underlying the legislature's express recognition of non-unanimous verdicts in the penalty phase to determine whether a defendant receives a life or death sentence apply with equal force when a jury that has convicted a defendant of murder decides whether that defendant committed the murder by his own conduct. The jury's final verdict in the penalty phase results either in the imposition of a life sentence with a thirty-year minimum term or a sentence of death. Similarly, when a jury in a capital case decides whether a defendant committed the homicide \"by his own conduct,\" its determination establishes whether that defendant will be eligible for the death penalty. Although the consequences of the own-conduct determination and the penalty-phase verdict are not identical, the analogy is compelling. In the context of determining whether a jury should be informed of its non-unanimous option, any distinction is inconsequential.\n\nAs demonstrated by this record, a capital-murder defendant may focus his or her efforts in the guilt phase on raising a reasonable doubt about issues that trigger the penalty phase, rather than vigorously contesting guilt or innocence on the murder charge. The State acknowledges that \"the jury knew full well that the essential factual issue to be decided was who inflicted the fatal wounds -- defendant or Coleen.\" The jury also understood that when it decided that issue, it was taking a critical step toward imposition of a death sentence. We are convinced that, consistent with their statutory obligation in the penalty phase, the jurors should have been \"'fully informed of the consequences of their votes and the penalties which could result in each eventuality.'\" Ramseur, supra, 106 N.J. at 309 (quoting State v. Williams, 392 So. 2d 619, 634 (La. 1980)).\n\nFurthermore, the procedural consequence of nonunanimity in the penalty phase is identical with the consequence of nonunanimity in the own-conduct determination: a verdict that defendant is guilty of murder and should be sentenced in accordance with N.J.S.A. 2C:11-3b to at least a mandatory term of thirty-years\n\nimprisonment. Significantly, in neither instance does the inability of the jury to reach a verdict result in a hung jury and a mistrial, the jury's non-unanimous verdict in either instance resulting in a valid murder conviction.\n\nMoreover, as we acknowledged in Ramseur, supra, in the absence of an instruction on the permissibility of a non-unanimous verdict, an erroneous belief that a failure to agree will result in a mistrial \"'reasonably may [sway] a juror to join the majority, rather than [to] hold to his honest convictions, * * * to avoid forcing the parties, witnesses and court officials to undergo additional proceedings.'\" 106 N.J. at 309 (quoting Williams, supra, 392 So. 2d at 635). Hence, we conclude that the proper approach is for trial courts to inform juries in capital cases of their option to return a non-unanimous verdict on whether the defendant committed the murder by his own conduct. Similar to the mandated procedure in the penalty phase of the death-penalty process, the significance of the own-conduct determination in triggering the penalty phase supports the Conclusion that jurors must be instructed on the nonunanimity option.\n\nIn addition to omitting an express instruction on the non-unanimous-verdict option, the trial court's instruction regarding the jury's options on the own-conduct determination clearly was incorrect. Because the trial court's instruction to the jury concerning the duty to return a unanimous verdict was followed almost immediately by the instruction requiring the jury to decide whether defendant had committed the murders either by his own conduct or as an accomplice or co-conspirator, the court effectively required the jury to choose between a unanimous verdict that defendant had committed the murder by his own conduct or a unanimous verdict that he had committed the murder as an accomplice or co-conspirator. However, the sole issue that the jury had to decide was whether it was unanimously convinced beyond a reasonable doubt that defendant had committed the murder by his own conduct. A negative answer to that question would have been sufficient to render defendant non-death-eligible. No alternative unanimous finding that defendant had committed the murder as an accomplice or co-conspirator was required.\n\nD\n\nWe address the State's argument that the verdict of guilt on purposeful or knowing murder made an instruction on the non-unanimous option unnecessary. The State suggests that the non-unanimity option should not apply to the own-conduct determination, in part because to convict a defendant of murder, the jury must determine definitively whether that defendant committed the murder by his own conduct or as an accomplice. According to the State,\n\nThe jury had to decide if defendant acted as a principal by committing the acts himself which caused death or if [Alexander] committed those acts. An 'either . . . or . . ., but no surety on which theory' decision on defendant's liability for the substantive charge of purposeful or knowing murder would have resulted in a hung jury, not a non-capital murder verdict.\n\nAccordingly, the State argues, the court's instruction and verdict sheet accurately presented to the jury the two available verdict options: unanimity on own conduct or unanimity on accomplice or co-conspirator liability. Furthermore, the State points out that jury uncertainty about which theory of liability applied was \"a legal impossibility\" because defendant's convictions on purposeful or knowing murder already entailed a unanimous jury decision on a particular theory of liability.\n\nWe do not accept the State's premise that to convict defendant of purposeful or knowing murder, the jury was required unanimously to agree that the State had proved a specific theory of liability beyond a reasonable doubt. In Gerald, supra, we recognized that \"for purposes of determining an actor's guilt, both the [New Jersey Code of Criminal Justice] and the statutory and common law that preceded it abolished the distinction between principal and accomplice.\" 113 N.J. at 93. N.J.S.A. 2C:2-6 makes a defendant responsible for criminal conduct whether the defendant commits the crime by his own conduct, N.J.S.A. 2C:2-6a; aids another who commits the crime, N.J.S.A. 2C:2-6b(3), c; or conspires with another who commits the crime, N.J.S.A. 2C:2-6b(4). Those alternative theories of criminal-conduct responsibility impose the same criminal liability on a defendant\n\nwho is shown to have possessed the intent and to have acted to bring about the commission of the crime. N.J.S.A. 2C:2-6\n\naffirms the basic principle that liability is based upon conduct, to which is added the equally important affirmation that one may be accountable for the conduct of another. When such accountability obtains, it is and should be immaterial whether the defendant's own conduct, that of another for which he is accountable, or both in combination, establish the elements of the crime charged.\n\n[That] statement represents the legal situation in all jurisdictions and, indeed, all modern systems.\n\n[1 American L. Inst., Model Penal Code and Commentaries § 2.06 cmt. 2 at 299 (1985).]\n\nAlthough N.J.S.A. 2C:2-6 sets forth \"the different modes of complicity in an offense * * * it does not * * * contemplate that such distinctions should have a procedural significance.\" 2 Final Report of the New Jersey Criminal Law Revision Commission, commentary to § 2C:2-6, at 56 (1971) (hereinafter Final Report). Accordingly, the alternative theories of criminal-conduct responsibility do not constitute elements of a crime. See Gerald, supra, 113 N.J. at 99 (quoting Moore, supra, 207 N.J. Super. at 576). Ordinarily, indictments need not specify a theory of criminal-conduct responsibility. See State v. Schmidt, 110 N.J. 258, 263 (1988); 2 Final Report, supra, commentary to § 2C:2-6, at 56. Although murder indictments must specify whether the murder is alleged to have been committed by the defendant's own conduct, R. 3:7-3(b), the purpose of that requirement is only to indicate whether the alleged crime is one punishable by death.\n\nAccordingly, the accepted view is that to return a criminal conviction, a jury need not be unanimous on the theory of criminal-conduct responsibility if the alternative theories apply to commission of the same criminal act and each of them supports conviction of the same offense:\n\nIn a criminal charge involving one incident and two people, the jury is regarded as being unanimous if, without specifically identifying who was the principal and who was the accomplice, they all agree that one of the two actors performed all of the elements of the offense charged as a principal and that both actors knowingly participated in the alleged criminal act.\n\n[Probst v. State, 547 A.2d 114, 122-24 (Del. 1988) (rehearing en banc).]\n\nSee United States v. Peterson, 768 F.2d 64, 66-67 (2d Cir.) (noting that unanimity regarding defendant's role as either principal or aider and abettor is not required, but requiring unanimity on which of two acts charged in count of indictment was basis for verdict), cert. denied, 474 U.S. 923, 106 S. Ct. 257, 88 L. Ed. 2d 264 (1985); accord United States v. Horton, 921 F.2d 540, 544-46 (4th Cir. 1990), cert. denied, 501 U.S. 1234, 111 S. Ct. 2860, 115 L. Ed. 2d 1027 (1991); State v. McDonald, 872 P.2d 627, 655 (Alaska Ct. App. 1994); People v. Beardslee, 806 P.2d 1311, 1323-24 (Cal. 1991), cert. denied, U.S. , 112 S. Ct. 449, 116 L. Ed. 2d 467 (1991); State v. Smith, 563 A.2d 671, 676-78 (Conn. 1989); Bedell v. Commonwealth, 870 S.W.2d 779, 781 (Ky. 1994); Commonwealth v. Ramos, 577 N.E.2d 1012, 1014-15 (Mass. App. Ct.), review denied, 481 N.E.2d 481 (Mass. 1991); Fitzpatrick v. State, 638 P.2d 1002, 1011-12 (Mont. 1981); State v. Esker, 658 S.W.2d 49, 53-54 (Mo. Ct. App. 1983); State v. Hoffman, 804 P.2d 577, 605 (Wash. 1991); Holland v. State, 280 N.W.2d 288, 292-93 (Wis. 1979), cert. denied, 445 U.S. 931, 100 S. Ct. 1320, 63 L. Ed. 2d 764 (1980); see also Schad v. Arizona, 501 U.S. 624, 637-45, 111 S. Ct. 2491, 2500-04, 115 L. Ed. 2d 555, 569-74 (1991) (plurality) (holding that trial court's failure to require jury unanimity on whether first-degree murder conviction was based on theory of pre-meditated murder or felony-murder did not violate due-process protections).\n\nWe previously have acknowledged that view. See Bey II, supra, 113 N.J. at 99 (noting that trial court \"properly concluded\" that reversal on own-conduct finding was not fatal to murder conviction); see also State v. Parker, 124 N.J. 628, 633-34 (1991) (acknowledging that jury unanimity concerning theory of defendant's guilt is not required), cert. denied, U.S. , 112 S. Ct. 1483, 117 L. Ed. 2d 625 (1992). We reject the contention that a jury convinced beyond a reasonable doubt that a defendant either committed a criminal act or aided another in committing the act, but that harbors a reasonable doubt\n\nor is nonunanimous about which alternative is correct, should be precluded from returning a verdict of guilt on the criminal offense.\n\nThe jury's verdict that defendant was guilty of the purposeful and knowing murder of Alice Skov and John Bell required the jury to have determined that defendant was responsible for the murders beyond a reasonable doubt, either by his own conduct, as an accomplice, or as a co-conspirator, but did not require unanimity on the specific theory of liability. Thus, the possibility of a nonunanimous verdict on the own-conduct requirement remained a possibility after the jury decided defendant's guilt on the murder charges. We next consider whether that possibility was sufficiently great to warrant a Conclusion that the court's failure properly to charge the jury on the option of a nonunanimous verdict prejudiced defendant.\n\nE\n\nOur decisions have consistently emphasized that clear and correct jury instructions are essential for a fair trial. See, e.g., State v. Martini, 131 N.J. 176, 271 (1993) (citing State v. Collier, 90 N.J. 117, 122 (1982)); State v. Martin, 119 N.J. 2, 15 (1990) (citing Collier, supra, and State v. Green, 86 N.J. 281, 288 (1981)). As we stated in Martin, \"A charge is a road map to guide the jury, and without an appropriate charge a jury can take a wrong turn in its deliberations.\" 119 N.J. at 15. Furthermore, \"so critical is the need for accuracy that erroneous instructions on material points are presumed to be reversible error,\" ibid., and \"are ordinarily considered 'poor candidates for rehabilitation under the harmless error philosophy.'\" State v. Harmon, 104 N.J. 189, 213 (1986) (quoting State v. Simon, 79 N.J. 191, 206 (1979)).\n\nIn prior cases, we have dismissed as harmless error the failure of the court to give proper instructions on the own-conduct determination because the evidence presented at trial and the theory proposed by the defense simply did not support a Conclusion\n\nthat the jury might have harbored a doubt about whether defendant had committed the murder by his own conduct. In State v. McDougald, 120 N.J. 523 (1990), the defendant alleged error in the court's instructions on the distinction between own-conduct and accomplice liability, id. at 560-61. Additionally, the verdict sheet gave the jury a choice between own-conduct and accomplice liability after it had determined the defendant's guilt for murder. Id. at 561-62. The defendant's challenge concerned whether his actions or the actions of his accomplice had caused the victims' death. Id. at 561. We concluded in McDougald that because the defendant had \"stabbed, cut and struck the victims until they died,\" the instruction on own-conduct and accomplice liability had been adequate. Id. at 562.\n\nIn Biegenwald, supra, 126 N.J. 1, the defendant alleged that he had not been convicted of \"capital murder\" because the court had failed to obtain a special finding regarding own-conduct. The State's case was that the defendant had fired four shots into the victim's head, and the defense theory was that another person who had originally been charged with the defendant for the murder had committed the murders himself. Id. at 18-19. The defendant argued on appeal that the jury could have found that he had aided the other person, thus raising an own-conduct issue. However, because \"neither that theory nor the facts or arguments that might have supported it were ever put before the jury,\" we concluded that the verdict of guilt \"unmistakably\" indicated that defendant had committed the murder by his own conduct. Id. at 19. We note that in both McDougald and Biegenwald we vacated the defendant's death sentence on other grounds.\n\nIn examining the probable effect of the trial court's failure to instruct the jury that a non-unanimous verdict on the own-conduct determination was permissible and would not affect defendant's murder conviction, we focus on whether the testimony and arguments could have generated a reasonable doubt about whether\n\ndefendant or Coleen Alexander had shot John Bell and Alice Skov. We conclude that the evidence could have left the jury with a reasonable doubt on that question.\n\nDefense counsel's summation emphasized that very issue. Among the points that defense counsel underscored were the following: Coleen Alexander's demonstrated need for money had impelled Alexander and defendant to engage in criminal conduct; inconsistencies existed in the accounts of defendant's alleged inquiries about obtaining a gun; a witness had seen defendant outside of the house standing alone by the passenger side of the car; Alexander's height more accurately fit the trajectory of the first shot at Alice Skov, and her account of the shooting was inconsistent with the trajectory of the second, fatal shot to Alice Skov; Alexander had changed her clothes immediately after returning home from the murders; no blood had been found on defendant's clothes, and Alexander's clothes had never been checked; the State's indictment, of which the jury received a copy, charged defendant and Alexander with murder by their own conduct; Alexander had pled guilty to avoid the death penalty, but was exposed to the death penalty only if she committed either murder by her own conduct. In addition, defense counsel pointed out that the only accounts of the shooting had been from uniquely untrustworthy sources -- Alexander and the two \"jailhouse snitches,\" Lesando and Merlo. In the past, we have accorded due weight to the arguments advanced by defense counsel in assessing whether the evidence at trial could have supported a given result. See State v. Johnson, 120 N.J. 263, 300-01 (1990) (noting that defense counsel's argument during summation that defendant had not killed by his own conduct demonstrated need for appropriate own-conduct instruction on retrial).\n\nIn addition, we note the trial court's view that the record contained sufficient evidence on which the jury could have inferred that Alexander had killed the victims. Following closing arguments and prior to charging the jury, the court explained that it had included separate instructions on slayer and nonslayer-participant\n\nliability in the felony-murder charge. In that context the court observed, \"There's some testimony in the case from which the jury can infer that he wasn't the slayer, that he was there. There's testimony that he was the slayer. You have to give them both.\" When the court gave the felony-murder charge to the jury, it stated, \"Now as I recall the evidence, there's some evidence pointing to the fact that Bobby Lee Brown committed the killing during the course of a robbery and there's some evidence to indicate that perhaps Coleen Alexander was the one that committed the killing during the course of the robbery.\"\n\nAdditionally, we note that the court's description of the evidence was made with the benefit of its personal observation of the witnesses, particularly Alexander, who, the court observed, \"didn't seem to tell the truth about anything\" and whose \"little regard for the truth\" was \"readily apparent.\" That assessment of her credibility may reflect how the jurors perceived Alexander. Indeed, the record contains abundant examples of inconsistencies in Alexander's testimony, most notably in her testimony regarding her role in taking the rifle to Oxford and in removing it from the victims' home after the shooting. Against that background, we emphasize that the State's case that defendant committed the murders by his own conduct was based largely on Alexander's testimony, as well as on the prior statements of Merlo and Lesando, both of whom claimed that they could not recall having given those statements or having spoken to defendant about the murders.\n\nGiven those considerations, we cannot say with a sufficient degree of certainty that the jury -- or a single juror -- could not have harbored a reasonable doubt about whether defendant or Alexander killed the victims. We acknowledge that the record does not present a compelling basis to conclude that Alexander killed the victims, but it does present a basis on which a juror could hold a reasonable doubt about whether defendant or Alexander killed the victims, particularly when the defense was geared almost entirely toward creating that doubt. On slimmer evidentiary\n\nsupport, we observed in State v. Long, 119 N.J. 439 (1990):\n\nAlthough defendant's defense was inconsistent with any theory of accomplice liability, counsel could have argued to the jury that the State's evidence of the other accomplice's role might have created a doubt, not that defendant was there, but that he had been the shooter, thus entitling him to an accomplice charge. * * * We recognize the public impatience with capital-punishment jurisprudence but we cannot conscientiously or constitutionally deny this defendant the right to be tried in accordance with correct principles of law. We have repeatedly stated that we are convinced that the Legislature wished the law to apply equally to all capital defendants.\n\n[Id. at 464-65 (citations omitted).]\n\nFurthermore, in Gerald, supra, we concluded that the trial court's improper instruction on the own-conduct requirement was reversible because based on the record, \"it [was] possible -- however remotely,\" 113 N.J. at 100, that the jury could have returned a verdict that the defendant had not committed the murder by his own conduct.\n\nWhen we assess this record and the potential for harm inherent in the court's erroneous jury instructions, the inescapable Conclusion is that the court's charge \"was clearly capable of misleading the jury.\" Harmon, supra, 104 N.J. at 213. Our review of the record convinces us that the testimony could have created a reasonable doubt among the jurors about whether defendant or Alexander had inflicted the fatal wounds. Because such a doubt, even in the mind of one juror, could have resulted in a permissible nonunanimous verdict on the own-conduct question, the failure to inform the jury that it had the option of returning such a verdict was clearly capable of prejudicing defendant. Indeed, the only instruction that the court gave to the jury regarding unanimity not only failed to convey the non-unanimous option, it unequivocally mandated unanimity: \"Now since this is a criminal case, your verdict must be unanimous, all 12 jurors deliberating must agree.\" Clearly, jurors could not have understood from that instruction that a nonunanimous decision on the own-conduct requirement was a permissible option that would have resulted in a final verdict. Therefore, the jury's verdict on the own-conduct determination is flawed and cannot provide a basis for sustaining\n\ndefendant's death-eligibility. Accordingly, we reverse defendant's death sentence because of the error in the own-conduct instruction.\n\nThe erroneous instruction did not affect defendant's murder convictions because the jury could have convicted defendant of the murders even if it had disagreed about whether defendant had committed the murders by his own conduct, as an accomplice, or as a co-conspirator. See supra at (slip op. at ); Gerald, supra, 113 N.J. at 99-100. Thus, our reversal of the death sentence does not affect those convictions.\n\nAdditionally, we observe that defendant has made no showing or claim that the jury in fact reached a nonunanimous result on the own-conduct determination. Therefore, our reversal of defendant's death sentence would not preclude the State from again seeking the death penalty. Cf. Ramseur, supra, 106 N.J. at 313-15 (concluding that charge that improperly coerced jury to reach unanimous verdict in violation of Czachor after jury had indicated inability to reach verdict required that defendant receive benefit of non-unanimous verdict and foreclosed State from seeking death penalty on remand).\n\nTo seek a death-penalty verdict, however, the State would have to retry defendant on the charge of murdering Alice Skov for the purpose of establishing beyond a reasonable doubt that he committed that murder by his own conduct. In supplemental post-argument briefs the Attorney General and defense counsel acknowledged that defendant's conviction of the murder of Alice Skov must be vacated if the State on remand again seeks the death penalty for that offense. See N.J.S.A. 2C:11-3c (mandating that determination whether defendant committed homicidal act \"by his own conduct\" be made prior to penalty phase). See also Ramseur, supra, 106 N.J. at 193 (\"Section c of the Act permits the death penalty to be imposed only on those who commit murder 'by [their] own conduct' or who pay another to do so. Thus the Act does provide for a certain degree of narrowing at the guilt phase.\") (emphasis added). We rely as well on our\n\nholding in Gerald, supra, in which we rejected the option of preserving the defendant's murder conviction so that a jury on remand could first determine death-eligibility, \"to be followed, if eligibility be found, by a new sentencing proceeding.\" 113 N.J. at 70. Although the own-conduct issue before us can be distinguished from the state-of-mind determination that mandated reversal in Gerald -- the latter relating directly to an element of the crime of murder and the former serving only as a test of death-eligibility -- we are satisfied that the analogy is compelling. Accordingly, as in Gerald, supra,\n\nWithout a determination of the basis for the jury's verdict, we cannot sustain the imposition of the death penalty, nor, for the reasons expressed earlier in this opinion, can we permit a second jury to pick up the thread at some point in the first jury's deliberations. Hence the guilty phase of the capital murder charge must be retired from the beginning.\n\n[Id. at 92.]\n\nShould the State forego the option of seeking the death penalty on remand, the trial court would then be required to sentence defendant on his conviction for the murder of Alice Skov in accordance with N.J.S.A. 2C:11-3b. Furthermore, in light of our Disposition in favor of the State on its cross-appeal regarding the court's improper merger of the robbery and weapons-possession offenses, infra at (slip op. at ), the trial court will be required on remand to sentence defendant on those charges.\n\nIII\n\nWe now address defendant's other contentions only to the extent that they raise issues that are relevant to a potential retrial of the guilt and penalty phases.\n\nA. Improper Instructions on Accomplice and Co-conspirator Liability\n\nDefendant alleges that the trial court erred in failing properly to instruct the jury on accomplice and co-conspirator liability. In its original charge, the trial court properly instructed the jury, consistent with the indictment, that defendant could be\n\nguilty of murder if he committed the homicides by his own conduct, or if he was an accomplice of the person who committed the homicides. See N.J.S.A. 2C:2-6a, b(3). However, contrary to the indictment, the trial court failed to instruct the jury that defendant also could be guilty of murder if he had been engaged in a conspiracy to commit the homicides, whether or not he had committed the murder by his own conduct or had been an accomplice of the person who committed the homicides. See N.J.S.A. 2C:2-6b(4); see also State v. Bridges, 133 N.J. 447, 468 (1993) (\"[A] conspirator can be held liable for the acts of others that constitute a reasonably foreseeable risk arising out of the criminal conduct undertaken to effectuate the conspiracy, and occurring as the necessary or natural consequences of the conspiracy.\").\n\nThe trial court apparently intended to instruct the jury on defendant's exposure to a murder conviction on the basis that he had engaged in a conspiracy to commit the homicides, as alleged in counts three and four of the indictment. However, the trial court's original charge instead instructed the jury on the substantive crime of conspiracy, N.J.S.A. 2C:5-2, for which defendant had also been indicted. The commission of that crime, however, can occur without completion of the substantive offense contemplated by the conspiracy, and if the substantive offense, as here, is a crime of the first degree, the conspiracy offense is graded as a second-degree crime. N.J.S.A. 2C:5-4.\n\nDuring deliberations, the jury requested an instruction clarifying the difference between own-conduct liability and accomplice or co-conspirator liability. The court responded by defining own-conduct liability, repeating its instruction on the substantive offense of conspiracy but omitting again to instruct the jury that defendant could be convicted of murder solely on the basis that he had conspired with another person to commit the homicides. Neither accomplice nor co-conspirator liability for murder was explained in the court's supplemental instruction.\n\nGiven our reversal of defendant's death sentence on other grounds, see supra at (slip op. at 25-51), we need not undertake a detailed analysis of whether the court's flawed instructions prejudiced defendant in respect of the own-conduct determination that triggered the penalty phase. In one respect, the trial court's failure to instruct the jury that defendant could be convicted of murder if he conspired to commit the homicides benefitted defendant by limiting the grounds on which the jury could return a guilty verdict on the murder charges. Nevertheless, we also note the potential for prejudice. The court's instructions and verdict sheet emphasized that the jury's decision on the own-conduct requirement was a choice between alternative theories of liability -- own-conduct liability, on the one hand, or accomplice or co-conspirator liability on the other. Clearly, the jury's request for a supplemental charge on own-conduct liability and accomplice or co-conspirator liability suggests that the jury was uncertain about those theories or the distinction between them. The court increased that uncertainty when it responded to the jury's request with an explanation only of own-conduct liability, and no explanation of either accomplice or co-conspirator liability for murder. Because the own-conduct interrogatory required the jury to make a determination on the precise issue about which it later expressed confusion, the court's failure to resolve that confusion makes the own-conduct determination less reliable.\n\nB. Admissibility of Prior-Bad-Act Evidence\n\nDefendant claims that he was prejudiced by the introduction of inadmissible testimony concerning prior bad acts. The testimony concerned defendant's alleged prior abuse of Coleen Alexander and her children; Alexander's testimony that shortly after meeting defendant, she had put up bail for him in respect of an unrelated offense; Alexander's and defendant's theft of money from the home of Alexander's grandmother; and defendant's alleged sexual relationship with another woman. Defendant contends that the introduction of such testimony violated former Evidence Rule 55 (now N.J.R.E. 404(b)) and also violated pre-trial\n\norders requiring the State to notify defendant if it intended to introduce so-called \"Rule 55 evidence.\" (Because N.J.R.E. 404(b) is in some respects materially different from Evidence Rule 55, we consider defendant's contentions in the context of Evidence Rule 55.)\n\nThis Court has dealt extensively with the admissibility of evidence of prior bad acts. See, e.g., State v. Oliver, 133 N.J. 141 (1993); State v. Stevens, 115 N.J. 289 (1989). In Stevens, we explored the history and purpose of former Evidence Rule 55:\n\nUnderlying Rule 55 * * * is the recognition that other-crime evidence may simultaneously be highly probative and extremely prejudicial. * * * Despite its probative worth, other-crime evidence offered solely to prove criminal Disposition is excluded under the Rule, as at common law:\n\n\"The motivating policies are said to be to avoid confusion, unfair surprise and prejudice.\"\n\n[115 N.J. at 300 (emphasis added) (quoting State v. Ascolese, 59 N.J. Super. 393, 397 (App. Div. 1960)).]\n\nAlthough Evidence Rule 55 excludes evidence of prior criminal or civil wrongs if introduced to show a defendant's criminal Disposition, such evidence may be admitted to prove other facts in issue, subject to the court's discretion to exclude the evidence if its probative value is outweighed by its risk of prejudicing or misleading the jury. See Evid. R. 4 (now N.J.R.E. 403); Oliver, supra, 133 N.J. at 151. Based on our review of the challenged testimony, we conclude that the trial court did not abuse its discretion in admitting that testimony into evidence.\n\nMuch of the testimony about which defendant complains either was elicited during defendant's cross-examination of the witness or involved a subject that defendant had placed in issue. For example, the most damaging testimony regarding past abuse of Alexander by defendant was given by Alexander in the following colloquy on cross-examination:\n\nQ. You knew [defendant] well enough to blame him for the theft from your grandmother's, didn't you?\n\nA. I did as I was told.\n\nQ. You did as you were told, right. And that's generally what you've done throughout this whole thing, just done as you've been told, right?\n\nA. I did what I was told because I was afraid.\n\nQ. Oh, you were afraid of Mr. Brown?\n\nA. That's correct.\n\nQ. Mr. Brown threatened you, you said I think, correct?\n\nA. Mr. Brown not only threatened me, Mr. Brown has beaten me several of [sic] times, almost killed me the last time he beat me, strangled me with a dog chain, urinated on me.\n\nAt that point, defense counsel asked the court to instruct Alexander to be responsive to the questions and not volunteer information. The court gave the instruction and defense counsel continued:\n\nQ. Miss Alexander, you say this man threatened you, correct?\n\nA. Also beat me.\n\nQ. He threatened your life?\n\nA. Yes.\n\nQ. He threatened your children's life?\n\nA. He also beat my son with a stick.\n\nDefense counsel then immediately focussed on the fact that Alexander had written love letters to defendant in jail, and introduced into evidence letters that Alexander and her son had written on defendant's behalf after his arrest praising defendant's character as a husband and father.\n\nThat portion of the cross-examination clearly shows that the defense elicited from Alexander claims that she had been threatened by defendant so that the letters of praise could then be introduced, presumably both as substantive evidence of defendant's character and also to impeach Alexander's credibility. That Alexander continued to volunteer examples of defendant's prior bad acts in her responses to cross-examination does not constitute a basis for a reversal on the theory that Evidence Rule 55 would have precluded the admissibility of her testimony if offered as part of the State's case. We note also that references to the theft from the grandmother's house and to payment of a bail bond on defendant's behalf also occurred on defense counsel's cross-examination of Alexander.\n\nDefendant also contests the admissibility of testimony of Alexander's parents, offered and elicited by the State, that defendant had learned about the availability of the murder weapon, Stephen Krouch's rifle, when Krouch made a veiled threat to use it against defendant after Krouch had heard allegations that defendant was beating Alexander. Defendant objected to the testimony and requested a mistrial because the testimony violated Evidence Rule 55 and a pre-trial order requiring notice if such evidence were to be introduced. The court denied the request, and defendant declined the court's offer of a curative instruction. Because the State may wish to introduce the testimony at a retrial, we address its propriety.\n\nWe believe that the evidence does not directly implicate Evidence Rule 55. If the parents' testimony had been offered to prove that defendant had beaten Alexander, the testimony would have been inadmissible hearsay. Rather, the State introduced the references to defendant's abuse of Alexander to explain why Stephen Krouch had informed defendant of the existence of the rifle, and not primarily to prove that defendant had committed past wrongs.\n\nThe admissibility of the evidence if offered at retrial should be based on a determination of its relative probative value and risk of prejudice under N.J.R.E. 403, an evaluation best left to the trial court. Although the evidence clearly supports Stephen Krouch's testimony that he informed defendant about the rifle, other evidence also established that defendant knew about the rifle. Thus, Krouch's testimony explaining why he told defendant that he had a rifle, which the jury might improperly perceive to be evidence of defendant's abuse of Alexander, should be carefully scrutinized before it is admitted. In that connection, we note our Dissenting colleague's observation that \"the State could have easily avoided the prejudicial testimony while simultaneously imparting to the jury that defendant had knowledge of the weapon prior to the commission of the murders.\" Post at (slip op. at 38).\n\nThe other instances of challenged testimony do not merit extended Discussion. Neither the testimony regarding defendant's sexual acts with another woman nor Alexander's testimony that defendant pointed the rifle at her the night before the murders and said \"stick 'em up\" constituted evidence that implicates Evidence Rule 55, because those acts were neither criminal nor civil wrongs, as required by the Rule. See State v. Porambo, 226 N.J. Super. 416, 424-25 (App. Div. 1988); State v. Zarinsky, 143 N.J. Super. 35, 56 (App. Div. 1976), aff'd, 75 N.J. 101 (1977). Furthermore, although Evidence Rule 55 applies to \"other crimes, wrongs, or acts,\" Alexander's testimony clearly tends to show defendant's intent to use the rifle for the robbery, and his opportunity and preparation to do so, both of which are expressly enumerated categories for admissibility under the Rule. See also State v. Rose, 112 N.J. 454, 488-89 (1988) (deciding that evidence of defendant's prior statements and acts showing intent to use murder weapon against others was admissible to show purposeful intent and absence of mistake or accident at time of murder). The testimony regarding defendant's sexual acts with another woman is relevant to counter the defense's suggestion that defendant's confessions were driven by his devotion to Alexander and desire to protect her, an important issue in the case. Thus, the evidence should not be excluded under Evidence Rule 55, and would be admissible subject to the trial court's determination of its relative probative value and risk of undue prejudice, pursuant to N.J.R.E. 403. See McDougald, supra, 120 N.J. at 577-79 (holding that evidence of defendant's bigamous relationships and sexual relationships with minors not offered to imply that defendant had committed crimes but admissible as relevant to witness credibility and identification of defendant).\n\nWe next address defendant's claim that the court should have given the jury a specific limiting instruction regarding its consideration of prior-bad-act evidence at both the guilt and penalty phases. We note that N.J.R.E. 105, the successor to\n\nEvidence Rule 6, states that the court shall give a limiting instruction \"upon request,\" and expressly provides for waiver of the instruction. The Supreme Court Committee comment to the rule makes clear that failure to give a limiting instruction sua sponte, when required to avoid the risk of prejudice, is reviewable as plain error, citing Cofield, supra, 127 N.J. at 328. However, the comment to the waiver provision acknowledges that a party may wish to forego such an instruction for tactical reasons. Thus, while a court must give a limiting instruction, if warranted, despite the lack of a request, we find no support for defendant's suggestion that a court should provide an instruction despite a party's calculated decision to waive it.\n\nAlthough we agree that the trial court should have provided the jury with a general limiting instruction at the close of the guilt phase, our Disposition of defendant's claims of error regarding the admission of prior-bad-conduct evidence leads us to conclude that the failure to have done so was harmless. Indeed, given defense counsel's tactical waiver of a limiting instruction regarding the Krouches' testimony, and the apparently strategic decisions by defense counsel to elicit much of the other challenged evidence, we observe that any limiting instruction concerning that evidence ran the risk of interfering with defendant's trial strategy.\n\nThose same considerations apply to the penalty phase. In view of our reversal of the death sentence on other grounds we decline to undertake an analysis of whether the court's failure to give a limiting instruction in respect of testimony about defendant's prior bad acts was error. As discussed, some of that evidence, such as the thefts from defendant's grandmother, was elicited by defendant for strategic purposes, to demonstrate the role of Coleen Alexander in the crimes and her controlling influence over defendant. That evidence was relevant to the factors that defendant wished the jury to consider in mitigation. If a defendant presents evidence in mitigation, the State has the opportunity to rebut that evidence. See N.J.S.A. 2C:11-3c(2)(d). Furthermore, if a defendant relies on evidence that ordinarily would not be admissible\n\nunder the rules of evidence in criminal trials, the State has the opportunity to present evidence under that same relaxed standard. See N.J.S.A. 2C:11-3c(2)(b); see also McDougald, supra, 120 N.J. at 548-49 (upholding constitutionality of evidentiary provisions in N.J.S.A. 2C:11-3c(2)). We are not persuaded, for example, that the court was required to instruct the jury that it could consider the complimentary letters written about defendant by Alexander, but that it could not consider Alexander's testimony regarding defendant's prior abuse, which defendant apparently elicited for the very purpose of offering the letters into evidence as rebuttal.\n\nDespite the difficulty of fashioning an appropriate limiting instruction, we direct the trial court's attention to our observation in Rose, supra, that \"in a death penalty context, and in the face of * * * abundant and inflammatory evidence of defendant's past conduct, the necessity for a careful and precise limiting instruction to [the] jury [is] clear and compelling.\" 112 N.J. at 508. We are confident that in the event of retrial of the penalty phase, the court will craft an instruction that preserves the respective evidentiary rights of the State and defendant but does not permit irrelevant and inflammatory evidence to infect the penalty-phase deliberations.\n\nC. Court's Comment on Potential for Appellate Review\n\nDefendant claims that the trial court committed prejudicial error when it informed the jury during the guilt phase that \"sometimes these cases go up on appeal and * * * are reversed and * * * all of the time, all of the weeks and effort that you put in would go for [naught].\" The purpose of the comment was to abate perceived juror discontent with the number and length of trial interruptions required to permit the court to resolve legal issues. Although our reversal of the death sentence makes the effect of the comment on the penalty phase a moot issue, we consider whether the comment had the capacity to prejudice defendant in the guilt phase.\n\nA jury should not be reminded of the potential for appellate review, because that prospect may diminish the jury's sense of responsibility for its decision and might encourage the jury to render a verdict based on a lesser degree of certainty than required. See Caldwell v. Mississippi, 472 U.S. 320, 328-34, 105 S. Ct. 2633, 2639-2642, 86 L. Ed. 2d 231, 239-43 (1985); State v. Slattery, 239 N.J. Super. 534, 552 (App. Div. 1990). The court's comment was unnecessary and improper. However, we are convinced that that isolated comment did not have the effect of diminishing the jurors' sense of responsibility for the verdicts to be rendered.\n\nFirst, the comment was not made in the context of a jury instruction. The court's remarks preceding that comment made clear that the court was addressing the potential juror discontent caused by delays, and that those delays were prompted by the need to resolve legal issues. The court observed that the court's improper resolution of the legal issues might result in a reversal. No suggestion was made that the jury's determinations were subject to review. Furthermore, the reference was an isolated comment that the court made on the tenth day of a nineteen-day trial that spanned five weeks and included testimony from over forty witnesses. Moreover, the jury heard the comment three weeks before it began its guilt-phase deliberations. Finally, in its opening comments to the jury at the beginning of the guilt-phase trial, and during its charges in both the guilt and penalty phases, the court stressed to the jury that it \"alone\" had the duty to determine the factual issues and that it squarely shouldered the responsibility for imposing the death sentence.\n\nAlthough comments regarding the potential for review are not proper in guilt-phase or penalty-phase proceedings, a special danger exists in the penalty phase that is not present in the guilt phase. \"Even when a sentencing jury is unconvinced that death is the appropriate punishment, it might nevertheless wish to 'send a message' of extreme disapproval for the defendant's acts. This desire might make the jury very receptive to the [court's] assurance\n\nthat it can more freely 'err because the error may be corrected on appeal.'\" Caldwell, supra, 472, U.S. at 331, 105 S. Ct. at 2641, 86 L. Ed. 2d at 241 (quoting Maggio v. Williams, 464 U.S. 46, 54-55, 104 S. Ct. 311, 316, 78 L. Ed. 2d 43, 50 (1983) (Stevens, J., Concurring)). The penalty phase involves a qualitative assessment by the jury of what sentence is appropriate for a defendant who has already been found guilty. That context presents a much greater risk that a jury will \"send a message\" than does the guilt phase, in which the jury is still deciding whether the defendant should be convicted.\n\nWe conclude that the court's remark did not have the capacity to undermine the sense of responsibility with which the jury performed its duty in the guilt phase, and thus does not require reversal of defendant's convictions.\n\nD. Admission of Prior Inconsistent Statements of Lesando and Merlo\n\nDefendant challenges the introduction of statements made to the prosecution by Peter Lesando and Michael Merlo. Those statements related conversations that they had had with defendant while in prison in which defendant admitted his involvement in the murders and that he had been the shooter. Both Lesando and Merlo informed the prosecutor before trial that they would not testify to those conversations or the statements because they could not remember the events having occurred. The State sought to have Lesando's and Merlo's statements introduced as prior inconsistent statements pursuant to Evidence Rule 63(1)(a) (now N.J.R.E. 803(a)). Based on findings in separate evidentiary hearings, the court determined that both Lesando and Merlo were feigning their lack of recollection, and concluded that the prosecution could introduce their prior inconsistent statements as substantive evidence.\n\nNew Jersey Rule of Evidence 803(a)(1) states in part:\n\nThe following statements are not excluded by the hearsay rule:\n\n(a) Prior statements of witnesses. A statement previously made by a person who is a witness at a trial or hearing, provided it would have been admissible if made by the declarant while testifying and the statement:\n\n(1) is inconsistent with the witness' testimony at the trial or hearing * * *. However, when the statement is offered by the party calling the witness, it is admissible only if, in addition to the foregoing requirements, it (A) is contained in a sound recording or in a writing made or signed by the witness in circumstances establishing its reliability * * *.\n\n(N.J.R.E. 803(a)(1) restates almost verbatim the text of former Evidence Rule 63(1)(a).)\n\nIn State v. Mancine, 124 N.J. 232, 246-47 (1991), and State v. Gross, 121 N.J. 1, 7-9 (1990), we explained that amendments to Evidence Rule 63(1)(a) represented New Jersey's movement away from the \"orthodox\" view, under which such evidence was admissible only for impeachment purposes, and toward the more accepted, modern approach that the prior inconsistent statement of the proponent's witness could be admitted as substantive evidence. In Gross, we expressed our agreement with fifteen factors that the Appellate Division had enumerated for proper evaluation of the reliability of a prior inconsistent statement. 121 N.J. at 10 (quoting State v. Gross, 216 N.J. Super. 98, 109-10 (1987)). We held that in determining the admissibility of such statements, the court should be convinced by a preponderance of the evidence that the evidence is sufficiently reliable for presentation to the jury, noting that the required availability for cross-examination provided additional safeguards for reliability. Id. at 10-17.\n\nThe issue presented by defendant's appeal is whether the State in a criminal prosecution can introduce the prior inconsistent statement of its witness when the witness testifies that he cannot recall either making the statement or the events described in the statement, and the court determines that the witness is feigning that lack of recollection. Defendant claims that the prior statements were inadmissible under Evidence Rule 63(1)(a) because the witness's failure to recall the statements or the events they related did not constitute testimony that was inconsistent with the\n\nprior statements. Furthermore, defendant claims that even if the statements were inconsistent, admitting them as substantive evidence in such circumstances violates defendant's state constitutional right to confront witnesses, because the lack of recollection, even if feigned, makes effective cross-examination impossible.\n\nIn State v. Bryant, 217 N.J. Super. 72, certif. denied, 108 N.J. 202, cert. denied, 484 U.S. 978, 108 S. Ct. 490, 98 L. Ed. 2d 488 (1987), the Appellate Division squarely addressed the issue and, although acknowledging that courts were divided on the question, determined that the witness's prior inconsistent statement was admissible under the hearsay exception and did not violate the defendant's federal and state constitutional right to confront witnesses. Id. at 77-79. The court reached that same Conclusion in State v. Burgos, 200 N.J. Super. 6, 10-12 (App. Div.), certif. denied, 101 N.J. 304 (1985).\n\nWe begin by observing that the federal courts generally agree that a feigned lack of recollection regarding the facts contained in a prior statement constitutes inconsistent testimony and is not excluded as hearsay. See, e.g., United States v. Owens, 484 U.S. 554, 563, 108 S. Ct. 838, 844-45, 98 L. Ed. 2d 951, 960 (1988) (\"It would seem strange * * * to assert that a witness can avoid introduction of testimony from a prior proceeding that is inconsistent with his trial testimony by simply asserting lack of memory of the facts to which the prior testimony related.\"); United States v. Bigham, 812 F.2d 943, 946-47 (5th Cir. 1987) (discussing advisory committee note to federal rule that exception for prior inconsistent statements would protect against \"turncoat\" witnesses); United States v. DiCaro, 772 F.2d 1314, 1321-22 (7th Cir. 1985) (noting accepted view that \"inconsistent\" within meaning of hearsay exclusion does not mean \"diametrically opposed\"), cert. denied, 475 U.S. 1081, 106 S. Ct. 1458, 89 L. Ed. 2d 716 (1986); United States v. Murphy, 696 F.2d 282, 283-84 (4th Cir. 1982), cert. denied, 461 U.S. 945, 103 S. Ct. 2124, 77 L. Ed. 2d 1303 (1983), and cert. denied sub nom. Waddell v. United States, 461 U.S. 945, 103 S. Ct. 2123,\n\n77 L. Ed. 2d 1303 (1983); United States v. Rogers, 549 F.2d 490, 496 (8th Cir. 1976) (\"A claimed inability to recall, when disbelieved by the trial Judge, may be viewed as inconsistent with previous statements when the witness does not deny that the previous statements were in fact made.\"), cert. denied, 431 U.S. 918, 97 S. Ct. 2182, 53 L. Ed. 2d 229 (1977); United States v. Insana, 423 F.2d 1165, 1170 (2d Cir. 1970) (distinguishing between genuine lack of recollection, which may justify exclusion of prior statements, and admissibility \"where a witness does not deny making the statements nor the truth thereof but merely falsifies a lack of memory\"); see also United States v. Distler, 671 F.2d 954, 958 (6th Cir.) (observing in context of actual lack of recollection that \"partial or vague recollection is inconsistent with total or definite recollection\"), cert. denied, 454 U.S. 827, 102 S. Ct. 118, 70 L. Ed. 2d 102 (1981).\n\nThat position is shared by many state courts. See, e.g., Van Hatten v. State, 666 P.2d 1047, 1050-52 (Alaska Ct. App. 1983); People v. Johnson, 842 P.2d 1, 18 (Cal. 1992) (\"When a witness's claim of lack of memory amounts to deliberate evasion, inconsistency is implied.\"), cert. denied, U.S. , 114 S. Ct. 114, 126 L. Ed. 2d 80 (1993); United States v. Hsu, 439 A.2d 469, 470-71 (D.C. 1981); Traver v. State, 568 N.E.2d 1009, 1011-12 (Ind. 1991); State v. Marco, 368 N.W.2d 470, 473 (Neb. 1985) (noting that inconsistency does not require diametric opposition and can arise from failure to recall); State v. Sanchez, 811 P.2d 92, 97 (N.M. Ct. App. 1991); State v. Whiting, 402 N.W.2d 723, 731 (Wis. Ct. App.), review denied, 412 N.W.2d 893 (Wis. 1987); cf. Gibbons v. State, 286 S.E.2d 717, 721-22 (Ga. 1982) (holding witness's prior statement admissible as substantive evidence when witness denied that statement or that conversations related therein had been made). In addition, commentators agree that a feigned lack of recollection at trial amounts to inconsistency for the purposes of determining whether a prior inconsistent statement is admissible under hearsay exceptions:\n\nWhen is a prior statement inconsistent? On the face of it, a prior statement describing an event would not be inconsistent with testimony by the witness that he no longer remembers the event. Yet the tendency of unwilling or untruthful witnesses to seek refuge in forgetfulness is well recognized. Hence the Judge may be warranted in concluding under the circumstances the claimed lack of memory of the event is untrue and in effect an implied denial of the prior statement, thus qualifying it as inconsistent and nonhearsay.\n\n[2 John W. Strong, McCormick on Evidence § 251 (4th ed. 1992) (footnotes omitted).]\n\nIn 3A Wigmore on Evidence § 1043 (Chadbourne rev. 1970), the observation was made that \"where a witness now claims to be unable to recollect a matter, a former affirmation of it should be admitted as a contradiction.\" However, the orthodox rule that limited the use of prior statements to impeachment, rather than as substantive evidence, resulted in a reluctance of courts to admit prior statements based on lack of recollection for fear that juries would necessarily view the uncontradicted prior statement as evidence of the facts contained therein. Ibid. See also 4 Jack B. Weinstein \u0026 Margaret A. Berger, Weinstein's Evidence P 801-132 (1988) (observing that when witness lacks recollection of both prior statement and events in statement, if prior statement is introduced, limited cross-examination effectively makes prior statement single version of events). Nonetheless, because \"the unwilling witness often takes refuge in a failure to remember, * * * [a]n absolute rule of prohibition would do more harm than good, and the trial court should have discretion.\" Wigmore on Evidence, supra, § 1043.\n\nAs noted, New Jersey has abandoned the orthodox rule, and expressly permits a party to introduce its witness's prior inconsistent statement as substantive evidence. That approach allows the Jury to believe the version of events contained in the prior statement over the version presented by the witness at trial -- even when the witness's lack of recollection suggests that the events and statement never occurred. Thus, we agree that a feigned lack of recollection is an inconsistency on which the admission of a witness's prior inconsistent statement may be based.\n\nFurthermore, although we recognize that a witness's feigned lack of recollection may sharply limit or nullify the value of cross-examination, we agree with the United States Supreme Court's analysis in Owens, supra, 484 U.S. at 557-61, 108 S. Ct. at 841-43, 98 L. Ed. 2d at 956-59, and conclude that those limitations do not rise to the level of denying a defendant's federal and state constitutional right to confront witnesses. See, U.S. Const. amend VI; N.J. Const. art. I, P 10. In Owens, supra, the victim of a severe beating that resulted in a fractured skull had given a statement to police in the hospital shortly after the beating in which he identified the defendant as his assailant. At trial, the victim testified that he remembered identifying defendant to the police while in the hospital. However, on cross-examination, the victim admitted that he no longer could recall the attack sufficiently to identify his assailants and, except for when he made his statement to police, could not remember who had visited him during his subsequent hospital stay. That lack of recollection frustrated the defendant's efforts to cross-examine the victim on statements in which he allegedly had implicated someone other than the defendant for the assault.\n\nThe Court upheld defendant's conviction against claims that evidence of the prior identification violated the federal hearsay rule, permitting admission of a witness's prior identifications if the witness testifies at trial and is subject to cross-examination, see Fed. R. Evid. 801(d)(1)(C), and the Sixth Amendment's Confrontation Clause. The Court determined that the case \"squarely presented\" an issue that the Court had reserved in California v Green, 399 U.S. 149, 90 S. Ct. 1930, 26 L. Ed. 2d 489 (1970): whether a witness's loss of memory concerning events described in a prior statement that is admitted into evidence \"so affect[s] the petitioner's right to cross-examine as to violate the Confrontation Clause.\" 484 U.S. at 558, 108 S. Ct. at 841, 98 L. Ed. 2d at 957 (citing Green, supra, 399 U.S. at 168-69, 90 S. Ct. at 1940-41, 26 L. Ed. 2d at 502-03). The Court's Conclusion was that the Confrontation Clause guaranteed only \"'\"an opportunity for effective cross-examination, not cross-examination that is effective in whatever way, and\n\nto whatever extent, the defense might wish.\"'\" Id. at 559, 108 S. Ct. at 842, 98 L. Ed. 2d at 957 (quoting Kentucky v. Stincer, 482 U.S. 730, 739, 107 S. Ct. 2658, 2664, 96 L. Ed. 2d 631, 643 (1987) (quoting Delaware v. Fensterer, 474 U.S. 15, 20, 106 S. Ct. 292, 294, 88 L. Ed. 2d 15, 19 (1985))). The Court explained that the opportunity to cross-examine a defendant on issues such as the witness's perception, bias, and physical infirmities was all that the Sixth Amendment provided. Although that opportunity did not insure \"success,\" the Court observed, \"successful cross-examination is not the constitutional guarantee.\" Id. at 560, 108 S. Ct. at 843, 98 L. Ed. 2d at 958. Furthermore, we observe that in Owen the Court cited with approval Justice Harlan's concurrence in Green, supra, in which he stated\n\nthat he would have reached the issue of the out-of-court statement, and would have held that a witness's inability to \"recall either the underlying events that are the subject of an extra-Judicial statement or previous testimony or recollect the circumstances under which the statement was given, does not have Sixth Amendment consequence.\"\n\n[Id. at 558, 108 S. Ct. at 842, 98 L. Ed. 2d at 957 (quoting Green, supra, 399 U.S. at 188, 90 S. Ct. at 1951, 26 L. Ed. 2d at 514) (emphasis added).]\n\nWe also conclude that the constitutional confrontation guarantees are not violated by a witness's lack of recollection regarding an introduced prior statement or the events described in such a statement. The finding of feigned recollection is essentially a finding by the court that the witness is lying about the statement and about the contents of the statement. That the lie is in the form of a loss of memory rather than an outright denial that the events occurred is not of constitutional significance for the purpose of cross-examination. One objective of the New Jersey exception to the hearsay rule for prior inconsistent statements is to expose to the jury the possibility that the witness is lying, and to give the jury an alternative account of the events that it may choose to use as substantive evidence rather than the account offered by the witness. The jury, however, must observe the witness and make a decision about which account is true.\n\nWe question whether defendant would have had a significantly-enhanced opportunity to cross-examine Lesando and Merlo if they\n\nhad simply denied that they had made the statements or had spoken to defendant about the murders. In that event, defendant would have been left to the same means of discrediting the statements that he used at trial: suggesting that Lesando and Merlo had spoken with others about the murder, had had contact with Coleen Alexander, had read the accounts in the newspaper, or had made up the statements to benefit them in the Disposition of their own criminal cases.\n\nThat Lesando's and Merlo's statements were admitted on the basis of feigned lack of recollection did not necessarily cause a less effective cross-examination. Defendant elicited testimony concerning Lesando's erratic state of mind and his drug use at the time he gave the statement to police. Lesando testified that the officials from the prosecutor's office had not inquired about his state of mind on the day he gave the statements. He expressed doubt that he would have been placed back in a cell with defendant had he in fact given such a statement. Defense counsel also was able to explore whether Lesando had read newspaper accounts of the crime; whether he had had contact with Coleen Alexander in prison; and whether Lesando knew Robert Lohman, the person that defendant had originally claimed to be the killer. Defense counsel also elicited testimony from Lesando about his mental state at the time of the alleged statement, and suggested that in other conversations with Lesando defendant had implicated Alexander as the killer. Finally, defense counsel elicited testimony about Lesando's exposure to prosecution for recently-committed crimes.\n\nAdmittedly, Merlo's cross-examination was less revealing. He essentially stated he had no recollection regarding the events at that time. Nonetheless, defense counsel established that Merlo had received a favorable plea bargain and favorable sentencing shortly after having given his statement to police.\n\nWe conclude that the trial court did not err in admitting the prior inconsistent statements of Merlo and Lesando. The court correctly concluded that under the circumstances, the prior statements\n\nmade by both witnesses to police concerning conversations that they had had with defendant were inconsistent with the witnesses' feigned lack of recall regarding those statements and conversations. Thus, the decision to admit those statements, in accordance with the guidelines set forth in Gross, supra, 121 N.J. at 10, was proper. Finally, we hold that the admission of those statements, in the context of the witnesses' unwillingness to testify truthfully about them, did not deprive defendant of his constitutional right to be confronted by the witnesses against him.\n\nE. Instruction Regarding Alexander's Plea Bargain\n\nDefendant contends that the court should have instructed the Jury that although Alexander's plea agreement was conditioned on her truthful testimony, the fact that the State had not withdrawn her agreement did not constitute an implicit endorsement of her veracity. We find no merit in defendant's claim. Testimony regarding the requirement in the plea agreement that Alexander testify truthfully was elicited by both the prosecution and defense. However, the prosecutor never suggested that the promise of truthful testimony contained in the plea agreement provided any assurance that Alexander's testimony was truthful. Furthermore, the trial court specifically instructed the jury that it had to give \"careful scrutiny\" to Alexander's testimony because of the possibility that it was influenced by the prospect of beneficial treatment. Defense counsel did not request the instruction that defendant now claims was necessary.\n\nConsidering the lack of attention during this lengthy trial to the pledge of truth contained in the agreement, we question whether the court would have acted properly in bringing to the jury's attention prior to deliberation, without request from defense counsel, the existence of the pledge and the fact that the plea agreement had not been withdrawn -- and then instructing the jury that it should disregard that fact. Such an instruction could have been\n\nmore damaging to defendant than any harm caused by the court's failure to so instruct the jury.\n\nF. Challenges to Voir Dire\n\nDefendant challenges the adequacy of the voir dire in respect of death qualification. Essentially, defendant argues that the inadequate questioning of several prospective jurors may have resulted in the seating of jurors who would have automatically voted for the death penalty, because not enough information was elicited regarding their views for the court or defense counsel properly to assess their death qualification. See Biegenwald, supra, 126 N.J. at 32 (noting that exhaustion of peremptory challenges is not prerequisite to claim of prejudice based on inadequate voir dire).\n\nBecause we reverse defendant's death sentence on other grounds, an extended examination of this voir dire is not required. We have addressed at length the special concerns and requirements regarding voir dire in death-penalty cases, and have applied those principles to the jury selection issues raised in those cases. See, e.g., State v. DiFrisco, 137 N.J. 434, 459-73 (1994); Martini, supra, 131 N.J. at 207-21; State v. Hunt, 115 N.J. 330, 347-64 (1989); State v. Williams, 113 N.J. 393, 408-45 (1988). We have observed that the voir dire must be open-ended, thorough, and searching, sensitive to attorney participation, and \"designed to elicit a 'potential juror's views, biases, and inclinations.'\" State v. Erazo, 126 N.J. 112, 128-29 (1991) (quoting Biegenwald, supra, 126 N.J. at 39). We note the trial court's efforts to conduct a probing voir dire. The court had the jurors fill out a questionnaire on topics relevant to the circumstances of the case and to the death penalty. The court then explained to each Juror the general procedural principles involved in a capital case, notably bifurcation\n\nof the guilt and penalty phases. Subsequently, the court examined each Juror on specific areas of concern raised by answers in the questionnaire, and then asked questions concerning the juror's views on the death penalty, including an open-ended question on the juror's general views. Both the prosector and defense counsel were then freely permitted to question each Juror further regarding the death penalty or any other area of concern.\n\nIn assessing the adequacy of voir dire, a reviewing court must examine the overall effectiveness of the jury-selection process. See State v. Dixon, 125 N.J. 223, 243-48 (1991); Ramseur, supra, 106 N.J. at 257. That certain questions of the court typically required only simple \"yes\" or \"no\" responses is perhaps unavoidable. The substantive and procedural aspects of a capital case are highly complex, and assessment of a Juror's ability to adhere to those requirements will sometimes call for a limited use of close-ended questions that suggest a preferred response. Without undertaking a specific review of each Juror's questioning, we are satisfied that the trial court conducted a generally adequate voir dire that fairly elicited the views of prospective Jurors on their attitudes concerning the death penalty. In the event of re-trial, we expect that the court will conduct the voir dire in accordance with the principles articulated in our past cases. The court on retrial should also take into account the specific aspects of the original voir dire that were considered deficient by our Dissenting colleague. Post at -- (slip op. at 16-19).\n\nG. Applicability of Aggravating Factor c(4)(g)\n\nIn McDougald, supra, 120 N.J. 523, the defendant was charged with murdering the parents of his girlfriend. The State relied on the felony-murder aggravating factor, N.J.S.A. 2C:11-3c(4)(g), on the theory that the defendant had murdered the parents in the course of a burglary. The burglary allegation was based on the defendant's having entered the parents' home with the intent of murdering their daughter. Defendant\n\nclaimed that the evidence at trial supported the Conclusion that the burglary had been for the purpose of committing the murder of the daughter and her parents, and argued that the c(4)(g) aggravating factor would not be appropriate because the burglary would have been incidental to commission of the murders rather than a separate felony in the course of which the defendant committed the murders.\n\nBecause we reversed defendant's death sentence on other grounds, we dealt only briefly with that claim. We observed that the evidence supported alternative theories that either the defendant had entered the house solely to kill the daughter, and only afterwards had decided to kill the parents; or that the defendant had \"planned to kill [the daughter] and her parents from the very beginning, so that he did not murder [the parents] in the course of trying to murder [the daughter].\" Id. at 569-70. We noted that although the evidence was sufficient to submit the factor to the Jury at a penalty-phase rehearing, the court should carefully instruct the jury on the independent relationship that must exist between the murders and the felony to support the c(4)(g) factor. Id. at 570.\n\nBased on our language in McDougald, particularly the observation that the defendant may have intended to kill all the victims \"from the very beginning,\" defendant claims that because the State's theory of the case was that defendant and Alexander had planned originally to kill both Skov and Bell, the court should not have submitted the c(4)(g) aggravating factor to the Jury, or at least should have instructed the Jury that that factor did not apply if the jury found that both killings had been intended from the outset. The State counters that the meaning of the language in McDougald is properly understood only if read in the context of the argument that the defendant in McDougald advanced.\n\nWe agree with the State's position. McDougald addressed a situation in which the felony on which the c(4)(g) aggravating factor was based arguably had been a burglary committed to facilitate the commission of a murder. That that burglary could\n\nhave aggravated McDougald's culpability for the homicides is self-evident. The narrower issue that defendant raises is whether a murder that was planned before commission of the c(4)(g) felony can be considered a murder \"committed while the defendant was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit murder, robbery, sexual assault, arson, burglary or kidnapping\" as required by N.J.S.A. 2C:11-3c(4)(g). Defendant essentially argues that the c(4)(g) factor requires that the intent to commit the murder be formed while the commission, attempt to commit, or flight from the underlying felony is in progress.\n\nWe find no support for defendant's argument, either in logic or in our cases. In Moore, supra, 122 N.J. 420, we addressed arguments concerning the relevance to the c(4)(g) factor of the sequence of the killing and the underlying felony. In that case the defendant faced the death penalty for each of two murders, and each murder was the underlying felony that aggravated the other. The defendant argued, \"You either kill A in the course of killing B or kill B in the course of killing A,\" but not both. Id. at 470-71 (emphasis added). We observed, \"Contrary to defendant's assertions, the statute does not rely on the temporal sequence of the murders to determine application of [the c(4)(g)] aggravating factor. The factor applies to murders committed before, during, or after the commission of a felony * * *.\" Id. at 471. We determined that the c(4)(g) aggravating factor reflects a \"qualitative judgment\" that a murder \"is worse\" when it is committed \"at the same time\" as another murder, or other serious felony. Ibid. Justice Handler, in a separate opinion, contended that the \"fundamental argument\" was that the murder to which the c(4)(g) factor was being applied had to have been the probable consequence of the other felony, analogous to the requirements of the offense of felony-murder, see Martin, supra, 119 N.J. at 25-27, from which the c(4)(g) factor had been derived. Moore, supra, 122 N.J. at 506-07 (Handler, J., Concurring in part and Dissenting in part).\n\nDefendant's argument is one step removed from either of the issues discussed in Moore. In Moore, the defendant's claim was based on the premise that the c(4)(g) factor should not apply where the killing occurred prior to commission of the underlying felony. Defendant essentially argues that the c(4)(g) factor should not apply where the intent to kill is formed prior to commission of the underlying felony. We reject defendant's contention. In our view, the Legislature's adoption of the c(4)(g) factor reflected its considered judgment that murders committed in the course of a felony are more blameworthy than other murders, irrespective of whether the intent to commit the murder was formed before, during, or after commission of the felony. We find no error in the trial court's decision to submit the c(4)(g) factor to the jury.\n\nH. Challenges to Notice and Instructions on Aggravating Factors\n\n1. Defendant challenges the State's notice of aggravating factors, which simply recited the general statutory language for the c(4)(f) and c(4)(g) aggravating factors, and applied that language generally to the murders charged in the indictment. Thus, the notice did not specify which factor or factors the State would seek to prove in respect of each murder. Defendant claims that the notice failed adequately to inform him of the State's intent. See Rule 3:13-4(a).\n\nWe find defendant's claim of unfairness to be meritless. Defense counsel received the notice of aggravating factors in June 1991 -- almost one-and-a-half years before the trial commenced. The purpose of the notice is to enable defense counsel to prepare a defense and presumably to give counsel sufficient opportunity to seek clarification if the need arises, an opportunity that clearly was available in this case. We also agree with the trial court that a fair reading of the notice indicated that the State intended to prove both factors in respect of each murder.\n\nNonetheless, a more specific notice of factors could have been provided, specifying the application of the factors to each murder\n\nas well as the underlying felonies on which the State intended to base those factors. That practice should be followed in the future. Cf. Dixon, supra, 125 N.J. at 264 (criticizing lack of notice regarding underlying felony for c(4)(f) factor resulting from prosecutor's assertion of one felony as basis for aggravating factor at pretrial proceedings and assertion of different felony as basis in closing argument).\n\n2. Defendant alleges various errors in the trial court's instruction to the jury describing the elements of the aggravating factor and in the verdict sheet's description of the c(4)(g) aggravating factor as applied to Alice Skov. The alleged error on the verdict sheet concerned a failure to specify that only John Bell's murder could be used as an underlying felony to aggravate Alice Skov's murder. In the event of retrial, the verdict sheet should be clarified in that respect.\n\nWe address defendant's concern that the court's use of the phrase \"and/or\" was improper because it permitted the jury to be divided on which felony was the basis for finding an aggravating factor, and thus violated the statutory requirement of unanimity for findings of aggravating factors. For example, in respect of the murder of Alice Skov, the court instructed the jury as follows on the elements of the c(4)(f) and c(4)(g) factors, respectively:\n\n[c(4)(f):] The murder of Alice Skov was committed for the purpose of escaping trial, punishment or confinement for another offense committed by [defendant]. That is for the robbery and/or murder of John Donald Bell and/or the robbery of Alice Skov.\n\n[c(4)(g):] The offense as to Alice Skov was committed while [defendant] was engaged in the commission of, or an attempt to commit or flight after committing or attempting robbery and/or murder of John Donald Bell and/or robbery of Alice Skov.\n\nAccording to defendant's argument, the possibility existed, for example, that some jurors could have found the c(4)(f) factor because they believed the defendant had committed the murder of Alice Skov for the purpose of escaping detection for the murder of John Bell, while others could have found the c(4)(f) factor because\n\nthey believed defendant had killed Alice Skov to escape detection for the robbery of Alice Skov.\n\nFirst, we think that the jury's unanimous verdicts in the guilt phase that defendant was guilty of robbery and murder regarding each victim makes remote at best the possibility that the jurors disagreed on the underlying felony that supported each aggravating factor. Although one could conceive of an instance in which the alternative underlying felonies would be sufficiently distinct in occurrence to lead jurors to disagree about whether the defendant had killed to escape detection for one as opposed to the other, that is not this case. The parties did not dispute that the murders and robberies essentially were contemporaneous events, with the murder of Bell preceding the murder of Skov. That a juror could believe, therefore, that defendant murdered Skov to escape detection for the robbery, but not to escape detection for the murder of Bell, seems implausible.\n\nHere, defendant does not allege that one of the potential bases for the c(4)(f) aggravating factor was invalid. Furthermore, we find that this is not a situation that involves \"a genuine possibility of jury confusion or that a conviction may occur as the result of different jurors concluding that the defendant committed different acts.\" United States v. Echeverry, 719 F.2d 974, 975 (9th Cir. 1983), cited in Parker, supra, 124 N.J. at 636 (emphasis added). Accordingly, we do not find plain error in the court's failure to have given a charge that unanimity was required regarding the specific underlying felony that supported the aggravating factors.\n\nNonetheless, we emphasize that a jury finding that an aggravating factor exists must be based on a unanimous agreement regarding the specific underlying felony on which that finding is based. That Conclusion is compelled by the central role that findings of aggravating factors play in the penalty-phase verdict. Thus, in the event of retrial, the court should provide instructions and a verdict sheet that ensure that the jury's findings\n\nof aggravating factors are based on unanimous agreement regarding the underlying felony.\n\nDefendant also argues that the court should have specifically instructed the jury that in respect of the c(4)(f) factor, it had to determine that the underlying felonies had been committed prior to or contemporaneous with the applicable murder. Defendant cites State v. Hightower, 120 N.J. 378, 420 (1990), to support that position. In Hightower, we addressed a situation in which the defendant claimed that the c(4)(f) factor could be supported only by \"'prior offenses and not contemporaneous ones.'\" Ibid. We decided only that the c(4)(f) factor could not be construed so narrowly. Indeed, our Discussion of that issue did not endorse a limit on the acceptable temporal sequence of the underlying felony and the murder. The only limitation that we noted in Hightower was that the defendant's subsequent efforts to conceal the murder did not support the aggravating factor. Id. at 422. On this record, no question exists that all of the felonies submitted in support of the aggravating factor were committed at a time sufficiently close to the murder of Alice Skov to support the c(4)(f) factor.\n\nI. Consideration of Alexander's Sentence as Mitigating Factor\n\nDefendant contends that the court should have instructed the jury that it could consider as a mitigating factor the fact that Alexander had received a prison sentence. Defendant acknowledges that our decision in Gerald, supra, 113 N.J. 40, addressed and rejected that claim. Defendant asserts that the United States Supreme Court's decision in Parker v. Dugger, 498 U.S. 308, 111 S. Ct. 731, 112 L. Ed. 2d 812 (1991), requires that a jury in a capital case be permitted to consider the sentence of a defendant's confederate in mitigation of the death penalty.\n\nIn Gerald, we addressed whether a jury could consider the sentences of co-defendants as mitigating evidence under the \"catch-all\" factor, N.J.S.A. 2C:11-3c(5)(h). We first noted that at the time of the defendant's penalty-phase trial, his co-defendants\n\nhad not yet been sentenced but had entered pleas concerning which the State had agreed to recommend prison sentences. We observed that because a court would not have been bound by such a recommendation, the term of the co-defendants' sentences had not been established when the jury deliberated on the defendant's sentence. 113 N.J. at 101-02.\n\nMore significantly, we determined that the language of the c(5)(h) factor, although broad, was not limitless in scope. Id. at 103. It permits the jury to consider in mitigation \"any other factor which is relevant to the defendant's character or record or to the circumstances of the offense.\" N.J.S.A. 2C:11-3c(5)(h). That language reflected a constitutional requirement set forth by the United States Supreme Court that the sentencer in a capital case be allowed to consider as mitigating evidence \"'any aspect of a defendant's character or record and * * * any of the circumstances of the offense * * *.'\" Gerald, supra, 113 N.J. at 103 (quoting Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 2965, 57 L. Ed. 2d 973, 990 (1978) (plurality holding)); see also Woodson v. North Carolina, 428 U.S. 280, 303-05, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 960-61 (1976) (plurality opinion) (recognizing Eighth Amendment required consideration of defendant's record and character and circumstances of offense). We observed that the Supreme Court had not expanded that requirement to include evidence unrelated to a defendant's record or character, or to the circumstances of the offense. See Gerald, supra, 113 N.J. at 103 (citing Lockett, supra, 438 U.S. at 608, 98 S. Ct. at 2996, 57 L. Ed. 2d at 992 (plurality holding)); Franklin v. Lynaugh, 487 U.S. 164, 172-74, 108 S. Ct. 2320, 2326-27, 101 L. Ed. 2d 155, 165-66 (1988) (majority holding)).\n\nWe concluded that a codefendant's sentence does not fall within the scope of evidence that a death-penalty jury was permitted to consider. Such evidence is clearly not \"relevant to the defendant's character or record.\" Gerald, supra, 113 N.J. at 103. Furthermore, we determined that the phrase \"circumstances of the offense\" refers to \"the circumstances surrounding the\n\ncommission of the crime itself\" and not to the sentence that co-defendants later receive, which are based on considerations \"peculiar to those co-defendants.\" Id. at 104.\n\nWe recently re-affirmed that holding in DiFrisco, supra , 137 N.J. at 502-06. In that case, the defendant was convicted of carrying out a contract killing. The State had not prosecuted the person who hired the defendant to commit the murder. The trial court denied the defendant's request to permit the jury to consider that failure to prosecute as a mitigating factor under the c(5)(h) catch-all factor. We rejected the defendant's claim, which was based in part on the Supreme Court decision in Parker, supra, 498 U.S. 308, 111 S. Ct. 731, 112 L. Ed. 2d 812, observing that the Supreme Court's decision in Parker had no bearing on our holding in Gerald. Difrisco, supra, 137 N.J. at 504-06. In Parker, the Florida Supreme Court had determined that two of the aggravating circumstances on which a defendant's death sentence was based were not supported by the evidence. Nevertheless, that court affirmed the death sentence because it concluded that the trial court had not found the existence of any mitigating circumstances. 498 S. Ct. at 317-18, 111 S. Ct. at 734, 112 L. Ed. 2d at 820. However, under Florida law, the trial court could have found the existence of nonstatutory mitigating factors without including such findings in its sentencing order. Id. at 317-18, 111 S. Ct. at 737-38, 112 L. Ed. 2d at 823-24. The record of the sentencing hearing demonstrated that the defendant had presented evidence that his accomplices had received only prison sentences, a permissible nonstatutory mitigating factor under Florida law. Id. at 314-16, 111 S. Ct. at 736-37, 112 L. Ed. 2d at 822-23. The record also reflected that both the advisory jury and the trial court that imposed the sentence had found the existence of some mitigating circumstances. Id. at 315-17, 111 S. Ct. at 736-37, 112 L. Ed. 2d at 822-23. Thus, the Supreme Court determined, the Florida Supreme Court had erred in concluding that the trial court had not found any mitigating factors and that its harmless error analysis regarding the stricken\n\naggravating factors was therefore flawed. Id. at 318-23, 111 S. Ct. at 738-40, 112 L. Ed. 2d at 824-27.\n\nParker does not require us to reconsider our holding in Gerald that accomplice sentencing may not be considered as a mitigating factor in penalty-phase hearings under New Jersey's death-penalty statute. The Supreme Court decided only that the failure of the Florida Supreme Court to credit the trial court's finding of mitigating circumstances had deprived the defendant in that case of his Eighth Amendment right to individualized sentencing. The Court did not hold that consideration of an accomplice's sentence as a mitigating factor is constitutionally compelled.\n\nJ. Prosecutor's Improper Comments at Penalty Phase\n\nDuring closing arguments at the penalty-phase hearing, the Prosecutor repeatedly referred to the special harm that each aggravating factor addressed as \"the evil\" that the factor addressed, and also urged the jury to address that evil. Defendant contends that that phrase had the potential to suggest to the jury that it impose the death penalty to remedy a societal evil, rather than because the evidence proved that it was the appropriate sentence for defendant under the circumstances of the offense.\n\nOur cases make clear that a prosecutor's invitations to the jury to decide guilt or sentencing on the basis of societal duty are unacceptable in a death-penalty proceeding. See, e.g., State v. Pennington, 119 N.J. 547, 575-76 (1990) (holding improper suggestions to jury during guilt and penalty phases that its \"oath\" requires it to convict); State v. Coyle, 119 N.J. 194, 230-31 (1990) (\"There is no room in a capital case for remarks that suggest 'the need to protect society from crime.'\" (quoting Ramseur, supra, 106 N.J. at 321)); Rose, supra, 112 N.J. at 520-21 (finding improper admonitions to jury to \"send a message\" to community, county, and state that \"law is in place\").\n\nOur review of the record reveals that in the context of the entire summation, the challenged statements were not excessively in\n\nflammatory. Although we are confident that those statements did not divert the jury from its duty to decide the case based on the evidence before it, if a retrial of the penalty phase occurs, the prosecutor should avoid any suggestion that the jury should determine defendant's sentence on the basis of the jury's societal obligations.\n\nK. Double-Counting of Evidence Supporting c(4)(f) and c(4)(g) Factors\n\nDefendant requests that the court reexamine its position, first set forth in Bey II, supra, 112 N.J. 123, that a jury may use the same evidence to support more than one aggravating factor. In that case we considered the question in the context of both the c(4)(g) aggravating factor and the c(4)(c) factor which generally addresses concerns regarding the brutality of the murder. We concluded:\n\nThe appropriate resolution is to allow the prosecution to use the same evidence in seeking to prove multiple aggravating factors, provided the trial court advises the jury that it should not simply compare the number of aggravating factors against the number of mitigating factors, that it is considering the same facts more than once, and that it should be cognizant that the same facts are being used to prove more than one aggravating factor. This result permits the jury to consider the evidence relevant to each aggravating factor, and should prevent it from giving undue weight to the number of factors when one aspect of the defendant's conduct supports multiple aggravating factors. §\n\n[Id. at 176.]\n\nWe further analyzed the issue in Rose, supra, in the context of the c(4)(f) factor, also present here, and the c(4)(h) factor, which concerns the killing of a public official. See 112 N.J. at 524-27. We adopted the general principle announced in Bey II and concluded that the trial court had committed reversible error by failing to instruct the jury that it \"not assign inordinate weight to the facts that support multiple factors.\" Id. at 527. We have maintained that position in cases involving use of the same evidence to support the c(4)(f) and c(4)(g) factors. See, e.g., McDougald, supra, 120 N.J. at 568-69; Hightower, supra, 120 N.J. at 422. We discern no\n\nbasis in defendant's contentions to depart from our prior resolution of that issue.\n\nL. Propriety of Consecutive Sentencing on Murder Convictions\n\nDefendant claims that the court's imposition of a consecutive sentence of life imprisonment with a thirty-year mandatory minimum for the murder of John Bell violated the sentencing guidelines that we set forth in State v. Yarbough, 100 N.J. 627, 643-44 (1985), cert. denied, 475 U.S. 1014, 106 S. Ct. 1193, 89 L. Ed. 2d 308 (1986). (Subsequent to defendant's sentence, the Legislature effectively eliminated the bar to consecutive sentences imposed by Yarbough. See L. 1993, c. 223.)\n\nGiven our reversal of defendant's death sentence for the murder of Alice Skov, and defendant's concession that the trial court improperly merged defendant's two convictions of first-degree armed robbery and his conviction for unlawful possession of a weapon with his felony-murder convictions, we remand the entire matter for resentencing. However, we perceive no bar to the imposition of consecutive sentences for the murders of Alice Skov and John Bell based on the principles of consecutive sentencing set forth in Yarbough, supra. See Moore (Marie), supra, 113 N.J. at 308-10 (concluding that sentences consecutive to death sentence totalling 224 years with 87-1/2-year mandatory minimum did not violate Yarbough, but noting that on remand for resentencing on murder conviction, \"more realistic sentence would be one that ensured that [defendant] would be ineligible for parole for the remainder of her life\").\n\nDefendant's assertion that such sentencing is improper because the murders and robberies were part of one criminal transaction has no support in our cases. Indeed, the case on which defendant relies, State v. Rogers, 124 N.J. 113 (1991), supports the opposite Conclusion. The shootings in Rogers were virtually simultaneous. During a tavern robbery, patrons were ordered to lie on the floor. When one of the patrons, an off-duty sheriff's officer, made a move toward his gun, the two perpetrators in the\n\nbar each opened fire, hitting that officer and another patron. Both the patrons died. Id. at 115. The defendant, who was not in the bar who had supplied the guns and driven the getaway car, received two consecutive thirty-year mandatory terms on two convictions for felony murder. Id. at 115-16. The Appellate Division determined that the consecutive sentences were contrary to Yarbough, and suggested that on remand the court consider imposition of sentences that were part concurrent and part consecutive. Id. at 116 (quoting 236 N.J. Super. 378, 381 (1989)). We disagreed with both those Conclusions. We first determined that the Code of Criminal Justice (Code) did not permit partially-concurrent and -consecutive sentences. Id. at 116-19. Furthermore, we \"disagreed with the Appellate Division's determination that 'the sentence imposed, two consecutive 30-year terms of imprisonment without parole, is contrary to [Yarbough ] guideline 5,'\" which suggested a shorter second term when consecutive terms were imposed for the same offense. Id. at 119 (quoting 236 N.J. Super. at 382). We noted that that guideline could not apply in cases in which sentences were mandated by the Code. Id. at 119-20. That result clearly assumes that consecutive sentencing for multiple murders that occur in close sequence is not improper.\n\nM. Merger of Defendant's Other Convictions\n\nThe State contends that the court erred in merging defendant's convictions for the first-degree armed robbery of Alice Skov and the first-degree armed robbery of John Bell, pursuant to N.J.S.A. 2C:15-1a(3), and unlawful possession of a weapon, N.J.S.A. 2C:39-5c(2), with his felony-murder convictions, which in turn had been merged with the purposeful and knowing murder convictions. The State claims that those were conceptually distinct offenses and that their merger was contrary to the weight of judicial authority. Defendant concedes the State's claim, and we agree.\n\nWe follow a \"flexible approach\" in merger issues that \"requires us to focus on 'the elements of the crimes and the Legislature's intent in creating them,' and on 'the specific facts of each case.' \" State v. Cole, 120 N.J. 321, 327 (1990) (quoting State v. Miller, 108 N.J. 112, 116-17 (1987)). The overall principle guiding merger analysis is that a defendant who has committed one offense \"'cannot be punished as if for two.'\" Miller, supra, 108 N.J. at 116 (quoting State v. Davis, 68 N.J. 69, 77 (1975)). Convictions for lesser-included offenses, offenses that are a necessary component of the commission of another offense, or offenses that merely offer an alternative basis for punishing the same criminal conduct will merge.\n\nApplying those principles here, the merit of the State's position is clear. Once defendant had been convicted of purposeful and knowing murder for the criminal homicide of each victim, his conviction for felony murder became \"surplusage\" because that offense imposes criminal liability for the homicide committed in the course of a felony in the event that intent for the homicide cannot be proved. See State v. Stenson, 174 N.J. Super. 402, 406-07 (Law Div. 1980), aff'd, 188 N.J. Super. 361 (App. Div. 1982), certif. denied, 93 N.J. 268 (1983). Furthermore, because defendant's felony-murder convictions merge into his convictions for purposeful and knowing murder, the armed-robbery convictions do not merge because proof of the armed-robbery offenses is not necessary to sustain defendant's convictions for purposeful and knowing murder. See State v. Russo, 243 N.J. Super. 383, 411 (App. Div. 1990), certif. denied, 126 N.J. 322 (1991).\n\nIn respect of the convictions for first-degree robbery and unlawful possession of the rifle, we note that merger might have been appropriate had defendant been convicted of first-degree robbery solely on the basis of counts seven and eight of the indictment, which alleged that defendant had committed a theft while inflicting bodily injury with a deadly weapon, contrary to\n\nN.J.S.A. 2C:15-1a(1), b. Compare State v. Best, 70 N.J. 56, 61-68 (1976) (holding that possession-of-dangerous-weapon charge merges with robbery charge) with Russo, supra, 243 N.J. Super. at 411-12 (holding that charge of possession of weapon for unlawful purpose does not merge with other offenses because defendant had unlawful purpose in mind apart from those offenses). However, defendant was also convicted of first-degree armed robbery on the basis of counts nine and ten of the indictment, which alleged that he had committed the theft from the victims while committing a crime of the first degree, namely the murders. See N.J.S.A. 2C:15-1a(3), b. Conceptually, the possession of the weapon was not a requirement for the robbery conviction. Cf. State v. Mirault, 92 N.J. 492 (1983) (holding that aggravated-assault conviction merged with first-degree robbery charge where assault had elevated theft to robbery). Furthermore, because \"the essence of the offense\" of unlawful possession of a weapon pursuant to N.J.S.A. 2C:39-5 \"is possession of the weapon without a permit, * * * it will rarely merge with a conviction for a substantive offense committed with the weapon * * * .\" Cannel, New Jersey Criminal Code Annotated, comment 5 on N.J.S.A. 2C:39-5 (1994).\n\nOn remand, the trial court is directed to resentence defendant in accordance with the foregoing principles.\n\nN. Constitutionality of New Jersey Death Penalty Act\n\nDefendant maintains that the New Jersey death-penalty statute, N.J.S.A. 2C:11-3c to -3f, violates both federal and State constitutional protections against cruel and unusual punishment. See U.S. Const. amends VIII, XIV; N.J. Const. art. I, P 12. This Court has consistently upheld the constitutionality of New Jersey's death-penalty statute, most recently in DiFrisco, supra, 137 N.J. at 508. Defendant presents no new arguments that impel us to reconsider that issue. See, e.g., State v. Marshall, 123 N.J. 1, 169 (1991); Ramseur, supra, 106 N.J. at 166-97.\n\nIV\n\nWe affirm defendant's convictions for murder, felony-murder, robbery, weapon-possession, and conspiracy, as well as defendant's life sentence with thirty-years parole ineligibility for the murder of John Bell. We reverse the death sentence imposed for the murder of Alice Skov. We remand the matter to the trial court for further proceedings consistent with our Disposition.\n\nChief Justice Wilentz and Justices Clifford and Pollock join in this opinion. Justice Handler has filed a separate opinion Concurring in part and Dissenting in part. Justice O'Hern has filed a separate Dissenting opinion in which Justice Garibaldi joins.\n\nHANDLER, J., Concurring and Dissenting.\n\nThis is a direct appeal from a conviction for capital murder and a sentence of death. A Warren County jury convicted defendant, Bobby Lee Brown, of the knowing and purposeful murders of the aunt and uncle of his girlfriend, Coleen Alexander. The Court reverses defendant's death sentence because of the inaccuracy and inadequacy of the trial court's instructions with respect to whether the murders were committed \"by his own conduct.\" That finding is a specific requirement for murderers to be considered eligible for the death penalty. Defendant was convicted essentially on the testimony of his co-perpetrator and lover, Coleen Alexander.\n\nLittle doubt exists that either Brown or Alexander or both committed the murders by their own conduct. Yet, there could be, indeed perhaps ought to be, considerable doubt about which of them murdered by his or her own conduct. Because those charge errors have so serious an impact on precisely that evidentiary question, they compel a reversal of defendant's death sentence. In concur in that part of the Court's opinion.\n\nDefendant also raises other serious questions. Those include the sufficiency of the instructions on vicarious liability theories of murder, the adequacy of the death-qualification process during voir dire, the validity of the jury finding on the aggravating factors at the penalty trial, and the introduction of prejudicial and irrelevant bad-act evidence. On those issues the Court determines that the error does not require the reversal of defendant's conviction or sentence. Although other issues in the case are also troubling, I\n\ndisagree most strongly with the Court's Disposition of the foregoing issues and, therefore, Dissent.\n\nI\n\nThe Court today determines that a trial court commits reversible error in failing to instruct the jury, during the guilt phase of a capital trial, that an inability to agree unanimously on whether a defendant committed the murder by his or her own conduct, itself, \"constitutes a final verdict that results in the imposition of a sentence of imprisonment of at least a thirty-year mandatory term.\" Ante at (slip op. at 28). In reaching that Conclusion, the Court recognizes, ante at (slip op. at 26-27), the established distinction between elements of the crime of murder and particularized or special findings that are relevant only to the sentencing determination. See, e.g., State v. Gerald, 113 N.J. 40, 93 (1988). I write separately on this issue to explain more fully the principles that, I believe, demand the Conclusion reached by the Court.\n\nThe Court recognizes the existence of three distinct options that are available with respect to the own-conduct determination. First, a jury may unanimously agree that the defendant committed the murder by his or her own conduct. Second, a jury may unanimously agree that the defendant did not commit the murder by his or her own conduct. Third, the jury may fail to agree unanimously on that question. Ante at (slip op. at 28).\n\nBecause the jury has this third option, the Court must inform the jury of its existence. It is a fundamental principle of our capital jurisprudence that, if a jury has an option with respect to the determination of a particular issue, the jury must know that it has that option. See, e.g., State v. Ramseur, 106 N.J. 123, 311 (1987) (\"To hide from the jury the full range of its sentencing options . . . is to mock the goals of rationally and consistency required by modern death penalty jurisprudence.\"). We will not countenance the possibility that a jury might condemn a defendant to death without having carefully considered every\n\ncircumstance that might exempt the defendant from that penalty. Accordingly, the trial court in this case committed reversible error in failing to charge the jury that it had the option of returning a valid conviction of murder without having to reach unanimous agreement on the own-conduct issue, and, I would add, in failing to explain the significance of that kind of determination, namely, that the defendant would not in that event be eligible for the death penalty.\n\nThe Dissent denies that any third option exists with respect to the own-conduct determination. Post at (slip op. at 2). It reasons that the own-conduct factor constitutes an element of the crime of murder, such that a failure unanimously to agree on that factor results in a hung jury on the charge of murder. That view mischaracterizes the own-conduct factor. One knows an element of a crime by the circumstance that a failure of proof of the facts underlying an element requires an acquittal of the crime. A failure of proof of own-conduct, though, does not require and acquittal of murder.\n\nThis Court has characterized the own-conduct requirement not as the functional equivalent of an \"element\" of a crime but as \"merely a triggering device for the death-penalty phase of the trial.\" Gerald, supra, 113 N.J. at 99 (quoting State v. Moore, 207 N.J. Super. 561, 576 (Law Div. 1985)). In accepting that understanding of the own-conduct determination, the Court sensibly gives weight to the sentencing function of that determination -- its only function -- rather than to the happenstance of its location in the guilt phase of the capital trial. Although the jury makes its finding during its guilt-phase deliberations, the finding has no consequence for the defendant's liability for murder; a defendant can commit murder either by his or her own conduct, as an accomplice, or as a conspirator. Ante at (slip op. at 28).\n\nBecause a defendant can be convicted of murder even if the defendant did not commit the murder by his or her own conduct, as long as the defendant committed it as a co-conspirator or as an\n\naccomplice, we cannot say that the own-conduct determination involves an element of the crime of murder. The Legislature has, however, invested the own-conduct determination with profound implications for the penalty, by making ineligible for death those murderers who do not kill by their own conduct, except in narrow circumstances not here relevant. N.J.S.A. 2C:11-3c. The Court, recognizing that the own-conduct finding serves a function significant only to the penalty determination, properly applies penalty-determination principles. See Ramseur, supra, 106 N.J. at 443-45 (Handler, J., Dissenting) (recognizing that unique character of capital prosecutions requires uniquely \"scrupulous and exacting\" review). Among penalty-determination principles is the rule that a jury can permissibly fail to agree unanimously on the sentence without voiding the proceeding altogether. The Court decides today that the rule allowing a jury to return a nonunanimous sentencing verdict requires that the jury be permitted to return a nonunanimous verdict with respect to own-conduct. Ante at (slip op. at 37) (\"The procedural consequence of nonunanimity in the penalty phase is identical with the consequence of nonunanimity in the own-conduct determination . . .\") A failure to agree unanimously produces a life sentence.\n\nThe Dissent does not address the logic of the majority's position. Instead, it refers to the murder statute, N.J.S.A. 2C:11-3c, which identifies three classes of persons who, within the larger set of persons who commit purposeful or knowing murder under N.J.S.A. 2C:11-3a(1) and (2), can be eligible for capital prosecution. Post at (slip op. at 3). The Dissent seizes on the two classes of murderers other than own-conduct murderers who can be capitally prosecuted, and assumes that parallel third options of nonunanimity must exist for those classes.\n\nThe flaw in the Dissent's approach is its assumption that if the jury has a third option with respect to the own-conduct factor, it must also have a third option with respect to the other classes of murder that appear in the same statutory provision as the own-conduct factor. The majority, however, requires notification of\n\nthe third option of nonunanimity because the own-conduct issue is relevant to the capital sentencing determination and, in this case, is irrelevant to liability for murder. The same may or may not be true with respect to the other statutory classes of murder in a given case.\n\nThe Dissent also invests too much significance in the fact that the determination of the own-conduct issues occurs in the guilt phase of the capital trial. The Court recognizes that the formal boundary dividing the phases of a capital trial does not prevent events in the first phase from having a substantial effect in the later phase. See State v. Erazo, 126 N.J. 112, 133 (1991) (noting that evidence introduced at guilt phase of capital trial has inescapable impact on jury's deliberation in penalty phase). The procedural bifurcation of a capital trial into guilt and penalty phases does not and cannot create an impermeable wall between each phase of deliberation. Because the own-conduct determination bears only on the sentence, we must apply to that determination principles appropriate to its sentencing function.\n\nThe profound difference between the natures of the guilt and penalty determinations requires the application of different standards. The law of capital punishment in New Jersey is replete with examples of special statutory rules applied to the penalty determination. For example, this Court conducts a mandatory review of capital cases resulting in a death sentence. N.J.S.A. 2C:11-3e. In addition, the normal rules of evidence do not apply to a defendant's offer of mitigating information. N.J.S.A. 2C:11-3c(2)(b). The Court's interpretation of those rules is expansive. State v. Davis, 96 N.J. 611 (1984). A defendant is also accorded the privilege of presenting non-evidentiary information to the jury during the sentencing phase. State v. Zola, 112 N.J. 384 (1988). Different principles apply also to the jury's sentencing deliberations. For example, jurors need not unanimously agree on the existence of a mitigating factor in order to weigh the factor against any aggravating factors. State v. Bey, 112 N.J. 123, 159-61 (1988) (Bey II). Most important,\n\nthe normal prohibition on nonunanimous verdicts does not apply to the penalty determination itself, so that a jury's failure to agree on a sentence produces not a hung jury but rather a sentence of life imprisonment. N.J.S.A. 2C:11-3c(3)(c).\n\nToday, the Court again recognizes the need to apply special sentencing principles to a guilt-phase event that has significant sentencing implications: the determination of whether a defendant committed the murder by his or her own conduct. Thus, with respect to that determination, the majority understands that any finding involving the solemn choice between life or death requires the application of principles developed to govern the sentencing decision, even though the finding in question happens to occur during the guilt-phase deliberations.\n\nProper instructions on the manner of making the own-conduct finding are crucial here because of the state of the evidence in this case. The infirmities in the own-conduct instruction take effect precisely on this case's key factual dispute. A reasonable juror could have doubted that defendant pulled the trigger -- and that doubt alone would render defendant ineligible for the death penalty. Only Coleen Alexander's testimony places defendant's finger on the trigger. She was defendant's accomplice, and is an habitual liar. The errors peculiar to this case clearly impair defendant's fair chance of receiving the benefit of the lone, doubting juror. The evidence in this case is troubling. In no way is \"doubt\" impossible or irrational.\n\nII\n\nThe trial court's failure to instruct the jury properly with respect to its determination of the own-conduct requirement was exacerbated by its error in failing properly to instruct the jury on accomplice and co-conspirator liability. The trial court, in its original charge, failed to instruct the jury that defendant could be found guilty of murder if he conspired to commit the homicides, even if he did not commit the murder by his own conduct, and even if he was not an accomplice of the person who committed the\n\nhomicides. See N.J.S.A. 2C:2-6b(4). During deliberations, the jury asked the court to explain the difference between own-conduct liability and accomplice or co-conspirator liability. The court again failed to instruct the jury that defendant could be convicted of murder on the basis of co-conspirator liability and, further, neglected to re-define accomplice liability as well.\n\nThe court's failure to dispel the jury's confusion about two of the three possible theories of murder liability compounded the prejudice attributable to its erroneous instructions with respect to the own-conduct requirement. Curiously, the Court agrees that the trial court erred in omitting the instruction, but concludes that because of its reversal of defendant's death sentence on other grounds, it \"need not undertake a detailed analysis of whether the court's flawed instructions prejudiced defendant in respect of the own-conduct determination that triggered the penalty phase.\" Ante at (slip op. at 54). I Dissent from that Disposition of this issue.\n\nOmitting a proper charge on co-conspirator and accomplice liability accentuated the failure to give the third-option charge on the own-conduct factor. The omission prevented the jury from adequately considering the alternatives to the own-conduct theory, namely, accomplice or co-conspirator liability, and thus in effect subtly encouraged the jury to choose the only remaining theory, which rendered defendant death eligible. I fail to see how this Court can distinguish between these two instances of insufficient instructions, one affecting the own-conduct theory, the other affecting the vicarious theories, when each compounds the prejudice of the other. The effect of failing to instruct the jury that it could permissibly not agree on the own-conduct question bolstered a finding of own conduct by the jury, assuming the jury was convinced that defendant had committed some form of intentional homicide and felt also an understandable pressure to reach a verdict. Similarly, the failure adequately to instruct that the jury could convict defendant of murder under a conspiracy or accomplice theory indirectly encouraged a finding of own conduct.\n\nBelieving defendant guilty of purposely and knowingly killing the victims, the jury thus had only one clear path, that of own-conduct liability -- the death-eligible option -- as a means to convict defendant of murder.\n\nCorrect instructions are essential for a fair trial. State v. Rhett, 127 N.J. 3, 5 (1992); State v. Martin 119 N.J. 2, 15 (1990); State v. Concepcion, 111 N.J. 373, 379 (1988). Incorrect jury instructions are \"presumed to be prejudicial error,\" State v. Frederico, 103 N.J. 169, 176 (1986), and are considered to be \"poor candidates for rehabilitation under the harmless error philosophy.\" State v. Weeks, 107 N.J. 396, 410 (1987); State v. Simon, 79 N.J. 191, 206 (1979). The importance of a correct jury charge is enhanced in capital cases in light of the irreversibility of the penalty.\n\nThe record contains ample evidence, made clear by the trial court's decision to allow the jury to consider all three theories and acknowledged in the majority opinion, ante at (slip op. at 46-49), to support a conviction based on any of the three theories of liability. The insufficient charge prevented the jury from engaging in a balanced and full consideration of all of the possible theories of murder. The trial court's failure to address the obvious confusion of this jury renders wholly unreliable the jury's \"by his own conduct\" finding.\n\nWhen reasonable evidentiary support exists, a court must charge the jury on the elements of a lesser-included offense. Beck v. Alabama, 447 U.S. 625, 636-37, 100 S. Ct. 2382, 2388, 65 L. Ed. 2d 392, 401-02 (1980); State v. Saulnier, 63 N.J. 199, 206 (1973). When a jury is prevented from considering all available options, the jury, convinced that the defendant committed some crime, is tempted to lessen the State's burden to prove guilt beyond a reasonable doubt. See Keeble v. United States, 412 U.S. 205, 212-13, 93 S. Ct. 1993, 36 L. Ed. 2d 844 (1973).\n\nThe majority's suggestion that the botched charge could have \"benefited the defendant\" is especially puzzling, given the context\n\nof a capital trial. The Court quite soundly determines that reversible error exists in the failure to make the third-option charge with respect to the own-conduct theory of liability because own-conduct liability triggers the possibility that defendant will be sentenced to death. See Gerald, supra, 113 N.J. at 99. The peculiar vice in the omission of a proper charge on vicarious murder is the resultant failure to balance or counteract any inclination of the jury to find that defendant committed the crime by his own conduct, again making defendant eligible for death. That failure cannot be overlooked or minimized because it unacceptably increases the risk of an ultimate death sentence.\n\nI can conclude only that the incomplete charge on co-conspirator liability constitutes additional grounds for reversal because it deprived the jury of its ability to consider all its available options with respect to the manner in which the murders had been committed, thereby destroying the reliability of the verdicts as rendered.\n\nIII\n\nThe Court forgoes a significant opportunity to elaborate on what constitutes an adequate death qualification of a jury, and on the importance of the trial court's obligation to conduct a searching voir dire in capital cases. I cannot condone the Court's all too casual treatment of an obviously inadequate death qualification. The majority's review of the record is perfunctory and uncritically deferential rather than conscientious and searching. It fails to meet the standards for review of capital prosecutions exemplified by this Court in State v. Bey, 112 N.J. 45 (1988) (Bey I).\n\nDefendant argues that in instances involving six jurors, all of whom sat as either actual jurors or alternates, both defense counsel and the court failed to elicit information relevant to juror bias by making no effort to inquire further after receiving vapid responses to open-ended questions. The voir dire of jurors Margaret Dempsey and Christopher Gorzsas, both of whom sat on the\n\njury, are representative of the questioning conducted and responses elicited in the voir dire of those six jurors. During her death qualification, Ms. Dempsey responded vaguely to the court's open-ended questions.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Similar questioning of Mr. Gorzsas elicited similarly vague responses.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In Mr. Gorzsas' case, defense counsel did conduct some follow-up questioning. He asked one question related to Mr. Gorzsas' ability to set aside his finding regarding guilt when he moved into the penalty-trial stage. Mr. Gorzsas indicated that \"yes\" he could do that. No one questioned him further.\n\n\"Because adequate juror qualification is an imperative condition for a valid capital-murder prosecution, extraordinary importance attaches to the voir dire and death-qualification process.\" State v. Marshall, 123 N.J. 1, 220 (1991) (Marshall I) (Handler, J., Dissenting); State v. Perry, 124 N.J. 128, 188 (1991) (Handler, J., Concurring and Dissenting). The majority greatly misunderstands voir dire in characterizing it as a procedural operation. An adequate voir dire requires more than the rote recitation of formal procedures. Rather, adequacy is\n\nmeasured by the usefulness of the information elicited for guaranteeing juror impartiality and competency, and for providing counsel with grounds for the intelligent exercise of challenges. See State v. Biegenwald, 126 N.J. 1, 39 (1991) (Biegenwald IV).\n\nThe right to a fair and impartial jury is guaranteed under both the federal and state constitutions. U.S. Const. amends. VI, XIV; N.J. Const. art. 1, para. 10. Moreover, the protection afforded that fundamental right is heightened in capital cases. Ramseur, supra, 106 N.J. at 324 n. 84. Thus, the Court has imposed on trial courts the obligation \"to preserve the integrity of the jury and minimize the danger that prejudice will infiltrate the adjudicatory process * * *.\" State v. Williams, 93 N.J. 39, 63 (1983) (Williams I). Indeed, the voir dire is the most critical and important means of assuring jury impartiality. Id. at 68-69.\n\nAlthough we grant a degree of discretion to trial courts in the manner of conducting the death qualification of the jury, State v. Jackson, 43 N.J. 148, 160 (1964), cert. denied sub nom. Ravenell v. New Jersey, 379 U.S. 982, 85 S. Ct. 690, 13 L. Ed. 2d 572 (1965), we have recognized that \"an appellate tribunal is likewise under a duty to make an independent evaluation of the facts and circumstances and of the juror's voir dire examination.\" State v. Van Duyne, 43 N.J. 369, 386 (1964), cert. denied 380 U.S. 987, 85 S. Ct. 1359, 14 L. Ed. 2d 279 (1965). Today the Court fails to make such an evaluation, and thus, in effect, affirms the acceptability of open-ended questions evoking \"it depends\" responses followed by lengthy, leading \"yes or no\" questions.\n\nOn facts very similar to this case, the Court in Biegenwald IV found the death qualification insufficient and grounds for reversal because it offered no assurance of the jury impartiality necessary to a fair trial. In holding that such a voir dire process constituted reversible error, the Court stated:\n\nThe suggestion in the colloquy that there is a \"correct\" answer to the open-ended question \"what are your views on the death penalty\" is most troubling. Although\n\nsuch an open-ended question is undeniably a proper jumping-off point for death qualification, the vapid response \"it depends on the circumstances\" in no way reduces the need for additional probing of a venireperson's views on the appropriateness of the sentence of death. The purpose of voir dire is not to elicit from a potential juror the correct answer; it is to draw out the potential juror's views, biases, and inclinations and to provide both counsel and the court the opportunity to assess the venireperson's demeanor. We reiterate that voir dire should proceed with the conscious object of providing court and counsel alike with sufficient information with which to challenge potential jurors intelligently -- whether for cause or peremptorily.\n\n[126 N.J. at 39.]\n\nThe death qualification in this case bears marked resemblance to the voir dire at issue in Biegenwald IV. Here, as there, venirepersons gave moderately non-committal responses to the court's pro-forma questions about their views on the death penalty, and defense counsel failed to ask probing follow-up questions. In this case, neither the court nor counsel asked questions of the jurors likely to uncover whether the fact that defendant was accused of committing two murders would affect their deliberations. Additionally, they were not questioned about any effect the elderly status of the victims might have on their determination.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The examination simply did not inquire sufficiently \"into whether any juror could consider the mitigation evidence . . . [, effectively denying] counsel and the trial court the tools with which to insure that the jury panel could fairly undertake its role [at the penalty phase] in this case.\" Williams II, supra, 113 N.J. at 417.\n\nThe voir dire in this case exemplifies the minimalist approach that is emerging in our capital prosecutions. The Court, in ratifying this form of questioning and the hollow, \"it depends on the circumstances\" responses, institutionalizes a mode of voir dire that we condemned in Biegenwald IV. The Court thus endorses the acceptability of responses it had previously declared inadequate in the context of a capital case.\n\nThe majority seems to accept the proposition that the voir dire was sufficient because defense counsel participated in the questioning. Although the incorporation of defense counsel's questions into those asked by the court can help secure an adequately qualified jury, the mere fact that defense counsel asked questions does not establish the adequacy of voir dire. In the capital-murder context, the trial court bears a special responsibility to ensure an impartial jury, Biegenwald IV, supra, 126 N.J. at 42, and has an obligation \"to preserve the integrity of the jury and minimize the danger that prejudice will infiltrate the adjudicatory process.\" Williams I, supra, 93 N.J. at 63, 68-69.\n\nThe Court's duty to ensure that a capital defendant receives a trial by a properly qualified jury is overarching and nondelegable. It cannot be abandoned to defense counsel. We have stated: \"whatever lack of zealousness and vigor one might ascribe to defense counsel in no way diminishes our duty to ensure that defendant is sentenced by a fair and impartial jury.\" Biegenwald IV, 126 N.J. at 42.\n\nOnly a proper death qualification can assure the State and the defendant that the jury harbors no preconceived biases and can follow and apply the law in determining whether the defendant shall live or die. The failure to conduct an extensive, individualized death-qualification inquiry, notwithstanding defense counsel's failure to request it, negates that assurance. Just as a defendant has no right to decide whether he or she is tried for capital murder or sentenced to death, see, e.g., State v. Koedatich, 112 N.J. 225, 329-32 (1988), neither a defendant nor defense counsel has the prerogative to decide whether to death qualify a jury in capital cases. See Marshall I, supra, 123 N.J. at 224 (Handler, J., Dissenting).\n\nIn light of Biegenwald IV and our death penalty jurisprudence proclaiming the importance of effective death qualification, the voir dire in this case was clearly deficient. The touchstone of our decision in Biegenwald IV was that the jury may have included\n\nunqualified persons. Id. at 43. Here, we cannot possibly know the extent of the impairment of those six jurors, five of whom participated in the deliberation that resulted in defendant's death sentence. The gravity of the error inheres in the unreduced risk that defendant was condemned after a trial before an improperly qualified jury. The court's failure to conduct an adequate voir dire and to ensure a trial before a fair and impartial jury constitutes irremediable error, see Williams II, supra, 113 N.J. at 413; Marshall I, supra, 123 N.J. at 221 (Handler, J., Dissenting), and independent grounds for the reversal of the death sentence.\n\nIV\n\nIn this case, the prosecution sought to establish, and the jury found, two aggravating factors. The first is that \"the murder was committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by the defendant or another.\" N.J.S.A. 2C:11-3c(4)(f). The second is that \"the offense was committed while the defendant was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit, murder, robbery, sexual assault, arson, burglary or kidnapping.\" N.J.S.A. 2C:11-3c(4)(g).\n\nOn the verdict sheet submitted to the jury, the trial court presented the c(4)(g) aggravating factor for each victim in the following terms:\n\nThe murder was committed while the defendant was engaged in the commission of or an attempt to commit or flight after committing or attempting to commit murder and/or robbery. (emphasis added).\n\nThe verdict sheet presented the c(4)(f) factor for each victim as follows:\n\nThe murder was committed for the purpose of escaping detection, apprehension, trial, punishment or confinement for another offense committed by the defendant.\n\nThe verdict sheets clearly failed to communicate the fact that the jury had to agree unanimously on some particular underlying felony or offense in order to find those aggravating factors.\n\nThe trial court's instructions to the jury, also, did not communicate any need for the jury to reach a unanimous agreement on the specific felony underlying an aggravating factor in order to find that factor. Thus, with respect to Alice Skov, the trial court instructed the jury as follows on the c(4)(g) factor:\n\nthe offense as to Alice Skov was committed while [defendant] was engaged in the commission of, or an attempt to commit or flight after committing or attempting robbery and/or murder of John Donald Bell and/or robbery of Alice Skov. (emphasis added).\n\nThe trial court used identical \"and/or\" language for the felonies underlying the c(4)(f) factor.\n\nThe instruction on each aggravating factor is rendered ambiguous by the \"and/or\" term. The use of that term does not communicate that the jurors must unanimously agree on one specific predicate felony in order for them to find the aggravating factor. Absent a clear communication, four jurors might have found an aggravating factor in reliance on a finding of robbery of John Bell, while four others might have found the factor in reliance on the murder of John Bell, while yet four other jurors might have found the factor in reliance on the robbery of Alice Skov. The Court's approval of the instruction with the inclusive \"and/or\" expression allows a finding of the aggravating factor by a jury thus fractured. I strongly differ with the Court, and would not allow the possibility of a fractured jury raised by the deficient presentation of that critical issue to go unredressed.\n\nIn State v. Parker, 124 N.J. 628 (1991), the Court considered when, if ever, a jury can return a unanimous verdict without unanimously agreeing about some preliminary factual issues. It stated that\n\nin some circumstances, however, a general charge on jury unanimity will not suffice. That is so when, for example, \"a single crime can be proven by different theories based on different acts and at least two of these theories rely on different evidence, and [when] the circumstances demonstrate a reasonable possibility that a juror will find one theory proven and the other not proven but that all of the jurors will not agree on the same theory.\"\n\n[124 N.J. at 635 (quoting People v. Melendez, 274 Cal. Rptr. 599, 608 (Cal. App. 1990).]\n\nThe circumstances identified by this Court in Parker as requiring jury unanimity closely resemble the circumstances in this case. Thus for example, with respect to Alice Skov the c(4)(g) factor may be established by proof of one of several theories, each distinguished by the particular predicate felony on which it relies: murder of John Bell, robbery of John Bell, or robbery of Alice Skov. Each of those predicate felonies, or theories of the aggravating factor, depends on distinct acts and is proven by different evidence. Accordingly, the jury must unanimously agree on one of the predicate felonies in order to find the aggravating factor.\n\nThe majority endorses that Conclusion. Ante at (slip op. at 87). If the jury were not required unanimously to agree on a predicate felony in order to find the aggravating factor, a jury that voted 8-4 against each of the three possible predicate felonies could still find the aggravating factor, provided that every juror voted for one of the three predicate felonies. The possibility that a jury so configured might nevertheless find an aggravating factor does not comport with the substantial certainty we require of juries that would sentence a defendant to death. See, e.g., State v. Biegenwald, 106 N.J. 13, 53 (1987) (requiring that aggravating factors must outweigh mitigating factors beyond reasonable doubt) (Biegenwald II).\n\nIn Parker, the Court observed that a specific unanimity instruction is required when \"the circumstances demonstrate a reasonable possibility that a juror will find one theory proven and the other not proven but that all of the jurors will not agree on the same theory.\" 124 N.J. at 635. That possibility exists in this case because each of the felonies alleged as a predicate for the aggravating factors involves distinct acts. Accordingly, as the majority acknowledges, if the defendant here had asked for a specific unanimity instruction, the trial court would have been obliged to give one. Ante at (slip op. at 87). The Court, however, finds no plain error in the lack of any specific unanimity instruction. Id. at (slip op. at 86). I believe the\n\nerror is stark and requires a reversal of the jury's sentencing determination.\n\nThe c(4)(f) and c(4)(g) factors essentially contain two elements. First, each requires the commission of a predicate offense. Second, each requires the existence of a specific relationship between that offense and the murder. The two factors differ, though, both in the kinds of offenses that can serve as predicates and in the nature of the requisite relationship between the offense and the murder. The c(4)(f) factor allows any \"offense\" to serve as its predicate, even an offense committed by \"another.\" N.J.S.A. 2C:11-3c(4)(f). The c(4)(g) factor much more narrowly restricts the class of eligible predicate offenses to those committed by the defendant and enumerated among the factor's listed felonies.\n\nThe majority addresses the two distinctive elements of each of the aggravating factors as though they were virtually identical:\n\nWe think that the jury's unanimous verdicts in the guilt phase that defendant was guilty of robbery and murder regarding each victim makes remote at best the possibility that the jurors disagreed on the underlying felony that supported each aggravating factor. Although one could conceive of an instance in which the alternative underlying felonies would be sufficiently distinct in occurrence to lead jurors to disagree about whether the defendant had killed to escape detection for one as opposed to the other, that is not this case.\n\n[Ante at (slip op. at 86).]\n\nThe majority thus discounts any actual difference between the elements of the respective aggravating factors. Further, it discounts the requirement for a particularized relationship between the predicate offense and the murder, by finding mere contemporaneity sufficient to establish the relationship. Thus, the Court states:\n\nThe parties did not dispute that the murders and robberies essentially were contemporaneous events, with the murder of Bell preceding the murder of Skov. That a juror could believe, therefore, that defendant murdered Skov to escape detection for the robbery, but not to escape detection for the murder of Bell, seems implausible.\n\n[ Ibid. ]\n\nThe majority, finally, fails to recognize in this context that the jury's guilt-phase determinations do not automatically or necessarily carry over into the penalty phase of the trial.\n\nRule 2:10-2 allows appellate courts, \"in the interests of Justice, [to] notice plain error not brought to the attention of the trial or appellate court.\" We have said that the interests of Justice warrant a finding of plain error if \"in all the circumstances there was a reasonable doubt as to whether the error denied a fair trial and a fair decision on the merits.\" State v. Macon, 57 N.J. 325, 338 (1971). More pointedly, we said that a plain error is \"one sufficient to raise a reasonable doubt as to whether the error led the jury to a result it otherwise might not have reached.\" Id. at 336. We find plain error, then, in an error that could have changed the result.\n\nThe Court, applying conventional plain-error doctrine, undertakes an independent examination of the record and purports to know what a properly instructed jury would have done. To presume to have such knowledge, the Court must assume that juries in this context perform essentially a fact-finding function. That, however, is not the case. As this Court has in the past recognized, our juries in reaching ultimate verdicts perform a function far more embracive and nuanced than that of mere fact-finding. See, e.g., State v. Ingenito, 87 N.J. 204 (1981); State v. Simon, 79 N.J. 191 (1979).\n\nThis Court has recognized that the right to a trial by jury holds \"a hallowed place\" in the firmament of American law. State v. Collier, 90 N.J. 117, 122 (1982). The jury, indeed, is so important that we do not lightly allow a defendant even voluntarily to waive a jury. State v. Dunne, 124 N.J. 303 (1991). The right is protected by both the United States Constitution, amendment six, and the New Jersey Constitution, article I, paragraph 9. The genius of the jury consists in its introduction of \"the conscience of the community\" into our system of Justice. See Ingenito, supra, 87 N.J. at 212. We burden the jury with the responsibility of making the \"paramount, exclusive and independent\" adjudication of criminal guilt or innocence. Simon, supra, 79 N.J. at 199. In discharging that responsibility, the jury does not function as a mere fact-finder,\n\nbut rather more broadly finds the truth as expressed in its ultimate verdict. Ingenito, supra, 87 N.J. at 211. We understand that a jury's verdict in a criminal case transcends its fact-finding function. Thus, a jury may acquit even in the face of overwhelming evidence of guilt. Simon, supra, 79 N.J. at 208. Furthermore, courts will accept from juries even inconsistent verdicts, if they \"accrue to the benefit of a defendant.\" Ingenito, supra, 87 N.J. at 212. A jury may also \"nullify\" a law by acquitting a defendant for some reason even though the jury may believe the defendant guilty beyond a reasonable doubt. State v. Ragland, 105 N.J. 189, 205 (1986).\n\nWe thus recognize the moral dimension of jury verdicts. A defendant's right to a jury trial means that a defendant has the right to trial by a jury possessed of the fundamental power to exercise moral judgment in discharging its responsibility to determine ultimate criminal guilt or innocence. To dilute or diminish the jury's responsibility, therefore, violates a defendant's constitutional right to a trial by jury. See, e.g., Sandstrom v. Montana, 442 U.S. 510, 516 n.5, 99 S. Ct. 2450, 2455 n.5, 61 L. Ed. 2d 39, 46 n.5 (1979) (holding that federal constitution bars directed verdicts against defendants in criminal cases regardless of strength of state's evidence); State v. Coyle, 119 N.J. 194 (1990) (ruling that sequential charge of successive crimes was improper because it can prevent jury from fully considering each charge); Collier, supra, 90 N.J. at 123 (invalidating rape conviction where trial court directed verdict on lesser charge of contributing to delinquency of a minor; noting that direction of verdict on lesser charge might \"improperly impinge on the sensitive area of jury deliberation\"); Simon, supra, 79 N.J. at 199-200 (ruling that piecemeal instructions, special interrogatories, and fragmented deliberations can result in \"subtle coercion\" and may undermine jury's capacity to determine ultimate criminal guilt or innocence).\n\nBy statute, our Legislature has extended the right to a trial by jury to capital-sentencing proceedings. N.J.S.A. 2C:11-3c(1). All of the principles that define the duty of a jury and govern its deliberations, then, apply in full measure to the sentencing phase of this defendant's trial. A sentencing jury, like a guilt jury, bears the ultimate responsibility of decision. N.J.S.A. 2C:11-3c(3). Any attempt by the prosecutor or the court to diminish the jury's sense of responsibility for the verdict constitutes serious error. Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 86 L. Ed. 2d 231 (1985).\n\nThe decision to sentence a defendant to death vastly exceeds in intellectual and moral difficulty the determination of ultimate criminal guilt. State v. Purnell, 126 N.J. 518, 553 (1992) (Handler, J., Concurring and Dissenting). The extraordinary severity and irreversibility of the penalty command a heightened degree of care in the application of the principles of our law. See, e.g., Lockett v. Ohio, 438 U.S. 586, 605, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978); Ramseur, supra, 106 N.J. at 316. Thus, the right to trial by jury at capital sentencing invokes protections greater even than those necessary to preserve the right to trial by jury on the issue of guilt.\n\nIn criminal prosecutions, our courts, as noted, recognize that the jury's ultimate determination of criminal liability imports a moral dimension. To ensure that the jury's determination of criminal liability is independent and that its consideration and assessment of all relevant matters bearing on the ultimate question of criminal guilt is comprehensive, we do not permit the jury to take short cuts or to abbreviate its deliberations. For that reason, we do not allow collateral estoppel to supplant the independent fact-finding that serves as the necessary basis for the ultimate determination of criminal guilt. Thus, a jury must consider from a fresh vantage point the evidence of guilt supporting a criminal conviction even though that evidence was previously considered by the jury in a separate criminal proceeding charging an additional crime. Ingenito, supra, 87 N.J. at 209. In order to safeguard\n\nthe defendant's presumption of innocence on a second charge, we require that \"the jury be instructed in no uncertain terms to consider anew the evidence previously admitted but to disregard completely its prior verdict.\" Ragland, supra, 105 N.J. at 195. It is even more imperative that such reconsideration be ensured in a capital sentencing trial.\n\nIf we require a jury to reconsider evidence in a case in which the bifurcation separates two guilt determinations involving the same evidence tending to establish the same elements, e.g., Ragland, supra, 105 N.J. at 195; Ingenito, supra, 87 N.J. at 209, we surely must require it when the bifurcation separates a guilt from a capital sentencing determination. In that latter case, the jury considers the evidence again for its capacity to establish the elements of the felony, but now the decision on the felony exists in a wholly new deliberative universe. Now, the aim of the larger deliberation is not to establish criminal guilt or innocence, but to decide whether the defendant shall live or die.\n\nTo conclude that the absence of a specific unanimity instruction concerning the predicate felonies as a basis for finding aggravating factors does not constitute plain error, the Court must necessarily subscribe to two assumptions. First, the Court must assume that the jury did reconsider the evidence underlying the predicate felonies. Second, the Court must assume that, on reconsideration, the jury unanimously found some single specific predicate felony underlying each aggravating factor. Neither assumption is justified. The trial court never specifically instructed the jury in the penalty phase to reconsider anew, without being bound by its guilt-phase determinations, the evidence underlying the possible predicate felonies. And if the jury did on its own initiative correctly consider that evidence, we have no way of knowing, in the absence of a specific unanimity instruction, whether the jury did unanimously agree on a specific predicate felony.\n\nWe cannot assume that with proper instructions the jury would have reached a unanimous determination on each of the predicate\n\nfelonies. That assumption would require the Court to know that no juror harbored any doubts or misgivings about defendant's guilt, or that such doubts and misgivings would have had no influence on that juror's ultimate sentencing decision. Numerous jurisdictions recognize the propriety of allowing a jury to consider residual doubts about guilt in determining whether to sentence a defendant to death. See, e.g., Andrews v. Collins, 21 F. 3d 612, 623, n. 21 (5th Cir.1994) (Texas); Stringer v. Jackson, 862 F.2d 1108, 1116 (5th Cir.1988) (approving counsel's strategy of arguing residual doubt to jury), rev'd on other grounds sub nom. Stringer v. Black, U.S. , 112 S. Ct. 1130, 117 L. Ed. 2d 367 (1992), aff'd as modified, 979 F.2d 38 (5th Cir.1992); Rupe v. Wood, F. Supp. , (slip op. at 23), 1994 WL 518844 (W.D. Wash., Sept. 19, 1994) (No. C91-16357); People v. Johnson, 842 P.2d 1, 40-41 (Cal. 1992), cert. denied 114 S. Ct. 114 (1993); State v. Watson, 572 N.E.2d 97, 111 (Ohio 1991); cf. Franklin v. Lynaugh, 487 U.S. 164, , 108 S. Ct. 2320, 101 L. Ed. 2d 155, (1988) (ruling that no federal constitutional right exists to have jury consider residual doubts in mitigation of sentence).\n\nWe cannot fully fathom or divine the deliberative dynamics of a jury's decision on whether to put a defendant to death. For that reason, even within the framework of substantive standards explained by clear instructions, we cannot deny a jury the decisional flexibility and freedom of conscience to consider lingering doubts and to give those doubts weight that spares the life of a defendant. See Lockhart v. McCree, 476 U.S. 162, 181, 106 S. Ct. 1758, 1769, 90 L. Ed. 2d 137 (1986); Smith v. Balkcom, 660 F.2d 573, 580-81 (5th Cir.1981) (applying Georgia law), cert. denied 459 U.S. 882, 103 S. Ct. 181, 74 L. Ed. 2d 148 (1982). If, as recognized by many courts, a jury's residual doubts about guilt of murder can properly affect its weighing of aggravating and mitigating factors in the ultimate life-or-death decision, so also can a jury's residual doubts about guilt of an underlying felony properly affect the jury's decision about the existence of an aggravating factor dependent on that felony. If the jury is not given a real opportunity to\n\nreconsider the evidence supporting the felony conviction, the jury will be deprived of the chance to ponder any remaining doubts it had about guilt of the felony. When brought to bear in the decision on the existence of the aggravating factor, those doubts, although previously resolved, may appear to the jury in a sharply different light because of their crucial significance to the awesome sentence the jury is asked to impose.\n\nDefendant's sentencing jury, then, should have been required to reconsider the evidence of the charged felonies and to deliberate anew in the penalty phase about the existence of the felonies underlying the c(4)(f) and c(4)(g) aggravating factors. Most importantly, it should have been instructed to do so unencumbered by its prior determinations based on that evidence.\n\nEven if we assume that the jury did properly deliberate anew, we must acknowledge that we have no way of knowing whether, in those deliberations, the jury unanimously found any of the possible predicate felonies. Perhaps doubts latent during the first deliberation on criminal guilt figured more substantially in the second deliberation on the ultimate sentence given the different and portentous purpose of the latter. Perhaps the changed deliberative universe of capital sentencing affected the deliberations about the possible predicate felonies. Perhaps not. The point, though, is that this Court has no way of knowing whether, in those new and more extended deliberations, the jurors unanimously agreed on some particular predicate felony. We know that every juror individually found the existence of some predicate felony, because the jury as a whole found the aggravating factors; but because the jury was not instructed on the necessity of unanimous agreement on a specific predicate felony, we cannot know whether in fact the jury did thus unanimously agree.\n\nThe majority, therefore, looks in vain to the guilt verdicts for guidance and support concerning the events of the penalty deliberation. There is none that enables it to use those verdicts simply to ratify defendant's death sentence. Accordingly, the majority's\n\nfinding of no plain error, relying on the fact of the guilt verdicts, is not defensible.\n\nI continue to adhere to the view that the plain error doctrine does not apply in the review of capital cases. See Bey I, supra, 112 N.J. at 118 (Handler, J., Concurring). The unique severity of capital punishment commands the application of special procedural protections, Ramseur, supra, 106 N.J. at 324, including a searching review of the record by this Court for error. When this Court finds error, whether or not noticed by the defendant below, we should not strain, as the majority today does, to find that error harmless. Because this Court cannot know whether proper instructions would have changed the result, the premise of the plain-error standard fails. The Court ought, in this circumstance, eschew that standard in favor of the simple error standard. Under that standard, our course is clear: because the trial court failed to instruct the jury of the necessity of unanimous agreement on a particular predicate felony to support a finding of the aggravating factors, we must vacate defendant's death sentence.\n\nV\n\nAnother reversible error also infects the jury's determination that defendant deserved to die for the murder of Alice Skov. The State alleged two aggravating factors with respect to John Bell: c(4)(g), a killing committed during the commission of another felony, either the robbery of John Bell and/or the murder and/or burglary of Alice Skov; and c(4)(f), a killing to prevent defendant's detection for robbing John Bell and/or robbing and/or killing Alice Skov. Likewise the State alleged parallel aggravating factors with respect to Alice Skov: c(4)(g), a killing committed during the commission of another felony, either the robbery and/or killing of John Bell and/or the robbery of Alice Skov; and c(4)(f) a killing to prevent detection for the robbery and/or killing of John Bell and/or the robbery of Alice Skov. The jury unanimously found the c(4)(g) factor in both killings. On the c(4)(f) factor, however,\n\nthe jury found it applicable only to the killing of Alice Skov. Further, the jury did not indicate on which predicate felony it based any of its aggravating factor determinations.\n\nAs I previously expressed in State v. Moore, 122 N.J. 420 (1991), in order for a charged murder to be subject to an aggravating factor reflecting the commission of another felony, the charged murder must arise during the course of and as a probable consequence of the other felony. Id. at 506 (Handler, J., Concurring and Dissenting). I believe that causal nexus reflects the clear legislative intent, as shown by the analogous legislative treatment of the substantive crime of felony murder. It is reasonable to infer from the language of the statute (\"committed while defendant was engaged in the commission of\") that the Legislature intended to incorporate elements of the felony-murder doctrine into the standards governing the c(4)(g) aggravating factor. See Moore, supra, 122 N.J. at 506-07 (Handler, J., Concurring and Dissenting). In determining the elements of the substantive crime of felony murder, we have ruled that the commission of the murder must be a probable consequence of the felony. State v. Martin, 119 N.J. 2, 27-28 (1990). It follows that in the context of the c(4)(g) factor, the Legislature presumably intended that the charged murder occur while the defendant \"was engaged in the commission of [the predicate felony],\" and was the \"probable consequence\" of the commission of that felony.\n\nHere, the State did not argue that the killing of either victim was a probable consequence of the other. Rather the State argued that defendant and Coleen Alexander had conspired from the outset to kill and rob the victims, as is evidenced by the fact that defendant was charged with conspiracy to commit the murder and robbery of both victims. Thus, each murder was independently intended by defendant. More significantly, the jury was not instructed to consider, nor asked to determine, whether a sufficient causal nexus existed between the two murders. I believe the legislative intent underlying that aggravating factor\n\ncannot be effectuated by charging only that Alice Skov was killed during the commission of the murder and/or robbery of John Bell. Rather, that aggravating factor could be established only if the jury was able to conclude beyond a reasonable doubt that her killing was a probable consequence of either the killing and/or robbery of John Bell. See Moore, supra, 122 N.J. at 509-10 (Handler, J., Concurring and Dissenting).\n\nThe Court fairly comments on the logic underlying c(4)(g) -- that certain types of murders are more blameworthy than others. However, the Court overlooks the specific logic of the statutory construct -- that c(4)(g) murders are more blameworthy because they are causally related to the commission of an accompanying felony. The language of the statute contemplates that the killing is aggravated because of defendant's greater fault in that it occurred because the defendant was engaged in other criminal behavior that, under our law, generated a real risk that someone would be killed. Moore, supra, 122 N.J. at 508 (Handler, J., Concurring and Dissenting). Thus, I do not believe that the felony-murder aggravating factor was meant to encompass intentional multiple-murder situations. See People v. Harris, 679 P.2d 433, 452 (Cal.), cert. denied 469 U.S. 965, 105 S. Ct. 365, 83 L. Ed. 2d 301 (1984).\n\nMoreover, using each murder to aggravate the other unavoidably leads to double counting and exaggerates the weight of the aggravating factors. The California Supreme Court expressed the point in Harris. The Court stated:\n\nIn this case, alleging this special circumstance with each murder count results in a finding of two special circumstances. Since there must be more than one murder to allege this special circumstance at all, alleging two special circumstances for a double murder improperly inflates the risk that the jury will arbitrarily impose the death penalty[.]\n\n[679 P.2d at 452 (citations omitted).]\n\nHere, the evidence of each murder is used twice by the jury in determining punishment for each murder. The Legislature could not have intended this result. In the absence of a limiting instruction providing a careful explanation of the proper use of the\n\nsame evidence, the double use of the evidence to establish aggravating factor c(4)(g) constitutes reversible error.\n\nVI\n\nI agree with the Court that most of defendant's arguments with respect to prior bad-act evidence do not establish reversible error. However, the trial court committed an egregious error in admitting Stephen Krouch's testimony that he showed the eventual murder weapon to defendant as a warning to him about beating Coleen.\n\nStephen Krouch's testimony regarding defendant's beating of Coleen was neither elicited during cross-examination of the witness nor did it involve a subject that defendant had placed in issue. Rather, that testimony was elicited by the prosecutor on direct examination of Mr. Krouch after defense counsel had strenuously objected to that line of questioning during the testimony of Coleen's mother, Violet Krouch. In the case of Mrs. Krouch, the prosecutor agreed to withdraw the question asking why Mrs. Krouch's husband had told defendant about the rifle.\n\nThe majority ignores the fact that the jury first heard during Mr. Kroch's testimony that defendant had beaten Coleen in the past. All other references to defendant's beating of Coleen, including Coleen's own testimony elicited by defense counsel on cross-examination, came after the trial Judge had admitted Mr. Krouch's testimony. Thus, it is likely that defense counsel's strategic treatment of later testimony about the abuse constituted a defensive reaction to that earlier adverse ruling.\n\nMoreover, the majority misconstrues the purpose of the testimony elicited. According to the majority, the primary purpose of the evidence was to establish that Stephen Krouch had informed defendant of the existence of a weapon in the Krouch home. Ante at (slip. op. at 59). Clearly, however, explaining why Stephen Krouch introduced defendant to the weapon is irrelevant to proving that he in fact did introduce defendant to the weapon. Such irrelevant testimony, showing reprehensible spousal abuse, is so\n\nobviously inflammatory and prejudicial to defendant that it could not possibly withstand the test for admissibility laid out in N.J.R.E. 403.\n\nThe Court suggests that at a subsequent re-trial a court should \"carefully scrutinize\" the evidence and consider a limiting instruction should it determine to admit the testimony. Ante at (slip op. at 59). I strongly disagree with that Disposition. There can be no reason to admit the prejudicial testimony in light of the fact that the prosecutor could have elicited the needed information by simply asking Mr. Krouch if he ever told defendant that there was a gun in the house. The majority intimates that the testimony that Mr. Krouch told defendant about the rifle is inseparable from the testimony indicating why Mr. Krouch told him. This is not the case. In fact, the prosecutor asked two distinct questions to elicit the information. The State could have easily avoided the prejudicial testimony while simultaneously imparting to the jury that defendant had knowledge of the weapon prior to the commission of the murders.\n\nVII\n\nDefendant's trial was rife with serious errors impugning the reliability of the verdict and death sentence. The court's instructions concerning the own-conduct determination and the vicarious murder theories undermine the reliability of the jury's decision on those issues, and the court's failure properly to instruct the jury concerning its deliberations on the aggravating factors render insupportable the sentence of death. More generally, the case reveals in many ways the fallibility of our current efforts to prosecute capital cases and enforce capital punishment.\n\nThe problems that afflict the judicial administration of capital punishment are endemic. Those problems are intractable because, I believe, we seek to administer capital punishment under a judicial regime that is firmly fixed on a foundation of constitutional due process and fundamental fairness.\n\nFrom the beginning of our experiment with death, we have confronted the unresolvable dilemma inherent in having a guilt determination made by a death-qualified jury that, by the very process of death qualification, becomes conditioned in the direction of guilt. Ramseur, supra, 106 N.J. at 428-35 (Handler, J., Dissenting). In Marshall I, the Court reviewed the judgment made by a jury that experienced all of the pitfalls surrounding the process of death qualification. The defendant was found guilty by an inadequately death-qualified jury -- indeed, a jury that defense counsel declined to death-qualify at all, allegedly pursuing a \"strategy\" of avoiding any reference to the death penalty. I noted that the Court's acceptance of that trial strategy, which rested on the notion that repeated references to the death penalty in the course of qualifying the jury were likely to predispose the jury toward a belief in the defendant's guilt, confirmed the premise that the process of death-qualification biases a jury toward conviction.\n\nIn State v. Perry, 124 N.J. 128, 187-90 (1991) (Handler, J., Concurring and Dissenting), State v. Erazo, 126 N.J. 112, 142-50 (1991) (Handler, J., Concurring and Dissenting), and State v. Purnell, 126 N.J. 518, 560-62 (1992) (Handler, J., Concurring and Dissenting), I further criticized the slip-shod quality of attempted death-qualifications, which served only to increase the risk of conviction, and thus to increase the chance that a poorly-qualified jury would make the ultimate life or death judgment. Similarly, in this case, defendant was convicted by an inadequately death-qualified jury because the trial court as well as defense counsel failed to probe and follow up non-committal responses to open-ended questions. None, or very few, of the so called \"safeguards\" inherent in death qualifications were applied in defendant's voir dire. Rather, it contained all the telltale signs of pro forma death-qualification: vague responses to open-ended questions; no probing; and only formulaic, obvious, yes or no, will-you-do-your-duty-type questions as follow-up. And worse, the jurors were subjected to repeated and portentous references to the death penalty. Defendant's fate was placed in\n\nthe hands of a jury that had been death qualified only in the pernicious sense of having been exposed to the possibility of a death sentence, thus inciting, but leaving hidden, potential biases. See Ramseur, 106 N.J. at 430-31 (Handler, J., Dissenting).\n\nIn addition, the trial court inadequately instructed the jury with respect to its available options concerning determinations that were critical to the penultimate issue of death eligibility but not to the issue of guilt. Defendant was subjected to a guilt-phase charge that (1) confused the jury by inadequately defining the death-eligible offense, (2) failed to inform the jury that it could disagree about the underlying basis of guilt (by his own conduct or accomplice/co-conspirator) thus producing a potentially coercive influence over the jury's deliberation, (3) gave an inadequate instruction for one of the alternative findings to own conduct, namely, co-conspiracy, and (4) debilitated the protection afforded defendant by the \"beyond a reasonable doubt\" standard by incorrectly informing the jury that it must agree on one theory beyond a reasonable doubt instead of instructing that only a finding of own conduct need be unanimous and beyond a reasonable doubt.\n\nThose errors occurred at the very stage at which the guilty-phase bleeds into the penalty-trial, insofar as the \"own-conduct\" determination must be made ostensibly during the guilt phase, but possesses only penalty implications. To the extent that some logic justifies bifurcation of guilt and penalty proceedings, it rests on the presumption that different evaluative norms are implicated at the different stages, thus warranting different rules. The \"own-conduct\" finding blurs the distinctions and because of that blurring, creates an unprotected area in which a defendant experiences the worst of both worlds. I think Bobby Lee Brown is that defendant.\n\nIn essence, a jury given enough death qualification to prejudice its guilt determination but not enough adequately to qualify it to decide impartially life or death as an ultimate sentence sat without proper guidance in judgment on an issue, own conduct, that serves\n\nto distinguish death-eligible from non-death-eligible crimes. Defendant thus endured all the errors that made Robert Marshall's case so troubling. But worse, he endured them at the moment in the guilt phase when the jury is asked to make what is basically a sentencing determination without having the benefit of the procedural protections imposed at the penalty trial.\n\nThis case shows again the doctrinal tangle that ensnares our capital murder jurisprudence. We continue in the administration of this law to struggle to free ourselves from confusion, contradiction, and arbitrariness. We try valiantly but vainly to identify, define, and follow intelligible principles and guiding rules so that capital prosecutions can be conducted with consistency, even-handedness, and fundamental Justice. The objective that we have set for ourselves -- to punish a criminal defendant with death -- categorically demands that capital prosecutions be conducted at the very highest levels of fairness and constitutional due process. This case, unfortunately, exemplifies our failure -- it again demonstrates the confusion and arbitrariness that beset the administration of Justice in capital causes. We seem determined to seek the ultimate punishment, but we are equally determined not to give up our constitutional protections. Our experience is teaching us that we cannot have both -- the retributive luxury of sentencing criminals to death and the constitutional glory of due process and the rule of law.\n\nO'HERN, J., Dissenting in part.\n\nI disagree with the majority's position that principles of constitutional law or statutory construction require that a jury be instructed that it may return a non-unanimous verdict in the guilt phase of a capital case.\n\nI\n\nTrial by jury is fundamental to the American system of criminal Justice. It is \"the normal and, with occasional exceptions, the preferable mode of disposing of issues of fact\" in major criminal\n\ncases. Patton v. United States, 281 U.S. 276, 312, 50 S. Ct. 253, 263, 74 L. Ed. 854, 870 (1930). \"[The] intrinsic value of trial by jury has earned public confidence over time.\" State v. Dunne, 124 N.J. 303, 318 (1991). In Dunne we stated:\n\n\"'The maintenance of the jury as a fact finding body in criminal cases is of such importance and has such a place in our traditions'\" that, under federal law, a defendant may not unilaterally insist on a trial before a Judge alone. [Singer v. United States, 380 U.S. 24, 34, 85 S. Ct. 783, 789, 13 L. Ed. 2d 630, 637 (1965) (quoting United States v. Patton, 281 U.S. 276, 312, 50 S. Ct. 253, 263, 74 L. Ed. 854, 870 (1930)).] * * * Thus, through trial by jury, \"in most circumstances\" Justice can be done. A fair trial is afforded to the accused, and public confidence in the criminal Justice system is preserved.\n\n[Id. at 318-19.]\n\nOne of the nearly-universal hallmarks of trial by jury is the requirement of a unanimous verdict in criminal cases. The roots of the search for jury unanimity are traced in 3 William Blackstone, Commentaries *375-76.\n\nConsistent with that history and tradition, I believe that allowing, much less requiring, juries to consider the return of non-unanimous verdicts in the guilt phase of a capital case is wrong. The Court reasons that the \"by [one's] own conduct\" factor in a capital case is not an essential element of the crime of capital murder and thus may in effect be treated as though it were an aggravating factor in the sentencing phase. Ante at (slip op. at 26-27). In the sentencing phase of a capital case, the jury is statutorily authorized to return a non-unanimous verdict. N.J.S.A. 2C:11-3c(3)(c).\n\nAside from being an internal contradiction with its own precedent (in State v. Koedatich, 118 N.J. 513, 524-28 (1990), the Court held that a non-unanimous finding on the presence of an aggravating factor was not a criminal verdict), the Court's theory that there may be non-unanimous verdicts in the guilt phase adds to capital cases another layer of decision that is not required by law.\n\nII\n\nIn reaching its Conclusion, the majority reasons that capital murder does not exist under the Code -- there is only murder -- and\n\nthat the qualifications for capital sentencing in N.J.S.A. 2C:11-3c are not essential elements of a defined offense of capital murder. I disagree.\n\nThe Code's structure makes clear that before a defendant may receive a capital sentence, a jury must first have determined in the guilt phase of the trial that the defendant committed the murder \"by [the actor's] own conduct,\" or through \"payment or promise\" of anything of value, or as a \"leader of a narcotics trafficking network.\" N.J.S.A. 2C:11-3c. Consider the implications of the majority's thesis in the context of the last factor, the leader of the narcotics-trafficking network, the so-called \"drug kingpin.\" I suspect that in most drug-kingpin prosecutions involving murder, the State will charge the accused kingpin with the underlying substantive offense in another count of the indictment. Must the jury be instructed that it may be non-unanimous on the capital-murder count but that it must be unanimous on the kingpin count? Consider also the payment-of-value factor. Must a jury be told that it may return a non-unanimous verdict on the presence of that factor? I think not.\n\nThat Conclusion (that one who hires a killer could not receive a non-unanimous verdict on that issue of hiring) leads me to believe that to suggest that the death-triggering factors are anything but the essential elements of the crime of capital murder is not logical. As essential elements of capital murder, the presence or absence of those factors must be unanimously determined in the guilt phase of the capital case. Our Rules Governing Criminal Practice contemplate no less. Rule 3:7-3(b) requires that an indictment for murder shall specify whether\n\nthe defendant is alleged: (1) to have committed the act by his or her own conduct or (2) to have procured the commission of the offense by payment or promise of payment, of anything of pecuniary value or (3) to be the leader of a drug trafficking network * * *, and who, in furtherance of a conspiracy * * *, commanded or by threat or promise solicited the commission of the offense.\n\nThe Code makes the point clear.\n\n\"Element of an offense\" means (1) such conduct or (2) such attendant circumstances or (3) such a result of conduct as\n\n(a) Is included in the description of the forbidden conduct in the definition of the offense [or]\n\n(b) Establishes the required kind of culpability * * *.\n\n[N.J.S.A. 2C:1-14h.]\n\nEach of the 2C:11-3c factors \"establishes the required kind of culpability\" for capital sentencing. Hence, because those factors are essential \"elements of an offense,\" ibid., they must be unanimously resolved in the guilt phase of the capital case.\n\nIII\n\nThe determination of the presence of those elements in the guilt phase of a capital case is analogous to a pre-Code finding of first-degree murder. Under pre-Code law, murder was divided into two degrees as part of an early reform to mitigate the death penalty. First-degree murder was characterized by the willful, deliberate, and premeditated nature of the killing. N.J.S.A. 2A:113-2, repealed by L. 1978, c. 95, N.J.S.A. 2C:98-2. \"All other murders were presumptively of the second degree\" and such defendants were therefore not subject to the death penalty. State v. Gerald, 113 N.J. 40, 71-72 (1988). Recall that Senator John Russo, the principal sponsor of the 1982 death-penalty act, analogized death eligibility with \"first-degree murder, willful, premeditated murder.\" Senate Judiciary Committee, Hearings on S. 112 1 (1982). Let us suppose the Legislature had simply retained those pre-Code definitions of murder but had added the separate sentencing requirement of N.J.S.A. 2C:11-3c(3)(c) with its provision that \"if the jury is unable to reach a unanimous verdict [in the sentencing phase,] the court shall sentence defendant * * *\" to a term of thirty years to life with a minimum of thirty years without parole. Would a jury that could not reach a unanimous verdict of guilt or innocence on the first-degree murder charge be instructed that it was nonetheless authorized to return a verdict of second-degree murder because the Code provisions that allow a non-unanimous verdict with regard to the weighing of aggravating and mitigating factors at the penalty phase have the corresponding effect of allowing the\n\njury to return a non-unanimous verdict on guilt or innocence of first-degree capital murder?\n\nI have found no case in which a jury unable to agree on the guilt or innocence of the degree of murder establishing death eligibility was not dismissed even though it had reached, or might have reached, a verdict on a lesser degree of murder. Such non-unanimity on the higher degree does not constitute a bar to a retrial of a defendant for the first-degree count. State v. Booker, 293 S.E. 2d 78 (N.C. 1982), summarizes the majority rule. \"When a jury has declared its inability to reach a verdict [on a first-degree murder count], the action of the trial Judge in declaring a mistrial is reviewable only in case of gross abuse of discretion * * *.\" Id. at 79. The principle that allows the public to see that a criminal prosecution proceeds to a verdict either of acquittal or conviction is predicated on \"the public's interest in fair trials designed to end in just judgments.\" Wade v. Hunter, 336 U.S. 684, 689, 69 S. Ct. 834, 837, 93 L. Ed. 974, 978 (1949). The better way to charge in a capital case may be to instruct the jury that it must consider two charges, capital murder and non-capital murder, and to explain that the defendant may be found guilty of non-capital murder as either a principal or an accomplice.\n\nIn this case, the issue arises as a matter of plain error. The jury charge in this case could have been clearer, but it did not incorrectly state the law. Nothing requires that a jury be instructed that it may return a non-unanimous verdict on a capital-murder count. I am satisfied that the charge did not have a clear capacity to bring about an unjust result. See Rule 2:10-2. A capital-murder charge should not authorize non-unanimous verdicts in the guilt phase of a capital case.\n\nWe must never forget, as we have stated so often, the importance of maintaining the public's confidence in our criminal-Justice system. Trial by jury, for reasons rooted in our history and tradition, is one of the foundations of that confidence. It is a foundation not simply because of trust in the common man, trust in the verdict of one's peers, but because it has proven itself as the best vehicle for attaining Justice. We surrender to no clamor when we protect trial by jury; we simply accept the wisdom of the ages and benefit from the experience of thousands of\n\nJudges over hundreds of years who continue to marvel at the consistent soundness of jury verdicts.\n\n[Dunne, supra, 124 N.J. at 319.]\n\nThe jury verdict on the capital-murder count was sound. Had any member of the jury entertained a reasonable doubt as to defendant's guilt of murder by his own conduct, the jury would have been hung and a new trial afforded defendant.\n\nJustice Garibaldi joins in this opinion.\n\n\u003cspan class=\"fn\"\u003e1. Ms. Dempsey answered the court's initial open-ended questions about her general views on the death penalty by saying, \"I believe in it depending on, as you just said, factors involved.\" Asked whether she favored, disfavored or was neutral on the death penalty, she responded, \"I think you have to be very careful, I don't know where that falls with favor or disfavor. You have to be very careful.\" Ms. Dempsey further indicated, in response to yes-or-no questioning, that she would consider mitigating evidence and that race and age had nothing to do with the case. She also indicated that the fact that defendant could receive life imprisonment would not impair her ability to sentence. Defense counsel asked no further questions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The examination of Mr. Gorzsas typically indicated: COURT: In general, what's your opinion with regard to the death penalty? GORZSAS: I really have no strong opinion one way or another. I believe that in certain circumstances it may be a good thing, however, it's not a black and white issue. COURT: Let me put it another way, do you generally favor, disfavor of are you neutral on the issue of imposing the death penalty? GORZSAS: I guess I would say that I favor it slightly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We have previously acknowledged the potential benefit of using hypothetical questions designed to draw out bias and preDisposition if open-ended questions are insufficient. See Biegenwald IV, supra, 126 N.J. at 42.\u003c/span\u003e\n\n",
    "body_length": 226979,
    "citedas": [
      "138 N.J. 481",
      "651 A.2d 19"
    ],
    "attorneys": "For appellant and cross-respondent: Stephen W. Kirsch, Assistant Deputy Public Defender, and Matthew Astore, Deputy Public Defender II, (Susan L. Reisner, Acting Public Defender, attorney). For respondent and cross-appellant: Nancy A. Hulett, Deputy Attorney General, (Deborah T. Poritz, Attorney General of New Jersey, attorney).",
    "category": [
      "36",
      "78"
    ],
    "judges": "Chief Justice Wilentz and Justices Clifford and Pollock join in this opinion. Justice Handler has filed a separate opinion Concurring in part and Dissenting in part. Justice O'Hern has filed a separate Dissenting opinion in which Justice Garibaldi joins.",
    "citation_count": 89
  }
}
