{
  "id": "FqJzR2YBTlTomsSBhkfJ",
  "document": {
    "title": "People v. Cain",
    "full_title": "THE PEOPLE AND v. TRACY DEARL CAIN AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1995-05-04T00:00:00.000Z",
    "docket": "No. S006544",
    "body": "WERDEGAR, J.:\n\nDefendant Tracy Dearl Cain was convicted following a jury trial of the first degree murders of William and Modena Galloway (Pen. Code, § 187, subd. (a), 189).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The jury found true robbery-murder, burglary-murder, attempted-rape-murder and multiple-murder special-circumstance allegations. ( § 190.02, subds. (a) (3) \u0026 (17).) Defendant was also convicted of two counts of burglary ( § 459) and one count of robbery ( § 211), but was acquitted on a charge of rape ( § 261). The jury fixed the penalty for each murder at death. After denying the motion for modification of the penalty verdict, the court entered judgment accordingly. The present appeal is automatic. (Cal. Const., art. VI, § 11; § 1239, subd. (b).)\n\nGUILT PHASE FACTS\n\nPROSECUTION'S CASE\n\n1. The Victims\n\nPrior to the weekend of October 17, 1986, Modena Shores Galloway and William Jefferson Galloway lived in Oxnard. Their next door neighbor was Persey Cain, the father of defendant. Mr. Galloway, 63 years of age, had injured his back and was in poor health. Since Mr. Galloway was unable to work on his own car, his son, William, and Persey Cain had sometimes repaired the car in the Galloway driveway with the garage door open. Defendant observed some of these repairs.\n\nMr. Galloway had a habit of keeping large amounts of cash in his house. When he received his monthly disability check, which ranged from $1,500-$2,000 per month, he placed $200-$300 in a savings account and retained the remainder in cash. He paid all of his bills in cash and did not have a checking account. Mr. Galloway had shown his son-in-law, Kenneth Mehaffie, a brown wallet containing approximately $1,000, which he kept in the desk next to the bed. He also kept a black wallet containing less cash on his person.\n\nMrs. Galloway stored her jewelry in a small wooden box with a sliding top. The Galloways also owned a Sanyo beta video casette recorder (VCR), which was kept in Mr. Galloway's room. The Galloways kept a child-sized rocker in the living room of their home for their grandchild. Their home was equipped with several night lights that turned on automatically and remained on when the Galloways retired. These night lights provided sufficient light by which to recognize someone they knew.\n\nOn Monday, October 20, 1986, the Galloways' son, William, found them dead in their home. William entered the house through the garage. The door between the garage and the kitchen was broken off its hinges. William found his father's body lying in the hallway to the living room. Dried blood was on the wall. William found his mother's body in her bedroom. Again, dried blood was splattered on the wall.\n\n2. Chronology from Witness Testimony\n\nDefendant lived with his father, Persey Cain, next door to the Galloways. On Tuesday, October 14, 1986, Persey Cain went on a week-long trip, leaving defendant and defendant's younger brother Val in charge of the house, with food in the refrigerator and approximately $50. Prior to his departure, Persey Cain took parts from defendant's Pinto to Barber Auto Parts for a valve job. On Sunday, October 12, 1986, defendant had received a pay check in the amount of $111.75 from Manpower Temporary Services.\n\na. Friday, October 17, 1986\n\nThe auto parts store records show $57.18 was paid in cash for defendant's valve job on October 17. Beginning in the late afternoon on that day, defendant and Val held a party at their house. Acquaintances attending the party included David Cerda, Floyd Clements, Rick Albis, Kevin Walker, Ulysses Anthony Mendoza, and two unidentified girls. At the party, everyone consumed beer and everyone, except Albis, consumed marijuana. Later in the evening, defendant \"rocked up\" some cocaine and smoked it out of a pipe.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAround 8:30 p.m., defendant complained he was missing $10. He threatened \"to beat all of their asses\" if someone did not find the money. Mendoza told defendant his money was in his top dresser drawer, where defendant had placed it after returning from purchasing beer. Defendant found the money.\n\nAccording to Mendoza, defendant remained angry, because his brother Val and Walker were in the bedroom with the two girls. Defendant complained Val should have included him instead of Walker. Defendant was so angry he kicked the door and put a hole in it. A few minutes later, Walker and the girls left and did not return. Clements testified this incident occurred on Saturday night, not Friday night, while Albis testified it occurred on Friday but he, not Walker, was in the bedroom with Val and the girls.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nMendoza testified that around 11 p.m. he and defendant walked to a nearby 7-Eleven to buy more beer. On the way to the store defendant asked Mendoza to help burglarize the Galloways' house so \"he could get thousands.\" Mendoza declined, saying he didn't have the nerve.\n\nAt the 7-Eleven, Mendoza and defendant encountered Richard Willis and Sean Sampson. Defendant told them he wanted to buy drugs. According to Mendoza, he and defendant climbed in the backseat of Sampson's car and drove off to obtain drugs. While they were in the car, defendant tapped Mendoza on his knee and made a strangling gesture with his hands. Mendoza told Sampson and Willis that, if they were smart, they would turn around and drop him off or something foolish would happen. They complied and Mendoza returned to the party. About 20-30 minutes later, defendant returned home and called Mendoza a \"pussy,\" because he would not help him.\n\nWillis's account of his encounter with defendant differed somewhat. Willis testified that, as he was leaving the 7-Eleven store at approximately 6:30 or 7 p.m., he met defendant, who asked if Willis knew where he could get some marijuana. They drove to defendant's house, because defendant said he needed to get some money, then to Willis's house. When Willis asked to see the money, defendant claimed he forgot to bring it, so they returned to defendant's house. When defendant returned to the car, he brought Mendoza with him. They returned to Willis's house, but when Willis again asked to see the money defendant still didn't have any. They returned to the car. As they started to drive, defendant asked if Willis knew where he could sell a home entertainment system so he could purchase the marijuana. Willis directed him to Aleric Street. Mendoza then said, \"If you know what is good for you, you'll take me back.\" Willis \"got the hint\" and dropped them back at the Cain house. Sampson testified he did not see either Mendoza or defendant on Friday night.\n\nMark Pina lived across the street from the Cain residence. At approximately 12:30 a.m., on Saturday, October 18, defendant and Mendoza visited Pina. Defendant asked Pina if he owned a freebase pipe and offered him $10 for it. Pina gave the pipe to defendant and declined payment. During the brief visit, Pina thought defendant looked \"sprung,\" as though he had already used cocaine; he talked fast, repeated things, and did not seem to hear when Pina spoke to him.\n\nMendoza testified that, sometime after he returned from his ride with Willis and Sampson, he was seated on the couch. (The record is not clear whether he and defendant had yet visited Pina.) Mendoza heard defendant call to Cerda. Cerda walked outside the front door and talked with defendant. He came back inside, grabbed his jacket, and left again. Cerda returned three or four minutes later without defendant. A bit later, Val asked Cerda to go check where defendant was. Cerda left and returned again in a couple minutes without defendant.\n\nRick Albis, who had left the party with Floyd Clements sometime between 10 and 11 p.m., returned less than one hour later. He stayed for 10-20 minutes. Cerda, Mendoza and Val were present, but Albis did not see or hear defendant.\n\nApproximately 20-30 minutes after Albis left for the second time, defendant returned. Mendoza, Val and Cerda were present. According to Mendoza, defendant had blood on the inner part of the bill of his hat, on his right cheekbone, on his right foot, on his right leg by his pocket, and on his chest area. Defendant said he had gotten \"thousands.\" Mendoza saw defendant holding a lot of money in his left palm. The money was folded in half with a $100 bill on top. Defendant said he had \"knocked them smooth out\" or he had \"blipped somebody.\" Val had defendant remove his clothes to be washed. Mendoza and Cerda spent the remainder of the night at the Cain residence.\n\nb. Saturday, October 18, 1986\n\nOn Saturday defendant was scheduled to work at a temporary job, but did not report to work. When Mendoza awoke, he went into the living room. Defendant was asleep in a recliner. Mendoza picked up a wad of bills lying next to defendant and counted the money. The wad contained $500. Defendant woke up, grabbed the money and exclaimed: \"Give me my fucking money.\" Albis also testified defendant showed him a check and a wad of money when he returned to the Cain house on Saturday morning.\n\nDuring the encounter, Mendoza noticed what appeared to be fresh cut wounds on defendant's right hand. Later on Saturday afternoon, Clements saw defendant hold his right hand in a fist in the palm of his left hand. He heard defendant ask Mendoza to get him a Band-Aid. That morning Mendoza heard Val ask defendant what he did with the people the previous night. Defendant responded: \"That's on them.\"\n\nSometime that day, defendant, Mendoza, Albis and Cerda went shopping. Defendant bought a pair of black leather hightop basketball shoes, a black Raiders hat, some cassettes and a car stereo. The stereo cost over $200. Defendant paid cash for all the items.\n\nClements testified Mendoza came to his house around 5 or 6 p.m. to ask if he knew anyone who would buy a VCR for $25 or $30. Clements saw the VCR in the back of Mendoza's truck. Clements noticed Mendoza was wearing a new jacket and cap. Mendoza testified he did not purchase any new clothes when he accompanied defendant on his shopping spree.\n\nClements further testified Mendoza told him about seeing the Galloways' bodies. Mendoza told Clements the lady was lying on the bed with a pillow over her face and there was blood everywhere. The old man was lying on the floor, all bloody with holes in his head. Mendoza, however, testified he never entered the Galloway home.\n\nSometime between 11 p.m. and midnight, Willis and Sampson again encountered defendant and Mendoza at the 7-Eleven. Mendoza tried to sell Sampson a VCR, which he said was at the defendant's house. Mendoza also had with him a wooden box containing jewelry he was trying to sell. Sampson and Willis gave Mendoza and defendant a ride back to defendant's house. As he left the car, defendant warned Sampson and Willis to keep their mouths shut about the VCR. Mendoza testified these events did not occur.\n\nc. Sunday, October 19, 1986\n\nDefendant and Val held a barbecue on Sunday afternoon. Just as the sun was going down, defendant asked Mendoza to take him to the store in Mendoza's truck. Mendoza refused. According to Mendoza, defendant stated Mendoza would either take him or he would knock Mendoza out and take the truck himself. When Mendoza got to the truck, he saw a box containing cables, wires, rags and sticks in the back of the truck. Defendant directed him to drive to Perkins Road where defendant disposed of the box. While defendant was disposing of the box, Mendoza saw that it also contained a VCR.\n\nKathy Lazoff, Mendoza's girlfriend at the time, was also at the barbecue. Lazoff overheard a conversation between Mendoza and defendant. Defendant said: \"Take it. I'll give you a couple bucks for gas.\" Mendoza responded: \"Man, you're crazy.\" Defendant then replied: \"You have no choice because I'll kick your ass and take your truck.\" Defendant appeared angry and upset during the conversation.\n\n3. The Investigation\n\nThe investigation of the Galloway murders began around 2:40 p.m. on October 20, 1986. The crime scene was photographed. Bloody footprints were found on the asphalt tile in Mr. Galloway's bedroom between the bed and the television. Some prints appeared to have been made by a stocking-clad foot and at least one print appeared to have been made by some type of shoe. Some of the prints differed in size. The tiles were photographed. A broken child's rocking chair, splattered with blood and missing a rocker and an armrest support, was found next to Mr. Galloway's body in the hallway. The house was dusted for fingerprints and some latent prints were found. The results of comparisons of these prints were not part of the trial testimony. Despite the use of sophisticated tests to recover fingerprints from the rocking chair, no prints were found.\n\nDr. Ronald O'Halloran, the Assistant Medical Examiner for Ventura County arrived at the Galloways' house around 5 p.m. He found Mr. Galloway's body in the hallway. Based upon the state of decomposition of the bodies, Dr. O'Halloran estimated the Galloways had been murdered two to three days before he examined them.\n\nDr. O'Halloran found Mrs. Galloway's body on a bed. She was lying on her back with her feet and legs extending over the side of the bed. Her legs were spread apart exposing her genitals. The body was nude from the waist down, except for two bootie socks. Her top was pulled up almost to her breasts. A pillow covered her head and blood was splattered on the wall. The police found Mrs. Galloway's panties on the floor just inside her bedroom door and her pajama bottoms near her husband's body.\n\nA VCR, a jewelry box containing jewelry, and the brown wallet in which Mr. Galloway habitually kept large amounts of cash were missing from the house. A black wallet containing $170 was found in Mr. Galloway's bedroom and a small pouch containing $34 was found pinned in Mr. Galloway's pajama bottoms.\n\nBetween October 20 and 24, Detective Billy Tatum interviewed Rick Albis, Mendoza, Clements and Val. None had injuries on their hands. Cerda was arrested on October 22; the little finger of his right hand was injured. Defendant was also arrested October 22. He had cuts on his fingers and knuckles and a bruise on his shoulder.\n\nIn a tape-recorded interview with detectives, defendant first gave an entirely exculpatory version of events. Defendant claimed he learned of the Galloway murders from some of his neighbors when he returned home from work on Monday afternoon and saw all of the police cars near the Galloways' home. Except for trips to the store to buy beer, defendant was home all night on Friday. He stayed home all day Saturday watching television and videotapes. On Sunday morning, he visited his ex-girlfriend. Later that afternoon, he held a barbecue for friends and family.\n\nAfter being confronted by the detectives with some obvious lies in his initial story, defendant modified his story. He maintained he did not kill anyone. He admitted, however, going to the Galloway home on Friday night. On Saturday, he returned to the Galloway house with Rick Albis and Mendoza to wipe away fingerprints.\n\nFinally, defendant stated that he, Mendoza, Albis and Cerda went to the Galloway house on Friday night. Defendant continued to deny that he killed anyone. Defendant was looking for money and Rick Albis was looking for a gun. Rick Albis took his shoes off so he would not leave shoe prints. At some point, Mrs. Galloway came out of the bedroom. Rick Albis hit her; knocked her down; and continued hitting her. Defendant could not say who moved Mrs. Galloway back to her room or who raped her. Cerda placed the pillow over her face and hit and shook her. Cerda also killed Mr. Galloway. Mendoza hit Mr. Galloway with his hand and a rocking chair. Defendant stated that he moved the broken rocking chair. Defendant, Mendoza and Rick Albis returned to the Galloway house on Saturday morning to wipe away fingerprints. Defendant used a face towel from his house for this purpose. He then wrapped two broken sticks from the rocking chair in the towel. Later that day, Mendoza threw the sticks and the VCR into the water.\n\n4. Physical Evidence\n\nDr. Frederick Lovell, Chief Medical Examiner for Ventura County, performed the autopsy on the body of William Galloway on October 22. He estimated Mr. Galloway died two to three days before his body was placed in the morgue refrigerator. The cause of Mr. Galloway's death was trauma to the brain. Mr. Galloway sustained a minimum of 13 blows, which produced injuries to Mr. Galloway's upper chest, right shoulder and head. One of the blows to the head was probably the lethal blow. The object used to administer the blows was hard and had an edge, but not a sharp cutting edge. Considerable force would have been necessary to produce the bruising found on the body. Evidence of defensive wounds was also found.\n\nAlso on October 22, Dr. O'Halloran performed the autopsy of Mrs. Galloway's body. Dr. O'Halloran opined the cause of Mrs. Galloway's death was also traumatic head injury. He found evidence of eight external and five internal injuries. At a minimum, Mrs. Galloway received two to three blows. If an object was used to administer the blows, it was blunt.\n\nBecause the crime scene suggested a sexual assault, Dr. O'Halloran examined the body's vaginal area. Dr. O'Halloran prepared vaginal swabs and pubic and scalp hair samples. He surgically removed Mrs. Galloway's vagina and attempted to invert it. During his examination of the vagina, he found an approximately one-half inch tear just inside the lower part of the vaginal opening. Dr. O'Halloran did not notice the tear when he first examined the body or when he removed the vagina. Since there was no hemorrhage related to the tear, Dr. O'Halloran believed he produced the tear when he attempted to turn the vagina inside out.\n\nSometime after the autopsy, Dr. O'Halloran tested the vaginal swabs for the presence of sperm and seminal fluid. None was detected. In his opinion, these findings did not rule out a rape, but he was unable to opine Mrs. Galloway definitely had been raped. The prosecution also called Dr. Bruce Woodling, a medical doctor and expert in sexual assault examinations. In Dr. Woodling's opinion, the tear in the vagina occurred as the result of penetration by a penis-like object and not Dr. O'Halloran's attempts to invert the vagina.\n\nCriminalist Edwin Jones, Jr., compared foreign hairs found on Mrs. Galloway's clothing to hair samples from defendant and other possible donors. Defendant's pubic hair exhibited a \"very unusual\" cuticle structure, which was also found in the foreign hairs. Based upon microscopic and electrophoresis examination, Mr. Jones concluded all of the foreign hairs could have been deposited by defendant, and the characteristics exhibited in the foreign pubic hairs would be found in only a very few people in the general population.\n\nThree foreign hairs were found in Mrs. Galloways panties. One foreign hair was a long pubic hair, the other two were leg hairs. Mrs. Galloway, Mendoza, Cerda, and Clements were eliminated as the source of these hairs by microscopic examination. Electrophoresis testing in the PGM (phosphoglucomutase) subgroup on the pubic hair further eliminated Mr. Galloway and Albis as the source of the hair. Thus, of the people defendant's statement placed in the Galloway house, only defendant's hair possessed the same PGM subgrouping and microscopic characteristics as the foreign hairs found in the panties.\n\nAccording to Mr. Jones, all of the other foreign hairs found on Mrs. Galloway's clothing also could have been deposited by defendant. A dark hair found in Mrs. Galloway's pajama bottoms, hairs found in Mrs. Galloway's pajama top, and three hairs found in Mrs. Galloway's socks were all microscopically similar to defendant's samples.\n\nIn photographs of the crime scene, Jones observed blood splatters on the walls next to where the bodies were located. The multiple blood splatters in the vicinity of Mr. Galloway's head suggested Mr. Galloway's head was very close to or on the floor when most of the blood was released. Most of the blood splatters near Mrs. Galloway's body were on the wall directly above the pillow that covered her face, from which Jones opined the blows took place while Mrs. Galloway was lying on the bed.\n\nJones was also given a blue jacket soaked in blood that was found at the crime scene. The jacket was a size small and would not have fit defendant.\n\nOn Wednesday, October 22, 1986, Officer Charles Hookstra recovered the Galloways' VCR from a drainage ditch off Perkins Road. He was unable to find the missing rocking chair pieces among the driftwood and trash in the ditch.\n\nDEFENSE CASE\n\nConsistent with his final statement to the police, defendant contended he entered the Galloway home to steal money, was present when the Galloways were murdered, but did not kill them.\n\nCriminalist Gregory Laskowski, an expert in footprint examination, compared the photographs of the crime scene footprints to controlled samples of footprints made by defendant and Mendoza. Mr. Laskowski eliminated Mendoza as the source of the prints. According to Mr. Laskowski, defendant did not make the whole-foot impressions found at the crime scene. Mr. Laskowski was not able to eliminate defendant as the possible source of two heel prints, because the prints did not possess sufficient individual identifying characteristics. Laskowski also opined it was unlikely the footprints were deposited six to ten hours after the murder, a time consistent with when defendant, Albis and Mendoza wiped away the fingerprints on Saturday.\n\nDr. Werner Spitz is the Medical Examiner for Wayne County, Michigan. Dr. Spitz agreed with Dr. O'Halloran that the absence of bleeding associated with Mrs. Galloway's vaginal tear indicated the tear occurred after death. Furthermore, Dr. Spitz testified that, in the vast majority of sexual assault cases he has investigated, semen and/or seminal fluid were found. Dr. Spitz opined, in the absence of evidence of trauma to the genitals, or semen or seminal fluid, no evidence substantiated a sexual assault. The presence of pubic hair would not be sufficient to alter his Conclusion. On cross-examination, Dr. Spitz conceded a rape can occur without leaving evidence of vaginal injury.\n\nDefendant called Trisha Greene and Richard Gifford to provide testimony inconsistent with Mendoza's testimony. Greene testified she had known Mendoza since grade school, approximately seven years. On Sunday morning, the day before the Galloways' bodies were discovered, Mendoza spoke with her, Cerda and Bill Miller at her home. At that time Mendoza was wearing a new jacket, shirt and hat, which he said his father bought. Mendoza described going to the Galloway house with \"Tracy\" on Saturday after the Galloways were dead. He described Mrs. Galloway lying on the bed with her head covered by a pillow. Mendoza also said he took a VCR, which he dumped in the reservoir.\n\nRichard Gifford testified that in October of 1986, Mendoza tried to sell him jewelry from an antique wooden box with carvings on its sides. Mendoza told Gifford he had stolen the box from a house in the neighborhood. Mendoza also tried to sell Gifford a VCR, which resembled a picture he was shown of the Galloways' VCR. During this time, defendant was down the street talking loudly with Cerda. Defendant kept glancing in the direction of Mendoza and Gifford.\n\nOn cross-examination, Gifford testified he saw defendant on Saturday afternoon at the 7-Eleven with a large roll of bills. Gifford thought defendant must have had over $1000. Defendant gave Gifford a $100 bill to buy some beer for him. Gifford went into the store and gave the bill to the cashier, Dean Geer. Later on Sunday afternoon, Gifford observed defendant still flashing money.\n\nPROSECUTION REBUTTAL\n\nDean Geer testified that on Saturday, October 18, he was employed at the 7-Eleven on Channel Islands Boulevard. In the late afternoon, Richard Gifford purchased some beer and cigarettes with a $100 bill. Dean knew Gifford, because he often helped Dean close the store in the evenings. Dean remembered the transaction, because it was unusual to receive such a large bill.\n\nArturo Mendoza is Mendoza's father. In October of 1986, Mr. Mendoza bought Anthony a new jacket and a baseball hat. Anthony also owned another jacket of a similar style that he was buying for himself at that time through Amway.\n\nGUILT PHASE ISSUES\n\nI. ADMISSION OF PHOTOGRAPHS INTO EVIDENCE\n\nDefendant contends he was prejudiced during both the guilt and penalty phases by the admission into evidence during the guilt phase of 29 photographs: photographs of Modena Galloway's body as discovered by the police at the crime scene, autopsy photographs of Modena Galloway's excised and inverted vagina; an autopsy photograph of Modena Galloway's face; photographs of William Galloway's body as discovered by the police at the crime scene; and autopsy photographs of William Galloway's body and face. Defendant claims these photographs were cumulative, gruesome, inflammatory and irrelevant. He contends the admission of these photographs into evidence violated his Fifth and Fourteenth Amendment rights to due process, his Eighth Amendment right to a reliable verdict in a capital case and his Sixth Amendment right to a fair jury trial. He also claims his trial counsel rendered ineffective assistance by failing to object to the admission of these photographs.\n\nBecause trial counsel did not object to the admission of any of these photographs, defendant's objections are waived. (E.g., People v. Turner (1990) 50 Cal. 3d 668, 706, 268 Cal. Rptr. 706, 789 P.2d 887.) Contrary to defendant's contention, no special exception to this rule of waiver exists for capital cases. (Ibid.; People v. Pinholster (1992) 1 Cal. 4th 865, 935, 824 P.2d 571.)\n\nDefendant further contends the trial court had a sua sponte duty to conduct an independent review of the photographs pursuant to Evidence Code section 352. As we have previously recognized, \"while a court may exercise such authority under Evidence Code, section 352 [citations], the failure to so act cannot be urged on appeal as error.\" (People v. Visciotti (1992) 2 Cal. 4th 1, 53, fn. 19, 825 P.2d 388.)\n\nDefendant also contends trial counsel's failure to object to the admission of these photographs constituted ineffective assistance of counsel. In order to prevail on this claim defendant must prove (1) his attorney's representation was deficient in that it fell below an objective standard of reasonableness under prevailing professional norms, and (2) his attorney's deficient representation subjected him to prejudice. (Strickland v. Washington (1984) 466 U.S. 668, 687, 80 L. Ed. 2d 674, 104 S. Ct. 2052; In re Wilson (1992) 3 Cal. 4th 945, 950, 838 P.2d 1222.) Prejudice for purposes of this analysis is demonstrated by showing a reasonable probability that, but for trial counsel's failings, the result would have been more favorable for the defendant. A reasonable probability is a probability sufficient to undermine confidence in the outcome. (Ibid.) Defendant's claim fails, because he is unable to demonstrate prejudice from counsel's failure to object.\n\nContrary to defendant's contentions, we conclude the bulk of the photographs would have been properly admitted even if trial counsel had proffered the objections now urged. Our Conclusion is based upon our independent review of the photographs in question.\n\nAlthough several of the photographs are highly unpleasant to observe, none of the photographs are unduly gruesome or inherently inflammatory. Moreover, each photograph was relevant to the prosecution's case. The photographs of the victims at the crime scene and the autopsy photographs of the wounds received by the victims were relevant to the prosecution contentions that defendant was the actual killer, intended to kill his victims, and did so during the commission of robbery and rape. (E.g., People v. Wash (1993) 6 Cal. 4th 215, 245-246, 861 P.2d 1107; People v. Pride (1992) 3 Cal. 4th 195, 243, 833 P.2d 643.) The photographs of the excised vagina were relevant to the question of whether Modena Galloway was raped. The photographic evidence could assist the jury in evaluating the expert testimony on this subject. (Cf. People v. Price (1991) 1 Cal. 4th 324, 441, 821 P.2d 610.)\n\nAssuming certain photographs were cumulative of others, there is no reasonable probability trial counsel's failure to object on this ground affected the verdicts. The overlap between photographs was not substantial. Given this fact and the strong, albeit circumstantial, evidence linking defendant to the murders and rape, confidence in either the guilt or penalty phase verdicts is not undermined by the admission of any redundant photographic evidence. We repeatedly have rejected the argument photographs of a murder victim should be excluded as cumulative if the photographs are offered to prove facts established by testimony. (E.g., People v. Price, supra, 1 Cal. 4th at p. 441.) Defendant presents no persuasive reason for us to depart from our prior rulings.\n\nDefendant fails to establish ineffective assistance of counsel. Moreover, since the photographs in question were relevant, admissible evidence, defendant also fails to establish a violation of any other federal constitutional right by their admission into evidence.\n\nII. PARTIAL CONCESSION OF GUILT\n\nDefendant next asserts his constitutional rights were violated by certain admissions made in defense counsel's opening and closing guilt phase arguments. In particular, defendant argues defense counsel was ineffective, because he told the jury defendant was guilty of burglary and multiple felony murder.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Defendant equates these statements with a guilty plea on those charges. He therefore also faults the trial court for not intervening to obtain a personal, on-the-record waiver consistent with Boykin v. Alabama (1969) 395 U.S. 238, 23 L. Ed. 2d 274, 89 S. Ct. 1709 and In re Tahl (1969) 1 Cal. 3d 122, 81 Cal. Rptr. 577, 460 P.2d 449.\n\nWe have held trial counsel's decision not to contest, and even expressly to concede, guilt on one or more charges at the guilt phase of a capital trial is not tantamount to a guilty plea requiring a Boykin-Tahl waiver. (People v. Griffin (1988) 46 Cal. 3d 1011, 1029; People v. Hendricks (1987) 43 Cal. 3d 584, 592-594, 238 Cal. Rptr. 66, 737 P.2d 1350.) It is not the trial court's duty to inquire whether the defendant agrees with his counsel's decision to make a concession, at least where, as here, there is no explicit indication the defendant disagrees with his attorney's tactical approach to presenting the defense. (See People v. Freeman (1994) 8 Cal. 4th 450, 497, 882 P.2d 249; People v. Griffin, supra, 46 Cal. 3d at p. 1029; People v. Hendricks, supra, 43 Cal. 3d at 593-594.)\n\nNext we turn to defendant's claim his counsel's concessions constituted ineffective assistance of counsel. As we previously have recognized, \"to the extent defendant is arguing that it is necessarily incompetence for an attorney to concede his or her client's guilt of murder [or burglary and murder as in this case], the law is otherwise.\" (People v. Mayfield (1993) 5 Cal. 4th 142, 177, 852 P.2d 331.) Furthermore, as pointed out above, the record does not demonstrate counsel ignored \"any express wish on defendant's part to present an active defense\" with regard to either the felony-murder or burglary counts. (Ibid.)\n\nDefendant also appears to argue his counsel's concessions were an incompetent tactical choice. We disagree. Defendant admitted to the police on tape he was inside the victims' residence when they were murdered and he entered the residence with the intent to steal money. His taped statement was played to the jury. Defendant's admission that he entered the residence for the purpose of stealing money proved his specific intent to commit burglary. (Pen. Code, §§ 459, 460; 2 Witkin, Cal. Criminal Law (2d ed. 1988) § 656, pp. 736-737.) Under the felony-murder rule, his commission of burglary, together with the killing of the victims in the commission of the burglary, made him liable for murder. (1 Witkin, Cal. Criminal Law (2d ed. 1988) § 470, pp. 528-529.) Under these circumstances, we cannot conclude counsel was ineffective for candidly admitting defendant's guilt on these counts (People v. Freeman, supra, 8 Cal. 4th at p. 498; People v. Mayfield, supra, 5 Cal. 4th at p. 177; People v. Jackson (1980) 28 Cal. 3d 264, 292-293, 168 Cal. Rptr. 603, 618 P.2d 149), while vigorously arguing against defendant's guilt of the special circumstances.\n\nIII. ADMISSION OF VIDEOTAPED STATEMENT INTO EVIDENCE\n\nOn October 21, 1986, the day following the discovery of the Galloways' bodies, Larry Good, a local television news reporter, briefly interviewed defendant, in his capacity as a neighbor of the victims. During the course of this interview, Good asked defendant: \"I guess there's no, no idea who would do something like this, huh?\" Defendant responded: \"Uh-uh . . . not that I know of . . . I don't know nothing about that.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Over defendant's objections and following a lengthy hearing, the trial court permitted the videotape to be shown to the jury and admitted into evidence.\n\nDefendant now contends the trial court erred and the improper admission of the videotape violated his due process rights under the Fifth and Fourteenth Amendments to the federal Constitution, as well as his right to a reliable and non-arbitrary sentencing determination under the Eighth Amendment. We reject defendant's claims and conclude the trial court did not abuse its discretion in admitting the videotape.\n\nDefendant initially claims the videotaped statement should have been excluded as irrelevant. \"'Relevant evidence' means evidence, including evidence relevant to the credibility of a witness or hearsay declarant, having any tendency in reason to prove or disprove any disputed fact that is of consequence to the determination of the action.\" (Evid. Code, § 210.) As we have repeatedly observed, the trial court is \"vested with wide discretion in determining relevance under this standard.\" (E.g., People v. Kelly (1992) 1 Cal. 4th 495, 523, 822 P.2d 385.)\n\nThe trial court concluded defendant's statement to the reporter denying any knowledge of the crimes could be found by the jury to be a false statement inconsistent with both (1) his police interview statement proclaiming he was present during the crimes, but Albis and Cerda committed the murders, and (2) the prosecution's strong, albeit circumstantial, evidence defendant committed the murders. The trial court reasoned defendant's denial of knowledge of the crimes, taken together with his subsequent statements to the police, reasonably could be viewed as part of an evolving plan to evade responsibility and deflect blame for the crimes. Therefore, the trial court concluded defendant's videotaped statement could tend to prove consciousness of guilt and, thus, the identity of the murderer. (E.g., People v. Green (1980) 27 Cal. 3d 1, 41, 164 Cal. Rptr. 1, 609 P.2d 468.) We find no error in the trial court's reasoning.\n\nDefendant further contends the prosecution failed to lay a foundation that defendant's statement was wilfully or deliberately false. (See People v. Albertson (1944) 23 Cal. 2d 550, 581-582, 145 P.2d 7 (conc. opn. of Traynor, J.); People v. Mickey (1991) 54 Cal. 3d 612, 671-672, 286 Cal. Rptr. 801, 818 P.2d 84.) Assuming, without deciding, this objection was not waived by failure to raise it at trial, we conclude the circumstances surrounding the videotaped statement, and the patent inconsistencies between the statement and defendant's subsequent statement to the police, provided the necessary foundation.\n\nDefendant claims the reporter's question regarding defendant's knowledge of the crimes was so ambiguous as to render defendant's response irrelevant or at least more prejudicial than probative. Again, assuming, without deciding, this objection was not waived by failure to raise it during trial, we reject defendant's contention as meritless. The question as reasonably construed called for any knowledge defendant possessed regarding the perpetrator of the crimes.\n\nDefendant also contends that, even if the substance of his statement to the reporter was relevant and admissible, his demeanor as shown by the videotape was either irrelevant or more prejudicial than probative under Evidence Code section 352. For these reasons, defendant asserts the trial court erred by failing to compel the prosecution to accept defendant's proposed stipulation to introduction of the contents of the statement, without introduction of the videotape itself, or by failing to exclude the videotape altogether. Again, we find no abuse of discretion by the trial court.\n\nThe trial court did not abuse its discretion in deciding defendant's demeanor was relevant. The jury was permitted to decide whether defendant's pretrial statements were false. Defendant's demeanor when making one of these statements is highly probative on this issue. Because the videotape presentation thus contained relevant information not covered by the defendant's proposed stipulation, the prosecutor was not required to accept the stipulation in lieu of showing the videotape. (People v. Edelbacher (1989) 47 Cal. 3d 983, 1007, 254 Cal. Rptr. 586, 766 P.2d 1; see also People v. Karis (1988) 46 Cal. 3d 612, 640, 250 Cal. Rptr. 659, 758 P.2d 1189.)\n\nWe also consider defendant's claim the trial court should have excluded the videotape on the basis of undue prejudice. A trial court's exercise of discretion in admitting or rejecting evidence pursuant to Evidence Code section 352 \"will not be disturbed on appeal unless there is a manifest abuse of that discretion resulting in a miscarriage of Justice.\" (People v. Milner (1988) 45 Cal. 3d 227, 239, 246 Cal. Rptr. 713, 753 P.2d 669.) Here there was no such abuse. The trial court carefully balanced the probative value of the videotape against its potential for prejudice to defendant. On this record, we find no reason to disturb the trial court's ruling. Furthermore, because the evidence was admissible, there was no violation of defendant's federal constitutional rights.\n\nIV. INSTRUCTIONAL ERROR\n\nA. CALJIC No. 2.03\n\nDefendant contends the trial court erred in instructing the jury on the subject of consciousness of guilt with CALJIC No. 2.03.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Specifically, defendant argues this instruction improperly permitted the jury to infer \"since [defendant] made false statements . . . at the time of the event he had a specific intent to steal and a specific intent to kill.\"\n\nDefendant's argument is belied by the text of the instruction itself. The instruction on its face did not address the specific intent issues, which were governed by other instructions. CALJIC No. 2.03 instructed the jury only to consider defendant's false statement as a circumstance tending to prove consciousness of guilt; the instruction cautioned the jury the statement standing alone is \"not sufficient by itself to prove guilt.\" (See People v. Kelly, supra, 1 Cal. 4th at p. 531.) We presume the jury followed the instruction as given. (E.g., People v. Frank (1990) 51 Cal. 3d 718, 728, 274 Cal. Rptr. 372, 798 P.2d 1215.) Under these circumstances, the jury could not have been misled by CALJIC No. 2.03 into improper inferences regarding defendant's specific intent at the time the crimes were committed. Accordingly, defendant fails to demonstrate instructing the jury with CALJIC No. 2.03 violated his constitutional rights.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nB. CALJIC No. 2.11.5\n\nDefendant next contends the trial court erred by instructing the jury with an unmodified version of CALJIC No. 2.11.5, which told the jury to disregard, for purposes of determining defendant's guilt, the nonprosecution of other persons allegedly involved in the crimes.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Defendant contends this instruction undermined other instructions regarding accomplice testimony, thereby unfairly restricting the jury's evaluation of the testimony of Mendoza and Albis.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In particular, defendant contends this instruction barred the jury from considering any bias in these witnesses' testimony resulting from grants of immunity.\n\nWe previously rejected this specific claim under substantially similar circumstances. (People v. Price, supra, 1 Cal. 4th at pp. 445-446.) In so doing, we explained: \"The purpose of the challenged instruction is to discourage the jury from irrelevant speculation about the prosecution's reasons for not jointly prosecuting all those shown by the evidence to have participated in the perpetration of the charged offenses, and also to discourage speculation about the eventual fates of unjoined perpetrators. (People v. Cox (1991) 53 Cal. 3d 618, 668, 280 Cal. Rptr. 692, 809 P.2d 351.) When the instruction is given with the full panoply of witness credibility and accomplice instructions, as it was in this case, [jurors] will understand that although the separate prosecution or nonprosecution of coparticipants, and the reasons therefor, may not be considered on the issue of the charged defendant's guilt, a plea bargain or grant of immunity may be considered as evidence of interest or bias in assessing the credibility of prosecution witnesses. (People v. Sully [1991] 53 Cal. 3d 1195, 1219, 283 Cal. Rptr. 144, 812 P.2d 163.) Although the instruction should have been clarified or omitted (see People v. Cox, supra, [53 Cal. 3d] at p. 667; People v. Williams (1988) 45 Cal. 3d 1268, 1313, 248 Cal. Rptr. 834, 756 P.2d 221), we cannot agree that giving it amounted to error in this case.\" (People v. Price, supra, 1 Cal. 4th at p. 446.) Here, as in Price, standard instructions on accomplice testimony were given; the Price analysis is thus dispositive of defendant's claim.\n\nC. CALJIC No. 8.11\n\nThe trial court instructed the jury on implied malice in terms of CALJIC No. 8.11 (1983 rev.).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e As the Attorney General concedes, the trial court erred by giving this instruction. The case against defendant was tried on a felony-murder theory; therefore, malice, whether express or implied, was irrelevant. (See People v. Dillon (1983) 34 Cal. 3d 441, 475, 194 Cal. Rptr. 390, 668 P.2d 697.)\n\nDefendant contends the implied malice instruction misled the jury in two respects. First, defendant asserts the instruction injected confusion into the intent instructions properly given under the felony-murder theory. Second, defendant asserts the implied malice instruction prevented the jury from properly understanding that intent to kill was a necessary element of the special circumstance charges.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e We do not believe, however, there is \"a reasonable likelihood\" the jury understood the instructions as the defendant asserts. (Estelle v. McGuire (1991) 502 U.S. 62, 72 [116 L. Ed. 2d 385, 112 S. Ct. 475].) In making this determination, we have considered the specific language challenged, the instructions as a whole and the jury's findings. (People v. Mincey (1992) 2 Cal. 4th 408, 451, 827 P.2d 388; People v. Kelly, supra, 1 Cal. 4th at pp. 525-526.)\n\nThe trial court, using modified versions of CALJIC Nos. 3.31 (1980 rev.) and 8.21, correctly instructed the jury that the intent necessary to find defendant guilty of first degree murder under the felony-murder theory was a specific intent to commit one or more of the felonies underlying the charge. The trial court also correctly instructed the jury on the elements of the underlying felonies. (See CALJIC Nos. 14.50 (1981 rev.), 9.10 (1982 rev.).) In light of these instructions, which clearly applied to the evidence presented and the arguments made during the trial, we do not find a reasonable likelihood the unnecessary definition of implied malice included in the instructions misled the jury about the intent necessary to convict defendant of murder under a felony-murder theory. When the instructions are viewed as a whole, it is clear the implied malice instruction related only to the general definition of murder given to the jury. The jurors would not have been misled by the inclusion of this surplus instruction. (See People v. Williams (1988) 45 Cal. 3d 1268, 1310-1311, 248 Cal. Rptr. 834, 756 P.2d 221; People v. Duncan (1991) 53 Cal. 3d 955, 972-973, 281 Cal. Rptr. 273, 810 P.2d 131 [inclusion of malice in definition of murder, where case tried on felony murder theory, not prejudicial].)\n\nNext, defendant asserts there is a reasonable likelihood the jury was misled by the implied malice instruction when assessing the intent necessary to find him guilty of the special circumstances charged, because no instruction was given specifically differentiating the intent to kill required for the special circumstances findings from the mental state required for implied malice murder. Furthermore, defendant contends the jury confusion was compounded by the references to \"mental state,\" as opposed to \"intent to kill,\" found in the instruction addressing the sufficiency of circumstantial evidence necessary to support a special circumstances finding.\n\nWe find no reasonable likelihood the erroneously given implied malice instruction would have misled the jury in assessing defendant's culpability for the special circumstances charged. The trial court instructed the jury with a modified version of CALJIC No. 8.81.17 (1984 rev.), which specified the felony-murder special circumstances could not be found true unless the prosecution proved \"that the defendant intended to kill a human being or intended to aid another in the killing of a human being.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The same information was also imparted with a modified CALJIC No. 8.80 (1984 rev.), which told the jury defendant's intent to kill, or intent to aid in killing, had to be proven beyond a reasonable doubt.\n\nIn light of these specific and clear instructions, we find no reasonable likelihood the surplus implied malice instruction would have misled a reasonable jury in reaching verdicts on the special circumstances.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Our finding is buttressed by the prosecutor's express acknowledgment, in his summation, that the special circumstances required intent to kill. (See People v. Kelly, supra, 1 Cal. 4th at p. 526 [closing arguments correctly explaining relevant law considered in evaluating prejudice from erroneous jury instruction]; People v. Moore (1988) 47 Cal. 3d 63, 87-89, 252 Cal. Rptr. 494, 762 P.2d 1218 [closing arguments demonstrate adequacy of instruction on issue of corroboration required for accomplice testimony].)\n\nD. CALJIC Nos. 4.21 and 4.22\n\nDefendant next alleges the jury was not properly informed voluntary intoxication could negate the intent to kill required for the special circumstances. He faults the trial court for giving the version of CALJIC No. 4.21 (1981 rev.) requested by defense counsel and for giving CALJIC No. 4.22 (1981 rev.), which defines voluntary intoxication.\n\nDefendant's jury was instructed on the interplay between intent and voluntary intoxication as follows: \"[P] In the crime of murder of which defendant is accused in Counts 1 and 2 of the information, a necessary element is the existence in the mind of the defendant of the specific intent to kill. [P] If the evidence shows that defendant was intoxicated at the time of the alleged offense, the jury should consider his state of intoxication in determining if defendant had such specific intent. [P] If from all the evidence you have a reasonable doubt whether defendant formed such specific intent, you must give the defendant the benefit of the doubt and find that he did not have such specific intent.\" The standard definition of voluntary intoxication followed. Instructions on the special circumstances allegations preceded and followed the voluntary intoxication instructions.\n\nDefendant first contends that under these instructions the jury would not have understood voluntary intoxication could negate the intent required for the special circumstances. Rather, the jury, he asserts, would have incorrectly construed CALJIC No. 4.21 as adding an intent element to felony murder. We do not find a reasonable likelihood the jury understood the instructions as defendant contends.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nFirst, the voluntary intoxication instruction referred to \"the crime of murder of which defendant is accused in Counts 1 and 2 of the information.\" The special circumstances were alleged under the murder counts charged in counts 1 and 2 of the information. Furthermore, the jury was instructed, through versions of CALJIC Nos. 8.80, 8.81.3 and 8.81.7, within close proximity of the voluntary intoxication instructions that intent to kill was a necessary element of the special circumstances. The jury was not instructed that intent to kill was an element of felony murder, and was indeed told an \"unintentional or accidental\" killing could be murder under that doctrine. (See CALJIC No. 8.21.) Finally, both attorneys discussed the intent to kill requirement of the special circumstances in their summations. Under these circumstances, we believe the instructions taken as a whole were understood as allowing voluntary intoxication to be considered in relation to the intent to kill requirement of the special circumstances.\n\nWe also find no error in the court's instructing the jury with CALJIC No. 4.22. We are not persuaded there is any likelihood the standard definition of voluntary intoxication found in this instruction negatively affected the jury's deliberations.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nDefendant also complains of the court's giving the standard pattern instructions on circumstantial evidence (CALJIC No. 2.01 (1979 rev.)), and circumstantial evidence relating to special circumstances (CALJIC Nos. 8.83 and 8.83.1). His claims of error in these instructions have been repeatedly rejected by this court. (People v. Freeman, supra, 8 Cal. 4th at pp. 505-506; People v. Jennings (1991) 53 Cal. 3d 334, 386, 279 Cal. Rptr. 780, 807 P.2d 1009.) Defendant advances no persuasive reason for us to reconsider our prior decisions.\n\nV. INSUFFICIENCY OF EVIDENCE OF INTENT TO KILL\n\nDefendant next contends the jury's implied findings of intent to kill in connection with the special circumstances are not supported by sufficient evidence. We disagree.\n\nThe standard of review is well established. \"'In reviewing the sufficiency of evidence for a special circumstance' - as for a conviction - 'the question we ask is whether, after viewing the evidence in the light most favorable to the People, any rational trier of fact could have found the essential elements of the allegation beyond a reasonable doubt.'\" (People v. Rowland (1992) 4 Cal. 4th 238, 271, 841 P.2d 897, quoting People v. Mickey, supra, 54 Cal. 3d at p. 678, italics in original.)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e \"In a case, such as the present one, [where the finding is] based upon circumstantial evidence, we must decide whether the circumstances reasonably justify the findings of the trier of fact, but our opinion that the circumstances also might reasonably be reconciled with a contrary finding would not warrant reversal of the judgment. [Citation.]\" (People v. Proctor (1992) 4 Cal. 4th 499, 528-529, 842 P.2d 1100.)\n\nOur review of the record reveals substantial evidence from which a rational jury could find beyond a reasonable doubt defendant possessed the requisite intent to kill the Galloways. First, sufficient evidence was present from which a rational jury could find defendant personally killed the Galloways. Defendant admitted he entered the Galloway house, albeit with others, on the evening of the murders in order to steal money. Defendant's hand was injured the night of the murders. Expert testimony linked leg and pubic hair found on Mrs. Galloway's clothes to defendant. Mendoza testified he observed defendant with blood on his clothing. Mendoza also testified defendant told his party guests he had \"knocked them smooth out\" or that he had \"blipped somebody.\"\n\nSecond, sufficient evidence was presented from which a rational jury could conclude beyond a reasonable doubt the assailant, defendant, possessed the specific intent to kill the Galloways. While not determinative, the nature of the Galloways' wounds, multiple blows to the head and body, supports an inference their assailant intended to kill them. (Cf. People v. Mincey, supra, 2 Cal. 4th at pp. 433-434 [nature of wounds probative of intent to torture]; People v. Proctor, supra, 4 Cal. 4th at pp. 529-530 [nature of killing probative of premeditation and deliberation].) Moreover, the prosecutor presented evidence that the victims knew defendant, and that lighting conditions in the victims' home would have enabled them to identify defendant. Finally, the crime scene evidence, and defendant's statement, suggested missing pieces of the child's rocking chair had been used in one or both of the killings; the assailant, the jury could infer, had deliberately taken the chair from the living room to the hallway and torn it apart for use as a weapon, again indicating an intent to kill or seriously injure. In light of this evidence, a rational jury could conclude beyond a reasonable doubt defendant intended to kill the victims in order to prevent them from identifying him.\n\nFinally, a rational jury could conclude beyond a reasonable doubt defendant's intoxication on the night of the murders did not negate his intent to kill. Little evidence was presented from which the jury could Judge the effects of the defendant's voluntary intoxication. Defendant smoked an unspecified quantity of cocaine and may have consumed an unspecified quantity of beer and marijuana. The only testimony relating to the effect of whatever substances defendant consumed the night of the murders was the testimony of defendant's neighbor Mark Pina. Pina testified defendant looked \"sprung\" and exhibited the following symptoms of cocaine usage: \"talks fast, repeats things, and you try and tell them something and it doesn't -- they don't seem to hear it.\" Contrary to defendant's contention, this sparse evidence does not compel us to find that the only rational Conclusion a jury could have reached was defendant was incapable of forming a specific intent to kill due to his voluntary intoxication. (Cf. People v. Williams, supra, 45 Cal. 3d at pp. 1311-1312 [witness's testimony defendant acted like he consumed LSD insufficient to support instruction on voluntary intoxication]; People v. Carr (1972) 8 Cal. 3d 287, 294-295, 104 Cal. Rptr. 705, 502 P.2d 513 [evidence defendant consumed unspecified quantity of alcohol or drugs insufficient to support instruction on diminished capacity].)\n\nOn this record, a rational jury could have concluded beyond a reasonable doubt defendant intentionally killed the Galloways.\n\nVI. CONTENTIONS RELATING TO ATTEMPTED RAPE\n\nDefendant raises several objections relating to the attempted rape special circumstance. We address defendant's contentions in turn.\n\nA. Inadequate Notice\n\nDefendant asserts he received inadequate notice the prosecution was relying upon attempted rape as an alternate basis to support the rape special circumstance. Defendant claims the failure specifically to charge attempted rape as a basis of the rape special circumstance violated his statutory rights under sections 190.1, 190.2 and 190.4 and his constitutional rights of due process, equal protection and notice of the charges against him.\n\nThe original information, the first amended information and the second amended information charged defendant with rape and alleged a special circumstance of murder while engaged in the commission of rape. The second amended information pleaded the rape special circumstance as follows: \"It is further alleged the murder of Modena Shores Galloway was committed by defendant, TRACY CAIN, while the defendant was engaged in the commission of rape in violation of Penal Code Section 261, within the meaning of section 190.2(a)(17).\" Section 190.2, subdivision (a)(17) states in relevant part: \"The murder was committed while defendant was engaged in or was an accomplice in the commission of, attempted commission of, or the immediate flight after committing or attempting to commit the following felonies: [P] . . . [P] (iii) Rape in violation of Section 261.\" (Italics added.)\n\nFollowing the prosecutor's rebuttal argument in which the prosecutor stressed a finding of attempted rape was sufficient to find defendant guilty of the rape special circumstance, the trial court raised the issue of whether the information had provided defendant with sufficient notice of the attempted rape basis of the special circumstance. The court stated its inquiry was triggered by the fact the information specifically enumerated attempted robbery in the robbery special circumstance allegation, but did not specifically enumerate attempted rape in the rape special circumstance allegation. Under these circumstances, the court wished to ascertain whether defense counsel believed he had been misled. The prosecutor reminded the court he had argued attempted rape in his opening statement and attempted rape was included in the agreed jury instruction for the special circumstances. Defense counsel stated he was aware of the differences in the language used in the information, but he also was familiar with section 190.2. He was not surprised by the prosecutor's argument, believed the prosecutor had the right to make the argument, and believed his client was not prejudiced by the prosecutor's reliance upon attempted rape as a basis for the rape special circumstance.\n\nWe find no statutory error in the language used to allege the rape special circumstance. Although consistency in the form of charging special circumstances is preferable, the rape special circumstance as alleged satisfactorily \"charged\" defendant and was not misleading. ( §§ 190.1, subds. (a) \u0026 (c); 190.4, subd. (a).) Under the statute, the rape special circumstance specifically includes that the crime was committed during the \"attempted commission of a rape.\" ( § 190.2, subd. (a)(17).) The information specifically referred to the statute defining the special circumstance. Under these circumstances, the rape special-circumstance allegation provided the express notice of the charges against defendant required under state law in a capital case. (See People v. Morris (1988) 46 Cal. 3d 1, 17, 249 Cal. Rptr. 119, 756 P.2d 843, disapproved on other grounds, In re Sassounian 9 Cal. 4th 535, 543-544, fn. 5, 887 P.2d 527 [purpose of charging requirement of section 190.4 in capital cases is to provide defendant with express notice of felony underlying special circumstance or felony-murder theory].)\n\nFurthermore, since the information was sufficient to provide the required notice, and defendant's counsel stated defendant was neither surprised nor prejudiced by the argument and instructions relating to attempted rape as the basis of the rape special circumstance, defendant's constitutional right to notice of the charges against him was not compromised. (Cf. People v. Crawford (1990) 224 Cal. App. 3d 1, 7-9, 273 Cal. Rptr. 472 [defendant's rights not compromised where circumstances of trial provided notice that prosecution was proceeding under felony-murder theory]; People v. Scott (1991) 229 Cal. App. 3d 707, 712-718, 280 Cal. Rptr. 274 [same].)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nB. Instructing with Modified Version of CALJIC No. 8.81.17\n\nDefendant contends the version of CALJIC No. 8.81.17 given to the jury was misleading. The jury was instructed:\n\n\"To find the special circumstance referred to in these instructions as murder in the commission of a burglary, a robbery or a rape, is true, it must be proved:\n\n\"1. That the murder was committed while the defendant was engaged in or was an accomplice in the commission or attempted commission of a burglary, a robbery, or a rape.\n\n\"2. That the defendant intended to kill a human being or intended to aid another in the killing of a human being.\n\n\"3. That the murder was committed in order to carry out or advance the commission of the crime of a burglary, a robbery, or a rape or to facilitate the escape therefrom or to avoid detection. In other words, the special circumstances referred to in these instructions is [sic] not established if the burglary, robbery or rape was merely incidental to the commission of the murder.\" (Emphasis added.)\n\nDefendant contends the failure in the third paragraph of the instruction to refer explicitly to attempted rape permitted the jury to ignore the question whether the acts constituting attempted rape \"were merely collateral to and occurred subsequent to the commission of the murder.\" We find no reasonable likelihood the jury interpreted the instruction as defendant suggests. (Estelle v. McGuire, supra, 502 U.S. at p. 72 [116 L. Ed. 2d 385, 400].) Rather, it is obvious from the challenged instruction, the special verdict forms, and other instructions given (e.g., CALJIC No. 8.80), the court used \"burglary, robbery or rape\" as generic terms for the special circumstances, which also included the attempted commission of these crimes. Therefore, the failure specifically to include the word \"attempt\" in the third paragraph of the instruction could not have misled the jury.\n\nC. Failure to Instruct on Elements of Attempt\n\nThe trial court instructed defendant's jury on the elements of an attempted rape special circumstance in terms of CALJIC No. 8.81.17 and on the elements of rape in terms of CALJIC No. 10.00. Neither party requested and the trial court did not instruct the jury on the elements of attempt as set forth in CALJIC No. 6.00. The jury found defendant not guilty of the separate rape count, but specifically found defendant guilty of the attempted rape special circumstance. The Attorney General concedes the failure to instruct the jury on the elements of an attempt was error.\n\nDefendant argues the failure to instruct is reversible per se. Defendant is wrong. The omission of instruction on the elements of a special circumstance is subject to harmless error analysis. (People v. Odle (1988) 45 Cal. 3d 386, 410-416, 247 Cal. Rptr. 137, 754 P.2d 184 [failure to instruct on elements of peace-officer-murder special circumstance].) In this case, we are convinced the omission of the instruction defining attempt was harmless beyond a reasonable doubt and did not affect the jury's verdict.\n\nCALJIC No. 6.00 (5th ed. 1988 bound vol.) states: \"[P] An attempt to commit a crime consists of two elements, namely, a specific intent to commit the crime, and a direct but ineffectual act done toward its commission.\" As the Attorney General persuasively argues, insofar as relevant here this instruction merely restates the common meaning of \"attempt.\" To attempt an act is to \"try\" or \"endeavor to do or perform\" the act. (Webster's New Internat. Dict. (2d ed. 1958) p. 177.) Defendant could not \"try\" to rape Modena Galloway without intending to do so and doing an act toward the rape's commission. In finding defendant attempted or tried to rape Modena Galloway, the jury thus necessarily considered and found to be true the elements set forth in CALJIC No. 6.00. As the prosecutor argued to the jury in his closing statement, no explanation other than rape or attempted rape was sufficient to explain the position of Modena Galloway's body and the presence of the pubic and body hairs in her clothes. Under these circumstances, we conclude omission of the attempt instruction did not contribute to the verdict obtained; the jury necessarily made the requisite findings necessary to hold defendant liable for this special circumstance. Our Conclusion precludes finding prejudice, whether under the federal constitutional standard (Chapman v. California (1967) 386 U.S. 18, 24, 17 L. Ed. 2d 705, 87 S. Ct. 824; Yates v. Evatt (1991) 500 U.S. 391, 114 L. Ed. 2d 432, 111 S. Ct. 1884) or that for state law error (People v. Watson (1956) 46 Cal. 2d 818, 836, 299 P.2d 243). For the same reason, defendant's related claim of ineffective assistance of counsel in failing to request a definitional instruction is also unavailing.\n\nD. Failure to Instruct Intoxication Can Negate Specific Intent to Rape\n\nThe trial court instructed the jury on the effect of intoxication, but, at the request of defense counsel, limited the application of the instruction to the intent to kill element of the special circumstances. Defendant contends he was prejudiced by the failure of the court to instruct the jury intoxication also can be considered in determining the existence of specific intent to rape.\n\nAs already noted, defense counsel's request for the instruction bars this contention under the doctrine of invited error. (People v. Cooper, supra, 53 Cal. 3d at p. 831; People v. Marshall, supra, 50 Cal. 3d at pp. 931-932.) Any error, moreover, was clearly harmless. Because the jury found all of the special circumstances to be true, we know the jury rejected defendant's claim that voluntary intoxication negated the specific intent to kill elements of the special circumstances. No evidence was presented from which a jury rationally could have found defendant, despite his asserted intoxication, intended to kill Mr. and Mrs. Galloway, but because of that same intoxication did not form the intent to rape Mrs. Galloway. By finding defendant attempted to rape Mrs. Galloway, the jury necessarily found the requisite intent. Any error was thus harmless under either federal or state standards. Again, the related claim of ineffective assistance of counsel fails for the same reason.\n\nE. Sufficiency of Evidence\n\nDefendant next contends the record lacks substantial evidence to support the jury's findings (1) he specifically intended to rape; (2) he committed attempted rape; and (3) Modena Galloway's murder occurred during the commission of attempted rape. Applying the standard of review set forth, ante, at page __ [typed maj. opn. at pp. 31-32], we reject defendant's claims.\n\nDefendant contends the record is devoid of evidence of specific intent to rape. A rational jury, however, clearly could have concluded otherwise. Modena Galloway's body was found in a position and state of dress suggestive of rape or some type of sexual assault. Body and pubic hairs similar to defendant's, and unlike those of others possibly involved in the crimes, were found in Modena Galloway's panties, pajama top, and socks. The jury rationally could conclude defendant partially unclothed himself and the victim for the purpose of sexual intercourse.\n\nDefendant next contends the evidence is insufficient to support a finding he was the rapist. He specifically attacks what he believes is the inconclusiveness of the hair identification testimony. However, this testimony, if believed and construed favorably to the People, eliminated as the source of the hairs found on Mrs. Galloway's clothing all persons defendant claimed were present at the murders with the exception of defendant. It thus provided substantial evidence from which a rational jury could conclude defendant was the person who attempted to rape Modena Galloway. This evidence was further buttressed by the substantial evidence defendant committed the other crimes against the Galloways alone.\n\nThe felony-murder special circumstance ( § 190.2, subd. (a)(17)) requires that the murder was committed \"while the defendant was engaged in or was an accomplice in the commission of, attempted commission of, or the immediate flight after committing or attempting to commit\" certain enumerated felonies, including rape. Defendant contends the attempted rape in this case was merely incidental to the murder. Defendant also contends the evidence is insufficient to support a finding the attempted rape was commenced prior to the victim's death. We again reject defendant's claims.\n\nFirst, a rational jury could have concluded from the evidence that defendant intended to rape Modena Galloway in addition to stealing from the Galloways. The theory presented at trial and supported by substantial evidence was the murders were committed to advance the other felonies and to conceal defendant's identity as the perpetrator. No evidence supports the contrary Conclusion, that the attempted rape was somehow committed in order to facilitate or further the murders.\n\nSecond, defendant attempts to undermine the jury's finding by claiming the evidence does not prove the attempted rape began prior to death. No evidence, however, was presented to support the opposite Conclusion, and we have previously held that \"in the absence of any evidence suggesting that the victim's assailant intended to have sexual conduct with a corpse [citation], we believe that the jury could reasonably have inferred from the evidence that the assailant engaged in sexual conduct with the victim while she was still alive . . . .\" (People v. Ramirez (1990) 50 Cal. 3d 1158, 1176, 270 Cal. Rptr. 286, 791 P.2d 965.) We specifically note the lack of evidence from the pathologist or the criminalist that the victim's body was moved or disturbed after death. In addition, the presence of foreign hairs, including a pubic hair fragment, in Modena Galloway's socks supports a rational inference the victim resisted the attempted rape by kicking.\n\nVII. SUFFICIENCY OF EVIDENCE OF COUNT 6, BURGLARY\n\nCounts 3 and 6 of the second amended information charged defendant with separate counts of burglary. Count 3 addressed the burglary occurring at the time the Galloways were murdered. Count 6 addressed the burglary occurring on Saturday morning when the fingerprints were erased. During deliberations, the jury requested an explanation of the difference between the burglaries charged in the two counts. In response, the trial court read the counts as charged in the second amended information. The trial court also told the jury: \"So in simple language it is alleged that there was [sic] two separate and distinct acts of burglary. The jury returned guilty verdicts on both counts in the first degree.\n\nConsistent with his taped statement to the police, defendant admits he entered the Galloways' house a second time. He contends, however, the only purpose of this entry was to wipe away fingerprints. Defendant argues there is no evidence he entered the second time with the intent to take property belonging to the Galloways or took any property during this entry. While the evidence of defendant's guilt on this count is not overwhelming, we find sufficient evidence to support the jury's verdict.\n\n\"'Although the People must show that a defendant charged with burglary entered the premises with felonious intent, such intent must usually be inferred from all of the facts and circumstances disclosed by the evidence, rarely being directly provable. [Citations.] When the evidence justifies a reasonable inference of felonious intent, the verdict may not be disturbed on appeal. [Citations.]'\" (People v. Price, supra, 1 Cal. 4th at p. 462, quoting People v. Matson (1974) 13 Cal. 3d 35, 41, 117 Cal. Rptr. 664, 528 P.2d 752.) The evidence presented at trial demonstrated defendant returned from the Galloways' home with blood on his clothes and a roll of cash. No other property known to have been taken from the Galloways' home, such as the VCR and jewelry box, was seen until later on Saturday after the defendant entered the home a second time. The jury therefore could reasonably conclude the items in question were taken during the second entry to the Galloways' home.\n\nFurthermore, a reasonable jury could conclude defendant possessed some proprietary interest in the items once they were removed from the Galloway home. Defendant was present when Mendoza attempted to sell the VCR and jewelry to Sean Sampson and Richard Willis. Mendoza told Sampson the VCR was stored at defendant's house. Defendant warned Sampson and Willis not to tell anyone about the attempted sale. Moreover, Mendoza testified defendant coerced him into driving the goods to a drainage canal where defendant threw them into the water. The VCR was later found at this location. Mendoza's testimony was corroborated on this point by the testimony of Kathy Lazoff, who overheard Mendoza and defendant arguing about the use of Mendoza's truck. Albis also overheard an argument between Mendoza and defendant at the relevant time.\n\nFrom this evidence a jury could rationally infer defendant was involved in the taking of the VCR and the jewelry box and therefore defendant entered the Galloway home with the intent to take additional property. In addition, defendant admitted that while in the Galloway house on Saturday morning, he wrapped up and took away pieces of the broken rocking chair, pieces which may have been the weapon used in one or both of the killings. The jury could reasonably infer he entered with intent to commit that act of larceny.\n\nVIII. PROSECUTORIAL MISCONDUCT\n\nDefendant contends several statements included by the prosecutor in his closing argument constituted misconduct. We reject defendant's claims.\n\nFirst, defendant waived his right to appellate review of each of the prosecutorial comments he now challenges, because he failed to object and request curative admonitions in the trial court. (People v. Benson (1990) 52 Cal. 3d 754, 794, 276 Cal. Rptr. 827, 802 P.2d 330.) The \"close case\" exception relied upon by defendant to avoid the waiver bar is no longer recognized. (People v. Carrera (1989) 49 Cal. 3d 291, 321, 261 Cal. Rptr. 348, 777 P.2d 121.) \"That a case is close does not in and of itself excuse the failure to object or impose a duty on the trial court to intervene in the absence of objection. [Citation.]\" (Ibid.)\n\nIn the alternative, defendant contends failure to object to the prosecutor's statements constituted ineffective assistance of counsel. Therefore, we next address defendant's claims of misconduct on the merits. In so doing, we inquire as to whether there is a reasonable likelihood the jury misconstrued the prosecutor's words in the manner suggested by defendant. (People v. Clair (1992) 2 Cal. 4th 629, 663, 828 P.2d 705.) Applying this standard, we find no misconduct. Therefore, defendant's ineffective assistance of counsel claim is groundless.\n\n1. Intent to Kill\n\nDefendant claims the prosecutor committed misconduct by including the following statements in his Discussion of the intent to kill requirement for the special circumstances: (1) \"intent to kill is not an issue\"; (2) intent to kill is a \"very low mental state\"; (3) \"[a] dog can intend to kill\"; and (4) \"the defendant wasn't so strung-out or so drunk or anything like that he reached a state -- a mental state lower than that of a dog.\"\n\nThe prosecutor's first statement when viewed in context did not advise the jury that intent to kill was not an issue in the case. Rather, the jury would have understood the prosecutor to argue intent to kill was obviously proven given the evidence presented during the trial, especially the photographs of the Galloways' bodies.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe prosecutor's remaining comments, understood in context, did not amount to misconduct. The prosecutor used these expressions in an attempt to contrast intent to kill, which may be formed quickly and irrationally, with more deliberative intellectual activities (\"higher mathematics,\" in his example). We believe the jury likely would have understood the prosecutor's comments in this unobjectionable way.\n\n2. Rape and Attempted Rape\n\nDefendant contends four prosecutorial misrepresentations \"relating to the rape charge undoubtedly convinced the jury that it must reach some finding favorable to the prosecution relating to rape, even if it were not convinced by the actual testimony in the record.\"\n\nDefendant first claims misconduct arising from a discrepancy between the prosecutor's characterization of a portion of Dr. O'Halloran's testimony and the actual testimony. Defendant claims the prosecutor went beyond the evidence in his argument (see People v. Benson, supra, 52 Cal. 3d at pp. 794-795) by stating Dr. O'Halloran testified about blood \"coming out of the vaginal area -- a stream of dried blood,\" when the doctor's testimony explained the stream was \"postmortem decomposition fluid rather than blood from an injury.\"\n\nIn his argument, the prosecutor urged the jury to look at the pictures of Mrs. Galloway, because the pictures showed a rape scene. He then stated: \"A number of them are very, very explicit and bloody, and look at them, not from the point of view of horrifying yourself, but [from] the point of view of what happened there. [P] And you can see there's the blood Dr. O'Halloran talked about coming out of the vaginal area, and its not at all a pleasant site [sic]. You see it for example on this People's No. 7. Obviously, a stream of dried blood that he referred to.\"\n\nThe prosecutor did not mischaracterize Dr. O'Halloran's testimony. The doctor testified there was \"a streak of brownish-red material that appeared to be blood coming from or coming from close to her vaginal area.\" Dr. O'Halloran also testified that the photograph in question \"showed the streak of bloody fluid coming from the vaginal area.\" Dr. O'Halloran's subsequent testimony attributing the source of the blood to postmortem fluid draining out of the body rather than an injury did not change the fact the photograph showed a dried, bloody fluid coming out of the vagina. The prosecutor properly used this one photograph to illustrate the point that, while viewing the photographs was unpleasant, it was important for the jury to do so.\n\nDefendant next characterizes the following statement by the prosecutor as \"inflammatory rhetoric:\" \"What in the hell is the defendant's pubic hair doing on Mrs. Galloway's panties if he didn't rape her or attempt to rape her?\" We do not view this statement in the same light as defendant. Rather, we believe the statement was simply fair commentary on the evidence introduced at trial. (See People v. Kaurish (1990) 52 Cal. 3d 648, 683, 276 Cal. Rptr. 788, 802 P.2d 278.)\n\nDefendant next claims the prosecutor impermissibly went beyond the record in attributing the hairs found on Mrs. Galloway's clothing to defendant, when the criminalist's testimony was more equivocal, e.g., the hairs \"could have come from defendant\" and defendant's hair was \"similar in all respects that I could measure.\"\n\nThe prosecutor's argument was proper. As to the key pubic hair found on the victim's panties, the criminalist eliminated microscopically or by electrophoresis testing all the people, except defendant, who defendant claimed were present when the Galloways were murdered. Furthermore, the criminalist testified all of the hairs retrieved from Mrs. Galloway's clothing were microscopically similar to defendant's hair and defendant's pubic hair possessed distinctive characteristics. Under such circumstances, it was proper for the prosecutor to draw the inference the hair on Mrs. Galloway's clothes was defendant's hair. (See People v. Kaurish, supra, 52 Cal. 3d at p. 683.)\n\nFinally, having concluded the attempted rape special circumstance was properly put before the jury, we also reject defendant's claim the prosecutor should not have been permitted to refer to attempted rape in his summation.\n\nIX. INEFFECTIVE ASSISTANCE OF COUNSEL IN CLOSING ARGUMENT\n\nIn addition to the claims of ineffective assistance of counsel addressed previously herein, defendant also contends his counsel rendered ineffective assistance in delivering his guilt phase closing argument. Specifically, defendant asserts the argument was deficient in the following ways: (1) inclusion of factual errors regarding money stolen from the Galloway home; (2) inclusion of legal error in explaining the necessity of finding intent to kill; (3) failure effectively to present a voluntary intoxication defense; and (4) failure to address the attempted rape basis of the rape-murder special circumstance. We address each claim in turn.\n\nDefendant objects to five purported factual misstatements by trial counsel relating to the money taken from the Galloway home: \"we know a wallet was taken\"; \"the property that was taken was money;\" \"he stole this money\"; defendant \"admitted he got $500\"; and \"there's a probability\" defendant was \"guilty of robbery.\" Defendant claims these admissions were not supported by the evidence presented at trial and no rational explanation exists for inclusion of these statements in trial counsel's argument. We disagree.\n\nEach of these statements embodies an inference consistent with (if not actually drawn from) defendant's statement to the police. In that statement, defendant made certain admissions relating to his entry of and taking property from the Galloway home, but consistently maintained he did not personally kill or assist in the killing of either victim. In light of the evidence presented at trial and defendant's audiotaped confession, trial counsel could reasonably conclude that his client would be found guilty of felony murder and that his efforts were best concentrated on defending against the special circumstances. Therefore, defense counsel's argument, which was consistent with defendant's statement to the police and stressed defendant's unwavering claim that he did not personally kill or intend to kill the victims, does not provide support for a claim of ineffective assistance of counsel.\n\nDefendant also objects to the italicized sentence in the following passage from defense counsel's closing statement: \"Somebody killed them. And it was a senseless, terrible crime, but did Tracy Cain do it? I submit to you that beyond a reasonable doubt there's a suspicion, yeah, but not beyond a reasonable doubt. . . . [P] This crime is horrible to any reasonable person. [P] But you can't convict him because it's a bad crime or the pictures look bad. It has to be on evidence and the special circumstance that he -- either was the actual killer or he intended to kill. If he didn't kill, it simply has not been proven. It's a good maybe, but that's not enough.\" The italicized sentence was, under the law governing this case, incorrect, since the special circumstance allegations required proof of intent to kill even if defendant was the actual killer. Contrary to defendant's assertion, however, we find no reasonable likelihood the jury construed defense counsel's statement to his detriment. In context, counsel's point was that the prosecution had failed in its burden of proving beyond a reasonable doubt defendant was the actual killer. As counsel stated immediately after the challenged remark, \"If he didn't kill, it simply has not been proven.\" The jury would have understood the argument as focused on whether defendant was the actual killer, as the prosecution contended, not on the question of intent. Furthermore, the jury was properly instructed the special circumstances required proof of intent to kill, and the same point was made by the prosecutor. We presume the jury followed the instruction. (People v. Frank, supra, 51 Cal. 3d at p. 728.) There is no reasonable probability the jury understood the particular sentence now challenged as stating otherwise. Thus, defendant's ineffective assistance of counsel claim fails for lack of prejudice, and we need not address whether the inclusion of this sentence in the argument constituted inadequate representation. (See, e.g., People v. Fauber (1992) 2 Cal. 4th 792, 831, 831 P.2d 249.)\n\nDefendant further contends trial counsel did not present \"even a minimally effective argument on the undisputed use of alcohol and drugs on the night in question.\" Counsel did briefly argue there was no intent to kill because defendant \"was obviously under the influence of alcohol and drugs.\" Belaboring this point would have risked appearing to concede defendant was the killer, which would have conflicted with and detracted from counsel's primary argument, that (consistent with his police statement) defendant had not killed anyone, planned to kill anyone or assisted in killing anyone in the burglary. In addition, almost no evidence was presented regarding the quantity and effects of the drugs consumed by defendant on the night of the murders or the effect consumption had on defendant. Defendant thus cannot demonstrate either deficient performance or prejudice in his counsel's argument relating to this subject.\n\nFinally, defendant contends his counsel's argument was ineffective for failing to address the prosecutor's assertion that evidence of attempted rape in this case was sufficient to support a finding of true for the rape-murder special circumstance. The record specifically reflects that trial counsel made a tactical choice not to discuss the possibility of an attempted rape in his closing argument. Trial counsel stated in a bench conference that he believed defendant's strong defense to the rape allegation would have been undermined by addressing what defense counsel believed was a speculative possibility of attempted rape. We cannot find that trial counsel's decision in this regard fell below reasonable professional norms.\n\nX. RECONVENING THE JURY\n\nAfter returning its guilt phase verdicts, the jury was reconvened in order to determine the degree of the murders of which it found defendant guilty. Defendant argues (1) the trial court lacked jurisdiction to reconvene the jury; (2) the trial court's instructions to the reconvened jury invaded the province of the jury; and (3) the trial court's failure to require the jury to redeliberate the special circumstances impermissibly disturbed the statutory order of deliberations.\n\nA. Procedural Background\n\nDuring the morning of April 26, 1988, the jury advised the court it had reached verdicts on the guilt phase issues. Because defendant's trial counsel, Willard Wiskell, was in Arizona preparing for the possible penalty phase, defendant agreed attorney Joel Steinfeld could appear for the purpose of receiving the verdicts. The jury presented its verdicts and the clerk read them. The jury found defendant guilty of the murders of both Mr. and Mrs. Galloway. The court told the jurors a penalty phase would be necessary, and instructed them to return on May 11.\n\nAfter the jury departed, counsel stipulated the robbery verdict should be recorded as second degree robbery, since no degree was set forth on the verdict form. Apparently, no one noticed a similar flaw in the murder verdicts. Later that day, however, the prosecutor notified the court the verdicts failed to specify the degree of the murders. The prosecutor requested the jury be immediately reconvened to correct the error. The court instructed the bailiff to contact the jurors and order them to return the next day.\n\nThe next day, the trial court granted a defense-requested continuance until May 2, when Wiskell could be present. The court further ordered the clerk not to record the verdicts until requested by the court. The court advised the jurors of a \"legal problem\" relating to the verdict forms and the possibility they might be reconvened with new forms. The court again admonished the jurors not to discuss the case or obtain information about the case from outside sources, and instructed them to return on May 2.\n\nOn May 2, outside the presence of the jury, the court considered the motion to reconvene. During this hearing, Wiskell admitted the only theory of the case was felony murder and therefore the verdicts returned by the jury could only be first degree murder. He stated that, for strategic reasons, he had not sought instructions regarding any possible lesser offenses. Wiskell also acknowledged the court retained jurisdiction over the jury for purposes of correcting the verdicts, but argued the jury should be instructed it must unanimously agree on the degree of murder -- first degree or nothing. Wiskell argued such an instruction would give the defendant the benefit of the jurors deliberating anew on the issue of degree.\n\nThe trial court granted the motion. The court explained to the jury the omission in the verdict forms for counts 1 and 2. The court told the jury it was being reconvened to deliberate the issue of the degree of the murders. The court then read two instructions pertaining to the issue of degree: CALJIC No. 8.21 (modified) on first degree murder and CALJIC No. 8.80 (modified) on special circumstances. Pursuant to counsel's stipulation, all other instruction previously given and the exhibits were sent into the jury room. As neither counsel objected, the old verdict forms were also sent into the jury room for comparison with the new forms. The court told the jury: \"You're charged then only with the duty or obligation or responsibility of reconvening and deliberating on your verdicts as to Counts 1 and 2 in order that you may returned [sic] a correct and complete verdict as to each of those counts, if its possible for you to do so.\" After deliberating, the jury returned verdicts finding both murder to be of the first degree.\n\nB. Jurisdiction\n\nDefendant first protests reconvening the jury under the circumstances set forth above violated sections 1157 and 1164 and therefore was beyond the trial court's jurisdiction. Section 1157 provides that, in the event a jury fails to determine the degree of a defendant's crime, the degree \"shall be deemed to be of the lesser degree.\" Section 1164, subdivision (a) directs the clerk to record in the minutes verdicts \"receivable by the Court.\" Defendant's claim lacks merit.\n\nIn People v. Bonillas (1989) 48 Cal. 3d 757, 257 Cal. Rptr. 895, 771 P.2d 844 (hereafter Bonillas), we considered under what circumstances a trial court can reconvene a jury to correct an incomplete or otherwise irregular verdict. In that capital case, we held the trial court retains jurisdiction for this purpose until the jury has left the court's control, i.e., until the jury has been discharged. (Id. at pp. 770-773; accord People v. Turner, supra, 50 Cal. 3d at p. 701.) Without a doubt, defendant's jury remained under the trial court's control at the time it was reconvened, since the penalty phase was still to be tried by the same jury. As the Attorney General correctly argues, our decision in Bonillas is dispositive of defendant's jurisdictional claim.\n\nDefendant's attempt factually to distinguish Bonillas is unpersuasive. Whether the verdict in the present case was \"incomplete\" in light of the instructions given, or whether it should have been immediately recorded, are distinctions without relevance. Bonillas stands for the proposition any error in the verdict may be corrected by reconvening the jury, as long as the jurors have not lost their character as jurors by, for example, discharge or receiving information inadmissible in the relevant phase of the proceeding. (Bonillas, supra, 48 Cal. 3d at pp. 770-773.)\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nC. Intrusion into Province of Jury\n\nDefendant next insists the remarks and instructions of the trial court to the reconvened jury in effect directed the jury to return a verdict of first degree murder. He also urges the trial court committed error under Caldwell v. Mississippi (1985) 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 by referring to possible appellate review of the jury's decision.\n\nAs the Attorney General observes, defendant failed to object to any of the comments by the trial court about which he now complains. Defendant therefore has waived these claims of error on appeal. (E.g., People v. Anderson (1990) 52 Cal. 3d 453, 468, 276 Cal. Rptr. 356, 801 P.2d 1107.)\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nEven if we disregard waiver, defendant's claims fail on the merits. We have reviewed the court's remarks and reject defendant's contention the jury would have understood the comments to direct a finding of first degree murder. The court did not state or imply the jury should find the murder was in the first degree. Rather, the court gave the jury new verdict forms which allowed it to find, or not to find, the murder was in the first degree, and told the jury to make a finding, if it could, \"as to whether the murder was first degree.\" To the extent the defendant complains the trial court should have explicitly instructed the jury to begin deliberations \"anew,\" we have previously rejected this argument under similar circumstances. (People v. Turner, supra, 50 Cal. 3d at p. 702.)\n\nFinally, the trial court did not commit Caldwell error. This error consists of leading the sentencer in a death penalty case to believe \"the responsibility for determining the appropriateness of the defendant's death rests elsewhere.\" (Caldwell v. Mississippi, supra, 472 U.S. at p. 329.) We have explained: \"Arguably the mere mention of appeal is improper, since it rarely serves any constructive purpose and may lead the jury on its own to infer that their responsibility for penalty determination is diluted. But when the context does not suggest appellate correction of an erroneous death verdict, the danger that a jury will feel a lesser sense of responsibility for its verdict is minimal.\" (People v. Bittaker, supra, 48 Cal. 3d at p. 1106.) Here, the context of the court's reference to appeal was to explain why the court requested the jury not to mark on the \"old\" verdict forms sent into the jury room for comparison purposes.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The trial court's comments in no way conveyed the suggestion prohibited by the high court in Caldwell v. Mississippi, supra, 472 U.S. at page 333.\n\nD. Order of Deliberation\n\nDefendant next contends his federal constitutional rights were violated by the jury's failure to adhere to the order of deliberations set forth in section 190.1, subdivision (a). This statute states in pertinent part: \"If the trier of fact finds the defendant guilty of first degree murder, it shall at the same time determine the truth of all special circumstances charged. . . .\" Defendant's arguments are unpersuasive.\n\nFirst, the only reasonable inference in this case is the jury deliberated in the correct order. Prior to its original deliberations, the jury was instructed it should return a finding on the robbery, rape, burglary, and multiple-murder special circumstances only if it found defendant guilty of first degree murder. (CALJIC No. 8.80 (1984 rev.), modified.) The jury found all of the special circumstances true. Felony murder was the only theory advanced at trial. Defense counsel candidly admitted his pursuit of an all-or-nothing verdict. The only reasonable Conclusion to draw is the jury found the murders were of the first degree, but was unable to record its findings because of the inadequate verdict forms. After determining degree, the jury then considered the special circumstances. Reconvening the jury did not materially affect the order of deliberation and was necessary only to satisfy the statutory mandate the degree of the offense must be express no matter how plain the implied finding. ( § 1157; Bonillas, supra, 48 Cal. 3d at 769, fn. 4.)\n\nMoreover, defendant's argument ignores section 1404, which provides: \"Neither a departure from the form or mode prescribed by this Code in respect to any pleading or proceeding, nor an error or mistake therein, renders it invalid, unless it has actually prejudiced the defendant, or tended to his prejudice, in respect to a substantial right.\" Assuming the procedure followed by the trial court to reconvene the jury resulted in the jury deliberating in the wrong order, defendant has not explained and we do not see how he was prejudiced by this error, especially in light of the fact the same 12 jurors participated in all of the deliberations and reached unanimous verdicts on all of the charges. Under these circumstances, the trial court was not required to have the jury begin its deliberations anew from the point of the defect in the verdict form. (Cf. People v. Turner, supra, 50 Cal. 3d at pp. 701-702 [trial court need not instruct jury to begin robbery deliberations anew].) We therefore find the error, if any, was harmless beyond a reasonable doubt. (Chapman v. California, supra, 386 U.S. at p. 24.)\n\nPENALTY PHASE FACTS\n\nPROSECUTION EVIDENCE\n\nThe prosecution introduced evidence of one prior felony conviction ( § 190.3, subd. (c)) and three incidents of criminal activity involving the use of force or violence ( § 190.3, subd. (b)). The former evidence consisted of a stipulation that on October 18, 1982, defendant was sentenced in Yuma County, Arizona, to the Arizona state prison for the felony of auto theft, and served time in prison for that offense.\n\n1. 1979 Perez Incident.\n\nOn September 28, 1979, defendant (then 16 years old) was an inmate in a Yuma County, Arizona, juvenile detention facility. Nicolas Perez, Jr., a control officer at the facility, was escorting a group of inmates from the dining room to a dormitory. As they prepared to pass through a door, defendant, the first in line, turned suddenly and hit Perez in the face with his closed fist. Other inmates in the group then tried to take Perez's keys as he and defendant fought. Perez suffered a broken nose and cheekbone and a wound requiring six stitches above his eye; he was off work for about one month.\n\n2. 1985 Fight Outside Fontes Trailer.\n\nVirginia Fontes, who had testified at a pretrial hearing in this case, was found unavailable as a witness; her prior testimony was read to the jury. Fontes testified that on November 4, 1985, a truck pulled up to her family's trailer, which was parked on the Rincon. A fight ensued between men from the truck, including defendant, and Fontes's husband and son. Fontes's son Robert Ramirez was fighting with a man named Mark Miller. Ramirez had the best of the fight and was on top of Miller, when defendant approached and hit Ramirez on the back of the head with a rock (about eight inches wide) he took from the nearby seawall. As Ramirez tried to get up, defendant hit him again, this time in the eye.\n\n3. 1986 Parker/Brown Incident.\n\nAnita Parker testified she met defendant in April 1985 and lived with him for a time in Los Angeles. On September 14, 1986, she was living in Ventura and had a new boyfriend, Greg Brown. Parker and Brown encountered defendant outside a bar in Ventura. Defendant pulled Parker from a car and, as Brown approached, knocked him down. Shortly afterward, when Parker and Brown arrived at Brown's mother's house, defendant again approached them. This time he pulled a tire iron from his pants and hit Parker in the head with it. Defendant told Parker to get up and run. As she did so he followed her, kicking her from behind. Parker eventually lost consciousness and woke up in the hospital, where she heard defendant telling the police Brown had hit her with a shovel.\n\nOn cross-examination Parker admitted she drinks four or five bottles of wine a day. In 1985 she normally carried a small knife with her for self-defense, and on one occasion she cut defendant on the arm with it. She also testified she forgave defendant and did not want him to be executed.\n\nDEFENSE EVIDENCE\n\n1. Fontes Incident.\n\nRichard Clayton, who was involved in the 1985 fight outside the Fontes trailer, testified he, Mark Miller and defendant went to the trailer to talk to Debbie Miller, Mark Miller's estranged wife and Clayton's former secretary. The altercation began when Debbie Miller swung at Clayton; he pushed her back and she fell down. A group of people then came out of the trailer and jumped on Clayton. Mark Miller joined the fray, but defendant at first stayed in the truck. Eventually defendant came to the aid of Clayton and Miller, but he never hit anybody with a rock. On cross-examination Clayton conceded he was too busy defending himself to have watched defendant during the whole fight.\n\n2. Conduct in Arizona State Prison\n\nTwo Arizona state prison work crew supervisors testified, from prison records, to defendant's good conduct on prisoner work crews in 1983 and 1984. Inmates who were discipline problems or escape risks were not allowed on fence-building crews such as the one on which defendant worked. Defendant received the highest possible score (15) on one of his evaluations on the fence crew, with comments he was doing a very good job and showing up for work every day. On another crew he was evaluated monthly for effort, responsibility and cooperation; he earned scores of 14 twice and 15 once.\n\n3. Other Defense Evidence.\n\nDefendant was born December 29, 1962. His mother died in Jonestown, Guyana, in 1978. Persey Cain, defendant's father, testified defendant was the fourth of his twelve children. Defendant was not a bad or wild kid, but rather a \"good kid[,] . . . [a] typical, you know, boy.\" The murder of his neighbors shocked Percy Cain and did not sound like his son, who had never been in trouble except for the auto theft. He asked the jury for mercy.\n\nDefendant's stepmother, Wilma Cain, raised him from the age of 4 until he left home at 18 or 19. She too was shocked when she heard of defendant's conviction or these murders, because it did not sound like him. He was a \"typical\" child, not \"incorrigible in any way.\" She too asked the jury to have sympathy and show mercy for defendant.\n\nThe attorney representing David Cerda testified his client was charged with two counts of murder, as well as other offenses, in the Galloway killings. He did not face a sentence of death or life without the possibility of parole if convicted.\n\nJohn Irwin, a professor of sociology at San Francisco State University, testified on the conditions of life in prison and the behavior of life prisoners. Irwin described the deprivations prisoners experience in privacy, breadth of activity and personal relationships. Life prisoners tend to cause less trouble than other prisoners. Because they know the prison will be their home for a long time they tend to \"settle in\" and plan for the long term. Many people serving life sentences go through a process of contrition, expiation and redemption. This may include efforts at benefiting society through \"lifers clubs\" that perform good works, such as recording texts for the blind and attempting to steer juveniles away from a life of crime.\n\nPENALTY PHASE ISSUES\n\nI. JURY SELECTION: RULINGS ON CHALLENGES FOR CAUSE\n\nDefendant contends the court erred in granting the prosecution's challenge to two prospective jurors because of their bias against capital punishment and in denying defense challenges to four jurors despite their asserted bias in favor of the death penalty.\n\nA challenge to a prospective juror should be sustained when the juror's views on capital punishment would \"prevent or substantially impair\" the performance of his or her duties as a juror in accordance with the instructions and oath. (Wainwright v. Witt (1985) 469 U.S. 412, 424, 83 L. Ed. 2d 841, 105 S. Ct. 844; People v. Ghent (1987) 43 Cal. 3d 739, 767, 239 Cal. Rptr. 82, 739 P.2d 1250; People v. Mincey, supra, 2 Cal. 4th 408, 456.)\n\nAlthough we review the record to decide if the trial court's ruling is supported by substantial evidence (People v. Gordon (1990) 50 Cal. 3d 1223, 1262, 270 Cal. Rptr. 451, 792 P.2d 251; see also People v. Miranda (1987) 44 Cal. 3d 57, 94, 241 Cal. Rptr. 594, 744 P.2d 1127 [whether decision is \"'fairly supported by the record'\"]), we pay due deference to the trial court, which was in a position to actually observe and listen to the prospective jurors. Voir dire sometimes fails to elicit an unmistakably clear answer from the juror, and there will be times when \"the trial Judge is left with the definite impression that a prospective juror would be unable to faithfully and impartially apply the law. . . . This is why deference must be paid to the trial Judge who sees and hears the juror.\" (Wainright v. Witt, supra, 469 U.S. at p. 426; People v. Ghent, supra, 43 Cal. 3d at p. 767.) Thus, if the juror's responses are conflicting or equivocal, the trial court's determination as to bias is binding on the reviewing court. (People v. Mincey, supra, 2 Cal. 4th at p. 456; People v. Price, supra, 1 Cal. 4th at p. 402.)\n\nA. Jurors Excused for Opposition to Capital Punishment\n\nWhen initially asked whether she would always vote for a life sentence and would refuse to consider the death penalty regardless of the evidence, prospective juror Darcy Canton answered, \"I don't know what I'd do, to be honest with you. . . . I would tend to think I wouldn't be able to do it, but I don't know.\" On further questioning she explained she leaned against the death penalty, but was not \"totally\" against it, and could not say \"that no matter what I would never do it.\" Under examination from defense counsel she added, \"I'd like to say I have an open mind and I would be able to go in there with an open mind. But actually being there and doing that is another thing; and . . . I don't know how my insides would respond when it came down to that, if I had to come all the way down to that point and decide.\" Defense counsel stated he did not think Canton met the Witt standard and he would not oppose a challenge for cause. The prosecutor agreed Canton was biased and challenged her; the challenge for cause was granted. The trial Judge, in the process of excusing Canton, expressed his opinion she was very likely to conclude on further reflection \"that for all practical purposes you personally could not impose the death penalty on anybody.\" She agreed, \"Probably right.\"\n\nProspective juror William Davis answered \"yes\" when asked if he would refuse to consider the death penalty no matter what the evidence. On further questioning, he explained he could not conceive of a case where he would vote for the death penalty and could not conceive of himself \"being part of a jury that sentences a man to death.\"\n\nThe trial court did not err in excusing these prospective jurors for cause. Davis unambiguously indicated he would vote against death regardless of the evidence. Canton's responses were equivocal and could have been understood to mean merely that she was unable to predict what her emotions would be were she in a position to vote for a sentence of death. They also, however, offer substantial support for the contrary Conclusion that, despite her desire to have an open mind, her emotional leaning against death was so strong she probably could not vote for that penalty even if she thought the evidence justified it. We defer to the trial court's resolution of this factual ambiguity. (People v. Mincey, supra, 2 Cal. 4th at p. 456.) Our Conclusion is further supported by the fact not only the trial Judge, but all of the other three participants -- the prosecutor, defense counsel and Canton herself -- agreed with this assessment of her mental state.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nB. Denial of Defense Challenges for Cause\n\nDefendant claims error in the court's denial of four defense challenges, those to prospective jurors Patricia Cairns, Clifford Hanson, Forrest Warnke and Rudolfo Pamplona.\n\nThe defense excused two of these panel members, Pamplona and Hanson, by peremptory challenge. Warnke and Cairns also did not serve on the jury or as alternates; it appears they were never seated. After excusing Hanson, defendant had used only eight of the twenty-six peremptory challenges to which he was entitled. (Former § 1070.) At his next peremptory, after the prosecution had passed on its challenge, he also passed and accepted the jury.\n\nDefendant did not exhaust his peremptories and had sufficient challenges remaining to eliminate the remaining panel members to whom he objected. Moreover, none of the prospective jurors as to whom defendant now claims error served as jurors or alternates. Defendant accepted the jury as constituted and makes no attempt to show its members were actually biased. No prejudice could have arisen from the court's denial of the defense challenges for cause, and therefore no reversible error occurred. (People v. Raley (1992) 2 Cal. 4th 870, 904-905, 830 P.2d 712; People v. Price, supra, 1 Cal. 4th at p. 401; People v. Coleman (1988) 46 Cal. 3d 749, 770-771, 251 Cal. Rptr. 83, 759 P.2d 1260.)\n\nRecognizing he cannot show reversible error in the court's rulings, defendant further asserts his attorney's failure to exhaust the available peremptory challenges constituted ineffective assistance of counsel. However, this claim too fails, as defendant demonstrates neither that counsel performed deficiently, nor that his choice prejudiced defendant. (People v. Ledesma (1987) 43 Cal. 3d 171, 216-217, 233 Cal. Rptr. 404, 729 P.2d 839.) The record shows counsel had a reasonable tactical purpose in accepting the jury. The prosecutor had passed on his peremptory, then, after a recess, sought to withdraw the pass, remarking he realized a juror to whom he had given a low rating was still seated. The court denied that request, giving the defense an opportunity to accept the jury while it contained a juror the prosecutor viewed as undesirable. Counsel, after consultation with defendant, took advantage of that opportunity. Even were this to be regarded as an incompetent choice, no prejudice appears for the reasons already noted: none of the prospective jurors whom defendant now attacks as partial actually served, and there is no showing the jury as actually constituted was anything but impartial.\n\nII. EXCLUSION OF EVIDENCE OF DAVID CERDA'S PLEA OFFER.\n\nDefendant contends the court erred in excluding evidence David Cerda was offered and initially agreed to accept a sentence of four years in prison for his role in the killings. We conclude the court did not err in excluding the evidence as irrelevant and because its probative value, if any, was greatly outweighed by the confusion and consumption of time involved in litigating questions surrounding the making of the plea offer. (Evid. Code, § 352.)\n\nThe defense sought to introduce a change of plea form in which David Cerda agreed to plead guilty and testify against defendant in exchange for a sentence of four years in state prison. Cerda later withdrew his plea and, at the time of defendant's trial, still faced first degree murder charges without special circumstance allegations.\n\nDefense counsel argued the withdrawn plea was admissible to show \"the prosecutor wanted Tracy Cain so bad that they were willing to offer somebody who was legally guilty of first degree murder four years in prison.\" The prosecutor objected on grounds of section 1192.4 and Evidence Code section 1153, both of which exclude evidence of withdrawn guilty pleas. The prosecutor, who was also prosecuting Cerda, further noted the evidence would open up the issue of why he had made the offer to Cerda. If it were admitted, the prosecutor intended to testify to his personal belief David Cerda had participated in the crime only by holding up the garage door for defendant and later going back to check on him.\n\nThe court excluded evidence of the withdrawn plea because it was not relevant in mitigation, because it was inadmissible under section 1192.4 and Evidence Code section 1153, and because trial of the collateral issues relating to the withdrawn plea would consume undue time (Evid. Code, § 352) and raise issues of attorney-client privilege. Cerda's attorney testified without objection his client was charged with murder, but was not faced with possible sentences of death or life without parole.\n\nDefendant argues the court's ruling deprived him of his right to present all available nonstatutory mitigating evidence. He relies on Parker v. Dugger (1991) 498 U.S. 308, 112 L. Ed. 2d 812, 111 S. Ct. 731 (hereafter Parker). As we have previously explained, however, Parker did not hold evidence of an accomplice's sentence must be introduced in mitigation at the penalty phase, or that a comparison between sentences given codefendants is required. (See People v. Mincey, supra, 2 Cal. 4th at p. 480.) The Parker court merely concluded a Florida trial Judge, in sentencing the defendant to death, had in fact considered the nonstatutory mitigating evidence of the accomplice's sentence, as under Florida law he was entitled to do. (Parker, supra, 498 U.S. at pp. 314-315.) Parker does not state or imply the Florida rule is constitutionally required, and California law is to the contrary; we have held such evidence irrelevant because it does not shed any light on the circumstances of the offense or the defendant's character, background, history or mental condition. (People v. Mincey, supra, 2 Cal. 4th at pp. 479-480; People v. Belmontes (1988) 45 Cal. 3d 744, 810-813, 248 Cal. Rptr. 126, 755 P.2d 310; People v. Dyer (1988) 45 Cal. 3d 26, 69-71, 246 Cal. Rptr. 209, 753 P.2d 1.)\n\nIn the present case defendant did introduce evidence of his accomplice's lesser sentence; he was precluded merely from showing the prosecution had previously offered an even shorter sentence in exchange for the accomplice's proposed testimony. Where the plea based on that offer was subsequently withdrawn, and the accomplice did not testify at defendant's trial, we fail to see how the prosecution's offer bears on the circumstances of the crime or on defendant's character or background. Although defendant insists \"the prosecutor's view\" of Cerda's culpability is a \"critical circumstance relating to the crime,\" he offers neither authority nor reasoning supporting this position. The prosecutor's opinion about the various coparticipants' relative culpability is not relevant to any issue at trial.\n\nTo the extent the prosecutor's view of defendant and Cerda's relative culpability, and his reasons for making the four-year offer to Cerda, were relevant as mitigation, any conceivable probative value was outweighed by the confusion of issues and consumption of time potentially involved in trying these questions. Determining the prosecutor's view of Cerda's relative culpability and the reasons for that view would involve, as the trial court noted, \"a monumental trial within a trial.\"\n\nWe conclude the trial court did not err in finding the proposed evidence of a withdrawn plea irrelevant or in excluding it under Evidence Code section 352. \"While it is true, as defendant contends, a capital defendant must be allowed to present all relevant mitigating evidence to the jury [citations], the trial court determines relevancy in the first instance and retains discretion to exclude evidence whose probative value is substantially outweighed by the probability that its admission will create substantial danger of confusing the issues or misleading the jury.\" (People v. Fauber, supra, 2 Cal. 4th at p. 856 [no error in excluding evidence defendant declined a plea offer requiring him to testify against accomplices].)\n\nIII. INSTRUCTION ON DELIBERATIONS WITH ALTERNATE SUBSTITUTED AT BEGINNING OF PENALTY PHASE.\n\nAt the commencement of the penalty trial one juror was discharged and an alternate substituted. Defendant does not complain of the discharge or substitution, but claims error in the special instruction the court gave the penalty phase jury on how its deliberations should be affected by the prior verdicts and the substitution. Consideration of the point requires examining the special instruction in full:\n\n\"After the guilt phase of this trial was concluded and the jury returned its verdicts one of your number was excused for legal cause and replaced with an alternate juror for the penalty phase of the trial. The alternate juror has been present during all evidence and the reading of all instructions on the law in both phases of the trial. However, the alternate juror did not participate in the jury deliberations and voting which resulted in the verdicts returned as to the guilt and innocence of the defendant of the charges set forth in the information, and as to the truthfulness of the special circumstance allegations set out in the information.\n\n\"For the purposes of this penalty phase of the trial the alternate juror must accept the verdicts and findings rendered by the jury in the guilt phase of the trial. That is, the alternate juror must accept that the defendant has been proved guilty beyond a reasonable doubt of the charges of murder in the first degree, burglary in the first degree, and robbery, as set forth in the information. The alternate juror must accept that the special circumstance allegations have been proved to be true beyond a reasonable doubt; namely that two murders were committed by defendant and that murder was committed while the defendant was engaged in the commission of burglary and robbery and attempted rape, as set forth in the information. The alternate juror must accept the verdict that the defendant is not guilty of rape as charged in the information.\n\n\"If you have any lingering doubt concerning the guilt of the defendant as to any of those charges of which he was found guilty, or if you have any lingering doubt concerning the truthfulness of any of the special circumstance allegations which were found to be true, you may consider that lingering doubt as a mitigating factor or circumstance.\n\n\"A lingering doubt is defined as any doubt, however slight, which is not sufficient to create in the minds of the jurors a reasonable doubt.\n\n\"The People and the defendant have the right to a verdict on the matter of penalty which is reached only after a full participation of the 12 jurors who ultimately return the verdict. This right may be assured in this phase of the trial only if the alternate juror participates fully in the deliberations, including such review as may be necessary of the evidence presented in the guilt phase of the trial.\n\n\"Therefore, the reasonable doubt of guilt and truthfulness of the charges and special circumstances as to which verdicts have been returned shall not be reexamined by the jury. However, for the purpose of determining if there is a lingering doubt concerning the guilt of the defendant on any charge as to which he has been found guilty, or a lingering doubt as to the truthfulness of any special allegation which has been found to be true, the jury shall begin its deliberations from the beginning with respect to the evidence presented in the guilt phase of this trial. You are instructed to set aside and disregard all past deliberations, if any, concerning whether there is any lingering doubt as to the guilt of the defendant or the truthfulness of any special allegation and begin deliberating anew. This means that each remaining original juror must set aside and disregard any earlier deliberations concerning a possible lingering doubt as if they had not taken place.\"\n\nDefendant contends the court erred by instructing the alternate to accept that defendant's guilt of murder, burglary and robbery, and the truth of the special circumstance allegations, had been proven beyond a reasonable doubt. He further maintains the jury as a whole should not have been instructed not to reexamine the question of reasonable doubt as to the verdicts already returned. These portions of the instruction, he argues, violated the principle that the jury must reach its verdict through common, shared deliberations. (People v. Collins (1976) 17 Cal. 3d 687, 693, 131 Cal. Rptr. 782, 552 P.2d 742.) Instead of the instruction given, defendant contends, the jury should have been told to disregard all past deliberations and, with the substituted alternate juror, \"review every aspect of the evidence in the guilt phase that had any possible bearing on the penalty to be imposed.\"\n\nWe perceive no constitutional defect in the special instruction. As defendant concedes, excusal of a juror for good cause and substitution of an alternate at the penalty phase does not require a retrial of the guilt phase. (People v. Fields (1983) 35 Cal. 3d 329, 351, fn. 9, 197 Cal. Rptr. 803, 673 P.2d 680.) If the guilt phase is not retried, the penalty phase jury, including the new juror, must perforce \"accept\" the guilt phase verdicts and findings, as they were instructed to do in this case. Those findings determined guilt and truth of the special circumstances beyond a reasonable doubt. It follows that reasonable doubt is not at issue in the penalty phase: the new juror must accept the previous findings were made beyond a reasonable doubt, and the jury as a whole has no cause to deliberate further on whether any of them harbor reasonable doubt as to guilt or truth of the special circumstances. (See People v. DeSantis (1992) 2 Cal. 4th 1198, 1238, 831 P.2d 1210 [at penalty phase the defendant's guilt is conclusively presumed].) The challenged portions of the special instruction did no more than inform the jury of these limitations on its penalty phase duties.\n\nThe special instruction did not purport to limit the guilt phase evidence that could be considered by the jury, whether in assessing the circumstances of the crime ( § 190.3, subd. (a)) or in considering the existence of lingering doubt.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Nor did it suggest the substituted juror should play less than an equal role in assessing the evidence from the guilt phase for either of these purposes. To the contrary, the instruction stated the alternate juror was to \"participate[] fully in the deliberations, including such review as may be necessary of the evidence presented in the guilt phase of the trial.\"\n\nAs to lingering doubt, the original jurors were instructed to \"set aside and disregard\" any earlier deliberations and to begin their deliberations anew, with the substituted juror, \"with respect to the evidence presented in the guilt phase of the trial.\" An instruction that allows the jurors to vote against the death penalty if they have residual doubt as to guilt or truth of the special circumstances is sufficient even though it requires the jurors to accept the guilt phase verdicts. (See People v. Kaurish, supra, 52 Cal. 3d 648, 708 [alternate substituted during penalty deliberations]; People v. Gonzalez (1990) 51 Cal. 3d 1179, 1234-1236, 275 Cal. Rptr. 729, 800 P.2d 1159 [retrial of penalty phase to new jury].) Here the instructions made clear not only that lingering doubts as to guilt could be considered in mitigation, but also that the penalty phase jury was to deliberate on this question as an integrated whole, to set aside any previous Discussion on the question, and to review in its common deliberations any relevant guilt phase evidence.\n\nWe recognize, as defendant emphasizes, the penalty phase \"has no separate formal existence but is merely a stage in a unitary capital trial.\" (People v. Hamilton (1988) 45 Cal. 3d 351, 369, 247 Cal. Rptr. 31, 753 P.2d 1109.) The overlap of relevant evidence between the two phases may be substantial. Substitution of a juror for the penalty phase presents the potential problem of the new juror \"joining a group which has already discussed and evaluated the circumstances of the crime, the capacity of the defendant, and other issues which bear both on guilt and on penalty.\" (People v. Fields, supra, 35 Cal. 3d at p. 351.) For that reason we declined in Fields to adopt a procedure that would result in routine substitution of jurors at the penalty phase, while recognizing substitution might nonetheless be required when a guilt phase juror, due to \"unforeseen circumstances,\" is unable to complete the trial. (Id. at p. 351, fn. 9.) The special instruction given here addressed the potential problem described in Fields by commanding the jury in clear and certain terms to set aside any previous Discussion of guilt phase evidence relevant to lingering doubt, and in general to deliberate on their penalty verdict as an integrated group, including any review they conducted of the guilt phase evidence. We believe this instruction was adequate to safeguard defendant's right to unitary jury deliberations.\n\nThe non-capital decisions cited by defendant are not to the contrary. (People v. Thomas (1990) 218 Cal. App. 3d 1477, 267 Cal. Rptr. 865; People v. Aikens (1988) 207 Cal. App. 3d 209, 254 Cal. Rptr. 30.) In both cases the appellate court approved the trial court's excusal of a juror and substitution of an alternate after the jury had reached verdicts on some but not all of the charges. (Thomas, supra, 218 Cal. App. 3d at pp. 1485-1488; Aiken, supra, 207 Cal. App. 3d at pp. 211-214.) Neither decision holds the reconstituted jury must reconsider the verdicts already returned or deliberate on factual Conclusions irrelevant to the counts yet to be decided. As already discussed, the jury here was correctly instructed to begin its deliberations anew as to guilt phase evidence to the extent it reviewed that evidence in its penalty phase deliberations.\n\nIV. CLAIMS OF ERROR RELATING TO SECTION 190.3, SUBDIVISION (A).\n\nThe jury was instructed to consider \"the circumstances of the crime of which the defendant was convicted in the present proceedings and the existence of any special circumstance found to be true.\" (See CALJIC No. 8.84.1 (1986 rev.) mod. by court.) Defendant raises several claims of error regarding this instruction and section 190.3, subdivision (a) (hereafter factor (a)), from which it was drawn.\n\nDefendant's broadest attack, made in a supplemental brief, is that factor (a) is so vague or imprecise that it fails to guide the sentencer's discretion, in violation of Eighth Amendment. (See Stringer v. Black (1992) 503 U.S. 222, 117 L. Ed. 2d 367, 112 S. Ct. 1130.) This court and the United States Supreme Court have both rejected this contention, holding directions to consider the circumstances of the crime are not unconstitutionally vague. (Tuilaepa v. California (1994) 512 U.S. ___ [129 L. Ed. 2d 750]; People v. Sims (1993) 5 Cal. 4th 405, 465-466, 853 P.2d 992; People v. Noguera (1992) 4 Cal. 4th 599, 648-649, 842 P.2d 1160.)\n\nDefendant also contends the court was obliged, on its own motion, to instruct the jury not to \"double count\" the same facts as circumstances of the crime and as special circumstances. (See People v. Melton (1988) 44 Cal. 3d 713, 768, 244 Cal. Rptr. 867, 750 P.2d 741 [noting \"theoretical\" problem of double counting but finding \"possibility of actual prejudice . . . remote\"].) We have repeatedly rejected claims of reversible error in this regard where the defense did not request an instruction against double counting, and there was no misleading argument by the prosecutor suggesting the same facts should be weighed twice, once under each rubric. (People v. Proctor, supra, 4 Cal. 4th at p. 550; People v. Fauber, supra, 2 Cal. 4th at p. 858; People v. Ashmus (1991) 54 Cal. 3d 932, 997, 820 P.2d 214.) Here there was neither a defense request nor any misleading prosecutorial argument on the point.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nNor do we agree the instruction's reference to special circumstances unfairly \"weighted\" the jury's decision in favor of death. The facts underlying the special circumstance findings are among the circumstances the jury may consider. An instruction not to consider the special circumstances \"would defeat the manifest purpose of factor (a) to inform jurors that they should consider, as one factor, the totality of the circumstances involved in the criminal episode that is on trial.\" (People v. Morris, supra, 53 Cal. 3d at p. 224.)\n\nDefendant's remaining two claims regarding the instruction on factor (a) are also without merit. We have already considered and rejected defendant's claims of legal error and factual insufficiency in the finding of attempted rape as a special circumstance; we therefore also reject his further contention the penalty verdict must be reversed because the factor (a) instruction allowed the jury to consider attempted rape among the special circumstances found true, as well as his related claim his attorney rendered ineffective assistance by failing to move the special circumstances be stricken or otherwise excluded from consideration by the penalty jury.\n\nNor can we discern any reversible error in the court's failure to instruct the jury, sua sponte, not to consider in its penalty decision any evidence relating exclusively to the charge of rape, on which defendant had been acquitted. As defendant concedes, the evidence relevant to the rape charge was the same evidence from which the jury had found Mrs. Galloway's murder was committed during an attempted rape. (Cf. People v. Jennings, supra, 53 Cal. 3d at pp. 389-390 [penalty phase instruction should have been tailored to direct jury not to consider evidence of assault against one victim, where defendant was acquitted of the charges relating to that victim].) The jury was properly instructed to consider the attempted rape under factor (a). Moreover, since the jury was instructed under factor (a) to consider only the circumstances of crimes \"of which the defendant was convicted in the present proceeding\" (emphasis added), there is no reasonable likelihood (People v. Kelly, supra, 1 Cal. 4th at pp. 525-526) they were misled to believe they should ignore their own not guilty verdict on the rape charge.\n\nV. CLAIMS OF ERROR RELATING TO SECTION 190.3, SUBDIVISION (b).\n\nAs with factor (a), defendant challenges as unconstitutionally vague section 190.3, subdivision (b) (factor (b)), under which the jury may consider prior violent criminal activity on the question of penalty. Again, this general objection has been rejected by the United States Supreme Court as well as this court. (Tuilaepa v. California, supra, 512 U.S. at p. __, 129 L. Ed. 2d at p. 762; People v. Sims, supra, 5 Cal. 4th at pp. 465-466.) Nor does defendant provide any compelling reason to reexamine our holdings that introduction in the penalty phase of prior unadjudicated crimes does not violate due process, equal protection or the right to a reliable sentencing procedure (People v. Medina (1990) 51 Cal. 3d 870, 906-907, 274 Cal. Rptr. 849, 799 P.2d 1282; People v. Balderas (1985) 41 Cal. 3d 144, 204-205, 222 Cal. Rptr. 184, 711 P.2d 480), and that the jurors need not unanimously agree as to defendant's guilt of the prior offenses (People v. Hardy (1992) 2 Cal. 4th 86, 207, 825 P.2d 781; People v. Miranda, supra, 44 Cal. 3d 57, 99).\n\nTurning to more specific claims, defendant contends evidence of the 1985 fight outside the Fontes trailer (the Fontes-Ramirez assaults) should have been excluded because he was previously acquitted of certain charges arising from that incident. Allowing the jury to hear and consider evidence of the fight, he claims, subjected him to double jeopardy as well as violating section 190.3, which excludes from the penalty phase evidence of \"an offense for which the defendant was prosecuted and acquitted.\"\n\nAccording to evidence put before the court in a hearing on defendant's objection to use of the incident, defendant and others were charged with four felonies in the attack on Fontes's husband and son. Counts 3 and 4 involved the son, Robert Ramirez. Count 3 charged assault with a deadly weapon ( § 245, subd. (a)(1)), to wit, an iron bar. Count 4 alleged not assault with a deadly weapon, but rather, battery causing serious bodily injury, in violation of section 243, subdivision (d). No weapon use was alleged in this count. Defendant was completely acquitted on count 3, but on count 4 was convicted of a lesser included offense, the misdemeanor of simple battery ( § 242).\n\nWhile overruling defendant's objection to Fontes's testimony, the trial court limited the testimony to \"facts from which the reasonable inference of a misdemeanor battery could be drawn . . . .\" Evidence concerning use of an iron bar was excluded, since defendant was acquitted of the assault charge alleging such use. Evidence defendant kicked Ramirez and hit him with a rock, however, was allowed, since these acts presumably formed the basis of the battery for which defendant had been convicted.\n\nThe trial court's ruling was not error. The jury heard no evidence tending to show an offense for which defendant had been acquitted. Fontes did not testify to any use of an iron bar (count 3) or that defendant inflicted any serious bodily injury on Ramirez (count 4). Defendant was not previously acquitted of assaulting Ramirez with a rock or of kicking him. Indeed, these acts constituted the circumstances of a battery for which defendant had been convicted as a lesser included offense of the felony charged in count 4.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe details and circumstances of prior violent criminal conduct are properly admitted and considered under factor (b) even if the defendant was previously prosecuted for the same conduct, so long as the defendant was not acquitted of the offense. (People v. Fierro (1991) 1 Cal. 4th 173, 231, 821 P.2d 1302; People v. Melton (1988) 44 Cal. 3d 713, 754, 244 Cal. Rptr. 867, 750 P.2d 741.) Although we held in People v. Sheldon (1989) 48 Cal. 3d 935, 951, 258 Cal. Rptr. 242, 771 P.2d 1330, that section 190.3's bar on evidence of acquitted offenses extends to lesser included offenses, neither that holding nor the reasoning supporting it extend to a case, like this one, where the defendant was convicted of the lesser offense and the penalty phase evidence is limited to facts on which the jury could reasonably have reached the lesser verdict. Here, unlike Sheldon, the People did not \"circumvent[]\" section 190.3 by using a possible lesser offense to \"admit evidence surrounding the acquitted offense . . . .\" (48 Cal. 3d at p. 951.)\n\nThe use under factor (b) of a crime for which a defendant was previously convicted does not violate the constitutional and statutory bars against double jeopardy. The defendant is not being tried again, or made subject to punishment or conviction, for the same offense; instead, the evidence is admitted to assist the jury in its determination of the appropriate sentence on the current charge. (People v. Visciotti, supra, 2 Cal. 4th at p. 71; People v. Fierro, supra, 1 Cal. 4th at pp. 231-232; People v. Melton, supra, 44 Cal. 3d at p. 756, fn. 17.) For this reason the \"same conduct\" test of double jeopardy established in Grady v. Corbin (1990) 495 U.S. 508, 109 L. Ed. 2d 548, 110 S. Ct. 2084, would not apply, even if that case had not recently been overruled. (United States v. Dixon (1993) ___ U.S. ___, ___; 125 L. Ed. 2d 556, 577-578.) \"As defendant was not prosecuted in the penalty phase for the conduct on which his prior conviction was predicated (People v. Visciotti, supra, 2 Cal. 4th at p. 71), Corbin has no application to this case.\" (People v. Johnson (1992) 3 Cal. 4th 1183, 1242, 842 P.2d 1.) Finally, to the extent the collateral estoppel aspect of double jeopardy applies to relitigation of facts in a penalty trial (see People v. Melton, supra, 44 Cal. 3d at p. 756, fn. 17), it is inapplicable here because defendant \"points to no specific facts litigated in his penalty trial which were necessarily resolved in his favor in prior criminal proceedings.\" (Ibid.)\n\nDefendant also claims error in the court's failure to instruct, sua sponte, on the elements of assault and on defense of others as a legal defense to assault. As he acknowledges, we have repeatedly held there is no duty, absent a request, to instruct on elements of crimes proven under factor (b). (People v. Tuilaepa (1992) 4 Cal. 4th 569, 591-592; People v. Hardy, supra, 2 Cal. 4th at pp. 205-207; People v. Davenport (1985) 41 Cal. 3d 247, 281, 221 Cal. Rptr. 794, 710 P.2d 861.) That rule is based in part on a recognition that, as tactical matter, the defendant \"may not want the penalty phase instructions overloaded with a series of lengthy instructions on the elements of alleged other crimes because he may fear that such instructions could lead the jury to place undue emphasis on the crimes rather than on the central question of whether he should live or die.\" (People v. Davenport, supra, 41 Cal. 3d at p. 281; see also People v. Anderson, supra, 52 Cal. 3d 453, 483 [on appeal, defendant claims \"'sheer bulk'\" of instructions on prior criminal activity overemphasized prior crimes and distracted jury from its primary duty].) We have also noted a trial court is not prohibited from giving such instructions on its own motion when they are \"vital to a proper consideration of the evidence.\" (People v. Davenport, supra, 41 Cal. 3d at p. 282.)\n\nDefendant urges reexamination of these precedents, insisting the court does have a sua sponte obligation when the existence of the prior offense's elements, or a legal defense to the crime, is open to serious question based on the evidence. He argues instructions on assault and defense of third parties were essential to the jury's proper consideration of the evidence in this case, as the jury could have found defendant committed no crime when he came to the aid of Miller in the latter's fight with Ramirez.\n\nWe need not decide whether under some circumstances the trial court would have a sua sponte obligation to instruct on elements or defenses. Here the instructions were not so vital to the jury's evaluation of defendant's prior actions as to require they be given without a request. The defense here was able to present evidence and argue, even without these instructions, that defendant's involvement was restricted to rescuing his friend who was getting beaten in a fight. Fontes herself testified her son was on top of Miller and hitting him. The defense called Clayton, who testified defendant did not instigate the fight and remained uninvolved until he came to Miller's assistance; even then, Clayton testified, defendant did not use a rock. Based on this evidence, defense counsel argued defendant \"had nothing to do\" with the reasons for the fight and acted only to \"assist afterwards one of his friends.\"\n\nStandard instructions on assault (the label by which the court identified the offense against Ramirez) or battery (of which defendant was convicted) would have informed the jury these crimes were not committed if the defendant acted in lawful defense of another person. (CALJIC Nos. 9.00, 9.12 (5th ed. 1988 bound vol.).) A standard instruction on defense of others (CALJIC No. 5.32 (5th ed. 1988 bound vol.)) explains it is lawful to apply reasonable force necessary to prevent the imminent infliction of bodily injury on another. As just seen, however, even without these instructions the jury had before it evidence and argument from which it could rationally assess the degree of culpability defendant bore in the prior incident. The proper focus for consideration of prior violent crimes in the penalty phase is on the facts of the defendant's past actions as they reflect on his character, rather than on the labels to be assigned the past crimes (see People v. Clair, supra, 2 Cal. 4th at pp. 680-681) or the existence of technical defenses to prior bad acts (see People v. Tuilaepa, supra, 4 Cal. 4th at p. 592). Here the evidence and argument properly focused the jury's attention on the moral assessment of defendant's actions in the Fontes incident; the instructions now suggested were not essential to the jury's consideration of this issue.\n\nMoreover, the tactical considerations we have previously identified were potentially present here, and instruction on the court's own motion could have interfered with those tactics. In argument, the prosecutor devoted little time to the Fontes incident, conceding it was a relatively minor episode: \"I'm not asking you to say that it's the strongest aggravating factor. It's kind of a -- it's a minor deal, but it shows a continuing pattern of violence.\" Defense counsel, although he had called Clayton to present a version of the events more favorable to defendant than Fontes's, also deemphasized the incident in his summation. Like the prosecutor, he discussed it very briefly, pointing out defendant had not been involved in instigating the fight and had acted only to assist Miller. He also noted a previous jury had assessed only misdemeanor liability on defendant and argued the incident was so minor, it should not \"have any bearing at all on whether or not Mr. Cain ought to die.\" The record thus supports an inference counsel adopted the reasonable tactic of treating the Fontes incident as so minor the jury should not consider it at all in their decision. Detailed instructions on the possible crimes committed and legal defenses thereto could have frustrated this defense approach. Under these circumstances the trial court was not obliged, sua sponte, to give such instructions. (People v. Tuilaepa, supra, 4 Cal. 4th at pp. 591-592; People v. Hardy, supra, 2 Cal. 4th at pp. 205-207; People v. Davenport, supra, 41 Cal. 3d at p. 281.)\n\nFinally, defendant argues all evidence regarding the Fontes incident should have been stricken because it established, as a matter of law, that defendant had acted in lawful defense of Miller. We disagree. The evidence was such as allowed a rational juror to find beyond a reasonable doubt defendant engaged in violent criminal activity. (People v. Clair, supra, 2 Cal. 4th at pp. 672-673.) The jurors could rationally have believed, for example, that Miller was not in imminent danger of bodily injury, or that defendant used more force than reasonably necessary to defend Miller.\n\nDefendant's claims regarding use of the 1979 assault on Perez, the Arizona juvenile control officer, are also without merit. As already discussed, use of prior violent conduct under factor (b) does not violate the bar on double jeopardy and does not generally require instruction on the elements of the offenses previously committed. The use of defendant's out-of-state conduct as evidence of a circumstance in aggravation does not raise any question of the court's jurisdiction to convict or punish him for an offense committed in another jurisdiction, because, as already noted, the defendant in the penalty phase is not convicted of or punished for the prior offense. (People v. Visciotti, supra, 2 Cal. 4th at p. 71; People v. Fierro, supra, 1 Cal. 4th at pp. 231-232; see also People v. Pensinger (1991) 52 Cal. 3d 1210, 1260-1261, 278 Cal. Rptr. 640, 805 P.2d 899 [violent criminal conduct in another state admissible under factor (b) even if it does not constitute California crime].)\n\nFinally, neither the passage of nine years between the incident and this penalty trial, nor the fact defendant was a juvenile when he assaulted Perez, nor the alleged destruction of Arizona juvenile detention records, made the use of this prior violent crime unfair or unreliable. (See People v. Bacigalupo (1991) 1 Cal. 4th 103, 134, 820 P.2d 559 [passage of nine years, lack of trial transcript and unwillingness of witnesses to meet with defense counsel did not preclude use of prior criminal conduct under factor (b)]; People v. Anderson, supra, 52 Cal. 3d at p. 476 [remoteness goes to weight, not admissibility]; People v. Cox, supra, 53 Cal. 3d 618, 688-689 [violent criminal conduct as 15-year-old admissible under factor (b)].) As to the alleged destruction of records (a fact not shown in the record, since defendant did not object on this ground below), we are not convinced, if true, this would have unconstitutionally deprived defendant of an opportunity fairly or fully to litigate the circumstances of the 1979 assault. The conduct was proven through a percipient witness, Perez, whom the defense could, and did, cross-examine fully. Defendant was also a percipient witness to the event and could have testified to any circumstances reducing his culpability, had he so wished. (See People v. Cox, supra, 53 Cal. 3d at p. 689 [juvenile conduct proven through victims and other percipient witnesses, whom defense had full opportunity to cross-examine].)\n\nVI. CLAIMS OF ERROR RELATING TO SECTION 190.3, SUBDIVISION (c).\n\nDefendant contends the use of non-violent felony convictions under section 190.3, subdivision (c) (hereafter factor (c)) violates the rights to a fair penalty trial and reliable determination on the death penalty. He attacks the statute on its face, and as applied here to his single prior felony conviction for auto theft, suffered in 1982 when defendant was 19 years old.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn his facial challenge, defendant asserts the existence of prior nonviolent felony convictions does not rationally assist the jury in deciding which capital defendants are worthy of the death penalty. We have held that prior felony convictions not involving force or violence are relevant \"'to demonstrate that the capital offense was undeterred by prior successful felony prosecutions.'\" (People v. Bacigalupo, supra, 1 Cal. 4th at p. 140 quoting People v. Balderas, supra, 41 Cal. 3d at p. 202, italics omitted.) Prior convictions tend to show \"the capital offense was the culmination of habitual criminality -- that it was undeterred by the community's previous criminal sanctions.\" (People v. Balderas, supra, 41 Cal. 3d at p. 202, italics and fn. omitted.) Defendant offers no authority for his view that consideration of such convictions renders the penalty decision unfair or unreliable.\n\nIn support of his facial attack, defendant cites us to death penalty statutes of a large number of states that, he asserts, restrict the use of prior convictions to crimes involving force or violence. California, he maintains, is alone in allowing the use of nonviolent prior convictions as a factor in the penalty decision, and thus has fallen below \"contemporary standards regarding the infliction of punishment.\" (Woodson v. North Carolina (1976) 428 U.S. 280, 288, 49 L. Ed. 2d 944, 96 S. Ct. 2978.)\n\nIn addition to resting on the incorrect assumption the Eighth Amendment requires the states to adopt some type of uniform capital sentencing scheme (see Tuilaepa v. California, supra, 512 U.S. at p. ___ [129 L. Ed. 2d at p. 762] [states have considerable latitude in how to guide sentencer's discretion at selection phase]), defendant's showing as to the law of other states is not convincing. At least one of the state laws he cites expressly allows specified nonviolent offenses to be used as aggravating circumstances in a penalty trial.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e In another case he has confused death-selection factors with death-eligibility factors (see id. at pp. ___ [129 L. Ed. 2d at pp. 759-760]); a statute limiting the use of prior convictions in the eligibility decision does not necessarily place the same restriction on the evidence admissible in the selection phase.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Moreover, even when nonviolent prior felony convictions are not designated aggravating factors for either eligibility or selection, the presence or absence of such convictions may be relevant to prove or disprove the existence of a factor in mitigation.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Thus, defendant has not demonstrated either that California is unique in allowing consideration of nonviolent felonies in the penalty decision, or that uniqueness would indicate constitutional defectiveness.\n\nAs to the specific use of defendant's auto theft conviction, defendant argues his conviction for \"teen-age participation in a car theft\" was irrelevant or unreliable as a factor in the penalty decision. Taken alone, of course, a prior auto theft, by a teenager or anyone else, would not be a reason for choosing a death sentence. The conviction here, however, was not taken alone; it was but one fact in defendant's background the jury could consider in assessing his character and culpability. Together with the evidence of later violent conduct introduced under factor (b), as well as the capital crimes, it tended to show a pattern of criminal behavior undeterred by penal sanctions.\n\nVII. ASSERTED PROSECUTORIAL MISCONDUCT IN JURY ARGUMENT.\n\nOver defense objection, the prosecutor was permitted to argue defendant's words and actions demonstrated a lack of remorse for his role in the killings of Mr. and Mrs. Galloway. The prosecutor told the jury defendant's attitude toward the crimes was demonstrated by his statement on the night of the killings that he had \"knocked\" the victims \"smooth out\" and gotten \"thousands,\" by his appearance on the television news, by his answer the morning after the killings to Val's inquiry about the victims (\"That's on them\"), and by his response to Detective Tatum's question as to whether he felt sympathy for the victims when he saw them dead (\"They laugh at shit like that, man\").\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e In summary, the prosecutor argued defendant had been given \"every opportunity to express sorrow, sympathy, pity, remorse. Nothing. No remorse, nothing. Just a fear that he'd be caught. Selfish. Remorseless. [P] You know, in a sense it's not the defendant's size that frightens you. It's his attitude. It's his attitude toward other human beings. He's a big man, but it's his attitude that's frightening. [P] And I submit to you that that is a very strong aggravating factor, his attitude toward the crime afterward.\"\n\nDefendant contends the prosecutor's argument improperly treated the absence of a possible mitigating factor as aggravating and employed a non-statutory aggravating factor. (People v. Davenport, supra, 41 Cal. 3d at pp. 288-290; People v. Boyd (1985) 38 Cal. 3d 762, 771-776, 215 Cal. Rptr. 1, 700 P.2d 782.) We reject this claim for two reasons.\n\nFirst, much of the prosecutor's argument referred to what we have called \"overt remorselessness,\" a proper aggravating circumstance. (People v. Gonzalez (1990) 51 Cal. 3d 1179, 1231-1232, 275 Cal. Rptr. 729, 800 P.2d 1159.) A murderer's attitude toward his actions and the victims at the time of the offense is a \"circumstance[] of the crime\" ( § 190.3, subd. (a)) that may be either aggravating or mitigating.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e (Ibid.; see also People v. Edwards (1991) 54 Cal. 3d 787, 833, 819 P.2d 436 [circumstances of crime include its moral context].) From the evidence that defendant, still bloody from the killings, returned to his friends and boasted of what he had just done, the jury could infer his attitude during the crimes was one of callousness towards the victims. Similarly, Detective Tatum's question related to defendant's emotions during the second burglary on Saturday morning, and defendant's answer tended to show his attitude at that time. The prosecutor did not misconduct himself in arguing from this evidence. \"The defendant's overt indifference or callousness toward his misdeed bears significantly on the moral decision whether a greater punishment, rather than a lesser, should be imposed.\" (People v. Gonzalez, supra, 51 Cal. 3d at p. 1232.)\n\nSecond, we have repeatedly held the prosecutor can properly direct the jury's attention to evidence showing the defendant's lack of remorse. (See, e.g., People v. Hardy, supra, 2 Cal. 4th at pp. 209-210; People v. Breaux (1991) 1 Cal. 4th 281, 313, 821 P.2d 585; People v. Odle, supra, 45 Cal. 3d 386, 422.) To the extent the prosecutor exceeded the proper scope of argument by characterizing defendant's post-crime attitude as aggravating, the error was harmless. \"With or without argument, jurors can be expected to react strongly to evidence of overt callousness. [Citation.] Their response is unlikely to be influenced by whether the prosecutor brands such evidence as 'aggravating' or merely 'nonmitigating.'\" (People v. Gonzalez, supra, 51 Cal. 3d at p. 1232.) The prosecutor in this case also made it very clear the absence of a mitigating factor was not in itself aggravating, telling the jury that \"when a mitigating factor is not present, you don't shove it over into the aggravating factor column. It's just a zero.\"\n\nContrary to defendant's claim, evidence of his callous attitude was not irrelevant to the penalty determination. (People v. Gonzalez, supra, 51 Cal. 3d at p. 1232.) Nor did the prosecutor's reference to remorselessness as a circumstance in aggravation subject defendant to use of a vague factor in violation of the Eighth Amendment: the prosecutor's specific references to defendant's words and actions made clear the meaning of his assertion defendant lacked remorse. Nor, finally, did the prosecutorial argument violate defendant's privilege against self-incrimination. It focused on overt demonstrations of remorselessness and did not include any implied comment on defendant's failure to testify or confess full responsibility for the killings. (People v. Cummings (1993) 4 Cal. 4th 1233, 1329, 850 P.2d 1; People v. Breaux, supra, 1 Cal. 4th at p. 313.)\n\nDefendant's remaining claims of prosecutorial misconduct are barred on appeal by his failure to object and request an admonition. In no instance was the assertedly erroneous prosecutorial argument so inflammatory that a timely admonition would have been ineffective. (People v. Price, supra, 1 Cal. 4th at p. 440.) In any event, no reversible error has been shown. The prosecutor did not misconduct himself in giving his interpretations of two statements made by defendant (\"That's on them\" and \"They laugh at shit like that, man\"); although the meaning of these phrases was less than absolutely clear, the prosecutor's interpretations were reasonable. Nor did he go beyond the evidence in arguing defendant had led a selfish and brutal life, had used his physical strength to intimidate and frighten others and had lived in his father's home while working only sporadically.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Finally, the prosecutor's passing reference to the death of his own maternal grandparents when his mother was only 13 years old bore no reasonable possibility of influencing the penalty verdict. (People v. Douglas (1990) 50 Cal. 3d 468, 538, 268 Cal. Rptr. 126, 788 P.2d 640; People v. Brown (1988) 46 Cal. 3d 432, 456, 250 Cal. Rptr. 604, 758 P.2d 1135.) Since all these asserted instances of unobjected-to misconduct were either proper or clearly harmless, we also reject defendant's claim counsel's failure to object constituted ineffective assistance.\n\nVIII. INEFFECTIVE ASSISTANCE OF COUNSEL IN DEFENSE PENALTY ARGUMENT.\n\nDefendant contends his attorney incompetently and prejudicially neglected to argue his lack of premeditation was a mitigating circumstance of the offense. The record belies this claim. The lack of premeditation and deliberation was counsel's primary argument as to the circumstances of the capital crimes. He argued: \"There was no preplanning for killing. There was no talking about killing. There was no arming yourselves with a weapon. There was no deliberate killing.\" He then described several capital cases with which he was familiar that involved preplanning and deliberation. He concluded: \"To compare this with this was a spontaneous act. There was no preplanning whatsoever. The lack of premeditation. . . . That makes this case not excusable, but certainly not as bad as some of these others.\" (Emphasis added.) Counsel then tied the lack of premeditation to the defense theory defendant was impaired by drug use and was desperate for money with which to obtain more drugs: \"Mitigation, ladies and gentlemen -- another part of mitigation is intoxication. . . . [P] We know he was intoxicated. . . . He was using crack. [P] The compunction, ladies and gentlemen, to use cocaine was certainly there. [P] I submit, ladies and gentlemen, that he could no more control that urge for cocaine than probably you and I can control being right-handed. . . . [P] That's a far cry from a person who is sober, who looks around, who creeps in, who tapes somebody up and kills them with an axe. It's a far cry from the kind of person who arms themselves with a gun and deliberately shoots and kills.\" (Emphasis added.)\n\nCounsel's line of argument, while ultimately unsuccessful, was reasonable and clear. The jurors could not have failed to understand he was arguing lack of premeditation and deliberation was a mitigating circumstance of the crimes.\n\nDefendant also complains of a single sentence in counsel's argument on premeditation that defendant interprets as a concession he was the actual killer.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e In context, and in light of counsel's express reminder defendant has \"denied that [he was the killer] all the way through,\" and counsel's urging that the evidence left room for lingering doubt, the remark is more reasonably understood as urging the jury to consider the mitigating circumstances of the killings even if they believed defendant committed them. Such an argument was proper, indeed unavoidable, in light of the guilt phase verdicts, which strongly indicated the jurors accepted the prosecution theory defendant was the actual killer.\n\nIX. ASSESSMENT OF AGGRAVATING AND MITIGATING FACTORS.\n\nDefendant raises a number of objections to the court's instructions on assessment of aggravating and mitigating circumstances. We have previously rejected these contentions and decline to reconsider our decisions. The court was not constitutionally required to define aggravation and mitigation (People v. Malone (1988) 47 Cal. 3d 1, 54-55, 252 Cal. Rptr. 525, 762 P.2d 1249), to label various factors as exclusively aggravating or mitigating (People v. Montiel (1993) 5 Cal. 4th 877, 943, 855 P.2d 1277; People v. Livaditis (1992) 2 Cal. 4th 759, 784, 831 P.2d 297) or to delete inapplicable factors (People v. Montiel, supra, 5 Cal. 4th at p. 937, fn. 31; People v. Miranda, supra, 44 Cal. 3d at pp. 104-105). The instruction to determine if the aggravating circumstances were \"so substantial\" in relation to the mitigating circumstances adequately informed the jury the former had to outweigh the latter. (People v. Duncan, supra, 53 Cal. 3d at p. 978.) There was no error in failing to instruct the jury it must find beyond a reasonable doubt that each aggravating factor relied on was true, that the aggravating factors outweighed the mitigating, and that death was the appropriate penalty. (People v. Clark (1992) 3 Cal. 4th 41, 170, 833 P.2d 561; People v. Livaditis, supra, 2 Cal. 4th at p. 786.) In the absence of any indication of a jury deadlock, the court was not obliged to inform jurors they could render no verdict at all by failing to agree unanimously on either death or life without parole. (People v. Miranda, supra, 44 Cal. 3d at p. 105.)\n\nX. APPLICATION TO MODIFY PENALTY.\n\nDefendant makes several claims of error relating to the trial court's denial of his automatic application to modify the penalty verdict ( § 190.4, subd. (e)). First, he contends the court improperly read, considered and was influenced by the probation officer's report in denying the application. As the People concede, the court did apparently read the report, which had to be prepared because defendant was also to be sentenced on noncapital crimes, before ruling on the modification motion. The better procedure, as we have previously stated, is to defer reading the report until after ruling on the modification motion, which is to be made on the basis of the evidence that was before the jury. (People v. Lewis (1990) 50 Cal. 3d 262, 287, 266 Cal. Rptr. 834, 786 P.2d 892.) In similar cases, however, we have assumed, absent evidence in the record to the contrary, that the court was not improperly influenced by material in the probation report. (People v. Berryman (1993) 6 Cal. 4th 1048, 1106, 864 P.2d 40; People v. Fauber, supra, 2 Cal. 4th at p. 866.) Here that Conclusion is amply supported by the record: before ruling the court explained its view \"the court should not take into consideration the contents of the probation report\"; after ruling the court repeated, \"I base my ruling entirely upon the evidence that was presented in the trial.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nTurning to the trial court's statement of its reasons for denial, the record does not support defendant's claim the court improperly treated the absence of certain mitigating factors as aggravating. The court's recital of absent mitigating factors follows, and was apparently intended to illustrate, its Conclusion there were no mitigating circumstances of sufficient substance to outweigh the circumstances in aggravation.\n\nWe also reject defendant's claim the court's mention of his prior felony conviction and his attempt to rape Mrs. Galloway was improper. As explained above, the attempted rape special circumstance was not legally invalid, and the prior conviction, even though for a nonviolent crime, was an appropriate consideration on the question of penalty.\n\nTo the extent the court erred in relying on evidence defendant was, in general, \"a brutal person,\" any error would be harmless. The court regarded the brutality of the capital crimes as \"certainly the most aggravating circumstance of all,\" one that \"far outweighs any mitigating circumstance that might be present.\" It is clear from the court's statement there is no reasonable possibility reliance on indications of brutality other than defendant's acts of violence affected its decision. (People v. Fauber, supra, 2 Cal. 4th at p. 867.) Finally, the court's failure expressly to refer to evidence defendant regards as mitigating does not demonstrate the court ignored or overlooked such evidence. (People v. Berryman, supra, 6 Cal. 4th at p. 1107.) The court explicitly stated it had independently reviewed the evidence and believed death was the appropriate penalty. Nothing in the record suggests the court failed to perform its duty in this regard.\n\nXI. CUMULATIVE EFFECT OF ERRORS.\n\nAlthough we have found a few isolated instances of error in defendant's trial, we do not believe they affected its fairness either individually or taken together. Defendant was entitled to a fair trial, not a perfect one. (People v. Mincey, supra, 2 Cal. 4th at p. 454.) This record does not establish any significant error in the trial of guilt or penalty.\n\nXII. DISPROPORTIONATE PUNISHMENT\n\nFinally, we do not find defendant's death sentence grossly disproportionate to his personal culpability for these offenses; as on previous occasions, we decline to review the sentence in comparison to those in unrelated cases. (People v. Mincey, supra, 2 Cal. 4th at p. 476; People v. Kaurish, supra, 52 Cal. 3d at p. 716.) Defendant beat his two older neighbors to death in their own home, robbing them and sexually assaulting one as well. His apparent motive was to get money for his personal use. The nighttime burglary was defendant's idea, planned in advance. Although defendant may have been under the influence of alcohol or drugs, or feeling the effects of a drug dependency, the jury found on sufficient evidence that when he actually encountered the Galloways he formed an intent to kill them, an intent he carried out with considerable brutality. Even without consideration of defendant's past acts of violence, it is apparent death is not a constitutionally inappropriate punishment for these crimes.\n\nDisposition\n\nThe judgment of the superior court is affirmed in its entirety.\n\nLUCAS, C.J., KENNARD, J., ARABIAN, J., BAXTER, J. and GEORGE, J., Concurring.\n\nDisposition\n\nThe judgment of the superior court is affirmed in its entirety.\n\nMOSK, J., Concurring:\n\nI concur in the judgment. After review, I have found no reason to do otherwise.\n\nI also concur generally in Justice Werdegar's opinion for the court. It fully addresses, and soundly rejects, all of defendant's claims.\n\nI write separately to express my view that the time has come to revisit the question what mental state is required for first degree felony murder.\n\nSince \"in California all crimes are statutory and there are no common law crimes\" (In re Brown (1973) 9 Cal. 3d 612, 624, 108 Cal. Rptr. 465, 510 P.2d 1017; see Pen. Code, § 6), first degree felony murder is purely a creature of statute. The defining provision is Penal Code section 189: \"All murder . . . which is committed in the perpetration of, or attempt to perpetrate,\" certain enumerated felonies \"is murder of the first degree.\" As for mental state, there is no requirement of intent to kill, deliberation, or premeditation (see Pen. Code, § 189) or even of malice aforethought (People v. Hansen (1994) 9 Cal. 4th 300, 319, 885 P.2d 1022 (conc. \u0026 dis. opn. of Mosk, J.); see generally People v. Dillon (1983) 34 Cal. 3d 441, 472-476, 194 Cal. Rptr. 390, 668 P.2d 697 (plur. opn. by Mosk, J.); accord, id. at p. 490 (conc. opn. of Kaus, J.)). All that is demanded in this regard is the state of mind belonging to the underlying felony. To the extent that such decisions as People v. Sears (1965) 62 Cal. 2d 737, 745, 44 Cal. Rptr. 330, 401 P.2d 938, overruled on another point, People v. Cahill (1993) 5 Cal. 4th 478, 509-510, 853 P.2d 1037, footnote 17, and its progeny hold or state otherwise, they are unsound. Moreover, to the extent that they use the terms \"specific intent\" and \"general intent,\" which evolved as labels to identify particular crimes as, respectively, admitting or not admitting the defense of voluntary intoxication (People v. Hood (1969) 1 Cal. 3d 444, 455-456, 82 Cal. Rptr. 618, 462 P.2d 370; see People v. Whitfield (1994) 7 Cal. 4th 437, 463, 868 P.2d 272 (conc. \u0026 dis. opn. of Mosk, J.)), and which are in themselves \"notoriously difficult . . . to define and apply\" (People v. Hood, supra, 1 Cal. 3d at p. 456), they have proved to be mischievous. They should no longer be followed.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Baking soda is used to \"rock up\" cocaine, i.e., transform it into a smokable form. Around 7:30 that evening defendant told Val to go next door to the Galloways' to borrow baking soda. Val enlisted Mendoza to do the errand. Mendoza went to the Galloway residence and obtained baking soda from Mrs. Galloway.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Albis was in custody at the California Youth Authority at the time of trial. He was granted immunity for his testimony. He was not charged with any crime relating to the present case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The content of defense counsel's statements can be Judged from the following excerpts from his closing guilt phase argument: \"First of all burglary. \"Did Mr. Cain go in the Galloway home to steal? \"Yeah, he did. I said so in my opening statement, but that wasn't evidence. The evidence was from his own lips to the police. He stole.\" \" . . . .. . . . . . . . . . . . . . . . . . . . . . . . . \"What about murder? Is the defendant guilty of murder? \"Well, this may surprise you; but in my understanding of the law, yes, he is. He is guilty of murder. \"You may think: Wow, defense lawyer up there and he's giving away the store. He's not doing his job. He's not representing Mr. Cain. \"Well, I disagree with that. I think I am representing him, but I'm also not going to dispute facts that are not in dispute. Mr. Holmes [the prosecutor] is correct. If he's engaged in a felony inherently dangerous to human life and somebody dies, each participant is guilty of murder.\" \" . . . .. . . . . . . . . . . . . . . . . . . . . . . . . . \"I'm not saying and I won't say that the evidence is Tracy Cain killed anybody. My goodness. That's a big difference, and I tend [sic: intend] to stress that this afternoon. \"I submit the evidence is not Tracy Cain personally killed anybody; but I also submit ladies and gentlemen, that you don't even get to that part when you're talking about the murder. That's the special circumstance, but the murder-- \"Is he guilty of murder? \"The law is clear. He did something wrong, and that's burglary. That's a given. And somebody died during that. So it's a given. He's guilty. And he's guilty of murder.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant notes what he believes is a discrepancy between the response in the transcript, Court's Special Exhibit No. 17, and the response heard on the videotape. According to defendant's reply brief, on the defense copy of the videotape defendant is heard saying: \"Uh-uh . . . not that I know of . . . oh, no, no, no.\" Our review of the videotape played for the jury (People's exhibit No. 102) reveals no discrepancy. As the transcript reflects, defendant's response was: \"Uh-uh . . . not that I know of . . . I don't know nothing about that.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The jury was instructed as follows: \"If you find that before this trial the defendant made willfully false or deliberately misleading statements concerning the charge upon which he is now being tried, you may consider such statements as a circumstance tending to prove a consciousness of guilt but it is not sufficient of itself to prove guilt. The weight to be given to such circumstance and its significance, if any, are matters for your determination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Because we conclude the videotaped statement was properly admitted into evidence as tending to prove consciousness of guilt, defendant's related objection to instructing the jury in terms of CALJIC No. 2.03 on the ground there was no evidentiary support for the instruction is meritless. (People v. Kimble (1988) 44 Cal. 3d 480, 498, fn. 14, 244 Cal. Rptr. 148, 749 P.2d 803.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The jury was instructed: \"There has been evidence in this case indicating that a person other than defendant was or may have been involved in the crime for which the defendant is on trial. You must not discuss or give any consideration as to why the other person is not being prosecuted in this trial or whether he has been or will be prosecuted.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Cerda did not testify at defendant's trial. Defendant correctly concedes the instruction would have been proper if its application had been expressly limited to Cerda. (E.g., People v. Cox (1991) 53 Cal. 3d 618, 667, fn. 13, 280 Cal. Rptr. 692, 809 P.2d 351.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The instruction as given reads in relevant part: \"'Malice' may be either express or implied . . . . [P] Malice is implied when the killing results from an intentional act, the natural consequences of which are dangerous to life, which act was deliberately performed by a person who knows that his conduct endangers the life of another and who acts with conscious disregard for life. \"When it is shown that a killing resulted from the intentional doing of an act with implied malice, no other mental state need be shown to establish the mental state of malice aforethought. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Because the murders in this case occurred after our decision in Carlos v. Superior Court (1983) 35 Cal. 3d 131, 197 Cal. Rptr. 79, 672 P.2d 862 and prior to our decision in People v. Anderson (1987) 43 Cal. 3d 1104, 240 Cal. Rptr. 585, 742 P.2d 1306, defendant was tried by agreement under the rule set forth by this court in Carlos. Therefore, the trial court instructed the jury, with a modified version of CALJIC No. 8.80 (1984 rev.), that, in order to find any of the special circumstances true, it must first find defendant, whether acting as a principal or an aider or abettor, intended to kill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. With respect to the multiple murder special circumstance, the trial Judge instructed the jury with a modified version of CALJIC No. 8.81.3, which read as follows: \"To find the special circumstance, referred to in these instructions as multiple murder convictions, is true, it must be proved: \"1. That the defendant has in this case been convicted of more than one offense of murder in the first or second degree. \"2. That in both of these offenses of murder the defendant intended to kill or intended to aid in the killing of a human being.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Defendant may be understood to claim the failure to define the terms \"intent to kill\" or \"specific intent to kill\" rendered the jury instructions unconstitutional, because the jury was not provided with a basis for separating capital crimes from other murders. Defendant's contention lacks merit. First, we have concluded that no confusion arose from the instructions given relating to intent. Second, the terms are readily understandable. No prejudice could have resulted from the failure to instruct the jury on the meaning of intent in the language that defendant now suggests. Since the jury was properly instructed to find intent to kill, defendant's constitutional claim is meritless. (See People v. Anderson, supra, 43 Cal. 3d at pp. 1138-1148; Carlos v. Superior Court, supra, 35 Cal. 3d 131.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Defendant's trial counsel made an informed tactical choice to limit the voluntary intoxication instruction to the special circumstance allegations and not to include in the charge the specific intent crimes of attempted rape, robbery and burglary. The instruction given, of which defendant now complains, is the one drafted and requested by his attorney. Although counsel neglected to expressly include reference to the special circumstances, the record shows counsel \"made a conscious, deliberate tactical choice between having the instruction and not having it.\" (People v. Cooper (1991) 53 Cal. 3d 771, 831, 281 Cal. Rptr. 90, 809 P.2d 865.) Defendant's claim of reversible error is therefore also barred by the invited error doctrine. (Ibid.; People v. Marshall (1990) 50 Cal. 3d 907, 931, 269 Cal. Rptr. 269, 790 P.2d 676; see also People v. Kelly, supra, 1 Cal. 4th at p. 535 [court not required sua sponte to rewrite standard instruction that correctly states the law].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We have considered the interplay among all of the intent instructions given, including the implied malice instruction, and have found no reasonable likelihood a reasonable juror would have been misled in his or her deliberations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. As in prior decisions, \"we need not, and do not, reach the question whether the sufficiency-of-evidence review specified in the text is required under the due process clause of the Fourteenth Amendment to the United States Constitution and/or the due process clause of article I, section 15 of the California Constitution.\" (People v. Rowland, supra, 4 Cal. 4th at p. 271, fn. 11.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Because we conclude the rape special circumstance as alleged was both statutorily and constitutionally adequate, we do not further consider defendant's claim that permitting the jury to base its special circumstance finding on attempted rape resulted in a \"constructive amendment\" of the information. Furthermore, because we find neither error nor prejudice, defendant's ineffective assistance of counsel claim must be rejected also. We doubt, moreover, whether the principal \"error\" alleged, i.e., counsel's failure to claim surprise and prejudice where there was none, could be considered constitutionally deficient performance even if prejudicial. Effective assistance does not require counsel to refrain from frankness and honesty in his or her dealings with the court. (Cf. Nix v. Whiteside (1985) 475 U.S. 157, 171-176, 89 L. Ed. 2d 123, 106 S. Ct. 988 [counsel's successful effort to prevent defendant from perjuring himself is not ineffective assistance]; cf. Lockhart v. Fretwell (1993) 506 U.S. ___, 122 L. Ed. 2d 180, 188-190 [counsel's failure to raise objection was not ineffective assistance where objection would have been based on decision that was later overruled; test of prejudice is not outcome determination alone, but impact on fairness of the adversary proceedings].) To the extent defendant perfunctorily asserts other constitutional claims without adequate development, these claims are not properly made and therefore are rejected.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The context was as follows: \"Now, there are a lot of matters in the instructions that aren't going to be in dispute . . . . [P] There's obviously a burglary here. There's obviously a robbery, two deaths that resulted from that. Intent to kill is not an issue. After all, look at the pictures. . . . [P] The purpose of seeing them is to see what happened. The purpose is not to horrify you. . . . [P] What we have here is obviously a first-degree murder and an intentional killing. . . . [P] You look at Mr. Galloway, and you look at Mrs. Galloway, and you look at the diagrams, the body diagrams the autopsy surgeon did. That didn't take a second. That took time.\" The prosecutor then discussed intoxication as it affects intent to kill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Defendant cursorily protests the reconvening of the jury violated his rights to due process and equal protection. Because we find no statutory violation, the authority cited by defendant in support of his due process claim is inapposite and the claim fails. To the extent defendant explains his equal protection claim, he appears to argue the Bonillas rule violates equal protection because it applies only to capital cases. Defendant is wrong. Other bifurcated procedures are found outside the realm of capital cases. For example, the truth of allegations a defendant suffered prior convictions may be bifurcated from a jury trial of currently charged offenses. (See People v. Calderon (1994) 9 Cal. 4th 69, 72, 885 P.2d 83.) Under the proper circumstances, the Bonillas rule could apply in such a case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. We have held claims of Caldwell error fall within an exception to this rule of waiver. (People v. Bittaker (1989) 48 Cal. 3d 1046, 1104, 259 Cal. Rptr. 630, 774 P.2d 659.) The reason for this exception is not articulated in Bittaker, but it could be argued that when the court itself has referred to impermissible and prejudicial considerations an objection is likely to be futile, and in many cases may tend to aggravate the error's effect. Because of the potential difficulty of determining whether the waiver doctrine should apply in this case, we assume defendant has preserved this particular point, and treat it on the merits. (People v. Champion (1995) 9 Cal. 4th 879, 908, fn. 6; see, e.g., People v. Fudge (1994) 7 Cal. 4th 1075, 1106-1107, 875 P.2d 36; People v. Pinholster, supra, 1 Cal. 4th 865, 912.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The trial court's challenged comments were as follows: \"Do not mark up the old verdict forms. I have to save those if any reviewing court wants to see what we were doing and why I sent you back, to re-deliberate. I've got to keep the old forms to explain what we left out.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Because we find no error on the merits we need not decide whether, as the People argue, defense counsel's nonopposition to the challenge waived the claim or, if it did, whether nonopposition constituted ineffective assistance of counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In addition to the special instruction quoted above, the jury was instructed on lingering doubt as a mitigating circumstance in another instruction. That instruction also told the jury to consider the circumstances of the crime in its penalty decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Contrary to defendant's claim, counsel did not render ineffective assistance by failing to request such an instruction. Since the instruction given was not reasonably likely to have been understood as inviting the jurors to \"weigh\" each special circumstance twice (People v. Fauber, supra, 2 Cal. 4th at p. 858), it was neither deficient performance on counsel's part, nor prejudicial to defendant's case, to forego a special instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In his reply brief defendant argues the prior acquittal was \"necessarily based on an acceptance of the fact that Mr. Cain used neither an iron bar nor a rock . . . .\" The record does not support this claim. In the prior proceeding codefendant Mark Miller was convicted on count 3 of assault with a deadly weapon, to wit, an iron bar, and on count 4 of battery causing serious bodily injury. Thus the jurors in the previous trial may have acquitted defendant of the felonies because they believed Ramirez's injuries were caused by an attack with an iron bar for which they believed Miller, rather than defendant, was responsible. These verdicts say nothing about whether defendant hit Ramirez with a rock. Defendant suggests an attack with a rock of the size indicated by Fontes would necessarily cause serious injury. Although Fontes testified in the penalty phase here the rock was about eight inches wide, the record does not contain her testimony in the prior trial (references to that testimony by defense witness Clayton were stricken). Assuming the testimony was consistent, the jury in the previous trial could have found she was exaggerating the size of the rock. The jury could also have believed the prosecution had simply failed to show the rock was responsible for Ramirez's injuries in light of evidence that (as Fontes testified in the pretrial hearing here) once Ramirez got off of Miller, Miller hit him in the head with an iron bar, leaving him lying in a pool of blood.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant points out the offense was committed in 1981, when he was 18 years old.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Section 13-703 of the Arizona Revised Statutes, as amended in 1993, mandates consideration of any prior conviction for a \"serious\" offense, including in that category certain nonviolent offenses such as first degree burglary. (Ariz. Rev. Stat., § 13-703, subsections F.2, H.9.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Oregon defines \"aggravated murder\" as including murder by a defendant who has previously been convicted of murder or manslaughter. (Ore. Rev. Stat., § 163.095(1)(c).) In the proceeding to determine the sentence for an aggravated murder, however, \"evidence may be presented as to any matter that the court deems relevant to sentence.\" (Ore. Rev. Stat., § 163.150(1)(a).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See, e.g., West's Annotated Indiana Code, section 35-50-2-9(c)(1): mitigating circumstances used in selection include that \"the defendant has no significant history of prior criminal conduct.\" The Model Penal Code provision cited by defendant employs a similar mitigating circumstance: \"The defendant has no significant history of prior criminal activity.\" (Model Pen. Code, § 210.6.) The comment to this section notes: \"The word 'significant' was inserted into the tentative-draft formulation lest a trivial and remote conviction be construed to bar consideration of an otherwise law-abiding life as a mitigating factor.\" (Model Pen. Code and Commentaries, com. (b) to § 210.6, pp. 137-138.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. As the context demonstrates, the prosecutor could reasonably argue defendant admitted he felt, during the Saturday entry, no sympathy for the victims, but only fear for his own fate: \"[Police detective]: Didn't you feel anything when you walked in there and saw them like that? [P] [Defendant]: I was scared, man. [P] [Detective]: But didn't you feel any sympathy -- [P] [Defendant]: They laugh at shit like that, man. [P] [Detective]: Who do? [P] [Defendant]: Tony, man, Tony and Rick, man, and Dave, they laughed at shit like that, man. [P] [Detective]: Well, gotta be sick. [P] [Defendant]: And I know that shit going, I know, cause I'm the oldest . . . and I've been in prison before . . . and they gonna make, they gonna put me, make me look like I did all this shit, man . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In contrast, the defendant's \"mere failure to confess guilt or express remorse\" at a later time is not a circumstance of the crime, does not fit within any other statutory sentencing factor, and thus should not be urged as aggravating. (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant's brutality and use of his physical strength were demonstrated by the capital crimes as well as by the Perez, Fontes and Parker incidents, and were relevant under factor (b). The fact defendant worked only sporadically and was hence in need of money was relevant to motive, a circumstance of the crimes. Defendant's failure to support himself or to use his physical strength for good ends was also employed to demonstrate he had squandered his family advantages (a middle-class upbringing) and failed to profit from the good example of his father, a hard-working man of good character. The prosecutor suggested defendant's personal history was relevant not in aggravation, but to rebut any suggestion of mitigation in the defense evidence of background: \"Now he's thrown his life away, and that's no crime, and after all, we don't just because people throw away their lives, we don't vote to give them the death penalty, but on the other hand, he's thrown away his life, I submit to you, and that's no reason to save him.\" To the extent the prosecutor inadvertently strayed from this permissible argument into suggesting laziness and selfishness were aggravating factors, any error was harmless. There is no reasonable possibility the jury was moved to sentence defendant to death because he lacked permanent employment and lived with his father.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. After describing a premeditated execution-style killing, counsel argued: \"That's a far cry from a person who is so drug-impaired, he goes in there, stumbles around trying to get some money, and he acts in a rage reaction because that's what happened.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Although the Judge also stated he had, in preparation for ruling on the motion, refreshed his recollection of the evidence in part by reading the probation officer's factual summary, nothing in the record suggests he was influenced by any extraneous material. Defendant incorrectly argues the court's reference to defendant having denied using drugs must have been based on a statement to that effect in the probation report because there was no such evidence at trial. In the police interview introduced at trial defendant several times denied using \"dope\" or \"coke.\"\u003c/span\u003e\n\n",
    "body_length": 185813,
    "citedas": [
      "10 Cal.4th 1",
      "892 P.2d 1224",
      "40 Cal.Rptr.2d 481"
    ],
    "attorneys": "Cooper, White \u0026 Cooper, Willard P. Norberg and Kathleen A. Callaghan for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Carol Wendelin Pollack, Assistant Attorney General, John R. Gorey, Susan Frierson and Linda C. Johnson, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "78"
    ],
    "judges": "Werdegar, J.; Lucas, C.J., Kennard, J., Arabian, J., Baxter, J. and George, J., Concurring. Mosk, J.; Concurring separately.",
    "citation_count": 561
  }
}
