{
  "id": "lZ5XRmYBTlTomsSBybWm",
  "document": {
    "title": "State v. Alaska Civil Liberties Union",
    "full_title": "STATE OF ALASKA v. ALASKA CIVIL LIBERTIES UNION .",
    "jurisdiction": "Alaska Supreme Court",
    "date": "1999-04-16T00:00:00.000Z",
    "docket": "Supreme Court No. S-8778",
    "body": "5108 Notice: This opinion is subject to correction before publication in the Pacific Reporter. Readers are requested to bring errors to the attention of the Clerk of the Appellate Courts, 303 K Street, Anchorage, Alaska 99501, phone (907) 264-0608, fax (907) 264-0878.\n\nOPINION\n\nNo. 5108\n\nAppeal from the Superior Court of the State of Alaska, Third Judicial District, Anchorage, Michael L. Wolverton, Judge.\n\nI. INTRODUCTION\n\nThe Alaska legislature reformed Alaska's campaign financing statutes in 1996 by enacting Chapter 48 SLA 1996 (the Act), also known as Senate Bill (SB) 191. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The Alaska Civil Liberties Union (AkCLU) sued the State of Alaska, seeking a judgment declaring that parts of the Act violated rights of free speech and association by restricting campaign contributions and expenditures for state and local elections. Accepting AkCLU's arguments, the superior court held that SB 191 was unconstitutional. Because we hold that the State had a legitimate interest in preventing corruption or the appearance of corruption in state election campaigns and that most of the challenged provisions were narrowly tailored to achieve that interest, we hold that the challenged provisions, with limited exceptions discussed below, do not offend rights of speech and association. Reading the bans on non-group entities' expenditures and contributions narrowly, we reverse generally the judgment declaring the Act unconstitutional. But we affirm as to the invalidity of the pre-election year and legislative session contribution bans.\n\nII. FACTS AND PROCEEDINGS\n\nThe legislature's concern about the effect of undue influence on the work of government -- first expressed in a 1913 statute requiring lobbyists to register \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e -- has reached comprehensive scope in the last quarter-century. In 1974 the Alaska legislature enacted statutes regulating state election campaigns. Individuals were prohibited from contributing more than $1,000 annually to a candidate other than themselves. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e No cash contribution exceeding $100 could be made to a candidate, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and no expenditure promoting a candidate exceeding $100 could be made unless a written receipt was filed with the state's election commission. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Candidates' total expenditures in campaigns for various offices were limited by formulas relating to the office sought and the population of the constituency area, and, for house and senate seats, the number of seats in the district, although the legislature later repealed this provision. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In 1975 the legislature expanded the $1,000 annual candidate contribution limit to cover groups, political committees, businesses, corporations, and labor unions. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn 1996 the Alaska legislature comprehensively reformed Alaska's campaign financing laws by enacting SB 191. It passed the bill not long before voters were to vote on an initiative to reform campaign finance. The State asserts here, as it did below, that SB 191 was a response to the initiative and to public concerns about actual and apparent corruption in Alaska politics. The Act recited these legislative findings:\n\n\"(3) organized special interests are responsible for raising a significant portion of all election campaign funds and may thereby gain an undue influence over election campaigns and elected officials, particularly incumbents . . .\"\n\n\". . . .\"\n\n\"(5) because, under existing laws, candidates are completely free to convert campaign funds to personal income, there is great potential for bribery and political corruption.\"[ \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e ]\n\nThe Act also expressed the following purpose: \"It is the purpose of this Act to substantially revise Alaska's election campaign finance laws in order to restore the public's trust in the electoral process and to foster good government.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nSenate Bill 191, while less restrictive in some areas, was more comprehensive in scope than the initiative it sought to supplant. Unlike the initiative, SB 191 included not only contribution limits and prohibitions, and expenditure prohibitions, but time restrictions, restrictions on the use of campaign assets, restrictions on the use of gaming proceeds, exemptions from reporting requirements, campaign lending restrictions, and standards of criminal conduct. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nSenate Bill 191 became effective January 1, 1997. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nAkCLU sued the State in July 1997. It complained that the Act violated both the First Amendment to the United States Constitution, as applied to the states through the Fourteenth Amendment, and article I, section 5 of the Alaska Constitution. It sought declaratory and injunctive relief specifically challenging the validity of the Act's provisions containing (1) limits on campaign contributions; (2) bans on certain types of campaign contributions; (3) restrictions on the timing of contributions; (4) restrictions, which AkCLU characterized as expenditure limitations, on campaign funds carry-forwards and inter-candidate contributions; and (5) bans on independent expenditures by certain organizations.\n\nAkCLU moved for complete summary judgment, relying heavily on the United States Supreme Court's opinion in Buckley v. Valeo, which requires a threat of corruption or the appearance of corruption to justify regulation of campaign speech. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e AkCLU submitted no factual evidence. The State opposed AkCLU's motion, cross-moved for summary judgment, and submitted more than 1800 pages of documents. The documents included: independent studies; a study commissioned by the state senate; fifteen affidavits, including affidavits from former Governors Steve Cowper, Jay Hammond, and Walter Hickel, and former house member David Finkelstein; news clippings; Alaska Public Offices Commission (APOC) reports; and campaign disclosure records. AkCLU's reply attached the affidavit of an advertising firm account manager. AkCLU later submitted two additional affidavits in support of its motion for preliminary injunction.\n\nThe State's evidence discussed the proposed campaign finance initiative and the drive to place it on the ballot in 1996. The initiative contained a finding, as noted above, that \"[o]rganized special interests are responsible for raising a significant portion of all campaign funds, and may thereby gain an undue influence over campaigns and elected officials, particularly incumbents.\"\n\nMichael Frank, chair of Campaign Finance Reform Now!, the ballot measure organizers, affied that over 30,000 people signed the petition for the ballot initiative. Frank said he heard frequent comments from citizens who said that \"after candidates got elected they 'went bad' or 'became corrupt' or 'got crooked' or 'went on the take' and began accepting contributions and favors from the interests they were supposed to regulate.\" Frank stated his personal view that the existing system \"reeked of corruption.\"\n\nMichele Keck, who also collected signatures for the initiative, affied that she got involved because \"[t]he decisions of elected officials appear too often to be linked to campaign contributors [rather] than to the merits of the issues.\" She said she collected approximately 5,000 signatures for the initiative, and her impression was that others who signed the petition felt the same way she did.\n\nDavid Finkelstein, a former state house member, affied that he personally had gathered over a thousand signatures for the campaign reform initiative. \"The constant refrain I heard from citizens,\" he said, \"was that the Legislature was owned by special interests. This perception existed even among people who would not sign the initiative, who would often state that nothing was going to change the corruption caused by big money.\"\n\nThe State also introduced a report commissioned by the Alaska State Senate and produced by the Josephson Institute in 1990. The report discussed the opinions of lobbyists, legislators, and state public officials on legislative ethics in Alaska. The researchers found that: \"the level of trust and confidence in the integrity of the legislature is disturbingly low\"; the low level of trust is attributable at least in part to \"calculated evasions of the purpose and spirit of campaign laws\"; and calculated evasions of the campaign laws were, according to fifty percent of legislators and sixty-eight percent of public officials, a serious problem calling for greater regulation.\n\nFollowing oral argument, the superior court granted summary judgment to AkCLU. The court primarily relied upon Buckley, and gave several reasons for its result: the State had not introduced evidence of \"real harm\"; SB 191's contribution limits are impermissibly \"differen[t] in kind\" from the Buckley limits; and \"leveling the playing field\" is an inadequate justification for restricting campaign contributions. Concluding that the valid and invalid provisions were \"so inextricably intertwined\" that the valid provisions could not be severed and preserved, the court invalidated the entire Act, including those provisions AkCLU did not explicitly challenge, as unconstitutional under the First Amendment.\n\nThe State appeals.\n\nIII. DISCUSSION\n\nA. Standard of Review\n\nWe review grants of summary judgment de novo. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e To obtain summary judgment, the moving party must prove the absence of genuine factual disputes and its entitlement to judgment. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIf the movant makes a prima facie showing that he or she is entitled to judgment on the established facts as a matter of law, the opposing party must demonstrate that a genuine issue of fact exists to be litigated by showing that it can produce admissible evidence reasonably tending to dispute the movant's evidence.[ \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e ]\n\nWhen a court grants summary judgment without stating its reasons, we presume that the court ruled in the movant's favor on all the grounds stated. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e All reasonable inferences of fact must be drawn against the moving party and in favor of the nonmoving party. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThis case raises constitutional issues. Issues of constitutional interpretation are questions of law which we review de novo. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nB. History of Campaign Finance Litigation\n\n1. Buckley v. Valeo\n\nBuckley v. Valeo is the wellspring of modern campaign finance jurisprudence. The Supreme Court there reviewed contribution and expenditure limits contained in the 1974 amendments to the Federal Election Campaign Act of 1971. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e It concluded that all campaign finance restrictions impinge on public debate and therefore implicate the First Amendment. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e \"[C]ontribution and expenditure limitations impose direct quantity restrictions on political communication and association by persons, groups, candidates, and political parties . . . .\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAccordingly, the Court held that campaign finance reform measures limiting expenditures must satisfy \"the exacting scrutiny applicable to limitations on core First Amendment rights of political expression.\" \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Concerning contribution limits, the Court explained that \"[e]ven a 'significant interference with protected rights . . .' may be sustained if the State demonstrates a sufficiently important interest and employs means closely drawn to avoid unnecessary abridgment of associational freedoms.\" \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The Court later explained that to be constitutional, a provision burdening the exercise of political speech must be \"narrowly tailored to serve a compelling state interest.\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nBuckley addressed limits on contributions and expenditures in election races for federal office. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In doing so, the Court upheld the contribution limits but struck down the expenditure limits, drawing a distinction that the Court has continued to observe. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe challenged expenditure limits, the Court reasoned, were invalid because they directly and substantially limited the quantity of political speech. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The 1974 amendments limited individual and group expenditures to $1,000 per election for clearly identified candidates, thus preventing, for example, a one-quarter page advertisement in a major metropolitan newspaper. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The Court found that the governmental interest in preventing corruption and the appearance of corruption was inadequate to justify the ceiling on independent expenditures, for two reasons. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e First, the \"exacting interpretation\" needed to avoid unconstitutional vagueness would render the ceiling ineffective. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Second, there was little danger genuinely independent expenditures (those absent prearrangement and coordination) would be made as a quid pro quo for the candidate's \"improper commitments.\" \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The ceiling therefore served no \"substantial government interest\" but heavily burdened core First Amendment expression. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The Court also rejected, as insufficiently compelling, other rationales for campaign finance reform, including \"leveling the playing field.\" \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nBut the Court reasoned that contribution limitations, in contrast, primarily implicate associational rights. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The Court explained that\n\n\"a limitation upon the amount that any one person or group may contribute to a candidate or political committee entails only a marginal restriction upon the contributor's ability to engage in free communication. . . . The quantity of communication by the contributor does not increase perceptibly with the size of his contribution, since the expression rests solely on the undifferentiated, symbolic act of contributing.\"[ \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e ]\n\nThe Court held that while the interest in preventing corruption and the appearance of corruption is not compelling enough to limit speech directly by limiting expenditures, it is a sufficiently compelling interest to justify contribution restrictions. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The Court noted the absence of any indication the contribution limits \"would have any dramatic adverse effect\" on the funding of campaigns and political associations:\n\n\"Given the important role of contributions in financing political campaigns, contribution restrictions could have a severe impact on political dialogue if the limitations prevented candidates and political committees from amassing the resources necessary for effective advocacy. There is no indication, however, that the contribution limitations imposed by the Act would have any dramatic adverse effect on the funding of campaigns and political associations. The overall effect of the Act's contribution ceilings is merely to require candidates and political committees to raise funds from a greater number of persons and to compel people who would otherwise contribute amounts greater than the statutory limits to expend such funds on direct political expression, rather than to reduce the total amount of money potentially available to promote political expression.\"[ \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e ]\n\nThe Court then discussed the primary purpose of the 1974 amendments: \"the prevention of corruption and the appearance of corruption spawned by the real or imagined coercive influence of large financial contributions on candidates' positions and on their actions if elected to office.\" \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nIt is unnecessary to look beyond the Act's primary purpose -- to limit the actuality and appearance of corruption resulting from large individual financial contributions -- in order to find a constitutionally sufficient justification for the $1,000 contribution limitation. Under a system of private financing of elections, a candidate lacking immense personal or family wealth must depend on financial contributions from others to provide the resources necessary to conduct a successful campaign. The increasing importance of the communications media and sophisticated mass-mailing and polling operations to effective campaigning make the raising of large sums of money an ever more essential ingredient of an effective candidacy. To the extent that large contributions are given to secure a political quid pro quo from current and potential office holders, the integrity of our system of representative democracy is undermined. . . .\n\nOf almost equal concern as the danger of actual quid pro quo arrangements is the impact of the appearance of corruption stemming from public awareness of the opportunities for abuse inherent in a regime of large individual financial contributions. . . . Here . . . Congress could legitimately conclude that the avoidance of the appearance of improper influence \"is also critical . . . if confidence in the system of representative Government is not to be eroded to a disastrous extent.\"[ \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e ]\n\nThe Court also rejected contentions that other less restrictive means -- bribery laws and disclosure requirements --existed. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e \"Congress was surely entitled,\" the Court said, to view contribution ceilings as \"a necessary legislative concomitant\" for dealing with even disclosed contributions. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nThe Court concluded that the $1,000 contribution ceiling was valid, and noted: \"Significantly, the Act's contribution limitations in themselves do not undermine to any material degree the potential for robust and effective Discussion of candidates and campaign issues by individual citizens, associations, the institutional press, candidates, and political parties.\" \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The Court similarly rejected challenges to a $5,000 limitation on political committees' contributions, a limitation on volunteers' incidental expenses, and a $25,000 annual limitation on individuals' total contributions. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nThe Buckley Court set out three potential outer limits on contribution restrictions. First, it noted that \"[g]iven the important role of contributions in financing political campaigns, contribution restrictions could have a severe impact on political dialogue if the limitations prevented candidates and political committees from amassing the resources necessary for effective advocacy.\" \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Restrictions preventing \"effective advocacy\" would directly impact speech, and therefore would be invalid. Second, the Court warned that at some level contribution limits would become so low that \"distinctions in degree\" between limits would become \"differences in kind.\" \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Third, it approved the limits intended to prevent corruption through \"large\" contributions, but warned that a statute barring contributions that were not \"large\" would be presumptively overbroad and thus invalid. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\n2. After Buckley\n\nSince deciding Buckley, the Court has fleshed out its implications. The Court has invalidated some restrictions, finding no danger of corruption in independent expenditures by political action committees (PACs) \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e or political parties, \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e or in individual contributions relating to initiative campaigns, where there is no danger of an improper quid pro quo. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e The Court has upheld restrictions on indirect contributions to candidates, such as contributions to PACs. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e It has also rejected speech-restrictive campaign reforms whose only purpose was to lower the cost of elections. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nIts decisions have closely examined campaign restrictions on various organizations. Long before Buckley, federal law had prohibited contributions and expenditures by corporations and labor organizations. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Post-Buckley decisions narrowed the permissibility of such restrictions. In 1978 the Court reaffirmed the corporate right to speak and invalidated restrictions on corporate expenditures relating to ballot initiatives. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e It reasoned that corporate speech, like individual speech, \"furthers the societal interest in the 'free flow of commercial information.'\" \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nIn 1986, in Federal Election Comm'n v. Massachusetts Citizens for Life (MCFL), the Supreme Court declared that some nonbusiness, political corporations are protected from campaign finance limitations. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Because the corporation involved there, Massachusetts Citizens for Life (MCFL), had been formed to promote political ideas, had no shareholders, and was independent from the influence of business corporations, the Court reasoned that MCFL's political expenditures did not pose the same dangers as those of a typical corporation. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nIn 1990, in Austin v. Michigan Chamber of Commerce, the Supreme Court upheld the application of a state corporate campaign expenditure ban to a nonprofit corporation. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Its rationale --that corporations' \"unique state-conferred corporate structure that facilitates the amassing of large treasuries\" poses a danger of corruption -- announced a second model for potential political corruption which justifies regulation of political speech. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Austin preserved, however, the exception for nonbusiness, political corporations that meet the three criteria announced in MCFL. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nThese cases leave us with a jurisprudence based on the threat of corruption and the appearance of corruption, and dependent on case-specific analysis. Speech relating to ballot initiatives (where quid pro quo corruption is not a significant danger) is entirely protected. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e In campaigns for political office, individual speech is protected to the extent it is independent and poses no danger of quid pro quo arrangements; contributions and coordinated expenditures are subject to regulation. Corporations that meet special nonbusiness criteria (as per MCFL) pose no danger of corruption, and have rights similar to those of individuals. But corporations that do not meet those criteria are -- given the threat of corruption their state-created advantages pose -- completely subject to regulation.\n\nWe should note here that AkCLU would have us apply a strict \"real harm\" standard, over and above the \"compelling interest-narrowly tailored\" standard. AkCLU argues that \"the Supreme Court -- and all other courts -- require a threshold showing that a proposed restriction on First Amendment rights is justified by evidence of 'real harm' of a constitutionally cognizable interest . . . .\"\n\nThe Supreme Court articulated this threshold test in Turner Broadcasting System, Inc. v. FCC:\n\n\"When the government defends a regulation on speech as a means to redress past harms or prevent anticipated harms, it must do more than simply \"posit the existence of the disease sought to be cured.\" It must demonstrate that the recited harms are real, not merely conjectural, and that the regulation will in fact alleviate these harms in a direct and material way.\"[ \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e ]\n\nBut the Court tempered that statement:\n\n\"We agree that courts must accord substantial deference to the predictive judgments of Congress. Sound policymaking often requires legislators to forecast future events and to anticipate the likely impact of these events based on deductions and inferences for which complete empirical support may be unavailable. . . . That Congress' predictive judgments are entitled to substantial deference does not mean, however, that they are insulated from meaningful judicial review altogether.\"[ \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e ]\n\nThis standard of review, said the Court,\n\n\"is to assure that, in formulating its judgments, Congress has drawn reasonable inferences based on substantial evidence. . . . `[W]hen trenching on first amendment interests, even incidentally, the government must be able to adduce either empirical support or at least sound reasoning on behalf of its measures.'\"[ \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e ]\n\nWe believe the real harm test does not require exhaustive proof of corruption in this context, but merely, in the words of the Court, \"empirical support or at least sound reasoning\" in favor of the measures defended.\n\nWe turn now to those provisions of the Act specifically challenged by AkCLU.\n\nC. Ban on Independent Expenditures by \"Non-group\" Entities; AS 15.13.135\n\nThe Act bans any entity from making independent expenditures \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e to support or oppose a candidate for state office unless the entity qualifies as a \"group.\" \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e The definition of \"group\" in AS 15.13.135 effectively precludes business corporations, labor organizations, and other entities from making such expenditures. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nAkCLU and Amicus Alaska State Chamber of Commerce argue that the Act as a whole, and in part through AS 15.13.135, unconstitutionally interferes with the political speech of corporations, labor unions, unincorporated organizations, the Chamber, and its members by banning or limiting their independent expenditures and campaign contributions. AkCLU claims that the State has not articulated a compelling interest and has offered no evidence of \"real harm\" justifying any restraint on speech, and that the State's evidence of corruption is little more than a Discussion of the amounts corporations contributed before the Act became effective. It asserts that the State's desire to limit corporations' disproportionate influence reflects the discredited \"level playing field\" motive. It argues that the independent expenditures ban cannot satisfy federal law because Alaska law does not permit alternative participation by business and labor entities. AkCLU notes, for example, that federal law allows corporations and other entities to make unlimited contributions to political parties to use in general party activities. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e AkCLU also argues that Alaska law restricts non-group \"issue advocacy.\"\n\nThe State, relying on Austin, argues that the expenditure prohibition is justified by the need to avoid the \"disproportionate impact\" non-group entities would have on the political process. Citing Austin \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e and Brookings Institution scholar Daniel Ortiz, \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e the State argues that while the Supreme Court has characterized the interest as one of preventing a form of corruption, \"the interest is actually an interest in preventing the corporate voice from overwhelming individuals' voices, i.e., in leveling the playing field.\"\n\nThe State also argues that the expenditure prohibition is needed to prevent these entities from avoiding the contribution prohibition, contained in AS 15.13.074(f) and discussed below, that also applies to them. It argues that courts have upheld restraints on union and corporate expenditures in candidate elections, and it minimizes the impact of the ban by arguing that these entities still have ample alternatives for political expression. It responds to the overbreadth issue by arguing that APOC has prohibited independent expenditures for or against candidates by corporations or labor organizations using corporate or union treasury funds. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e It argues that in cases involving issue-oriented nonprofit corporations, courts apply a narrow construction to avoid any constitutional defect.\n\nAbsent meaningful argument tracing the cumulative effect of the Act's limitations on independent expenditures and contributions of \"non-group\" entities, we cannot assess exactly how these restraints function together, and how they differ in actual, real-world effect from restrictions found in the Federal Election Campaign Act or the Michigan statutes discussed in Austin. Given the Supreme Court's distinction between independent expenditures and contributions, \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e we deal here with these provisions separately, and first address AS 15.13.135 because the First Amendment gives greater protection to independent expenditures.\n\n1. Corporations and labor unions\n\nOur review of AS 15.13.135 requires us to return to Austin. Restraints on campaign expenditures by corporations and labor unions have long been part of federal law, and have long been upheld. In Austin, the Supreme Court upheld an independent expenditure ban as applied to a nonprofit corporation, the Michigan State Chamber of Commerce. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Because the Michigan statute permitted an alternative method for making expenditures, through \"separate segregated funds,\" the Court held that the restriction was narrowly tailored. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e It based its holding on \"'the compelling governmental interest in preventing corruption [from] political war chests funneled through the corporate form.'\" \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e The Court determined that the special \"state-created advantages\" of the corporate form allow corporations to amass large sums of money, potentially giving them \"an unfair advantage in the political marketplace.\" \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\n\nThe Court reiterated its explanation from MCFL that the political advantage of corporations is\n\n\"unfair because `[t]he resources in the treasury of a business corporation . . . are not an indication of popular support for the corporation's political ideas. They reflect instead the economically motivated decisions of investors and customers. The availability of these resources may make a corporation a formidable political presence, even though the power of the corporation may be no reflection of the power of its ideas.'\"[ \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e ]\n\nThe Michigan State Chamber argued that concern about corporate domination was insufficient to justify restricting independent expenditures. The Austin Court noted that in First National Bank v. Bellotti, it had recognized that a legislature might demonstrate a danger of real or apparent corruption posed by corporate expenditures made to influence candidate elections. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e The Austin Court then noted that the danger of financial quid pro quo corruption is not the only possible justification for restricting independent expenditures:\n\n\"Regardless of whether this danger of \"financial quid pro quo\" corruption may be sufficient to justify a restriction on independent expenditures, Michigan's regulation aims at a different type of corruption in the political arena: the corrosive and distorting effects of immense aggregations of wealth that are accumulated with the help of the corporate form and that have little or no correlation to the public's support for the corporation's political ideas.\"[\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e ]\n\nThe Court thus identified a second way in which the political process may be corrupted: through the disproportionate political influence corporate wealth can have because it bears no necessary relationship to the actual public support for the corporation's political views. This potential for distortion, rather than any actual or apparent danger of quid pro quo corruption, provided the threat that justified the Michigan statute in the Court's eyes. The Court has not retreated from its analysis in Austin.\n\nApplying Austin, we must first determine whether a \"compelling state interest\" justifies any restriction on non-group entities' independent expenditures in campaigns for elected office.\n\nThe State introduced substantial evidence -- discussed in Part II -- generally relating to corruption and the appearance of corruption. Some of the State's evidence discussing both expenditures and contributions confirms the disproportionate influence of corporate and labor union participation recognized in Austin.\n\nFor example, Larry Makinson states in Open Secrets that the top fifty contributors (not including political parties) donated about a third of the dollars received by Alaska legislative candidates in the 1986 election. \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e These fifty consisted of twenty-one corporations, nine labor unions, eight PACs and trade associations, six law and lobbying firms, and six individuals. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\n\nFormer Alaska Governor Steve Cowper affied that under the old rules \"[c]ontributions were bundled by corporations and unions from officers and employees associated with them so that greater amounts were given to candidates thereby increasing the amount given to a particular candidate and increasing the influence of the core contributor.\" He also stated that \"[t]hese business entities are given a special ability to accumulate money for business purposes . . . . Because of the wealth of unions and corporations, they can obtain more influence over elected officials than the individuals who elect them.\"\n\nAn Alaska Public Interest Research Group (AKPIRG) report claimed to show that \"business interests control over half of campaign contributions\" to candidates. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e This did not, the report said, consider \"the fact that donations to political parties are largely dominated by business.\" \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\nAPOC data supported the disproportionate-influence theory by demonstrating that the vast majority of donations to the House Republican Majority Fund in 1996 was made by corporations, trade associations, or their PACs.\n\nIn 1989 four of the five APOC members supported bans on contributions by PACs, unions, and corporations. They explained their stance under the theory that \"apart from political parties, only those who may vote should be entitled to contribute to candidates\" to minimize the appearance of \"special influence\" by \"special interests.\"\n\nThe State introduced the proposed campaign finance initiative and affidavits relating to the drive to place it on the ballot in 1996. As noted in Part II, the initiative contained a finding that \"[o]rganized special interests are responsible for raising a significant portion of all campaign funds, and may thereby gain an undue influence over campaigns and elected officials, particularly incumbents.\" \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nNo evidence regarding business corporations seems necessary. We think the reasoning underlying Austin resolved that issue as a matter of law. And it is equally clear that labor organizations may be barred from making independent expenditures in candidate campaigns. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e The Court considered and upheld the constitutionality of the segregation requirements as they applied to labor unions. \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e We therefore hold that the State has a compelling interest that justifies applying AS 15.13.135 to business corporations and labor unions.\n\n2. Other non-group entities\n\nBut the evidence discussed above and in Parts II and III.D of this opinion and the other evidence introduced in the superior court does not directly establish whether AS 15.13.135 permissibly may be applied to entities other than business corporations and labor unions.\n\nThe Supreme Court appears to have recognized that unions and corporations are not the only organizations potentially subject to treatment different from that accorded individuals. In Federal Election Comm'n v. National Right to Work Committee, the Court noted that \"there is no reason why [the governmental interest in preventing actual corruption and the appearance of corruption of elected representatives] may not in this case be accomplished by treating unions, corporations, and similar organizations differently from individuals.\" \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e In MCFL, the Court noted that corporations are \"by far the most prominent example of entities that enjoy legal advantages enhancing their ability to accumulate wealth.\" \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\n\nAlthough AS 15.13.135 clearly includes organizations that are not business corporations or labor organizations, the parties have not meaningfully discussed the differences in the organizational forms of \"non-group\" entities. The Alaska statutes permit various forms of unincorporated organizations. \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e Some, such as limited partnerships, have many of the attributes of corporations. A general partnership or limited liability partnership has some of these attributes, if not perpetual life. These organizations, like corporations, can amass large treasuries from their business operations and the capital contributions of their investors. And controlling partners or general partners might vote to spend some of the business treasury to support or oppose state election candidates over the objections of minority or limited partners, who, like corporate shareholders, have a stake in the business but no effective voice.\n\nSome aspects of the corporate form are unique, as Austin seems to recognize. But we conclude that the corporate form is not determinative. Nor is size determinative, because the Court has declined to distinguish between widely-held and closely-held corporations. \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e Equally non-determinative is actual wealth, because the Court has reasoned that it is the potential for unfair influence that justifies regulation. \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e For instance, in MCFL the Court invalidated an independent expenditure ban as it applied to a small, nonprofit corporation that had purely political purposes. \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nThe Court reasoned:\n\n\"Regulation of corporate political activity thus has reflected concern not about use of the corporate form per se, but about the potential for unfair deployment of wealth for political purposes. Groups such as MCFL, however, do not pose that danger of corruption. MCFL was formed to disseminate political ideas, not to amass capital.\"[ \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e ]\n\nWe agree with AkCLU that AS 15.13.135 as written embraces \"non-group\" entities whose speech may not be permissibly restricted by an expenditure prohibition. \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e But we cannot fully resolve the extent of any statutory overbreadth in this appeal in context of particular organizational forms or specific entities on the basis of the arguments and record before us.\n\nWe decline to strike down the statute on the theory the expenditure ban is overbroad as written. We choose instead to read the statute narrowly in order to prevent it from applying to \"non-group\" entities whose speech is constitutionally protected. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e Entities which are neither labor unions nor corporations are subject to expenditure bans only to the extent they are within the class of organizations potentially able to amass great wealth through state-created advantages. \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e We therefore read AS 15.13.135 in accordance with the three conditions Austin discussed in describing the MCFL exception. Thus, entities must be exempted from AS 15.13.135's ban if (1) they cannot participate in business activities, (2) they have no shareholders who have a claim on corporate earnings, and (3) they are independent from the influence of business corporations. \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e\n\nAkCLU asserts that exemptions may not be sufficient to avoid chilling speech because even entities that meet these criteria for exemption might be afraid to make expenditures for fear of prosecution. But we conclude that those criteria, approved by the Supreme Court, are sufficiently definite to provide meaningful guidance to would-be contributors. We also think it wise to resolve the ultimate boundaries of this statutory prohibition in the context of legal challenges asserting specific facts concerning particular organizations or types of organizations.\n\nThis narrowed construction of the prohibition leaves ample room for individuals involved in organizations to engage in political speech.\n\nAkCLU argues, in essence, that this prohibition, in conjunction with other provisions -- such as AS 15.13.074(f) -- leaves affected entities with no avenues for political speech. It suggests that there is no opportunity for such entities to establish segregated funds, in comparison with the Michigan statute discussed in Austin. It claims that these restraints on independent expenditures and candidate contributions are far more restrictive than those imposed by federal law, which it notes permits corporations and other entities to make unlimited contributions to a political party for use in general party activities. \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e The Alaska State Chamber of Commerce notes that the Michigan statute permitted corporations to form PACs.\n\nBut in our view, nothing prevents individual organizers of non-group entities from either forming a \"group\" to collect contributions and make expenditures, or soliciting individual contributions from other members without relying on treasury funds. Further, it appears that non-group entities may communicate their endorsements to their employees or members. \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e The State also contends that because organized entities meet the definition of \"person\" in AS 01.10.060(8), they may make contributions and expenditures for ballot propositions or questions even though they may not make them for or against candidates under AS 15.13.135 and AS 15.13.065.\n\nWe note too that the only remedy a dissident participant may have in such business entities, regardless of their size, when disagreeing with use of the entity's wealth for political speech, is potentially ruinous: withdrawal from the organization. In National Right to Work Committee, the Court upheld a statute barring contributions or expenditures by corporations, labor unions, and national banks in connection with federal elections, in part because it protected individuals who have paid money into the entity for purposes \"other than the support of candidates from having that money used to support political candidates to whom they may be opposed.\" \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e In Austin, the Court noted that because members have a significant incentive to continue their financial support for the Michigan State Chamber whatever their opinion of its political agenda, disclosure will not ensure that the funds in the Chamber's treasury correspond to members' support for its ideas. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e\n\nBecause the expenditure ban serves all these myriad purposes in a narrowly tailored fashion, we reverse the superior court's invalidation of AS 15.13.135.\n\nD. Contribution Restrictions\n\n1. Contribution bans\n\na. Bans on contributions by \"non-group\" entities; AS 15.13.074(f)\n\nThe Act prohibits a \"corporation, company, partnership, firm, association, organization, business trust or surety, \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e [or] labor union\" from contributing to a candidate or \"group.\" \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e\n\nThis outright ban on contributions directly implicates both political speech rights and associational rights of would-be contributors.\n\nBut, in light of the facts discussed in Part II and III.C, we hold that Alaska has a substantial governmental interest in campaign finance reform that justifies some restriction on First Amendment freedoms. We conclude that the considerations which justify the ban on independent expenditures by \"non-group\" entities (see Part III.C) also justify this contribution ban.\n\nAs we noted in Part III.C.2, the list of \"non-group\" entities subject to the ban is overbroad, and must be read in a manner consistent with the constitution. We again agree with the State's argument that such bans are potentially valid for reasons discussed in Austin: the \"state-created advantages\" of the corporate form create \"an unfair advantage in the political marketplace.\" \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e Organizations that do not benefit from such advantages -- most clearly, entities like MCFL \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e -- are not subject to such restrictions. Entities which are neither labor unions nor corporations are subject to contribution bans only to the extent they are within the class of organizations potentially able to amass great wealth through state-created advantages. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e We believe the permissible scope of these bans is best determined in context of fact- and class-specific litigation, \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e especially given the lack of briefing on the issue here. We therefore do not now attempt to list which types of entities the statute may permissibly affect. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\n\nAkCLU and the Chamber both contend that the restrictions on contributions and expenditures by corporations and labor unions, considered together, are so extreme as to constitute bans on issue advocacy. We disagree. Alaska Statute 15.13.135 (under our restricted interpretation) bars corporations and corporation-like entities only from making \"independent expenditure[s] supporting or opposing a candidate for election to public office.\" Under this rule, if \"explicit words of advocacy of election or defeat of a clearly identified candidate\" \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e are required to show support or opposition, issue advocacy will not be affected by the Act. We therefore reject AkCLU's argument that Austin must be read narrowly and that the State has offered no evidence justifying the contribution ban.\n\nWe also reject the Chamber's assertion that the ban is overbroad because it includes organizations that are not wealthy. Because it is the potential for corruption or the appearance of corruption that justifies the restraint, the actual wealth of a given organization is irrelevant. It is enough that the entity operate in a form which has benefitted from \"state-created advantages\" that give it \"an unfair advantage in the political marketplace.\" \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e\n\nb. Restrictions on contributions by nonresidents; AS 15.13.072(a), (e), (f)\n\nAlaska Statute 15.13.072 prohibits a candidate, group, or political party from soliciting or accepting contributions from nonresident individuals except to the extent that all the contributions received from nonresidents do not exceed specified limits. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e It also prohibits a candidate from soliciting or accepting any contributions from a group which is organized under the laws of another state, which is resident in another state, or whose participants are not Alaska residents when the contribution is made. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e Consequently, nonresident individuals may make contributions to a candidate subject to the sliding limitations of AS 15.13.072(e) and to a group or political party subject to the ten-percent limitation of AS 15.13.072(f); nonresident groups may make no contributions at all. Nonresident individuals and groups may make unlimited independent expenditures.\n\nThese restrictions on the speech of nonresidents must meet the \"narrowly tailored-compelling interest\" test discussed in Part III.B. In justification, the State argues that these restrictions \"prevent nonresidents from dominating the process,\" and that \"[b]y restricting the influence of nonresidents . . . the reforms promote the valid state goal of encouraging voter participation in campaigns.\" The State refers us to no specific evidence of corruption or the appearance of corruption caused by out-of-state contributions, and does not contend that quid pro quo corruption justifies these restraints.\n\nApplicable to this issue is the general evidence of the influence of money and political system corruption and appearance of corruption. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e In addition, two former Alaska governors submitted affidavits in which they affied that contributions from outside the state create serious loyalty problems. Former Governor Walter Hickel stated that \"whenever a candidate has to seek donations from outside the state, the candidate is buying a potential conflict of interest.\" Former Governor Jay Hammond stated that\n\n\"[t]he necessity of having to raise substantial sums of money from non-Alaska resident contributors discourages many qualified Alaskans from becoming candidates. And it taints those who do. How can the average Alaska voter believe that a candidate who has accepted thousands of dollars from non-Alaska resident contributors who have pecuniary interests at stake in the votes the candidate will cast if he or she is elected is not obligated to the contributors as much as he or she is to the voters? And there is an unfortunate basis in fact for that perception. Once elected, it is all too easy for candidates to accommodate mores to money, particularly since non-Alaska resident contributors do not ask the candidates that their money has helped to elect to act unlawfully, and most issues of public importance are rarely black and white. It is amazing how a flash of green can help clarify an ambiguous policy choice.\"\n\nThe State cites O'Callaghan v. State \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e and Vote Choice, Inc. v. DiStefano \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e in defense of the restrictions. But neither case certifies nonresident domination or enhanced voter participation as a compelling interest. O'Callaghan discusses a Wisconsin opinion holding that an interest in voter participation is compelling, but the United States Supreme Court reversed that ruling on other grounds. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e Vote Choice portrays facilitated communication between the candidate and the electorate as only a \"valid\" interest. \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e The Supreme Court has never held that fear of nonresident domination or a goal of enhanced voter participation is a compelling state interest justifying restraints on campaign finance.\n\nAkCLU argues that absent \"some evidence showing the corruptive influence of non-resident contributions, there can be no legitimate reason to preclude them from participating in the election process.\" It claims that these restraints are merely intended to \"level the playing field,\" an insufficient justification. Because the contribution limits applicable to residents also apply to nonresidents, \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e AkCLU contends that the State must show special corruption caused by out-of-state contributions in order to uphold additional restrictions on nonresidents. It cites evidence discussing contributions by out-of-state groups as minimal, but the sources cited use a far less expansive definition for non-residence than the statute, making the evidence an unreliable barometer of the statute's impact.\n\nAkCLU relies on VanNatta v. Keisling. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e The Ninth Circuit, applying a \"less-than-strict, rigorous scrutiny,\" there struck down an Oregon constitutional amendment that restricted out-of-district contributions made to state candidates. \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e The Ninth Circuit unanimously held that the amendment was not closely drawn to advance the goal of reducing corruption because it banned all out-of-district donations, regardless of size. \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e But Judge Brunetti also concluded in his Dissenting opinion that \"Oregon has a sufficiently important interest in protecting its republican form of government,\" \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e reasoning that\n\n\"[i]f states have flexibility in determining who is a resident for voting purposes and in taking steps to make sure non-residents do not have access to some state services, it follows that states also have a strong interest in making sure that elections are decided by those who vote. The Supreme Court has come very close to saying as much in Shaw, Holt, and Austin. With the increasing importance of fundraising in elections generally, . . . and in Oregon in particular, elections are for all intents and purposes are [sic] often decided well before any resident steps into a voting booth.\"[ \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e ]\n\nAlthough Judge Brunetti's analysis is intriguing and we have recognized a similar theme in a different context, \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e we need not consider it here, because we think VanNatta is distinguishable on its facts. Oregon's out-of-district restrictions applied to both nonresidents and residents of Oregon. \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e But Alaska's challenged provisions apply only to nonresidents of Alaska, and do not limit speech of those most likely to be directly affected by the outcome of a campaign for state office -- Alaska residents regardless of what district they live in. Also, Alaska is not contiguous to any other state, and the general state residence requirement does not have the same impact on nonresidents that Oregon's district-specific restrictions had.\n\nFurther, we respectfully disagree with the VanNatta court's Discussion of \"largeness,\" even though Alaska's restrictions do not directly distinguish based on the size of the individual contributions. Alaska's restrictions attempt \"to ensure the integrity of political structures and processes.\" \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e They are aimed not at very large individual contributions, by which a single contributor can influence a candidate, but at cumulatively vast out-of-state contributions. Austin recognized this sort of corrupting influence. \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e Further, the limits here are closely drawn to achieve the goal of preventing non-resident contributors from drowning out the voices of Alaska residents. Though the State introduced evidence of the extent of what it called \"out of state\" contributions in recent elections, we are uncertain of the value of the State's evidence. The Act's limitation on nonresident groups applies, as noted above, to groups whose participants are not Alaska residents at the time of the contribution. \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e No records of sufficient specificity have been kept to show how many groups this might affect. We therefore conclude the record contains no evidence relating to the potential impact of this provision.\n\nAlaska has a long history of both support from and exploitation by nonresident interests. Its beauty and resources have long been lightning rods for social, developmental, and environmental interests. More than 100 years of experience, stemming from days when Alaska was only a district and later a territory without an elected governor or voting representation in Congress, have inculcated deep suspicions of the motives and wisdom of those who, from outside its borders, wish to remold Alaska and its internal policies for dealing with social or resource issues. Outside influence plays a legitimate part in Alaska politics, but it is not one that Alaskans embrace without reservation. The Act's restraints on nonresident contributions attempt to limit this influence, and attempt to prevent elected officials from becoming beholden to those influences. Through mass marketing and solicitations, organizations can marshal vast numbers of contributions by individuals. These nonresident contributions may be individually modest, but can cumulatively overwhelm Alaskans' political contributions. Without restraints, Alaska's elected officials can be subjected to purchased or coerced influence which is grossly disproportionate to the support nonresidents' views have among the Alaska electorate, Alaska's contributors, and those most intimately affected by elections, Alaska residents. These restraints therefore limit the \"potential for distortion.\" We hold that this is a sufficiently compelling state interest. \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e Any question whether the dollar and percentage limits are unduly low turns on a \"difference in kind\" analysis, and we do not read the record to indicate that these limits in fact impinge on nonresidents' speech or associational rights.\n\nAkCLU also objects to the \"tracing rule\" of AS 15.13.072(f), which states that contributions from \"individuals who are not residents may not exceed 10 percent of total contributions\" made to groups or political parties in a given year. AkCLU also asks that reporting requirements imposed on \"non-resident\" groups be invalidated for overbreadth. Because AkCLU's brief has devoted only five lines to these arguments, we decline to consider their merits. These provisions are not so obviously invalid that we will invalidate them based on the limited briefing before us.\n\nc. Ban on registered lobbyists' out-of-district contributions; AS 15.13.074(g)\n\nAlaska Statute 15.13.074(g) prohibits a registered lobbyist from contributing to legislative candidates in districts outside the district in which the lobbyist is eligible to vote. \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\n\nThe State contends that AS 15.13.074(g) reduces corruption and the appearance of corruption, and argues that lobbyists are like other persons whose contributions create \"special risks\" of actual or apparent corruption. It asserts that \"greater risks of corruption attend lobbyists' special relationship with elected officials.\"\n\nAkCLU counters that the State has not demonstrated what real harm is alleviated by the restriction and that the $500 individual contribution limit already prevents \"large\" contributions that could corrupt. It claims the ban violates free speech. (The heading in AkCLU's brief also asserts that this ban violates lobbyists' rights to equal protection but because AkCLU has not briefed this contention, we do not reach it.)\n\nThe State introduced evidence, through affidavits and a survey commissioned by the state senate, of perceptions of the role lobbyists play in political fund-raising. According to the survey, fifty percent of registered lobbyists believe fund-raising pressure by special interests is a \"serious problem,\" because monied interests get special access to and influence over legislators.\n\nEighty-seven percent of lobbyists said that the refusal to make campaign contributions sometimes adversely affects lobbying. Thirty-seven percent said that this happens frequently and that lobbyists often give contributions \"defensive[ly] to ward off negative reactions and the loss of access.\"\n\nThe State submitted an Anchorage Daily News (ADN) article, attached to the Frank affidavit, about one lobbyist's settlement of campaign finance law violations. Frank's affidavit also attached another article from an unspecified national journal comparing lobbyist contributions to bribery of Judges.\n\nDavid Finkelstein affied that lobbyists serve as conduits for the clients they serve. He stated that \"the clear message\" lobbyists gave him as a legislator was that \"I was expected to give them special consideration.\" He recalled that large contributors had an effect on some of his early votes.\n\nThe State also discussed APOC records that imply that substantial risks of actual or perceived corruption attend lobbyists' special relationship with elected officials. The records concerned questionable financial relations between legislators and lobbyists, including informal loan arrangements and unreported lobbyist payment of air travel costs.\n\nThis evidence supports the State's assertion that lobbyists' contributions are \"especially susceptible to creating an appearance of corruption.\" The State argues:\n\n\"When in session, Alaska's legislature is geographically isolated from the state's core population. Lobbyists are, by definition, paid to influence administrative or legislative action. AS 24.45.171(8). Their professional purpose, coupled with their proximity to legislators during the legislative session, makes them particularly susceptible to the perception that they are buying access when they make contributions.\"\n\nBased on this evidence we conclude that the State had a compelling interest justifying some restraint on speech.\n\nThe next question is whether the challenged ban is narrowly tailored to serve the purpose of preventing actual or perceived corruption. Unlike most individuals, who are unlikely to have any incentive to contribute to many of the candidates for the fifty legislative seats at issue each general election, \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e a lobbyist has some incentive to contribute to candidates whose election will place them in a position to introduce or thwart legislation and to vote in committee or on the floor on matters of professional interest to the lobbyist.\n\nThe cumulative effect of numerous $500 contributions by a single lobbyist is substantial. By virtue of the lobbyist's special role in the legislative system, his or her broad distribution of campaign money creates a very real perception of influence-buying. The diffusion of cash is all the more dangerous because it has the potential to achieve influence with a significant portion of sitting legislators. For example, in the 1990 election cycle, fifty-one lobbyists made 485 contributions averaging $433 each, for a total of $210,047. Seventy-six candidates received these contributions. Perhaps other alternatives would have been effective in carrying out the State's purpose, but the out-of-district ban draws a logical compromise between lobbyists' private rights and their professional obligations.\n\nWe also conclude that the restraint does not foreclose lobbyists from engaging in political speech. As the State notes, lobbyists retain other contribution avenues. For example, \"[they] may also participate in and contribute to 'groups' -- including political parties -- which may contribute to any legislative candidate.\" And they may make independent expenditures for any legislative candidate.\n\nOther courts have imposed campaign speech restrictions on individuals based on their professions. The Vermont Supreme Court, for example, upheld a lobbyist speech restriction four years ago in Kimbell v. Hooper. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e There the court rejected a challenge to a Vermont statute that prohibited contributions by registered lobbyists to legislators while the legislature is in session. \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e The court concluded that \"[t]he legislature has chosen a narrowly drawn measure to avoid a serious appearance of impropriety, and we see no reason to strike that measure down.\" \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e In our view, lobbyists are similar to those professionals whose contribution rights have been permissibly restricted by federal and state law, because their contributions create special risks of actual or apparent corruption. \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e\n\nWhile the State may not \"burden substantially more speech than is necessary to further the government's legitimate interests,\" \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e we conclude that the ban on out-of-district lobbyist contributions is narrowly tailored to further the State's compelling interest. We therefore uphold the ban on out-of-district contributions by lobbyists.\n\n2. Contribution limits\n\nThe Supreme Court has encapsulated the problem of judging contribution limits: \"'if it is satisfied that some limit on contributions is necessary, a court has no scalpel to probe, whether, say, a $2,000 ceiling might not serve as well as a $1,000.' Such distinctions in degree become significant only when they can be said to amount to differences in kind.\" \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e Another court observed that \"every jurisdiction is sui generis, and thus every campaign contribution limitation must be Judged on its own circumstances.\" \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e\n\nIn addition to the evidence discussed in Parts II and III.C, the State submitted evidence directly relating to the influence of large contributions.\n\nAccording to the Josephson Report survey, only eight percent of lobbyists said no legislator can be influenced by campaign contributions to take or withhold some significant legislative action. Forty-seven percent said at least a quarter of the legislature could be so influenced.\n\nMichael Frank attached to his affidavit copies of newspaper articles and columns to support his contention that people are generally \"fed up\" with the corruption of the system as it currently stands. These include: (1) an ADN editorial pointing out the conflicts of interest on a tax issue faced by legislators who received money from the oil industry. \"It's absurd to believe that any legislator can receive thousands of dollars from mighty contributors and remain totally unaffected by it,\" the editorial argues; (2) an ADN article about the proposed initiative, quoting lobbyist Jerry Reinwand as saying \"I can't imagine anything more distasteful than the system we have now.\" The article also quotes AKPIRG director Stephen Conn as criticizing the system for making politicians beholden to large contributors, and as saying \"[t]he game seems rigged right from the beginning\"; (3) an ADN editorial column by Howard Weaver articulating the view that \"[a]s the price of politics gets higher, politicians are necessarily forced to pay more attention to those who can give them money\"; (4) an ADN editorial criticizing a state senator who had dismissed the public concern that contributions taint state politics as \"a great paranoid myth.\" The editorial mocked the senator's statement as patently false; (5) an ADN column by Mike Doogan implying that Governor Tony Knowles's stance on some issues is governed by the fact that British Petroleum was a large contributor to Knowles's political party, the Democratic Party; and (6) an ADN article quoting David Finkelstein as saying, \"It's obvious that much of what goes on is buying influence, not influencing elections.\"\n\nSome of the evidence implies that campaign contributions actually corrupt. Larry Makinson's Open Secrets strongly implies that an immense infusion of oil money into the Republican Party in 1986 brought about the demise of a North Slope tax proposal that would have cost oil companies $100 million. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e\n\nAn AKPIRG report postulated in 1995 that candidates considered election funding when passing bills that exempted cruise lines from gambling and alcohol taxes, exempted price-setting commercial fishermen from antitrust laws, repealed seafood processing quality assurance plans, reduced oil royalties payable to the state, and \"slashed funding for consumer protection and antitrust cases.\" \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e The report author asserted that \"only the most naive would miss the connection between large contributions and protection of interests.\" \u003cspan class=\"fnref\"\u003e140\u003c/span\u003e\n\nFormer Alaska Governor Steve Cowper affied that he believes the current state of campaign finance breeds \"cynicism and distrust.\" \"[T]here is very little practical difference,\" Cowper affied, \"between a large campaign contribution and a bribe.\" He further stated that the public \"generally understands that campaign contributions are an important factor taken into consideration by elected officials in every vote taken or decision made.\"\n\nFormer Alaska Governor Jay Hammond described an unusual position he faced in his first senate term. Having accepted money from oil interests, he felt compelled to vote against them just to show he had not been bought. He ultimately voted against \"Big Oil,\" and \"[a]lthough I like to think that I cast those votes based on the merits of each bill,\" he said, \"to this day I am not sure of my true motivation.\"\n\nDavid Finkelstein affied that while he resisted the influence of big contributors on major bills, \"I do recall that large contributors had an effect on my vote\" on some minor bills.\n\nCharles Wohlforth, a member of the Anchorage Municipal Assembly, affied that\n\n\". . . I have at times found it impossible to dissect my own motives in voting on complex issues with conflicting and incomplete information and faced by advocacy from important contributors to my campaigns. Despite my best efforts and particular concern about campaign finance reform I cannot with complete confidence say I have never been influenced by campaign contributions.\n\n\". . . I have developed the belief and the working assumption that campaign contributions received and the prospect of receiving future contributions often affects the outcome of Assembly votes.\"\n\nWe conclude that the State's evidence demonstrated that there is a legitimate concern about corruption or the appearance of corruption, and the potential for resulting erosion of public confidence in the electoral process. This evidence established the existence of a compelling governmental interest justifying some restrictions on local and state election campaign contributions. The question is whether the contribution limits adopted in SB 191 are narrowly tailored or whether they unconstitutionally prevent \"effective advocacy\" \u003cspan class=\"fnref\"\u003e141\u003c/span\u003e or represent \"differences in kind.\" \u003cspan class=\"fnref\"\u003e142\u003c/span\u003e\n\na. Limits on individuals' contributions; AS 15.13.070(b)\n\nIndividuals are prohibited by AS 15.13.070(b) from contributing more than $500 per year to a candidate or to a \"group\" that is not a political party, and from contributing more than $5,000 per year to a political party. \u003cspan class=\"fnref\"\u003e143\u003c/span\u003e Prior to 1996, Alaska's individual contribution limit was $1,000 per year. \u003cspan class=\"fnref\"\u003e144\u003c/span\u003e\n\nThe State defends these limits as necessary to \"avoid the risks of corruption and its appearance that large contributions create, without interfering with the expressive and associational aspects of contributing.\" The State acknowledges that to be held valid, the limits cannot undermine \"robust and effective\" public debate and must withstand strict scrutiny.\n\nThe State argues that federal law requires that each jurisdiction's restrictions be Judged based on the applicable context. \u003cspan class=\"fnref\"\u003e145\u003c/span\u003e The State contends that deference to legislative determinations is the general practice in such cases. It relies on documents it filed in the superior court as proof that the total amount contributed to candidates under the reforms has not declined from pre-reform totals. The State would justify the limits on contributions to groups and political parties as preventing backdoor evasion of the candidate contribution limits.\n\nAkCLU, on the other hand, argues that the $500 limit per candidate is too sweeping, and insufficiently justified. It argues that the initial limits authorized in Buckley were intended to prevent \"the problem of large campaign contributions -- the narrow aspect of political association where the actuality and potential for corruption had been identified.\" \u003cspan class=\"fnref\"\u003e146\u003c/span\u003e Not only are these limits lower than needed to prevent corruption, AkCLU contends, but the State has failed to demonstrate \"real harm\" caused by contributions in the $500 to $1,000 range, given that the pre-reform limit was $1,000.\n\nAkCLU contends that the restriction merits no deference to the legislature, given the high cost of elections in Alaska, and the fact that, after adjustment for inflation, the Alaska limit is only eight percent of the limit approved in Buckley in 1976. According to AkCLU, the restriction is an impermissible \"difference in kind.\"\n\nAkCLU also argues that the State's restrictions on contributions to political parties are unnecessary and not narrowly tailored. AkCLU contends that the State offers no evidence of backdoor violations of the current limit, and that existing law, by prohibiting laundering, already closes such loopholes.\n\nIn support of its cross-summary judgment motion, the State introduced evidence to show that the reforms would not impede the ability of candidates to run successful campaigns.\n\nRobert Stern, of the Center for Governmental Studies, examined past contributions and made predictions about the effects of reform. He predicted that contributions would drop, but not so much as to place a \"substantial burden\" on candidates. He determined that house candidates would need only ninety-four contributions of $500 to reach the median total successful candidates raised for the 1990-96 elections. Following Stern's statistics, senate candidates would require only 185 contributions of $500 each to reach the median total successful candidates raised for the 1990-96 elections. Likewise, candidates for governor would need only 2,448 contributions of $500 to reach the median total successful candidates reached during the 1990-94 elections. Stern predicted that the off-year ban would impact incumbents more than challengers. And he predicted that the ban on inter-candidate transfers would have minimal effects.\n\nNadine Hargesheimer, a campaign staffer for two Fairbanks mayoral candidates, affied that the reforms \"did not materially affect Mayor Hove's ability to raise enough money to run an effective campaign\" for that office in 1997. Despite the fact that there were three fewer mayoral candidates in 1997, the amount raised in that race was in fact about ten percent more than the $148,228 candidates raised in 1991.\n\nHarriet Drummond, a member of the Anchorage School Board, affied that the reforms \"had no substantial impact on my fundraising\" in her 1997 campaign for re-election.\n\nThomas Begich, a campaign consultant, affied that no specific amount of money is required to run a viable campaign; he stated that \"I believe it is clear that competitive campaigns can be run in Alaska under the present campaign finance reform law.\" He added that \"while a campaign's competitiveness does not appear to be affected\" by the reforms' restrictions, \"the proportional impact of an individual's influence on the election process over that of a non-individual (PAC, business or labor union) has increased.\"\n\nAkCLU opposed this evidence in the summary judgment proceeding with one affidavit. James Lottsfeldt, an advertising firm account manager, affied that the reforms \"will so severely limit the available resources to candidates that, except in unusual circumstances, the limitations will materially impair a candidate's ability to conduct an effective campaign.\" Such a system will, Lottsfeldt stated, benefit individuals with enough private wealth to campaign without contributions.\n\nTo support its motion for a preliminary injunction, AkCLU submitted two other affidavits.\n\nTom McKay, Chairman of the Republican Party of Alaska, affied that the Act \"substantially impairs the Republican Party's ability to raise sufficient funds to support its activities.\" He cited a drop in fundraising from $362,525 in 1995 to $119,917 in 1997 (both non-election years).\n\nGary Jacobson, a professor of political science at the University of California, San Diego, disputed the relevance of the Drummond and Hargesheimer affidavits. He maintained that analyses of effects based on municipal election data are not valid for elections to the state legislature.\n\nBoth sides cite case law to support their contentions. So far as we are aware, no court has invalidated individual-to-candidate contribution limits similar to those at issue here on the ground they are per se unconstitutional. \u003cspan class=\"fnref\"\u003e147\u003c/span\u003e Rather, the Supreme Court upheld as a matter of law a $5,000 limit on individuals' contributions to multicandidate political committees. \u003cspan class=\"fnref\"\u003e148\u003c/span\u003e And in Buckley, it upheld the FECA $1,000 limit on individuals' contributions to candidates, even though the FECA also imposed a $25,000 cumulative annual limit on an individual's contributions. \u003cspan class=\"fnref\"\u003e149\u003c/span\u003e The Sixth Circuit affirmed a grant of summary judgment approving a $1,000 limit on contributions by individuals to a single candidate in an election year. \u003cspan class=\"fnref\"\u003e150\u003c/span\u003e The Eighth Circuit invalidated a $100 contribution limit on the basis of undisputed facts that indicated the limit was too low to allow meaningful political speech in campaigns. \u003cspan class=\"fnref\"\u003e151\u003c/span\u003e The Oregon Supreme Court invalidated a $500 limit on individual campaign contributions because the legislation did not specify any harm it was intended to fix. \u003cspan class=\"fnref\"\u003e152\u003c/span\u003e\n\nOther courts, examining contribution limits following trial, have considered a variety of factors to determine whether a particular limit is constitutionally permissible. In Carver v. Nixon, the Eighth Circuit considered multiple quantitative factors -- including the cost of elections and the percentages of small-contribution donors -- to find that the $100-$300 limits there in issue were invalid because they entailed a \"difference in kind.\" \u003cspan class=\"fnref\"\u003e153\u003c/span\u003e In National Black Police Ass'n v. District of Columbia Board of Elections and Ethics, the court invalidated $100 and $50 limits as too restrictive of candidate speech after a full trial. \u003cspan class=\"fnref\"\u003e154\u003c/span\u003e\n\nIn Montana Right to Life Ass'n v. Eddleman, the district court held that \"a determination of what constitutes a 'large' contribution associated with campaign corruption or the appearance of corruption is based upon the particular facts and circumstances of the campaign at issue.\" \u003cspan class=\"fnref\"\u003e155\u003c/span\u003e\n\nThe same sentiment was expressed in California Pro-life Council v. Scully, where the district court held that \"[t]he facts pertinent to each jurisdiction, such as the size of the district, the cost of media, printing, staff support, news media coverage, and the divergent provisions of the various statutes and ordinances undermines the value of crude comparisons.\" \u003cspan class=\"fnref\"\u003e156\u003c/span\u003e\n\n(1) Individual contributions to candidates\n\nThe affidavits and other documents filed by the State in the superior court support a finding that the contribution limits do not place a substantial burden on the ability of candidates to run competitive local or state election campaigns. The opinions of the State's experts also support that Conclusion. Facts adduced by the State memorializing experience in local and statewide races support the experts' opinions. The excerpt contains a summary of candidates' disclosure statements indicating that the total amount of contributions has not declined significantly since enactment of SB 191. The record suggests that the contribution totals for 1998, the first election year after the reforms took effect, exceed the comparable 1996 campaign totals.\n\nAs we noted above, AkCLU offered two affidavits to support its injunction request and one to support its summary judgment argument. They generally assert that the Act's provisions impair fund-raising and advocacy, but do not explain the impact of particular provisions of the Act, including these contribution limits. Nor do they discuss the effect of the two temporal limitations that we hold to be invalid in Part III.D.3. Even standing alone, the affidavits would not support findings that the contribution limits are different in kind than Alaska's pre-existing $1,000 limit or the limit the Supreme Court approved in Buckley, or are any lower than the lowest limit the Supreme Court would approve for state election campaigns. Buckley did not hold that $1,000 was the lowest individual contribution limit that would be consistent with the First Amendment. \u003cspan class=\"fnref\"\u003e157\u003c/span\u003e Moreover, Buckley dealt only with the FECA, which governs campaigns for federal office. \u003cspan class=\"fnref\"\u003e158\u003c/span\u003e It is not apparent that a campaign for local or state elected office is as complex or potentially expensive (given the numbers of voters involved) as a campaign for the federal offices of president, vice-president, senator, or representative. Buckley did not intimate that a limit of $1,000 was the lowest limit permissible for state elections. Nor can the Act's provisions be readily compared with FECA's. Some provisions have no counterpart. FECA, for example, imposes a $25,000 cumulative annual limit on individual contributors, \u003cspan class=\"fnref\"\u003e159\u003c/span\u003e intuitively lessening a justification for a federal candidate limit lower than $1,000.\n\nOther courts have noted that it is important to look to the circumstances of the elections to determine what limitations are and are not constitutionally permissible. But absent evidence that diminished contribution limits have impaired effective advocacy or are qualitatively different in kind, we see no justification for a trial. The United States Supreme Court has made it clear that a court is not to substitute its judgment for the legislature's by wielding a scalpel the legislature chose to forego. That the legislature may not have \"fine-tuned\" the Act does not justify its invalidation. The evidence the State introduced is, we find, sufficiently compelling to justify the $500 limitation on individual contributions for electoral campaigns in Alaska. We therefore uphold the limitation.\n\nIn doing so, we necessarily reject AkCLU's arguments that the new limits do not address the real danger: \"large\" contributions. The Supreme Court rejected a similar argument in Buckley. \u003cspan class=\"fnref\"\u003e160\u003c/span\u003e We also reject AkCLU's argument that, because the new limits fail to recognize the high cost of Alaska elections and are, when adjusted for inflation, only eight percent of the limit approved in Buckley in 1976, the new limits are invalid as a matter of law. The Supreme Court has not held contribution limits to be invalid on a theory that they fail to keep pace with inflation.\n\n(2) Individual contributions to groups and political parties\n\nThe State argues that limits on individuals' contributions to groups and political parties are also reasonable and that such limits are necessary to protect the \"integrity\" of the limit on individuals' contributions to candidates by closing loopholes. We conclude that preventing individuals from channeling their contributions through a group or a party, and thus avoiding the limit on individuals' contributions to candidates, is a valid purpose. We also conclude that the $5,000 limit is not so patently \"different in kind\" as to justify invalidation. We uphold the limit on individual contributions to groups or political parties, keeping in mind the Court's words in Buckley: \"If it is satisfied that some limit on contributions is necessary, a court has no scalpel to probe, whether, say, a $2,000 ceiling might not serve as well as $1,000.\" \u003cspan class=\"fnref\"\u003e161\u003c/span\u003e\n\nb. Limits on contributions by groups; AS 15.13.070(c)\n\nUnder AS 15.13.070(c), a \"group\" that is not a political party may not contribute more than $1,000 per year to a candidate, another group, or a political party. \u003cspan class=\"fnref\"\u003e162\u003c/span\u003e\n\nThe State's evidence with respect to large contributions discussed above (see supra Part III.D.2) also applies to \"group\" contributions. AkCLU contends that groups' contributions merit greater protection because they implicate both associational and speech rights. It asserts that contributions not made by an individual to a candidate have no quid pro quo effect, and that backdoor funneling concerns are irrelevant because existing law already prohibited funneling excess contributions through a group. It also claims that the $1,000 limits are significantly lower than the $5,000 group limit approved in Buckley, and are so low that they prohibit contributions that no longer threaten corruption.\n\nIt appears to us, however, that this $1,000 limit cannot be said to be different in kind. Buckley actually upheld individual contribution limits of $1,000 per election for federal elections, subject to a cumulative annual maximum of $25,000. \u003cspan class=\"fnref\"\u003e163\u003c/span\u003e And even though funneling was already illegal in Alaska, there is no indication that existing law was either an adequate protection or effectively enforceable, and there was instead evidence it was not. \u003cspan class=\"fnref\"\u003e164\u003c/span\u003e\n\nBecause the question is ultimately whether these limits are \"large,\" prevent \"effective advocacy,\" or constitute a \"difference in kind,\" our comments relative to the individual contribution limits apply equally here. We consequently reverse the grant of summary judgment with respect to these limits and uphold this provision of the Act.\n\nc. Limits on contributions by political parties; AS 15.13.070(d)\n\nThe Act sets graduated limits for political parties' contributions to candidates; they range from $100,000 to candidates for governor or lieutenant governor to $5,000 to candidates for certain other offices. \u003cspan class=\"fnref\"\u003e165\u003c/span\u003e\n\nThe State argues that these limits are necessary to prevent groups and individuals from circumventing their contribution limits by funneling contributions through political parties; in support it cites APOC inquiries regarding use of political parties to pass funds to candidates. The State also introduced an affidavit from former Alaska Governor Steve Cowper, who affied that pass-throughs (donations to a party that are earmarked for a candidate) under the pre-reform system \"made a mockery of contribution limits and turned political parties into money launderers.\"\n\nRelying on Colorado Republican Federal Campaign Committee v. Federal Election Comm'n, \u003cspan class=\"fnref\"\u003e166\u003c/span\u003e AkCLU argues that all limits on political parties' campaign finance activities are unconstitutional. It concludes that a majority of the Court there stated its belief that contributions or coordinated expenditures made by a political party do not have a corrupting impact on the political process.\n\nBut, because Colorado Republican addresses limits on parties' independent expenditures, not contributions, it does not squarely apply here. As noted above, the Court has held that expenditure limits infringe much more directly on speech than do contribution limits. Further, the Court primarily analyzes contribution limits in context of associational rights. A party's associational rights are not unduly infringed by contribution limits that are not different in kind. We are not prepared to say, based on the record before us, that these limits are different in kind.\n\nWe note that federal law contains equivalent limits. Under FECA, a political party is categorized as a \"multicandidate political committee.\" \u003cspan class=\"fnref\"\u003e167\u003c/span\u003e 2 U.S.C.  441a imposes the following limits on contributions by multicandidate political committees: (a) $15,000 per year to a political party, \u003cspan class=\"fnref\"\u003e168\u003c/span\u003e (b) $5,000 per year to non-party multicandidate political committees, \u003cspan class=\"fnref\"\u003e169\u003c/span\u003e and (c) $5,000 per election to candidates for federal office. \u003cspan class=\"fnref\"\u003e170\u003c/span\u003e National parties and party senate campaign committees may give up to $17,500 to senate candidates during an election year. \u003cspan class=\"fnref\"\u003e171\u003c/span\u003e\n\nAnother provision treats parties differently for purposes of expenditures, but it does not affect the contribution limits to which parties are otherwise subject. \u003cspan class=\"fnref\"\u003e172\u003c/span\u003e\n\nAbsent any limits on contributions by parties, we believe there would be substantial potential for undue influence, i.e., quid pro quo corruption or the appearance of corruption. The natural tendency of successful candidates who receive unlimited contributions from a party would be to reduce independent consideration of issues and adhere to positions taken by the party itself. The relatively large ($5,000) limits on contributions by individuals to parties would also encourage channeling individual contributions to favored candidates absent any party limits. We therefore conclude that the State has a legitimate governmental interest in limiting a party's contributions. Further, to the extent the ban on \"non-group\" contributions may be invalid, limits on party contributions become even more justified. We therefore reverse the judgment below with respect to AS 15.13.070(d) and uphold the limit on contributions by political parties.\n\n3. Restrictions on when contributions may be made and received\n\na. Bans on nonelection year contributions; AS 15.13.074(c), (d)\n\nTwo statutes which restrict the timing of contributions effectively ban \"non-election year\" contributions. Alaska Statute 15.13.074(c)(1) limits pre-election contributions. For candidates for offices filled at general elections, the statute prohibits making contributions before January 1 of the election year. \u003cspan class=\"fnref\"\u003e173\u003c/span\u003e For candidates for offices filled at municipal or special elections, it prohibits making contributions earlier than nine months before the election. \u003cspan class=\"fnref\"\u003e174\u003c/span\u003e Alaska Statute 15.13.074(c)(4), as amended in 1998, bars post-election contributions, i.e., after December 31 of the election year or sixty days after the candidate's last contested election, whichever comes first. \u003cspan class=\"fnref\"\u003e175\u003c/span\u003e Alaska Statute 15.13.072(c) correspondingly restricts when contributions may be solicited or accepted. \u003cspan class=\"fnref\"\u003e176\u003c/span\u003e The Act also contains contingent timing restrictions that take effect only if a final court order declares AS 15.13.074(c) unconstitutional. \u003cspan class=\"fnref\"\u003e177\u003c/span\u003e\n\nAt the outset, we note that Buckley authorizes \"reasonable time, place, and manner regulations, which do not discriminate among speakers or ideas, in order to further an important governmental interest unrelated to the restriction of communication,\" provided that the regulations do not impose direct quantity restrictions on political communication and association. \u003cspan class=\"fnref\"\u003e178\u003c/span\u003e\n\nThe State offered evidence bearing on the need for contribution time limits. In Open Secrets, author Larry Makinson argues that off-year contributions allow donors effectively to double the existing contribution limits by giving twice in a single election cycle. \u003cspan class=\"fnref\"\u003e179\u003c/span\u003e\n\nIn 1989 the APOC staff examined the proportion of contributions made after elections. \u003cspan class=\"fnref\"\u003e180\u003c/span\u003e Less than two percent of all contributions in the 1988 cycle were post-election contributions. \u003cspan class=\"fnref\"\u003e181\u003c/span\u003e At that time a majority of the APOC commissioners stated strong support for barring post-election contributions, and hoped such a ban would curtail contributions \"intended to influence a successful candidate rather than the outcome of an election.\" \u003cspan class=\"fnref\"\u003e182\u003c/span\u003e\n\nFormer Alaska Governor Hickel affied that \"post-election contributions can too easily be viewed as an attempt to purchase influence and are one of the most troubling kinds of contribution.\"\n\nThe State submitted a news article quoting 1994 gubernatorial candidate Jim Campbell as saying that \"[t]here is an appearance of conflict of interest when a winning candidate raises money after the election is over.\"\n\nIn the superior court the State argued that the timing limits \"address the problem of the perpetual campaign.\" It argues on appeal that these restrictions help ensure that contributions will be used only to finance election campaigns. It asserts that contributions \"remote in time\" to an election are \"very susceptible to the appearance that they were made to purchase influence.\" It contends that APOC reports demonstrate the need for fund-raising time limits. These reports show that between 1989 and 1995, eighty percent of all nonelection-year contributions were made directly to incumbents. Only three percent of nonelection-year contributions were directed to challengers. Candidates for seats with no incumbent candidate received seventeen percent of nonelection-year contributions.\n\nThe State claims that the pre-election year ban -- \"before candidacies are declared and platform issues are identified\" --eliminates contributions that have \"the appearance of being made to purchase access or influence, particularly if the candidate . . . is an incumbent.\"\n\nThe evidence the State cites shows, at most, that incumbents who received pre-election year contributions may have had a fund-raising advantage over the challengers, but it does not distinguish on the basis of when the incumbents and challengers declared their candidacies, or rebut the possibility that incumbents, whom voters had previously favored, and whose political platform was previously successful, were more in tune with the electorate or better organized than their challengers.\n\nThat pre-election year contributors strongly favored incumbents may imply a desire by those contributors to purchase access or influence. But it does not give the appearance of corruption absent some evidence implying that incumbents have used pre-election year contributions to help raise funds substantially exceeding their probable campaign needs. Nor is it apparent how the temporal limits address any corruption that might arise from giving some contributors inordinate opportunity to influence the process. \u003cspan class=\"fnref\"\u003e183\u003c/span\u003e\n\nThe State emphasizes the negative public perception of post-election contributions:\n\n\"Obviously a postelection contribution cannot be intended to assist the candidate in his or her efforts to win because the election is over. While some contributors may simply wish to assist in retiring campaign debts, a more likely perception is that the purpose is to buy influence or, at the very least, access.\"\n\nTo bolster its argument, the State cites cases from other jurisdictions with what it admits are \"mixed results.\" In two cases, courts upheld the restrictions. \u003cspan class=\"fnref\"\u003e184\u003c/span\u003e In Gable v. Patton, the restriction barred acceptance of contributions during the four weeks preceding a primary. \u003cspan class=\"fnref\"\u003e185\u003c/span\u003e In Ferre v. Florida ex rel. Reno, the restriction prohibited post-election contributions. \u003cspan class=\"fnref\"\u003e186\u003c/span\u003e In the other two cases (both involving off-year bans), courts held the time restrictions unconstitutional. \u003cspan class=\"fnref\"\u003e187\u003c/span\u003e\n\nAkCLU argues that the State has failed to provide evidence of \"real harm.\" Likewise, AkCLU maintains that \"[t]he identified harm of a quid pro quo receipt of money in exchange for political favors simply does not apply to non-incumbents.\" It asserts that, if anything, the evidence suggests the aggregate effect of the temporal limits would be to increase, not diminish, the possibility of corruption.\n\nIt also contends that the limits are not narrowly tailored, and that even though the contingent temporal restrictions reduce the harm, they unconstitutionally interfere with the right of association.\n\nWhile we recognize that these limits would have a significant effect on a candidate's power to spend money during non-election years, we consider these provisions to be contribution limits, not expenditure limits. \u003cspan class=\"fnref\"\u003e188\u003c/span\u003e It is not apparent how the relatively short pre-election contribution window addresses corruption or the appearance of corruption. Neither the minimal evidence nor the State's arguments justify the compressed time limits of AS 15.13.074(c)(1), (2), and (3). The cases the State cites do not explain how the pre-election limits can be justified. \u003cspan class=\"fnref\"\u003e189\u003c/span\u003e We agree with the core rationale of the Massachusetts Supreme Judicial Court, which concluded in Opinion of the Justices to the House of Representatives that a cap on nonelection-year contributions was unconstitutional. \u003cspan class=\"fnref\"\u003e190\u003c/span\u003e That court held:\n\n\"[L]egislation that has the effect of prohibiting a contributor from expressing support and affiliation with a candidate for a lengthy period constitutes a significant interference with the right of association. A contributor might have compelling reasons for desiring to express that support at a particular time other than the year of the election.\"[ \u003cspan class=\"fnref\"\u003e191\u003c/span\u003e ]\n\nWe therefore affirm the superior court's invalidation of the pre-election contribution limits of AS 15.13.074(c)(1), (2), and (3).\n\nOur affirmance of this aspect of the judgment below causes the eighteen-month contingent pre-election time limits in the Act to take effect. \u003cspan class=\"fnref\"\u003e192\u003c/span\u003e Because neither side has substantively discussed the validity of these contingent limits, and because they are not patently unconstitutional, we decline to address their validity here. \u003cspan class=\"fnref\"\u003e193\u003c/span\u003e\n\nPost-election time limits, however, far more clearly address corruption and its appearance because the election has resolved the critical contingency of which candidate will hold office. We think this latter impact on associational rights is narrowly tailored to further compelling state interests. We therefore uphold the post-election contribution limits of AS 15.13.074(c)(4).\n\nb. Ban on contributions during the legislative session; AS 15.13.074(c)\n\nAlaska Statute 15.13.074(c)(2) prohibits making contributions to legislative candidates, including both challengers and incumbents, during a regular legislative session. \u003cspan class=\"fnref\"\u003e194\u003c/span\u003e\n\nAkCLU argues that this ban severely constrains effective campaign advocacy by legislative candidates. \"Given the length of the Alaska legislative session, fundraising [under the ban] is limited to a two-month period before a primary election and [to] two and one-half [additional] months before a general election.\" \u003cspan class=\"fnref\"\u003e195\u003c/span\u003e Moreover, AkCLU claims the associational rights of potential contributors are severely restricted during the legislative session.\n\nThe State argues that this ban \"addresses the perception that contributions are made to influence the conduct of elected officials during the session.\" It also contends that \"the prohibition frees sitting legislators from the fund-raising treadmill and allows them to focus on the public's business during the legislative session.\" The State claims that this interest is compelling enough to support the ban. The Josephson Report survey, in which about sixty percent of legislators stated they believed fundraising during the legislative session needed to be regulated, supports this contention to a limited extent.\n\nConsidered in isolation, the \"legislator-freeing\" rationale is not sufficiently compelling to justify this restriction. In Rosenstiel v. Rodriguez, the Eighth Circuit held that freeing legislators to deal with issues was only relevant as a by-product of corruption-fighting measures. \u003cspan class=\"fnref\"\u003e196\u003c/span\u003e In other cases cited by the State, the interest was found sufficient only to promote a speech-enhancing measure. \u003cspan class=\"fnref\"\u003e197\u003c/span\u003e\n\nPreventing corruption or its appearance is a compelling interest justifying narrowly-tailored restraints on First Amendment rights. But the very circumstance most relevant to the appearance of corruption -- receipt of contributions by incumbent candidates during the session -- does not imply that in-session contributions to challengers also give the appearance of corruption. The ban is therefore not narrowly tailored to the State's compelling interest, and is invalid as to non-incumbents. But invalidating the ban only as to challengers would fundamentally unbalance a restriction which the legislature clearly intended to apply to incumbents and challengers alike, and would defeat the legislature's clear intention as to this prohibition. We therefore decline to invalidate only part of this ban while upholding it with respect to incumbent candidates.\n\nAccordingly, we affirm the decision holding these provisions invalid.\n\nE. Restrictions on the Use of Campaign Funds\n\n1. Carry-forward restriction; AS 15.13.116\n\nAlaska Statute 15.13.116 limits the amount of unused contributions a candidate may carry forward to the next campaign. \u003cspan class=\"fnref\"\u003e198\u003c/span\u003e\n\nAkCLU argues that these \"spend down\" requirements function as expenditure limits and are invalid. (AkCLU does not challenge AS 15.13.112, which prohibits using contributions for a candidate's personal benefit, or converting contributions to a candidate's personal income.)\n\nThe threshold question is whether the carry-forward restriction burdens speech. Two cases the State cites held that similar restrictions directly limited expenditures, and therefore burdened speech. \u003cspan class=\"fnref\"\u003e199\u003c/span\u003e We agree with that analysis. We must therefore decide whether the State has compelling interests justifying this burden.\n\nThe State argues that the limits are justified because they prevent candidates who are unopposed, or opposed by weak candidates, from taking contributions in one campaign to avoid limits in the next one. This rationale is plausible. Contribution limits fight corruption, and therefore relate to a compelling state interest. Contribution limits for future campaigns of presently unopposed candidates would effectively double without this provision. \u003cspan class=\"fnref\"\u003e200\u003c/span\u003e Neither of the State's cited cases \u003cspan class=\"fnref\"\u003e201\u003c/span\u003e presented this issue, because the associated contribution limits in both of those cases had been invalidated.\n\nThere is evidence of substantial carryovers that appear large in comparison with the total projected expense of campaigns for contested seats. The average victorious state senate candidate in the 1990 general election had a surplus (for our purposes, meaning cash on hand less debts) of $11,450 at the end of the year. The average victorious house candidate that year had a surplus of $8,759. One successful house candidate had a surplus of $33,043; one successful senate candidate had a surplus of $77,034. By way of comparison, the average victorious house campaign for 1994 cost $43,764; the corresponding senate election cost $72,784.\n\nWe hold that the State's interest in preventing avoidance of valid contribution limits by use of carry-forwards is both compelling and served by this restriction. We also conclude that this provision is narrowly tailored to accomplish this interest. We therefore reverse that portion of the judgment below.\n\n2. Ban on inter-candidate contributions; AS 15.13.112(b)(7)\n\nThe Act prohibits a candidate from using campaign funds to contribute to another candidate or to a group. \u003cspan class=\"fnref\"\u003e202\u003c/span\u003e\n\nThe State argues that the ban is valid because it prevents:\n\n\"(1) use of donations contrary to the purpose of the original contributor; (2) corrupt use of campaign funds for power-brokering; and (3) evasion of contribution limits by funneling. The State relies on David Finkelstein's affidavit for support. Finkelstein affied that \"[t]hroughout my time in the Legislature it was common knowledge that certain legislators used campaign contributions to try to secure leadership positions, particularly the Speaker or President.\" He cited the 1992 speaker's contest as an example, claiming that Republicans threw fundraisers for Democrats to gain support for their speakership candidacies.\"\n\nA number of candidates apparently have the wherewithal to wield such power. At the end of the 1990 campaign cycle, according to APOC records, ten state senate candidates had surpluses ranging as high as $33,043. Fifty-two house candidates had surpluses, six of which exceeded $20,000.\n\nThe State also notes that the law does not impair the candidate's ability to donate personal funds to another candidate.\n\nAkCLU responds by citing Service Employees, which dealt with a similar ban contained in a California initiative. \u003cspan class=\"fnref\"\u003e203\u003c/span\u003e The Ninth Circuit there addressed each of the arguments raised by the State here, and rejected each for a different reason. The court refused to accept the \"misuse of donations\" rationale because it was not sufficiently narrowly tailored. The court, discussing the rationale in the context of intra-candidate transfers, asserted that \"this interest in ensuring that contributors are not misled could be served simply by requiring candidates to inform contributors that their contributions might be spent on other races.\" \u003cspan class=\"fnref\"\u003e204\u003c/span\u003e The court dismissed the concern about power brokering as follows:\n\n\"The Authors [of the initiative] argue that the inter-candidate transfer ban may be justified by the state's interest in preventing corruption or the appearance of corruption by \"political power brokers.\" Even if we assume this to be an important state interest, the ban is not \"closely drawn to avoid unnecessary abridgement of associational freedoms.\" The potential for corruption stems not from campaign contributions per se but from large campaign contributions. The inter-candidate transfer ban prohibits small contributions from one candidate to another as well as large contributions. We hold, therefore, that the inter-candidate transfer ban is unconstitutional . . . .\"[ \u003cspan class=\"fnref\"\u003e205\u003c/span\u003e ]\n\nBut because the court in Service Employees had already invalidated the contribution limits of the California initiative, there was no longer any danger that inter-candidate contributions could be used to avoid valid contribution limits. The court therefore rejected funneling as a valid basis for the ban. \u003cspan class=\"fnref\"\u003e206\u003c/span\u003e\n\nIn this case, however, we have upheld the individual contribution limits. Prevention of funneling therefore remains a reasonable rationale for some restriction on inter-candidate contributions. Without restrictions, a candidate experiencing a very easy election or a candidate very successful at fundraising could pass along contributions to other candidates at will; allowing inter-candidate transfers could conceivably permit contributors to evade limits not just once but multiple times. A contributor wishing to make four $500 contributions to candidate A (three more than the individual limit permits) would be able to contribute to candidates B, C, and D, with the expectation they would each pass their surplus contributions on to candidate A.\n\nBecause the State has a compelling interest in enforcing contribution limits, and because candidates still retain the right to make contributions from personal funds, we conclude that this provision is constitutional.\n\nF. Severability of Unconstitutional Provisions\n\nBecause we have concluded that some of these provisions are unconstitutional we must consider the question of severability. Severability is a matter of state law. \u003cspan class=\"fnref\"\u003e207\u003c/span\u003e The seminal case in Alaska is Lynden Transport, Inc. v. State, which holds that\n\n\"[t]he test for determining the severability of a statute is twofold. A provision will not be deemed severable `unless it appears both that, standing alone, legal effect can be given to it and that the legislature intended the provision to stand, in case others included in the act and held bad should fall.'\"[ \u003cspan class=\"fnref\"\u003e208\u003c/span\u003e ]\n\nThe Act contains a severability clause. \u003cspan class=\"fnref\"\u003e209\u003c/span\u003e Its inclusion indicates that the legislature intended the remainder of the Act to stand if part of it were invalidated. It is also significant that the legislature enacted contingent provisions that were to become effective if parts of the Act were held to be invalid.\n\nAlthough we hold today that some parts of the Act are unconstitutional, we do not believe that their invalidation so undermines the structure of the Act as a whole that the entire Act must fall. Standing alone, legal effect can be given to the remaining provisions.\n\nOther courts considering severability in the campaign finance context have reached the same Conclusion. In Buckley, the Supreme Court let stand the public financing provisions of the Federal Election Campaign Act while invalidating expenditure limits. \u003cspan class=\"fnref\"\u003e210\u003c/span\u003e In Russell v. Burris, the Eighth Circuit severed the constitutional provisions of an Arkansas campaign reform act, holding that the purpose of the valid provisions would not be thwarted by the invalidation of the others. \u003cspan class=\"fnref\"\u003e211\u003c/span\u003e The district court considering Colorado Republican on remand refused to hold that the unconstitutional independent expenditure limitation could not be severed from the remainder of the party expenditure provision. \u003cspan class=\"fnref\"\u003e212\u003c/span\u003e\n\nBecause we believe the constitutional parts of this Act satisfy the conditions discussed in Lynden Transport, we hold those provisions to be severable and reject AkCLU's argument to the contrary.\n\nG. Other Arguments\n\nAkCLU's complaint alleges that the ban on anonymous contributions, AS 15.13.074(b), \u003cspan class=\"fnref\"\u003e213\u003c/span\u003e is unconstitutional.\n\nThe Supreme Court stated in dictum that a ban on anonymous contributions would be permissible. \u003cspan class=\"fnref\"\u003e214\u003c/span\u003e But because the briefs have not discussed this provision, we decline to reach the issue.\n\nIV. CONCLUSION\n\nTo recapitulate:\n\n\"(1) Because the constitutional parts of the Act can be given legal effect standing alone, in accordance with the legislature's intention, we REVERSE the judgment on the issue of severability, and address each part of the Act on its own merits.\"\n\n\"(2) We AFFIRM the judgment to the extent it held invalid the ban on non-election year contributions in the 1996 Act (AS 15.13.074(c)(1), (2), and (3)); and the ban on contributions to candidates during the legislative session (AS 15.13.074(c)(2)).\"\n\n\"(3) We REVERSE the judgment with respect to the following provisions, which we hold to be valid as a matter of law:\"\n\n\"(a) the ban on independent expenditures by non-group entities, to the extent it applies to corporations, labor unions, and other entities meeting the three-part test outlined in Part III (AS 15.13.135);\"\n\n\"(b) the ban on contributions by corporations, labor unions, and other entities meeting the three-part test outlined in Part III (AS 15.13.074(f));\"\n\n\"(c) the limits on contributions by individuals (AS 15.13.070(b)), groups (AS 15.13.070(c)), and political parties (AS 15.13.070(d));\"\n\n\"(d) the restrictions on contributions by nonresident individuals and groups (AS 15.13.072(a)(2) and (3), (e), and (f));\"\n\n\"(e) the ban on lobbyists' contributions to out-of-district candidates (AS 15.13.074(g));\"\n\n\"(f) the restriction on carry-forwards (AS 15.13.116); and\"\n\n\"(g) the ban on inter-candidate contributions (AS 15.13.112(b)(7)).\"\n\n\"(6) We leave it to future legal challenges to determine which specific classes of \"non-group\" entities besides corporations and labor unions may be permissibly subject to the expenditure and contribution bans set out in AS 15.13.135 and 15.13.074(f).\"\n\n\u003cspan class=\"fn\"\u003e1. Although the bill enacted into law is generally referred to as SB 191, the version of the bill the legislature actually enacted was HCS CSSB 191(FIN) am H.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See ch. 43  1, SLA 1913.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See ch. 76  1, SLA 1974 (current version at AS 15.13.070(a)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See ch. 76  1, SLA 1974 (current version at AS 15.13.070(b)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See ch. 76  1, SLA 1974 (current version at AS 15.13.070(c)). The 1974 enactment did not distinguish between coordinated and independent \"expenditures.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See former AS 15.13.070(f), repealed by ch. 85  45, SLA 1986.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See ch. 189  20, SLA 1975 (current version at AS 15.13.070(a)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Ch. 48  1, SLA 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See ch. 48  2, 5-7, 11-12, 19, 25, SLA 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See ch. 48  35, SLA 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Buckley v. Valeo, 424 U.S. 1, 26 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Nielson v. Benton, 903 P.2d 1049, 1052 (Alaska 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Alaska Travel Specialists, Inc. v. First Nat'l Bank of Anchorage, 919 P.2d 759, 762 (Alaska 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. French v. Jadon, Inc., 911 P.2d 20, 23 (Alaska 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See State v. Appleton \u0026 Cox of Cal., Inc., 703 P.2d 413, 414 (Alaska 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See Ross v. City of Sand Point, 952 P.2d 274, 276 (Alaska 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See Revelle v. Marston, 898 P.2d 917, 925 n.13 (Alaska 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See Buckley, 424 U.S. at 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See id. at 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Id. at 44-45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Id. at 25 (quoting Cousins v. Wigoda, 419 U.S. 477, 488 (1975) (internal quotation omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Austin v. Michigan Chamber of Commerce, 494 U.S. 652, 657 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See Buckley, 424 U.S. at 12-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See, e.g., Colorado Republican Fed. Campaign Comm. v. Fed. Election Comm'n, 518 U.S. 604, 618-19 (1996) (striking down limit on independent expenditures by political parties); Federal Election Comm'n v. Massachusetts Citizens for Life (MCFL), 479 U.S. 238, 263-64 (1986) (striking down expenditure limit); Federal Election Comm'n v. National Conservative Political Action Comm., 470 U.S. 480, 500-501 (1985) (striking down limit on political committee expenditures); California Med. Ass'n v. Federal Election Comm'n, 453 U.S. 182, 198-201 (1981) (allowing limits on contributions to political committees).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See Buckley, 424 U.S. at 19-20, 39, 58-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See id. at 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See id. at 45-47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Id. at 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Id. at 47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Id. at 47-48.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Id. at 48-51. The Court stated: The concept that government may restrict the speech of some elements of our society in order to enhance the relative voice of others is wholly foreign to the First Amendment, which was designed \"to secure the widest possible dissemination of information from diverse and antagonistic sources,\" and \"to assure unfettered interchange of ideas for the bringing about of political and social changes desired by the people.\" Id. at 48-49 (quoting New York Times Co. v. Sullivan, 376 U.S. 254, 266, 269 (1964) (citations omitted)). The Court also rejected expenditure limits on campaigns for federal office, noting that the Act's contribution limits and disclosure provisions would serve to alleviate the \"major evil\" associated with rapidly increasing expenditures -- \"the danger of candidate dependence on large contributions.\" Id. at 55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See id. at 24-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Id. at 20-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See id. at 25-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Id. at 21-22 (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Id. at 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Id. at 26-27 (quoting CSC v. Letter Carriers, 413 U.S. 548, 565 (1973)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See id. at 28-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Id. at 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Id. at 28-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See id. at 35-38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Buckley, 424 U.S. at 21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Id. at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Id. at 28-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See National Conservative Political Action Comm., 470 U.S. at 497-98.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See Colorado Republican, 518 U.S. at 618-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See Citizens Against Rent Control v. City of Berkeley, 454 U.S. 290, 298-300 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See California Med. Ass'n, 453 U.S. at 197-99.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See, e.g., Colorado Republican, 518 U.S. at 618 (striking down limit on independent political party expenditures).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. See MCFL, 479 U.S. at 246-47; see also Taft-Hartley Act, ch. 120,  304, 61 Stat. 136, 159 (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. See First Nat'l Bank v. Bellotti, 435 U.S. 765, 784 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Id. at 783 (quoting Virginia State Bd. of Pharmacy v. Virginia Citizens Consumer Council, Inc., 425 U.S. 748, 764 (1976)). The Court also found no danger of corruption in a ballot initiative campaign, where no corruptible candidate existed. See id. at 790.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See MCFL, 479 U.S. at 263-64.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. See Austin v. Michigan Chamber of Commerce, 494 U.S. 652, 660 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. See id. at 661-65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. See Citizens Against Rent Control, 454 U.S. at 298-300; Bellotti, 435 U.S. at 790.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Turner Broadcasting System, Inc. v. FCC, 512 U.S. 622, 664 (1994) (quoting Quincy Cable TV v. FCC, 768 F.2d 1434, 1455 (D.C. Cir. 1985)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Id. at 666 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Id. (quoting Century Communications Corp. v. FCC, 835 F.2d 292, 304 (D.C. Cir. 1987)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. AS 15.13.400(7) defines an \"independent expenditure\" as: an expenditure that is made without the direct or indirect consultation or cooperation with, or at the suggestion or the request of, or with the prior consent of, a candidate, a candidate's campaign treasurer or deputy campaign treasurer, or another person acting as a principal or agent of the candidate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. AS 15.13.400(5)(B) defines \"group\" to mean \"any combination of two or more individuals acting jointly who organize for the principal purpose of influencing the outcome of one or more elections and who take action the major purpose of which is to influence the outcome of an election.\" An \"individual\" is a \"natural person.\" AS 15.13.400(8).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. AS 15.13.135(a) provides, in pertinent part: \"Only an individual or group may make an independent expenditure supporting or opposing a candidate for election to public office . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. The Act, by contrast, bans such contributions. See AS 15.13.074(f).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. See Austin, 494 U.S. at 658-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. See Daniel Ortiz, \"The First Amendment at Work: Constitutional Restrictions on Campaign Finance Regulation,\" Campaign Finance Reform: A Sourcebook (1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. See Greg Granquist, APOC Advisory Opinion AO 97-09- CD (approved June 19, 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. See Buckley, 424 U.S. at 14-23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See Austin, 494 U.S. at 660.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Id. at 660.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Id. at 659 (quoting National Conservative Political Action Comm., 470 U.S. 480, 500-01 (1985)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Id. (quoting MCFL, 479 U.S. at 257).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Id. (quoting MCFL, 479 U.S. at 258).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. See id. (citing Bellotti, 435 U.S. at 788 n.26).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. Id. at 659-60 (citations omitted) (quoting National Conservative Political Action Comm., 470 U.S. at 497).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. See Larry Makinson, Open Secrets 7 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. See id. at 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Janet Campbell, The Best Politicians Money Can Buy 15 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. This perception of the dangers of undue influence is reinforced by a recent study of federal government written by Charles Lewis and the Center for Public Integrity. In The Buying of the Congress, Lewis discusses examples of areas in which members of Congress accepted large contributions and resisted compelling legislation that would have been costly to their contributors. See Charles Lewis, The Buying of the Congress 83-104 (food safety), 105-25 (tobacco), 142-65 (pharmaceuticals), 166-83 (occupational safety), 184-95 (aviation safety), 199-218 (health care), 253-66 (telecommunications), 285-302 (antitrust regulation) (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. See 2 U.S.C.  441b(a) (1994); MCFL, 479 U.S. at 247-48.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. See Federal Election Comm'n v. National Right to Work Comm., 459 U.S. 197, 210 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Id. at 210-11 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. See MCFL, 479 U.S. at 258 n.11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. See, e.g., AS 10.50.010 (limited liability companies); AS 32.05.010 (partnerships); AS 32.11.010 (limited partnerships).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. See Austin, 494 U.S. at 661; National Right to Work Comm., 459 U.S. at 199, 210-11 (a nonprofit corporation without capital stock).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. See Austin, 494 U.S. at 661; National Right to Work Comm., 459 U.S. at 210 (\"[W]e accept Congress's judgment that it is the potential for such influence that demands regulation.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. See MCFL, 479 U.S. at 263.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. Id. at 259.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. It appears that APOC reads AS 15.13.135 in a manner consistent with MCFL, holding that the Republican Party of Alaska is not subject to the corporate prohibitions of AS 15.13.074(f) (prohibiting political contributions by corporations). The APOC has held that the Republican Party of Alaska, notwithstanding its corporate status, is a political party. See APOC Advisory Opinion AO 97-08b-CD (approved November 5, 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. See Bonjour v. Bonjour, 592 P.2d 1233, 1237 (Alaska 1979); Gottschalk v. State, 575 P.2d 289, 295 (Alaska 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. See Austin, 494 U.S. at 659.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. See Federal Election Comm'n v. Survival Educ. Fund, 65 F.3d 285, 291 (2d Cir. 1995) (citing Austin, 494 U.S. at 662-64).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. Federal law bars contributions or expenditures by corporations \"in connection with\" federal elections. See 2 U.S.C.  441b(a). This impliedly leaves room for corporations to give parties contributions not \"in connection with\" particular candidates or elections. Cf. 2 U.S.C.  441b(b)(2) (permitting nonpartisan registration and get-out-the-vote campaigns by corporations aimed at associated individuals).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. 2 AAC 50.313(l)(4) provides that the following does not constitute a \"contribution\" under 2 AAC 50.310- .405: a payment made by a business, corporation, trade association, labor organization, or other organization not organized primarily to influence elections to communicate directly with its members or employees, or their families, on any subject, if the communication is of the same format and nature used by the organization when it has communicated in the past on nonpolitical subjects, does not request members or their families to do anything other than exercise the right to vote, and does not solicit individual contributions to a clearly identified candidate or group chosen by the organization . . . . See also J. Kohout, APOC Advisory Opinion AO 97-20-CD (approved June 24, 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. National Right to Work Committee, 459 U.S. at 208. See also 2 U.S.C.  441b; MCFL, 479 U.S. at 264 (discussing the importance of ensuring that persons connected with the organization \"will have no economic disincentive for dissociating with it if they disagree with its political activity.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. See Austin, 494 U.S. at 663 n.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. The origin and purpose of the reference to \"surety\" is uncertain. A \"surety\" is \"[a] person who is primarily liable for payment of debt or performance of obligation of another.\" Black's Law Dictionary 1441 (6th ed. 1990). It is not obvious how suretyship relates to campaign finance. The State suggests that \"surety\" was inadvertently substituted for \"society,\" a term which appears in AS 01.10.060(8). Four statutes contain equivalent lists which include \"society\" but not \"surety.\" See AS 01.10.060(8) (general list of statutory definitions); AS 16.43.990(5) (commercial fisheries); AS 30.13.900(5) (regional resource development authorities); AS 30.17.900(7) (Adak Reuse Authority). Sutherland Statutory Construction states that \"if the literal import of the text of an act is inconsistent with the legislative meaning or intent, or such interpretation leads to absurd results,\" courts will ordinarily modify the statute to comport with legislative intent. Norman J. Singer, Sutherland Statutory Construction  46.07 (5th ed. 1992). We agreed with that proposition when we held that \"to construe statutes so as to avoid results glaringly absurd has long been a judicial function.\" Sherman v. Holiday Constr. Co., 435 P.2d 16, 19 (1967) (quoting Armstrong Paint \u0026 Varnish Works v. Nu-Enamel Corp., 305 U.S. 315, 332-33 (1938)). But for purposes of the present appeal it is not necessary to decide whether AS 15.13.074(f) applies to a \"surety\" or a \"society.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. AS 15.13.074(f) provides: \"A corporation, company, partnership, firm, association, organization, business trust or surety, labor union, or publicly funded entity that does not satisfy the definition of group in AS 15.13.400 may not make a contribution to a candidate or group.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. Austin, 494 U.S. at 659 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. See MCFL, 479 U.S. at 259.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. See supra Part III.C. See also Survival Educ. Fund, 65 F.3d at 291.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. See Trustees for Alaska v. State, 736 P.2d 324, 329 (Alaska 1987) (\"standing may be denied if there is a plaintiff more directly affected by the challenged conduct in question who has [brought] or is likely to bring suit\"); see also San Francisco Drydock, Inc. v. Dalton, 131 F.3d 776, 778 (9th Cir. 1997) (noting that it is appellate court's \"obligation to be sure that standing exists and to raise, sua sponte if need be, any deficiency\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. AS 15.13.074(f) also bans contributions by a \"publicly funded entity.\" This provision potentially implicates the \"unconstitutional conditions\" doctrine. But no party discusses the issue here or the seminal case, Rust v. Sullivan, 500 U.S. 173 (1991), in which the Supreme Court upheld a speech regulation as a valid condition on federal funding, and distinguished between a permissible withheld subsidy and an impermissible forced silence. See id. at 194, 196. We therefore do not consider whether this section simply bans the use of government funds, or completely bans campaign-related political speech.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. Federal Election Comm'n v. Christian Action Network, 110 F.3d 1049, 1062 (4th Cir. 1997) (quoting Buckley, 424 U.S. at 80).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. Austin, 494 U.S. at 659.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. AS 15.13.072(a)(2) prohibits a candidate from soliciting or accepting a contribution from \"an individual who is not a resident of the state at the time the contribution is made, except as provided in (e) of this section.\" AS 15.13.072(e) permits a candidate to solicit and accept contributions from nonresident individuals if the amounts contributed by the nonresident individuals do not exceed: \"(1) $20,000, if the candidate . . . is seeking the office of governor or lieutenant governor; (2) $5,000, if the candidate . . . is seeking the office of state senator; (3) $3,000, if the candidate . . . is seeking the office of state representative or municipal or other office.\" AS 15.13.072(f) applies a ten-percent limitation on contributions by nonresident individuals to groups or political parties: A group or political party may solicit or accept contributions from an individual who is not a resident of the state at the time the contribution is made, but the amounts accepted from individuals who are not residents may not exceed 10 percent of total contributions made to the group or political party during the calendar or group year in which the contributions are received.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. AS 15.13.072(a)(3) prohibits a candidate from soliciting or accepting a contribution from \"a group organized under the laws of another state, resident in another state, or whose participants are not residents of this state at the time the contribution is made.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. See Parts II, III.C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. 914 P.2d 1250 (Alaska 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. 4 F.3d 26 (1st Cir. 1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. See O'Callaghan v. State, 914 P.2d at 1257 (discussing Wisconsin ex rel. LaFollette v. Democratic Party of United States, 287 N.W.2d 519 (Wis. 1980), rev'd sub nom., Democratic Party of United States v. Wisconsin, 450 U.S. 107 (1981)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. Vote Choice, 4 F.3d at 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. See AS 15.13.070.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. 151 F.3d 1215 (9th Cir. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. Id. at 1220-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. See id. at 1221.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. Id. at 1222 (Brunetti, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. Id. at 1223 (Brunetti, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. In Robison v. Francis, 713 P.2d 259 (Alaska 1986), we noted that each state has the obligation \"to preserve the basic conception of a political community,\" that this includes the \"power to prescribe the qualifications of its officers and the manner in which they shall be chosen,\" and that this power and responsibility \"applies not only to the qualifications of voters, but also to [the qualifications of various elected and unelected officers].\" Id. at 270 n.14 (citing and quoting from Sugarman v. Dougall, 413 U.S. 634, 647 (1973)). The state's power to preserve the political community by excluding nonresidents from voting is self-evident. Although we have not previously affirmed the authority of the state to limit the influence of nonresidents over state elections through regulation of their campaign contributions, such an extension would not be illogical.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. See VanNatta, 151 F.3d at 1217.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. Id. at 1225 (Brunetti, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. See Austin, 494 U.S. at 660-61. AkCLU also cites Whitmore v. Federal Election Comm'n, 68 F.3d 1212 (9th Cir. 1996), which it describes as rejecting a California statute prohibiting out-of-state contributions. As Judge Brunetti in VanNatta concluded, \"the Whitmore court did not intend to resolve the First Amendment rights of the contributors.\" VanNatta, 151 F.3d at 1225 (Brunetti, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. See AS 15.13.072(a)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. See Austin, 494 U.S. at 661.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. AS 15.13.074(g) reads: An individual required to register as a lobbyist under AS 24.45 may not make a contribution to a candidate for the legislature at any time the individual is subject to the registration requirement under AS 24.45 and for one year after the date of the individual's initial registration or its renewal. However, the individual may make a contribution under this section to a candidate for the legislature in a district in which the individual is eligible to vote or will be eligible to vote on the date of the election. An individual who is subject to the restrictions of this subsection shall report to the commission, on a form provided by the commission, each contribution made while required to register as a lobbyist under AS 24.45. This subsection does not apply to a representational lobbyist as defined in regulations of the commission. AS 24.45.041 requires lobbyists to register before engaging in lobbying. AS 24.45.171(8) defines \"lobbyist\" to mean: (A) a person who is employed and receives payments, or who contracts for economic consideration, including reimbursement for reasonable travel and living expenses, to communicate directly or through the person's agents with any public official for the purpose of influencing legislative or administrative action if a substantial or regular portion of the activities for which the person receives consideration is for the purpose of influencing legislative or administrative action; or (B) a person who represents oneself as engaging in the influencing of legislative or administrative action as a business, occupation, or profession. AS 24.45.161(a) exempts the following from registration: (1) an individual (A) who lobbies without payment of compensation or other consideration and makes no disbursement or expenditure for or on behalf of a public official to influence legislative or administrative action other than to pay the individual's reasonable personal travel and living expenses; and (B) who limits lobbying activities to appearances before public sessions of the legislature, or its committees or subcommittees, or to public hearings or other public proceedings of state agencies; (2) an elected or appointed state or municipal public officer or an employee of the state or a municipality acting in an official capacity or within the scope of employment; (3) any newspaper or other periodical of general circulation, book publisher, radio or television station (including an individual who owns, publishes, or is employed by that newspaper or periodical, radio or television station) that publishes news items, editorials, or other comments, or paid advertisements, that directly or indirectly urge legislative or administrative action if the newspaper, periodical, book publisher, radio or television station, or individual engages in no further or other activities in connection with urging or advocating legislative or administrative action other than to appear before public sessions of the legislature, or its committees or subcommittees, or public hearings or other public proceedings of state agencies; (4) a person who appears before the legislature or either house, or standing, special, or interim committee, in response to an invitation issued under (c) of this section.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. Alaska Const. art. II,  1, 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. 665 A.2d 44 (Vt. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. See id. at 46 n.2, 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. Id. at 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. See Blount v. Securities \u0026 Exchange Comm'n, 61 F.3d 938, 941-48 (D.C. Cir. 1995) (upholding regulation restricting ability of municipal securities professionals to contribute to or solicit contributions for political campaigns of elected officials from whom they may obtain business); Schiller Park Colonial Inn, Inc. v. Berz, 349 N.E.2d 61, 66-69 (Ill. 1976) (upholding ban on contributions from liquor licensees); Soto v. New Jersey, 565 A.2d 1088, 1105-06 (N.J. Super. App. Div. 1989) (upholding ban on campaign contributions by key casino employees). We decline to follow Fair Political Practices Comm'n v. Superior Ct. of L.A. County, 599 P.2d 46, 51-53 (Cal. 1979), which struck down bans on lobbyists' contributions. The law in Fair Political Practices Commission banned all contributions by lobbyists, and was therefore not narrowly tailored. See id. Here, by contrast, lobbyists may still participate in the campaign process by contributing to candidates from their own districts. See AS 15.13.074(g).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. See California Pro-life Council v. Scully, 989 F. Supp. 1282, 1296 (E.D. Cal. 1998) (quoting Ward v. Rock Against Racism, 491 U.S. 781, 799 (1989)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. Buckley, 424 U.S. at 30 (emphasis added) (quoting Buckley v. Valeo, 519 F.2d 821, 842 (D.C. Cir. 1975)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. California Pro-life Council, 989 F. Supp. at 1298.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. See Larry Makinson, Open Secrets 20 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. Alaska Public Interest Research Group, The Best Politicians Money Can Buy 9 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141. Buckley, 424 U.S. at 21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142. Id. at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143. Following repeal and re-enactment of AS 15.13.070 by ch. 48  10, SLA 1996, AS 15.13.070(b) provides: \"An individual may contribute not more than (1) $500 per year to a candidate, to an individual who conducts a write-in campaign as a candidate, or to a group that is not a political party; (2) $5,000 per year to a political party.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144. See former AS 15.13.070 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145. See California Pro-life Council, 989 F. Supp. at 1298.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146. Buckley, 424 U.S. at 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147. Cf. William J. Connolly, How Low Can You Go?: State Campaign Contribution Limits and the First Amendment, 76 B.U. L. Rev. 483, 484 (1996) (\"As a general proposition, contribution limits are not per se unconstitutional.\"); Arkansas Right to Life State Political Action Comm. v. Butler, 29 F. Supp. 2d 540 (W.D. Ark. 1998) (invalidating a $500 state limit on contributions to committees that could make only \"independent expenditures\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e148. See California Med. Ass'n v. Federal Election Comm'n, 453 U.S. 182, 198-201 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e149. See Buckley, 424 U.S. at 7, 35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e150. See Kentucky Right to Life, Inc. v. Terry, 108 F.3d 637, 648 (6th Cir. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e151. See Day v. Holahan, 34 F.3d 1356, 1366 (8th Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e152. See VanNatta, 931 P.2d at 784-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e153. Carver v. Nixon, 72 F.3d 633, 644 (8th Cir. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e154. See National Black Police Ass'n v. District of Columbia Bd. of Elections \u0026 Ethics, 924 F. Supp. 270, 273, 282 (D.D.C. 1996), vacated on other grounds, 108 F.3d 346 (D.C. Cir. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e155. Montana Right to Life Ass'n v. Eddleman, 999 F. Supp. 1380, 1386 (D. Mont. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e156. California Pro-life Council, 989 F. Supp. at 1298.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e157. See Day, 34 F.3d at 1366.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e158. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e159. See 2 U.S.C.  441a(a)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e160. See 424 U.S. at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e161. 424 U.S. at 30 (quoting Buckley v. Valeo, 519 F.2d 821, 842 (D.C. Cir. 1975)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e162. AS 15.13.070(c) provides: \"A group that is not a political party may contribute not more than $1,000 per year (1) to a candidate, or to an individual who conducts a write-in campaign as a candidate; or (2) to another group or to a political party.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e163. See 424 U.S. at 7, 28-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e164. David Finkelstein affied that during his tenure with the House Democratic Campaign Committee, [n]early all the money came from large contributors who had already given the maximum amount in many races and wanted to see additional money (beyond the limits of the law) go to these candidates. In a number of cases business interests went even further and attempted to direct their contributions as pass-throughs to specific candidates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e165. AS 15.13.070(d) provides: A political party may contribute to a candidate, or to an individual who conducts a write-in campaign, for the following offices an amount not to exceed (1) $100,000 per year, if the election is for governor or lieutenant governor; (2) $15,000 per year, if the election is for the state senate; (3) $10,000 per year, if the election is for the state house of representatives; and (4) $5,000 per year, if the election is for (A) delegate to a constitutional convention; (B) Judge seeking retention; or (C) municipal office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e166. 518 U.S. 604 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e167. See 2 U.S.C.  431.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e168. See 2 U.S.C.  441a(a)(2)(B). But see 2 U.S.C.  441a(a)(4) (\"The limitations on contributions contained in [paragraph 2] do not apply to transfers between and among political committees which are national, State, district, or local committees . . . of the same political party.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e169. See 2 U.S.C.  441a(a)(2)(C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e170. See 2 U.S.C.  441a(a)(2)(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e171. See 2 U.S.C.  441a(h).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e172. See 2 U.S.C.  441a(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e173. AS 15.13.074(c), though amended in 1998, reads largely as it did in the 1996 Act. Compare ch. 48  11, SLA 1996 with ch. 74  5, SLA 1998. The 1996 Act provided: A person or group may not make a contribution (1) to a candidate for governor or lieutenant governor or an individual who files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100 for governor or lieutenant governor, before the later of the following dates: (A) the date the individual (i) becomes a candidate; or (ii) files with the commission the document necessary to permit the individual to incur certain election-related expenses as authorized by AS 15.13.100; or (B) January 1 of the year of the election . . . . . . . . (2) to a candidate for the state legislature or an individual who files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100 for the state legislature while the legislature is convened in a regular or special legislative session, unless the contribution is made in a place other than the capital city during the 90 days immediately preceding an election in which the candidate or individual is a candidate, or before the later of the following dates: (A) the date the individual (i) becomes a candidate; or (ii) files with the commission the document necessary to permit the individual to incur certain election-related expenses as authorized by AS 15.13.100; or (B) January 1 of the year of the election; (3) to a candidate or an individual who files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100 for an office that is to be filled at a municipal election before the later of the following dates: (A) the date the individual (i) becomes a candidate; or (ii) files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100; (B) the date that is nine months before the date of the municipal election; or (4) to any candidate after the earlier of December 31 of the year of the election or the 60th day (A) after the date of a primary election if the candidate (i) has been nominated at the primary election or is running as a write-in candidate; and (ii) is not opposed at the general election; (B) after the date of the primary election if the candidate was not nominated at the primary election; or (C) after the date of the general election, or after the date of a municipal or municipal runoff election, if the candidate was opposed at the general, municipal, or municipal runoff election; (5) in the capital city to a candidate for governor or lieutenant governor or the state legislature when the legislature is convened in a regular or special legislative session. AS 15.13.074(c) (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e174. See AS 15.13.074(c)(3)(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e175. See AS 15.13.074(c)(4), as amended by ch. 74  5, SLA 1998. Before its amendment in 1998, AS 15.13.074(c)(4) imposed a post-election cutoff of forty-five days. See ch. 48  11, SLA 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e176. AS 15.13.072(c) provides: (c) An individual, or one acting directly or indirectly on behalf of that individual, may not solicit or accept a contribution (1) before the date for which contributions may be made as determined under AS 15.13.074(c); or (2) later than the day after which contributions may not be made as determined under AS 15.13.074(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e177. See ch. 48  33(b), SLA 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e178. 424 U.S. at 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e179. See Larry Makinson, Open Secrets 6 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e180. See Alaska Public Offices Commission, Impact of Reform Proposals on Campaign Funding Patterns in Alaska (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e181. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e182. APOC Ann. Rep. to the Legislature 10 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e183. Cf. Austin, 494 U.S. at 658-61 (recognizing danger of \"corrosive and distorting effects of immense aggregations of wealth\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e184. See Gable v. Patton, 142 F.3d 940 (6th Cir. 1998); Ferre v. Florida ex rel. Reno, 478 So. 2d 1077 (Fla. Dist. App. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e185. See 142 F.3d at 944.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e186. See 478 So. 2d at 1078-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e187. See Zeller v. Florida Bar, 909 F. Supp. 1518 (N.D. Fla. 1995); Opinion of the Justices to the House of Representatives, 637 N.E.2d 213 (Mass. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e188. Until contributions are received, they are unavailable to expend. But see Opinion of the Justices, 637 N.E.2d at 217.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e189. See Gable, 143 F.3d at 949-53 (upholding restriction that prohibited acceptance of contributions from outside sources during the twenty-eight days preceding an election, and that was part of a scheme for publically financing election campaigns); Service Employees Int'l Union v. Fair Political Practices Comm'n, 955 F.2d 1312, 1318-21 (9th Cir. 1992) (striking down fiscal year limit on campaign fund- raising because it discriminated against challengers). The State also cites Ferre. But that decision upheld restrictions on post-election contributions, and it does not address the sort of pre-election restrictions challenged here. Zeller, 909 F. Supp. at 1525-26 (holding unconstitutional prohibition on contributions made more than one year before judicial elections).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e190. See Opinion of the Justices, 637 N.E.2d at 218.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e191. Id. at 218.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e192. See ch. 48  12, SLA 1996: AS 15.13.074(c) is repealed and reenacted to read: A person or group may not make a contribution (1) to a candidate or an individual who files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100 when the office is to be filled at a general election before the date that is 18 months before the general election; (2) to a candidate or an individual who files with the commission the document necessary to permit that individual to incur certain election-related expenses as authorized by AS 15.13.100 for an office that is to be filled at a special election or municipal election before the date that is 18 months before the date of the regular municipal election or that is before the date of the proclamation of the special election at which the candidate or individual seeks election to public office; or (3) to any candidate later than the 45th day (A) after the date of a primary election if the candidate (i) has been nominated at the primary election or is running as a write-in candidate; and (ii) is not opposed at the general election; (B) after the date of the primary election if the candidate was not nominated at the primary election; or (C) after the date of the general election, or after the date of a municipal or municipal runoff election, if the candidate was opposed at the general, municipal, or municipal runoff election.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e193. We observe that the invalidation of the pre- election year contribution bans affords candidates a greater time period in which to raise campaign funds. Such added time necessarily lessens the danger that candidates may be prevented from \"amassing the resources necessary for effective advocacy.\" Buckley, 424 U.S. at 21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e194. See AS 15.13.074(c)(2) set out supra note 173. The legislature amended this provision and AS 15.13.072(d) (the corresponding ban on soliciting or accepting contributions during the session) in 1998. Now if the legislature is in session during the ninety days immediately preceding the election in which the legislative candidates are competing, candidates may solicit or accept contributions during that period, so long as they do so outside the capital city. See ch. 14  1, 2, SLA 1998; ch. 74  3, 5, 19, SLA 1998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e195. As the Florida Supreme Court noted, \"[d]uring this period, incumbents have virtually unlimited access to the press and free publicity merely by virtue of the public forum they are privileged to occupy,\" thus creating obvious potential imbalances. Florida v. Dodd, 561 So. 2d 263, 265 (Fla. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e196. See Rosensteil v. Rodriguez, 101 F.3d 1544, 1553 (8th Cir. 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e197. See Vote Choice, Inc. v. DiStefano, 4 F.3d 26, 39- 40 (1st Cir. 1993); Republican Nat'l Comm. v. Fed. Election Comm'n, 487 F. Supp. 280, 284 (S.D.N.Y. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e198. AS 15.13.116 reads, in pertinent part: (a) A candidate who, after the date of the general, special, municipal, or municipal runoff election or after the date the candidate withdraws as a candidate, whichever comes first, holds unused campaign contributions shall distribute the amount held within 90 days. The distribution may only be made to . . . . (8) transfer all or a portion of the unused campaign contributions to an account for a future election campaign; a transfer under this paragraph is limited to (A) $50,000, if the transfer is made by a candidate for governor or lieutenant governor; (B) $10,000, if the transfer is made by a candidate for the state senate; (C) $5,000, if the transfer is made by a candidate for the state house of representatives; and (D) $5,000, if the transfer is made by a candidate for an office not described in (A)-(C) of this paragraph; . . . . (b) After a general, special, municipal, or municipal runoff election, a candidate may retain the ownership of one computer and one printer and of personal property, except money, that was acquired by and for use in the campaign. The current fair market value of the property retained, exclusive of the computer and printer, may not exceed $2,500. All other property shall be disposed of, or sold and the sale proceeds disposed of, in accordance with (a) or (c) of this section. (c) Property remaining after disbursements are made under (a)-(b) of this section is forfeited to the state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e199. See Shrink Mo. Gov't Political Action Comm. v. Maupin, 71 F.3d 1422, 1427-29 (8th Cir. 1995) (invalidating Missouri's carry-forward restriction); Service Employees, 955 F.2d at 1315, 1323 (discussing provision barring expenditure of funds raised before challenged reform measure was enacted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e200. In Open Secrets, Larry Makinson cites numerous \"popular\" methods of evading the former $1,000 contribution limit, including making off-year contributions, donating through family members, donating through corporations, donating through union locals, and pooling donations of employees. See Larry Makinson, Open Secrets 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e201. See Shrink, 71 F.3d at 1428-29; Service Employees, 955 F.2d at 1318-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e202. AS 15.13.112(b) reads, in pertinent part: (b) Campaign contributions held by a candidate or group may not be . . . . (7) used to make contributions to another candidate or to a group.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e203. See 955 F.2d at 1315.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e204. Id. at 1322 (\"Concerns about the unintended use of contributors' money can be met 'by means far more narrowly tailored and less burdensome than [a] restriction on direct expenditures: simply requiring that contributors be informed that their money may be used for such a purpose.'\") (quoting FEC v. MCFL, 479 U.S. 238, 261 (1986)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e205. Id. at 1323.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e206. See id. at 1322.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e207. See Leavitt v. Jane L., 518 U.S. 137, 139 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e208. Lynden Transport, Inc. v. State, 532 P.2d 700, 713 (Alaska 1975) (quoting Dorchy v. Kansas, 264 U.S. 286, 290 (1924)); see also Sonneman v. Hickel, 836 P.2d 936, 940-41 (Alaska 1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e209. See Ch. 48  31, SLA 1996 (\"Under AS 01.10.030, if any provision of this Act, or the application thereof to any person or circumstance, is held invalid, the remainder of this Act and the application to other persons or circumstances is not affected thereby.\"). AS 01.10.030 provides: Any law heretofore or hereafter enacted by the Alaska legislature which lacks a severability clause shall be construed as though it contained the clause in the following language, \"If any provision of this Act, or the application thereof to any person or circumstance is held invalid, the remainder of this Act and the application to other persons or circumstances shall not be affected thereby.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e210. See 424 U.S. at 108-09.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e211. See 146 F.3d at 573.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e212. See Federal Election Comm'n v. Colorado Republican Fed. Campaign Comm., 1999 WL 86840, at *10 (D. Colo. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e213. AS 15.13.074(b) reads: \"A person or group may not make a contribution anonymously, using a fictitious name, or using the name of another.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e214. See Citizens Against Rent Control, 454 U.S. at 299-300.\u003c/span\u003e\n\n",
    "body_length": 153175,
    "citedas": [
      "978 P.2d 597"
    ],
    "attorneys": "Appearances: David T. Jones and Jan Hart DeYoung, Assistant Attorneys General, Anchorage, and Bruce M. Botelho, Attorney General, Juneau, for Appellant. Jonathan B. Rubini, Foster, Pepper, Rubini \u0026 Reeves, L.l.c., Anchorage, and Suzanne S. La Pierre, Anchorage, for Appellee. Kyle W. Parker, Patton, Boggs, L.l.p., Anchorage, and Benjamin L. Ginsberg, John C. Martin, and Donald F. McGahn II, Patton, Boggs, L.l.p., Washington, D.c., for Amicus Curiae Alaska State Chamber of Commerce.",
    "category": [
      "124"
    ],
    "judges": "Before: Matthews, Chief Justice, Compton, Eastaugh, Fabe, and Bryner, Justices.",
    "citation_count": 5
  }
}
