{
  "id": "vqnHSWYBTlTomsSBa-Fw",
  "document": {
    "title": "FLORIDA BAR AMENDMENTS TO RULES REGULATING FLORIDA BAR",
    "full_title": "THE FLORIDA BAR; RE: AMENDMENTS TO RULES REGULATING THE FLORIDA BAR",
    "jurisdiction": "Supreme Court of Florida",
    "date": "1994-10-20T00:00:00.000Z",
    "docket": "No. 83,222",
    "body": "Per Curiam.\n\nThe Florida Bar, as part of its annual review and with the authorization of the Board of Governors, petitions this Court to amend the Rules Regulating The Florida Bar and to adopt new rules. Several private citizens have also filed petitions requesting the amendment and adoption of rules. The Bar opposes the citizen petitions, and various members of the Bar and the public oppose the Bar's petition. We have jurisdiction pursuant to article V, sections 2(a) and 15 of the Florida Constitution.\n\nThe specific Rules Regulating The Florida Bar that the Bar has petitioned to create or amend include: rule 1-3.3 (Official Bar Name and Address); bylaw 2-3.5 (Board of Governors; Nomination of Members; Staggered Terms); bylaw 2-9.7 (Policies and Rules; Insurance for Members of Board of Governors, Officers, Grievance Committee Members, UPL Committee Members, Clients' Security Fund Committee Members, and Employees); rule 3-2.1 (Rules of Discipline; Definitions); rule 3-5.1 (Types of Discipline); rule 3-5.3 (Diversion of Disciplinary Cases to Practice and Professionalism Enhancement Programs); rule 3-7.1 (Confidentiality; Notice to Judges; Alcohol and Drug Treatment); rule 3-7.3 (Review of Inquiries, Complaint Processing, and Initial Investigatory Procedures); rule 3-7.4 (Grievance Committee Procedures); rule 3-7.6 (Procedures Before a Referee; Costs); rule 4-1.5 (Fees for Legal Services); rule 4-1.6 (Confidentiality of Information); rule 4-3.4 (Fairness of Opposing Party and Counsel); rule 4-3.6 (Trial Publicity); rule 4-5.4 (Professional Independence of a Lawyer; Sharing Fees With Non-lawyers); rule 4-7.6 (Communication of Fields of Practice); subchapter 6-14 (Standards for Certification of Board Certified Health Law Attorney); subchapter 6-15 (Standards for Certification of Board Certified Immigration and Nationality Lawyer);\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and chapter 14 (Fee Arbitration Rule; Jurisdiction; Institution of Proceedings; Rules of Procedure for Arbitration Proceedings).\n\nWith minor modifications as set forth in this opinion, we approve the Bar's proposals. We also consider, on our own motion, amendment to rule 3-7.10 (Reinstatement and Readmission Procedures). A number of private citizens also filed petitions and appeared at oral argument in this cause. We commend those citizens who participated in these proceedings and took the time to share their concerns and frustrations with the Court. However, we find the citizen proposals to be without merit, and thus do not approve the amendments or new rules set forth in the citizen petitions.\n\nSome of the amendments proposed by the Bar involve only technical changes, and others are self-explanatory. However, we find the following rules deserve discussion.\n\nRule 3-5.3 - Professional Enhancement Programs\n\nRule 3-5.3 is a new rule that creates a program of diverting disciplinary cases to practice and professionalism enhancement programs as an alternative to existing sanctions. The practice and professionalism enhancement programs are intended to provide educational opportunities to members of the Bar for enhancing skills and avoiding misconduct allegations. The rule specifies that only those disciplinary cases that would otherwise be disposed of by a finding of minor misconduct or by a finding of no probable cause with a letter of advice are eligible for diversion to practice and professionalism enhancement programs. Furthermore, a respondent who has been the subject of a prior diversion within seven years is not eligible for diversion. The rule also outlines the mechanics of the diversion process, the responsibilities of a respondent whose case is diverted, and the effects, costs, and possible sanctions in the event that a diversion program is not completed.\n\nIn spite of several comments in opposition to this new rule, we find that diversion to such practice and professionalism enhancement programs is a remedial action which serves the interests of both the Bar and the public. The thrust of this program is to identify lawyers who are beginning to have problems with the management of their practices as evidenced by minor disciplinary complaints. The lawyers are then provided skills training or professional enhancement, thereby diverting serious matters of misconduct. We note that a similar pretrial intervention program operating in the criminal justice system has been effective in dealing with persons charged with nonviolent offenses. See ยง 948.08, Fla. Stat. (1993).\n\nRule 3-7.6 - Procedures Before a Referee\n\nProposed subdivision (o) clarifies what are taxable costs in disciplinary proceedings and provides for the assessment of a respondent's costs against the Bar in the event that the Bar raises no justiciable issue of law or fact. The rule also codifies this Court's reaffirmation that the award of costs in disciplinary actions is subject to the referee's discretion. See The Fla. Bar v. Bosse, 609 So.2d 1320, 1322 (Fla. 1992); The Fla. Bar v. Chilton, 616 So.2d 449, 451 (Fla. 1993).\n\nWhile we agree with the Bar that most of the changes to this rule are in accord with recent decisions of this Court, we agree with bar member Henry Trawick that the proposed \"clear and convincing evidence\" standard is unfair to a respondent seeking an assessment of costs against the Bar or attempting to avoid an assessment of costs in the Bar's favor that the respondent claims to be unnecessary, excessive, or improperly authenticated. Accordingly, we do not include such a standard in the amended rule.\n\nRule 4-3.6 - Trial Publicity\n\nThe proposed amendment of this rule follows the United States Supreme Court's recent decision in Gentile v. State Bar of Nevada, 501 U.S. 1030, 111 S. Ct. 2720, 115 L. Ed. 2d 888 (1991). In Gentile , the Supreme Court held that a Nevada rule that is almost identical to our current rule 4-3.6 was unconstitutional because of vagueness. The proposed amendment of rule 4-3.6 deletes the type of \"safe harbor\" language that the Supreme Court found misleading in Gentile, 111 S. Ct. at 2731-32, and incorporates the \"substantial likelihood of material prejudice\" standard that the Supreme Court found to be a \"constitutionally permissible balance between the First Amendment rights of attorneys in pending cases and the state's interest in fair trials.\" Id. at 2745.\n\nRule 3-7.10 - Reinstatement and Readmission Procedures In addition to the Bar's proposals, this Court, on its own motion, amends rule 3-7.10 to include a new subdivision that specifies the costs that are taxable in reinstatement and readmission proceedings. As this Court explained in Bosse and Chilton, only those costs specifically identified in the Rules Regulating The Florida Bar may be assessed against either a respondent or the Bar. 609 So.2d at 1322; 616 So.2d at 451. Rule 3-7.10(d) currently provides that costs may include \"court reporters' fees, witness fees and traveling expenses, and reasonable traveling expenses and out-of-pocket costs of the referee and attorneys for The Florida Bar.\" Thus, the rule currently does not permit the assessment of other costs such as investigative expenses. See The Fla. Bar re Janssen, No. 81,774 (Fla. Oct. 13, 1994); The Fla. Bar re Williams, 538 So.2d 836 (Fla. 1989). We have added subdivision (o) to permit the assessment of the same taxable costs that may be assessed in a disciplinary proceeding before a referee, as provided by amended rule 3-7.6(o).\n\nAccordingly, the rules are amended and adopted as reflected in the appendix to this opinion. The new language is indicated by underscoring; deletions are indicated by strike-through type. Committee comments are included for explanation and guidance only and are not adopted as an official part of the rules. These amendments take effect upon the release of this opinion.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The filing of a motion for rehearing shall not modify the effective date of the rules.\n\nIt is so ordered.\n\nGRIMES, C.J., and OVERTON, SHAW, KOGAN, HARDING, WELLS, and\n\nANSTEAD, JJ., concur.\n\nAPPENDIX\n\nRULE 1-3.3 OFFICIAL BAR NAME AND ADDRESS\n\nEach member of The Florida Bar shall designate an official barname, mailing address, and business telephone number. If the address given is not the physical location or street address of the principal place of employment, then such information shall also be given. Each member shall promptly notify the executive director of any changes in any information required by this rule. The official bar name of each member of The Florida Bar shall be used in the course of the member's practice of law. A change in official bar name may be made only upon request to and approval of the Supreme Court of Florida.\n\nBYLAW 2-3.5 NOMINATION OF MEMBERS\n\n(a) Staggered Terms. Elections shall be held and appointments made in even-numbered years for the following board of governors' representatives:\n\nCircuit (seat #)\n\n1\n\n2(2)\n\n3\n\n4(1)\n\n6(1)\n\n7\n\n9(1)\n\n9(3)\n\n10\n\n11(1)\n\n11(3)\n\n11(5)\n\n11(7)\n\n11(9)\n\n13(1)\n\n14\n\n15(1)\n\n15(3)\n\n17(1)\n\n17(4)\n\n18\n\n20\n\nnonresident (2)\n\npublic member (2)\n\nElections shall be held and appointments made in odd-numbered years for the following board of governors' representatives:\n\nCircuit (seat #)\n\n2(1)\n\n4(2)\n\n5\n\n6(2)\n\n8\n\n9(2)\n\n11(2)\n\n11(4)\n\n11(6)\n\n11(8)\n\n11(10)\n\n11(11)\n\n12(1)\n\n13(2)\n\n13(3)\n\n15(2)\n\n16\n\n17(2)\n\n17(3)\n\n17(5)\n\n19\n\nnonresident (1)\n\nnonresident (3)\n\npublic member (1)\n\nAs additions or deletions of circuit representatives resulting from the application of the formula provided in this rule necessitate changes in the lists set forth above, both in circuit and office numbers, such changes shall be made by the executive director as appropriate and shall be published in The Florida Bar News on or before November 1.\n\n(b) Time for Filing Nominating Petitions. Nominations for the election of representatives on the board of governors from each judicial circuit shall be made by written petition signed by not fewer than 5 members of The Florida Bar in good standing. In each circuit in which there is more than 1 representative to be elected, the offices of the representatives shall be designated numerically, with the executive director making whatever adjustments are necessary to reflect changes resulting from the annual certification, and a nominating petition shall state the number of the office sought by a nominee. Any number of candidates may be nominated on a single petition, and any number of petitions may be filed, but all candidates named in a petition and all members signing such petition shall have their official bar address in the judicial circuit that the candidate is nominated to represent and shall be members of The Florida Bar in good standing. Nominations for election of a nonresident member of the board of governors shall be by written petition signed by not fewer than 5 nonresident members of The Florida Bar in good standing. Nominees shall endorse their written acceptance on such petitions but no nominee shall accept nomination for more than 1 office. All nominating petitions shall be filed with the executive director at the headquarters office on or before 5:00 p.m., December 1 prior to the year of election. On a date to be fixed by the executive director the nominating petitions shall be canvassed and tabulated by the executive director and the clerk of the Supreme Court of Florida, and the executive director and the clerk of the Supreme Court of Florida shall thereupon certify in writing the names of all members who have been properly nominated.\n\n(c) Nomination and Appointment of Non-lawyer Members. The board of governors' members who are not members of The Florida Bar shall be chosen and appointed by the Supreme Court of Florida from the list of nominees to be filed with the court by the board of governors. The board of governors of The Florida Bar by majority vote shall nominate 3 persons for each non-lawyer seat and shall file the nominations with the Supreme Court of Florida on or before April 15 of the appointment year for that seat. The 2 non-lawyer members shall serve staggered terms of 2 years and shall serve no more than 2 terms.\n\nBYLAW 2-9.7 INSURANCE FOR MEMBERS OF BOARD OF GOVERNORS, OFFICERS, GRIEVANCE COMMITTEE MEMBERS, UPL COMMITTEE MEMBERS, CLIENTS' SECURITY FUND COMMITTEE MEMBERS, AND EMPLOYEES\n\nAppropriate insurance coverage for members of the board of governors, officers of The Florida Bar, members of UPL, clients' security fund, and grievance committees, and employees of The Florida Bar shall be provided as authorized by the budget committee and included in the budget. To the extent the person is not covered by insurance, The Florida Bar shall indemnify any officer, board member, UPL, clients' security fund, or grievance committee member, or employee of The Florida Bar who was or is a party, or is threatened to be made a party to any threatened, pending, or completed action, suit, or proceeding, whether civil, criminal, administrative, or investigative (other than an action by The Florida Bar), by reason of the fact that the person is or was an officer, board member, UPL, clients' security fund, or grievance committee member, or employee of The Florida Bar, against expenses (including attorneys' fees), judgments, fines, and amounts paid in settlement, actually and reasonably incurred by the person in connection with such action, suit, or proceeding, including any appeal thereof, if the person acted in good faith and in a manner reasonably believed to be in, or not opposed to, the best interests of The Florida Bar, and with respect to any criminal action or proceeding, had no reasonable cause to believe the conduct was unlawful. The termination of any action, suit, or proceeding by judgment, order, settlement, or conviction or upon a plea of nolo contendere or its equivalent shall not of itself create a presumption that the person did not act in good faith and in a manner that the person reasonably believed to be in, or not opposed to, the best interests of The Florida Bar, or with respect to any criminal action or proceeding, had reasonable cause to believe that the conduct was unlawful.\n\n3-2. DEFINITIONS\n\nRULE 3-2.1 GENERALLY\n\nWherever used in these rules the following words or terms shall have the meaning herein set forth unless the use thereof shall clearly indicate a different meaning:\n\n(a) Bar Counsel. A member of The Florida Bar representing The Florida Bar in any proceeding under these rules. Any staff counsel of The Florida Bar may serve as bar counsel or assistant bar counsel in a particular case.\n\n(b) The Board or the Board of Governors. The board of governors of The Florida Bar.\n\n(c) Complainant or Complaining Witness. Any person who has complained of the conduct of any member of The Florida Bar to any officer or agency of The Florida Bar.\n\n(d) This Court or the Court. The Supreme Court of Florida.\n\n(e) Court of this State. A state court authorized and established by the constitution or laws of the State of Florida.\n\n(f) Diversion to Practice and Professionalism Enhancement Programs. The removal of a disciplinary matter from the disciplinary system and placement of the matter in a skills enhancement program in lieu of a disciplinary sanction.\n\n( f g) Executive Committee. The executive committee of the board of governors of The Florida Bar.\n\n( g h) Executive Director. The executive director of The Florida Bar.\n\n(i) Practice and Professionalism Enhancement Programs. Programs operated either as a diversion from disciplinary action or as a part of a disciplinary sanction that are intended to provide educational opportunities to members of the bar for enhancing skills and avoiding misconduct allegations.\n\n( h j) Probable Cause. A finding by an authorized agency that there is cause to believe that a member of The Florida Bar is guilty of misconduct justifying disciplinary action.\n\n(k) Referral to Practice and Professionalism Enhancement Programs. Placement of a lawyer in skills enhancement programs as a disciplinary sanction.\n\n( i l) Referee. A judge or retired judge appointed to conduct proceedings as provided under these rules.\n\n( j m) Respondent. A member of The Florida Bar or an attorney subject to these rules who is accused of misconduct or whose conduct is under investigation.\n\n( k n) Staff Counsel. An employee of The Florida Bar authorized under rule 3-3.3. When used in this rule, the term may include associate or assistant staff counsel.\n\n( l o) Branch Staff Counsel. Branch staff counsel are the assistant staff counsel in charge of a branch office of The Florida Bar. Any assistant staff counsel of The Florida Bar may serve as branch staff counsel at the direction of the regularly assigned branch staff counsel or headquarters staff counsel. Headquarters staff counsel are the staff counsel assigned to the headquarters office in Tallahassee.\n\n( m p) Designated Reviewer. The designated reviewer is a member of the board of governors responsible for review and other specific duties as assigned by the board of governors with respect to a particular grievance committee or matter. If a designated reviewer recuses or is unavailable, any other board member may serve as designated reviewer in that matter. The designated reviewer will be selected, from time to time, by the board members from the circuit of such grievance committee. In circuits having an unequal number of grievance committees and board members, review responsibility will be reassigned, from time to time, to equalize workloads. On such reassignments responsibility for all pending cases from a particular committee passes to the new designated reviewer. Staff counsel will be given written notice of changes in the designated reviewing members for a particular committee.\n\n3-5. TYPES OF DISCIPLINE\n\nRULE 3-5.1 GENERALLY\n\nA judgment entered, finding a member of The Florida Bar guilty of misconduct, shall include one or more of the following disciplinary measures:\n\n(a) Admonishments. A Supreme Court of Florida order finding minor misconduct and adjudging an admonishment may direct the respondent to appear before the Supreme Court of Florida, the board of governors, grievance committee, or the referee for administration of the admonishment. A grievance committee report and finding of minor misconduct or the board of governors, upon review of such report, may direct the respondent to appear before the board of governors or the grievance committee for administration of the admonishment. A memorandum of administration of an admonishment shall thereafter be made a part of the record of the proceeding.\n\n(b) Minor Misconduct. Minor misconduct is the only type of misconduct for which an admonishment is an appropriate disciplinary sanction.\n\n(1) Criteria. In the absence of unusual circumstances misconduct shall not be regarded as minor if any of the following conditions exist:\n\n(A) the misconduct involves misappropriation of a client's funds or property;\n\n(B) the misconduct resulted in or is likely to result in actual prejudice (loss of money, legal rights, or valuable property rights) to a client or other person;\n\n(C) the respondent has been publicly disciplined in the past 3 years;\n\n(D) the misconduct involved is of the same nature as misconduct for which the respondent has been disciplined in the past 5 years;\n\n(E) the misconduct includes dishonesty, misrepresentation, deceit, or fraud on the part of the respondent; or\n\n(F) the misconduct constitutes the commission of a felony under applicable law.\n\n(2) Discretion of Grievance Committee. Despite the presence of 1 or more of the criteria described in subdivision (1) above, a grievance committee may recommend an admonishment for minor misconduct or diversion to a practice and professionalism enhancement program when unusual circumstances are present. When the grievance committee recommends an admonishment for minor misconduct or diversion to a practice and professionalism enhancement program under such circumstances, its report shall contain a detailed explanation of the circumstances giving rise to the committee's recommendation.\n\n(3) Recommendation of Minor Misconduct. If a grievance committee finds the respondent guilty of minor misconduct or if the respondent shall admit guilt of minor misconduct and the committee concurs, the grievance committee shall file its report recommending an admonishment, recommending the manner of administration, and for the taxing of costs against the respondent. The report recommending an admonishment shall be forwarded to staff counsel and the designated reviewer for review. If staff counsel does not return the report to the grievance committee to remedy a defect therein, or if the report is not referred to the disciplinary review committee by the designated reviewer (as provided in rule 3-7.5(b)), the report shall then be served on the respondent by bar counsel. The report and finding of minor misconduct shall become final unless rejected by the respondent within 15 days after service of the report. If rejected by the respondent, the report shall be referred to bar counsel and referee for trial on complaint of minor misconduct to be prepared by bar counsel as in the case of a finding of probable cause. If the report of minor misconduct is not rejected by the respondent, notice of the finding of minor misconduct shall be given, in writing, to the complainant.\n\n(4) Rejection of Minor Misconduct Reports. The rejection by the board of governors of a grievance committee report of minor misconduct, without dismissal of the case, or remand to the grievance committee, shall be deemed a finding of probable cause. The rejection of such report by a respondent shall be deemed a finding of probable cause for minor misconduct. Upon trial before a referee following rejection by a respondent of a report of minor misconduct, the referee may recommend any discipline authorized under these rules.\n\n(5) Admission of Minor Misconduct. Within 15 days after a finding of probable cause by a grievance committee, a respondent may tender a written admission of minor misconduct to bar counsel or the grievance committee. An admission of minor misconduct may be conditioned upon acceptance by the grievance committee, but the respondent may not condition the admission of minor misconduct upon the method of administration of the admonishment or upon nonpayment of costs incurred in the proceedings. Such an admission may be tendered after a finding of probable cause (but before the filing of a complaint) only if such an admission has not been previously tendered. If the admission is tendered after a finding of probable cause, the grievance committee may consider such admission without further evidentiary hearing and may either reject the admission, thereby affirming its prior action, or accept the admission and issue its report of minor misconduct. If a respondent's admission is accepted by the grievance committee, the respondent may not thereafter reject a report of the committee recommending an admonishment for minor misconduct. If the admission of minor misconduct is rejected, such admission shall not be considered or used against the respondent in subsequent proceedings.\n\n(c) Probation. The respondent may be placed on probation for a stated period of time of not less than 6 months nor more than 3 years or for an indefinite period determined by conditions stated in the order. The judgment shall state the conditions of the probation, which may include but are not limited to the following: completion of a practice and professionalism enhancement program as provided elsewhere in these rules; supervision of all or part of the respondent's work by a member of The Florida Bar; the making of reports to a designated agency; the satisfactory completion of a course of study or a paper on legal ethics approved by the Supreme Court of Florida; such supervision over fees and trust accounts as the court may direct. The respondent will also reimburse the bar for the costs of supervision. Failure to observe the conditions of the probation or a finding of probable cause as to conduct of the respondent committed during the period of probation shall terminate the probation. In such event, even though such finding of probable cause shall be made after the expiration of the period of probation, the judgment shall be reconsidered and an appropriate judgment shall be entered. On termination of probation for failure to observe the conditions of probation or on a finding of probable cause for misconduct committed during the period of probation, the attorney may be punished for contempt or suspended from the practice of law on petition by The Florida Bar, and any such suspension shall continue until the respondent may be reinstated to the practice of law as provided elsewhere in these rules.\n\n(d) Public Reprimand. A public reprimand shall be administered in the manner prescribed in the judgment but all such reprimands shall be reported in the Southern Reporter. Due notice shall be given to the respondent of any proceeding set to administer the reprimand. The respondent shall appear personally before the Supreme Court of Florida, the board of governors, any judge designated to administer the reprimand, or the referee, if required, and such appearance shall be made a part of the record of the proceeding.\n\n(e) Suspension. The respondent may be suspended from the practice of law for a definite period of time or an indefinite period thereafter to be determined by the conditions imposed by the judgment. During such suspension the respondent shall continue to be a member of The Florida Bar but without the privilege of practicing, and, upon the expiration of the suspension period and the satisfaction of all conditions accompanying the suspension, the respondent shall become eligible to all of the privileges of members in The Florida Bar. A suspension of 90 days or less shall not require proof of rehabilitation or passage of the Florida bar examination. A suspension of more than 90 days shall require proof of rehabilitation and may require passage of all or part of the Florida bar examination. No suspension shall be ordered for a specific period of time in excess of 3 years.\n\n(f) Disbarrment. A judgment of disbarrment terminates the respondent's status as a member of the bar. A former member who has been disbarred may only be admitted again upon full compliance with the rules and regulations governing admission to the bar. Except as might be otherwise provided in these rules, no application for admission may be tendered within 5 years after the date of disbarrment or such longer period as the court might determine in the disbarrment order.\n\n(g) Notice to Clients. Upon service on the respondent of an order of disbarrment, suspension, resignation for cause, emergency suspension, or placement on the inactive list, the respondent shall, unless this requirement is waived or modified in the court's order, forthwith furnish a copy of the order to all of the respondent's clients with matters pending in the respondent's practice, and within 30 days after service of the order the respondent shall furnish staff counsel of The Florida Bar with a sworn affidavit listing the names and addresses of all clients who have been furnished copies of the order.\n\n(h) Forfeiture of Fees. An order of the Supreme Court of Florida or a report of minor misconduct adjudicating a respondent guilty of entering into, charging, or collecting a fee prohibited by the Rules Regulating The Florida Bar may order the respondent to forfeit the fee or any part thereof. In the case of a clearly excessive fee, the excessive amount of the fee may be ordered returned to the client, and a fee otherwise prohibited by the Rules Regulating The Florida Bar may be ordered forfeited to The Florida Bar Clients' Security Fund and disbursed in accordance with its rules and regulations.\n\n(i) Restitution. In addition to any of the foregoing disciplinary sanctions and any disciplinary sanctions authorized elsewhere in these rules, the respondent may be ordered or agree to pay restitution to a complainant or other person if the disciplinary order finds that the respondent has received a clearly excessive, illegal, or prohibited fee or that the respondent has converted trust funds or property. In such instances the amount of restitution shall be specifically set forth in the disciplinary order or agreement and shall not exceed the amount by which a fee is clearly excessive, in the case of a prohibited or illegal fee shall not exceed the amount of such fee, or in the case of conversion shall not exceed the amount of the conversion established in disciplinary proceedings. The disciplinary order or agreement shall also state to whom restitution shall be made and the date by which it shall be completed. Failure to comply with the order or agreement shall not preclude further proceedings under these rules.\n\n(j) Disciplinary Resignation. A respondent may be allowed to resign membership in The Florida Bar in lieu of defending against allegations of disciplinary violations. If accepted by the Supreme Court of Florida, a disciplinary resignation terminates the respondent's status as a member of the bar. A former member whose disciplinary resignation has been accepted may only be admitted again upon full compliance with the rules and regulations governing admission to the bar. Except as otherwise provided in these rules, no application for admission may be tendered within 3 years after the date of the order of the Supreme Court of Florida that accepted the disciplinary resignation or such additional time as the respondent may have stated in the petition for disciplinary resignation. A petition that states that disciplinary resignation is without leave to apply for readmission shall preclude readmission to the bar.\n\nRULE 3-5.3 DIVERSION OF DISCIPLINARY CASES TO PRACTICE AND PROFESSIONALISM ENHANCEMENT PROGRAMS\n\n(a) Authority of Board. The board of governors is hereby authorized to establish practice and professionalism enhancement programs to which eligible disciplinary cases may be diverted as an alternative to disciplinary sanction.\n\n(b) Types of Disciplinary Cases Eligible for Diversion. Disciplinary cases that otherwise would be disposed of by a finding of minor misconduct or by a finding of no probable cause with a letter of advice are eligible for diversion to practice and professionalism enhancement programs.\n\n(c) Limitation on Diversion. A respondent who has been the subject of a prior diversion within 7 years shall not be eligible for diversion.\n\n(d) Approval of Diversion Recommended by Bar Counsel or Grievance Committee. The bar shall not offer a respondent the opportunity to divert a disciplinary case to a practice and professionalism enhancement program unless staff counsel, the grievance committee chair, and the designated reviewer concur.\n\n(e) Contents of Diversion Recommendation. If a diversion recommendation is approved as provided in subdivision (d), the recommendation shall state the practice and professionalism enhancement program(s) to which the respondent shall be diverted, shall state the general purpose for the diversion, and the costs thereof to be paid by the respondent.\n\n(f) Service of Recommendation on and Review by Respondent. If a diversion recommendation is approved as provided in subdivision (d), the recommendation shall be served on the respondent who may accept or reject a diversion recommendation in the same manner as provided for review of recommendations of minor misconduct. The respondent shall not have the right to reject any specific requirement of a practice and professionalism enhancement program.\n\n(g) Effect of Rejection of Recommendation by Respondent. In the event that a respondent rejects a diversion recommendation the matter shall be returned for further proceedings under these rules.\n\n(h) Diversion at Trial Level.\n\n(1) Agreement of the Parties. A referee may recommend diversion of a disciplinary case to a practice and professionalism enhancement program if the bar approves diversion as stated in subdivision (d) and the respondent agrees. Under these circumstances a conditional plea, as otherwise authorized by these rules, may be submitted to the referee for review and approval.\n\n(2) After Submission of Evidence. A referee may recommend diversion of a disciplinary case to a practice and professionalism enhancement program if, after submission of evidence, but before a finding of guilt,the referee determines that, if proven, the conduct alleged to have been committed by the respondent is not more serious than minor misconduct.\n\n(3) Costs of Practice and Professionalism Enhancement Program. A referee's recommendation of diversion to a practice and professionalism enhancement program shall state the costs thereof to be paid by the respondent.\n\n(4) Appeal of Diversion Recommendation. The respondent and the bar shall have the right to appeal a referee's recommendation of diversion, except in the case of diversion agreed to under subdivision (h)(1).\n\n(5) Authority of Referee to Refer a Matter to a Practice and Professionalism Enhancement Program. Nothing in this rule shall preclude a referee from referring a disciplinary matter to a practice and professionalism enhancement program as a part of a disciplinary sanction.\n\n(i) Effect of Diversion. When the recommendation of diversion becomes final, the respondent shall enter the practice and professionalism enhancement program(s) and complete the requirements thereof. Upon respondent's entry into a practice and professionalism enhancement program, the bar shall terminate its investigation into the matter and its disciplinary files shall be closed indicating the diversion. Diversion into the practice and professionalism enhancement program shall not constitute a disciplinary sanction.\n\n(j) Effect of Completion of the Practice and Professionalism Enhancement Program. If a respondent successfully completes all requirements of the practice and professionalism enhancement program(s) to which the respondent was diverted, the bar's file shall remain closed.\n\n(k) Effect of Failure to Complete the Practice and Professionalism Enhancement Program. If a respondent fails to fully complete all requirements of the practice and professionalism enhancement program(s) to which the respondent was diverted, including the payment of costs thereof, the bar may reopen its disciplinary file and conduct further proceedings under these rules. Failure to complete the practice and professionalism enhancement program shall be considered as a matter of aggravation when imposing a disciplinary sanction.\n\n(l) Costs of Practice and Professionalism Enhancement Programs. The Florida Bar shall annually determine the costs of practice and professionalism enhancement programs and publish the amount of the costs thereof that shall be assessed against and paid by a respondent.\n\n3-7. PROCEDURES\n\nRULE 3-7.1 CONFIDENTIALITY\n\n(a) Scope of Confidentiality. All matters including files, preliminary investigation reports, interoffice memoranda, records of investigations, and the records in trials and other proceedings under these rules, except those disciplinary matters conducted in circuit courts, are property of The Florida Bar. All of those matters shall be confidential and shall not be disclosed except as provided in these rules. When disclosure is permitted under these rules, it shall be limited to information concerning the status of the proceedings and any information that is part of the public record as defined in these rules.\n\n(b) Public Record. The public record shall consist of the record before a grievance committee, the record before a referee, the record before the Supreme Court of Florida, and any reports, correspondence, papers, recordings, and/or transcripts of hearings furnished to, served on, or received from the respondent or the complainant.\n\n(c) Circuit Court Proceedings. Proceedings under rule 3-3.5 shall be public information. Contempt proceedings authorized elsewhere in these rules shall be public information even though the underlying disciplinary matter is confidential as defined in these rules.\n\n(d) Limitations on Disclosure. Any material provided to The Florida Bar that is confidential under applicable law shall remain confidential and shall not be disclosed except as authorized by the applicable law. If this type of material is made a part of the public record, that portion of the public record may be sealed by the grievance committee chair, the referee, or the Supreme Court of Florida.\n\n(e) Disclosure of Information. Unless otherwise ordered by this court or the referee in proceedings under this rule, nothing in these rules shall prohibit the complainant, respondent, or any witness from disclosing the existence of proceedings under these rules or from disclosing any documents or correspondence served on or provided to those persons.\n\n(f) Response to Inquiry. Representatives of The Florida Bar authorized by the board of governors shall respond to specific inquiries concerning matters that are in the public domain, but otherwise confidential under the rules, by acknowledging the status of the proceedings.\n\n(g) Notice to Law Firms. When a disciplinary file is opened the respondent shall disclose to the respondent's current law firm and, if different, the respondent's law firm at the time of the act or acts giving rise to the complaint, the fact that a disciplinary file has been opened. Disclosure shall be in writing and in the following form:\n\nA complaint of unethical conduct against me has been filed with The Florida Bar. The nature of the allegations are ___________________________. This notice is provided pursuant to rule 3-7.1(g) of the Rules Regulating The Florida Bar.\n\nThe notice shall be provided within 15 days of notice that a disciplinary file has been opened and a copy of the above notice shall be served on The Florida Bar.\n\n(h) Pending Investigations. Disciplinary matters pending at the initial investigatory and grievance committee levels shall be treated as confidential by The Florida Bar, except as provided in rule 3-7.1(f).\n\n(i) Minor Misconduct Cases. Any case in which a finding of minor misconduct has been entered, by action of the grievance committee or board, shall become public information.\n\n(j) Probable Cause Cases. Any disciplinary case in which a finding of probable cause for further disciplinary proceedings has been entered shall be public information. For purposes of this subdivision a finding of probable cause shall be deemed to have been made in those cases authorized by rule 3-3.2(a), for the filing of a formal complaint without the prior necessity of a finding of probable cause.\n\n(k) No Probable Cause Cases. Any disciplinary case that has been concluded by a finding of no probable cause for further disciplinary proceedings shall become public information.\n\n(l) Production of Disciplinary Records Pursuant to Subpoena. The Florida Bar, pursuant to a valid subpoena issued by a regulatory agency, may provide any documents that are a portion of the public record, even if the disciplinary proceeding is confidential under these rules. The Florida Bar may charge a reasonable fee for identification of and photocopying the documents.\n\n(m) Notice to Judges. Any judge of a court of record upon inquiry of the judge shall be advised and, absent an inquiry, may be advised as to the status of a confidential disciplinary case and may be provided with a copy of documents in the file that would be part of the public record if the case was not confidential. The judge shall maintain the confidentiality of the matter records and shall not otherwise disclose the status of the case.\n\n(n) Evidence of Crime. The confidential nature of these proceedings shall not preclude the giving of any information or testimony to authorities authorized to investigate alleged criminal activity.\n\n(o) Alcohol and Drug Treatment. That an attorney has voluntarily sought, received, or accepted treatment for alcoholism or alcohol or drug abuse shall be confidential and shall not be admitted as evidence in disciplinary proceedings under these rules unless agreed to by the attorney who sought the treatment.\n\nFor purposes of this subdivision, an attorney shall be deemed to have voluntarily sought, received, or accepted treatment for alcoholism or alcohol or drug abuse if the attorney was not under compulsion of law or rule to do so, or if the treatment is not a part of conditional admission to The Florida Bar or of a disciplinary sanction imposed under these rules.\n\nIt is the purpose of this subdivision to encourage attorneys to voluntarily seek advice, counsel, and treatment available to attorneys, without fear that the fact it is sought or rendered will or might cause embarrassment in any future disciplinary matter.\n\n(p) Response to False or Misleading Statements. If public statements that are false or misleading are made about any otherwise confidential disciplinary case, The Florida Bar may disclose all information necessary to correct such false or misleading statements.\n\n(q) Disclosure by Waiver of Respondent. Upon written waiver executed by a respondent, The Florida Bar may disclose the status of otherwise confidential disciplinary proceedings and provide copies of the public record to:\n\n(1) the Florida Board of Bar Examiners or the comparable body in other jurisdictions for the purpose of evaluating the character and fitness of an applicant for admission to practice law in that jurisdiction; or\n\n(2) Florida judicial nominating commissions or the comparable body in other jurisdictions for the purpose of evaluating the character and fitness of a candidate for judicial office; or\n\n(3) the governor of the s State of Florida for the purpose of evaluating the character and fitness of a nominee to judicial office.\n\nRULE 3-7.3 REVIEW OF INQUIRIES, COMPLAINT PROCESSING, AND INITIAL INVESTIGATORY PROCEDURES\n\n(a) Screening of Inquiries. Prior to opening a disciplinary file, bar counsel shall review the inquiry made and determine whether the alleged conduct, if proven, would constitute a violation of the Rules Regulating The Florida Bar warranting the imposition of discipline. If bar counsel determines that the facts allege a fee dispute which, if proven, would probably not constitute a clear violation under rule 4-1.5 of the Rules Regulating The Florida Bar, bar counsel may, with the consent of the complainant and respondent, refer the matter to the appropriate circuit arbitration committee for arbitration under chapter 14. If bar counsel determines that the facts, if proven, would not constitute a violation of the Rules Regulating The Florida Bar warranting the imposition of discipline, bar counsel may decline to pursue the inquiry. A decision by bar counsel not to pursue an inquiry shall not preclude further action or review under the Rules Regulating The Florida Bar. The complainant and respondent shall be notified of a decision not to pursue an inquiry and shall be given the reasons therefor.\n\n(b) Complaint Processing and Bar Counsel Investigation. If bar counsel decides to pursue an inquiry, a disciplinary file shall be opened and the inquiry shall be considered as a complaint, if the form requirement of subdivision (c) is met. Bar counsel shall investigate the allegations contained in the complaint.\n\n(c) Form for Complaints. All complaints, except those initiated by The Florida Bar, shall be in writing and under oath. The complaint shall contain a statement providing:\n\nUnder penalty of perjury, I declare the foregoing facts are true, correct, and complete.\n\n(d) Dismissal of Disciplinary Cases. Bar counsel may dismiss disciplinary cases if, after complete investigation, bar counsel determines that the facts show that the attorney respondent did not violate the Rules Regulating The Florida Bar. Dismissal by bar counsel shall not preclude further action or review under the Rules Regulating The Florida Bar. Nothing in these rules shall preclude bar counsel from obtaining the concurrence of the grievance committee chair on the dismissal of a case. If a disciplinary case is dismissed, the complainant shall be notified of the dismissal and shall be given the reasons therefor.\n\n(e) Diversion to Practice and Professionalism Enhancement Programs. Bar counsel may recommend diversion of disciplinary cases as provided elsewhere in these rules if, after complete investigation, bar counsel determines that the facts show that the respondent's conduct did not constitute disciplinary violations more severe than minor misconduct.\n\n( e f) Referral to Grievance Committees. Bar counsel may refer disciplinary cases to a grievance committee for its further investigation or action as authorized elsewhere in these rules. Bar counsel may recommend specific action on a case referred to a grievance committee.\n\n( f g) Information Concerning Closed Inquiries and Complaints Dismissed by Staff. When bar counsel does not pursue an inquiry or dismisses a disciplinary case, such action shall be deemed a finding of no probable cause for further disciplinary proceedings and the matter shall become public information.\n\nRULE 3-7.4 GRIEVANCE COMMITTEE PROCEDURES\n\n(a) Notice of Hearing. When notice of a grievance committee hearing is sent to the respondent, such notice shall be accompanied by a list of the grievance committee members.\n\n(b) Complaint Filed W w ith Grievance Committee. A complaint received by a committee direct from a complainant shall be reported to the appropriate branch staff counsel for docketing and assignment of a case number, unless the committee resolves the complaint within 10 days after receipt of the complaint. A written report to branch staff bar counsel shall include the following information: complainant's name and address, respondent's name, date complaint received by committee, copy of complaint letter or summary of the oral complaint made, and the name of the committee member assigned to the investigation. Formal investigation by a grievance committee may proceed after the matter has been referred to staff bar counsel for docketing.\n\n(c) Investigation. A grievance committee is required to consider all charges of misconduct forwarded to the committee by staff counsel whether based upon a written complaint or not.\n\n(d) Conduct of Proceedings. The proceedings of grievance committees may be informal in nature and the committees shall not be bound by the rules of evidence.\n\n(e) No Delay for Civil or Criminal Proceedings. An investigation shall not be deferred or suspended without the approval of the board even though the respondent is made a party to civil litigation or is a defendant or is acquitted in a criminal action, notwithstanding that either of such proceedings involves the subject matter of the investigation.\n\n(f) Counsel and Investigators. Upon request of a grievance committee, staff counsel may appoint a bar counsel or an investigator to assist the committee in an investigation. Staff Bar counsel shall assist each grievance committee in carrying out its investigative and administrative duties and shall prepare status reports for the committee, notify complainants and respondents of committee actions as appropriate, and prepare all reports reflecting committee findings of probable cause, no probable cause, recommended discipline for minor misconduct, and letters of advice after no probable cause findings.\n\n(g) Quorum, Vote. Three members of the committee, 2 of whom must be lawyers, shall constitute a quorum. The grievance committee may consider cases in panels of not fewer than 3 members, 2 of whom must be lawyers. Consideration of matters by a panel of 3 members shall only be conducted upon concurrence of the designated reviewer and the chair of the grievance committee. The 3-member panel shall elect 1 of its lawyer members to preside over the panel's actions. If the chair or vice-chair is a member of a 3-member panel, the chair or vice-chair shall be the presiding officer. All findings of probable cause and recommendations of guilt of minor misconduct shall be made by affirmative vote of a majority of the committee members present, which majority must number at least 2 members. The number of committee members voting for or against the committee report shall be reflected in the transcript. Minority reports may be filed. A lawyer grievance committee member may not vote on the disposition of any matter in which that member served as the investigating member of the committee.\n\n(h) Rights and Responsibilities of the Respondent. The respondent may be required to testify and to produce evidence as any other witness unless the respondent claims a privilege or right properly available to the respondent under applicable federal or state law. The respondent may be accompanied by counsel. At a reasonable time before any finding of probable cause or minor misconduct is made, the respondent shall be advised of the conduct that is being investigated and the rules that may have been violated. The respondent shall be provided with all materials considered by the committee and shall be given an opportunity to make a written statement, sworn or unsworn, explaining, refuting, or admitting the alleged misconduct.\n\n(i) Rights of the Complaining Witness. The complaining witness is not a party to the disciplinary proceeding. Unless it is found to be impractical by the chair of the grievance committee due to unreasonable delay or other good cause, the complainant shall be granted the right to be present at any grievance committee hearing when the respondent is present before the committee. Neither unwillingness nor neglect of the complaining witness to cooperate, nor settlement, compromise, or restitution, will excuse the completion of an investigation. The complaining witness shall have no right to appeal.\n\n(j) No Finding of No Probable Cause.\n\n(1) Authority of Grievance Committee. If a A grievance committee may upon terminate ion of its an investigation does not by finding that no probable cause exists to believe that the respondent has violated these rules. The committee may issue a letter of advice to the respondent in connection with the finding of no probable cause.\n\n(2) Notice of Committee Action. , the committee shall dispose of its file in the manner directed by the board of governors. If the grievance committee has notified the respondent of the investigation, then the committee Bar counsel shall notify the respondent and complainant of the action of the committee. The failure of a grievance committee to find probable cause shall not preclude further proceedings.\n\n(3) Effect of No Probable Cause Finding. A finding of no probable cause by a grievance committee shall not preclude the reopening of the case and further proceedings therein.\n\n(4) Disposition of Committee Files. Upon the termination of the grievance committee's investigation, the committee's file shall be forwarded to bar counsel for disposition in accord with established bar policy.\n\n(k) Letter Reports in No Probable Cause Cases. Upon a finding of no probable cause, bar counsel will submit a letter report of the no probable cause finding to the complainant, presiding member, investigating member, and the respondent, including any documentation deemed appropriate by bar counsel and explaining why the complaint did not warrant further proceedings. Letters of advice issued by a grievance committee in connection with findings of no probable cause shall be signed by the presiding member of the committee. Letter reports and letters of advice shall not constitute a disciplinary sanction.\n\n(kl) Preparation, Forwarding, and Review of Grievance Committee Complaints. If a grievance committee finds probable cause, the bar counsel assigned to the committee shall promptly prepare a record of its investigation and a formal complaint. The record before the committee shall consist of all reports, correspondence, papers, and/or recordings furnished to or received from the respondent, and the transcript of grievance committee meetings or hearings, if the proceedings were attended by a court reporter; provided, however, that the committee may retire into private session to debate the issues involved and to reach a decision as to the action to be taken. The formal complaint shall be signed by the member of the committee who presided in the proceeding. The formal complaint shall be in such form as shall be prescribed by the board. If the presiding member of the grievance committee disagrees with the form of the complaint, the presiding member may direct bar counsel to make changes accordingly. If bar counsel does not agree with the changes, the matter shall be referred to the designated reviewer of the committee for appropriate action. When a formal complaint by a grievance committee is not referred to the designated reviewer, or returned to the grievance committee for further action, the formal complaint shall be promptly forwarded to and reviewed by bar headquarters staff counsel who shall file the formal complaint, and furnish a copy of the formal complaint to the respondent. A copy of the record shall be made available to the respondent at the respondent's expense.\n\n(l) Letter Reports in No Probable Cause Cases. Upon a finding of no probable cause, bar counsel will submit a report of the no probable cause finding to the complainant, presiding member, investigating member, and the respondent including any documentation deemed appropriate by bar counsel and explaining why the complaint did not warrant further proceedings. Letters of advice issued by a grievance committee in connection with findings of no probable cause shall be signed by the presiding member of the committee. Letter reports and letters of advice shall not constitute a disciplinary record.\n\n(m) Recommendation of Admonishment for Minor Misconduct. If the committee recommends an admonishment for minor misconduct, the grievance committee report shall be drafted by bar counsel and signed by the presiding member. The committee report need only include: (1) the committee's recommendations regarding the admonishment, designation withdrawal, and conditions of redesignation; (2) the committee's recommendation as to the method of administration of the admonishment; (3) a summary of any additional charges that will be dismissed if the admonishment is approved; (4) any comment on mitigating, aggravating, or evidentiary matters that the committee believes will be helpful to the board in passing upon the admonishment recommendation; and (5) an admission of minor misconduct signed by the respondent, if the respondent has admitted guilt to minor misconduct. No record need be submitted with such a report. After the presiding member signs the grievance committee report, the report shall be returned to bar counsel. The report recommending an admonishment shall be forwarded to staff counsel and the designated reviewer for review. If staff counsel does not return the report to the grievance committee to remedy a defect therein, or if the designated reviewer does not present the same to the disciplinary review committee for action by the board, the report shall then be served on the respondent by bar counsel.\n\n(n) Rejection of Admonishment. The order of admonishment shall become final unless rejected by the respondent within 15 days after service upon the respondent. If rejected by the respondent, the report shall be referred to bar counsel and referee for trial on complaint of minor misconduct to be prepared by bar counsel as in the case of a finding of probable cause.\n\n(o) Recommendation of Diversion to Remedial Programs. A grievance committee may recommend, as an alternative to issuing a finding of minor misconduct or no probable cause with a letter of advice, diversion of the disciplinary case to a practice and professionalism enhancement program as provided elsewhere in these rules. A respondent may reject the diversion recommendation in the same manner as provided in the rules applicable to rejection of findings of minor misconduct. In the event that a respondent rejects a recommendation of diversion, the matter shall be returned to the committee for further proceedings.\n\n( o p) Appointment of Bar Counsel. When a grievance committee formal complaint is not referred to the disciplinary review committee, or returned to the grievance committee, staff counsel of The Florida Bar headquarters in Tallahassee may appoint bar counsel unless bar counsel has been appointed, sign the complaint and file the same in the Supreme Court of Florida, serve a copy on the respondent, and request the Supreme Court of Florida to assign a referee to try the cause. If probable cause is found by the board, staff bar counsel will prepare the formal complaint.\n\nRULE 3-7.6 PROCEDURES BEFORE A REFEREE\n\n(a) Referees. The chief justice shall have the power to appoint referees to try disciplinary cases and to delegate to a chief judge of a judicial circuit the power to appoint referees for duty in the chief judge's circuit. Such appointees shall ordinarily be active county or circuit judges, but the chief justice may appoint retired judges.\n\n(b) Trial by Referee. When a finding has been made by a grievance committee or by the board that there is cause to believe that a member of The Florida Bar is guilty of misconduct justifying disciplinary action, and the formal complaint based on such finding of probable cause has been assigned by the chief justice for trial before a referee, the proceeding thereafter shall be an adversary proceeding that shall be conducted as hereinafter set forth.\n\n(c) Venue. The trial shall be held in the county in which an alleged offense occurred or in the county where the respondent resides or practices law or last practiced law in Florida, whichever shall be designated by the Supreme Court of Florida; provided, however, that if the respondent is not a resident of Florida and if the alleged offense is not committed in Florida, the trial shall be held in a county designated by the chief justice.\n\n(d) Style of Proceedings. All proceedings instituted by The Florida Bar shall be styled \"The Florida Bar, Complainant, v. (name of respondent), Respondent,\" and \"In The Supreme Court of Florida (Before a Referee).\"\n\n(e) Nature of Proceedings.\n\n(1) Administrative in Character. A disciplinary proceeding is neither civil nor criminal but is a quasi-judicial administrative proceeding. The Florida Rules of Civil Procedure apply except as otherwise provided in this rule.\n\n(2) Discovery. Discovery shall be available to the parties in accordance with the Florida Rules of Civil Procedure.\n\n(f) Bar Counsel. Bar counsel shall make such investigation as is necessary and shall prepare and prosecute with utmost diligence any case assigned. Assistant bar counsel shall serve under the general supervision of bar counsel.\n\n(g) Pleadings. Pleadings may be informal and shall comply with the following requirements:\n\n(1) Complaint; Consolidation and Severance.\n\n(A) Filing. Staff counsel shall prepare the complaint and file the same in the Supreme Court of Florida.\n\n(B) Content. The complaint shall set forth the particular act or acts of conduct for which the attorney is sought to be disciplined.\n\n(C) Joinder of Charges and Respondents; Severance. A complaint may embrace any number of charges against one or more respondents, and charges may be against any one or any number of respondents; but a severance may be granted by the referee when the ends of justice require it.\n\n(2) Answer and Motion. The respondent shall answer the complaint and, as a part thereof or by separate motion, may challenge only the sufficiency of the complaint and the jurisdiction of the forum. All other defenses shall be incorporated in the respondent's answer. The answer may invoke any proper privilege, immunity, or disability available to the respondent. All pleadings of the respondent must be filed within 20 days of service of a copy of the complaint.\n\n(3) Reply. If the respondent's answer shall contain any new matter or affirmative defense, a reply thereto may be filed within 10 days of the date of service of a copy upon bar counsel, but failure to file such a reply shall not prejudice The Florida Bar. All affirmative allegations in the respondent's answer shall be considered as denied by The Florida Bar.\n\n(4) Disposition of Motions. Hearings upon motions may be deferred until the final hearing, and, whenever heard, rulings thereon may be reserved until termination of the final hearing.\n\n(5) Filing and Service of Pleadings.\n\n(A) Prior to Appointment of Referee. Any pleadings filed in a case prior to appointment of a referee shall be filed with the Supreme Court of Florida and shall bear a certificate of service showing parties upon whom service of copies has been made. On appointment of referee, the Supreme Court of Florida shall notify the parties of such appointment and forward all pleadings filed with the court to the referee for action.\n\n(B) After Appointment of Referee. All pleadings, motions, notices, and orders filed after appointment of a referee shall be filed with the referee and shall bear a certificate of service showing service of a copy on the staff counsel of The Florida Bar and on all interested parties to the proceedings.\n\n(6) Amendment. Pleadings may be amended by order of the referee, and a reasonable time shall be given within which to respond thereto.\n\n(7) Expediting the Trial. If it shall be made to appear that the date of final hearing should be expedited in the public interest, the referee may, in the referee's discretion, shorten the time for filing pleadings and the notice requirements as provided in this rule.\n\n(8) Disqualification of Referee. Upon motion of either party, a referee may be disqualified from service in the same manner and to the same extent that a trial judge may be disqualified under existing law from acting in a judicial capacity. In the event of disqualification, the chief justice shall appoint a successor.\n\n(h) Notice of Final Hearing. The cause may be set down for trial by either party or the referee upon not less than 10 days' notice. The trial shall be held as soon as possible following the expiration of 10 days from the filing of the respondent's answer, or if no answer is filed, then from the date when such answer is due.\n\n(i) The Respondent. Unless the respondent claims a privilege or right properly available under applicable federal or state law, the respondent may be called as a witness by The Florida Bar to make specific and complete disclosure of all matters material to the issues. When the respondent is subpoenaed to appear and give testimony or to produce books, papers, or documents and refuses to answer or to produce such books, papers, or documents, or, having been duly sworn to testify, refuses to answer any proper question, the respondent may be cited for contempt of the court.\n\n(j) Complaining Witness. The complaining witness shall have no rights other than those of any other witness; the complaining witness has no right to be present during a hearing or trial but may be called upon to testify and produce evidence as any other witness. Neither unwillingness nor neglect of the complaining witness to cooperate, nor settlement, compromise, or restitution will excuse failure to complete any trial.\n\n(k) Referee's Report.\n\n(1) Contents of Report. Within 30 days after the conclusion of a trial before a referee or 10 days after the referee receives the transcripts of all hearings, whichever is later, or within such extended period of time as may be allowed by the chief justice for good cause shown, the referee shall make a report and enter it as part of the record, but failure to enter the report in the time prescribed shall not deprive the referee of jurisdiction. The referee's report shall include:\n\n(A) a finding of fact as to each item of misconduct of which the respondent is charged, which findings of fact shall enjoy the same presumption of correctness as the judgment of the trier of fact in a civil proceeding;\n\n(B) recommendations as to whether the respondent should be found guilty of misconduct justifying disciplinary measures;\n\n(C) recommendations as to the disciplinary measures to be applied;\n\n(D) a statement of any past disciplinary measures as to the respondent that are on record with the executive director of The Florida Bar or that otherwise become known to the referee through evidence properly admitted by the referee during the course of the proceedings (after a finding of guilt, all evidence of prior disciplinary measures may be offered by bar counsel subject to appropriate objection or explanation by respondent); and\n\n(E) a statement of costs incurred by The Florida Bar and recommendations as to the manner in which such costs should be taxed. The costs of the proceedings shall include investigative costs, including travel and out-of-pocket expenses, court reporters' fees, copy costs, witness and traveling expenses, and reasonable traveling and out-of-pocket expenses of the referee and bar counsel, if any. Costs shall also include a $500 charge for administrative costs. Costs taxed shall be payable to The Florida Bar.\n\n(2) Filing. The referee's report and record of proceedings shall in all cases be transmitted together to the Supreme Court of Florida. Copies of the report shall be served on the parties including the staff counsel of The Florida Bar. The referee shall serve a copy of the record on staff counsel with the report. Staff counsel will make a copy of the record, as furnished, available to other parties on request and payment of the actual costs of reproduction.\n\n(l) The Record.\n\n(1) Reporting of Testimony. All hearings at which testimony is presented shall be reported and the transcript of the testimony shall be filed in the cause.\n\n(2) Contents. The record shall include all items properly filed in the cause including pleadings, transcript of testimony, exhibits in evidence, and the report of the referee.\n\n(m) Plea of Guilty by Respondent. At any time during the progress of disciplinary proceedings, a respondent may tender a plea of guilty.\n\n(1) Before Filing of Complaint. If the plea is tendered before filing of a complaint by staff counsel, such plea shall be tendered in writing to the grievance committee.\n\n(2) After Filing of Complaint. If the complaint has been filed against the respondent, the respondent may enter a plea of guilty thereto by filing the same in writing with the referee to whom the cause has been assigned for trial. Such referee shall take such testimony thereto as may be advised, following which the referee will enter a report as otherwise provided.\n\n(3) Unconditional. An unconditional plea of guilty shall not preclude review as to disciplinary measures imposed.\n\n(4) Procedure. Except as herein provided, all procedure in relation to disposition of the cause on pleas of guilty shall be as elsewhere provided in these rules.\n\n(n) Cost of Review or Reproduction.\n\n(1) The actual cost of reproduction, when photocopying or other reproduction is performed by the bar, for the purposes of these rules is determined by the board to be $1 per page. In addition to reproduction charges, the bar may charge a reasonable fee incident to a request to review disciplinary records or for research into the records of disciplinary proceedings and identification of documents to be reproduced.\n\n(2) When the bar is requested to reproduce documents that are voluminous or is requested to produce transcripts in the possession of the bar, the bar may decline to reproduce the documents in the offices of the bar and shall inform the requesting person of the following options:\n\n(A) purchase of the transcripts from the court reporter service that produced them;\n\n(B) purchase of the documents from the third party from whom the bar received them; or\n\n(C) designation of a commercial photocopy service to whom the bar shall deliver the original documents to be copied, at the requesting party's expense, provided the photocopy service agrees to preserve and return the original documents and not to release them to any person without the bar's consent.\n\n(o) Costs.\n\n(1) Taxable Costs. Taxable costs of the proceedings shall include only:\n\n(A) investigative costs, including travel and out-of-pocket expenses;\n\n(B) court reporters' fees;\n\n(C) copy costs;\n\n(D) telephone charges;\n\n(E) fees for translation services;\n\n(F) witness expenses, including travel and out-of-pocket expenses;\n\n(G) travel and out-of-pocket expenses of the referee;\n\n(H) travel and out-of-pocket expenses of counsel in the proceedings, including of the respondent if acting as counsel; and\n\n(I) an administrative fee in the amount of $750 when costs are assessed in favor of the bar.\n\n(2) Discretion of Referee. The referee shall have discretion to award costs and absent an abuse of discretion the referee's award shall not be reversed.\n\n(3) Assessment of Bar Costs. When the bar is successful, in whole or in part, the referee may assess the bar's costs against the respondent unless it is shown that the costs of the bar were unnecessary, excessive, or improperly authenticated.\n\n(4) Assessment of Respondent's Costs. When the bar is unsuccessful in the prosecution of a particular matter, the referee may assess the respondent's costs against the bar in the event that there was no justiciable issue of either law or fact raised by the bar.\n\nRULE 3-7.10 REINSTATEMENT AND READMISSION PROCEDURES\n\n(a) Readmission. A former member who has been disbarred or whose petition for disciplinary resignation has been accepted, pursuant to rule 3-7.12, may be admitted again only upon full compliance with the rules and regulations governing admission to the bar. Except as might be otherwise provided in these rules, no application for admission may be tendered within 5 years after the date of disbarrment or such longer period as the court might determine in the disbarrment order.\n\n(b) Reinstatement. An attorney who has been suspended may be reinstated to membership in The Florida Bar pursuant to this rule. The proceedings under this rule are not applicable to suspension for nonpayment of dues.\n\n(c) Petitions; Form and Contents.\n\n(1) Filing. The original petition for reinstatement and 3 copies thereof shall be in writing, verified by the petitioner, and addressed to and filed with the Supreme Court of Florida. A copy shall be served on The Florida Bar in Tallahassee.\n\n(2) Form and Exhibits. The petition shall be in such form and shall be accompanied by such exhibits as provided for in rule 3-7.10(n)(1) and (2). The information required concerning the petitioner may include any or all of the following matters in addition to such other matters as may be reasonably required to determine the fitness of the petitioner to resume the practice of law: criminal and civil judgments, disciplinary judgments, copies of income tax returns together with consents to secure original returns, occupation during suspension and information in connection therewith, financial statements, and statement of restitution of funds that were the subject matter of disciplinary proceedings.\n\n(d) Deposit for Cost. The petition shall be accompanied by proof of a deposit paid to The Florida Bar in such amount as the board of governors shall prescribe to ensure payment of reasonable costs of the proceedings, as provided for in rule 3-7.10(o). Such costs in the discretion of the board of governors may include court reporters' fees, witness fees and traveling expenses, and reasonable traveling expenses and out-of-pocket costs of the referee and attorneys for The Florida Bar.\n\n(e) Reference of Petition for Hearing. The chief justice shall refer the petition for reinstatement to a referee for hearing; provided, however, that no such reference shall be made until evidence is submitted showing that all costs assessed against the petitioner in all disciplinary proceedings have been paid and restitution has been made.\n\n(f) Attorney for the Bar. When a petition for reinstatement is filed, the board of governors or staff counsel, if authorized by the board of governors, may appoint, from the members in good standing of The Florida Bar designated by the staff counsel to serve as bar counsel, one or more attorneys to represent The Florida Bar in the proceeding. The duties of such attorneys shall be to appear at the hearings and to prepare and present to the referee evidence that, in the opinion of the referee or such attorneys, should be considered in passing upon the petition.\n\n(g) Determination of Fitness by Referee Hearing. The referee to whom the petition for reinstatement is referred shall conduct the hearing as a trial, in the same manner, to the extent practical, as proceedings are conducted under the rule concerning trials. The matter to decide shall be the fitness of the petitioner to resume the practice of law.\n\n(h) Hearing; Notice; Evidence.\n\n(1) Notice. The referee to whom the petition for reinstatement is referred shall fix a time and place for hearing, and notice thereof shall be given at least 10 days prior to the hearing to the petitioner, to attorneys representing The Florida Bar, and to such other persons as may be designated by the referee to whom the petition is referred.\n\n(2) Appearance. Any persons to whom notice is given, any other interested persons, or any local bar association may appear before the referee in support of or in opposition to the petition at any time or times fixed for hearings thereon.\n\n(3) Failure of Petitioner to be Examined. For the failure of the petitioner to submit to examination as a witness pursuant to notice given, the referee shall dismiss the petition for reinstatement unless good cause is shown for such failure.\n\n(i) Prompt Hearing; Report. The referee to whom a petition for reinstatement has been referred by the chief justice shall proceed to a prompt hearing, at the conclusion of which the referee shall make and file with the Supreme Court of Florida a report that shall include the findings of fact and a recommendation as to whether the petitioner is qualified to resume the practice of law. Such report shall be in the form prescribed by the board. The referee shall file the report and record in the Supreme Court of Florida and shall serve a copy of the report and record on staff counsel and a copy of the report only on all other parties. Staff counsel shall make a copy of the record, as furnished, available to other parties upon request and payment of actual costs of reproduction.\n\n(j) Review. Review of referee reports in reinstatement proceedings shall be in accordance with rule 3-7.7.\n\n(k) Judgment. If the petitioner is found unfit to resume the practice of law, the petition shall be dismissed. If the petitioner is found fit to resume the practice of law, the judgment shall reinstate the petitioner in The Florida Bar; provided, however, that the judgment may make such reinstatement conditional upon the payment of all or part of the costs of the proceeding and upon the making of partial or complete restitution to parties harmed by the petitioner's misconduct that led to the petitioner's suspension of membership in The Florida Bar; and further provided, however, if suspension of the petitioner has continued for more than 3 years, the reinstatement may be conditioned upon the furnishing of such proof of competency as may be required by the judgment in the discretion of the Supreme Court of Florida, which proof may include certification by the Florida Board of Bar Examiners of the successful completion of an examination for admission to The Florida Bar subsequent to the date of the suspension.\n\n(l) Successive Petitions. No petition for reinstatement shall be filed within 1 year following an adverse judgment upon a petition for reinstatement filed by or on behalf of the same person.\n\n(m) Readmission After Disciplinary Resignation. In the case of a disciplinary resignation, no readmission application may be filed until 3 years after the date of the order of the Supreme Court of Florida that accepted such disciplinary resignation or such additional time as the attorney may have stated in a petition for disciplinary resignation. No application for readmission may be filed until all costs in disciplinary cases that were dismissed because of the disciplinary resignation have been paid by the applicant for readmission. If an attorney's petition for disciplinary resignation states that it is without leave to apply for readmission, such condition shall preclude any readmission.\n\n(n) Petitions for Reinstatement to Membership in Good Standing.\n\n(1) Availability. Petitions for reinstatement under this rule are available to suspended members of the bar when the disciplinary judgment conditions their reinstatement upon a showing of compliance with specified conditions.\n\n(2) Style of Petition. Petitions shall be styled in the Supreme Court of Florida and filed with the Supreme Court of Florida in quadruplicate, with a copy served on staff counsel and The Florida Bar in Tallahassee.\n\n(3) Contents of Petition. The petition shall be verified by the petitioner and shall be accompanied by a written authorization to the District Director of the Internal Revenue Service, authorizing the furnishing of certified copies of the petitioner's tax returns for the past 5 years or since admission to the bar, whichever is greater. The authorization shall be furnished on a separate sheet. The petition shall have attached as an exhibit a true copy of all disciplinary judgments previously entered against the petitioner. It shall also include the petitioner's statement concerning the following:\n\n(A) name, age, residence, address, and number and relation of dependents of the petitioner;\n\n(B) the offense or misconduct upon which the suspension was based, together with the date of such suspension;\n\n(C) the names and addresses of all complaining witnesses in any disciplinary proceedings that resulted in suspension; and the name and address of the referee or judge who heard such disciplinary proceedings or of the trial judge, complaining witnesses, and prosecuting attorney, if suspension was based upon conviction of a felony or misdemeanor involving moral turpitude;\n\n(D) the nature of the petitioner's occupation in detail since suspension, with names and addresses of all partners, associates in business, and employers, if any, and dates and duration of all such relations and employments;\n\n(E) a statement showing the approximate monthly earnings and other income of the petitioner and the sources from which all such earnings and income were derived during said period;\n\n(F) a statement showing all residences maintained during said period, with names and addresses of landlords, if any;\n\n(G) a statement showing all financial obligations of the petitioner including but not limited to amounts claimed, unpaid, or owing to the Florida Bar Clients' Security Fund or former clients at the date of filing of the petition, together with the names and addresses of all creditors;\n\n(H) a statement of restitution made for any and all obligations to all former clients and the Florida Bar Clients' Security Fund and the source and amount of funds used for this purpose;\n\n(I) a statement showing dates, general nature, and ultimate disposition of every matter involving the arrest or prosecution of the petitioner during said period for any crime, whether felony or misdemeanor, together with the names and addresses of complaining witnesses, prosecuting attorneys, and trial judges;\n\n(J) a statement as to whether any applications were made during said period for a license requiring proof of good character for its procurement; and, as to each such application, the date and the name and address of the authority to whom it was addressed and the disposition thereof;\n\n(K) a statement of any procedure or inquiry, during said period, covering the petitioner's standing as a member of any profession or organization, or holder of any license or office, that involved the censure, removal, suspension, revocation of license, or discipline of the petitioner; and, as to each, the dates, facts, and the disposition thereof and the name and address of the authority in possession of the record thereof;\n\n(L) a statement as to whether any charges of fraud were made or claimed against the petitioner during said period, whether formal or informal, together with the dates and names and addresses of persons making such charges;\n\n(M) a concise statement of facts claimed to justify reinstatement to The Florida Bar;\n\n(N) a statement showing the dates, general nature, and final disposition of every civil action wherein the petitioner was either a party plaintiff or defendant, together with dates of filing of complaints, titles of courts and causes, and the names and addresses of all parties and of the trial judge or judges, and names and addresses of all witnesses who testified in said action or actions; and\n\n(O) a statement showing what amounts, if any, of the costs assessed against the accused attorney in the prior disciplinary proceedings against the petitioner have been paid by the petitioner and the source and amount of funds used for this purpose.\n\n(4) Comments on Petition. Upon the appointment of a referee and bar counsel, copies of the petition shall be furnished by the executive director to local board members, local grievance committees, and to such other persons as are mentioned in this rule. Persons will be asked to direct their comments to bar counsel. The proceedings and finding of the referee shall relate to those matters described in this rule and also to those matters tending to show the petitioner's rehabilitation, present fitness to resume the practice of law, and the effect of such proposed reinstatement upon the administration of justice and purity of the courts and confidence of the public in the profession.\n\n(5) Costs Deposit. The petition shall be accompanied by a deposit for costs of $500.\n\n(o) Costs.\n\n(1) Taxable Costs. Taxable costs of the proceedings shall include only:\n\n(A) investigative costs, including travel and out-of-pocket expenses;\n\n(B) court reporters' fees;\n\n(C) copy costs;\n\n(D) telephone charges;\n\n(E) fees for translation services;\n\n(F) witness expenses, including travel and out-of-pocket expenses;\n\n(G) travel and out-of-pocket expenses of the referee;\n\n(H) travel and out-of-pocket expenses of counsel in the proceedings, including of the petitioner if acting as counsel; and\n\n(I) an administrative fee in the amount of $750 when costs are assessed in favor of the bar.\n\n(2) Discretion of Referee. The referee shall have discretion to award costs and absent an abuse of discretion the referee's award shall not be reversed.\n\n(3) Assessment of Bar Costs. The referee may assess the bar's costs related to the proceeding against the petitioner unless it is shown that the costs of the bar were unnecessary, excessive, or improperly authenticated.\n\n(4) Assessment of Petitioner's Costs. When the bar unsuccessfully opposes a petition for reinstatement or readmission, the referee may assess the petitioner's costs against the bar in the event that there was no justiciable issue of either law or fact raised by the bar. RULE 4-1.5 FEES FOR LEGAL SERVICES\n\n(a) Illegal, Prohibited, or Clearly Excessive Fees. An attorney shall not enter into an agreement for, charge, or collect an illegal, prohibited, or clearly excessive fee or a fee generated by employment that was obtained through advertising or solicitation not in compliance with the Rules Regulating The Florida Bar. A fee is clearly excessive when:\n\n(1) after a review of the facts, a lawyer of ordinary prudence would be left with a definite and firm conviction that the fee exceeds a reasonable fee for services provided to such a degree as to constitute clear overreaching or an unconscionable demand by the attorney; or\n\n(2) the fee is sought or secured by the attorney by means of intentional misrepresentation or fraud upon the client, a non-client party, or any court, as to either entitlement to, or amount of, the fee.\n\n(b) Factors to Be Considered in Determining Reasonable Fee. Factors to be considered as guides in determining a reasonable fee include:\n\n(1) the time and labor required, the novelty, complexity, and difficulty of the questions involved, and the skill requisite to perform the legal service properly;\n\n(2) the likelihood that the acceptance of the particular employment will preclude other employment by the lawyer;\n\n(3) the fee, or rate of fee, customarily charged in the locality for legal services of a comparable or similar nature;\n\n(4) the significance of, or amount involved in, the subject matter of the representation, the responsibility involved in the representation, and the results obtained;\n\n(5) the time limitations imposed by the client or by the circumstances and, as between attorney and client, any additional or special time demands or requests of the attorney by the client;\n\n(6) the nature and length of the professional relationship with the client;\n\n(7) the experience, reputation, diligence, and ability of the lawyer or lawyers performing the service and the skill, expertise, or efficiency of effort reflected in the actual providing of such services; and\n\n(8) whether the fee is fixed or contingent, and, if fixed as to amount or rate, then whether the client's ability to pay rested to any significant degree on the outcome of the representation.\n\n(c) Consideration of All Factors. In determining a reasonable fee, the time devoted to the representation and customary rate of fee need not be the sole or controlling factors. All factors set forth in this rule should be considered, and may be applied, in justification of a fee higher or lower than that which would result from application of only the time and rate factors.\n\n(d) Enforceability of Fee Contracts. Contracts or agreements for attorney's fees between attorney and client will ordinarily be enforceable according to the terms of such contracts or agreements, unless found to be illegal, obtained through advertising or solicitation not in compliance with the Rules Regulating The Florida Bar, prohibited by this rule, or clearly excessive as defined by this rule.\n\n(e) Duty to Communicate Basis or Rate of Fee to Client. When the lawyer has not regularly represented the client, the basis or rate of the fee shall be communicated to the client, preferably in writing, before or within a reasonable time after commencing the representation.\n\n(f) Contingent Fees. As to contingent fees:\n\n(1) A fee may be contingent on the outcome of the matter for which the service is rendered, except in a matter in which a contingent fee is prohibited by paragraph (f)(3) or by law. A contingent fee agreement shall be in writing and shall state the method by which the fee is to be determined, including the percentage or percentages that shall accrue to the lawyer in the event of settlement, trial, or appeal, litigation and other expenses to be deducted from the recovery, and whether such expenses are to be deducted before or after the contingent fee is calculated. Upon conclusion of a contingent fee matter, the lawyer shall provide the client with a written statement stating the outcome of the matter and, if there is a recovery, showing the remittance to the client and the method of its determination.\n\n(2) Every lawyer who accepts a retainer or enters into an agreement, express or implied, for compensation for services rendered or to be rendered in any action, claim, or proceeding whereby the lawyer's compensation is to be dependent or contingent in whole or in part upon the successful prosecution or settlement thereof shall do so only where such fee arrangement is reduced to a written contract, signed by the client, and by a lawyer for the lawyer or for the law firm representing the client. No lawyer or firm may participate in the fee without the consent of the client in writing. Each participating lawyer or law firm shall sign the contract with the client and shall agree to assume joint legal responsibility to the client for the performance of the services in question as if each were partners of the other lawyer or law firm involved. The client shall be furnished with a copy of the signed contract and any subsequent notices or consents. All provisions of this rule shall apply to such fee contracts.\n\n(3) A lawyer shall not enter into an arrangement for, charge, or collect:\n\n(A) any fee in a domestic relations matter, the payment or amount of which is contingent upon the securing of a divorce or upon the amount of alimony or support, or property settlement in lieu thereof; or\n\n(B) a contingent fee for representing a defendant in a criminal case.\n\n(4) A lawyer who enters into an arrangement for, charges, or collects any fee in an action or claim for personal injury or for property damages or for death or loss of services resulting from personal injuries based upon tortious conduct of another, including products liability claims, whereby the compensation is to be dependent or contingent in whole or in part upon the successful prosecution or settlement thereof shall do so only under the following requirements:\n\n(A) The contract shall contain the following provisions:\n\n(i) \"The undersigned client has, before signing this contract, received and read the statement of client's rights and understands each of the rights set forth therein. The undersigned client has signed the statement and received a signed copy to refer to while being represented by the undersigned attorney(s).\"\n\n(ii) \"This contract may be cancelled by written notification to the attorney at any time within 3 business days of the date the contract was signed, as shown below, and if cancelled the client shall not be obligated to pay any fees to the attorney for the work performed during that time. If the attorney has advanced funds to others in representation of the client, the attorney is entitled to be reimbursed for such amounts as the attorney has reasonably advanced on behalf of the client.\"\n\n(B) The contract for representation of a client in a matter set forth in subdivision (f)(4) may provide for a contingent fee arrangement as agreed upon by the client and the lawyer, except as limited by the following provisions:\n\n(i) Without prior court approval as specified below, any contingent fee that exceeds the following standards shall be presumed, unless rebutted, to be clearly excessive:\n\na. Through the time of filing of an answer or the demand for appointment of arbitrators - 33-1/3% of any recovery up to $1 million.\n\nb. From the time of filing an answer or the demand for appointment of arbitrators through the entry of judgment.\n\n1. 40% of any recovery up to $1 million; plus\n\n2. 30% of any portion of the recovery between $1 and $2 million; plus\n\n3. 20% of any portion of the recovery exceeding $2 million , .\n\nc. If all defendants admit liability at the time of filing their answers and request a trial only on damages:\n\n1. 33-1/3% of any recovery up to $1 million; plus\n\n2. 20% of any portion of the recovery between $1 and $2 million; plus\n\n3. 15% of any portion of the recovery for any amount exceeding $2 million.\n\nd. An additional 5% of any recovery after notice of appeal is filed or post-judgment relief or action is required for recovery on the judgment.\n\n(ii) If any client is unable to obtain an attorney of the client's choice because of the limitations set forth in (f)(4)(B)(i), the client may petition the circuit court for approval of any fee contract between the client and an attorney of the client's choosing. Such authorization shall be given if the court determines the client has a complete understanding of the client's rights and the terms of the proposed contract. The application for authorization of such a contract can be filed as a separate proceeding before suit or simultaneously with the filing of a complaint. Proceedings thereon may occur before service on the defendant and this aspect of the file may be sealed. Authorization of such a contract shall not bar subsequent inquiry as to whether the fee actually claimed or charged is clearly excessive under subdivisions (a) and (b).\n\n(iii) In cases where the client is to receive a recovery that will be paid to the client on a future structured or periodic basis, the contingent fee percentage shall only be calculated on the cost of the structured verdict or settlement or, if the cost is unknown, on the present money value of the structured verdict or settlement, whichever is less. If the damages and the fee are to be paid out over the long term future schedule, then this limitation does not apply. No attorney may separately negotiate with the defendant for that attorney's fee in a structured verdict or settlement where such separate negotiations would place the attorney in a position of conflict.\n\n(C) Before a lawyer enters into a contingent fee contract for representation of a client in a matter set forth in this rule, the lawyer shall provide the client with a copy of the statement of client's rights and shall afford the client a full and complete opportunity to understand each of the rights as set forth therein. A copy of the statement, signed by both the client and the lawyer, shall be given to the client to retain and the lawyer shall keep a copy in the client's file. The statement shall be retained by the lawyer with the written fee contract and closing statement under the same conditions and requirements as subdivision (f)(5).\n\n(D) As to lawyers not in the same firm, a division of any fee within subdivision (f)(4) shall be on the following basis:\n\n(i) To the lawyer assuming primary responsibility for the legal services on behalf of the client, a minimum of 75% of the total fee.\n\n(ii) To the lawyer assuming secondary responsibility for the legal services on behalf of the client, a maximum of 25% of the total fee. Any fee in excess of 25% shall be presumed to be clearly excessive.\n\n(iii) The 25% limitation shall not apply to those cases in which 2 or more lawyers or firms accept substantially equal active participation in the providing of legal services. In such circumstances counsel shall apply for circuit court authorization of the fee division in excess of 25%, based upon a sworn petition signed by all counsel that shall disclose in detail those services to be performed. The application for authorization of such a contract may be filed as a separate proceeding before suit or simultaneously with the filing of a complaint. Proceedings thereon may occur before service of process on any party and this aspect of the file may be sealed. Authorization of such contract shall not bar subsequent inquiry as to whether the fee actually claimed or charged is clearly excessive. An application under this subdivision shall contain a certificate showing service on the client and The Florida Bar. Counsel may proceed with representation of the client pending court approval.\n\n(iv) The percentages required by this subdivision shall be applicable after deduction of any fee payable to separate counsel retained especially for appellate purposes.\n\n(5) In the event there is a recovery, upon the conclusion of the representation, the lawyer shall prepare a closing statement reflecting an itemization of all costs and expenses, together with the amount of fee received by each participating lawyer or law firm. A copy of the closing statement shall be executed by all participating lawyers, as well as the client, and each shall receive a copy. Each participating lawyer shall retain a copy of the written fee contract and closing statement for 6 years after execution of the closing statement. Any contingent fee contract and closing statement shall be available for inspection at reasonable times by the client, by any other person upon judicial order, or by the appropriate disciplinary agency.\n\n(g) Division of Fees Between Lawyers in Different Firms. Subject to the provisions of subdivision (f)(4)(D), a division of fee between lawyers who are not in the same firm may be made only if the total fee is reasonable and:\n\n(1) the division is in proportion to the services performed by each lawyer; or\n\n(2) by written agreement with the client:\n\n(A) each lawyer assumes joint legal responsibility for the representation and agrees to be available for consultation with the client; and\n\n(B) the agreement fully discloses that a division of fees will be made and the basis upon which the division of fees will be made.\n\n(h) Credit Plans. Charges made by any lawyer or law firm under an approved credit plan shall be only for services actually rendered or cash actually paid on behalf of the client. No higher fee shall be charged and no additional charge shall be imposed by reason of a lawyer's or law firm's participation in an approved credit plan.\n\nSTATEMENT OF CLIENT'S RIGHTS FOR CONTINGENCY FEES\n\nBefore you, the prospective client, arrange a contingent fee agreement with a lawyer, you should understand this statement of your rights as a client. This statement is not a part of the actual contract between you and your lawyer, but, as a prospective client, you should be aware of these rights:\n\n1. There is no legal requirement that a lawyer charge a client a set fee or a percentage of money recovered in a case. You, the client, have the right to talk with your lawyer about the proposed fee and to bargain about the rate or percentage as in any other contract. If you do not reach an agreement with one lawyer you may talk with other lawyers.\n\n2. Any contingent fee contract must be in writing and you have 3 business days to reconsider the contract. You may cancel the contract without any reason if you notify your lawyer in writing within 3 business days of signing the contract. If you withdraw from the contract within the first 3 business days, you do not owe the lawyer a fee although you may be responsible for the lawyer's actual costs during that time. If your lawyer begins to represent you, your lawyer may not withdraw from the case without giving you notice, delivering necessary papers to you, and allowing you time to employ another lawyer. Often, your lawyer must obtain court approval before withdrawing from a case. If you discharge your lawyer without good cause after the 3-day period, you may have to pay a fee for work the lawyer has done.\n\n3. Before hiring a lawyer, you, the client, have the right to know about the lawyer's education, training, and experience. If you ask, the lawyer should tell you specifically about the lawyer's actual experience dealing with cases similar to yours. If you ask, the lawyer should provide information about special training or knowledge and give you this information in writing if you request it.\n\n4. Before signing a contingent fee contract with you, a lawyer must advise you whether the lawyer intends to handle your case alone or whether other lawyers will be helping with the case. If your lawyer intends to refer the case to other lawyers, the lawyer should tell you what kind of fee sharing arrangement will be made with the other lawyers. If lawyers from different law firms will represent you, at least 1 lawyer from each law firm must sign the contingent fee contract.\n\n5. If your lawyer intends to refer your case to another lawyer or counsel with other lawyers, your lawyer should tell you about that at the beginning. If your lawyer takes the case and later decides to refer it to another lawyer or to associate with other lawyers, you should sign a new contract that includes the new lawyers. You, the client, also have the right to consult with each lawyer working on your case and each lawyer is legally responsible to represent your interests and is legally responsible for the acts of the other lawyers involved in the case.\n\n6. You, the client, have the right to know in advance how you will need to pay the expenses and the legal fees at the end of the case. If you pay a deposit in advance for costs, you may ask reasonable questions about how the money will be or has been spent and how much of it remains unspent. Your lawyer should give a reasonable estimate about future necessary costs. If your lawyer agrees to lend or advance you money to prepare or research the case, you have the right to know periodically how much money your lawyer has spent on your behalf. You also have the right to decide, after consulting with your lawyer, how much money is to be spent to prepare a case. If you pay the expenses, you have the right to decide how much to spend. Your lawyer should also inform you whether the fee will be based on the gross amount recovered or on the amount recovered minus the costs.\n\n7. You, the client, have the right to be told by your lawyer about possible adverse consequences if you lose the case. Those adverse consequences might include money that you might have to pay to your lawyer for costs and liability you might have for attorney's fees to the other side.\n\n8. You, the client, have the right to receive and approve a closing statement at the end of the case before you pay any money. The statement must list all of the financial details of the entire case, including the amount recovered, all expenses, and a precise statement of your lawyer's fee. Until you approve the closing statement you need not pay any money to anyone, including your lawyer. You also have the right to have every lawyer or law firm working on your case sign this closing statement.\n\n9. You, the client, have the right to ask your lawyer at reasonable intervals how the case is progressing and to have these questions answered to the best of your lawyer's ability.\n\n10. You, the client, have the right to make the final decision regarding settlement of a case. Your lawyer must notify you of all offers of settlement before and after the trial. Offers during the trial must be immediately communicated and you should consult with your lawyer regarding whether to accept a settlement. However, you must make the final decision to accept or reject a settlement.\n\n11. If at any time you, the client, believe that your lawyer has charged an excessive or illegal fee, you have the right to report the matter to The Florida Bar, the agency that oversees the practice and behavior of all lawyers in Florida. For information on how to reach The Florida Bar, call 904-561-5600, or contact the local bar association. Any disagreement between you and your lawyer about a fee can be taken to court and you may wish to hire another lawyer to help you resolve this disagreement. Usually fee disputes must be handled in a separate lawsuit unless your fee contract provides for arbitration. You can request, but may not require, that a provision for arbitration (under chapter 682, Florida Statutes, or under the fee arbitration rule of the Rules Regulating The Florida Bar) be included in your fee contract.\n\n__________________ ________________________\n\nClient Signature Attorney Signature\n\n__________________ __________________\n\nDate Date\n\nComment\n\nBasis or rate of fee\n\nWhen the lawyer has regularly represented a client, they ordinarily will have evolved an understanding concerning the basis or rate of the fee. In a new client-lawyer relationship, however, an understanding as to the fee should be promptly established. It is not necessary to recite all the factors that underlie the basis of the fee but only those that are directly involved in its computation. It is sufficient, for example, to state the basic rate is an hourly charge or a fixed amount or an estimated amount, or to identify the factors that may be taken into account in finally fixing the fee. When developments occur during the representation that render an earlier estimate substantially inaccurate, a revised estimate should be provided to the client. A written statement concerning the fee reduces the possibility of misunderstanding. Furnishing the client with a simple memorandum or a copy of the lawyer's customary fee schedule is sufficient if the basis or rate of the fee is set forth.\n\nRule 4-1.8(e) should be consulted regarding a lawyer's providing financial assistance to a client in connection with litigation.\n\nTerms of payment\n\nA lawyer may require advance payment of a fee but is obliged to return any unearned portion. See rule 4-1.16(d). A lawyer is not, however, required to return retainers that, pursuant to an agreement with a client, are not refundable. A lawyer may accept property in payment for services, such as an ownership interest in an enterprise, providing this does not involve acquisition of a proprietary interest in the cause of action or subject matter of the litigation contrary to rule 4-1.8(i). However, a fee paid in property instead of money may be subject to special scrutiny because it involves questions concerning both the value of the services and the lawyer's special knowledge of the value of the property.\n\nAn agreement may not be made whose terms might induce the lawyer improperly to curtail services for the client or perform them in a way contrary to the client's interest. For example, a lawyer should not enter into an agreement whereby services are to be provided only up to a stated amount when it is foreseeable that more extensive services probably will be required, unless the situation is adequately explained to the client. Otherwise, the client might have to bargain for further assistance in the midst of a proceeding or transaction. However, it is proper to define the extent of services in light of the client's ability to pay. A lawyer should not exploit a fee arrangement based primarily on hourly charges by using wasteful procedures. When there is doubt whether a contingent fee is consistent with the client's best interest, the lawyer should offer the client alternative bases for the fee and explain their implications. Applicable law may impose limitations on contingent fees, such as a ceiling on the percentage.\n\nRule 4-1.5(f)(3) does not apply to lawyers seeking to obtain or enforce judgments for arrearages.\n\nContingent fee regulation\n\nRule 4-1.5(f)(4) should not be construed to apply to actions or claims seeking property or other damages arising in the commercial litigation context.\n\nRule 4-1.5(f)(4)(B) is intended to apply only to contingent aspects of fee agreements. In the situation where a lawyer and client enter a contract for part non-contingent and part contingent attorney's fees, rule 4-1.5(f)(4)(B) should not be construed to apply to and prohibit or limit the non-contingent portion of the fee agreement. An attorney could properly charge and retain the non-contingent portion of the fee even if the matter was not successfully prosecuted or if the non-contingent portion of the fee exceeded the schedule set forth in rule 4-1.5(f)(4)(B). Rule 4-1.5(f)(4)(B) should, however, be construed to apply to any additional contingent portion of such a contract when considered together with earned non-contingent fees. Thus, under such a contract a lawyer may demand or collect only such additional contingent fees as would not cause the total fees to exceed the schedule set forth in rule 4-1.5(f)(4)(B).\n\nThe limitations in rule 4-1.5(f)(4)(B)(i)c are only to be applied in the case where all the defendants admit liability at the time they file their initial answer and the trial is only on the issue of the amount or extent of the loss or the extent of injury suffered by the client. If the trial involves not only the issue of damages but also such questions as proximate cause, affirmative defenses, seat belt defense, or other similar matters, the limitations are not to be applied because of the contingent nature of the case being left for resolution by the trier of fact.\n\nRule 4-1.5(f)(4)(B)(ii) provides the limitations set forth in subdivision (f)(4)(B)(i) may be waived by the client upon approval by a circuit court judge. This waiver provision may not be used to authorize a lawyer to charge a client a fee that would exceed rule 4-1.5(a) or (b). It is contemplated that this waiver provision will not be necessary except where the client wants to retain a particular lawyer to represent the client or the case involves complex, difficult, or novel questions of law or fact that would justify a contingent fee greater than the schedule but not a contingent fee that would exceed rule 4-1.5(b).\n\nUpon a petition by a client, the trial court reviewing the waiver request must grant that request if the trial court finds the client: (a) understands the right to have the limitations in rule 4-1.5(f)(4)(B) applied in the specific matter; and (b) understands and approves the terms of the proposed contract. The consideration by the trial court of the waiver petition is not to be used as an opportunity for the court to inquire into the merits or details of the particular action or claim that is the subject of the contract.\n\nThe proceedings before the trial court and the trial court's decision on a waiver request are to be confidential and not subject to discovery by any of the parties to the action or by any other individual or entity except The Florida Bar. However, terms of the contract approved by the trial court may be subject to discovery if the contract (without court approval) was subject to discovery under applicable case law or rules of evidence.\n\nRule 4-1.5(f)(4)(B)(iii) prohibits a lawyer from charging the contingent fee percentage on the total, future value of a recovery being paid on a structured or periodic basis. This prohibition does not apply if the lawyer's fee is being paid over the same length of time as the schedule of payments to the client.\n\nDivision of fee\n\nA division of fee is a single billing to a client covering the fee of two or more lawyers who are not in the same firm. A division of fee facilitates association of more than one lawyer in a matter in which neither alone could serve the client as well, and most often is used when the fee is contingent and the division is between a referring lawyer and a trial specialist. Subject to the provisions of subdivision (f)(4)(D), subdivision (g) permits the lawyers to divide a fee on either the basis of the proportion of services they render or by agreement between the participating lawyers if all assume responsibility for the representation as a whole and the client is advised and does not object. It does require disclosure to the client of the share that each lawyer is to receive. Joint responsibility for the representation entails the obligations stated in rule 4-5.1 for purposes of the matter involved.\n\nDisputes over fees\n\nIf a procedure Since the fee arbitration rule (Chapter 14) has been established by the bar to provide a procedure for resolution of fee disputes, such as an arbitration or mediation procedure established by the bar, the lawyer should conscientiously consider submitting to it. Where L l aw may prescribes a procedure for determining a lawyer's fee, for example, in representation of an executor or administrator, a class, or a person entitled to a reasonable fee as part of the measure of damages . , T t he lawyer entitled to such a fee and a lawyer representing another party concerned with the fee should comply with the prescribed procedure.\n\nReferral fees and practices\n\nA secondary lawyer shall not be entitled to a fee greater than the limitation set forth in rule 4-1.5(f)(4)(D)(ii) merely because the lawyer agrees to do some or all of the following: (a) consults with the client; (b) answers interrogatories; (c) attends depositions; (d) reviews pleadings; (e) attends the trial; or (f) assumes joint legal responsibility to the client. However, the provisions do not contemplate that a secondary lawyer who does more than the above is necessarily entitled to a larger percentage of the fee than that allowed by the limitation.\n\nThe provisions of rule 4-1.5(f)(4)(D)(iii) only apply where the participating lawyers have for purposes of the specific case established a co-counsel relationship. The need for court approval of a referral fee arrangement under rule 4-1.5(f)(4)(D)(iii) should only occur in a small percentage of cases arising under rule 4-1.5(f)(4).\n\nIn determining if a co-counsel relationship exists, the court should look to see if the lawyers have established a special partnership agreement for the purpose of the specific case or matter. If such an agreement does exist, it must provide for a sharing of services or responsibility and the fee division is based upon a division of the services to be rendered or the responsibility assumed. It is contemplated that a co-counsel situation would exist where a division of responsibility is based upon, but not limited to, the following: (a) based upon geographic considerations, the lawyers agree to divide the legal work, responsibility, and representation in a convenient fashion. Such a situation would occur when different aspects of a case must be handled in different locations; (b) where the lawyers agree to divide the legal work and representation based upon their particular expertise in the substantive areas of law involved in the litigation; or (c) where the lawyers agree to divide the legal work and representation along established lines of division, such as liability and damages, causation and damages, or other similar factors.\n\nThe trial court's responsibility when reviewing an application for authorization of a fee division under rule 4-1.5(f)(4)(D)(iii) is to determine if a co-counsel relationship exists in that particular case. If the court determines a co-counsel relationship exists and authorizes the fee division requested, the court does not have any responsibility to review or approve the specific amount of the fee division agreed upon by the lawyers and the client.\n\nRule 4-1.5(f)(4)(D)(iv) applies to the situation where appellate counsel is retained during the trial of the case to assist with the appeal of the case. The percentages set forth in subdivision (f)(4)(D) are to be applicable after appellate counsel's fee is established. However, the effect should not be to impose an unreasonable fee on the client.\n\nRULE 4-1.6 CONFIDENTIALITY OF INFORMATION\n\n(a) Consent Required to Reveal Information. A lawyer shall not reveal information relating to representation of a client except as stated in subdivisions (b), (c), and (d), unless the client consents after disclosure to the client.\n\n(b) When Lawyer Must Reveal Information. A lawyer shall reveal such information to the extent the lawyer reasonably believes necessary:\n\n(1) to prevent a client from committing a crime; or\n\n(2) to prevent a death or substantial bodily harm to another.\n\n(c) When Lawyer May Reveal Information. A lawyer may reveal such information to the extent the lawyer reasonably believes necessary:\n\n(1) to serve the client's interest unless it is information the client specifically requires not to be disclosed;\n\n(2) to establish a claim or defense on behalf of the lawyer in a controversy between the lawyer and client;\n\n(3) to establish a defense to a criminal charge or civil claim against the lawyer based upon conduct in which the client was involved;\n\n(4) to respond to allegations in any proceeding concerning the lawyer's representation of the client; or\n\n(5) to comply with the Rules of Professional Conduct.\n\n(d) Exhaustion of Appellate Remedies. When required by a tribunal to reveal such information, a lawyer may first exhaust all appellate remedies.\n\n(e) Limitation on Amount of Disclosure. When disclosure is mandated or permitted, the lawyer shall disclose no more information than is required to meet the requirements or accomplish the purposes of this rule.\n\nComment\n\nThe lawyer is part of a judicial system charged with upholding the law. One of the lawyer's functions is to advise clients so that they avoid any violation of the law in the proper exercise of their rights.\n\nThe observance of the ethical obligation of a lawyer to hold inviolate confidential information of the client not only facilitates the full development of facts essential to proper representation of the client but also encourages people to seek early legal assistance.\n\nAlmost without exception, clients come to lawyers in order to determine what their rights are and what is, in the maze of laws and regulations, deemed to be legal and correct. The common law recognizes that the client's confidences must be protected from disclosure. Based upon experience, lawyers know that almost all clients follow the advice given, and the law is upheld.\n\nA fundamental principle in the client-lawyer relationship is that the lawyer maintain confidentiality of information relating to the representation. The client is thereby encouraged to communicate fully and frankly with the lawyer even as to embarrassing or legally damaging subject matter.\n\nThe principle of confidentiality is given effect in 2 related bodies of law, the attorney-client privilege (which includes the work product doctrine) in the law of evidence and the rule of confidentiality established in professional ethics. The attorney-client privilege applies in judicial and other proceedings in which a lawyer may be called as a witness or otherwise required to produce evidence concerning a client. The rule of client-lawyer confidentiality applies in situations other than those where evidence is sought from the lawyer through compulsion of law. The confidentiality rule applies not merely to matters communicated in confidence by the client but also to all information relating to the representation, whatever its source. A lawyer may not disclose such information except as authorized or required by the Rules of Professional Conduct or by law. However, none of the foregoing limits the requirement of disclosure in subdivision (b). This disclosure is required to prevent a lawyer from becoming an unwitting accomplice in the fraudulent acts of a client. See also Scope.\n\nThe requirement of maintaining confidentiality of information relating to representation applies to government lawyers who may disagree with the policy goals that their representation is designed to advance.\n\nAuthorized disclosure\n\nA lawyer is impliedly authorized to make disclosures about a client when appropriate in carrying out the representation, except to the extent that the client's instructions or special circumstances limit that authority. In litigation, for example, a lawyer may disclose information by admitting a fact that cannot properly be disputed or in negotiation by making a disclosure that facilitates a satisfactory conclusion.\n\nLawyers in a firm may, in the course of the firm's practice, disclose to each other information relating to a client of the firm, unless the client has instructed that particular information be confined to specified lawyers.\n\nDisclosure adverse to client\n\nThe confidentiality rule is subject to limited exceptions. In becoming privy to information about a client, a lawyer may foresee that the client intends serious harm to another person. However, to the extent a lawyer is required or permitted to disclose a client's purposes, the client will be inhibited from revealing facts that would enable the lawyer to counsel against a wrongful course of action. While the public may be protected if full and open communication by the client is encouraged, several situations must be distinguished.\n\nFirst, the lawyer may not counsel or assist a client in conduct that is criminal or fraudulent. See rule 4-1.2(d). Similarly, a lawyer has a duty under rule 4-3.3(a)(4) not to use false evidence. This duty is essentially a special instance of the duty prescribed in rule 4-1.2(d) to avoid assisting a client in criminal or fraudulent conduct.\n\nSecond, the lawyer may have been innocently involved in past conduct by the client that was criminal or fraudulent. In such a situation the lawyer has not violated rule 4-1.2(d), because to \"counsel or assist\" criminal or fraudulent conduct requires knowing that the conduct is of that character.\n\nThird, the lawyer may learn that a client intends prospective conduct that is criminal. As stated in subdivision (b)(1), the lawyer shall reveal information in order to prevent such consequences. It is admittedly difficult for a lawyer to \"know\" when the criminal intent will actually be carried out, for the client may have a change of mind.\n\nSubdivision (b)(2) contemplates past acts on the part of a client that may result in present or future consequences that may be avoided by disclosure of otherwise confidential communications. Rule 4-1.6(b)(2) would now require the attorney to disclose information reasonably necessary to prevent the future death or substantial bodily harm to another, even though the act of the client has been completed.\n\nThe lawyer's exercise of discretion requires consideration of such factors as the nature of the lawyer's relationship with the client and with those who might be injured by the client, the lawyer's own involvement in the transaction, and factors that may extenuate the conduct in question. Where practical the lawyer should seek to persuade the client to take suitable action. In any case, a disclosure adverse to the client's interest should be no greater than the lawyer reasonably believes necessary to the purpose.\n\nWithdrawal\n\nIf the lawyer's services will be used by the client in materially furthering a course of criminal or fraudulent conduct, the lawyer must withdraw, as stated in rule 4-1.16(a)(1).\n\nAfter withdrawal the lawyer is required to refrain from making disclosure of the client's confidences, except as otherwise provided in rule 4-1.6. Neither this rule nor rule 4-1.8(b) nor rule 4-1.16(d) prevents the lawyer from giving notice of the fact of withdrawal, and the lawyer may also withdraw or disaffirm any opinion, document, affirmation, or the like.\n\nWhere the client is an organization, the lawyer may be in doubt whether contemplated conduct will actually be carried out by the organization. Where necessary to guide conduct in connection with the rule, the lawyer may make inquiry within the organization as indicated in rule 4-1.13(b).\n\nDispute concerning lawyer's conduct\n\nWhere a legal claim or disciplinary charge alleges complicity of the lawyer in a client's conduct or other misconduct of the lawyer involving representation of the client, the lawyer may respond to the extent the lawyer reasonably believes necessary to establish a defense. The same is true with respect to a claim involving the conduct or representation of a former client. The lawyer's right to respond arises when an assertion of such complicity has been made. Subdivision (c) does not require the lawyer to await the commencement of an action or proceeding that charges such complicity, so that the defense may be established by responding directly to a third party who has made such an assertion. The right to defend, of course, applies where a proceeding has been commenced. Where practicable and not prejudicial to the lawyer's ability to establish the defense, the lawyer should advise the client of the third party's assertion and request that the client respond appropriately. In any event, disclosure should be no greater than the lawyer reasonably believes is necessary to vindicate innocence, the disclosure should be made in a manner that limits access to the information to the tribunal or other persons having a need to know it, and appropriate protective orders or other arrangements should be sought by the lawyer to the fullest extent practicable.\n\nIf the lawyer is charged with wrongdoing in which the client's conduct is implicated, the rule of confidentiality should not prevent the lawyer from defending against the charge. Such a charge can arise in a civil, criminal, or professional disciplinary proceeding and can be based on a wrong allegedly committed by the lawyer against the client or on a wrong alleged by a third person; for example, a person claiming to have been defrauded by the lawyer and client acting together. A lawyer entitled to a fee is permitted by subdivision (c) to prove the services rendered in an action to collect it. This aspect of the rule expresses the principle that the beneficiary of a fiduciary relationship may not exploit it to the detriment of the fiduciary. As stated above, the lawyer must make every effort practicable to avoid unnecessary disclosure of information relating to a representation, to limit disclosure to those having the need to know it, and to obtain protective orders or make other arrangements minimizing the risk of disclosure.\n\nDisclosures otherwise required or authorized\n\nThe attorney-client privilege is differently defined in various jurisdictions. If a lawyer is called as a witness to give testimony concerning a client, absent waiver by the client, rule 4-1.6(a) requires the lawyer to invoke the privilege when it is applicable. The lawyer must comply with the final orders of a court or other tribunal of competent jurisdiction requiring the lawyer to give information about the client.\n\nThe Rules of Professional Conduct in various circumstances permit or require a lawyer to disclose information relating to the representation. See rules 4-2.2, 4-2.3, 4-3.3, and 4-4.1. In addition to these provisions, a lawyer may be obligated or permitted by other provisions of law to give information about a client. Whether another provision of law supersedes rule 4-1.6 is a matter of interpretation beyond the scope of these rules, but a presumption should exist against such a supersession.\n\nFormer client\n\nThe duty of confidentiality continues after the client-lawyer relationship has terminated.\n\nRULE 4-3.4 FAIRNESS OF OPPOSING PARTY AND COUNSEL\n\nA lawyer shall not:\n\n(a) unlawfully obstruct another party's access to evidence or otherwise unlawfully alter, destroy, or conceal a document or other material that the lawyer knows or reasonably should know is relevant to a pending or a reasonably foreseeable proceeding; nor counsel or assist another person to do any such act.\n\n(b) fabricate evidence, counsel or assist a witness to testify falsely, or offer an inducement to a witness that is prohibited by law , except a lawyer may pay a witness reasonable expenses incurred by the witness in attending or testifying at proceedings; a reasonable, non-contingent fee for the professional services of an expert witness; and reasonable compensation to reimburse a witness for the loss of compensation incurred by reason of preparing for, attending, or testifying at proceedings.\n\n(c) knowingly disobey an obligation under the rules of a tribunal except for an open refusal based on an assertion that no valid obligation exists.\n\n(d) in pretrial procedure, make a frivolous discovery request or intentionally fail to comply with a legally proper discovery request by an opposing party.\n\n(e) in trial, allude to any matter that the lawyer does not reasonably believe is relevant or that will not be supported by admissible evidence, assert personal knowledge of facts in issue except when testifying as a witness, or state a personal opinion as to the justness of a cause, the credibility of a witness, the culpability of a civil litigant, or the guilt or innocence of an accused.\n\n(f) request a person other than a client to refrain from voluntarily giving relevant information to another party unless:\n\n(1) the person is a relative or an employee or other agent of a client, and\n\n(2) it is reasonable to believe that the person's interests will not be adversely affected by refraining from giving such information.\n\nComment\n\nThe procedure of the adversary system contemplates that the evidence in a case is to be marshalled competitively by the contending parties. Fair competition in the adversary system is secured by prohibitions against destruction or concealment of evidence, improperly influencing witnesses, obstructive tactics in discovery procedure, and the like.\n\nDocuments and other items of evidence are often essential to establish a claim or defense. Subject to evidentiary privileges, the right of an opposing party, including the government, to obtain evidence through discovery or subpoena is an important procedural right. The exercise of that right can be frustrated if relevant material is altered, concealed, or destroyed. Applicable law in many jurisdictions makes it an offense to destroy material for the purpose of impairing its availability in a pending proceeding or one whose commencement can be foreseen. Falsifying evidence is also generally a criminal offense. Subdivision (a) applies to evidentiary material generally, including computerized information.\n\nWith regard to subdivision (b), it is not improper to pay a witness's expenses or to compensate an expert witness on terms permitted by law. The common law rule in most jurisdictions is that it is improper to pay an occurrence witness any fee for testifying and that it is improper to pay an expert witness a contingent fee.\n\nSubdivision (f) permits a lawyer to advise employees of a client to refrain from giving information to another party, for the employees may identify their interests with those of the client. See also rule 4-4.2.\n\nRULE 4-3.6 TRIAL PUBLICITY\n\n(a) Prejudicial Extra-judicial Statements Prohibited. A lawyer shall not make an extra-judicial statement that a reasonable person would expect to be disseminated by means of public communication if the lawyer knows or reasonably should know that it will have a substantial likelihood of materially prejudicing an adjudicative proceedingdue to its creation of an imminent and substantial detrimental effect on that proceeding.\n\n(b) Statements of Third Parties. A lawyer shall not counsel or assist another person to make such a statement. Prosecutors and defense c C counsel shall exercise reasonable care to prevent investigators, employees, or other persons assisting in or associated with a criminal case from making extra-judicial statements that are prohibited under this rule.\n\n(b) Matter Constituting Prejudicial Extra-judicial Statements. A statement referred to in subdivision (a) ordinarily is likely to have such an effect when it refers to a civil matter triable to a jury, a criminal matter, or any other proceeding that could result in incarceration, and the statement relates to:\n\n(1) the character, credibility, reputation, or criminal record of a party, suspect in a criminal investigation, or witness or the identity of a witness or the expected testimony of a party or witness;\n\n(2) in a criminal case or proceeding that could result in incarceration, the possibility of a plea of guilty to the offense, or the existence or contents of any confession, admission, or statement given by a defendant or suspect or that person's refusal or failure to make a statement;\n\n(3) the performance or results of any examination or test, or the refusal or failure of a person to submit to an examination or test, or the identity or nature of physical evidence expected to be presented;\n\n(4) any opinion as to the guilt or innocence of a defendant or suspect in a criminal case or proceeding that could result in incarceration;\n\n(5) information the lawyer knows or reasonably should know is likely to be inadmissible as evidence in a trial and would, if disclosed, create a substantial risk of prejudicing an impartial trial; or\n\n(6) the fact that a defendant has been charged with a crime, unless there is included therein a statement explaining that the charge is merely an accusation and that the defendant is presumed innocent until and unless proven guilty.\n\n(c) Permitted Extra-judicial Statements. Notwithstanding subdivisions (a) and (b)(1) through (5), a lawyer involved in the investigation or litigation of a matter may state without elaboration:\n\n(1) the general nature of the claim or defense;\n\n(2) the information contained in a public record;\n\n(3) that an investigation of the matter is in progress, including the general scope of the investigation, the offense or claim, or defense involved and, except when prohibited by law, the identity of the persons involved;\n\n(4) the scheduling or result of any step in litigation;\n\n(5) a request for assistance in obtaining evidence and information necessary thereto;\n\n(6) a warning of danger concerning the behavior of a person involved when there is reason to believe that there exists the likelihood of substantial harm to an individual or to the public interest; and\n\n(7) in a criminal case:\n\n(A) the identity, residence, occupation, and family status of the accused;\n\n(B) if the accused has not been apprehended, information necessary to aid in apprehension of that person;\n\n(C) the fact, time, and place of arrest; and\n\n(D) the identity of investigating and arresting officers or agencies and the length of the investigation.\n\nComment\n\nIt is difficult to strike a balance between protecting the right to a fair trial and safeguarding the right of free expression. Preserving the right to a fair trial necessarily entails some curtailment of the information that may be disseminated about a party prior to trial, particularly where trial by jury is involved. If there were no such limits, the result would be the practical nullification of the protective effect of the rules of forensic decorum and the exclusionary rules of evidence. On the other hand, there are vital social interests served by the free dissemination of information about events having legal consequences and about legal proceedings themselves. The public has a right to know about threats to its safety and measures aimed at assuring its security. It also has a legitimate interest in the conduct of judicial proceedings, particularly in matters of general public concern. Furthermore, the subject matter of legal proceedings is often of direct significance in debate and deliberation over questions of public policy.\n\nSpecial rules of confidentiality may validly govern proceedings in juvenile, domestic relations, mental disability proceedings, and perhaps other types of litigation. Rule 4-3.4(c) requires compliance with such rules.\n\nRULE 4-5.4 PROFESSIONAL INDEPENDENCE OF A LAWYER\n\n(a) Sharing Fees W w ith Non-lawyers. A lawyer or law firm shall not share legal fees with a non-lawyer, except that:\n\n(1) an agreement by a lawyer with the lawyer's firm, partner, or associate may provide for the payment of money, over a reasonable period of time after the lawyer's death, to the lawyer's estate, or to one 1 or more specified persons;\n\n(2) a lawyer who undertakes to complete unfinished legal business of a deceased lawyer may pay to the estate of the deceased lawyer that proportion of the total compensation that fairly represents the services rendered by the deceased lawyer;\n\n(3) a lawyer who purchases the practice of a deceased, disabled, or disappeared lawyer may, in accordance with the provisions of rule 4-1.17, pay to the estate or other legally authorized representative of that lawyer the agreed upon purchase price; and\n\n(4) bonuses may be paid to non-lawyer employees based on their extraordinary efforts on a particular case or over a specified time period, provided that the payment is not based on the generation of clients or business and is not calculated as a percentage of legal fees received by the lawyer or law firm.\n\n( \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e b) Qualified Pension Plans. A lawyer or law firm may include non-lawyer employees in a compensation or qualified pension, profit-sharing, or retirement plan, even though the lawyer's or law firm's contribution to the plan is based in whole or in part on a profit-sharing arrangement.\n\n( b c) Partnership W w ith Non-lawyer. A lawyer shall not form a partnership with a non-lawyer if any of the activities of the partnership consist of the practice of law.\n\n( c d) Exercise of Independent Professional Judgment. A lawyer shall not permit a person who recommends, employs, or pays the lawyer to render legal services for another to direct or regulate the lawyer's professional judgment in rendering such legal services.\n\n( d e) Non-lawyer Ownership of Professional Service Corporation or Association. A lawyer shall not practice with or in the form of a professional corporation or association authorized to practice law for a profit if:\n\n(1) a non-lawyer owns any interest therein, except that a fiduciary representative of the estate of a lawyer may hold the stock or interest of the lawyer for a reasonable time during administration; or\n\n(2) a non-lawyer has the right to direct or control the professional judgment of a lawyer.\n\nComment\n\nThe provisions of this rule express traditional limitations on sharing fees. These limitations are to protect the lawyer's professional independence of judgment. Where someone other than the client pays the lawyer's fee or salary, or recommends employment of the lawyer, that arrangement does not modify the lawyer's obligation to the client. As stated in subdivision (c), such arrangements should not interfere with the lawyer's professional judgment.\n\nThe prohibition against sharing legal fees with non-lawyer employees is not intended to prohibit profit-sharing arrangements that are part of a qualified pension, profit-sharing, or retirement plan. Compensation plans, as opposed to retirement plans, may not be based on legal fees.\n\nRULE 4-7.6 COMMUNICATION OF FIELDS OF PRACTICE\n\nA lawyer may communicate the fact that the lawyer does or does not practice in particular fields of law. A lawyer shall not state or imply that the lawyer is a specialist except as follows:\n\n(a) Patent Practice. A lawyer admitted to engage in patent practice before the United States patent and trademark office may use the designation \"patent attorney\" or a substantially similar designation.\n\n(b) Certified Lawyers. A lawyer who complies with the Florida certification plan as set forth in chapter 6, Rules Regulating The Florida Bar, or who is certified by a national group that has standards for certification substantially the same as those set out in chapter 6, which has been accredited by the American Bar Association Standing Committee on Specialization may inform the public and other lawyers of the lawyer's certified areas of legal practice and may state in communications to the public that the lawyer is a \"specialist in (area of certification).\"\n\n(c) Designated Lawyers. A lawyer who complies with the Florida designation plan as set forth in chapter 6, Rules Regulating The Florida Bar, may inform the public and other lawyers of the lawyer's designated areas of legal practice.\n\nComment\n\nThis rule permits a lawyer to indicate areas of practice in communications about the lawyer's services, such as in a telephone directory or other advertising. If a lawyer practices only in certain fields, or will not accept matters except in such fields, the lawyer is permitted so to indicate. However, no lawyer who is not certified by The Florida Bar or a national group having substantially the same standards may be described to the public as a \"specialist\" or as \"specializing.\"\n\nCHAPTER 14. FEE ARBITRATION RULE\n\n14-1. JURISDICTION AND VENUE RULE 14-1.1 JURISDICTION\n\n(a) Written Request After Dispute Required. Circuit arbitration committees shall have jurisdiction to resolve disputes over a fee paid, charged, or claimed for legal services rendered by a member of The Florida Bar when the parties to the dispute agree to arbitrate hereunder either by written contract or by a request for arbitration signed by all parties. after a dispute has arisen.\n\n(b) Pending Civil Action. Circuit arbitration committees shall not have jurisdiction to resolve disputes involving matters in which a court has taken jurisdiction to determine and award a reasonable fee to a party or that involve fees charged that constitute a violation of the Rules Regulating The Florida Bar, unless specifically referred to the circuit arbitration committee by the court or by bar counsel, respectively.\n\n(c) Attorney-Client Relationship Required. Circuit arbitration committees have jurisdiction to resolve disputes between members of The Florida Bar or between a member of The Florida Bar and a client or clients only.\n\n(d) Authority to Decline Exercise of Jurisdiction. The chair of a circuit arbitration committee or the chair of a panel of a circuit arbitration committee, with the consent of the chair of the circuit arbitration committee, shall have authority to decline jurisdiction to resolve any particular dispute by reason of its complexity and protracted hearing characteristics.\n\n14-4. INSTITUTION OF PROCEEDINGS\n\nRULE 14-4.1 GENERALLY\n\n(a) Consent. All proceedings shall be instituted by the filing of a written consent to arbitration under these rules either by written contract or by the consent form prescribed herein signed by each party to the controversy. Each of such parties shall provide the committee with a concise statement of that party's position, including the amount claimed or in controversy, on the form prescribed and authorized by the standing committee. Copies of the rules and consent forms will be supplied to the parties by the circuit arbitration committee.\n\n(b) Attachments. If there is a written contract regarding fees between the parties, a copy of that written contract shall accompany the request or submission.\n\nRULES OF PROCEDURE FOR ARBITRATION PROCEEDINGS RULE VI. THE AWARD\n\nThe decision of the arbitrators shall be expressed in a written award on the form prescribed by the standing committee, signed by the arbitrators, which shall include a brief explanation of the basis of the award and shall be submitted to the parties. If there is a dissent, it shall be signed separately but the award shall be binding if signed by a majority of the arbitrators. Unless the consent to arbitration provides otherwise, the arbitrators may grant any lawful relief, including specific performance. An award may also be entered upon the consent of all the parties. Once the award is signed, the hearing may not be reopened except upon consent of all parties and the chair or sole arbitrator. The award may be confirmed, set aside, modified, or corrected only in accordance with sections 682.13 and 682.14,\u003e chapter 682, Florida Statutes, as amended. RULE VII. ENFORCEMENT\n\nIf an award is made to a client and the respondent member of The Florida Bar refuses to comply, the chair of the circuit arbitration committee shall designate an attorney member of the committee or other volunteer member of The Florida Bar at no cost to the client, other than actual litigation expenses, to represent such client in enforcing or defending such award in accordance with chapter 682, Florida Statutes.\n\nRULE VIII. DEATH OR INCOMPETENCE OF A PARTY\n\nIn the event of the death or adjudication of incompetency of a party to the arbitration proceedings during the course of arbitration but prior to the rendering of a decision, the proceeding shall abate upon the suggestion of death of a party or notice of adjudication of incompetency of a party to the chair, unless the personal representative or the guardian of the party consents to go forward. In the event of death or incompetence of a party after the close of the proceedings but prior to a decision, the decision rendered shall be binding upon the heirs, administrators, or executors of the deceased and on the estate and guardian of the incompetent.\n\n\u003cspan class=\"fn\"\u003e1. The Bar filed a motion to sever and expedite review of subchapters 6-14 and 6-15. This Court granted that motion and approved subchapters 6-14 and 6-15 in an opinion released September 1, 1994.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Because the amendments to rule 3-7.10 were originated by this Court, all interested parties shall have thirty days within which to file comments directed toward rule 3-7.10, after which this Court shall enter a subsequent order if any change shall be deemed necessary.\u003c/span\u003e\n\n",
    "body_length": 144176,
    "citedas": [
      "19 Fla. Law W. S 551"
    ],
    "attorneys": "William F. Blews, President, Miami, Florida; John A. DeVault, III, President-elect, Jacksonville, Florida; and John F. Harkness, Jr., Executive Director, Paul F. Hill, General Counsel and John A. Boggs, Director, Lawyer Regulation, Tallahassee, Florida, for Petitioner, The Florida Bar. Henry P. Trawick, Jr., Sarasota, Florida; Henry M. Brown, Longwood, Florida; Robert Bertrand, Miami Lakes, Florida; Jimmy Hatcher, Bristol, Florida; Beverley Comstock, Bradenton, Florida; Dalwin Albert, Bradenton, Florida; Ronald C. Eubanks, Ft. Walton, Florida; Gregory G. Cartotto, Miami Springs, Florida; Stephen Lane, Margate, Florida; Marvin A. Berkowitz, Boca Raton, Florida; Samuel Cintron, Miami, Florida; Paul Melkonian, Miami, Florida; Robert Frankl, Hollywood, Florida; and Ronald Bibace, Boca Raton, Florida, Interested Parties.",
    "category": [
      "124"
    ],
    "judges": "Grimes, C.j., and Overton, Shaw, Kogan, Harding, Wells, and Anstead, JJ., concur.",
    "citation_count": 0
  }
}
