{
  "id": "-qKCR2YBTlTomsSBtHz6",
  "document": {
    "title": "Loder v. City of Glendale",
    "full_title": "LORRAINE LODER AND v. CITY OF GLENDALE ET AL. AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1997-01-06T00:00:00.000Z",
    "docket": "No. S043548.",
    "body": "GEORGE, C. J.\n\nIn this case we address a challenge to an employment-related drug testing program adopted by the City of Glendale in 1986. Under the program in question, all individuals who conditionally have been offered new positions with the city (both newly hired persons and current city employees who have been approved for promotion to a new position) are required to undergo urinalysis testing for a variety of illegal drugs and alcohol as part of a preplacement medical examination that the city traditionally has conducted prior to hiring or promotion. The drug testing requirement applies to all of the city's employment positions, and is imposed without regard to whether the city has any basis for suspecting that a particular applicant for employment or promotion currently is abusing drugs or alcohol.\n\nThe trial court concluded that the city could not lawfully impose a drug testing requirement for all city positions in either the preemployment or prepromotion context, and then undertook the substantial task of reviewing detailed job descriptions of 80 job categories (many of which included a number of separate job classifications) and, with regard to each category and classification, balancing the intrusion upon reasonable expectations of privacy against the governmental interests served by drug testing. The trial court ultimately determined that the challenged drug testing program was invalid as to classifications falling within 36 of the designated categories, and valid as to the remaining positions. On appeal, the Court of Appeal agreed with the trial court that the city could not require drug testing for all city positions, in either the preemployment or the prepromotion setting, but concluded that the trial court improperly had approved drug testing for a significantly larger group of employment positions than was constitutionally permissible.\n\nWe granted review to determine the validity of the city's drug testing program under the statutory and constitutional provisions relied upon by plaintiff. As we shall explain, we conclude that the across-the-board drug testing program here at issue is invalid as applied to current employees who have been conditionally approved for promotion, but is valid as applied to job applicants. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI\n\nA\n\nFrom 1983 to 1985, the city's personnel department observed an increase in the number of city employee disciplinary cases in which substance abuse appeared to be a significant factor, as well as an increase in the number of city employees who voluntarily referred themselves for treatment for substance abuse. In response, the city instituted a two-month pilot project (beginning in November 1985) under which drug testing was conducted on all applicants for city employment. Of the 48 applicants who were tested during the pilot project, 10 (approximately 21 percent) tested positive for drugs. Thereafter, in mid-1986, the city's civil service commission adopted the drug and alcohol screening program that is challenged in this case.\n\nFor at least 10 years prior to the 1986 adoption of the program, the city had required every applicant who had been conditionally approved for hiring or promotion to undergo a preplacement medical examination paid for by the city and conducted at the medical offices of a city-designated physician. As part of the preplacement medical examination, applicants were required to provide a urine sample for analysis for various medical conditions. In adopting the drug and alcohol testing program here at issue, the civil service commission approved the addition of a drug and alcohol screening component to this preexisting preplacement medical examination process.\n\nThe record discloses that the medical examination and drug and alcohol screening process operates in the following manner. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Applicants for employment or promotion are notified in the city's employment bulletin (which announces job openings) that, as part of the selection process, a medical examination, including drug and alcohol screening, is required of all applicants. After an applicant has completed the initial, substantive portion of the application process (consisting, typically, of written and/or oral examinations, performance tests, background and reference checks, etc.), and has been selected by the city for employment or promotion, the applicant is notified that his or her hiring or promotion is conditioned upon successful completion of a preplacement medical examination that includes a drug and alcohol screening component. The personnel department refers all successful applicants to Dr. Robert Newhouse, a Glendale physician, for medical examination and drug testing. The record indicates that Dr. Newhouse had conducted preplacement medical examinations for the city for 10 years prior to its adoption of the drug testing program.\n\nThe medical examination and drug and alcohol screening are conducted at Dr. Newhouse's medical offices. When an applicant arrives at the offices, he or she is asked by a medical employee to sign a written form, consenting to a medical examination and to drug and alcohol testing, and authorizing the release of the test results to the city. The form also asks the applicant to list all medications and drugs that he or she currently is taking, and informs the applicant that a positive result on the drug or alcohol screening test, absent a valid legal explanation for the presence of such drug or alcohol, will result in disqualification from the hiring or promotion process. Applicants who refuse to sign the consent form or to undergo the screening process are considered medically disqualified for employment or promotion, and are advised that the disqualification will remain in effect for the applicant's entire period of eligibility for the position in question. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAfter the consent form has been completed and signed, the testing process begins. At the time the city added the drug testing component, it instituted a number of measures designed to prevent fraud or adulteration in the drug testing procedure. First, the applicant is provided a hospital gown to wear and is asked to undress down to his or her underwear. A medical employee then furnishes the applicant an empty, sealed, sterile container, and the seal is broken in the presence of the applicant. Thereafter, a medical employee accompanies the applicant to a restroom and stands in a cubicle next to the applicant's cubicle while the applicant provides a urine sample; the medical employee does not visually observe the urination process. As additional safeguards against potential fraud, blue colored water is used in the toilet bowl to prevent adulteration of the urine sample, and the medical employee checks the temperature of the sample that the applicant has provided. If the urine sample is cold, the applicant is requested to provide another sample.\n\nAfter the applicant has given the urine sample to the medical employee, the sample is tested (in the applicant's presence), using a \"dipstick,\" to determine the presence of blood, sugar, or protein in the urine, as a screen for medical problems. Thereafter, the container is closed and sealed with evidence tape, and the applicant and medical employee both sign a \"chain of custody\" slip that is placed in a laboratory envelope along with the sample. The applicant subsequently undergoes the remainder of the medical examination, which generally consists of at least the taking of a complete medical history from the applicant, a general physical examination, audiometric testing, and tuberculosis skin testing. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThereafter, the laboratory envelope containing the applicant's urine sample is sent to an independent, certified testing laboratory, which examines the sealed sample for signs of tampering and assigns a serial number to the sample to avoid identifying the applicant by name. While the sample is at the laboratory, a positive chain of custody is kept at all times, and the laboratory is secured by magnetically controlled doors.\n\nAt the laboratory, the urine sample is tested for the following substances: (1) amphetamines and methamphetamines (including \"speed\" and \"crystal\"), (2) benzodiazepines (including Valium, Librium, Oxazepam, Serex, Dalmane), (3) barbiturates (including Amobarbital, Butabarbital, Pentobarbital, Phenobarbital, Secobarbital), (4) cocaine, (5) methadone, (6) methaqualone (i.e., Quaalude), (7) opiates (including codeine, heroin, morphine, hydromorphone, hydrocodone), (8) phencyclidine (PCP), (9) \"THC\" (marijuana), and (10) alcohol. The sample initially is tested by an enzyme immunoassay (EMIT) test. If that test discloses a positive finding, the sample is tested by a gas chromatography/mass spectrophotometry (GCMS) test. If the second test is negative, the overall test result is considered negative and reported as such by the laboratory. Any sample that has tested positive is retained by the laboratory for 12 months, to permit retesting in connection with any administrative appeal the applicant may file.\n\nThe results of the laboratory testing are set forth in a written report to Dr. Newhouse. Dr. Newhouse reviews the results in conjunction with the consent form that the applicant has completed (on which the applicant has disclosed the medications that he or she currently is taking), determines whether the test has revealed the presence of drugs for which the applicant has no legitimate medical explanation, and reports his Conclusion to the director of personnel. All test results, like all other medical records, are treated as confidential and kept in a confidential medical file. The director of personnel testified that the information is not disclosed to any law enforcement agency.\n\nIf the test reveals the presence of drugs for which the applicant has no legitimate medical explanation, the applicant is disqualified from hiring or promotion, and remains ineligible for the period during which the \"eligibility list\" for the job in question is in force. A disqualified promotional applicant, currently employed by the city in another position, is referred to a mandatory assistance program that includes group counseling and a wide variety of educational programs.\n\nApplicants for hiring or promotion who are disqualified as a result of the drug testing program may appeal to the city's civil service commission, pursuant to procedures governing an applicant's disqualification for other medical conditions. If the applicant or the civil service commission requests retesting of the sample in connection with such an administrative appeal, and the applicant agrees that the results of the retesting may be released to the city's personnel division, the retesting, by gas chromatography, is performed at a laboratory selected by the applicant from a list of three laboratories designated by the city. If the results of the second drug screen are negative, Dr. Newhouse reviews the results and recommends either qualifying or disqualifying the applicant; if the results are positive, the initial disqualification remains in effect. If the applicant continues to contest a disqualification, the civil service commission may reject the appeal or direct that a third drug screen be conducted on the initial sample by another laboratory. If the third test is negative, Dr. Newhouse reviews the results and makes a recommendation to the civil service commission, which may find the applicant either eligible or disqualified.\n\nB\n\nShortly after the city's adoption of the drug testing program, plaintiff Lorraine Loder, a taxpayer, instituted the present taxpayer's suit to enjoin further expenditure of public funds relating to the drug testing program. (See Code Civ. Proc., § 526a.) The complaint alleged that the drug testing program violated the provisions of a California statute, the Confidentiality of Medical Information Act (Civ. Code, § 56 et seq.), and also violated the provisions of the federal and state Constitutions guaranteeing the right to be free of unreasonable searches and seizures, and the right of privacy. (U.S. Const., 4th Amend.; Cal. Const., art. I, § 1.)\n\nAfter considering briefs submitted by the parties with regard to the appropriate constitutional analysis to be applied in this context, the trial court concluded that it was \"mandated by applicable law, as handed down by the United States Supreme Court and other sources, to engage in a constitutional analysis as to each category of positions placed in issue by the parties.\" In light of this Conclusion, the court directed the parties to prepare a joint statement describing each of the numerous job categories to which the drug testing program applied, including a Discussion of factors affecting an employee's reasonable expectation of privacy and the particular governmental interests supporting such testing. The resulting joint statement was approximately 500 pages in length.\n\nIn addition to submitting the joint statement, the parties introduced testimony from city officials and expert witnesses concerning the background and purpose of the drug testing program, the harmful effects of drug use in the employment context, and alternative methods--other than urinalysis testing--that may be available for detecting and dealing with the drug use problem in the employment context.\n\nAfter considering the material presented by the parties and the numerous federal and state decisions evaluating drug testing programs, the trial court, in a 250-page opinion, concluded that the Glendale drug testing program was valid as to numerous job classifications but invalid as to others. In reaching its Conclusion, the trial court initially considered the constitutional validity of the drug testing program under the federal and state Constitutions, looking to prior federal and state cases that had identified a variety of factors that could justify drug testing for particular job classifications in the absence of individualized suspicion--for example, whether the position was closely involved with public safety, related to drug interdiction, or involved access to highly sensitive or classified information--as well as other factors that could affect the reasonable expectation of privacy of persons employed in particular positions. After balancing the governmental interests supporting drug testing against the employees' reasonable expectations of privacy with regard to each job classification, the trial court ultimately concluded that the city's drug testing program was invalid, in both the preemployment and prepromotion contexts, as to specified positions in 36 of the 80 job categories to which the policy applied, but valid as to the remaining positions. Thus, for example, the trial court found the drug testing program constitutionally invalid as applied to city attorneys and their secretaries, library and city clerk personnel, clerks and stenographers, meter readers, and finance and administrative services personnel, but valid as applied to police, fire, and jail personnel, waste management and sanitation workers, health service personnel, mechanics and repair workers, and power and water department personnel.\n\nWith regard to plaintiff's statutory argument, the trial court concluded that the drug testing program did not violate the provisions of the Confidentiality of Medical Information Act (Civ. Code, § 56 et seq.).\n\nThe trial court issued an injunction prohibiting the city from applying the challenged drug testing program to those job categories as to which it had found the testing constitutionally impermissible. At the same time, the trial court expressly stated that the injunction applied only to the drug testing aspects of the city's examination process and that the city was \"not prohibited from conducting the remainder of the existing physical examinations as to [such job categories], including the taking of urine samples from the applicants or employees for purposes other than the detection of illegal drug use, including for ascertainment of medical condition and physical fitness.\"\n\nC\n\nBoth parties appealed from the judgment of the trial court. The city contended that the trial court should have found the drug testing program permissible with regard to all job classifications, while plaintiff contended that the trial court's injunction was too limited and should have applied to additional job classifications.\n\nThe Court of Appeal agreed with the trial court that a drug testing program that applied to all employment positions is impermissible in both the preemployment and the prepromotional contexts, but the appellate court concluded that, in balancing the privacy interests of employees against the governmental interests served by drug testing, the trial court improperly had upheld the validity of the drug testing program with regard to many job classifications as to which the city had failed to demonstrate a sufficiently compelling justification. As the Court of Appeal interpreted the governing federal and state constitutional decisions, the city's suspicionless drug testing program was valid \"only as to positions in which the regular duties involve some special and obvious physical or ethical demand, and the compromise of the employee's ability to meet such demands could have an immediate disastrous consequence upon public safety or security \" (italics added). The Court of Appeal then determined that the trial court had approved drug testing with respect to many job classifications that did not pose safety or security concerns of this magnitude.\n\nFinally, the Court of Appeal held that even with regard to those employment positions that satisfied its stringent standard, drug testing may be required only \"(1) upon initial employment in the job category, whether by hire or promotion; and (2) after a job offer has been made; and (3) if the test is conducted in a manner which does not violate the Americans With Disabilities Act, i.e., without requiring disclosure of any medical history information (including drugs which the applicant is taking upon advice and/or prescription of a medical doctor) which is not relevant to the applicant's ability to perform the job; and (4) if the sample is collected in a manner which does not intrude unnecessarily upon the right to personal privacy; and (5) if an initial positive test is confirmed by a second test regarded as reliable by the relevant scientific community.\" (Fns. omitted.)\n\nThe Court of Appeal reversed the portion of the judgment that permitted drug testing \"as to specified [job] categories where inconsistent with the views expressed\" in the Court of Appeal opinion, and remanded the matter to the trial court \"for the sole purpose of further limiting those job titles as to which preemployment and promotional drug testing may be conducted.\"\n\nThe city sought review of the Court of Appeal's decision, challenging both the constitutional standard embraced by the Court of Appeal and that court's application of the standard to the numerous job classifications at issue in this case. We granted review to consider the validity of the city's drug testing program under the applicable statutory and constitutional provisions.\n\nII\n\nAs noted at the outset, plaintiff's challenge to the city's drug testing program here at issue rests on both statutory and constitutional grounds. Pursuant to traditional principles of judicial restraint, we turn first to plaintiff's statutory claim because, were that claim meritorious, there would be no need to reach plaintiff's constitutional contentions. (See Ashwander v. Valley Authority (1936) 297 U.S. 288, 347 [80 L. Ed. 688, 711, 56 S. Ct. 466] (conc. opn. by Brandeis, J.).)\n\nPlaintiff contends that the city's drug testing program violates a provision of California's Confidentiality of Medical Information Act. (Civ. Code, § 56 et seq.) In general, this legislation, enacted in 1981, is intended to protect the confidentiality of individually identifiable medical information obtained from a patient by a health care provider, while at the same time setting forth limited circumstances in which the release of such information to specified entities or individuals is permissible. (See, e.g., Heller v. Norcal Mutual Ins. Co. (1994) 8 Cal. 4th 30 [32 Cal. Rptr. 2d 200, 876 P.2d 999].) To provide such protection, the act specifies that \"[n]o provider of health care shall disclose medical information regarding a patient of the provider without first obtaining an authorization . . .\" (Civ. Code, § 56.10, subd. (a)), and then sets forth, in some detail, the requirements of a valid authorization for the release of medical information \"by a provider of health care\" (id., § 56.11) or by an employer (id., § 56.21).\n\nThe record in the present case indicates that the city treats the results of the drug testing program with the same degree of confidentiality as all other confidential medical information obtained as a result of its medical examination of job applicants and employees, retaining the information in confidential medical files and disclosing the results of the testing only to the city personnel director. Plaintiff does not contend that the manner in which the city handles or maintains drug test results violates the provisions of the Confidentiality of Medical Information Act relating to an employer's duty to protect against the unauthorized disclosure or use of confidential medical information. (Civ. Code, § 56.20, subds. (a), (c).) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nInstead, plaintiff contends that the drug testing program violates the act insofar as the program automatically disqualifies from employment or promotion any employee who refuses to sign a form (tendered to an applicant prior to testing), authorizing the physician who conducts the drug testing to inform the city of the results of the testing. Plaintiff relies, in this regard, upon Civil Code section 56.20, subdivision (b), which provides in full: \" No employee shall be discriminated against in terms or conditions of employment due to that employee's refusal to sign an authorization under this part. However, nothing in this section shall prohibit an employer from taking such action as is necessary in the absence of medical information due to an employee's refusal to sign an authorization under this part.\" (Italics added.)\n\nPlaintiff contends that by disqualifying applicants who refuse to authorize disclosure to the city of the results of city-mandated drug testing, the program impermissibly \"discriminates\" against applicants who \"refus[e] to sign an authorization,\" in violation of Civil Code section 56.20, subdivision (b), and that the city has failed to establish that its disqualification of such applicants from employment or promotion is \"necessary\" within the meaning of this subdivision. Plaintiff contends, in this regard, that the reference in section 56.20, subdivision (b), to \"necessary\" \"should be defined to require an employer to have a compelling reason to act in the absence of information and should further require that the employer had no reasonable, less intrusive alternative.\"\n\nIn our view, plaintiff's proposed interpretation of Civil Code section 56.20, subdivision (b), is untenable. An employer \"discriminates\" against an employee in violation of section 56.20, subdivision (b), if it improperly retaliates against or penalizes an employee for refusing to authorize the employee's health care provider to disclose confidential medical information to the employer or others (see Civ. Code, § 56.11), or for refusing to authorize the employer to disclose confidential medical information relating to the employee to a third party (see Civ. Code, § 56.21). By contrast, an employer who disqualifies an employee or job applicant for refusing to permit the employer to be informed of the ultimate results of an employer-mandated medical examination or drug test, like an employer who disqualifies an employee or applicant who fails or refuses to take the required examination or test, has not \"discriminated\" against the employee or applicant for refusing to sign an authorization of disclosure, but instead simply has taken \"such action as is necessary in the absence of medical information due to [the] employee's refusal . . .,\" as specifically authorized by section 56.20, subdivision (b). This follows because an employer-mandated medical examination or drug testing procedure obviously would be totally ineffective if an employer could not treat an individual who refuses to permit the employer to learn the ultimate results of the examination in the same fashion as an individual who refuses to complete the test. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nAlthough plaintiff maintains that the language in Civil Code section 56.20, subdivision (b), permitting an employer to take \"such action as is necessary in the absence of medical information due to an employee's refusal to sign an authorization\" (italics added) should be interpreted to require an employer to justify any employer-mandated medical examination or drug test under a demanding \"compelling interest\" standard, plaintiff has not cited, and our independent research has not identified, anything in either the language or legislative history of section 56.20, subdivision (b), that indicates the Legislature, in enacting this provision, intended to impose any such stringent requirement on employer-mandated medical examinations or drug testing. Indeed, although section 56.20, subdivisions (a) and (c) (quoted in fn. 5, ante), reasonably can be interpreted as imposing restrictions upon an employer's handling and disclosure of information about an applicant obtained through an employer-mandated medical examination or drug test, there is nothing in the language or legislative history of the Confidentiality of Medical Information Act to suggest that the Legislature, in drafting this enactment, ever considered the entirely distinct question of whether, and under what circumstances, an employer may require a job applicant or current employee to submit to an employer-administered medical examination or drug test as a condition of employment. In the absence of any indication that the Legislature, in enacting this legislation, intended to address the validity of employer-mandated medical examinations or drug tests, we do not believe that section 56.20, subdivision (b), can or should be interpreted as having resolved this significant issue by implication. Accordingly, we conclude that so long as an employer-mandated medical examination or drug testing program is otherwise lawful, section 56.20, subdivision (b), does not prohibit an employer from disqualifying an applicant or employee who refuses to authorize disclosure to the employer of the ultimate results of the examination or test.\n\nOur Conclusion that Civil Code section 56.20, subdivision (b), cannot reasonably be interpreted to regulate the circumstances under which an employer may require job applicants or current employees to submit to a medical examination or drug test is bolstered by the circumstance that, in contrast to the Confidentiality of Medical Information Act, other statutory provisions exist, both at the federal and state level, that speak directly to the question of the validity of employer-mandated medical examinations and drug testing.\n\nAt the federal level, the most pertinent statute is the Americans with Disabilities Act (42 U.S.C.S. § 12101 et seq.) (ADA), enacted in 1990. The ADA contains a number of explicit provisions related to employer-required medical examinations, establishing different rules applicable to various stages of the application and employment process. In the initial stage of the application process, prior to the time an employer has made an offer of employment to a job applicant, the ADA prohibits any employer covered by the act from conducting a medical examination of any applicant. (42 U.S.C.S. § 12112(d)(2)(A).) After an employer has made an offer of employment to a job applicant and before the applicant begins his or her employment duties, however, the ADA specifically provides that an employer may require a job applicant to undergo a medical examination, and may condition its offer of employment on the results of such examination, so long as (1) all entering employees are subjected to such an examination regardless of disability, (2) information obtained through the examination regarding the medical condition or history of the applicant is collected and maintained in separate medical files and is treated as a confidential medical record, and (3) the results of the examination are used only in accordance with the other provisions of the ADA (i.e., the results may not be used to discriminate against a qualified individual with a disability). (42 U.S.C.S. § 12112(d)(3).) The administrative regulation implementing this section of the act further explains that, at this stage, \"[m]edical examinations conducted in accordance with this section do not have to be job-related and consistent with business necessity.\" (29 C.F.R. § 1630.14(b)(3) (1996).) Finally, after an employee has been hired and has begun working, the ADA provides that an employer \"shall not require a medical examination . . . unless such examination . . . is shown to be job-related and consistent with business necessity.\" (42 U.S.C.S. § 12112(d)(4)(A).) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThus, the ADA establishes a rather detailed scheme regulating employer-required medical examinations, prohibiting such examinations at some stages of the application and employment process, but specifically permitting an employer, at the post-offer/pre-hiring stage, to require such medical examinations of all applicants without any showing that the examination \"is . . . job-related and consistent with business necessity.\" (42 U.S.C.S. § 12112(d)(4)(A).)\n\nFurthermore, although the ADA places some significant limitations upon the circumstances under which an employer may require current employees or applicants for employment to undergo medical examinations, the act contains a specific provision declaring that \"[f]or purposes of this subchapter, a test to determine the illegal use of drugs shall not be considered a medical examination\" (42 U.S.C.S. § 12114(d)). The legislative history of the ADA and the administrative regulations promulgated pursuant to the act also make clear that the ADA was not intended to restrict an employer's use of drug testing to determine whether an applicant for employment or a current employee is currently engaging in the illegal use of drugs. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAt the state level, the question of employer-required medical examinations is addressed explicitly in an administrative regulation that was adopted to implement a provision of the Fair Employment and Housing Act (FEHA), prohibiting discrimination in employment on the basis of physical or mental disability. (See Gov. Code, § 12935, subd. (a), 12940.) Under the regulation, an employer may condition an offer of employment upon the results of a medical examination conducted before the employee begins work so long as (1) all entering employees in similar positions are subjected to such an examination, (2) the applicant or employee is permitted to \"submit independent medical opinions for consideration\" before the applicant is disqualified based upon the results of the examination, and (3) the results of the examination are maintained on separate forms and are treated as confidential medical records. (Cal. Code Regs., tit. 2, § 7294.0, subd. (d).) Moreover, like the ADA, the FEHA specifically provides that \"the unlawful use of controlled substances or other drugs shall not be deemed, in and of itself, to constitute a mental [or physical] disability\" for purposes of the provisions of the act prohibiting discrimination on the basis of mental or physical disability (Gov. Code, § 12926, subds. (i), (k)), and nothing in the FEHA, or any other California statute, purports to prohibit, or place general limitations upon, employer-mandated drug testing. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nOf course, the Legislature remains free to impose greater restrictions upon employer-mandated medical examinations or drug testing than those embodied in the current provisions of the ADA or the FEHA. Contrary to plaintiff's contention, however, we believe it is clear that the Legislature did not intend to impose such restrictions when it enacted the applicable provisions of the Confidentiality of Medical Information Act in 1981. Accordingly, we reject plaintiff's contention that the city's drug testing program--by disqualifying applicants who refuse to authorize the release of drug test results to the city--improperly \"discriminates\" against such applicants in violation of Civil Code section 56.20, subdivision (b).\n\nHaving found that plaintiff's sole statutory challenge to the city's drug testing program is without merit, we turn to plaintiff's constitutional contentions.\n\nIII\n\nPlaintiff maintains that the city's drug testing program violates the provisions of both the United States and California Constitutions. Because the United States Supreme Court already has spoken directly to the issue of the proper application of federal constitutional principles in evaluating the validity of drug testing in the public employment context, whereas our court has not previously had occasion to address the issue of employment-related drug testing under the state Constitution, we believe it is advisable and appropriate to consider plaintiff's federal constitutional claim before addressing her contention under the state Constitution.\n\nThe United States Supreme Court addressed the validity of employer-required drug testing in two cases decided in 1989: Skinner v. Railway Labor Executives' Assn. (1989) 489 U.S. 602 [103 L. Ed. 2d 639, 109 S. Ct. 1402] (Skinner) and Treasury Employees v. Von Raab (1989) 489 U.S. 656 [103 L. Ed. 2d 685, 109 S. Ct. 1384] (Von Raab). In view of the significance of the Skinner and Von Raab cases, we review these decisions in some detail.\n\nA\n\nIn Skinner, (supra) , 489 U.S. 602, the court examined the validity, under the Fourth Amendment, of drug testing conducted by a private railroad pursuant to regulations promulgated by the Federal Railroad Administration (FRA). The regulations, imposed because the FRA had found that alcohol and drug abuse by railroad employees poses a serious threat to safety, required the railroad to administer blood and urine tests to employees who were working on trains that were involved in certain relatively serious accidents. The regulations required the railroad, immediately after the occurrence of such an accident, to transport all crew members or other covered employees directly involved in the accident to an independent medical facility, where both blood and urine samples were to be obtained from each employee. (Although primary reliance was placed upon blood samples, urine samples also were required, because drug traces remain in a person's urine longer than in the blood, and in some cases it would not be possible to transport a worker to a medical facility before certain drugs might be eliminated from the worker's bloodstream.)\n\nIn analyzing the validity of the mandated blood and urine tests, the court in Skinner first determined that, because the railroad carried out the testing under the aegis of the federal regulations, there was sufficient governmental \"encouragement, endorsement, and participation . . . to implicate the Fourth Amendment.\" (489 U.S. at pp. 615-616 [103 L. Ed. 2d at pp. 658-659].)\n\nThe court in Skinner thereafter considered whether the blood and urine tests called for by the regulation constituted \"searches or seizures\" for purposes of the Fourth Amendment. The court first noted that it had \"long recognized that a 'compelled intrusio[n] into the body for blood to be analyzed for alcohol content' must be deemed a Fourth Amendment search,\" explaining that both the physical intrusion, penetrating the skin, and the \"ensuing chemical analysis of the sample\" constitute invasions of the tested individual's privacy interests. (489 U.S. at p. 616 [103 L. Ed. 2d at p. 659].) Turning to urine testing, and observing that, unlike blood testing, \"the procedures . . . for collecting and testing urine samples do not entail a surgical intrusion into the body,\" the court nonetheless concluded that the administration of a urine test also constitutes a search for purposes of the Fourth Amendment. ( Id. at p. 617.) The court explained: \"It is not disputed . . . that chemical analysis of urine, like that of blood, can reveal a host of private medical facts about an employee, including whether he or she is epileptic, pregnant, or diabetic. Nor can it be disputed that the process of collecting the sample to be tested, which may in some cases involve visual or aural monitoring of the act of urination, itself implicates privacy interests. . . . 'There are few activities in our society more personal or private than the passing of urine. Most people describe it by euphemisms if they talk about it at all. It is a function traditionally performed without public observation; indeed, its performance in public is generally prohibited by law as well as social custom.' [Citation.] Because it is clear that the collection and testing of urine intrudes upon expectations of privacy that society has long recognized as reasonable, the Federal Courts of Appeal have concluded unanimously, and we agree, that these intrusions must be deemed searches under the Fourth Amendment.\" (489 U.S. at p. 617 [103 L. Ed. 2d at pp. 659-660], italics added.)\n\nHaving found that the Fourth Amendment applied to the challenged blood and urine testing, the court in Skinner, emphasizing that this constitutional provision does not proscribe all searches and seizures but only those that are \"unreasonable,\" proceeded to determine whether the searches mandated by the regulation were reasonable for purposes of the Fourth Amendment. The court observed: \" What is reasonable, of course, 'depends on all of the circumstances surrounding the search or seizure and the nature of the search or seizure itself.' [ Citation.] . . . [ T ] he permissibility of a particular practice 'is Judged by balancing its intrusion on the individual's Fourth Amendment interests against its promotion of legitimate governmental interests.' [Citations.]\" (489 U.S. at p. 619 [103 L. Ed. 2d at p. 661], italics added.) Although acknowledging that in most criminal cases this balance is struck in favor of the procedure described by the warrant clause (viewing a search as reasonable if conducted pursuant to a warrant that has been issued by a neutral magistrate upon a showing of probable cause), the court in Skinner noted that past Supreme Court decisions had recognized exceptions to this rule \" 'when \"special needs, beyond the normal need for law enforcement, make the warrant and probable-cause requirement impracticable.\" ' [Citations.] When faced with such special needs, we have not hesitated to balance the governmental and privacy interests to assess the practicality of the warrant and probable-cause requirements in the particular context. [Citations.]\" ( Id. at pp. 619-624 [103 L. Ed. 2d at p. 661].)\n\nExamining the specific context presented in Skinner, the court found that \"[t]he Government's interest in regulating the conduct of railroad employees to ensure safety, like its supervision of probationers or regulated industries, or its operation of a government office, school, or prison, 'likewise presents \"special needs\" beyond normal law enforcement that may justify departures from the usual warrant and probable-cause requirements.' \" (489 U.S. at p. 620[ 103 L. Ed. 2d at pp. 661-662].) After concluding that imposition of a warrant requirement in this context \"would add little to the assurances of certainty and regularity already afforded by the regulations, while significantly hindering, and in many cases frustrating, the objectives of the Government's testing program\" ( id. at p. 624 [103 L. Ed. 2d at p. 664]), the court turned to the more difficult question whether the testing program was impermissible because it subjected employees to blood and urine testing in the absence not only of a showing of probable cause to believe that an employee had used illicit drugs or alcohol, but also in the absence of a showing of even an individualized suspicion of recent drug or alcohol use. Although the court in Skinner noted that \"[w]hen the balance of interests precludes insistence on a showing of probable cause, we have usually required 'some quantum of individualized suspicion' before concluding that a search is reasonable [citation],\" (ibid.) it further explained that past cases also had indicated \"that a showing of individualized suspicion is not a constitutional floor, below which a search must be presumed unreasonable,\" and that \"[ i ] n limited circumstances, where the privacy interests implicated by the search are minimal, and where an important governmental interest furthered by the intrusion would be placed in jeopardy by a requirement of individualized suspicion, a search may be reasonable despite the absence of such suspicion.\" (Ibid., italics added.)\n\nThe court then went on to conclude that, under the circumstances presented in Skinner, the governmental interest in testing without a showing of individualized suspicion outweighed the intrusion on privacy posed by the tests for illegal drugs and alcohol. In reaching this Conclusion, the court emphasized the compelling nature of the governmental interest supporting the testing at issue in Skinner, explaining that the railroad \"[e]mployees subject to the tests discharge duties fraught with such risks of injury to others that even a momentary lapse of attention can have disastrous consequences\" (489 U.S. at p. 628 [103 L. Ed. 2d at p. 667]), and that \"[m]uch like persons who have routine access to dangerous nuclear power facilities, [citations], employees who are subject to testing under the FRA regulations can cause great human loss before any signs of impairment become noticeable to supervisors or others. . . . . . . By ensuring that employees in safety-sensitive positions know they will be tested upon the occurrence of a triggering event, the timing of which no employee can predict with certainty, the regulations significantly increase the deterrent effect of the administrative penalties associated with the prohibited conduct, [citation], concomitantly increasing the likelihood that employees will forgo using drugs or alcohol while subject to being called for duty.\" ( Id. at pp. 628-630 [103 L. Ed. 2d at pp. 667-668].)\n\nThe court in Skinner also found that several circumstances operated to diminish the intrusion upon reasonable expectations of privacy resulting from the challenged testing program. Although the court stated that \"in most contexts\" it would not characterize as minimal the privacy concerns implicated by urine testing, \"which require[s] employees to perform an excretory function traditionally shielded by great privacy\" (489 U.S. at p. 626 [103 L. Ed. 2d at p. 665]), the court noted that the regulations at issue in Skinner attempted to reduce the intrusiveness of the collection process by not requiring that samples be furnished under the direct observation of a monitor, and by providing that the sample was to be collected \"in a medical environment, by personnel unrelated to the railroad employer, . . . not unlike similar procedures encountered often in the context of a regular physical examination.\" ( Id. at pp. 626-627 [103 L. Ed. 2d at pp. 665-666].) \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Further, the court stated that \"[m]ore importantly, the expectations of privacy of covered employees are diminished by reason of their participation in an industry that is regulated pervasively to ensure safety, a goal dependent, in substantial part, on the health and fitness of covered employees.\" ( Id. at p. 627 [103 L. Ed. 2d at p. 666].) The court noted that both federal and state legislation contemplated that railroad workers would be subjected to thorough examination for safety purposes, and that the FRA had found that \" 'most railroads require periodic physical examinations for train and engine employees and certain other employees' [citation].\" (Ibid.) The court concluded that \"[t]hough some of the privacy interests implicated by the toxicological testing at issue reasonably might be viewed as significant in other contexts, logic and history show that a diminished expectation of privacy attaches to information relating to the physical condition of covered employees and to this reasonable means of procuring such information.\" ( Id. at p. 628 [103 L. Ed. 2d at p. 667].)\n\nIn light of the compelling governmental interests that it found would be significantly hindered if railroads were required to point to specific facts giving rise to a reasonable suspicion of impairment before testing an employee, and its Conclusion that the testing authorized by the regulations was not an undue infringement on the justifiable expectations of privacy of covered employees, the court in Skinner held that \"the Government's compelling interests outweigh privacy concerns\" (489 U.S. at p. 633 [103 L. Ed. 2d at p. 670]) and accordingly concluded that the alcohol and drug tests in question were \"reasonable within the meaning of the Fourth Amendment.\" ( Id. at p. 634 [103 L. Ed. 2d at p. 671].) Thus, the court rejected the challenge to the drug and alcohol testing program at issue in Skinner.\n\nB\n\nAlthough Skinner provides considerable guidance with respect to the general application of Fourth Amendment principles to employment-related drug testing, the United States Supreme Court's decision in Von Raab, (supra) , 489 U.S. 656, handed down the same day as Skinner, is even more instructive with regard to the validity of the drug testing program at issue in the present case. The drug and alcohol tests involved in Skinner were conducted only after a train accident had occurred, whereas the drug testing in Von Raab, like the testing here at issue, was imposed upon employees upon their application for transfer or promotion to new positions.\n\nIn Von Raab, the court considered a challenge to a drug testing program that had been adopted by the United States Customs Service. Under that agency's program, \"[d]rug tests were made a condition of placement or employment for positions that meet one or more of three criteria. The first is direct involvement in drug interdiction or enforcement of related laws, an activity the Commissioner [of Customs] deemed fraught with obvious dangers to the mission of the agency and the lives of Customs agents. [Citation.] The second criterion is a requirement that the incumbent carry firearms, as the Commissioner concluded that '[p]ublic safety demands that employees who carry deadly arms and are prepared to make instant life or death decisions be drug free.' [Citation.] The third criterion is a requirement for the incumbent to handle 'classified' material, which the Commissioner determined might fall into the hands of smugglers if accessible to employees who, by reason of their own illegal drug use, are susceptible to bribery or blackmail.\" (489 U.S. at pp. 660-661 [103 L. Ed. 2d at p. 699].)\n\nUnder the customs program, once an employee qualifies for a position covered by the testing program, the Customs Service notifies the employee that final selection is contingent upon successful completion of drug screening. The employee is directed to report to a testing facility at a particular date and time. At the testing site, the employee is required to remove outer garments (such as a coat or jacket) and any other personal belongings, and is permitted to produce the sample either behind a partition or in a bathroom stall. \"To ensure against adulteration of the specimen, or substitution of a sample from another person, a monitor of the same sex as the employee remains close at hand to listen for the normal sounds of urination. Dye is added to the toilet water to prevent the employee from using the water to adulterate the sample.\" (489 U.S. at p. 661 [103 L. Ed. 2d at p. 699].) The monitor inspects the sample for temperature and color and places it in a tamper-proof container, which is sealed. Chain-of-custody procedures are utilized to protect the integrity of the process. Under the Customs Service program, current employees who test positive for drugs, and offer no satisfactory explanation, are subject to dismissal from the Customs Service.\n\nIn analyzing the validity of the Customs Service program as applied to current employees who had been offered transfer or promotion, the court in Von Raab began by explaining that \"earlier cases have settled that the Fourth Amendment protects individuals from unreasonable searches conducted by the Government, even when the Government acts as an employer [citing O'Connor v. Ortega (1987) 480 U.S. 709 [94 L. Ed. 2d 714, 107 S. Ct. 1492], and, in view of our holding in [ Skinner ] that urine tests are searches, it follows that the Customs Service's drug-testing program must meet the reasonableness requirement of the Fourth Amendment.\" (Von Raab, (supra) , 489 U.S. at p. 665 [ 103 L. Ed. 2d at pp. 701-702].) As in Skinner, the court also noted that although, as a general matter, a search must be supported by a warrant issued upon probable cause, \"where a Fourth Amendment intrusion serves special governmental needs, beyond the normal need for law enforcement, it is necessary to balance the individual's privacy expectations against the Government's interests to determine whether it is impractical to require a warrant or some level of individualized suspicion in the particular context.\" (489 U.S. at pp. 665-666 [103 L. Ed. 2d at p. 702].) Observing that the Customs Service drug testing program was not designed to serve the ordinary needs of law enforcement (test results could not be used in a criminal prosecution without the employee's consent), the court in Von Raab found that the purposes of the program--\"to deter drug use among those eligible for promotion to sensitive positions within the Service and to prevent the promotion of drug users to those positions\" ( id. at p. 666 [103 L. Ed. 2d at p. 702])--like the government's concern for safe rail transportation in Skinner, embodied a \"special need\" that could justify departure from the ordinary warrant and probable cause requirements.\n\nThe court explained that a warrant is not required in this context, because under the Customs Service program every employee who sought transfer or promotion to a covered position was tested, and in light of the circumstance that \"the Service does not make a discretionary determination to search based on a judgment that certain conditions are present, there are simply 'no special facts for a neutral magistrate to evaluate' [citation].\" (Von Raab, (supra) , 489 U.S. at p. 667 [ 109 S. Ct. at p. 1391, 103 L. Ed. 2d at p. 703].) The court then went on to examine the more difficult question whether the drug testing could be justified in the absence of any individualized suspicion of illicit drug use by the employees who were subject to testing. Reiterating that \"[o]ur precedents have settled that, in certain limited circumstances, the Government's need to discover . . . latent or hidden conditions, or to prevent their development, is sufficiently compelling to justify the intrusion on privacy entailed by conducting such searches without any measure of individualized suspicion,\" the court found that \"the Government's need to conduct the suspicionless searches required by the Customs program outweighs the privacy interests of employees engaged directly in drug interdiction, and of those who otherwise are required to carry firearms.\" (489 U.S. at p. 668 [103 L. Ed. 2d at p. 704], italics added.)\n\nIn explaining this Conclusion, the court emphasized both the significance of the government's interest with regard to these particular employment positions, and the diminished expectation of privacy of the individuals seeking such positions. With regard to drug-interdiction personnel, the court stated: \"It is readily apparent that the Government has a compelling interest in ensuring that front-line interdiction personnel are physically fit, and have unimpeachable integrity and judgment. . . . This national interest in self-protection could be irreparably damaged if those charged with safeguarding it were, because of their own drug use, unsympathetic to their mission of interdicting narcotics. A drug user's indifference to the Service's basic mission or, even worse, his active complicity with the malefactors, can facilitate importation of sizable drug shipments or block apprehension of dangerous criminals.\" (Von Raab, (supra) , 489 U.S. at p. 670 [ 103 L. Ed. 2d at p. 705].) With respect to employment positions that require the carrying of a firearm, the court declared: \"Customs employees who may use deadly force plainly 'discharge duties fraught with such risks of injury to others that even a momentary lapse of attention can have disastrous consequences.' [Citation.] We agree with the Government that the public should not bear the risk that employees who may suffer from impaired perception and judgment will be promoted to positions where they may need to employ deadly force.\" ( Id. at pp. 670-671 [103 L. Ed. 2d at p. 705].)\n\nHaving highlighted the important public interests supporting suspicionless testing of those Customs Service positions involving drug interdiction and requiring the carrying of a firearm, the court examined the intrusion upon privacy resulting from compelling employees seeking transfer or promotion to such positions to undergo the challenged urine test for drugs. The court first noted that it had recognized in Skinner that \"[t]he interference with individual privacy that results from the collection of a urine sample for subsequent chemical analysis could be substantial in some circumstances.\" (Von Raab, (supra) , 489 U.S. at p. 671 [ 103 L. Ed. 2d at p. 705].) It then went on: \"We have recognized, however, that the 'operational realities of the workplace' may render entirely reasonable certain work-related intrusions by supervisors and co-workers that might be viewed as unreasonable in other contexts. [Citation.] While these operational realities will rarely affect an employee's expectations of privacy with respect to searches of his person, or of personal effects that the employee may bring to the workplace [citation], it is plain that certain forms of public employment may diminish privacy expectations even with respect to such personal searches. Employees of the United States Mint, for example, should expect to be subject to certain routine personal searches when they leave the workplace every day. Similarly, those who join our military or intelligence services may not only be required to give what in other contexts might be viewed as extraordinary assurances of trustworthiness and probity, but also may expect intrusive inquiries into their physical fitness for those special positions. [Citations.]\" ( Id. at pp. 671-672 [103 L. Ed. 2d at p. 706].)\n\nTurning to the two categories of Customs Service employees it then was considering, the court continued: \"We think Customs employees who are directly involved in the interdiction of illegal drugs or who are required to carry firearms in the line of duty likewise have a diminished expectation of privacy in respect to the intrusions occasioned by a urine test. Unlike most private citizens or government employees in general, employees involved in drug interdiction reasonably should expect effective inquiry into their fitness and probity. Much the same is true of employees who are required to carry firearms. Because successful performance of their duties depends uniquely on their judgment and dexterity, these employees cannot reasonably expect to keep from the Service personal information that bears directly on their fitness. [Citation.] While reasonable tests designed to elicit this information doubtless infringe some privacy expectations, we do not believe these expectations outweigh the Government's compelling interests in safety and in the integrity of our borders.\" (Von Raab, (supra) , 489 U.S. at p. 672 [ 103 L. Ed. 2d at p. 706], fn. omitted.)\n\nAfter concluding that the Government's \"interests in safeguarding [the nation's] borders and the public safety outweigh the privacy expectations of employees who seek to be promoted to positions that directly involve the interdiction of illegal drugs or that require the incumbent to carry a firearm,\" and thus that \"the testing of these employees is reasonable under the Fourth Amendment\" (Von Raab, (supra) , 489 U.S. at p. 677 [ 103 L. Ed. 2d at p. 709]), the court went on to consider whether such tests also were constitutionally reasonable with regard to the third category of employees to whom the drug testing program applied, employees who were required to handle classified material. The court indicated it agreed \"that the Government has a compelling interest in protecting truly sensitive information from those who . . . '. . . might compromise [such] information' [citations],\" and that \"employees who seek promotions to positions where they would handle sensitive information can be required to submit to a urine test under the Service's screening program, especially if the positions covered under this category require background investigations, medical examinations, or other intrusions that may be expected to diminish their expectations of privacy in respect of a urinalysis test.\" (489 U.S. at p. 677 [103 L. Ed. 2d at pp. 709-710].) The court, however, expressed concern whether this category of employees in fact \"encompasses only those Customs employees likely to gain access to sensitive information,\" suggesting that the record indicated that the category included \"those holding such diverse positions as 'Accountant,' 'Accounting Technician,' 'Animal Caretaker,' 'Attorney (All),' 'Baggage Clerk,' 'Co-op Student (All),' 'Electric Equipment Repairer,' 'Mail Clerk/Assistant,' and 'Messenger.' \" ( Id. at p. 678 [103 L. Ed. 2d at p. 710].) Because it was not evident to the court that all of the employees holding such positions were likely to gain access to sensitive information, the court concluded it was appropriate to remand the matter \"for such proceedings as may be necessary to clarify the scope of this category of employees subject to testing.\" (Ibid.) The lower court thus was directed, on remand, to \"examine the criteria used by the Service in determining what materials are classified and in deciding whom to test under this rubric,\" and also to consider, \"[i]n assessing the reasonableness of requiring tests of these employees,\" \"pertinent information bearing upon the employees' privacy expectations, as well as the supervision to which these employees are already subject.\" (Ibid.)\n\nThe court in Von Raab summarized its holding as follows: \"We hold that the suspicionless testing of employees who apply for promotion to positions directly involving the interdiction of illegal drugs, or to positions that require the incumbent to carry a firearm, is reasonable. The Government's compelling interests in preventing the promotion of drug users to positions where they might endanger the integrity of our Nation's borders or the life of the citizenry outweigh the privacy interests of those who seek promotion to these positions, who enjoy a diminished expectation of privacy by virtue of the special, and obvious, physical and ethical demands of those positions. We do not decide whether testing those who apply for promotion to positions where they would handle 'classified' information is reasonable because we find the record inadequate for this purpose.\" (489 U.S. at p. 679 [103 L. Ed. 2d at pp. 710-711].)\n\nC\n\nIn addition to the decisions in Skinner and Von Raab, the United States Supreme Court more recently decided another drug testing case-- Vernonia School Dist. 47J v. Acton (1995) 515 U.S. 646 [132 L. Ed. 2d 564, 115 S. Ct. 2386] (Vernonia)--that sheds some light on the proper application of the Fourth Amendment to the drug testing program here at issue. In Vernonia, the court considered the constitutional validity of a drug testing program, adopted by a school district, that required students who participate in school athletic programs to undergo urinalysis testing for drugs. In upholding the validity of drug testing in that context, the Vernonia decision placed very heavy reliance upon the circumstances that the program applied to children who had been committed to the temporary custody of the state as schoolmaster, and that students who choose to \"go out for\" a sport--\"[s]omewhat like adults who choose to participate in a 'closely regulated industry' \" (id. at p. [ 132 L. Ed. 2d at p. 577, 115 S. Ct. at p. 2393])--have a diminished expectation of privacy. Neither of those circumstances, of course, is directly relevant to the present case. In the course of its opinion, however, the court in Vernonia had occasion to address the nature or strength of the governmental interest that must be established in determining whether an intrusion is constitutionally \"reasonable\" for purposes of the Fourth Amendment and, in particular, whether a state is required to demonstrate that any intrusion upon privacy rights is justified by a \"compelling\" state interest.\n\nIn addressing this point, the court in Vernonia acknowledged that \"[i]n both Skinner and Von Raab, we characterized the government interest motivating the search as 'compelling' [citation]\" (Vernonia, (supra) , 515 U.S. at p. [ 132 L. Ed. 2d at p. 579, 115 S. Ct. at p. 2394]), and observed that both the district court and the Court of Appeals in Vernonia had relied upon Skinner and Von Raab to conclude that because the school drug testing program in Vernonia authorized drug testing in the absence of individualized suspicion, the school district was required to demonstrate that it had a \"compelling need\" for the program. The court in Vernonia went on to explain, however, that \"[i]t is a mistake . . . to think that the phrase 'compelling state interest,' in the Fourth Amendment context, describes a fixed, minimum quantum of governmental concern, so that one can dispose of a case by answering in isolation the question: Is there a compelling state interest here? Rather, the phrase describes an interest which appears important enough to justify the particular search at hand, in light of other factors which show the search to be relatively intrusive upon a genuine expectation of privacy. Whether that relatively high degree of government concern is necessary in this case or not, we think it is met.\" (Id. at p. [ 132 L. Ed. 2d at p. 579, 115 S. Ct. at pp. 2394-2395].) Thus, the Vernonia decision clarifies that, for purposes of the Fourth Amendment's \"reasonableness\" inquiry, the strength or importance of the governmental interest that is necessary to render a search reasonable generally will depend upon the relative intrusiveness of the governmental conduct on reasonable expectations of privacy: the more the conduct intrudes upon reasonable expectations of privacy, the more important or compelling the governmental interest must be to render the intrusion reasonable.\n\nD\n\nIn light of this review of the United States Supreme Court's decisions in Skinner, Von Raab, and Vernonia, a number of principles are clear. First, there can be no question but that the drug testing program adopted by the City of Glendale implicates the Fourth Amendment of the federal Constitution. Skinner, Von Raab, and Vernonia establish that urinalysis testing constitutes a \"search\" for Fourth Amendment purposes, and because the employer in this case, like the Customs Service in Von Raab and the school district in Vernonia, is a public entity to whom the Fourth Amendment is directly applicable, it follows that the city's drug testing program is constitutionally permissible only if the program satisfies the reasonableness requirement of the Fourth Amendment.\n\nAt the same time, Skinner, Von Raab, and Vernonia also establish that the city's drug testing program does not necessarily violate the Fourth Amendment simply because it imposes a drug testing requirement in the absence of a warrant and without a showing of individualized suspicion with regard to the persons to be tested. Skinner, Von Raab, and Vernonia demonstrate that, in some circumstances, a governmental entity may, consistent with the Fourth Amendment and without obtaining a warrant, require individuals to undergo urinalysis testing even though the government has no basis for suspecting that the individual currently is using drugs.\n\nThe question presented here, of course, is whether the particular drug testing program adopted by the city is consistent with the constitutional principles set forth in Skinner, Von Raab, and Vernonia. In support of its contention that its drug testing program is valid in its entirety, the city maintains that, as an employer, it has a strong interest in maintaining a drug-free workplace as to all employment positions, both because of the problems of diminished efficiency, increased absenteeism, and added health expenses that frequently result when an employee abuses drugs or alcohol, and in order to preserve the integrity of a workforce that is paid at public expense. The city points out that the information it seeks to obtain through the drug testing program--whether an applicant for employment or promotion currently is using illegal drugs or abusing alcohol--is information that is relevant to its decision whether to hire or promote the particular individual, and that could be the proper subject of inquiry in questioning the applicant, without violating his or her Fourth Amendment rights. Although the city acknowledges that the drug testing programs upheld in Skinner and Von Raab, unlike the program here at issue, did not apply to all public employment positions, it asserts that because of the significant problems posed by any employee who abuses drugs, the important governmental interests served by drug testing outweigh the intrusion on privacy inherent in urinalysis testing, particularly where, as here, the applicants for employment or promotion are informed at the outset of the selection process that such mandatory drug testing is a part of the process and can avoid such testing simply by not applying for employment with the city or for promotion.\n\nThe lower courts, in analyzing the constitutionality of the city's challenged drug testing program under Skinner and Von Raab, did not draw any distinction between the program's application to current employees who are seeking promotion and to job applicants who are seeking employment. We believe, however, it is useful and appropriate to evaluate separately the validity of the program as applied in the prepromotional and preemployment contexts.\n\n1\n\nAs applied to current employees who are seeking promotion, we believe that the city's argument--that suspicionless urinalysis testing for drugs is permissible without regard to the nature of the employment position in question--is inconsistent with the decision in Von Raab, (supra) , 489 U.S. 656. As we have seen, in Von Raab the United States Supreme Court addressed the validity of the Customs Service's drug testing program that, like the program here at issue, applied to current employees who had sought transfer or promotion to a new position that had been offered conditioned upon their successful completion of a urinalysis drug test. As in the present case, the employees were informed at the time they sought transfer or promotion that drug screening would be required, and the drug testing protocol provided for indirect monitoring of the urination process. ( Id. at pp. 661, 672, fn. 2 [103 L. Ed. 2d at pp. 699, 706].)\n\nWe believe that a fair reading of the decision in Von Raab makes it clear that although the court concluded that sufficiently important governmental interests justify the imposition of suspicionless drug testing for employment positions involving the interdiction of drugs, the carrying of a firearm, and the handling of truly sensitive information, the court also determined that it is not constitutionally \"reasonable,\" under the Fourth Amendment, for a governmental employer to conduct suspicionless urinalysis drug testing of all current public employees seeking promotion, regardless of the nature or duties of the position at issue.\n\nSeveral aspects of the Von Raab decision support this Conclusion. First, the opinion in Von Raab took pains to discuss in some detail both the nature of the job categories to which the drug testing program applied and the special importance of the governmental interest in ensuring that persons who use illegal drugs are not promoted or transferred into such positions. (See 489 U.S. at pp. 667-672 [103 L. Ed. 2d at pp. 703-706].) If the general governmental interest in promoting a drug-free workplace were sufficient, in itself, to warrant suspicionless urine testing for all employment positions, there would have been no reason for the opinion in Von Raab to emphasize the special aspects of the particular job classifications at issue in that case.\n\nSecond, after setting forth the strength of the government's interests in ensuring that employees who are engaged directly in drug interdiction or who are required to carry firearms are not using illegal drugs, the court in Von Raab went on to explain: \"Against these valid public interests we must weigh the interference with individual liberty that results from requiring these classes of employees to undergo a urine test. The interference with individual privacy that results from the collection of a urine sample for subsequent chemical analysis could be substantial in some circumstances. [Citation.] We have recognized, however, that the 'operational realities of the workplace' may render entirely reasonable certain work-related intrusions by supervisors and co-workers that might be viewed as unreasonable in other contexts. [Citation.] While these operational realities will rarely affect an employee's expectations of privacy with respect to searches of his person, or of personal effects the employee may bring to the workplace, . . . it is plain that certain forms of public employment may diminish privacy expectations even with respect to such personal searches. Employees of the United States Mint, for example, should expect to be subject to certain routine personal searches when they leave the workplace every day. . . . We think Customs Service employees who are directly involved in the interdiction of illegal drugs or who are required to carry firearms in the line of duty likewise have a diminished expectation of privacy in respect to the intrusions occasioned by a urine test. Unlike most private citizens or government employees in general, employees involved in drug interdiction reasonably should expect effective inquiry into their fitness and probity. Much the same is true of employees who are required to carry firearms.\" (489 U.S. at pp. 671-672 [103 L. Ed. 2d at pp. 705-706], italics added.)\n\nBecause the court in Von Raab explicitly contrasted the reasonable expectations of privacy of employees who seek Customs Service positions involving drug interdiction, or the carrying of a firearm, from the reasonable expectations of \"government employees in general,\" the Von Raab decision cannot be read to support the Conclusion that the \"operational realities of the workplace\"--including the legitimate interest in a drug-free workplace--provide a sufficient justification for requiring all public employees who apply for promotion to undergo drug testing.\n\nThird, this reading of the Von Raab decision is further supported by the court's Discussion of the third category of employment positions to which the Customs Service's drug testing program applied, positions involving the handling of classified material. As noted above, with regard to this category of positions, the court in Von Raab concluded that it was \"unable, on the present record, to assess the reasonableness of the Government's testing program insofar as it covers employees who are required 'to handle classified material.' \" (489 U.S. at p. 677 [103 L. Ed. 2d at p. 709].) The court explained that although it agreed \"that employees who seek promotions to positions where they would handle sensitive information can be required to submit to a urine test under the Service's screening program, especially if the positions covered under this category require background investigations, medical examinations, or other intrusions that may be expected to diminish their expectations of privacy in respect of a urinalysis test . . .\" (ibid.), it was unclear \"whether the category defined by the Service's testing directive encompasse[d] only those Customs employees likely to gain access to sensitive information\" ( id. at p. 678 [103 L. Ed. 2d at p. 710]), because of the nature of some of the positions (for example, baggage clerks, assistant mail clerks, and messengers) that the record suggested fell within this category.\n\nConcluding that it was appropriate to remand the case to the lower courts for such proceedings as might be necessary to clarify the scope of this category of employees subject to testing, the court directed that, on remand, the lower courts \"should examine the criteria used by the Service in determining what materials are classified and in deciding whom to test under this rubric.\" (Von Raab, (supra) , 489 U.S. at p. 678 [ 103 L. Ed. 2d at p. 710].) The high court additionally specified that \"[i]n assessing the reasonableness of requiring tests of these employees, the court should also consider pertinent information bearing upon the employees' privacy expectations, as well as the supervision to which these employees are already subject.\" (Ibid.) Such a remand would have been totally unnecessary and unwarranted, of course, if an employer's legitimate interest in a drug-free workplace were sufficient to render suspicionless urine testing reasonable with regard to all government employees seeking promotion to a new position. In short, the high court's remand in Von Raab with regard to the issue of the reasonableness of the testing program as applied to employees who handle classified material is totally incompatible with the city's contention that across-the-board drug testing of current employees conditionally approved for promotion is permissible under the Fourth Amendment. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nAccordingly, we conclude that the Von Raab decision establishes that, for purposes of the Fourth Amendment to the federal Constitution, it is not constitutionally permissible for a governmental employer to require urinalysis drug testing of every current governmental employee who applies for promotion to another governmental position--without regard to the nature of the position sought--but rather that the reasonableness of such testing turns upon the nature and duties of the position in question. Subsequent federal circuit court decisions that have reviewed drug testing in a variety of circumstances uniformly have interpreted Von Raab in this manner, rejecting any suggestion that an across-the-board testing requirement, applicable to all current governmental employees, can be sustained in the face of the decision in Von Raab. (See, e.g., Harmon v. Thornburgh (D.C. Cir. 1989) 878 F.2d 484, 492-493 [278 App.D.C. 382]; id. at p. 496 (conc. and dis. opn. by Silberman, J.); IBEW, Local 1245 v. Skinner (9th Cir. 1990) 913 F.2d 1454, 1461-1463 \u0026 cases cited in fn. 26.) Thus, we conclude that insofar as the City of Glendale's program imposes a drug testing requirement upon every current employee who applies for and is offered a promotion, without regard to the nature of the position sought, the program is unconstitutional under Von Raab. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n2\n\nAs applied to job applicants, however, the determination of the validity, under the Fourth Amendment, of the city's drug testing program is not as clear. Neither Skinner nor Von Raab addressed the question of the validity of drug testing of job applicants, and two federal decisions that have addressed the question of the validity of preemployment drug testing of all job applicants in the wake of Skinner and Von Raab have reached conflicting Conclusions. (Compare Willner v. Thornburgh (D.C. Cir. 1991) 928 F.2d 1185, 1188-1194 [289 App.D.C. 93] [upholding drug testing of all applicants for attorney positions with the Department of Justice (including applicants for the antitrust division), relying on rationale that applies to job applicants in general] with Georgia Ass'n of Educators v. Harris (N.D.Ga. 1990) 749 F. Supp. 1110, 1114-115 [striking down a Georgia statute that authorized preemployment drug testing of all applicants for state employment]; see also Marcus \u0026 Smolla, Introduction: A Balanced Approach to Drug Testing in the Workplace (1991) 33 Wm. \u0026 Mary L.Rev. 1, 2-3 [members of task force evenly divided on drug testing of all job applicants]; Proposal for a Substance Abuse Testing Act: the Report of the Task Force on the Drug-Free Workplace, Institute of Bill of Rights Law (1991) 33 Wm. \u0026 Mary L.Rev. 5, 25-26 [alternative proposed provisions relating to applicant drug testing].) \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAlthough the United States Supreme Court has not yet spoken on the issue, we conclude that when, as in the case before us, the drug screening program is administered in a reasonable fashion as part of a lawful preemployment medical examination that is required of each job applicant, drug testing of all job applicants is constitutionally permissible under the Fourth Amendment even though similar drug testing of current employees seeking promotion is not. As the Skinner, Von Raab, and Vernonia decisions establish, in evaluating the \"reasonableness\" of a drug testing program for purposes of the Fourth Amendment, it is necessary to weigh the importance or strength of the governmental interest supporting suspicionless drug testing against the intrusion on reasonable expectations of privacy imposed by such testing. As we explain, we conclude that an employer has a significantly greater need for, and interest in, conducting suspicionless drug testing of job applicants than it does in conducting similar testing of current employees, and also that a drug testing requirement imposes a lesser intrusion on reasonable expectations of privacy when the drug test is conducted as part of a lawful preemployment medical examination that a job applicant is, in any event, required to undergo. Because of these significant differences in both the strength of the interest supporting preemployment drug testing and in the diminished intrusion upon reasonable expectations of privacy implicit in the testing, we conclude that in the preemployment context, unlike the prepromotional context, such drug testing is reasonable, and hence constitutionally permissible, under the Fourth Amendment.\n\nWe begin with a consideration of the interest supporting suspicionless drug testing of all job applicants. In light of the well-documented problems that are associated with the abuse of drugs and alcohol by employees--increased absenteeism, diminished productivity, greater health costs, increased safety problems and potential liability to third parties, and more frequent turnover \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e --an employer, private or public, clearly has a legitimate (i.e., constitutionally permissible) interest in ascertaining whether persons to be employed in any position currently are abusing drugs or alcohol. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Although this interest logically could support drug testing of current employees as well as job applicants, an employer generally need not resort to suspicionless drug testing to determine whether a current employee is likely to be absent from work or less productive or effective as a result of current drug or alcohol abuse: an employer can observe the employee at work, evaluate his or her work product and safety record, and check employment records to determine whether the employee has been excessively absent or late. If a current employee's performance and work record provides some basis for suspecting that the employee presently is abusing drugs or alcohol, the employer will have an individualized basis for requesting that the particular employee undergo drug testing, and current employees whose performance provides no reason to suspect that they currently are using drugs or abusing alcohol will not be compelled to sustain the intrusion on their privacy inherent in mandatory urinalysis testing. (See 4 LaFave, (supra) , § 10.3(e), pp. 498-500.)\n\nWhen deciding whether to hire a job applicant, however, an employer has not had a similar opportunity to observe the applicant over a period of time. Although the employer can request information regarding the applicant's performance in past jobs or in nonemployment settings, an employer reasonably may lack total confidence in the reliability of information supplied by a former employer or other references. And although an employer will, of course, obtain the opportunity to make its own observations after it has hired the applicant, the hiring of a new employee frequently represents a considerable investment on the part of an employer, often involving the training of the new employee. Furthermore, once an applicant is hired, any attempt by the employer to dismiss the employee generally will entail additional expenses, including those relating to the hiring of a replacement. In view of these considerations, we believe that an employer has a greater need for, and interest in, conducting suspicionless drug testing of job applicants than it does in conducting such testing of current employees. (See 4 LaFave, (supra) , § 10.3(e), p. 504.)\n\nTurning to the degree of the intrusion on reasonable expectations of privacy imposed by the city's drug testing program, we believe that the intrusion on privacy is significantly diminished because the drug testing urinalysis in this case was administered as part of a preemployment medical examination that the job applicant, in any event, would have been required to undergo. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Although, as the Skinner and Von Raab decisions indicate, a requirement that an individual submit to a monitored urinalysis test ordinarily represents a significant intrusion on individual privacy (Skinner, (supra) , 489 U.S. 602, 626 [ 103 L. Ed. 2d 639, 665-666]; Von Raab, (supra) , 489 U.S. 656, 671 [ 103 L. Ed. 2d 685, 705-706]), neither Skinner nor Von Raab considered whether the intrusion on privacy rises to that level when such drug testing is not administered as a separate procedure (as it was in Skinner and Von Raab) but rather is conducted as part of a comprehensive medical examination that already includes a urinalysis component.\n\nWe believe that, from a realistic standpoint, requiring an individual to undergo a complete medical examination generally entails a significantly greater intrusion on privacy than simply requiring him or her to provide a urine sample for drug testing. After all, a medical examination, in itself, ordinarily requires the individual not only to submit a urine sample but in addition to provide a medical history and to undergo a physical examination that entails an intrusive touching of one's body by a physician. (See generally, Krupp et al., Physician's Handbook (18th ed. 1976) pp. 22-31 [summarizing elements of ordinary physical examination and laboratory data].) Although in this case the city's addition of the drug screening test to its preexisting medical examination procedure was accompanied by the institution of several new security measures (such as the aural monitoring of the urinalysis process) that entailed some additional intrusion on the applicant's privacy with regard to provision of the urine sample, the incremental intrusion on privacy attributable to these new measures appears rather minor when viewed in the context of a complete medical examination. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nOf course, if requiring a job applicant to undergo a preemployment medical examination itself would constitute an unconstitutional intrusion on privacy, the circumstance that the addition of a drug testing component to a medical examination represents only a minimal incremental intrusion on privacy would provide an inadequate basis for finding the intrusive effect of the drug test to be minimal for constitutional purposes. Plaintiff in this case, however, has not contended that the city's examination procedure is unlawful insofar as it requires all job applicants who have been offered employment to submit to a medical examination as a condition of their hiring, and plaintiff has not cited, and our independent research has not revealed, any authority suggesting it is impermissible for an employer to require all job applicants to submit to medical examinations without regard to the nature of the position in question.\n\nIn this respect, the position of job applicants appears to differ from that of current employees. As we have noted above in connection with the Discussion of plaintiff's statutory claim, the recently enacted federal ADA contains a number of provisions addressing the circumstances under which an employer may require a job applicant or a current employee to undergo a medical examination. Under the ADA, an employer is prohibited from requiring any applicant to submit to a medical examination before the employer has made an offer of employment to the applicant, but once an employer has made a conditional offer of employment the ADA specifically provides that the employer may require the applicant to undergo a medical examination and may condition its offer of employment on the results of the examination so long as all entering employees are required to undergo such an examination (42 U.S.C.S. § 12112(d)(2), (3)). Furthermore, under the ADA, preemployment, postoffer \"[m]edical examinations . . . do not have to be job-related and consistent with business necessity.\" (29 C.F.R. § 1630.14(b)(3) (1996).) By contrast, once an employee has been hired and has begun working, the ADA provides that an employer \"shall not require a medical examination . . . unless such examination . . . is shown to be job-related and consistent with business necessity.\" (42 U.S.C.S. § 12112(d)(4)(A).)\n\nAccordingly, under the ADA, while an employer may require a job applicant to submit to a preemployment, postoffer medical examination without regard to the nature of the position being filled, an employer may require a current employee who is seeking a promotion to submit to a medical examination only if the examination is shown to be \"job-related and consistent with business necessity\" (42 U.S.C.S. § 12112(d)(4)(A)), a standard that would appear to require at least some consideration of whether the nature and duties of the employment position to which the current employee is seeking promotion differ in some relevant respect from those of the employee's current position so as to provide a job-related justification for a medical examination. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nAlthough the current provisions of the ADA are not, of course, determinative of the scope of a job applicant's reasonable expectation of privacy (for Fourth Amendment purposes) with regard to medical examinations, we believe the statute does accurately reflect the general societal understanding that a requirement that all job applicants submit to a medical examination prior to hiring does not violate a job applicant's reasonable expectation of privacy. As one federal court has observed: \"Pre-employment physical examination, including urinalysis, is simply too familiar a feature of the job market on all levels to permit anyone to claim an objectively based expectation of privacy in what such analysis might disclose.\" ( Fowler v. New York City Dept. of Sanitation (S.D.N.Y. 1989) 704 F. Supp. 1264, 1270; see also Decker, Employee Privacy Law and Practice (1995 supp.) § 6. 15 A, p. 109 [\"The employer's right to require applicants to undergo a physical examination is considered basic to the hiring process.\"].) \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThus, we conclude that an employer has a significantly greater interest in conducting suspicionless drug testing of job applicants than it does in testing current employees seeking promotion, and that the imposition of a urinalysis drug testing requirement on job applicants as part of a lawful preemployment medical examination involves a lesser intrusion on reasonable expectations of privacy than does testing conducted independently of such an examination. In balancing an employer's interest in suspicionless drug testing in this context against the intrusion on a job applicant's reasonable expectation of privacy, we conclude that the city's urinalysis drug testing of job applicants, administered as part of a lawful preemployment medical examination, is \"reasonable\" within the meaning of the Fourth Amendment. We believe that this is one of the \"limited circumstances,\" referred to in Skinner, \"where the privacy interests implicated by the search are minimal, and where an important governmental interest furthered by the intrusion would be placed in jeopardy by a requirement of individualized suspicion . . . .\" (Skinner, (supra) , 489 U.S. at p. 624 [ 103 L. Ed. 2d at p. 664].)\n\nE\n\nIn sum, we conclude that the city's across-the-board urinalysis drug testing program violates the Fourth Amendment of the federal Constitution as applied to current city employees seeking promotion to another city position, but that the program does not violate the Fourth Amendment as applied to job applicants.\n\nIV\n\nBecause we have concluded that the federal Constitution precludes the city from applying its drug testing program to all current employees seeking promotion without regard to the nature of the position sought, there is no need to determine whether such testing of current employees also would violate the provisions of the California Constitution. On the other hand, having concluded that the city's urinalysis drug testing of all job applicants is permissible under the federal Constitution, we are required to address plaintiff's claim that, even if such testing is valid under the federal Constitution, the drug testing of job applicants is invalid under the privacy provision--article I, section 1--of the California Constitution.\n\nAs noted at the outset of this opinion, this court previously has not had occasion to ascertain the validity of any employment-related drug testing program, either of current employees or of job applicants, under the state Constitution. In Wilkinson v. Times Mirror Corp. (1989) 215 Cal. App. 3d 1034 [264 Cal. Rptr. 194] (Wilkinson), however, the Court of Appeal addressed a state constitutional challenge to a preemployment drug testing program that shared many of the characteristics of the drug testing program here at issue. In Wilkinson, the employer (a private publishing company) informed every applicant who had received a conditional offer of employment that the offer was contingent upon the applicant's taking and passing a medical examination, which included a medical history, certain diagnostic tests, and a urine test for drugs and alcohol. The applicants were referred to a medical clinic for the examination, where they were asked to disclose all medications they had taken within the preceding 72 hours and were required to provide a urine sample for testing. (The opinion notes that the collection of urine was not observed (215 Cal. App. 3d at p. 1049), but does not indicate whether aural monitoring or other security measures existed to deter or detect adulteration or fraud.) If an applicant tested positive for drugs or alcohol (and the result was not adequately justified by the lawful medications the applicant had disclosed), the medical clinic would inform the employer that the applicant was medically disqualified, a description that also was applied to other medical disqualifications.\n\nIn evaluating the validity of this preemployment drug testing program, the court in Wilkinson first concluded that the state constitutional privacy clause, unlike the Fourth Amendment to the federal Constitution, applied to the conduct of the private employer involved in that case. (215 Cal. App. 3d at pp. 1039-1044.) Thereafter, the court in Wilkinson went on to uphold the validity of the preemployment drug testing program under the state Constitution, relying heavily upon its determination that (1) a job applicant reasonably must anticipate being required to take a preemployment physical examination that usually includes a urinalysis, and (2) subjecting the applicant's urine sample to additional analysis for the presence of illegal drugs or alcohol constitutes only a slight additional intrusion on privacy over that inherent in a preemployment medical examination. The court in Wilkinson found that because drug testing of job applicants as part of a required preemployment medical examination imposes a relatively minimal intrusion on the applicants' reasonable expectations of privacy, the employer's interest in conducting such tests was sufficient to render the intrusion on privacy reasonable and permissible under the state Constitution. ( Id. at pp. 1046-1052.)\n\nWilkinson was decided a number of years prior to this court's decision in Hill v. National Collegiate Athletic Assn. (1994) 7 Cal. 4th 1 [26 Cal. Rptr. 2d 834, 865 P.2d 633] (Hill), in which our court undertook an in-depth analysis of the scope and proper application of the state constitutional privacy clause. In view of the significance of the Hill decision, we shall review that decision in some detail.\n\nA\n\nIn Hill, (supra) , 7 Cal. 4th 1, college athletes brought an action for injunctive relief against the National Collegiate Athletic Association (NCAA), asserting that a drug testing program, instituted by the NCAA and applied to student athletes participating in NCAA-sponsored events, violated the students' right of privacy under article I, section 1, of the California Constitution. Under the program, student athletes seeking to participate in NCAA-sponsored competition were required, at the beginning of each year of competition, to sign a drug-testing consent form, authorizing the NCAA to conduct drug tests on the athlete for specified drugs (including stimulants, anabolic steroids, and street drugs) in accordance with established NCAA procedures; failure to sign the form rendered the athlete ineligible to participate in NCAA-sponsored competition. Under the program, all student athletes who participated in championship events or postseason bowl games potentially were subject to urinalysis drug testing. When an athlete at such an event was notified that he or she had been selected for testing, the athlete was required to report promptly to a collection station and to provide a urine sample in the presence of an NCAA monitor of the same sex as the athlete. The specimen then was sent to a laboratory for testing. A positive test resulted in the suspension or revocation of the student's eligibility for NCAA competition.\n\nIn determining whether the NCAA drug testing program violated the state constitutional privacy provision, the court in Hill turned first to the question whether the California constitutional right of privacy applied to a nongovernmental entity such as the NCAA. Although a number of prior Court of Appeal decisions, including the Wilkinson decision noted above, had held that the state constitutional privacy clause applies to private entities as well as governmental entities, our court had not resolved that issue prior to Hill. After considering the ballot arguments that were before the voters in 1972 when they added to article I, section 1, of the Constitution the explicit reference to \"privacy,\" and the Court of Appeal decisions on this issue, the court in Hill held that the state constitutional privacy provision applies to \"private as well as government entities.\" (7 Cal. 4th at p. 20).\n\nHaving determined that the NCAA was subject to the state constitutional privacy provision, the court in Hill considered the appropriate standard to be applied in determining whether the NCAA drug testing program at issue in that case violated the state constitutional privacy provision. The lower courts in Hill had ruled that, under the state constitutional privacy clause, the NCAA bore the burden of proving both (1) that its drug testing program was supported by a \"compelling state interest,\" and (2) the absence of any less intrusive alternative means of accomplishing that interest. Determining that the NCAA had failed to meet this burden, the lower courts found the drug testing program unconstitutional. After carefully and thoroughly canvassing (1) the ballot arguments accompanying the privacy initiative, (2) the various sources of the right of privacy (in both common law and federal constitutional authorities) that preceded the voters' incorporation of an explicit right of privacy into the California Constitution, and (3) prior California cases interpreting and applying the state constitutional privacy provision, the court in Hill concluded that the lower courts had utilized an improper standard in evaluating the constitutional validity of the challenged NCAA drug testing program under the state constitutional privacy clause. The court in Hill rejected the proposition \"that every assertion of a privacy interest under article I, section 1, must be overcome by a 'compelling interest' \" (7 Cal. 4th at pp. 34-35) and explained that \"[i]n view of the far-reaching and multifaceted character of the right to privacy, such a standard imports an impermissible inflexibility into the process of constitutional adjudication.\" ( Id. at p. 35.) In this regard, the court noted that, although some of the prior California decisions applying the state constitutional privacy provision \"use 'compelling interest' language[,] others appear to rely on balancing tests giving less intense scrutiny to nonprivacy interests. The particular context, i.e., the specific kind of privacy interest involved and the nature and seriousness of the invasion and any countervailing interests, remains the critical factor in the analysis. Where the case involves an obvious invasion of an interest fundamental to personal autonomy, e.g., freedom from involuntary sterilization or the freedom to pursue consensual familial relationships, a 'compelling interest' must be present to overcome the vital privacy interest. If, in contrast, the privacy interest is less central, or in bona fide dispute, general balancing tests are employed.\" ( Id. at p. 34, fn. omitted.)\n\nThe court in Hill then went on to consider \"the correct legal standard to be applied in assessing plaintiffs' claims for invasion of privacy\" (7 Cal. 4th at p. 35), articulating three \"elements\" of a cause of action for violation of the state constitutional right of privacy and discussing the \"defenses\" that might be asserted against such a cause of action. ( Id. at pp. 35-59.) The court stated in this regard that \"a plaintiff alleging an invasion of privacy in violation of the state constitutional right to privacy must establish each of the following: (1) a legally protected privacy interest; (2) a reasonable expectation of privacy in the circumstances; and (3) conduct by defendant constituting a serious invasion of privacy.\" ( Id. at pp. 39-40.) \"A defendant may prevail in a state constitutional privacy case by negating any of the three elements just discussed or by pleading and proving, as an affirmative defense, that the invasion of privacy is justified because it substantively furthers one or more countervailing interests.\" ( Id. at p. 40.) \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The court further held that \"[t]he plaintiff, in turn, may rebut a defendant's assertion of countervailing interests by showing there are feasible and effective alternatives to defendant's conduct which have a lesser impact on privacy interests.\" (Ibid.)\n\nThe three \"elements\" set forth in Hill --a legally protected privacy interest, reasonable expectation of privacy, and serious invasion of privacy--should not be interpreted as establishing significant new requirements or hurdles that a plaintiff must meet in order to demonstrate a violation of the right to privacy under the state Constitution--hurdles that would modify substantially the traditional application of the state constitutional privacy provision (and diminish the protection provided by that provision), by authorizing, in a wide variety of circumstances, the rejection of constitutional challenges to conduct or policies that intrude upon privacy interests protected by the state constitutional privacy clause, without any consideration of the legitimacy or importance of a defendant's reasons for engaging in the allegedly intrusive conduct and without balancing the interests supporting the challenged practice against the severity of the intrusion imposed by the practice.\n\nUnder such an interpretation, Hill would constitute a radical departure from all of the earlier state constitutional decisions of this court cited and discussed in Hill (7 Cal. 4th at p. 34, fn. 11), decisions that uniformly hold that when a challenged practice or conduct intrudes upon a constitutionally protected privacy interest, the interests or justifications supporting the challenged practice must be weighed or balanced against the intrusion on privacy imposed by the practice. (See, e.g., White v. Davis (1975) 13 Cal. 3d 757, 776 [120 Cal. Rptr. 94, 533 P.2d 222] [intrusion on college student's privacy interest resulting from unwarranted government surveillance of classroom Discussion can be justified only if compelling interest is served by the surveillance]; Valley Bank of Nevada v. Superior Court (1975) 15 Cal. 3d 652, 656-658 [125 Cal. Rptr. 553, 542 P.2d 977] [intrusion on bank customer's privacy interest in bank records balanced against civil litigant's right to discover relevant facts]; Loder v. Municipal Court (1976) 17 Cal. 3d 859, 864-877 [132 Cal. Rptr. 464, 553 P.2d 624] [governmental interest in retaining arrest record outweighs intrusion on arrestee's privacy interest in preventing improper uses of record]; City of Santa Barbara v. Adamson (1980) 27 Cal. 3d 123, 131-134 [164 Cal. Rptr. 539, 610 P.2d 436, 12 A.L.R.4th 219] [intrusion on resident's privacy interest in living with unrelated persons not justified by governmental interests underlying local zoning ordinance]; Committee to Defend Reproductive Rights v. Myers (1981) 29 Cal. 3d 252, 273-282 [172 Cal. Rptr. 866, 625 P.2d 779, 20 A.L.R.4th 1118] [intrusion on indigent women's privacy interest in reproductive choice outweighs governmental interests served by funding childbirth but not abortion]; Doyle v. State Bar (1982) 32 Cal. 3d 12, 19-21 [184 Cal. Rptr. 720, 648 P.2d 942] [intrusion on clients' privacy interest in trust account records in custody of attorney outweighed by governmental interest in State Bar investigation of possible attorney malfeasance]; People v. Stritzinger (1983) 34 Cal. 3d 505, 511-514 [194 Cal. Rptr. 431, 668 P.2d 738] [intrusion on patient's privacy interest in confidentiality of psychotherapy session not justified by governmental interests under the particular circumstances of that case]; Conservatorship of Valerie N. (1985) 40 Cal. 3d 143, 163-168 [219 Cal. Rptr. 387, 707 P.2d 760] [intrusion on conservatee's privacy interest in reproductive choice and control of her body is not justified by the governmental interest served by absolute prohibition of conservator-authorized sterilization]; Long Beach City Employees Assn. v. City of Long Beach, (supra) , 41 Cal. 3d 937, 943-948 \u0026 fn. 12 [intrusion on employee's privacy interest imposed by polygraph examination could be justified only by demonstration that examination served a compelling interest that could not be accomplished by less intrusive means]; Schmidt v. Superior Court (1989) 48 Cal. 3d 370, 389-390 [256 Cal. Rptr. 750, 769 P.2d 932] [minimal intrusion on privacy interest imposed by mobilehome park rule excluding persons under 25 years of age was outweighed by interests supporting rule].) Nothing in Hill suggests that the court intended to reject the constitutional analysis applied in all of these cases.\n\nFurthermore, an interpretation of Hill that would permit the rejection of a claim involving a significant intrusion upon a constitutionally protected privacy interest--without considering or weighing the justifications supporting the intrusive conduct--not only would discard the basic constitutional analysis consistently applied by California courts for the past two decades in resolving claims under the state constitutional privacy clause, but also would signify that the California Constitution, which includes an express provision guaranteeing the right of privacy, would provide substantially less protection of that right than does the federal Constitution, in which the right of privacy is only implied. In analyzing federal constitutional privacy claims under the Fourth Amendment or the due process clauses of the Fifth or Fourteenth Amendments, federal decisions--after finding an intrusion upon a constitutionally protected privacy interest--uniformly consider the validity and importance of the interests supporting the challenged conduct, and weigh those interests against the severity of the intrusion in resolving the constitutional question. (See, e.g., Skinner, (supra) , 489 U.S. 602, 624-633 [ 103 L. Ed. 2d 639, 664-670]; Von Raab, (supra) , 489 U.S. 656, 667-677 [ 103 L. Ed. 2d 685, 667-710]; Vernonia, (supra) , 515 U.S. 646, [ 132 L. Ed. 2d 564, 573-582, 115 S. Ct. 2386, 2390-2397]; Planned Parenthood of Southeastern Pa. v. Casey (1992) 505 U.S. 833, 869-901 [120 L. Ed. 2d 674, 709-730, 112 S. Ct. 2791].) Nothing in the ballot arguments considered by the electors who voted to incorporate an express protection of privacy into the California Constitution suggested that the provision would be less protective of privacy than the federal Constitution, and, since its enactment, the state constitutional privacy provision never has been so interpreted. (See, e.g., City of Santa Barbara v. Adamson, (supra) , 27 Cal. 3d 123, 130, fn. 3; Committee to Defend Reproductive Rights v. Myers, (supra) , 29 Cal. 3d 252, 262-263.)\n\nAccordingly, the three \"elements\" set forth in Hill properly must be viewed simply as \"threshold elements\" that may be utilized to screen out claims that do not involve a significant intrusion on a privacy interest protected by the state constitutional privacy provision. These elements do not eliminate the necessity for weighing and balancing the justification for the conduct in question against the intrusion on privacy resulting from the conduct in any case that raises a genuine, nontrivial invasion of a protected privacy interest. As we have noted, Hill was the first case in which our court addressed the question whether the state constitutional privacy clause applies to private as well as to governmental entities. Having concluded that the privacy clause applies to private entities and also that the legal concept of \"privacy\" potentially has a very broad sweep, the court in Hill determined that it was appropriate to articulate several threshold elements that may permit courts to weed out claims that involve so insignificant or de minimis an intrusion on a constitutionally protected privacy interest as not even to require an explanation or justification by the defendant. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Hill cannot properly be read, however, to have adopted a sweeping new rule under which a challenge to conduct that significantly affects a privacy interest protected by the state Constitution may be rejected without any consideration of either the legitimacy or strength of the defendant's justification for the conduct.\n\nThis understanding of the proper role of the elements set forth in Hill is confirmed by a review of the application of these elements in Hill itself. In analyzing the validity of the NCAA drug testing program, the court in Hill began by recognizing that the first element--a \"legally protected privacy interest\"--clearly was satisfied, because the drug testing program impacted a student athlete's constitutionally protected privacy interests in two respects: (1) the testing intruded upon a student's interest in \"autonomy privacy\" insofar as it required the athlete to provide a urine sample in a monitored setting, and (2) the testing implicated a student's interest in \"informational privacy\" insofar as the urinalysis provided the NCAA with personal and confidential information regarding the student's medical condition and the student was required to disclose the medications that he or she currently was taking. (7 Cal. 4th at pp. 40-41.)\n\nThereafter, in discussing the second and third elements--\"reasonable expectation of privacy\" and \"seriousness of invasion\"--in relationship to the intrusion upon autonomy privacy, the court in Hill concluded that although the ordinary conditions of collegiate athletics (in which undressing in locker rooms and the use of shared shower facilities is a usual occurrence) and the student's advance notice of the testing requirement diminished the testing's intrusion upon a student athlete's reasonable expectations of autonomy privacy, the student's privacy interests \"are not thereby rendered de minimis,\" and \"[t]he NCAA's use of a particularly intrusive monitored urination procedure justifies further inquiry, even under conditions of decreased expectations of privacy.\" (7 Cal. 4th at p. 43, italics added.) Similarly, in applying the \"reasonable expectation\" and \"seriousness of invasion\" elements with regard to the drug testing's intrusion on informational privacy, the court again concluded that although a student athlete's reasonable expectations with regard to informational privacy also were diminished by virtue of the athletic setting, \"[d]irected and specific inquiries about personal medications (including questions about birth control pills) in the potentially stressful circumstances of a random drug test are undoubtedly significant from a privacy standpoint,\" and \"[ w ] ithout a correspondingly important 'reason to know,' the NCAA would have no right to demand answers to these kinds of questions.\" (7 Cal. 4th at p. 53, italics added.) Thus, the court in Hill considered the elements simply to determine whether the intrusion on privacy imposed by the drug testing was so insignificant or de minimis that the court did not even have to consider the NCAA's justification for the testing, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e and, in each instance, concluded that it was required to evaluate and balance the NCAA's justification for the drug testing against the relative intrusiveness of the testing in order to determine the validity of the testing program under the state constitutional privacy provision.\n\nThereafter, in undertaking the balancing process, the court in Hill found that the challenged drug testing program was supported by two legitimate interests of the NCAA: its interest in maintaining the integrity of intercollegiate athletic competition and its interest in protecting the health and safety of student athletes. Weighing the significance of these interests against the diminished intrusion on privacy imposed by drug testing in the context of intercollegiate athletics, the court in Hill concluded that the NCAA drug testing program did not violate the right to privacy guaranteed by the state Constitution.\n\nAfter reaching this Conclusion with regard to the NCAA student athletics drug testing program, the decision in Hill added some cautionary remarks specifically related to drug testing in the employment context. The court stated: \"In generally upholding the NCAA's drug testing program against plaintiffs' privacy challenge, we intimate no views about the legality of blanket or random drug testing conducted by employers, whether of current employees or applicants for employment, or by other kinds of entities. Employment settings are diverse, complex, and very different from intercollegiate athletic competition. Reasonable expectations of privacy in those settings are generally not diminished by the emphasis on bodily condition, physical training, and extracurricular competition inherent in athletics. In the government employment context, for example, the Fourth Amendment protection against unreasonable searches and seizures has generally been interpreted to require more than an employer interest in employee job performance or a 'drug-free workplace' to justify drug testing without reasonable suspicion. Drug testing has been upheld when particular kinds of employment settings--including prison guarding, train operations, or customs inspection--present extraordinary risks to employer or public interests from employee drug use. As one federal court commented: 'No one would want to live in an Orwellian world in which the government assured a drug-free America by randomly testing the urine of all its citizens.' [Citation.] What requirements are imposed on private employers by the California constitutional right to privacy will depend upon the application of the elements and considerations we have discussed to the employer's special interests and the employee's reasonable expectations prevailing in a particular employment setting. We are not called upon to decide any such issues here.\" (7 Cal. 4th at pp. 54-55, fns. omitted.)\n\nB\n\nIn contrast to Hill, of course, the present case does require us to consider the validity, under the state Constitution, of a drug testing program imposed in the employment context. In view of our Conclusion that the city's drug testing of all current employees seeking promotion is unconstitutional under the federal Constitution, however, the state constitutional issue is a rather narrow one: Does the city's drug testing program violate the state constitutional right of privacy insofar as it requires all job applicants to submit to urinalysis drug testing as part of a preemployment medical examination?\n\nIn resolving this question, we begin by recognizing that the drug testing program unquestionably implicates privacy interests protected by the state Constitution. As the Hill decision establishes, a procedure that (1) requires individuals to provide a urine sample under monitored conditions, (2) authorizes the administering entity to test the sample in order to acquire information concerning the internal state of the tested individual's body, and (3) requires an individual to disclose medications that he or she currently is taking, clearly intrudes upon both autonomy privacy interests and informational privacy interests that are protected by the state Constitution. Under the state constitutional right to privacy, an individual, including a job applicant, generally may not be required to submit to such a procedure, or to disclose such information, in the absence of reasonable justification for the testing.\n\nAs we have discussed above, however, urinalysis drug testing of job applicants that is administered as part of an otherwise lawful preemployment medical examination represents much less of an intrusion on reasonable expectations of privacy than does drug testing in other contexts. As a general matter, a job applicant reasonably must anticipate that a prospective employer may require that he or she undergo a preemployment medical examination before the hiring process is completed. When drug testing is conducted as part of a required preemployment medical examination that typically would include a urinalysis for medical conditions or diseases, the testing does not impose the usual intrusion on privacy that results when an individual is required to provide a separate urine sample on demand. Nonetheless, the addition of a drug testing component to a routine medical examination does involve the disclosure of some additional private information about the individual and often is accompanied, as it was in this case, by the adoption of increased security measures, including additional monitoring of the urinalysis process. The disclosure of additional private information through testing a bodily substance obtained from an individual and the increased monitoring of the process under which an individual provides a urine sample constitute intrusions upon the applicant's constitutional privacy interests that are not insignificant or de minimis--intrusions that would not be permissible in the absence of reasonable justification. Accordingly, in determining the validity of the preemployment testing, we must consider the legitimacy and strength of the employer's interest in conducting such testing. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAs we have discussed above in analyzing plaintiff's Fourth Amendment claim, because of the significant problems--absenteeism, increased safety concerns, tardiness, reduced productivity, and increased risk of turnover--typically posed by an employee who abuses drugs or alcohol, an employer has a legitimate and substantial interest in determining whether or not an applicant currently is engaging in such conduct before the employer finalizes any hiring decision. And because an employer normally has had no opportunity to observe a job applicant over a period of time under circumstances that reasonably might alert the employer to a potential drug or alcohol problem, the employer has a greater need to conduct suspicionless drug testing of job applicants than it does to conduct such testing of its current employees. The employer's interest is a significant one, not only because the mistaken hiring of an individual who is abusing drugs or alcohol can impose significant financial burdens on an employer, but also because such an employee's absences or diminished production frequently will create morale problems within the workplace. (See Under the Influence; Drugs and the American Workforce, (supra) , pp. 157-158.)\n\nBalancing the employer's substantial interest in conducting suspicionless drug testing of a job applicant against the relatively minor intrusion upon such an applicant's reasonable expectations of privacy when the drug testing is conducted as part of a general preemployment medical examination, we conclude that, as applied to such job applicants, the city's drug testing program does not violate the privacy provision of the state Constitution. In this setting, we conclude that the limited incremental intrusion upon a job applicant's privacy is justified by the city's countervailing interests.\n\nV\n\nWe have concluded that the city's drug testing program violates the federal Constitution insofar as it applies to all current employees who have been offered a promotion to another position, but that the program is constitutionally permissible, under both the federal and state Constitutions, insofar as it applies to job applicants.\n\nHaving determined that the city may not impose suspicionless drug testing on all current employees who have been offered a promotion, the question remains whether we should review all city jobs, position-by-position, to determine whether a suspicionless drug testing requirement constitutionally may be applied to an employee promoted to a particular position. As noted above, the trial court undertook that considerable task, and the Court of Appeal reviewed the trial court's Conclusions, disagreeing in numerous instances with the trial court's resolution of the balancing process.\n\nFor a number of reasons, we conclude that such a position-by-position review is not warranted in the present case. First, at the time the city promulgated the challenged testing program in 1986, the United States Supreme Court's decisions in Skinner and Von Raab had not yet been rendered (those cases were decided in 1989), and there is no indication that the city officials who adopted the drug testing program undertook a position-by-position review of city jobs to determine which positions involved special features, comparable to those identified in the federal decisions, that warrant suspicionless drug testing of current employees. Second, the drug testing program was instituted by the city in 1986 as part of a routine prepromotional medical examination. Subsequent to the city's adoption of the drug testing program, Congress enacted the ADA which places new restrictions on an employer's authority to require current employees to undergo a medical examination. As discussed above, under the ADA an employer may require all job applicants who have been offered a position to undergo a medical examination before beginning employment, but, once an em ployee has begun working, the ADA provides that an employer \"shall not require a medical examination . . . unless such examination . . . is shown to be job-related and consistent with business necessity.\" (42 U.S.C.S. § 12112(d)(4)(A).) Accordingly, it appears likely that, under the ADA, the city now may require prepromotional medical examinations only for a smaller group of promotional candidates. In assessing the intrusiveness of a drug testing requirement in the prepromotion context, it would be important for the court to know whether the current employee would be (and lawfully could be) required, in any event, to undergo a medical examination and urinalysis. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nUnder these circumstances, we conclude that, with regard to prepromotional drug testing, it is appropriate simply to set aside the city's suspicionless urinalysis testing program as overbroad, leaving the city free to fashion a new prepromotional drug testing program in light of current constitutional and statutory authority. (See, e.g., Harmon v. Thornburgh, (supra) , 878 F.2d 484, 493-496 [having found that the challenged agency drug testing program was overbroad, the court declined to decide \"which employees may and may not be tested,\" concluding it is \"more appropriate that any such determination should be made . . ., as an initial matter, by the agency rather than by the court\"].) \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nVI\n\nIn sum, we conclude that the challenged drug testing program is unconstitutional insofar as it applies to current city employees seeking promotion, but that the program is constitutional insofar as it applies to job applicants.\n\nThe judgment of the Court of Appeal is reversed, and the matter is remanded to the Court Appeal for further proceedings consistent with the views expressed in this opinion.\n\nWerdegar, J., concurred.\n\nMOSK, J.,\n\nConcurring and Dissenting.-- I concur in part III, D, 1 of the lead opinion, and in its Disposition as it pertains to the City of Glendale's (hereafter sometimes City) program for drug testing candidates for promotion. I agree with the lead opinion that \"it is not constitutionally 'reasonable,' under the Fourth Amendment [to the United States Constitution], for a governmental employer to conduct suspicionless urinalysis drug testing of all current public employees seeking promotion, regardless of the nature or duties of the position at issue.\" (Lead opn., ante, at p. 878.) I also believe, for reasons that will become evident below, that the privacy clause of article I, section 1 of the California Constitution provides independent grounds for invalidating drug testing of all City employees in line for promotions.\n\nI do not agree with the lead opinion and the majority that the testing of all applicants for employment within the City is constitutional under either the federal or state Constitution. As explained below, although it may be true that government employers have a somewhat greater need to test applicants than to test current employees, that need does not, by itself, constitutionally justify across-the-board testing of applicants. Nor is it true, as the lead opinion maintains, that urine testing is minimally intrusive simply because applicants for employment have been subject to medical examinations. Drug testing represents a significant additional invasion of these applicants' basic rights to privacy and dignity, and the City has not carried its considerable burden of showing that such invasion is justified in the case of all applicants offered employment. The City has not demonstrated a constitutionally paramount need to include applicants for such positions as clerk-typist and city attorney in a drug testing program that has typically been confined to those seeking employment in such safety-sensitive jobs as bus driver or police officer. From the record before us, we cannot determine if the City's universal drug testing program arises from a substantial, legitimate governmental need, or from purely political or ideological considerations, and therefore cannot determine the extent to which the program is constitutionally justified.\n\nI.\n\nThe Fourth Amendment to the United States Constitution affirms the right of the people to \"be secure in their persons, houses, papers and effects, against unreasonable searches and seizures.\" In general, a government search and seizure must be justified with a warrant \"on probable cause,\" or must at least be backed by \" 'some quantum of individualized suspicion.' \" ( Skinner v. Railway Labor Executives' Assn. (1989) 489 U.S. 602, 624 [103 L. Ed. 2d 639, 664, 109 S. Ct. 1402] (Skinner).) \"In limited circumstances, where the privacy interests implicated by the search are minimal, and where an important governmental interest furthered by the intrusion would be placed in jeopardy by a requirement of individualized suspicion, a search may be reasonable despite the absence of such suspicion.\" (Ibid.)\n\nIn Skinner, the court concluded that \"the collection and testing of urine\" is a search under the Fourth Amendment because such urine testing \"intrudes upon expectations of privacy that society has long recognized as reasonable.\" (Skinner, (supra) , 489 U.S. at p. 617 [ 103 L. Ed. 2d at p. 660].) The Skinner court identified two privacy interests that bring urine testing within the ambit of the Fourth Amendment. First, the very act of urine testing itself requires the employee to perform under government supervision \"an excretory function traditionally shielded by great privacy.\" ( Id. at p. 626 [103 L. Ed. 2d at p. 666].) \" 'There are few activities in our society more personal or private than the passing of urine. Most people describe it by euphemisms if they talk about it at all. It is a function traditionally performed without public observation; indeed, its performance in public is generally prohibited by law as well as social custom.' \" ( Id. at p. 617 [103 L. Ed. 2d at pp. 659-660].) Second, the Skinner court found it undisputed that \"chemical analysis of urine . . . can reveal a host of private medical facts about an [individual], including whether he or she is epileptic, pregnant, or diabetic.\" (Ibid.)\n\nThere is no question that the City's drug test in the present case infringes on these same privacy interests. The test is conducted, according to the physician who operated the program for the City, as follows: First, the applicant is required to sign a waiver form that includes \"a place for the individual to list any and all medications, drugs, etc. that the individual is taking. If any of these medications are included in the drug testing procedure, the individual will have to satisfactorily explain their usage. The individual is then asked to remove his or her clothing. A man removes his clothing to his shorts, and a woman to her bra and panties at which point they both are given a gown to wear. . . . The individual is then accompanied by [a] medical representative to a restroom to give a sample of urine in order to prevent tampering with the sample. The medical representative monitoring the giving of the urine sample stands in the cubicle adjacent to the cubicle occupied by the individual to assure that there is no tampering with the sample. However, there is no direct observation of the individual giving the urine sample. The individual returns the container to the medical representative. The medical representative notes whether the sample is cold or warm. If it is cold, this will not be acceptable for this test procedure because it indicates tampering . . . .\" If the sample does not appear to have been tampered with, it is tested for blood, sugar and protein as screening for medical problems, then sealed, labeled and sent to a laboratory.\n\nThus, the City's test possesses the two intrusive features identified by the Skinner court. First, the aural monitoring of the applicant's urination, after being asked to disrobe, is a basic form of privacy invasion. Second, the urinalysis and the required disclosures prior to urinalysis will reveal a host of private information, including the full array of legal medications the applicant is taking. Thus, the City may learn from such data, and from the drug test results themselves, much about the private lives of the applicants, including whether the applicant is \"HIV positive,\" or is taking birth control pills or high blood pressure medication. The City will also learn who is using marijuana outside the workplace for permissible medical reasons. (See Health \u0026 Saf. Code, § 11362.5.) \"Because drug tests often furnish information about employee activities occurring outside of working hours, such tests may provide . . . a periscope through which [the testers] can peer into an individual's behavior in her private life, even in her own home.\" ( Jones v. McKenzie (D.C. Cir. 1987) 833 F.2d 335, 339 [266 App.D.C. 85], opn. mod. 878 F.2d 1476, 1477 [279 App.D.C. 19].)\n\nThe lead opinion argues that applicants for employment in this case have diminished expectations of privacy when compared to current employees, because the preemployment drug testing is part of a medical examination that predated the drug testing program and is supposedly typical in the preemployment setting. \" medical examination, in itself, ordinarily requires the individual not only to submit a urine sample but in addition to provide a medical history and to undergo a physical examination that entails an intrusive touching of one's body by a physician. . . . Although in this case the city's addition of the drug screening test to its preexisting medical examination procedure was accompanied by the institution of several new security measures (such as the aural monitoring of the urinalysis process) that entailed some additional intrusion on the applicant's privacy with regard to provision of the urine sample, the incremental intrusion on privacy attributable to these new measures appears rather minor when viewed in the context of a complete medical examination.\" (Lead opn., ante, at p. 884, italics in original.)\n\nI disagree that the \"incremental\" intrusion was \"rather minor.\" It is evident from the record that whatever physical examination had been done prior to the institution of drug testing did not compel disclosure of all the medications the applicant was taking, nor administer tests that would reveal the presence of such medication; rather, this disclosure was a particular feature of the drug screening. Although the record is somewhat unclear on this point, it appears that urinalysis before drug screening is only for the presence of blood, sugar, and protein in the urine. Moreover, even if the medical examination had required applicants to respond to a written inquiry concerning the medications they were presently taking, such an inquiry is obviously less invasive than the use of urinalysis to obtain such information.\n\nFurther, urinalysis prior to the institution of the drug testing program did not involve the monitoring of urination, aurally or otherwise. Thus, as the lead opinion concedes, \"[t]he disclosure of additional private information through testing a bodily substance obtained from an individual and the increased monitoring of the process under which an individual provides a urine sample constitute intrusions upon the applicant's constitutional privacy interests that are not insignificant or de minimis--intrusions that would not be permissible in the absence of reasonable justification.\" (Lead opn., ante, at p. 897.) Or, to state the matter in stronger terms, the drug test is more than a routine physical examination of the employee; it represents a coercive governmental appropriation of information about private, and in many cases lawful, behavior, a kind of coercion which in turn necessitates the additional intrusion of monitored urination--\"a type of search particularly destructive of privacy and offensive to personal dignity.\" ( Treasury Employees v. Von Raab (1989) 489 U.S. 656, 680 [103 L. Ed. 2d 685, 711, 109 S. Ct. 1384] (dis. opn. of Scalia, J.) (Von Raab).)\n\nMoreover, although the lead opinion cites cases approving an employer's ability to administer medical examinations to prospective employees, it is by no means clear in the case law that all preemployment medical examinations, of whatever scope and for whatever reason, are constitutional. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e As one commentator has explained, medical testing has been expanding in recent years both in frequency and in breadth; its function has been gradually transformed from a means of screening out those who are presently unfit to perform a job, or who are particularly at risk of being exposed to certain occupational dangers, into a tool for assessing an employee or applicant's general health and private habits so as to promote cost containment by the employer. (See Rothstein, Medical Screening and the Employee Health Cost Crisis (1989) pp. 1-6.) Given the inherently invasive nature of medical examinations, any expansion of their scope and intrusiveness should be viewed with vigilance rather than quiescence by courts charged with safeguarding the Fourth Amendment. The view, implicit in the lead opinion, that \"all prior intrusions . . . which society has accepted, form a baseline for comparison . . . [and] [e]ach new intrusion . . . represent[s] only an incremental diminution of privacy overall\" (Cornish \u0026 Louria, Employment Drug Testing, Preventive Searches, and the Future of Privacy (1991) 33 Wm. \u0026 Mary L.Rev. (1991) 95, 114) is one certain to allow the steady erosion of our privacy rights.\n\nThe lead opinion is of course correct that, as the United States Supreme Court noted in Skinner, the invasiveness of the drug testing process is somewhat reduced when \"[t]he sample is . . . collected in a medical environment, by personnel unrelated to the . . . employer, and is thus not unlike similar procedures encountered often in the context of a regular physical examination.\" (Skinner, (supra) , 489 U.S. at pp. 626-627 [ 103 L. Ed. 2d at p. 666].) But the Skinner court mentioned this as only one of a number of factors weighing in favor of the constitutional legitimacy of any particular urine test: \" More importantly, the expectations of privacy of covered employees are diminished by reason of their participation in an industry that is regulated pervasively to ensure safety, a goal dependent, in substantial part, on the health and fitness of covered employees.\" ( Id. at p. 627 [103 L. Ed. 2d at p. 666], italics added.) As Skinner thereby demonstrates, the particular setting in which a drug test takes place is less important for purposes of Fourth Amendment analysis than the strength of the government interests justifying the test and the concomitant reduction of an employee's reasonable privacy expectations in light of those interests. Thus, it is important to recognize that the City's drug testing program is not immunized from constitutional challenge merely because it can be placed under the familiar aegis of a \"medical examination.\"\n\nThe lead opinion, in addition to minimizing the job applicant's expectations of privacy, also exaggerates the nature of the government employer's interests. It accomplishes this overstatement in two steps. First, it contends that \"[i]n light of the well-documented problems that are associated with the abuse of drugs and alcohol by employees--increased absenteeism, diminished productivity, greater health costs, increased safety problems and potential liability to third parties, and more frequent turnover--an employer, private or public, clearly has a legitimate (i.e., constitutionally permissible) interest in ascertaining whether persons to be employed in any position currently are abusing drugs or alcohol.\" (Lead opn., ante, at pp. 882-883, fns. omitted.) Second, it reasons that although these interests could also justify the drug testing of current employees as well as job applicants, \"an employer generally need not resort to suspicionless drug testing to determine whether a current employee is likely to be absent from work or less productive or effective as a result of current drug or alcohol abuse: an employer can observe the employee at work, evaluate his or her work product and safety record, and check employment records to determine whether the employee has been excessively absent or late.\" (Id. at p. 883.) Not so, they claim, for the job applicant, because the employer \"may lack total confidence in the reliability of information supplied by a former employer or other references.\" (Ibid.) The lead opinion therefore concludes that \"[i]n view of these considerations, . . . an employer has a greater need for, and interest in, conducting suspicionless drug testing of job applicants than it does in conducting such testing of current employees.\" (Ibid.)\n\nYet even if the lead opinion is correct that employers have in general a marginally greater need to test job applicants than current employees, this fact does not justify the drug testing of all applicants for government employment. As explained below, such a Conclusion is incompatible with the proper, fact-specific balancing of privacy rights and governmental interests required by the Fourth Amendment.\n\nThe principles pertinent to analyzing the sufficiency of the government's interests are found in cases discussed at length in the lead opinion, and I will only briefly summarize those cases here. In Skinner, (supra) , 489 U.S. 602, and Von Raab, (supra) , 489 U.S. 656, the United States Supreme Court set forth the basic framework for analyzing Fourth Amendment challenges to drug testing policies and programs. The court recognized, as mentioned above, that drug testing by a government employer was a \"search\" within the meaning of the Fourth Amendment, but that a warrant and indeed any form of individualized suspicion could be dispensed with \"where the Government seeks to prevent the development of hazardous conditions or to detect violations that rarely generate articulable grounds for searching any particular place or person.\" (Von Raab, (supra) , 489 U.S. at p. 668 [ 103 L. Ed. 2d at p. 703].) These types of government interests may \" in certain limited circumstances. . . [be] sufficiently compelling to justify the intrusion on privacy entailed by conducting such searches without any measure of individualized suspicion.\" (Ibid., italics added.) The Von Raab court upheld much of the United States Customs Service drug testing program at issue in that case, which involved the testing of employees prior to promotion into positions directly involved in drug interdiction, or in the handling of firearms, the misuse of which could pose a danger to public safety. Both of these interests were deemed to be \"compelling\" by the court. ( Id. at p. 672 [103 L. Ed. 2d at p. 706].) The court also agreed in principle that the drug testing of employees required to handle classified information, another part of the Custom Service's drug testing program, was justified by \"a compelling interest in protecting truly sensitive information from those who, 'under compulsion of circumstances or for other reasons, . . . might compromise [such] information.' \" ( Id. at p. 677 [103 L. Ed. 2d at p. 709].) But the court found it unclear, from the record, whether all the job classifications subject to drug testing--such as \" 'Baggage Clerk' \" and \" 'Electric Equipment Repairer' \"--were \"likely to gain access to sensitive information\" ( id. at p. 678 [103 L. Ed. 2d at p. 710]) and accordingly remanded to the court of appeals for clarification and possible limitation of the Customs Service's drug testing program.\n\nThe lessons of Skinner and Van Raab were distilled in Harmon v. Thornburgh (D.C. Cir. 1989) 878 F.2d 484 [278 App.D.C. 382], a case involving a program of random drug testing for a wide range of United States Department of Justice employees. The Harmon court rejected the department's rationale that a generalized interest in the \"integrity of its workforce\" could justify such testing, stating that \" Von Raab. . . suggests that federal employment alone is not a sufficient predicate for mandatory urinalysis.\" ( Id. at p. 490.) Rather, \" Von Raab. . . suggests that the government may search its employees only when a clear, direct nexus exists between the nature of the employee's duty and the nature of the feared violation.\" (Ibid., italics added.) While the court indicated that a more limited drug testing program confined to \"DOJ employees having substantial responsibility for the prosecution of federal drug offenders\" would be lawful ( id. at p. 490, fn. omitted), it invalidated the program in question as overbroad.\n\nThe Supreme Court further elaborated on its Fourth Amendment drug testing analysis in Vernonia School Dist. 47J v. Acton (1995) 515 U.S. 646 [132 L. Ed. 2d 564, 115 S. Ct. 2386] (Vernonia) a case that involved the lawfulness of a policy of random drug testing of high school student athletes. The court clarified that the phrase \" 'compelling state interest,' \" used in Skinner and Von Raab, does not describe \"a fixed, minimum quantum of governmental concern, . . . [but] [r]ather . . . an interest which appears important enough to justify the particular search at hand, in light of other factors which show the search to be relatively intrusive upon a genuine expectation of privacy.\" (Id. at pp. - [132 L. Ed. 2d at p. 579, 115 S. Ct. at pp. 2394-2395].) The court's alternate appellation for the term \"compelling interest\" was a \"relatively high degree of government concern.\" (Id. at p. [132 L. Ed. 2d at p. 579, 115 S. Ct. at p. 2395].) It concluded that that standard had been met by the high school's drug testing policy: \"Deterring drug use by our Nation's schoolchildren is at least as important as enhancing efficient enforcement of the Nation's laws against the importation of drugs, which was the governmental concern in Von Raab. . ., or deterring drug use by engineers and trainmen, which was the governmental concern in Skinner.\" (Id. at p. [132 L. Ed. 2d at pp. 579-580, 115 S. Ct. at p. 2395].) The Vernonia court cautioned, however, \"against the assumption that suspicionless drug testing will readily pass constitutional muster in other contexts. The most significant element in this case is . . . that the [drug testing] Policy was undertaken in furtherance of the government's responsibilities, under a public school system, as guardian and tutor of children entrusted to its care.\" (Id. at p. [132 L. Ed. 2d at p. 582, 115 S. Ct. at p. 2396].)\n\nThus, in each of the cases discussed above, the court pinpointed a sufficiently compelling interest, or relatively high degree of governmental concern that justified invading privacy rights. The kinds of compelling interests these cases enumerate are either critical public safety concerns, where \" 'even a momentary lapse of attention can have disastrous consequences' \" (Von Raab, (supra) , 489 U.S. at p. 670 [ 103 L. Ed. 2d at p. 705]) or, as in the case of customs agents or the school district, the prevention of some kind of fundamental impairment of the particular government agency's ability to perform its public mission. (Ibid.) On the other hand, the cases suggest that other, nonspecific governmental, symbolic interests, such as the \"integrity of the workforce,\" or interest in a \"drug free workplace,\" although laudable, do not justify the invasion of privacy inherent in a drug test. (See Harmon v. Thornburgh, (supra) , 878 F.2d at p. 490; see also Von Raab, (supra) , 489 U.S. at pp. 680-681 [ 103 L. Ed. 2d at p. 712] (dis. opn. of Scalia, J.); Georgia Ass'n of Educators v. Harris (N.D.Ga. 1990) 749 F. Supp. 1110, 1115; Taylor v. O'Grady (7th Cir. 1989) 888 F.2d 1189, 1196.) \"utside of the law enforcement context, the government's legitimate interest in employee drug testing extends no further than its interest in workplace conduct and the performance of work responsibilities.\" (National Treasury Employees Union v. Yeutter (D.C. Cir. 1990) 918 F.2d 968, 974 [287 App.D.C. 28].)\n\nThe lead opinion does not rely on purely \"symbolic\" interests to justify the drug testing of all applicants for government employment, but rather on a general interest in government \"efficiency\"--the legitimate need that a government employer, like a private employer, has in promoting a productive workforce in which absenteeism, disciplinary problems, turnover, etc., are minimized. Courts have generally viewed these interests as a rationale for drug testing with considerable skepticism. (See National Treasury Employees Union v. Yeutter, (supra) , 918 F.2d at p. 974 [rejecting \"unsupported connection between off-duty drug use and government efficiency\"].) As this court has observed, \"the Fourth Amendment protection against unreasonable searches and seizures has generally been interpreted to require more than an employer interest in employee job performance . . . to justify drug testing without reasonable suspicion.\" ( Hill v. National Collegiate Athletic Assn. (1994) 7 Cal. 4th 1, 54 [26 Cal. Rptr. 2d 834, 865 P.2d 633].)\n\nThe lead opinion implicitly recognizes that these efficiency interests are not as compelling as public safety interests, because the former cannot justify, as the latter can, the drug testing of promotional candidates. If that were not the case, then the lead opinion's contention that there are alternative means of assessing job performance that render prepromotional testing unnecessary would invalidate such testing even for positions critical to public safety. After all, a current employee's actual safety record is in all likelihood a much better predictor of future safety performance than is the off-the-job drug use tested by urinalysis. But, as the lead opinion implies, an interest in preventing accidents with disastrous public safety consequences is so compelling that testing is justified even though the amount of pertinent additional information yielded by the testing may be slight compared to alternative means of employee evaluation. But the government's interest in employee efficiency, being of less importance, cannot surmount the argument that there are less intrusive alternative means of predicting future job performance of current employees. Behind this differential treatment of the two types of interests is the self-evident recognition that the government's interest in preventing accidents is far weightier than its interest in promoting marginal productivity improvements in its operations.\n\nThe interest in government efficiency is not only, as a general matter, less than compelling, but is also potentially all encompassing. While the concern with public safety is relatively focused--only in certain occupations, such as bus driver, can an employee's drug impairment represent an immediate threat to public safety--efficiency concerns are applicable to all government employees. Moreover, efficiency can logically be used to justify a wide array of intrusions into the privacy of job applicants, because so much private information might be arguably relevant in some way to predicting the performance of future employees--current family situation, a record of psychotherapeutic treatment, genetic makeup, a score on a lie detector test. (See generally, Larson, Employment Screening (1995) § 2.07-2.10, pp. 2-15 to 2-30.)\n\nThus, the government's general interest in efficiency and employee productivity is both less important and potentially more far reaching than the interest in public safety and other interests that have been identified as \"compelling.\" These two characteristics dictate that courts adopt a certain attitude of skepticism when this interest is used to justify universal drug testing. I am unwilling to categorically state that the government's interest in efficiency can never justify urine testing in the preemployment setting. (See O'Connor v. Ortega (1987) 480 U.S. 709, 724 [94 L. Ed. 2d 714, 727-728, 107 S. Ct. 1492] [interest in ensuring efficient government operation a reason to dispense with warrant and probable cause requirements in searching office of government employee suspected of misfeasance].) It may indeed be the case that the employer has a greater need, at least in some instances, for drug testing applicants than for testing current employees. But when the government seeks to drug test all applicants offered employment solely on general efficiency grounds, I would place on it the burden of showing that the efficiency interests at stake are so substantial that they require a drug testing program of such breadth. As the court stated in Georgia Ass'n of Educators v. Harris, (supra) , 749 F. Supp. at page 1113, in invalidating a statute that authorized the drug testing of all applicants to state employment: \"The [United States Supreme] Court's application of the balancing test [in drug testing cases] was predicated on the [government agency's] concrete expression of substantial or compelling interests served by drug testing and a fact-specific explanation of how testing the subject employee groups furthered those interests.\" We should require nothing less of the City in the present case.\n\nThe reason for such a fact-specific showing is clear. It is basic to Fourth Amendment jurisprudence that legitimate expectations of privacy are not obliged to yield the right-of-way to every claim of governmental efficiency. As Justice Stewart stated of the operation of the Fourth Amendment in the criminal context: \"he mere fact that law enforcement may be made more efficient can never by itself justify disregard of the Fourth Amendment. [Citation.] . . . he Fourth Amendment reflects the view of those who wrote the Bill of Rights that the privacy of a person's home and property may not be totally sacrificed in the name of maximum simplicity in enforcement of the criminal law.\" ( Mincey v. Arizona (1978) 437 U.S. 385, 393 [57 L. Ed. 2d 290, 301, 98 S. Ct. 2408].) So too, outside the criminal law, Fourth Amendment rights cannot be nullified simply by appeals to improving the productivity of government employers. Indeed, a government employer would presumably not drug-test if it were not in some sense efficient to do so, i.e., if the costs incurred by the tests were not outweighed by the benefits expected to be received by the government agency. But the Fourth Amendment does not merely enjoin the government to be a rational actor; it requires a government search outside the criminal context to be reasonable not in terms of the government's costs and benefits, but in terms of the relative weight of societal gains and privacy losses resulting from the search, and therefore requires courts to invalidate certain types of searches and seizures despite the fact that they promote the government's efficiency. A general, unsubstantiated claim that drug testing of all applicants is necessary to improve job performance leaves courts unable to assess the actual strength of government's need for universal, suspicionless, testing and so renders them incapable of performing their proper function under the Fourth Amendment of balancing constitutional rights and government interests.\n\nMoreover, as suggested above, a government agency may institute drug testing not because it expects tangible productivity gains but because of political, ideological, or symbolic motivations. (See Rothstein, Medical Screening and the Employee Health Cost Crisis, (supra) , at pp. 100-101; see also Von Raab, (supra) , 489 U.S. at pp. 686-687 [ 103 L. Ed. 2d at p. 715] (dis. opn. of Scalia, J.).) Since the general interest in government efficiency, unlike the specific, compelling interests in public safety or the like, can in the abstract be used to justify drug testing of any and all positions, it may be employed as a pretext behind which is concealed a symbolic interest in ensuring a \"drug-free workplace,\" although such interest, if stated overtly, would be insufficient under the Fourth Amendment to warrant a universal testing program. Under these circumstances, a court must at least look behind the proffered generalities and determine if the government agency has made a specific showing that the drug testing of all applicants would advance the tangible governmental interests offered as justification for the program, or if these interests are merely a facade behind which to promote a purely symbolic political agenda.\n\nWhat kind of showing must be made? First, at the very least, the government must demonstrate a significant problem with drug abuse, i.e., a productivity problem traceable to drug abuse. The problem must be pinpointed with some degree of specificity. It is not enough to identify drug abuse somewhere in city government. As a recent study has shown, drug use is highly stratified by occupation and industry, with over 15 percent of construction workers and waitresses, for example, reporting current drug use, and only about 2-4 percent teachers and engineers so reporting. (Substance Abuse and Mental Health Services Administration, Drug Use Among U.S. Workers: Prevalence and Trends By Occupation and Industry Categories (Drug Use Among U.S. Workers) (1996) pp. 17-18.) Therefore, when a city has had problems with its groundkeeping staff or its temporary recreational employees engaging in drug-abuse-related unproductive behavior, it may be legitimate for that city to adopt applicant testing among some of its employees to address this problem. But there may be little if any public benefit from drug testing clerks, secretaries, engineers, or city planners, if no similar productivity problem has been identified among those groups.\n\nIt is true that the Von Raab court implicitly rejected Justice Scalia's Dissenting argument that the Customs Service's drug testing program was unconstitutional because there had been an inadequate showing of a drug problem in the agency. (Von Raab, (supra) , 489 U.S. at pp. 674-675 [ 103 L. Ed. 2d at p. 708].) But in the present case, with less compelling, more amorphous, interests at stake than in Von Raab, the Fourth Amendment balancing of interests requires the government to make a particularized showing that such comprehensive testing is genuinely necessary for the significant improvement of government operations. The government may not conduct widespread, suspicionless searches under the Fourth Amendment without evidence that it is engaged in something more than a far-flung fishing expedition or a symbolic anti-drug crusade.\n\nSecond, the government must show that drug testing is a reasonable means of addressing the problems at hand--i.e., that a positive drug test is a good predictor of future job performance. It is evident that the government cannot claim a substantial need to drug-test without some showing that such testing actually contributes to the desired aim of improving employee productivity.\n\nThird, the government must demonstrate that there are no reasonable, less invasive alternatives to drug testing in the particular government department or occupational classification in question. This showing goes to the heart of the lead opinion's reason for distinguishing between preemployment and prepromotional drug testing--that in the former case, unlike the latter, the employer has not had adequate opportunity to observe the employee's work performance. But that assertion is by no means invariably incontrovertible. There may be some occupations in which much is revealed about an employee's level of performance through a rsum, references, and various benchmarks of performance, particularly when the employee has been subject to extensive background checks. (See Willner v. Thornburgh (D.C. Cir. 1991) 928 F.2d 1185, 1197-1198 [289 App.D.C. 93] (dis. opn. of Henderson, J.).) Applicants who have had their prior work subject to \"the kind of day-to-day scrutiny that is the norm in more traditional office environments\" (Von Raab, (supra) , 489 U.S. at p. 674 [ 103 L. Ed. 2d at p. 707]) may not be able to conceal significant problems in their previous employment from prospective employers. It is therefore not self-evident that an employer has in all cases a greater need to drug-test applicants for employment than it has to test current employees. As such, the City's claim that it has insufficient alternative means for screening applicants should be subject to a requirement of evidentiary support.\n\nAfter reviewing the record below, I conclude that the City has not made the required factual showing of a substantial interest in drug-testing all applicants to whom it offers employment. First, the City has failed to demonstrate that it has a widespread drug problem requiring universal testing. The City did institute a preplacement drug testing program between November 1985 and January 1986, and found that about 20 percent of the applicants/employees tested positive for drugs, or about 10 out of 48. The occupational categories testing positive were as follows: three part-time seasonal laborers, two tree trimmers, two sanitation workers, a part-time recreational leader, a pump-plant operator and an equipment service worker. Can it really be said from these figures that drug use/abuse was pandemic in the City of Glendale's workforce? There was no evidence, for example, of drug use among the City's clerical or professional employees, who no doubt make up a good percentage of that workforce. If applicants for the tree trimmer job are testing positive for drugs, does that tell us anything about whether there is a need for testing in the city manager's, or city planner's, office?\n\nMoreover, the City's claim that it has documented, prior to instituting drug testing, a significant increase in the percentage of disciplinary cases related to substance abuse is quite misleading. What the record does reveal is not that the number of substance-abuse related cases increased between 1983 and 1986--these remained constant at about nine to ten--but the total number of disciplinary cases decreased, thereby increasing the percentage of disciplinary cases suspected of being related to substance abuse. It is unclear from the record what the basis was for the City's suspicions that drugs were involved in the disciplinary cases, but even if these suspicions were well founded, the total number equals about one-half of 1 percent of the City's workforce. We have no way of knowing if these disciplinary problems were concentrated in some departments or were widespread. This is a weak reed indeed on which to lean a program of blanket preemployment drug testing.\n\nAs for the second part of the City's showing--that drug testing will have an actual positive effect on the government agency's productivity--the general evidence on this score is mixed. Because urinalysis detects metabolites from past drug use rather than current impairments, the connection between a positive test and on-the-job work performance is not self-evident. It is true that positive preemployment test results have been correlated with higher absenteeism and firing rates. (See Normand et al., Under the Influence: Drugs and the American Workforce (1994) pp. 220-223 (Drugs and the American Workforce).) But it does not follow that preemployment drug testing will yield a reduction in absenteeism or turnover, or an overall increase in productivity. While there is a correlation between positive drug test results and some indicia of poor performance, the evidence indicates that a very high percentage of those who score positive on drug tests nonetheless perform satisfactorily on the job. For example, Normand and Salyard's study of preemployment testing in the United States Postal Service, which is probably the most comprehensive longitudinal study of its kind done to date, showed that after 3.3 years, about 24 percent of positive testers had been fired compared to 15 percent negative testers. (Drugs and the American Workforce, (supra) , at pp. 220-223.) This means that about 76 percent of those positive testers performed at least satisfactorily on the job. The loss of the 76 percent, and their replacement with applicants initially Judged to be less qualified, will not necessarily lead to the efficiency improvement the employer seeks. Thus, as the authors of Drugs and the American Workforce caution: \"The studies do not show that positive testers performed worse than those who would have replaced them had they been rejected on the basis of drug-test information.\" (Drugs and the American Workforce, (supra) , at p. 228.) \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nMoreover, the significance of drug testing declines as drug abuse decreases in the general population, which has in fact been the case since 1980. (Drugs and the American Workforce, (supra) , at p. 223.) A recent study of workers ages 18-49 shows a major decline in recent drug use from 16.5 percent in 1985 (around when the City program was formulated) to 8.1 percent in 1993. (Drug Use Among U.S. Workers, (supra) , p. 9.) To the extent that drug use declines, the capacity of drug testing to improve employee productivity likewise diminishes.\n\nThe significance of these statistics can most clearly be illustrated with numerical examples. In the United States Postal Service study cited above, the prevalence of positive tests among applicants was slightly less than 10 percent. Given a 10 percent prevalence, and the fact that approximately 25 percent of the applicants testing positive turned out to be unsatisfactory employees, then the drug tests, had the results been heeded, would have correctly screened out 2.5 percent (25% X 10%) of the applicant pool, and incorrectly screened out 7.5 percent. If the prevalence rate of positive testers drops to 5 percent, then the drug tests' rate of screening out future unsatisfactory employees drops to 1.25 percent of the total applicant pool. If, as cited above in Drug Use Among U.S. Workers, the prevalence of drug use among most of those belonging to certain professional and clerical categories is lower than in the general population, between 2 and 4 percent, then drug testing will successfully screen out less than 1 percent of this applicant pool. Whether this will improve the productivity of those segments of the work force at all (given the number of potentially successful employees who will be screened out and replaced with those who might be inferior), this marginal improvement is a scant justification for overriding the substantial privacy interests of applicants offered employment.\n\nAs for the third prong of the showing, the City has not even addressed the question whether, in all cases, there is an adequate alternative mechanism for screening prospective employees. As noted, there may be occupations in which the nature of the background investigation and the \"paper trail\" left by the applicant produces a picture that renders drug testing superfluous, in the same sense that it is superfluous for selecting qualified promotional candidates. There are, moreover, many methods of preemployment selection, some relatively successful, that have been studied at length by organizational or industrial psychologists. (See generally, Dale, Successful Recruitment and Selection: A Practical Guide for Managers (1995) pp. 149-186). There is no showing in the record that would indicate universal drug testing results in a more productive workforce when used instead of, or in addition to, these more traditional employee selection techniques. On remand, the parties should have the opportunity to address this issue.\n\nIn sum, under the tests I propose, a government agency could justify preemployment drug testing either by demonstrating that drug impairment will compromise a compelling state interest, such as public safety, or that the government department has or likely will have a problem with drug abuse that will substantially impair its efficiency and effectiveness, that applicant testing will help remedy this problem, and that the agency lacks sufficient alternate means of applicant screening. With these alternative tests, we would be acknowledging that employers do sometimes have a greater need, as the lead opinion argues, to drug-test applicants than to test current employees, and thus would be giving employers greater latitude to do so, while nonetheless requiring the government employer to make a particularized demonstration of a special need to drug-test. Such a demonstration has been the hallmark of Fourth Amendment jurisprudence outside the criminal context. The City has failed to demonstrate that universal preemployment testing is necessary for the significant improvement of employee efficiency, or for the furtherance of any other substantial government interest. I would accordingly remand to permit the City to appropriately narrow its applicant testing program.\n\nII.\n\nIn addition to violating the Fourth Amendment to the United States Constitution, the City's preemployment drug testing scheme contravenes the privacy clause of article I, section 1 of the California Constitution, which declares as an inalienable right \"pursuing and obtaining . . . privacy.\" Before discussing how the privacy clause applies to this case, I briefly review this court's interpretation of the meaning of this constitutional provision.\n\nIn our first case interpreting the privacy clause, White v. Davis (1975) 13 Cal. 3d 757 [120 Cal. Rptr. 94, 533 P.2d 222], we held, after reviewing the ballot arguments advocating its passage, that the clause \"does not purport to prohibit all incursion into individual privacy but rather that any such intervention must be justified by a compelling interest.\" ( Id. at p. 775.) In White, we questioned whether there could be a compelling interest justifying a government program of surveillance of university classrooms purportedly for the purpose of uncovering dissident or subversive activity, and held that a cause of action was stated for illegal expenditure of public money on that program. ( Id. at pp. 775-776.)\n\nIn Hill v. National Collegiate Athletic Assn., (supra) , 7 Cal. 4th 1, a case in which I Dissented, the majority rejected the \"compelling interest\" test articulated in White. In what can only be described as a fabrication out of whole cloth, the Hill court interpreted the privacy clause to create a right of action only if the following were alleged and proven: (1) a legally protected privacy interest; (2) a reasonable expectation of privacy; and (3) a serious invasion of the privacy interest amounting to \"an egregious breach of the social norms underlying the privacy right.\" (Hill, (supra) , 7 Cal. 4th at pp. 35-37.) Once this threshold has been crossed, a privacy invasion may nonetheless be shown to be justified by a \"competing interest\" derived from \"the legally authorized and socially beneficial activities of government and private entities,\" the relative importance of which \"is determined by their proximity to the central functions of a particular public or private enterprise.\" ( Id. at p. 38.) Plaintiffs can in turn contest a defense based on countervailing interest by \"demonstrating the availability and use of protective measures, safeguards, and alternatives to the defendant's conduct that would minimize the intrusion on privacy interests.\" (Ibid.)\n\nThe lead opinion now declares, in essence, that the formidable threshold requirements originally set forth in Hill, particularly the requirement that a privacy infringement rise to the level of an \"egregious breach of . . . social norms,\" ( Hill v. National Collegiate Athletic Assn., (supra) , 7 Cal. 4th at p. 37) are no longer part of the state constitutional law of privacy. In its place the lead opinion would employ a balancing test similar to the one used under Fourth Amendment analysis, at least in the case of drug testing by government employers. Because there no longer appears to be support for the Hill test by a majority of this court, and therefore no stare decisis constraint to follow a privacy test with which I have disagreed from the outset, I offer in its place the test I originally proposed in my Dissenting opinion in Hill.\n\nIn my Dissent in Hill, I reviewed, in its full context, the right of privacy declared in article I, section 1 of the California Constitution. I set out the law relating to a plaintiff's right of action thereunder as follows: \"he plaintiff must plead that he has a right of privacy and that it was interfered with by the defendant. The defendant may then plead, beyond simple denial, that any conduct on his part adversely affecting the right of privacy was justified by a compelling public need if it rose to the level of abridgment or that it was allowed as reasonable if it did not. The plaintiff must prove his right of privacy and the defendant's interference therewith by shouldering the generally applicable burden of proof by a preponderance of the evidence [citation]. The defendant must prove under the same burden the justification or allowance of his conduct.\" ( Hill v. National Collegiate Athletic Assn., (supra) , 7 Cal. 4th at pp. 85-86 (dis. opn. of Mosk, J.).)\n\nIn the present case, I conclude that plaintiff has properly pled and proved interference with the right of privacy. As discussed above, drug testing compromises informational privacy, one of the primary concerns of the proponents of the privacy amendment, by forcing those tested to reveal medications they are taking and other intimate medical information. In White v. Davis, (supra) , 13 Cal. 3d at page 775, 120 Cal. Rptr. 94, 533 P.2d 222, we identified as one of the principle \"mischiefs\" cited by the ballot arguments, the \"overbroad collection and retention of unnecessary personal information by government and business interests.\" I also note the ballot arguments specifically identified the intrusive gathering of information during the job application process as a type of abuse of privacy the privacy clause was designed to redress. \"Each time we apply for a credit card or a life insurance policy, file a tax return, interview for a job, or get a drivers' license, a dossier is opened and an informational profile is sketched. Modern technology is capable of monitoring, centralizing and computerizing this information which eliminates any possibility of individual privacy.\" (Ballot Pamp., Proposed Stats. and Amends to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 7, 1972) argument in favor of Prop. 11, p. 27, italics added.) Preemployment urine testing is a quintessential example of an invasion by modern technology of a realm of privacy previously undisturbed, in order to extract information that might be useful to the prospective employer. As such, preemployment drug testing is precisely the kind of privacy invasion with which the privacy clause is concerned.\n\nMoreover, as discussed above, the act of governmental monitoring of urination that occurs during a drug test is also deeply invasive of individual privacy. This is, in itself, an independent reason for finding that drug testing abridges protectible privacy interests under California Constitution article I, section 1. (See Hill, (supra) , 7 Cal. 4th at p. 91 (dis. opn. of Mosk, J.).)\n\nWe turn then to whether there is a \"compelling public need\" for universal preemployment testing by the City. For reasons more fully articulated in the first part of this opinion, I do not find that the City has carried its burden of showing a compelling public need to test all applicants for employment or for promotion. The government does have a legitimate need to make its operations more efficient and effective, and to save the expenditure of tax revenues in its delivery of needed services. But it may not accomplish these general goals through any means, no matter how intrusive of privacy, and no matter how little the means chosen relate to the legitimate government need. As explained in the first part of this opinion, the City has not adequately justified the testing of applicants to all non-safety-sensitive positions. The City has failed to make an adequate showing that the testing of all applicants to employment, and not some narrower group, is necessary to substantially improve the workings of city government.\n\nNor do I find, under the arguably less stringent ad hoc balancing test employed by the lead opinion, that across-the-board applicant testing passes muster under the privacy clause. For reasons explained in the first part of this opinion, the testing of all applicants offered employment with the City cannot, on the record before us, survive a Fourth Amendment challenge. Neither can it survive a challenge under the privacy clause, which provides at least as much protection against government intrusions of privacy as the Fourth Amendment.\n\nIII.\n\nIn short, the City of Glendale has not carried its burden of showing that it has a compelling or substantial need to drug test each of the applicants for whom it has made job offers. In light of the fact that the law of preemployment testing was unclear at the time of trial of this case, I would remand to the City to determine which occupations merit preemployment testing. A job applicant could be subject to a preemployment test if (1) a compelling interest was at stake, as defined by the Skinner, Von Raab, and Vernonia, such as public safety, which would likely be compromised through drug impairment or (2) an interest in the significant improvement in worker productivity was at stake, provided it could be fairly demonstrated that drug abuse was a particular problem in the department to which the prospective employee was applying, and that drug testing could be shown to be a valid means of significantly abating the problem. As part of this determination, an assessment should be made of whether there were sufficient alternate means other than drug testing of evaluating applicants. Both the Fourth Amendment and the privacy clause of the state Constitution require the government to shoulder these evidentiary burdens in order to justify a suspicionless search that intrudes into some of the deepest recesses of an applicant's private life.\n\nI would accordingly partly affirm and partly reverse the decision of the Court of Appeal, and remand the case with directions to refashion the injunction against the City in a manner consistent with this opinion.\n\nKENNARD, J.,\n\nConcurring and Dissenting.-- The Fourth Amendment of the United States Constitution protects an individual from unreasonable searches and seizures. Mandatory urinalysis drug and alcohol testing of prospective and current employees by a government employer is a search within the scope of the Fourth Amendment. (See Skinner v. Railway Labor Executives' Assn. (1989) 489 U.S. 602, 617 [103 L. Ed. 2d 639, 659-660, 109 S. Ct. 1402].) In this case we must determine the reasonableness of such a search.\n\nMore specifically, the issue is this: May the government, here the City of Glendale, require all persons seeking government positions--including both current employees seeking promotion and nonemployees tentatively approved for employment--to submit to urinalysis drug and alcohol testing, when the government has no reason to suspect substance abuse and the positions are not ones in which substance abuse poses special safety or security risks? The lead opinion holds, and I agree, that testing of current employees seeking promotion is unconstitutional. With respect to prospective employees, however, the lead opinion holds that the testing does not violate the Fourth Amendment's prohibition against unreasonable searches and seizures. I do not join in this holding and would invalidate mandatory testing of both prospective and current employees, because the lead opinion provides no persuasive basis for distinguishing between the two groups.\n\nAccording to the lead opinion, across-the-board drug and alcohol testing of nonemployee job applicants imposes a \"rather minor\" intrusion on the privacy of these individuals because they, unlike current employees seeking promotion, must submit to a preemployment physical examination that routinely includes urinalysis. (Lead opn., ante, at p. 884.) The lead opinion's assumption that all \"routine\" physicals are necessarily constitutional, irrespective of their scope, is questionable, as Justice Mosk notes in his Concurring and Dissenting opinion. (Conc. and dis. opn. of Mosk, J., ante, at p. 904.)\n\nFurthermore, as Justice Mosk explains: \"It is evident from the record that whatever physical examination had been done prior to the institution of drug testing did not compel disclosure of all the medications the applicant was taking, nor administer tests that would reveal the presence of such medication; rather, this disclosure was a particular feature of the drug screening. Although the record is somewhat unclear on this point, it appears that urinalysis before drug screening is only for the presence of blood, sugar, and protein in the urine. Moreover, even if the medical examination had required applicants to respond to a written inquiry concerning the medications they were presently taking, such an inquiry is obviously less invasive than the use of urinalysis to obtain such information.\" (Conc. and dis. opn. of Mosk, J., ante, at p. 903.) It also would require the \"additional intrusion of monitored urination--'a type of search particularly destructive of privacy and offensive to personal dignity.' \" (Ibid.)\n\nThe lead opinion stresses the economic interest of employers, public as well as private. It points to studies reporting a link between employee drug use and \"increased absenteeism, diminished productivity, greater health costs, . . . and more frequent turnover.\" (Lead opn., ante, at p. 882.)1a Nonetheless, with respect to current employees, the lead opinion concludes that suspicionless across-the-board drug and alcohol testing is not necessary to serve the employer's economic interest. As the lead opinion explains, the employer has a less intrusive way to determine whether a current employee's work performance is affected by substance abuse, namely, by observing the employee at work and evaluating the employee's work product, safety record, and attendance record. (Lead opn., ante, at p. 883.)\n\nThis same method is equally available to evaluate a job applicant hired on a probationary basis. But the lead opinion rejects this approach. Hiring the applicant, according to the lead opinion, \"represents a considerable investment on the part of an employer, often involving the training of the new employee,\" and replacing the applicant \"generally will entail additional expenses, including those relating to the hiring of a replacement.\" (Lead opn., ante, at p. 883.) Because of these economic factors, the lead opinion states, the employer needs to conduct suspicionless urinalysis testing of all job applicants.\n\nI question whether the government's purely economic considerations, as articulated by the lead opinion, can ever be sufficient \"to overcome the interests in vindicating human dignity\" embodied in the constitutionally guaranteed right of privacy. (Holtzman, Applicant Testing for Drug Use: A Policy and Legal Inquiry (1991) 33 Wm. \u0026 Mary L.Rev. 47, 90; see also Note, Middlebrooks v. Wayne County: Does Governmentally Imposed Preemployment Drug Testing Dispose of Constitutional Rights? (1995) 1995 Det. C.L.Rev. 1155, 1178-1179.) The United States Supreme Court has never found a government employer's economic interest to be sufficient to permit suspicionless drug or alcohol testing. But even assuming, for the sake of argument, that purely economic considerations may sometimes justify such action, to pass constitutional muster the government would have to show that the invasion of the individual's constitutional right to privacy is necessary because the government's economic interest is substantial and there is no less intrusive alternative available. Only then would the government's purely economic interest be \" important enough \" to justify the particular search at hand. ( Vernonia School Dist. 47J v. Acton (1995) 515 U.S. 646, [132 L. Ed. 2d 564, 579, 115 S. Ct. 2386, 2394-2395], italics in original.) Here, the City of Glendale has not made such a showing.\n\nIn this case, I am not persuaded that the City of Glendale's urinalysis drug and alcohol testing of all job applicants tentatively approved for employment will save the city substantial amounts of money, and that the city has no less invasive alternative. I question how effective such testing is at predicting which persons' job performance will be impaired by substance abuse. Testing will not weed out persons who begin substance abuse after they are hired. It also will not reveal whether the job applicant has temporarily abstained from the use of alcohol or drugs in order to pass the test. (Note, Middlebrooks v. Wayne County: Does Governmentally Imposed Preemployment Drug Testing Dispose of Constitutional Rights?, (supra) , 1995 Det. C.L.Rev. at p. 1177.) Nor is it true that every job applicant who tests positive will be an incompetent employee. In sum, the City of Glendale's urinalysis drug and alcohol screening of all prospective employees is both overinclusive and underinclusive: overinclusive because some capable and productive workers will, if a trace of an illicit substance is found, fail the test; and underinclusive because some prospective employees will, simply by temporarily abstaining from using illicit substances, be able to pass the test.\n\nFurther, there is a less intrusive alternative to determine whether substance abuse will impair a new employee's job performance: a probationary period during which the employer can observe the employee on the job. (Note, Middlebrooks v. Wayne County: Does Governmentally Imposed Preemployment Drug Testing Dispose of Constitutional Rights?, (supra) , 1995 Det. C.L.Rev. at p. 1177.) (This is the same method that the lead opinion applies to current employees being considered for promotion.) Granted, this alternative may impose certain costs on the employer. But such costs are offset, at least to some extent, by the greater accuracy that on-the-job observation would provide in determining a new employee's job performance. The City of Glendale has not demonstrated that, on balance, the costs of probationary observation are so great as to justify the substantial intrusion on constitutionally protected privacy interests that across-the-board suspicionless urinalysis inflicts on prospective employees.\n\nBecause I conclude that the Fourth Amendment does not permit the City of Glendale to engage in blanket suspicionless urinalysis drug and alcohol testing either of employees seeking promotion or of prospective employees, I do not address whether the City's testing also violates an individual's right to privacy set forth in article I, section 1 of the California Constitution.\n\nConclusion\n\nSubstance abuse has ruined countless lives and has caused economic losses to government and industry. Yet, when considering the constitutionality of government-conducted suspicionless urinalysis testing for substance abuse, courts must consider not only the government employer's economic interest but also the constitutionally protected interests of citizens in the sanctity of their privacy. We live in an era when personal information that previously could only have been gathered at great expense, or could not have been gathered at all, is now routinely collected, analyzed, packaged, and distributed at great speed and trivial cost. As the economic and technological barriers to the invasion of privacy have collapsed, the constitutional protection of our privacy assumes an ever-increasing importance.\n\nThis case conjures up visions of an Orwellian nightmare in which the government, through intrusive bodily testing, microscopically scrutinizes the most intimate aspects of the bodies and lives of all individuals seeking government positions, justifying such scrutiny on the ground that the intrusions will enhance efficiency, productivity, and cost-effectiveness. In the words of one commentator: \"y submitting millions of Americans to systematic bio-chemical surveillance of their blood or urine, our level of expectations of individual privacy will greatly diminish, and we will, thereby, surrender a considerable amount of autonomy, dignity and sovereignty. We [will] have allowed the government and employers to transcend an invisible shield which stood at the edge of our bodies. . . . John Stuart Mill's aphorism, 'Over himself, over his own body and mind, the individual is sovereign,' no longer sounds relevant.\" (Proposal for a Substance Abuse Testing Act: The Report of the Task Force on the Drug-Free Workplace, Institute of Bill of Rights Law (1991) 33 Wm. \u0026 Mary L.Rev. 5, 33-34. [Comment of task force member Cornish, italics omitted.])\n\nCHIN, J.,\n\nConcurring and Dissenting.-- I concur in the lead opinion insofar as it upholds the drug testing program of the City of Glendale (City) as to conditionally accepted applicants for new employment. I disagree with the lead opinion, however, to the extent it completely invalidates City's program as to conditionally promoted, current employee applicants without giving City needed guidance as to which job positions could properly justify applicant testing. I believe City's program is valid in its entirety, and I fail to see any significant legal distinction between the two categories of applicants. Indeed, the lead opinion's otherwise informative footnote 1 (lead opn., ante, at p. 853) fails to include the fact that five members of this court (Justice Mosk, Justice Kennard, Justice Baxter, Justice Brown, and myself) find that distinction legally unsound.\n\nIn determining the validity of City's program, the lead opinion purports to balance the job applicant's privacy interests and expectations with City's public interest in maintaining a drug-free working environment in its offices. All the applicable authorities support the use of such a balancing test. (See Vernonia School Dist. 47J v. Acton (1995) 515 U.S. 646, [132 L. Ed. 2d 564, 574, 115 S. Ct. 2386, 2390-2391] (Vernonia); Skinner v. Railway Labor Executives' Assn. (1989) 489 U.S. 602, 619 [103 L. Ed. 2d 639, 661, 109 S. Ct. 1402] (Skinner); Treasury Employees v. Von Raab (1989) 489 U.S. 656, 665-666 [103 L. Ed. 2d 685, 702, 109 S. Ct. 1384] (Von Raab); Hill v. National Collegiate Athletic Assn. (1994) 7 Cal. 4th 1, 39-40 [26 Cal. Rptr. 2d 834, 865 P.2d 633] (Hill).) But contrary to the lead opinion, in this case the balance clearly favors City as to both classes of applicants covered by its drug testing program.\n\nIn my view, whether we apply the federal or California cases on the subject of drug testing, we should uphold City's program in its entirety. The supposed privacy intrusions (indirect monitoring of urination and confidential questioning about current use of prescription drugs) are equally minimal, whether applied to new or conditionally promoted employees. The testing and medical inquiry is confidential, nonrandom, and relatively nonintrusive, being performed during a comprehensive medical examination routinely given to all applicants for new employment or promotion.\n\nMoreover, City's interest in assuring that its employees are drug free is as great or greater with respect to applicants seeking promotion to positions carrying higher responsibility than with respect to applicants seeking entry level positions. As we shall see, all the circumstances the lead opinion cites to support drug testing of applicants for new employment likewise would support testing of applicants for promotion.\n\n1. CITY'S PLAN IS ONLY MINIMALLY INTRUSIVE\n\na. Drug testing occurs as part of a routine medical examination\n\nThe lead opinion correctly observes that City's drug testing occurs during a comprehensive medical examination routinely given to all applicants for new employment or promotion. (Lead opn., ante, at pp. 853-854.) As the lead opinion states, \"the intrusion on privacy is significantly diminished because the drug testing urinalysis in this case was administered as part of a preemployment medical examination that the job applicant, in any event, would have been required to undergo.\" (Lead opn., ante, at p. 884, fn. omitted.)\n\nCity's program requires conditionally promoted employees to take the drug test as part of the same comprehensive medical exam required of all applicants for employment. In my view, this aspect of the plan provides a ready means of distinguishing the high court cases on which the lead opinion relies in invalidating City's plan as to promoted employees. As the lead opinion itself acknowledges, \"neither Skinner nor Von Raab considered whether the intrusion on privacy rises to [a significant] level when such drug testing is not administered as a separate procedure (as it was in Skinner and Von Raab) but rather is conducted as part of a comprehensive medical examination that already includes a urinalysis component.\" (Lead opn., ante, at p. 884.)\n\nA statement in Von Raab also supports this position. In finding that persons seeking promotions to positions involving handling of sensitive materials could be drug tested, the high court added that this testing would be appropriate, \"especially if the positions covered under this category require background investigations, medical examinations, or other intrusions that may be expected to diminish their expectations of privacy in respect of a urinalysis test.\" (Von Raab, (supra) , 489 U.S. at p. 677 [ 103 L. Ed. 2d at p. 710], italics added.) This statement suggests that applicants' privacy expectation is diminished, and the analysis differs, when, as here, drug testing is incident to a medical exam.\n\nb. ADA allows medical examinations of promoted employees\n\nIn concluding that Von Raab forecloses City's attempt to test conditionally promoted applicants, the lead opinion erroneously assumes that the federal Americans with Disabilities Act (42 U.S.C.S. § 12101-12213) (ADA) would preclude consensual drug testing and medication disclosure as part of a routine medical examination taken following a conditional offer of promotion. (Lead opn., ante, at pp. 885-886.) I disagree.\n\nFirst, as the lead opinion observes (lead opn., ante, at p. 886, fn. 18), plaintiff has not raised an ADA challenge to City's policy of requiring exams for conditionally promoted employees, and the parties have not briefed the issue. We should not reach this important, perhaps even pivotal, point of federal law under these circumstances.\n\nSecond, I dispute the lead opinion's Conclusion that the ADA would forbid an employer to require a current employee who seeks a promotion to submit to a medical examination, or would allow such an examination only if \"the nature and duties of the employment position to which the current employee is seeking promotion differ in some relevant respect from those of the employee's current position.\" (Lead opn., ante, at p. 886.) To the contrary, the ADA allows medical examinations which are \"job-related and consistent with business necessity.\" (42 U.S.C.S. § 12112(d)(4)(A).) Clearly, the conditional approval of a promotion necessarily renders a current medical examination both \"job-related\" and \"consistent with business necessity\" under the ADA.\n\nIndeed, the lead opinion acknowledges that, in testing, City \"is seeking information that is relevant to its hiring decision and that it legitimately may ascertain.\" (Lead opn., ante, at p. 883, fn. 15.) Is not the testing therefore \"job-related and consistent with business necessity\" under the ADA? (See also 42 U.S.C.S. § 12114(a) [ADA does not apply to employee or applicant currently engaging in illegal drug use]; Collings v. Longview Fibre Co. (9th Cir. 1995) 63 F.3d 828, 831-836 [provisions of ADA and comparable Washington statute do not protect current drug users from discharge for drug-related misconduct].) Thus, City properly treats newly hired and newly promoted employees equally in requiring drug testing as a component of a comprehensive medical examination.\n\nc. Only indirect, aural monitoring of urination is involved\n\nI believe it quite significant that only indirect monitoring of the urination process is involved in City's program, as contrasted to the more intrusive direct visual monitoring at issue in Hill. Although the lead opinion fails to mention it, all the leading cases observe that such indirect monitoring is minimally intrusive or, as Vernonia describes it, \"negligible.\" (Vernonia, (supra) , 515 U.S. at p. [ 132 L. Ed. 2d at p. 578, 115 S. Ct. at p. 2393]; see Hill, (supra) 7 Cal. 4th at pp. 43, 51-52; Skinner, (supra) , 489 U.S. at p. 626 [ 103 L. Ed. 2d at pp. 665-666]; Von Raab, (supra) , 489 U.S. at pp. 672-673, fn. 2 [ 103 L. Ed. 2d at p. 706]; Willner v. Thornburgh (D.C. Cir. 1991) 928 F.2d 1185, 1189-1191 [289 App.D.C. 93] (Willner), cert. den. sub nom. Willner v. Barr (1991) 502 U.S. 1020 [116 L. Ed. 2d 760, 112 S. Ct. 669].)\n\nThe lead opinion does recognize that \"[a]lthough in this case the city's addition of the drug screening test to its preexisting medical examination procedure was accompanied by the institution of several new security measures (such as the aural monitoring of the urinalysis process) that entailed some additional intrusion on the applicant's privacy with regard to providing the urine sample, the incremental intrusion on privacy attributable to these new measures appears rather minor when viewed in the context of a complete medical examination.\" (Lead opn., ante, at p. 884, fn. omitted, original italics.) I agree, and I note that such reasoning applies with equal force to conditionally promoted employees.\n\nd. Medical inquiry regarding current drug use is nonintrusive\n\nFinally, I observe that confidential medical inquiry regarding a conditionally hired applicant's present use of prescribed drugs involves no serious infringement of informational privacy, and the lead opinion appears to agree. (See lead opn., ante, at p. 884, and fn. 17.) The United States Supreme Court has held that requiring advance disclosure of medications as part of a drug testing program is neither per se unreasonable nor a significant invasion of privacy where, as here, the program limits disclosure to authorized medical and administrative personnel. (See Vernonia, (supra) , 515 U.S. at p. [ 132 L. Ed. 2d at pp. 577-579, 115 S. Ct. at pp. 2393-2394]; see also Skinner, (supra) , 489 U.S. at p. 626, fn. 7 [ 103 L. Ed. 2d at p. 666].) As the record indicates, City's program required that it hold any medical information it received from applicants in strict confidence and not divulge the information to law enforcement agencies or other persons lacking a legitimate need to know it.\n\nWe should keep in mind that City's medication disclosure requirement was deemed necessary to protect applicants, and not merely to increase the accuracy of the testing. The disclosure requirement protects applicants from \"false positive\" drug test results by allowing them to reveal any legally prescribed medications they may be taking. (See Hill, (supra) , 7 Cal. 4th at pp. 52-54.)\n\nThus, I think it beyond reasonable dispute that City's drug testing program resulted in only a slight, minimal, or \"negligible\" intrusion on personal privacy. I turn next to the question whether new or conditionally promoted employees had or have a reasonable expectation that such minimal intrusions will not occur.\n\n2. CONDITIONALLY HIRED OR PROMOTED EMPLOYEES HAVE A REDUCED EXPECTATION OF PRIVACY AS TO BEING TESTED FOR ILLEGAL DRUGS\n\nNext I observe that, in addition to the minimally intrusive nature of the procedures involved here, applicants for employment or promotion with City have a reduced expectation of privacy regarding being tested for illegal drugs. Although the lead opinion disclaims reliance on this factor (see lead opn., ante, at p. 886, fn. 19), all applicants (including those seeking promotion) have advance notice of the testing requirement. Most leading cases in the area stress the element of advance notice as a factor in upholding applicant testing as opposed to unannounced, random testing of current employees. (E.g., Von Raab, (supra) , 489 U.S. at p. 672, fn. 2 [103 L. Ed. 2d at p. 706] [advance notice procedure \"significantly minimize[s] the program's intrusion on privacy interests\"]; Willner, (supra) , 928 F.2d at pp. 1188-1194; Harmon v. Thornburgh (D.C. Cir. 1989) 878 F.2d 484, 489 [278 App.D.C. 382], cert. den. sub nom. Bell v. Thornburgh (1990) 493 U.S. 1056 [107 L. Ed. 2d 949, 110 S. Ct. 865]; American Postal Workers Union v. Frank (D.Mass. 1990) 734 F. Supp. 40, 41, revd. on other grounds (1st Cir. 1992) 968 F.2d 1373; Transportation Institute v. U.S. Coast Guard (D.D.C. 1989) 727 F. Supp. 648, 654-655; Hill, (supra) , 7 Cal. 4th at p. 42; Wilkinson v. Times Mirror Corp. (1989) 215 Cal. App. 3d 1034, 1048-1050 [264 Cal. Rptr. 194]; Middlebrooks v. Wayne County (1994) 446 Mich. 151 [521 N.W.2d 774, 783-784] (conc. opn. of Boyle, J.); Comment, Government Drug Testing: A Question of Reasonableness (1990) 43 Vand. L.Rev. 1343, 1367 \u0026 fn. 216, 1368, fn. 220 [minimal intrusion as applied to job applicant testing].)\n\nI conclude that because applicants for City employment or promotion anticipate testing regarding their ingestion of illegal drugs, they have a reduced expectation of privacy regarding such testing.\n\n3. CITY HAS IMPORTANT AND SUBSTANTIAL INTERESTS IN TESTING CONDITIONALLY HIRED OR PROMOTED EMPLOYEES\n\nEven if plaintiff had demonstrated that City's drug testing program involved a substantial or serious privacy intrusion, and that conditionally promoted applicants had a reasonable expectation they would not be tested for illegal drugs, clearly City has shown sufficient justification for imposing a drug test requirement despite the intrusion. City's interest in maintaining a drug-free working environment for all City offices is equally important and substantial whether new or conditionally promoted employees are involved. Indeed, in most instances, City would appear to have a far greater interest in assuring that persons promoted to higher, more responsible City positions are drug free.\n\nAlthough the lead opinion properly finds the Court of Appeal's \"disastrous consequence\" test too restrictive (see lead opn., ante, at p. 900, fn. 25), the lead opinion otherwise gives no further guidance to City or others who wish to design a constitutional drug testing program covering conditionally promoted employees. Instead, the lead opinion simply cites a random testing case ( Harmon v. Thornburgh, (supra) , 878 F.2d 484) as illustrative of \"current constitutional and statutory authority.\" (Lead opn., ante, at p. 899.) Rather than refer City to an inapposite decision (closer on point would be Willner, (supra) , 928 F.2d 1185, an applicant testing case), I would advise City that the state and federal Constitutions are clearly satisfied by the following important and substantial public interests City has already asserted in this case.\n\na. Drug testing helps assure work force economy, efficiency, and safety\n\nFirst and foremost, City has an important and legitimate interest in hiring and promoting a safe, secure, dependable, and efficient workforce. In this case, City had experienced prior disciplinary problems related to drug use by its employees. City knew that, in one sampling, more than one fifth of all prospective employees tested positive for illegal drugs. City accordingly could foresee that additional problems would arise in the future unless it initiated an effective drug testing or screening program.\n\nThus, a consideration present with respect to all applicants for employment or promotion to any City job is City's need to reduce the adverse effects of drug use among its employees, effects that would include decreased efficiency and morale as well as increased costs from employee assistance or rehabilitation programs, workers' compensation payments, medical and hospitalization benefits, and sick leave. As the lead opinion acknowledges, \"[i]n light of the well-documented problems that are associated with the abuse of drugs and alcohol by employees--increased absenteeism, diminished productivity, greater health costs, increased safety problems and potential liability to third parties, and more frequent turnover--an employer, private or public, clearly has a legitimate (i.e., constitutionally permissible) interest in ascertaining whether persons to be employed in any position currently are abusing drugs or alcohol.\" (Lead opn., ante, at pp. 882-883, fns. omitted.) These considerations apply with equal force to employees seeking promotion to new, and possibly higher, levels of responsibility.\n\nThe lead opinion (ante, at pp. 882-883) speculates that employers presumably have already gathered information regarding existing employees' productivity, absenteeism records, and the like, and thus have less need to test those employees for drugs. This is a weak point of distinction. An untested, drug-abusing employee who is satisfactorily \"getting by\" at a lower job level may well prove totally inadequate at a new position involving additional skills or responsibilities. Thus, an employer has an obvious and immediate need to test persons being considered for promotion.\n\nThe United States Supreme Court has expressed doubt as to the effectiveness of employer observations for detecting drug use. (See Skinner, (supra) , 489 U.S. at p. 628 [103 L. Ed. 2d at p. 667] [drug-impaired employees \"will seldom display any outward 'signs detectable by the lay person or, in many cases, even the physician' \"]; Von Raab, (supra) , 489 U.S. at p. 674 [ 103 L. Ed. 2d at p. 707] [\"Detecting drug impairment on the part of employees can be a difficult task, especially where . . . it is not feasible to subject employees and their work product to the kind of day-to-day scrutiny that is the norm in more traditional office environments.\"]; see also National Treasury Emp. Union v. U.S. Customs Serv. (D.C. Cir. 1994) 27 F.3d 623, 629 [307 App.D.C. 173] [\"A use of drugs, including weekend use, that is sufficient to expose an employee to bribery or intimidation by a drug smuggler will not necessarily affect the user's work product, and may thus escape detection through 'day-to-day scrutiny' of the employee's performance on the job.\"].)\n\nThus, I would conclude that the lead opinion's purported distinction between newly hired and newly promoted employees is illogical and impractical, and affords insufficient basis for partly invalidating City's drug testing program.\n\nb. Public nature of City government justifies drug testing\n\nThe high court has indicated that the \"operation of a government office\" may present \"special needs\" beyond normal law enforcement that would justify drug testing. (Skinner, (supra) , 489 U.S. at pp. 619-620 [ 103 L. Ed. 2d at p. 661]; see also Willner, (supra) , 928 F.2d at p. 1188, discussed below.) City's very nature as a public enterprise involves considerations of public safety, health, security, morale, and fiscal integrity, which are necessarily inherent in some degree in every job category. Drug use predictably could adversely affect City employees' ability to function effectively and efficiently in all these areas. The overriding public interest in assuring the safe, sound, and efficient operation of City government amply justifies the minimal privacy intrusions involved here.\n\nMoreover, running a city effectively requires a high degree of public trust in those who carry out its daily operations. City has an obvious need to maintain public confidence in the integrity and efficiency of its work force and to secure capable and productive employees before their new terms of employment commence. (See Willner, (supra) , 928 F.2d at p. 1192.)\n\nFor example, under City's \"Major Emergency Disaster Preparedness Plan,\" all City employees must be prepared to be available to assist the public during major disasters or emergencies. (See Gov. Code, § 3100 et seq.) Additionally, many if not most City employees are engaged in tasks--such as operating machinery, working in or near power, water, construction or sanitation facilities, or driving motor vehicles--that could well have public safety implications. Many other City employees are entrusted with or have access to sensitive or confidential information or substantial public funds.\n\nThese factors unite to provide important and substantial justifications for City's drug testing program when balanced against the very minor privacy intrusions involved in that program.\n\nc. Case law supports drug testing\n\nI note that none of the applicable cases, federal or state, draws a distinction between newly hired and newly promoted employees for purposes of privacy analysis. The cases do distinguish generally between across-the-board applicant testing, as involved in this case, and random, unannounced testing, a more difficult area not directly apposite to our situation. (See, e.g., IBEW, Local 1245 v. U.S. NRC (9th Cir. 1992) 966 F.2d 521 [upholding random drug testing for certain nuclear power plant workers]; AFGE Local 1533 v. Cheney (9th Cir. 1991) 944 F.2d 503 [upholding random testing of civilian Navy personnel with access to classified information]; Intern. Broth. of Teamsters v. Dept. of Transp. (9th Cir. 1991) 932 F.2d 1292, 1300-1307, and cases cited at p. 1306 [upholding random testing and preemployment testing for commercial bus and truck drivers]; National Treasury Employees Union v. Yeutter (D.C. Cir. 1990) 918 F.2d 968, 971-976 [287 App.D.C. 28] [upholding drug testing for all \"on-duty\" Department of Agriculture employees operating motor vehicles carrying passengers, but requiring nexus between employment and potential harm as to \"off-duty\" drug use]; IBEW, Local 1245 v. Skinner (9th Cir. 1990) 913 F.2d 1454 [upholding federal testing of natural gas and pipeline employees]; Bluestein v. Skinner (9th Cir. 1990) 908 F.2d 451, 454-458 [upholding government testing of private pilots, flight crews, and controllers]; Transport Workers' Union v. S.E. PA. Transp. Auth. (3d Cir. 1988) 884 F.2d 709 [upholding government testing of mass transit workers]; National Federation of Federal Employees v. Cheney (D.C. Cir. 1989) 884 F.2d 603 [280 App.D.C. 164] [invalidating in part random drug testing by Army Department of all civilian employees in certain \"critical\" positions]; Harmon v. Thornburgh, (supra) , 878 F.2d 484 [invalidating, as overly broad, random testing of all Department of Justice criminal prosecutors]; American Fed. of Gov. Emp. v. Derwinski (N.D.Cal. 1991) 777 F. Supp. 1493, 1500-1501 [invalidating in part random testing of Veterans Administration personnel for lack of sufficient nexus with job safety].)\n\nThe constitutional problems some courts have noted with respect to random drug testing result from its more intrusive nature, which involves occasional, unpatterned, and unannounced drug testing of current employees. Obviously, that testing presents greater privacy concerns than situations where, as here, the persons tested have prior notice of the test, and indeed have initiated the steps leading to the testing to obtain employment or promotion.\n\nTo justify random testing of current employees, the government generally must show a direct nexus, usually involving safety, integrity, or security considerations, between the job duties and the anticipated harm. (See, e.g., Harmon v. Thornburgh, (supra) , 878 F.2d at pp. 488-492, and cases cited; Note, Dimeo v. Griffin : Another Random Drug Test or the Latest Infringement on the Fourth Amendment Rights of American Workers? (1993) 87 Nw. U. L.Rev. 1087, 1111-1114.) Unlike applicant testing, random employee testing does not occur at a predetermined time, with advance notice, as part of a routine process which the applicant voluntarily initiates by applying for employment or promotion. Most cases recognize the distinguishable nature of preemployment or prepromotion testing.\n\nThus, with few exceptions, cases have had no difficulty upholding applicant drug testing programs that would have been of questionable constitutionality if arising in a different context. (See Von Raab, (supra) , 489 U.S. at pp. 667, 672-673, fn. 2 [103 L. Ed. 2d at pp. 706-707]; Piroglu v. Coleman (D.C. Cir. 1994) 25 F.3d 1098, 1103-1104 [306 App.D.C. 392] [upholding random drug tests for trainees during probationary period]; Intern. Broth. of Teamsters v. Dept. of Transp., (supra) , 932 F.2d at pp. 1299, 1307; Willner, (supra) , 928 F.2d at pp. 1188-1194; IBEW, Local 1245 v. Skinner, (supra) , 913 F.2d at p. 1464 [privacy considerations ordinarily applicable in random testing situations are not pertinent to applicants for employment]; Harmon v. Thornburgh, (supra) , 878 F.2d at p. 489 [acknowledging distinction]; Nat. Federation of Fed. Employees v. Weinberger (D.C. Cir. 1987) 818 F.2d 935, 943 [260 App.D.C. 286]; American Postal Workers Union v. Frank, (supra) , 734 F. Supp. at p. 41, revd. on other grounds (1st Cir. 1992) 968 F.2d 1373; Transportation Institute v. U.S. Coast Guard, (supra) , 727 F. Supp. at pp. 654-655 [upholding preemployment testing for private employees in maritime industry]; Wilkinson v. Times Mirror Corp. supra, 215 Cal. App. 3d at pp. 1048-1050 [upholding preemployment testing by private employer]; Middlebrooks v. Wayne County, (supra) , 521 N.W.2d at pp. 783-784 (conc. opn. of Boyle, J.); see also 4 LaFave, Search and Seizure (3d ed. 1996) § 10.2(g), p. 450 [\"somewhat more likely to be upheld are testing schemes which are part of an established physical examination or of a screening process for prospective employees\" (fns. omitted)].)\n\nIn Willner, (supra) , 928 F.2d 1185, plaintiff applicant was disqualified for failing to take a drug test for an attorney position with the Department of Justice. Plaintiff sued, and the federal district court enjoined further drug testing, relying on an earlier random testing case ( Harmon v. Thornburgh, (supra) , 878 F.2d 484). On appeal, a majority of the court reversed the judgment. The court's reasoning is quite pertinent to our case.\n\nFirst, the Willner majority observed that the challenged drug testing program was supported by a special need beyond mere law enforcement, namely, the government's interest in the \" 'operation of a government office.' \" (Willner, (supra) , 928 F.2d at p. 1188, quoting Skinner, (supra) , 489 U.S. at pp. 619-620 [ 103 L. Ed. 2d at p. 661].) Perhaps recognizing that such a \"special need\" arguably fell short of the safety, integrity, or security concerns present in many of the random search cases, Willner distinguished applicant testing and observed that no \"high degree of justification\" would be required in those cases, where the applicants had little or no reasonable expectation of privacy, and the intrusion into their personal privacy was minimal. (Willner, (supra) , 928 F.2d at pp. 1188-1189.) That analysis is consistent with Skinner and Von Raab and is fully applicable here.\n\nWillner stressed that (1) the job applicant testing involved only indirect monitoring; (2) all applicants had prior notice that drug tests would be conducted as a prerequisite to employment; (3) testing was neither random nor discretionary but certain to occur as part of the application process; and (4) testing resulted from the exercise of a personal choice to apply for the position. (Willner, (supra) , 928 F.2d at pp. 1189-1191.) Each of these factors reduced the applicants' expectation of privacy and effected a minimal privacy intrusion. All of them exist in the present case, as to applicants both for initial employment and for promotion.\n\nThus, Willner observed that job applicants \"know they will have to undergo a drug test if they are tentatively selected for employment . . . . Pre-employment testing is not random. . . . ll applicants must provide a urine sample before being hired. The procedure is scheduled ahead of time and the applicant is given advance notice of the date. All of this, Von Raab indicated, reduces 'to a minimum' the unsettling effect of unexpected intrusions. . . . Similarly, it is significant that the individual has a large measure of control over whether he or she will be subject to urine testing. No one is compelled to seek a job at the Department of Justice. [Citation.] If individuals view drug testing as an indignity to be avoided, they need only refrain from applying. This too is an important distinction between applicants and incumbents. The choice presented to current employees--undergo random drug testing or lose your job--is not comparable to that facing applicants.\" (Willner, (supra) , 928 F.2d at pp. 1189-1190.)\n\nWillner noted that, under Von Raab, the employees \"became subject to drug testing only because they chose to apply for promotions. To that extent, they also had control over whether they would be tested and they had advance knowledge of the testing. The Supreme Court considered these factors among others that served to diminish their expectation of privacy. [Citation.]\" (Willner, (supra) , 928 F.2d at p. 1190.)\n\nAs for the competing governmental interests that courts must weigh in the balance, Willner elaborated on the justification it had mentioned earlier, namely, the special needs inherent in operating a government office. The court stated that a government entity \"has a legitimate interest in maintaining public confidence and trust\" in its operations. (Willner, (supra) , 928 F.2d at p. 1192.) Drug use by its employees would seriously undermine that confidence. (Ibid.) Additionally, the government has an overriding interest in securing a work force qualified to do the assigned work. (Ibid.; see also Comment, Weighing the Factors of Drug Testing for Fourth Amendment Balancing (1992) 60 Geo. Wash. L.Rev. 1151, 1186-1187 [discussing government's interest in assuring integrity of its workplace as justification for drug testing].)\n\nI do not, of course, reach the more difficult question whether or not these considerations would justify random testing of incumbent, nonapplicant government employees. Different factors (including the employees' possibly heightened expectation of privacy) may come into play in these situations. (See Willner, (supra) , 928 F.2d at pp. 1192-1193.) But a public employer's need to screen out unsuitable applicants for employment or promotion before they join the work force or assume their new positions is obvious and substantial.\n\n4. Conclusion\n\nThe privacy intrusions involved in City's drug testing program (indirect, aural monitoring; confidential questioning) are minimal and negligible under the applicable case law. Testing is neither random nor discretionary, but is predictable, routine, and certain, being conducted in a medical environment as part of a regular, comprehensive medical examination given to all applicants for employment or promotion. The tests are performed under circumstances aimed at maintaining a reasonably high degree of confidentiality, personal dignity, and privacy.\n\nApplicants for employment or promotion, having prior notice that they must take drug tests, have a reduced expectation of privacy concerning tests designed to disclose facts regarding any present illegal drug use.\n\nBalanced against the minimal intrusion on the applicants' privacy are City's important and substantial interests in maintaining a drug-free environment for all its new or promoted employees, in minimizing the costs inherent in drug abuse and rehabilitation, and in serving the overriding public interest in the safe and efficient operation of City government.\n\nI would uphold City's drug testing program in its entirety.\n\nBaxter, J., and Brown, J., concurred.\n\nBROWN, J.,\n\nConcurring and Dissenting.--I join in Justice Chin's Concurring and Dissenting opinion. Of necessity, his opinion accepts the existing terms of the debate and argues--persuasively in my view--the City of Glendale's drug testing plan could be sustained under the current standards enunciated by the United States Supreme Court. Of course, the alternate view is equally sustainable since the balancing test articulated in recent precedents is \"inherently, and doubtless intentionally, imprecise.\" ( Willner v. Thornburgh (D.C. Cir. 1991) 928 F.2d 1185, 1187 [289 App.D.C. 93] (hereafter Willner).) Thus, I write separately to point out why the debate is neither compelling nor useful in deciding the narrow question of the constitutionality of noticed, mandatory drug testing.\n\nUnder the standard fashioned in Treasury Employees v. Von Raab (1989) 489 U.S. 656, 665 [103 L. Ed. 2d 685, 701-702, 109 S. Ct. 1384], mandatory drug testing is an unreasonable search prohibited by the Fourth Amendment unless it is required by \"special governmental needs, beyond the normal need for law enforcement,\" and those needs outweigh the employee's privacy interest. \"The Court did not purport to list all of the factors that should be weighed or to identify which factors should be considered more weighty than others.\" (Willner, (supra) , 928 F.2d at p. 1187.) This is not a standard; it is a conundrum. As with other attempts to apply amorphous balancing tests, multitiered levels of scrutiny, and abstract evidentiary exclusions, the results can only be described as whimsical. (Comment, Weighing the Factors of Drug Testing for Fourth Amendment Balancing (1992) 60 Geo. Wash. L.Rev. 1151, 1152-1153, 1168-1196; Comment, Government Drug Testing: A Question of Reasonableness (1990) 43 Vand. L.Rev. 1343, 1369-1372, 1375-1376.)\n\nIn this case and others like it involving the interests of government solely as an employer and the surrender of a constitutional right as a condition of obtaining a mere benefit or \"privilege,\" I would argue for a return to an earlier view, pungently expressed by Justice Holmes while a member of the Supreme Judicial Court of Massachusetts: \"The petitioner may have a constitutional right to talk politics, but he has no constitutional right to be a policeman.\" ( McAuliffe v. Mayor, etc., of City of New Bedford (1892) 155 Mass. 216 [29 N.E. 517].)\n\nI realize, of course, that for many years Holmes's view has been out of fashion. His epigrammatic flair in McAuliffe, and later in Frost Trucking Co. v. R. R. Com. (1926) 271 U.S. 583, 601 [70 L. Ed. 1101, 1108, 46 S. Ct. 605, 47 A.L.R. 457] (\"acts in other circumstances unlawful may be justified by the purpose for which they are done\" (dis. opn. of Holmes, J., joined by Brandeis, J.)), may even have helped provoke the reevaluation that led to the shibboleth of \"unconstitutional conditions\" and, for a time, the near disappearance from American constitutional law of the so-called \"rights-privilege distinction.\" (See, e.g., Speiser v. Randall (1958) 357 U.S. 513, 518-519 [2 L. Ed. 2d 1460, 1468, 78 S. Ct. 1332]; Sherbert v. Verner (1963) 374 U.S. 398, 404 [10 L. Ed. 2d 965, 970-971, 83 S. Ct. 1790]; Pickering v. Board of Education (1968) 391 U.S. 563, 568 [20 L. Ed. 2d 811, 817, 88 S. Ct. 1731]; Perry v. Sindermann (1972) 408 U.S. 593, 596-598 [33 L. Ed. 2d 570, 576-578, 92 S. Ct. 2694].)\n\nIf a doctrine of unconstitutional conditions does exist, its purview is quite limited. There are certainly circumstances in which we should view any claim of consent with a jaundiced eye. For example, when the government runs the only game in town (the ability to hold public office), makes a citizen an offer that cannot be refused (your money or your life), conditions the exercise of one constitutional right on the relinquishment of another compatible constitutional right (freedom to practice religion in exchange for silence in the political process), or seeks to impose a condition having no conceivable connection to the underlying activity, the degree of coercion inherent in such a bargain may vitiate any claim of voluntariness. (See generally, Easterbrook, Insider Trading, Secret Agents, Evidentiary Privileges, and the Production of Information (1981) Sup. Ct. Rev. 309, 348-349.) However, to the extent the doctrine of unconstitutional conditions purports to hold that government may not grant a benefit on the condition that the beneficiary surrender a constitutional right, even if the government may withhold the benefit altogether, it seems more a figment of academic imagination than a reality.\n\nAs Judge Easterbrook has pointed out, \"[c]onstitutional rights are waived every day. People incriminate themselves, surrender their rights to counsel, waive a bundle of rights as part of plea bargains, and sign contracts surrendering a right to trial through arbitration or confession of judgment clauses. . . . Congress routinely makes states offers they cannot refuse, states take federal money and surrender rights to autonomous government. . . . In all of these cases, people sell their constitutional rights in ways that, they believe, make them better off. They prefer the benefits of the agreement to the exercise of their rights.\" (Easterbrook, Insider Trading, Secret Agents, Evidentiary Privileges, and the Production of Information, (supra) , Sup. Ct. Rev. at pp. 346-347, fns. omitted.)\n\nHere, applicants and promotional candidates know the job offer or promotional opportunity is conditioned on consent to a medical examination which includes drug testing. They are notified of the date and time of the test, the conditions under which it will be conducted, and the consequences of failure. Each applicant for employment or promotion signs a waiver before the procedure begins. Neither job applicants nor employees risk the loss of anything they already possess. Employees who test positive are not fired; they are simply ineligible for promotion. The information remains confidential and no referral is made to law enforcement.\n\nA search of a person is constitutional if consent is freely and voluntarily given. (See Schneckloth v. Bustamonte (1973) 412 U.S. 218, 219 [36 L. Ed. 2d 854, 858, 93 S. Ct. 2041].) Under the City of Glendale's testing program, an applicant's or employee's obligation to undergo testing for current drug use \"can be triggered only by her own decision to alter her [employment] status.\" ( Harmon v. Thornburgh (D.C. Cir. 1989) 878 F.2d 484, 489 [278 App.D.C. 382], italics added.)\n\nBecause incumbent employees seeking promotion have consented to undergo drug testing as part of a medical examination after notice of the testing requirement, this case is analogous to the airport search cases of a generation ago. There the federal courts concluded that advance notice to commercial air travelers of mandatory preboarding searches of all enplaning passengers survived constitutional scrutiny. As a matter of constitutional law, \"A PROSPECTIVE PASSENGER HAS A CHOICE: he may submit to a search of his person and immediate possessions as a condition to boarding; or he may turn around and leave. If he chooses to proceed, that choice, whether viewed as a relinquishment of an option to leave or an election to submit to the search, is essentially a 'consent,' granting the government a license to do what it would otherwise be barred from doing by the Fourth Amendment.\" ( United States v. Davis (9th Cir. 1973) 482 F.2d 893, 913 (maj. opn. by Browning, J.); see also United States v. Edwards (2d Cir. 1974) 498 F.2d 496 (maj. opn. by Friendly, J.); cf. Willner, (supra) , 928 F.2d at p. 1190 [\"No one is compelled to seek a job at the Department of Justice. [Citation.] If individuals view drug testing as an indignity to be avoided, they need only refrain from applying.\"].)\n\nIn the same spirit, federal courts have held a union may consent to drug testing and that employees are generally bound by the agreement. ( Bolden v. Southeastern Pennsylvania Transp. Auth. (3d Cir. 1991) 953 F.2d 807, 827-829 [to the best of our knowledge no court has held the right to be free from drug testing is one which cannot be negotiated away]; Utility Workers of America v. Southern Cal. Edison (9th Cir. 1988) 852 F.2d 1083, 1086 [same]; see American Postal Workers Union v. U.S. Postal (1989) 871 F.2d 556, 567 [where court rejected a Fourth Amendment challenge to searches of employee lockers because the searches were authorized by the collective bargaining agreement and waivers signed by employees].)\n\nAs some members of the high court have recognized, on occasion, the government's interest as an employer is distinct from its interests as sovereign, and context is often critical. (See, e.g., Snepp v. United States (1980) 444 U.S. 507, 509, fn. 3 [62 L. Ed. 2d 704, 708, 100 S. Ct. 763] [\"he CIA [may] protect substantial government interests by imposing reasonable restrictions on employee activities that in other contexts might be protected by the First Amendment.\"]; Buckley v. Valeo (1976) 424 U.S. 1, 290-291 [46 L. Ed. 2d 659, 841-842, 96 S. Ct. 612] [\"The limits imposed by the First and Fourteenth Amendments on governmental action may vary in their stringency depending on the capacity in which the government is acting. . . . . . . . . . ases which deal with the government as employer or proprietor are not fungible with those which deal with the government as a lawmaker enacting criminal statutes applying to the population generally.\"] (conc. and dis. opn. of Rehnquist, J.); Healy v. James (1972) 408 U.S. 169, 203 [33 L. Ed. 2d 266, 292, 92 S. Ct. 2338] [\"The government as employer or school administrator may impose upon employees and students reasonable regulations that would be impermissible if imposed by the government upon all citizens.\"] (conc. opn. of Rehnquist, J.); and see Wells \u0026 Hellerstein, The Governmental-Proprietary Distinction in Constitutional Law (1980) 66 Va. L.Rev. 1073, 1113-1121.)\n\nThe direct relationship of drug use to job performance can hardly be doubted. Private firms competing in the same labor market as the government routinely insist on comparable forms of drug testing. They obviously believe drug use is rationally related to job performance. I see nothing in the circumstances of this case to suggest that the city's interest in providing an environment for its employees free of illegal drugs and their effects on the workplace is in principle any different from the same interest of private employers. For that reason, I am skeptical that the government employer should be required to select and promote its work force hampered by constraints intended primarily to limit its penal interests. Indeed, I question whether government as an employer should be required to operate under constraints that are any different from those affecting the private employers with whom it must compete in the labor market.\n\nThe Dissenters' concern about the relentless erosion of the private spheres of human conduct is certainly legitimate. The hegemony of the data bank has left us little privacy to protect and scant ability to control how, when, or to whom personal information is disclosed. It is this control--the right to prevent disruption of routine, invasion of property rights, embarrassment, and to protect the privacy of information--that the Fourth Amendment and state privacy provisions seek to protect. (See Posner, Rethinking the Fourth Amendment (1981) Sup. Ct. Rev. 49, 51, 52.) And it is precisely this security which is undermined by endlessly malleable balancing tests. In that respect, more autonomy is sacrificed on the altar of arbitrary ad hoc determinations than will ever be lost through consensual searches of public employees.\n\nThus, were we writing on a clean slate, I would opt for a clear, concise rule. I would conclude that applicants and incumbent Glendale city employees who seek promotion after notice of the city's drug testing requirement have consented to drug testing, a consent that is constitutionally valid and avoids Fourth Amendment concerns. Where the underlying interest is not constitutionally protected, \"the greater power to completely ban\" a given activity \"necessarily includes the lesser power\" to impose conditions on its exercise. ( Posadas de Puerto Rico Assoc. v. Tourism Co. (1986) 478 U.S. 328, 345-346 [92 L. Ed. 2d 266, 283, 106 S. Ct. 2968].) Moreover, since drug use and its effects are closely related or \"germane\" to job performance, no specter of an unconstitutional condition arises. ( Nollan v. California Coastal Comm'n (1987) 483 U.S. 825, 835-837 [97 L. Ed. 2d 677, 688-689, 107 S. Ct. 3141]; Sullivan, Unconstitutional Conditions (1988) 102 Harv. L.Rev. 1415, 1458-1468; Epstein, Unconstitutional Conditions, State Power and the Limits of Consent (1988) 102 Harv. L.Rev. 4, 65, 67-73; cf. FCC v. League of Women Voters of California (1984) 468 U.S. 364, 408 [82 L. Ed. 2d 278, 309-310, 104 S. Ct. 3106] (dis. opn. of Rehnquist, J., joined by Burger, C. J. and White, J.).)\n\nSimply put, Glendale's drug testing policy gives applicants and promotional candidates a clear choice: they may consent to a limited invasion of their privacy or they may decline to take the test and forego the employment or the opportunity for promotion.\n\nThese tradeoffs are part of the cost of being a public servant. Thus, federal employees cannot run political campaigns; FBI agents do not go on strike. State employees are required to reveal detailed financial information knowing it will be publicly disseminated. Such choices are neither easy nor comfortable.\n\nBut that is life. Sometimes beauty is fierce; love is tough; and freedom is painful.\n\n\u003cspan class=\"fn\"\u003e1. Four Justices (Justice Mosk, Justice Kennard, Justice Werdegar, and myself) conclude that the challenged drug testing program is invalid in the prepromotion context, and five Justices (Justice Baxter, Justice Werdegar, Justice Chin, Justice Brown, and myself) conclude that the challenged drug testing program is valid in the preemployment context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. For convenience, we sometimes refer to the drug and alcohol testing program as simply drug testing or drug screening.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. If an applicant, after reviewing the consent form, indicates that he or she cannot take the medical examination at the scheduled time, the applicant is informed that the drug and alcohol testing component of the screening must be completed at that time, but the remainder of the medical examination may be postponed. An applicant who refuses to complete this portion of the examination at that time is disqualified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In May 1987, prior to the trial court's ruling in this matter, the city approved a comprehensive revision of its \"preplacement medical standards,\" establishing three medical examination \"levels\" and determining which level of examination was appropriate for each of the city's numerous job classifications. These standards specify that the \"lowest\" or least extensive medical examination level (Medical Examination Level I) consists of \"a complete medical history, a general physical examination, urinalysis, audiometric testing, T.B. skin testing and drug screen,\" and provide that the other two examination levels include all of these components plus additional medical tests.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Section 56.20, subdivisions (a) and (c), provide in relevant part: \"(a) Each employer who receives medical information shall establish appropriate procedures to ensure the confidentiality and protection from unauthorized use and disclosure of that information. These procedures may include, but are not limited to, instruction regarding confidentiality of employees and agents handling files containing medical information, and security systems restricting access to files containing medical information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) No employer shall use, disclose, or knowingly permit its employees or agents to use or disclose medical information which the employer possesses pertaining to its employees without the patient having first signed an authorization under Section 56.11 or Section 56.21 permitting such use or disclosure, [with specified exceptions].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The authorization form at issue in this case permitted the examining physician to disclose to the city only the ultimate results of the drug testing, and did not purport to allow the disclosure of additional information beyond such results. Accordingly, we have no occasion to determine whether an employer would violate section 56.20, subdivision (b), if it penalized an employee or job applicant for refusing to authorize the disclosure of information beyond such limits. (Cf. Pettus v. Cole (1996) 49 Cal. App. 4th 402, 431-433 [57 Cal. Rptr. 2d 46] [Confidentiality of Medical Information Act precludes health care providers, who conducted employer-requested physical and mental health examinations to verify an employee's claim of disability, from disclosing to the employer, without the employee's written authorization, information beyond that specifically authorized by statute.].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. 42 United States Code section 12112 provides in relevant part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) General rule\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"No covered entity shall discriminate against a qualified individual with a disability because of the disability of such individual in regard to job application procedures, the hiring, advancement, or discharge of employees, employee compensation, job training, and other terms, conditions, and privileges of employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Medical examinations and inquiries\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(1) In general\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The prohibition against discrimination as referred to in subsection (a) of this section shall include medical examinations and inquiries.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(2) Preemployment\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(A) Prohibited examination or inquiry\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Except as provided in paragraph (3), a covered entity shall not conduct a medical examination . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(3) Employment entrance examination\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A covered entity may require a medical examination after an offer of employment has been made to a job applicant and prior to the commencement of the employment duties of such applicant, and may condition an offer of employment on the results of such an examination, if--\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(A) all entering employees are subjected to such an examination regardless of disability;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(B) information obtained regarding the medical condition or history of the applicant is collected and maintained on separate forms and in separate medical files and is treated as a confidential medical record, except that--\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) supervisors and managers may be informed regarding necessary restrictions on the work or duties of the employee and necessary accommodations;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(ii) first aid and safety personnel may be informed, when appropriate, if the disability might require emergency treatment; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(iii) government officials investigating compliance with this chapter shall be provided relevant information on request; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(C) the results of such examination are used only in accordance with this subchapter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(4) Examination and inquiry\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(A) Prohibited examinations and inquiries\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A covered entity shall not require a medical examination and shall not make inquiries of an employee as to whether such employee is an individual with a disability or as to the nature or severity of the disability, unless such examination or inquiry is shown to be job-related and consistent with business necessity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(B) Acceptable examinations and inquiries\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A covered entity may conduct voluntary medical examinations, including voluntary medical histories, which are part of an employee health program available to employees at that work site. A covered entity may make inquiries into the ability of an employee to perform job-related functions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(C) Requirement\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Information obtained under subparagraph (B) regarding the medical condition or history of any employee [is] subject to the requirements of subparagraphs (B) and (C) of paragraph (3).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The ADA generally prohibits a covered employer from discriminating against \"a qualified individual with a disability\" (42 U.S.C.S. § 12112(a)), but includes a provision specifying that \"[f]or purposes of this subchapter, the term 'qualified individual with a disability' shall not include any employee or applicant who is currently engaging in the illegal use of drugs, when the covered entity acts on the basis of such use.\" (42 U.S.C.S. § 12114(a), italics added.) An administrative commentary, providing interpretive guidance on the administrative regulation implementing this provision (29 C.F.R. § 1630.3 (1996)), explains: \"The term 'currently engaging' is not intended to be limited to the use of drugs on the day of, or within a matter of days or weeks before, the employment action in question. Rather, the provision is intended to apply to the illegal use of drugs that has occurred recently enough to indicate that the individual is actively engaged in such conduct. . . . . . . Employers are entitled to seek reasonable assurances that no illegal use of drugs is occurring or has occurred recently enough so that continuing use is a real and ongoing problem. The reasonable assurances that employers may ask applicants or employees to provide include . . . evidence, such as drug test results, to show that the individual is not currently engaging in the illegal use of drugs.\" (29 C.F.R. appen. to pt. 1630--Interpretative Guidance on title I of the Americans with Disabilities Act, § 1630.3.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. A recently published text reports that, as of 1995, 14 states had enacted statutes specifically regulating aspects of workplace drug testing. (See Larson, Employment Screening (1995) § 4.05[2], p. 4-35.) All of the statutes regulate the testing of current employees (generally limiting the circumstances and employment positions as to which testing may be required), but most of the statutes permit the testing of all job applicants as long as the testing is conducted in accordance with specified procedures. (Id. at p. 4-37.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In discussing the intrusion upon the employees' privacy resulting from the aspect of the drug testing program that required the tested employees to disclose medications they recently had taken, the court in Skinner noted that \"[w]hen employees produce the blood and urine samples required by [the regulations], they are asked by medical personnel to complete a form stating whether they have taken any medications during the preceding 30 days. The completed forms are shipped with the samples to the FRA's laboratory. [Citation.] This information is used to ascertain whether a positive test result can be explained by the employee's lawful use of medications. While this procedure permits the Government to learn certain private medical facts that an employee might prefer not to disclose, there is no indication that the Government does not treat this information as confidential, or that it uses the information for any other purpose. Under the circumstances, we do not view this procedure as a significant invasion of privacy.\" (489 U.S. at p. 626, fn. 7 [103 L. Ed. 2d at p. 666].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although the prepromotional drug testing at issue in Von Raab was not conducted as part of a general medical examination, nothing in that opinion suggests across-the-board drug testing of promotional candidates would be permissible under the Fourth Amendment if the drug testing were included as part of such a medical examination. In upholding the testing of employees who sought promotion to positions in which they actually would handle sensitive information, the court in Von Raab indicated that testing of such employees would be constitutionally reasonable, \"especially if the positions covered under this category require background investigations, medical examinations, or other intrusions that may be expected to diminish their expectations of privacy in respect of a urinalysis test.\" (Von Raab, (supra) , 489 U.S. at p. 677 [ 103 L. Ed. 2d at p. 710], italics added.) But nothing in Von Raab suggests that suspicionless drug testing of public employees whose duties would not otherwise justify testing--for example, employees seeking promotion to such positions as \"Accounting Technician\" or \"Baggage Clerk\"--would become constitutionally reasonable if the government employer not only required the employees to submit to drug testing but also combined such testing with a required medial examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurthermore, because the drug testing program in Von Raab did not include \"random unannounced\" testing, but rather involved a testing program, like the one here at issue, that applied to applicants for promotion who had advance notice of the drug testing requirement, we do not believe Von Raab properly can be interpreted, as Justice Chin's Concurring and Dissenting opinion suggests (post, at pp. 928-932), to preclude only across-the-board testing of current employees conducted on an unannounced, random basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Of course, we do not suggest that the Fourth Amendment prohibits an employer from requiring a current employee to submit to a drug test as a condition of promotion when such testing is justified by the nature of the particular position to which promotion is sought. Von Raab makes clear that such testing is permissible with regard to some employment positions. The challenged drug testing program here at issue, however, applies to promotions to every city position, including promotions to entry-level, non-safety-sensitive positions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe shall discuss later in this opinion whether it is appropriate for us to review each of the city's numerous job classifications in order to determine which of those classifications constitutionally may be subject to suspicionless, prepromotional drug testing. (See, post, pp. 898-899.) In addition, of course, drug testing of a current employee may be justified when there is some individualized basis for suspecting that the employee currently is using illegal drugs. (See 4 LaFave, Search and Seizure (3d ed. 1996) § 10.3(e), pp. 493-500 [citing and discussing cases] (hereafter LaFave).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. A number of other federal decisions have upheld applicant drug-testing programs involving employment positions as to which safety concerns are paramount, and each of these decisions relied upon considerations of safety in upholding the validity of the testing program. (See, e.g., Piroglu v. Coleman (D.C. Cir. 1994) 25 F.3d 1098, 1102-1104 [306 App.D.C. 392] [emergency medical technician trainees]; Intern. Broth. of Teamsters v. Dept. of Transp. (9th Cir. 1991) 932 F.2d 1292 [commercial truckdrivers]; IBEW, Local 1245 v. Skinner, (supra) , 913 F.2d 1454 [natural gas pipeline workers].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See generally, National Research Council, Under the Influence: Drugs and the American Work Force (1994) pages 129-169, 227; United States Department of Health and Human Services, Drugs in the Workplace: Research and Evaluation Data, volume II (1990) pages 11, 228, 231; Larson, Employment Screening, (supra) , sections 1.03, 3.06, pages 1-4 to 1-9, 3-56 to 3-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Thus in this case the employer is seeking information that is relevant to its hiring decision and that it legitimately may ascertain. (Cf. Long Beach City Employees Assn. v. City of Long Beach (1986) 41 Cal. 3d 937, 943-948 [227 Cal. Rptr. 90, 719 P.2d 660].) Plaintiff cites no authority indicating that an employer may not reject a job applicant if it lawfully discovers that the applicant currently is using illegal drugs or engaging in excessive consumption of alcohol.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The record in the present case makes it clear that the city's preemployment medical examination was a full and genuine medical examination that a job applicant would have been required to undergo even in the absence of the drug testing component. As already noted, the city had conducted such medical examinations of all job applicants for many years before the drug testing program was instituted. In view of these circumstances, we have no occasion to pass upon the validity of a preemployment drug testing program conducted under other conditions or circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In addition to the aural monitoring feature, the city required applicants to undress to their underwear and put on a hospital gown, and added blue dye in the toilet water to prevent adulteration of the urine sample. The addition of the dye obviously did not intrude on the applicant's interest in privacy. Requiring the applicant partially to disrobe and wear a gown also did not significantly increase the invasion of privacy inherent in the required medical examination, because a physical examination by a physician ordinarily would involve a comparable degree of disrobing. Similarly, although the drug testing program required the applicant to disclose, on the drug screening authorization form, the medications that he or she currently was taking, the required medical examination itself included taking a medical history from the applicant, which ordinarily would include the disclosure of current medications.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In the present case, plaintiff did not challenge the validity of the city's policy of requiring all current employees who are offered promotion to a new position to undergo a medical examination, and thus the lower courts had no occasion to consider the propriety of that policy in light of the provisions of the ADA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlthough the city contended at oral argument that the provisions of the ADA applicable to preemployment, postoffer medical examinations should be interpreted to apply to current employees who apply for promotions as well as to job applicants, we believe the language of the statute, and the administrative regulations, make it clear that the preemployment, post-offer medical examination provision applies to \"entering employees\" and not to current employees who are candidates for promotion. (See 42 U.S.C.S. § 12112(d)(3) [\"A covered entity may require a medical examination after an offer of employment has been made to a job applicant and prior to the commencement of the employment duties of such applicant . . . if-- (A) all entering employees are subjected to such an examination regardless of disability . . . .\"]; 29 C.F.R. appen. to pt. 1630--Interpretative Guidance on Title I of the Americans with Disabilities Act, § 1630.14(b) [\"An employer is permitted to require post-offer medical examinations before the employee actually starts working.\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Our Conclusion with regard to job applicants' reasonable expectations of privacy in relation to medical examinations does not depend upon the circumstances that, in the present case, the city notified job applicants at the outset that a medical examination and drug screening were part of the hiring process and the applicants applied for positions with knowledge of the screening requirement. As the court explained in Nat. Federation of Fed. Employees v. Weinberger (D.C. Cir. 1987) 818 F.2d 935, 943 [260 App.D.C. 286]: \" search otherwise unreasonable cannot be redeemed by a public employer's exaction of a 'consent' to the search as a condition of employment. . . . Advance notice of the employer's condition, however, may be taken into account as one of the factors relevant to the employees' legitimate expectations of privacy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Van Raab, (supra) , 489 U.S. 656, although the United States Supreme Court explained that the Customs Service employees had been notified of the drug screening when they applied for promotion ( id. at p. 672, fn. 2 [103 L. Ed. 2d at p. 706]), the court did not suggest that such advance notice would render drug testing reasonable for any employee who was so notified, without regard to the nature of the position to which promotion was sought. Indeed, in remanding the question of the reasonableness of the drug testing program as applied to positions involving the handling of classified information, the decision in Von Raab makes it quite clear that advance notice of a testing requirement is not sufficient to render the requirement reasonable for Fourth Amendment purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In elaborating on the proper analysis of the merits of a proposed justification for an intrusion upon privacy, the court in Hill stated: \"The diverse and somewhat amorphous character of the privacy right necessarily requires that privacy interests be specifically identified and carefully compared with competing or countervailing privacy and nonprivacy interests in a 'balancing test.' The comparison and balancing of diverse interests is central to the privacy jurisprudence of both common and constitutional law. Invasion of a privacy interest is not a violation of the state constitutional right to privacy if the invasion is justified by a competing interest. Legitimate interests derive from the legally authorized and socially beneficial activities of government and private entities. Their relative importance is determined by their proximity to the central functions of a particular public or private enterprise. Conduct alleged to be an invasion of privacy is to be evaluated based on the extent to which it furthers legitimate and important competing interests.\" (7 Cal. 4th at pp. 37-38.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Unlike Hill, of course, the present case involves the conduct of a governmental entity, but plaintiff does not contend that Hill 's Discussion of the elements and defenses applicable in an action under the state constitutional privacy clause was intended to apply only to cases, like Hill, that involve a constitutional challenge to the conduct of a private entity. Nothing in Hill suggests that such a limitation was intended. Indeed, there are a number of passages in Hill that clearly indicate that the court, while recognizing that involvement of a governmental entity might affect the degree of the intrusion imposed by particular conduct and the importance of the interests served by the conduct, intended the decision's general framework to apply to all state constitutional privacy claims, including claims against governmental entities. (See 7 Cal. 4th at p. 38 [\"Legitimate interests derive from the legally authorized and socially beneficial activities of government and private entities. Their relative importance is determined by their proximity to the central functions of a particular public or private enterprise.\" (Italics added.)]; ibid. [\"The NCAA is a private organization, not a government agency. Judicial assessment of the relative strength and importance of privacy norms and countervailing interests may differ in cases of private, as opposed to government, action.\"].) So long as the elements set forth in Hill are applied properly, the screening function served by those elements may be useful in protecting governmental entities, as well as private entities, from unnecessarily extended litigation with regard to state constitutional privacy claims that involve only insignificant or de minimis intrusions upon reasonable expectations of privacy. (See, e.g., Stackler v. Department of Motor Vehicles (1980) 105 Cal. App. 3d 240, 248 [164 Cal. Rptr. 203] [requirement that driver's license contain photograph of licensee does not \"implicate any of the excesses at which the constitutional provision protecting the right of privacy is directed\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Although in discussing the \"serious invasion of privacy interest\" element, the opinion in Hill states at one point that \"[a]ctionable invasions of privacy must be sufficiently serious in their nature, scope, and actual or potential impact to constitute an egregious breach of the social norms underlying the privacy right\" (7 Cal. 4th at p. 37), the opinion's application of the element makes it clear that this element is intended simply to screen out intrusions on privacy that are de minimis or insignificant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Of course, the circumstance that the incremental intrusion upon privacy attributable to the city's preemployment drug testing program is significant enough that such testing would not be permissible were there no justification for the testing does not mean that a court should not consider the relatively minor degree of the incremental intrusion in determining whether the employer's justification for the testing outweighs the intrusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Although the ADA was enacted while the present proceedings were pending, it is settled that \" '[r]elief by injunction operates in futuro, and the right to it must be determined as of the date of decision by an appellate court.' [Citations.]\" ( White v. Davis, (supra) , 13 Cal. 3d 757, 773, fn. 8.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Although we do not determine the validity of suspicionless, prepromotional testing as applied to any particular job category, we believe it is appropriate to observe that, in our view, the Court of Appeal in this case set forth too restrictive a standard in holding that such testing is permissible only for positions in which an employee's inability to perform his or her duties could have an \"immediate disastrous consequence upon public safety or security.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn concluding that such a stringent standard is required under the Fourth Amendment as interpreted in Skinner, (supra) , 489 U.S. 602, and Von Raab, (supra) , 489 U.S. 656, the Court of Appeal relied in part upon the circumstance that the Skinner and Von Raab decisions referred to the state interests that supported suspicionless drug testing (of the employment positions at issue in those cases) as \"compelling interests,\" and reasoned that such language signified that, under the Fourth Amendment, the validity of any such drug testing program \"must pass the strict scrutiny test . . . .\" After the Court of Appeal rendered its opinion, however, the United States Supreme Court explained in its subsequent decision in Vernonia, (supra) , 515 U.S. 646, that \"[i]t is a mistake . . . to think that the phrase 'compelling state interest,' in the Fourth Amendment context, describes a fixed, minimum quantum of governmental concern, so that one can dispose of a case by answering in isolation the question: Is there a compelling state interest here? Rather, the phrase describes an interest which appears important enough to justify the particular search at hand, in light of other factors which show the search to be relatively intrusive upon a genuine expectation of privacy.\" (Id. at p. [ 132 L. Ed. 2d at p. 579, 115 S. Ct. at pp. 2394-2395].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eParticularly in view of Vernonia 's clarification of the applicable Fourth Amendment principles, we believe the Court of Appeal erred in suggesting that, under Skinner and Von Raab, suspicionless drug testing is valid only as to employment positions in which an employee's inability to meet the demands of his or her job \"could have an immediate disastrous consequence upon public safety or security.\" Most federal cases applying Skinner and Von Raab have not applied so stringent a standard. (See, e.g., National Treasury Emp. Union v. U.S. Customs Serv. (D.C. Cir. 1994) 27 F.3d 623, 627-629 [307 App.D.C. 173]; AFGE Local 1533 v. Cheney (9th Cir. 1991) 944 F.2d 503, 505-507; IBEW, Local 1245 v. Skinner, (supra) , 913 F.2d 1454, 1462-1463.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The chief case cited by the lead opinion in support of the categorical legal validity of such tests, Fowler v. New York City Dept. of Sanitation (S.D.N.Y. 1989) 704 F. Supp. 1264, was decided prior to Skinner. The Fowler court was guided in part by the mistaken view, soon to be repudiated in Skinner, that drug testing of government employees was not a \"search\" within the meaning of the Fourth Amendment. ( Id. at p. 1271.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Another researcher has reported no significant relationship between positive drug tests and various indicia of work performance in a hospital workplace, suggesting that the correlationship between drug use and job performance may vary according to occupation. (See Parish, Relation of the Pre-employment Drug Testing Result to Employment Status: A One-Year Follow Up (1989) 4 J. Gen. Internal Med. 44 [reporting no significant correlation between drug use and work performance within given occupational classifications].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a The lead opinion also asserts that it is \"well documented\" that drug abuse will lead to \"increased safety problems and potential liability to third parties.\" (Lead opn., ante, at p. 882.) I do not doubt that employees performing certain types of work (for example, tree trimmers using chain saws) endanger their own safety and that of others when they work while under the influence of alcohol or drugs; urinalysis testing of applicants for such positions is certainly permissible to determine substance abuse. (See Skinner v. Railway Labor Executives' Assn., (supra) , 489 U.S. 602, 628 [103 L. Ed. 2d at p. 667].) By contrast, the duties performed by a file clerk ordinarily pose no special hazard. I am aware of no evidence that generalized safety or security concerns justify across-the-board testing of all applicants for government employment, regardless of the nature of the positions for which they apply.\u003c/span\u003e\n\n",
    "body_length": 259479,
    "citedas": [
      "14 Cal.4th 846",
      "927 P.2d 1200",
      "59 Cal.Rptr.2d 696"
    ],
    "attorneys": "Mark Rosenbaum, Paul Hoffman, Gary Williams, Krakow \u0026 Kaplan, Marvin E. Krakow, Steven J. Kaplan and Eliza Vorenberg for Plaintiff and Appellant. Scott H. Howard, City Attorney, Ron R. Braden, Assistant City Attorney, Jackson, Tufts, Cole \u0026 Black, Gerald Marer, Goldstein, Kennedy \u0026 Petito and Charles H. Goldstein for Defendants and Appellants. De Witt W. Clinton, County Counsel Los Angeles, Stephen R. Morris, Principal Deputy County Counsel, Cristina L. Sierra, Acting City Attorney Pasadena, Lawrence S. Newberry, Assistant City Attorney, N. Gregroy Taylor, Karen L. Tachiki, Henry Torres, Jr., Elise S. Rose, Dorothy Bacskai Egel, K. William Curtis, Kenneth R. Hulse, Roy J. Chastain, Linda M. Nelson, Charles D. Sakai, Daniel J. Popeo, David A. Price, Sweeney, Mason \u0026 Wilson, Roger Mason, Swidler \u0026 Berlin, Robert V. Zener, Kathryn R. Taylor, Morgan, Lweis \u0026 Bockius, Raymond R. Kepner, Richard C. Rybicki, Littler, Mendelsohn, Fastiff, Tichy \u0026 Mathiason, Mark A. de Bernardo, Peter A. Susser, Paula Champagne, Richard N. Hill, Schachter, Kristoff, Orenstein \u0026 Berkowitz, Victor Schachter and Sharon S. Zezima as Amici Curiae on behalf of Defendants and Appellants.",
    "category": [],
    "judges": "Opinion by George, C. J., with Werdegar, J., Concurring. Concurring and Dissenting opinions by Mosk, J., by Kennard, J., by Chin, J., with Baxter and Brown, JJ., Concurring, and by Brown, J.",
    "citation_count": 54
  }
}
