{
  "id": "isSvXmYBTlTomsSBgeAX",
  "document": {
    "title": "Oregon v. Moen",
    "full_title": "STATE OF OREGON v. RONALD HOWARD MOEN",
    "jurisdiction": "Oregon Supreme Court",
    "date": "1990-01-11T00:00:00.000Z",
    "docket": "Nos. CC 86-C-21131, SC S33952",
    "body": "This is a criminal case in which the defendant seeks reversal of his conviction of the offense of aggravated murder. In the alternative, he requests that his death sentence be vacated.\n\nSUMMARY OF FACTS\n\nGuilt Phase\n\nThe bodies of Hazel Chatfield and Judith Moen were found in Hazel Chatfield's residence on Friday, March 14, 1986, by a neighbor and two friends.\n\nDr. Karen Gunson, the medical examiner, testified that both victims died of gunshot wounds to the head. In addition to the fatal wound to the head, Judith Moen had been shot in the chest after death had occurred. Dr. Gunson also found some bruises and other minor injuries on Judith Moen. The time of death was estimated to be Thursday night or some time before then.\n\nThe police officers and crime laboratory technicians found that some areas of the house had been ransacked, but discounted theories of burglary because a portable television and stereo were not taken. Further, no footprints were found in soft soil outside what the officers otherwise might have treated as a suspected entry point. The spent bullets from what appeared to be the fatal gunshots were recovered and all three had eight lands and grooves with a right-hand twist and appeared to have been fired from a .38 caliber revolver.\n\nThe state's theory was that defendant had killed Judith Moen during a domestic quarrel and that he had killed Hazel Chatfield when she became involved in the dispute. Blood splatter evidence indicated that some injury had occurred to Judith Moen on her bed, that she had been upright and mobile at some time while bleeding, then was shot through the head, moved, and shot again through the chest. The second gunshot wound probably occurred one-half hour or longer after the first gunshot wound to Judith Moen. Other physical evidence indicated that Hazel Chatfield may have been holding a towel to one of Judith Moen's wounds when she was shot. All of the blood samples taken from the residence were matched to Judith Moen.\n\nThe police investigation focused on defendant because he had been seen with Judith Moen on Wednesday evening, March 12, 1986, at approximately 9:30 to 10:00 at a local restaurant.\n\nWhen questioned by police after the crime, defendant had a mark on his left hand and made a statement to the officers that a dog had bitten him. A dentist made casts of the victims' teeth and a veterinarian took tooth impressions of several dogs known to have been in contact with defendant during the relevant times. Those casts were submitted to Dr. Gary Bell, who was presented to the court as a specialist in forensic dentistry. Dr. Bell concluded that the tooth mark or teeth marks on defendant's hand were consistent with Hazel Chatfield's teeth and that neither Judith Moen nor any of the three dogs examined could have caused the mark.\n\nThrough a series of transactions, defendant had been in possession of a .38 caliber revolver known as an RG38s, and the state presented evidence that the bullets that killed the victims came from that weapon.\n\nThe remainder of the state's case focused on actions by defendant that the state characterized as suspicious, such as taking a raincoat to be cleaned and washing his hands with gasoline, and on statements made by defendant or by the victims.\n\nDr. Daniel Mulkey testified that he treated Hazel Chatfield from August 1985 up to and including visits on February 11 and March 11, 1986. During the latter two visits, Mrs. Chatfield complained of depression and despondency since her daughter and son-in-law (defendant) had moved into her home. Mrs. Chatfield appeared agitated, anxious, nervous, very tearful, and crying. Dr. Mulkey attempted to treat her for a potentially fatal lesion but, because of her situation at home, was unable to convince her that she needed treatment. Dr. Mulkey further testified that Mrs. Chatfield told him that she was upset about her daughter and son-in-law, that her son-in-law had been physically abusive to her daughter, and that \"she felt he might kill them both.\" Dr. Mulkey diagnosed her condition as situational depression and recommended that defendant be removed from the home.\n\nA former husband of Judith Moen testified that\n\ndefendant was pursuing a dissolution of his marriage with Judith and quoted defendant as saying, \"I'm finally going to get rid of the bitch one way or the other.\"\n\nBrad Barton, Judith Moen's son, described an incident in February 1986, while he was living at Hazel Chatfield's residence, during which defendant and Judith Moen became involved in an altercation. Barton described threats by defendant and a display of a shotgun in a threatening manner.\n\nFinally, the state's key witness was Kenneth Scurlock, a fellow inmate in the Marion County jail when defendant was arrested. Scurlock claimed that defendant confessed to killing the two victims and described how the homicides had occurred. He further claimed that defendant said \"he wasn't worried about anything because he had taken care of it all.\" Another inmate, Billy Minor, also testified that defendant was involved in a conversation about women and that defendant said \"you just have to know how to take care of them\" and made a gesture \"like he had a gun.\"\n\nThe defense presented three expert witnesses to challenge the state's theory of the homicide. David Sugiyama, an experienced laboratory technician from Los Angeles, questioned when the blood was deposited at the residence. Sugiyama questioned several other conclusions reached by the state's expert on the blood shown in the photographs.\n\nLucian C. Haag, a firearms expert, questioned whether the .38 caliber shells found at the scene came from defendant's revolver.\n\nDr. Homer Campbell, a forensic odontologist (trained in the anatomy and growth of teeth), examined the photographs of the mark on defendant's hand and concluded that it was not a dog bite. He further found that he could not identify the mark, but he was convinced that it was definitely not a human bite and was probably not an animal bite.\n\nIn addition to the expert witnesses, defendant produced several witnesses with respect to the events of March 12, 1986, all of whom provided essentially negative testimony to the effect that they did not observe anything unusual occur on that date.\n\nThe evidence then was closed and the jury retired and found defendant guilty of aggravated murder.\n\nPenalty phase\n\nA. The state's case\n\nAt the penalty phase, the state presented documents demonstrating prior criminal convictions of defendant that dated from 1959. The convictions included negligent homicide, forgery, robbery, petty larceny, assault, and possession of a firearm by a felon.\n\nMary Frances Kilgore and John C. Towle described the events surrounding defendant's 1958 negligent homicide conviction -- while driving drunk, defendant killed another person.\n\nRobert Franke described an incident on July 31, 1959, in which defendant threatened Franke with a gun and eventually fired the gun into the ceiling at Franke's home.\n\nAlfanso Jaca and Inez Carter were both robbery victims in cases resulting in defendant's convictions in 1978. Both robberies involved display of a pistol or revolver and no harm to the storekeepers. One incident occurred at a liquor store; the other, at a grocery store.\n\nJohn Butler was a detective for the Santa Clara, California, Police Department in 1968 and investigated yet another armed robbery of an individual named Jack Richards. He picked up defendant in Boise, Idaho, after his arrest there and returned him to San Jose. During the trip, defendant had a conversation with Butler about the Richards robbery and the gun used.\n\nDuino Giordano recalled that he arrested defendant July 7, 1973, and found a gun in his boot. That event resulted in a conviction for possession of a firearm by a felon.\n\nThe state also offered transcripts of testimony by Richards and Jaca from two of defendant's trials for armed robbery.\n\nB. Defendant's case\n\nDefendant took the stand. With regard to March 12, 1986, defendant testified that he met Judith Moen and Hazel\n\nChatfield at Dr. Nadel's office and went back to Hazel's residence shortly after the visit. He then went to Paul White's and began a drinking binge. He left White's residence and met Judith Moen at the Blue Willow restaurant that evening. She was attempting to obtain drugs and he tried to prevent her from following that course of action. Defendant denied returning to Hazel Chatfield's residence after meeting with Judith at the Blue Willow restaurant and contended that he had not been back since that day. He concluded that Judith Moen's involvement with drug usage was the reason for her death. He testified that he had nothing to do with the homicides. The remainder of defendant's testimony was a general description of his relationship with Judith, and a description of his physical condition.\n\nGUILT PHASE ASSIGNMENT OF ERROR I\n\nDefendant's first assignment of error is:\n\n\"The indictment should have been set aside because evidence was presented to the grand jury describing defendant's prior criminal convictions and attempting to prove through expert testimony that there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.\"\n\nOn May 13, 1986, defendant was indicted by a Marion County grand jury for two counts of aggravated murder with a firearm. This indictment did not set forth allegations pertaining to the three statutory questions set forth in ORS 163.150(1)(b).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nBecause of a concern that it might be necessary to plead the statutory questions in the indictment, the prosecutor decided to seek a new indictment to include those three allegations.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e On June 27, 1986, the matter was resubmitted to the same grand jury that returned the original aggravated murder indictment. The grand jury did not hear any additional evidence on the elements of the crime; the only evidence presented was the testimony of Dr. John Cochran concerning defendant's propensity for future dangerousness. The grand jury returned a second indictment that was identical to the first indictment on the guilt elements but added allegations that the aggravated murders were committed deliberately and without reasonable provocation and that a probability existed that defendant would commit criminal acts of violence that would constitute a continuing threat to society.\n\nIn State v. Stout, 305 Or 34, 41, 749 P2d 1174 (1988), this court stated:\n\n\"Under this court's long-standing and consistent interpretation of ORS 135.510, an indictment cannot be set aside on any statutory ground save those listed in ORS 135.510. * * * If an indictment cannot be attacked on the ground that the grand jury heard insufficient evidence, it follows that it cannot be attacked on the ground that the grand jury heard the wrong type of evidence. Thus, under this court's interpretation of ORS 135.510, even if some 'irregularities' outside that provision would justify setting aside an indictment, the admission of hearsay evidence is not among them.\" (Emphasis in original.)\n\nStout addressed issues of insufficiency and hearsay, i.e., too little evidence, or evidence of the wrong type. Here, defendant claims the grand jury heard too much evidence. Defendant never explains how Dr. Cochran's grand jury testimony, even if inadmissible, presents any statutory or constitutional violation.\n\nIn State v. Wagner, 305 Or 115, 172, 752 P2d 1136 (1988),\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e this court held:\n\n\"The offense with which this defendant is charged is aggravated murder as defined in ORS 163.095(2)(a)(E) * * *. The ultimate facts that make up that offense are clearly alleged in the indictment. To be guilty of aggravated murder one does not need to act 'deliberately.' If one is guilty of aggravated murder but the jury does not unanimously find that the perpetrator acted deliberately, the guilty one is not sentenced to death but is yet guilty of aggravated murder. There is no requirement of pleading an indictment that requires the indictment to set forth possible penalties that the law may fix for guilt on a particular charge.\"\n\nWagner does not say that alleging the affirmative of the three statutory questions is error; it holds only that the three questions need not be alleged.\n\nIn this case, the grand jury already had returned an aggravated murder indictment against defendant before it heard any penalty evidence. Defendant never has contended that the grand jury heard inadmissible evidence before it returned the first indictment, and he expressly acknowledged in the trial court that the grand jurors did not consider Dr. Cochran's testimony when they returned the original indictment. When the grand jury reindicted defendant, it did not hear any additional guilt evidence -- it heard some of the state's penalty evidence and concluded that the answer to each of the three statutory questions was \"yes.\" The grand jury procedure in this case was in essence the same bifurcated procedure mandated at trial. See ORS 163.150. The grand jury made a determination of the likelihood of defendant's guilt sufficient to justify indicting him and then heard evidence on the penalty phase issues. That these two determinations were accomplished by separate indictments, rather than one indictment, did not prejudice defendant, although the material added to the indictment after resubmission was surplusage under Wagner.\n\nIn compliance with ORCP 59C(2) and ORS 136.330, the indictment in this case was not submitted to the jury during the guilt phase of the trial and that jury found defendant guilty of aggravated murder solely on evidence properly submitted to it. Under these circumstances, it is clear that defendant was not prejudiced by the language in the indictment of which he complains and that any defects in the indictment are harmless.\n\nASSIGNMENT OF ERROR II\n\nFor his second assignment of error, defendant claims that the trial court erred in allowing Dr. Daniel Davis Mulkey to recite statements of Hazel Chatfield, one of the deceased victims, describing conduct of defendant and fears that defendant might kill both her and her daughter. The court ruled on defendant's objection that the out-of-court statements concerning defendant were hearsay and violated defendant's state and federal constitutional right of confrontation.\n\nDefendant argues that Dr. Mulkey's testimony concerning Hazel Chatfield's statements should not have been admitted under OEC 803(4) because: (1) \"the declarant's motivation for giving the information is highly suspect,\" and (2) the doctor \"did not specifically rely upon the statement[s] as reasonably pertinent to his diagnosis of depression.\"\n\nOEC 803(4) recognizes a hearsay exception for statements made for the purposes of medical diagnosis or treatment. The rule provides:\n\n\"The following are not excluded by [OEC 802, the general rule against the admission of hearsay], even though the declarant is available as a witness:\n\n\"* * *\n\n\"(4) Statements made for purposes of medical diagnosis or treatment and describing medical history, or past or present symptoms, pain or sensations, or the inception or general character of the cause [or] external source thereof insofar as reasonably pertinent to diagnosis or treatment.\"\n\nThe Legislative Commentary to the rule states, in pertinent part:\n\n\"In this subsection, an exception to the hearsay rule is created for statements made for the purposes of medical diagnosis or treatment. Several changes to Oregon law result.\n\n\"Even those few jurisdictions which have shied away from admitting statements of present condition generally, see [OEC] 803(3), supra, have allowed them if made to a person for the purpose of diagnosis or treatment in view of the declarant's strong motivation to be truthful. McCormick[, Evidence,] section 292 at 690. The guaranty of trustworthiness extends to statements of past condition made for the purpose of diagnosis or treatment, i.e., medical history, although until now Oregon courts have not accepted this. See\n\nReid v. Yellow Cab Co., 131 Or 27, 279 P 635 (1929). The guaranty also extends to statements regarding causation of a condition, if reasonably pertinent, in accord with the current trend. Shell Oil Co. v. Industrial Commission, 2 Ill 2d 590, 119 NE2d 224 (1954); McCormick[, Evidence,] section 292 at 691, 692; New Jersey Evidence Rule 63(12)(c).\n\n\"Statements as to fault ordinarily would not qualify under the language of this subsection. Thus, a statement that the declarant was struck by an automobile would not be excluded, as touching causation; a statement that the car was driven through a red light would [be excluded], as touching fault.\"\n\nProfessor Laird Kirkpatrick explains that \"[t]he rationale underlying this exception is that the patient's desire for proper treatment or diagnosis outweighs any motive to falsify.\" Kirkpatrick, Oregon Evidence 361 (1982).\n\nJudge Weinstein, referring to the identical hearsay exception under the Federal Rules of Evidence, FRE 803(4), suggests a second policy ground for the admissibility of these statements, i.e., \"a fact reliable enough to serve as the basis for a diagnosis is also reliable enough to escape hearsay proscription.\" 4 Weinstein \u0026 Berger, Weinstein's Evidence 803-146 (1988).\n\nTo be admissible under OEC 803(4), a statement must meet three requirements:\n\n(a) The statement must be \"made for purposes of medical diagnosis or treatment\";\n\n(b) The statement must describe or relate \"medical history, or past or present symptoms, pain or sensations, or the inception or general character of the cause [or] external source thereof\";\n\n(c) The statement must be \"reasonably pertinent to diagnosis or treatment.\"\n\nThe challenged testimony in this case satisfies these criteria:\n\na. Were Hazel Chatfield's statements \"made for purposes of medical diagnosis [ and ] treatment\"?\n\nMrs. Chatfield's motive in making the statements at issue must necessarily be determined by reference to the circumstances\n\nin which they were made. As explained in 4 Louisell \u0026 Mueller, Federal Evidence 593-94, ยง 444 (1980) (concerning the identical federal provision):\n\n\"The principal reason for admitting statements made for purposes of obtaining medical treatment is that they are considered trustworthy. Usually such statements are made by the patient to his physician, and usually they describe the patient's own past and present physical sensations, and things which happened to him personally. Thus, risks of misperception and of faulty memory are minimal. Moreover, the patient will understand that his description is important in determining the treatment he will receive, so he has every reason to speak not only truthfully, but carefully, so that the risks of insincerity and ambiguity are likewise minimal.\" (Emphasis added; footnote omitted.)\n\nOn February 11, 1986, Mrs. Chatfield came to her physician as a patient as \"part of a routine follow up for high blood pressure and some other medical problems.\" She was so \"anxious\" and \"extremely nervous\" that Dr. Mulkey could not conduct the planned interview and she \"indicated\" to him for the first time \"that she was suffering from depression or anxiety.\" When she first referred to her son-in-law's presence in her home, she did so only in response to Dr. Mulkey's question why she was depressed. When he saw her as a patient one month later, she exhibited symptoms \"absolutely\" associated with extreme depression and was so emotionally distressed that, as before, Dr. Mulkey was unable to talk with her about other medical problems, one of which was \"potentially life-threatening.\" Through his professional training and practice, he knew the symptoms of depression and anxiety and previously had diagnosed her as suffering from situational depression. In this context, Mrs. Chatfield again talked with Dr. Mulkey about defendant's presence in her home, his abusive conduct, and her resulting fears. He determined that she still suffered from the illness of depression and prescribed anti-depressant medication and defendant's removal from the home.\n\nMrs. Chatfield made these statements as a patient to her treating physician during regularly scheduled visits to his office. The statements related directly to the severe emotional distress that she was suffering at the time of those visits. The\n\ndepression that she experienced is a medically recognized illness that her physician had the training and experience to diagnose and to treat. Her complaints focused on her feelings of depression. Dr. Mulkey responded to her statements with clinical inquiries, a medical diagnosis, and a prescribed course of treatment.\n\nThe trial court was entitled to conclude that the statements in question were \"made for purposes of medical diagnosis [and] treatment.\"\n\nb. Was the subject matter of the statements proper?\n\nMrs. Chatfield's statements to her physician quite clearly described \"the inception or general character of the cause [or] external source\" of her continuing depression. Defendant does not contend otherwise.\n\nc. Were Mrs. Chatfield's statements \"reasonably pertinent\" to diagnosis and treatment?\n\nOEC 803(4) authorizes the admission of a patient's out-of-court statements (made for purposes of diagnosis or treatment) to her physician concerning \"the inception or general character of the cause [or] external source \" of her condition, to the extent that such information is \" reasonably pertinent to [the physician's] diagnosis or treatment.\" (Emphasis added.) The commentary to the rule confirms the reliability of statements satisfying that condition, i.e.:\n\n\"The guaranty [of trustworthiness] also extends to statements regarding causation of a condition, if reasonably pertinent, in accord with the current trend.\" (Emphasis added.)\n\nIn this case, Mrs. Chatfield gave Dr. Mulkey information concerning the cause of her depression and, in doing so, identified defendant. Defendant argues that such statements are \"accusations of personal fault\" and not reasonably pertinent to diagnosis or treatment. Defendant's argument ignores the wording of OEC 803(4). OEC 803(4) expressly authorizes the admission of statements concerning the \"cause [or] external source\" of an illness, provided the statements are \"made for purposes of medical diagnosis or treatment\" and are \"reasonably pertinent\" to either endeavor. Mrs. Chatfield's statements concerning defendant communicated to Dr. Mulkey the ongoing cause of her situational depression. He used that\n\ninformation first, to diagnose, and, then, to treat her illness. The information and his professional skills permitted him to distinguish her depression from other forms of that illness and to prescribe specific treatment for it. The requirements of the rule are satisfied. The fact that the continuing cause of her illness was the presence and conduct of a named individual is not a basis for excluding the statements.\n\nIn interpreting an identical evidentiary rule, FRE 803(4), the leading federal decision is consistent with our analysis and conclusion. In United States v. Renville, 779 F2d 430 (8th Cir 1985), an 11-year-old child was sexually abused by her stepfather. The defendant claimed that a doctor should not have been permitted to testify to statements of the victim, made during an examination, that identified the defendant as her abuser. He argued that FRE 803(4) did \"not encompass statements of fault or identity made to medical personnel.\" 779 F2d at 435-36. While acknowledging that such statements relating to identity ordinarily are not admissible, the court determined that where such statements were relevant to the physician's diagnosis or treatment, FRE 803(4) authorized their admission. Because the victim's statements were relevant for those purposes, the court held that their admission was proper. That court's analysis is applicable to this case:\n\n\"The crucial question under the rule is whether the out-of-court statement of the declarant was 'reasonably pertinent' to diagnosis or treatment. In United States v. Iron Shell, 633 F.2d 77 (8th Cir. 1980), cert. denied 450 U.S. 1001, 101 S.Ct. 1709, 68 L.Ed.2d 203 (1981), this court set forth a two-part test for the admissibility of hearsay statements under rule 803(4): first, the declarant's motive in making the statement must be consistent with the purposes of promoting treatment; and second, the content of the statement must be such as is reasonably relied on by a physician in treatment or diagnosis. Id. at 84. See also Roberts v. Hollocher, 664 F.2d 200, 204 (8th Cir. 1981). The test reflects the twin policy justifications advanced to support the rule. First, it is assumed that a patient has a strong motive to speak truthfully and accurately because the treatment or diagnosis will depend in part upon the information conveyed. The declarant's motive thus provides a sufficient guarantee of trustworthiness to permit an exception to the hearsay rule. Iron Shell, 633 F.2d at 84. Second, we have recognized that 'a fact reliable enough to serve as the basis for a diagnosis is also reliable enough to escape hearsay proscription.' Id. * * *\n\n\"* * *\n\n\"* * * We believe that a statement by a child abuse victim that the abuser is a member of the victim's immediate household presents a sufficiently different case from that envisaged by the drafters of rule 803(4) that it should not fall under the general rule. Statements by a child abuse victim to a physician during an examination that the abuser is a member of the victim's immediate household are reasonably pertinent to treatment.\n\n\"* * *\n\n\"* * * Information that the abuser is a member of the household is therefore 'reasonably pertinent' to a course of treatment which includes removing the child from the home.\" 779 F2d at 436-38 (first emphasis in original; second emphasis added).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAdmissibility of statements of the type challenged here is not limited to cases involving child abuse.\n\nThe testimony of Dr. Mulkey relating statements made to him by his patient, Mrs. Chatfield, concerning defendant's presence and conduct in her home was admissible under OEC 803(4) against defendant's hearsay objection.\n\nAlthough not offered by the state as an excited utterance, the statement by Mrs. Chatfield to her physician also would qualify for admission under OEC 803(2), which creates an exception to the hearsay rule for statements by a person laboring under the stress of an event or condition which caused excitement. The specific wording of that rule is:\n\n\"The following are not excluded by Rule 802, even though the declarant is available as a witness:\n\n\"* * *\n\n\"(2) A statement relating to a startling event or condition made while the declarant was under the stress of excitement caused by the event or condition.\"\n\nOn February 11, 1986 (the killings occurred March 13, 1986), Mrs. Chatfield sought treatment from Dr. Mulkey. She had been under his care since August 1985. At the time of that interview, which lasted 30 to 40 minutes, she was so upset that she cried through most of the interview and, according to the physician, at the same time she was \"anxious and nervous to the point, I think, you could describe her as being fairly agitated. It was impossible to conduct an interview with her. * * * She couldn't concentrate or answer my questions directly. She was obviously extremely nervous.\" She again saw the physician on March 11, 1986, just 48 hours before her death. The physician described her as being \"even more agitated and anxious, nervous, very tearful, crying. It was extremely difficult if not impossible for me to conduct the interview relating to her other medical problems. * * * She was so anxious and nervous and tearful about her life situation at home that she wouldn't even allow me to instruct her on what would be the best course of action for her other problem.\" While in that tearful and anxious condition, she told the physician \"that she was still upset about the residen[ce] in her home of her daughter and son-in-law, that her son-in-law had been abusive to her daughter, physically abusive. And this had upset her a great deal, that she felt he might kill them both.\" This prompted the physician to ask Mrs. Chatfield \"to call the police and [he] encouraged her to have Mr. Moen removed from her property * * *.\" Defendant's claim for reversal under this assignment of error No. 2 is directed solely to the statement made by Mrs. Chatfield to Dr. Mulkey.\n\nIn addressing the admissibility of such evidence under the identical federal rule, FRE 803(3), Louisell and Mueller comment: \"Continuing emotional * * * shock * * * or unabated fright * * * and other factors may prolong the impact of a stressful event, making it proper to resort to Rule 803(2) despite long lapses of time.\" 4 Louisell \u0026 Mueller, supra, at 506, ยง 439. In this case, Mrs. Chatfield's grandson testified\n\nthat between the two visits to Dr. Mulkey the defendant had threatened to kill him, Mrs. Chatfield, and his mother, Judith Moen, and in fact had threatened them with a shotgun. Therefore, there was a strong factual basis for Mrs. Chatfield's fright, which was relevant to identify defendant as the killer of both women. This evidence is just as admissible as an excited utterance when unsolicited by the physician as it would have been had Mrs. Chatfield run from the scene of the threat shouting, \"I feel Moen might kill us both.\" The fact that the utterance contains a conclusion or opinion of the declarant does not defeat its admission. See Wright v. Swann, 261 Or 440, 447, 493 P2d 148 (1972).\n\nObviously, this utterance reflected the victim's state of mind and was not some remote speculative statement that someone feared another would kill for \"drugs, money and girlfriend,\" which we addressed in State v. Mendez, 308 Or 9, 15, 774 P2d 1082 (1989).\n\nWe recognize that the statement made by Mrs. Chatfield to the physician presents a recurring problem arising in connection with the admissibility of accusatory statements made before the act by victims of homicide. Here, however, the statement made in her distraught condition to the physician related to a real-life event that had actually happened to the victim. The trustworthiness of the statement can be derived from its spontaneity, as a true reflection of her state of mind and her desire to receive treatment from the physician. Of course, most evidence offered by the prosecution is prejudicial to a defendant, otherwise the state would not offer it. The issue is not whether the evidence is prejudicial to a defendant, but whether it is unfairly prejudicial.\n\nIn this case, the trial judge carefully evaluated the proffered evidence, first excluding it under an original offer of proof and then admitting it after a closer evaluation of the evidence with other facts in the case. The trial court did not err in admitting Mrs. Chatfield's statement to Dr. Mulkey.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn addition to his claim that the out-of-court statement of Mrs. Chatfield was hearsay, defendant contends that the admission of Dr. Mulkey's testimony violated defendant's \"confrontation rights secured by the Sixth Amendment of the United States Constitution and Article I, section 11, of the Oregon Constitution.\"\n\nIn State v. Campbell, 299 Or 633, 648, 705 P2d 694 (1985), this court applied the reasoning set forth in Ohio v. Roberts, 448 U.S. 56, 100 S Ct 2531, 65 L Ed 2d 597 (1980), to determine \"what constitutes unavailability of a hearsay declarant and what constitutes adequate indicia of reliability of hearsay declarations to satisfy our state constitutional confrontation clause.\"\n\nThe United States Supreme Court in Ohio v. Roberts established a two-part test to determine whether the admission of the out-of-court statements of a person who does not testify at trial satisfies a criminal defendant's right to confrontation under the Sixth Amendment. First, \"[i]n the usual case,\" the declarant must be \"unavailable,\" and second, the out-of-court statements must have \"adequate indicia of reliability.\" 448 U.S. at 65-66. The Court has concluded \"that certain hearsay exceptions rest upon such solid foundations that admission of virtually any evidence within them comports with the 'substance of the constitutional protection.'\" 448 U.S. at 66. Thus, the \"[r]eliability\" of the out-of-court statement \"can be inferred without more in a case where the evidence falls within a firmly rooted hearsay exception.\" In cases where the evidence does not fall within a \"firmly rooted\" hearsay exception, it may be admitted if the proponent can make \"a showing of particularized guarantees of trustworthiness.\" Id.\n\na. Was the declarant unavailable?\n\nMrs. Chatfield, who made the out-of-court statements, is one of the two murder victims in this case and, for that reason, was not available to testify.\n\nb. In addressing the confrontation clause issue, may the reliability of Mrs. Chatfield's statements to Dr. Mulkey be inferred because they are admissible under OEC 803(4)?\n\nNo independent inquiry into the reliability of Mrs. Chatfield's statements to Dr. Mulkey is required if the hearsay exception expressed in OEC 803(4) is determined to be a\n\n\"firmly rooted\" one. The rationale underlying the assumption that statements made to a physician for purposes of treatment or diagnosis are trustworthy is long-standing and widely recognized. The hearsay exception expressed in OEC 803(4) is \"firmly rooted.\"\n\nOver a century ago, the Massachusetts Supreme Court recognized what would become an additional or alternative rationale for the admission of declarations related to pain and suffering in cases where the statements were made for the purpose of medical treatment or diagnosis. In Barber v. Merriam, 11 Allen 322, 325, 93 Mass 322 (1865), a patient, in order to receive medical advice, made statements to a physician concerning \"the way in which an injury was done.\" The court analyzed the admissibility of the evidence as follows:\n\n\"Its admissibility is an exception to the general rule of evidence, which has its origin in the necessity of the case * * *. To the argument against their competency founded on the danger of deception and fraud, the answer is that such representations are competent only when made to a person of science and medical knowledge, who has the means and opportunity of observing and ascertaining whether the statements and declarations correspond with the condition and appearance of the persons making them, and the present existing symptoms which the eye of experience and skill may discover. Nor is it to be forgotten that statements made to a physician for the purpose of medical advice and treatment are less open to suspicion than the ordinary declarations of a party. They are made with a view to be acted on in a matter of grave personal concernment, in relation to which the party has a strong and direct interest to adhere to the truth.\" Id.\n\nSee also Roosa v. Boston Loan Co., 132 Mass 439, 440 (1882). This same rationale is expressed by OEC 803(4) in the requirements (1) that the statements be \"made for purposes of medical diagnosis or treatment,\" and (2) that (at least for statements concerning the cause of a condition) they be \"reasonably pertinent to diagnosis or treatment.\"\n\nMcCormick, Evidence 690-92, ยง 292 (2d ed 1972), written before the adoption of the Federal Rules of Evidence and the Oregon Evidence Code, observed:\n\n\"Although statements to physicians are not likely to be spontaneous, since they are usually made in response to questions, their reliability is assured by the likelihood that the patient\n\nbelieves that the effectiveness of the treatment he receives may depend largely upon the accuracy of the information he provides the physician.\n\n\"This strong assurance of reliability has caused some courts to expand the exception to include statements made by a patient to a physician concerning past symptoms. This seems appropriate, as patients are likely to recognize the importance to their treatment of accurate statements as to past as well as present symptoms. Wider acceptance of this expansion might well be expected, although at present more courts would probably admit the testimony for the limited purpose of explaining the basis for the physician's conclusion than would admit it to prove the fact of the prior symptoms.\n\n\"The exception might be taken one step further to encompass statements made to a physician concerning the cause or the external source of the condition to be treated. In some cases the special assurance of reliability -- the patient's belief that accuracy is essential to effective treatment -- also applies to statements concerning the cause, and a physician who views this as related to diagnosis and treatment might reasonably be expected to communicate this to the patient and perhaps take other steps to assure a reliable response. * * * The greater number of courts probably still adhere to a position requiring the exclusion of any statements related to cause, although the better view would seem to be that statements as to the inception or general nature of the cause should be admissible insofar as they were reasonably pertinent to diagnosis or treatment.\" (First emphasis in original; second emphasis added; footnotes omitted.)\n\nAlthough until fairly recently statements falling within two categories (viz., past symptoms and cause) were excluded by courts in many jurisdictions, the long-standing and widely recognized rationale supporting the admissibility of statements concerning present symptoms applies equally to past symptoms and -- where it may be relevant to the form of treatment -- to cause. It is that rationale and the circumstances in which the statements are made and not the characteristics of the categories within which these statements fall that assure the trustworthiness of statements admitted under this exception. The exception recognizes that a patient seeking medical treatment has a \"strong motive\" to provide truthful information and that \"life and death decisions are made by physicians in reliance on such facts and as such should have sufficient trustworthiness to be admissible in a court of law.\"\n\nSee United States v. Iron Shell, 633 F2d 77, 83-84 (8th Cir 1980), cert den 450 U.S. 1001 (1981); accord State v. Robinson, 153 Ariz 191, 735 P2d 801, 814 (1987) (\"'indicia of reliability' sufficient to avoid a violation of the confrontation clause\" could be \"inferred\" because statements fell within rule identical to OEC 803(4)); State v. Wyss, 124 Wis 2d 681, 370 NW2d 745, 757-59 (1985) (\"the question of whether a hearsay exception is 'firmly rooted' does not turn upon how long the rule has been accepted but rather how solidly it is grounded on considerations of reliability and trustworthiness -- the very reasons for the right to confrontation\"). See also State v. Maldonado, 13 Conn App 368, 536 A2d 600, 604 (1988) (medical treatment exception \"firmly rooted\" (citing State v. Robinson, supra)).\n\nIn addition to the above, as previously discussed, the statements were also admissible under the \"excited utterance\" exception of OEC 803(2). The excited utterance exception is a firmly rooted traditional hearsay exception.\n\nMrs. Chatfield was unavailable. Her out-of-court statements to Dr. Mulkey were admissible under OEC 803(2) and (4) and bore \"adequate indicia of reliability.\" Accordingly, Dr. Mulkey's testimony did not violate defendant's confrontation rights under either the Oregon or United States Constitution.\n\nASSIGNMENT OF ERROR III\n\nFor his third assignment of error, defendant claims that the court erred in allowing testimony by Judith Moen's son that defendant had threatened one or both of the victims with a shotgun during an argument on a prior occasion. Defendant asserts that evidence of a prior confrontation between defendant and his wife in which other family members attempted to intercede should not have been admitted in the guilt phase of the trial.\n\nThe evidence challenged in this assignment of error is the testimony of Brad Barton concerning an incident that occurred at the Chatfield home in mid-February 1986. The incident was approximately three weeks before Judith Moen and Hazel Chatfield were murdered in that same home. Barton testified that defendant was arguing with Judith Moen in a back studio of the house; Barton was in the living room\n\nwatching television at the time. During the argument, Barton's grandmother, Hazel Chatfield, went back to the studio, and then returned to the living room to ask Barton for his help. When Barton entered the studio, Judith Moen was trying to convince defendant to leave the house, but defendant did not want to leave. Defendant finally left through the back door, and Barton, Judith Moen, and Hazel Chatfield followed him. Outside defendant pushed Judith Moen and said he would kill them. When Barton told defendant not to push his mother, defendant responded, \"What are you going to do about it?\" Barton told defendant he would stop him. At that time, defendant went to the trunk of his car and pulled out a shotgun. Holding the gun at what Barton described as a \"port arms\" position, defendant stated, \"Are you going to try and stop me now?\" At this time, Judith Moen said, \"What are you, such a small man you can't handle a kid except with a gun?\" Defendant then put the gun back in his trunk and closed the trunk. A couple of minutes later, before defendant left, he stated once again that he would kill Barton and Judith Moen. At the time, Hazel Chatfield was at the door of the house where she had gone to call the police.\n\nDefense counsel objected that, under OEC 404(3), the proposed evidence was not admissible, because it proved only the bad character of defendant and that he acted in conformity therewith. Defense counsel further asserted that the February argument was not sufficiently similar to the charged offenses to allow its admission, because the homicides involved a different weapon and because Brad Barton was not present during the killings.\n\nThe admissibility of evidence of \"other crimes\" is governed by OEC 404(3), which provides:\n\n\"Evidence of other crimes, wrongs or acts is not admissible to prove the character of a person in order to show that the person acted in conformity therewith. It may, however, be admissible for other purposes, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\"\n\nBefore ruling that the evidence was admissible, the trial court reviewed State v. Johns, 301 Or 535, 559, 725 P2d 312 (1986), and this court's explanation of the fundamental rationale of OEC 404(3). In ruling that the probative value of\n\nthe evidence outweighed the potential prejudicial effect, the trial court specifically noted that it had taken into account the following factors: the need for the evidence, the certainty that the other crime was committed, the certainty that defendant was the actor, and the strength or weakness of the evidence. See State v. Johns, supra, 301 Or at 557-58. The court concluded as follows:\n\n\"[A]nother reason that in this instance compels me or assists me in my determination of the evidence and that is it is proper in that this case is almost 100 percent based upon circumstantial evidence and the witnesses to the killings are the deceased. Obviously they cannot testify.\n\n\"I believe the witness' testimony was clear and if believed by the jury establishes the fact that there was this occurrence and I do believe that it is relevant to the issue of intent as alleged in the indictment.\"\n\nWhen testimony is offered under OEC 404(3), State v. Johns requires a trial court to make an initial determination whether the proposed evidence is relevant to an issue being tried. If the evidence is relevant to prove intent, then it should be tested under the following criteria set out in Johns:\n\n\"(1) Does the present charged act require proof of intent?\n\n\"(2) Did the prior act require intent?\n\n\"(3) Was the victim in the prior act the same victim or in the same class as the victim in the present case?\n\n\"(4) Was the type of prior act the same or similar to the acts involved in the charged crime?\n\n\"(5) Were the physical elements of the prior act and the present act similar?\n\n\"(6) If these criteria are met, is the probative value of the prior act evidence substantially outweighed by the danger of unfair prejudice, confusion of issues or misleading the jury, undue delay or presentation of cumulative evidence?\" 301 Or at 555-56.\n\nThis court further explained that application of the sixth criterion includes consideration of five factors: (1) the need for the evidence; (2) the certainty that the other crime was committed and that the defendant was the actor; (3) the strength or weakness of the evidence; (4) the inflammatory effect of the evidence on the jury; and (5) how time-consuming\n\nand distracting proof of the other crime evidence will be. 301 Or at 557-58. A trial court has discretionary authority to admit evidence that is relevant to a defendant's intent, unless the probative value of the evidence is substantially outweighed by the danger of unfair prejudice. 301 Or at 559; OEC 403.\n\nIn State v. Johns, this court emphasized that the threshold consideration for the admission of evidence of other crimes is whether the evidence is relevant to an issue in dispute, i.e., whether the evidence has any tendency to make the existence of a fact of consequence more or less probable. \"Other crimes\" evidence is relevant if it \"even slightly increases or decreases the probability of existence of any material fact in issue.\" State v. Allen, 301 Or 569, 573, 725 P2d 331 (1986) (emphasis added).\n\nLong before Johns, this court recognized the relevancy of a defendant's prior hostile acts toward a homicide victim or toward a class of persons to which the victim belongs. See, e.g., State v. Wong Gee, 35 Or 276, 57 P 914 (1899) (defendant's threat to shoot third party over a gambling game in which deceased participated four days prior to homicide admissible in murder prosecution); State v. Finch, 54 Or 482, 488-89, 103 P 505 (1909) (defendant killed deceased because of the latter's zeal in prosecuting charges against defendant for disbarment; \"all evidence of whatsoever nature tending to throw light upon the relations existing between the accused and the deceased and the feeling between them is competent\"); State v. Klamert, 253 Or 485, 455 P2d 607 (1969) (defendant's prior threats against \"young cops\" on several occasions over one-month period preceding crime held properly admitted to prove intent in prosecution for assault with intent to kill police officer).\n\nThis type of evidence has special relevance to the issue of a hostile motive, which in turn is probative of intent. Evidence that shows a hostile relationship existed between a defendant and his victim tends to shed light on a defendant's mens rea. The state had the burden to prove beyond a reasonable doubt that defendant's acts were intentional.\n\nThis court noted in State v. Johns that \"[i]ntent or state of mind is often the most difficult element of a crime to prove because many crimes are unwitnessed and even if a witness is present, the witness can only surmise the actor's\n\nstate of mind. * * * [T]herefore courts very liberally admit prior crime evidence to prove mens rea. \" 301 Or at 551.\n\nIn Johns, this court permitted the introduction of evidence of the defendant's attempt to kill a different spouse six years earlier because the evidence tended to prove that \"when similarly agitated in a domestic setting defendant will act violently and intentionally.\" 301 Or at 551. In parallel fashion, the same inferences may be drawn in this case concerning defendant's mental state during the killings from evidence that shows defendant's intentional reaction under similar circumstances.\n\nThe inference of defendant's homicidal intent was particularly strong because the prior act included the specific threat to kill the same final victim, and because defendant's threat to kill was repeated after his weapon had been put away. This presents the inference that defendant intended to carry out that threat at some time in the future, rather than immediately. The prior threat was relevant to prove that defendant later acted consistent with that expressed intent. In Johns, this court noted that \"the closer in time of the prior act to the act charged, the greater the probative value.\" 301 Or at 555. Here, the events were only three weeks apart, and the inference was accordingly stronger.\n\nAs mentioned, to be convicted of aggravated murder, the state must prove that defendant must have killed both victims intentionally. ORS 163.095, 163.115(1). Evidence of the prior altercation is relevant to show that defendant would kill, and kill intentionally.\n\nThe trial court correctly applied the six factors set out in Johns. First, the charged offenses required proof of intent. Second, the prior act also required intent. Defendant's act of deliberately obtaining a gun from the car and threatening to kill Judith Moen and members of her family demonstrated that specific intent. Third, defendant's threats were directed both at the same victim, Judith Moen, who ultimately was killed, and at the same class of victims, family members who came to the aid of Judith Moen.\n\nThe fourth and fifth factors of similarity between the events were also established. Both the type of act and the physical elements of each act were substantially similar, to the\n\nextent that can be determined from the circumstantial evidence. Both events occurred at Hazel Chatfield's home. In both events, a domestic argument between defendant and his wife preceded the crime. In both events, Hazel Chatfield intervened in the argument. In both events, defendant's anger at Judith Moen expanded to aggression against those who aided her. In both events, defendant resorted to the use of a firearm.\n\nThe final question under the Johns analysis is whether the probative value of the prior act evidence is substantially outweighed by the danger of unfair prejudice, confusion, delay, or misleading the jury. The resolution of this question depends on the five factors of need, certainty, strength, inflammatory effect, and time consumption. Defendant does not question the certainty of his commission of the prior threat or the strength of that evidence. The time consumption was minimal, covering only nine pages of transcript. As to need, the trial court pointed out that \"this case is almost 100 percent based upon circumstantial evidence and the witnesses to the killings are the deceased. Obviously they cannot testify.\"\n\nUnder OEC 404(3), the decision whether the effect of other crimes evidence is unduly prejudicial ultimately is a matter left to the discretion of the trial court. The trial judge carefully determined that the evidence was relevant to the issue of defendant's intent and did not err in admitting evidence of defendant's other threats against his victims. The trial court followed the approved method of analysis of such evidence and acted within the proper scope of its discretion.\n\nPENALTY PHASE ASSIGNMENT OF ERROR IV\n\nThe fourth assignment of error is:\n\n\"The penalty phase was tainted due to improper evidence allowed by the trial court and incorrect instructions such that defendant's right to a fair trial under the due process clause of the United States Constitution, Amendment XIV and Article I, section 11, of the Oregon Constitution was violated. Defendant submits the following errors were made by the trial court at the penalty phase:\n\n\"A. Evidence of prior convictions for negligent homicide and forgery and testimony regarding an unadjudicated\n\nincident in 1959 were too remote and, therefore, not relevant.\n\n\"B. Prior convictions for negligent homicide and forgery were not relevant because none of the convictions were probative on the issue of propensity to commit criminal acts of violence.\n\n\"C. Evidence was admitted in violation of ORS 163.150(2) which prohibits 'the introduction of any evidence secured in violation of the constitution of the United States or of the State of Oregon.' Specifically:\n\n\"(1) Defendant's statement to police officers while in custody after asserting his right to remain silent;\n\n\"(2) Proof of a firearm conviction after the trial court had ruled that the search and seizure which produced the weapon made the basis of the conviction was illegal;\n\n\"(3) Use of transcripts from prior court hearings in violation of defendant's right to confrontation.\n\n\"D. The trial court incorrectly instructed the jury\n\n\"(1) That they could not have sympathy for defendant in their deliberations on the penalty phase;\n\n\"(2) Mitigation evidence applied to the second special issue, not all three questions.\"\n\nWe now consider these issues in turn.\n\nA. Was some of defendant's criminal conduct too remote in time to be relevant to future dangerousness?\n\nDuring the penalty phase of this case, the state offered and the trial court received in evidence exhibits which represented proof of defendant's convictions for forgery (1957) and negligent homicide (1958), and testimony describing a 1959 incident wherein defendant allegedly discharged a gun during an argument.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Defendant objected to this evidence\n\non the ground that it was too remote.\n\nAt the sentencing phase, \"evidence may be presented as to any matter that the court deems relevant to sentence.\" ORS 163.150(1)(a). More specifically, ORS 163.150(1)(b)(B) requires the jury to determine defendant's future dangerousness and, in making that determination, permits certain evidence that can be considered:\n\n\"Upon the conclusion of the presentation of the evidence, the court shall submit the following issues to the jury:\n\n\"* * *\n\n\"(B) Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed * * *.\" (Emphasis added).\n\nIn Wagner, this court emphasized that ORS 163.150 reflects an intent that the information provided to the jury as to defendant's background be broad in scope:\n\n\"Even if the statute were silent, obviously, either defendant or the state would have the right to introduce any evidence relevant to the resolution of all or any of the three questions which frame the jury's resolution of the three issues.\" 305 Or at 156-57.\n\nIn Wagner, the defendant contended that the trial court erred in admitting evidence of his bad character, previous bad acts, and criminal conduct that did not result in convictions. The court responded:\n\n\"The evidence of these bad acts was not received for the purpose of impeachment of defendant. When evidence of a defendant's bad acts is sought to be introduced to blacken a defendant's character, we do not allow it under the Oregon Evidence Code as a general rule because it does not tend to prove or disprove any fact in issue. In considering question number 2 under ORS [163.150(1)(b)(B)], however, such evidence is relevant. It is the kind of evidence on which logical human beings, every day in our society and criminal justice system, make predictions about what a person is most apt to do in the future.\" 305 Or at 178.\n\nOEC 401 defines \"relevant evidence\" as \"evidence having any tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence.\" Evidence of a defendant's entire previous criminal history is relevant concerning the probability that a defendant will commit criminal acts of violence that will constitute a continuing threat to society. It is exactly \"the kind of evidence on which logical human beings * * * make predictions about what a person is most apt to do in the future.\" State v. Wagner, supra, 305 Or at 178.\n\nObviously, a jury in the penalty phase should have information sufficient to enable it to consider the character and individual circumstances of a defendant prior to the imposition of a death sentence, and the jury should consider the range and severity of a defendant's prior criminal conduct in answering the second question.\n\nIn answering that question, the jury should have before it all possible relevant information about the individual defendant whose fate it must determine. The relevant question during the sentencing hearing is whether the defendant will be dangerous in the future. ORS 163.150(1)(b)(B). Evidence of all of a defendant's prior conduct, bad and good, is precisely the type of evidence that the jury needs to make this determination. Therefore, defendant's complete prior conduct was relevant to the issue of whether and to what extent mitigating circumstances existed and the extent of defendant's prior criminal conduct.\n\nDefendant specifically claims that evidence of the 1959 incident in which he fired a gun should have been excluded. As in Wagner, defendant does not challenge the truth or accuracy of the information the jury received and considered on this issue. State v. Wagner, supra, 305 Or at 178. Defendant's assertion is that the lack of conviction coupled with the remoteness in time of the incident renders the incident without probative value. This court has rejected the contention that unadjudicated criminal acts are not relevant during the penalty phase. See State v. Wagner, supra, 305 Or at 178. Evidence of this incident, though somewhat remote, nevertheless is relevant concerning \"the extent and severity of\n\nthe defendant's prior criminal conduct.\" ORS 163.150(1)(b)(B).\n\nDefendant also claims that the trial court should have concluded that the evidence of defendant's forgery and negligent homicide convictions was irrelevant and too remote under OEC 401. While defendant acknowledges that the trial court has discretion to determine whether evidence is relevant or too remote, defendant does not demonstrate that discretion was abused. See State v. Johns, supra, 301 Or at 559; State v. Peden, 220 Or 205, 210-11, 348 P2d 451 (1960) (whether evidence should be excluded for remoteness rests largely in the discretion of the trial court). Nothing indicates that the probative value of this evidence was \"substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury, or by considerations of undue delay or needless presentation of cumulative evidence.\" OEC 403. The trial court did not err in admitting this relevant evidence against a claim of remoteness under OEC 401 or prejudice under OEC 403.\n\nB. Was defendant's \"non-violent\" criminal conduct relevant to future dangerousness?\n\nDefendant asserts that because his convictions for forgery and negligent homicide were \"non-violent criminal convictions\" they were not probative of future dangerousness. We initially note that while forgery generally is a non-violent property offense, negligent homicide, or any crime in which defendant causes the death of another, is not per se \"non-violent\" or \"non-dangerous.\"\n\nIn State v. Huntley, 302 Or 418, 427, 730 P2d 1234 (1986), this court held that dangerous offender statutes are applicable only to defendants whose mental or emotional disorder creates a propensity to commit dangerous, as opposed to non-violent but habitual, criminal acts. Huntley specifically rejected the suggestion that a person's criminal history, whether non-violent or remote in time, is irrelevant in assessing future dangerousness. The same analysis should be applied here on the issue of \"future dangerousness\" under a different statute aimed at the same issue. Huntley noted that the official commentary to the dangerous offender statutes showed the legislative intent that procedural safeguards be provided \"while at the same time furnishing the court with as\n\nmuch information as can be obtained on which to base an intelligent decision \" to determine future dangerousness of an offender. 302 Or at 424 (emphasis added). Similarly, quoting the commentary to parallel provisions of the Model Sentencing Act, Huntley also noted that it was intended that the sentencing authority have broad access to historical facts concerning the person to be sentenced:\n\n\"In the light of today's knowledge of prediction of criminal behavior (or any behavior), we make it clear that the judge, representing society, makes a common-sense decision based on as much relevant information as possible.\" 302 Or at 426 (emphasis in original).\n\nIn Huntley, the court observed that the Diagnostic and Statistical Manual of Mental Disorders (3d ed 1980) (DSM III) provides guidance to a trial court in assessing a defendant's antisocial personality disorder.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Whether a person has such a disorder is relevant to the issue of future dangerousness. Whether a defendant is labeled a sociopath, a psychopath, or a person with an antisocial personality, a jury in the sentencing phase of a death penalty trial is entitled to know if the defendant has such a disorder in deciding the issue of future dangerousness. DSM III-R notes the diagnostic value of the precise crimes for which defendant was convicted in 1957 and 1958. The diagnostic criteria for antisocial personality disorder specifically include acts of theft, including forgery, and recklessness regarding personal safety, as indicated by driving problems such as driving while intoxicated or recurrent speeding. DSM III-R at 344-45. DSM III-R provides the following description of antisocial personality disorder:\n\n\"The essential feature of this disorder is a pattern of irresponsible and antisocial behavior beginning in childhood or early adolescence and continuing into adulthood. For this diagnosis to be given, the person must be at least 18 years of age and have a history of Conduct Disorder before the age of 15.\n\n\"Lying, stealing, truancy, vandalism, initiating fights, running away from home, and physical cruelty are typical childhood signs. In adulthood the antisocial pattern continues, and may include failure to honor financial obligations,\n\nto function as a responsible parent or to plan ahead, and an inability to sustain consistent work behavior. These people fail to conform to social norms and repeatedly perform antisocial acts that are grounds for arrest, such as destroying property, harassing others, stealing, and having an illegal occupation.\n\n\"People with Antisocial Personality Disorder tend to be irritable and aggressive and to get repeatedly into physical fights and assaults, including spouse- or child-beating. Reckless behavior without regard to personal safety is common, as indicated by frequently driving while intoxicated or getting speeding tickets. Typically, these people are promiscuous (defined as never having sustained a monogamous relationship for more than a year). Finally, they generally have no remorse about the effects of their behavior on others; they may even feel justified in having hurt or mistreated others. After age 30, the more flagrantly antisocial behavior may diminish, particularly sexual promiscuity, fighting, and criminality.\" Id. at 342.\n\nConcerning non-violent prior offenses, Huntley pointed to such factors as the defendant's juvenile record, expulsion from school, violation of house rules at foster care, burglary, and automobile theft. The court noted that the defendant, as an adult, had demonstrated a failure to plan ahead, absconded from supervision, showed recklessness by driving while intoxicated, and committed two felonies.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e 302 Or at 436. All these \"non-violent\" factors were considered relevant, given the DSM criteria, to a determination that defendant would pose a future danger to society.\n\nLikewise, in the case before us, the trial court did not err in admitting defendant's eight forgery convictions in 1957 and his 1958 negligent homicide conviction as being of some relevance to the issue of future dangerousness. The trial court found that the evidence \"could show a developing and continuing history of criminal activity.\" The jury needed evidence of defendant's entire criminal record to ensure accuracy in its assessment. Because defendant's complete criminal history is probative of the likelihood of future dangerous criminal conduct, the trial court did not abuse its discretion in determining that the evidence was relevant, notwithstanding the age and nature of the criminal acts.\n\nC. Was evidence admitted in violation of ORS 163.150(1)(a)?\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n1. Were defendant's custodial statements concerning an armed robbery admissible?\n\nThis assignment of error is based primarily upon the testimony of John B. Butler, who was called as a witness by the prosecution during the penalty phase. Butler testified generally concerning his investigation of an armed robbery complaint in August 1968 while he was a police officer in Campbell, California. After eliciting those basic facts, the prosecutor asked:\n\n\"[PROSECUTOR]: And after you took statements from those individuals and spoke to Mr. Richards [the victim], did you have occasion to cause an arrest Warrant to be issued?\n\n\"[BUTLER]: Yes, sir.\n\n\"[DEFENSE COUNSEL]: Objection. What relevancy could this possibly be? And it's misleading and prejudicial.\n\n\"THE COURT: I don't know, but I think we'll discuss it outside the presence of the jury.\"\n\nAt that point, the jury was excused and the prosecutor presented Butler's testimony by way of an offer of proof.\n\nIn the offer of proof, Butler testified that based upon the robbery complaint an arrest warrant was issued for \"Mr. Ronald Howard Moen.\" Defendant subsequently was arrested on the warrant by the police in Boise, Idaho. Defendant \"waived extradition,\" and Butler was one of the officers assigned to transport him back to California. Before leaving Boise, Butler advised defendant of his constitutional rights. In response, defendant \"said he didn't want an attorney present, and he didn't want to make any statements.\" Butler testified that because of defendant's exercise of his right to remain silent, \"we did not ask him any questions about the incident.\" Butler did not induce, coerce, or intimidate defendant into talking about the incident:\n\n\"THE COURT: Notwithstanding the fact that you\n\ndidn't interrogate him, did you promise him anything by way of a reward or favorable consideration or otherwise induce him to get him to make a statement to you?\n\n\"[BUTLER]: No, sir, I did not.\n\n\"THE COURT: Did you coerce or intimidate him in any way or manner?\n\n\"THE WITNESS: Absolutely not, sir.\"\n\nButler testified that while they were en route from Boise to California, defendant \"made some non-solicited remarks * * * to the effect that it was not a good beef. It had not been an armed robbery and referred to the weapon, which he saw me place in the trunk, to his gun.\"\n\nAfter considering the offer of proof, the trial court ruled:\n\n\"[THE COURT]: I understand that this witness is prepared to testify to the jury that after being given the Miranda warnings, he said he didn't want an attorney but he also did not want to talk and later on said something to the effect of 'This is a bum wrap [ sic ]' and 'That is my gun that is being put into the trunk,' or he referred to it in words to that effect.\n\n\"[Defense counsel] made an objection, and I'll overrule the objection and let the witness testify as to that statement.\"\n\nWhen the jury was brought back into the courtroom, Butler testified without objection to the matters presented in the offer of proof. In particular, he testified as follows:\n\n\"[PROSECUTOR]: But you left Boise, Idaho and the authorities there did advise Mr. Moen of his rights per Miranda that day?\n\n\"[BUTLER]: Yes, sir, I did.\n\n\"Q Did you have any conversation or discussion with him on your way back?\n\n\"A Yes, sir.\n\n\"Q Did you solicit -- did you ask, him any questions, make any interrogation of the defendant on the way back?\n\n\"A No, sir, I did not.\n\n\"Q However, did he make a voluntary statement to you?\n\n\"A Yes, sir.\n\n\"Q When was that, the first or second day?\n\n\"A I believe it was the first day.\n\n\"Q Do you recall what the statement was?\n\n\"A He made the statement 'This was not an armed robbery. This was a beef.'\n\n\"Q Was that in reference to the Richards' robbery?\n\n\"A Yes, sir. He made reference to the fact that the gun in the trunk was -- or in the back of the car was his gun.\"\n\nIn this assignment of error defendant does not pursue the relevance objection he made at trial; rather, he states the issue as \"whether sufficient facts exist for the court to have reached the conclusion that defendant initiated the further conversation and therefore waived his right to silence.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Defendant contends that there were insufficient facts to support the conclusion that defendant waived his right to silence, and that therefore the state did not meet its \"heavy burden\" of proving that the statements were voluntary. Defendant states that in the offer of proof, Butler\n\n\"had no recollection of whether or not defendant was handcuffed, how many hours defendant had been in the back of the car when he made the statement, when was the last time the vehicle had stopped for water or a rest before he made the statement, or when the last time defendant had had a meal before the statement.\"\n\nThe complaint about lack of certain details does not overcome the fact that Butler testified without contradiction that he advised defendant of defendant's constitutional rights; that defendant expressly waived his right to a lawyer but invoked his right to silence; that the officers thereafter did not question defendant \"about the incident\"; that Butler \"absolutely\" did not induce, coerce, or intimidate defendant into making admissions concerning the robbery; and that defendant nonetheless \"made some non-solicited remarks\" to the officers concerning the crime.\n\nNo factual basis exists in this record to find either that the challenged statements were involuntary or that they were elicited in violation of defendant's right to silence.\n\nTherefore, Butler's testimony concerning defendant's statements was properly admitted. See State v. Foster, 303 Or 518, 529-30, 739 P2d 1032 (1987); State v. Kell, 303 Or 89, 99-100, 734 P2d 334 (1987).\n\n2. Did the trial court correctly admit evidence that defendant was convicted of possession of a firearm by a felon?\n\nDuring the penalty phase, the prosecution called Duino Giordano, a police officer for the Los Gatos, California, Police Department. He testified concerning an incident on July 7, 1973, in which he stopped defendant in response to an official dispatch that defendant was wanted and was traveling in Los Gatos in a described vehicle. As Giordano began to testify concerning \"a quick pat search\" of defendant that he did at the scene of the stop, defense counsel objected that \"[t]here's no proper grounds for the search and seizure.\" At that point, the jury was excused and the prosecutor proceeded by way of an offer of proof. The prosecutor ultimately elicited from the witness that during the frisk he discovered that defendant had a firearm concealed in his boot.\n\nAfter reviewing the testimony of Giordano relating to his justification for the stop and frisk, the trial court ruled:\n\n\"I'm going to sustain [defense counsel's] objection at this time on the basis that unless the officer had reason to suspect that a crime had been committed, that he was not privileged under Oregon law to stop the person and after the stop to frisk. I don't know what California law is on that subject.\"\n\nThe prosecutor then elected not to use the witness for any further testimony, and he was excused.\n\nSubsequently, the prosecutor offered a record of a judgment of conviction entered in Santa Clara County Superior Court for the State of California. The record establishes that \"RONALD HOWARD MOEN\" was convicted on July 27, 1973, of the crime of \"Possession of Firearm by Felon\" based \"on his plea of guilty.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Defense counsel objected to introduction of the document, but the trial court overruled the objection. On this issue, the following colloquy took place:\n\n\"[DEFENSE COUNSEL]: That is the one the officer previously testified and the Court ruled there was an illegal search and seizure? I understand now this conviction, despite the constitutional issue, will now be used against this defendant?\n\n\"THE COURT: What do you mean?\n\n\"[DEFENSE COUNSEL]: We successfully barred any testimony of this police officer on the ground that he had made an illegal search and seizure.\n\n\"THE COURT: Maybe I was wrong. Maybe it should have been admitted. But that is the conviction order.\n\n\"[DEFENSE COUNSEL]: The statute says you cannot admit evidence that's in violation of the United States and Oregon Constitutions. Those are exempted.\n\n\"THE COURT: I did not rule to that extent regarding the evidence in this case. That portion is relevant and it may be admitted.\"\n\nDefendant argues:\n\n\"[The trial court's] rulings are highly inconsistent and directly in conflict with the intent if not the literal reading of ORS 163.150(1)(a). If evidence obtained in violation of Federal or State Constitutional rights is not intended to be allowed in the penalty phase hearing, certainly proof of a conviction that resulted from such evidence should not be allowed.\"\n\nDefendant's argument is without merit. The most obvious problem with defendant's argument is his unsupported assumption of fact that the challenged conviction \"resulted from such evidence.\" The trial court's exclusion of evidence discovered during the 1973 frisk does not furnish defendant with a basis to collaterally attack the validity of the 1973 conviction. The judgment of conviction on its face discloses that defendant, while represented by counsel, was convicted of the offense based \"on his plea of Guilty.\" Nothing in this record suggests that the evidence the trial court excluded was evidence upon which the prior conviction necessarily was premised, either in whole or in part.\n\nThe trial court correctly admitted into evidence the judgment of conviction, notwithstanding the fact that the court excluded evidence relating to the stop and frisk.\n\n3. During the penalty phase, did the trial court correctly admit transcripts from preliminary hearings in which the victims of defendant's prior crimes testified concerning those crimes?\n\nDuring the penalty phase, the prosecutor offered preliminary hearing transcripts concerning defendant's involvement in several unrelated robberies. Each transcript contained the victim's testimony concerning the crime for which defendant was charged. Defense counsel objected on several grounds, including that the admission of the transcripts violated defendant's right of confrontation under both the Oregon and United States Constitutions. The trial court overruled defendant's objection.\n\nThe evidence was offered as a hearsay exception, former testimony, under OEC 804(3).\n\nOEC 804(1)(d) provides, in pertinent part:\n\n\"'Unavailability as a witness' includes situations in which the declarant:\n\n\"* * *\n\n\"(d) Is unable to be present or to testify at the hearing because of death or then existing physical or mental illness or infirmity[.]\"\n\nOEC 804(3)(a) provides:\n\n\"The following are not excluded by [OEC 802, the hearsay rule] if the declarant is unavailable as a witness:\n\n\"(a) Testimony given as a witness at another hearing of the same or a different proceeding * * *, if the party against whom the testimony is now offered * * * had an opportunity and similar motive to develop the testimony by direct, cross, or redirect examination.\"\n\nWith respect to the transcripts admitted into evidence, the state proffered evidence that the victim whose testimony is recorded in each transcript is deceased, and defendant did not and does not contest the sufficiency of that evidence. Therefore, both declarants were \"unavailable as a witness\" within the meaning of OEC 804(1)(d).\n\nOn their face, both transcripts admitted into evidence meet the basic criteria for admissibility under OEC 804(3)(a) as former testimony. The transcripts, both from\n\npreliminary hearings, disclose that in each the victim testified as a witness, under oath, in a criminal proceeding in which defendant was the adverse party, and that the victims were subjected to extensive cross-examination by defense counsel with respect to their testimony.\n\nDefendant did not and does not contend that either transcript fails to meet those basic criteria. Rather, his present challenge is premised solely on the requirement in OEC 804(3)(a) that during the prior hearing he must have had a \"similar motive to develop the [witness's] testimony by * * * cross * * * examination.\" He contends that he did not have a similar or sufficient motive to conduct a thorough cross-examination of the witnesses during the prior hearings.\n\nThe commentary to OEC 804(3)(a) notes that preliminary hearing testimony is intended to be included within the ambit of the rule, but that a bare opportunity to cross-examine the witness at the hearing may not be sufficient to fulfill the requirements of the rule:\n\n\"The Legislative Assembly recognizes that the foregoing principles may not apply in at least two situations. * * * Again, in a preliminary hearing in a criminal case, neither party may have the opportunity or similar motive to develop testimony. Testimony in these two situations is admissible under this paragraph if the proponent can show equivalent opportunity and motive. California v. Green, 399 U.S. 149, 90 S Ct 1930, 26 L Ed 2d 489 (1970) (testimony given at preliminary hearing satisfied confrontation requirements). Otherwise, it should be excluded. It should be added that failure to cross-examine a witness at a preliminary hearing does not necessarily waive the right to object to admission of the testimony in a subsequent proceeding.\"\n\nThis court has not examined OEC 804(3)(a) with respect to preliminary hearing testimony. The predecessor statute to OEC 804(3)(a), former ORS 41.900(8) (repealed by Or Laws 1981, ch 892, ยง 98), declared admissible \"[t]he testimony of a witness, deceased, * * * given in a former action, suit, or proceeding, or trial thereof, between the same parties, relating to the same matter.\" Applying that statute, the court held that a witness's testimony during a preliminary hearing was admissible in the subsequent criminal prosecution where that witness died in the interim. State v. Crawley, 242 Or 601, 410 P2d 1012 (1966).\n\nIn Crawley, the victim of an automobile theft testified at the defendant's preliminary hearing, but died prior to trial. 242 Or at 603. At trial, the victim's preliminary hearing testimony was recounted for the jury. Citing the statute, this court rejected the defendant's argument on appeal that the testimony should have been excluded as hearsay:\n\n\"The principal basis for excluding hearsay is that no opportunity is afforded to confront the witness and cross examine him. The above statutory provision recognizes that when this opportunity is afforded at the time the testimony was originally given and when the same issues are involved there is no rational basis for excluding evidence of the statements because they are hearsay. Trustworthiness of the statements has already been insured by the opportunity to confront and cross examine. * * * The only factual difference in [ State v. Meyers, 59 Or 537, 117 P 818 (1911),] was that the testimony was given at a prior trial rather than a preliminary hearing. That difference, in our opinion, is not important when defendant has been afforded the opportunity at such a hearing to confront and cross examine the witness.\" 242 Or at 604-05 (citations omitted).\n\nAdditionally, the former statute was interpreted to permit the admission in a criminal trial of sworn testimony taken previously in a different criminal proceeding, provided the defendant was the defendant in the prior proceeding, the witness became unavailable for the second trial, and the defendant had an adequate opportunity to confront the witness and to cross-examine his testimony in the prior proceeding. State v. Von Klein, 71 Or 159, 165-69, 142 P 549 (1914) (testimony taken during larceny prosecution admissible in subsequent prosecution for polygamy where witness became unavailable).\n\nMost of the cases applying OEC 804(3)(a) or its statutory predecessor were those in which the prior testimony was given in the same criminal prosecution. See, e.g., State v. Crawley, supra; State v. Meyers, 59 Or 537, 117 P 818 (1911) (testimony given at first trial admissible in retrial). Nothing in the text of OEC 804(3)(a), however, limits the rule's application to that circumstance. Nor does the current rule require mutuality, unlike former ORS 41.900(8), which was limited to a subsequent proceeding \"between the same parties.\" OEC 804(3)(a) only requires that \"the party against\n\nwhom the testimony is now offered\" had an opportunity and motive in the prior hearing to develop that witness's testimony. Thus, the transcripts were not inadmissible under OEC 804(3)(a) merely because they are from criminal prosecutions in another state based upon different criminal conduct.\n\nDefendant states that \"[n]o * * * thorough cross-examination occurred in either of the preliminary hearings at issue\" and concluded that \"the objection should have been sustained on confrontation clause grounds under both the Federal and State Constitutions.\" He makes no attempt, however, to explain with any particularity how in this case either of the challenged preliminary hearing transcripts failed to meet the \"opportunity and similar motive\" requirements of OEC 804(3)(a). In fact, defendant not only had a complete opportunity to cross-examine the witnesses in both of the prior hearings, but also his defense counsel in each case did so quite extensively. For example, in the case in which Jack Richards was the victim, the direct examination by the prosecutor consumed 10 pages of transcript, while the cross-examination by counsel representing defendant consumed 24 pages. Moreover, in each case the cross-examination thoroughly delved into all pertinent parts of the witness's direct testimony.\n\nThis is not a situation where the witness in the preliminary hearing testified to a matter and the defendant did little or no cross-examination for tactical reasons, such as to use the preliminary hearing primarily for discovery. The principal issue in both preliminary hearings was: Was there probable caused to believe that defendant committed the crime alleged? In each of the prior hearings, the witness testified for the purpose of establishing probable cause to believe that defendant in fact committed the crime that the witness alleged he committed. In response, defendant cross-examined the witness for the obvious purpose of discrediting the witness's testimony that the crime was committed and that defendant was the perpetrator. The \"opportunity and similar motive\" criteria of OEC 804(3)(a) unquestionably were met in this case. Moreover, the admission of transcripts did not violate defendant's confrontation rights under state or federal constitutions.\n\nWhere a witness is unavailable for trial, despite the\n\ngood faith efforts of the state to procure his live testimony, it does not violate the state confrontation clause, Article I, section 11, to admit into evidence a transcript of that witness's prior sworn testimony, provided the above-described statutory prerequisites are met. See State v. Crawley, supra, 242 Or at 604-05 (witness deceased); State v. Meyers, supra, 59 Or at 541-42 (witness outside of jurisdiction). In State v. Crawley, 242 Or at 604-05, this court quoted with approval from State v. Meyers, 59 Or at 604-05:\n\n\"'It is held, however, that, where the accused has once enjoyed the right to cross-examine and confront the witness at an earlier trial, his constitutional right to meet him face to face is not violated by the admission of the testimony of such witness when absent at a subsequent trial. If the defendant is represented by counsel at a preliminary examination, and has had an opportunity to cross-examine witnesses, he has enjoyed his right to meet his accuser face to face, and no objection exists to receiving the testimony. * * *'\"\n\nSee also State v. Von Klein, supra, 71 Or at 167-69 (witness outside of jurisdiction).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe challenged transcripts admitted into evidence in this case also did not violate defendant's federal constitutional rights under the confrontation clause. See Ohio v. Roberts, 448 U.S. 56, 100 S Ct 2531, 65 L Ed 2d 597 (1980); Mancusi v. Stubbs, 408 U.S. 204, 92 S Ct 2308, 33 L Ed 2d 293 (1972); California v. Green, 399 U.S. 149, 90 S Ct 1930, 26 L Ed 2d 489 (1970).\n\nD. (1) Did the trial court correctly instruct the jurors during the penalty phase concerning the role of \"sympathy\" in their deliberations?\n\nOn the morning of April 13, 1987, at the outset of the penalty phase, the trial court gave the jury some preliminary\n\ninstructions, including the following instruction patterned on Uniform Criminal Jury Instruction No. 1003:\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\n\"It is your duty to weigh the evidence calmly, dispassionately, and decide the case upon its merits. You are not to allow any bias, sympathy, or prejudice any place in your deliberations, and you should not use any guesswork, conjecture, or speculation.\"\n\nDuring the preliminary instructions, the trial court also instructed the jurors that they were \"to consider any mitigating circumstances received in evidence\" when they eventually deliberated on the sentence.\n\nFollowing the preliminary instructions, the penalty phase continued for the next eight days. In the late afternoon of April 21, after the close of evidence and the final arguments by counsel, the trial court gave its final penalty phase instructions to the jury. In those instructions, the court again gave an instruction patterned on the uniform instruction cited above, but this time the word \"sympathy\" was omitted.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In pertinent part, the trial court's final instruction to the jurors was as follows:\n\n\"In deciding this case, you're to consider all the evidence that you find worthy of belief. It's your duty to weigh the evidence calmly, dispassionately, and to decide the case upon its merits.\n\n\"You're bound not to allow bias or prejudice any place in your deliberations. You should not decide this case on guesswork or conjecture or speculation.\"\n\nThe trial court also repeated in its final instructions the preliminary instruction on \"mitigating circumstances\"; this time, however, the trial court further defined the term:\n\n\"In determining this issue [the second question], you're to consider any mitigating circumstances received into evidence, including but not limited to defendant's age, the extent of [ sic ] severity of defendant's prior criminal conduct, and the extent of mental and emotional pressure under which the defendant was acting at the time the killing is committed.\n\n\" Mitigating circumstances are those such as do not constitute a justification or excuse of the offense in question; but which in fairness and mercy may be considered as extenuating or reducing a degree of moral culpability. It means allocation, abatement, diminution, reduction, or lessening of the amount of penalty.\" (Emphasis added.)\n\nThe paragraph last quoted is based on \"Defendant's Requested Instruction No. 2,\" which appears to have been submitted near the end of the penalty phase. None of the final instructions suggested that the jurors were to disregard \"sympathy\" in their deliberations, and defendant did not and does not challenge any of the final instructions upon that ground.\n\nDefendant argues that the trial court improperly instructed the jury not to consider sympathy for defendant.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e We initially note that the opening instruction given was general and facially neutral. It was fair and impartial and it cautioned the jury to disregard \"bias, sympathy, or prejudice\" for or against the state, the victims, and defendant. This cautionary instruction operated primarily to defendant's benefit. As the United States Supreme Court observed in California v. Brown, 479 U.S. 538, 543, 107 S Ct 837, 93 L Ed 2d 934, 941 (1987):\n\n\"An instruction prohibiting juries from basing their sentencing decisions on factors not presented at the trial * * * serves the useful purpose of confining the jury's imposition of the death sentence by cautioning it against reliance on extraneous emotional factors, which, we think, would be far more likely to turn the jury against a capital defendant than for him.\"\n\nIn view of the heinous double murder which the jury\n\nhad just found that defendant committed, the instruction challenged here served to diminish the possibility that the jury improperly would decide to impose a death sentence in sympathy for the victims and their families.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nWe also note that in addition to being fair and impartial, the challenged instruction was general and did not interfere with defendant's constitutional and statutory right to have the jury hear and consider fully his mitigating evidence. Defendant does not contend that the trial court excluded any mitigating evidence that he proffered during the penalty phase of the trial. Thus, the jury had before it all of the evidence in mitigation that defendant chose to offer. Furthermore, the trial court specifically instructed the jury both at the beginning and at the close of the penalty phase that \"you are to consider any mitigating circumstances which have been received in evidence.\" As noted above, the final instruction on this issue went further and defined \"mitigating circumstances\" as that evidence \"which in fairness and mercy may be considered as extenuating or reducing a degree of moral culpability.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe essence of defendant's argument concerning this assignment of error is that the trial court's preliminary instruction against considering \"sympathy\" during deliberations effectively precluded the jurors from giving proper consideration to mitigating evidence. His argument fails,\n\nhowever, because he erroneously assumes that his constitutional right to present and to have the jurors consider evidence of specific mitigating circumstances entitles him to appeal generally to their sympathy.\n\nDefendant's argument is grounded on his attempt to distinguish California v. Brown. In that case, a California trial court instructed the jury that it \"must not be swayed by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling.\" 479 U.S. at 539. The California Supreme Court reversed the death sentence on the basis that the instruction violated the federal constitution because a capital defendant has the right to have the jury consider any sympathy factor raised by the evidence when determining the appropriate penalty. In holding that the instruction did not violate the provisions of the Eighth and Fourteenth Amendments to the United States Constitution, the United States Supreme Court, in a plurality opinion, stated:\n\n\"Respondent does not contend, and the Supreme Court of California did not hold, that conjecture, passion, prejudice, public opinion, or public feeling should properly play any role in the jury's sentencing determination, even if such factors might weigh in the defendant's favor. Rather, respondent reads the instruction as if it solely cautioned the jury not to be swayed by 'sympathy.' Even if we were to agree that a rational juror could parse the instruction in such a hypertechnical manner, we would disagree with both respondent's interpretation of the instruction and his conclusion that the instruction is unconstitutional.\n\n\"By concentrating on the noun 'sympathy,' respondent ignores the crucial fact that the jury was instructed to avoid basing its decision on mere sympathy. Even a juror who insisted on focusing on this one phrase in the instruction would likely interpret the phrase as an admonition to ignore emotional responses that are not rooted in the aggravating and mitigating evidence introduced during the penalty phase. While strained in the abstract, respondent's interpretation is simply untenable when viewed in light of the surrounding circumstances. This instruction was given at the end of the penalty phase, only after respondent had produced 13 witnesses in his favor. Yet respondent's interpretation would have these two words transform three days of favorable testimony into a virtual charade. We think a reasonable juror would reject that interpretation, and instead understand the instruction not to rely on 'mere sympathy' as a directive to\n\nignore only the sort of sympathy that would be totally divorced from the evidence adduced during the penalty phase.\" 479 U.S. at 542 (emphasis in original).\n\nIn the case at bar, defendant's interpretation of Brown is erroneous insofar as he construes it to require that jurors must be allowed to decide whether the mitigating evidence engenders sympathy for defendant. The Court in Brown did not open the door to general appeals to the jurors' emotional responses, i.e., to their sympathy. Defendant erroneously construes the Court's mention of \"mere sympathy\" and \"extraneous emotional factors\" to mean, by negative implication, that sympathy and emotionalism are appropriate considerations so long as they are not \"mere\" and \"extraneous.\" The plurality opinion in Brown simply distinguishes full consideration of the objective mitigating circumstances, which is constitutionally mandated, from a general appeal to the jurors' emotional responses, which is impermissible.\n\nIn Brown, the plurality opinion re-emphasized the primary principle in capital sentencing jurisprudence under the Eighth Amendment:\n\n\"The Eighth Amendment jurisprudence of this Court establishes two separate prerequisites to a valid death sentence. First, sentencers may not be given unbridled discretion in determining the fates of those charged with capital offenses. The Constitution instead requires that death penalty statutes be structured so as to prevent the penalty from being administered in an arbitrary and unpredictable fashion.\" 479 U.S. at 541.\n\nThe plurality concluded that an instruction cautioning the jurors from being swayed in their deliberations by \"sympathy\" simply \"prohibit[s] juries from basing their sentencing decisions on factors not presented at the trial, and irrelevant to the issues at the trial, [and] does not violate the United States Constitution.\" 479 U.S. at 543.\n\nThis point is stated more explicitly in Justice O'Connor's concurring opinion in Brown, where she notes that \"the sentence imposed at the penalty stage should reflect a reasoned moral response to the defendant's background, character, and crime rather than mere sympathy or emotion.\" 479 U.S. at 545 (O'Connor, J., concurring) (emphasis in original). This position was reinforced by Justice O'Connor's majority\n\nopinion in Penry v. Lynaugh, 492 U.S. , 109 S Ct 2934, 106 L Ed 2d 256 (1989). In short, general sympathy, or any emotionalism, has no place in a capital sentencing decision, just as it has no place in the jury's deliberations during the guilt phase.\n\nAny uncertainty that remained after Brown concerning the appropriate role of the jurors' sympathy during the sentencing phase effectively was eliminated by the Court's more recent decision in Booth v. Maryland, 482 U.S. 496, 107 S Ct 2529, 96 L Ed 2d 440 (1987). That case involved the question whether it is constitutionally permissible for the capital sentencing jury to hear and consider a \"victim impact statement.\" The Court, per the opinion of Justice Powell joined by the four justices who dissented in Brown, concluded that such evidence was \"irrelevant to a capital sentencing decision, and that its admission creates a constitutionally unacceptable risk that the jury may impose the death penalty in an arbitrary and capricious manner.\" 482 U.S. at 503. In so ruling, the Court expressly reiterated:\n\n\"As we have noted, any decision to impose the death sentence must be, and appear to be, based on reason rather than caprice or emotion. The admission of these emotionally charged opinions as to what conclusions the jury should draw from the evidence clearly is inconsistent with the reasoned decision making we require in capital cases.\" 482 U.S. at 452 (citation, quotation and footnote omitted; emphasis added).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn sum, consistent with the Eighth Amendment,\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nORS 163.150(1) allowed defendant to present and the jury to consider any specific evidence he had to offer in mitigation of his crime. See State v. Farrar, 309 Or 132, 786 P2d 161 (1990). The jury expressly and properly was instructed to consider that evidence in answering the statutory questions. Beyond consideration of that specific mitigation evidence, however, the challenged instruction properly served to caution the jury not to allow general feelings of sympathy any place in its deliberations, regardless whether that sympathy was for defendant, his victims, their families, or anyone else. The instructions, read together and in context, thus constitutionally channeled the jurors' deliberations by instructing them to make a reasoned resolution of the statutory questions based solely on the aggravating and mitigating evidence before them. The Eighth Amendment did not entitle defendant to have the jurors be swayed by sympathy; their proper role was to reach a reasoned decision based solely on the evidence before them. Accordingly, the challenged instruction was proper under the Eighth and Fourteenth Amendments to the United States Constitution.\n\nD. (2) Did the trial court correctly instruct the jurors during the penalty phase concerning the proper role of mitigating evidence in their deliberations?\n\nDefendant cites the following instruction as error:\n\n\"The second question asked by the law is: Is there a probability, meaning is it more likely than not that the defendant would commit criminal acts of violence that would constitute a continuing threat to society?\n\n\" In determining this issue, you're to consider any mitigating circumstances received into evidence including but not limited to defendant's age, the extent or severity of defendant's prior criminal conduct, and the extent of mental or emotional pressure [under] which the defendant was acting at the time the killing is [ sic ] committed.\n\n\"Mitigating circumstances are those such as do not constitute a justification or excuse of the offense in question; but which in fairness and mercy may be considered as extenuating or reducing a degree of moral culpability. It means allocation, abatement, diminution, reduction, or lessening of the amount of penalty.\" (Emphasis added.)\n\nThe first and third paragraphs of this instruction are not at issue in this case.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Concerning the second paragraph, defendant complains only that the emphasized introductory clause was error. Defendant does not claim that the clause is error because of what it says -- he acknowledges that it properly instructed the jury to consider the mitigating evidence in its deliberations on the second question. Rather, defendant's sole complaint is that the emphasized clause improperly might have suggested to the jurors that they were to consider the mitigating evidence only in their deliberations on the second question and not with respect to the other two questions. We do not agree. We have, however, encouraged trial courts to instruct sentencing juries on mitigation on all three statutory issues, not just the second. State v. Wagner, supra, 305 Or at 156-57.\n\nAs we have stated this date in State v. Wagner, 309 Or 5, 786 P2d 93 (1990), consistent with the the Penry v. Lynaugh, supra, decision of the United States Supreme Court and ORS 163.150, in a death penalty case the trial judge must instruct the jury on a fourth question on the subject of mitigation, if constitutionally required. The trial court failed to give such an instruction. The holding in Wagner requires that this case be remanded to the trial court for retrial of the penalty phase only, consistent with the procedures set forth in that opinion.\n\nPursuant to our opinion today in State v. Wagner, in the penalty phase the trial court must instruct each juror on the four issues set forth in ORS 163.150(1)(b) (1989), which statutory instructions may (but need not) read as follows:\n\n1. Was the conduct of the defendant that caused the death of the deceased committed deliberately and with the reasonable expectation that death of the deceased or another would result?\n\n2. Is there a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society? In determining this issue, you shall consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed.\n\n(If raised by the evidence) 3. Was the conduct of the defendant in killing the deceased unreasonable in response to the provocation, if any, by the deceased?\n\n4. Should defendant receive a death sentence? You should answer this question 'no' if you find that there is any aspect of defendant's character or background, or any circumstances of the offense, that you believe would justify a sentence less than death.\n\nAs we stated in Wagner, in the fourth question proposed above we are asking the jury to consider any mitigating aspect of defendant's life, alone or in combination, not necessarily related causally to the offense, in making its finding. 309 Or at 32.\n\nIf any juror votes \"no\" on any of the four questions, the death penalty may not be imposed, because a sentence of death by a jury must be unanimous. Acceptable instructions relating to evidence and proof of mitigating circumstances are set out in State v. Farrar, supra, decided this date.\n\nASSIGNMENT OF ERROR V\n\nFor his final assignment of error, defendant asserts that the trial court erred in overruling defendant's demurrer. Defendant then raises several specific issues, most of which we decline to address because we have decided those issues in State v. Wagner, supra, and State v. Farrar, supra. We will, however, address two issues which defendant posits.\n\nA. Does pretrial incarceration of a defendant indicted for aggravated murder constitute \"unnecessary rigor\"?\n\nDefendant argues that pretrial incarceration of defendant in the face of the potential imposition of the death penalty constitutes unnecessary rigor in violation of Article I, section 13, of the Oregon Constitution. He reasons as follows:\n\n\"The psychological suffering and emotional trauma experienced by a person who is indicted for a capital crime, contemplating the possibility of his life being taken by the state, can only be imagined. Necessary due process prolongs the fear and the uncertainty in a way that can only impose deep psychic injury and terror in the accused. That injury is imposed while the accused is still presumed to be an innocent person.\n\n\"Oregon law recognizes the reality of psychic injuries in awards for emotional distress and anxiety as damages in tort cases and as compensable injuries under workers' compensation laws. To hang the threat of death over an innocent person, like the sword of Damocles, for months, waiting for trial and final determination of whether the defendant should live or die, must do psychic injury of substantial proportion and, therefore, constitutes unnecessary rigor.\"\n\nDefendant's argument apparently is that pretrial confinement on an aggravated murder charge is unnecessarily rigorous because a defendant facing a potential death sentence and receiving due process will necessarily be anxious about the possibility that he might be executed if found guilty of aggravated murder. Defendant's argument is totally without merit.\n\nArticle I, section 13, guarantees that \"[n]o person arrested, or confined in jail, shall be treated with unnecessary rigor.\" Defendant correctly notes that this provision is not limited to beatings or other forms of physical brutality; rather, it extends to \"needlessly harsh, degrading, or dehumanizing treatment of prisoners.\" Sterling v. Cupp, 290 Or 611, 622, 625 P2d 123 (1981). Article I, section 13, is not directed to the charges that bring a defendant into custody, but only to the conditions of his incarceration.\n\nIt was not unnecessarily rigorous to subject defendant, who was charged with aggravated murder, to pretrial\n\nconfinement. Or Const, Art I, ยง 14;\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e ORS 135.240(2).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See generally Haynes v. Burks, 290 Or 75, 619 P2d 632 (1980). Additionally, defendant fails to establish that any prison practices contributed to his anxiety over the possibility of a death sentence. Prison practices are not the cause of such anxiety, because presumably a defendant would suffer the same anxiety if he were at large pending trial.\n\nFinally, it should be noted that the possibility of a death sentence is not unconstitutionally rigorous per se because Article I, section 40, of the Oregon Constitution specifically authorizes the imposition of the death penalty for aggravated murder.\n\nB. Is lethal injection cruel and unusual?\n\nThe caption of defendant's claim differs from the argument that follows it. The caption suggests that death by lethal injection is cruel and unusual. Defendant's associated argument, however, addresses the question whether imposition of the death penalty violates substantive due process. Neither of defendant's arguments has merit.\n\nBecause defendant raised the issue of cruel and unusual punishment as part of his demurrer, the question is whether lethal injection is, on its face, an unconstitutional method of carrying out the death penalty. Lethal injection is not a cruel and unusual method of carrying out the death penalty. Woolls v. McCotter, 798 F2d 695, 698 (5th Ci, cert den 478 U.S. 1031 (1986); see also Gray v. Lucas, 710 F2d 1048, 1057-61 (5th Cir), cert den 463 U.S. 1237 (1983) (execution by lethal gas not cruel and unusual); cf. Heckler v. Chaney, 470 U.S. 821, 105 S Ct 1649, 84 L Ed 2d 714 (1985) (upholding Federal Drug Administration's decision not to decide whether chemical agent used in lethal injection was \"safe\" for human\n\nuse). Defendant does not cite any caselaw advocating his position. There is no basis to defendant's argument.\n\nAs to defendant's substantive due process claim, the state constitution does not provide defendant with any support. This court repeatedly has stated that Oregon's constitution does not contain a due process clause. State v. Wagner, supra, 305 Or at 145-46; State v. Hart, 299 Or 128, 140, 699 P2d 1113 (1985); see also Linde, Without \"Due Process\": Unconstitutional Law in Oregon, 49 Or L Rev 125 (1970).\n\nThe federal constitution also provides no support for defendant's argument. The opinions that have addressed this question have held that, for the purposes of the death penalty, substantive due process is co-extensive with the Eighth Amendment. See Furman v. Georgia, 408 U.S. 238, 359 n 141, 92 S Ct 2726, 33 L Ed 2d 346 (1972) (Marshall, J., concurring); Prejean v. Maggio, 765 F2d 482, 484 (5th Cir 1985) (on rehearing), cert den 492 U.S. , 106 L Ed 2d 604 (1989). In other words, if the imposition of the death penalty satisfies the Eighth Amendment, it also satisfies substantive due process. Cf. McGautha v. California, 402 U.S. 183, 91 S Ct 1454, 28 L Ed 2d 711 (1971) (imposing death penalty did not violate due process).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nConclusion\n\nAny assignments of error not discussed have been considered and are either moot or without merit.\n\nThe judgment is affirmed as to the guilt phase and reversed as to the penalty phase, and the case is remanded to the circuit court for further proceedings consistent with this opinion.\n\nDisposition\n\nThe judgment is affirmed as to the guilt phase and reversed as to the penalty phase, and the case is remanded to the circuit court for resentencing consistent with this opinion.\n\nFADELEY, J., dissenting.\n\nThe court's majority makes two substantial changes in the law in order to provide a new sentencing trial in this case. One very significant change is announced in State v. Wagner, 309 Or 5, 786 P2d 93 (1990) (Wagner II), but applies in common to this case, to Wagner's case and to twenty other\n\ncases. That change holds that this court has the legislative power to add many, many words to change the meaning and procedural effect of a statute adopted by the initiative, and may do so even though the majority of this court said, two years ago, in State v. Wagner, 305 Or 115, 143-45, 752 P2d 1136 (1988) (Wagner I), that the statute did not contain the ideas which are now added to it by the court.\n\nI do not agree that the ends -- providing a new sentencing trial and new appeals -- justify the means of adding 100 words of changes to a printed section of the death penalty statute. Rather, I would achieve finality and punishment at this time by imposing a mandatory life sentence under the portion of our statutes which the United States Supreme Court has not brought in question. This is not a case where a gap in a statute is filled in to cover a situation which the legislature overlooked. Nor is it a case where an ambiguous statute is interpreted in a way which makes sense and avoids a potential problem of constitutional proportions. It is a case of the judiciary adding \"legislation\" to that approved by the legislative branch. This judicial conduct establishes a new and potentially mischievous precedent which I can not join. Accordingly, I dissent from that change in the law.\n\nIn this particular case the court's majority makes a second change, one in the law of evidence, with which I cannot agree. The court changes Oregon evidence law to allow a hearsay statement by \"A\" as admissible to prove the mental intent of \"B\" concerning the conduct of \"B\" 48 to 72 hours after the statement of \"A\" was uttered. I dissent from this extension of the hearsay exception because it is not in accord with our evidence statutes or our decided cases and because the court majority's rule will do substantial damage to the reliability of the fact-finding process.\n\nLEGAL BACKGROUND\n\nIn 1984 the voters adopted two ballot measures. In the first, the people of Oregon amended this state's constitution to permit the government to impose death notwithstanding the state's prior constitutional prohibitions against cruel and unusual punishment and against vengeance as a foundation policy for such punishment. Thus, they recognized that taking the life of a murderer was an act of vengeance, even when the killing was done by the state. They also recognized\n\nthat the government killing of an individual in response to a murder committed by that individual was, in the Oregon value system, a cruel and unusual punishment.\n\nIn the second ballot measure, adopted at the same time, the people borrowed a death penalty sentencing scheme from Texas, rather than re-enact the death statutes used in earlier days in Oregon. In 1988, the statute embodied in the ballot measure was upheld by a majority in Wagner I. On certiorari to the United States Supreme Court, that court in 1989 vacated the judgment of this court and remanded the case to us for reconsideration in light of Penry v. Lynaugh, 492 U.S. , 109 S Ct 2934, 106 L Ed 2d 256 (1989). Wagner v. Oregon, 492 U.S. , 109 S Ct 3235, 106 L Ed 2d 583 (1989).\n\nIn Penry, the Supreme Court found the Texas sentencing formula, copied by Oregon, unsatisfactory for imposing a death sentence because that formula did not permit the jury to use mitigating evidence to decide whether, in that individual instance, death was appropriate. The United States Supreme Court said that, to avoid being cruel and unusual under the federal constitution's Eighth Amendment, \"punishment should be directly related to the personal culpability of the defendant.\" 109 S Ct at 2951, 106 L Ed 2d at 284. By vacating the Oregon decision by this court in Wagner I, the Supreme Court said that imposing death based on the procedure used in Oregon was also defective. This defect follows from the limited question format which prevents the jury from expressing for the community the jury's \"reasoned moral response to the defendant's background, character and crime.\" Id. The Court vacated the judgment of death in Penry because it was imposed by a procedure whereby \"the jury was not provided with a vehicle for expressing its 'reasoned moral response' to that [mitigating] evidence in rendering its sentencing decision.\" 109 S Ct at 2952, 106 L Ed 2d at 284. The Penry court decided that instructing the jury to follow the limited procedures set forth in our statute impermissibly limited the jury's ability to decide for life imprisonment rather than death.\n\nA. Choices for Resentencing\n\nNow that the Wagner case has been returned to this court, Oregon has various policy choices available to it. Those choices may be exercised by local district attorneys, or by this\n\ncourt, within the framework of the part of Oregon's homicide statutes and procedures which the United States Supreme Court has not found to be constitutionally deficient.\n\n1. Finality\n\nAs Chief Justice Rehnquist has said, one major concern of the criminal justice system \"is to ensure that offenders against the laws of society will be punished, and punished without unreasonable delays.\" Rehnquist, Rule of Law, 6 U Ark Little Rock LJ 485, 498 (1983). I would heed that advice to achieve finality of punishment and avoid the unreasonable delays and further appeals inherent in other choices. Article VII (amended), section 3, of the Oregon Constitution provides that this court, knowing the proper final judgment to enter, may enter it. That choice -- entering a final sentence now -- would also avoid the dangerous course of changing the Oregon law concerning which branch of Oregon government it is that is empowered to write legislation.\n\n2. New Sentencing Trial, New Appeals\n\nThe majority does not give such deference to the concept of finality, but instead chooses a course which keeps the defendant's case and appeals still alive and the punishment for his crime still unfixed.\n\nIn my view the majority choice is an example of winning a battle at a price so high to the orderly rule of law that the court risks losing the war against lawlessness.\n\nUNWISE CHANGES IN OREGON LAW\n\nA. The Amendments and Additions to the Statute\n\nI dissent from the drastic revision and lengthy additions to the words of the adopted statute which the majority finds necessary to save the constitutionality of the death penalty procedures of Oregon's Criminal Code. I agree with the majority that without such revisions, additions, and quite possibly other modifications, Oregon's procedures for deciding to impose the death penalty do not meet the requirements announced by the United States Supreme Court in Penry v. Lynaugh, supra.\n\nI disagree with this court's amending and adding to the legislation. Rewriting legislation is the job of the legislative branch and is its exclusive prerogative under our system of government.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe 1984 legislation limited the juries' consideration of \"mitigating circumstances\" to one issue -- \"[w]hether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society.\" ORS 163.150(1)(b)(B)(1987 Replacement Part). This provision first states the issue of future dangerousness as a question for the jury and then immediately states: \"In determining this issue, the court shall instruct the jury to consider any mitigating circumstances.\" Two other subparagraphs state two other issues for the jury, but neither contains words which permit the jury to consider mitigating circumstances with reference to either of the remaining questions. Indeed, no mention of mitigating circumstances is made in the three jury-question subparagraphs except for the internal reference in the subparagraph about future dangerousness.\n\n1. Extent of the Judicial Amendments\n\nThe additions to statute made by this court in Wagner I and II are shown in capitalized letters below. The statute as enacted is shown in lower case letters. The extent of the capitalized additions generally show the presently perceived extent of the constitutional deficiency in the Oregon statute under Penry.\n\n\"(1)(a) Upon a finding that the defendant is guilty of aggravated murder, the court, except as otherwise provided in subsection (2) of this section, shall conduct a separate sentencing proceeding to determine whether the defendant shall\n\nbe sentenced to life imprisonment or death. The proceeding shall be conducted in the trial court before the trial jury as soon as practicable OR ANY OTHER JURY EMPANELED AT ANY TIME AFTER GUILT IS DETERMINED IN THE EVENT THAT DEFENDANT SUCCESSFULLY APPEALS. * * *\n\n\"(b) Upon the conclusion of the presentation of the evidence, the court shall submit the following issues to the jury:\n\n\"(A) Whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that death of the deceased or another would result AND THE JURY SHALL BE INSTRUCTED TO CONSIDER EVIDENCE OF ANY MITIGATING CIRCUMSTANCE ON THIS ISSUE;\n\n\"(B) Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed; and\n\n\"(C) If raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by deceased AND THE JURY SHALL BE INSTRUCTED TO CONSIDER EVIDENCE OF ANY MITIGATING CIRCUMSTANCE ON THIS ISSUE;\n\n\"(D) THE JURY SHALL ALSO BE INSTRUCTED AS FOLLOWS: SHOULD DEFENDANT RECEIVE A DEATH SENTENCE? YOU SHOULD ANSWER THIS QUESTION 'NO' IF YOU FIND THAT THERE IS ANY ASPECT OF DEFENDANT'S CHARACTER OR BACKGROUND, OR ANY CIRCUMSTANCES OF THE OFFENSE, THAT YOU BELIEVE WOULD JUSTIFY A SENTENCE LESS THAN DEATH. \"\n\nEven if I were willing to join in so deeply entering the field of judicial legislation to avoid declaring the unconstitutionality of a statute, the practical wisdom of doing so in this\n\ncase would still seem lacking. It is true that a majority of Oregon voting citizens adopted the sentencing statute now seen by the United States Supreme Court to be constitutionally unsound in application. But, it is doubtful that a majority of Oregonians would approve of general judicial tampering with our jury system by an appellate court placing new statutory limits on the role of juries selected from the community.\n\n2. Cost of the Judicial Amendments\n\nAlso, I believe, the majority of Oregonians should prefer to see the convictions and sentences become final rather than to permit the substantial increased cost and significant added delay before the sentence becomes final which the option of trying to save the statute by judicial legislation necessarily entails. I suspect that the public's purse and patience are stretched to their limits, that the escalating costs and tedious delays in litigation promoted by judicial legislation to save a statute border on intolerable.\n\nAs studies show, the public cost of appeals in a death penalty case exceeds the cost of imprisonment for the rest of the convicted defendant's natural life.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\n3. Delay Created by the Judicial Amendments, Cost of Retrial and Appeal\n\nThe simplest of the 22 death penalty cases now pending on appeal in Oregon is Wagner II, supra, wherein the defendant pleaded guilty to aggravated murder committed in June of 1985. A penalty-phase-only jury proceeding was held following Wanger's guilty plea. The entire proceeding now has to be repeated because of the majority's addition of 100 words of their own to our statute. This affects 22 separate cases.\n\nThe cost and delay of repeating the process are both substantial. A review of what has already happened in Wagner I, and a preview of what will happen in Wagner II follows. Defendant Wagner appealed after the first hearing and sentencing. In September 1987, after a voluminous record of the penalty-phase trial was produced, oral arguments were presented in this court. The public paid for both the state's attorneys and Wagner's advocates, as our constitution requires. This court produced 122 pages of printed majority and dissenting opinions in February 1988. See State v. Wagner, 305 Or 115, 752 P2d 1136 (1988). Wagner then asked the United States Supreme Court to accept his case.\n\nIn the summer of 1989, the United States Supreme Court remanded this case to us, after an appeal for which Oregon's public paid both sides, because of that court's decision in Penry v. Lynaugh, supra. The majority now remands the case to the trial court, which it left in 1985, for a new penalty-phase trial to be held under different guidelines than those used in 1985. Assuming that the publicly paid prosecutor continues to seek the death penalty and is successful in that effort, this court can expect to see the case on appeal again in 1990 or 1991, with a new expensive transcript and publicly paid advocates on both sides. From here, of course, it is on to the United States Supreme Court once again, still at public expense, with a possible final decision in 1992 or 1993.\n\nIf the Supreme Court lets the sentence stand the next time around, the collateral attacks on the sentence, which may follow at public expense, should be over by eight to ten years from the date of Wagner's guilty plea. Until then, the public will pay the costs of Wagner's penitentiary confinement along with the confinement expenses for perhaps, by then, about 100 other Oregon death row inmates.\n\nThe other 19 persons now sentenced to death under the flawed procedure may not receive two direct chances at the Supreme Court, as Wagner will, but the cost of transcripts, advocates, and appeals in each of those 19 cases have been enlarged because each had separate trials to determine guilt and each raised trial issues on appeal, none of which were present in Wagner's guilty plea case.\n\nSubstantial savings would have resulted had the majority of this court simply adhered to the statute in effect at the time of conviction, which was the statute already presented to and effectively invalidated by the United States Supreme Court. Instead, this court bends its precedents about judicial legislation to the breaking point by changing the statute to make it fit current perceptions about the meaning of the federal constitution.\n\n4. Diminution of Constitutional Separation of Powers\n\nThe rationale offered by the majority for why it may make such extensive amendments and additions to the death penalty statute obliterates the constitutional separation of the legislative and judicial branches of our government. The majority says, if the statute does not \"preclude\" (i.e., expressly forbid) the court's amendments and additions, there is no limit to what change a court can make in a legislative act.\n\nAs if to prove the point, the court cites ORS 174.010, correctly summarizes that statute as providing \"a general direction not to add to the terms of a statute,\" but then immediately erases the clear meaning of that statute by calling it merely one of the \"useful tools for decision\" which may be ignored in favor of the majority's \"specific analysis in the first instance.\" ORS 174.010 says in direct terms that judges are not to insert \"what has been omitted.\" Our cases have honored that limit until today. Today the court in effect says: \"Why bother with legislation, we can make all the changes in the statutes we want.\"\n\nB. Admission of Prejudicial Hearsay\n\nI also dissent from the court's majority ruling that evidence of an accusatory statement made by a person murdered two or three days later is admissible to prove the \"identity\" or the \"intent\" of the assailant.\n\nI have no quarrel with the general exception to the hearsay rule that statements made to one's physician for the purpose of obtaining treatment are not rendered inadmissible\n\nsimply because they are made outside the courtroom and are offered to prove the truth of the matters asserted. OEC 803(4). However, I think the statement at issue, \"I am afraid he [my son-in-law] will kill us both,\" fails to come within the guarantees of reliability that form the logical basis for the exception. Nor do I think the declarative accusation, made before the conduct that the prosecution seeks to prove, meets the requirements to qualify for the hearsay exception, let alone passes the probative-value versus unfair-prejudice test in OEC 403.\n\n1. Nature of Diagnosis and Treatment Relationship\n\nThe chronology of treatment shows the patient first came to the doctor for treatment not related to fear of the son-in-law, that during a later but regularly scheduled visit the doctor diagnosed the patient as also suffering from situational depression, that a month later, at a regularly scheduled return visit, she made the accusatory statement about fear that defendant would kill her, and that several days later she was killed. The chronology is as follows:\n\nIn August of 1985, patient Chatfield was transferred from another doctor to the care of the doctor who later became the witness to her hearsay statement. She came with nine listed ailments, and a medical history of chronic depression. The doctor-witness started treating the multiple conditions with regularly scheduled visits on the 11th day of each month, including October and November, 1985.\n\nOn February 11, 1986, she came for a regular visit and stated she was upset \"since\" her daughter and son-in-law had moved in with her. She mentioned being afraid of his dog, not him. The doctor diagnosed \"situational depression\" during this visit.\n\nOn March 11, 1986, she came for a regular visit. The depression was present to a heightened degree. The statement objected to, but admitted in evidence, was made at this visit. No new diagnosis was made, although a prescription of a drug for depression, which also reduced \"anxiety,\" was given by the witness-doctor.\n\nOn March 13 or 14, 1986, patient Chatfield was shot. The doctor did not see, diagnose, or treat her for this injury.\n\n2. Objections to Doctor's Testimony About the Declaration\n\nDefense counsel objected to the doctor's recounting what the patient said, two or three days before she was shot, in part, as follows:\n\n\"[T]here has to be a trauma that's being treated which has to arise as a result of some specific action or injury that's directed toward the deceased, Mrs. Chatfield.\"\n\nThis ground of objection is sufficient to raise the issue that the patient's statement to her physician is only admissible as proof of the cause of a past injury and that it is not admissible to prove the way that future injury occurred, after the statement was made, in accordance with the declared opinion or prediction about the future. It also impliedly points out the lack of treatment motivation to tell the truth. Following that ground of objection the trial judge asked the doctor:\n\nQuestion: \"Did Mrs. Chatfield relate any instances of problems with her and Mr. Moen?\"\n\nAnswer: \"Do you want me to elaborate or say 'yes' or 'no'? The answer is 'no'. I asked her. I said 'Has he been physically abusive to you?' She said 'No.' * * * But she said, what I was testifying to concerning before, she was afraid he would kill them both.\"\n\nDefense counsel also objected that:\n\n\"Under this particular exception, 803(4) that generally statements contributing [sic] fault usually are not admissible * * *. The type of statement being elicited from the doctor that's attributed to the victim Chatfield is a statement of fault * * *. [A]t no time did Mrs. Chatfield say the defendant, Mr. Moen, had struck her physically, assaulted her or threatened to kill her * * *. So I think it is important to make that distinction and because no statements were made to the doctor about that, and because the statements by Mrs. Chatfield were a fault type statement, that it does not fall within the exception and should not be admissible.\"\n\nOn appeal, the defendant pointed out that the doctor did not specifically rely upon the statement as reasonably\n\npertinent to his diagnosis of depression. The doctor diagnosed the situational depression on February 11, 1986, and the statement about which he testified over objection, was made to him a month later.\n\n3. Court's Ruling Admitting Declaration\n\nIn overruling the objections, the trial judge said:\n\n\"The rationale, of course, is I assume the patient's intention and desire to be truthful in seeking treatment from a doctor is more apt to be truthful than to falsify a statement when they are seeking medical treatment.\n\n\"In this case the doctor's patient, one of the victims in the homicide, unquestionably went to him for medical care, treatment and the information she gave him was used by the doctor in his prescription and/or advice as to what she should do for her condition of depression which the doctor found to be present.\"\n\nThe trial judge recognized and ruled on the issue of admissibility under OEC 403, stating:\n\n\"I think under those circumstances and weighing the probative value with the possible prejudice affect [sic] that the evidence is admissible.\n\n\"I'll overrule the objection and the doctor may be permitted to testify.\"\n\n4. Scope of Rule Against Hearsay and Its Exceptions\n\nOEC 801(3) defines hearsay as an out-of-court statement \"offered in evidence to prove the truth of the matter asserted\" in the statement. Here, the hearsay statement, \"I am afraid my son-in-law will kill us both,\" was offered in a trial on an indictment alleging that the son-in-law committed homicide and that he did so \"intentionally.\" The Oregon Evidence Code states: \"Hearsay is not admissible except as provided by [Rules 801 to 806] or as otherwise provided by law.\"\n\nOEC 802. The Legislative Commentary provides: \"In any event, the Legislative Assembly intends that hearsay only be admitted pursuant to some statutory or constitutional authority.\" Kirkpatrick, Oregon Evidence 347 (1982).\n\nOEC 803 now lists 24 situations where a hearsay declaration is \"not excluded\" by the general exclusionary rule in OEC 802. The Legislative Commentary indicates that these exceptions do not mandate that an out-of-court declaration is admissible in evidence even where the declaration fits within an exception. As the Legislative Commentary points out:\n\n\"The exceptions to the rule against admissibility of hearsay evidence set forth in this rule are phrased in negative terms of non-application of the hearsay rule, rather than in positive terms of admissibility. This is done in order to repel any implication that other grounds for excluding the evidence are eliminated from consideration.\" Kirkpatrick, supra, at 350.\n\nThe evidence of the out-of-court statement may thus be excluded as not relevant, or as unfairly or highly prejudicial in comparison with the strength of its tendency to prove a fact in issue such as, in this case, identity or intent. Thus, OEC 403 states, in part, \"evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice\" and for other reasons.\n\n5. Exceptions to Exclusion of Hearsay on Which Majority Relies\n\nThe majority in this case relies upon two of the hearsay exceptions and holds that they mandate admissibility of the statement \"I am afraid my son-in-law will kill us both.\" Those exceptions are for \"statements made for purposes of diagnosis or treatment,\" OEC 803 (4), and a \"statement relating to a startling event or condition,\" more commonly called an \"excited utterance.\" OEC 803(2).\n\n6. Conflicting Reliability Guarantees of Majority's Exceptions\n\nA moment's reflection will suggest that these two grounds contradict one another. A person who is so excited that the person utters a spontaneous remark without reflecting\n\nupon its effect, as is required to qualify as trustworthy under the excited utterance exception, is not likely to be mindful of or motivated by the knowledge that the statement is being used for the purpose of that person's diagnosis or treatment, as is required to qualify as trustworthy under that exception. That mutual contradiction of reliability guarantees should be enough reason not to be persuaded of admissibility by a claim that both exceptions support admission of the hearsay.\n\nHowever, those are two exceptions upon which the majority relies to sustain this capital conviction. Under the majority decision, a trial judge will preside over a re-trial of the penalty phase proceeding where the propriety of letting a jury hear the second-hand out-of-court accusatory statement may come in question again. Therefore, a detailed examination of the statement and the requirements for coming within the exception are now in order.\n\n7. Accusatory Hearsay Statements by a Victim\n\na. Victim's Accusatory Hearsay Not Usually Admissible\n\nTaken literally, the statement \"I am afraid he will kill us both\" expresses a current state of mind, that of a present fear of death and of the person who the declarant states produces the fear. It is also an accusation that the person to whom declarant attributes her fear of death is of a sort or character that she reasonably believes will kill her. Taken in the context of this case, it is a prediction and an accusation of who would be likely to kill her. The majority describes the statement as if it were a declaration about the son-in-law's past treatment of the declarant. That does not fit, however, with the doctor's testimony about Mrs. Chatfield's statement to him. The doctor testified, in answer to questions by the trial judge, as follows:\n\nQuestion: \"Did Mrs. Chatfield relate any instances of problems with her and Mr. Moen?\n\nAnswer: \"Do you want me to elaborate or say 'yes' or 'no'? The answer is 'no.' I asked her. I said 'Has he been physically abusive to you?' She said 'No.' * * * But\n\nshe said, what I was testifying to concerning before, she was afraid he would kill them both.\"\n\nThis court has, within the year, unanimously rejected as inadmissible evidence offered by a murder defendant that the victim feared a person, whom the victim named, would kill him. In the unanimous decision in State v. Mendez, 308 Or 9, 774 P2d 1082 (1989), the offered and rejected testimony was that:\n\n\"two weeks before his murder [Carlos] Sevilla asked her for a weapon, stating that he feared [Carl] Moen would kill him for his drugs, money, and girlfriend.\" 308 Or at 15.\n\nThe prosecutor's hearsay objection was sustained and the evidence was excluded. This court, upholding exclusion of the evidence, approved the explanation of ruling offered by the trial judge, as follows:\n\n\"But, the fact still remains that even if it had relevancy, the prejudicial effect of such a statement outweighs its probative value, because the prejudicial effect is that the jury could accept that as a statement for the truth of what is being said by the declarant about some future thing that is going to happen, and it is not admissible for that purpose.\" 308 Or at 17 n 12.\n\n(The fact that the persons accused by the victims in Mendez and here are named \"Moen\" is a coincidence. They are two different people.)\n\nIn the murder case of People v. Ireland, 75 Cal 188, 450 P2d 580 (1969), the issue was whether a homicide was intentional, as it is one of the issues here. There, the accusatory statement was made on the day of her death by the victim, Ann, to her friend, Mrs. Blount. The trial court permitted Mrs. Blount to testify, over hearsay objection, that the victim told her she feared that the defendant would kill her. The California Supreme Court reversed, stating that:\n\n\"In such circumstances it must be concluded that the hearsay statement of Ann offered through the testimony of Mrs. Blount was improperly admitted into evidence.\n\n\"* * *\n\n\"The error was prejudicial. The statement in question not only reflected Ann's state of mind at the time of utterance; it\n\nalso constituted an opinion on her part as to conduct which defendant would undertake at a future time. On the basis of this hearsay opinion the jury might reasonably have inferred that Ann several hours before the homicide had concluded that defendant had then formed the intention to kill her. The next logical inference, to wit, that Ann's assessment of defendant's then intention was accurate and defendant had in fact formed an intention to kill several hours before the homicide strikes directly at the heart of the defense. The judgment must, therefore, be reversed.\" 75 Cal at 193-94, 450 P2d at 585-86 (footnote omitted).\n\nIndeed, as of the time of the annotation \"Admissibility as Res Gestae, of Accusatory Utterances Made by Homicide Victim Before the Act,\" 74 ALR 3d 963 (1976), the author was able to state categorically:\n\n\"Where the interval of time between the utterance and the act of homicide extended over a period of several days the attempt to introduce such statement into evidence has been unsuccessful.\" Id. at 981.\n\nThe United States Supreme Court has also spoken about accusatory statements made by a homicide victim which point to defendant as the murderer in a case which presents the accusation as a backward-looking one. But that is also the gist of the majority's description of Mrs. Chatfield's accusation here, even though that description does not fit the literal words which the doctor relayed to the jury. In Shepard v. United States, 290 U.S. 96, 54 S Ct 22, 78 L Ed 196 (1933), a victim, two weeks before her death, told her nurse, then caring for her as a patient, that \"Dr. Shepard has poisoned me.\" 290 U.S. at 98. The doctor was husband of the victim and the indicted defendant against whom the nurse was permitted to testify. Speaking through Justice Cardozo, the Supreme Court reversed the conviction because of error in admitting the hearsay statement, either as dying declaration or as proof of state of mind of the victim.\n\nThe Supreme Court rejected arguments that the jury would not be misled into treating the accusation as proof of Dr. Shepard's guilt. The court stated:\n\n\"The reverberating clang of those accusatory words would drown all weaker sounds. It is for ordinary minds, and not for\n\npsychoanalysts, that our rules of evidence are framed.\" 290 U.S. at 104.\n\nb. This Accusatory Statement and OEC 803(4); Statements for the Purposes of Medical Diagnosis or Treatment\n\nTwo days or more\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e before her death by violence in her home, Mrs. Chatfield told her physician of her fear of death at the hands of defendant.\n\n(i.) OEC 803(4) Exception Applies to Past or Present Events, Not to Future Predictions\n\nThe text of rule 803(4) clearly shows that the exception relates only to statements of past or present events. It lists as \"not excluded\" the following:\n\n\"Statements made for purposes of medical diagnosis or treatment and describing medical history, or past or present symptoms, pain or sensations, or the inception or general character of the cause of [sic] external source thereof insofar as reasonably pertinent to diagnosis or treatment.\"\n\nThe Legislative Commentary likewise supports the exemption only for proof of past or present condition, or causation of the past or present condition, as follows:\n\n\"The guaranty of trustworthiness extends to statements of past condition made for the purpose of diagnosis or treatment, i.e., medical history, although until now Oregon courts have not accepted this. The guaranty also extends to statements regarding causation of a condition, if reasonably pertinent, in accord with the current trend.\" Kirkpatrick, supra, at 360 (citations omitted).\n\nHowever, as the majority opinion notes but does not explain, the guarantee of reliability upon which the law permits the doctor's testimony is the belief in the mind of the patient that the statement is pertinent to the doctor's treatment and diagnosis. The reliability of hearsay statements depends on the declarant's understanding that the statement\n\nis pertinent to diagnosis or treatment so that the declarant will be motivated to tell the truth in the interest of declarant's own health.\n\n(ii.) OEC 803(4) Exception Requires Declarant to Have a Treatment Motive for the Statement Offered\n\nThe main case upon which the majority relies, states this requirement as follows: \"[F]irst, the declarant's motive in making the statement must be consistent with the purposes of promoting treatment.\" United States v. Renville, 779 F2d 430, 436 (8th Cir 1985) (emphasis added). The Renville court cited other 8th Circuit cases in support of the rule. Renville and the cases it cites involve a past fact, not a future prediction or opinion, and identify the person who criminally injured the declarant personally. The use of the past-fact statement in Renville is to identify, through the doctor's testimony, the assailant -- to disclose through the doctor who it was that committed past sexual abuse for which treatment is being given.\n\nIn the instant case the patient did not make the statement in the form of telling her symptoms to the doctor to obtain his help. Apparently, she held no belief that that subject was necessary to successful diagnosis and treatment, at least there is no evidence that she so understood the situation so that she could form a motive to be truthful in making the accusatory statement.\n\nThe doctor-witness described declarant Mrs. Chatfield as \"extremely nervous and was not able to cope with\" his diagnosis of cancer which was life threatening. She was \"agitated and upset\" before he told her that and she \"wouldn't discuss\" the life threatening problem. The situational depression, which the doctor-witness diagnosed a month earlier, was present and heightened: \"It was impossible to conduct an interview with her. * * * She seemed to jump from one subject to the next. She couldn't concentrate or answer my questions directly.\" Declarant had been treated for symptoms of depression even before she became the doctor-witness' patient eight months earlier and before her daugher and defendant moved to her home.\n\nUnited States v. Narciso, 446 F Supp 252, 289 (ED Mich 1977) (statement of patient he \"was shot\" admissible but statement \"shot by white man\" not admissible), interprets the identical provisions of the Federal Rules of Evidence, FRE 803(4), as follows:\n\n\"Yet while the doctor's motive was further diagnosis, the underlying assumption of the rule requires the Court to inquire as to the declarant's motivation for giving the information. If his motive is to disclose the information to aid in his own diagnosis and treatment, this, it is assumed, guarantees the statement's trustworthiness. However, if the declarant makes the statement while under the impression that he is being asked to indicate 'who was responsible' for what happened, his response may very well be accusatory in nature and any inherent reliability of such a statement is thereby destroyed.\"\n\nIndeed, the majority opinion discloses that the declarant had no ability to form or follow a motivation to tell her doctor the truth at the time she made the declaration.\n\nThe majority points out that she was, at the time she saw the doctor \"laboring under the stress of an event or condition which caused excitement.\" 309 Or at 59. The doctor could not even instruct her about the life-threatening cancer in her eye. Id at 19-20.\n\nThe doctor's recounting of this particular statement -- \"I fear he will kill us both\" -- should not have been admitted as qualifying under the exception for statements of past events or present condition made to a physician for treatment.\n\nNone of the authorities cited by the majority are about a statement used to prove the intent or identity of a future, but predicted, homicide. No authority can be found to support admission under the diagnosis and treatment exception, to prove a future event.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Rather, the authorities cited, or\n\nwhich can be found, require that the declaration of the patient be about past causation of a currently existing condition. At most, the declaration, under those authorities, would be admissible to prove that the mother-in-law's existing condition of depression was caused by fear of her son-in-law. These cases do not support admission of a prediction of who will commit a future crime as to which there can be no present motive to be truthful to obtain proper treatment. These cases are not at all about an accusation that \"He will kill me\" in the future. Nor do they involve declarants who told the doctor-witness \"No, he has never abused me.\"\n\nMoreover, there are other ways in which the majority's sustaining of the use of this declaration as evidence are not supported by authorities quoted or cited by the majority.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n(iii.) OEC 803(4) Fault-Attribution Exception Limited to Child Abuse Cases\n\nThe Renville court justified a special exception from the restrictions of FRE 803(4) upon which the majority seizes and expands. A treatment statement normally may not be used for attributing past fault. The special exception is for \"a statement of a child abuse victim that the abuser is a member of the victim's immediate household.\" 779 F2d at 436. The majority quotes this special exception but, then, without any analysis whatever or citation of any authority, states as a holding that:\n\n\"Admissibility of statements of the type challenged here is not limited to cases involving child abuse.\" 309 Or at 59.\n\nThe cases relied upon by the majority in footnote 4 do not\n\nsupport the misapplication of the rule by the majority. Rather, they are about identifying the perpetrator of child sex abuse which has occurred within a family. Moreover, the legislature limited any expansion of admissibility of any such past accusatory statements to those made by a child under 10 years when it added OEC 803(18)(a) in 1989.\n\nc. The Accusatory Statement and OEC 803(2), the Excited Utterance Exception\n\nThe majority upholds the accusatory statement about future conduct on the ground that it was spontaneous, made in a state of excitement, and brought on by past events which the majority documents as \"threatened with a shotgun\" at least three weeks earlier.\n\nIn general, this exception requires that the declarant be startled and exclaim spontaneously and thus not be able to deliberate or think about what to say between the event and the excited utterance. See Zeller v. Dahl, 262 Or 515, 518-20, 499 P2d 1316 (1972); Kirkpatrick, Oregon Evidence, 355 (1982) and 135 (Supp 1988-1989).\n\nThe excited utterance rule provides that the declaration is \"not excluded\" although it is made out-of-court, i.e. hearsay. OEC 803(2). The rule does not exclude the following:\n\n\"A statement relating to a startling event or condition made while the declarant was under the stress of excitment caused by the event or condition.\"\n\nThe Legislative Commentary states:\n\n\"The key factor in determining whether an utterance is 'excited' and therefore qualifies under the exception, is the degree to which it is spontaneous.\" Kirkpatrick, supra, at 353.\n\n(i.) Startling Event Required for Exception\n\nThe commentary and rule require a \"startling event\" and that the declaration in evidence be related in time to that startling event. No case or other authority can be cited to support a time-separation of more than three weeks. Yet, that is the time separation between the shotgun incident and the accusatory statement of the victim. Mrs. Chatfield's adult\n\ngrandson, who was there, testified to establish the shotgun incident date.\n\nThe excited statement must relate to an immediately past or present event causing the excitement during which the utterance is made.\n\n(ii.) Utterance Must Be Close In Time to Startling Event\n\nThe majority makes use of the elastic word \"long,\" found in a text on evidence, in an effort to avoid the problem of over three weeks delay between the startling event on which the majority relies to make the utterance an excited one and the date of the utterance offered in evidence. 4 Louisell and Mueller, Federal Evidence, 506, ยง 439 (1980). The text uses the words \"long lapses of time,\" but the longest lapse in a cited supporting case is 20 hours, not over three weeks. Id at 506 n 10. In the 20-hour case, the evidence was a statement made to a doctor while declarant was hospitalized for the prior injury to which the statement directly related. Id. It was not an accusation about future conduct.\n\n(iii.) Excitement of Startling Event Must Persist Until Utterance\n\nThere is no evidence here that the excitement of the shotgun incident was present in the declarant or that she had performed no reflective reasoning after that event and before her declaration to the doctor. The majority replaces the absent, but needed, evidence by connective conjecture. In so doing, the majority stretches the rule's requirement for a time connection between the startling event and the utterance many times further than the point at which all other courts have held the connection breaks and the utterance is inadmissible. Even so no continuing excitement from the startling event is shown to be present.\n\nConclusion\n\nI am not convinced beyond a reasonable doubt that the erroneously admitted evidence did not significantly influence the jury's verdict and its finding of intentional and deliberate murder. The case was circumstantial. The homicides\n\nwere with a .38 caliber pistol, not a shotgun, and there is some evidence they were committed in the course of a marijuana-related burglary. The state offered a plea bargain for life imprisonment which the defendant refused. The judge's instructions offered no lesser included offenses to the jury. The victim's accusation of future wrongdoing produces a \"reverberating clang,\" to borrow Justice Cardoza's phrase, which unfairly prejudiced the result. I would reverse the conviction as well as the penalty phase verdict in this case. The finding of guilt should be reversed and a new trial granted on that issue as well as on the death penalty issue which the majority's rewriting of the death penalty law will require.\n\n\u003cspan class=\"fn\"\u003e1. This discussion refers to ORS 163.150(1)(b) before its 1989 amendment, Or Laws 1989, ch 790, ยง 135b. Prior to this amendment, this statute provided: \"Upon the conclusion of the presentation of the evidence, the court shall submit the following issues to the jury: \"(A) Whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that death of the deceased or another would result; \"(B) Whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society. In determining this issue, the court shall instruct the jury to consider any mitigating circumstances offered in evidence, including, but not limited to, the defendant's age, the extent and severity of the defendant's prior criminal conduct and the extent of the mental and emotional pressure under which the defendant was acting at the time the offense was committed; and \"(C) If raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The indictment was returned before this court decided State v. Wagner, 305 Or 115, 752 P2d 1136 (1988), which held that the three statutory questions need not be pled in an indictment. That judgment was vacated and the case was remanded, on different grounds. Wagner v. Oregon, 492 U.S. , 109 S Ct 3235, 106 L Ed 2d 583 (1989), on remand 309 Or 5, 786 P2d 93 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See subsequent history at note 2, ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Many state courts have reached the same conclusion as the Renville court: State v. Robinson, 153 Ariz 191, 735 P2d 801 (1987) (while the official commentary to FRE 803(4) excludes attributions of fault from the category of admissible statements made to a treating physician, this concerns only somatic injuries, such as result from automobile accidents. In child sexual abuse cases statements concerning the assailant's identity are crucial to effective treatment of the psychological trauma of the abuse and to the prevention of future abuse); Stallnacker v. State, 19 Ark App 9, 715 SW2d 883 (1986) (because there was a need to prevent recurring abuse and to treat the child emotionally, the child's statements identifying her father as the abuser were admissible); Oldsen v. People, 732 P2d 1132 (Colo 1986) (because the child victim was found to be incompetent to testify and because the proponent of the hearsay testimony could produce no other evidence that the child was capable of recognizing the need to prove accurate information for purposes of diagnosis or treatment, the child's statements to the treating physician were admissible under Rule 803(4)); but see People v. Lalone, 432 Mich 103, 437 NW2d 611 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We note that the Supreme Court of Wisconsin arrived at a similar conclusion in a remarkably similar case in deciding State v. Wyss, 124 Wis 2d 681, 370 NW2d 745, 759 (1985). In that case, a prosecution for first-degree murder of wife, the Wisconsin Supreme Court held that trial court did not abuse its discretion in admitting victim's statements to her psychiatrist that she lived in fear of her husband; the trustworthiness of the evidence was derived from the victim's motivation to tell the truth as the result of the desire to receive treatment for an anxiety disorder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. On July 31, 1959, at 2:30 a.m., defendant entered the home of Robert Franke, defendant's then brother-in-law, and removed a handgun. A confrontation took place when Franke tried to stop defendant from taking the weapon. Defendant refused to return the gun and pointed it at Franke. When Franke asked to go back to the house and tend to crying children, defendant pulled the trigger of the gun, causing it to snap on an empty chamber. Back in the house, defendant demanded that Franke give him bullets and another gun. When Franke turned to leave the room, defendant shot the gun. The bullet lodged in a doorway at eye-level with Franke, approximately one foot away. Defendant's mother and sister persuaded Franke not to pursue criminal charges. Defendant called his sister, Ardyce Schaecher, as a witness to the incident. His sister testified that, although defendant was drunk and wanted money, defendant did not point the gun at Franke, but fired it at the ceiling.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. DSM III has been updated as DSM III-R (1987). Diagnostic criteria in the new edition are substantially similar for purposes here. Both versions emphasize early manifestations of antisocial behavior.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The court did not explain what type of felony offenses were involved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. ORS 163.150(1)(a) provides in relevant part: \"This subsection shall not be construed to authorize the introduction of any evidence secured in violation of the Constitution of the United States or of the State of Oregon. The state and the defendant shall be permitted to present arguments for or against a sentence of death.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We need not address whether defendant preserved this alleged error at trial, because we hold that defendant's statements were properly admitted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The record also discloses that a second charge was dismissed concurrent to defendant's guilty plea to the firearm charge, which suggests that the plea was the result of a negotiated plea agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. More recently this court has expressed concern that this exception to the hearsay rule raises confrontation clause concerns unless the prosecution is required first to exhaust all reasonable steps to secure the witness's presence at trial, see State v. Smyth, 286 Or 293, 593 P2d 1166 (1979) (applying former ORS 41.900(8)), but that concern is not presented by this case. Here both of the witnesses are deceased.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. UCrJI No. 1003, entitled \"Functions of the Court and Jury,\" states in pertinent part: \"In deciding this case you are to consider all the evidence that you find worthy of belief. It is your duty to weigh the evidence calmly and dispassionately and to decide this case upon its merits. You are not to allow bias, sympathy, or prejudice any place in your deliberations. You should not decide this case on guesswork, conjecture, or speculation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In the prepared jury instructions, as they appear in the trial court file, the word \"sympathy\" is printed in this instruction but it was enclosed in brackets manually by pen. The record does not disclose when the alteration was made, at whose instance it was made, or why it was made.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The state argues that we need not consider this assignment of error on the merits because (1) the preliminary instruction was not prejudicial and thus does not present a cognizable issue; and (2) defendant did not preserve the alleged error. Assuming arguendo that these contentions are wrong, the trial court did not err by giving the challenged instruction because the instruction was proper. See discussion post at 89-92.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In appellate opinions in this state, the instruction cautioning against sympathy almost invariably appears in the context of protecting the defendant from jury sympathy for the victim. See, e.g., State v. Leland, 190 Or 598, 636-37, 227 P2d 785 (1951), aff'd 343 U.S. 790, 72 S Ct 1002, 96 L Ed 1302 (1952) (capital murder, \"gruesome\" photograph of victim); State v. Hill, 49 Or App 297, 300, 619 P2d 671 (1980) (rape victim had epileptic seizure while testifying).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Because defendant does not contend that the trial court ever improperly instructed the jury to disregard any of his mitigating evidence, the Court's language in California v. Brown, 479 U.S. 538, 542-43, 107 S Ct 837, 93 L Ed 2d 934 (1987), is apropos here: \"We also think it highly unlikely that any reasonable juror would almost perversely single out the word 'sympathy' from the other nouns which accompany it in the instruction: conjecture, passion, prejudice, public opinion, and public feeling. Reading the instruction as a whole, as we must, it is no more than a catalog of the kind of factors that could improperly influence a juror's decision to vote for or against the death penalty. The doctrine of noscitur a sociis [he is known by his companions'] is based on common sense, and a rational juror could hardly hear this instruction without concluding that it was meant to confine the jury's deliberations to considerations arising from the evidence presented, both aggravating and mitigating.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Court's seminal capital sentencing cases clearly establish as the primary principle that a capital sentencing scheme, to pass muster under the Eighth Amendment, must channel the sentencer's discretion with objective, rational and narrowing criteria to avoid arbitrary and capricious decisions as to imposition of the death penalty. The dissenters in California v. Brown, supra note 16, at 562 (Blackmun, J., dissenting), pay homage to that. As a corollary of that basic principle, the dissenters, qua majority in Booth v. Maryland, 482 U.S. 496, 508, 107 S Ct 2529, 96 L Ed 2d 440 (1987), hold that \"any decision to impose the death sentence must be, and appear to be, based on reason rather than caprice or emotion.\" Logically, it is completely antithetical to those two basic premises to allow, much less to invite, the jury to make an irrational, emotional capital sentencing decision. The historical pattern of juries according discretionary \"mercy\" to murderers who were sympathetic because they happened to be white and privileged, at the expense of those who were not sympathetic because they happened to be otherwise, is precisely what Furman v. Georgia, 408 U.S. 238, 92 S Ct 2726, 33 L Ed 2d 346 (1972), and its progeny are all about.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Although it appears that defendant's argument is based solely on the Eighth Amendment and that he makes no claim that the challenged instruction was incorrect under Oregon law, it should be noted that this court has held that it is appropriate in a criminal trial, even in a capital case, to instruct the jury to be fair and impartial, and to lay aside sympathy and prejudice during its deliberations. In State v. Srapp, 56 Or 588, 589-90, 109 P 1094 (1910), the defendant was tried for first degree murder, his primary defense was that he was drunk when he killed the victim, and he was found guilty of murder in the second degree. The court summarily rejected his assignment of error on appeal that the trial court erred when it instructed the jury to disregard sympathetic feelings during its deliberations: \"The part of the twentieth instruction in which the jury are cautioned against sympathy for defendant or his relatives, and also against the influence of public prejudice against such crimes or against one charged with a crime of the gravity of this one, and told that it was their sworn duty to try the case according to the law and evidence, and to lay aside both sympathy and prejudice, was evidently fair and impartial, and not an improper instruction.\" 56 Or at 596.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The first paragraph of the quoted instruction correctly restates the second statutory question. See ORS 163.150(1)(b)(B). Defendant does not contend otherwise. The third paragraph is based upon defendant's own requested instruction. Thus, defendant cannot and does not contend that it is erroneous in any respect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Or Const, Art I, ยง 14, provides: \"Offences (sic), except murder, and treason, shall be bailable by sufficient sureties. Murder or treason, shall not be bailable, when the proof is evident, or the presumption strong.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. ORS 135.240(2) provides: \"When the defendant is charged with murder or treason, release shall be denied when the proof is evident or the presumption strong that the person is guilty.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. McGautha was limited to determining whether the procedures that California and Ohio used satisfied due process. McGautha is significant, however, because neither the majority nor the dissents looked to substantive due process as a legitimate means of analyzing the validity of the death penalty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The defendant in Penry was a 22-year-old mentally retarded male with the \"mental age\" of a child six-and-one-half years old. 109 S Ct at 2941, 106 L Ed 2d At 271. A major reason given by the Supreme Court for refusing to constitutionally exempt substantially retarded adults from the death penalty was that the states have not generally excluded retarded people from death penalty exactions and that \"legislation * * * is an objective indicator of contemporary values upon which we can rely.\" Id. at 109 S Ct at 2955, 106 L Ed 2d at 289. Under that line of reasoning, the majority, by drastically altering Oregon's legislation, certainly obscures the usefulness of legislation as an objective indicator of contemporary values.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Spangenberg \u0026 Walsh, Capital Punishment or Life Imprisonment? Some cost Considerations, 23 Loy LAL Rev 45, passim (1989) (reporting several death penalty studies and concluding that \"capital punishment is simply more expensive than life imprisonment\"); see also Gary, The Cost of Taking a Life: Dollars and Sense of the Death Penalty, 18 UC Davis L. Rev 1221, 1269 (1985). Cf. United States General Accounting Office, Criminal Justice: Limited Data Available on Costs of Death Sentences, 4 (Sept. 1989) (noting National Center for State Courts' study that \"concludes that even though many experts believe that it costs more to finance a system in which the death penalty is an option, little empirical data exist that actually compare the cost of a death sentence case with a non-death sentence case\" and that offers a research methodology designed to gather that data.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The state's pathologist testified that she was unable to fix the time or the day of death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority's fifth footnote, however, cites to a Wisconsin decision which the majority finds similar to the question here. 309 Or at 61. In the Wisconsin case, a victim told her psychiatrist that she was \"living in fear\" of her husband and that she felt trapped and resentful in her marriage. No statement that she would be killed was included. No accusatory identification of a future killer was made. The doctor was treating the victim for overweight, smoking, and anxiety neurosis. Admitting the evidence of her declaration, the court simply held that the declaration was within the Wisconsin equivalent of Oregon's OEC 803(4) exception without analysis or citation to authority about the nature of the statement or its effect. State v. Wyss, 124 Wis 2d 681, 370 NW2d 745, 759 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Legislative Commentary on OEC 803(4) warns that \"statements as to fault ordinarily would not qualify under the language of this subsection. Thus, a statement that the declarant was struck by an automobile would not be excluded [from admission in evidence], as touching causation; a statement that the car was driven through a red light [later recounted by the treating doctor] would, as touching on fault.\" Kirkpatrick, supra, at 360. In this context, Mrs. Chatfield's statement would be like saying, \"I am upset because I fear my son-in-law will strike me with his auto,\" offered to prove that her son-in-law drove a hit-and-run auto which killed her two days later. See id at 138 (Supp 1988-1989) (patients' statements \"are admissible under Rule 803(4), only if they were made with an intent to facilitate medical diagnosis or treatment and were in fact reasonably pertinent\"); see also Mayor v. Dowsett, 240 Or 196, 225, 400 P2d 234 (1965).\u003c/span\u003e\n\n",
    "body_length": 167681,
    "citedas": [
      "309 Or. 45",
      "786 P.2d 111"
    ],
    "attorneys": "Timothy P. Alexander, of Timothy P. Alexander, P.C., Beaverton, argued the cause and filed the brief for appellant. Rives Kistler, Assistant Attorney General, Salem, argued the cause for respondent. With him on the brief were Dave Frohnmayer, Attorney General, Virginia L. Linder, Solicitor General, and Janet A. Klapstein, Michael C. Livingston, Brenda J Peterson and Timothy A. Sylwester, Assistant Attorneys General, Salem.",
    "category": [
      "36",
      "78"
    ],
    "judges": "In Banc. Jones, J. Fadeley, J., filed a dissenting opinion in which Linde, J., joined.",
    "citation_count": 16
  }
}
