{
  "id": "k7PPTGYBTlTomsSBvd8T",
  "document": {
    "title": "08/24/66 CITY GAYLORD v. GAYLORD CITY CLERK",
    "full_title": "CITY OF GAYLORD v. GAYLORD CITY CLERK",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1966-08-24T00:00:00.000Z",
    "docket": "Docket No. 51,239",
    "body": "Complaint by City of Gaylord for a writ of mandamus to compel Gladys Beckett, Gaylord City Clerk, to comply with directions of Gaylord City Council, directing her to execute and certify an agreement under the industrial development revenue bond act of 1963. The Attorney General, Frank J. Kelley, intervened in the cause, and the Governor, George Romney, requested that certain questions in the case be certified to the Supreme Court as permitted by GCR 1963, 797. Request granted and questions certified by the trial Judge to this Court.\n\nOn May 8, 1963, the legislature enacted PA 1963, No 62 (CL 1948, § 125.1251 et seq. [Stat Ann 1965 Cum Supp § 5.3533(21) et seq. ]), described as the \"industrial development revenue bond act of 1963.\" It permits Michigan municipalities to issue tax-exempt municipal bonds to finance acquisition of industrial buildings.\n\nThe city council of Gaylord approved such a bond issue. It contracted with United States Plywood Corporation for it to purchase land and construct an industrial plant. Gaylord is to finance purchase of these facilities by selling \"city of Gaylord, Michigan, industrial building revenue bonds.\" The facilities are then to be sold to the city with a lease back to the corporation for 25 years at a rental sufficient to pay principal and interest on the bonds. At the end of 25 years, the corporation has the option of purchasing the facilities for $1. The bonds are to recite:\n\n\"This bond and the interest thereon are payable solely from the revenues derived from the facilities * * * and does not [in any way] * * * obligate * * * the city to levy * * * any form of taxation whatever for the payment of such principal and interest.\"\n\nBecause section 103 of the internal revenue code of 1954 (26 USCA, § 103[1]) grants a tax exemption to the income from municipal bonds, the net result of this transaction is that the city of Gaylord lends its tax-free status to the corporation so that the interest on what would otherwise be a private bond issue becomes tax-free.\n\nThe plywood plant has been built, but defendant city clerk refused to complete the transaction. The city brought mandamus to compel performance. The case was certified directly to this Court, by virtue of GCR 1963, 797, at the request of Governor George Romney. The questions are stated in this opinion as certified to us by the circuit Judge. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI.\n\nIs Act 62 of 1963 unconstitutional because its title is deficient under the terms of article 4, § 24, of the Michigan Constitution (1963)?\n\nDefendant contends that Act No 62 violates article 4, § 24, of the Michigan Constitution of 1963, which provides:\n\n\"No law shall embrace more than one object, which shall be expressed in its title.\"\n\nJustice Thomas M. Cooley has stated the principle to be followed in applying this section:\n\n\"It ought to be construed reasonably, and not in so narrow and technical a sense as unnecessarily to embarrass legislation.\" Ryerson v. Utley, 16 Mich 269, 277, citing People, ex rel. Drake, v. Mahaney, 13 Mich 481, 494.\n\nThe object of Act No 62 is to enable municipalities to attract industry by acquiring and financing industrial facilities through revenue bonds. The title reads:\n\n\"An act relating to industrial development; to authorize municipalities to acquire industrial buildings and sites; to provide for the financing of such buildings by the issuance of revenue bonds; to provide the terms and conditions of such bonds; and to prescribe the powers and duties of the municipal finance commission.\"\n\nThe title informs the reader of the object of the act. \"The title to an act is good if it fairly indicates the general subject matter covered by the act.\" City of Bay City v. State Board of Tax Administration, 292 Mich 241, 249.\n\nII.\n\nAre the improvements for which bonds are to be issued works of internal improvement for private purposes prohibited by article 3, § 6, of the Michigan Constitution (1963)?\n\nArticle 3, § 6, of the Michigan Constitution (1963) provides:\n\n\"The State shall not be a party to, nor be financially interested in, any work of internal improvement, nor engage in carrying on any such work, except for public internal improvements provided by law.\"\n\nThe reasons for section 6 have been fully documented. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Briefly, in 1835 the people of Michigan sought a prosperity they thought could be brought about by improved lines of communication. They directed the legislature to engage in \"Internal improvement * * * in relation to roads, canals and navigable waters.\" Constitution of 1835, art 12, § 3. Shortly afterward, the nation underwent a financial crisis. Oppressive taxation to service the State debt resulted from many bond issues that had been floated to finance \"internal improvements.\" Article 14, § 9, of the Constitution of 1850 provided:\n\n\"The State \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e shall not be a party to, nor interested in, any work or internal improvement.\"\n\nThis prohibition, with modifications in language, was carried into the 1908 and 1963 Constitutions. Const 1908, art 10, § 14; Const 1963, art 3, § 6. It has been repeatedly held, however, that it does not include self-liquidating bonds because they do not obligate the general taxing power. Gilbert v. City of Traverse City, 267 Mich 257, 260, 261; Attorney General, ex rel. Eaves, v. State Bridge Commission, 277 Mich 373, 383; Oakland County Drain Com'r v. City of Royal Oak, 306 Mich 124, 142; City of Dearborn v. Michigan Turnpike Authority, 344 Mich 37, 74, 75.\n\nThe law of these cases was brought to the attention of the delegates to the 1961 convention by a member of the committee that drafted section 6. He stated:\n\n\"Neither the State nor any local unit of government is prohibited by section 14 of article 10 [1908 Constitution] from engaging in self-liquidating projects. These projects, of course, are defined, generally speaking, as projects which must be paid for out of the revenue which the project itself produces, such as is established by revenue bond that I am sure practically all of the delegates in this convention are familiar with. This section, of course, does not prohibit engaging in that type of activity.\" 2 Official Record, Constitutional Convention of 1961, p 2311.\n\nA sponsor of a minority amendment which later was substantially adopted by the convention as section 6 stated:\n\n\"Now, let us look upon its operation [article 10, § 14 (1908 Const)] as a prohibition against government ventures in, hopefully, self-supporting and self-liquidating projects. One, it is no longer very effective in this direction.\" 2 Official Record, (supra) , p 2317.\n\nWhether the exception as to revenue bonds was approved or disapproved, it was a recognized fact. The delegates froze that exception into section 6 by their retention of substantially the same language which, in prior Constitutions, had been construed to allow it. See Const 1850, art 14, § 9; Const 1908, art 10, § 14.\n\nDefendant insists that we look at the plain language of the Constitution. It prohibits not only direct financial involvement by the State but also prohibits the State from being a \"party\" to works of internal improvement. The State, through the city of Gaylord, is a \"party\" but the prohibition against the State being a \"party\" was present when this Court found an exception as to self-liquidating bonds. Const 1850, art 14, § 9; Const 1908, art 10, § 14. Since that exception was known to the delegates, in the absence of some specific limitation by them of the same, it must be considered still valid.\n\nThis project might also escape classification as an internal improvement as not being an artery of commerce. See OAG 1963-1964, pp 75-78. Whether the meaning of \"internal improvement\" should be so limited need not be decided in light of our holding as to self-liquidating bonds.\n\nIII.\n\nWill the issuance of bonds under Act 62 of 1963 constitute the granting of the credit of the city of Gaylord, an agency of the State, for unauthorized purposes as prohibited by article 9, § 18, and article 7, § 26, of the Michigan Constitution (1963)?\n\nArticle 9, § 18, of the 1963 Constitution provides:\n\n\"The credit of the State shall not be granted to, nor in aid of any person, association or corporation, public or private, except as authorized in this Constitution.\" (Emphasis supplied.)\n\nArticle 7, § 26 (Const 1963), provides:\n\n\"Except as otherwise provided in this Constitution, no city or village shall have the power to loan its credit for any private purpose or, except as provided by law, for any public purpose.\" (Emphasis supplied.)\n\nAn exception permitted by section 18 \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e is contained in section 26. We confine our inquiry to section 26. Defendant admits that this Court has, on several occasions, held that self-liquidating projects do not involve a granting of credit. Attorney General, ex rel. Eaves, v. State Bridge Commission, supra; Oakland County Drain Com'r v. City of Royal Oak, supra. She seeks to delimit this line of cases, however, by pointing out that each involved a clear, undisputed public purpose. Under section 26, if the bond issue is not a loan of credit, the question of public purpose is not reached.\n\nDefendant cites the banking laws of Connecticut, Massachusetts, and New York \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e to the effect that any default by a municipality for a fixed period of years preceding a bond issue shall bar banks and financial institutions in those States from buying the general obligation bonds of that municipality. Defendant also contends that if the municipality is negligent in issuing the bonds it may be held in breach of an implied covenant of good faith (see Armstrong, \"Municipal Inducements\" -- The New Mexico Commercial and Industrial Project Revenue Bond Act, 48 Cal L Rev 58, 62, n 19 [1960]) and that misrepresentation, implied covenant of warranty, and breach of trust are additional theories by which the general taxing power of the municipality might be reached. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e (See Fordham, Revenue Bond Sanctions, 42 Col L Rev 395, 409-419 [1942]; The \"Public Purpose\" of Municipal Financing for Industrial Development, 70 Yale L Rev 789, 793 [1961].)\n\nThe dangers presented by these various contentions exist as to all municipal revenue bonds, not just industrial revenue bonds. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e However persuasive defendant's arguments might be upon first impression, if we were to characterize industrial revenue bonds as a loan of credit, such a holding would have to extend to all types of revenue bonds. The delegates to the 1961 Constitutional Convention brought the lending of credit provision into the 1963 Constitution against a line of decisions which flatly stated that revenue bonds are not within the prohibition of lending of credit. See Attorney General, ex rel. Eaves, v. State Bridge Commission, supra; Oakland County Drain Com'r v. City of Royal Oak, supra; City of Dearborn v. Michigan Turnpike Authority, supra, p 59. These decisions have created for the constitutional language a meaning that excludes revenue bonds from the definition of a loan of credit.\n\nIV.\n\nDoes the financing proposed leave open the possibility that tax moneys of the city may be diverted for nonpublic purposes as prohibited by article 7, § 21, of the Michigan Constitution (1963)?\n\nWe would state the above question as follows: Does Act No 62 and the program of the city of Gaylord thereunder exhibit a public purpose? It is the crucial question in this case and one of first impression. Unlike the questions thus far discussed, it is not possible to point to a specific provision of the 1963 Constitution that might be construed to permit the city of Gaylord to act if a public purpose is present or to prohibit it from acting absent such purpose.\n\nNevertheless, the theme of public purpose runs through the Constitution. As we have seen, article 3, § 6, specifically excepts from its prohibitions \"public internal improvements provided by law\", and article 7, § 26, prohibits the lending of the credit of any city or village \"except as provided by law, for any public purpose.\"\n\nArticle 7, § 21, reads:\n\n\"The legislature shall provide by general laws for the incorporation of cities and villages. Such laws shall limit their rate of ad valorem property taxation for municipal purposes, and restrict the powers of cities and villages to borrow money and contract debts. Each city and village is granted power to levy other taxes for public purposes, subject to limitations and prohibitions provided by this Constitution or by law.\"\n\nArticle 4, § 51 (Const 1963), provides:\n\n\"The public health and general welfare of the people of the State are hereby declared to be matters of primary public concern. The legislature shall pass suitable laws for the protection and promotion of the public health.\"\n\nThis new section, together with the traditional public policy of this State, must be held to limit the powers of the legislature and of government generally to such legislative acts and such governmental powers as exhibit a public purpose. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nDefendant contends that the location of a manufacturing plant in the Gaylord area is not a public purpose because the plant is primarily to make a profit for its stockholders; that any benefit the area receives is merely incidental; that such a plant will create additional public needs for schools, streets, sewers, and water facilities which will increase the tax burden; and that, if the plant shuts down, the public welfare load would be substantially increased.\n\nPlaintiff contends that there is a definite public interest in providing and maintaining steady employment; that under the stipulated facts, as a direct result of the location of the plywood plant in the Gaylord area, there is now only one vacant building on Main street out of 14 vacant not long ago; that it is extremely difficult to rent store space; that a housing shortage exists; commercial and residential growth has resulted; the corporation will employ up to 200 persons in the plant and an additional 100 or 150 persons in outside activity.\n\nIt is further stipulated that, based upon the United States Chamber of Commerce estimate prepared for the small business administration, the expected impact of the manufacturing plant on the economy of the city of Gaylord is reflected in the following chart:\n\n\"Chart\n\n\"What Each 100 Jobs Means to a Community.\n\n\"What 100 New Factory Workers Bring to a Town:\n\n\"359 More People\n\n\"91 More School Children\n\n\"$710,000 More Personal Income Per Year\n\n\"100 More Households\n\n\"$229,000 More Bank Deposits\n\n\"3 More Retail Establishments\n\n\"97 More Passenger Cars Registered\n\n\"65 More Employed in Nonmanufacturing\n\n\"$331,000 More Retail Sales Per Year.\"\n\nWhether the rosy picture of the future depicted by plaintiff may prove to be a chimera or reality, this Court can neither Judge nor prognosticate. There is nothing in the contract between United States Plywood and the city of Gaylord to guarantee either result. Plywood is not obligated to provide any given number of jobs for any period of time. It does not undertake to run the plant a single day. If, because of technological advances or for any other reason, it should elect to close the plant, there is nothing in its contract to prevent it from doing so. Nevertheless it is Plywood's money alone that was laid on the line to construct this plant and it would seem to be a reasonable assumption that operation of it will follow.\n\nAs we have noted, insofar as Plywood is concerned, it achieves by this transaction a tax-exempt status for interest on bonds issued in the name of the city which Plywood alone is in effect obligated to redeem. Gaylord was assured only that a manufacturing plant would be built in a township adjacent to the city and that the rental for the plant would pay off the bonds.\n\nIn casting up the credits and the debits, from present view, the probabilities would seem to favor the credits -- that is to say, employment and other benefits to the community and the area as opposed to additional costs for schools, public utilities, and the hazard of unemployment. Such an assessment is buttressed by the fact that the transaction is subject to the scrutiny and approval of the Michigan municipal finance commission.\n\nNumerous cases from other jurisdictions deal with the problem of public purpose. The weight of authority \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e upholds municipal industrial aid financing as having a public purpose. For example, in the Oklahoma case of Harrison v. Claybrook (1962), 372 P2d 602, 605, it is stated:\n\n\"That the particular function, or purpose, involved is a 'public' one cannot be seriously doubted. We think the court in Faulconer v. City of Danville, 313 Ky 468 (232 SW2d 80, 83), was particularly articulate on this subject when it said therein:\n\n\"'The consensus of modern legislative and judicial thinking is to broaden the scope of activities which may be classed as involving a public purpose. * * * It reaches perhaps its broadest extent under the view that the economic welfare is one of the main concerns of the city, State, and the Federal governments.'\"\n\nSuch cases, however, are of limited assistance. The question must be assessed in the light of our constitutional provisions and the history of our State.\n\nMichigan cases have steadily broadened the concept of public purpose. In Miller v. Michigan State Apple Commission, 296 Mich 248, a State tax on apples, which was used to promote sale of Michigan apples, was upheld because stimulation of the State's apple industry would be beneficially reflected throughout the State. In Hays v. City of Kalamazoo, 316 Mich 443 (169 ALR 1218), the expenditure of general funds of a city for membership in the Michigan Municipal League, a private nonprofit corporation established to advise and lobby for cities and villages in the State, was upheld as being for a public purpose. In Sommers v. City of Flint, supra, a transfer of city property to the Federal government, without consideration, for use as an armory was upheld, based upon mutuality of obligation between the United States and the city in the field of national defense.\n\nIn determining what constitutes public purpose the following statement contained in Allydonn Realty Corporation v. Holyoke Housing Authority, 304 Mass 288, 292 (23 NE2d 665), is much quoted:\n\n\"Some of the factors which the cases suggest as proper to be considered are these: Whether the benefit is available on equal terms to the entire public in the locality affected; whether the service or commodity supplied is one needed by all or by a large number of the public; whether the enterprise bears directly and immediately, or only remotely and circumstantially, upon the public welfare; whether the need to be met in its nature requires united effort under unified control, or can be served as well by separate individual competition; whether private enterprise has in the past failed or succeeded in supplying the want or in eradicating the evil; whether, insofar as benefits accrue to individuals, the whole of society has an interest in having those individuals benefited; whether a proposed extension of governmental activity is in line with the historical development of the Commonwealth and with the general purpose of its founders; whether it will be necessary to use public ways or to invoke the power of eminent domain; whether a special emergency exists, such as may be brought about by war or public calamity. It is hardly necessary to say that the foregoing considerations are in no sense to be regarded as exclusive of others, and that great weight or little or no weight may be attached to some of them according to the presence or absence of others, or of still other conditions not hereinbefore enumerated.\"\n\nIn Hays v. City of Kalamazoo, supra, pp 453, 454, this Court quoted with approval from 37 Am Jur, Municipal Corporations, § 120, p 734:\n\n\"'A public use changes with changing conditions of society, new appliances in the sciences, and other changes brought about by an increase in population and by new modes of transportation and communication. The courts as a rule have attempted no judicial definition of a public as distinguished from a private purpose, but have left each case to be determined by its own peculiar circumstances. Generally, a public purpose has for its objective the promotion of the public health, safety, morals, general welfare, security, prosperity, and contentment of all the inhabitants or residents within the municipal corporation, the sovereign powers of which are used to promote such public purpose. The phrase \"municipal purpose,\" used in the broader sense, is generally accepted as meaning public or governmental purpose as distinguished from private. The modern trend of decision is to expand and liberally construe the term \"public use\" in considering State and municipal activities sought to be brought within its meaning. The test of public use is not based upon the function or capacity in which or by which the use is furnished. The right of the public to receive and enjoy the benefit of the use determines whether the use is public or private.'\"\n\nIt can scarcely be questioned that the benefits resulting from a plywood plant that are conjured by plaintiff would be general to the public in the Gaylord area, thereby meeting the test of public use set forth in Hays v. City of Kalamazoo, supra. The legislature, in enacting Act No 62, has concluded that the public health and welfare will be served. The act is constitutional as exhibiting a public purpose. In coming to this Conclusion, we have taken particular note of the mandate of article 7, § 34, a new provision of the 1963 Constitution which states, in part, as follows:\n\n\"The provisions of this Constitution and law concerning counties, townships, cities, and villages shall be liberally construed in their favor.\"\n\nV.\n\nDoes Act No 62 of 1963 surrender or avoid the taxing power of the township of Bagley in which the plant will be located, contrary to the provisions of article 9, § 2, of the Michigan Constitution (1963), in that it does away with the lien for taxes against the industrial plant and site?\n\nAct No 62 provides that the lessee will be subject to ad valorem property taxation, but that a lien will not attach to the property by virtue of that tax. Defendant contends that this violates article 9, § 2, of the Constitution of 1963, which provides:\n\n\"The power of taxation shall never be surrendered, suspended or contracted away.\"\n\nA lien is not an essential element of the power of taxation. See Hellerstein, State and Local Taxation, pp 15-20 (1952). Unless a taxing statute expressly so provides, taxes do not constitute a lien on property. Tousey v. Post, 91 Mich 631, 634; 84 CJS, Taxation, § 585, p 1180.\n\nSection 11 of Act No 62 parallels PA 1953, No 189, as amended (CLS 1961, §§ 211.181, 211.182 [Stat Ann 1960 Rev § 7.7(6) and Stat Ann 1965 Cum Supp § 7.7(5)]). The purpose in both instances is to insure that persons leasing normally tax-exempt property for profit-making purposes do not secure an unfair advantage by avoiding taxation. See United States v. City of Detroit, 345 Mich 601, 610; Township of Muskegon v. Continental Motors Corporation, 346 Mich 218, 223; and Rockwell Spring \u0026 Axle Company v. Romulus Township, 365 Mich 632, 637.\n\nVI.\n\nIs Act No 62 of 1963 unconstitutional in that it does not contain a restriction on the power of the city of Gaylord granted therein to borrow money and contract debts, contrary to the provisions of article 7, § 21, of the Michigan Constitution (1963)?\n\nArticle 7, § 21, of the 1963 Constitution provides:\n\n\"The legislature shall provide by general laws for the incorporation of cities and villages. Such laws shall * * * restrict the powers of cities and villages to borrow money and contract debts.\"\n\nDefendant contends that since Act No 62 does not contain a restriction on the power of the city to borrow it is invalid. The self-liquidating aspect of these bonds excepts them from the constitutional language. In re Brewster Street Housing Site, 291 Mich 313, 341, 342. For an extended Discussion of this exception, see Young v. City of Ann Arbor, 267 Mich 241, 248-254. Because of the reasons expressed in Young, Act No 62 does not violate the debt restrictions of article 7, § 21.\n\nVII.\n\nIs Act No 62 of 1963 deficient as ambiguous and incomplete because:\n\nA. It does not provide that the bonds must be sold at public sale?\n\nB. It permits a referendum on the question of the issuance of the bonds but provides no means for giving notice of the right of referendum?\n\nA.\n\nDefendant's contentions here go to the provision in the municipal finance act for the public sale of mortgage revenue bonds issued by a municipality. CLS 1961, § 133.2 (Stat Ann 1958 Rev § 5.3188[7]). Act No 62 is silent with regard to the manner in which bonds are to be sold. However, section 9(2) of Act No 62 states that when issuing bonds a municipality may authorize additional bonds for contemplated future improvements and place them in escrow to be \"negotiated\" later.\n\nThe legislature may place restrictions on the manner in which bonds are to be sold. See 43 Am Jur, Public Securities and Obligations, § 126, p 373, and 15 McQuillin, Municipal Corporations (3d ed), § 43.65, p 589. The normal purpose of a public sale is to assure the best price, but here the city is unconcerned with price. Price is of concern only to the corporation.\n\nSection 13 of Act No 62 specifically states that the municipal finance commission shall determine \"whether the bonds conform to the provisions of this act.\" (Emphasis supplied.) While bonds under Act No 62 may not be issued without the approval of the municipal finance commission, they are not made subject to the provisions of the municipal finance act, only the provisions of Act No 62. That act does not require public sale. The legislature was free to make such a requirement or not. The act is not deficient in this regard.\n\nB.\n\nSection 12 of Act No 62 provides for a right of referendum but makes no provision as to how notice should be given to the electors of that right. The legislature is not required to provide any right of referendum. Consequently, the act is not invalid for failure to particularize the method of notice. The city exercised its discretion in giving notice to the electorate. The council's action was published in the local newspaper. No petition for referendum was filed. No abuse of discretion is shown.\n\nThe referendum provision contained in the homerule act (CLS 1961, § 117.5 [Stat Ann 1965 Cum Supp § 5.2084(g)]) is substantially different from that found in Act No 62. Only the referendum provision in Act No 62 is applicable to this proceeding.\n\nVIII.\n\nIs the proposed bond issue in conflict with Act No 62 of 1963 or with applicable provisions of the city charter because:\n\nA. The financing does not meet the requirements of the act in that:\n\n(1) No provision is made for a depreciation account?\n\n(2) Operation and maintenance expenses are to be met by the lessee rather than the city, with the result that excess funds for that purpose are to be returned to the lessee rather than credited to a depreciation account?\n\n(3) The financing calls for the naming of a trustee although the industrial plant and site are not to be mortgaged?\n\nB. The financing does not comply with provisions of the Gaylord city charter in that:\n\n(1) There will be no provision for competitive construction bids as required by section 16.6 of the city charter?\n\n(2) The financing may contemplate the city's engaging in a business enterprise requiring an investment of money in excess of 10 cents per capita but without the approving vote of the electors of the city thereon, as required by section 15.2 of the city charter and section 5(e) of the city home-rule act?\n\n(3) The financing may not comply with the terms of sections 10.7 and 10.9 of the city charter relative to the means of collection and payment of city funds?\n\n(4) The financing may cause the city to exceed its debt limit as specified in section 12.7 of the city charter?\n\nA.\n\n(1) Section 3(c) of Act No 62 requires that the agreement \"provide * * * an adequate depreciation account.\" CL 1948, § 125.1253 (Stat Ann 1965 Cum Supp § 5.3533[23]). (Emphasis supplied.) Plaintiff admits no depreciation account has been created. The rentals are programmed to amortize the cost of the plant and site over 25 years. The corporation can then purchase the facility for $1. Since the rentals will amortize the cost of the plant, and the cost basis will be zero at the end of the lease, this provides a built-in \"depreciation account\" which is adequate.\n\n(2) The fact that operation and maintenance expenses are to be met by the lessee rather than the city out of a segregated fund does not bring the proposed bond issue in conflict with Act No 62. Section 3(c) of Act No 62 does not require the establishment of a separate operation and maintenance fund. It states:\n\n\"The agreement shall provide that the rents to be charged for the use of the industrial building shall be fixed and revised from time to time so as to produce income and revenues sufficient to provide for * * * the operation and maintenance of the industrial building.\"\n\nSince the lessee will pay for operation and maintenance, the required provision has been met. Since the rentals do not include this cost, no money need be segregated in an operating and maintenance fund. Section 8(1) of Act No 62 does not require that sums accumulated in an operating and maintenance fund be transferred into the depreciation account, but provides that they \"may\" be transferred. These features of the proposed financing do not conflict with Act No 62.\n\n(3) The proposed bond issue is not in conflict with Act No 62 although the issue calls for the naming of a trustee and does not provide for a mortgage on the facility. Section 5 of Act No 62 recognizes the alternative of either a mortgage or a trustee for the bondholders. CL 1948, § 125.1255 (Stat Ann 1965 Cum Supp § 5.3533 [25][1], [2], [3]). Further, that section is permissive and provides only that the resolution authorizing the bond issue \"may a mortgage or deed of trust\" to secure principal and interest. The city council was not required to have the bond issue secured by a mortgage nor was it prohibited from providing for a trustee for the bondholders.\n\nB.\n\n(1) The failure of the proposed financing agreement to make provision for competitive bids does not violate section 16.6 of the charter of the city of Gaylord. The plywood plant is now in existence. Section 16.6 is silent as to the acquisition of an existing structure. It provides:\n\n\"Before making any purchase or contract for supplies, materials, equipment, or contractual services, opportunity shall be given for competition.\" (Emphasis supplied.)\n\nSection 3(a) of Act No 62 allows a municipality to acquire an industrial facility by \"gift or purchase.\" Act No 62 controls. City of Hazel Park v. Municipal Finance Commission, 317 Mich 582.\n\n(2) Section 15.2 of the charter of the city of Gaylord requires that the city have a 3/5 approval of the electors before it engages in any business enterprise requiring an investment of money in excess of 10 cents per capita. An identical requirement is found in CLS 1961, § 117.5(e) (Stat Ann 1965 Cum Supp § 5.2084). The city's function in this case is merely to furnish its name to a bond issue. Such function does not constitute engaging in a business enterprise.\n\n(3) Section 10.7 of the city charter of Gaylord provides:\n\n\"All * * * other moneys regardless of source, accruing to the city shall be collected by the city clerk who shall in all cases give receipts therefor.\"\n\nThis provision is contradictory to section 5(1)(a) of Act No 62, which provides:\n\n\"Any resolution authorizing the issuance of bonds under this act may contain covenants as to * * * the use and Disposition of the rentals from the industrial building.\"\n\nRead as a whole, Act No 62 was intended to provide a particular means for the collection and payment of funds involved in industrial financing. See, especially, section 3(e), which provides:\n\n\"Any municipality may * * * sell and convey the industrial building, including without limitation the sale and conveyance thereof subject to a mortgage.\"\n\nSection 10.7 was designed for the normal fiscal activities of the city. To the extent that it is in conflict with the purposes of Act No 62, it is not applicable here.\n\nSection 10.9 of the charter provides a precise method by which claims and demands against the city are to be met. This bond issue is self-liquidating. No \"claims and demands\" will arise from the proposed scheme of financing. Section 10.9 does not, therefore, invalidate the bond issue.\n\n(4) Section 12.7 of the city charter of the city of Gaylord provides:\n\n\"The city may not incur indebtedness by the issue of bonds or otherwise, in any sum which * * * shall exceed 10 per centum of the assessed valuation of the real and personal property within the city.\"\n\nThis bond issue is in excess of the 10 percent limitation. The rationale which supports the exception noted in article 7, § 21, of the 1963 Michigan Constitution is applicable here. See (infra). The indebtedness contemplated by section 12.7 is general obligation indebtedness and not self-liquidating indebtedness required by Act No 62.\n\nConclusion.\n\nSince the questions certified to this Court by the circuit court for the county of Otsego have been answered in favor of plaintiff, a writ of mandamus will issue to compel defendant to perform her duties.\n\nNo costs, a public question being involved.\n\nAddendum.\n\nAdams, J. This addendum is written in reply to the opinion of Justice Souris in this case. On July 19, 1966, this Court convened for the purpose of hearing the response of counsel to the following communication from the clerk of the Court:\n\n\"Confirming my telephone conversation earlier today, please be advised that the Supreme Court has instructed me to request that you appear before the Court on Tuesday, July 19, at 11:30 a.m., prepared to discuss whether the following question ought to be certified and briefed.\n\n\"The question referred to is as follows: Should this proceeding be remanded to the trial court for supplementary certification of the questions designed to test the constitutional validity of PA 1963, No 62, against the limitations on legislative power contained in the 1908 Constitution, then still in effect?\"\n\nAt the Conclusion of the session, all counsel were asked whether, in their opinion, it was necessary that further questions be certified or further briefs be submitted. Counsel stated that further briefing was unnecessary and that the case could stand on the questions submitted.\n\nThis might be sufficient reason to decline to pass upon the questions raised by Justice Souris. There is, however, a more fundamental reason. The Michigan Constitution of 1963, art 3, § 7, under the heading \"General Government\", provides:\n\n\"The common law and the statute laws now in force, not repugnant to this constitution, shall remain in force until they expire by their own limitations, or are changed, amended or repealed.\"\n\nThe above provision has been shifted in the 1963 Constitution from its former position in the schedules of previous Constitutions. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Under Schedule and Temporary Provisions, it is further provided:\n\n\"Sec. 1. The attorney general shall recommend to the legislature as soon as practicable such changes as may be necessary to adapt existing laws to this constitution.\"\n\nNo Michigan cases have considered the import of article 3, § 7, or of the similar provisions of other Michigan Constitutions. In Dewar v. People, 40 Mich 401 (29 Am Rep 545), the city charter enacted in 1873 empowered the common council to license and regulate saloons, restaurants, and billiard rooms. At the time the charter was granted by the legislature, the State Constitution provided that the legislature should not pass any act authorizing the grant of a license for the sale of intoxicating liquors. The constitutional provision was repealed and the city then passed an ordinance that in effect provided for licensing liquor establishments. In holding that the ordinance could not be sustained, the Court said:\n\n\"The legislature of 1873 had no power, under the Constitution as it then was, to authorize such licenses, and it is not presumable that any unconstitutional power was intended to be exercised in granting the charter. But if the charter at that time did not confer or attempt to confer the authority, neither does it do so now. The meaning of the charter is the same to-day that it was when adopted, and it cannot be affected and enlarged by any subsequent change in the Constitution. The intent to be sought for in the charter is the intent of the body which passed it, namely, the legislature of 1873; and that was clearly not an intent to authorize the licensing of sales of intoxicating drinks.\"\n\nDewar did not involve construction of the provision in the 1850 Michigan Constitution with regard to laws \"in force\" remaining in force. All Dewar decided was that the removal of a constitutional prohibition on the legislature did not have retroactive effect on previous legislative action so as to enlarge the legislative grant of authority beyond what the legislature had the power to do when it acted.\n\nIn Village of Mt. Pleasant v. Vansice, 43 Mich 361 (38 Am Rep 193), the defendant was fined for violation of a village ordinance forbidding the sale of liquor and providing that violations of the ordinance were misdemeanors. The Court said: (p 363)\n\n\"In the first place the general act referred to nowhere assumes to delegate the power to a village council to ordain misdemeanors.\"\n\nThe Court found (citing Dewar) that, since the legislature was forbidden to make laws authorizing the grant of a license at the time the incorporating act was passed, the legislature could not give that power to the village. The elimination from the Constitution of the prohibition did not change the meaning of the law from what it was at the time of enactment.\n\nIn Dullam v. Willson, 53 Mich 392 (51 Am Rep 128), it was held that a statute, purporting to give the governor power to remove public officers for misconduct, void for repugnancy to the Constitution which had vested no judicial power in the governor, was not validated by an amendment to the Constitution giving him the power of removal. Justice Champlin wrote: (p 398)\n\n\"The information alleges that the removal was made in pursuance of the statute; and from the fact that the executive order removing the respondent follows the language of the statute instead of the Constitution, and fills the vacancy until the next session of the legislature, instead of the unexpired term, I am convinced that the action was had under the statute. But if the power exists under the Constitution, it is immaterial that a misrecital is made as to its source, and would not invalidate the exercise of the power. I am satisfied that the statute furnishes no valid basis for the power of removal, because repugnant to the Constitution of 1835, which vested no judicial power in the governor. The statute, being void, was not validated by the amendment of 1862, and the question depends solely upon the constitutional amendment of 1862.\" (Emphasis supplied.)\n\nNothing was said in the amendment of 1862 \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e with regard to its effect on prior laws nor did it purport in any way to validate a prior law.\n\nSeneca Mining Company v. Secretary of State, 82 Mich 573 (9 LRA 770), involved passage by the legislature of PA 1889, No 129, authorizing the renewal of a corporate charter. An amendment to the Michigan Constitution passed at the 1889 April election eliminated a former limitation on the authority of the legislature to authorize such renewals. The Court said: (p 575)\n\n\"Without the authority conferred upon the legislature by this amendment to the Constitution, the legislature would have no authority to authorize the extension of corporate existence of corporations such as this, as was held in Attorney General v. Perkins, 73 Mich 303. The important question which is therefore presented is, when did the amendment adopted by the electors in April, 1889, take effect as a part of the Constitution?\"\n\nThe Court held the amendment took effect prior to the legislative enactment and, therefore, the renewal was authorized. Once again, the case does not involve the construction of the laws \"in force\" language of the Constitution but, rather, the construction of amendments to the Constitution.\n\nIn People v. Frencavage, 233 Mich 369, defendant had first been convicted in 1921 and sentenced to the Michigan reformatory. While out on parole, he was arrested on another offense and sentenced to Marquette prison. This conviction was vacated because of an invalid information. He was then brought back to Kent county under an 1861 law that had been declared unconstitutional. He was recommitted to the Michigan reformatory for his unexpired term under the first conviction. The Court said: (pp 371, 372)\n\n\"The portions of this legislation dealing with procedure were held to be unconstitutional in People v. Moore, 62 Mich 496. If these provisions were beyond the power of the legislature to enact at the time they were enacted, it is obvious that a change in the Constitution (PA 1903, p 452) did not make them valid without re-enactment.\"\n\nAn amendment to the 1850 Constitution in 1903 did not provide for validation of the 1861 act, but merely authorized procedures for retaking and returning convicts on parole. Since the 1861 act had been declared unconstitutional prior to adoption of the 1908 Constitution and was not validated by the 1903 amendment to the 1850 Constitution, it was not \"in force\" when the 1908 Constitution was adopted.\n\nToole v. State Board of Dentistry, 300 Mich 180, involved an attack upon a law that had been submitted to a referendum vote. A constitutional provision required that the law be printed on the ballot. It was not so printed in machine precincts. The Constitution was later amended to allow a statute subject to referendum to be posted in the polling place rather than printed. The Court said: (p 184)\n\n\"This, of course, did not have retroactive effect, and the ballot prepared for use on the voting machines did not comply with the then command of the Constitution.\"\n\nThe Constitution required a certain procedure which was not followed. The amendment to the Constitution, adopted after the referendum, did not attempt to validate the procedure used at that election but, rather, authorized a new procedure. The election was tested by the procedure in effect when it was held.\n\nIt will be seen that, while the above cases deal with the effect of an amendment to the Constitution upon legislation, no case considered the effect of the laws \"in force\" provisions of any Michigan Constitution. Unfortunately, the constitutional debates are not helpful in construing the meaning of the laws \"in force\" provisions. However, if the language does not result in validating laws in effect at the time a new Constitution is adopted (save for those repugnant to it), each of Michigan's earlier Constitutions continues to have life and an effect upon the laws of this State even though the manifest intention of the authors of each Constitution was to replace the old with the new. The result would be that any law enacted under a previous Constitution would first have to be tested for constitutionality under that Constitution, then under ensuing Constitutions, and finally under the 1963 Constitution. Under such a rule, a law might have to be reviewed for constitutionality under all four Michigan Constitutions before its validity is finally established. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAs somewhat indicative of the intention of the framers of the 1963 Constitution, it may be noted that the words \"provided by law\" or words to similar effect are used throughout the document and with much greater frequency than in earlier Constitutions. By way of example, the following parallel provisions are of interest:\n\n1908 1963\n\nart 2, § 13. art 1, § 14.\n\n\"The right of trial by jury shall \"The right of trial by jury\n\nremain, but shall be deemed to shall remain, but shall be waived\n\nbe waived in all civil cases unless in all civil cases unless demanded\n\ndemanded by one of the parties by one of the parties in the\n\nin such manner as shall be pre- manner prescribed by law. In all\n\nscribed by law.\" civil cases tried by 12 jurors a\n\nverdict shall be received when 10\n\njurors agree.\"\n\nart 5, § 39. art 4, § 35.\n\n\"All laws enacted at any ses- \"All laws enacted at any ses-\n\nsion of the legislature shall be sion of the legislature shall be\n\npublished in book form within published in book form within\n\n60 days after the final adjourn- 60 days after final adjournment\n\nment of the session, and shall be of the session, and shall be dis-\n\ndistributed in such manner as tributed in the manner provided\n\nshall be provided by law. The by law. The prompt publication\n\nspeedy publication of such judi- of judicial decisions shall be pro-\n\ncial decisions as may be deemed vided by law. All laws and ju-\n\nexpedient shall also be provided dicial decisions shall be free for\n\nfor by law. All laws and ju- publication by any person.\"\n\ndicial decisions shall be free for\n\npublication by any person.\"\n\nart 8, § 1. art 7, § 1.\n\n\"Each organized county shall \"Each organized county shall\n\nbe a body corporate, with such be a body corporate with powers\n\npowers and immunities as shall and immunities provided by law.\"\n\nbe established by law. All suits\n\nand proceedings by or against a\n\ncounty shall be in the name there-\n\nof.\"\n\nart 8, § 8. art 7, § 8.\n\n\"The legislature may by gen- \"Boards of supervisors shall\n\neral law confer upon the boards have legislative, administrative\n\nof supervisors of the several coun- and such other powers and duties\n\nties such powers of a local, legis- as provided by law.\"\n\nlative and administrative char-\n\nacter, not inconsistent with the\n\nprovisions of this constitution, as\n\nit may deem proper.\"\n\nart 9, § 8. art 7, § 33.\n\n\"Any officer elected by a coun- \"Any elected officer of a po-\n\nty, city, village, township or litical subdivision may be re-\n\nschool district may be removed moved from office in the manner\n\nfrom office in such manner and and for the causes provided by\n\nfor such cause as shall be pre- law.\"\n\nscribed by law.\"\n\nThe change from the future tense in the 1908 Constitution to the present tense in the 1963 Constitution is of some significance.\n\nThe following cases from other States are helpful in determining the correct construction of the \"in force\" provision.\n\nIn Henry v. State (1871), 26 Ark 523, the State Constitution [1868] provided in article 15, § 16:\n\n\"All laws in this State not in conflict with this Constitution shall remain in full force until otherwise provided by the general assembly, or until they expire by their own limitation.\"\n\nDefendants were indicted for keeping a grocery without a license. It was claimed that the former law regulating groceries was repealed by the new Constitution. The court rejected this proposition and said:\n\n\"The laws continued in force by the Constitution itself, are as valid as though re-enacted by the general assembly.\" (Emphasis supplied.)\n\nGolden v. People, ex rel. Baker, 101 Colo 381 (74 P2d 715), involved a 1932 amendment to the Constitution which provided: \"No such laws shall ever authorize the establishment or maintenance of any saloon.\" A 1935 act defined a so-called statutory \"saloon\", which went into existence all over the State. In 1936 an old age pension amendment was passed allocating to the pension fund 85% of taxes from intoxicating liquor \"of whatever kind.\" The district attorney sought an injunction to prevent a town from issuing licenses on the theory that the 1935 act was unconstitutional. The court said, at p 384:\n\n\"Following the enactment by the general assembly of said chapter 142, licenses therein provided for, similar to those here in question, were issued and 'saloons,' if such they be, established thereunder have since been operating generally throughout the State. Thus the revenue raising provisions of said chapter 142 were incorporated into, and are now a part of, the Constitution, with the result that said article 22 has been modified as to its prohibition against the establishment and maintenance of any saloon, and those places here in question which had provided, and were providing, such revenue were legalized.\n\n\"To hold otherwise * * * seems clearly contrary to the purpose and intent of said amendment No. 4 and its specific language. The fact, if it be a fact, that the licensing provisions of said chapter 142, here involved, were, prior to the passage of the old age pension amendment, unconstitutional, is now immaterial. It had not been so declared and all presumptions were in its favor.\" (Emphasis supplied.)\n\nState, ex rel. Marr, v. Luther, 56 Minn 156 (57 NW 464), involved railroad acts which were held to have been validated by an amendment to the Constitution. The court said: (pp 164, 165)\n\n\"In brief, the legislature assumed that when making a grant of lands to aid the building of a railway, or in executing the trust where lands had been granted to the State by congress for the same purpose (and which, while thus held by the State, either as proprietor or in trust, were, of course, not subject to taxation), it had the power, in the furtherance of the object for which the grant was made, to exempt such lands from ordinary taxation, and to provide for commuted taxation of both the railroad and the granted lands.\n\n\"There is not in the history of the State a single grant of lands to aid the building of a railway, where this system of commuted taxation has not been adopted. * * *\n\n\"In this situation of things, the people adopted a constitutional amendment, Const, art 4, § 32a, ordaining that 'any law providing for the repeal or amendment of any law or laws heretofore or hereafter enacted which provides that any railroad company now existing in this State, or operating its road therein, or which may be hereafter organized shall in lieu of all other taxes * * * pay into the treasury of this State a certain percentage therein mentioned of the gross earnings of such railroad companies now existing or hereafter organized shall, before the same shall take effect and be in force, be submitted to a vote of the people of the State, and be adopted and ratified by a majority of the electors voting at the election at which the same shall be submitted to them.'\n\n\"This language must have been selected and this amendment adopted with reference to the existing legislation and the general legislative policy to which we have referred; and, read and construed in that light, it amounts to a clear recognition of the validity of existing laws providing for this commuted system of taxation of railroad property and lands, and of legislative power to enact such laws for the future. If it did not refer to this, there was nothing to which it could refer. It is, by necessary implication, a validation of past legislation of that kind, and a grant of power to enact it in the future.\" (Emphasis supplied.)\n\nPeople, ex rel. McClelland, v. Roberts (1896), 148 NY 360 (42 NE 1082), involved the Constitution of 1876 which gave the superintendent of public works power to make certain appointments. The Constitution of 1894 put all government workers under civil service. The court held that the new Constitution enlarged the former civil service statute so that it covered all public employees and took away the power of the superintendent to make appointments. The court said, at pp 369, 370:\n\n\"Moreover, it is evident from the language of the new provision of the Constitution and from the debates in the convention which followed its introduction into that body, that it was framed and adopted with reference to existing laws, which were intended to give to it immediate practical operation. So that in adopting the new Constitution, the people, in their original capacity, decreed that, thereafter, all the departments of the government should be brought within the operation of existing laws on the subject of appointments. The mandate to the legislature to enact laws to provide for the enforcement of the section does not in any degree conflict with this view. That was a prudent and proper, though, perhaps, an unnecessary precaution. But it affords no ground for the inference that the people intended to ignore the aid and utility of existing laws to give immediate practical effect to the principle, or that they were content to wait for the reform until the legislature should make new regulations on the subject. It was the intention to put all the new provisions of the Constitution into operation through the instrumentality of such laws as were then in force, so far as practicable, and if, in practice, they were found to be in any respect insufficient for that purpose, they were to be replaced or supplemented by new ones. This view does not depend entirely upon construction, since the instrument itself contains an express provision on that subject. The people declared in section 16 of article 1 that 'Such acts of the legislature of this State as are now in force shall be and continue the law of this State, subject to such alterations as the legislature shall make concerning the same; but all such parts of the common law, and such of the said acts, or parts thereof, as are repugnant to this Constitution, are hereby abrogated.'\n\n\"If the act of 1883 or any of its amendments needed new life and vigor, in order to bring this case within their operation, it has thus been given to them by an authority from which even the legislature itself has derived all of its powers.\" (Emphasis supplied.)\n\nIn the above case, it will be noted that the court not only held the law to be in force but also that the new Constitution had enlarged the former scope of the law.\n\nSee, also, Speegle v. Joy (1882), 60 Cal 278, holding that, under a constitutional \"in force\" provision, an act in force was kept in existence and that an act to go into effect at a future date was defeated. See, also, People v. Whiting (1883), 64 Cal 67 (28 P 445), where a portion of a statute in effect was held valid and a portion to have effect in the future was severed.\n\nOf all the numerous State Constitutions containing provisions similar to Michigan's article 3, § 7, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e as a matter of draftsmanship the provisions in the 1945 Georgia Constitution are of particular interest:\n\n\"Paragraph III. Third in authority. -- Third: In subordination to the foregoing: All laws now of force in this State, not inconsistent with this Constitution shall remain of force until the same are modified or repealed by the general assembly. * * *\n\n\"Paragraph IV. Local and private acts. -- Local and private acts passed for the benefit of counties, cities, towns, corporations and private persons, not inconsistent with the Supreme Law, nor with this Constitution and which have not expired nor been repealed, shall have the force of statute law, subject to judicial decision as to their validity when passed, and to any limitations imposed by their own terms.\" (Emphasis supplied.) 1 Georgia Code Ann, pp 666, 669.\n\nThe difference in the language of these two sections seems particularly pertinent since the last clearly spells out the rule for which Justice Souris contends. Following one after the other, it must be inferred that the first does not.\n\nThe correct test of the constitutionality of a statute is not all previous Michigan Constitutions in effect from the time of a law's enactment plus the existing Constitution, but simply the validity of the law under the present Constitution. This is the test that originally was set up in the Constitution of 1835, art 1, § 21, where it was provided:\n\n\"All acts of the legislature contrary to this or any other article of this Constitution shall be void.\"\n\nThis provision was not repeated in later Michigan Constitutions. It is quite understandable why it was not because later Michigan Constitutions by their \"in force\" provisions carried over the statutory law that had been developing through the years under previous Constitutions and validated it save for repugnancy to the new Constitution. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e It is noteworthy that all Michigan Constitutions retain in the laws in force provisions the exact words \"not repugnant to this Constitution.\" Other phraseology has changed. This clause has remained throughout.\n\nTo adopt the contrary rule would produce results the people could not possibly have intended. In the present case, if we were to test PA 1963, No 62, under the 1908 Constitution and determine it to be unconstitutional, having already determined it to be constitutional under the 1963 Constitution, the legislature would be obliged again to pass the law. While the examination of the constitutionality of a law under two or more Michigan Constitutions might exercise the brain cells of the members of this Court, it would be an exercise the futility of which seems manifest. Enactment of legislation is a time-consuming and expensive process. If a law is valid under the 1963 Constitution, we cannot believe either the framers of the Constitution or the people intended that it be stricken from the statute books because of invalidity under some former Constitution which they have voted out of existence.\n\nWe construe the language of the 1963 Michigan Constitution, art 3, § 7, to have validated all laws that were in force and effect on January 1, 1964. The constitutionality of said laws shall be tested by the 1963 Constitution save as to existing public and private rights as provided for by section 2 of the schedule and temporary provisions of that Constitution.\n\nT. M. Kavanagh, C. J. (concurring).\n\nWe concur in and support the reasoning and answers Justice Adams had written prior to the addendum portion of his opinion and we concur in the result reached.\n\nWe do not agree with the reasoning in his addendum, although we do agree it is not necessary for us to test PA 1963, No 62, under the 1908 Constitution.\n\nThe Michigan Constitution of 1963 was adopted April 1, 1963. The speaker of the house of representatives requested the opinion of the attorney general as to the constitutionality of the proposed Act No 62 under both the 1908 Constitution and the Constitution approved and adopted April 1, 1963.\n\nOn April 10, 1963, the attorney general of the State of Michigan gave his opinion approving the constitutionality of the act. On May 8, 1963, the legislature adopted Act No 62, effective immediately, which we are asked to construe.\n\nA legislature has power to enact a statute not authorized by the present Constitution where the statute is passed in anticipation of a constitutional amendment authorizing it or provides that it shall take effect upon the adoption of such a constitutional amendment. See 16 Am Jur 2d, Constitutional Law § 180; 171 ALR 1075 and cases cited therein, Druggan v. Anderson, 269 U.S. 36 (46 S Ct 14, 70 L ed 151).\n\nIn Druggan v. Anderson, supra, the court was considering the Eighteenth Amendment to the United States Constitution, which was ratified and became effective January 16, 1919, but provided that prohibition therein declared should not become operative until after one year. The national prohibition act was passed after the ratification of the amendment, but before the expiration of the year, and provided that it was not to go into effect until after the amendment did. The court in upholding the act and holding that it went into effect January 16, 1920, made the incidental observation that \"indeed it would be going far to say that while the fate of the amendment was uncertain Congress could not have passed a law in aid of it, conditioned upon the ratification taking place.\"\n\nIn Alabam's Freight Co. v. Hunt, 29 Ariz 419 (242 P 658), the contention was made that since, at the time of the passage of the act, the legislature had no power under the Constitution to require an election of remedies in advance of injury, it could not then enact a valid law containing such a provision, which should become effective upon a future amendment of the Constitution permitting it. The court in upholding the act said: \"We are of the opinion that the legislature may pass an act to take effect only upon the adoption of a constitutional amendment authorizing it, and that its constitutionality is to be tested by the Constitution as it is at the time the law takes effect, and not as when it was passed.\"\n\nThe facts in the case before us, where the legislature by its request for the opinion of the attorney general after the 1963 Constitution was adopted by the people and before the enactment of the proposed law, indicate the legislature was passing PA 1963, No 62, in anticipation of the effective date of the Constitution of 1963.\n\nWe conclude, therefore, that the act is not to be tested under the 1908 Constitution but under the 1963 Constitution.\n\nSouris, J. (dissenting).\n\nWe are asked in this proceeding \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e to determine the constitutionality of the industrial development revenue bond act of 1963, PA 1963, No 62. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In addition, we are asked to pass upon the validity, under Act No 62 and other pertinent statutory provisions, of certain agreements proposed to be entered into between the city of Gaylord and the United States Plywood Corporation, a function usually performed, at least before execution of such agreements, by private attorneys engaged and paid for such professional service.\n\nAt stake in this proceeding is Michigan's effort to match other States' financial inducements to private industrial enterprises to locate new plants within their borders. The post-World War II dispersal of manufacturing establishments from the highly industrialized States, like Michigan, to those States which previously were predominantly agricultural, is unpleasantly familiar recent history in this State. So, too, are the techniques by which other States have sought to accelerate artificially that process of industrial decentralization. By Act No 62 our legislature apparently decided that Michigan should add to its arsenal of weapons for use in this competition among the States for industrial plants. The new weapon authorized by Act No 62 is the tax-exempt status, under section 103(a)(1) of the internal revenue code, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e of interest on the obligations of a State and its political subdivisions.\n\nWhat Act No 62 does, in its practical effect, is to authorize municipalities to grant favored private enterprises the benefit of this tax exemption for the purpose of financing their industrial development at costs less than the private financial market would charge. It works this way: If United States Plywood were considering erecting a plant at Gaylord, to be financed by traditional borrowing methods at prevailing interest rates, the private lenders would charge Plywood interest at a rate sufficiently high to reflect the fact that they, the lenders, would have to pay Federal income taxes on the interest received from Plywood on its borrowed indebtedness. If the private lenders were not obliged to pay Federal income tax on the interest earned from such loans, it is reasonable to conclude that they would charge a rate of interest lower than is charged when such tax is payable thereon and, consequently, the borrower's financing costs would be lower correspondingly. Act No 62 provides the means by which a municipality, like Gaylord, can reduce the borrowing costs of a favored industrial concern, like Plywood, by borrowing the money itself at lower interest rates than could Plywood, since receipt of interest income on Gaylord's obligations is tax free, and, in turn, by \"loaning\" that money to Plywood at the same low rate of interest Gaylord itself must pay.\n\nWhile the act does not expressly authorize a municipality to \"loan\" money to a private enterprise, the practical effect of what is authorized to be done is exactly that. Instead of simply loaning Plywood an amount in cash equal to Gaylord's borrowing, and at the same interest rate, for Plywood's use in constructing a plant near Gaylord, the act requires that Gaylord use the proceeds of its borrowing to acquire a plant site for lease or sale, or some combination of both, to Plywood at a rental or purchase price adequate, but no greater than necessary, to permit Gaylord to retire its indebtedness as principal and interest thereon become due. In this fashion the act avoids the appearance, at least, of State government's direct entry into the field of private industrial financing, traditionally regarded in this country to be beyond the permissible scope of State governmental powers.\n\nThe question then becomes, did the legislature have the constitutional power to authorize municipalities to enter into such transactions? The Court's decision, from which I Dissent, is that it did. While my Dissent is based upon technical deficiencies in this proceeding which, as I shall elaborate hereafter, preclude this Court from authoritative determination of the constitutionality of Act No 62, I regret that the majority's opinion does not consider the nature of the power granted municipalities beyond the superficial form in which it is cast by the act. The fact is that none of the parties, not even defendant, who denies the validity of the act, has included in the briefs filed in this Court any analysis of the act as an integrated whole. Instead, we are expected to pronounce a far-reaching constitutional judgment of an act the essential nature of which is ignored by the parties while its sections are described as if completely independent one from the other, much as a blind man would describe an elephant upon his first encounter with one by describing what he feels of its trunk, its legs and its tail. Not infrequently appellate courts' judgment errors are attributable to just such inadequacies of counsel's arguments and briefs.\n\nI.\n\nA.\n\nI Dissent from the Court's decision of the constitutional issue simply because in my view the issue has not been presented in its proper constitutional context by either of the original parties in this case nor by the attorney general, who intervened after the case was at issue, technically, in the trial court. My objection to determination of the constitutionality of Act No 62 is that all of the parties, and the Court's majority, consider that issue exclusively in the light of the limitations upon legislative and municipal power contained in our Constitution of 1963, the provisions of which did not become effective until eight months following the legislative adoption and gubernatorial approval of Act No 62, which was ordered by the legislature to be given immediate effect on May 8, 1963. It is my opinion that the constitutional validity of Act No 62 must, as a matter of uniform and manifestly correct judicial practice, at least initially be Judged by the limitations contained in our Constitution of 1908, the constitutional charter in effect when the legislature undertook to adopt Act No 62.\n\nThere is no room to quibble over this principle of law, our Court having stated and applied it, without deviation, until now. It is so fundamental and elementary a principle that rarely need it be expounded at length. In Dewar v. People (1879), 40 Mich 401 (29 Am Rep 545), Mr. Justice Cooley writing for the Court, the Court set aside a conviction for keeping a saloon without a license, contrary to a city ordinance. The legislature had granted the city a charter with a provision authorizing it to license saloons, restaurants and billiard rooms or to prohibit any of them. When the charter was granted our Constitution of 1850 (art 4, § 47), forbade the legislature from authorizing the grant of licenses for the sale of intoxicating liquors, but that section was repealed by the people three years later. Following such repeal, the city enacted the ordinance which Dewar was charged to have violated, the sole authority for the ordinance being the city's charter provision mentioned above. Justice Cooley concluded that, since the Constitution had forbade the legislature to authorize the grant of licenses for the sale of intoxicants when it had granted the city's charter, the charter's grant of authority to issue licenses could not be construed then, nor at the time of decision after repeal of the prohibitory constitutional provision, to permit licensing of sale of intoxicants. While it would have sufficed for purpose of decision to base his Conclusion upon the finding that the legislature did not intend when it granted the charter to authorize the grant of licenses for the sale of intoxicants, Justice Cooley also noted that the charter granted by the legislature was the same as it was when adopted \"and it cannot be affected and enlarged by any subsequent change of the constitution.\" 40 Mich 401, 403.\n\nIn Village of Mount Pleasant v. Vansice (1880), 43 Mich 361 (38 Am Rep 193), a legislative act authorized villages to license \"saloons, taverns and eating-houses.\" As in Dewar, supra, this statute was enacted while the 1850 Constitution contained the provision forbidding the legislature to authorize the grant of licenses for the sale of intoxicants. After repeal of that provision, the village adopted an ordinance, ostensibly by authority of the statute mentioned, requiring a license for the sale of intoxicants. Mr. Justice Graves, writing for the same distinguished Court which decided Dewar, supra, and which consisted of Justices Cooley, Campbell, Marston and Graves, had the following to say in application of the principle our majority refuses to apply today (pp 363, 364):\n\n\"If the legislature had the purpose to confer the power [to license sale of intoxicants], and designed that the terms used should have the meaning now claimed for them, the design was in conflict with the Constitution as it then existed, and the sense and scope of the provision were so far null and void. They never were of any force, and were as though they had not been expressed or involved in the language, and the words were left to carry a sense in harmony with the Constitution. The meaning claimed not having been enacted in the passage of the law, because the Constitution forbade it, it has not become a law merely through a change of the Constitution and the lapse of time. Dewar v. People, 40 Mich 401; Ludlow v. Hardy, 38 Mich 690.\"\n\nIn 1846, a statute of this State purported to authorize the governor to remove certain State officers, for official misconduct or habitual or wilful neglect of duty, during recesses of the legislature. Acting pursuant to that statute, the governor removed a trustee of a State institution and, as also authorized by the statute, appointed a successor to serve during the legislature's recess. Upon the trustee's refusal to vacate his office, a quo warrantor suit was instituted in the Supreme Court in behalf of the successor appointee. This Court, in Dullam v. Willson (1884), 53 Mich 392 (51 Am Rep 128), entered judgment for the respondent trustee on the ground that the statute pursuant to which the governor purported to act was invalid because it violated the Constitution of 1835, in effect when the statute was enacted, notwithstanding that our Constitution of 1850, as amended in 1862, expressly authorized the governor to exercise the power of removal such as the legislature had purported to grant him in the statute of 1846. In rendering its decision, this Court said, at p 398:\n\n\"The statute furnishes no valid basis for the power of removal, because repugnant to the Constitution of 1835, which vested no judicial power in the governor. The statute, being void, was not validated by the amendment of 1862, and the question [the validity of the governor's summary removal of respondent] depends solely upon the constitutional amendment of 1862.\"\n\nIn Seneca Mining Company v. Secretary of State (1890), 82 Mich 573 (9 LRA 770), the Court considered and rejected the argument that a constitutional amendment adopted by the people in April of 1889 did not take effect immediately, but only at the commencement of the year 1890. The issue was important because in June of 1889, after the constitutional amendment had been approved by the people and pursuant to the power granted therein, the legislature enacted a statute authorizing certain mining companies, like plaintiff, to extend their corporate lives beyond 30 years. Upon plaintiff's attempt to extend its existence, and the secretary of state's refusal to file the required amended articles of association, plaintiff sought our writ of mandamus. The Court held that the constitutional amendment became effective, that is, it attained the force and effect of law, in April of 1889 when adopted by the people and, therefore, that the legislature possessed the constitutional power to act as it did in June of that year. In rejecting the argument advanced by the secretary of state, the Court stated the fundamental proposition of law our majority rejects today in the following language:\n\n\"For, if the law-making power is prohibited from enacting a law, and in disregard of such prohibition it goes through the forms of enacting a law, such enactment is of no more force or validity than a piece of blank paper, and is utterly void, and power subsequently conferred upon the legislature by an amendment of the Constitution does not have a retroactive effect, and give validity to such void law.\" 82 Mich 573, 576, 577. (Emphasis added.)\n\nIn People v. Frencavage (1925), 233 Mich 369, defendant challenged the validity of an 1861 legislative enactment relating to the revocation of conditional pardons. His theory was that the legislature did not have authority to enact such law prior to a 1902 amendment of the Constitution of 1850. The Court agreed by stating the obvious:\n\n\"If these provisions were beyond the power of the legislature to enact at the time they were enacted, it is obvious that a change in the Constitution (PA 1903, p 452) did not make them valid without reenactment.\" 233 Mich 369, 371, 372.\n\nWhat these cases mean to me is that the legislature's acts must be Judged in the light of the powers possessed by the legislature at the time it undertakes to act. With due regard for the fact that the legislative power of a State, unlike the legislative power of congress, does not depend upon express constitutional grant but, rather, is as broad and comprehensive as necessary to accomplish the legitimate purposes of government except as the people may have imposed restraints upon such power by constitutional limitations (Sears v. Cottrell [1858], 5 Mich 251, 257-259, and Young v. City of Ann Arbor [1934], 267 Mich 241, 243), the Constitution in force and effect at the time the legislature acts must be examined to determine whether the people in fact have forbidden the legislature so to act. If they have, the legislative act is a nullity, a void, a failure of creation; it is stillborn, dead at birth; it lacks the force of law; it is impotent as a source of rights or of obligations; it signifies an act of futility as devoid of effect as if never attempted; it is no more effective as a law than is a piece of blank paper.\n\nThis is not a principle of law unique to Michigan. All courts in other jurisdictions which squarely have considered the issue recognize the validity of the principle. See the cases cited and discussed in the annotation, \"Remand or suspension of constitutional limitations as affecting statute previously enacted\", 171 ALR 1070.\n\nLike most other legal principles, this one has its limitations, but none is applicable here. When a legislature purports to enact a statute the subject matter of which is beyond the legislative power of the State as limited by the State's people in their Constitution, the principle is applicable and the statute is void ab initio. Thus it is that in this case the limitations upon legislative power contained in the 1908 Constitution should be examined to determine whether what the legislature attempted in Act No 62 to authorize municipalities to do was beyond the legislature's power. If it were beyond the powers of the legislature under the 1908 Constitution, our judicial duty would end with our declaration of the act's invalidity. Only if it were not beyond such powers, would Act No 62 then have to be tested for its current validity against the limitations contained in the 1963 Constitution.\n\nHowever, there are circumstances when courts sometimes give legal effect to legislative acts which violate constitutional provisions. For example, in Toole v. State Board of Dentistry (1942), 300 Mich 180, this Court ruled that a referendum election upon a statute regulating the practice of dentistry effectively approved the statute notwithstanding failure to comply with a then applicable constitutional requirement that on referendum the full text of the statute be printed on the ballot. While the paper ballots used at the referendum election complied with the constitutional requirement, the full text of the statute was not printed on voting machine ballots. The Court's decision rested heavily upon the overwhelming approval given the statute by the electorate, and upon the fact that even without the favorable votes cast on the voting machines, the statute would have been approved by a very substantial margin. Also articulated as a reason for the Court's decision was the traditional reluctance of courts to disfranchise voters for the mistakes of election officials. In my view of the Toole Case, it must have been significant to the Court that the legislative act challenged was, in practical effect, an enactment by the people themselves. It is not likely, in my opinion, that the Court would have countenanced the legislature's failure to comply with a like procedural requirement of the Constitution. Judicial willingness to give legal effect to official actions taken in violation of a constitutional provision, as distinguished from legislative enactments beyond the scope of the legislature's power, arise most frequently, as in the Toole Case, when elections are involved. For another example, see Adsit v. Secretary of State (1891) 84 Mich 420 (11 LRA 534).\n\nThere is another circumstance in which the void ab initio principle is not fully applicable. When a legislative enactment is unconstitutional as applied to certain parties or certain facts, but otherwise within the powers of the legislative body to enact, then the enactment generally is held to be void only when so applied and otherwise is given legal effect. See Dequindre Development Co. v. Charter Township of Warren (1960), 359 Mich 634, and Schaefer v. City of East Detroit (1960), 360 Mich 536. We need not pause long on this limitation upon the principle, for in this case of Gaylord, our inquiry should be whether the subject matter of Act No 62 was entirely beyond the constitutional capacity of the legislature and not whether the act as sought to be utilized in Gaylord contravenes constitutional limitations.\n\nFinally, there is another exception to the principle, which exception is invoked, belatedly and inaptly, here. The exception is that the people themselves, by express constitutional enactment or by necessary implication therefrom, can validate a prior legislative enactment which exceeded the legislature's constitutional power. For a thoughtful Discussion of this exception, see Field, The Effect of an Unconstitutional Statute (1935), pp 288-294. Its application depends upon the people's intent as expressed in the subsequent constitutional enactment. I have found no cases in which the courts have refused to apply the exception when the people's intent to validate a prior unconstitutional statute is stated clearly. The difficulty arises when the people's intent is not stated clearly.\n\nIt is now claimed that article 3, § 7 of the 1963 Constitution \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e signifies the people's intent to validate all prior unconstitutional statutes the provisions of which are not repugnant to the new Constitution and that, therefore, even if it be assumed that Act No 62 violated the 1908 Constitution, it now has the effect of law if it does not contravene the 1963 Constitution. This claim I will examine with some care later in this opinion. Suffice to note now that, while I recognize the exception to the general principle, in my opinion article 3, § 7 has nothing whatever to do with that exception.\n\nOnly in the event that the legislature had the constitutional power to do what it attempted in Act No 62, and that must be determined from the Constitution of 1908, will it become appropriate for us to consider, in that event, the continuing constitutional validity of Act No 62 under the Constitution of 1963. If we were to determine, on the other hand, that Act No 62 was beyond the power of the legislature to enact, as those powers were then limited by the Constitution of 1908, and thus invalid, the Constitution of 1963 cannot be construed to breathe life into an act theretofore dead. What the parties hereto would have us do, and our majority unwisely complies, is to skip the initial and crucial step of testing the constitutional validity of Act No 62 by the only constitutional instrument applicable at the moment of the act's purported creation -- the Constitution of 1908. By this error of judgment to which our majority has been led, the legislature, our municipal governments, industrial concerns and bond buyers may be induced to rely upon our current majority's declaration of validity of Act No 62 only to discover, months or years hence when another suit challenges the act's validity when enacted, that their reliance was misplaced because our majority then might conclude that, indeed, our Constitution of 1908 forebade what the legislature sought to do in Act No 62.\n\nAfter submission of this proceeding for our decision, when we discovered that none of the questions certified to us by the circuit Judge and briefed by the parties \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e concerned the applicability of our Constitution of 1908 to the validity of Act No 62, a majority of my Brethren rejected my motion to remand the cause to the trial court for supplementation of the certified questions and the parties' briefs thereon to include questions concerning the validity of Act No 62 in light of the limitations upon legislative power contained in article 8, §§ 20 and 22 through 25, inclusive, and article 10, §§ 9, 12 through 14, inclusive, and 20 of the Constitution of 1908. Instead, the Court summoned counsel for the parties to appear before the Court on July 19 last to consider whether the cause should be remanded for such purpose.\n\nAt the hearing on July 19, counsel for the city argued that article 3, § 7 of the 1963 Constitution \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e had the effect of validating Act No 62 even if it were assumed arguendo that the act was violative of the 1908 Constitution, his theory being, apparently, that not having been declared unconstitutional prior to the effective date of the 1963 Constitution, Act No 62 was a statute then \"in force\" and, therefore, it need now be tested against only the 1963 Constitution's limitations. He conceded he had no authority, from Michigan or any other jurisdiction with comparable constitutional provisions, to support his argument. The argument is not persuasive logically, for it assumes that a legislative act beyond the legislature's constitutional authority has sufficient vitality to be \"in force\" until judicially declared invalid. This simply is not true for an unconstitutional statute is invalid ab initio, a nullity from its inception, precisely because the legislature had no power to enact it. This Court put it trenchantly in Adsit v. Secretary of State (1891), 84 Mich 420, at 429, \"An unconstitutional law is no law.\"\n\nArticle 3, § 7 is not unique to Michigan's Constitution of 1963. As noted in footnote 6, (supra) , comparable provisions have appeared in all three of our predecessor Constitutions and, as well, are found in the Constitutions of other States. Such a provision was involved in the decision of the Arkansas supreme court in Henry v. State (1871) 26 Ark 523. In that case defendants appealed a conviction for keeping a grocery without procuring a license and paying a tax therefor required by statute. One of their claims on appeal was that the power to license and tax a grocery-keeper did not exist when the statute was enacted; that such power was first granted the legislature by a new Constitution adopted subsequent to the statute; and, therefore, because the legislature failed to re-enact the statute after adoption of the new Constitution, that the statute was void because beyond the legislative power at the time of its enactment. The Arkansas supreme court made short shrift of the claim, noting that the legislature did, indeed, have the power to license grocers and to exact payment therefor, even before adoption of the new Constitution, since that power was not prohibited to the legislature by the prior Constitution. Since the statute was within the legislature's power and was, therefore, valid, the provision of the new Arkansas Constitution, similar to our article 3, § 7, would be applicable. That provided that all laws in force before the adoption of the Constitution and not in conflict with its terms, were to continue in force.\n\nSuch application of the constitutional language is eminently correct. It gives to the language no greater meaning than the average person, not encumbered by the labyrinthian complexities of the lawyer's thought processes, would give it. The language, as it surely was intended by the people whose votes adopted it, accomplished only the purpose of providing continuity of the laws in force under the old Constitution upon the adoption of a new Constitution so long as not in conflict with the latter. It is, after all, the judiciary's function in interpreting constitutional language to find the intent of the people who adopted it by their votes. See, for example, Bacon v. Kent-Ottawa Metropolitan Water Authority (1958), 354 Mich 159, 170, 171, and Lockwood v. Commissioner of Revenue (1959), 357 Mich 517, 554, 555.\n\nYet, today, it is baldly asserted that article 3, § 7 means much more than the Arkansas court said that State's counterpart provision meant, that it means that even statutes clearly void under the old Constitution are somehow given life if they could be enacted validly under the new Constitution -- and without the need for any further legislative action whatever! And this bald assertion is made to this Court, not in the form of a written brief, but only in oral argument, without so much as a passing reference to what the people may have intended in adopting article 3, § 7 and without so much as a single citation of authority of any kind in support.\n\nWho can argue, seriously, that the people intended by article 3, § 7 to validate any and all void statutes not repugnant to the 1963 Constitution? There is not so much as a suggestion in the record of the constitutional convention that the convention delegates, even, so intended. The argument may appeal to desperate litigants and to Supreme Court Justices intrigued by the practical advantages of limiting their judicial tasks on assertion of invalidity of time-matured statutes to scrutiny only of the latest Constitution, but it has no such appeal for me. Absent some evidence that the people intended such a strained meaning to be placed upon the simple words of common usage with which they spoke in their Constitution, it is not open to this Court to distort by expansion what those words are commonly understood to mean.\n\nJustice Adams suggests in his opinion that it \"is of some significance\" to our construction of article 3, § 7, that the language used in article 1, § 14, article 4, § 35, article 7, §§ 1, 8 and 33 of the 1963 Constitution is cast in the present tense whereas the future tense was used in the counterpart provisions of the 1908 Constitution. I must confess that I do not comprehend the pertinence of this suggestion. Nor do I believe it is of any greater significance than that the style and drafting committee of the constitutional convention succeeded at least in part in performing its assigned and expressly limited \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e task of editing the language of delegates' proposals without altering their substantive meaning. This is evident upon tracing the cited provisions in the record of proceedings of the constitutional convention, from their reference as proposals to the style and drafting committee to that committee's submission of its redrafts to the convention. See, as to article 1, § 14, 2 Constitutional Convention Record (1961), pp 2925 and 3048; as to article 4, § 5, 1 Constitutional Convention Record (1961), p 707 and 2 Constitutional Convention Record (1961), p 2965; as to article 7, § 1, 1 Constitutional Convention Record (1961), p 985 and 2 Constitutional Convention Record (1961), p 2505; as to article 7, § 8, 1 Constitutional Convention Record (1961), p 986 and 2 Constitutional Convention Record (1961), p 2505; and as to article 7, § 33, 1 Constitutional Convention Record (1961), p 838 and 2 Constitutional Convention Record (1961), p 2971.\n\nWhat I have written should not suggest that the people cannot do what it now is claimed they did in article 3, § 7. If the people desire to do so, other much more explicit language must be used so that their intent to validate statutes theretofore void because beyond the legislature's power be stated clearly. By new constitutional provision or amendment, the people can do directly what a legislature may have attempted to do beyond its own constitutional power, as in Hammond v. Clark (1911), 136 Ga 313 (71 SE 479, 38 LRA NS 77) and they can validate specifically identified statutes which otherwise would be void, as in the cases collected in part III of the annotation, referred to above, at 171 ALR 1070, 1072-1074. But neither of those techniques was attempted by the people to attain validity of Act No 62.\n\nJustice Adams relies upon State, ex rel. Marr, v. Luther (1894), 56 Minn 156 (57 NW 464); Golden v. People, ex rel. Baker, (1937), 101 Colo 381 (74 P2d 715); and People, ex rel. McClelland, v. Roberts (1896), 148 NY 360 (42 NE 1082), in aid of his construction of article 3, § 7. None of those cases involved a constitutional provision even remotely similar to our article 3, § 7. Instead, the cases of Marr and Golden, like Hammond v. Clark, supra, involved situations in which the Minnesota and Colorado courts found that the people intended, by constitutional amendments, to validate particular statutes theretofore enacted; and the case of McClelland involved simply a finding by the New York court that the people intended by specific language contained in a new Constitution to include all civil divisions within the State's civil service which theretofore had been established by statute but the coverage of which had been limited by provisions of the old Constitution.\n\nThe two California cases cited by Justice Adams, Speegle v. Joy (1882), 60 Cal 278, and People, ex. rel. Orr, v. Whiting (1883), 64 Cal 67 (28 P 445), do involve a provision of that state's constitution, effective January 1, 1880, similar to our article 3, § 7. However, they lend no support to Justice Adams' contentions. In both cases the California court held that such a constitutional provision did not give force and effect to statutes which were enacted prior to the new Constitution but which were not, by their terms, to become effective until \"the first Monday of March, 1880\". Those statutes, or parts thereof, not \"in force\" on the effective date of the new California Constitution, the court held, \"never have and never will take effect\". See Orr, supra, p 68. The claim presently asserted for our article 3, § 7, that it validates a statute beyond the legislature's power theretofor to enact, was not considered in Speegle nor in Orr. However, those cases do support my reading of article 3, § 7, to the extent that the California court held that California's counterpart provision was a \"saving\" provision which carried over under the new Constitution only those previously enacted statutes which were validly in effect on the effective date of the new Constitution.\n\nThe assistant attorney general who appeared at the hearing on July 19th asserted, as did also the city's counsel, that the pertinent provisions of our 1908 Constitution were so similar to those in our 1963 Constitution that the arguments advanced in favor of the constitutionality of Act No 62 under the 1963 Constitution would be equally applicable under the 1908 Constitution. I will examine this assertion in due course later in this opinion.\n\nDefendant's counsel, in addition, acknowledged the pertinence of an inquiry under the 1908 Constitution, but urged that we confine ourselves to a declaration of the act's invalidity under the 1963 Constitution. He candidly advised the Court that he would prefer such a limited determination of invalidity as a tactical matter because, if we were to declare the act invalid under the 1908 Constitution, it might yet be reenacted as an exercise of permissible legislative power under the 1963 Constitution, whereas if declared invalid under the 1963 Constitution, there would be no possibility of subsequent legislative reenactment absent a constitutional amendment. It will suffice to note that this Court cannot succumb to the tactical stratagems of litigants which artificially restrict the Court's performance of its duty when constitutional issues of public importance are involved.\n\nNotwithstanding disclosure at the July 19th hearing that at least some members of the Court were deeply troubled by the failure of the trial court to certify questions raising the applicability of the 1908 Constitution and by the failure of all counsel to brief such clearly applicable questions, each counsel present declined invitation to file supplementary briefs and elected to stand on the briefs already filed. Thus, without the benefit of a trial court decision, or even a trial, in this case of \"public moment\"; without the benefit of an appellate decision by our Court of Appeals; and without the usually beneficial assistance of counsel's briefs on constitutional issues of threshold importance, a majority of our Court proceeds nonetheless to render its advisory decision.\n\nThat prompt decision in this matter is important I do not doubt, but it is even more important that our decision, whenever made, be right. It cannot be a right decision when it leaves unanswered the threshold question upon which all other questions involved depend. Yet, that is precisely what the Court's majority proposes now to do.\n\nConceivably, any member of the Court who believes, as I do, that the 1908 Constitution's limitations first must be considered before decision herein, could proceed to such consideration and decision in Dissent even without benefit of counsel's assistance. However, I am dissuaded from taking such course in this proceeding because the statute here involved is, beyond question, of major public significance. What is decided here will affect not only the Gaylord-United States Plywood project but others as well, some of which already have been undertaken and others of which are awaiting our present decision. In each of these projects, many interests are involved, both public and private; yet, it is strange that none of the municipalities or industrial concerns so vitally interested in the outcome of this litigation has sought to assist the Court in reaching its decision by participation herein as intervening parties or as amicus curiae. All factors considered, the validity of Act No 62, in my judgment, should be determined only after the issues have been narrowed by our traditional process of adjudication in an adversary trial court proceeding and then subjected to appellate review on a factual record and with the assistance of complete appellate argument by skilled counsel.\n\nIt was this view I expressed first in my Dissent to our order of April 12, 1965, granting the governor's request for certification of this case to the Supreme Court prior to trial and decision by the circuit court. That order and its three accompanying Dissents have not been published heretofore. Because I believe it important to the bench and bar that the judicial record of this unique proceeding be available readily for future use, the Court's order and the Dissents thereto are printed in the margin in their entirety. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nNotwithstanding my disagreement with the Court's grant of certification herein, I would have proceeded to judgment, even in Dissent, had the issues been framed and argued adequately for a worthy judgment of the statute's validity. They have not been to this date, and a majority of the Court has precluded the possibility of rectifying the fatal flaws in this record by its refusal to remand the cause to the circuit court for, at the very least, supplementary certification and briefing of the 1908 Constitution's applicability. To proceed to judgment in these circumstances is as futile as trying to fry an egg without first cracking and emptying its shell.\n\nB.\n\nWhile some of the pertinent provisions of the 1908 Constitution have been carried over in the 1963 Constitution, others have not. Thus, even some of my Brethren who find no constitutional infirmity in Act No 62, the 1963 Constitution alone considered, might possibly conclude, upon consideration of such other provisions of the 1908 Constitution, that the act was invalid from its inception. It might help to compare the 1908 Constitution's provisions which I consider possibly relevant to our inquiry with the counterpart provisions, when there are such, of the 1963 Constitution:\n\n1908 1963\n\nart 8, § 20. art 7, § 21.\n\n\"The legislature shall provide \"The legislature shall provide\n\nby a general law for the incorpo- by general laws for the incorpora-\n\nration of cities, and by a general tion of cities and villages. Such\n\nlaw for the incorporation of vil- laws shall limit their rate of ad\n\nlages; such general laws shall lim- valorem property taxation for mu-\n\nit their rate of taxation for mu- nicipal purposes, and restrict the\n\nnicipal purposes, and restrict powers of cities and villages to\n\ntheir powers of borrowing money borrow money and contract debts.\n\nand contracting debts.\" Each city and village is granted\n\npower to levy other taxes for\n\npublic purposes, subject to lim-\n\nitations and prohibitions provided\n\nby this constitution or by law.\"\n\nart 4, § 51.\n\n\"The public health and general\n\nwelfare of the people of the State\n\nare hereby declared to be matters\n\nof primary public concern. The\n\nlegislature shall pass suitable laws\n\nfor the protection and promotion\n\nof the public health.\"\n\nart 8, § 22. art 7, § 23.\n\n\"Any city or village may ac- \"Any city or village may ac-\n\nquire, own, establish and main- quire, own, establish and main-\n\ntain, either within or without its tain, within or without its corpo-\n\ncorporate limits, parks, boule- rate limits, parks, boule-\n\nvards, cemeteries, hospitals, alms- cemeteries, hospitals and all works\n\nhouses and all works which in- which involve the public health or\n\nvolve the public health or safety.\" safety.\"\n\nart 8, § 23. art 7, § 24.\n\n\"Subject to the provisions of \"Subject to this constitution,\n\nthis constitution, any city or vil- any city or village may acquire,\n\nlage may acquire, own and oper- own or operate, within or without\n\nate, either within or without its its corporate limits, public service\n\ncorporate limits, public utilities facilities for supplying water,\n\nfor supplying water, light, heat, light, heat, power, sewage dis-\n\npower and transportation to the posal and transportation to the\n\nmunicipality and the inhabitants municipality and the inhabitants\n\nthereof; and may also sell and thereof.\n\ndeliver heat, power and light\n\nwithout its corporate limits to \"Any city or village may sell\n\nan amount not to exceed 25 per and deliver heat, power or light\n\ncent of that furnished by it with- without its corporate limits in an\n\nin the corporate limits, and may amount not exceeding 25 per cent\n\nalso sell and deliver water outside of that furnished by it within\n\nof its corporate limits in such the corporate limits, except as\n\namount as may be determined by greater amounts may be permit-\n\nthe legislative body of the city ted by law; may sell and deliver\n\nor village; and may operate trans- water and provide sewage dis-\n\nportation lines without the mu- posal services outside of its cor-\n\nnicipality within such limits as porate limits in such amount as\n\nmay be prescribed by law: Pro- may be determined by the legis-\n\nvided, That the right to own or lative body of the city or village;\n\noperate transportation facilities and may operate transportation\n\nshall not extend to any city or lines outside the municipality\n\nvillage of less than 25,000 inhab- within such limits as may be\n\nitants.\" prescribed by law.\"\n\nart 8, § 24.\n\n\"When a city or village is au-\n\nthorized to acquire or operate any\n\npublic utility, it may issue mort-\n\ngage bonds therefor beyond the\n\ngeneral limit of bonded indebted-\n\nness prescribed by law: Pro-\n\nvided, That such mortgage bonds\n\nissued beyond the general limit of\n\nbonded indebtedness prescribed\n\nby law shall not impose any lia-\n\nbility upon such city or vil-\n\nlage, but shall be secured only\n\nupon the property and revenues\n\nof such public utility, including a\n\nfranchise stating the terms upon\n\nwhich, in case of foreclosure, the\n\npurchaser may operate the same,\n\nwhich franchise shall in no case\n\nextend for a longer period than\n\n20 years from the date of the\n\nsale of such utility and franchise\n\non foreclosure.\"\n\nart 8, § 25. art 7, § 25.\n\n\"No city or village shall have \"No city or village shall acquire\n\npower to abridge the right of any public utility furnishing\n\nelective franchise, to loan its cred- light, heat or power, or grant any\n\nit, nor to assess, levy or collect public utility franchise which is\n\nany tax or assessment for other not subject to revocation at the\n\nthan a public purpose. Nor shall will of the city or village, unless\n\nany city or village acquire any the proposition shall first have\n\npublic utility or grant any public been approved by three-fifths of\n\nutility franchise which is not sub- the electors voting thereon. No\n\nject to revocation at the will of city or village may sell any public\n\nthe city or village, unless such utility unless the proposition shall\n\nproposition shall have first re- first have been approved by a\n\nceived the affirmative vote of majority of the electors voting\n\nthree-fifths of the electors of such thereon, or a greater number if\n\ncity or village voting thereon at the charter shall so provide.\"\n\na regular or special municipal\n\nelection; and upon such proposi-\n\ntion women taxpayers having the\n\nqualifications of male electors\n\nshall be entitled to vote.\"\n\nart 10, § 9. art 9, § 2.\n\n\"The power of taxation shall \"The power of taxation shall\n\nnever be surrendered or suspend- never be surrendered, suspended\n\ned by any grant or contract to or contracted away.\"\n\nwhich the state or any municipal\n\ncorporation shall be a party.\"\n\nart 10, § 12. art 9, § 18.\n\n\"The credit of the State shall \"The credit of the State shall\n\nnot be granted to, nor in aid of not be granted to, nor in aid of\n\nany person, association or corpo- any person, association or corpo-\n\nration, public or private.\" ration, public or private, except\n\nas authorized in this constitution.\n\n\"This section shall not be con-\n\nstrued to prohibit the investment\n\nof public funds until needed for\n\ncurrent requirements or the in-\n\nvestment of funds accumulated to\n\nprovide retirement or pension ben-\n\nefits for public officials and em-\n\nployees, as provided by law.\"\n\nart 7, § 26.\n\n\"Except as otherwise provided\n\nin this constitution, no city or vil-\n\nlage shall have the power to loan\n\nits credit for any private purpose\n\nor, except as provided by law, for\n\nany public purpose.\"\n\nart 10, § 13. art 9, § 19.\n\n\"The State shall not subscribe \"The State shall not subscribe\n\nto, nor be interested in the stock to, nor be interested in the stock\n\nof any company, association or of any company, association or\n\ncorporation.\" corporation, except that funds ac-\n\ncumulated to provide retirement\n\nor pension benefits for public offi-\n\ncials and employees may be in-\n\nvested as provided by law; and\n\nendowment funds created for\n\ncharitable or educational purposes\n\nmay be invested as provided by\n\nlaw governing the investment of\n\nfunds held in trust by trustees.\"\n\nart 10, § 14. art 3, § 6.\n\n\"The State shall not be a party \"The State shall not be a party\n\nto, nor be interested in, any work to, nor be financially interested\n\nof internal improvement, nor en- in, any work of internal improve-\n\ngage in carrying on any such ment, nor engage in carrying on\n\nwork, except: any such work, except for public\n\n\"1. In the development, im- internal improvements provided\n\nprovement and control of or aid- by law.\"\n\ning in the development, improve-\n\nment and control of public roads,\n\nharbors of refuge, water-ways,\n\nairways, airports, landing fields\n\nand aeronautical facilities;\n\n\"2. In the development, im-\n\nprovement and control of or aid-\n\ning in the development, improve-\n\nment and control of rivers,\n\nstreams, lakes and water levels,\n\nfor purposes of drainage, public\n\nhealth, control of flood waters and\n\nsoil erosion;\n\n\"3. In reforestation, protection\n\nand improvement of lands in the\n\nState of Michigan;\n\n\"4. In the expenditure of\n\ngrants to the State of land or\n\nother property.\"\n\nart 10, § 20.\n\n\"It shall be competent for the\n\nState to acquire, purchase, take,\n\nhold and operate any railroad, or\n\nrailroad property, belonging to\n\nany railroad or railway company\n\nin this State heretofore organized\n\nunder a special charter still in\n\nforce and effect and constituting\n\na contract between the State and\n\nsaid company, wherein the right\n\nto purchase or acquire has been\n\nreserved to the State, whenever\n\nin the judgment of the legisla-\n\nture such acquisition or purchas-\n\ning is necessary to protect and\n\nconserve the rights and interests\n\nof the State under such charter\n\nor contract. Any and all debts or\n\nobligations of such company con-\n\nstituting a lien upon such rail-\n\nroad, or railroad property, may\n\nbe assumed by the State; and\n\nsuch road or property may be\n\nleased, sold or disposed of in such\n\nmanner as may be provided by\n\nlaw.\"\n\nIt has been claimed, by the city's counsel and the assistant attorney general at our July hearing, that so much of the language of the pertinent provisions of both Constitutions is identical or similar that a decision of the statute's validity under the 1963 Constitution virtually assures that the same Conclusion would be reached under the 1908 Constitution. Of course, no such result automatically follows without our express pronouncement of such a decision; nor can we make such pronouncement in propriety without careful consideration of the differences in the pertinent provisions of the two Constitutions.\n\nFor example, is it not of some significance that whereas article 3, § 6 of the 1963 Constitution forbids the State from becoming \"financially\" interested in any work of internal improvement, article 10, § 14 of the 1908 Constitution forbade any interest in such improvements and not just financial interests therein?\n\nAnd is it not of some significance that the 1963 Constitution limits the power of the State to grant its credit \"except as authorized in this constitution\" (art 9, § 18) and the power of a city or village to loan its credit \"except as provided by law, for any public purpose\" (art 7, § 26), whereas when Act No 62 was adopted the 1908 Constitution absolutely forbade the grant of the State's \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e credit \"in aid of any person, association or corporation, public or private\" (art 10, § 12)?\n\nWhat about the express grant to cities and villages in article 8, § 24 of the 1908 Constitution (omitted in the 1963 Constitution) to issue \"mortgage bonds\" for the acquisition or operation of public utilities in amounts beyond the general limit of bonded indebtedness prescribed by law but, in which event, the city's or village's liability would be secured \"only upon the property and revenues of such public utility\"? Is this 1908 grant any different from the power to issue revenue bonds, authorized by Act No 62 but for other than public utility purposes? If the power to issue \"mortgage bonds\" or revenue bonds was limited, as it was by the 1908 Constitution, for the acquisition or operation of public utilities, may it not be argued that issuance of such bonds for other purposes logically was impliedly forbidden? Expressio unius est exclusio alterius.\n\nOther examples of possibly significant differences between the two Constitutions can be readily discerned upon examination of the provisions from each set forth above. The examples mentioned should suffice to establish my contention that our majority's declaration of constitutionality under the 1963 Constitution does not address itself to the more difficult problems posed by the 1908 Constitution.\n\nOne reason the 1908 Constitution poses more difficult judicial problems than does the 1963 Constitution may be examined with profit. Our majority concludes that the 1963 Constitution's limited prohibition against the State's becoming interested (\"financially\") in works of internal improvements (art 3, § 6) does not apply to an interest financed by self-liquidating revenue bonds. This Conclusion is based upon what is called by our majority \"a recognized fact\" by the delegates to the Constitutional Convention which produced our 1963 Constitution that such bond issues were not regarded by our Court to violate the internal improvements provision of article 10, § 14 of our 1908 Constitution, citing Gilbert v. City of Traverse City (1934), 267 Mich 257; Attorney General, ex rel. Eaves, v. State Bridge Commission (1936), 277 Mich 373; Oakland County Drain Com'r v. City of Royal Oak (1943), 306 Mich 124; and City of Dearborn v. Michigan Turnpike Authority (1955), 344 Mich 37.\n\nIf we assume the delegates were aware of the cited decisions of this Court and that they believed our Court had held what the majority now says is the holding of those cases, then there is some merit in accepting the Court's construction of article 3, § 6 of the 1963 Constitution to exclude from its prohibitory reach projects financed by revenue bonds. However, as I will attempt later to demonstrate, I do not believe those cases can be read so broadly. Furthermore, if we were to apply the more restrictive limitation of article 10, § 14 of the 1908 Constitution, the pertinence of those decisions would be far different from their pertinence to our construction of the 1963 Constitution.\n\nIn the first place the delegates to the convention which drafted the 1908 Constitution were not influenced by the cited cases, each of which was decided long after that convention had completed its work. Thus, those cases could not be used to help determine what the delegates and the people then intended in adopting article 10, § 14 of the 1908 Constitution as our majority uses them to determine what was intended by article 3, § 6 of the 1963 Constitution.\n\nIn the second place, if we assume the cited cases mean what our majority today says they mean, we would not be precluded by stare decisis, or any doctrine or other principle of law, from overruling those post-1908 decisions insofar as our construction of the 1908 Constitution is involved. While I grant we would be bound to accord the 1963 Constitution a meaning consistent with our own prior decisional rulings pertinent to the constitutional language to be construed, and even when convinced that such prior decisions were erroneous, the assumption being that the delegates and people in adopting such constitutional language relied upon those decisions, no such consideration would limit our power or our duty, as I see it, to reconsider the law declared in those decisions were we construing the 1908 Constitution.\n\nThat brings me now to the decisions themselves and the accuracy of our majority's claims for them. Our majority says that in those cases we held that self-liquidating bonds, revenue bonds, are not within the reach of the 1908 Constitution's prohibition against the State's becoming interested in works of internal improvement. Gilbert v. City of Traverse City (1934), 267 Mich 257, does not so hold. The case involved issuance of self-liquidating bonds by Traverse City to finance a municipal harbor and park development on Grand Traverse Bay. It was claimed that such a project violated article 10, § 14 of the 1908 Constitution because it was a work of internal improvement not among those then expressly authorized by the section. Contrary to our present majority's implication, the Court did not hold that such a project was not a work of internal improvement prohibited by the Constitution, nor did it hold, nor even infer, that works of internal improvement financed by self-liquidating bonds were beyond the reach of section 14's prohibition. Instead, and without further Discussion, it held article 10, § 14 not applicable to the proposed project because \"The project in question seems to be authorized by article 8, § 22, conferring upon cities the power to construct and maintain parks and other works which involve the public health and safety.\" 267 Mich 257, 261.\n\nTwo years later, the Court decided Attorney General, ex rel. Eaves, v. State Bridge Commission (1936), 277 Mich 373. In that case the validity of PA 1935, No 147, was challenged. It was that act which authorized construction and operation of the Blue Water bridge between Port Huron and Sarnia and its partial financing by issuance of revenue bonds. Among the many claims made against the constitutionality of the act was the claim that it violated the prohibition against works of internal improvement contained in article 10, § 14 of the 1908 Constitution. Whereas in Gilbert, supra, as noted above, the Court planted its decision that the Traverse City project, financed also by revenue bonds, was not prohibited by article 10, § 14 because expressly authorized by article 8, § 22, in Eaves, the Court cryptically decided that Act No 147 did not contravene article 10, § 14 because \"We held in Gilbert v. City of Traverse City, supra, that a self-liquidating project was not prohibited by the foregoing section of the Constitution.\" 277 Mich 373, 383. That this was not the rule of law of Gilbert is crystal clear, although it cannot be faulted as a description of the result in that particular case. Yet, in Eaves that cryptic description of result in Gilbert was misstated as the law of the case and summarily applied to Eaves. The Eaves decision on this point is troublesome for another reason. As in Gilbert, where the Court held that article 10, § 14 does not prohibit that which another provision of the Constitution expressly authorizes, so in Eaves the Court could have decided that case, consistent with Gilbert, by holding that article 10, § 14 did not prohibit the construction of the bridge, as an internal improvement, since article 8, § 26 of the 1908 Constitution, previously quoted by the Court in Eaves, expressly authorized construction of bridges.\n\nThe Court's error in Eaves was compounded in Oakland County Drain Com'r v. City of Royal Oak (1943), 306 Mich 124, a case in which, among other things, it was claimed that a self-liquidating sewage disposal system was an internal improvement within the ban of article 10, § 14. After deciding, upon ample authority, that drains necessary for public health were not internal improvements of the kind prohibited by article 10, § 14, the Court gratuitously added, as obiter dictum, at p 142:\n\n\"Furthermore, the establishment and operation of the proposed sewage disposal system is hereinafter determined to be a self-liquidating project, and we have repeatedly held that such a project is not a work of internal improvement and, therefore, not prohibited by the constitutional provision above quoted. See Attorney General, ex rel. Eaves, v. State Bridge Comm., 277 Mich 373; Gilbert v. City of Traverse City, 267 Mich 257.\"\n\nFinally, in City of Dearborn v. Michigan Turnpike Authority (1955), 344 Mich 37, at pp 74, 75, the Court summarily rejected a claim that the turnpike act, PA 1953, No 176, was in conflict with article 10, § 14 of the 1908 Constitution because it authorized a public corporation to engage in works of internal improvement by simple reference to the above quoted dictum from Oakland County Drain Com'r v. City of Royal Oak, supra.\n\nThose are the cases relied upon by today's majority, without analysis, to support a crucial portion of its decision under the 1963 Constitution. However immunized from judicial reconsideration those cases might be in construing the 1963 Constitution, and I do not concede this point yet, absent a much clearer showing of reliance thereon by the delegates who drafted the Constitution than is made in the majority's opinion, they are not immune from our reconsideration if and when we consider the initial validity of Act No 62 against the provisions of the 1908 Constitution which I believe were misconstrued by the Court in the cited cases.\n\nEnough has been said, I believe, even without consideration of other pertinent provisions of the 1908 Constitution, to indicate the magnitude of the error the Court commits today. It is twofold. First, the case manifestly is not ready for decision, the 1908 Constitution, clearly pertinent, having been ignored, inexplicably, by all parties and the Court's majority. Second, some of the cases relied upon by the Court's majority, when carefully analyzed, do not support the legal propositions for which they are cited.\n\nII.\n\nThere is yet another reason I cannot join in the Court's action today. While it may be argued plausibly that this Court should decide, in these truncated proceedings, the constitutionality of Act No 62, its possible significance to the economic life of our entire State considered, I can conceive of no valid reason for consideration and advisory decision now of the technical compliance of the proposed agreements between Gaylord and United States Plywood Corporation with the requirements of the act and the city's charter. These questions, also presented in vacuo, are perhaps significant to the parties to the proposed agreements, but hardly merit designation as questions \"of such public moment as to require early determination\" (GCR 1963, 797), before trial and decision by a circuit Judge. These are questions which bond counsel normally is expected to pass upon in connection with every bond issue and which courts ought not to be called upon to answer in advance as is here sought to be done. If answered in this case, on what basis shall we decline to give such advisory opinions in the future whenever a bond issue is proposed by any public body? See Mr. Justice Black's opinion in Connor v. Herrick (1957), 349 Mich 201, particularly his quotation, at 210, of Mr. Justice Brewer's opinion in Tregea v. Modesto Irrigation District (1896), 164 U.S. 179, 185-187 (17 S Ct 52, 41 L ed 395).\n\nConclusion.\n\nI recognize the importance of our majority's decision to this State's position in the competition among the States for industrial development. However, PA 1963, No 62 represents a very substantial departure from our traditional concepts of the constitutionally appropriate scope of involvement of State and local governments in the affairs of private business. Valid judgment entitled to public reliance requires more from the Court than our majority submits today. The case is before us prematurely; the briefs of counsel and our majority's opinion do not address themselves to the constitutional issues of threshold importance; that opinion perpetuates past decisional error without comment; and, finally, our majority unwisely undertakes, in these truncated proceedings, to validate in advance a proposed bond issue by writing an opinion it should be bond counsel's obligation first to write. For the foregoing reasons I Dissent from the Court's decision and, instead, would remand this cause for a complete testimonial hearing in the trial court.\n\nBlack, J. (for entry of order indicated below).\n\nOut of the titanic welter thus far written with respect to the questions certified to us, one unanimous verdict is sure to spring from the critical ken of such lawyers and Judges as are due to pore over these multifarious opinions. It is that this Court long since should have called for proceedings resulting in a further and better statement pursuant to GCR 1963, 797 (2). (See Appendix for this Rule.)\n\nMy vote accords with that verdict. It is cast in favor of an order directing necessary amendment of pleadings and for certification of additional questions aimed at test of PA 1963, No 62 by the Constitution of Michigan as same stood May 8, 1963.1a The necessitous nature thereof appears pointedly in the opinion of Justice Souris, initial discoverer after submission here that the Court was confronted by an insufficient certification of questions.\n\nI agree with Justice Souris that the validity of said Act No 62,2a the act having been made declaredly effective on the above date, is due properly for primary test by such constitutional provisions as were in effect at the time. True, a secondary question could arise and well might be certified after the defendant's answer has been amended. To state it: In event Act No 62 survives any newly certified assay under the former Constitution, was that act nullified in whole or in part by some or any provision of the Constitution of 1963?\n\nWith all deserving deference I Dissent from the sum of that which appears due -- at present writing -- for the unrestrictive endorsement of some if not an outright majority of the Brethren. Here it is, repeated for double exposure:\n\n\"We construe the language of the 1963 Constitution art 3, § 7, to have validated all laws that were in force and effect on January 1, 1964.\"\n\nWas Act No 62 \"in force and effect on January 1, 1964\"? Isn't it of due order that that question come to judicial answer prior to inquiry whether Act No 62 is \"repugnant to this Constitution\" (the current Constitution)?\n\nNow I have always understood, and hear no lawyer or jurist contend otherwise, that an unconstitutional statute though in form and name a law is from the beginning no law at all; that the unconstitutionality thereof dates from the time of enactment rather than the time of decision so branding it, and that it at no time became effective for any purpose, legal or otherwise. Hence, according to my book of constitutional law at least, if Act No 62 was unconstitutional when enacted and ordered effective in May of 1963,3a it can hardly be said -- seriously at least -- that said section 7 \"validated\" it seven months later.\n\nTo test the point assume that any statute enacted when the Constitution of 1908 was in effect (said Act No 62 included of course) had been questioned for validity under that Constitution with final judicial decision of unconstitutionality made prior to January 1, 1964. Assuming further that the tested statute is presently found \"not repugnant to this Constitution,\" would said section 7 \"validate\" what prior to January 1, 1964, was invalid? My answer is that said section 7 operated January 1, 1964, and operates presently only upon the common law and \"the statute laws now in force, not repugnant to this Constitution,\" and that it plainly has no legal or people-intended application to a statute unless that statute was in force when the new Constitution became operative.\n\nSince the delay caused by this discovered omission of pleading and resultant error of certification is due partly to our own failure to scan these certified questions thoroughly when and shortly after they arrived last November, I would offer the following possibly helpful alternative suggestion, to which is appended a statement of conviction respecting Justice Adams' treatment of the now mooted merits.\n\nThe governor, having moved exigently pursuant to said GCR 1963, 797, could recommend that the legislature repeal said Act No 62 with immediately effective re-enactment thereof according to its tenor. Should that be done I could and would indorse unconditionally the reasons for answers and the answers Justice Adams has given to these certified questions. Which is to say that, had the statute now scrutinized come to enactment after January 1, 1964, my signature would support the reasoning and answers Justice Adams has written prior to the \"Addendum\" portion of his opinion.\n\nSuch a result would leave for future litigation any question of validity of said Act No 62 that might arise in any instance where -- if at all -- the act has already been utilized. It would at the same time relieve an intensely expectant situation of which we are all cognizant; a situation to which Justice Souris has made appropriate reference in his opinion. Unless it is unavoidable we should not make the fathers of quite a few of our cities hold their municipal breath much longer. In the phrasing of Mark Twain (Letter from the Recording Angel), we credit such men \"up a thousand-fold\" in our own great record, \"on account of the strain,\" and now if at all feasible should effectively release that strain in some way, innovational or otherwise.\n\nTo avoid all possible misunderstanding my vote is cast in accordance with the second paragraph of this opinion.\n\nAPPENDIX.\n\nGCR 1963, 797, 373 Mich cxi, cxii.\n\nRule 797. Certified Questions.\n\n(1) Whenever the Judge or Judges of any court, or the officers of any tribunal, from which an appeal of right or otherwise may be taken to the Court of Appeals or to the Supreme Court, has pending before him or them any controlling question or questions of public law involved in a pending case or controversy, and such question or questions are of such public moment as to require early determination according to executive message of the governor addressed to the Supreme Court, the Supreme Court in its discretion may authorize such Judge or officers to certify such question or questions to the Supreme Court with a statement of the facts relevant thereto sufficient to make clear the application of such question or questions, and further proceedings relative to such case or controversy shall thereupon be stayed to such extent as the Judge or officers shall by order direct, pending receipt of an answer from the Supreme Court.\n\n(2) If any question is not properly stated, or if sufficient facts are not given to show the application thereof, the Supreme Court may require a further and better statement of the question and of the facts.\n\n(3) The answers given by the Supreme Court to certified questions shall be given in the ordinary form of opinions, to be published with other opinions of the Supreme Court.\n\n(4) After the answer of the Supreme Court has been transmitted to the court or tribunal from which the question was certified, the case or controversy shall be proceeded with or disposed of in accordance therewith.\n\n\u003cspan class=\"fn\"\u003e1. The questions were not so presented or briefed by either party, a practice of which we disapprove. Wherever this unusual procedure is invoked, the parties should address themselves to the questions as certified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See Attorney General, ex rel. Barbour, v. Pingree, 120 Mich 550, 554 et seq. (46 LRA 407); Campbell, Outlines of the Political History of Michigan, p 480 et seq. (1876); Cooley, Michigan, a History of Governments, p 279 et seq. (1905); Sagendorph, Stevens Thomson Mason, Misunderstood Patriot, p 317 et seq. (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This language includes both the State and local units of government. Attorney General, ex rel. Barbour, v. Pingree, supra, p 561. Also, see 2 Proceedings of the 1907-1908 Constitutional Convention, pp 1066, 1067; 2 Official Record, Constitutional Convention of 1961, p 2310.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 18 places a flat prohibition upon the lending of credit \"except as authorized in this Constitution.\" The predecessor of section 18, article 10, § 12, of the Constitution of 1908, did not contain this exception. Because of this, decisions involving municipalities under the 1908 Constitution relied upon both article 10, § 12, and article 8, § 25, which was directly applicable to local units of government. Skutt v. City of Grand Rapids, 275 Mich 258, 266; Sommers v. City of Flint, 355 Mich 655, 661. Under the 1963 Constitution, this is no longer required.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. CGSA, §§ 36-96(2); Ann L Mass., ch 168, § 43; 4 McKinney's Cons. L., Banking Law, § 235.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The proposed lease between Gaylord and United States Plywood places the sole burden of tort liability, insurance, and repair on the lessee corporation. A trustee will attend to the mechanics of collection of rent, segregation of funds, and payment of the bonds. However, in the proposed trust indenture the city will covenant to perform all duties placed upon it and agree to collect sufficient revenues and rental income to meet the requirements of the indenture. Numerous other duties are placed upon the city, such as enforcing compliance with the terms of the lease and reletting the facilities in the event of default by United States Plywood. Safeguards are provided by section 13 of PA 1963, No 62, which require the municipality to obtain permission from the municipal finance commission for the bond issue. The commission may request information from the municipality and section 13 lays down specific criteria to guide the commission in giving its approval. See CL 1948, § 125.1263 (Stat Ann 1965 Cum Supp § 5.3533[33]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Similarly, these dangers are encountered by revenue bonds issued by the State but nevertheless the bonds have been regularly held not to be pledges of the State's credit. See the recent case of Schureman v. State Highway Commissioner, 377 Mich 609, 611; Pinsky, State Constitutional Limitations on Public Industrial Financing: An Historical and Economic Approach, 111 Penn L Rev 265, 316.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The absolute character of this requirement does not diminish its flexibility. As Justice Cooley said, \"All governmental powers exist for public purposes, but they are not necessarily to be exercised under the same conditions of public interest. The sovereign police power which the State possesses is to be exercised only for the general public welfare, but it reaches to every person, to every kind of business, to every species of property within the commonwealth. The conduct of every individual and the use of all property and of all rights is regulated by it, to any extent found necessary for the preservation of the public order, and also for the protection of the private rights of one individual against encroachments by others. The sovereign power of taxation is employed in a great many cases where the power of eminent domain might be made more immediately efficient and available, if constitutional principles would suffer it to be resorted to; but each of these powers has its own peculiar and appropriate sphere, and the object which is public for the demands of one is not necessarily of a character to permit the exercise of another.\" People, ex rel. Detroit \u0026 H. R. Co., v. Township Board of Salem, 20 Mich 452, 478 (4 Am Rep 400). The requirement of public purpose has been most rigid when public money or property is involved. Attorney General v. Board of Supervisors of Bay County, 34 Mich 46, 47; Baker v. City of Grand Rapids, 142 Mich 687, 690; Younglas v. City of Flint, 345 Mich 576, 578; Cf. Sommers v. City of Flint, supra. The requirement has been less rigid when there was no chance the general taxing power could be reached. Gilbert v. City of Traverse City, 267 Mich 257, 261.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Opinion of the Justices, No. 120, 254 Ala 506 (49 So 2d 175); Newberry v. City of Andalusia, 257 Ala 49 (57 So 2d 629); DeArmond v. Alaska State Development Corporation (Alaska), 376 P2d 717; Andres v. First Arkansas Development Finance Corp., 230 Ark 594 (324 SW2d 97); Hackler v. Baker, 233 Ark 690 (346 SW2d 677); Roan v. Connecticut Industrial Building Commission, 150 Conn 333 (189 A2d 399); In re Opinion of the Justices, 54 Del 366 (177 A2d 205); State, ex rel. Ferguson, v. City of Pittsburg, 188 Kan 612 (364 P2d 71); Industrial Development Authority v. Eastern Kentucky Regional Planning Commission (Ky, 1960), 332 SW2d 274; Miller v. Police Jury of Washington Parish, 226 La 8 (74 So 2d 394); City of Frostburg v. Jenkins, 215 Md 9 (136 A2d 852); Albritton v. City of Winona, 181 Miss 75 (178 So 799, 115 ALR 1436); Opinion of the Justices, 103 NH 258 (169 A2d 634); Opinion of the Justices, 103 NH 325 (171 A2d 429); Roe v. Kervick, 42 NJ 191 (199 A2d 834); Village of Deming v. Hosdreg Company, 62 NM 18 (303 P2d 920); Gripentrog v. City of Wahpeton (ND 1964), 126 NW2d 230; Harrison v. Claybrook (Okla, 1962), 372 P2d 602; Opinion to the Governor, 79 RI 305 (88 A2d 167); cf. Opinion to the Governor, 88 RI 202 (145 A2d 87); Darnell v. County of Montgomery, 202 Tenn 560 (308 SW2d 373); McConnell v. City of Lebanon, 203 Tenn 498 (314 SW2d 12); Almond v. Day, 197 Va 782 (91 SE2d 660); State, ex rel. County Court of Marion County, v. Demus, 148 W Va 398 (135 SE2d 352).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe minority view is represented by the following: Beazley v. DeKalb County, 210 Ga 41 (77 SE2d 740); Hogue v. Port of Seattle, 54 Wash 2d 799 (341 P2d 171); Nash v. Town of Tarboro, 227 NC 283 (42 SE2d 209); Opinion of the Justices, 152 Me 440 (131 A2d 904); Opinion of the Justices to the Senate, 332 Mass 769 (126 NE2d 795); State, ex rel. Beck, v. City of York, 164 Neb 223 (82 NW2d 269); State, ex rel. Saxbe, v. Brand, 176 Ohio St 44 (197 NE2d 328); Village of Moyie Springs, Idaho, v. Aurora Manufacturing Company, 82 Idaho 337 (353 P2d 767); Village of Suring v. Suring State Bank, 189 Wis 400 (207 NW 944); State v. Town of North Miami (Fla 1952), 59 So 2d 779; State v. Suwannee County Development Authority (Fla 1960), 122 So 2d 190; State v. Clay County Development Authority (Fla), 140 So 2d 576; but see State v. Inter-American Center Authority (Fla 1955), 84 So 2d 9; and State v. Inter-American Center Authority (Fla 1962), 143 So 2d 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Constitution of 1835. Schedule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. All laws now in force in the territory of Michigan, which are not repugnant to this constitution, shall remain in force until they expire by their own limitations, or be altered or repealed by the legislature.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe following also appears in article 1 of the Constitution of 1835.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 21. All acts of the legislature contrary to this or any other article of this Constitution shall be void.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eConstitution of 1850. Schedule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 1. The common law and the statute laws now in force, not repugnant to this constitution, shall remain in force until they expire by their own limitations or are altered or repealed by the legislature.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eConstitution of 1908. Schedule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 1. The common law and the statute laws now in force, not repugnant to this constitution, shall remain in force until they expire by their own limitations, or are altered or repealed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Amending Const 1850, art 12, § 8. -- Reporter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. There were approximately 2,000 public acts in force when the 1963 Constitution went into effect. Many of those statutes contain numerous \"portions.\" Under PA 1945, No 119 (CL 1948, § 8.5 [Stat Ann 1961 Rev § 2.216]), or under the severability provisions contained in many acts prior to the enactment of that act, the Court would be obliged to determine which portions of an act were invalid and which were not and whether the valid portions could be given effect after the invalid portions had been severed. The magnitude of this task can be Judged from the fact that in 1948 there were 21,000 sections to the compiled laws. The number has, of course, since increased.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Index Digest of State Constitutions, pp 595, 596.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The procedure of adopting a great body of law along with the adoption of a Constitution is a common one. For example: The 1835 Michigan Constitution carried into Michigan law the laws in force in the Territory of Michigan. Const 1835, schedule, § 2. The Kentucky Constitution carried into effect in Kentucky laws in force in Virginia as of June 1, 1792. Constitution of Kentucky, paragraph 233. The New Hampshire Constitution carried into State law the laws of the colony usually practiced in courts of law. Constitution of the State of New Hampshire, part 2, art 90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 This proceeding is unique in the history of the Supreme Court. It is the first instance in which the Court has been asked for its advisory opinion pending trial of questions of public law as permitted by GCR 1963, 797.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 CL 1948, § 125.1251 et seq. (Stat Ann 1965 Cum Supp § 5.3533[21] et seq.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 \"§ 103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) General rule. -- Gross income does not include interest on --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the obligations of a State, a Territory, or a possession of the United States, or any political subdivision of any of the foregoing, or of the District of Columbia.\" Internal Revenue Code of 1954 (26 USCA, § 103[1]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 \"Sec. 7. The common law and the statute laws now in force, not repugnant to this constitution, shall remain in force until they expire by their own limitations, or are changed, amended or repealed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Note, however, that prior to adoption of Act No 62, in response to a request from the Honorable Joseph J. Kowalski, the speaker of the house of representatives, the attorney general issued a formal opinion on April 10, 1963, in which he considered and upheld the constitutionality of the then pending legislation against the limitations contained then in article 10, §§ 12 and 14 of the Constitution of 1908 and, in addition, proceeded to give his opinion that the counterpart provisions of the adopted but not yet effective 1963 Constitution, article 9, § 18, and article 3, § 6, also would not be violated. See OAG 1963-1964, No 4146, pp 75-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 See footnote 4, p 336, (supra) . For similar provisions in our preceding constitutions, see Const 1908, sched, § 1; Const 1850, sched, § 1; and Const 1835, sched, § 2. The records of the proceedings of the constitutional conventions which adopted each of Michigan's four constitutions disclose that the delegates did not consider in debate the meaning now urged for the cited provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 See 1 Constitutional Convention Record (1961), p 121.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 \"On order of the Court, the request of the governor under GCR 1963, 797, to certify the above case is Granted, subject to remand to the circuit court of Otsego county in the event it appears upon certification to this Court that the cause is not properly at issue as to all parties litigant, or that further proceedings in the circuit court are requisite for a complete record (Chief Justice Kavanagh and Justices Black and Souris Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Kavanagh, C. J., dissenting. I disagree with the order granting certification in the above matter for the reason the pending circuit court case is not in shape for certification to this Court; the attorney general has filed no pleadings on behalf of the people of this State; the taxpayers of Gaylord are not adversarily represented; and we should not be expected to hear and decide cases in a vacuum. I would deny the request of the governor until, and only until, the case is in shape for certification to this Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Black, J., dissenting. This pending Otsego county suit is not yet in shape for certification under GCR 1963, 797. The attorney general has filed no pleading and no proceedings have been taken to insure that the people of Michigan as well as the taxpayers of Gaylord are adversarily represented, as a class, under Court Rule 208. See Connor v. Herrick, 349 Mich 201, 204 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"I suggest -- yes gratuitously -- that the attorney general should provide a team from his staff to brief and argue the constitutional positions the defendant city clerk has taken plus any others such team may wish to submit. That was done when the first constitutional convention case was briefed and decided (People v. State Board of Canvassers, 323 Mich 523); also when the sales-tax use-tax case was briefed and argued (Lockwood v. Commissioner of Revenue, 357 Mich 517). It is a good way to assure that \"friendly\" lawsuits like this do not become cozy unto a sellout of those who receive no true day in court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The impeding factor here is due to failure of the Constitutional Convention of 1961-1962 to insert, in the new Constitution, a Massachusetts type grant of constitutional authority for issuance of advisory opinions when requested by the chief executive or by the legislature. (See Note *) Inclusion of such form of grant was, by at least one member of our Court, urged with considerable earnestness before the convention's committee upon the judicial branch.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNote * For at least a century the Massachusetts Constitution has provided as quoted below. True, the decisions in that State disclose that the provision is and has been employed with care, as well as sparingly. The point is that the provision is there, for use when needed. The provision:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Each branch of the legislature, as well as the governor and council shall have authority to require the opinions of the Justices of the supreme judicial court, upon important questions of law, and upon solemn occasions.\" (Massachusetts Constitution, art 2, chap 3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The Convention chose instead to insert the more restrictive provision which appears now as section 8 of article 3 of the Michigan Constitution of 1963. (See Note +) That provision was not put to use in this instance. It could not have been, the legislature having given immediate effect to the act of 1963 (No 62) which, in this Gaylord Case, is up for judicial scrutiny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNote + Opinions on constitutionality by Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Sec. 8. Either house of the Legislature or the Governor may request the opinion of the Supreme Court on important questions of law upon solemn occasions as to the constitutionality of legislation after it has been enacted into law but before its effective date.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is possible, the foregoing considered, that the circuit court record may yet be placed in shape for certification under GCR 1963, 797. Upon that thought I would deny certification without prejudice to future representations the governor may choose to forward pursuant to that rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Souris, J., dissenting. I would deny the request made by the governor in his executive message to this Court dated March 15, 1965. Certification of controlling questions of public law involved in a pending case or controversy for decision by this Court prior to decision in the trial court, pursuant to GCR 1963, 797, is a matter for discretionary action by this Court pursuant to the express provisions of the Rule. In my judgment such discretionary action should be exercised, if ever, only in circumstances of extreme emergency in which, for example, the most vital functions of government are threatened or the public peace and safety are in jeopardy. I am not persuaded that City of Gaylord v. Gaylord City Clerk presents any such circumstance warranting our abandonment of our traditional judicial procedures by granting the certification requested.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is not normally the business of this Court to render advisory opinions in a context divorced from the adversary trial court proceedings traditional to the common law. Such function properly remains the duty of the attorney general when the State's interest is involved. Except in the rare circumstances mentioned above and when, upon solemn occasions, we may be requested, as provided in article 3, § 8 of the Constitution of 1963, by either house of the legislature or by the governor for our opinion upon the constitutionality of legislation enacted but not yet effective, I would decline respectfully all requests such as made herein to truncate the traditional judicial process experience throughout the centuries has proved best suited to the accomplishment of Justice.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Although reference was made only to the State's credit, the ban was held applicable, as well, to the political subdivisions of the State. See Oakland County Drain Com'r v. City of Royal Oak (1943), 306 Mich 124, 139, 140; and Sommers v. City of Flint (1959), 355 Mich 655, 663.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a This is not to suggest that a trial is requisite to solution of the issues posed by the pleadings and our said opinions. The controlling constitutional questions by their nature are readily certifiable and determinable without the taking of proof. They arise exclusively upon the compared faces of a statute and such constitutional provisions as are found applicable; not upon circumstances which require proof.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a Nonfederal validity, I would cautiously add.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a A question we cannot decide in the absence of additional certification or appeal following appropriate amendment of the defendant clerk's answer.\u003c/span\u003e\n\n",
    "body_length": 146909,
    "citedas": [
      "144 N.W.2d 460",
      "378 Mich. 273"
    ],
    "attorneys": "Boyd C. Baird, Gaylord City Attorney, (Miller, Canfield, Paddock \u0026 Stone, of counsel), for plaintiff. Frank J. Kelley, Attorney General, Robert A. Derengoski, Solicitor General, Eugene Krasicky and James J. Wood, Assistant Attorneys General, for the State of Michigan, intervenor. Walsh \u0026 O'Rourke (Daniel F. Walsh, of counsel), for defendant.",
    "category": [],
    "judges": "Adams, J. O'Hara, J., concurred with Adams, J. T. M. Kavanagh, C. J. (in Agreement). Dethmers, Kelly, and Smith, JJ., concurred with Kavanagh, C. J. Souris, J. (minority OPINION(S)ing). Black, J. (for entry of order indicated below).",
    "citation_count": 0
  }
}
