{
  "id": "LJA9QmYBTlTomsSBo1XT",
  "document": {
    "title": "MALNAK v. YOGI",
    "full_title": "Alan B. MALNAK et al., Plaintiffs, v. Maharishi Mahesh YOGI et al., Defendants",
    "jurisdiction": "D. New Jersey",
    "date": "1977-10-20T00:00:00.000Z",
    "docket": "76-341",
    "body": "MEANOR, District Judge.\n\nPlaintiffs move for partial summary judgment to enjoin the teaching of the \"Science of Creative Intelligence\" in the public schools of New Jersey on the ground that such teaching violates the Establishment Clause of the First Amendment. The material facts are not contested, although the parties vigorously dispute the significance of those facts.\n\nThe suit involves 12 named plaintiffs and 20 named defendants. Plaintiffs include eight individuals who pay federal income taxes and are liable to pay state sales taxes and, in some cases, local property taxes. Four of the taxpayers are the parents of two children who attend one of the high schools at which the course was offered; they sue in their own behalves and as guardians ad litem for their children. The eight taxpayers comprise an unincorporated association known as the Coalition for Religious Integrity, which also is a named plaintiff in this action. The remaining plaintiffs are a clergyman who lives in New Jersey, Americans United for Separation of Church and State, a nonprofit Maryland corporation, and Spiritual Counterfeit Project, Inc., a nonprofit California corporation.\n\nThe first group of defendants are organizations and individuals who are engaged in the dissemination of the Science of Creative Intelligence and in the propagation of the technique of Transcendental Meditation. The organizational defendants are three California corporations and a division of one of the corporations. These defendants seek to disseminate SCI/TM throughout the United States, primarily through the World Plan Executive Council -- United States (WPEC-US) and its divisions. At the national level, the organizational structure of a World Plan Executive Council with several divisions apparently occurs in a number of countries throughout the world. See Jarvis Deposition at 786. International organizations devoted to the propagation of SCI/TM exist. The structure of the \"international level\" is changing and the relationship between the international and national organizations is nebulous.\n\nThe organizations, primarily under the auspices of the WPECs throughout the world, are implementing a \"World Plan\" which \"is in progress to train one teacher of the Science of Creative Intelligence for every one thousand people in all parts of the globe.\" Fundamentals of Progress, Exhibit A attached to Jarvis Affidavit, at 2. The \"World Plan\" has seven stated goals:\n\n(1) To develop the full potential of the individual;\n\n(2) To improve governmental achievements;\n\n(3) To realize the highest ideal of education;\n\n(4) To eliminate the age-old problem of crime and all behavior that brings unhappiness to the family of man;\n\n(5) To maximize the intelligent use of the environment;\n\n(6) To bring fulfillment to the economic aspirations of individuals and society;\n\n(7) To achieve the spiritual goals of mankind in this generation.\n\nId. The named organizational defendants presumably are entrusted with implementing the \"World Plan\" within the United States. The individual defendants are officers of these corporations, a person who taught the SCI/TM course in New Jersey high schools, and Maharishi Mahesh Yogi, the principal deviser of the Science of Creative Intelligence and primary exponent of Transcendental Meditation. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\"\n\nThe five boards of education which arranged for the teaching of the SCI/TM course at high schools within their jurisdictions also are named as defendants. The New Jersey Department of Education and the New Jersey Board of Education, as well as the Commissioner of Education, an individual employee of the Department of Education, and the State of New Jersey itself are sued. In addition, the United States Department of Health, Education and Welfare and the United States are named as defendants.\n\nPlaintiffs base their motion for partial summary judgment on the textbook used in the New Jersey high schools, a ceremony at which attendance by the student is mandatory, the deposition testimony of the president of the WPEC-US, the deposition testimony of two people who taught the SCI/TM course in four of the five high schools at which the course was offered, and a one-page affidavit of a clergyman.\n\nIn opposing the motion for partial summary judgment, defendants rely on the same deposition testimony relied upon by plaintiffs and the deposition testimony of three clergymen-practitioners of the TM technique and the deposition testimony of an employee of the United States Office of Education. In addition, defendants rely on affidavits of the president of the WPEC-US, of two teachers of the SCI/TM course in New Jersey high schools, of a linguist, of two professors of religion, and of eleven New Jersey high school students who were enrolled in the SCI/TM course.\n\nTranscendental Meditation, briefly stated, is a technique of meditation in which the meditator contemplates a meaningless sound. Defendants have placed in the record the result of tests which purport to show that a meditator undergoes certain physiological changes during meditation. Other tests purport to show that practitioners of the technique will develop permanent changes in their physiologies, e.g., lowered heart rate and lowered breathing rate.\n\nThe \"Science of Creative Intelligence\" is a theory, devised or promulgated primarily by defendant Yogi, which purports to explain what occurs within a meditator's mind during meditation and to describe an entity or concept which defendants call \"creative intelligence.\" The \"Science of Creative Intelligence\" posits that during transcendental meditation a meditator reverses the process through which thought develops until the meditator's mind reaches the entity, or \"field of life,\" called \"the field of pure creative intelligence,\" which is at the source of thought, according to the World Plan defendants. The textbook used in the New Jersey high schools states the above, but devotes most of its pages to a description of the nature and qualities of the entity called \"creative intelligence.\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nAs stated above, the SCI/TM course was offered as an elective course at five high schools in New Jersey during the 1975-76 academic year. The students at all five high schools used the same textbook and received their mantras, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" or sound aids, at identical ceremonies. The SCI/TM course was taught four or five days a week by teachers trained by the World Plan defendants. The teachers were paid by the WPEC-US and were not employed by any of the five defendant school boards nor certified by the State Board of Examiners. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Aaron Deposition at 621. The SCI/TM course was the only course taught by the SCI/TM teachers.\n\nThe undisputed material facts upon which plaintiffs rely and from which plaintiffs assert that the only conclusion possible is that teaching of the SCI/TM course violates the establishment of religion clauses of both the United States and New Jersey constitutions are the textbook and the puja \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" used in the course.\n\nTHE TEXTBOOK\n\nThe \"Science of Creative Intelligence\" as a course of study had its genesis in 1972 when \"Maharishi, in conjunction with experts in education and science, developed a structure of teaching which was labeled the Science of Creative Intelligence.\" Jarvis Deposition at 913. As stated above, the \"Science of Creative Intelligence\" posits that during the practice of Transcendental Meditation the meditator's mind moves from a conscious thought to the source of thought, where the mind comes in contact with the unmanifest and unbounded field of pure creative intelligence, T at 29, \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" which is present, among other places, within every human being. T at 26. Defendants state that attainment of contact with the field of pure creative intelligence places the meditator in a \"fourth state of consciousness\" known as \"restful alertness\" or \"transcendental consciousness.\" T at 30. The textbook states that during TM the meditator experiences the field of pure creative intelligence directly. T at 29. Contact with the field of pure creative intelligence infuses the meditator's mind both with creativity, T at 26, and with \"all the qualities of creative intelligence,\" T at 38, clarifies and strengthens the meditator's thoughts, T at 32, expands the meditator's perceptions, T at 30, and \"refines\" the meditator's nervous system, Jarvis Deposition at 866a. Regular practice of TM will \"refine\" the meditator's nervous system further so that the expanded perceptions experienced during TM will carry over into the meditator's conscious thoughts and activities. T at 38, 86. Regular practice of TM may lead the meditator to the situation in which the meditator's mind is infused with the \"expanded awareness\" and perceptions that he experiences while meditating during waking, sleeping, and dreaming; this state is called \"cosmic consciousness,\" or \"the fifth state of consciousness.\" T at 86. See Jarvis Deposition at 866b. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nThe textbook states that \"[the] field of pure creative intelligence is the home of all qualities that constitute the universe,\" T at 292; \"all the qualities of which we can conceive are present in the unmanifest field of pure creative intelligence.\" T at 40. The field of pure creative intelligence also is the source of thought. T at 26, and \"a field of unlimited energy, intelligence and happiness.\" T at 56. The field of pure creative intelligence also is \"unbounded.\" T at 24, and \"an inexhaustible reservoir of energy and intelligence, the fountainhead of all currents of creative intelligence.\" T at 26. The textbook defines \"creative intelligence\" as \"that impelling force which continually gives rise to new expressions of life and order, progressive and evolutionary in nature.\" T at 20. Thus creative intelligence is a force which springs from the field of pure creative intelligence, e.g., T at 26, which is the source of everything in the universe, e.g., T at 26, 40, 260.\n\nCreative intelligence, like the unbounded field of pure creative intelligence, possesses all the qualities that can be conceived of: \"Every quality that is ever expressed in creation is the expression of creative intelligence.\" T at 40. The textbook specifically lists and discusses fifty \"qualities of creative intelligence.\" \"The qualities of creative intelligence can be seen as currents of consciousness arising from the field of pure consciousness, the field of pure creative intelligence.\" T at 40. The unbounded field of pure creative intelligence is unmanifest and silent. E.g., T at 29, 40. Creative intelligence ranges from the unmanifest field of pure creative intelligence to its manifestations in the universe. T at 22. Manifestations of creative intelligence include everything. \"From the individual to the universe, all that we see is the display of creative intelligence.\" T at 240. The textbook devotes 225 pages to the discussion of fifty specific \"qualities of creative intelligence.\" The textbook states that \"[when] the conscious mind reaches the field of pure creative intelligence, it becomes saturated with all qualities of creative intelligence . . . .\" T at 38. The fifty qualities of creative intelligence which are discussed in the textbook are progress, evolution, purposefulness, intelligence, order, beauty, precision, truth, dynamism, rest, stability, adaptability, gentleness, strength, efficiency, kindness, independence, helpfulness, vigilance, resourcefulness, spontaneity, analysis, synthesis, decisiveness, sweetness, universality, harmony, diversity, joy or happiness, life or liveliness, insight, foresight, thoughtfulness, specificity, expansiveness, courage, generosity, economy, love, justice, cleanliness, purity, freedom, responsibility, creativity, eternity, practicality, success, holism, and fulfillment. The textbook states that during meditation, the meditator's mind\n\nbecomes saturated with all qualities of creative intelligence, and then, in whatever area of living these qualities are needed, they express themselves more. That is why when a man meditates, he becomes more efficient in every field of thinking and decision-making, more capable in any undertaking he may choose. Wherever he puts his attention, he begins to display more expressed values of creative intelligence.\n\n* * *\n\nOne point that should be emphasized is that the qualities of creative intelligence develop very naturally and spontaneously through regular contact with the field of pure creative intelligence.\n\nWe should never try to exhibit qualities of creative intelligence, because their expression must be spontaneous. Every breath of life is spontaneously under the control of creative intelligence, and therefore any trying from our side can only result in stress and strain. Life must be lived very spontaneously, very naturally. We experience in our meditation how very naturally the mind arrives at the goal of all progress, unbounded awareness. We know from our experience how the slightest effort on our part not only stops progress but produces stress. Therefore, we should never try to imitate any quality of creative intelligence. We simply meditate and allow all the qualities of creative intelligence to be displayed spontaneously in our thinking and action.\n\nT at 38. The textbook thus states that a person attains the qualities of creative intelligence, e.g., truthfulness, efficiency, freedom, through regular contact with the field of pure creative intelligence during the practice of Transcendental Meditation. The process is automatic: \"We simply meditate and allow all the qualities of creative intelligence to be displayed spontaneously in our thinking and action.\" Statements of the automatic nature of the process of infusing an individual with all the qualities of creative intelligence through Transcendental Meditation appear throughout the textbook. E.g., T at 49, 260.\n\nThe textbook states that Transcendental Meditation is not only the automatic means of attaining all the qualities of creative intelligence, but also is the exclusive manner of obtaining all the qualities of creative intelligence. See T at 94, 132, 217, 262. In this connection, the above-quoted passage states that \"[we] should never try to exhibit qualities of creative intelligence, because their expression must be spontaneous.\" Since these qualities must be expressed spontaneously and since spontaneous expression of these qualities is developed only through the practice of Transcendental Meditation, it follows that \"we should never try to imitate any quality of creative intelligence.\" The textbook thus appears to indicate that a person should never consciously strive to be kind, truthful, brave, independent, successful, etc. Rather, \"[we] simply meditate and allow all the qualities of creative intelligence to be displayed spontaneously in our thinking and action.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" T at 38.\n\nThe textbook states that the field of pure creative intelligence is the source of everything. For example, the textbook states that the field of pure creative intelligence \"is the very source of life-energy, the reservoir of wisdom, the origin of all power in nature, and the fountainhead of all success in the world.\" T at 98. The textbook states that the field of pure creative intelligence \"is the home of all qualities that we can conceive of in the fields of knowledge and action, existence and evolution.\" T at 260. \"The field of pure creative intelligence is the home of all qualities that constitute the universe.\" T at 292. \"[Everything] in creation is nothing other than the expression of unmanifest creative intelligence.\" T at 260. \"[Every] quality that is ever expressed in creation is the expression of creative intelligence.\" T at 40. \"[All] aspects of life [are] all manifestations of unmanifest creative intelligence.\" T at 262. \"The entire field of life, from the individual to the cosmos, is nothing but the expression of never-changing pure creative intelligence in the relative ever-changing expressions of life.\" T at 92. The field of pure creative intelligence \"is at the basis of the 'comprehensive, orderly integrity of the universe.'\" T at 174, quoting from a speech given by Maharishi Mahesh Yogi in 1971. The textbook is replete with statements that pure creative intelligence is \"the basis of life\" or \"at the basis of life.\" E.g., T at 78, 107, 129, 188, 242, 245, 260, 264, 271. For example, the textbook states that the field of pure creative intelligence is \"the universal basis of life.\" T at 188, 129. The textbook also indicates that pure creative intelligence is \"the source, course, and goal of all existence.\" T at 171. The citations to the textbook listed above by no means form an exhaustive list of statements attributing the source of everything to the field of pure creative intelligence. Among other qualities specifically mentioned as having their source in the field of pure creative intelligence are thought, e.g., T at 26, 30, 62, 162, 242, activity, T at 32, 102, 192, feelings, T at 102, and \"all cultural traditions and values,\" T at 245. This list also is not exhaustive of the specific qualities which the textbook states have their source in the field of pure creative intelligence.\n\nDefendant Jarvis, president of World Plan Executive Council -- United States, agreed in deposition testimony that pure creative intelligence is the source of all creation, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" but stated that \"[it] is the source in that it is the ultimate constituent.\" Jarvis Deposition at 1050. Defendant Jarvis thus attributed a passive role to the entity of \"level of life,\" Jarvis Deposition at 1019, called pure creative intelligence. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" As stated in the textbook and reiterated by defendant Jarvis, the field of pure creative intelligence is the source of creative intelligence, which possesses all the qualities of pure creative intelligence. E.g., T at 40; Jarvis Deposition at 1036. Creative intelligence is the \"impelling life force,\" T at 86, which expresses all the qualities in the universe, which are contained in the field of pure creative intelligence. Creative intelligence ranges from its source in the unmanifest field of creative intelligence to activity in all manifest aspects of life. See T at 20. Creative intelligence is coextensive with the field of pure creative intelligence in the sense that both the field of pure creative intelligence and creative intelligence contain \"all the qualities of which we can conceive.\" T at 260. Creative intelligence manifests itself in all aspects of the universe while the field of pure creative intelligence remains always unmanifest, at the core of everything in the universe. T at 292. Creative intelligence thus can be seen as an active extension or projection of the field of pure creative intelligence.\n\nWhile the field of pure creative intelligence is described as silent, nonchanging, and immovable, the textbook describes creative intelligence as perpetually active in all aspects of the universe. In scores of places, the textbook ascribes activity to creative intelligence, and to qualities of creative intelligence. Identifying creative intelligence as \"this impelling life force,\" T at 86, the textbook later states that creative intelligence \"guides and sustains every aspect of the universe.\" T at 174. The textbook asserts that \"the activity of nature is conducted by creative intelligence.\" T at 114. \"Every breath of life is spontaneously under the control of creative intelligence . . . .\" T at 38. \"Creative intelligence is always giving an evolutionary direction to our thoughts, feelings, and actions.\" T at 52. \"Creative intelligence is always gracefully arranging the parts of our life to form a pleasing whole.\" T at 62. \"We discover that the creative intelligence that structures the blueprint of life in our genes also regulates the movements of the far-distant galaxies and inspires a musician to give expression to the fullness of life.\" T at 171. The textbook refers to the \"activating power of creative intelligence,\" T at 60, 65, to the \"inherent activity\" of creative intelligence, T at 82, and to the \"endless creative activity of creative intelligence,\" T at 240, and states that creative intelligence \"perpetually creates.\" T at 242. \"Creative intelligence is always acting, ever vigilant to unfold its unbounded resources in every particle of existence.\" T at 126, see, e.g., T at 110, 128.\n\n\"Creative intelligence has structured the body in a manner that allows unbounded awareness to display its full value and enjoy the play of life.\" T at 224. \"It is the love of a mother for her children that inspires her to greatness. Creative intelligence instills unbounded love in her, and this spontaneously generates the limitless creativity and energy needed for all her activities.\" T at 270. \"Creative intelligence is comforting. It provides a family to soothe and nourish us.\" T at 274. \"Creative intelligence is life-supporting. It creates a society that strengthens and upholds the fullness of life in each of its members.\" T at 282. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\"\n\nIn addition to the ascription of activity to creative intelligence, anthropomorphism pervades the textbook's description of creative intelligence. Twenty-five of the text-book's thirty-two lessons begin with the assertion that creative intelligence possesses certain qualities. For example, \"[creative] intelligence is thoughtful and spontaneous,\" T at 160, \"[creative] intelligence is loving and just,\" T at 214, \"[creative] intelligence is decisive and sweet,\" T at 178, \"[creative] intelligence is precise and truthful,\" T at 72, \"[creative] intelligence is independent and helpful,\" T at 250. While all the qualities attributed to creative intelligence by the textbook are not exclusively human characteristics, some of them are. For example, neither an animal nor a plant nor an inorganic element nor a law of nature could be said to be thoughtful, just, and truthful. The textbook also anthropomorphizes creative intelligence in many other statements. For example, the textbook states that \"[even] when we are asleep, creative intelligence is awake, working to refresh us.\" T at 128.\n\nAmong the other characteristics of creative intelligence is omnipotence. In addition to stating repeatedly that \"everything in creation is nothing other than the expression of unmanifest creative intelligence,\" T at 260; see, e.g., T at 92, the textbook states that the field of pure creative intelligence is \"the origin of all power in nature.\" T at 98, and that \"the activity of nature is conducted by creative intelligence.\" T at 114. The textbook speaks of \"the unlimited power of creative intelligence.\" T at 108. On the same page, the textbook states that creative intelligence \"accomplishes all great things with no effort.\" Id. A few pages later, the textbook states that \"creative intelligence is able to accomplish everything effortlessly by remaining behind the scenes of relative life.\" T at 118. The textbook states that creative intelligence is self-sufficient and self-illuminating. T at 122, 118. Although self-sufficiency and self-illumination are not necessarily aspects of omnipotence, the context of ultimateness and universality in which the textbook speaks of creative intelligence -- \"universal existence,\" T at 292 -- eliminates all possible conclusions except that the self-sufficiency and self-illumination of creative intelligence is absolute and all-encompassing.\n\nThe textbook refers to the field of pure creative intelligence as \"the universal basis of all knowledge,\" T at 189, \"the home of all knowledge,\" T at 149, 189, and \"the stable basis of all knowledge.\" T at 97. The textbook asserts that creative intelligence \"[upholds] all the different fields of knowledge and every expression of life.\" T at 172. The textbook states that\n\nthe activity of nature is conducted by creative intelligence, by that comprehensive, unbounded intelligence, by that enormous computer which takes into account all possible avenues in designing a single channel of action. Because every activity of nature is taken into account and is guided by creative intelligence, nature takes the shortest course.\"\n\nT at 114. It is true, as pointed out by defendants' counsel at oral argument, that a mundane computer is not omniscient because it contains only that data which has been fed into it. A self-activating computer which is \"the home of all knowledge,\" however, is omniscient by definition. The textbook also asserts that the field of pure creative intelligence is \" the reservoir of wisdom.\" T at 98 (emphasis supplied).\n\nCreative intelligence is omnipresent, according to the textbook. Attestations of the omnipresence of creative intelligence appear scores of times throughout the textbook. For example, in \"Lesson 1\" the textbook states that \"creative intelligence is present everywhere, within us as well as outside us.\" T at 23. In the central section of the textbook appears the following passage:\n\nCreative intelligence is universal and specific.\n\n* * *\n\nIt is present in all forms, words, smells, tastes, and objects of touch. In all objects of experience, in all senses of perception and organs of action, in every phenomenon, in the doer and the work done, in all directions -- north, south, east, and west -- in all times -- past, present, and future -- it is uniformly present. In front of man, behind him, to the left and right of him, in him -- everywhere, and under all circumstances, creative intelligence is permeating everything.\"\n\nT at 186. Four pages from the end of the textbook, the book states that \"creative intelligence is present everywhere, deep within everything as well as on the surface.\" T at 292.\n\nCreative intelligence is eternal, according to the textbook. The textbook states that the field of creative intelligence \"has existed for all times. It is, always has been, and always will be the nonchanging basis of life, the fountainhead of all currents of creativity.\" T at 242. The textbook asserts that creative intelligence has existed \"in all times -- past, present, and future . . ..\" T at 186. The textbook asserts:\n\nFrom the individual to the universe, all that we see is the display of creative intelligence. It is an all-time reality; it goes on and on. And because it is creative, it keeps on creating. In its perpetual play the creation goes on, on the steps of progress. There is no end to it.\n\nT at 240.\n\nThe textbook states repeatedly that creative intelligence is both unmanifest or unseen, e.g., T at 30, 41, 107, 132, 252, 295, and unbounded or illimitable or infinite, e.g., T at 24, 44, 74, 100, 126, 157, 180, 208, 244.\n\nThe textbook frequently uses synonyms for creative intelligence and for the field of pure creative intelligence. For example, the textbook refers to the field of pure creative intelligence as \"pure intelligence.\" T at 257. In one passage the textbook refers to the field of pure creative intelligence first as \"pure intelligence\" and in the following line of type as \"intelligence.\" T at 82. Numerous additional references to the field of pure creative intelligence as simply \"intelligence\" appear throughout the textbook. E.g., T at 56, 60, 62, 89, 114, 157, 172. The textbook also refers to the field of pure creative intelligence as \"the unbounded reservoir of intelligence.\" T at 102.\n\nThe field of pure creative intelligence alternatively is called \"the field of unlimited happiness,\" T at 32, 56, and \"the unbounded ocean of bliss,\" T at 152; see T at 80, and \"that field of unbounded bliss-consciousness,\" T at 122. The field of pure creative intelligence is \"a field of unbounded happiness.\" T at 162. The textbook gives creative intelligence the synonym \"bliss-consciousness.\" E.g., T at 55, 144. During the practice of Transcendental Meditation, bliss-consciousness, or creative intelligence, is said to \"infuse\" and \"saturate\" the meditator's mind. T at 38, 55, 56, 145, 180, 221; see, e.g., T at 95.\n\nThe textbook synonymously refers to the field of pure creative intelligence as \"universal existence,\" T at 292, and \"perfection of existence,\" T at 118. The textbook labels the unmanifest field of pure creative intelligence as \"the most fundamental field of life.\" The textbook describes the field of pure creative intelligence as \"the unmanifest center of life,\" T at 36, \"the unmanifest field of life,\" T at 41, \"the nonchanging basis of life,\" e.g., T at 74, 98, \"the universal basis of life,\" T at 188-89, 129, \"the wholeness of life,\" e.g., T at 178, 262, \"the holistic field of life,\" T at 262, \"the holistic basis of life,\" T at 264. The field of pure creative intelligence repeatedly is called the \"basis of life,\" e.g., T at 245, 107, and the textbook uses \"the source of life\" as a synonym for the field of pure creative intelligence. See T at 78. See also Jarvis Deposition at 1035.\n\nAnother aspect of the field of pure creative intelligence is that it is \"full.\" The textbook uses the word \"fullness\" as a synonym for the field of pure creative intelligence. For example, the textbook states that \"[the] fullness from which creativity begins is the unmanifest aspect of intelligence. From that fullness the waves of creative intelligence arise and dance into manifestation.\" T at 22. In other sections of the book, the textbook states that creativity begins in the field of pure creative intelligence and that the waves or currents of creative intelligence also arise from the field of pure creative intelligence. E.g., T at 121, 242. The textbook, especially in the first lesson, states repeatedly that \" fullness is the source, course, and goal of existence and progress.\" E.g., T at 22 (emphasis in original). The textbook later equates \"the unbounded wholeness of pure creative intelligence\" with \"the source, course, and goal of all existence.\" T at 171. The textbook equates \"the goal of all growth and progress\" with \"the unbounded field of pure creative intelligence.\" T at 44. The subtitle for Lesson 27 is \"Applying Fullness for Success in Life.\" T at 250. The text of Lesson 27 speaks of applying the field of pure creative intelligence for success in life, thus substituting that phrase for the word \"fullness.\":\n\nWhen the unmanifest field of pure creative intelligence is incorporated in our awareness through regular practice of Transcendental Meditation, it can be practically applied in all phases of relative life; so we spontaneously succeed in every undertaking.\n\nT at 252. Another instance of synonymous use of \"fullness\" and \"the field of pure creative intelligence\" occurs when the textbook refers to both terms as the \"nature of life.\" In Lesson 7, the textbook states that during the practice of Transcendental Meditation \"we experience the true nonchanging nature of life.\" T at 74. In Lesson 27, the textbook states that \"the nature of life is fullness, bliss-consciousness . . . .\" T at 252.\n\nThe textbook states that the field of pure creative intelligence is perfect: \"The field of pure creative intelligence is self-sufficient. It is fullness of life, perfection of existence, and therefore unattached to anything in the relative field, free from the influence of action.\" T at 118. \"[No] sorrow can enter bliss-consciousness, nor can bliss-consciousness know any gain greater than itself.\" T at 144. The field of pure creative intelligence of course is pure and possesses all qualities in their pure form.\n\nThe textbook speaks of certain goals of man and nature. For example, the textbook teaches that \"the goal of life [is] perceiving the fullness of life in the waves of practical living.\" T at 250. The \"living of the fullness of life\" is the \"ultimate success\" of an individual. T at 257. The field of pure creative intelligence is the \"goal of all existence,\" as well as its source. T at 171. The textbook instructs that the \"true status\" of each individual's mind \"is unbounded bliss-consciousness.\" T at 55. If bliss-consciousness \"could become permanently established in the mind, the mind would have accomplished its ultimate purpose . . . .\" Id. Establishing bliss-consciousness in the mind of course occurs only through the practice of Transcendental Meditation. \"The purpose of man's life is to gain a state of unlimited energy, intelligence, power, creativity, and bliss.\" T at 52. If this is the purpose of man's life, how can this purpose be fulfilled? The textbook answers four pages later by stating that this purpose can be fulfilled by contacting the field of pure creative intelligence, T at 56, which is \"the inexhaustible fountainhead of energy, creativity, intelligence, and happiness,\" T at 121, and \"the origin of all power in nature.\" T at 98. It is \"the goal of all progress,\" T at 44, and \"[the] goal of all activity.\" T at 52.\n\nThe textbook frequently states that contact with the field of pure creative intelligence is the exclusive means of obtaining fulfillment. For example, \"[the] experience of the holistic field of pure creative intelligence is an experience of wholeness, fullness, which alone can bring fulfillment to every phase of life.\" T at 260. Continuing in the same vein, the textbook states:\n\nOur life has so many aspects. All the diverse aspects cannot possibly be attended to individually; fullness of life cannot be gained by amending the parts. What we can do is take care of the holistic value of creation, which lies in the unmanifest field of pure creative intelligence, by opening our awareness to it through Transcendental Meditation.\n\nT at 262.\n\nA fundamental teaching of the textbook is the existence of an unmanifest or uncreated level of life: \"LIFE RANGES FROM GROSS TO SUBTLE TO UNMANIFEST.\" T at 152; see, e.g., T at 41. The textbook explains:\n\nWe know from physics that physical existence is composed of many different layers. Beyond the gross surface level of the object are increasingly subtle layers of existence, one within the other -- molecular, atomic, subatomic. Beyond the subtlest level, of the object is the unmanifest, unbounded value of the object.\n\nT at 152. The unmanifest level of life is the field of pure creative intelligence: \"The ultimate reality of every object is unmanifest creative intelligence.\" T at 154.\n\nIn summary, the textbook teaches that there exists an unmanifest or uncreated field of life which is illimitable or unbounded or infinite. This field of life is present everywhere, both within and without everything and every abstraction in the universe. This field of life is active, has \"unlimited power,\" and encompasses all knowledge. This field of life is pure and perfect. Synonyms for this field of life are \"perfection of existence,\" bliss, and intelligence. This field of life is the field of pure love, see T at 218, pure truth, see T at 76, and pure justice, see T at 220. This field of being has always existed.\n\nDefendants seek to refute the statements in the textbook with conclusional assertions in affidavits and in their briefs the substance of which can be encapsulated thus: no matter what statements appear in the textbook, those statements are \"not intended or understood as an [ sic ] religion, religious study or study of God.\" Jarvis Affidavit para. 27. Although defendants' counsel stated at oral argument that he would not call the Science of Creative Intelligence either a philosophy or a science or a religion, defendants' affidavits and brief argue and state that the Science of Creative Intelligence is a \"philosophical study,\" Jarvis Affidavit para. 25, or \"essays in philosophy,\" Harned Affidavit para. 27; see Db at 24. Based on this assertion, defendants seek to dismiss Creative Intelligence as merely \"a philosophical idea,\" Harned Affidavit para. 28, or a \"philosophic concept,\" Jarvis Affidavit para. 46 \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" and Db at 29. The textbook directly and explicitly contradicts these statements: \"Creative intelligence is not just an abstract concept or idea; it is a concrete reality that can be practically applied to bring success and fulfillment to every phase of living.\" T at 250.\n\nIn their papers in opposition to plaintiffs' motion for summary judgment, defendants also select certain descriptions of creative intelligence from the textbook and attempt to refute their obvious meanings. Some of these attempted refutations are supported by imprecise and unpersuasive analogies; others stand as bald assertions of belief by the affiants.\n\nFor example, the textbook states that creative intelligence \"guides and sustains every aspect of the universe.\" T at 174. Defendants state:\n\nCreative intelligence is not understood or taught as sustainer of the universe in a religious sense. It \"guides and sustains\" in a scientific-philosophic sense, much in the same manner that gravity guides and sustains the path of the planets.\n\nJarvis Affidavit para. 36. The weakness of the analogy requires little comment. Unlike creative intelligence, gravity is not, inter alia, the source of life-energy, the home of all knowledge and wisdom, and the origin of all power in nature. See T at 98, 149. Unlike creative intelligence, gravity is not kind, or adaptable or practical; nor is gravity an ocean of love. T at 214, 216. Furthermore, gravity does not control everything in the manner in which the textbook states that creative intelligence does. For example, \"the activity of nature is conducted by creative intelligence . . . .\" T at 114. \"Every breath of life is spontaneously under the control of creative intelligence . . . .\" T at 38.\n\nThe textbook states that\n\nThe activity of nature is conducted by creative intelligence, by that comprehensive, unbounded intelligence, by that enormous computer which takes into account all possible avenues in designing a single channel of action.\n\nT at 114. Plaintiffs contend that this statement and a number of others in the textbook indicate that creative intelligence is \"the determining force of the universe.\" Defendants reply:\n\nNor is creative intelligence the determining force in the universe. It may be said to conduct \"the activity of nature\" in the same way that the DNA molecule conducts growth in the individual and may be likened to an \"enormous computer.\"\n\nJarvis Affidavit para. 37. Some of the problems with this weak analogy are similar to those encountered in the previous analogy. There is no reason to believe that DNA molecules are kind or that DNA molecules are an ocean of love or that DNA molecules are \"the ultimate reality\" of every object, movement, and activity. See T at 154, 192. Moreover, DNA molecules are tangible; they are not the product of someone's imagination or belief, i.e., they are not \"philosophic concepts\" or \"philosophical ideas.\" In addition, if DNA molecules can be said to contain the code or blueprint for the development of individual organisms, the textbook teaches that creative intelligence places that blueprint there: \"the creative intelligence that structures the blueprint of life in our genes also regulates the movements of the far-distant galaxies . . .\" T at 171. Not only does creative intelligence structure \"the blueprint of life in our genes,\" but also \"[creative] intelligence has structured the [human] body . . . .\" T at 224.\n\nDefendants state that \"bliss-consciousness\" is not intended or understood as a religious concept; rather it is merely a term to characterize experiences accompanying a specific level of personal growth.\" Jarvis Affidavit para. 38. The textbook's use of the term \"bliss-consciousness\" directly contradicts this definition of \"bliss-consciousness.\" At a number of points, the textbook uses \"bliss-consciousness\" as synonymous with creative intelligence. For example, \"[as] creative intelligence, bliss-consciousness, becomes more infused in the conscious mind, every object becomes more charming, because we are able to perceive more of its full value.\" T at 55. Again, the textbook states that \"[we] know that the true nature of the self is unbounded pure creative intelligence, bliss-consciousness -- that most self-sufficient field of life.\" T at 121. Still another example is the following quotation:\n\nIn cosmic consciousness a person's whole life is permeated by the light of pure creative intelligence. . . . He is established on that level of existence which is deep within everything -- that field of unbounded bliss-consciousness which is self-sufficient and self-illuminating.\n\nT at 122. Of course, \"that level of existence which is deep within everything\" is referred to elsewhere in the textbook as the field of pure creative intelligence. See, e.g., T at 292. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\"\n\nDefendants state:\n\nThe mere fact that qualities such as beauty, creativity, intelligence and orderliness, are associated with creative intelligence does not make creative intelligence the source of aesthetic values. A Rembrandt painting can be described using similar values, yet it is not the source of aesthetic values in a religious sense.\n\nJarvis Affidavit para. 39. To say that these qualities are merely \"associated with creative intelligence\" states a far more modest position than that taken by the textbook. According to the textbook, the field of pure creative intelligence is the \"home\" of all of these qualities as well as \"the home of all qualities that constitute the universe.\" E.g., T at 292. The field of pure creative intelligence and creative intelligence possess these qualities in their pure and perfect forms. For example, the textbook states that the field of pure creative intelligence is \"the field of perfect orderliness.\" T at 63. The textbook also states the field of pure creative intelligence is \"the source of all creativity.\" T at 242.\n\nThe implicit analogy to a Rembrandt painting is not well drawn. Surely no one would suggest that a Rembrandt painting is \"the source of all creativity,\" as the field of pure creative intelligence is said to be. Creativity, beauty, intelligence, and orderliness existed long before Rembrandt put brush to canvas. Neither has any Rembrandt painting \"existed for all times,\" as creative intelligence has; nor has any Rembrandt painting all the other qualities attributed by the textbook to creative intelligence. Finally and most obviously, a Rembrandt painting is a specific and tangible object, not an abstraction produced by belief or imagination.\n\nDefendants admit that creative intelligence is eternal and state that \"[purely] secular ideas and principles, such as freedom and the concepts of truth and justice, are eternal and 'go on and on,' devoid of religious connotations.\" Jarvis Affidavit para. 42. As with defendants' other analogies, one of the weaknesses with this one is that freedom, truth, and justice do not have the other characteristics attributed to creative intelligence by the textbook. For example, neither freedom nor truth nor justice is a \"concrete reality,\" T at 250, which \"can be contacted,\" T at 13, and which \"accomplishes all great things with no effort.\" T at 108. The textbook applies all three of the quotations to creative intelligence. Furthermore, the textbook states that freedom, truth, and justice are merely three of the multitude of qualities contained within the field of pure creative intelligence. E.g., \"justice is a quality of creative intelligence.\" T at 220; see, e.g., T at 72-81, T at 118-125, T at 214-221. Freedom, truth, and justice thus can be seen as eternal as aspects of creative intelligence just as a religious person could see these three concepts as being eternal as aspects of God. Indeed, a person who believes in the existences of both God and creative intelligence theoretically could see creative intelligence as an aspect of God. To an atheist, however, creative intelligence must take on the role of an ultimate essence or supreme being. While an atheist might be able to accept statements that freedom, truth, and justice all were eternal concepts with no relation to God, acceptance of the eternal existence of the field of pure creative intelligence or of creative intelligence, with all its extraordinary characteristics, would require the belief in an essence or being beyond human existence.\n\nDefendants contend that creative intelligence is not all-powerful: \"Creative intelligence is understood as 'the origin of all power' in the sense that the stability of mind and body which results from the practice of the TM technique, enables a person to be healthier, to exercise better judgment and thereby be more powerful.\" This statement differs substantially through understatement and truncation of the relevant textbook quotation from that which is stated in the textbook. The textbook asserts that the field of pure creative intelligence is \"the origin of all power in nature.\" T at 98. Defendants' statement, by truncating the quotation from the textbook, implies that creative intelligence is the origin of all power only in an individual. The textbook, however, speaks of creative intelligence in terms of universality. E.g., T at 126, 188-89. In the entire phrase of which defendants quote only a part, the textbook asserts that the field of pure creative intelligence is \"the origin of all power in nature.\" T at 98. The textbook repeatedly refers to \"the unlimited power of creative intelligence,\" T at 108, and \"the unbounded power of creative intelligence,\" T at 110. The textbook states that creative intelligence conducts the activity of nature, T at 114, including the structuring of the human body, T at 224, and the structuring of the blueprint of each individual's life in his or her genes, T at 171. The textbook states that creative intelligence \"can permeate anything,\" T at 107, \"accomplishes all great things with no effort,\" T at 108, and \"is able to accomplish everything effortlessly,\" T at 118. Creative intelligence is absolutely self-sufficient and self-illuminating, T at 121-22, has \"unbounded resources,\" T at 126, and can know no gain greater than itself, T at 144.\n\nDefendants also contend that\n\n[while] the textbook attempts to describe certain qualities of creative intelligence, it contains nothing intended or understood as inherently religious. Thus, attributes such as loving, just, gentle, strong, efficient, kind, clean, purifying, \"a person of full heart,\" self-sustaining and self-sufficient, are simply human qualities that develop as a result of personal growth.\n\nJarvis Affidavit para. 41. These statements again diverge substantially from what is stated in the textbook. While it may be true that these qualities do develop in an individual as a result of personal growth, the textbook attributes these \"simply human qualities,\" with the exception of \"a person of full heart,\" to a non-human, unmanifest, uncreated \"concrete reality,\" T at 250; e.g., T at 214-221, 100-107, 108-117, 222-229. Creative intelligence not only is loving, just, gentle, strong, efficient, kind, clean, purifying, and self-sufficient, but also possesses these qualities, and all other qualities in the universe, e.g., T at 36, 292, in their pure and infinite or \"unbounded\" states.\n\nDefendants state that\n\n[the] fact that the textbook mentions that creative intelligence is \"the basis of all growth and progress\" does not warrant the inference that it is the Creator of the universe. Rather, it is the basis of all growth and progress in a similar sense that physics considers matter and energy to be the basic elements of everything. In addition, concepts such as energy and gravity go \"on and on;\" however, they are not understood as creators of the universe.\n\nJarvis Affidavit para. 35. Once again, defendants' statements differ substantially from what is stated in the textbook and their analogy is poorly drawn and unpersuasive. While the textbook does state that \"[creative] intelligence is at the basis of all growth and progress,\" T at 19, this statement must be read in conjunction with the many other assertions in the textbook concerning creative intelligence. The textbook states that creative intelligence is the source of \"all existence.\" T at 171. Creative intelligence is the eternal, \"nonchanging basis of life,\" T at 242, and \"the source of all creativity.\" T at 243. The laws of nature themselves, \"which are directly responsible for the creation, maintenance, and evolution of everything in the universe,\" T at 242, are merely \"currents of creative intelligence.\" T at 110. Creative intelligence uses these laws of nature, or currents of creative intelligence, when creative intelligence creates the manifest universe: \"When we investigate more closely the mechanics of manifestation, we find that creative intelligence creates by means of certain traditions, certain specific laws, which themselves are nonchanging. There are innumerable laws of nature functioning at every level of life . . . .\" T at 242. \"The endless creative activity of creative intelligence takes place within the traditional structure of the laws of nature and is ultimately founded on the most fundamental field of life -- the unmanifest field of pure creative intelligence.\" T at 240. The textbook instructs that \"everything in creation is nothing other than the expression of unmanifest creative intelligence . . . .\" T at 260. Creative intelligence \"structures the blueprint of life in our genes. . . .\" T at 171. According to the textbook, \"[the] ultimate reality of every object is unmanifest creative intelligence. Every object, every expressed value in the phenomenal world, is an expression of the nonexpressed, unbounded value of creative intelligence.\" T at 154.\n\nCreative intelligence thus is not merely \"the basis of all growth and progress,\" but also is the eternal, nonchanging \"source of all creativity and the source of 'all existence;'\" the textbook continues this theme by stating that \"everything in creation is nothing other than the expression of unmanifest creative intelligence . . . .\" T at 260.\n\nDefendants' attempt at analogizing creative intelligence to matter and energy, Jarvis Affidavit para. 35, is as weak and unpersuasive as defendants' previously discussed analogies and comparisons. Neither matter nor energy has more than the tiniest fraction of the characteristics of creative intelligence. Neither matter nor energy is blissconsciousness or unbounded awareness or a field of \"unlimited power, energy, existence, intelligence, peace, and happiness,\" as is creative intelligence, according to the textbook. E.g., T at 121, 262, 102. Neither matter nor energy possess the \"simply human qualities,\" Jarvis Affidavit para. 41, of creative intelligence. Neither matter nor energy engages in the variegated activities which are conducted by creative intelligence. For example, neither matter nor energy \"is always unfolding greater levels of happiness within us,\" nor are they \"always refining our thinking, perception, and action to give clear, truthful expression to the nature of life,\" as creative intelligence does, to name but a couple of the multitude of activities attributed to creative intelligence by the textbook. T at 144, 74.\n\nDefendants also state that \"[electricity], the wheel, the printing press and water can each be considered to be at the basis of all growth and progress within different contexts, yet none can properly be considered the Creator of the Universe.\" Harned Affidavit para. 28. In this statement, defendants passingly mention a crucial consideration, which is the obvious observation that words take their meaning from the context in which they are used. The textbook speaks of creative intelligence only in terms of universality and illimitability. For example, the textbook states that creative intelligence \"expresses itself throughout the entire universe. Creative intelligence is always acting, ever vigilant to unfold its unbounded resources in every particle of existence.\" T at 126. The textbook repeatedly states that creative intelligence is \"the universal basis of life,\" e.g., T at 189, and \"the home of all qualities that constitute the universe,\" e.g., T at 292. Creative intelligence, according to the textbook, has an unlimited supply of resources. T at 126. One of the recurrent promises of the textbook is the experience of universality gained from contact with pure creative intelligence. E.g., T at 188. It is in this context of universality that creative intelligence must be evaluated. Almost needless to say, the implicit comparisons of creative intelligence to electricity, the wheel, the printing press, and water add nothing to defendants' arguments.\n\nAs can be seen from the foregoing discussion, one of defendants' methods of refuting the obvious import of textbook statements is to suggest a worldly entity or concept to which the textbook statement arguably might be applied. For example, faced with the textbook statement that creative intelligence \"guides and sustains every aspect of the universe,\" T at 174, defendants claim that creative intelligence is really like gravity guiding the paths of the planets; faced with the textbook statement that creative intelligence conducts the activity of nature, T at 114, defendants argue that creative intelligence is functioning in a fashion similar to that of a DNA molecule; faced with statements in the textbook that creative intelligence is the home of all qualities including beauty, creativity, intelligence, and orderliness, defendants assert that a \"Rembrandt painting can be described using similar values. . . .\" Jarvis Affidavit para. 39. The problem with this approach is that creative intelligence, as described in the textbook, is not truly similar to any of the items to which defendants have compared or analogized it. For defendants' analogies to have any validity, one must, in examining the analogies, exclude from consideration the fact that creative intelligence possesses a plethora of qualities which are not possessed by the items to which it is compared. The weakness of defendants' comparisons perhaps is underscored by juxtaposing and noting the lack of similarity among the items and concepts to which they have compared creative intelligence: gravity, DNA, a Rembrandt painting, energy, the wheel, water, matter, electricity. The dissimilarity of concepts to which creative intelligence has been compared is not surprising in light of the teachings of the textbook. Since \"[the] ultimate reality of every object is creative intelligence,\" T at 154, creative intelligence presumably is ultimately similar to everything in the universe.\n\nDefendants state that \"[creative] intelligence is not intended to be understood as an all-pervasive 'being' like God.\" Jarvis Affidavit para. 37. No elaboration on this statement is made in the affidavit. The textbook repeatedly asserts that creative intelligence is all-pervasive. For example, the textbook states that creative intelligence\n\nis present in all forms, words, smells, tastes, and objects of touch. In all the objects of experience, in all the senses of perception and organs of action, in every phenomenon, in the doer and the work done, in all directions -- north, south, east, and west -- in all times -- past, present, and future -- it is uniformly present. In front of man, behind him, to the left and right of him, in him -- everywhere, and under all circumstances, creative intelligence is permeating everything.\n\nT at 186. The textbook repeatedly states that \"creative intelligence is present everywhere.\" E.g., T at 23, 36. \"The ultimate reality of every object is unmanifest creative intelligence.\" T at 154. \"The universe is a continuous, unified whole, an unbroken field of creative intelligence.\" T at 137. Creative intelligence, according to the textbook, clearly is all-pervasive. Whether creative intelligence is a \"being,\" essence, principle, intelligence, or entity has no bearing on plaintiffs' motion for summary judgment.\n\nIn opposition to plaintiffs' motion for summary judgment, defendants also rely upon the depositions of three clergymen. All three clergymen, a Catholic priest, a United Presbyterian minister, and a rabbi, have attended their own pujas, have taken full or partial courses on the Science of Creative Intelligence, which they believe to have been substantially similar in content to that taught in the New Jersey High schools, and practiced Transcendental Meditation. At least one of the clergymen was active in an attempt to introduce the Science of Creative Intelligence into the curriculum of the public high schools in his place of residence and has a daughter who is a teacher of SCI/TM. All three clergymen, based on their understandings of SCI, testified that they did not view their courses in the Science of Creative Intelligence as courses in religion or religious philosophy. Each of the clergymen also testified, based on his understanding of SCI, that he found nothing in the Science of Creative Intelligence course which he took which conflicted with his religion. Two of the clergymen examined the textbook which was used in the New Jersey schools for the first time on the day of their depositions. Prendeville Deposition at 146; Roberts Deposition at 26. The third clergyman testified that he had had a copy of the textbook in his possession for several weeks and had \"looked it over kind of carefully.\" Essrig Deposition at 59. The same clergyman testified that he had attended only a small part of a course on the Science of Creative Intelligence, but also had attended three or four weekend \"residence courses\" in which he heard several lectures, both live and on video tape, on the subject and had attended \"many meetings\" at a TM center. Id. at 19, 54, 56. One of the clergymen testified that in his course on the Science of Creative Intelligence he was provided with a copy of the Bhagavad-Gita and had purchased a copy of Commentaries on the Bhagavad-Gita by Maharishi Mahesh Yogi for use in the course. Roberts Deposition at 71, 57-58. There is no evidence that the Bhagavad-Gita or defendant Yogi's Commentaries thereon were used in connection with the course taught in the New Jersey high schools.\n\nWhile the court, of course, accepts the statement of each of the clergymen that it is his understanding of the Science of Creative Intelligence course that he took that the course was not a course in religion or religious philosophy, the question whether or not the teaching of the Science of Creative Intelligence, as represented by the textbook and by the deposition testimony of two people who taught the course in New Jersey high schools, constitutes a violation of the establishment clause presents a different question and remains a legal question for resolution by the courts. In addition, it is impossible for this court to determine either what the understanding of each clergyman regarding the Science of Creative Intelligence is or the similarity between the course taken by the clergymen and that offered to New Jersey high school students. There is evidence in the record that the courses taken by the clergymen differed in content both from each other and from the course offered in the New Jersey high schools. One of the clergymen was read three excerpts from the textbook used in New Jersey schools and asked if he had been taught the substance of the quoted excerpts in the course on the Science of Creative Intelligence which he had taken. The clergyman answered \"no\" to two of the three questions. Prendeville Deposition at 97-101. Later, the same clergyman was asked if he had been taught that \"the field of pure creative intelligence is the ocean of life and that all manifest existence and evolutionary processes are waves of that ocean,\" which is a virtual quotation of a statement appearing on page 20 of the textbook used in New Jersey high schools. The clergyman answered the question with a categorical \"No.\" Id. at 117. The same clergyman testified that he had been taught in the SCI course which he had taken that the field of pure creative intelligence existed only within each individual. Id. at 117-18. This teaching clearly contravenes that of the textbook used in New Jersey high schools. E.g., T at 23, 36, 40, 42, 154, 292. The same clergyman's articulated understanding of the meaning of the term creative intelligence differed substantially from the definition which appears in the textbook before the court. Compare Prendeville Deposition at 93, 97, 99 with T at 20.\n\nAs noted earlier, another clergyman testified that he used materials in his course on the Science of Creative Intelligence which were not used in New Jersey or by the other two clergymen. The third clergyman took only a small part of the course, but has attended lectures on the Science of Creative Intelligence from time to time.\n\nNone of the three clergymen testified that he actually had read the entire textbook used in the New Jersey high schools. Two of the clergymen saw the book for the first time on the day of their depositions; they could not have spent more than a few minutes in inspecting it. The third clergyman testified that he had had a copy of the textbook in his possession for several weeks and had \"looked it over kind of carefully;\" he also responded \"[yes], I did,\" when asked if he had had \"a chance to review the book.\" Essrig Deposition at 59, 22. The same clergyman also testified that he made no notes or other writings during or after his examination of the textbook. Id. at 59. Immediately following a conference with defendants' counsel, this clergyman testified on redirect examination that he had \"studied\" the textbook. Id. at 106. The clergyman did not specify the portions of the textbook which he had studied, but did not remember any reference to the term \"bliss-consciousness\" in the textbook. Id. at 104. The term \"bliss-consciousness\" appears tens, probably scores, of times throughout the textbook. The term occasionally is used as a synonym for creative intelligence. E.g., T at 55, 144. The same clergyman also stated that he had never heard the term \"bliss-consciousness\" at any of the lectures on the Science of Creative Intelligence. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" Essrig Deposition at 102-03.\n\nAside from the difficulty in determining the basis for the clergymen's understandings of the Science of Creative Intelligence, it is difficult to see the utility of this testimony to the court in light of the fact that the court has a copy of the textbook actually used in the New Jersey high school course and hundreds of pages of deposition testimony of two people who taught that course.\n\nDefendants also submit affidavits from two teachers of the New Jersey SCI/TM courses and eleven identical form affidavits signed by eleven students in New Jersey high schools. Each teacher stated that she does \"not understand\" the SCI/TM courses which she taught to be courses in religion. Each student's affidavit states the affiant's name, his religious affiliation, the fact that he took a SCI/TM course in a New Jersey high school, and the fact that the student does \"not understand\" that the SCI/TM course was a study of religion. Since none of these students read more than one-third of the textbook and most read less than one-sixth of the textbook, see Jarvis Affidavit para. 32, the students' understandings of the SCI/TM course is impossible to determine. Moreover, the court cannot rely on the unexplained conclusions of third parties when the teachings of the course are in evidence in the form of a textbook, especially if those teachings contradict the unexplained conclusions. In addition, the subjective characterizations by individuals of teachings as religious or not religious in their systems of categorization cannot be determinative of whether or not the teachings are religious within the meaning of the first amendment. See infra at 1315-1320.\n\nDefendants also submitted the affidavits of two professors of religion who state that the Science of Creative Intelligence does not constitute a religion under their definitions of religion. These affidavits are discussed infra at 1315-1320.\n\nTHE PUJA\n\nThe puja is a ceremony at which each student was given his or her mantra, the sound aid essential to practicing Transcendental Meditation. Every student who participated in the SCI/TM course was required to attend a puja as a part of the course; no mantras were given except at pujas. Aaron Deposition at 589. Each student received his or her mantra individually at the conclusion of or during a puja performed in a closed room by the teacher in the presence of one student. The teacher performed a puja in the presence of each individual student prior to imparting a mantra to the student. Aaron Affidavit at 593.\n\nThe pujas were conducted on Sundays off the school premises. An appointment was set up for each student so that the teacher could perform the pujas and impart the mantras seriatim without requiring the students to wait while their classmates received their mantras. Id. at 600. Prior to the appointed Sunday, each student was asked to bring a clean white handkerchief, a few flowers, and three or four pieces of fruit to the puja. Upon each student's arrival, the handkerchief, flowers, and fruit were taken from him or her and placed in a container, and the student was lead to a small room. At the request of someone at the site, each student removed his or her shoes before entering the room. The student and teacher entered the room, and the teacher closed the door. Inside the room was a rectangular table which was covered by a white sheet. Metropole Deposition at 344. The table held a brass candle-holder and a brass incense holder. The holders contained a candle and incense, both of which were lit by the teacher. Id. at 346-47. The table also held three brass dishes which contained, respectively, water, rice, and sandalpaste. Id. at 345-46. The table also carried a small brass dish containing camphor. Id. at 347-48. In addition, there was a tray on the table and an eight-by-twelve inch color picture of Guru Dev at the back of the table. Id. at 348-49; see Prendeville Deposition at 73. Guru Dev was a teacher of defendant Yogi and is held by the World Plan defendants to be the latest preserver and disseminator of the Transcendental Meditation technique prior to defendant Yogi. Metropole Deposition at 349. Guru Dev has been dead for over twenty years. Id. at 350. As soon as the teacher and student were in the room, the container holding the flowers, fruit, and handkerchief brought by the student was placed on the table. Id. at 343. Each student then stood or sat in front of the table while the teacher sang a chant in Sanskrit. The chant lasted three or four minutes. Aaron Deposition at 685. During the singing of the chant, the teacher moved some of the articles from the table onto the tray. Id. at 685. See Prendeville Deposition at 73-75. At the conclusion of the chant, the teacher imparted the mantra to the student by speaking it aloud. Metropole Deposition at 351. See Prendeville Deposition at 23. The teacher then instructed the student in the technique of using the mantra in the practice of Transcendental Meditation for approximately twenty minutes. Aaron Affidavit at 2. Each student then was taken to another room in which he or she meditated alone for the first time for a period of approximately twenty minutes. Id. Following the meditation, each student was \"asked to answer in writing several questions concerning the experience.\" Id. Upon completion of the written answers, the teacher and the student met to discuss the student's experience with meditation. Id. at 3. Each student spent between one and one-half and two hours engaged in the above-described activities. Id. at 2. A week or two prior to the puja, each student was required to sign a document in which the student promised never to reveal his or her mantra. Metropole Deposition at 358. No student received a copy of the document which he or she had signed. Id. at 361. The teachers told the students that the puja was not a religious exercise or prayer. Aaron Affidavit at 3; Metropole Affidavit at 2.\n\nAs stated above, the chant is sung in Sanskrit. During the several-week teacher training course, the teachers learn the words to the chant by memorizing the Sanskrit words phonetically. Aaron Deposition at 681. Each teacher at the teacher training course is given a sheet of paper on which the Sanskrit words of the chant are written phonetically in English-language characters. Metropole Deposition at 325. The teachers also are given English-language translations of the chant. Id. The teachers must memorize the melody to which the chant is sung. Aaron Deposition at 681. In addition, the teachers had to learn certain gestures and hand movements used during the singing of the chant. Id. at 681, 685. As a condition precedent to becoming a teacher of SCI/TM, the would-be teachers had to perform the chant in front of and to the satisfaction of defendant Yogi or one of his aides. Id. at 682.\n\nThe following English translation of the chant which the teachers sing at the puja was supplied by defendants as an exhibit at certain depositions: \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\n\"Invocation\n\nWhether pure or impure, where purity or impurity is permeating everywhere, whoever opens himself to the expanded vision of unbounded awareness gains inner and outer purity.\n\nInvocation\n\nTo Lord Narayana, to lotus-born Brahma the Creator, to Vashishtha, to Shakti and his son Parashar,\n\nTo Vyasa, to Shukadeva, to the great Gaudapada, to Govinda, ruler among the yogis, to his disciple,\n\nShri Shankaracharya, to his disciples Padma Pada and Hasta Malaka\n\nAnd Trotakacharya and Vartika-Kara, to others, to the tradition of our Master, I bow down.\n\nTo the abode of the wisdom of the Shrutis, Smritis and Puranas, to the abode of kindness, to the personified glory of the Lord, to Shankara, emancipator of the world, I bow down.\n\nTo Shankaracharya the redeemer, hailed as Krishna and Badarayana, to the commentator of the Brahma Sutras, I bow down. To the glory of the Lord I bow down again and again, at whose door the whole galaxy of gods pray [ sic ] for perfection day and night.\n\nAdorned with immeasurable glory, preceptor of the whole world, having bowed down to Him we gain fulfillment.\n\nSkilled in dispelling the cloud of ignorance of the people, the gentle emancipator, Brahmananda Sarasvati, the supreme teacher, full of brilliance, Him I bring to my awareness.\n\nOffering the invocation of the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a seat to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering an ablution to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a cloth to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering sandalpaste to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering full rice to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a flower to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering incense to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering light to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering water to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering fruit to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering water to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a betel leaf to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a coconut to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering camphor light\n\nWhite as camphor, kindness incarnate, the essence of creation garlanded with Brahman, ever dwelling in the lotus of my heart, the creative impulse of cosmic life, to That, in the form of Guru Dev, I bow down.\n\nOffering light to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering water to the lotus feet of Shri Guru Dev, I bow down.\n\nOffering a handful of flowers.\n\nGuru in the glory of Brahma, Guru in the glory of Vishnu, Guru in the glory of the great Lord Shiva, Guru in the glory of the personified transcendental fulness [ sic ] of Brahman, to Him, to Shri Guru Dev adorned with glory, I bow down.\n\nThe Unbounded, like the endless canopy of the sky, the omnipresent in all creation, by whom the sign of That has been revealed, to Him, to Shri Guru Dev, I bow down.\n\nGuru Dev, Shri Brahmananda, bliss of the Absolute, transcendental joy, the Self-Sufficient, the embodiment of pure knowledge which is beyond and above the universe like the sky, the aim of 'Thou art That' and other such expressions which unfold eternal truth, the One, the Eternal, the Pure, the Immovable, the Witness of all intellects, whose status transcends thought, the Transcendent along with the three gunas, the true preceptor, to Shri Guru Dev, I bow down.\n\nThe blinding darkness of ignorance has been removed by applying the balm of knowledge. The eye of knowledge has been opened by Him and therefore, to Him, to Shri Guru Dev, I bow down.\n\nOffering a handful of flowers to the lotus feet of Shri Guru Dev, I bow down.\"\n\nAll spacing, punctuation, and capitalization in the quotation above are identical to the exhibit provided by defendants.\n\nAs can be seen from the English translation, the double invocation of the puja chant takes the form of expressions of reverence for \"the Lord,\" other named entities or individuals, \"the tradition of our Master,\" and Guru Dev, who is portrayed as a personification of a divine being or essence. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" The translation of the chant reads in part as follows:\n\nTo the glory of the Lord I bow down again and again, at whose door the whole galaxy of gods pray [sic] for perfection day and night.\n\nAdorned with immeasurable glory, preceptor of the whole world, having bowed down to Him we gain fulfillment.\n\nThis passage makes clear that the chanter is referring to a divine being or essence or entity, \"the Lord.\" \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" No other reasonable interpretation is possible.\n\nThe chant continues in the next paragraph to identify Guru Dev as a personification of \"Him,\" or \"the Lord:\"\n\nSkilled in dispelling the cloud of ignorance of the people, the gentle emancipator, Brahmananda Sarasvati, the supreme teacher, full of brilliance, Him I bring to my awareness.\n\nIn this paragraph Brahmananda Sarasvati, who also is known as Guru Dev, see Jarvis Deposition at 995, is referred to as \"Him,\" with a capital aitch. The only prior appearance of the term \"Him,\" with a capital aitch, occurs in the preceding paragraph and the referent of that \"Him\" is \"the Lord.\" The word \"Him\" with a capital aitch occurs four additional times in the chant. The referent in each case is \"Guru Dev.\"\n\nThe chanter then makes fifteen offerings to Guru Dev and fourteen obeisances to Guru Dev. The chant then describes Guru Dev as a personification of \"kindness\" and of \"the creative impulse of cosmic life,\" and the personification of \"the essence of creation,\" which, simultaneously with its personification in Guru Dev, lies in the center of the chanter's heart:\n\nWhite as camphor, kindness incarnate, the essence of creation garlanded with Brahman, ever dwelling in the lotus of my heart, the creative impulse of cosmic life, to That, in the form of Guru Dev, I bow down.\n\nThe chanter then makes three more offerings to Guru Dev and three additional obeisances to Guru Dev. The chant then moves to a passage in which a string of divine epithets are applied to Guru Dev. Guru Dev is called \"The Unbounded,\" \"the omnipresent in all creation,\" \"bliss of the Absolute,\" \"transcendental joy,\" \"the Self-Sufficient,\" \"the embodiment of pure knowledge which is beyond and above the universe like the sky,\" \"the One,\" \"the Eternal,\" \"the Pure,\" \"the Immovable,\" \"the Witness of all intellects, whose status transcends thought,\" \"the Transcendent along with the three gunas,\" and \"the true preceptor.\" \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Manifestly, no one would apply all these epithets to a human being. The chant ends with another offering and two more obeisances to \"Him,\" to Guru Dev. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nThe items used in seventeen of the nineteen offerings were explicitly enumerated as being present during the initiation ceremonies of the New Jersey high school students. The items stated as being offered in two of the offerings were not present. Id. at 454. Metropole Deposition at 336-48. The materials for five of the nineteen offerings were supplied by each individual student. See id. at 338. Defendant Aaron testified that she moved the items that were on the table at the beginning of the puja onto the tray during the singing of the chant. Aaron Deposition at 685. Nothing was on the tray at the beginning of the puja. Metropole Deposition at 348.\n\nA conflict exists between the evidence submitted by defendants as to whether the puja is performed by the initiator for himself or by the initiator for the student. Defendants' experts in religion state that the puja is performed by the teacher for the student. Harned Affidavit para. 18; Rao Affidavit para. 11. Defendant Jarvis stated that the puja is performed by the teacher for himself. Jarvis Deposition at 896-97. Defendants' counsel also argues that the puja is performed \"by the teacher solely for himself.\" Db at 15. On plaintiffs' motion for summary judgment, defendants' allegation that the puja is performed for the initiator himself, with the students' participation limited to attendance and the contribution of certain offerings, Rao Affidavit para. 11, will be accepted as true.\n\nDefendants deny the religiosity of the puja. In refuting the religiosity of the puja, defendants take the same oblique approach to the question as taken in their discussion of the Science of Creative Intelligence course. Defendants once again eschew direct analysis of the content of the challenged practice, and instead rely upon the subjective interpretations, beliefs, and opinions of defendants and third-parties, who have various degrees of interest in the lawsuit and who have varying degrees of understanding of the facts which form the basis of this lawsuit.\n\nPrimary reliance is placed on the affidavit and deposition testimony of defendant Jarvis. Defendants also rely on the deposition testimony of three clergymen and the affidavits of two professors of religion, the deposition testimony and affidavits of two people who performed several of the initiation ceremonies in relation to the New Jersey high school course, and the affidavits of eleven New Jersey high school students who witnessed performances of the puja in relation to the SCI/TM course.\n\nDefendants seek to characterize the puja as \"a ceremony of gratitude,\" and apparently so represented it to the New Jersey high school students. It is difficult to understand why defendants label the puja \"a ceremony of gratitude\" because the English translation of the chant fails to reveal one word of gratefulness or thanksgiving. Rather, the puja takes the form of a double invocation of Guru Dev. Putting this difficulty aside for the moment, the question arises as to whom this gratitude is being expressed. Defendants have answered this question by stating that the gratitude is given \"to the tradition of teachers who have preserved this teaching,\" Jarvis Affidavit para. 11, \"to the knowledge\" which each of the \"teachers\" named in the chant is said to have possessed, Jarvis Deposition at 1006, and to the prior \"teachers\" themselves, Aaron Deposition at 582. The problem with all of defendants' descriptions of the receiver of the gratitude is that none of the described recipients is capable of receiving it. When one performs a ceremony of gratitude or \"thanksgiving,\" Aaron Deposition at 582, one must have a recipient of that gratitude in mind or the ceremony would be meaningless. In common English usage, ceremonies of gratitude or thanksgiving are performed to divine beings (God, Providence, etc.), animate and sensate beings, and possibly institutions run by human beings. While one may be grateful for a body of knowledge or for a tradition, that gratitude extends to the purveyors or creators of that knowledge or to the preservers of the tradition. One would no more perform a ceremony of gratitude to a tradition or to a body of knowledge than one would perform a ceremony of gratitude to a chair or to a useful contrivance or to a machine or to any other inanimate object which would be entirely incapable of perceiving human communication.\n\nThe problem with performing the ceremony of gratitude to the teachers themselves is that most of the \"teachers\" mentioned in the puja chant have been dead for thousands of years, see Jarvis Deposition at 1003, and the last \"teacher\" mentioned in the chant has been dead for nearly a quarter of a century. Dead people are incapable of communication with living human beings unless one believes in the existence of a soul which continues to exist after the death of the body.\n\nAs stated earlier, no words of gratitude or thanks appear in the English translation of the puja chant. The chant clearly is labeled \"Invocation\" twice. An invocation is the invoking or calling upon a spirit, a principle, a person, or a deity for aid. Funk and Wagnells New Standard Dictionary 1290 (1949); The Random House College Dictionary 703 (1973); Webster's New Collegiate Dictionary 444 (1960). The chant clearly invokes the spirit or deity of Guru Dev:\n\nSkilled in dispelling the cloud of ignorance of the people, the gentle emancipator, Brahmananda Sarasvati [ Guru Dev ], the supreme teacher, full of brilliance, Him I bring to my awareness.\n\nOffering the invocation of the lotus feet of Shri Guru Dev, I bow down.\n\n(emphasis supplied).\n\nDefendant Jarvis states in an affidavit that it is his personal understanding that the puja is merely a ceremony of gratitude to the tradition of past teachers and that similar ceremonies are performed in a number of secular contexts in India. While the court of course accepts these statements as accurate reflections of defendant Jarvis' personal understanding, the court also must note that defendant Jarvis made no claim of knowledge in the matter of Indian customs. See Jarvis Deposition at 908, 1020. Defendant Jarvis, when asked if he knew what the Sanskrit word \"puja\" meant, replied, \"[no], I don't know what the word 'puja' means except to interpret it as a ceremony of gratitude.\" Id. at 935. Directly on the heels of this reply, defendant Jarvis was asked if he were familiar with any puja \"other than the one that is performed by the teacher at the time that a mantra is assigned.\" Id. Defendant Jarvis answered: \"No.\" Id. In his affidavit, defendant Jarvis also states that he believes that only \"3 or 4 ex-teachers\" of the more than 7,000 TM teachers in the United States believe that the puja has religious significance. Jarvis Affidavit para. 18.\n\nDefendants also rely on affidavits of two professors of religion. The affidavits are virtually identical and will be treated together. Neither professor practices Transcendental Meditation and presumably has never witnessed a puja; both professors state that they have read the English translation of the puja chant which appears above. Each professor concludes that in his opinion the Puja is not a religious ceremony.\n\nNeither professor offers any textual analysis of the chant. Neither professor offers any analysis of the performance of the ceremony, except to note that each student is present and brings a handkerchief, fruit, and flowers. Rather, the professors offer a broad generalization that \"[in] India, many secular activities begin with a puja ceremony or ceremony of gratitude.\" Rao Affidavit para. 12. The professors then state that secular pujas are part of the cultural life of India. Rao Affidavit para. 12. While the court, of course, accepts these generalizations, they shed little or no light on the religiosity or lack thereof of the puja conducted in the presence of New Jersey high school students because there is no indication that the puja performed for the high school students was similar to \"secular pujas\" performed in India. The only similarity, stated by the professors, between the \"secular pujas\" of India and the TM puja is that some secular pujas involve the use of flowers, fruit, white handkerchiefs, incense, and rice. Rao Affidavit para. 13; Harned Affidavit para. 20. Neither professor states that it is common in these \"secular pujas\" to sing a chant in Sanskrit, a language which has been dead for thousands of years. Neither professor stated that it is common in these secular pujas to sing a chant which includes the words \"To the glory of the Lord, I bow down again and again.\"\n\nThe court's statements of what does not appear in the professors' affidavits should not be interpreted as an indication that the court is rejecting any representation of fact contained therein. For the purposes of this motion, the court accepts representations of fact (as distinguished from legal conclusions and arguments) appearing in the professors' affidavits. The court points out the lack of precision in implicitly comparing the TM puja to the \"secular pujas\" of India merely to demonstrate the lack of utility of these generalizations as an aid in determining the question before the court.\n\nThe professors ultimately base their opinions that the puja is not a religious ceremony on their beliefs that religions should be defined subjectively, the keystone being whether or not the participants in the ceremony intend the ceremony to have religious significance. Harned Affidavit para. 21; Rao Affidavit paras. 15, 21. This subjective approach to defining religion and identifying religious ceremonies may account for the failure of the professors to address themselves to the actual performance of the puja and content of the chant. Under the professors' approach, the content of the ceremony would be immaterial if the participants sincerely believed and intended that the puja have no religiosity. As will be developed later, this subjective, or \"contextual,\" approach to defining religion and identifying religious ceremonies is unacceptable as a legal standard under the first amendment. See pages 1315-1320 infra.\n\nDefendants also rely upon the deposition testimony of three clergymen who practice Transcendental Meditation and who went through a puja in receiving their mantras. Although defendants offered the clergymen as \"fact witnesses\" and specifically denied that the clergymen were testifying as experts, defendants now seek to rely on the opinions of the clergymen. See F.R.Ev. 701. Over the objection of plaintiffs' counsel, each of the three clergymen testified that in his opinion the puja was not a religious ceremony. None of the clergymen implicitly or explicitly held himself out as having extensive knowledge of any religion but their respective denominations. All three clergymen disclaimed knowledge of Indian culture and history and Hindu religion and philosophy. All three clergymen indicated that they accepted representations made to them by their teachers that the puja was a ceremony of gratitude which must be attended by them in order to receive a mantra. All three of the clergymen stated that they did not view the puja as important; one of the clergymen characterized the significance of the puja to him as \"trivial,\" although he also stated that the puja may have had a significance, unknown to him, to other persons. The lack of importance attached to the ritual of the puja may account for the hazy recollections of two of the clergymen. At the time of his puja, none of the clergymen had seen an English translation of the puja chant. A few weeks prior to his deposition, each of the three clergymen was sent the above-quoted translation of the chant by defendants or by defendants' counsel. At his deposition, each of the three clergymen testified that the reading of the translation did not change his opinion that the puja was not a religious ceremony.\n\nIn addition to the deposition testimony of the three clergymen, defendants rely on the affidavits of two teachers and eleven high school students of the SCI/TM course who state that they do not understand the puja to be a religious ceremony. Like the clergymen, neither the teachers nor the students claim any qualifications as experts in religion or anything else; they offer statements that they do not understand the puja to be a religious ceremony. Neither the teachers nor the clergymen nor the students offer any reasons for their understandings or lack thereof. While the court accepts the statements, these unexplained statements cannot be determinative of the religiosity of the puja for reasons set out infra at 1315-1320, especially in light of the fact that the opinions of the clergymen, teachers, and students are based on facts in the record.\n\nDefendants seek to analogize the puja chant to the Hippocratic Oath. The analogy is not convincing. First, nowhere in the Hippocratic Oath is \"the Lord\" invoked. The only mention of gods in the Hippocratic Oath occurs in the opening phrase: \"I swear by Apollo Physician, by Asclepius, by Health, by Panacea, and by all the gods and godesses, making them my witnesses . . . .\" C. McFadden, Medical Ethics 431-32 (5th ed. 1961). Moreover, the gods mentioned in the Hippocratic Oath are creatures of mythology, inhabitants of a dead religion. Those responsible for administering the oath are neither priests nor trained by priests of these ancient gods, but laymen. In contrast, the puja is sung at the direction of Maharishi Mahesh Yogi, a Hindu monk. The words and offerings of the chant invoke the deified teacher, who also was a Hindu monk, of Maharishi Mahesh Yogi. In the chant, this teacher is linked to names known as Hindu deities. Maharishi Mahesh Yogi places such great emphasis on the singing of this chant prior to the imparting of a mantra to each individual student that no mantras are given except at pujas and no one is allowed to teach the Science of Creative Intelligence/Transcendental Meditation unless he or she performed the puja to the personal satisfaction of Maharishi Mahesh Yogi or one of his aides. Aaron Deposition at 682. See Jarvis Deposition at 834. Needless to say, neither Hinduism nor belief in \"the Lord\" constitute a dead religion. Both of these beliefs are held by hundreds of millions of people.\n\nDISCUSSION\n\nPlaintiffs allege that the teaching of the SCI/TM course in New Jersey high schools violates the establishment clauses of both the United States Constitution and the New Jersey Constitution. The first clause of the first amendment to the United States Constitution states that \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" The New Jersey Constitution states that \"[there] shall be no establishment of one religious sect in preference to another.\" N.J.Const. Art. 1, para. 4. The fundamental mandates of the \"establishment of religion\" clause were enumerated by the Supreme Court thirty years ago:\n\nThe \"establishment of religion,\" clause of the First Amendment means at least this: Neither a state nor the Federal Government can set up a church. Neither can pass laws which aid one religion, aid all religions, or prefer one religion over another. Neither can force or influence a person to go to or to remain away from church against his will or force him to profess a belief or disbelief in any religion. No person can be punished for entertaining or professing religious beliefs, for church attendance or non-attendance. No tax in any amount, large or small, can be levied to support any religious activities or institutions, whatever they may be called, or whatever form they may adopt to teach or practice religion. Neither a state nor the Federal Government can, openly or secretly, participate in the affairs of any religious organizations or groups and vice versa. In the words of Jefferson, the clause against establishment of religion by law was intended to erect \"a wall of separation between church and State.\"\n\nEverson v. Board of Education, 330 U.S. 1, 15-16, 67 S. Ct. 504, 511, 91 L. Ed. 711 (1947), quoting Reynolds v. United States, 98 U.S. 145, 164, 25 L. Ed. 244 (1878). The Court reaffirmed its commitment to these basic principles in Torcaso v. Watkins, 367 U.S. 488, 495, 81 S. Ct. 1680, 1683, 6 L. Ed. 2d 982 (1961) (footnotes omitted):\n\nWe repeat and reaffirm that neither a State nor the Federal Government can constitutionally force a person \"to profess a belief or disbelief in any religion.\" Neither can constitutionally pass laws or impose requirements which aid all religions as against non-believers, and neither can aid those religions based on a belief in the existence of God as against those religions founded on different beliefs.\n\nThe position of the federal government and the states must be one of neutrality in the area of religious activity. Abington School District v. Schempp, 374 U.S. 203, 222, 83 S. Ct. 1560, 10 L. Ed. 2d 844 (1963). A three-part test has emerged from the Supreme Court decisions involving the establishment clause. In order to avoid violation of the establishment clause, the federal or state\n\nlaw in question, first, must reflect a clearly secular legislative purpose, second, must have a primary effect that neither advances nor inhibits religion, and, third, must avoid excessive government entanglement with religion.\n\nCommittee for Public Education v. Nyquist, 413 U.S. 756, 773, 93 S. Ct. 2955, 2965, 37 L. Ed. 2d 948 (1973).\n\nBefore applying this three-part test, however, the court must determine if the SCI/TM course constitutes a religious activity under the first amendment. Owing to the variety of form and substance which religions may take, the courts have avoided the establishment of explicit criteria, the possession of which indelibly identifies an activity as religious for purposes of the first amendment. This court, therefore, must be guided by the type of activity that has been held to be religious under the first amendment by the courts.\n\nIn implementing the establishment clause, the Supreme Court has made clear that an activity may be religious even though it is neither a part of nor derives from a societally recognized religious sect. In Engel v. Vitale, 370 U.S. 421, 82 S. Ct. 1261, 8 L. Ed. 2d 601 (1962), the New York State Board of Regents, a governmental agency with broad supervisory, executive and legislative powers over the state's public school system, composed a nondenominational prayer and recommended that it be recited by students at the beginning of each school day. Recitation of the prayer was voluntary; students could remain seated and silent or leave the room during the recitation. The prayer read:\n\nAlmighty God, we acknowledge our dependence upon Thee, and we beg Thy blessings upon us, our parents, our teachers and our Country.\n\nId. at 422, 82 S. Ct. at 1262. The Regents put forward the prayer as part of its \"Statement on Moral and Spiritual Training in the Schools.\" Despite the fact that the prayer was not connected to any recognized religious group or groups and had been composed and recommended solely by laymen, the Supreme Court found that \"[there] can, of course, be no doubt that New York's program of daily classroom invocation of God's blessings as prescribed in the Regents' prayer is a religious activity.\" Id. at 424, 82 S. Ct. at 1264.\n\nSimilarly, in Torcaso v. Watkins, 367 U.S. 488, 81 S. Ct. 1680, 6 L. Ed. 2d 982 (1961), the Supreme Court held unconstitutional a provision of the Declaration of Rights of the Maryland Constitution which required appointees to state offices to declare a belief in the existence of God as a condition of obtaining their commissions. Although a belief in the existence of God is central to many religions, the Court did not find that this belief in and of itself constituted a religion in the societally accepted meaning of that word nor did the Court find that the belief derived from a particular sect. Rather, the Court found that the Maryland provision violated the establishment of religion clause because it propagated \"a particular kind of religious concept.\" See id. at 494, 81 S. Ct. at 1683 (footnote omitted). The Court thus held that governmental aid to the propagation of a \"religious concept\" would violate the establishment clause. The Court indicated that the Maryland provision violated the establishment clause both in that it prevented nonreligious people from holding public office and in that it aided all \"those religions based on a belief in the existence of God as against those religions founded on different beliefs.\" Id. at 495, 81 S. Ct. at 1683-1684 (footnote omitted). The Supreme Court in Torcaso and Engel interpreted the word \"religion\" in the first amendment broadly to encompass \"religious [concepts]\" and religions which do not propound a belief in the existence of God. In a footnote to Torcaso, the Court listed certain religions which do not hold a belief in the existence of a Supreme Being: \"Among religions in this country which do not teach what would generally be considered a belief in the existence of God are Buddhism, Taoism, Ethical Culture, Secular Humanism and others.\" Id. at 495 n.11, 81 S. Ct. at 1684 (citations omitted).\n\nIn a statutory context, the Supreme Court has given a broad meaning to the phrase \"religious training and belief\" in construing section 6(j) of the Universal Military Service and Training Act. Welsh v. United States, 398 U.S. 333, 90 S. Ct. 1792, 26 L. Ed. 2d 308 (1970); United States v. Seeger, 380 U.S. 163, 85 S. Ct. 850, 13 L. Ed. 2d 733 (1965). Section 6(j) provided in part:\n\nNothing contained in this title shall be construed to require any person to be subject to combatant training and service in the armed forces of the United States who, by reason of religious training and belief, is conscientiously opposed to participation in war in any form. Religious training and belief in this connection means an individual's belief in a relation to a Supreme Being involving duties superior to those arising from any human relation, but does not include essentially political, sociological, or philosophical views or a merely personal moral code.\n\nDespite the fact that the Court was called upon to construe a statute, which contained an explanation of the phrase \"religious training and belief,\" the Court held:\n\nIf an individual deeply and sincerely holds beliefs that are purely ethical or moral in source and content but that nevertheless impose upon him a duty of conscience to refrain from participating in any war at any time, those beliefs certainly occupy in the life of that individual \"a place parallel to that filled by . . . God\" in traditionally religious persons. Because his beliefs function as a religion in his life, such an individual is as much entitled to a \"religious\" conscientious objector exemption under  6(j) as is someone who derives his conscientious opposition to war from traditional religious convictions.\n\nWelsh v. United States, supra, 398 U.S. at 340, 90 S. Ct. at 1796, quoting United States v. Seeger, supra, at 176, 85 S. Ct. 850.\n\nThe majority opinion in neither Seeger nor Welsh grappled with the problem of defining religion as it is used in the first amendment. The significance of these cases for purposes of this court's analysis derives not from the definitions of \"religious training and belief\" at which the Supreme Court arrived, but rather from the fact that the Court defined the phrase broadly in an exercise of statutory construction, an area in which the Court is far more circumscribed in defining terms than it is in the area of constitutional interpretation. See Welsh, supra, 398 U.S. at 346, 90 S. Ct. 1792 (Harlan, J., concurring).\n\nIn light of Engel, supra, and Abington School District v. Schempp, supra, a panel of the Seventh Circuit held that the first amendment's establishment clause was violated by a teacher who had her kindergarten students recite the following poem or prayer prior to their morning snack:\n\nWe thank you for the flowers so sweet;\n\nWe thank you for the food we eat;\n\nWe thank you for the birds that sing;\n\nWe thank you for everything.\n\nDeSpain v. DeKalb County Community School District 428, 384 F.2d 836, 837 (7th Cir. 1967), cert. denied, 390 U.S. 906, 88 S. Ct. 815, 19 L. Ed. 2d 873 (1968). The Seventh Circuit held that recitation of this simple poem or prayer by five-year olds constituted an establishment of religion because the word \"you\" referred to \"the Deity.\" Id. at 839.\n\nIn Founding Church of Scientology v. United States, 133 U.S. App. D.C. 229, 409 F.2d 1146 (1969), the court confronted the question whether or not a philosophy or system of beliefs called Scientology was a religion under the first amendment. Although Scientology postulated the existence of no supreme essence or being and disavowed mysticism and supernaturalism, the court held that the Founding Church's claim that its theories and philosophy constituted a religion for purposes of the first amendment revealed a prima facie case for such status. Id. at 1160. The court noted that the theories of Scientology included a belief\n\nthat man is essentially a free and immortal spirit (a \"thetan\" in Scientological terminology) which merely inhabits the \"mest body\" (\"mest\" is an acronym of the words matter, energy, space, time). Man is said to be characterized by the qualities of \"beingness,\" \"havingness,\" and \"doingness.\" The philosophical theory was developed that the world is constructed on the relationships of \"Affinity,\" \"Reality,\" \"Communication,\" which taken together are denominated \"the ARC Triangle.\"\n\nId. at 1152. In Founding Church, the Scientologists claimed that Scientology was a religion entitled to protection under the first amendment whereas the proponents of the Science of Creative Intelligence state that their teachings and activities are not religious in nature. The case is noteworthy, however, as another example of a court giving a broad definition to the term religion under the first amendment. The court also noted that whether or not Scientology was a religion for purposes of the first amendment did not depend on the representations of its proponents, but was a proper subject for legal contest. Id. at 1160.\n\nDefendants point out that none of the above-discussed decisions explicitly defined religion within the meaning of the first amendment. The lack of a precise definition is not surprising in light of the fact that a constitutional provision is involved. This court knows of no decision defining press or speech within the meaning of the first amendment. The meaning of these terms, and many other constitutional terms, have expanded with the passage of time and the development of the nation. The drafters of the Constitution certainly attributed a meaning to the term \"the press\" which would not encompass means of communication now deemed to be part of \"the press.\" See, e.g., Rosenbloom v. Metromedia, Inc., 415 F.2d 892, 895 (3d Cir. 1969). Similarly, philosophies and theories recognized as religions or religious practices were unheard of by the drafters of the Constitution and the Bill of Rights. New religions appear in this country frequently and they cannot stand outside the first amendment merely because they did not exist when the Bill of Rights was drafted. As stated by Mr. Justice Frankfurter in McGowan v. Maryland, 366 U.S. 420, 465-66, 81 S. Ct. 1101, 1156, 6 L. Ed. 2d 393 (1961) (Frankfurter, J., concurring),\n\nOf course, the immediate object of the First Amendment's prohibition was the established church as it had been known in England and in most of the Colonies. But with foresight those who drafted and adopted the words, \"Congress shall make no law respecting an establishment of religion,\" did not limit the constitutional proscription to any particular, dated form of state-supported theological venture. The Establishment Clause withdrew from the sphere of legitimate legislative concern and competence a specific, but comprehensive, are of human conduct; man's belief or disbelief in the verity of some transcendental idea and man's expression in action of that belief or disbelief.\n\nWhen courts are faced with forms of \"the press\" or forms of \"religion\" unknown in prior decisional law, they must look to the prior interpretations of the constitutional provisions for guidance as to the substantive characteristics of theories or practices which have been found to constitute \"religion\" under the first amendment. The Supreme Court has interpreted the religion clauses of the first amendment several times in its recent history. E.g., Committee for Public Education v. Nyquist, 413 U.S. 756, 93 S. Ct. 2955, 37 L. Ed. 2d 948 (1973); Epperson v. Arkansas, 393 U.S. 97, 89 S. Ct. 266, 21 L. Ed. 2d 228 (1968); Abington School District v. Schempp, 374 U.S. 203, 83 S. Ct. 1560, 10 L. Ed. 2d 844 (1963); Engel v. Vitale, 370 U.S. 421, 82 S. Ct. 1261, 8 L. Ed. 2d 601 (1963); Torcaso v. Watkins, 367 U.S. 488, 81 S. Ct. 1680, 6 L. Ed. 2d 982 (1961); Everson v. Board of Education, 330 U.S. 1, 67 S. Ct. 504, 91 L. Ed. 711 (1947); Cantwell v. Connecticut, 310 U.S. 296, 60 S. Ct. 900, 84 L. Ed. 1213 (1940). The historical development and purpose of the religion clauses have been elaborated in a number of these cases, especially in Engel and in Everson. Religion, as comprehended by the first amendment now includes mere affirmation of belief in a supreme being, Torcaso, supra, invocation of a supreme being in a public school, Engel, supra, and reading verses from the Bible without comment, Schempp, supra.\n\nDefendants argue that all of the above-discussed decisions are inapposite to the issues in this suit because the activity in question in each of the prior cases was represented or conceded to be religious in nature whereas defendants in the instant action assert that the activities are not religious in nature. The court notes the distinction but cannot accept defendants' conclusion that the decisions are not relevant. The cases, at the very least, reveal the types of activity and belief that have been considered religious under the first amendment.\n\nFinding no guidance in the decisional law, defendants urge the court to adopt a \"definitional approach\" which is \"substantive and contextual.\" \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" Harned Affidavit para. 12. Under the cases discussed supra, it is the usual practice of courts to examine the substance, or content, of a challenged activity and the context in which it occurs. This court is following this usual practice in the instant case.\n\nDefendants illustrate their concept of a \"substantive and contextual\" approach by means of an analogy:\n\nImagine I watch an athlete, who bows his head, folds his hands and closes his eyes for a moment during athletic competition. Although this occurs in a secular context, I assume he is praying. When I mention this to him, he denies that he is praying and asserts that he is merely trying to empty his mind of every distraction so he can concentrate entirely upon the athletic event. I refuse to believe him because whenever I have seen persons act in this manner, they have been engaged in prayer. But the athlete responds that if his actions did have religious significance, he would act similarly after his victories in order to express his gratitude to God. Yet he does not do so. Furthermore, he says, if he were devout, he would certainly not maintain the extravagant life style, that has gained him notoriety in the newspapers. In the end, I am persuaded that his actions have no religious significance. He has provided me with the complete context in which it is possible to accurately assess whether or not his actions have any religious significance. In the context of this athlete's life and ideas, these actions have no religious significance.\n\nHarned Affidavit para. 13. Although defendants label this approach \"substantive and contextual,\" the analogy is devoid of substantive analysis and places determinative emphasis on the athlete's subjective characterization of his activity. To inject some substantive analysis into the analogy, the narrator might ask the athlete how he emptied his mind of distraction. If the athlete replied that when he closes his eyes he pictures in his mind's eye a black dot which expands until it blots out all distracting thoughts and noises, then the narrator again would conclude that the action carried no religious significance. If, however, the athlete states that after he closes his eyes he invokes and contacts That, the narrator no doubt would ask a definition of \"That.\" If the athlete answered that \"That\" is the eternal, omnipresent source of everything in the universe, the narrator might respond, \"oh, then you were praying.\" The athlete would answer: \"Oh, no. Prayers are directed to God, which is a projection of the human imagination of an ideal and around which the theologies and religions of the world have grown. There's nothing religious about That. That is an objective reality. I know because I contact it frequently and it helps me.\" Although the athlete steadfastly and sincerely denies the religiosity of his action, it is doubtful that the narrator would have any hesitation in concluding that the athlete had engaged in what society would recognize as a religious activity. The difference in interpretation does not depend on the sincerity or cognition of the athlete. Rather, the difference is semantical. The athlete is cognizant of his action and sincerely believes that he has contacted \"That.\" He fails to characterize the activity as religious because he believes religions to consist of moral precepts and rituals and an abstraction known as God. The narrator thus would be faced with a situation in which the questioned action had no religious significance in the eyes of the athlete, but clearly would be viewed as religious by society. The difference derives from the different definitions of religion held by the athlete and by society.\n\nAs noted by defendants' expert, \"religion is notoriously difficult to define.\" Harned Affidavit para. 7. Judge (now Chief Justice) Burger has noted that resort to dictionary definitions reveals that \"the terms 'religion' and 'religious' in ordinary usage are not rigid concepts.\" Washington Ethical Society v. District of Columbia, 101 U.S.App.D.C. 371, 249 F.2d 127, 129 (1957). Subjective philosophical will vary among individuals because of their varying concepts of religion or science or philosophy. To allot \"critical,\" Harned Affidavit para. 21; Rao Affidavit para. 21, or determinative weight on the question whether or not an activity or belief is \"religious\" under the first amendment to the proponents' subjective characterizations of their activities and beliefs would be to inject a variable into the first amendment test which would preclude a fair and uniform standard. Under this approach, courts would be bound to accept the proponents' representations of its activities and beliefs as religious or secular unless the court determined by evaluating the proponents' demeanors in the witness box that the proponents were insincere in their characterizations of their activities and beliefs. The courts thus would be forced to examine and to accept the intellectual classification system of each proponent of certain activities or beliefs. The only inquiry left to the courts would be into the sincerity with which the proponents hold their systems of classification. \"Religion\" under the first amendment would take on a different meaning in each case, and similar or virtually identical practices would be religious or not religious under the first amendment depending on the classification system of a particular proponent. For example, one of the clergymen meditators deposed as a fact witness on behalf of defendants testified that \"[religion] to me, is my personal relationship to God. The concepts about Gods in other religions are philosophy.\" Roberts Deposition at 85. If this clergyman were to offer a course in the philosophical and moral teachings of a religion other than his own in a public high school, some taxpayers no doubt would sue under the establishment clause to enjoin the teaching of the course. In deciding whether or not the teachings were religious, if the court were required to place determinative weight on the characterization of the teachings by the clergyman and his students, then the court would be bound to rule that a system of teachings considered by society to be religious are not religious under the first amendment. In the context of the life and ideas of the clergyman and his students, to whom the teachings were presented as philosophical, the teachings carry no religious significance; they are merely philosophical discourses. A substantive analysis of the teachings, of course, would tend to show their religious nature and a court certainly would be justified in finding the course \"religious\" under the first amendment despite the sincere characterization by the clergyman of the teachings as secular philosophy.\n\nIn a vein similar to defendants' clergyman-fact witness, defendant Jarvis testified to an intensely personal and subjective definition of God: \"To me, God is a personal appreciation, something that is developed in my heart and mind with respect to my relationship and communication with my creator, and it falls into my religious development because I include God within my own religious life.\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" Jarvis Deposition at 1049. In contradistinction to God, \"a personal appreciation\" of his creator, defendant Jarvis defined creative intelligence as an objectively demonstrable phenomenon. Id. at 878. If Mr. Jarvis believes that his religion derives from \"a personal appreciation\" of his creator, then it is not surprising that he would fail to view what he believes to be an objectively demonstrable phenomenon and the teachings thereon to be religious in nature.\n\nThe problem of placing heavy emphasis on subjective characterizations of certain beliefs and activities by the proponents of those beliefs and activities is illustrated by Welsh v. United States, 398 U.S. 333, 90 S. Ct. 1792, 26 L. Ed. 2d 308 (1970). Welsh sought classification as a conscientious objector under section 6(j) of the Universal Military Training and Service Act. Section 6(j) allowed classification of a registrant as a conscientious objector only if his objection to war sprang from religious beliefs. Although Welsh disavowed that his conscientious objection to war derived from religious beliefs, the Supreme Court held that Welsh's beliefs were religious within the meaning of the Act. The Court of Appeals had relied on Welsh's disavowal of a religious basis for his objection in upholding the Appeal Board's denial of conscientious objector status to Welsh. In reversing the Court of Appeals, the Supreme Court stated that the lower court had placed:\n\nundue emphasis on the registrant's interpretation of his own beliefs. The Court's statement in [United States v. Seeger that a registrant's characterization of his own belief as \"religious\" should carry great weight does not imply that his declaration that his views are nonreligious should be treated similarly. When a registrant states that his objections to war are \"religious,\" that information is highly relevant to the question of the function his beliefs have in his life. But very few registrants are fully aware of the broad scope of the word \"religious\" as used in  6(j), and accordingly a registrant's statement that his beliefs are nonreligious is a highly unreliable guide for those charged with administering the exemption.\n\nId. at 341, 90 S. Ct. at 1797. The Court also noted that Welsh had amended his original disavowal through a letter to his Appeal Board which stated that his beliefs \"were certainly religious in the ethical sense of the word.\" Id.\n\nThe unreliability of proponents' characterizations of their actions and beliefs is illustrated by the instant case. The first organization in this country to offer instruction in the technique of Transcendental Meditation was incorporated in California in 1959 by Mahareshi Mahesh Yogi and others under the name of the Spiritual Regeneration Movement Foundation. Jarvis Deposition at 858, 861. Until 1965, the Spiritual Regeneration Movement Foundation was the only organization in the United States which offered instruction in Mahareshi Mahesh Yogi's teachings. Id. at 852. Defendant Jarvis served as secretary of this corporation from 1963 to 1965. Id. at 854. One of the articles of the certificate of incorporation, as amended, of the Spiritual Regeneration Movement Foundation stated that \"this corporation is a religious one, the educational purpose shall be to give instruction in a simple system of meditation.\" Id. at 861. The proponents of SCI/TM before the court today characterize their activities as secular in nature.\n\nTo the extent that the standard recommended by defendants places critical or determinative weight on the subjective characterization of the proponents of their activities and beliefs, it must be rejected. The inappropriateness of a standard which places such importance on the proponents' characterization of their beliefs and activities is particularly apparent in the context of an establishment clause case in which the proponents have enlisted the aid of governmental entities in the propagation of their beliefs, teachings, theories, and activities. While the characterization of proponents is properly admissible evidence, proponents cannot propagate concepts which society recognizes as religious in nature merely because the proponents view the concepts as secular.\n\nThe court finds it unnecessary to improvise an unprecedented definition of religion under the first amendment because it appears that this case is governed by the teachings of prior Supreme Court decisions. Careful inspection of the facts in this suit reveal that the novel aspects of the case are more apparent than real.\n\nThe textbook clearly teaches \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" and assumes that there exists and has existed eternally an unmanifested or uncreated field of life which is unbounded or infinite. This field of life is present everywhere, both within and without everything in the universe; it permeates everything and every being and is the ultimate reality of everything in the universe. This field of life is active in the form of \"creative intelligence,\" is the source of all power in the universe, has \"unlimited power,\" and encompasses all knowledge. This field of life is pure and perfect and contains all qualities of the universe in their pure, perfect, and infinite form. This field of life is alternately termed perfection of existence, bliss, and intelligence. This field of being contains love, justice, and truth in their pure and infinite forms. Contact with this field of being bestows upon individuals the ability to choose between right and wrong spontaneously, without regard to moral codes and laws. T at 180. Manifestly, the textbook describes some sort of ultimate reality which in its various forms is given the name \"god\" in common usage. Over a dozen years ago, a unanimous Supreme Court took judicial cognizance of \"the ever-broadening understanding of the modern religious community\" concerning the concept of God. United States v. Seeger, 380 U.S. 163, 180, 85 S. Ct. 850, 861, 13 L. Ed. 2d 733 (1965). The Court noted that \"[the] eminent Protestant theologian, Dr. Paul Tillich . .. identified God not as a projection 'out there' or beyond the skies but as the ground of our very being.\" Id. The Court then quoted Dr. Tillich as follows:\n\nI have written of the God above the God of theism . . . . In such a state [of self-affirmation] the God of both religious and theological language disappears. But something remains, namely, the seriousness of that doubt in which meaning within meaningless is affirmed. The source of this affirmation of meaning within meaningless, of certitude within doubt, is not the God of traditional theism but the \"God above God,\" the power of being, which works through those who have no name for it, not even the name God.\n\nId., quoting P. Tillich, II Systematic Theology 12 (1957).\n\nThe Court followed this excerpt with a quotation from a contemporaneous pronouncement of the Ecumenical Council of the Catholic Church:\n\nEver since primordial days, numerous peoples have had a certain perception of that hidden power which hovers over the course of things and over the events that make up the lives of men; some have even come to know of a Supreme Being and Father.\n\n* * *\n\nThe Church regards with sincere reverence those ways of action and of life, precepts and teachings which, although they differ from the ones she sets forth, reflect nonetheless a ray of that Truth which enlightens all men.\n\nId. at 182, 85 S. Ct. at 862, quoting Council Daybook, Vatican II, 3d Sess. 282 (1965).\n\nFinally the Court quoted the views of a leader in the Ethical Culture Movement on that Movement's conception of the term \"God:\"\n\nWhat ultimate reality is we do not know; but we have the faith that it expresses itself in the human world as the power which inspires in men moral purpose.\n\n* * *\n\nThus the \"God\" that we love is not the figure on the great white throne, but the perfect pattern, envisioned by faith, of humanity as it should be, purged of the evil elements which retard its progress toward \"the knowledge, love and practice of the right.\"\n\nId. at 183, 85 S. Ct. at 863, quoting D. Muzzey, Ethics As a Religion (1951).\n\nIn his concurring opinion, Mr. Justice Douglas outlined concepts of \"god\" as expounded in Hinduism and Buddhism. Concerning Hindu conceptions of \"god,\" Mr. Justice Douglas notes:\n\nThough Hindu religion encompasses the worship of many Deities, it believes in only one single God, the eternally existent One Being with his manifold attributes and manifestations.\n\n* * *\n\nPhilosophically, the Supreme Being is the transcendental Reality which is Truth, Knowledge, and Bliss. It is the source of the entire universe.\n\nId. at 189-90, 85 S. Ct. 866 (Douglas, J., concurring). Mr. Justice Douglas continued:\n\nBuddhism -- whose advent marked the reform of Hinduism -- continued somewhat the same concept [of God or Brahman]. As stated by Nancy Wilson Ross, \"God -- if I may borrow that word for a moment -- the universe, and man are one indissoluble existence, one total whole. Only THIS -- capital THIS -- is. Anything and everything that appears to us as an individual entity or phenomenon, whether it be a planet or an atom, a mouse or a man, is but a temporary manifestation of THIS in form; every activity that takes place, whether it be birth or death, loving or eating breakfast, is but a temporary manifestation of THIS in activity. When we look at things this way, naturally we cannot believe that each individual person has been endowed with a special and individual soul or self. Each one of us is but a cell, as it were, in the body of the Great Self, a cell that comes into being, performs its functions, and passes away, transformed into another manifestation. Though we have temporary individuality, that temporary, limited individuality is not either a true self or our true self. Our true self is the Great Self; our true body is the Body of Reality, or the Dharmakaya, to give it its technical Buddhist name.\n\n* * *\n\n. . . if \"God\" is taken to mean a personal Creator of the universe, then the Buddhist has no interest in the concept. Id., p. 39. But if \"God\" means something like the state of oneness with God as described by some Christian mystics, then the Buddhist surely believes in \"God,\" since this state is almost indistinguishable from the Buddhist concept of Nirvana, \"the supreme Reality; . . . the eternal, hidden and incomprehensible Peace.\" Id., pp. 39-40.\n\nId. at 190-91, 85 S. Ct. at 866, citing Conze, Buddhism (1959) (Douglas, J., concurring).\n\nThe foregoing quotations, of course, are not relied upon by this court for their technical accuracy. Rather, the quotations demonstrate the substantive content attributed to the term \"God\" by contemporary society. It cannot be doubted that the concepts encompassed by this substantive content are recognized as \"religious\" concepts. The similarity, indeed, virtual identity, between some of the concepts used in the quotations to describe \"God\" and the terms used in the textbook to describe creative intelligence is unmistakable. For example, compare the Buddhist concept that \"[our] true self is the Great Self,\" with the textbook statement that \"[we] know that the true nature of the self is unbounded pure creative intelligence, bliss-consciousness -- that most self-sufficient field of life.\" T at 121. Compare the Buddhist concept that \"God -- if I may borrow that term for a moment -- the universe, and man are one indissoluble existence,\" with the textbook statement that \"[the] universe is a continuous, unified whole, an unbroken field of creative intelligence.\" T at 137. Compare the Buddhist concept that \"[anything] and everything that appears to us as an individual entity or phenomenon, is but a temporary manifestation of THIS. . . .\" with the textbook statements that \"everything in creation is nothing other than the expression of unmanifest creative intelligence,\" T at 260, and that \"all aspects of life [are] manifestations of unmanifest creative intelligence.\" T at 262. Compare the Buddhist concept of Nirvana as \"the eternal, hidden and incomprehensible Peace,\" with the textbook's description of the field of pure creative intelligence as the eternal, T at 242, unmanifest, T at 30, unbounded, T at 24, silent, T at 82, nonchanging, T at 94, immovable, T at 40, field of unbounded harmony, T at 138.\n\nCompare the Hindu concept of the Supreme Being as Truth, Knowledge, and Bliss with the textbook statements asserting that the field of pure creative intelligence is \"an ocean of bliss,\" T at 152, \"a field of unlimited happiness,\" T at 32, the basis of all knowledge, T at 97, \"the home of all knowledge,\" T at 149, and truth, T at 76, 81. Compare the Hindu concept that the Supreme Being is the source of the entire universe with the textbook statement that creative intelligence lies at the basis of every individual life and of everything, T at 189, and is the source of all existence. T at 171.\n\nCompare the Catholic concept of God as Truth with the textbook's indication that the field of pure creative intelligence is truth. T at 76, 81. Compare the Protestant theologian's concept of God as \"the very ground of our being\" with the textbook's description of the field of pure creative intelligence as \"the very source of life-energy,\" T at 98, and the \"universal basis of life,\" T at 188-89, and \"the stable foundation of our life [ sic ],\" T at 271.\n\nThese concepts concerning God or a supreme being of some sort are manifestly religious when they appear as tenets of Christianity or Buddhism or Hinduism. These concepts do not shed that religiosity merely because they are presented as a philosophy or as a science. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" Similarly, whether an unmanifest and eternal field of life with all the characteristics attributed to it as the textbook attributes to creative intelligence is called a supreme being, god, the ultimate reality, Brahman, Tao, Allah, Nirvana, THIS, creative intelligence and the field of creative intelligence and the field of creative intelligence, the Father, Son, and Holy Spirit, it, or the One is immaterial to determining the religious nature of the concept; although the precise conceptions or definitions of the ultimate reality or supreme being will differ from religion to religion, the religious nature of the concept is incontrovertible. Whether \"God\" is considered an ultimate universal principle or being or essence or entity or field of life on which the universe is based, has no bearing on the religious nature of the concept. It cannot be doubted that concepts of \"God\" or an ultimate level of life or ultimate reality are religious concepts. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" E.g., Engel v. Vitale, supra; Torcaso v. Watkins, supra; Seeger v. United States, supra; DeSpain v. DeKalb County Community School District, supra.\n\nThe puja chant is an invocation of a deified human being who has been dead for almost a quarter of a century. An icon of this deified human being rests on the back of a table on which is placed a tray and offerings. During the singing of the chant, which identifies the items on the table and in the room as offerings to this deity, some of these offerings are lifted from the table by the chanter and placed onto the tray. It cannot be doubted that the invocation of a deity or divine being is a prayer. Engel v. Vitale, supra, 370 U.S. at 424, 82 S. Ct. 1261. The religious nature of prayer has been recognized by many courts, e.g., Engel v. Vitale, supra; \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" DeSpain v. DeKalb County Community School District, supra, and the proposition needs no further demonstration here.\n\nA recognition of the religious nature of the teachings and activities questioned is largely determinative of this suit since the entanglement of both the federal and state governmental entities is apparent. Under the establishment clause, a three-part test has evolved to determine whether governmental action in regard to religious activity constitutes a violation of the constitutional prohibition. In order to avoid contravening the establishment clause, the law or governmental action in question\n\nfirst, must reflect a clearly secular legislative purpose, second, must have a primary effect that neither advances nor inhibits religion, and third, must avoid excessive government entanglement with religion.\n\nCommittee for Public Education v. Nyquist, supra, 413 U.S. at 773, 93 S. Ct. at 2965. (citations omitted).\n\nThe secular purpose of the governmental associations with the SCI/TM course apparently is to make available to public school students the alleged benefits of the technique of Transcendental Meditation. Practice of the technique is alleged by its proponents to reduce stress in individuals; the reduction in stress allegedly would result in an increase in educability and sociability among the students taking the course. This purpose appears to be secular. In effecting this secular purpose, however, the governmental agencies did not merely offer a course in the technique of Transcendental Meditation. In fact, the teaching and practice of the technique occupies a minor fraction of the class time of the SCI/TM course. Instruction in the technique takes less than twenty minutes. Aaron Affidavit at 2. Ten or fifteen minutes of each class are spent in practicing the technique, Metropole Deposition at 416. Approximately 70 percent of the class time is devoted to the teaching of the theory of the Science of Creative Intelligence, the focal point of which is the textbook. As stated earlier, the textbook posits that during the practice of Transcendental Meditation the meditator comes into contact with the field of pure creative intelligence, \"the ultimate reality of every object,\" T at 154. As outlined above, most of the book is devoted to attributing various characteristics to the field of pure creative intelligence and creative intelligence. As demonstrated above, the characteristics which are attributed to pure creative intelligence are parallel to characteristics which are attributed to the supreme being or ultimate reality by mankind. In effecting the secular purpose of reducing stress among public school students, however, the governmental entities have not merely introduced the teaching of a simple technique of meditation whereby the meditator contemplates a meaningless sound. Rather, the SCI/TM course teaches that the meaningless sound is merely a vehicle used by the meditator to contact directly the \"perfection of existence,\" a level of life or being beyond and unmanifest to the mundane universe and observable or knowable solely through direct \"contact\" as outlined by the textbook, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" or possibly through its manifestations, i.e., the universe. Owing to the religious nature of the concept of the field of pure creative intelligence and creative intelligence, it is apparent that the governmental agencies have sought to effect a secular goal by the propagation of a religious concept, a belief in an unmanifest field of life which is perfect, pure, and infinite. In addition, students wishing to learn the technique of Transcendental Meditation are compelled to attend a religious ceremony, the puja. These means of effecting ostensibly secular ends are prohibited by the establishment clause. Abington School District v. Schempp, supra; Engel v. Vitale, supra.\n\nApplying the second prong of the Nyquist test, the promulgation of a belief in the existence of a pure, perfect, infinite, and unmanifest field of life clearly has a primary effect of advancing religion and religious concepts. Abington School District v. Schempp, supra; Engel v. Vitale, supra. Under the final prong of the test, the aid given to the SCI/TM course by both the federal government and the state of New Jersey clearly constitutes an \"excessive government entanglement in religion.\" Lemon v. Kurtzman, 403 U.S. 602, 91 S. Ct. 2105, 29 L. Ed. 2d 745 (1971). The course is offered as part of the curriculum at five New Jersey public high schools and the federal government has provided funds to aid in the establishment of the SCI/TM course in the public schools.\n\nThe SCI/TM course fails to pass muster under the three-pronged test enunciated in Nyquist and thus violates the establishment clause of the first amendment. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nSUMMARY JUDGMENT\n\nPlaintiffs move for partial summary judgment under Rule 56(a) to enjoin the teaching of SCI/TM in the New Jersey public schools. Rule 56(c) provides in part:\n\nThe judgment sought shall be rendered forthwith if the pleadings, depositions, answers to interrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.\n\nThe record before the court on this motion for summary judgment is unusually complete. The court has in evidence the 296-page textbook used in the course, a detailed description of the puja and defendants' translation of the chant sung therein, hundreds of pages of deposition testimony by two people who taught four of the five SCI/TM courses in New Jersey high schools, and other depositions and affidavits. This large quantity of evidence fails to reveal any dispute between the parties as to the operative facts. Defendants, however, argue that the court cannot and should not grant plaintiffs' motion for summary judgment. Defendants advance essentially three arguments in support of their position.\n\nFirst, defendants argue that a trial must be held to determine the sincerity with which defendants categorize their teachings as being \"not religious.\" For purposes of this summary judgment motion, the court, of course, accepts the sincerity of defendants' categorization of their teaching as not religious and their statement that only a tiny fraction of the more than seven thousand trained TM teachers in the United States view the SCI/TM course as religious, Jarvis Affidavit paras. 16, 23. The reasons why defendants' characterization of their teachings cannot be determinative of the religious nature of those teachings were stated supra at 1315-1320.\n\nIn connection with their first argument, defendants state that \"[in] Theriault v. Silber, 391 F. Supp. 578 (W.D.Tex.1975) and United States v. Kuch, 288 F. Supp. 439 (D.D.C.1968) it was determined that certain organizations were not religious because they did not sincerely hold the beliefs they professed.\" Db at 34. This statement raises a different issue of sincerity, the sincerity with which the alleged adherents of certain activities or beliefs profess those beliefs. Plaintiffs, of course, do not contest the sincerity with which defendants adhere to their teachings, such as the teaching that the practice of Transcendental Meditation brings the practitioner into direct contact with an unmanifest, eternal, pure, and perfect field of life.\n\nSecond, defendants argue that the court should not grant plaintiffs' motion for summary judgment because the court is faced with a novel issue of law in that no court previously has set forth explicit criteria, the possession of which unmistakably denominate beliefs, teachings, or activities as religious within the meaning of the first amendment. The courts have recognized certain teachings and beliefs as religious in nature. While defendants' teachings wear novel labels, the underlying teachings fall well within the concepts which courts previously have found to be religious.\n\nIn this posture, it is difficult to see the need for a bench trial. Counsel for defendants indicated at oral argument that the factual record is unlikely to be supplemented by a bench trial. The principal deviser of the Science of Creative Intelligence and the primary teacher of the technique of Transcendental Meditation, Maharishi Mahesh Yogi, is unlikely to testify at trial. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Defendants' counsel stated at oral argument that their only anticipated addition to the record now before the court was the testimony of two or three experts on religion. The experts would be called upon to give their opinions as to definitions of the term religion and their interpretations of the SCI/TM course. Defendants' counsel acknowledged at oral argument that the expert opinions could be reduced to writing, and defendants have submitted the affidavits of two experts in religion in opposing plaintiffs' motions for summary judgment.\n\nIn these affidavits, defendants' experts point out a long-standing debate among academicians as to \"the virtues of a functionalist/inclusive as opposed to a substantive/exclusive definition of religion.\" Harned Affidavit para. 7. Defendants' experts urge the court to construct a definition of religion which would exclude theories or practices which (1) did not contain certain attributes, such as, priests, houses of worship, symbols, dogmas concerning after-life and salvation, and (2) were not characterized by its adherents as religious. Defendants' experts state no rationale for this court's construction of an \"exclusive\" definition of religion except that \"functionalist\" definitions of religion tend to be overinclusive. Defendants' experts also admit that their narrow \"exclusive\" approach to defining religion is inappropriate under the free exercise clause, but maintain its validity for purposes of the establishment clause. Id. P 11. See pages 1315-1320 supra.\n\nThe approach to defining religion offered by defendants' experts is directly contrary to holdings of both the Supreme Court and lower federal courts. E.g., Engel v. Vitale, supra; Torcaso v. Watkins, supra; DeSpain v. DeKalb County Community School District 428, supra. The courts never have excluded certain beliefs or practices from the application of the religion clauses on the ground that the beliefs or practices lacked this or that type of teaching or practice which is connected to conventionally recognized religions. In addition, the courts have deemed activities and teachings religious even though the activities did not derive from a particular religious sect. E.g., Engel v. Vitale, supra; Torcaso v. Watkins, supra. An expert's definition of religion never can be determinative and can be of only tangential relevance to the meaning of constitutional terms. The court is interested in the term religion as it is used in the Constitution and has no interest in attempting to decide an academic dispute among theologians as to the best approach to defining religion for their professional purposes. For example, defendants' experts assert that \"[elements] commonly associated with religion,\" such as, clergy, places of worship, explicit moral codes, are not part of SCI/TM. See Harned Affidavit para. 24; Rao Affidavit para. 23. None of these elements need be present, however, for a court to determine that a practice or belief is religious within the meaning of the first amendment. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" See, e.g., Torcaso v. Watkins, supra.\n\nWhile expert opinion is invaluable in certain cases, a court, in dealing with a constitutional term, must be governed more by prior judicial findings than by the opinions of experts. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" Since the concepts being taught by defendants repeatedly have been recognized as religious by the courts, see pages - supra, the conclusions of experts that SCI/TM does not constitute \"religion as I know it,\" Harned Affidavit para. 30; Rao Affidavit para. 27, fails to raise a material issue of fact which would necessitate a bench trial. In addition, the prior judicial recognition of teachings such as those of defendants as religious dispels the novelty of the legal question, and, thus, the necessity of a bench trial.\n\nFinally, defendants argue that plaintiffs' motion for summary judgment cannot be granted unless the court infers that the teachings of the SCI/TM course are religious within the meaning of the first amendment. Defendants point out that all inferences to be drawn from the underlying facts on a motion for summary judgment \"must be viewed in the light most favorable to the party opposing the motion.\" Adickes v. S.H. Kress \u0026 Co., 398 U.S. 144, 158-59, 90 S. Ct. 1598, 1609, 26 L. Ed. 2d 142 (1970), quoting United States v. Diebold, Inc., 369 U.S. 654, 655, 82 S. Ct. 993, 8 L. Ed. 2d 176 (1962); Goodman v. Mead Johnson \u0026 Co., 534 F.2d 566, 573 (3d Cir. 1976). The courts in all three cases reversed summary judgments on the ground that \"[a] study of the record in this light leads us to believe that inferences contrary to those drawn by the trial court might be permissible.\" United States v. Diebold, Inc., supra, at 655, 82 S. Ct. at 994. In light of the prior judicial recognition of teachings such as those of defendants as religious, no inference is possible except that the teaching of SCI/TM and the puja are religious in nature; no other inference is \"permissible\" or reasonable, especially because the court is dealing with the meaning of a constitutional term and not with a factual dispute such as was involved in Adickes, supra, Diebold, supra, and Goodman, supra.\n\nAlthough defendants have submitted well over 1500 pages of briefs, affidavits, and deposition testimony in opposing plaintiffs' motion for summary judgment, defendants have failed to raise the slightest doubt as to the facts or as to the religious nature of the teachings of the Science of Creative Intelligence and the puja. The teaching of the SCI/TM course in New Jersey public high schools violates the establishment clause of the first amendment, and its teaching must be enjoined.\n\nPlaintiffs will submit an order in conformity with this opinion with consent as to form within 10 days.\n\n\u003cspan class=\"fn\"\u003e1. Plaintiffs have been unable to effect service of process on Maharishi Mahesh Yogi, apparently a citizen of India, on account of his prolonged absence from this country.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Creative intelligence arises out of the field of pure creative intelligence. The court notes the distinction, but for purposes of discussion the two entities will be considered as complimentary portions of a single entity. See discussion at 1290-1291, 1292-1293 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. \"Mantra\" has been defined as a meaningless sound which is essential to the practice of Transcendental Meditation and which is \"known\" to have a positive effect on the nervous system. Metropole Deposition at 352; Aaron Deposition at 664; Jarvis Deposition at 886. Defendants attach great importance to the selection of mantras for individuals and deny that use of a randomly selected sound in meditation will produce the beneficial effects alleged to result from the practice of their method of meditation. See Jarvis Deposition at 887-90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See N.J.S.A. 18A:6-34 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The puja is a ceremony at which each student was given his or her mantra, the sound aid essential to practicing the TM technique.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The letter \"T\" in the citations represents the textbook used in the New Jersey high schools, \"Science of Creative Intelligence for Secondary Education: First-Year Course.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The practice of TM by a person who has attained cosmic consciousness may lead to further refinement of his nervous system and increased faculties of perception until a state called unity consciousness is reached. If a person, through the practice of TM, develops his faculties of perception to their full potential and attains the highest level of refinement of his nervous system, the person is said to have attained the highest form of consciousness, which is called interchangeably either God consciousness or Brahman consciousness. Jarvis Deposition at 866b \u0026 866e-f; Aaron Deposition at 650-57. Defendant Aaron, a SCI/TM teacher at two of the New Jersey high schools, stated at deposition that she did not mention unity consciousness or Brahman or God consciousness to her classes. Aaron Deposition at 660.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The practice of Transcendental Meditation automatically bestows upon a practitioner the ability to tell what is right from what is wrong: A more and more exact sense of judgment between right and wrong comes naturally as one's consciousness grows, but when consciousness is highest and creative intelligence is infused into the nature of one's mind to the fullest extent, the mind knows without doubt what is right and wrong. By natural inclination and natural taste, wrong actions and wrong thoughts are not even considered. So the real art of performing right action is in having a mind that is right at all times. To be right, the mind has to be in that state of lasting contentment and purity which alone belongs to the state of cosmic consciousness. T at 180. The textbook states that the laws and traditions of one's culture and religion provide guidelines \"to proper modes of thinking and behavior\" prior to the attainment of cosmic consciousness. T at 180-81. Once a practitioner of Transcendental Meditation achieves cosmic consciousness, however, mundane moral codes apparently are superfluous. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant Jarvis also acknowledged that pure creative intelligence is the source of religion, philosophy, and knowledge. Jarvis Deposition at 1019.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant Jarvis apparently was referring to only the field of pure creative intelligence in the quoted sentence. While the field of pure creative intelligence remains unmanifest and silent, according to the textbook, no such passivity is attributed to creative intelligence by the textbook. As noted in footnote 2, supra, the court is regarding the field of pure creative intelligence and creative intelligence as complimentary aspects of the same entity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In addition to the ascription of activity to creative intelligence as an entity, the textbook ascribes activity to certain qualities of creative intelligence. The specific qualities of creative intelligence are the means through which creative intelligence \"expresses itself.\" T at 258, 13. For example, the textbook states that \"[the] functioning of creative intelligence is such that under similar circumstances, similar results occur . . . . There is something definite; nothing is random, and it is this specific value of creative intelligence that automatically carries out evolution everywhere.\" T at 64. \"The progressive and evolutionary qualities of creative intelligence are at the basis of all growth everywhere; they continually propel life on increasing steps of progress towards the fullness of life.\" T at 42. \"[The] functioning of the orderly quality of [creative intelligence] reveals the intelligence governing individual and cosmic life.\" T at 60. \"Creative intelligence is precise and truthful . . . . It is this precise quality of creative intelligence that structures the finer levels of existence and unfolds the truth of life to our awareness.\" T at 72. \"The precise and truthful qualities of creative intelligence direct the growth of everything in nature with precision and exactness.\" T at 80. \"[The] precise quality of creative intelligence structures with minute detail all the manifest expressions of life, while the truthful quality of creative intelligence provides the nonchanging platform from which these changing expressions arise.\" T at 82. \"It is this efficient quality of creative intelligence that kindly and effortlessly guides everything to its goal in the fullness of life.\" T at 108. \"The harmonizing and diversifying qualities of creative intelligence enable every thing in nature to fulfill its own specific role while contributing to the harmonious functioning of the whole.\" T at 140. \"The integrative quality of creative intelligence promotes the progress, and evolution of all values of life -- physical and non-physical, abstract and concrete.\" T at 170. Throughout creation there is the expression of life, and underneath there is stability. The wide range of variety in creation is based on the nonvariable unity of existence, intelligence. To be able to put the changing and nonchanging aspects of life together -- this is the integrative quality of creative intelligence. T at 172. \"The generous and economical qualities of creative intelligence endlessly and precisely give and give and give until every aspect of life is full to overflowing.\" T at 206. \"The generous and economical qualities of creative intelligence provide abundance of wealth with precision in every bit of life.\" T at 213. Through Transcendental Meditation, \"[the] clean and purifying qualities of creative intelligence cleanse the body, senses, mind, and heart simultaneously.\" T at 224. \"The liberating and responsible qualities of creative intelligence make such diverse expression of life grow freely within the dignity of its own individual structure.\" T at 238. \"The creative and traditional qualities of creative intelligence provide patterns of change through which everything quickly progresses to the fullness of life.\" T at 240. \"The holistic and fulfilling qualities of creative intelligence bring fulfillment to life by enabling us to perceive the fullness of life in every individual expression of life.\" T at 258.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In apparent contradiction to the statement in his affidavit, Mr. Jarvis, president of WPEC -- US, testified at deposition that creative intelligence is an objectively demonstrable phenomenon, \"demonstrable in its expression. For instance, I move my hand.\" Jarvis Deposition at 878. Mr. Jarvis also testified at deposition that SCI/TM was not a philosophy. Id. at 1016.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. At other points, the textbook refers to \"bliss-consciousness\" as a state of mind which can be achieved through Transcendental Meditation. E.g., T at 95. Presumably, this use of \"bliss-consciousness\" differs from its use as a synonym for creative intelligence. This situation illustrates a recurrent technique of the textbook, which is the attribution of different meanings to identical, seemingly technical terms, such as \"bliss-consciousness\" and \"fullness,\" in different sections of the textbook. No doubt, this technique contributed to the fact that no high school class in New Jersey managed to complete more than nine of the 32 lessons contained in the textbook. Jarvis Affidavit at para. 32. The vagueness engendered by this technique is compounded by the fact that the textbook, although labelled a \"Science\" and now called \"essays in philosophy,\" is virtually devoid of reliable definitions. The 296-page textbook defines one term: creative intelligence. All other definitions apparently are left to classroom discussion as all other terms are undefined or are defined capriciously, varying from sentence to sentence. An example of whimsical definition occurs on page 23 of the textbook. The first sentence on page 23 reads: \"Perceiving the fullness of life means perceiving creative intelligence functioning in every expression of life.\" Thus it appears that fullness of life means perceiving creative intelligence functioning in every aspect of life. A few paragraphs later on the same page, however, the textbook states that \"[the] fullness of life is already within us -- it only needs to be enlivened.\" If fullness of life means creative intelligence functioning in every aspect of life, however, how can the fullness of life be within us waiting to be enlivened? The next page of the textbook states that it is the field of pure creative intelligence that is within us and it is creative intelligence which \"only needs to be enlivened.\" T at 24. It thus appears that fullness of life is a synonym for creative intelligence instead of a synonym for creative intelligence functioning in every expression of life. The paragraph which begins by informing the reader that the fullness of life is within us waiting to be enlivened, however, continues as follows: Fullness of life means making use of the fullness of creative intelligence -- living a life that is always creative and interesting, ever lively with new discoveries and insights, life that is always intelligent, orderly and purposeful, our creative energies being productively channeled into ever greater achievements. Fullness of life means enjoying the full range of our potentialities -- inner strength and stability, outer adaptability, ease of expression, and enjoyment. T at 23. Appropriately, the text of lesson one ends three sentences later with the question \"[what] does fullness of life mean to you?\" T at 23. The textbook does not state whether the student is to pick one of the definitions appearing on page 23 or use his imagination to create a definition for himself. In either case, clarity and precision of communication suffer. As stated earlier, \"fullness of life\" is the main theme of the three-year curriculum of \"The Science of Creative Intelligence,\" the three subthemes adopted for each year being \"perceiving the fullness of life,\" \"developing the fullness of life,\" and \"living the fullness of life.\" T at 11. Despite the obvious importance of the term \"fullness of life\" to an intellectual understanding of the course, the textbook never offers an explicit, reliable definition. In numerous places, the textbook uses \"fullness of life\" synonymously with creative intelligence or the field of pure creative intelligence. E.g., T at 126. But see T at 216, where the textbook states \"[love] is the fullness of life.\" The purpose of this nebulous approach to technical terms is never stated, but the lack of precise definition of terms and the use of identical terms for different referents seems an unusual and unnecessarily confusing approach to be taken by an introductory textbook in a science or philosophy course. Other instances of imprecise and poor usage of words occur throughout the textbook. For example, 25 of the 32 lessons in the textbook begin with the words \"two qualities of creative intelligence.\" These words are followed immediately, not by the names of two qualities, but by two adjectives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The same clergyman testified that there was no connection between the teachings embodied in the Science of Creative Intelligence and the technique of Transcendental Meditation. See id. at 71, 99. The clergyman apparently was oblivious to the fact that defendants teach that the Science of Creative Intelligence explains the mechanics of the practice of Transcendental Meditation, including the teaching that the alleged benefits of the practice of Transcendental Meditation derive not from the contemplation of a meaningless sound but from contact with an unmanifest field of life known as the field of pure creative intelligence. E.g., T at 23, 24, 26, 38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. This translation was attached to the Prendeville Deposition and was marked as defendants' exhibit AA. This translation is based upon the Sanskrit chant and the translation thereof appearing in a book called \"The Holy Tradition,\" which was written by Maharishi Mahesh Yogi. See Jarvis Deposition at 764, 986-88.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Maharishi Mahesh Yogi has referred to the divinity of Guru Dev in other contexts. See Jarvis Deposition at 811-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The court is aware that defendant Jarvis, although not an expert in the culture, history, or religions of India, see Jarvis Deposition at 908, 1020, testified that it is his personal understanding that the use of the word \"Lord\" in the term \"Lord Narayana\" denotes merely \"the highest possible human appreciation and esteem [for human beings], like we would say Lord Mountbatten or something like that.\" Jarvis Deposition at 996. Ignoring for the moment the inaccuracies in this weak analogy and accepting the statement arguendo, Mr. Jarvis' understanding of the word \"Lord\" when the word is attached to a proper noun can have no application to the term \"the Lord\" standing alone. In addition, it is impossible to imagine that \"the whole of galaxy of gods pray [ sic ] for perfection\" at the door of \"Lord Mountbatten\" or at the door of any other titled person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The similarity between the epithets applied to Guru Dev in this chant and the description of the field of pure creative intelligence in the textbook is unmistakable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In addition to the obeisance to \"the Lord\" and the identification of Guru Dev with this divinity, Guru Dev is depicted in the chant as a Guru in the glory of the three major gods of Hinduism and is said to be a personification of the Supreme Being of Hindu philosophy: Guru in the glory of Brahma, Guru in the glory of Vishnu, Guru in the glory of the great Lord Shiva, Guru in the glory of the personified transcendental fulness [sic] of Brahman, to Him, to Shri Guru Dev adorned with glory, I bow down. As stated by Mr. Justice Douglas in United States v. Seeger, 380 U.S. 163, 189-90, 85 S. Ct. 850, 865, 13 L. Ed. 2d 733, 750 (1965) (Douglas, J., concurring) (emphasis in original): In the Hindu religion the Supreme Being is conceived in the forms of several cult Deities. The chief of these, which stand for the Hindu Triad, are Brahma, Vishnu and Siva. * * * Indian philosophy, which comprises several schools of thought, has advanced different theories of the nature of the Supreme Being. According to the Upanishads, Hindu sacred texts, the Supreme Being is described as the power which creates and sustains everything, and to which the created things return upon dissolution. The word which is commonly used in the Upanishads to indicate the Supreme Being is Brahman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Defendants preface this \"definitional approach\" with the assertion that \"the free exercise clause may require a broad definition of religion in order to protect individual liberty; however, the establishment clause has a more narrow scope.\" Harned Affidavit para. 11. This statement by one of defendants' experts in religion is clearly improper and inadmissible under Rule 56(e) because the professor presents no credentials as an expert in constitutional law. Defendants argue that \"[unlike] the free-exercise clause of the First Amendment, the establishment clause does not encompass multifarious heterodox beliefs.\" Defendants' Second Supplemental Brief at 2. Defendants cite no authority for this assertion and the proposition appears dubious. As stated by Mr. Justice Rutledge: \"Religion\" appears only once in the Amendment. But the word governs two prohibitions and governs them alike. It does not have two meanings, one narrow to forbid \"an establishment\" and another, much broader, for securing \"the free exercise thereof.\" \"Thereof\" brings down \"religion\" with its entire and exact content, no more and no less, from the first into the second guaranty, so that Congress and now the states are as broadly restricted concerning the one as they are regarding the other. No one would claim today that the Amendment is constricted, in \"prohibiting the free exercise\" of religion, to securing the free exercise of some formal or creedal observance, of one sect or of many. It secures all forms of religious expression, creedal, sectarian or nonsectarian, wherever and however taking place, except conduct which trenches upon the like freedoms of others or clearly and presently endangers the community's good order and security. . . . The word connotes the broadest content, determined not by the form or formality of the teaching or where it occurs, but by its essential nature regardless of those details. \"Religion\" has the same broad significance in the twin prohibition concerning \"an establishment.\" The Amendment was not duplicitous. \"Religion\" and \"establishment\" were not used in any formal or technical sense. The prohibition broadly forbids state support, financial or other, or religion in any guise, form or degree. Everson v. Board of Education, supra, 330 U.S. at 32-33, 67 S. Ct. at 519-520 (Rutledge, J., dissenting). While Mr. Justice Rutledge was speaking for four members of the Court in dissent in Everson, the majority and dissent agreed that the establishment clause must have a broad interpretation and application. See Abington School District v. Schempp, supra, 374 U.S. at 216-17, 83 S. Ct. 1560. To the extent that the religion clauses differ in the protections afforded, the application of the two clauses of course will differ. For example, the establishment clause has a broader application than does the free exercise clause in the sense that a plaintiff may bring suit under the establishment clause even though he has suffered no injury to or impairment of his religious beliefs while a plaintiff cannot bring suit under the free exercise clause unless he can allege a direct governmental infringement upon his religious beliefs or practices. See, e.g., Engel v. Vitale, supra, 370 U.S. at 430-31, 82 S. Ct. 1261; McGowan v. Maryland, supra, 366 U.S. at 466-67, 81 S. Ct. 1101 (Frankfurter, J., concurring). The establishment clause protects every individual's right to freedom of belief while the free exercise clause protects the individual's freedom to practice his religion. See, e.g., Abington School District v. Schempp, supra, 374 U.S. at 217-18, 83 S. Ct. 1560; Cant-well v. Connecticut, 310 U.S. 296, 303-04, 60 S. Ct. 900, 84 L. Ed. 1213 (1940). The case at bar is illustrative of the different functions of the religion clauses. While defendants deny the religious nature of their teachings and activities, the adherents to certain teachings and activities who sought the protection of the free exercise clause never could deny the religious nature of their teachings and activities. The fact that the religion clauses offer different protections gives no reason to infer that the word \"religion,\" which appears only once in the religion clauses, has a meaning under the establishment clause different from its meaning under the free exercise clause. While it is possible for a group of individuals to attach religious significance to activities which society regards as nonreligious and seek protection for the practice of those activities under the free exercise clause, a court cannot afford that protection unless the activities embody religious teachings. E.g., People v. Woody, 61 Cal.2d 716, 40 Cal.Rptr. 69, 394 P.2d 813 (1964) (In Bank). See note 26 infra. In Woody, a group of individuals believed that the eating of peyote put them into direct contact with God. The California Supreme Court held that a state criminal statute proscribing the use of peyote could not be applied to the adherents to this belief because application of the law to them would violate the free exercise clause. If subsequent medical research which revealed that peyote had beneficial properties lead the state to repeal the criminal statute, a public school would be able to teach that peyote has beneficial effects but the school could not teach that use of peyote puts the user in touch with God without violating the establishment clause. The activity is not religious per se, but is religious in light of the beliefs or teachings attached to it. Similarly, principles which society at large finds beneficial and useful are not religious in nature merely because similar principles are common to the dogmas of many religious sects. For example, a public school could teach its students that it is wrong to steal or murder without violating the establishment clause. The public school could not teach its students to refrain from stealing because God has proscribed it. The principle is not necessarily religious, but becomes religious if taught as a divine law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In this connection, defendant Jarvis also testified that it is his belief that God created the physical universe and human beings. Jarvis Deposition at 1059. When asked if he believed that God created pure creative intelligence, defendant Jarvis expressed uncertainty: \"That is a question I have not as yet answered for myself.\" Id. at 1051. Later defendant Jarvis stated: \"I can accept the statement that God created pure creative intelligence, but I don't understand it enough to develop that statement.\" Id. at 1060. Defendant Jarvis also attributed a passive role to creative intelligence as the ultimate source of everything in the universe: \"It is the source in that it is the ultimate constituent,\" which God would use to create. Id. at 1050. While the field of pure creative intelligence may be inactive, any description of creative intelligence as passive is contradicted directly by the textbook. See pages 1292-1293 supra. Defendants call attention to defendant Jarvis' religious views as demonstrative of the lack of religiosity in SCI/TM, Db at 26, and these views illustrate one of the problems with the teachings of the SCI/TM course. While defendant Jarvis is able to accept as a matter of religious faith that God created creative intelligence, he was unable to explain in terms of reason how something that has existed \"always,\" was created by God who also has existed always. The same metaphysical conundrum no doubt would confront some high school students of SCI/TM. In addition, those students who doubt or deny the existence of God or any other unmanifest field of life will be subjected to inculcation of a belief in an unmanifest field of life which is pure, perfect, and unbounded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The court, of course, does not concern itself with the truth or falsity of defendants' teachings. See United States v. Ballard, 322 U.S. 78, 85-88, 64 S. Ct. 882, 88 L. Ed. 1148 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. A philosophy well may posit the existence of a supreme being without functioning as a religion in the sense of having clergy and houses of worship. For purposes of the first amendment, these philosophies are the functional equivalents of religions. Surely the prohibition of the establishment clause could not be avoided by governmental aid to the inculcation of a belief in a supreme being through philosophical instruction instead of through conventionally recognized religious instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Plaintiffs have placed in the record an affidavit of a professor of theology which states that certain attributes, which plaintiffs contend are ascribed to creative intelligence by the World Plan defendants, are possessed exclusively by God in the tradition of both Hebrew and Christian theology. Although defendants ridicule this affidavit as \"meaningless,\" Db at 28, they do not refute it; defendants' only response to the affidavit is a paragraph in the affidavit of a professor of religious studies which entirely misinterprets plaintiffs' affidavit. See Harned Affidavit para. 29. In light of the discussion supra at 1320-1322, however, the court finds no need to rely, and does not rely, on the affidavit in ruling on plaintiffs' motion for partial summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In Engel v. Vitale, supra, the New York State Board of Regents composed and recommended the use of a prayer. Only the teacher of each class was required to recite the prayer. Id. at 438, 82 S. Ct. 1261. (Douglas, J., concurring). Attendance by the students was not mandatory. Id. at 423 n.2, 82 S. Ct. 1261. In the instant case, attendance by all students taking the elective SCI/TM course is mandatory. The students also are asked to participate in the ceremony to the extent of bringing flowers, fruit, and a handkerchief which are used as offerings to the deified Guru Dev during the puja chant. The compulsion placed on students in the SCI/TM course to attend a religious ceremony thus is greater than that placed on the students in Engel. While the prayer in Engel was recited daily and the puja is performed only once for each student, the prayer in Engel was recited without any of the trappings which are part of the puja. The fact that the puja chant is sung in Sanskrit, of course, has no bearing on the religious nature of the ceremony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The distinction between teaching that the practice of Transcendental Meditation will bring about certain physiological and psychological changes in the meditator and teaching that the practice of Transcendental Meditation brings the meditator into direct contact with a pure, perfect, and infinite field of life, the field of pure creative intelligence, is illustrated by People v. Woody, 61 Cal.2d 716, 40 Cal.Rptr. 69, 394 P.2d 813 (1964) (In Bank). Defendants in Woody were convicted of violation of California laws prohibiting the use of certain narcotic drugs and hallucinogens. Defendants appealed the conviction on the ground that application of the statute to them impinged on their first amendment right to the free exercise of religion because the eating of peyote, a hallucinogen, was part of their religious practices. In addition to, or concurrent with, the psychological changes undergone by a peyote eater, defendants believed that \"those who partake of peyote enter into direct contact with God.\" 40 Cal.Rptr. at 73, 394 P.2d at 817. Although the California Supreme Court recognized the right of the state, pursuant to its police power, to proscribe the use of peyote when taken merely to produce hallucinations and other psychological changes in the user, the court held that the law could not be applied to defendants because defendants believed that partaking of peyote not only produced hallucinations but also brought them into direct contact with God. Similarly, defendants here do not teach that use of a mantra merely will bring about certain beneficial physiological and psychological changes; rather, defendants teach that a mantra is a vehicle which will bring a practitioner of Transcendental Meditation into direct contact with an unmanifest, pure, perfect, eternal, and infinite field of life, the field of pure creative intelligence. The fact that a practitioner of Transcendental Meditation may undergo certain physiological and psychological changes without believing that he is contacting with the field of pure creative intelligence, see, e.g., Essrig Deposition at 70, 71, 99, just as an eater of peyote can experience hallucinations without believing that he is contacting God, does not make defendants' teachings any less religious.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In light of the court's holding under the Federal Constitution, plaintiffs' claims of violation of the New Jersey Constitution need not be addressed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Plaintiffs' various attempts to effect service of process on Maharishi Mahesh Yogi have been unsuccessful. Maharishi Mahesh Yogi has not been present in the United States for approximately two years. Pursuant to Rule 4(i)(d) of the Federal Rules of Civil Procedure and to Rule 4:4-4(e) of the New Jersey Court Rules, plaintiffs eventually sought to effect service on Maharishi Mahesh Yogi by delivering a copy of the summons and complaint to the Clerk of this court to be mailed by registered mail, return receipt requested, to Maharishi Mahesh Yogi at the World Plan Administrative Center in Switzerland. The summons and complaint were returned to the Clerk, the envelope stamped \"Nicht abgeholt/Non reclame/Non ritirato.\" A crossed out signature appears in a box marked \"Signature of the employee of the office of destination\" on the return receipt, which is taped to the envelope.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Atheism may be a religion under the establishment clause in that the government cannot aid the propagation of a belief in the nonexistence of a supreme being. See Abington School District v. Schempp, supra, 374 U.S. at 225, 83 S. Ct. 1560; Zorach v. Clauson, 343 U.S. 306, 314, 72 S. Ct. 679, 96 L. Ed. 954 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Courts frequently decide on the basis of the operative facts whether or not certain activities stand within the meaning of terms used in the Constitution. For example, in Rosenbloom v. Metromedia, Inc., 415 F.2d 892 (3rd Cir. 1969), aff'd, 403 U.S. 29, 91 S. Ct. 1811, 29 L. Ed. 2d 296 (1971), the Third Circuit held that radio and television were within the meaning of the word press as used in the first amendment. In Heflin v. Sanford, 142 F.2d 798 (5th Cir. 1944), the Fifth Circuit held that compelled national service was not involuntary servitude within the meaning of the thirteenth amendment. Under the doctrine of \"constitutional fact,\" the Supreme Court has held that the courts must decide whether an activity falls within the meaning of constitutional terms. For example, in Pennekamp v. Florida, 328 U.S. 331, 66 S. Ct. 1029, 90 L. Ed. 1295 (1946), the Supreme Court held that it was not bound by lower court findings that newspaper editorials \"were unlawfully critical of the administration of justice in certain cases then pending,\" id. at 333, 66 S. Ct. at 1030, because [the] Constitution has imposed upon this Court final authority to determine the meaning and application of those words of that instrument which require interpretation to resolve judicial issues. With that responsibility, we are compelled to examine for ourselves the statements in issue and the circumstances under which they were made to see whether or not they do carry a threat of clear and present danger to the impartiality and good order of the courts or whether they are of a character which the principles of the First Amendment, as adopted by the Due Process Clause of the Fourteenth Amendment, protect. Id. at 335, 66 S. Ct. at 1031 (footnote omitted). Similarly, in Edwards v. South Carolina, 372 U.S. 229, 83 S. Ct. 680, 9 L. Ed. 2d 697 (1963), the Supreme Court, held that it was required to examine the underlying facts from which it would determine whether or not petitioner's actions came within the meaning of the \"constitutionally protected rights of free speech, free assembly, and freedom to petition for redress of their grievances.\" Id. at 235, 83 S. Ct. at 638. In Blackburn v. Alabama, 361 U.S. 199, 80 S. Ct. 274, 4 L. Ed. 2d 242 (1960), the Court rejected the findings of a lower court that petitioner's confession was voluntary within the meaning of the due process clause of the fourteenth amendment and held that the Court had a duty to scrutinize the underlying facts and determine whether or not the confession was voluntary under the fourteenth amendment. Id. at 205, 80 S. Ct. 274. In addition, the Supreme Court has held that \"the meaning of an armband for the purpose of expressing certain views is the type of symbolic act that is within the Free Speech Clause of the First Amendment.\" Tinker v. Des Moines Independent Community School District, 393 U.S. 503, 505, 89 S. Ct. 733, 736, 21 L. Ed. 2d 731 (1969), citing West Virginia Board of Education v. Barnette, 319 U.S. 624, 63 S. Ct. 1178, 87 L. Ed. 1628 (1943); Stromberg v. California, 283 U.S. 359, 51 S. Ct. 532, 75 L. Ed. 1117 (1931). The Supreme Court also has held that certain \"associational\" rights are within the meaning of speech, peaceable assembly, and petition for redress of grievances as used in the first amendment. E.g., United Mine Workers, District 12 v. Illinois State Bar Association, 389 U.S. 217, 88 S. Ct. 353, 19 L. Ed. 2d 426 (1967); NAACP v. Button, 371 U.S. 415, 83 S. Ct. 328, 9 L. Ed. 2d 405 (1963).\u003c/span\u003e\n\n",
    "body_length": 177027,
    "citedas": [
      "440 F. Supp. 1284"
    ],
    "attorneys": "McCarter \u0026 English by Julius B. Poppinga, Newark, New Jersey, for plaintiffs. , Fischer \u0026 Kagan by Jay D. Fischer, Clifton, New Jersey, and Paul, Weiss, Rifkind, Wharton \u0026 Garrison by Edward N. Costikyan, Bernard Ouziel, New York, New York, for defendants World Plan Executive Council. , Scipio L. Africano, Union City, New Jersey, for defendant Board of Ed. of Union City. , Jonathan L. Goldstein, U.S. Atty. by William E. Staehle, Asst. U.S. Atty., Newark, New Jersey, for defendants United States Dept. of Health, Ed. and Welfare, and United States of America. , William F. Hyland, Atty. Gen., State of New Jersey by Guy S. Michael, Deputy Atty. Gen., Trenton, New Jersey, for State of New Jersey defendants. Meanor, District Judge.",
    "category": [
      "124",
      "252",
      "36"
    ],
    "judges": "MEANOR, District Judge.",
    "citation_count": 0
  }
}
