{
  "id": "24HyPWYBTlTomsSBiW-a",
  "document": {
    "title": "Ezold v. Wolf",
    "full_title": "NANCY O'MARA EZOLD AT NO. 91-1780 v. WOLF, BLOCK, SCHORR AND SOLIS-COHEN AT NO. 91-1741",
    "jurisdiction": "Third Circuit",
    "date": "1992-12-30T00:00:00.000Z",
    "docket": "Nos. 91-1741, 91-1780",
    "body": "Opinion OF THE COURT\n\nHUTCHINSON, Circuit Judge.\n\nWolf, Block, Schorr and Solis-Cohen (Wolf) appeals from a judgment of the United States District Court for the Eastern District of Pennsylvania granting relief in favor of Nancy O'Mara Ezold (Ezold) on her claim that Wolf intentionally discriminated against her on the basis of her sex in violation of Title VII of the Civil Rights Act of 1964 (Title VII), 42 U.S.C.A. §§ 2000e to 2000e-17 (West 1981 \u0026 Supp. 1992), when it decided not to admit her to the firm's partnership effective February 1, 1989. At trial Wolf contended that it denied Ezold admission to the partnership because her skills in the category of legal analysis did not meet the firm's standards. The district court disagreed and found that this articulated reason was a pretext contrived to mask sex discrimination. Wolf argues on appeal that the district court improperly analyzed the evidence before it and that the evidence, properly analyzed, does not support the district court's ultimate finding of pretext.\n\nThis case raises important issues that cut across the spectrum of discrimination law. It is also the first in which allegations of discrimination arising from a law firm partnership admission decision require appellate review after trial.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Accordingly, we have given it our closest attention and, after an exhaustive examination of the record and analysis of the applicable law, have concluded that the district court made two related errors whose combined effect require us to reverse the judgment in favor of Ezold. The district court first impermissibly substituted its own subjective judgment for that of Wolf in determining that Ezold met the firm's partnership standards. Then, with its view improperly influenced by its own judgment of what Wolf should have done, it failed to see that the evidence could not support a finding that Wolf's decision to deny Ezold admission to the partnership was based upon a sexually discriminatory motive rather than the firm's assessment of her legal qualifications. Accordingly, we hold not only that the district court analyzed the evidence improperly and that its resulting finding of pretext is clearly erroneous, but also that the evidence, properly analyzed, is insufficient to support that finding and therefore its ultimate Conclusion of discrimination cannot stand. We will therefore reverse and remand for entry of judgment in favor of Wolf. This Disposition makes it unnecessary to address the issues raised in Wolf's appeal concerning the remedy the district court awarded to Ezold or those in Ezold's cross-appeal concerning her claim of constructive discharge.\n\nI.\n\nEzold sued Wolf under Title VII alleging that Wolf intentionally discriminated against her because of her sex when it decided not to admit her to the firm's partnership. She further alleged that she was constructively discharged by reason of the adverse partnership decision. The court bifurcated the issues of liability and damages. After a lengthy bench trial the district court rendered its Findings of Fact and Conclusions of Law on November 29, 1990. See Ezold v. Wolf, Block, Schorr and Solis-Cohen, 751 F. Supp. 1175 (E.D. Pa. 1990) (Ezold I). It entered judgment in favor of Ezold on her claim for intentional discrimination and against her on her claim for constructive discharge.\n\nThe district court held that the nondiscriminatory reason articulated by Wolf for its rejection of Ezold's candidacy--that her legal analytical ability failed to meet the firm's partnership standard--was a pretext. It stated:\n\nMs. Ezold has established that the defendant's purported reasons for its conduct are pretextual. The defendant promoted to partnership men having evaluations substantially the same or inferior to the plaintiff's, and indeed promoted male associates who the defendant claimed had precisely the lack of analytical or writing ability upon which Wolf, Block purportedly based its decision concerning the plaintiff. . . . Such differential treatment establishes that the defendant's reasons were a pretext for discrimination.\n\nId. at 1191-92 (Conclusion of Law (COL) 11). The district court also held that four instances of conduct by Wolf supported its finding of pretext: (1) Ezold was evaluated negatively for being too involved with women's issues in the firm; (2) a male associate's sexual harassment of female employees at the firm was seen as \"insignificant\" and not mentioned to the Associates Committee prior to the partnership decision; (3) Ezold was evaluated negatively for being very demanding, while male associates were evaluated negatively for lacking assertiveness; and (4) Ezold \"was the target of several comments demonstrating [Wolf's] differential treatment of her because she is a woman.\" Id. at 1192 (COL 12).\n\nIn holding that Ezold had failed to establish that she was constructively discharged, the district court stated:\n\nA reasonable person in Ms. Ezold's position would not have deemed her working conditions to be so intolerable as to feel compelled to resign.\n\nId. (COL 16). This holding became relevant to the issue of damages. By way of relief, Ezold sought backpay as well as instatement in the firm as a partner, and if such instatement was impractical, front pay. Wolf argued to the district court that its holding that Ezold was not constructively discharged limited her relief to back pay covering the period from her unlawful denial of admission to the partnership, effective February 1, 1989, until the date of her voluntary resignation from the firm on June 7, 1989. On March 15, 1991, the district court decided that its holding against Ezold on her constructive discharge claim did not preclude her from obtaining relief for the period following her voluntary resignation. See Ezold v. Wolf, Block, Schorr and Solis-Cohen, 758 F. Supp. 303 (E.D. Pa. 1991) (Ezold II).\n\nThe parties then briefed the issue of whether Ezold properly mitigated her damages as required by section 706(g)(1) of Title VII, 42 U.S.C.A. § 2000e-5(g)(1). On July 23, 1991, the district court issued its final memorandum and order. It ruled that Ezold had properly mitigated her damages and that her rejection of Wolf's offer to admit her as a partner as of February 1, 1990 if she accepted responsibility for its domestic relations practice did not toll Wolf's liability for back pay. The court then awarded Ezold back pay in the amount of $131,784.00 for the period from her resignation on June 7, 1989 to January 31, 1991. The parties agreed that if the court's November 27, 1990 and March 15, 1991 orders were affirmed on appeal, Ezold would be instated as a partner.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The court incorporated this agreement into its orders. The district court also awarded Ezold attorney's fees and costs. Wolf timely appealed from the district court's orders. Ezold filed a protective cross-appeal from the district court's denial of her constructive discharge claim.\n\nII.\n\nEzold was hired by Wolf as an associate on a partnership track in July 1983. She had graduated in the top third of her class from the Villanova University School of Law in 1980 and then worked at two small law firms in Philadelphia. Before entering law school, Ezold had accumulated thirteen years of administrative and legislative experience, first as an assistant to Senator Edmund Muskie, then as contract administrator for the Model Cities Program in Philadelphia, and finally as Administrator of the Office of a Special Prosecutor of the Pennsylvania Department of Justice.\n\nEzold was hired at Wolf by Seymour Kurland, then chairman of the litigation department. The district court found that Kurland told Ezold during an interview that it would not be easy for her at Wolf because \"she was a woman, had not attended an Ivy League law school, and had not been on law review.\" Ezold I, 751 F. Supp. at 1177 (Finding of Fact (FOF) 18). Subsequent to this meeting, but prior to accepting Wolf's offer of employment, Ezold had lunch with Roberta Liebenberg and Barry Schwartz, both members of the litigation department. She did not ask them anything about the firm's treatment of women.\n\nEzold was assigned to the firm's litigation department. From 1983-87, Kurland was responsible for the assignment of work to associates in the department. He often delegated this responsibility to partner Steven Arbittier. As Ezold acknowledged, many partners bypassed the formal assignment procedure and directly assigned matters to associates. The district court found that Arbittier assigned Ezold to actions that were \"small\" by Wolf standards. Id. at 1178 (FOF 24).\n\nEzold's performance was reviewed regularly throughout her tenure pursuant to Wolf's evaluation process, which operates as follows: The Associates Committee, consisting of ten partners representing each of the firm's departments, first reviews the performance of all the firm's associates and makes recommendations to the firm's five-member Executive Committee as to which associates should be admitted to the partnership. The Executive Committee then reviews the partnership recommendations of the Associates Committee and makes its own recommendations to the full partnership. The firm's voting partners consider only those persons whom the Executive Committee recommends for admission to the partnership.\n\nSenior associates within two years of partnership consideration are evaluated annually; non-senior associates are evaluated semi-annually. The firm's partners are asked to submit written evaluations on standardized forms.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The partner is asked the degree of contact he has had with the associate during the evaluation period. Partners were instructed that the evaluations were to be completed regardless of the extent of the evaluating partner's contact or familiarity with the associate's work. Ten criteria of legal performance are listed on the forms in the following order: legal analysis, legal writing and drafting, research skills, formal speech, informal speech, judgment, creativity, negotiating and advocacy, promptness and efficiency. Ten personal characteristics are also listed: reliability, taking and managing responsibility, flexibility, growth potential, attitude, client relationship, client servicing and development, ability under pressure, ability to work independently, and dedication. As stated by Ian Strogatz,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Chairman of the Associates Committee: \"The normal standards for partnership include as factors for consideration all of the ones . . . that are contained [on] our evaluation forms.\" Joint Appendix (App.) at 1170.\n\nDespite format changes, legal analysis was always listed as the first criterion to be evaluated. This criterion was defined on the evaluation forms used in 1987 and 1988 as the \"ability to analyze legal issues; grasp problems; collect, organize and understand complex factual issues.\" Id. at 3728. Partners provide grades as well as written comments on these criteria. The evaluation forms describe the grades as follows:\n\n- DISTINGUISHED : Outstanding, exceptional; consistently demonstrates extraordinary adeptness and quality; star.\n\n- GOOD : Displays particular merit on a consistent basis; effective work product and performance; able; talented.\n\n- ACCEPTABLE : Satisfactory; adequate; displays neither particular merit nor any serious defects or omissions; dependable.\n\n- MARGINAL : Inconsistent work product and performance; sometimes below the level of what you expect from Associates who are acceptable at this level.\n\n- UNACCEPTABLE : Fails to meet minimum standard of quality expected by you of an associate at this level; frequently below level of what you expect.\n\nId. at 3464 (emphasis in original).\n\nThe form asks the evaluating partner to describe any particular strengths or weaknesses of an associate. Partners are also asked to indicate their views on the admission of each senior associate to the partnership. The evaluation lists five possible responses: \"with enthusiasm,\" \"with favor,\" \"with mixed emotions,\" \"with negative feelings\" or \"no opinion.\" Partners are also asked to respond \"yes\" or \"no\" to the following question: \"I would feel comfortable turning over to this Associate to handle on his/her own a significant matter for one of my clients.\" Id. at 3467. Given the number of reviewing partners, the evaluations often contain a wide range of divergent views.\n\nThese evaluations are then compiled and summarized by the firm's administrative staff and organized in books for review by the Associates Committee. Ezold I, 751 F. Supp. at 1181 (FOF 52). Each member of the Associates Committee is asked to make an initial assessment of the evaluations pertaining to one of the associates or candidates for partnership. That committee member prepares a form entitled \"Committee Member's Associate Evaluation Summary\" summarizing his or her personal view of each associate's evaluations. This form is colloquially referred to as the \"bottom line\" memo. As found by the district court, the bottom line memo \"is intended to be [the Associates Committee member's] own personal view of what he has gleaned from the evaluations submitted at the time by the partners who submitted evaluation forms, plus anything in addition that [the Associates Committee member] has gleaned from any interviews that he has conducted with respect to those evaluations.\" Id. at 1181 (FOF 53) (emphasis in original). The bottom line memo also contains a \"grid\" reflecting the Associates Committee member's summary of the evaluated associate's grades in legal and personal skills.\n\nThe bottom line memo also assesses a senior associate's prospects for regular partnership (Category VI) under the following ratings: \"more likely than not,\" \"unclear,\" \"less likely than not\" or \"unlikely.\" In 1987 and 1988, similar rankings were used to determine the associate's potential for special partnership (Category VII). The Category VII partnership then in existence conferred a non-equity \"partnership\" status upon associates who fell below the normal standard for admission as equity partners but whose work nevertheless was making a valuable contribution to the firm. See id. at 1177 (FOF 15).\n\nEach member of the Associates Committee receives copies of the bottom line memo for all associates before meeting formally to discuss evaluations. The bottom line memo serves as a starting point for the Associates Committee's Discussion of each candidate. The Committee members, using both the bottom line memo and the administrative summaries of the grades and comments, engage in a process of weighing and comparing each associate's legal skills and personal characteristics. The Committee also conducts interviews of those partners who failed to submit written evaluations of an associate during an evaluation period, submitted an evaluation that requires clarification or asked for an opportunity to supplement the written evaluation in an interview.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Strogatz testified that the Committee has no formal voting procedure. Id. at 1181 (FOF 57). It ultimately reaches its own consensus as to each senior associate's partnership potential and as to each associate's performance. It also formulates a performance review that will be given to each associate and senior associate by a member of the Committee.\n\nThe firm's partners evaluated Ezold twice a year as an associate and once a year as a senior associate from October 1983 until the Associates Committee determined that it would not recommend her for partnership in September 1988. The district court found that \"in the period up to and including 1988, Ms. Ezold received strongly positive evaluations from almost all of the partners for whom she had done any substantial work.\" Id. at 1182 (FOF 60).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In making this finding the district court relied on the evaluations of Wolf partners Seymour Kurland, Robert Boote, Steve Goodman, Barry Schwartz, Alan Davis and Raymond Bradley. Ezold's overall score in legal skills in the 1988 bottom line memorandum before the Associates Committee was a \"G\" for good. It was noted that \"overall\" that year she received \"stronger grades in intellectual skills than last time.\" Id. at 1183 (FOF 71).\n\nEvaluations in Ezold's file not mentioned by the district court show that concerns over Ezold's legal analytical ability arose early during her tenure at the firm. In an evaluation covering the period from November 1984 through April 1985, Arbittier wrote:\n\nI have discussed legal issues with Nancy in connection with [two cases]. I found her analysis to be rather superficial and unfocused. I am beginning to doubt that she has sufficient legal analytical ability to make it with the firm. . . . She makes a good impression with people, has common sense, and can handle routine matters well. However these traits will take you just so far in our firm. I think that due to the nature of our practice Nancy's future here is limited.\n\nApp. at 3392. That same year Schwartz wrote:\n\nI have worked a great deal with Nancy since my last evaluation. . . . Both cases are complex, multifaceted matters that have presented novel issues to us. While her enthusiasm never wanes and she keeps plugging away--I'm often left with a product that demonstrates uncertainty in the analysis of a problem. After extensive Discussions with me, the analysis becomes a little more focused, although sometimes I get the sense that Nancy feels adrift and is just marching as best she can to my analytical tune. . . . In my view her energy, enthusiasm and fearlessness make her a valuable asset to us. While she may not be as bright as some of our best associates, her talents will continue to serve us well.\n\nId. at 3392. Also in 1985, partner Donald Joseph rated Ezold's legal analytical ability as marginal and wrote \"its [sic] too early to tell but I have been disappointed on her grasp of the problem, let alone performance.\" Id.\n\nDuring her next evaluation period from April through November 1985, Ezold received similar negative evaluations. Arbittier, Robert Fiebach and Joseph rated her legal analytical abilities as marginal. Arbittier wrote:\n\nShe took a long time getting [a summary judgment brief] done and I found it to be stilted and unimaginative. One of the main issues--dealing with the issue of notice-- she missed completely and did not grasp our position . . . . Also, in considering whether to file a defensive motion . . . she failed to cite me to a clause in the agreement that was highly relevant leaving me with the impression that the motion could not succeed. I think Nancy tries hard and can handle relatively straight-forward matters with a degree of maturity and judgment, but when she gets into more complicated areas she lacks real analytical skill and just does what she is told in a mechanical way. She is not up to our minimal Wolf, Block standards.\n\nId. at 3376. Boote made the following report on his performance review with Ezold after this evaluation period:\n\nNancy appeared to accept the judgment, albeit a little grudgingly, that her analytical, research and writing ability was not up to our standards and that she should focus on the types of matters that she can handle effectively. . . . We made it very clear to Nancy that if she pursues general civil litigation work she is not on track toward partnership and that her only realistic chance for partnership in our opinion is to develop a good reputation for herself in one of the specialized areas of practice.\n\nId. at 3375.\n\nIn the evaluation period covering November 1985 to April 1986, Boote wrote the following to the Associates Committee:\n\nNancy continues to get mixed reviews. Her pluses are that she is mature, courageous, pretty good on her feet and has the capacity to inspire confidence in clients. Her minuses are that there is doubt about her analytic and writing ability. . . . In considering Nancy's prospects for the long range, I think we should bear in mind that we have made mistakes in the past in letting people go to other firms who really could have filled a valuable niche here. Whether Nancy is such a person, of course, remains to be seen.\n\nId. at 3365.\n\nA summary of Ezold's performance review from October 1986 prepared by Schwartz stated:\n\nNancy was advised that several of the lawyers feel she has made very positive progress as a lawyer, Sy [Kurland] being one of them. However, he told her that other lawyers had strong negative sentiments about her capabilities and they feel she has a number of shortcomings in the way of complicated analysis of legal problems and in being able to handle the big complicated corporate litigation, and therefore, does not meet the standard for partnership at Wolf, Block. . . . Both Sy and I urged Nancy to seriously consider looking for employment elsewhere as she may not be able to turn the tide.\n\nId. at 3364.\n\nAlthough several partners saw improvement in Ezold's work, negative comments about her analytical ability continued up until, and through, her 1988 senior associate evaluation, the year she was considered for partnership. A summary of her evaluations for 1987 and 1988, focusing on the grades and comments she received in the category of legal analysis, follows:\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n1987 Evaluations\n\nPartner\n\nGrade (Legal\n\nName\n\nAnalysis)\n\nComments\n\nPromislo M\n\n\"I had minimal contact with Nancy, but I thought she did not generate ideas . . . or pull the facts together well and exercise the best lawyerly Judgement. She seemed somewhat over her head, but I don't think she should have been.\" Recommended partnership with \"negative feelings.\" Id. at 3854-57.\n\nKurland\n\n\"There seems to be serious question as to whether she has the legal ability to take on large matters and handle them on her own. We have been over this many times and there is nothing I can add to what I've already said about Nancy. What I envisioned about her when I hired her as a \"good, stand-up effective courtroom lawyer\" remains to be true and I think she has proven her case. Apparently she has not proved to the satisfaction of the firm the other qualities considered necessary to rise to the top of the firm.\" Recommended partnership \"with mixed emotions.\" Id. at 3878-81.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAlderman A\n\nSlight contact. Recommended partnership with \"negative feelings.\" Id. at 3886-89.\n\nBoote A\n\n\"Nancy has avoided demonstrating ability in the area [of legal analysis] because I believe she lacks it. On the other hand, in Nancy's case, other qualities redeem her. . . . I would not want her in charge of a large legally complex case, the traditional measure of a Wolf Block partner.\" Recommended partnership \"with favor.\" Id. at 3894-97.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFlaherty A\n\nSlight contact. Recommended partnership with \"mixed emotions.\" Id. at 3918-21.\n\nJoseph\n\n\"I have been singularly unimpressed with the level of her ability. . . . She may be fine to keep for certain smaller matters, but I don't see her skills as being those for our sophisticated practice.\" Id. at 3930-33. Recommended partnership with \"negative feelings.\" Id. at 3933.\n\nSchwartz G\n\n\"She is excellent in court and loves to be in that arena. . . . She remains a little weak in her initial analysis of complex legal issues.\" Id. at 3954-56.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nDubrow A\n\n\"In my one experience we lost a client, but I think Nancy performed satisfactorily.\" No opinion as to partnership admission. Id. at 3990-93.\n\nRoberts G\n\nSlight contact. Recommended partnership \"with favor.\" Id. at 4052-55.\n\nSpitzer G\n\n\"Little contact, most favorable impression.\" Recommended partnership \"with favor.\" Id. at 4060-63.\n\nDuring the 1987 evaluation period, two partners viewed Ezold's eventual admission to the partnership \"with enthusiasm,\" sixteen \"with favor,\" eight \"with mixed emotions\" and seven with \"negative feelings.\" Id. at 3346. The Associates Committee formed a consensus that Ezold's analytical ability fell below the firm's standards. It predicted her partnership chances as \"unclear\" and if she was made a partner it would most likely be a Category VII partner because there was substantial doubt as to her legal ability. Id. at 3349. At trial Ezold acknowledged that during her evaluation meeting for this period she was told that \"there were partners who criticized [her] writing ability and questioned [her] ability to handle complex litigation, perhaps criticized or questioned [her] ability in the area of legal analysis.\" Id. at 666.\n\n1988 Evaluations\n\nPartner\n\nGrade (Legal\n\nName\n\nAnalysis)\n\nComments\n\nRosenblum A\n\n\"On a very complicated matter primarily involving financial analysis, I am not sure whether or not [Ezold] grasped analysis fully. (I am not sure that others working on project did either . . . .).\" Recommended partnership with \"mixed emotions.\" Id. at 3488-91.\n\nTemin A\n\nSlight contact. Recommended partnership \"with mixed emotions.\" Id. at 3508-11.\n\nDavis A\n\n\"She will never be a legal scholar--but we have plenty of support in that area.\" Recommended partnership with \"enthusiasm.\" Id. at 3512-15.\n\nArbittier A\n\n\"Barely adequate legal skills\"; \"Her abilities are limited. She makes a good impression but she lacks real legal analytical ability.\" Recommended partnership with \"mixed emotions.\" Id. at 3520-23.\n\nFiebach M\n\n\"Nancy has certain strengths . . . . If directed, she will do a good job--except that she has limitations with respect to complex legal issues. However, when left on her own she does not do what has to be done until [the] case is in crisis and she does a poor job in keeping [the] client informed.\" Recommended partnership with \"negative feelings.\" Id. at 3544-47.\n\nGoldberger\n\nWould feel comfortable turning over a significant matter for one of his clients \"if not too complex.\" \"Nancy reputedly can handle many of our matters on her own. If so and reliable others bear these rumors out, partnership may be in the cards.\" Recommended partnership with \"mixed emotions.\" Id. at 3552-55.\n\nJoseph\n\n\"Her abilities to grasp legal issues from the little I observed was insufficient to trust her in major litigation on her own.\" Recommended partnership with \"negative feelings.\" Id. at 3560-63.\n\nPoul G\n\nSlight contact. Recommended partnership \"with favor.\" Id. at 3580-83.\n\nSimon\n\n\"Probably ancient history--but I do recall my perception that she does not write well and lacks intellectual sophistication.\" Recommended partnership with \"negative feelings.\" Id. at 3596-99.\n\nFala G\n\n\"Nancy handled a moderate sized lawsuit for a client of mine. Job was done well and responsibly. Result was good.\" Id. at 3656.\n\nRoberts G\n\nSlight contact; recommended partnership with \"mixed emotions.\" Id. at 3688-91.\n\nGarber\n\n\"Experience with her years ago was unsatisfactory.\" No opinion on partnership recommendation. Id. at 3756-59.\n\nBerriman G\n\nSlight contact; recommended partnership \"with enthusiasm.\" Id. at 3776-79.\n\nKaplinsky A\n\n\"She has done a very nice job on the Home Unity shareholder litigation. . . . I am probably not as complimentary as Alan [Davis] might be. I was never convinced that she had a complete grasp of the accounting issues in the case.\" Recommended partnership \"with favor.\" Id. at 3452-55.\n\nMcConomy G\n\n\"Only worked on one matter for me. She is doing a super job.\" Recommended partnership \"with favor.\" Id. at 3464-67.\n\nIn 1988, ninety-one partners submitted evaluations of Ezold. Thirty-two, a little more than one-third, made recommendations with varying degrees of confidence, for Ezold's admission to partnership. Seven of those partners recommended that Ezold be made a partner \"with enthusiasm,\" fourteen \"with favor,\" six with \"mixed emotions,\" four with \"negative feelings,\" and one with \"mixed emotions/negative feelings.\" Id. at 3318. Three of the four partners who voted for partnership with negative feelings were members of Ezold's department. After reviewing Ezold's evaluations and conducting interviews, the Associates Committee voted 9-1 not to recommend Ezold for Category VI partnership.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn a Discussion initiated by Davis, the Associates Committee also debated modifying the partnership standard as a matter of general policy or specially in Ezold's case because of her other positive attributes. Davis believed:\n\nalthough [Ezold] was not up to par on her legal analytical ability, . . . deficiencies in a particular area, even though it was a traditional area where we required a certain superior level, could be overlooked or relaxed to where there were sufficiently compensating skills in other areas, because I felt as chairman that in staffing a case, I could put together the right skills, and we had enough business where we could fit everybody in usefully and productively.\n\nId. at 1665, 1686. He thought the firm \"just ought to come off [its] standards and be a little more creative in melding different abilities that different people might bring.\" Id. at 1685. The other Committee members ultimately rejected this suggestion.\n\nThe Associates Committee told Ezold that she would not be recommended for admission as a \"Group VI\" regular partner effective February 1, 1989 because \"too many partners did not believe she had sufficient legal analytical ability to handle complex legal issues.\" Ezold I, 751 F. Supp. at 1189 (FOF 136). It did vote, however, to recommend her for the status of \"Group VII\" special partner that the firm had heretofore made available to associates who are valuable but fall below the firm's high standards for full partnership.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The continuing existence of that category was, however, then under review by the firm's Executive Committee. It was in fact later eliminated.\n\nOut of a total of eight candidates in Ezold's class, five male associates and one female associate were recommended for regular partnership. One male associate, Associate X, was not recommended for either regular or special partnership.\n\nThe Executive Committee decided to review the Associates Committee's negative recommendation of Ezold and also to conduct an independent review of the negative recommendation of Associate X.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e William Rosoff, former chairman of the Executive Committee, conducted the inquiry. Rosoff reviewed Ezold's evaluation documents and interviewed four litigation department partners: Schwartz, Boote, Arbittier and Fiebach. Rosoff had learned of the policy disagreement among some of the firm's partners as to whether the partnership standard should be relaxed in light of Ezold's other attributes. He reported to the Executive Committee that it should not recommend Ezold's admission unless it was prepared to reduce the firm's partnership standards. The 5-member Executive Committee voted unanimously not to recommend Ezold's admission as a regular partner.\n\nOn November 16, 1988 Executive Committee Chairman Charles Kopp met with Ezold and informed her of the decision. He also told her that two domestic relations partners had informed the Committee several days earlier that they were leaving the firm and that this immediate vacuum presented an opportunity for her. Id. at 1189 (FOF 137). He promised that if she agreed to work in this department, she would be made a regular partner in one year. Other associates passed over for partnership in the past had sometimes agreed to specialize in a certain area where the need arose and had later made partner. Although Kopp had little contact with Ezold, he believed that Ezold could handle the work because of the positive evaluations of her skills with clients and in the courtroom and because the practice area did not require the same complex analysis as the firm's commercial litigation practice. See id. at 1189 (FOF 137-38).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Ezold declined the offer. Kopp told Ezold that the firm nevertheless wanted her to stay and she could stay on as a litigation associate as long as she wanted. Id. at 1189 (FOF 139).\n\nEzold also met with Rosoff concerning the domestic relations offer. The district court found that Rosoff \"told her that although he could not assure her of a partnership in the future if she declined the domestic relations partnership offer, she would be considered for partnership in the future.\" Id. at 1190 (FOF 142). He also told her that she would receive a substantial pay raise the following July when semi-annual raises are given to associates, but she would not receive the pay raise being given to the other members of her class who were recommended for partnership.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nEzold remained at the firm, none of her cases were taken away from her, and Davis, then chair of the Litigation Department and one of Ezold's supporters, continued to assign her new cases. On January 25, 1989, one day after the firm's partners voted on the admission of new partners, Ezold began looking for other employment. She ultimately signed a one-year contract as president of an environmental consulting firm, a former client of Wolf, and also took an \"of counsel\" position with a suburban law firm. Ezold resigned from the firm on June 7, 1989.\n\nIII.\n\nThe district court had subject matter jurisdiction under 28 U.S.C.A. § 1331 (West Supp. 1992) and 42 U.S.C.A. § 2000e-5(f)(3) (West 1981). We have jurisdiction over the final orders of the district court pursuant to 28 U.S.C.A. § 1291 (West Supp. 1992).\n\nIV.\n\nEzold claims Wolf intentionally discriminated against her because of her sex. Intentional discrimination in employment cases fall within one of two categories: \"pretext\" cases and \"mixed-motives\" cases. See Price Waterhouse v. Hopkins, 490 U.S. 228, 247, 104 L. Ed. 2d 268, 109 S. Ct. 1775 n.12 (1989) (plurality). In pretext cases, the familiar McDonnell Douglas/Burdine analysis applies. In a mixed motives case the McDonnell Douglas/Burdine analysis does not apply, and the plaintiff has the burden of showing by evidence tied to a discriminatory animus that an illegitimate factor had a \"motivating\" or \"substantial\" role in the employment decision. Id. at 258. This theory has been codified in the Civil Rights Act of 1991. See 42 U.S.C.A. § 2000e-2(m) (West Supp. 1992). If the plaintiff makes such a showing, the burden shifts to the employer to prove by a preponderance of the evidence \"that it would have reached the same [employment] decision . . . even in the absence of\" the impermissible factor. Hopkins, 490 U.S. at 244-45. There is some uncertainty in the law about the sort of evidence a plaintiff must show to shift the burden to an employer in a mixed motives case, see Tyler v. Bethlehem Steel Corp., 958 F.2d 1176, 1183 (2d Cir.), cert. denied, ... 60 U.S.L.W. 3238 (U.S. Oct. 5, 1992) (No. 91-1975), but we need not address that issue here as Ezold proceeded only under the McDonnell Douglas/Burdine framework. See Transcript of Oral Argument, at 46-47 (\"Your Honor . . . I intended to say that this case followed standard McDonnell Douglas and Burdine. . . . This is a pretext case.\"). This is not a mixed-motive case. The issue in this case is \"whether illegal or legal motives, but not both, were the 'true' motives behind the [partnership] decision.\" Lockhart v. Westinghouse Credit Corp., 879 F.2d 43, 49 (3d Cir. 1989); see also Price Waterhouse, 490 U.S. at 260 (White, J., Concurring).\n\nTherefore, before considering Wolf's contentions, we think it wise to revisit the alternating burdens of proof in a Title VII discrimination case under the now familiar process set forth in McDonnell Douglas Corp. v. Green, 411 U.S. 792, 802, 36 L. Ed. 2d 668, 93 S. Ct. 1817 (1973) and Texas Dep't of Community Affairs v. Burdine, 450 U.S. 248, 252-56, 67 L. Ed. 2d 207, 101 S. Ct. 1089 (1981). See, e.g., Bennun v. Rutgers State Univ., 941 F.2d 154, 170 (3d Cir. 1991), cert. denied, 117 L. Ed. 2d 124, 112 S. Ct. 956 (1992); Roebuck v. Drexel Univ., 852 F.2d 715, 726-27 (3d Cir. 1988). Ezold relied on this particular method of circumstantial proof of discrimination at trial. The plaintiff must first establish by a preponderance of the evidence a prima facie case of discrimination. Burdine, 450 U.S. at 252; Bellissimo v. Westinghouse Elec. Corp., 764 F.2d 175, 179 (3d Cir. 1985), cert. denied, 475 U.S. 1035, 89 L. Ed. 2d 353, 106 S. Ct. 1244 (1986), abrogated on other grounds, Price Waterhouse v. Hopkins, 490 U.S. 228, 104 L. Ed. 2d 268, 109 S. Ct. 1775 (1989). The plaintiff can establish a prima facie case by showing that she is a member of a protected class; that she was qualified for and rejected for the position; and that non-members of the protected class were treated more favorably. Roebuck, 852 F.2d at 726 (citing McDonnell Douglas, 411 U.S. at 802); see Burdine, 450 U.S. at 252-53. After the plaintiff has established a prima facie case, the burden shifts to the defendant to produce evidence of a legitimate, nondiscriminatory reason for the employee's rejection. Burdine, 450 U.S. at 252; Bellissimo, 764 F.2d at 179. If the defendant's evidence creates a genuine issue of fact, the presumption of discrimination drops from the case. Burdine, 450 U.S. at 254-55; Bellissimo, 764 F.2d at 179. Then, the plaintiff, since she retains the ultimate burden of persuasion, must prove, by a preponderance of the evidence, that the defendant's proffered reasons were a pretext for discrimination. Burdine, 450 U.S. at 257; Chipollini v. Spencer Gifts, Inc., 814 F.2d 893, 898 (3d Cir.) (in banc), cert. denied, 483 U.S. 1052, 97 L. Ed. 2d 815, 108 S. Ct. 26 (1987); Bellissimo, 764 F.2d at 180.\n\nThe parties do not dispute the district court's Conclusion of law that Ezold demonstrated a prima facie case, in particular that she was \"qualified\" for admission to the partnership. While \"more than a denial of promotion as a result of a dispute over qualifications\" must be shown to prove pretext, see Molthan v. Temple Univ., 778 F.2d 955, 962 (3d Cir. 1985), such a dispute will satisfy the plaintiff's prima facie hurdle of establishing qualification as long as the plaintiff demonstrates that \"she was sufficiently qualified to be among those persons from whom a selection, to some extent discretionary, would be made.\" Bennun, 941 F.2d at 171 (quoting Roebuck, 852 F.2d at 726). In Title VII cases involving a dispute over \"subjective\" qualifications, we have recognized that the qualification issue should often be resolved in the second and third stages of the McDonnell Douglas/Burdine analysis, to avoid putting too onerous a burden on the plaintiff in establishing a prima facie case, but we have refused to adopt a blanket rule. Fowle v. C \u0026 C Cola, 868 F.2d 59, 64 (3d Cir. 1989). Because the prima facie case is easily made out, it is rarely the focus of the ultimate disagreement. Healy v. New York Life Ins. Co., 860 F.2d 1209, 1214 n.1 (3d Cir. 1988), cert. denied, 490 U.S. 1098, 104 L. Ed. 2d 1004, 109 S. Ct. 2449 (1989). We agree with the district court's Conclusion that favorable evaluations from partners with whom Ezold worked, and a score of \"G\" on her 1988 bottom line memo, demonstrate that she was qualified for partnership consideration. See Ezold I, 751 F. Supp. at 1191 (COL 6).\n\nThe defendant may rebut the presumption of discrimination arising out of the plaintiff's prima facie case by producing evidence that there was a \"legitimate, nondiscriminatory reason\" why the plaintiff was rejected. Burdine, 450 U.S. at 254; McDonnell Douglas, 411 U.S. at 802. The Supreme Court in Burdine said:\n\nThe defendant must clearly set forth, through the introduction of admissible evidence, the reasons for the plaintiff's rejection. The explanation provided must be legally sufficient to justify a judgment for the defendant. If the defendant carries this burden of production, the presumption raised by the prima facie case is rebutted, and the factual inquiry proceeds to a new level of specificity. Placing this burden of production on the defendant thus serves simultaneously to meet the plaintiff's prima facie case by presenting a legitimate reason for the action and to frame the factual issue with sufficient clarity so that the plaintiff will have a full and fair opportunity to demonstrate pretext. . . .\n\n450 U.S. at 255-56.\n\nThe burden then shifts to the plaintiff to show that the defendant's articulated reasons are pretextual. Id. at 256. This burden merges into the plaintiff's ultimate burden of persuading the court that she has been the victim of intentional discrimination. Id. The plaintiff must demonstrate \"by competent evidence that the presumptively valid reason[] for [the alleged unlawful employment action] [was] in fact a coverup for a . . . discriminatory decision.\" McDonnell Douglas, 411 U.S. at 805. Explicit evidence of discrimination--i.e., the \"smoking gun\"--is not required. See Bennun, 941 F.2d at 171; Lockhart v. Westinghouse Credit Corp., 879 F.2d 43, 48 (3d Cir. 1989). A plaintiff can establish pretext in one of two ways: \"either directly by persuading the court that a discriminatory reason more likely motivated the employer or indirectly by showing that the employer's proffered reason is unworthy of credence.\" Burdine, 450 U.S. at 256.\n\nIn proving that the employer's motive was more likely than not the product of a discriminatory reason instead of the articulated legitimate reason, sufficiently strong evidence of an employer's past treatment of the plaintiff may suffice. See Patterson v. McLean Credit Union, 491 U.S. 164, 188, 109 S. Ct. 2363, 105 L. Ed. 2d 132 (1989);\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e McDonnell Douglas, 411 U.S. at 804. The employer's \"general policy and practice with respect to minority employment\" may also be relevant. McDonnell Douglas, 411 U.S. at 804-05. Alternately, if a plaintiff produces credible evidence that it is more likely than not that \"the employer did not act for its proffered reason, then the employer's decision remains unexplained and the inferences from the evidence produced by the plaintiff may be sufficient to prove the ultimate fact of discriminatory intent.\" Chipollini, 814 F.2d at 899.\n\nWolf's articulated nondiscriminatory reason for denying Ezold's admission to the partnership was that she did not possess sufficient legal analytical skills to handle the responsibilities of partner in the firm's complex litigation practice. Ezold attempted to prove that Wolf's proffered explanation was \"unworthy of credence\" by showing she was at least equal to, if not more qualified than, similarly situated males promoted to partnership. She also contended that her past treatment at the firm showed Wolf's decision was based on a discriminatory motive rather than the legitimate reason of deficiency in legal analytical ability that the firm had articulated.\n\nV.\n\nFrom this overview of the law, we turn to the specifics of the district court's analysis, its findings and the parties' contentions concerning them. The district court compared Ezold to eight successful male partnership candidates, Associates A-H. It found:\n\nThe test that was put to the plaintiff by the Associates Committee that she have outstanding academic credentials and that before she could be admitted to the most junior of partnerships, she must demonstrate that she had the analytical ability to handle the most complex litigation was not the test required of male associates.\n\nEzold I, 761 F. Supp. at 1183 (FOF 73). The district court then concluded:\n\nMs. Ezold has established that the defendant's purported reasons for its conduct are pretextual. The defendant promoted to partnership men having evaluations substantially the same or inferior to the plaintiff's, and indeed promoted male associates who the defendant claimed had precisely the lack of analytical or writing ability upon which Wolf, Block purportedly based its decision concerning the plaintiff. The defendant is not entitled to apply its standards in a more \"severe\" fashion to female associates. . . . Such differential treatment establishes that the defendant's reasons were a pretext for discrimination.\n\nId.. at 1191-92 (COL 11) (citations omitted).\n\nWolf says this finding of pretext is wrong. Analyzing its contentions, we perceive two reasons why this is so. First, the district court's finding that Ezold was required to have outstanding academic credentials before she could be admitted to partnership is without factual support in the record. The only evidence in the record that Wolf considered Ezold's academic record is limited to the original decision to hire Ezold and to assignments given to Ezold early in her employment with Wolf, issues we consider in Part IX, infra. Second, in its analysis, the district court did not focus on Wolf's articulated reason for denying Ezold partnership--lack of analytic ability to handle complex litigation. Instead, the district court first substituted its own general standard for the qualities Wolf believed were essential to law firm partnership. Then, applying its own incorrect standard of comparison, the district court did not realize that a comparison of Ezold's legal analytic ability with that of the successful males could not support a finding of pretext. Overall, Ezold's evaluations in that category were not as good as that of even the least capable male associate who was offered a partnership position.\n\nVI.\n\nWolf contends that in all aspects of its analysis the district court improperly substituted its own subjective judgment--not only concerning what the firm's partnership standard should be--but also concerning whether Ezold met this standard. Specifically, it alleges that the district court ignored the negative evaluations concerning Ezold's legal analytical ability that are in the record; looked beyond the criterion of legal analysis, Wolf's articulated nondiscriminatory reason, in comparing Ezold to male associates admitted to the partnership; failed to make findings concerning male associates denied admission to the partnership based on their deficient legal analytical ability; and excluded from evidence the evaluation files of female associates admitted to the partnership who received criticisms similar to male associates admitted to the partnership in areas other than legal analysis. Initially, Wolf argues our review of these issues is plenary.\n\nWolf relies on Logue v. International Rehabilitation Associates, Inc., 837 F.2d 150 (3d Cir. 1988), for the proposition that we exercise plenary review over the district court's determinations on these questions. Ezold responds that Wolf is trying to obtain plenary review by couching a challenge to the sufficiency of the evidence as legal error in the selection of the appropriate standards for determining discrimination. In Logue the defendant asserted on appeal that the district court incorrectly applied the legal standard for sex discrimination by failing to address and make findings of fact on all of the legitimate, nondiscriminatory reasons it offered in support of its termination of the plaintiff's employment. Id. at 153. We held that by failing to address all of the defendant's proffered reasons the district court erred as a matter of law, misapplied the legal standard governing sex discrimination and deprived the defendant of the full trial process contemplated by Burdine. Id. at 154.\n\nThis case is distinguishable from Logue. Here, the district court did consider Wolf's articulated nondiscriminatory reason and did make findings upon it. Wolf contends the district court's findings are incomplete and that those it did make do not support its ultimate finding of pretext. Plenary review is appropriate in order to determine the extent to which essential findings are missing. The district court's refusal to credit or make findings concerning all of Wolf's proffered evidence, however, does not subject its express findings to plenary review. Those findings cannot be set aside unless they are clearly erroneous. A finding becomes clearly erroneous \"when although there is evidence to support it, the reviewing court on the entire evidence is left with the definite and firm conviction that a mistake has been committed.\" Anderson v. City of Bessemer City, 470 U.S. 564, 573, 84 L. Ed. 2d 518, 105 S. Ct. 1504 (1985) (quoting United States v. United States Gypsum Co., 333 U.S. 364, 395, 92 L. Ed. 746, 68 S. Ct. 525 (1948)). When there are two permissible views of the evidence, the district court's choice of one view cannot be clearly erroneous. Id. at 574.\n\nThe district court's resolution of the ultimate issue whether Wolf's reason for denying Ezold's admission to the partnership was a pretext is a finding of fact subject to the clearly erroneous standard set forth in Federal Rule of Civil Procedure 52(a). See id. at 573; Bellissimo, 764 F.2d at 179. We may reverse the district court on this finding of fact only if the evidence is insufficient to permit a rational factfinder to infer that Wolf's assertion that Ezold was wanting in legal analytic ability was a mask for unlawful sex discrimination.\n\nWolf's disagreement with the method of analysis the district court employed leads naturally to its challenge to the sufficiency of the evidence to support the district court's finding of pretext and its ultimate Conclusion of unlawful discrimination. Thus, Wolf contended at oral argument before this Court: \"there is no proof, in this case, of a gender-driven result.\" Transcript at 59. In considering a challenge to the sufficiency of the evidence, we must determine based on our own \"comprehensive review of the entire record\" whether Ezold has satisfied her ultimate burden of proving intentional sex discrimination. Bennun, 941 F.2d at 170; Bellissimo, 764 F.2d at 178-79. In doing so, we view the evidence in the light most favorable to Ezold. See Roebuck, 852 F.2d at 727-28 (citing Dreyer v. Arco Chem. Co., 801 F.2d 651, 654 (3d Cir. 1986), cert. denied, 480 U.S. 906, 107 S. Ct. 1348, 94 L. Ed. 2d 519 (1987)). We again defer to the district court's factual findings, including once more its ultimate finding, and we cannot reverse any of them unless they are clearly erroneous. Bellissimo, 764 F.2d at 178-79.\n\nVII.\n\nWolf's articulated reason for refusing to offer Ezold a partnership was its belief, based on a subtle and subjective consensus among the partners, that she did not possess sufficient legal analytic ability to handle complex litigation. Wolf never contended that Ezold was not a good courtroom lawyer, dedicated to her practice, and good with clients. Instead, many partners felt, because of the level of her legal analytical ability, that she could not handle partnership responsibilities in the firm's complex litigation practice. Absent evidence to show that legal analytic ability was not a necessary precondition for partnership at Wolf, the district court's opinion about Ezold's comparative strengths in the other categories on the evaluation form is immaterial.\n\nA.\n\nThe record does not show that anyone was taken into the partnership without serious consideration of their strength in the category of legal analytic ability.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The evaluations specifically asked each partner whether he or she would feel comfortable turning over to the partnership candidate \"to handle on his/her own a significant matter for one of my clients.\" See App. at 3423. Several of the partners' responses to this question on Ezold's evaluations show clear concern about the depth of her legal analytical capabilities. See, e.g., App. at 3348 (\"I would not want her in charge of a large legally complex case, the traditional measure of a Wolf, Block partner.\"). This same question, reflecting a requirement that an applicant exhibit analytical abilities sufficient to meet Wolf's perception of the firm's standard, was considered throughout the firm's evaluations of the male associates with whom Ezold was competing. See, e.g., App. at 4257 (\"I just am concerned if he could 'first chair' a case.\"); App. at 4823 (\"He [Associate H] can handle the most complex litigation we have.\"); App. at 4532 (\"Based on [Associate C's] ability to analyze a legal problem I could feel comfortable in turning over my best client to him for a significant matter.\"); App. at 5044 (\"[There are] questions about his intellectual strength, his ability to manage complex transactions and his level of attention to detail\"); App. at 4696 (\"He just doesn't have the high level of intelligence we need to handle complex legal questions.\"). Ezold herself acknowledged at trial that because of the nature of Wolf's litigation practice, its litigators devote much more time to legal analysis than in-court trial work.\n\nDavis, a member of the Associates Committee who favored partnership for Ezold, testified that he recognized her shortcomings in the area of legal analytic ability. Thus, he advocated a relaxation of the partnership standard to accommodate her because he believed that her other skills \"outweighed whatever deficiencies she had in the legal ability area.\" App. at 1684. The Associates Committee and the Executive Committee ultimately refused to relax the firm's standards. Such a refusal to relax standards, however, is not evidence of discrimination.\n\nWolf reserves for itself the power to decide, by consensus, whether an associate possesses sufficient analytical ability to handle complex matters independently after becoming a partner. It is Wolf's prerogative to utilize such a standard. In Billet v. CIGNA Corp., 940 F.2d 812 (3d Cir. 1991), an age discrimination case, we stated that \"barring discrimination, a company has the right to make business judgments on employee status, particularly when the decision involves subjective factors deemed essential to certain positions.\" Id. at 825. We stated again that \"[a] plaintiff has the burden of casting doubt on an employer's articulated reasons for an employment decision. Without some evidence to cast this doubt, this Court will not interfere in an otherwise valid management decision.\" Id. at 828 (citing Lucas v. Dover Corp., 857 F.2d 1397, 1403-04 (10th Cir. 1988) (a court will not second guess business decisions made by employers, in the absence of some evidence of impermissible motives)); see Loeb v. Textron, Inc., 600 F.2d 1003, 1012 n.6 (1st Cir. 1979) (\"While an employer's judgment or course of action may seem poor or erroneous to outsiders, the relevant question is simply whether the given reason was a pretext for illegal discrimination.\").\n\nThe partnership evaluation process at Wolf, though formalized, is based on judgment, like most decisions in human institutions. A consensus as to that judgment is the end result of Wolf's formal process. In that process, the Associates Committee has the role of collecting and weighing hundreds of evaluations by partners with diverse views before reaching its consensus as to a particular associate's abilities. The consensus the Associates Committee reaches is then passed on to the Executive Committee. After its review and, at least in Ezold's case, additional independent investigation, the Executive Committee submits its final recommendation to the partners for a vote.\n\nThe differing evaluations the partners first submit to the Associates Committee are often based on hearsay or reputation. No precise theorem or specific objective criterion is employed. Cf. Bennun, 941 F.2d at 179 (not \"unwarranted invasion\" of college's tenure process for district court \"to determine that [professor] was held to higher standards in objective terms, i.e. number of publications\") (emphasis added). We have cautioned courts on several occasions to avoid unnecessary intrusion into subjective promotion decisions in the analogous context of academic tenure. While such decisions are not insulated from judicial review for unlawful discrimination,\n\nit is clear that courts must be vigilant not to intrude into that determination, and should not substitute their judgment for that of the college with respect to the qualifications of faculty members for promotion and tenure. Determinations about such matters as teaching ability, research scholarship, and professional stature are subjective, and unless they can be shown to have been used as the mechanism to obscure discrimination, they must be left for evaluation by the professionals . . . .\n\nId. at 181 (Sloviter, C.J., Dissenting from denial of petition for rehearing) (quoting Kunda v. Muhlenberg College, 621 F.2d 532, 548 (3d Cir. 1980)). These cautions against \"unwarranted invasion or intrusion\" into matters involving professional judgments about an employee's qualifications for promotion within a profession inform the remainder of our analysis.\n\nB.\n\nIn Ezold's case, the district court correctly recognized the legal premise that should have governed its result: Title VII prohibits only \"discrimination.\" Therefore, \"consideration of the practices of the [firm] toward the plaintiff must be evaluated in light of its practices toward the allegedly more favored group, in this case males.\" Kunda, 621 F.2d at 538.\n\nThe district court, however, failed to apply this legal premise to the evidence before it. It disagreed not only with Wolf's assessment of Ezold's ability to meet Wolf's standards, but also with Wolf's partnership standards themselves. For example, it found:\n\nIn the magnitude of its complexity, a case may have a senior partner, a younger partner, and an associate(s) assigned to a case. Accordingly, requiring the plaintiff to have the ability to handle on her own any complex litigation within the firm before she was eligible to be a partner was a pretext.\n\nEzold I, 751 F. Supp. at 1188 (FOF 121). The district court disagreed with Wolf's decision not to overlook Ezold's deficiency in legal analysis because of her other skills and attributes, but the court is not a member of Wolf's Associates Committee or Executive Committee. Its belief that Wolf's high standard of analytical ability was unwise in light of the staffing of senior partners on complex cases does not make Wolf's standard a pretext for discrimination.\n\nThe evaluations that the district court did rely upon in making its finding of pretext praised Ezold for skills other than legal analysis, such as client relations and ability in court, that Wolf never disputed she possessed. Where an employer produces evidence that the plaintiff was not promoted because of its view that the plaintiff lacked a particular qualification the employer deemed essential to the position sought, a district court should focus on the qualification the employer found lacking in determining whether non-members of the protected class were treated more favorably. Without such a limitation, district courts would be routinely called upon to act as members of an employer's promotion board or committee. It would subjectively consider and weigh all the factors the employer uses in reaching a decision on promotion and then make its own decision without the intimate knowledge of the history of the employer and its standards that the firm's decisionmakers use in judging the degree to which a candidate exhibits a particular qualification that the employer has decided is of significance or primary importance in its promotion process. Pretext is not established by virtue of the fact that an employee has received some favorable comments in some categories or has, in the past, received some good evaluations. See, e.g., Billet, 940 F.2d at 826; Turner v. Schering-Plough Corp., 901 F.2d 335, 343-44 (3d Cir. 1990); Healy, 860 F.2d at 1215; see also Frieze v. Boatmen's Bank, 950 F.2d 538, 541 (8th Cir. 1991) (\"An employer rating an employee as competent discredits the employer's stated reason for discharging the employee, however, only when the employer's stated reason is the employee's general incompetence.\") (emphasis added). It was not for the district court to determine that Ezold's skills in areas other than legal analysis made her sufficiently qualified for admission to the partnership.\n\nThe district court's method of comparing Ezold to \"similarly situated\" male associates admitted to the partnership points up this initial flaw in its analysis. It engaged in a \"pick and choose\" selection of various comments concerning the male associates' personalities, work habits, and other criteria besides legal analysis, conducted its own subjective weighing process and then found that \"male associates who received evaluations no better than [Ezold] and sometimes less favorable than [her] were made partners.\" Ezold I, 751 F. Supp. at 1184 (FOF 75). In doing so, the district court made no reference to the many favorable evaluations of the analytical ability of these male associates.\n\nHopkins v. Price Waterhouse, 618 F. Supp. 1109 (D.D.C. 1985), aff'd in relevant part, 825 F.2d 458 (D.C. Cir. 1987), rev'd on other grounds, 490 U.S. 228, 109 S. Ct. 1775, 104 L. Ed. 2d 268 (1989) (plurality), is instructive. There the dispute centered in part on whether Price Waterhouse's concern about the plaintiff's interpersonal skills was a legitimate, nondiscriminatory reason to deny her partnership, or whether it was unworthy of credence. The district court held that \"it is clear that the complaints about the plaintiff's interpersonal skills were not fabricated as a pretext for discrimination.\" 618 F. Supp. at 1114. Contemporaneous evaluations \"conducted well before the plaintiff was proposed for partnership\" reflected numerous criticisms of her interpersonal skills, and \"even partners who strongly supported her partnership candidacy acknowledged these deficiencies.\" Id. The plaintiff in Hopkins had contended that men with problems in interpersonal skills were invariably admitted to the partnership. The district court disagreed, stating:\n\nThe plaintiff has identified two male candidates who were criticized for their interpersonal skills because they were perceived as being aggressive, overbearing, abrasive or crude, but were recommended by the Policy Board and elected partner. Price Waterhouse points out that in both cases the Policy Board expressed substantial reservations about the candidates' interpersonal skills but ultimately made a \"business decision\" to admit the candidates because they had skills which the firm had a specific, special need [for] and the firm feared that their talents might be lost if they were put on hold. . . . In addition, these candidates received fewer evaluations from partners recommending that they be denied partnership and the negative comments on these candidates were less intense than those directed at the plaintiff.\n\nId. at 1115.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe district court's comparison of Ezold with the successful male candidates in categories other than legal analytic ability does not lend support to its ultimate finding of pretext. The district court could not overturn Wolf's judgment that Ezold did not meet its standards for legal analytic ability without finding that Wolf's Conclusions as to Ezold's legal analytic ability were pretextual. That finding, in order to stand, has to be based on evidence showing either that Wolf's asserted reason for denying Ezold a partnership position was not credible--either through comparison of her ability in that category, as Wolf perceived it, with the successful male associates, or by evidence showing that Wolf's decision not to admit Ezold to the partnership was more likely motivated by a discriminatory reason than by her shortcomings in legal analytic ability.\n\nC.\n\nWere the factors Wolf considered in deciding which associates should be admitted to the partnership objective, as opposed to subjective, the conflicts in various partners' views about Ezold's legal analytical ability that this record shows might amount to no more than a conflict in the evidence that the district court as factfinder had full power to resolve. The principles governing valid comparisons between members of a protected minority and those fortunate enough to be part of a favored majority reveal an obvious difficulty plaintiffs must face in an unlawful discrimination case involving promotions that are dependent on an employer's balanced evaluation of various subjective criteria. This difficulty is the lack of an objective qualification or factor that a plaintiff can use as a yardstick to compare herself with similarly situated employees. In Bennun, the reason Rutgers assigned for denying Bennun's promotion to the position of tenured professor was the \"poor quality and insufficient quantity of his research.\" Bennun, 941 F.2d at 177. Because Bennun's research product could be measured against the judgment of his academic peers and, by that judgment, objectively compared with the research of a successful candidate for professor, Bennun was able to show the reason the University advanced for denying him the rank of professor was incredible. He did so by proving that he had published a higher number of articles than the similarly situated non-hispanic member of the faculty who had been granted professorial rank and that his articles had received more favorable reviews from internationally known scholars. Id. By objectively comparing Bennun's published research with that of the favored candidate, the district court rationally found that Bennun was held to higher standards than a non-Hispanic. This Court held that this finding was not clearly erroneous and thus laid a proper foundation for the district court's circumstantial inference that Rutgers' articulated reason for denying Bennun promotion was a pretext. Id. at 179-80.\n\nSimilarly, in Kunda, the district court held that Muhlenberg's asserted reason for not promoting Kunda, lack of a master's degree, \"was pretextual in view of its promotion of male members of the department who did not have masters' degrees.\" 621 F.2d at 539. We affirmed, stating:\n\nMuhlenberg's attempt to explain and distinguish each of the three situations [in which male members without master's degrees were promoted] raised a factual issue which the trier of fact decided against it. We cannot say that the record is barren of any evidence to support the trial court's findings, and therefore will affirm its ultimate Conclusion that plaintiff was discriminated against on the basis of sex in the denial of a promotion.\n\nId. at 545.\n\nThe record shows a 9-1 consensus among the members of the Associates Committee that Ezold's admission to the partnership was \"unlikely\" because of their overall assessment of her legal analytical ability. It was followed by the unanimous negative vote of the Executive Committee and the entire partnership. The positive evaluations of some partners concerning Ezold's skills in areas other than legal analysis do not show the reason Wolf advanced for denying partnership to Ezold was incredible and so a pretext for discrimination.\n\nEzold, unlike the plaintiffs in Bennun and Kunda, is not able to point to an objectively quantifiable factor by which Wolf compared her qualifications against those of the male associates considered for partnership. Wolf's articulated reason, lack of legal analytic ability to handle complex litigation, like all its other criteria, involves subjective assessment of an associate's manifested behavior and performance.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nD.\n\nHere, the district court not only based its finding of pretext on invalid comparisons, but it also ignored evidence Wolf produced to compare Ezold's shortcomings with the strengths of the successful male candidates in the category of legal analytic ability.\n\nThus, Wolf also argues the district court ignored significant evidence by focusing only on the positive evaluations in Ezold's files and turning a blind eye to the many negative criticisms concerning her analytic ability. Compare Ezold I, 751 F. Supp. at 1183 with Typescript, supra at 14-22. Wolf's attack in this respect is even more serious in its consequence than its attack on the court's use of comparisons between Ezold and the successful male candidates in categories other than legal analytic ability. The court's improper comparison of Ezold and the successful males in categories other than legal analytic ability would merely require a remand for appropriate comparison. If, however, Ezold is unable to show that she compared favorably in the category of legal analytic ability with at least one of the successful male candidates, she will have failed to show that Wolf did not pass her over for the legitimate reason it asserted. If she fails in that respect, she loses the benefit of the inference of unlawful discrimination that arises when the employer's legitimate articulated reason is shown not to be the real reason for the employer's discriminatory action. Absent that inference, Ezold cannot prevail on her McDonnell Douglas/Burdine theory unless she has produced direct evidence independently sufficient to show discriminatory animus, an issue we consider in Part IX, infra. See Burdine, 450 U.S. at 254-56. Compare McDonnell Douglas, 411 U.S. at 801 (\"The broad, overriding interest, shared by employer, employee, and consumer, is efficient and trustworthy workmanship assured through fair and . . . neutral employment and personnel decisions.\") with Burdine, 450 U.S. at 259 (\"Title VII, however, does not demand that an employer give preferential treatment to minorities or women.\") (citing 42 U.S.C.A. § 2000e-2(j)).\n\nWe are not unmindful of the difficult task a plaintiff faces in proving discrimination in the application of subjective factors. It arises from an inherent tension between the goal of all discrimination law and our society's commitment to free decisionmaking by the private sector in economic affairs.\n\nThe fact that Wolf's articulated reason for rejecting Ezold, lack of legal analytical ability, involves subjective and not objective factors subject to easy measurement does not, therefore, insulate the partnership decision from all review. When an employer relies on its subjective evaluation of the plaintiff's qualifications as the reason for denying promotion, the plaintiff can prove the articulated reason is unworthy of credence by presenting persuasive comparative evidence that non-members of the protected class were evaluated more favorably, i.e., their deficiencies in the same qualification category as the plaintiff's were overlooked for no apparent reason when they were promoted to partner.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nA plaintiff does not establish pretext, however, by pointing to criticisms of members of the non-protected class, or commendation of the plaintiff, in categories the defendant says it did not rely upon in denying promotion to a member of the protected class. Such comments may raise doubts about the fairness of the employer's decision. \"The fact that a court may think that the employer misJudged the qualifications of the applicant does not in itself expose him to Title VII liability, although this may be probative of whether the employer's reasons are pretexts for discrimination.\" Burdine, 450 U.S. at 259; see also Billet, 940 F.2d at 825. It does not, however, always prove the employer's reason is \"unworthy of credence\" in and of itself. See McDonnell Douglas, 411 U.S. at 804-05. Evidence establishing such incredibility must show that the standard or criterion the employer relied on was \"obviously weak or implausible.\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Villanueva v. Wellesley College, 930 F.2d 124, 131 (1st Cir.), cert. denied, 112 S. Ct. 181 (1991). Ezold's evidence does not make this showing.\n\nOn this issue of sufficiency, it is necessary to consider preliminarily Ezold's contention that the district court correctly refused to credit many of the negative evaluations of her analytical ability because they were by persons for whom she had never done \"substantial\" work. Since the district court relied on favorable evaluations of Ezold from partners who likewise had insubstantial contact with her, Ezold's argument would improperly allow the district court to apply a double standard in the use of positive, as opposed to negative, comments. For example, the district court relied on a favorable evaluation of Ezold by Bradley although he had never worked directly with her on a case. Similarly, an evaluation Robert Wolf, a retired partner in the corporate department, had written before the district court's dismissal of the complaint Ezold filed in that case, expressed his satisfaction with her handling of the client in the Union League matter. See Firestone \u0026 Parson, Inc. v. Union League, 672 F. Supp. 819 (E.D. Pa. 1987), aff'd mem., 833 F.2d 304 (3d Cir. 1987). In fact, seventeen of the twenty-one partners who viewed Ezold's admission \"with favor\" or \"with enthusiasm\" had only \"slight contact\" or \"no contact\" with her during the evaluation period and based their vote solely on reputation or minimal contact.\n\nThe district court's failure to consider the negative evaluations of Ezold's legal analytic ability because the partners making them had little contact with Ezold cannot be excused in the face of the credence the district court gave to positive comments about Ezold's ability from those who likewise had little or no contact with her. While a factfinder can accept some evidence and reject other evidence on the basis of credibility, it should not base its credibility determination on a conflicting double standard.\n\nMoreover, the district court never made a finding that the critical evaluations were themselves incredible or a pretext for discrimination. There is no evidence that Wolf's practice of giving weight to negative votes and comments of partners who had little contact and perhaps knew nothing about an associate beyond the associate's general reputation was not applied equally to female and male associates. Cf. Hopkins, 618 F. Supp. at 1116 (\"Regardless of its wisdom, the firm's practice of giving 'no' votes [by partners who had only limited contact with the candidate] great weight treated male and female candidates in the same way.\"). Ezold's preliminary contention that the district court did not have to consider these negative comments lacks merit. We turn therefore to an examination of the evidence comparing Ezold and the successful male candidates in the category of legal analytic ability.\n\nA sampling of comments from the negative evaluations of Ezold's legal analytic ability reveals the extent to which the district court's refusal to consider them flawed its analysis. For example, Fiebach was one of those with negative comments about Ezold's legal analytic ability. He consistently rated Ezold's analytical skills as \"marginal\" long before a 1988 disagreement in the Carpenter matter.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See App. at 3190-91, 3025. Fiebach had experienced \"substantial\" contact with Ezold during her final two years as an associate. He recommended Ezold for partnership, with professed \"negative feelings.\" See App. at 3544-47.\n\nFiebach was not alone in his negative comments about Ezold's legal analytic ability. Arbittier also strongly and consistently criticized Ezold in the category of legal analysis.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Arbittier had opposed hiring Ezold in the first instance because he did not think she had the academic credentials to make it at the firm. See App. at 3414 (\"poor academic record--well below our standards\"). In a 1984 evaluation Arbittier wrote \"she is doing much better than I thought she would . . . .\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e App. at 3397. Ezold later did work for Arbittier, and his contemporaneous evaluations indicate he was not impressed by her performance. See id. at 1488-89, 3380 (her brief was \"stilted and unimaginative\"; \"she failed to cite me to a clause in the agreement that was highly relevant\"; \"she missed [the main issue] completely\"). He ultimately recommended Ezold's admission to the partnership \"with mixed emotions.\"\n\nEven Ezold's strongest supporters acknowledged the shortcomings in her legal analytical ability. See, e.g., App. at 3894 (Boote) (\"I would not want her in charge of a large legally complex case, the traditional measure of a Wolf, Block partner.\"); id. at 3878 (Kurland) (\"Nancy is an exceptionally good courtroom lawyer . . . except there seems to be serious question as to whether she has the legal ability to take on large matters and handle them on her own.\"); id. at 3512 (Schwartz) (\"Nancy is adequate in [legal analysis], but is not a legal scholar.\"); id. at 3956 (Davis) (\"She remains a little weak in her initial analysis of complex legal issues.\"). These contemporaneous criticisms support Wolf's contention that the final consensus among its partners that Ezold did not, in the perception of the firm, possess the legal analytical capacity requisite to becoming a partner, and not her sex, was the reason for denying her a partnership position.\n\nVIII.\n\nThe district court's error in failing to consider the many negative evaluations of Ezold's legal analytic ability, like its error in comparing Ezold's strengths in other categories with the successful male candidates, is not dispositive of Wolf's argument that Ezold failed to produce evidence sufficient to show she was manifestly as good as the least capable of the favored males. The failure to consider these negative comments would not be fatal to Ezold's case if there were evidence in the record that could rationally support a finding of unequal treatment by Wolf in applying its articulated reason for the screening of candidates for partnership. Thus, it remains necessary for us to examine the record in that respect.\n\nWe note at once that it shows the evaluation process at Wolf is demanding. Cf. Watson v. Fort Worth Bank and Trust, 487 U.S. 977, 991-92, 101 L. Ed. 2d 827, 108 S. Ct. 2777 (1988) (\"opinions often differ when managers and supervisors are evaluated, and the same can be said for many jobs that involve . . . complex and subtle tasks like the provision of professional services . . . .\"); Zahorik v. Cornell Univ., 729 F.2d 85, 93 (2d Cir. 1984) (\"Where a broad spectrum of views is sought . . . a file composed of irreconcilable evaluations is not unusual. . . . Tenure files typically contain positive as well as negative evaluations, often in extravagant terms, sufficient to support either a grant or denial of tenure.\"). The firm may have been wrong in its perception of Ezold's legal analytic ability and, if so, its decision to pass over Ezold would be unfair, but that is not for us to Judge. Absent a showing that Wolf's articulated reason of lack of ability in legal analysis was used as a tool to discriminate on the basis of sex, Ezold cannot prevail. See Billet, 940 F.2d at 828; Hopkins, 618 F. Supp. at 1116; cf. Hishon v. King \u0026 Spalding, 467 U.S. 69, 81, 81 L. Ed. 2d 59, 104 S. Ct. 2229 (1984) (Powell, J., Concurring) (\"The qualities of mind, capacity to reason logically . . . and the like are unrelated to race or sex.\").\n\nA.\n\nAlways having in mind that the issue before us is whether the firm passed over Ezold because she is a woman, we begin our specific comparative analysis with male Associate A.\n\nAssociate A worked in Wolf's litigation department. He was recommended for partnership by the Associates Committee in the fall of 1988. He is closest to Ezold in the category of legal analysis, and, like her, received some negative evaluations over the years.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In its findings concerning A's evaluations, however, the district court failed to point out that no partner actually rated A lower than Ezold in the criterion of legal analysis. No partner had expressed serious problems with A's analytical ability as of 1988, the year he was up for partnership, as in Ezold's case. In fact, no partner gave A a grade below acceptable/marginal in the category of legal analysis during his final evaluation period.\n\nAssociate A received at least one and sometimes several marks of \"distinguished\" in this category during each evaluation period from April 1984 through 1988. Gregory Magarity, Ezold's most ardent advocate, rated A as \"distinguished\" in legal analysis in 1987 and 1988, higher than the grade of \"good\" he gave Ezold in those years. He wrote:\n\n[Associate A] did a magnificent job in the preparation and trial of [a case] in Indianapolis, Indiana. His written product was excellent; his support and legal analysis were likewise excellent . . . . You can assign [Associate A] to any of my cases.\n\nApp. at 5127. Barry Schwartz, David Doret, Donald Joseph and Donald Bean also consistently rated A as distinguished. Boote, a supporter of Ezold, also rated A higher than Ezold in this category. The record is replete with positive comments from many partners about Associate A that the district court did not refer to. In 1987 and 1988, not one partner ever gave Ezold an unqualified rating of \"distinguished\" in the category of legal analysis.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nAlthough Fiebach rated A as just \"acceptable\" in legal analysis in 1988 (App. at 6385), the district court incorrectly compared his single rating to Ezold's \"bottom line\" rating of \"good\" which was prepared not by Fiebach, but by Associates Committee member Arthur Block based on Block's own shorthand summary of a large number of individual evaluations of Ezold's analytic ability.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e See Ezold I, 751 F. Supp. at 1184 (FOF 77). That same year Fiebach gave Ezold a rating of \"marginal,\" lower than the acceptable rating he gave A in that criterion.\n\nStrogatz had also made a critical evaluation of A in 1987, the year prior to his admission to the partnership, but Strogatz viewed A's admission to the partnership \"with favor\" in 1988. He wrote that \"[A] is over the line,\" App. at 4354, and graded him as \"good/acceptable\" in the category of legal skills. Strogatz did not grade Ezold in this category in 1987 or 1988 because of no contact with her other than administratively. He did state, however, that \"my impression from others is that her legal skills are at best average and more probably marginal.\" App. at 3975.\n\nFinally, in 1988, eight partners viewed A's admission to the partnership \"with enthusiasm,\" one \"with enthusiasm/favor,\" thirty-two \"with favor,\" six \"with mixed emotions,\" one \"with negative feelings\" and the rest had no opinion. Davis was the only partner in the firm to vote for A's admission to the partnership with a negative view. He gave A the same grade as Ezold, however, in the category of legal analysis. In 1988, seven partners viewed Ezold's admission \"with enthusiasm,\" fourteen \"with favor,\" six \"with mixed emotions,\" four \"with negative feelings\" and one \"with mixed emotions/negative feelings.\" A's analytical skills, while criticized by various partners, were never as consistently questioned as Ezold's. The criticisms of A, found among the comments of the partners evaluating Ezold and A, do not support a finding that Wolf's legitimate non-discriminatory reason for refusing a partnership position to Ezold was incredible. In a comparison of subjective factors such as legal ability, it must be obvious or manifest that the subjective standard was unequally applied before a court can find pretext. See typescript supra at 37-39; Villanueva, 930 F.2d at 131. Unequal application of the criterion of legal ability is not manifest between Ezold and Associate A on this record.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e It does not contain evidence sufficient to show that Ezold was held up to a higher standard than Associate A because she was a woman.\n\nEzold's ability in legal analysis suffers even more in the partners' eyes when compared with the individual evaluations of the other successful male candidates. All of the other males that Wolf accepted for partnership in 1988 received many scores of distinguished in the category of legal analysis, and none of them ever received a grade of marginal in this category during his final evaluation period prior to admission to the partnership. We summarize them as follows.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe Associates Committee recommended Male Associate B, an associate in the litigation department, for partnership in July 1989. The critical comments upon which the district court relied with respect to Associate B have nothing to do with B's legal analytical skills but focus instead upon his work habits. B's legal analysis, on the other hand, was often rated as distinguished. See, e.g., App. at 4724 (Poul) (\"He does a remarkable job. I expect him to take over the client some day.\"); id. at 4249-51, 4268, 4280. In his last evaluation as a senior associate, six partners rated B as \"distinguished\" in legal analysis, and not one partner rated him below \"acceptable\" in this category. Davis and Magarity, Ezold's strongest supporters, graded B higher than Ezold in the category of legal analysis, recognizing his ability as \"distinguished.\" Davis wrote on B's final evaluation that \"he has produced elegantly written legal work.\" App. at 4281. Several partners, even those criticizing B's work habits, characterized him as \"very bright.\" Not one partner viewed B's admission to the partnership with negative feelings.\n\nAssociate C, an associate in the real estate department, was recommended by the Associates Committee in 1987 and became a partner in February 1988. With respect to Associate C, the district court made one finding:\n\n94. . . . In the 1987 Associates Committee bottom line memo, he received an overall grade of \"G,\" the same as that which Ms. Ezold had received. The summary of evaluations used by the Associates Committee noted that Henry Miller, a partner in the Real Estate Department, had changed Associate C's legal analysis score to [\"acceptable\"] and suggested that an \"adequate [score] may well be sufficient in his mind for regular partnership.\"\n\nEzold I, 751 F. Supp. at 1186.\n\nContrary to this single limited finding by the district court, C's legal analysis was uniformly rated as \"good\" or \"distinguished.\" The district court ignored the consensus in C's department that he had a high level of legal analytical ability. See App. at 4542; id. at 4532 (Weintraub) (\"Based on his ability to analyze a legal problem, I could feel comfortable in turning over my best client to him for a significant matter.\") In citing Miller's grade of \"acceptable\" in 1987, the district court fails to point out Miller's comments that any problems with B were based on earlier work and that he had improved from that time. Twelve partners viewed C's admission \"with enthusiasm,\" twenty-six \"with favor,\" eight \"with mixed emotions\" and one \"with negative feelings.\"\n\nAssociate D, an associate in the corporate department, was recommended for partner by the Associates Committee in 1988. In addition to other comments unrelated to D's legal analytical ability, the district court relied on the fact that in 1988 three partners said D needed help with his writing skills. Ezold I, 751 F. Supp. at 1186 (FOF 96). The district court failed to note that the partners who said D needed help with writing did so on the basis that English is not D's native language, as he was born and raised in a foreign country. One of the partners criticizing D's writing ability also wrote: \"I'd want a close look at his drafting skills--and perhaps we should make a special effort to cultivate them--in view of the language issue.\" App. at 4460. Very few partners ever questioned D's legal analytical ability and he received several marks of \"distinguished\" during his evaluations from 1986-88. The following comments from D's file are typical: \"Can handle very confusing complex structural and strategic issues. . . . Is a superb strategist on corporate acquisition matters.\" Id. at 4503; \"[D] is unusually smart and has an instinctive grasp of business. I believe he is a star.\" Id. at 4481. Eight partners voted for his admission \"with enthusiasm,\" twenty-seven \"with favor,\" twelve \"with mixed emotions,\" one \"with favor/mixed emotions\" and one \"with negative feelings.\"\n\nAssociate E, an associate in the estates department, was admitted to the partnership in 1987. The district court made one finding concerning Associate E:\n\n101. Mr. Strogatz stated that Associate E was not a star and that an associate did not need to be a star to be a partner. He also wrote that he thought of Associate E \"as a guy just to do work.\"\n\nEzold I, 751 F. Supp. at 1186. Strogatz made this comment based on \"no contact\" with E. See id. Strogatz wrote: \"Although not a star, [E] meets our standards.\" App. at 4438. The district court points to no criticism of E's legal analysis because there is none in the record and, in fact, E's ability was often rated as distinguished. See, e.g., App. at 4417 (Glyn) (\"His analytic abilities are exceptional.\"); id. at 4414 (Kamens (\"[E] exhibits a willingness to understand certain legal problems and analyzes them quite well.\"). The district court's reliance on Strogatz's evaluation in finding pretext further demonstrates the inconsistency with which it compared evaluations in this case, relying only on positive evaluations by partners Ezold had done \"substantial\" work for, while relying on negative evaluations of male associates based on no contact.\n\nThe following findings of the district court concerning Associate F, an associate in the corporate department, related to his legal analytical ability:\n\n103. The grid on Associate F's bottom line memo in 1988, the year before his consideration for partnership, reflected a composite grade of \"G-\" for legal analysis.\n\n107. The prior year Donald Joseph, a partner in the Litigation Department, had rated Associate F's legal skills as acceptable, noting \"a shoddiness in clear thinking or maybe lack of full experience.\"\n\n108. At the same time, Michael Temin, a partner in the Corporate Department, recommended that Associate F receive help in his writing and drafting skills.\n\n110. In 1986, William Rosoff evaluated Associate F:\n\nHe is sometimes too fast or flip or not attentive enough. In one matter, he failed to collect on a letter of credit on the grounds that he supposed Al Braslow would handle that part of the matter, when it was an inappropriate assumption to make especially without talking to Al. In another matter, the time for answering a complaint expired. While he might have thought someone else was seeing to it, he should have double checked.\n\nEzold I, 751 F. Supp. at 1186-87.\n\nIn fact, Joseph's full comment about \"a shoddiness in clear thinking\" stated:\n\nAcceptable--I have used . . . [acceptable] in the old [Wolf, Block] terms; a good lawyer, practical and valuable. I can't describe precisely my hesitancy--perhaps a shoddiness in clear thinking or maybe lack of full experience. . . .\n\nApp. at 4606. In F's final evaluation period, Joseph recommended F's admission \"with favor.\" Id. at 4611. While Temin wrote that F needed help with writing skills in 1988, he gave him a grade of \"good\" in legal and professional skills. With respect to Rosoff's 1986 criticism, the district court omitted the following statement by Rosoff in the same evaluation: \"[F] seems to be fine substantively. . . . I don't cite these as experiences which mean he cannot make the grade here, but he does have to make a more careful and expansive view of his role and responsibilities.\" Id. at 4602. Associate F's legal analytical ability was never called into question. In addition, F received a \"distinguished,\" numerous \"goods,\" and no \"marginals\" on his final review. Five partners viewed his admission to the partnership \"with enthusiasm,\" twenty-two \"with favor,\" four \"with mixed emotions\" and three \"with negative feelings.\" While the number of negative votes is close to the four Ezold received, the record shows that F had greater overall support from the partners in his department than Ezold did in hers.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe district court cited the following comments regarding the legal analytical ability of Associate G, an associate in the corporate department admitted to the partnership in February 1988:\n\n112. In the bottom line memorandum on Associate G for 1987, the year before he became partner in the Corporate Department, his grid reflected no composite score higher than \"G.\" In four of the legal skills, including legal research and promptness, Associate G was rated only \"acceptable.\"\n\n113. In his 1987 evaluation Associate G was rated \"acceptable\" in legal analysis by Alan Molod, a partner in the Corporate Department. Mr. Molod added that Associate G was \"Not a Star\" and was \"Sloppy at times and [showed] occasional lapses in judgment.\"\n\nEzold I, 751 F. Supp. at 1187.\n\nThe district court did not credit or consider the many favorable evaluations of G, such as, \"[G] is one of the brightest lawyers in our firm.\" App. at 4676. While Molod rated G as only acceptable in legal analysis in 1987, this score should be viewed against the many \"good\" and \"distinguished\" grades he received in this category. Molod's full comments stated: \"Good solid lawyer. Not a star. Very hard worker. Sloppy at times and occasional lapses in judgment.\" Id. at 4677. Despite rating G as only \"acceptable\" in legal analysis in 1987, Molod recommended G's admission to the partnership \"with favor.\" Overall, thirteen partners viewed G's admission to the partnership \"with enthusiasm,\" thirty \"with favor,\" six \"with mixed emotions\" and two \"with negative feelings.\"\n\nThe district court relied on one partner's criticisms of Associate H in concluding that Wolf applied its standards in a more severe fashion to Ezold. It found:\n\n116. Mr. Arbittier wrote in his 1987 evaluation of Associate H:\n\n[Associate H] has really let me down in his handling of a case for General Electric Pension Trust. He missed the crux of the case in the beginning and dragged his feet terribly in getting it back on track. . . . [Associate H] works very hard, but hard work alone is not enough. I have my doubts that he will ever be anything but a helper who does what he is told adequately but with no spark.\n\nMr. Arbittier wrote that Associate H was trying \"to change my view of him and I am giving him a second chance. He [has] brains. Maybe he can change.\" Mr. Arbittier also called Associate H \"phlegmatic, diffident, nonassertive and unimaginative,\" and in 1988 wrote that he was \"[not] real strong in legal analysis or in focusing on the key issues (dividing the wheat from the chaff).\"\n\n117. In 1989, Mr. Arbittier concluded that Associate H was a \"nice guy\" who had made improvement; he supported Associate H for partnership. Mr. Arbittier explained Associate H's \"redemption\"; Associate H told Mr. Arbittier how he had been overworked.\n\nEzold I, 751 F. Supp. at 1187.\n\nWhile the district court credited Arbittier's criticism of H, it chose to ignore Arbittier's continuing criticism of Ezold on the same grounds between 1984 and 1988. See typescript supra at 14-15, 20. The district court also ignored the fact that in H's final two evaluations, Arbittier viewed his admission to the partnership with favor and wrote the following comments: \"significant improvement\"; \"A good lawyer. . . . In the past I had some problems with [H]. He seems to have overcome them. . . .\" App. at 4845, 4858. This change in viewpoint was based on H's handling of a specific case for Arbittier. Goldberger specifically wrote in his evaluation of H that Arbittier's critical evaluation was \"aberrational . . . [H] is a talented, hard-working lawyer who deserves to make it.\" Id. at 4828. Moreover, the district court failed to acknowledge H's grades of \"distinguished\" in legal analysis throughout his tenure at the firm. Twelve partners viewed his admission to the partnership \"with enthusiasm,\" seventeen \"with favor,\" one \"with mixed emotions\" and zero \"with negative feelings.\"\n\nFinally, we note that three of the four partners who expressed \"negative feelings\" towards Ezold's candidacy were members of her own department, while none of the eight male associates was viewed with \"negative feelings\" by more than one member of their department.\n\nThe district court's finding that Wolf applied its partnership standards in a more \"severe\" fashion to female associates is clearly erroneous. The comparative evidence of more favorable treatment for male employees contained in this record does not support that finding. See Bellissimo, 764 F.2d at 180 (holding pretext \"clearly erroneous because [plaintiff] failed to make any showing of disparate treatment and because [defendant] proved that male attorneys were treated the same as she in the disputed areas.\"). Our review of the entire evaluation files of the eight male associates discloses that, unlike Ezold, whose staunchest supporters persistently expressed doubts about her ability to meet the firm's criterion of legal analysis, Associates A to H faced no comparable degree of criticism about their legal analytical skills. The snippets of comments critical of these male associates culled from dozens of evaluation forms do not show that Wolf's articulated reason for declining to recommend Ezold for partnership was \"obviously weak or implausible\" or that the standards were \"manifestly unequally applied.\" Villanueva, 930 F.2d at 131 (citations omitted).\n\nB.\n\nDespite Wolf's request, the district court failed to make findings concerning other male associates who, like Ezold, were passed over for partnership. The evidence concerning their evaluations adds support to our Conclusion that the district court's finding that Wolf's asserted legitimate reason for denying Ezold a partnership position was a sham cannot be supported on a theory of discriminatory application.\n\nMale Associates 1 and 2, who were comparable to Ezold in the category of legal analysis, were also rejected for regular partnership. Again, we recognize that the district court, as factfinder, \"can accept some parts of a party's evidence and reject others.\" Bennun, 941 F.2d at 179. But when the evidence sheds light on whether the employer treated similarly situated males and females alike, it should not be ignored. See Bellissimo, 764 F.2d at 181 (comparison of whether male attorneys treated same as discharged female attorney in disputed categories).\n\nMale Associates 1 and 2 were highly rated by a number of partners, but, as with Ezold, the Associates Committee determined their ability in legal analysis fell below the firm's standards. The Associates Committee expressed its views on Male Associates 1 and 2 in a letter to the Executive Committee stating that, although they were \"valuable associates,\" they nevertheless fell below the firm's \"historically accepted standards for admission to the partnership.\" App. at 2586. The partners' comments about Male Associates 1 and 2 were very similar to those criticizing Ezold. This is illustrated by the following sampling of comments about Male Associate 1: \"[He] has good talents although he is not as capable in legal analysis as others,\" id. at 4632 (Brantz); \"[His] best skills are in client relations and desire to please, rather than legal analysis or intellectual genius,\" id. at 4630 (Schneider); \"He has great difficulty analyzing and drafting complex business transactions,\" id. at 4642 (Wiener); \"[There are] questions about his intellectual strength, his ability to manage complex transactions and his level of attention to detail,\" id. at 5044 (Baer). The partners' comments with regard to Male Associate 2 are also similar to those the partners made about Ezold: \"He lacks the minimum level of analytic ability which is required to succeed at WB,\" id. at 4696 (Chanin); \"[His legal analysis is] just fair. Came up with little in the way of new ideas. . . . Seemed to miss key points at times,\" id. at 4695 (Arbittier); \"[Legal analysis is] not penetrating or focused. I do not feel comfortable relying on his legal judgment,\" id. at 4697 (Arbittier); \"He just doesn't have the high level of intelligence we need to handle complex legal questions,\" id. at 4696 (Arbittier); \"[He] is an enigma to me. His writing ability is substandard, and I have no confidence in his analytic skill. On the other hand, my client[] likes him very much,\" id. at 4725 (Brantz).\n\nIf the district court had employed the appropriate comparative analysis by focusing on whether Wolf's articulated reason of legal analysis was a pretext, it should have reached a different result. Our review of the whole record leaves us with a \"definite and firm conviction that a mistake has been committed\" by the district court in its comparative analysis. United States Gypsum Co., 333 U.S. at 395. The record does not show that Wolf applied its partnership admission standards unequally to male and female associates, nor that diminished ability in the area of legal analysis was an improper reason for denying admission.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e We sympathize with Ezold's situation and the long hours and efforts she put toward her partnership goal. On the record before us, however, we cannot affirm the district court's finding that Wolf's asserted reason for denying Ezold's admission to the partnership was unworthy of credence based on her theory that its standard of legal analytic ability was applied to her in an unlawfully discriminatory manner.\n\nBecause the evaluation files contain insufficient evidence to show that Ezold was evaluated more severely than the male associates, Ezold has not shown that Wolf's proffered reason for failing to promote her was \"unworthy of credence.\" We therefore hold that the district court's ultimate finding of pretext cannot be sustained on this basis.\n\nIX.\n\nWe must, however, still consider certain additional evidence which Ezold says directly establishes that Wolf's articulated reason was a pretext by showing that a discriminatory reason more likely motivated its decision not to admit her to the partnership.\n\nAs stated at the outset of our pretext analysis, sufficiently strong evidence of an employer's past treatment of a plaintiff may prove pretext. See Patterson, 491 U.S. at 188; McDonnell Douglas, 411 U.S. at 804. An employer's general policy and practice with regard to minority employment may also establish pretext. McDonnell Douglas, 411 U.S. at 804-05. The district court held that four instances of conduct \"supported\" the finding of pretext that it otherwise based on its comparison of Ezold with Associates A-H. The four instances of conduct by Wolf that the district court held supported its finding of pretext were: (1) Ezold was evaluated negatively for being too involved with women's issues in the firm; (2) a male associate's sexual harassment of female employees at the firm was seen as \"insignificant\"; (3) Ezold was evaluated negatively for being very demanding while male associates were evaluated negatively for lacking assertiveness; and (4) Ezold \"was the target of several comments demonstrating [Wolf's] differential treatment of her because she is a woman.\" Ezold I, 751 F. Supp. at 1192 (COL 12). They are discussed in Part IX C. infra. In addition, it made findings of fact concerning Wolf's assignment process that Ezold claims support its finding of pretext. We discuss that contention in Part IX A. Ezold's contention that the ratio of male to female partners at Wolf shows a pattern of illegal discrimination is the subject of Part IX B. Finally, Ezold points to other evidence in the record, upon which the district court made no findings, as evidence that shows Wolf's asserted reason for passing her over was pretextual. She contends that this evidence, considered as a whole, would entitle the district court to find that Wolf \"more likely\" denied her admission to the partnership because of her sex than because of Wolf's asserted legitimate non-discriminatory reason. See Burdine, 450 U.S. at 256. That evidence is the subject of Discussion in Part IX D.\n\nIn order to succeed on this theory, Ezold must show that it is more likely that the firm denied her a partnership position because of her sex than because of its perceptions of her legal analytic ability. With this causal requirement in mind, we will analyze each of the incidents or practices at Wolf which Ezold alleges shows directly that Wolf passed her over because she is a woman rather than because of any deficiency Wolf might have perceived in her legal ability.\n\nA.\n\nEzold contends illegal discriminatory treatment based on sex deprived her of equal opportunities to work on significant cases or with a wide variety of partners and that this unequal treatment is evidence of gender discrimination. From 1983 to 1987, Kurland was responsible for the assignment of work to associates in the litigation department. He often delegated this responsibility to Arbittier. Though Ezold acknowledges that many partners bypassed the formal assignment procedure and directly assigned matters to associates, the district court found that Arbittier assigned Ezold to actions that were \"small\" by Wolf standards. Ezold I, 751 F. Supp. at 1178 (FOF 24).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Ezold complained to Kurland and others about the quality of her assignments and that she had opportunities to work only with a limited number of partners.\n\nThis Court has recognized that when an employer discriminatorily denies training and support, the employer may not then disfavor the plaintiff because her performance is affected by the lack of opportunity. Jackson v. University of Pittsburgh, 826 F.2d 230, 235 (3d Cir. 1987), cert. denied, 484 U.S. 1020, 98 L. Ed. 2d 680, 108 S. Ct. 732 (1988); EEOC v. Hay Assocs., 545 F. Supp. 1064, 1072 (E.D. Pa. 1982). Even if we assume that Ezold received \"small\" cases at the beginning of her tenure at Wolf, however, there is no evidence this was the result of sex discrimination. Her evaluations indicate, rather, that it may have been her academic credentials that contributed to her receipt of less complex assignments. For example, Davis stated that \"the Home Unity case was the first really fair test for Nancy. I believe that her background relegated her to . . . matters (where she got virtually no testing by Wolf, Block standards) and small matters.\" App. at 3514. It is undisputed that Arbittier opposed hiring Ezold because of her academic history and lack of law review experience. In one of Ezold's early evaluations, Kurland wrote: \"She has not, in my view, been getting sufficiently difficult matters to handle because she is not the Harvard Law Review type. . . . We must make an effort to give her more difficult matters to handle.\" Id. at 3400. He also stated: \"I envisioned . . . her when I hired her as a 'good, stand-up, effective courtroom lawyer.'\" Id. at 3348. In urging the Executive Committee to reconsider Ezold's candidacy Magarity wrote:\n\n[The] perception [that she is not able to handle complex cases] appears to be a product of how Sy Kurland viewed Nancy's role when she was initially hired. For the first few years Sy would only assign Nancy to non-complex matters, yet, at evaluation time, Sy, and some other partners, would qualify their evaluations by saying that Nancy does not work on complex matters. Nancy was literally trapped in a Catch 22. The Chairman of the Litigation Department would not assign her to complex cases, yet she received negative evaluations for not working on complex matters.\n\nId. at 5576-77.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nWhile it would be unfortunate if these academic and intellectual biases were perpetuated after the decision was made to hire Ezold, academic or intellectual bias is not evidence of sex discrimination. The district court made no finding that Ezold was given small assignments because of her sex. In fact, its findings contradict unlawful discrimination in that respect. It found:\n\nShe worked for partners in the Litigation Department on criminal matters, insurance cases, general commercial litigation and other areas, and also did work for some partners in other departments. She handled matters at all stages of litigation, and was called upon by partners to go to court on an emergency basis.\n\nEzold I, 751 F. Supp. at 1178 (FOF 22). At trial Ezold characterized many of the cases she worked on as \"complex\" by either her standards or Wolf standards. In advocating Ezold for partner, Magarity stated that \"from 1986 through the present, Nancy has worked on numerous significant complex cases.\" App. at 5577.\n\nThe district court found that when Ezold suggested to Schwartz in her early years at Wolf that an unfairness in case assignments may have occurred because she was a woman, Schwartz replied: \"Nancy, don't say that around here. They don't want to hear it. Just do your job and do well.\" Ezold I, 751 F. Supp. at 1188 (FOF 127); App. at 657. This statement, made years before the 1988 decision to deny Ezold partnership, does not show that Wolf's evaluation of her legal ability was pretextual. Ezold's testimony that she \"didn't know of any other reason\" than gender for Wolf's treatment of her in the assignment process adds little.\n\nEzold also points to a preliminary injunction matter early in her career that was reassigned to a man after she had been the sole volunteer. The district court found that Arbittier reassigned the injunction to a man \"without explanation.\" See 751 F. Supp. at 1178 (FOF 29). Arbittier, however, testified that he realized the case needed a more senior associate and so reassigned it. This too occurred early in Ezold's employment at Wolf and there is nothing in the record to show that it had any connection with Ezold's failure to attain partnership. The district court's finding does not support a Conclusion that Wolf's reason for denying Ezold admission to the partnership is pretextual.\n\nThe district court also found that when Ezold first got to the firm in 1983, she and a male associate not on partnership track were assigned to sort out a large group of minor cases previously handled by an associate who had left the firm. This finding fails to support the district court's ultimate finding of pretext. The assignment was made on an as-needed basis to fill the void created when the associate working on the matters had left. Additionally, the district court failed to recognize that Arbittier gave Ezold full authority to reassign the matters to other male associates and administer the whole affair. The small bankruptcy matters to which the district court refers were later reassigned by Kurland at Ezold's request. Kurland testified that he did this \"both to free Nancy up a little and to give some demonstration that we [were] making an effort to change the nature of her assignments.\" App. at 3375.\n\nConcerns about associates being exposed only to \"small\" matters were not unique to Ezold. In fact, numerous partners expressed similar concerns about exposure to partners and assignment to complex cases with respect to male Associates A and B. See App. at 4920 (\"The Department should try to give A some assignments as second man on a large case. . . . If we fail to do this, [A] will continue to slip along operating independently on cases and we will have to confront, too late, the question of whether or not he meets partnership standards.\"); id. at 4324 (\"[A] has not been tested on large matters because of early perceptions that he was cavalier.\"); id. at 4928 (B must get broader exposure); id. at 4926 (\"somehow [B] must get broader exposure--even his Dep't. Chairman knows nothing about him.\"). Ezold's assignment to a disproportionate number of small matters may have reflected academic or intellectual bias. Beyond her own perceptions, however, Ezold offered no evidence showing that she was treated differently from male associates in getting assignments or exposure. The findings of the district court concerning Wolf's assignment process are in fact gender-neutral and do not support its ultimate finding of pretext.\n\nWith respect to the district court's finding that the firm prevented Ezold from gaining wide exposure to partners, the record shows that sixty-five partners expressed \"no opinion\" on the admission of Associate B, a litigator, which was more than the fifty-nine \"no opinion\" votes Ezold received. Fifty-nine partners also expressed \"no opinion\" on the admission of Associate H.\n\nThe district court's finding that Ezold did not work for more than five hundred hours in any year on any one matter, while \"virtually all the male associates in the department\" worked for six hundred hours on a single matter, is belied by the record. Ezold I, 751 F. Supp. at 1178 (FOF 27). The record shows that Ezold billed 701.2 hours on a major litigation matter in 1985 and that a majority of male associates in the litigation department did not bill six hundred hours or more on any single matter.\n\nFinally, the district court found that by allowing partners to bypass the formal assignment system, Kurland and Arbittier \"prevented the plaintiff from securing improved assignments . . . [and] impaired her opportunity to be fairly evaluated for partnership.\" Ezold I, 751 F. Supp. at 1179 (FOF 38, 40). The fact that Wolf's formal assignment process was often bypassed does not support the district court's finding of pretext.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Title VII requires employers to avoid certain prohibited types of invidious discrimination, including sex discrimination. It does not require employers to treat all employees fairly, closely monitor their progress and insure them every opportunity for advancement. \"Our task is not to assess the overall fairness of [Wolf's] actions.\" Logue, 837 F.2d at 155 n.5. It is a sad fact of life in the working world that employees of ability are sometimes overlooked for promotion. Large law firms are not immune from unfairness in this imperfect world. The law limits its protection against that unfairness to cases of invidious illegal discrimination. This record contains no evidence that Wolf's assignment process was tainted by a discriminatory motive.\n\nB.\n\nEzold also tries to reinforce her claim of pretext by pointing to the small number of women admitted to the partnership throughout the firm's history. The record shows that in 1989, only five of Wolf's 107 partners were women and there was only one woman among the twenty-eight partners in the litigation department in which Ezold had sought partnership. The district court made no finding based upon these numbers.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nStatistical evidence of an employer's pattern and practice with respect to minority employment may be relevant to a showing of pretext. See McDonnell Douglas, 411 U.S. at 805. Ezold's raw numerical comparisons, however, are not accompanied by any analysis of either the qualified applicant pool or the flow of qualified candidates over a relevant time period. The district court in Hopkins recognized the weakness of this type of evidence:\n\n[Plaintiff's] proof lacked sufficient data on the number of qualified women available for partnership and failed to take into account that the present pool of partners have been selected over a long span of years during which the pool of available qualified women has changed. Women have only recently entered the accounting and related fields in large numbers and there is evidence that many potential women partners were hired away from Price Waterhouse by clients and rival accounting firms.\n\nHopkins, 618 F. Supp. at 1116; cf. Wards Cove Packing Co. v. Atonio, 490 U.S. 642, 650-51, 104 L. Ed. 2d 733, 109 S. Ct. 2115 (1989) (in disparate impact case, proper comparison is between racial composition of at-issue jobs and racial composition of qualified population in relevant job market).\n\nBecause no Conclusion can be drawn from Ezold's raw numbers on underrepresentation, they are not probative of Wolf's alleged discriminatory motive. See Villanueva, 930 F.2d at 131 (statistics showing small percentage of minority faculty members inadequate absent some other indication of relevance); Molthan, 778 F.2d at 963 (\"Because the considerations affecting promotion decisions may differ greatly from one department to another, statistical evidence of a general underrepresentation of women in the position of full professor adds little to a disparate treatment claim\"). We, like the district court, do not consider them material to Ezold's Title VII claim.\n\nC.\n\nFinally, the district court held that the four specific instances of conduct mentioned on typescript supra at 75 evidenced a discriminatory animus and supported its finding of pretext. See Ezold I, 751 F. Supp. at 1192 (COL 12). It did not hold that these instances of conduct provided an independent or alternative basis for its finding, but viewed them only as support therefor.\n\n1.\n\nThe first instance of conduct on which the district court relied was that Ezold \"was evaluated negatively for being too involved with women's issues . . . specifically her concern about the [firm's] treatment of paralegals,\" while Fiebach was not reproached for raising the \"women's issue\" of part-time employment. Id. Ezold's perception was that the firm mistreated its paralegals by overworking and underpaying them and that treatment would not have occurred but for the fact that they were predominantly women. The court's finding on this matter refers to a 1986 evaluation submitted by Schwartz, one of Ezold's partnership supporters, in which he wrote: \"Judgment is better, although it still can be clouded by over-sensitivity to what she misperceives as 'womens' [sic] issues.\" App. at 3366. Schwartz testified, however, that he was not criticizing Ezold for raising the issue of the firm's treatment of paralegals, but for her misperception that this was a \"women's issue.\" Id. at 1585-86. Moreover, the fact that Fiebach, a male partner, was not criticized for encouraging Discussion of part-time employment is not probative of whether the partnership decision concerning Ezold was gender-based. This evidence is of marginal value in supporting the district court's finding of pretext.\n\n2.\n\nThe second instance of conduct on which the district court relied was \"the fact that a male associate['s] sexual harassment of female employees at the Firm was seen as insignificant and not worthy of mention to the Associates Committee in its consideration of that male associate for partnership.\" Ezold I, 751 F. Supp. at 1192 (COL 12). While it is undisputed that the male associate, Associate X, engaged in some form of harassment of female employees, the district court's finding about Wolf's attitude towards it is unsupported by the evidence and thus clearly erroneous. The record shows that Strogatz, then Chairman of the Associates Committee, met with Associate X concerning these incidents, and that a memorandum was placed in his personnel file. There was testimony that the incident was reported to the associate's department chairman and to the Associates Committee. The record also indicates that the incident occurred after the Associates Committee decided it was unlikely to recommend Associate X for partnership in any event. There is no evidence Wolf viewed the incident as \"insignificant.\" This incident is not evidence that the firm harbored a discriminatory animus against either women generally or Ezold specifically. It lends no support to the district court's finding of pretext.\n\n3.\n\nThe district court found that Ezold was \"evaluated negatively for being 'very demanding,' while several male associates who were made partners were evaluated negatively for lacking sufficient assertiveness in their demeanors.\" Ezold I, 751 F. Supp. at 1192 (COL 12) (emphasis in original). The criticisms of Ezold's assertiveness related to the way in which she handled administrative matters such as office and secretarial space, and not legal matters. See App. at 2206-11 (\"Very difficult to deal with on administrative matters. Very demanding.\"); see also id. at 3365, 3389. In particular, David Hofstein's evaluation of Ezold in 1984 stated:\n\nMy one negative experience did not involve legal work. When my group moved to the south end of the 21st floor, Nancy had a fit because she had to move. As I. Strogatz and our [Office Manager] know, Nancy's behavior was inappropriate and I think affected everyone's perception of her. Dealing with administrative matters professionally is almost as important as dealing with legal matters competently, and at least in that instance, Nancy blew it.\n\nApp. at 3393.\n\nThe district court refers to criticisms of male associates for lacking assertiveness, but in connection with their handling of legal matters. The district court was comparing apples and oranges. The record shows that male associates were also criticized for their improper handling of administrative problems. See App. at 3388 (\"He has had a series of run ins with administration . . . .\"); id. at 5099 (associate not admitted to partnership criticized for \"lack of tact, being arrogant or undiplomatic or unconciliatory); id. at 4778 (\"he is quarrelsome\"). The district court also quotes an evaluation of Ezold as a \"prima donna\" on administrative matters, but leaves out the full context of the statement which compares her to a male associate: \"Reminds me of [a male associate]--very demanding, prima donna-ish, not a team player.\" Id. at 3209.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe district court's finding that this evidence supports its Conclusion that Ezold was treated differently because of her gender is clearly erroneous. An \"unfortunate and destructive conflict of personalities does not establish sexual discrimination.\" Bellissimo, 764 F.2d 175, 182 (3d Cir. 1985). Further, by the time of Ezold's final evaluation in 1988, there was no mention of her attitude on administrative matters. Rosoff testified that in independently reviewing the Associate Committee's decision not to recommend Ezold for partnership, he disregarded the criticisms of her handling of administrative matters from earlier years as \"ancient history.\" App. at 2410. There is again no evidence that this incident played any role in Wolf's decision to deny Ezold's admission to the partnership.\n\n4.\n\nFinally, the district court found that Ezold was the target of several comments demonstrating the firm's differential treatment of women. The district court found the following:\n\nDuring the selection process . . . Mr. Kurland told Ms. Ezold that it would not be easy for her at Wolf, Block because she did not fit the Wolf, Block mold since she was a woman, had not attended an Ivy League law school, and had not been on law review. Mr. Kurland and Ms. Ezold stated that at one of the meetings with Ms. Ezold, only Ms. Ezold and he were present.\n\nSee Ezold I, 751 F. Supp. at 1177 (FOF 18). Ezold did not raise this reference at a subsequent lunch with associate Liebenberg, a woman, and Schwartz, nor did she express concern over Wolf's treatment of women. Although Kurland denied making the statement, the district court resolved this credibility issue in Ezold's favor and we will not disturb it.\n\nWolf argues that this comment made in 1983 before Ezold accepted the job is not probative on whether its partnership decision five years later was gender-based. In Roebuck v. Drexel University, 852 F.2d at 733, the plaintiff alleged racial discrimination in the denial of tenure and we considered the probative value of evidence of a discriminatory attitude on the part of a key decisionmaker. There, the president of the university exercised a significant influence on the decisionmakers and had made the final tenure decision. He had also made two statements reflecting racial bias. Id. We held, although the \"statements standing alone, occurring as they did over five years before the final denial of tenure, could not suffice to uphold a finding [of discrimination], they do add support, in combination with the other evidence, to the ultimate Conclusion.\" Id. ; see Jackson v. Harvard Univ., 721 F. Supp. 1397, 1431 n.24 (D. Mass. 1989) (alleged derogatory comments made to plaintiff by dean before she began teaching \"were made well before the plaintiff's tenure review process began and are manifestly too remote from the tenure decision-making process to have any relevance in this action\"), aff'd, 900 F.2d 464 (1st Cir.), cert. denied, , 498 U.S. 848, 112 L. Ed. 2d 104, 111 S. Ct. 137 (1990). Here, however, as we have painstakingly pointed out, other evidence of sex discrimination is lacking. In any event, Kurland made this comment before Ezold began her employment at Wolf, five years before the partnership decision. The comment's temporal distance from the decision Ezold says was discriminatory convinces us it is too remote and isolated to show independently that unlawful discrimination, rather than Wolf's asserted reason, more likely caused the firm to deny Ezold the partnership she sought in 1988.\n\nKurland himself had left the firm in January 1988, before Ezold's 1988 evaluation and before the Associates Committee and the Executive Committee denied her admission to the partnership. Thus, he did not take part in the final decision to deny Ezold's admission to the partnership, although he had consistently supported her candidacy despite his recognition of other partners' perceptions about her legal analytical ability. See Ezold I, 751 F. Supp. at 1182 (FOF 62) (\"I think she has proven her case.\"). Stray remarks by non-decisionmakers or by decisionmakers unrelated to the decision process are rarely given great weight, particularly if they were made temporally remote from the date of decision. See Hopkins, 490 U.S. at 277 (O'Connor, J., Concurring); Frieze, 950 F.2d at 541; Guthrie v. Tifco Indus., 941 F.2d 374, 378-79 (5th Cir. 1991), cert. denied, 112 S. Ct. 1267 (1992). We decline to depart from this principle in the present case.\n\nD.\n\nIn her brief on appeal, Ezold points to several other alleged sexist comments by Kurland to which she testified at trial but upon which the district court made no findings. Thus, the remaining issue on sufficiency is whether all of the sexist comments Ezold attributes to Kurland, taken together, are enough to establish pretext. Ezold testified that at the close of a litigation department dinner, Kurland singled her out for interrogation on the issue of sex discrimination at the firm. Kurland testified that he addressed the topic to the entire group because he was Vice Chancellor of the Philadelphia Bar Association and everyone was discussing the issue at the time. Ezold also testified and Kurland did not deny that Kurland would give her instructions in the hallway to \"smile\" and crudely ask whether she had any romantic encounters the night before. She also testified that at a litigation associates' breakfast Kurland recounted a Judge's comments about a murder case involving the rape of a corpse. Kurland testified:\n\nI looked around at the young people and at the time I was in the middle of a murder trial and I thought, my God, my young people here, have such a narrow fragmented aspect of what law is today, interrogatories and depositions in Federal Court, dealing in money matters and they don't really have a comprehension of what happens in law, that we have a whole state court system and criminal system, that they do not even come in contact with and I thought it would be beneficial for them to broaden their horizon to give them some exposure to hear firsthand from me what it was like to be involved in an actual murder trial . . . [and that] the Judge was telling me about other cases he had . . . and he told me about this one case and I talked about a case that a man had killed a woman and had sex with her afterwards.\n\nApp. at 1756-57.\n\nEzold additionally testified that Kurland told her not to refer a talented female attorney to the firm for employment because he did not want the problems caused by another female attorney working in the litigation department. Kurland did not recall Ezold talking to him about hiring anyone but denied making the statement about women associates. Finally, Ezold points to an alleged statement by Kurland cautioning female attorneys with children from traveling on business. Kurland denied making this statement and in fact often assigned Liebenberg, a female partner who had small children, to cases requiring extensive travel.\n\nAlthough the district court made no findings that these statements were actually made or whose version of the facts it believed, we must consider them on the sufficiency issue in the light most favorable to Ezold. In doing so, we recognize that proof of a discriminatory atmosphere may be relevant in proving pretext since such evidence \"does tend to add 'color' to the employer's decisionmaking processes and to the influences behind the actions taken with respect to the individual plaintiff.\" Conway v. Electro Switch Corp., 825 F.2d 593, 597 (1st Cir. 1987). We must therefore decide whether these six alleged comments by Kurland over a period of five years are sufficient to sustain the district court's finding that Wolf's reason for denying Ezold admission to the partnership--her legal analytical ability--was just a pretext to cover up sex discrimination.\n\nIn Lockhart v. Westinghouse Credit Corp., we considered the relevance in an age discrimination case of a statement made by a corporate vice-president after the plaintiff's termination. The vice-president stated: \"[This company] was a seniority driven company with old management and that's going to change, 'I'm going to change that.'\" 879 F.2d at 54. We said:\n\nWhen a major company executive speaks, \"everybody listens\" in the corporate hierarchy, and when an executive's comments prove to be disadvantageous to a company's subsequent litigation posture, it can not compartmentalize this executive as if he had nothing more to do with company policy than the janitor or watchman.\n\nId. This case is superficially similar to Lockhart in that Kurland, as the chairman of the litigation department, was a company executive until he left the firm in 1987. It is distinguishable, however, in several material respects. The other evidence supporting the verdict in favor of the plaintiffs in Lockhart, unlike the evidence in the present case, was substantial.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e In addition, though Kurland was at one time a decisionmaker and eventually supported Ezold's admission to the partnership, he took no part in the final votes or evaluations concerning Ezold because he had by that time left the firm.\n\nThough Kurland's comments, if made, were crude and unprofessional, we do not believe they are sufficient in and of themselves to sustain the district court's judgment in favor of Ezold. They may reflect unfavorably on Kurland's personality or his views, but they are not sufficient to show that there was such a pervasive hostility toward women at Wolf sufficient to show that Ezold's partnership decision was more likely the result of discriminatory bias than Wolf's perception\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e of Ezold's legal ability. Ezold has made no claim that Kurland's comments created a hostile working environment. See Meritor Sav. Bank, FSB v. Vinson, 477 U.S. 57, 64 (1986).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e If we were to hold that several stray remarks by a nondecisionmaker over a period of five years, while inappropriate, were sufficient to prove that Wolf's associate evaluation and partnership admission process were so infected with discriminatory bias that such bias more likely motivated Wolf's promotion decision than its articulated legitimate reason, we would spill across the limits of Title VII. See Hopkins, 109 S. Ct. at 1785 (Title VII strikes a balance between protecting employees from unlawful discrimination and preserving for employers their remaining freedom of choice.).\n\nX.\n\nWe have reviewed the evidence carefully and hold that it is insufficient to show pretext. Despite Ezold's disagreement with the firm's evaluations of her abilities, and her perception that she was treated unfairly, there is no evidence of sex discrimination here. The district court's finding that Wolf's legitimate non-discriminatory reason was incredible because Ezold was evaluated more severely than male associates because of her gender, as well as its finding that Wolf's requirement that she possess analytical skills sufficient to handle complex litigation was a pretext for discrimination, are clearly erroneous and find no support in the evidence. Finally, this record also lacks sufficient evidence of discriminatory animus to sustain a finding that Wolf more likely had a discriminatory motive in denying Ezold's admission to the partnership.\n\nXI.\n\nAccordingly, we will reverse the judgment of the district court in favor of Ezold and remand for entry of judgment in favor of Wolf.\n\n\u003cspan class=\"fn\"\u003e1. Price Waterhouse v. Hopkins, 490 U.S. 228, 104 L. Ed. 2d 268, 109 S. Ct. 1775 (1989), involved an accounting firm's denial of partnership to a female accountant. That case did proceed to trial but the appellate decisions provide guidance only on the parties' burdens of proof in a mixed motives case. This case was not tried on that theory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The district court's order also stated that if its prior orders were affirmed on appeal, it would thereafter determine back pay for the period from February 1, 1991 to the date of Ezold's instatement as a partner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. There was little change beyond format in the evaluation forms used throughout Ezold's tenure. We will describe the evaluation forms in effect in 1987 and 1988, the years Ezold was a senior associate being evaluated for admission to the partnership.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. At all relevant times, Strogatz served as chairman of the Associates Committee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The evaluation form asks the reviewing partner whether he or she would like to \"supplement and/or explain [the] written evaluation in an oral interview with a member of the Associates Committee.\" See, e.g., App. at 3889, 6467.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The district court quoted Ezold's evaluations in FOF 61-71.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Because the reason Wolf articulated for denying Ezold partnership was lack of legal analytic ability, this summary includes neither positive evaluations in other categories upon which the district court made findings nor evaluations in which there was neither grade nor comment in the category of legal analysis. Many of Ezold's evaluations in other categories were highly complimentary and compared quite favorably to the partners' evaluations of male candidates for partnership in the same categories. The district court's use of these other favorable evaluations in the comparative analysis in support of its ultimate finding of pretext is discussed in Part VII of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court omitted from its findings this portion of Kurland's evaluation concerning Ezold's legal analytical ability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The district court omitted this portion of Boote's evaluation from its finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The district court omitted this comment on legal analysis from its finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Roberta Liebenberg, a female litigation partner, voted against Ezold's admission. The only Associates Committee member voting in favor of Ezold was her former neighbor, Ronald Weiner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. \"Special partners,\" in contrast to regular partners, do not have the right to vote, do not have any equity in the partnership and may be removed by the Executive Committee. In addition, the benefits provided are inferior to those of regular partners. Ezold I, 751 F. Supp. at 1177 (FOF 15).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It is not clear from the record whether such an inquiry is a matter of course in connection with negative partnership recommendations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Ezold testified that Kopp told her that she could learn the area of the law in a week. Ezold contended that the offer of a position in domestic relations, a position with allegedly less esteem in the firm, is also evidence of discrimination. The district court found this department was formerly headed by a male, and is currently headed by two male senior partners. Ezold I, 751 F. Supp. at 1190 (FOF 143). We believe this abrogates the inference of discrimination Ezold would have us draw.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. After the Associates Committee determined that it would not be recommending Ezold for partnership, it was decided not to give her the September 1988 raise given to those in her class who were promoted. Ezold's salary as a senior associate was $73,000.00. The lowest level regular partner earns between $125,000.00 and $140,000.00 a year.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This statement in Patterson is in conformity with the law that pre-existed Patterson and is not affected by the Civil Rights Act of 1991. See Rush v. McDonald's Corp., 966 F.2d 1104, 1119-20 (7th Cir. 1992) (section 101 of Civil Rights Act of 1991 overturns portion of Patterson holding that proscription of racial discrimination in making of contract under 42 U.S.C.A. § 1981 applies only to refusals to hire and promotions rising to level of opportunity for \"new and distinct relation\" between employer and employee) (quoting Patterson, 491 U.S. at 185)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Though the record indicates that perceived legal analytic ability is a necessary condition for partnership at Wolf, it, in and of itself, is not a necessary and sufficient condition. Otherwise, the remaining categories on the evaluation form would be superfluous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We recognize that the Conclusions in the statement we quote from Hopkins were made by the factfinder. Nevertheless, we think the quoted language, correctly setting forth the basis on which comparison must be made, reflects the legal standard that the district court was required to apply to the evidence before it in Ezold's case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Among the factors other than legal analytic ability that Wolf considered are \"creativity,\" \"negotiating and advocacy,\" \"attitude,\" \"ability under pressure\" and \"dedication.\" See typescript supra at 10 (listing criteria of legal performance and personal characteristics appearing on evaluation form).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. As discussed infra, the plaintiff can also prove that despite the employer's articulated reason, a discriminatory reason \"more likely\" motivated the employer's decision. Burdine, 450 U.S. at 256.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The defendant is not required to prove that those promoted are \"better qualified\" than the plaintiff. See Burdine, 450 U.S. at 258.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Ezold argues the district court appropriately declined to consider Fiebach's objections because they were gender-based. Ezold refers to an April 1988 disagreement over case strategy in the Carpenter case. The district court made a general finding that Ezold was criticized for being \"very demanding\" and was expected by some members of the Firm to be nonassertive and acquiescent to the predominantly male partnership. Her failure to accept this role was a factor which resulted in her not being promoted to partner. Ezold I, 751 F. Supp. at 1189 (FOF 132). This general finding does not permit the court to ignore Fiebach's assessment. It does, however, illustrate again that the court did not consider the whole record relating to Wolf's articulated reason for denying Ezold a partnership position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The record shows that Arbittier was a tough critic of many associates, male and female, when he felt they did not measure up to Wolf's standards on analytic ability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The most damning motive that these comments reveal is lack of confidence based on academic credentials. This is a far cry from sex discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The district court's findings recited these comments. See FOF 76-86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Ezold did receive one \"distinguished/good\" from Stephen Goodman, who had substantial contact with her, in May 1987. In addition, she received a \"distinguished\" in legal analysis in 1983 and 1984 from Bean and in 1985 from Magarity. Wolf contended that one of the factors taken into account by the Associates Committee was whether a partner had a reputation as an especially hard or easy grader. There is strong evidence supporting Wolf's contention that Magarity was an \"easy grader\". The record is full of glowing memos that he wrote on behalf of male associates, including Associates A and B. See App. at 5126, 5128.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The 1988 bottom line memos on Ezold and A were both prepared by Block. His summary of both of their legal analysis grades was \"good.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The record also shows that A had stronger support from the partners within the litigation department than Ezold did. In 1988, of the twenty-eight partners in the litigation department, thirteen partners viewed A's admission \"with favor\" and three \"with enthusiasm\"; only two partners had mixed emotions and only one viewed his admission negatively. Ezold, on the other hand, had much less support from the litigation department partners. Only five partners viewed Ezold's admission \"with favor\" and only three \"with enthusiasm\"; four partners had mixed emotions and three viewed her admission negatively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The district court's findings concerning the evaluations of the other associates with whom it compared Ezold are found in FOF 87-118.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Of the twenty-eight partners in the corporate department, nine partners viewed F's admission \"with favor,\" two \"with enthusiasm,\" and one negatively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Wolf contends additionally that the district court erred in its post-trial decision to exclude from evidence the evaluation files of three successful female partnership. Assuming, without deciding, that these files were relevant, we note the district court did not exclude them on grounds of relevancy. Rather, when they were offered on redirect, it ruled they were \"beyond the scope\" that could have been anticipated on direct examination and were not proper redirect. In any event, in view of our Disposition we need not resolve this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The district court's complete findings concerning Wolf's assignment process as it related to Ezold are found in FOF 21-40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Magarity also testified that he saw nothing in Ezold's evaluations indicating any bias against her because of her gender.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Ezold did not complain when she benefitted from the informal assignment process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The district court failed to do so despite Ezold's proposed finding on the issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The district court made no finding concerning another incident involving Ezold. In that respect, the record indicates that Ezold was chastised for her handling of a request to reassign a case. Kurland had told Ezold that she should not handle any more small cases so she could free herself up for more substantial matters. He said that if she was assigned small cases she should come to him about reassignment. When Arbittier sent her the file in a simple bankruptcy case she sent it back with a note asking that it be reassigned. The record indicates that Ezold was criticized for just sending the file back with a note instead of talking to someone first. There is, however, no mention of this incident in any of Ezold's evaluations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. In Lockhart, there was sufficient indirect evidence to support the jury's verdict that age was the determinative factor in Lockhart's discharge. This evidence included: (1) Lockhart had received satisfactory performance evaluations and merit salary increases in each year over his twenty-two year career with the company; (2) he had never received a reprimand or demotion; (3) the alleged reason for his discharge was discrepancies found in an audit of his office, however, he was never given an opportunity to explain these discrepancies prior to his termination; (4) his immediate supervisor testified that he was a good and dependable worker and that the standard company policy was to proceed through a series of reprimands before an employee would be dismissed; (5) the second person responsible for his termination also testified that Lockhart was never insubordinate and never deliberately violated company policy; and (6) there was evidence that the company had decided to undertake a major restructuring which resulted in the consolidation of several locations and the filling of new management positions by much younger and inexperienced individuals. 879 F.2d at 49-50.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. It bears repeating in this final stage of Discussion that Wolf's impression of Ezold's legal analytic ability, informed but at the same time subjective, is the focal point in this case and that Wolf is entitled to form its own subjective judgment on that factor. Wolf is also entitled to be wrong in its judgment so long as it does not base its incorrect decision on unlawful sex discrimination or stereotype.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. For hostile environment to be actionable under Meritor, it must be sufficiently severe or pervasive to alter the conditions of [the plaintiff's] employment and create an abusive working environment.\" Id. at 67 (quotation omitted); see also Rogers v. EEOC, 454 F.2d 234, 238 (5th Cir. 1971) (\"mere utterance of an ethnic or racial epithet which engenders offensive feelings in an employee\" would not sufficiently affect conditions of employment to violate Title VII), cert. denied, 406 U.S. 957, 32 L. Ed. 2d 343, 92 S. Ct. 2058 (1972); Fox v. Ravinia Club, Inc., 761 F. Supp. 797, 801 (N.D. Ga. 1991) (evidence of casual atmosphere and loose conversation that sometimes had sexual connotations or implications insufficient to prove hostile working environment).\u003c/span\u003e\n\n",
    "body_length": 146111,
    "citedas": [
      "983 F.2d 509"
    ],
    "attorneys": "Judith P. Vladeck, Esquire (Argued), Vladeck, Waldman, Elias \u0026 Engelhard, P.C., Suite 800, 1501 Broadway, New York, NY 10036, Attorney for Nancy O'Mara Ezold. Arlin M. Adams, Esquire (Argued), Schnader, Harrison, Segal \u0026 Lewis, Suite 3600, 1600 Market Street, Philadelphia, PA 19103 and Mark S. Dichter, Esquire, Morgan, Lewis \u0026 Bockius, 2000 One Logan Square, Philadelphia, PA 19103, Attorneys for Wolf, Block, Schorr and Solis-Cohen. Linda J. Wharton, Esquire, Carol E. Tracy, Esquire, Judith L. Riddle, Esquire, Women's Law Project, Suite 401, 125 South Ninth Street, Philadelphia, PA 19107 and Pamela L. Perry, Esquire, Rutgers School of Law, Fifth and Penn Streets, Camden, NJ 08102, Attorneys for Amici Curiae Women's Law Project; National Bar Association, Women Lawyers Division, Philadelphia Chapter; National Association of Black Women Attorneys; Hispanic Bar Association of Pennsylvania; New Jersey Women Lawyers Association; San Francisco Women Lawyers' Alliance; Pennsylvania National Organization for Women; Women's Alliance for Job Equity; American Association of University Women, Pennsylvania Division; American Association of University Women; AAUW Legal Advocacy Fund; Business and Professional Women/USA; Center for Women Policy Studies; National Association of Commissions for Women; National Association of Female Executives; National Organization for Women; National Women's Law Center; NOW Legal Defense and Education Fund; Women Employed; Women's Legal Defense Fund; Employment Law Center; California Women's Law Center; Equal Rights Advocates, Inc.; Northeast Women's Law Center; and Women and Employment, Inc..",
    "category": [
      "128"
    ],
    "judges": "Present: Hutchinson, Cowen and Seitz, Circuit Judges.",
    "citation_count": 852
  }
}
