{
  "id": "P4C7PWYBTlTomsSBO6wh",
  "document": {
    "title": "United States v. Nelson",
    "full_title": "UNITED STATES OF AMERICA v. LEMRICK NELSON, JR. AND CHARLES PRICE, ALSO KNOWN AS BALD BLACK MAN .",
    "jurisdiction": "Second Circuit",
    "date": "2002-01-07T00:00:00.000Z",
    "docket": "Docket Nos. 98-1231 \u0026 98-1437",
    "body": "Argued: Wednesday May 3, 2000\n\nSupplemental Argument: Tuesday January 9, 2001\n\nDefendants appeal their convictions and sentences, following a jury trial, for violating 18 U.S.C. § 245(b)(2)(B). Defendants argue first that § 245(b)(2)(B) is unconstitutional, and that even if the statute is valid their convictions under it are not. We conclude that § 245(b)(2)(B) is constitutional and that the evidence presented at trial is sufficient to support defendants' convictions under the statute. Accordingly, we reject defendants' contention that we should order the district court to enter a judgment of acquittal. Defendants further argue that the district court committed reversible error in empaneling the jury that convicted them. We accept defendants' argument in this connection and therefore VACATE the verdict of conviction and REMAND the case to the district court for a new trial before a properly selected, impartial jury.\n\nLemrick Nelson, Jr. (\"Nelson\") and Charles Price (\"Price\") appeal their convictions and sentences, under 18 U.S.C. § 245(b)(2)(B) for willfully injuring, intimidating, and interfering with Yankel Rosenbaum (\"Rosenbaum\"), by force and threat of force, because of Rosenbaum's Jewish religion and because Rosenbaum was enjoying use of a Brooklyn city street. Nelson's and Price's primary contentions on appeal are (a) that § 245(b)(2)(B), as applied to them, is unconstitutional because it reaches conduct that lies beyond Congress's powers of regulation, (b) that the evidence presented at trial was in any event insufficient to support the finding that they had the intent § 245(b)(2)(B) requires, and (c) that the district court's open manipulation of the jury selection process to secure a racially and religiously balanced jury resulted in the empaneling of a biased juror and was unconstitutional. In addition, Nelson and Price present several more discrete claims, involving (a) double jeopardy (for Nelson only), (b) aiding and abetting liability (for Price only), and (c) evidentiary rulings, jury instructions, and sentencing decisions of the district court. We conclude that § 245(b)(2)(B) is constitutional as applied to Nelson and Price and that the evidence was sufficient to show that the defendants had the two-fold intent which that statute requires. Nevertheless, we also conclude that the district court committed reversible error in empaneling the jury. Accordingly, we vacate Nelson and Price's convictions and remand the case for a new trial before a properly chosen jury. We do not, given this disposition, decide most of Nelson's and Price's more discrete contentions. We do, however, affirm with respect to Nelson's claims concerning double jeopardy and Price's claims concerning aiding and abetting liability.\n\nI. BACKGROUND\n\nShortly after eight o'clock in the evening on August 19, 1991, a station wagon struck two children in the Crown Heights area of Brooklyn, New York. The driver of the car was Jewish, and both children were African American. A crowd soon gathered at the scene of the accident. As some of its members attempted to aid the injured children, others began to attack the driver of the car.\n\nThe first ambulance to reach the scene was from a Jewish hospital and was readily identifiable as such by Hebrew writing on its sides. The driver of the car that had hit the children was treated by personnel from this ambulance, and, at the direction of police officers who had arrived, the ambulance quickly left the scene in order to protect the injured Jewish driver from the angry crowd. Shortly after the ambulance from the Jewish hospital departed, two New York City ambulances arrived at the accident site. Their crews gave medical assistance to the two injured African-American children, and took them to the hospital. Both children had been seriously hurt; one ultimately died.\n\nIn the meantime, a crowd of several hundred people (watched over by between seventy and one hundred police officers) had formed in the neighborhood of the accident. Some members of the crowd complained about Jews and the preferential treatment that Jews allegedly received. They cited, as an example of this favored treatment, the fact that the Jewish driver had received medical attention before the African-American children even though the children were more seriously injured. Some members of the crowd began to throw objects.\n\nAt about eleven o'clock, a bald, African-American man later identified as defendant Price began addressing the crowd. Price's speech, which was captured on two videotapes (one made by an NBC cameraman covering the incident and the other made by the superintendent of a nearby building), was angry and aggressive and included, according to police and civilian witnesses, the following statements: \"[I]f it was a black man that did this they would have been gone to jail instead of being pulled inside of an ambulance for safekeeping.\" (Trial Tr. (\"Tr.\") 1573).\n\n\"We can't take this anymore. They're killing our children. The Jews get everything they want. The police are protecting them.\" (Tr. 1369).\n\n\"What are we going to do about this? Are we going to take this anymore?\" (Tr. 1143).\n\n\"Let's get the Jews\" and \"Eye for an eye. No justice no peace.\" (Tr. 1692).\n\nIn response to Price's exhortations, many people in the crowd began to yell, \"Get the Jews.\" (Tr. 1073). Toward the end of his speech, Price shouted something to the effect of \"Let's go to Kingston Avenue and get the Jews.\" \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e (Tr. 1377). Thereupon, a large part of the crowd, including Price and defendant Nelson (who had been in the crowd and had heard Price's speech) proceeded towards Kingston Avenue.\n\nWitnesses testified that prior to Price's speech, the crowd was neither unified nor particularly out of control, but that after he spoke, it became transformed into an explosive mass. It also became violent, throwing objects and setting two cars on fire, attacking a Jewish couple who may have had a baby with them, and assaulting a second Jewish man as he exited a building on Kingston Avenue. As the crowd proceeded past Kingston Avenue and onto the next block (Brooklyn Avenue), it spotted Yankel Rosenbaum (\"Rosenbaum\"), a bearded man in orthodox Jewish dress. A member of the crowd, possibly Price, yelled \"get'em\" and \"there goes one.\" (Tr. 1580, 1591). Someone else in the crowd was also heard to shout \"get the Jew, kill the Jew.\" (Tr. 1000).\n\nOn being targeted, Rosenbaum sought to escape the mob, running across Brooklyn Avenue and then across President Street. The crowd, however, caught up with him. A group of between ten and fifteen people, including Nelson, then began beating him, knocking him to the ground, and striking him repeatedly. Eventually, a police car approached the scene, causing the attacking group to scatter. Nelson attempted to flee with the rest of the crowd, but (according to an admission Nelson made to his girlfriend Travionne Shaw (\"Shaw\")) Rosenbaum grabbed hold of Nelson's T-shirt and prevented him from making good his escape. After trying unsuccessfully, by other means, to induce Rosenbaum to let him go, Nelson (again according to the admission made to Shaw) stabbed Rosenbaum and fled.\n\nNelson was seen running away by the police and was subsequently caught; when searched, he was found to have a bloody knife in his possession. Although Nelson initially denied committing the stabbing, Rosenbaum, (before going to the hospital) identified Nelson out of a lineup of four African-American males, and angrily asked him \"[w]hy did you stab me?\" (Tr. 1169). Testing conducted later, moreover, revealed that the blood on the knife found on Nelson (and also blood found on Nelson's trouser pocket) matched Rosenbaum's DNA and was inconsistent with Nelson's own DNA. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAfter receiving what the government concedes was inadequate medical care, Rosenbaum died from the stab-wounds he had sustained. Nelson was thereupon tried in New York State court on a variety of charges, including second degree murder in connection with the death of Rosenbaum. In October 1992, a jury acquitted Nelson of all charges.\n\nFollowing Nelson's acquittal in New York State court, Nelson and Price (collectively the \"defendants\") were indicted on federal charges. Nelson was charged with violating 18 U.S.C. § 245, which states, in pertinent part, that:\n\nWhoever, whether or not acting under color of law, by force or threat of force willfully injures, intimidates or interferes with, or attempts to injure, intimidate or interfere with--\n\n(2) any person because of his race, color, religion or national origin and because he is or has been--\n\n(B) participating in or enjoying any benefit, service, privilege, program, facility or activity provided or administered by any State or subdivision thereof;\n\nshall be fined under this title, or imprisoned not more than one year, or both; and if bodily injury results from the acts committed in violation of this section or if such acts include the use, attempted use, or threatened use of a dangerous weapon, explosives, or fire shall be fined under this title, or imprisoned not more than ten years, or both; and if death results from the acts committed in violation of this section or if such acts include kidnapping or an attempt to kidnap, aggravated sexual abuse or an attempt to commit aggravated sexual abuse, or an attempt to kill, shall be fined under this title or imprisoned for any term of years or for life, or both, or may be sentenced to death. 18 U.S.C. § 245(b)(2)(B). Price was charged both with violating § 245(b)(2)(B) directly and with aiding and abetting Nelson's violation of § 245(b)(2)(B), in violation of 18 U.S.C. § 2.\n\nThe federal indictment against Nelson and Price principally alleged that the defendants\n\nby force and threat of force did willfully injure, intimidate and interfere with, and attempt to injure, intimidate and interfere with, Yankel Rosenbaum, an Orthodox Jew, because of his religion and because he was enjoying facilities provided and administered by a subdivision of the State of New York, namely, the public streets provided and administered by the City of New York, and bodily injury to and the death of Yankel Rosenbaum did result. Superceding Indictment filed Aug. 14, 1996, at 1.\n\nThe defendants filed pre-trial motions to dismiss the indictment against them on several grounds. The district court denied these motions, and the case went to trial before a jury.\n\nFrom the outset of the trial, the district court (Trager, J.), no doubt responding to the politically charged nature of the case and to the controversial State court acquittal of Nelson, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e made clear his intention to empanel \"a moral jury that renders a verdict that has moral integrity.\" (Tr. 627). The district court stated that \"[t]his trial is occurring for the same reason Rodney King's trial occurred, the second trial, because the first jury did not represent the community.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e (Tr. 628). The court relatedly and repeatedly expressed its desire to empanel a jury (and not merely begin from a venire) \"that represents this community.\" (Tr. 628). Indeed, the district court made its intentions concerning jury selection absolutely plain to the parties, stating:\n\nI have an agenda here which I have made very clear from the very beginning, to end up with a jury that represents the community that will have moral validity; and if there is a hung jury, that itself will be a statement to both sides about both what is the process and the problems are with our society. To me, justice will be served. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e (Tr. 759).\n\nIn pursuit of the aim of empaneling a religiously and racially mixed jury, the district court made three important jury selection decisions. First, the district court denied the defendants' Batson challenge to the fact that the government, even though African Americans comprised only 30% of the jury pool, used 5 out of 9, or 55 %, of its peremptory challenges to strike African-American candidates from the jury. Second, the district court denied the defendants' for-cause challenge of a Jewish juror (Juror 108) in spite of the fact that the juror had expressed grave doubts about his ability to be objective concerning the case and, when asked to \"look into [his] heart\" to determine whether he could \"give the defendant[s] here a fair trial,\" had responded \"I don't know, I honestly don't know.\" (Tr. 632). And third, when an African-American empaneled juror was excused, the district court did not simply replace this juror with the first alternate, who was white, but instead, sua sponte, removed a second (white) juror from the panel and filled the two spaces this created with an African-American juror and with the above mentioned Jewish Juror 108. Both of these jurors were selected out of order from the list of alternates in clear violation of Fed. R. Crim. P. 24(c).\n\nThe district court took these unusual steps expressly to secure an empaneled jury containing both African Americans and Jews in a racial and religious balance that the district court believed would cause the public to \"understand,\" so that \"nobody [could] complain whatever the result.\" (Tr. 866). In response, defense counsel explicitly stated that this method of jury selection \"would be agreeable to the defendants.\" (Tr. 866). Moreover, the defendants themselves consented to the proposal and did so on the record. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe jury that resulted from this process convicted both Nelson and Price. After the jury returned its verdict, Nelson moved to vacate the convictions on the grounds (a) that the evidence presented at trial was insufficient to support the verdict (specifically, to support the findings of intent on which the conviction under § 245(b)(2)(B) depends) and (b) that § 245(b)(2)(B) is unconstitutional because it reaches conduct that Congress is without authority to regulate. The district court denied the motion and proceeded to sentencing. Under § 2H1.3 (1990) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e of the United States Sentencing Guidelines, applicable to violations of 18 U.S.C. § 245, Nelson's and Price's base offense levels were \"2 plus the offense level applicable to any underlying offense.\" The district court determined that the underlying criminal conduct for both Nelson and Price was second degree murder, which carries a base offense level of 33. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e See U.S.S.G. § 2A1.2 . Accordingly (after denying several requests for downward departures), the district court sentenced Nelson principally to 235 months in prison and Price principally to 262 months in prison.\n\nBoth defendants now appeal.\n\nII. DISCUSSION\n\nWe begin our discussion by addressing the defendants' contentions concerning 18 U.S.C. § 245(b)(2)(B) and the jury selection process. Once we have decided these questions, we consider, in light of their disposition, those of the defendants' remaining claims that are still relevant and properly before us.\n\nA. 18 U.S.C. § 245(b)(2)(B).\n\nNelson and Price present three arguments with respect to § 18 U.S.C. § 245(b)(2)(B): first, and most importantly, they claim that § 245(b)(2)(B) represents, at least as applied to them, an improper exercise of congressional power beyond the authority given to the federal government by the Constitution; second, they contend that the district court failed correctly to charge, and the government failed sufficiently to prove, that they displayed the dual intent required by § 245(b)(2)(B); and third, the defendants assert that § 245(b)(2)(B) is inapplicable to their case because the Brooklyn city street on which Rosenbaum was assaulted does not constitute a state or local \"facility\" within the meaning of the statute. We take up each argument in turn.\n\n1. The Constitutionality of 18 U.S.C. § 245(b)(2)(B).\n\nIt is axiomatic that the federal government, as established under the Constitution, is a government of limited powers, so that the federal government enjoys no authority beyond what the Constitution confers, and any exercise of federal power is permissible only if it is authorized by the Constitution, as it has been amended and interpreted from time to time. See, e.g., McCulloch v. Maryland, 17 U.S. (4 Wheat.) 316, 405 (1819) (\"This government is acknowledged by all, to be one of enumerated powers.\"); Marbury v. Madison, 5 U.S. (1 Cranch) 137, 176 (1803) (\"[T]hat those limits may not be mistaken, or forgotten, the constitution is written.\"); cf. New York v. United States, 505 U.S. 144 (1992).\n\nTitle18, Section 245(b)(2)(B) of the United States Code makes it a federal crime for a person (even if acting in a purely private capacity) to injure someone else because of the victim's race or religion and because the victim was enjoying a public facility provided by any State or local government. The defendants claim that, at least if interpreted to reach their conduct in this case, the statute exceeds the powers that the Constitution grants to the federal government. The government rejects this contention and asserts that, as applied to these defendants, the statute is constitutional. At various points in this litigation, the government has argued that the grant of authority on which the constitutionality of § 245(b)(2)(B) is founded appears in Section Five of the Fourteenth Amendment, in the Commerce Clause, and in the Thirteenth Amendment.\n\nIn its supplemental briefs, however, the government expressly declines to pursue the first of these arguments, observing that the Supreme Court's recent decision in United States v. Morrison, 529 U.S. 598 (2000), an interpretation of the State Action Doctrine \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e (first articulated in United States v. Harris, 106 U.S. 629, 640 (1883), and in the Civil Rights Cases, 109 U.S. 3, 11 (1883)) poses a significant obstacle to any reading of Section Five of the Fourteenth Amendment as authorizing Congress to regulate private conduct of the kind at issue in the case at bar. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Because the government no longer presents the Fourteenth Amendment argument, and because we conclude that this argument is not necessary to sustaining the constitutionality of § 245(b)(2)(B) as applied in this case, we decline to address it. Similarly, because we determine that the Commerce Clause argument is also unnecessary to the constitutionality of this statute as here applied, we set it to one side as well. We arrive at these conclusions because we believe that § 245(b)(2)(B) falls comfortably within Congress's powers under the Thirteenth Amendment as that Amendment has authoritatively been interpreted.\n\nA. The Scope of the Thirteenth Amendment.\n\nThe Thirteenth Amendment to the United States Constitution provides:\n\nSection 1. Neither slavery nor involuntary servitude, except as a punishment for a crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.\n\nSection 2. Congress shall have power to enforce this article by appropriate legislation. U.S. Const. amend. XIII.\n\nIn the case at bar, the government asserts that this constitutional provision authorizes the application of § 245(b)(2)(B) to make a federal crime of concededly private, bias-motivated violence against a person because of that person's Jewishness and because that person was enjoying the use of a city street. In considering this contention, we focus on each of the two Sections of the Thirteenth Amendment in turn. We bear in mind, however, that much of the doctrine surrounding the Amendment implicates both sections, so that our seriatim approach is more expository than substantive.\n\nIn contrast to Section One of the Fourteenth Amendment, which famously includes the language \"No State shall . . . ,\" Section One of the Thirteenth Amendment eliminates slavery and involuntary servitude generally, and without any reference to the source of the imposition of slavery or servitude. Accordingly, it has been recognized from the Amendment's enactment that Congress's powers under the Thirteenth Amendment are not limited by any analogue to the State Action Doctrine that was early deemed to restrict the Fourteenth Amendment. The Thirteenth Amendment, unlike the Fourteenth, in and of itself reaches purely private conduct.\n\nThus it has long been settled that the Thirteenth Amendment \"is not a mere prohibition of State laws establishing or upholding slavery, but an absolute declaration that slavery or involuntary servitude shall not exist in any part of the United States.\" Civil Rights Cases, 109 U.S. at 20. And accordingly, \"[u]nder the Thirteenth Amendment the legislation, so far as necessary or proper to eradicate all forms and incidents of slavery and involuntary servitude, may be direct and primary, operating upon the acts of individuals, whether sanctioned by state legislation or not.\" Id. at 23; see also Runyon v. McCrary, 427 U.S. 160, 179 (1976) (noting that it \"has never been doubted\" that the power granted Congress by the Thirteenth Amendment \"includes the power to enact laws . . . operating upon the acts of individuals\" (quotation marks and citation omitted)); Jones v. Alfred H. Mayer Co., 392 U.S. 409, 438-39 (1968) (\"If Congress has power under the Thirteenth Amendment to eradicate conditions . . . , then no federal statute calculated to achieve that objective can be thought to exceed the constitutional power of Congress simply because it reaches beyond state action to regulate the conduct of private individuals.\"). The fact that § 245(b)(2)(B) is applied in this case to reach purely private conduct therefore does not -- regardless of what might be the rule in the context of the Fourteenth Amendment -- present any obstacle to that statute's being upheld as a proper exercise of Congress's power under the Thirteenth Amendment.\n\nAlthough the Thirteenth Amendment, which was ratified in 1865, was enacted in the historical context of American slavery, which applied almost exclusively to African Americans, the interpretation of the Amendment itself has not been so limited. The text of the Amendment nowhere identifies or otherwise singles out those whose servitude the Amendment had specifically been enacted to address. And the Supreme Court early on held that although \"negro slavery alone was in the mind of the Congress which proposed the thirteenth article, it forbids any other kind of slavery, now or hereafter,\" and would apply equally to \"Mexican peonage or the Chinese coolie labor system.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The Slaughterhouse Cases, 83 U.S. (16 Wall.) 36, 72 (1873). The Court, moreover, re-affirmed this sentiment roughly thirty years later, explaining that the Thirteenth Amendment \"is the denunciation of a condition, and not a declaration in favor of a particular people. It reaches every race and every individual, and if in any respect it commits one race to the nation, it commits every race and every individual thereof. Slavery or involuntary servitude of the Chinese, of the Italian, of the Anglo-Saxon, are as much within its compass as slavery or involuntary servitude of the African.\" Hodges v. United States, 203 U.S. 1, 16-17 (1906). There can, therefore, be no doubt that the Thirteenth Amendment's prohibitions extend, at the least, to all race-based slavery or servitude.\n\nFurthermore,\"race\" as used in Thirteenth Amendment jurisprudence is a term of art, whose meaning is not limited by today's usage. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The fact that Jews (the group to which the government seeks, through the application of § 245(b)(2)(B) against Nelson and Price, to extend the protections of the Thirteenth Amendment) are today generally not considered a distinct race, therefore, does not rule out Jews from the shelter of the Thirteenth Amendment. See, e.g., Hodges, 203 U.S. 16-17 (recognizing protection under the Thirteenth Amendment of the \"Italian\" race, among others). Indeed, the Supreme Court's case law firmly and clearly rules that Jews count as a \"race\" under certain civil rights statutes enacted pursuant to Congress's power under the Thirteenth Amendment. See St. Francis Coll. v. Al-Khazraji, 481 U.S. 604, 611 (1987); Shaare Tefila Congregation v. Cobb, 481 U.S. 615, 617-18 (1987). As we shall explain in detail, these cases not only extend the protections of Reconstruction Era civil rights statutes, now codified at 42 U.S.C. §§ 1981 and 1982, to Jews understood as a \"race,\" they also implicitly rule that the Thirteenth Amendment, the source of congressional power upon which the Court found that these statutes relied, protects Jews as a race.\n\nIn establishing this conclusion, it will be useful to begin by describing §§ 1981 and 1982. Title 42, Section 1981 of the United States Code has its origins in the Civil Rights Act of 1866, 14 Stat. 27. The section provides that \"[a]ll persons within the jurisdiction of the United States shall have the same right . . . to make and enforce contracts . . . as is enjoyed by white citizens . . . .\" 42 U.S.C. § 1981. Like the Thirteenth Amendment, the text of § 1981 does not expressly mention the race of the person benefitted by the statute, and, as it has done with the Thirteenth Amendment, the Supreme Court has construed the section to forbid any \"racial\" discrimination in the making of private as well as public contracts. See Runyon, 427 U.S. at 168, 174-75. Section 1982 similarly has its origins in the 1866 Act, and provides that \"[a]ll citizens of the United States shall have the same right . . . as is enjoyed by white citizens . . . to inherit, purchase, lease, sell, hold, and convey real and personal property.\" Once again, although the text of § 1982 does not expressly mention the race of the beneficiary of the statute's protections, the Supreme Court has construed the section to forbid public and private racially discriminatory interference with property rights. See Jones v. Alfred H. Mayer Co., 392 U.S. 409, 443 (1968). Moreover, because the Fourteenth Amendment was not ratified until 1868, both § 1981 and § 1982 must, in their initial 1866 instantiations, have been enacted pursuant to the Thirteenth Amendment, which was adopted in 1865. And, because both sections reach purely private action, it remains the Thirteenth Amendment that must continue to play a dominant role in supporting their constitutionality today. Not surprisingly, then, Runyon, and Alfred H. Mayer, upheld the constitutionality of §§ 1981 and 1982 expressly by reference to the Thirteenth Amendment. See Runyon, 427 U.S. at 179; Alfred H. Mayer, 392 U.S. at 438-39. It follows that the scope of the \"races\" protected by the Thirteenth Amendment cannot be narrower than the scope of \"races\" these statutes themselves protect.\n\nSt. Francis College and Shaare Tefila make clear that §§ 1981 and 1982 (and consequently the Thirteenth Amendment) extend to protect the Jewish \"race.\" First, in St. Francis College, the Supreme Court unanimously held that the guarantees established by 42 U.S.C. § 1981 applied to a Caucasian of Arabian ancestry. In reaching this holding, the Court conducted an extensive investigation of mid-to-late nineteenth century dictionary and encyclopedia accounts of race, which revealed that, in addition to Arabs, Finns, Basques, Norwegians, Germans, Greeks, and many others, Jews (also known as Hebrews) were considered a distinct race at the time the Thirteenth Amendment was adopted. See St. Francis Coll., 481 U.S. at 610-12 (citing to the 1858 edition of the Encyclopedia Americana, the 1863 edition of the New American Cycolp'dia, and the 1878 (Ninth) edition of the Encyclopedia Britannica). In addition, the Court looked into the legislative history of § 1981, which also revealed that the 1866 Congress considered Jews to be a distinct race. See id. at 612 (citing Cong. Globe, 39th Cong., 1st Sess. 542 (1866) (remarks of Rep. Dawson referring to the Jewish race)). This research led the Court to conclude, concerning § 1981, that Congress intended to protect from discrimination identifiable classes of persons who are subjected to intentional discrimination solely because of their ancestry or ethnic characteristics. Such discrimination is racial discrimination that Congress intended § 1981 to forbid, whether or not it would be classified as racial in terms of modern scientific theory. Id. at 613. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nMoreover, in Shaare Tefila, the Supreme Court expressly held that when 42 U.S.C. § 1982 was adopted, \"Jews constituted a group of people that Congress intended to protect,\" and that \"[i]t is evident from the legislative history of the section reviewed in Saint Francis College, a review we need not repeat here, that Jews and Arabs were among the peoples then considered to be distinct races and hence within the protection of the statute.\" Shaare Tefila, 481 U.S. at 617-18.\n\nAs noted above, these arguments apply, a fortiori, to the Thirteenth Amendment itself. For it is on the authority of the Thirteenth Amendment that the applications of these civil rights statutes developed in St. Francis College and Shaare Tefila depend. Accordingly, we find that Jews were among the \"races\" intended to be protected from slavery and involuntary servitude by the Thirteenth Amendment, and that Congress may today protect Jews pursuant to that Amendment. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nFinally, there is strong precedent to support the conclusion that the Thirteenth Amendment extends its protections to religions directly, and thus to members of the Jewish religion, without the detour through historically changing conceptions of \"race\" that we have just taken. Certainly there is nothing in the conceptual or linguistic structure of the prohibition of \"slavery\" and \"involuntary servitude\" -- which appears in the Thirteenth Amendment, it is worth noting once again, unadorned by the adjective \"racial\" -- that limits the banning of these evils only when they are imposed along racial lines. See Kozminski, 487 U.S. at 942 (\"The primary purpose of the Amendment was to abolish the institution of African slavery . . . but the Amendment was not limited to that purpose; the phrase `involuntary servitude' was intended to cover those forms of compulsory labor akin to African slavery which in practical operation would tend to produce like undesirable results.\" (internal quotation marks omitted)). The most basic feature of \"slavery\" or \"involuntary servitude\" -- the subjugation of one person to another by coercive means \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e -- remains the same regardless of whether a person is subjugated on grounds of race or for some other reason. Indeed, one need look no further than Thucydides's famous Melian Dialogue to recognize that over much of the course of human history, slavery has been imposed, without regard to race, as the policy of a conquering nation over a conquered. See Thucydides, The Peloponnesian War book v para. 85-116. Certainly religion- rather than race-based slavery is consistent with both the status of the slave and with how that condition has been imposed historically.\n\nThese conceptual and historical observations, moreover, find ample support in the case-law. To begin with, although St. Francis College casts its argument in terms of historical understandings of the meaning of the word \"race,\" the conclusion of the Court in that case -- that § 1981 and, by implication, the Thirteenth Amendment, \"protect from discrimination identifiable classes of persons who are subjected to intentional discrimination solely because of their ancestry or ethnic characteristics,\" St. Francis Coll., 481 U.S. at 613 -- reads much more broadly than it would were the opinion limiting its sweep to the historicized concept of \"race.\" Cf. Griffin, 403 U.S. at 102 (noting that the Thirteenth Amendment authorizes the application of 42 U.S.C. § 1985(3) when there is \"some racial, or perhaps otherwise class-based, invidiously discriminatory animus behind the conspirators' action\"); see also Kozminski, 487 U.S. at 931 (inquiring whether two farmhands had been subjected to slavery or involuntary servitude and in doing so, treating them simply as individuals and never once considering the racial, ethnic, or religious classes to which they might have belonged). As a result, Chasidic Jews (like Rosenbaum) would fall within the coverage of this phrase even if, as a historical matter, Jews had never been considered specifically a distinct race.\n\nThat the protections of the Thirteenth Amendment extend to private actions, and that Jews are entitled to the full measure of these protections, does not, however, settle the question now before us. It remains to be determined whether these protections (bestowed upon Jews or any other groups) suffice to authorize the congressional exercise of power at issue here -- § 245(b)(2)(B)'s criminalization of violence applied against a person on account of (a) his race (religion), and (b) his use of a public street. If the Thirteenth Amendment included only Section One, this would present an unsettled question. Although it has been agreed from the outset that \"[b]y its own unaided force and effect [the Thirteenth Amendment] abolished slavery, and established universal freedom,\" Civil Rights Cases, 109 U.S. at 20, the Supreme Court has \"left open the question whether § 1 of the Amendment by its own terms did anything more than abolish [actual] slavery.\" City of Memphis v. Greene, 451 U.S. 100, 125-26 (1981) (citing Jones v. Alfred H. Mayer Co., 392 U.S. 409 (1986), and also declining to decide the question). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nB. The Power of Congress Under Section Two of the Thirteenth Amendment.\n\nThe existence of the Amendment's second section, however, renders consideration of the independent scope of Section One unnecessary. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e As the following discussion explains, Section Two grants Congress the power to enforce the Amendment by appropriate legislation, and it is clear from many decisions of the Supreme Court that Congress may, under its Section Two enforcement power, now reach conduct that is not directly prohibited under Section One. Furthermore, § 245(b)(2)(B), as applied in the case before us, falls comfortably within the limits of Congress's broad powers of enforcement under Section Two as these have been defined by controlling precedent.\n\nThe enforcement power granted Congress by Section Two has not always been construed in the broad manner described above. See Risa L. Goluboff, The Thirteenth Amendment and the Lost Origins of Civil Rights, 50 Duke L.J. 1609, 1639 (2001). Thus, even though the Supreme Court in the Civil Rights Cases interpreted the Thirteenth Amendment to authorize Congress to abolish not only chattel slavery itself but also to \"pass all laws necessary and proper for abolishing all badges and incidents of slavery,\" Civil Rights Cases, 109 U.S. at 20, it simultaneously suggested that the concept of \"badges and incidents of slavery\" might have a narrow construction. In particular, the Court held that the Congress's power to abolish the \"badges and incidents of slavery\" was limited to \"secur[ing] to all citizens of every race and color . . . those fundamental rights which are the essence of civil freedom, namely, the same right to make and enforce contracts, to sue, be parties, give evidence, and to inherit, purchase, lease, sell, and convey property, as is enjoyed by white citizens.\" Id. at 22. At the same time, the Court stated that the Thirteenth Amendment did not give Congress the power to \"adjust what may be called the social rights of men and races in the community.\" Id. And it found that the Civil Rights Act of 1875, which prohibited the denial of public accommodations based on race, \"ha[d] nothing to do with slavery or involuntary servitude,\" and hence could not be sustained as constitutional under the Thirteenth Amendment. Id. at 24. To adopt a more general interpretation of Congress's powers under Section Two, the Supreme Court concluded, would be \"running the slavery argument into the ground.\" Id.\n\nMoreover, regardless of whether this narrow reading was required to decide the Civil Rights Cases, it was expressly adopted roughly twenty years later, in Hodges v. United States, 203 U.S. 1 (1906), when the Supreme Court reversed the convictions (under predecessors to 18 U.S.C. § 241 and 42 U.S.C. §1981) of white men who had conspired to terrorize a group of black men to prevent them from working at a sawmill. In reaching this conclusion, the Court argued that \"it was not the intent of the [Thirteenth] Amendment to denounce every act done to an individual which was wrong if done to a free man, and yet justified in a condition of slavery.\" Hodges, 203 U.S. at 19. And it added that \"no mere personal assault or trespass or appropriation operates to reduce the individual to a condition of slavery\" as prohibited by the Amendment. Id. at 18. Finally, the Hodges Court couched these arguments in terms that narrowed Congress's Section Two power quite generally, concluding, in effect, that the Thirteenth Amendment authorizes Congress to proscribe only private acts that actually enslave a person, that is, that create \"a state of entire subjection of one person to the will of another.\" Id. at 7 (internal quotations omitted).\n\nBoth of these interpretations of the Thirteenth Amendment were adopted over ringing dissents by Justice Harlan (joined, in Hodges, by Justice Day). Justice Harlan argued that under the Thirteenth Amendment, Congress \"acquired the power not only to legislate for the eradication of slavery, but the power to give full effect to this bestowment of liberty.\" Id. at 29 (Harlan, J., dissenting). Consequently, Justice Harlan concluded, Congress enjoyed the power \"to pass all laws necessary and proper for carrying into execution\" this power, id. at 25-26 (Harlan, J., dissenting), including laws to \"make it impossible that any of [slavery's] incidents or badges should exist or be enforced in any State or Territory of the United States.\" Id. at 27 (Harlan, J.,dissenting). Moreover, and most critically, Justice Harlan asserted that \"[t]he form and manner of the protection [against slavery and involuntary servitude] may be such as Congress, in the legitimate exercise of its legislative discretion, shall provide.\" Id. at 24 (Harlan, J., dissenting) (quotation marks omitted).\n\nAlthough Justice Harlan's view of the Amendment has not been adopted in every particular, see supra footnote 16, the narrow construction of congressional power under Section Two -- epitomized by Hodges -- was expressly overruled. See Jones, 392 U.S. at 441 n.78. And Justice Harlan's reading of the Thirteenth Amendment's enforcement clause, including, critically, his account of the scope of congressional discretion under that clause, has in principal part prevailed.\n\nThe Supreme Court overruled Hodges and established this broader account of the enforcement power in Jones v. Alfred H. Mayer Co., 392 U.S. 409 (1968). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Jones involved a plaintiff who sought relief under 42 U.S.C. § 1982 against defendants who had refused to sell him a house for the sole reason that he was black. The Supreme Court held that, as a matter of statutory construction, § 1982 \"bars all racial discrimination, private as well as public, in the sale or rental of property, and that the statute, thus construed, is a valid exercise of the power of Congress [under Section Two] to enforce the Thirteenth Amendment.\" Id. at 413. Furthermore, the Court found that the authority of Congress to enforce the Thirteenth Amendment \"include[s] the power to eliminate all racial barriers to the acquisition of real and personal property.\" Id. at 439. Critically, the Court reached this conclusion while insisting that it need not decide the scope of the direct prohibitions contained in Section One of the Thirteenth Amendment because Section Two \"clothed `Congress with power to pass all laws necessary and proper for abolishing all badges and incidents of slavery in the United States.'\" Id. at 439 (quoting Civil Rights Cases, 109 U.S. at 20). \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e And most significantly, the Court noted, \"[s]urely Congress has the power under the Thirteenth Amendment rationally to determine what are the badges and the incidents of slavery, and the authority to translate that determination into effective legislation.\" Jones, 392 U.S. at 440. Finally, the Court expressly stated that, to the extent it was inconsistent with these pronouncements, Hodges was overruled. Id. at 443 n.78.\n\nSubsequently, in Griffin v. Breckenridge, 403 U.S. 88 (1971), the Supreme Court expanded on the theme introduced in Jones. The Court upheld, under the Thirteenth Amendment, the constitutionality of 42 U.S.C. § 1985(3), which creates a federal cause of action for damages when \"two or more persons . . . conspire or go in disguise on the highway or on the premises of another, for the purpose of depriving . . . any person or class of persons of the equal protection of the laws, or of equal privileges and immunities under the laws . . . [and] . . . do . . . any act in furtherance of the object of such conspiracy whereby another is injured . . . or deprived of . . . any right or privilege of a citizen of the United States.\"\n\nIn upholding the statute -- as applied to defendants who had conspired to assault and had, in fact, assaulted a group of blacks who were driving through Mississippi, and who the defendants (mistakenly) believed were involved with civil rights activists - the Supreme Court stated that \"the varieties of private conduct that [Congress] may make criminally punishable or civilly remediable [under Section Two of the Thirteenth Amendment] extend far beyond the actual imposition of slavery or involuntary servitude.\" Griffin, 403 U.S. at 105. Indeed, the Court expressed complete confidence both in this principle and in the fact that the principle covered the facts of the case before it, saying that \"[w]e can only conclude that Congress was wholly within its powers under § 2 of the Thirteenth Amendment in creating a statutory cause of action for Negro citizens who have been the victims of conspiratorial, racially discriminatory private action aimed at depriving them of the basic rights that the law secures to all free men.\" Id. Thereafter, the Supreme Court has applied this account of Congress's enforcement power under Section Two of the Thirteenth Amendment to uphold 42 U.S.C. § 1981 and that statute's creation of a federal civil remedy for racial discrimination in making and enforcing contracts in the context of private employment, see Johnson v. Ry. Express Agency, Inc., 421 U.S. 454, 459-60 (1975), and private education, see Runyon, 427 U.S. at 173-75, 179.\n\nIt seems to us that this set of cases necessarily depends on the notion that Congress has been vested, by Section Two of the Thirteenth Amendment, with the authority to prohibit conduct that the courts are unable to say violates Section One directly. This theme is well (if indirectly) developed in two Supreme Court cases declining to invalidate local government actions under Section One of the Thirteenth Amendment but expressly suggesting that if Congress had enacted statutes prohibiting the challenged conduct pursuant to Section Two of the Amendment, then the prohibitions, which the Court was itself unwilling to impose, would have been upheld. Thus, in Palmer v. Thompson, 403 U.S. 217, 227 (1971), the Supreme Court declared itself unwilling to hold that the City of Jackson's decision to close a municipal swimming pool rather than desegregate it violated the Thirteenth Amendment, but noted that \"although the Thirteenth Amendment is a skimpy collection of words to allow this Court to legislate new laws to control the operation of swimming pools throughout the length and breadth of this Nation, the Amendment does contain other words that . . . could empower Congress to outlaw `badges of slavery.'\" The Court, after quoting Section Two, noted that \"Congress has passed no law under this power to regulate a city's opening or closing of swimming pools.\" Id. And in City of Memphis v. Greene, 451 U.S. 100, 128 (1981), the Court -- even as it declined to hold that the closing of a city street (that began in a predominantly black neighborhood and traversed a predominantly white one) in and of itself contravened the Thirteenth Amendment -- added, by way of explanation and contrast, that the case did \"not disclose a violation of any of the enabling legislation enacted by Congress pursuant to § 2 of the Thirteenth Amendment.\"\n\nThe difference between the Court's articulate unwillingness, in Palmer and Greene, to apply Section One of the Thirteenth Amendment where Congress had not acted under Section Two and its equally articulate willingness, in Jones, Griffin, Johnson, and Runyon, to affirm Congress's choices when it had acted under the latter section, serves to underscore the extent to which Congress's powers under Section Two of the Thirteenth Amendment extend beyond the prohibition on actual slavery and servitude expressed in Section One. And, as we have shown, Congress, through its enforcement power under Section Two of the Thirteenth Amendment is empowered, to control conduct that does not come close to violating Section One directly. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The question before us is whether, in light of this jurisprudence, § 245(b)(2)(B), as applied in the case at bar, lies within this expansive enforcement power. We must, in other words, ask whether Congress could rationally have determined that the acts of violence covered by § 245(b)(2)(B) impose a badge or incident of servitude on their victims.\n\nC. The Meaning and Significance Under the Thirteenth Amendment of the Language of Section 245(b)(2)(B).\n\nThe critical feature of § 245(b)(2)(B) for purposes of this constitutional analysis is that it does not seek to reach most force-based injuries, intimidations, or interferences and by no means attempts to create a general, undifferentiated federal law of criminal assault. In this regard, the Supreme Court's treatment of § 1985(3) in Griffin provides a striking analogue. In Griffin, the Court said: \"The constitutional shoals that would lie in the path of interpreting § 1985(3) as a general federal tort law can be avoided by giving full effect to the congressional purpose -- by requiring, as an element of the cause of action, the kind of invidiously discriminatory motivation stressed by the sponsors of [a] limiting amendment [and included in the statute].\" Griffin, 403 U.S. at 102. Likewise, in the case at bar, similar constitutional shoals can be avoided by giving full effect to the congressional purpose behind § 245(b)(2)(B) -- by requiring, in other words, as elements of the crime defined by § 245(b)(2)(B) that the forceful injury, intimidation, or interference that the statute addresses be committed \"because\" of the victim's race or religion, etc., and \"because\" the victim was participating in or enjoying a facility, etc., provided or administered by a State or a subdivision thereof. See 18 U.S.C. § 245(b)(2)(B). Just as the element of invidiously discriminatory motivation was held in Griffin to bring § 1985(3) within the scope of Congress's Thirteenth Amendment powers, so also do the requirements that the victim be harmed because of his or her race or religion and his or her use of public-facilities bring § 245(b)(2)(B) under the same constitutional authority. In each case, the additional elements allow Congress \"rationally to determine,\" Jones, 392 U.S. at 440, that the proscribed conduct imposes a badge or incident of slavery on its victims.\n\nSince these additional elements of the statute are essential to its constitutionality, we must with particular assiduousness embark on an exercise of statutory interpretation to determine their meaning in § 245(b)(2)(B).\n\n\"The starting point in every case involving construction of a statute is the language itself.\" Blue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 756 (1975) (Powell, J., concurring). Accordingly, \"[w]hen confronted with a statute which is plain and unambiguous on its face, [a court] ordinarily do[es] not look to legislative history as a guide to its meaning.\" Tenn. Valley Auth. v. Hill, 437 U.S. 153, 185 n.29 (1978) (citing Ex parte Collett, 337 U.S. 55, 61 (1949)). The meaning of § 245(b)(2)(B), however, is anything but unambiguous.\n\nSpecifically, the significance of the word \"because,\" as that word is used in defining the two aforementioned constitutionally crucial elements of the crime, is anything but plain. Causation is one of the most famously complicated concepts in language and in law. The ancient Greeks, for example, distinguished among four concepts all now covered by the modern English word \"cause.\" See Aristotle, The Metaphysics 983a-983b (distinguishing among the final, formal, material, and efficient causation). And the modern law of torts employs at least three concepts of cause: \"cause-in-fact\" or \"but for\" cause, \"proximate\" or \"legal\" cause, see Restatement (Third) of Torts, § 431 cmt. a (distinguishing these two), and \"causal link\" or \"causal tendency.\" See Liriano v. Hobart Corp., 170 F.3d 264, 271-72 (2d Cir. 1999) (emphasizing the significance of the last); Zuchowicz v. United States, 140 F.3d 381, 388 n.7 (2d Cir. 1998) (same); see also Guido Calabresi, Concerning Cause and the Law of Torts: An Essay for Harry Kalven, Jr., 43 Univ. of Chi. L. Rev. 69, 71 (1975) (identifying and differentiating these three causal concepts). Moreover, \"because\" appears in § 245(b)(2)(B) nakedly, without any larger statutory structure by reference to which its meaning may be assessed. For all these reasons, \"the face of the Act is inescapably ambiguous,\" Schwegmann Bros. v. Calvert Distillers Corp., 341 U.S. 384, 395 (1951) (Jackson, J., concurring), and we must, albeit hesitantly, look to the legislative history of § 245(b)(2)(B) to help us establish Congress's intent and hence the statute's meaning.\n\nIn making this inquiry, we rely principally on the reports of the legislative Committees involved in drafting the statute and in steering it through Congress. The Supreme Court has said that these Reports, \"which represent the considered and collective understanding of those Congressmen involved in drafting and studying proposed legislation,\" constitute \"the authoritative source for finding the Legislature's intent.\" Garcia v. United States, 469 U.S. 70, 76 (1984) (internal quotation marks and brackets omitted). We therefore \"eschew[] reliance on the passing comments of one Member, and casual statements from the floor debates,\" id. (internal citations omitted), and focus on the Reports instead. In particular, we focus on that of the Senate Judiciary Committee, S. Rep. No. 90-721, since this is the only Committee to have considered and commented on the statute in a form that included both of the two \"becauses\" at issue here.\n\nThe Senate Judiciary Committee Report, after noting in passing that the first \"because\" entails that an act will come under the statute only if it is \"motivated by the race, color, religion, or national origin of the victim,\" S. Rep. No. 90-721, at 7 (1968), reprinted in 1986 U.S.C.C.A.N. 1837, 1844 (emphasis added), focuses more carefully on the meaning of the second \"because\" that appears in § 245(b)(2)(B). This \"because\" establishes that in order to violate the statute a person, in addition to being motivated by his victim's race, etc., must act because the victim was availing herself of, in the case of § 245(b)(2)(B), publicly provided facilities.\n\nIn discussing this phrase, the Senate Committee began by noting that the version of the statute originally reported out by the House Judiciary Committee covered acts committed against a person because of her race, etc., and done \"while\" the person was using public facilities. Id. The Senate Committee noted that the second \"because\" entered the statute as an amendment proposed on the House floor. Id. The original version, the Senate Committee said, \"may have swept too broadly\" for the \"constitutional basis [of] the bill,\" and the Committee therefore retained the second \"because\" that had been added to the bill by the House floor amendment. Id.\n\nThese background facts and Committee remarks establish that the Congress inserted the second \"because\" with the specific purpose of narrowing § 245(b)(2)(B)'s reach. But they do not reveal whether Congress, by this second \"because,\" intended § 245(b)(2)(B) to reach all acts which would not have been committed but for the fact that the victim was enjoying a public facility, only the narrower class of acts which were committed with the intent to prevent or dissuade the victim from, or punish the victim for, enjoying a public facility, or-narrower still-acts committed with the motive of preventing, dissuading, or punishing the victim's use of a public facility.\n\nUnder the first interpretation, a racially motivated assault, for example, would be covered by the statute if the attacker sought out his victims exclusively in a public park (but not if the attacker followed a victim from her house and attacked her while she was in the park only because this happened to be where the first opportunity to assault her arose). Under the second and third interpretations, by contrast, an attack would not come under the statute even if the attacker only assaulted victims in the public park, unless the focus on victims who used the park was more than just a matter of convenience. To be covered, the victims' public-park-use would itself have to be an intrinsic element of the attacker's intent or motivation, a reason, that is, for the assault. The most obvious examples of racially, etc., motivated attacks that implicate these latter senses of \"because the victims used public facilities\" are assaults that punish a member of a minority group for using the facilities or, relatedly, discourage that person from doing so in the future.\n\nWhile the familiarity of racially or religiously (etc.) motivated violence allowed the Senate Judiciary Committee to assume in passing that \"because\" of race, or religion, etc., as it appears in § 245(b)(2)(B), means motivated by racial or religious, etc., hatred, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e the somewhat lesser familiarity of the subtypes of violence identified by the second \"because\" required more detailed treatment in Committee. And although the Committee Report does not reveal that the Senate expressly focused upon the difference between the three senses of the phrase \"because [the victim] is or has been . . . enjoying any . . . facility . . . provided . . . by any State,\" 18 U.S.C. § 245(b)(2)(B), the Report does demonstrate that the Senate wished to use \"because\" in the second, narrower, meaning, but not in the third, narrowest, sense.\n\nThe Senate Committee, after noting that \"[i]n the House Committee's version [which read \"while\"] it was not necessary to show that the defendant intended to interfere with the protected activity, but only that the use of force was racially motivated,\" concluded that \"[t]he problem is avoided by the amendment [adding the second \"because\"] which adds the additional element of intent -- a purpose to interfere with the activity.\" S. Rep. No. 90-721, at 7, reprinted in 1968 U.S.C.C.A.N. at 1844. Indeed, the Senate Committee expressly mentioned precisely the two core cases that we identified as satisfying this stricter interpretation of the second \"because\":\n\nTwo types of situations would be covered [by the statute]: interference intended to prevent present or future participation in a described activity by the victim, and interference intended as a reprisal against the victim for having participated in a described activity. Id. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nAnd, significantly, the Senate Report requires intent with respect to these situations rather than motivation. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nSection 245(b)(2)(B), properly understood, therefore stops well short of creating a general, undifferentiated federal law of criminal assault and instead restricts its attention to acts of force or threat of force that involve two distinct kinds of discriminatory relationships with the victim -- first, an animus against the victim on account of her race, religion, etc., that is, her membership in the categories the statute protects; and, second, an intent to act against the victim on account of her using public facilities, etc., that is, because she was engaging in an activity the statute protects. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIt is important to understand that acts of violence or force committed against members of a hated class of people with the intent to exact retribution for and create dissuasion against their use of public facilities have a long and intimate historical association with slavery and its cognate institutions. Thus there is widespread agreement among scholars of slavery that slavery in general (across cultural and historical periods) centrally involves the master's constant power to use private violence against the slave, see Orlando Patterson, Slavery and Social Death: A Comparative Study 1-14 (1982) (noting that such violence is one of the three \"constituent elements\" of slavery), and that \"slavery is preeminently a relationship of power and dominion originating in and sustained by violence.\" David Brian Davis, Slavery and Human Progress 11 (1984). Moreover, the peculiar institution of American slavery unquestionably did not depart from this general rule. Southern States, for example, \"decriminalized [private] violence inflicted upon blacks to the extent thought necessary to assert and preserve white supremacy.\" Randall Kennedy, Race, Crime and the Law 30 (1997). And, in several States \"legislators expressly deprived slaves who were violently abused by whites of the protections of the common law of crimes by passing exculpatory acts that granted both slave masters and whites who were strangers to the slave legal rights to beat, whip, and kill bondsmen.\" Andrew Fede, Legitimized Violent Slave Abuse in the American South, 1619-1865: A Case Study of Law and Social Change in Six Southern States, 29 Am. J. Legal Hist. 93, 95 (1985).\n\nSignificantly, this practice of race-based private violence both continued beyond the demise of the institution of chattel slavery and was closely connected to the prevention of former slaves' exercise of their newly obtained civil and other rights (rights that slavery had previously denied them), thereby presenting \"a spectacle of slavery unwilling to die.\" Jones, 392 U.S. at 445 (Douglas, J., concurring). Thus \"violence against blacks reached staggering proportions in the immediate aftermath of the [Civil War],\" Eric Foner, Reconstruction: America's Unfinished Revolution 1863-1877, at 119 (1988), and such violence was specifically directed at the exercise, by black Americans, of the rights and habits of free persons. See, e.g., id. at 120 (\"The pervasiveness of violence reflected whites' determination to define in their own way the meaning of freedom and their determined resistance to blacks' efforts to establish their autonomy, whether in matters of family, church, labor, or personal demeanor.\"); Kennedy, supra, at 39 (\"In an effort to reassert control, whites beat or killed African-Americans for such `infractions' as failing to step off sidewalks, objecting to beatings of their children, addressing whites without deference, and attempting to vote.\").\n\nAs these studies suggest, there exist indubitable connections (a) between slavery and private violence directed against despised and enslaved groups and, more specifically, (b) between American slavery and private violence and (c) between post Civil War efforts to return freed slaves to a subjugated status and private violence directed at interfering with and discouraging the freed slaves' exercise of civil rights in public places. It is in the shadow of these connections, and citing to Justice Douglas's characterization of slavery as \"unwilling to die,\" Jones, 392 U.S. at 445 (Douglas, J., concurring), that the Eighth Circuit (the only Circuit previously to address the question of § 245(b)(2)(B)'s constitutionality under the Thirteenth Amendment), concluded \"[n]or can there be doubt that interfering with a person's use of a public [facility] because he is black is a badge of slavery.\" United States v. Bledsoe, 728 F.2d 1094, 1097 (8th Cir. 1984).\n\nOn the basis of the foregoing analysis, we similarly conclude that § 245(b)(2)(B)'s prohibition against private violence motivated by the victim's race, religion, etc., and because of the victim's use of a public facility, etc., \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e falls comfortably within Congress's \"power under the Thirteenth Amendment rationally to determine what are the badges and the incidents of slavery, and [its] authority to translate that determination into effective legislation.\" Jones, 392 U.S. at 440. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Accordingly, we find that § 245(b)(2)(B), as applied in the case at bar, \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e is a constitutional exercise of Congress's power under the Thirteenth Amendment. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n2. The Scope of 18 U.S.C. § 245(b)(2)(B).\n\nThe defendants argue, next, that even if § 245(b)(2)(B) is constitutional, it does not reach the conduct for which they were tried and convicted.\n\nA. Streets as Public Facilities.\n\nSection 245(b)(2)(B) limits its scope to acts committed against victims because they are \"participating in or enjoying any benefit, service, privilege, program, facility or activity provided or administered by any State or subdivision thereof.\" The defendants contend that their conduct does not come under the statute because Rosenbaum was not \"participating in or enjoying any benefit, service, privilege, program, facility or activity\" when he was attacked. In particular, the defendants argue that the Brooklyn city street on which Rosenbaum was attacked does not count as a \"facility\" within the meaning of § 245(b)(2)(B). \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe defendants begin with the proposition that \"facility\" as used in § 245(b)(2)(B) is an ambiguous term, so that we must, in deciding the statute's meaning, look beyond statutory language. See Schwegmann Bros., 341 U.S. at 395 (Jackson, J., concurring). Proceeding from this premise, they contend that in light of the legislative history of the statute and also of the rule of lenity (which asserts that ambiguities in criminal statutes should be resolved in a defendant's favor), see Kozminski, 487 U.S. at 952, we should find that a city street is not a \"facility\" for purposes of § 245(b)(2)(B). As a result, the defendants urge us to conclude that the fact that Rosenbaum was using a city street when the defendants attacked him is insufficient to sustain their convictions under the statute. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThis argument need not detain us long, for it stumbles at its initial premise. As the defendants themselves concede, \"[t]he starting point in interpreting a statute is its language, for `[i]f the intent of Congress is clear, that is the end of the matter.'\" Good Samaritan Hosp. v. Shalala, 508 U.S. 402, 409 (1993) (citing Chevron USA, Inc. v. Natural Res. Def. Council, Inc., 467 U.S. 837, 842 (1984)). Therefore, if § 245(b)(2)(B) is not ambiguous on its face, the defendants' remaining contentions fall away. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nDefendants' suggestions to the contrary notwithstanding, the term \"facility\" clearly and unambiguously includes city streets within its meaning. A \"facility\" is \"something that promotes the ease of any action, operation, transaction, or course of conduct\" or \"something (as a hospital, machinery, plumbing) that is built, constructed, installed or established to perform some particular function or facilitate some particular end.\" Webster's Third International Dictionary 812-13 (1966). And a city street undoubtedly \"promotes the ease of\" travel and transportation within the city and is \"built\" and \"constructed\" to \"perform [the] function [and] facilitate [the] end\" of such travel and transportation. It therefore unambiguously falls within the clear meaning of the text of § 245(b)(2)(B). Accordingly, as the district court correctly held, President Street in Brooklyn qualifies as a \"facility\" for purposes of § 245(b)(2)(B). \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nA. The Defendants' Motive and Intent.\n\nIn assessing the constitutionality of § 245(b)(2)(B), we held that this statute restricts its scope to acts of force or threat of force that involve two distinct kinds of discriminatory attitudes with respect to the victim -- first, a motive or an animus against the victim on account of her race, religion, etc., that is, her membership in a class or category the statute protects; and, second, an intent to act against the victim on account of his or her using public facilities, etc., that is, of his or her engaging in an activity that the statute protects. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn this appeal, the defendants attack the application of these motivation and intent requirements to them on formal and substantive grounds. The formal challenge is that the district court in its charge to the jury combined the two requirements. The substantive challenge is that the evidence was insufficient with respect to the second. The defendants claim that there is no evidence of any motive or intent to impose punishment or dissuasion on Rosenbaum because of his enjoying a city street, i.e., because of his engaging in the statutorily protected activity. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e We consider each argument in turn.\n\n(a) The Formal Challenge.\n\nIn its jury instructions, the trial court, over the defendants' objection, presented the dual requirements of motivation and intent imposed by § 245(b)(2)(B) as a single element of the crime that the statute creates. The court charged that \"the government must prove that the defendants injured, intimidated or interfered with Yankel Rosenbaum because he was Jewish and because he was exercising his right to use the streets.\" (Tr. 3024 (emphasis added)). In their formal challenge, the defendants renew their objection to this charge and argue that by combining the two requirements into a single element, rather than instructing the jury that each constituted a separate and distinct element, the district court minimized the government's obligation to prove beyond a reasonable doubt that the defendants displayed both.\n\nThis argument is straightforwardly meritless. In its instructions to the jury, the district court expressly and repeatedly used the conjunctive \"and\" in referring to the statutory requirement that both class-based motivation and activities-based intent are required to sustain a conviction under § 245(b)(2)(B). Furthermore the court, in describing to the jury the statute's requirements, referred, in the plural, to \"these motives or reasons,\" and presented the jury with an explicit and separate discussion of the second, activities-based intent requirement. (Tr. 3024). A conjunctive predicate is true only if both of its constituent predicates are true. And the proof requirements imposed on the government are not altered merely because the conjunction joins two predicates within one element of a charged crime rather than joining two separate, one-predicate elements. The district court made the need to establish the existence of both of these § 245(b)(2)(B) requirements plain. The defendants' formal argument that the district court's combining the two requirements into a single element of the crime was erroneous therefore fails. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\n(b) The Substantive Challenge.\n\nThe defendants' substantive argument concerning the activities-based \"because\" requirement presents a more serious question. The defendants may be contending, in this connection, that the evidence presented at trial was inadequate to establish that they possessed an activities-based motive which they may be saying is needed to sustain a conviction under § 245(b)(2)(B). They could be claiming that there was no evidence presented at trial sufficient to allow a jury to conclude that they acted with animus against Rosenbaum on account of his using the public street on which he was attacked or that they intended to punish or dissuade Rosenbaum from using a city street. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e If this is their argument, they overstate the statute's requirements. As we have interpreted § 245(b)(2)(B), see supra, it mandates an intent to interfere with the victim's use of public facilities, but does not demand a specific motive to do so. Accordingly, we will read defendants' challenge as principally one to the sufficiency of the evidence of the requisite intent.\n\n\"A defendant challenging the sufficiency of the evidence bears a heavy burden.\" United States v. Pipola, 83 F.3d 556, 564 (2d Cir. 1996). In addressing such a challenge, \"we must consider the evidence in the light most favorable to the government.\" United States v. Gore, 154 F.3d 34, 40 (2d Cir. 1998) (quotation marks omitted). And we \"must credit every inference that could have been drawn in the government's favor.\" United States v. Masotto, 73 F.3d 1233, 1241 (2d Cir. 1996) (quotation marks omitted). Accordingly, \"[t]he jury's verdict must be sustained, `if any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.' Jackson v. Virginia, 443 U.S. 307, 319, 99 S.Ct. 2781, 61 L.Ed.2d 560 (1979).\" Gore, 154 F.3d at 40. Finally, \"[t]hese principles apply whether the evidence being received is direct or circumstantial.\" Id.\n\nWhereas overwhelming direct evidence was adduced to prove that the defendants displayed anti-Jewish animus of the sort contemplated by § 245(b)(2)(B), the trial produced no similar direct evidence that the defendants, in addition to being motivated by Rosenbaum's Judaism, also had an intent to prevent or dissuade his use of the city street. For this reason, the case at bar is distinguishable from some (but not all, see infra) other cases in which convictions under § 245 have been upheld against sufficiency challenges. Thus the defendants' sufficiency challenges in this case raise more difficult questions than those made and rejected in United States v. Franklin, 704 F.2d 1183, 1192 (10th Cir. 1983), and United States v. Lane, 883 F.2d 1484, 1496 (10th Cir. 1989). In both of these cases, which involved §§ 245(b)(2)(B) and (C), there was direct evidence that the defendants had, prior to committing their crimes, specifically objected, in one, to \"racial mixing\" at the park in which the crime was committed (Franklin) and, in the other, to a Jewish victim's employment as a radio talk show host (Lane).\n\nIn contrast to the evidence in Franklin and Lane, the only evidence on which the government can rely in the case at bar is the circumstantial evidence that the defendants and the mob they incited or belonged to sought out their victims exclusively on city streets, and that the natural and foreseeable consequence of the attacks, given the victims' locations, was both an interference with these victims' contemporaneous use of the streets and an intimidation and deterrence against their future use of such streets. Against this evidentiary backdrop, and immediately after repeating its instruction that § 245(b)(2)(B) required the jury to decide whether the defendants acted both because of Rosenbaum's Judaism and because of his use of the city streets, the district court instructed the jury that in order to find that § 245(b)(2)(B)'s \"because\" requirements were satisfied the jury needed to make a decision about the defendants' state of mind. It is often impossible to ascertain or prove directly what the operation of a defendant's mind was. . . . [A] wise and intelligent consideration of all of the facts and circumstances shown by the evidence may enable you to infer what the defendant's state of mind was. . . . Therefore, you may rely on circumstantial evidence in determining the defendant's state of mind.\n\nIn this regard, I instruct you that you may infer that a person ordinarily intends all the natural and probable consequences of an act knowingly done. In other words, you may infer and find that the defendants intended all the consequences that a person, standing in like circumstances and possessing like knowledge, should have expected to result from the acts he knowingly committed.\n\nI also instruct you that the mere presence of a defendant where a crime is being committed, even coupled with knowledge that a crime is being committed, or the mere acquiescence by a defendant in the criminal conduct of others, even with guilty knowledge, is not sufficient to establish guilt of the crime charged here. (Tr. 3024-36).\n\nThe jury convicted the defendants in response to this instruction, and specifically to the statement that \"you may infer and find that the defendants intended all the consequences that a person, standing in like circumstances and possessing like knowledge, should have expected to result from the acts he knowingly committed.\" \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e (Tr. 3024-36). Consequently in presenting their sufficiency challenges, the defendants must be arguing, in effect, either (1) that the general inference of intent that this instruction contemplates is impermissible, or (2) that even if the general inference is permissible, a reasonable person standing in the defendants' shoes would not have expected his or her actions to interfere with the victims' use of the public streets or to intimidate or deter the victim from engaging in this protected activity, or (3), more broadly, that a finding of intent is not enough and that specific motive or animus to punish or retaliate against the victim for his use of the streets is needed.\n\nOnce the defendants' sufficiency challenges are understood in this way, it becomes clear that their arguments in this connection must be rejected. To begin with, it is well-settled that, as a general matter, criminal intent may be proven by circumstantial evidence. See United States v. Atehortva, 17 F.3d 546, 550 (2d Cir. 1994). And, it is equally well established that, while a jury instruction in a criminal case that the law presumes that a person intends the ordinary consequences of his voluntary acts violates due process, see Sandstrom v. Montana, 442 U.S. 510 (1979), an instruction that merely permits a jury to infer that an accused intends such consequences of such acts is acceptable, see Francis v. Franklin, 471 U.S. 307, 315 (1985). The instruction in the case at bar, which contained the language \"you may infer,\" is unambiguously of the latter, and generally permissible, variety. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nThe specific inference that the district court instructed the jury that it might draw -- from an attack on a city street by participants in a mob roving the streets, to a specific intent to interfere with, intimidate, or dissuade the street-based activities of the victim of the attack -- is, moreover, also permissible. Whether a particular inference falls within the general rule that a jury may conclude that an actor intended foreseeable consequences of his actions depends upon whether a jury's conclusion that a consequence of the actions is foreseeable is \"rooted in reason or common sense.\" Payne v. LeFevre, 825 F.2d 702, 707 (2d Cir. 1987). Here, the defendants' actions clearly had the foreseeable effect of interfering with Rosenbaum's contemporaneous and immediate use of the city street on which he was attacked, and had this effect in a manner that could not possibly go unnoticed. Furthermore, the long-standing and intimate connection between public violence and racial and religious oppression, see supra pages 54-57, and the fear felt by victims of violence, in particular by those who have been singled out on the basis of their race or religion, convince us that any connection the jury might have drawn between the defendants' conduct and their intent to interfere with or deter future street use by Rosenbaum and by people similarly situated was firmly rooted in reason and common sense.\n\nMoreover, as indicated earlier, we believe that the statute, while concerned with racial motivation and animus, did not impose a similar motivation requirement with respect to interference with participation in the relevant activities. That is, while we agree that a class-based motivation is required by the statute, proof of an activities-based intent is enough. We thus reach a conclusion similar to that presented in the Senate Committee Report, namely that evidence that a victim was attacked while actually engaged in a protected activity would ordinarily \"be enough to send the [question of activities-based intent] to a jury, because such facts would afford the basis for an inference that the assailant did intend to interfere with the protected activity.\" S. Rep. No. 90-721 at 9, reprinted in 1968 U.S.C.C.A.N. at 1844. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e And we reject the defendants' challenges to the sufficiency of the evidence presented against them.\n\nWe note, as a final matter, that we are not alone in reaching this conclusion in a case in which the only evidence of activities-based intent is circumstantial. At least two other Circuit Courts have done the same pursuant to § 245. Thus the Sixth Circuit, upholding a conviction under § 245(b)(2)(F), concluded that the evidence that a defendant directed racial slurs at his victim while they were both in a night club was sufficient to allow a jury to determine that the defendant acted \"because\" the victim was enjoying the services of a public place of entertainment. United States v. Ebens, 800 F.2d 1422 (6th Cir. 1986). It reached this result on the ground that: [t]he jury could . . . have found that [the defendant's] remarks were intended to make [the victim's] remaining on the premises uncomfortable and embarrassing and to intimidate and dissuade him from remaining on the premises . . . . Ebens, 800 F.2d at 1429.\n\nSimilarly, the Eighth Circuit held that even where there was no specific evidence of activities-intent and a defendant argued that an attack \"only incidentally\" occurred at a federal swimming area, the defendant's sufficiency challenge to his conviction under § 245(b)(2)(B) must be rejected. In such circumstances, the court stated: \"[I]t was for the jury to infer that the defendant intended to intimidate [his victim] and interfere with his use of the governmental facilities at [the swimming lake].\" United States v. Price, 464 F.2d 1217, 1218 (8th Cir. 1972). \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nB. The Selection of the Jury.\n\nHaving determined that § 245(b)(2)(B) is a constitutional exercise of Congress's powers under the Thirteenth Amendment, that the statute applies to behavior of the type that the government charged the defendants with committing, and that the evidence presented at trial was sufficient to allow the jury to return its verdict of conviction, we turn now to addressing the defendants' challenges to the district court's actions in empaneling the jury that convicted them.\n\nAs we have described, see supra pages 11-13, the district court expressed concern throughout the jury selection process that any jury that was finally empaneled should \"represent[] the community.\" (Tr. 759). This meant to the district court that the jury should contain appropriate numbers of African Americans and Jews. Although the district court was clearly interested in seating close to an equal number of African Americans and Jews on the jury, the makeup of the jury pool -- which had very few Jews in it -- caused the district court's concern for such racial and religious balance to express itself principally, although by no means exclusively, in the form of efforts to prevent the final jury from containing too many African Americans and too few Jews.\n\nIn this respect, the district court made three related decisions, each of which the defendants now appeal. First, the district court denied the defendants' objection, made pursuant to Batson v. Kentucky, 476 U.S. 79 (1986), to the fact that even though the jury pool was 30% African American, the government used 55% of its peremptory challenges to strike African- American candidates from the jury. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Second, the district court denied the defendants' for-cause challenge against a Jewish juror (Juror 108) who had expressed grave doubts about his ability to be objective concerning the case, stating that he was \"pretty sensitive\" to issues affecting the Jewish community and that he was \"disappointed\" by the outcome of defendant Nelson's state murder trial. (Tr. 619-21). The district court denied the challenge in spite of the fact that at a second round of voir dire, in which the district court expressly asked Juror 108 to \"look into your heart and ask yourself whether you feel personal emotional internal pressures that would make it such that you couldn't give the defendant here a fair trial,\" Juror 108 answered \"I don't know. I honestly don't know.\" (Tr. 632). And third, when an African-American empaneled juror was excused because of illness, \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e the district court sua sponte shifted a second (and white) juror from the main panel to become an alternate juror and then filled the two open places on the jury with another African-American juror and with the Jewish Juror 108. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Both of these jurors were selected from the list of alternate jurors out of order, in violation of Fed. R. Crim. P. 24(c).\n\nIn this way, the district court secured what it deemed to be adequate numbers of African Americans and Jews on the main jury. Specifically, the final jury panel contained three African Americans, Jewish Juror 108, and another juror who, although she did not describe herself as Jewish, had Jewish parents.\n\nThat the district court was at once intent on achieving this or an equivalent result, and was fully aware that doing so might require adopting controversial methods, may be seen from the fact that, shortly before performing these manipulations, the court stated:\n\nI will not allow this case to go to the jury without 108 as being a member of that jury, and how that will be achieved I don't know. It may well be just by people falling out. It may well happen, in which event I propose never to make any findings on this issue, and if I can I would seal the whole discussion because I see it serving no one's interest. I am not sure I can get away with that. I don't know if the press will allow it, but I don't think it would serve the public's interest to have this discussion go on the record, and especially, if I don't make any findings and I hope that I will not have to make any findings. (T. 758).\n\nDespite this fact, the defendants' counsel expressly stated that this third manipulation of the jury selection process \"would be agreeable to the defendants,\" (Tr. 866), and the defendants themselves consented to the proposal on the record.\n\nOn appeal, the defendants contend that all three of the district court's jury-selection actions constitute reversible error. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Because we conclude that the facts underlying the defendants' second and third arguments taken together give rise to a meritorious challenge to the defendants' convictions, we need not consider the first claim. And so it is to the second and third arguments to which we now turn.\n\nWhile normally we would treat these two claims separately from each other, (a) the unusual nature of the district court's race- and religion-based reshuffling, (b) the government's assertion that defendants - through the same acts - properly waived both their second and third challenges, and (c) the government's concessions - made on appeal - with respect to the third argument, render it necessary that we examine the second and third contentions in relation to each other.\n\nIn doing so, we face a series of complex questions: (a) whether a jury that is selected by a district court intentionally to achieve racial and religious objectives is a valid jury, (b) whether invalidity - if any - in a jury so selected constitutes a constitutional defect or - even if not necessarily unconstitutional - represents district court behavior that must be precluded by appellate courts in the exercise of their supervisory authority, (c) whether the flaws in such a jury panel can nevertheless be waived by the parties through their knowing consent, and (d) whether, even if such consent is to be deemed void, the refusal to permit waivers should be applied prospectively only, following a clear statement by a court of appeals of the inappropriateness of the actions consented to. In addition to these issues, we must also consider (a) whether Juror 108 was partial and hence properly challengeable for cause, (b) whether the erroneous seating of such a biased juror is waivable, \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e and (c) whether, even if it is waivable, the consent necessary to that waiver is validly given when the quid pro quo for it is the empaneling by the district court of a jury explicitly selected, in part, on the basis of race and religion.\n\nBecause we believe both (a) that in the case before us a biased juror was seated and (b) that the consent given to the selection of that juror was invalid, since it was obtained in exchange for the improper empaneling of a jury chosen partly on the basis of race and religion, we conclude that the defendants' convictions cannot stand. And we do so without giving ultimate answers to some of the other extraordinarily difficult questions that consensual racial or religious jurymandering present.\n\n1. The Impartiality of the Jury.\n\nThe Sixth Amendment to the United States Constitution grants criminal defendants the right to be tried \"by an impartial jury.\" U.S. Const. Amend.VI. Furthermore, the Supreme Court has observed, \"[o]ne touchstone of a fair trial is an impartial trier of fact -- a jury capable and willing to decide the case solely on the evidence before it.\" McDonough Power Equip., Inc. v. Greenwood, 464 U.S. 548, 554 (1984) (internal quotation marks and citation omitted). The right to trial before an impartial trier of fact -- be it a jury or a judge -- therefore implicates Due Process as well as Sixth Amendment rights.\n\nIn the case at bar, Juror 108, from the beginning of his voir dire, expressed concern for events affecting the Jewish community and, in particular, voiced his dissatisfaction with the State proceedings that resulted in defendant Nelson's acquittal. Moreover, on further questioning, Juror 108 said that although he \"would like to think\" of himself as objective and able to give the defendants a fair trial, he \"[h]onestly . . . [didn't] know\" whether he could do so. (Tr. 619-21). And, the last answer Juror 108 gave when the district court asked him once again whether he could set aside his personal feelings and give the defendants a fair trial was \"I don't know. I honestly don't know.\" (Tr. 632).\n\nIn spite of these statements, and in the context of its express desire to ensure that the empaneled jury contained an adequate number of Jewish jurors, the district court denied the defendants' for cause challenge to Juror 108. Then, by the unusual -- and indeed illegal, see Fed. R. Crim. P. 24(c) -- method described above and discussed below, the district court placed Juror 108 on the main panel that decided the defendants' case. The defendants now challenge these decisions of the district court.\n\nWe review a district court's rejection of a defendant's for cause challenge to a juror for abuse of discretion. Murray, 618 F.2d at 899. Indeed, \"[t]here are few aspects of a jury trial where we would be less inclined to disturb a trial judge's exercise of discretion, absent clear abuse, than in ruling on challenges for cause in the empaneling of a jury.\" Ploof, 464 F.2d at 118 n.4. This is especially true when, as here, a for cause challenge to a juror's impartiality rests on a claim that the juror suffers from what is generally called \"actual bias,\" that is, \"the existence of a state of mind that leads to an inference that the person will not act with entire impartiality.\" United States v. Torres, 128 F.3d 38, 43 (2d Cir. 1997). \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e A district court's findings concerning actual bias are \"based upon determinations of demeanor and credibility that are peculiarly within a trial judge's province.\" Wainwright v. Witt, 469 U.S. 412, 428 (1985).\n\nIn spite of this deferential standard of review, we conclude that the district court abused its discretion, and committed reversible error, in denying the defendants' for cause challenge to Juror 108. We believe, in other words, that Juror 108 sufficiently revealed actual bias in his answers during voir dire to require his exclusion from the jury. \"[A] voir dire admission by the prospective juror of a state of mind prejudicial to a party's interest,\" United States v. Haynes, 398 F.2d 980, 984 (2d Cir. 1968), is the most common and direct ground on the basis of which actual bias is found to exist. The admissions, indeed the repeated and persistent admissions, made to the district court by Juror 108 are precisely of this sort. As two of our sister courts have said, \"[d]oubts about the existence of actual bias should be resolved against permitting the juror to serve, unless the prospective panelist's protestation of a purge of preconception is positive, not pallid.\" Bailey v. Bd. of County Comm'rs, 956 F.2d 1112, 1127 (11th Cir. 1992) (quoting United States v. Nell, 526 F.2d 1223, 1230 (5th Cir. 1976)). And as a third has added, \"a juror who `could probably be fair and impartial'\" should not be considered impartial, because \"`[p]robably' is not good enough.\" United States v. Sithithongtham, 192 F.3d 1119, 1121 (8th Cir. 1999). This is especially so when, as in this case, the potential bias does not represent only a general state of mind but also a predisposition to believe in the guilt of one of the very defendants who is being tried. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nFurthermore, although we have acknowledged that, \"it is the rare juror who could honestly `guarantee' that his feelings about the particular type of crime alleged would in no way affect his deliberations.\" United States v. Murray, 618 F.2d 892, 899 (2d Cir. 1980), we have also called it \"crucial\" that in spite of these predispositions, a prospective juror should \"state[] in effect that she would do her best to determine the case on the evidence presented,\" and that she has \"made clear that her [predispositions] would not affect her judgment, and that she would determine the case solely on the evidence presented.\" Id. Thus, it is important that a juror who has expressed doubts about his or her impartiality also unambiguously assure the district court, in the face of these doubts, of her willingness to exert truly best efforts to decide the case without reference to the predispositions and based solely on the evidence presented at trial. See, e.g., United States v. Towne, 870 F.2d 880, 885 (2d Cir. 1989) (upholding the denial of a challenge for cause with respect to a juror who at first \"expressed reservations about her ability to be an impartial juror\" based on her knowledge of defendant's prosecution for various crimes in state court but who later \"promise[d] that she would try to decide the case based on the evidence presented\"); Ploof, 464 F.2d at 118 (doing the same when a juror who \"at first said that his thinking `might' be affected [based on a personal experience]; [but later] upon being reminded by the court of his oath, . . . said that he would do away with the `might' and that he would do his best\").\n\nJuror 108, having, inter alia, expressed his chagrin with defendant Nelson's state trial acquittal, never purged himself of his preconceptions. He never even asserted that he could probably be impartial. And he never promised to focus his attention on the evidence presented at trial. Specifically, Juror 108 never \"made clear . . . that []he would determine the case solely on the evidence presented,\" Murray, 618 F.2d at 899, or \"promise[d] that []he would try to decide the case based on the evidence presented,\" Towne, 870 F.2d at 885, or said \"that he would do his best,\" Ploof, 464 F.2d at 118, to decide the case in this impartial way. The most that Juror 108 said was that he would \"like to think\" that he could be impartial, but that he \"honestly [didn't] know.\"\n\nThe principal reason for which jurors are dismissed for cause is that \"they are unwilling or unable to follow the applicable law.\" United States v. Thomas, 116 F.3d 606, 616 (2d Cir. 1997). In the case at bar, this is the failing Juror 108 in effect admitted to and did not adequately take back. In light of this failing, we hold that the district court abused its discretion when it denied the defendants' for cause challenge to that juror.\n\nThis is not a case, moreover, in which, in spite of an erroneous refusal to strike a biased juror for cause, that biased juror was not in the end empaneled, so that \"the jury which was ultimately selected was fair and impartial.\" Towne, 870 F.2d at 885 (\"Since appellant has in no way established the partiality of the jury that ultimately convicted him, he may not successfully claim deprivation of his sixth amendment or due process rights.\"). That is, this is not a case in which, for example, an erroneous refusal to strike a biased juror for cause meant that the defendants had to use up one of their peremptory strikes to remove the offending juror from the pool. See Ross v. Oklahoma, 487 U.S. 81, 88 (1988) (\"[T]he fact that the defendant had to use a peremptory challenge to achieve [the result of an impartial jury] does not mean that the Sixth Amendment was violated.\"); United States v. Rubin, 37 F.3d 49, 54 (2d Cir. 1994) (holding that where an impartial jury was finally empaneled, the need to waste peremptory challenges to eliminate jurors whom the trial court should have removed for cause cannot be the basis of a Sixth Amendment challenge); see also United States v. Martinez-Salazar, 528 U.S. 304, 307 (2000) (\"[I]f the defendant elects to cure [a trial court's erroneous refusal to strike a juror for cause] by exercising a peremptory challenge, and is subsequently convicted by a jury on which no biased juror sat, he has not been deprived of any rule-based or constitutional right [i.e., of any right under the Sixth Amendment or under the Due Process Clause applied in connection with the Federal Rules of Criminal Procedure].).\"\n\nWe are faced, instead, with a case in which the district court's erroneous refusal to strike Juror 108 on account of his bias, together with its other jury selection actions (to be discussed in due course), wrongly resulted in the empanelment of a jury on which the biased juror sat. Consequently, the defendants in this case were convicted, in contravention of the Sixth Amendment and due process, by a jury that cannot be deemed to have been fully impartial. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\n2. The Significance of Defendant's Consent to the Seating of Juror 108\n\nThe district court's error in failing to strike Juror 108 for cause, coupled with its subsequently empaneling the biased juror, would ordinarily require us, without further analysis, to vacate the judgment of conviction and remand the case for a new trial before an unbiased fact finder. This case, however, presents an additional and crucial complication, namely that the defendants -- after originally objecting to the district court's failure to dismiss Juror 108 for cause -- subsequently did not merely fail to challenge the plan by means of which the district court placed Juror 108 on the main jury panel. Instead, they, both through their counsel, and by their own direct personal statements, expressly consented to the scheme.\n\nThe government argues that this express consent constituted a waiver -- that is, the \"intentional relinquishment or abandonment of a known right,\" Johnson v. Zerbst, 304 U.S. 458, 464 (1938) -- of the defendants' objections to the district court's refusal to strike Juror 108 for cause. And the same consent, the government asserts, also negated whatever possible objections the defendants might have had to the failure of impartiality that might have been imparted to the jury as a result of empaneling Juror 108. As the government points out, a mere forfeiture, or failure timely to assert a right, does not preclude appellate review for \"plain error\" under Fed. R. Crim. P. 52(b), but a waiver bars even this highly deferential form of reexamination. United States v. Olano, 507 U.S. 725, 733 (1993); see also United States v. Yu-Leung, 51 F.3d 1116, 1121 (2d Cir. 1995) (\"[F]orfeiture does not preclude appellate consideration of a claim in the presence of plain error, whereas waiver necessarily `extinguishes' the claim altogether.\" (quoting Olano, 507 U.S. at 733)) Thus, the government contends, that the defendants, by agreeing to the plan that placed this juror on the panel, have extinguished the Sixth Amendment and due process rights that they now seek to assert on appeal. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nWe reject the government's argument. First, we have substantial doubts about whether the right to be tried by an impartial tribunal is waivable, at least once a for-cause challenge has been made. Moreover, we conclude that, even if the right is waivable, the defendants' acceptance of an improper jury selection plan, only one part of which involved the empaneling of Juror 108, does not constitute a valid waiver.\n\nSome time ago, we indicated in powerful dicta that the right to an impartial fact finder might be inherently unwaivable. We said: It has been asserted that a defendant cannot waive those rights without enforcement of which the proceedings against him would be fundamentally unfair. Among such non-waivable rights would be the right to be tried by an impartial tribunal, the right to be tried by a court free from mob domination-- and the right not to be convicted solely upon the basis of a coerced confession. Perhaps Mr. Justice Frankfurter was referring to this concept of non-waivable rights when he said [that ordinary principles of waiver] `do not touch one of those extraordinary cases in which a substantial claim goes to the very foundation of a proceeding . United States v. Fay, 300 F.3d 345, 350-51 (2d Cir. 1962) (quoting Brown v. Allen, 344 U.S. 443, 503 (1993) (internal citation omitted and emphasis added). \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nIn expressing our continued allegiance to this dicta, we begin by making clear what we do not question. Thus we do not take issue with the uncontestable principle, applied in any number of cases dealing with any number of contexts, that even mere forfeiture of claims, including claims that attack the fundamental fairness of criminal proceedings, precludes all but plain error review of district court decisions. See generally Olano, 507 U.S. at 732. Nor do we assert that the technical requirements of Fed. R. Crim. P. 24(c), which govern the selection of alternate jurors and their movement onto the main panel, are unwaivable. See, e.g., United States v. Viserto, 596 F.2d 531, 539-40 (2d Cir. 1979) (finding express consent to a technical deviation from these procedures to constitute a valid waiver of the defendants' right to challenge this deviation on appeal); United States v. Josefik, 753 F.2d 585, 588 (7th Cir. 1985) (same); United States v. Baccari, 489 F.2d 274, 275 (10th Cir. 1973) (same); Leser v. United States, 358 F.2d 313, 317 (9th Cir. 1966) (same). Similarly, we, of course, do not suggest that the right to trial before an impartial jury cannot be waived in favor of trial by an impartial judge, or, indeed, waived altogether in favor of a guilty plea. See Singer v. United States, 380 U.S. 24, 36 (1965) (discussing the waiver of a jury trial in favor of a bench trial); McCarthy v. United States, 394 U.S. 459 (1969) (discussing the circumstances in which a guilty plea waives the right to stand trial). And we do not imply that all claims of structural error (of error that requires automatic reversal rather than harmless error review) are unwaivable. See Freytag v. Comm'r of Internal Revenue, 501 U.S. 868, 896 (1991) ( Scalia, J., concurring in part and concurring in the judgment) (arguing that many forms of structural error may for many purposes be waived). Finally, we do not assert that the presence of a possibly biased juror, whose bias has never been challenged by defendants at voir dire, necessarily taints the jury panel. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nInstead of addressing these or other broader questions, we limit our concern to the very narrow set of facts before us. Where the trier of fact in a criminal trial is a biased jury that resulted from a district court's erroneous failure to grant a for-cause challenge to an actually biased juror whose bias was revealed at voir dire, we question whether a defendant can subsequently waive his claim that he has been deprived of the right to be tried before an impartial fact finder. At the root of our concern is the fundamental, indeed foundational, role impartiality plays in our system of courts. Thus, quite apart from offending the Sixth Amendment, trying an accused before a jury that is actually biased violates even the most minimal standards of due process. See In re Murchison, 349 U.S. 133, 136 (1955) (\"A fair trial in a fair tribunal is a basic requirement of due process.\"); cf. In re Oliver, 333 U.S. 257 (1948); Tumey v. Ohio, 273 U.S. 510 (1927).\n\nHaving said all of this, we do not need to decide today whether in every such case the seating of a clearly biased juror who had earlier been challenged is unwaivable. For it is clearly the case that, even if such an act is waivable, the waiver must be totally free and uncoerced and any consideration given for the consent must be utterly free from taint. It must be so to overcome what the Supreme Court has called the \"presumption against the waiver of constitutional rights.\" Brookhart v. Janis, 384 U.S. 1, 4 (1966). And we do not believe that the consideration given in this case comes close to meeting this test.\n\nIn the context most nearly analogous to the one before us -- the waiver, by guilty plea, of the right (among others) to trial by jury, see McCarthy v. United States, 394 U.S. 459 (1969) -- the presumption against a valid consent plays itself out in the form of the rule that a guilty plea is good only if \"entered by one fully aware of the direct consequences of [the plea], including the actual value of any commitments made to him by the court.\" Brady v. United States, 397 U.S. 742, 755 (1970) (internal quotation marks omitted). Accordingly, a guilty plea -- and the waiver of the right to trial by jury accomplished by the entry of that plea -- may be invalidated if it is \"induced by . . . misrepresentation (including . . . unfulfillable promises), or, perhaps, by promises that are by their nature improper.\" Id. (internal quotation marks omitted). That is, as Brady says, the quid pro quo must be both fullfilable and proper. Thus, a guilty plea obtained by promising a defendant cigarettes, liquor, or unlimited \"spousal\" visitation rights, even if these promises were fulfillable, would not stand.\n\nWith these requirements in mind, and to see whether the consent given to the seating of Juror 108 was valid, we must examine what the defendants were offered in exchange for their waiver.\n\n3. The Race- and-Religion-Based Reshuffling of the Jury.\n\nAt the close of the orderly process of jury selection, the district court faced a jury that it viewed as insufficiently racially and religiously diverse. When one of the empaneled jurors was excused because of illness, the district court formulated a novel plan in order to cure this perceived defect. As is by now familiar, the court sua sponte removed a second, and white, juror from the main panel and then filled the two newly open places on the jury with an African-American and a Jewish juror (Juror 108) respectively, both of whom were selected from the list of alternate jurors out of order. Furthermore, the record leaves no room for doubting that it was the jurors' race and religion that motivated the district court's choice of which juror to remove from the main panel and its decision to move the two chosen alternate jurors onto the main panel ahead of the non-African-American, non-Jewish jurors who were next in line. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nWhat the district court did in its effort to achieve a racially and religiously balanced jury was unquestionably highly unusual. It was also improper. The error is made plain by the reasoning behind Batson v. Kentucky, 476 U.S. 78, 89 (1986), and Georgia v. McCollum, 505 U.S. 42, 59 (1992), in which the Supreme Court held that neither prosecutors nor defendants could, without violating the Equal Protection Clause, exercise peremptory strikes on the basis of race. After these cases it is beyond peradventure that the racial and religious reconstruction of the jury that occurred in this case could not constitutionally have been achieved at the instigation of the parties. And what the district court could not allow the parties to do, it also could not do of its own motion even with the consent of the parties. Indeed, the violation of equal protection that occurs when a person is excluded from a jury on the basis of his race (or religion) would seem only to be made more serious when the exclusion occurs at the behest not just of the parties but of the court itself, whose duties under the Equal Protection Clause are particularly strong. And, although the motives behind the district court's race- and religion-based jury selection procedures were undoubtedly meant to be tolerant and inclusive rather than bigoted and exclusionary, that fact cannot justify the district court's race-conscious actions. The significance of a jury in our polity as a body chosen apart from racial and religious manipulations is too great to permit categorization by race or religion even from the best of intentions.\n\nAs the Supreme Court has said, \"[t]he Fourteenth Amendment's mandate that race discrimination be eliminated from all official acts and proceedings of the State is most compelling in the judicial system.\" Powers v. Ohio, 499 U.S. 400, 415 (1991). \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Indeed, so central is equal protection to the legitimate functioning of the courts and specifically of juries that Congress has enacted a separate statute mandating that \"[n]o citizen possessing all other qualifications which are or may be prescribed by law shall be disqualified for service as grand or petit juror in any court of the United States, or of any State on account of race, color, or previous condition of servitude.\" 18 U.S.C. § 243. This statutory prohibition, as the Supreme Court has said, \"makes race neutrality in jury selection a visible, and inevitable, measure of the judicial system's own commitment to the commands of the Constitution,\" and accordingly, \"[t]he courts are under an affirmative duty to enforce the strong statutory and constitutional policies embodied in that prohibition.\" Powers, 499 U.S. at 416. There can be no doubt that the district court's race- and religion- based jury reconstruction (no matter how well motivated) directly violated this affirmative duty and hence was unacceptable.\n\nThis is so, moreover, regardless of whether the racial and religious jurymandering engaged in by the court formally violated the Equal Protection Clause, or simply came to the very edge of doing so. For, even if such actions were not unconstitutional, they would still be sufficiently inappropriate to a federal court as to be subject to our inherent supervisory authority. Our authority over the district courts, though \"not a form of free-flowing justice, untethered to legal principle\" does allow us to \"ensure that fair standards of procedure are maintained\" and \"to review procedures used in federal courts [without being] limited to ascertaining whether they are constitutionally valid.\" United States v. Ming He, 94 F.3d 782, 792 (2d Cir. 1996) (citing McNabb v. United States, 318 U.S. 332, 340 (1943)).\n\nThe government contends, however, that since in this case the parties agreed to the racial and religious reconstruction of the jury, as they undoubtedly did, whatever objections (either constitutional or otherwise) exist to the court's action have been waived and cannot now be raised. The difficulty with this argument is that, if it were to be countenanced, parties could always, with the court's consent, empanel a jury that was of precisely the racial and religious mix that they wished. If the court was of like mind, there would be nothing to stop civil litigants from agreeing, for example, that a contract or tort action between them should be heard by a jury composed only of members of their own racial or religious groups. And all Congress's and the Supreme Court's language about \"race neutrality in jury selection\" as a \"measure of the judicial system's commitment to the commands of the Constitution,\" Powers, 499 U.S. at 416, would be a dead letter. Of course, parties can, in appropriate situations, opt out of the judicial system - say by agreeing to arbitration. And if they do so, they can choose arbiters of whatever racial or religious sorts they wish. But that is totally different from bending the judicial system to their racial and religious preferences. For, unlike private institutions, the judicial system belongs not to the parties but to the nation.\n\nIt is for analogous reasons that the Supreme Court has treated as unwaivable a formally similar, if substantively very different, claim involving a threat to another set of judicial structures. In Freytag v. Commissioner of Internal Revenue, 501 U.S. 868 (1991), the Supreme Court considered a challenge, under the Appointments Clause of the Constitution, Art II, § 2, cl. 2, to the authority of the Chief Judge of the United States Tax Court to appoint Special Trial Judges to preside over tax disputes, pursuant to 26 U.S.C. § 7441. The Court reached the merits of this claim-in spite of the fact that the petitioners had waived it by consenting to appear before such a Special Trial Judge-and found that the petitioners' challenge invoked \"the strong interest of the federal judiciary in maintaining the constitutional plan of separation of powers.\" Freytag, 501 U.S. at 879 (internal quotation marks omitted). In effect, the High Court concluded, the importance of the petitioner's claim so implicated the very structural authority of the tribunal they contested that their claim could not be waived by their individual action. See also Glidden v. Zdanok, 370 U.S. 530, 535-36 (1941) (plurality opinion) (treating an Appointments Clause objection to judicial officers as unwaivable). In Freytag, as in the case before us, the parties, in concert with the relevant judge, could, absent unwaivability, persist in using an illegitimate decision maker to the permanent detriment of the nation's judicial system.\n\nPerhaps recognizing the fundamental problems that would adhere to permitting waivers of racially and religiously tested jurors, the government at oral argument in effect conceded that such arrangements should be forbidden in the future, regardless of the parties' consent. But it urged the court to permit the waiver, in view of the lack of express prior judicial disapproval of what had occurred, and to ratify, just this once, what the district court had done. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Thus at the first of two oral arguments held on this appeal, the following colloquy occurred:\n\nThe Government: There have been cases that this Court has essentially decided that certain procedures were improper and would not be condoned in the future on a prospective basis. That's happened. And this might be such a case.\n\nThe Court: How do we do that? Do we say that in this case [we affirm the conviction below] but in the future, if the prosecution agrees to something like this, it is acting at its peril because in the future we will reverse?\n\nThe Government: Sounds good.\n\nThe Court: What?\n\nThe Government: Sounds good.\n\nThe Court: Sounds better to you than it does to me, maybe.\n\nThe Government: Read it over a few times. You'll get used to it, Judge. Oral Argument Tr., May 3, 2000, at 48-49.\n\nIn the end, however, we need not decide whether the government's \"prospective only\" proposal should be accepted. As with the question of whether a jury, chosen as this one was, is unconstitutional or simply subject to reproval under our supervisory authority, no answer is needed to decide the case before us. This is so because of the presence on the final jury of a juror, number 108, whom we have found to be biased. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\n4. The Combined Effect of Juror 108 and of Race- and Religion-Based Reshuffling of the Jury.\n\nThe defendants before us did not consent to the empaneling of Juror 108 standing alone. They agreed to his seating only in the context of the district court's larger scheme to secure a jury that displayed the racial and religious diversity that the district court desired. In effect, the defendants, at the district court's prompting, consented to the placement of Juror 108 on the panel in exchange for the assignment to the panel, of an additional African-American juror in the place of a different white juror who would otherwise have been seated. This exchange, however, was improper, because the benefit to be received by the defendants in connection with the exchange -- the replacement by the court of a white juror with an African-American juror solely on the basis of race -- was itself improper. And this impropriety invalidated any waiver of the defendants' complaint concerning Juror 108's bias that might otherwise be found in their acceptance of the district court's larger plan. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nWe conclude that the district court erred in declining to remove Juror 108 from the jury for actual bias, and that the defendants' acceptance of the district court's jury-packing scheme (which placed Juror 108 on the jury) did not constitute a valid waiver of that error and of their claim of unconstitutional bias in the jury before which their case was tried. That is, we hold that a waiver to a juror's impartiality cannot be accepted when it was obtained by the promise of seating a jury with what the defendants apparently believed were \"desirable\" racial characteristics. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nC. Remaining Issues.\n\nIn addition to presenting the claims we have discussed in the preceding parts of this opinion, the defendants raise a series of other challenges to their convictions and sentences. All but two of these are rendered moot by our conclusion that the invalidity of the jury that convicted the defendants requires that we vacate their convictions and remand the case for a new trial. The two remaining challenges -- which argue that defendant Nelson's prosecution in federal court following his acquittal on New York State second degree murder charges violated double jeopardy and that defendant Price's prosecution for aiding and abetting rested on a legally insufficient theory of liability -- ask us to order that verdicts of acquittal be entered. Because they seek more than the new trial that we are granting to the defendants, we must consider the arguments on which they depend. Since, however, both challenges are straightforwardly meritless, neither needs detain us long.\n\nEven assuming that defendant Nelson's state prosecution for second degree murder and his federal prosecution under 18 U.S.C. § 245(b)(2)(B) satisfy the \"same elements\" test for double jeopardy established in Blockburger v. United States, 284 U.S. 299, 304 (1932), his double jeopardy claim fails in light of the doctrine of dual sovereignty, under which a defendant in a criminal case may constitutionally be prosecuted by different sovereigns for the same offense. See, e.g., Heath v. Alabama, 474 U.S. 82, 88-89 (1985).\n\nAn exception to the dual sovereignty doctrine does exist for cases in which \"one of the sovereigns effectively controlled the other, and the subsequent prosecution was merely a sham, masking a second prosecution by the sovereign that pursued the first prosecution.\" See United States v. Arena, 180 F.3d 380, 399 (2d Cir. 1999) (citing Bartkus v. Illinois, 359 U.S. 121, 123-24 (1959)). But that exception plainly does not apply in the case at bar. There is simply no evidence that the State of New York manipulated the federal government into engaging in the present prosecution. And this prosecution manifestly serves a clear and strong federal interest, namely the protection of civil rights. See United States v. All Assets of G.P.S. Auto. Corp., 66 F.3d 483, 495 (2d Cir. 1995) (\"[T]he Bartkus exception . . . applies only in an extraordinary type of case, perhaps only when one sovereign has essentially manipulated another sovereign into prosecuting.\" (internal quotation marks and citations omitted)); United States v. Davis, 906 F.2d 829, 832 (2d Cir. 1990) (noting that where \"the state proceeding has not adequately protected the federal interest,\" \"nothing prevents a [subsequent] federal prosecution\"). \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nEqually meritless is defendant Price's claim that the causal link between his speech at the scene of the accident that led to the rioting and violence and the eventual attack on Rosenbaum is insufficient, as a matter of law, to support his aiding and abetting liability for that attack. Under 18 U.S.C. § 2(b), a person may be convicted as a principal in connection with an offense if he \"willfully causes an act to be done which if directly performed by him or another would be an offense against the United States.\" And we have held that this statute \"adopts the general principal of causation in criminal law that an individual (with the necessary intent) may be held liable if he is a cause in fact of the criminal violation, even though the result which the law condemns is achieved through the actions of . . . intermediaries.\" United States v. Concepcion, 983 F.2d 369, 383-84 (2d Cir. 1992) (emphasis added and internal quotation marks omitted). The evidence presented at trial was unquestionably sufficient for a reasonable jury to find that Price's speech at the scene of the accident -- which transformed a crowd that was neither unified nor particularly out of control into an explosive mass -- was a cause in fact of the eventual assault.\n\nIII. CONCLUSION\n\nWe hold that 18 U.S.C. § 245(b)(2)(B) -- as applied to religiously or racially motivated attacks against Jews -- is a constitutional exercise of the Congress's power under the Thirteenth Amendment. In addition, we hold that the statute applies to behavior of the type that the government charged the defendants with committing, and that the evidence presented at trial was sufficient to allow the jury to return its verdict of conviction. We next hold that the district court erred in empaneling a juror whose answers at voir dire clearly displayed actual bias, and that as a result the jury that convicted the defendants failed both the Sixth Amendment's and the Due Process Clause's requirement of impartiality. We further hold that the trial court's race- and religion-based reconstruction of the jury, whatever its motivation, is impermissible in light of the courts' special commitment to equal protection. We finally hold, in view of this impermissibility, that the defendants' consent to the plan as a part of which the biased juror was empaneled did not constitute a valid waiver of their claim that the jury before which they were tried was improperly partial.\n\nAccordingly, the judgment of conviction of the district court is VACATED, and the case is REMANDED for retrial before a properly chosen, impartial jury.\n\nF.I. PARKER, Circuit Judge, dissenting in part and concurring in part:\n\nI wholly concur with Section II.B. of the majority opinion, which vacates the conviction because of the inappropriate way in which the jury was selected. I also concur in the majority's conclusion in Section II.A. that 18 U.S.C. § 245(b)(2)(B) represents a constitutional exercise of Congress's power under the Thirteenth Amendment to the United States Constitution, although I disagree with a portion of the reasoning in support of that conclusion. I also respectfully dissent from the majority's analysis of the meaning of the word \"because\" in section II.A.1.C. and its conclusion in Section II.A.2.B.(b) that the government presented sufficient evidence that this crime was committed because of the fact that Yankel Rosenbaum (\"Rosenbaum\") was using a public street at the time he was attacked. I concur in the remainder except as otherwise specifically noted in this partial dissent.\n\nI. The Constitutionality of 18 U.S.C. § 245(b)(2)(B) under the Thirteenth Amendment.\n\nI agree with that portion of the majority's analysis which concludes that the Thirteenth Amendment provides Congress with the authority to prohibit violent acts directed at persons by virtue of their religion. In other words, I agree that Congress's power to enforce the elimination of slavery in this country is not limited to enslavement, or its badges and incidents, by virtue of race.\n\nI do not agree with the majority's statement, however, that there is \"strong precedent\" [29/1] to support the view \"that the Thirteenth Amendment extends its protections to religions directly and thus to members of the Jewish religion, without\" regard to race. The fact is that the Thirteenth Amendment was enacted in response to the enslavement of African-Americans in this country, and congressional enactments pursuant to the Amendment have been directed at the plight of African- Americans in the aftermath of that enslavement. It is not surprising, therefore, that the case law has addressed itself to situations arising out of racial rather than religious or other discrimination. Precedent suggesting that the Thirteenth Amendment is not restricted to racial animus is limited. We have the dicta in Griffin v. Breckenridge, 403 U.S. 88, 102 (1971), that \"perhaps otherwise class-based, invidiously discriminating animus\" may be addressed under the Thirteenth Amendment, and the fact that in United States v. Kozminski, 487 U.S. 931 (1988), protection against involuntary servitude was addressed without consideration of the class to which the victims belonged.\n\nHowever, it is beyond dispute, as the opinion states, that the Thirteenth Amendment does not make any reference to race. It abolishes \"slavery\" and \"involuntary servitude.\" Given the fact, pointed out in the majority opinion, that throughout history enslavement has occurred without regard to race, there is every reason to conclude that the Thirteenth Amendment is not limited to slavery that is imposed by virtue of race.\n\nNor do I agree with that portion of the majority's analysis which indicates that because Jews were considered to be a race at the time of the enactment of the Thirteenth Amendment, Congress has the power to provide religious protection under § 245(b)(2)(B). If the power of Congress, under the Thirteenth Amendment, were limited to providing protection by virtue of race, then the fact that Jews were considered a race in the mid-Nineteenth Century does not seem to me to support the enactment of a statute which provides religious protection in the mid-Twentieth Century when Judaism was considered a religion. This I think is especially true since this entire case was tried as a religious discrimination case, not a race discrimination case. However, since, as I indicated above, I believe that the Thirteenth Amendment provides congressional power to prohibit imposition of the badges and incidents of slavery on the basis of religion, I agree with the majority's conclusion that § 245(b)(2)(B) is constitutional. I do not, however, concur in footnote 29 on page 59, which is wholly dicta and in no way affects the results in this case.\n\nII. Motive--Use of a Public Facility.\n\nThe defendants argue that there is insufficient evidence to support a finding that the defendants acted \"because\" the victim Rosenbaum was \"enjoying any . . . facility . . . provided or administered by any State or subdivision thereof,\" 18 U.S.C. § 245(b)(2)(B), that is, that the violence occurred in part because the victim was using a public street. The majority opinion disagrees with that argument in part on the basis of statutory construction contained in section II.A.1.C. and in part on the basis of the jury's ability to draw inferences of intent from the circumstantial evidence presented. (Section II.A.2.B.(b).) I cannot agree with either portion of the majority opinion.\n\nThe majority first goes astray, in my view, when it concludes that the meaning of the word \"because\" in 18 U.S.C. § 245(b)(2)(B) is anything but plain, i.e. ambiguous. The argument proceeds from the sound observation that \"[c]ausation is one of the most famously complicated concepts in language and in law.\" [46/13] The opinion refers by way of example to \"cause in fact,\" \"but for\" cause, \"proximate\" or \"legal\" cause and \"causal link or tendency,\" [47/2-5] used in modern tort law. This is all very well but does little to further the inquiry of the meaning of the word \"because\" which appears in the criminal statute at issue here and seems to have suffered not at all from the complications surrounding the word \"cause.\" In fact, \"because\" does not even appear as a defined word in either Black's \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e or Bouvier's \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Law Dictionaries. This suggests to me at least that the word should be given its ordinary, uncomplicated meaning.\n\nBecause is defined in Webster's Third International Dictionary as a preposition \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e as \"by reason of: on account of.\" Webster's Third International Dictionary 194 (14th ed. 1961). This I take to be the word's plain meaning and I therefore disagree with the majority's view that \"the face of the Act is inescapably ambiguous . . . .\" [47/11] I do, however, agree, as the majority points out, that \"[w]hen confronted with a statute which is plain and unambiguous on its face, [a court] ordinarily do[es] not look to legislative history as a guide to its meaning.\" (citations omitted). [46/7-8]\n\nThere are significant consequences to applying the plain meaning of \"because\" to § 245(b)(2)(B). First, it avoids the necessity of looking to legislative history, which I will later discuss as being highly ambiguous in itself when applied to this statute. This means that all of the majority opinion running from page 48/1 to 53/1 is unnecessary to the determination of the meaning of the word because.\n\nSecondly, it avoids what to me seems an oddly anomalous (if not bizarre) characterization of the statute as containing \"two distinct kinds of discriminatory attitudes with respect to the victim,\" [63/8-9] one being a motive and the other an intent, both springing from the identical word -- \"because.\" If one simply gives because its plain, unambiguous meaning -- \"by reason of\" or \"on account of\" -- one concludes that the statute deals not with intent, but with motive. See State v. Corrigan, 195 N.Y. 1, 12, 87 N.E. 792 (1989) (distinguishing motive as \"that which incites or stimulates a person to do the act\" and intent as \"the purpose as a particular means to effect [a] result\" (internal citations and quotation marks omitted)).\n\nThere is nothing whatsoever on the face of the statute which would suggest that the word \"because\" used in the phrase (2) any person because of his race, color, religion or national origin and because he is or has been -- . . . .\n\nwas intended to convey two different concepts -- motive in the first instance and intent in the second. Since the majority agrees that the first use of because connotes motive [63/9], see also United States v. Bledsoe, 728 F.2d 1094 (8th Cir. 1984) (finding first use of because connotes motive), it naturally follows that the second use does as well, there being nothing in the statute to suggest otherwise.\n\nFurthermore, if one does look at the legislative history (which one need not and should not), the result is anything but clear. For starters there is the fact that the statute initially covered acts done \"while\" the person was using public facilities. S. Rep. 90-121 at 7 (1968), reprinted in 1968 U.S.C.C.A.N. 1837, 1844. The word \"while\" was removed in favor of \"because,\" resulting in a requirement that the government provide some evidence of motivation or as the Senate Committee on the Judiciary put it \"a purpose to interfere with the activity.\" Id. The majority's analysis effectively reamends the statute to remove the because and put the while back in by creating an ambiguity which does not exist and further creating two different meanings of because.\n\nThe majority does, of course, point to instances in the Senate report where the word \"intent\" rather than \"motive\" is used. The terms motive and intent are often used interchangeably and I would attribute the use of \"intent\" in the legislative history to less than rigorous attention to the distinction. In any event, the legislative history is at best ambiguous on the point and there is no reason to resort to it.\n\nThe majority suggests that the Circuit Courts in which the \"dual intent requirement\" has been considered \"have adopted statutory constructions consistent with, if occasionally less specific than, the construction we adopt.\" [57, n. 25/1-13] The cases cited by the majority appear to me equivocal at best, and perhaps even supportive of the interpretation of the dual use of \"because\" that I urge. See United States v. Woodlee, 136 F.3d 1399, 1405 (10th Cir. 1998) (addressing the only element of § 245(b) under contention, whether bodily injury resulted, not the elements \"because of [the victim's] race . . .\" or \"because the [victim] was, or had been, enjoying a public facility\"); United States v. Makowski, 120 F.3d 1078, 1080 (9th Cir. 1997) (affirming conviction under § 245(b) where defendant-appellant shouted, inter alia, that the \"park belonged to the white man\" while beating Hispanic defendant who had been enjoying the use of a public park); United States v. Ebens, 800 F.2d 1422, 1428-29 (6th Cir. 1986) (rejecting defendant's challenge that there was insufficient evidence \"that his purpose was to injure, intimidate, and interfere with [the victim's] right to enjoy a place of public accommodation\" where \"[t]he jury could further have found that [the defendant's] remarks were intended to make [the victim's] remaining on the premises uncomfortable and embarrassing and to intimidate and dissuade him from remaining on the premises . . . .\"), abrogated on other grounds by Huddleston v. United States, 485 U.S. 681 (1988); United States v. Price, 464 F.2d 1217, 1218 (affirming conviction and rejecting defendants's contention that \"the altercation only incidentally occurred on federal property\" where defendant confronted victim at public swimming facility, blocked the victim's access to his path of travel, and severely beat him and rendered him unconscious). Where the cases, like the legislative history, occasionally use the term \"intent,\" not \"motive,\" I again attribute the use of \"intent\" to less than rigorous attention to the distinction.\n\nThe result of using the plain meaning of the word because is important to the disposition. While it may be appropriate for a jury to infer that in these circumstances the defendants intended to interfere with Rosenbaum's use of the public street, there is no evidence whatsoever from which a jury could conclude that the motivating force behind defendants' actions was to prevent, deter, or even retaliate against the use of a public street. In fact, to the contrary, it is abundantly clear from the evidence that the motivating force for the actions taken was religion-based animus, pure and simple.\n\nOur system of law gives great deference to conclusions drawn by juries. However, we do not permit juries to speculate in order to draw their conclusions. Radiation Dynamics, Inc. v. Goldmuntz, 464 F.2d 876, 887 (2d Cir. 1972) (\"[I]t is the duty of the court to withdraw the case from the jury when the necessary inference is so tenuous that it rests merely upon speculation and conjecture.\") Given the complete absence of any evidence which would support an inference that the defendant Nelson, or the defendant Price, was impelled to act -- motivated -- by the fact that Rosenbaum was using the public street, the jury's conclusion to that effect was pure speculation. I would therefore reverse the judgment of the district court on that ground. In view of the fact, however, that this is a minority position, I wholeheartedly concur with the remainder of the majority's opinion, except as pointed out otherwise herein.\n\nStraub, Circuit Judge, dissenting in part:\n\nI concur in the majority opinion in almost all respects, including the holdings that 18 U.S.C. § 245(b)(2)(B) is constitutional and that the evidence was sufficient to meet the statutory requirements. The sole exception to my concurrence is my disagreement with the majority's decision to vacate the conviction on the grounds that the District Court failed to excuse a biased juror in order to maintain the jury's racial and religious diversity. Although the highly unusual and improper jury selection raises troubling issues, I do not believe that vacating the sentence provides a sensible remedy in this case. Instead, I favor the government's recommendation that we affirm this sentence, while noting our willingness to consider the possibility of vacatur in future cases, should they arise.\n\nThe majority opinion vacates the sentence on the related grounds (1) that since Juror 108 was biased, the District Court should have granted the defendants' for-cause challenge against him and (2) that the defendants' subsequent agreement to seat Juror 108 did not waive their earlier objection. The defendants did not waive this objection, the majority holds, because jury impartiality is unwaivable once a for-cause challenge has been made and, even if it were waivable, the defendants' acceptance of an improper jury selection plan would not constitute a valid waiver.\n\nI agree with the majority that the District Court should have granted the for-cause challenge. I also share the majority's view that the District Court's race-based jury decisions were improper and antithetical to our constitutional system of adjudication. I respectfully dissent, however, because the majority provides a remedy that compensates no injured party and benefits participants in the constitutionally suspect behavior. The defendants here did not just acquiesce in a jury that included Juror 108. Instead, they actively agreed to-and we must infer, decidedly preferred-the jury that ultimately judged them over the jury that otherwise would have determined their guilt or innocence. To my mind, this absolutely exceptional fact renders the remedy of a new trial unsuitable to the error which confronts us. Accordingly, I would hold that the defendants' behavior waived any challenge to the jury selection.\n\nI. The Defendants Chose a Jury With Juror 108\n\nOnly an appreciation of the circuitous route which led to the empaneling of Juror 108 can lead to an understanding of why the defendants' conviction should be left undisturbed. The defendants initially challenged for cause Juror 108, a Jewish man, based on his responses to individual voir dire, which indicated his sensitivity to Jewish concerns and his belief that nothing \"definitive\" came out of Nelson's state court trial. The District Court denied this challenge, and the defendants then requested that the District Court conduct further questioning of the juror. After some hesitation, the District Court ultimately agreed to conduct additional questioning of Juror 108 to ascertain the juror's ability to be impartial. The District Court told the juror \"to look into your heart and ask yourself whether you feel personal emotional internal pressures that would make it such that you couldn't give the defendant here a fair trial.\" The juror responded, \"I don't know. I honestly don't know.\"\n\nAs the majority opinion observes, our case law would normally require that this juror be excused. This is so because the juror, at least explicitly, never purged himself of the bias which he demonstrated during voir dire. But subsequent events leave little doubt that this was no normal case. Just prior to the start of trial, Juror number 108 was the fourth alternate and, depending on how things unfolded, may never have served as anything more than an alternate juror in the normal course of events. But Juror 108 became a full jury member not as a result of attrition as other members were excused, but because of an agreement among the prosecution, the defense, and the Judge.\n\nPrior to swearing the jury, the District Court suggested that they substitute the second and fourth (Juror 108) alternate jurors for two regular jurors (one of whom was excused by the court for illness). \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e Both the prosecution and defense agreed to the plan. Defense counsel conveyed on the record in open court that they had discussed the plan with their clients and had obtained their consent to this substitution:\n\nThe Court: Mr. Paster, do you want to put it on the record what you have discussed.\n\nMr. Paster: Yes, we have discussed matters that we have agreed upon this morning with our client and he consents to proceeding.\n\nMs. Caproni: Could you state specifically on the record what has been agreed to?\n\nMr. Paster: Sure if I put on my glasses, that juror number 37 previously sitting in seat seven will become alternate number six, that juror 61 has been excused by the Court for illness, that juror number 94 has become juror number 11, that juror number 108 has, therefore, become juror number 12, that the order of the alternates shall be juror 93, 107, 11, 117, 122 and then juror number, 37 being the last alternate flat [sic].\n\nThe Court: Is that satisfactory. Mr. Price, is that satisfactory to you?\n\nThe Defendant Price: Yeah.\n\nMr. Headley: In addition to, Mr. Nelson, has overheard everything that Mr. Paster has said, in addition to that I informed Mr. Nelson that it would result in a jury where there would be three African Americans on the jury and two Jews on the jury, and you know Mr. Nelson has consented to that.\n\nThe Court: Is that acceptable, Mr. Nelson?\n\nThe Defendant Nelson: Yes, Your Honor.\n\nThe Court: I think we are ready to begin.\n\nIn other words, the Judge, the prosecution and, critically, the defendants preferred to proceed to trial with this jury-notwithstanding the fact that Juror 108 was a member. But for this agreement, Juror 108 would have likely remained an alternate juror.\n\nWaiver is \"ordinarily an intentional relinquishment or abandonment of a known right or privilege.\" Johnson v. Zerbst, 304 U.S. 458, 464 (1938). \"When there is no constitutional or statutory mandate, and no public policy prohibiting, an accused may waive any privilege which he is given the right to enjoy.\" Schick v. United States, 195 U.S. 65, 72 (1904); see United States v. Pachay, 711 F.2d 488, 495 (2d Cir. 1983) (Meskill, J., concurring in the result) (\"Constitutional rights are guarantees, privileges secured to the individual, not directives of the sovereign mandating what is in the best interests of that individual. As such, those rights can usually be waived at the instance of the defendant.\"). The inquiry of whether there has been an intelligent waiver of a particular right \"must depend, in each case, upon the particular facts and circumstances surrounding that case, including the background, experience, and conduct of the accused.\" Zerbst, 304 U.S. at 464.\n\nHere, the facts of this case compel the conclusion that the defendants waived their opportunity to challenge the District Court's rejection of their cause challenge to Juror 108. I reach this conclusion not because the defendants failed to renew their challenge for cause after the District Court acceded to their request to conduct additional questioning of Juror 108, nor because they declined to exercise a peremptory challenge to strike Juror 108-although they in fact chose not to do both of these things. I would instead find waiver on account of the defendants' consent to and participation in the plan that led to the substitution of Juror 108 onto the main jury.\n\nIn this regard, I agree with Justice Scalia, concurring in United States v. Martinez-Salazar, that \"I would not find it easy to overturn a conviction where, to take an extreme example, a defendant had plenty of peremptories left but chose instead to allow to be placed upon the jury a person to whom he had registered an objection for cause, and whose presence he believed would nullify any conviction.\" 528 U.S. 304, 318-19 (2000). Our case tops Justice Scalia's extreme example. Here, rather than merely failing to act to exclude the questionable juror, the defense-counsel and defendant-actually consented to his serving on the main jury. To order a new trial under the facts presented in this case-which indicate a strategic decision on the part of the defendants to adopt the District Court's allegedly improper procedure with respect to jury selection-would, in effect, provide the defendants with yet another opportunity to challenge the composition of a jury to which they waived objection.\n\nIn reaching this conclusion, I have considered the Supreme Court's warning against \"`sandbagging' on the part of defense lawyers\" who may decline to object to a potentially unconstitutional trial procedure in order to manufacture reversible error. See Wainwright v. Sykes, 433 U.S. 72, 89 (1977). \"[T]he underlying policy against permitting defense attorneys to create the errors of which they later complain remains the same regardless of whether the attorneys realized and appreciated the constitutional implications of the position they advocated.\" United States v. Joshi, 896 F.2d 1303, 1307 n.3 (11th Cir.), cert. denied sub nom. Panchal v. United States, 498 U.S. 986 (1990). To find otherwise under the circumstances of this case would permit a defendant to manipulate the system and allow him to \"test his fortunes with the first jury,\" and assure him of a \"second round in the event of a conviction.\" McCrory v. Henderson, 82 F.3d 1243, 1247 (2d Cir. 1996) (defendant's failure to object to the discriminatory use of peremptory challenges prior to the conclusion of jury selection constituted a waiver of that objection).\n\nThe errors here are not properly categorized as structural, and therefore unwaivable, because they did not \"so fundamentally undermine the fairness or the validity of the trial that they require voiding its result regardless of identifiable prejudice\" and therefore, could not \"fall within Fulminante's classification of structural errors.\" Yarborough v. Keane, 101 F.3d 894, 897-98 (2d Cir. 1996) (citing Arizona v. Fulminante, 499 U.S. 279, 309-10 (1991), cert. denied, 520 U.S. 1217 (1997)). When one considers the overall circumstances and conditions of this trial, we can have overwhelming confidence in the fairness and validity of its verdict. Even if Juror 108 showed potential bias during voir dire, the presence of this one possibly biased juror did not fundamentally undermine the validity of the criminal trial. Our interest in fairness and accuracy was secured by the other protections afforded these defendants. This includes the presence of eleven other jury members, the strong guidance of the Judge's jury instructions and, above all, the defendants' own ability to refuse to endorse and ratify the agreement by which Juror 108 took a seat on the jury. On the exceptional facts of this case, I cannot conclude that the presence of Juror 108 on the jury fundamentally undermined the validity and fairness of the defendants' trial.\n\nWhile the final jury may well have been chosen with race and religion in mind, it was a jury which all parties to the proceeding regarded as a better adjudicator of guilt and innocence than the alternative jury to be chosen by the strict dictates of Fed. R. Crim. P. 24(c). I believe that the defendants' participation in a plan to empanel Juror 108, where such participation was undoubtedly active, intelligent, and voluntary, should act as a waiver of any objection the defendants might have had to the impartiality of that juror based on voir dire. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nII. The Defendants' Waiver Was Valid.\n\nNor do I accept the majority's technical argument that the defendants' waiver was ineffective. The majority argues that since the waiver was premised on an improper exchange (both parties chose jurors on the basis of race and religion), we should not recognize the waiver. To my mind, we should deem the waiver ineffective only if our decision would further the public policy prohibiting the \"improper exchange.\" Although I agree that this highly unusual arrangement should not have been pursued by the defense or the government, let alone endorsed and encouraged by the District Court, I do not believe that vacatur provides a productive or sensible remedy in this case.\n\nThe remedy of ordering a new trial in response to race-based jury selection has found its most famous articulation in Batson v. Kentucky, 476 U.S. 79 (1986). There, the state prosecutor used peremptory challenges to strike four black persons-the only black persons-on the venire. When the defendant objected, the trial judge ruled that the parties could use their challenges to \"strike anybody they want to.\" Id. at 83. When the Supreme Court vacated the sentence and ordered a new trial, it offered three reasons why that misbehavior requires vacatur. First, the discriminatory conduct infringes a defendant's right to equal protection by denying him a jury of his peers. See id. at 86-87. Second, the discriminatory action injures the excluded juror by denying the person participation in jury service on account of his or her race. See id. at 87. Finally, the conduct harms the entire community by undermining public confidence in the fairness of the justice system. See id. at 87-88.\n\nIn light of the articulated injuries caused by the discriminatory jury selection, the Batson vacatur was a sensible outcome. The defendant, having been denied his equal protection, would be given his right to trial by jury chosen without racial prejudice. Moreover, the deterrent effect of such a remedy would serve to prevent the exclusion of future jurors based on race and, by eliminating this practice, restore and safeguard the public's confidence in the criminal justice system.\n\nIt seems to me that we should deem the waiver ineffective, and as a corollary require retrial, only when such a decision furthers one of these interests. But none of these reasons supports giving retroactive effect (i.e., voiding the defendants' waiver) to the rule announced by the majority. In this case, unlike in Batson, the defendants themselves participated in and agreed to the plan that empaneled Juror 108. This forecloses any claim that they suffered injury, or at the very least estops them from asserting this claim. See Minetos v. City Univ. of N.Y., 925 F. Supp. 177, 185 (S.D.N.Y. 1996) (holding that \"equity does not favor granting [the plaintiff] a new trial\" on account of defendants' Batson violation where the plaintiff herself violated Batson.) The Constitution does not require that we reward defendants for constitutional violations in which they themselves participated. See, e.g., United States v. Boyd, 86 F.3d 719, 724 (7th Cir. 1996) (\"Important social interests allow a judge to block the defense from taking certain action . . . . It does not follow that by violating these important social interests a defendant can help himself to a new trial.\"), cert. denied, 520 U.S. 1231 (1997). We do not, for example, permit a defendant to challenge evidence, the introduction of which he himself requested for strategic reasons, see United States v. Moskowitz, 215 F.3d 265, 270 (2nd Cir. 2000), cert. denied, 531 U.S. 1014 (2000), or challenge the admissibility of hearsay statements of a non-appearing witness where the defendant himself acted to prevent the witness from appearing, see U.S. v. Dhinsa, 243 F.3d 635, 651-52 (2nd Cir. 2001), cert. denied, - U.S. -, 2001 WL 1046926 (Oct. 1, 2001). In my view, we are dealing with a similar situation here, and these defendants do not deserve a second trial given their own conduct.\n\nWe are then left with the injuries to the excluded juror and to the community. For these purposes, a prospective rule against such behavior suffices, with no additional benefit to ordering retrial in this case. The excluded juror will not participate in a new trial. And the injury to the community's confidence in the system-if this practice is indeed widespread-can be averted by a prospective rule prohibiting this type of race and religion based jury selection. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nTherefore, I see no reason in law or public policy to view the defendants' waiver as ineffective. Although we should discourage this type of behavior in the future, ensuring this systemic interest does not require deeming these defendants' waiver ineffective. Neither judicial precedent nor public policy requires that the defendants receive compensation for an \"injury\" to which they not only acquiesced, but actually favored and desired. Insofar as the majority raises systemic concerns and wishes to ensure that district courts refrain from such jury practices in the future, a prospective warning would suffice. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Deeming the defendants' waiver ineffective does not enhance the deterrent value of our prohibition on race and religion based jury selection over a prospective rule to that effect.\n\nAs I see it, requiring a retrial needlessly prolongs the pain of the community and families who were victimized by the defendants' crimes. A retrial is neither deserved by the defendants nor required to safeguard the validity and fairness of our system of justice. The adoption of a prospective rule would not, as the majority suggests, operate to condone the District Court's choices. It would instead recognize that we should match our remedies to the injuries we seek to ameliorate. For all of the foregoing reasons, I respectfully dissent and would affirm the defendants' convictions.\n\n\u003cspan class=\"fn\"\u003e1. Kingston Avenue is a predominantly Jewish commercial street.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. After he had been arrested and had received his Miranda warnings, Nelson admitted to police detective Edward Brown that he had stabbed Rosenbaum. Nevertheless, when asked whether he had stabbed Rosenbaum because Rosenbaum was Jewish, Nelson continued to deny this motive, saying \"no, I was just high from the beer,\" and \"[n]o, that's not why I did it. I just got caught up in the excitement.\" (Tr. 1994, 2018).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., The Crown Heights Acquittal, N.Y. Times, Oct. 31, 1992, at A20; Is This Justice? Why the Nelson Verdict Rankles, N.Y. Newsday, Oct. 31, 1992, at 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The court was referring to the 1992 state court trial in which a jury that included no African Americans acquitted four white Los Angeles police officers of criminal charges arising out of their videotaped beating of an African-American motorist, and to the widespread rioting that occurred after the verdict. See, Richard A. Serrano, All 4 Acquitted in King Beating, L.A. Times, Apr. 30, 1992, at A1; Marc Lacey \u0026 Shawn Hubler, Rioters Set Fires, Loot Stores, L.A. Times, Apr. 30, 1992, at A1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Similarly, the district court said that Until [the] case goes forward and the public receives -- well, if there was a jury with three blacks, two Jews, two minorities, a mix of America and they came to a resolution and we actually respect it for the same reasons we did not respect the first verdict in the Rodney King and I did not respect the verdicts as a prosecutor in two cases involving the killings of young African Americans . . . and for the same reason that we are here today, because the first jury here was not representative of the community. [Based] on my experience as a prosecutor, that is probably the critical issue in any decision to bring the second case. (Tr. 759).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This account, although complete in all material respects, represents a somewhat simplified description of the chain of events in the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Ex Post Facto Clause requires application of this prior version of the Guidelines, i.e., the version in effect at the time Nelson committed the crime, rather than the version in effect on the date he was sentenced, because an intervening amendment to the Guidelines would have increased Nelson's base offense level by 1. See United States v. Fitzgerald, 232 F.3d 315, 318-19 (2d Cir. 2000) (per curiam).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Nelson and Price objected that the underlying conduct was voluntary manslaughter, which carries a base offense level of 25. See U.S.S.G. § 2A1.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The State Action Doctrine refers to the constitutional guarantee under Section One of the Fourteenth Amendment that \"no State shall deprive any person of `life, liberty, or property, without due process of law,' nor deny to any person `equal protection of the law,'\"Morrison, 529 U.S. at 619 (internal citation omitted), and requires that the wrongful conduct of private individuals have some connection to state authority to be actionable under the Fourteenth Amendment, see Civil Rights Cases, 109 U.S. at 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Morrison, the Court, referring to the \"time-honored principle that the Fourteenth Amendment, by its very terms, prohibits only state action,\" Morrison, 529 U.S. at 621, concluded that Section Five of the Fourteenth Amendment did not authorize the particular congressional creation of a federal civil remedy for the victims of private gender-motivated violence established by the Violence Against Women Act of 1994, § 40302, 108 Stat. 1941-42, 42 U.S.C. § 13981. In so doing, the Court appears to have rejected the position that United States v. Guest, 383 U.S. 745 (1966), and District of Columbia v. Carter, 409 U.S. 418 (1973), had effectively overruled Harris and the Civil Rights Cases and had held that Congress can, under Section Five of the Fourteenth Amendment, reach actions taken by private individuals. See Morrison, 529 U.S. at 624 (stating that \"[w]e accordingly have no hesitation in saying that it would take more than the naked dicta contained in Justice Clark's opinion [in Guest], when added to Justice Brennan's opinion [in Guest], to cast any doubt upon the enduring vitality of the Civil Rights Cases and Harris,\" and that Carter's reference to the Guest opinions \"is of course entirely dicta, and in any event cannot rise above its source\"). Nevertheless, the precise scope of the rule laid down by Morrison, and in particular the question of that rule's implications for the relationship between the State Action Doctrine, as it applies to Section One of the Fourteenth Amendment, and the limits of congressional power, under Section Five, to reach private action as a way of furthering Section One's prohibition on State action, is not ultimately decided by Morrison. Indeed, Morrison leaves this door open by relying upon the description of Congress's Section Five powers in the Civil Rights Cases, which construe the ability of Congress to regulate private action as permissible so long as its legislation is sufficiently tied to remedying prohibited exercises of state authority and thereby imply a case-by-case analysis, as well as by applying the \"congruence and proportionality\" test established in the City of Boerne v. Flores, 521 U.S. 507, 525, 530 (1997), which addressed whether particular congressional legislation was properly remedial rather than improperly declaratory of new substantive rights. See Morrison, 529 U.S. at 624, 625-26; see also Robert Post and Reva Siegel, Equal Protection by Law: Federal Antidiscrimination Legislation After Morrison and Kimel, 110 Yale. L.J. 441, 445 (arguing that rather than \"announcing a per se rule forbidding the use of Section 5 power to regulate private parties, [Morrison] is better read as requiring a case-by-case determination of whether Section 5 legislation is congruent and proportional to the constitutional violation it seeks to remedy\"). Because the question of Morrison's consequences for such Fourteenth Amendment arguments as the government initially presented in the case before us remains open, we note that the government's decision not to pursue its earlier argument involving Section Five of the Fourteenth Amendment does not amount to an active abandonment or rejection of that argument. Similarly, our decision not to reach the question whether Morrison precludes finding that § 245(b)(2)(B) is authorized under Section Five of the Fourteenth Amendment does not express any view as to that question's ultimate answer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See also Civil Rights Cases, 109 U.S. at 33 (Harlan, J., dissenting) (\"The terms of the thirteenth amendment are absolute and universal. They embrace every race which then was, or might thereafter be, within the United States.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Of course, as the Supreme Court itself has noted, the modern usage may well itself be a fiction, in the sense that it groups people into what are no more than socially constructed categories. See Saint Francis Coll. v. Al-Khazraji, 481 U.S. 604, 610 n. 4 (1987) (collecting references to biological and anthropological sources arguing that racial classifications are socio-political rather than biological).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Indeed, Justice Brennan concurred specially in order to make clear that, in his view, the majority's holding applied to all ethnic groups and that only \"discrimination based on birthplace alone is insufficient to state a claim under § 1981.\" Id. at 614 (Brennan, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The defendants try to defeat this conclusion by arguing that, whatever race meant in 1866, the 1968 Congress that included the language \"because of his race, color, religion or national origin\" in 18 U.S.C. § 245(b)(2)(B) gave the word \"race\" its modern usage and, consistent with this usage, aimed to protect Jews not as a race but as a religion. The defendants imply that because Congress, in enacting 18 U.S.C. § 245(b)(2)(B), intended to protect Jews as a religion and not as a race, and that because Congress's powers under the Thirteenth Amendment do not extend to protecting religions, the constitutionality of 18 U.S.C. § 245(b)(2)(B) as it was adopted cannot be upheld under the Thirteenth Amendment. And that that is so even if Congress could, under that Amendment, have protected Jews as a race had it chosen to do so. But quite apart from the fact that this argument fails because, the Thirteenth Amendment extends its protections against slavery to religions as well as to races, see infra, the argument confuses the category of persons that Congress may protect under the Thirteenth Amendment with the heading under which Congress acts in protecting such persons. And, especially where words -- that is headings -- change their meanings over time, it is the former, rather than the latter, that determines whether Congress has acted within or exceeded its constitutional powers. Cf. Kimel v. Fla. Bd. of Regents, 528 U.S. 62 (2000) (analyzing Age Discrimination in Employment Act of 1967 under the Fourteenth Amendment even though Congress did not explicitly state it was acting pursuant to that power); Jones v. United States, 526 U.S. 227, 232-33 (1999) (interpreting the federal carjacking statute, 18 U.S.C. § 2119, as defining three distinct offense even though the \"look\" of the statute suggested that it defined only one offense with three separate sentencing provisions); United States v. Kozminski, 487 U.S. 931, 939-40 (1988) (\"Federal crimes are defined by Congress, and so long as Congress acts within its constitutional power in enacting a criminal statute, this Court must give effect to Congress' expressed intention concerning the scope of conduct prohibited. Congress' power to enforce the Thirteenth Amendment by enacting § 241 and § 1584 is clear and undisputed. The scope of conduct prohibited by these statutes is therefore a matter of statutory construction.\"(internal citations omitted)); Griffin v. Breckenridge, 403 U.S. 88, 97, 104-05 (1971) (noting that, given its text, most courts had interpreted 42 U.S.C. § 1985(3) by reference to the Fourteenth Amendment, but analyzing its constitutionality under the Thirteenth Amendment); Woods v. Cloyd W. Miller, Co., 333 U.S. 138, 144 (1948) (\"The constitutionality of action taken by Congress does not depend on recitals of the power which it undertakes to exercise.\"); Civil Rights Cases, 109 U.S. at 10 (analyzing the Civil Rights Act of 1867 under the Thirteenth Amendment although Congress specifically invoked the Fourteenth Amendment). Congress is authorized to protect Jews under the Thirteenth Amendment because that Amendment's framers understood Jews to come within its purview; and once Congress enjoys this authority, Congress may exercise its power for whatever reason and under whatever heading it chooses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. There is a dispute about whether any form of coercion, if sufficiently powerful, may reduce a person to actual slavery or involuntary servitude, or whether only physical or legal coercion may do so. See Kozminski, 487 U.S. at 944 (concluding that a historical survey of Thirteenth Amendment precedents reveals that the prohibitions against actual slavery and involuntary servitude have been applied only in cases of physical or legal coercion but expressly \"draw[ing] no conclusions from this historical survey about the potential scope of the Thirteenth Amendment\"). This question about the precise limits of the concept of actual slavery is irrelevant to the case before us, however, since our case involves not actual slavery but rather the badges and incidents of slavery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Although, see infra pages 38-39, Jones, 392 U.S. at 441 n.78, overruled Hodges v. United States, 203 U.S. 1 (1906), the Jones Court declined to adopt the position articulated by Justice Harlan's dissent in Hodges, namely that \"by its own force, [the Thirteenth] Amendment destroyed slavery and all its incidents and badges.\" Hodges. 203 U.S. at 27 (Harlan, J., dissenting, joined by Day, J.) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although the Supreme Court has recently clarified the scope of Congress's power to enact legislation that abrogates the states' sovereign immunity, see, e.g., Seminole Tribe of Fla. v. Florida, 517 U.S. 44 (1996), the scope of Congress's power under Section Two of the Thirteenth Amendment to enforce the prohibition on slavery and its badges and incidents probably remains unaffected by Seminole Tribe's holding. As the argument to follow demonstrates, the independent scope the Supreme Court has accorded Congress's power under Section Two makes it unnecessary to determine the extent of Congress's power to enforce the Amendment under Article I, Section 8 of the Constitution, which grants Congress the power \"[t]o make all Laws which shall be necessary and proper for carrying into Execution the foregoing Powers, and all other Powers vested by this Constitution in the Government of the United States,\" including those specified in the Thirteenth Amendment. Of course, Seminole Tribe mandates that if Congress did indeed depend on this Article I power to enforce the Thirteenth Amendment, it could not, under the heading of the Thirteenth Amendment, abrogate State sovereign immunity under the Eleventh Amendment. See Seminole Tribe, 517 U.S. at 72-73. This limitation, however, probably does not apply insofar as Congress's power to enforce the prohibition on slavery arises directly out of Section Two of the Thirteenth Amendment. The Supreme Court, in Seminole Tribe, expressly re-affirmed its earlier holding in Fitzpatrick v. Bitzer, 427 U.S. 445 (1976), that Congress does enjoy power to abrogate State sovereign immunity under the Fourteenth Amendment. Indeed, the Court recognized that \"the Fourteenth Amendment, by expanding federal power at the expense of state autonomy, had fundamentally altered the balance of state and federal power struck by the Constitution,\" and consequently that, \"through the Fourteenth Amendment, federal power extended to intrude upon the province of the Eleventh Amendment and therefore that § 5 of the Fourteenth Amendment allowed Congress to abrogate the immunity from suit guaranteed by that Amendment.\" Seminole Tribe, 517 U.S. at 59. Moreover, the Court indicated in Fitzpatrick, 427 U.S. at 454-55, and emphasized in Ex parte Virginia, 100 U.S. 339 (1879) upon which Fitzpatrick relied, that both the Thirteenth and Fourteenth Amendments \"were intended to be, what they really are, limitations of the power of the States and enlargements of the power of Congress,\" Ex parte Virginia, 100 U.S. at 345. Thus, by analogy, Congress's enforcement powers under Section Two of the Thirteenth Amendment would seem not to be limited by Seminole Tribe and its progeny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. When the Court, in Jones, disapproved of Hodges's narrow account of the Section Two enforcement power, see infra, it also strongly suggested that the Hodges Court had improperly departed from earlier understandings of the enforcement power, specifically that \"[t]he conclusion of the majority in Hodges rested upon a conception of congressional power under the Thirteenth Amendment irreconcilable with the position taken by every member of this Court in the Civil Rights Cases and incompatible with the history and purpose of the Amendment itself.\" Jones, 392 U.S. at 441 n.78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Although this language (specifically the quotation from the Civil Rights Cases) uses the words \"necessary and proper,\" subsequent cases, discussed infra, make plain that the broad scope of Congress's power under the Thirteenth Amendment arises directly out of the enforcement clause of Section Two itself and not merely by application of the Necessary and Proper Clause of Article I, Section 8 to the Enforcement Clause. See, e.g., Griffin, 403 U.S. at 105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A similar doctrinal history establishes the analogous position with respect to the enforcement clause of the Fifteenth Amendment. See South Carolina v. Katzenbach, 383 U.S. 301, 324 (1966) (interpreting the enforcement clause of the Fifteenth Amendment to permit Congress to use \"any rational means to effectuate the constitutional prohibition\"). It is true that several recent Supreme Court cases -- including Board of Trustees of the University of Alabama v. Garrett, 531 U.S. 356 (2001); United States v. Morrison, 529 U.S. 598 (2000); Kimel v. Florida Board of Regents, 528 U.S. 62 (2000); Florida Prepaid Post-secondary Education Expense Board v. College Savings Bank, 527 U.S. 627 (1999); City of Boerne v. Flores, 521 U.S. 507 (1997) -- have undertaken to limit Congress's enforcement authority under Section Five of the Fourteenth Amendment to controlling conduct that directly violates the substantive provisions of Section One. But these cases do not refer to the Thirteenth Amendment context and hence cannot be read by us as applying to that context or as undermining the foundational principle that Congress's enforcement power under Section Two of the Thirteenth Amendment extends well beyond the scope of the direct prohibitions contained in Section One. There is, moreover, a crucial disanalogy between the Fourteenth and Thirteenth Amendments as regards the scope of the congressional enforcement powers these amendments, respectively, create. Whereas there is a long, well-established, doctrinally rich, and highly sophisticated tradition of judicial interpretation of the substantive protections established by Section One of the Fourteenth Amendment, the meaning of Section One of the Thirteenth Amendment has almost never been addressed directly by the courts, in the absence of specific congressional legislation enacted. Indeed, the Supreme Court has expressly referred to \"the inherently legislative task of defining `involuntary servitude.'\" Kozminski, 487 U.S. at 951. And the task of defining \"badges and incidents\" of servitude is by necessity even more inherently legislative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Not all attacks \"because\" a victim is black are, however, racially motivated in the relevant sense. Thus a racially indifferent attacker (one who gets his kicks from assaulting victims regardless of race) might nonetheless pursue exclusively black victims in the belief that the police will be less likely to seek out or prosecute those who commit violent acts against blacks. But we need not concern ourselves with whether § 245(b)(2)(B) would cover such assaults. The facts of the case before us (which leave no doubt as to the anti-Jewish motivation of Nelson and Price), do not require us to develop a fine-grained analysis of this question. Our interpretation, which-at least for current purposes-treats \"because\" as imposing a requirement of class-based animus, is subtly but pervasively influenced by the fact that § 245(b)(2)(B) is a criminal statute concerned with acts of force. The above example-of a racially indifferent attacker who pursues exclusively black victims in the belief that assaults against such victims are less likely to be punished-is much less plausible (and was less likely pressing on the Congress's mind) than the analogous, civil, non-force-based example of a racially indifferent employer who hires only whites in the belief that his customers prefer to deal with a business that employs a white workforce. We wish to make plain that our view that \"because\" as it is used in § 245(b)(2)(B) seems to create a requirement of discriminatory animus does not translate in any direct or natural way to civil anti-discrimination statutes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Finally, we note that some members of Congress objected to the version of § 245 that covered acts done \"while\" a victim was engaged in a protected activity on the grounds that some people, for example people who are employed by the federal government or who receive social security benefits, might be said to engage in these protected activities at all times, so that any and every impermissibly category-motivated act of violence against such people might have fallen within the scope of § 245 as originally conceived. See S. Rep. No. 90-721, at 8, reprinted in 1968 U.S.C.C.A.N. at 1844. But although the change from \"while\" to \"because\" no doubt helped satisfy those who presented this objection, we reject the government's suggestions that meeting this objection was the reason for the change, and that the scope of § 245 as it was eventually adopted, with the second \"because\" included, should be read no more narrowly than is necessary to achieve that particular purpose. Thus, this limited objection might have been met by a much less dramatic change than adopting the second \"because.\" For example, language such as \"in association with\" or \"connected to\" in place of \"while\" would have done as well, and Congress's decision to adopt \"because\" cannot adequately be explained in terms of the intent the government proposes. Moreover, as the additional portions of the Senate Committee Report discussed in the main text reveal, Congress expressly meant the change to \"because\" to have the more dramatically narrowing implications.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The difference is important. An assailant who is paid to beat up a member of a racial or religious group by someone who is motivated by a desire to punish the victim for using a public facility is not himself or herself motivated by the desire to punish the victim's use of the facility (the motive is simply to get money) but would, nonetheless, have the intent needed to violate the law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Circuit Courts that have considered the dual requirement that appears throughout § 245 have adopted statutory constructions that are consistent with, if occasionally less specific than, the construction we adopt. See United States v. Woodlee, 136 F.3d 1399, 1405 (10th Cir. 1998) (noting and distinguishing both \"because\" requirements in § 245(b)(2)(F)); United States v. Makowski, 120 F.3d 1078, 1081 (9th Cir. 1997) (noting that § 245(b)(2)(B) applies only where a defendant \"attack[s] the victim with the specific intent to deprive him of using a public place due to his race\"); United States v. Ebens, 800 F.2d 1422, 1429 (6th Cir. 1986) (focusing, in analyzing a conviction under § 245(b)(2)(F), on a defendant's use of force that was racially motivated and that was committed with the intent to intimidate and dissuade his victim from remaining on the premises of a place of public entertainment), abrogated on other grounds by Huddelston v. United States, 485 U.S. 681 (1988); United States v. Price, 464 F.2d 1217, 1218 (8th Cir. 1972) (separately identifying racial bias and intent to interfere with a victim's use of a public facility in a case involving § 245(b)(2)(B)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The presence of these two (narrowing) requirements in § 245(b)(2)(B) makes easier our upholding of the statute's constitutionality. But we did not so read the statute in order to avoid constitutional difficulties. Accordingly, we emphasize that we are not holding that both (and in particular the second) of the conditions are necessary to the statute's constitutionality. Thus a statute, for example, that federally criminalized private racially motivated violence quite generally might or might not be constitutional under the Thirteenth Amendment. Cf. Griffin, 403 U.S. at 105 (\"We can only conclude that Congress was wholly within its powers under § 2 of the Thirteenth Amendment in creating a statutory cause of action for Negro citizens who have been the victims of conspiratorial, racially discriminatory private action aimed at depriving them of the basic rights that the law secures to all free men.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The legislative history of § 245(b)(2)(B) reveals that Congress did not expressly make this determination, but instead enacted the statute in the belief that its constitutionality could be sustained under the Commerce Clause, S. Rep. No. 90-271, at 5, reprinted in 1968 U.S.C.C.A.N. at 1842, and the Fourteenth, and perhaps also the Fifteenth, Amendments, id. at 6, reprinted in 1968 U.S.C.C.A.N. at 1841-42. As a general matter, however, \"Congress is not obligated, when enacting its statutes, to make a record of the type that an administrative agency or court does to accommodate judicial review.\" Turner Broad. Sys., Inc. v. FCC, 512 U.S. 622, 666 (1994) (opinion of Kennedy, J.). And although the Supreme Court has recently reconsidered this principle in connection with legislation enacted under the \"substantial effects\" prong of the Commerce Clause, see United States v. Lopez, 514 U.S. 549, 563 (1995), the general rule remains unassailed in the context of the Thirteenth Amendment. Finally, even though the Congress that enacted § 245(b)(2)(B) made no findings under the headings of the Thirteenth Amendment and badges of servitude, it manifestly did make the underlying factual findings on which the determination that the conduct reached by the statute imposed badges and incidents of slavery depends. For example, the House Committee found that \"[v]iolence and threats of violence have been resorted to in order to punish or discourage Negroes from voting, from using places of pubic accommodation and public facilities, from attending desegrated schools, and from engaging in other activities protected by Federal law.\" H.R. Rep. No. 90-473, at 3-4. And the Senate Committee stated that § 245 was enacted specifically \"to strengthen the capability of the Federal Government to meet the problem of violent interference, for racial or other discriminatory reasons, with a person's free exercise of civil rights.\" S. Rep. No. 90-721, at 3, reprinted in 1968 U.S.C.C.A.N. at 1838. These findings are, of course, nearly perfect analogues to the historical conclusions earlier recounted with respect to badges and incidents of slavery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We are mindful of the irony that attaches to applying the Thirteenth Amendment in this case. In doing so, we employ a constitutional provision enacted with the emancipation of black slaves in mind to uphold a criminal law as applied against black men who, the jury found, acted with racial motivations, but in circumstances in which they were, at least partly, responding to perceived discrimination against them. We make no effort to dissolve this irony, noting only that the post-Civil War amendments' specific historical focus on black Americans and the amendments' generally egalitarian language are all too often in tension. Cf. Adarand Constructors, Inc. v. Pena, 515 U.S. 200 (1995); City of Richmond v. J.A. Croson Co., 488 U.S. 469 (1989); Wygant v. Jackson Bd. of Educ., 476 U.S. 267 (1986); Fullilove v. Klutznick, 448 U.S. 448 (1980); Regents of the Univ. of Cal. v. Bakke, 438 U.S. 265 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Because we find that § 245(b)(2)(B) is a constitutional exercise of the powers granted Congress under the Thirteenth Amendment, we do not reach the alternative arguments -- based on the Fourteenth Amendment and the Commerce Clause respectively -- that the government has at various points in this litigation advanced. We note, however, that an important connection exists between the Thirteenth Amendment argument on which we uphold the constitutionality of § 245(b)(2)(B) and the suggestion that the statute is a constitutional exercise of Congress's powers under the Commerce Clause. The Supreme Court has recently expressed a great reluctance to allow the Commerce Clause to grant Congress powers to regulate activities that are not directly economic. See Morrison, 529 U.S. at 610-11 (noting that \"Lopez's review of Commerce Clause case law demonstrates that in those cases where we have sustained federal regulation of intrastate activity based upon the activity's substantial effects on interstate commerce, the activity in question has been some sort of economic endeavor\"); Lopez, 514 U.S. at 559-60. And the activities regulated by § 245(b)(2)(B) unquestionably fall into this non-economic category. But the dominant theme in Lopez and Morrison was to protect from federal interference activities that are local in character and, in particular, these cases reflect the fear that a broad reading of the commerce power that allowed Congress to regulate even non-economic activities whenever these substantially affected interstate commerce \"`would effectually obliterate the distinction between what is national and what is local and create a completely centralized government.'\" Morrison, 529 U.S. at 608 (quoting Lopez, 514 U.S. at 556-57). It is in response to this worry that the Court has declined to adopt an expansive understanding of what might count as substantially affecting commerce. Under such a broad understanding, the Court opined, it would be \"difficult to perceive any limitation on federal power, even in areas such as criminal law enforcement or education where States historically have been sovereign.\" Lopez, 514 U.S. at 564. The Thirteenth Amendment argument presented in the main text reveals, however, that private violence motivated by a discriminatory animus against members of a race or religion, etc., who use public facilities, etc., is anything but intrinsically a matter of purely local concern. Instead, such violence has long been intimately connected to a system of slavery and involuntary servitude that the Thirteenth Amendment made centrally a matter of national concern. And for this reason, congressional action taken to regulate such activity is not likely to infringe impermissibly on local affairs. It follows that laws such as § 245(b)(2)(B) (if the activity regulated also involves substantial effects on interstate commerce) may well be constitutional directly under the Commerce Clause, even after Lopez and Morrison, and even without any independent resort to the Thirteenth Amendment. The fact that Congress may regulate an activity pursuant to its Thirteenth Amendment powers in itself indicates that the regulated activity is fundamentally national rather than local. And, as a result, Congress might also, separately, opt to regulate the activity pursuant to its Commerce Clause powers. See S. Rep. No. 90-271 at 5, 1968 U.S.C.C.A.N. at 1841-42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Because we reject the defendants' arguments in this connection and conclude that the street is a \"facility\" for purposes of § 245(b)(2)(B), we need not consider whether it might, additionally or alternatively, be a \"benefit,\" \"service,\" \"privilege,\" or \"activity\" within the meaning of the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The defendants also cite, in this connection, the canon of statutory construction that says that statutes should be construed to avoid unconstitutionality, see Tunick v. Safir, 209 F.3d 67, 75 (2d Cir. 2000), and suggest that, in light of this canon, we should read \"facility\" as narrowly as possible, to exclude city streets, because to do otherwise would place the constitutionality of § 245(b)(2)(B) in doubt. We reject this suggestion in light of our finding that the statute falls easily within Congress's powers under the Thirteenth Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The defendants also argue that reading \"facility\" as it is used in § 245(b)(2)(B) to include city streets would create an inconsistency with § 245(b)(2)(E), which also makes reference to the term \"facility,\" because § 245(b)(2)(E) refers to facilities in a manner that, they say, even more obviously excludes streets. This suggestion is entirely uncompelling. Section § 245(b)(2)(E) prohibits discriminatory interference with a person because he or she is \"traveling in or using any facility of interstate commerce, or using any vehicle, terminal, or facility of any common carrier by motor, rail, water, or air.\" Section 245(b)(2)(E) therefore treats interstate roads, highways, and streets as facilities, so that an interpretation of § 245(b)(2)(B) that understands \"facility\" as used there to include city streets harmonizes rather than conflicts with the plain meaning of the latter subsection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Other courts that have considered the question directly have reached the same conclusion and done so with similar dispatch. See United States v. White, 846 F.2d 678, 695 n.27 (11th Cir. 1988) (reversing a district court's judgment of acquittal of conspiracy to violate § 245(b)(2)(B) and holding, as one of three alternative grounds for its decision, that streets were facilities provided by the City of Decatur); United States v. Three Juveniles, 886 F. Supp. 934, 945 (D. Mass 1995) (holding that streets administered by a local government were facilities within the meaning of § 245(b)(2)(B)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. This interpretation of § 245(b)(2)(B) was in effect conceded by the government at oral argument when it stated that for an act to violate the statute, \"[t]here has to be evidence of motive . . . [to keep the victim] from using [a public facility] . . . [or] . . . an intent to punish [the victim] for using it.\" Oral Argument Tr., May 3, 2000, at 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The defendants suggest that this requirement of intent is essential to an upholding of the statute's constitutionality. This, they maintain, makes it more doubtful that the evidence presented at trial was sufficient to establish that the defendants had the specific intent that they claim the statute must require. The defendants thereby present their challenge to the sufficiency of the evidence underlying their conviction under § 245(b)(2)(B) as of a piece with their prior challenge to the statute's constitutionality. They contend that any reading of § 245(b)(2)(B) that makes the statute sufficiently limited and precise as to be within the scope of Congress's constitutional powers, also makes it so limited and precise as to render the evidence presented against them insufficient to bring their conduct within its terms. In addition to concluding that the evidence of intent was sufficient to sustain the defendants' convictions, we emphasize that in reaching this conclusion we do not view ourselves as acting under the specter of possible unconstitutionality. Instead, we reiterate that § 245(b)(2)(B), as we have interpreted it, is comfortably constitutional, although we of course express no opinion concerning the constitutionality of any broader statute not before us. See supra note 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The defense could perhaps be read to be saying that the charge was incorrect because by uniting the charge for category-based and activities-based intent and using language of intent in that charge, the court erred in stating what must be shown in order to demonstrate class-based motivation. To the extent that this is their argument, and to the extent the charge to the jury could be criticized for not specifying that category-based \"because\" required racial or religious animus or motivation any such error would be harmless. The evidence in this case established beyond peradventure that racial or religious animus or motivation existed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Defendant Price -- focusing on defendant Nelson's contention that his immediate motive for stabbing Rosenbaum was to free himself from Rosenbaum's grasp and thereby to escape apprehension by the police -- also contends that the verdict should be reversed because there was insufficient evidence of class-based motive. This argument is frivolous. Nelson's immediate aim of escaping does not preclude his having had other forms of motive as well, and the trial produced overwhelming evidence of precisely such independent anti-Jewish animus.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. We note that this is a case in which the naked inference identified in this instruction is at issue. The defendants do not claim that the jury improperly discounted countervailing evidence tending to show, specifically, that the defendants did not intend the ordinary consequences of their actions (for example, evidence that the defendants had planned to commit their attack away from the city street and attacked on the street only after their plan failed, or that they took other affirmative steps to diminish the association between their attack and the street). Instead, the defendants claim that the jury's inference is impermissible even where no evidence contradicts it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We therefore find no merit in defendant Nelson's contention that in upholding the conviction against the defendants' sufficiency challenge, we create a mandatory presumption that whenever an assault occurs on or near city streets, then the assault occurs because of the victim's use of the streets.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. We of course reach this conclusion based on our own independent analysis, and not because we are compelled to follow the Report's reading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In fact, the Price court went further, calling the defendant's sufficiency challenge \"a frivolous contention.\" Id. Oddly, it made this remark in the context of the trial court's instruction to the jury that \"a person intends the natural and probable consequences of acts knowingly done or knowingly omitted.\" Id. This jury instruction might be the presumption of intent instruction forbidden by Sandstrom rather than the permissive instruction that Francis allows. (Which side of the Sandstrom/Francis distinction this jury instruction falls on depends not on any particular form of words that the instruction uses, but rather on the sense conveyed by the jury charge as a whole and on whether a reasonable juror could read the charge as a whole as creating an unconstitutional presumption. See Payne, 825 F.2d at 707.) Price was decided before Sandstrom, of course, and Sandstrom, by affecting the correctness of the specific jury instruction at issue in Price, might alter the outcome of that case were it argued today. It does not, however, call into question the underlying principle employed by the court in Price. This is the notion that where a jury infers intent by deciding that a given defendant meant to bring about the consequences of his actions, that defendant cannot (without pointing to countervailing evidence that the jury ignored) unseat this finding by challenging the sufficiency of the evidence. And this, of course, is the principle we re-affirm today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. In addition, the district court made plain to the parties that peremptory challenges raised against the two Jewish prospective jurors in the group of 45 out of which the jury was ultimately chosen would be frowned upon. Thus the district court stated that \"I'm putting you right on notice that an attempt to get rid of the two Jewish jurors here, you are going to have to make an overwhelming showing,\" and added that it would require any peremptory challenges raised against Jewish jurors to be accompanied by sworn affidavits from defense counsel. (Tr. 683-84). The defendants do not appeal directly on the basis of these statements, which therefore serve merely to provide background to the district court decisions that the defendants do appeal. (In spite of the remarks reported above, the district court ultimately did grant the defendants' peremptory challenge against one Jewish juror.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. A second African-American juror, seated as Alternate Juror 3, was also excused (for hardship).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Although they opposed the district court's denial of their for-cause challenge to Juror 108, the defendants did not exercise a peremptory challenge against this juror.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The defendants had initially presented a fourth related argument on appeal, claiming that the district court had improperly denied them a peremptory challenge to Juror 108. The defendants withdrew this claim, however, after the government pointed out that they did not in fact seek to exercise a peremptory challenge against this juror.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Here, and subsequently, we refer to Juror 108 as a \"biased juror.\" This phrase connotes a juror's predisposition with respect a defendant's guilt or innocence which precludes the person from serving on a jury. We do not employ the term \"bias\" in its common use of an individual's racial prejudice or other form of intolerance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. In addition to actual bias, a for cause challenge to a juror may be grounded on \"implied bias\" and \"inferable bias.\" See id. Appellate review of district court decisions based on these grounds raises questions, and is governed by standards, that we need not address here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Juror 108 did this, of course, by expressing his disappointment with Nelson's acquittal in State court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Of course, \"most constitutional errors can be harmless.\" Arizona v. Fulminante, 499 U.S. 279, 306 (1991). Thus, where a \"defendant had counsel and was tried by an impartial adjudicator, there is a strong presumption that any other [constitutional] errors that may have occurred are subject to harmless-error analysis.\" Rose v. Clark, 478 U.S. 570, 579 (1986). And errors that count as \"structural,\" and require automatic reversal, occur only in a \"very limited class of cases.\" Johnson v. United States, 520 U.S. 461, 468 (1997). We are confronted, however, with precisely such a case. As the Supreme Court has reiterated, \"[a]mong those basic fair trial rights `that can never be treated as harmless' is a defendant's `right to an impartial adjudicator, be it judge or jury.'\" Gomez v. United States, 490 U.S. 858, 876 (1989) (quoting Gray v. Mississippi, 481 U.S. 648, 668 (1987) (quoting Chapman v. California, 386 U.S. 18, 23 (1967))).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The government also argues that any abuse of discretion the district court committed in rejecting the defendants' for-cause challenge to Juror 108 did not rise to the level of plain error, and was forfeited since the challenge to Juror 108 was not renewed when the panel was selected. We reject this contention because the arguments against the government's waiver theory that follow in the main text apply equally, mutatis mutandis, against any theory of forfeiture. We also note that such a forfeiture theory would have to be based on the defendants' failure to object to the empaneling of Juror 108. But, in a federal trial, a forfeiture of an objection to a trial court's denial of a for-cause challenge to a juror may not be implied from the failure subsequently to exercise a peremptory strike against that juror. Thus, the Supreme Court has expressly \"reject[ed] [the] contention that under federal law, a defendant is obliged to use a peremptory challenge to cure the judge's error [in failing to grant a challenge for cause].\" Martinez-Salazar, 528 U.S. at 307. In other words, it would seem that the defendants' initial challenge is sufficient to avoid forfeiture.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Fay's holding dealt with ordinary state law waiver rules and exhaustion requirements under federal habeas law. We note that although Fay's approach to these matters was affirmed by Fay v. Noia, 372 U.S. 391 (1963), Fay v. Noia was itself limited by Wainwright v. Sykes, 433 U.S. 72 (1977), and overruled by Coleman v. Thompson, 501 U.S. 722 (1991). But although Fay's holding concerning garden variety waiver and federal review of habeas petitions brought by state prisoners has been superceded by a new and very different habeas regime, Fay's dicta about extraordinary cases of waiver remains as powerful and relevant today as when it first issued.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. This list, of course, is not exhaustive, but merely provides examples designed to emphasize the narrow set of cases to which our discussion of unwaivability applies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. This scheme clearly violated Fed. R. Crim. P. 24(c), which states that \"[a]n alternate juror, in the order called, shall replace a juror who . . . is found to be unable or disqualified to perform juror duties.\" Any claim based on solely on the district court's technical violation of the procedures established in Rule 24(c) has, however, clearly been waived by the defendants' agreement to that plan. See Viserto, 596 F.2d at 539-40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. This is so, Powers teaches, not least because race-based selection of juries violates the equal protection rights not just of the parties to a proceeding but also of the would-be jurors who have been excluded. Thus, while \"[a]n individual juror does not have a right to sit on any particular petit jury, . . . he or she does possess the right not to be excluded from one on account of race.\" Powers v. Ohio, 499 U.S. at 409.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. One might question whether our dicta in Fay, together with holdings such as Freytag, should have sufficed to constitute such express judicial disapproval. But we need not so decide in order to resolve this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Judge Straub's thoughtful partial dissent does, however, warrant some further comment. Judge Straub believes, as we do, that Juror 108 should have been excluded for cause. He also agrees that the selection of this juror on a racial and religious basis constituted serious error that should not be countenanced. But he wishes to apply any prohibition only in the future. In support of his position he addresses various arguments against giving the defendants, who knowingly participated in the creation of the racially and religiously selected jury, the benefit of their own misdeeds. These arguments are not without merit. The problem with them is, however, that the decisive issue for us is neither prospective application nor juror bias but, as we discuss infra II(B)(4), whether a court may seat a biased juror in exchange for the seating of another juror who is selected on the basis of race. To illustrate this point most dramatically, consider a biased juror (as Judge Straub's partial dissent concedes Juror 108 to be) whatever his or her religion. Would we condone a court's offer that if, and only if, a defendant accepted, and indeed waived all objections to, such a biased juror, the court would-out of turn-seat a juror who was of defendant's race or religion? I think not. The court's jurymandering plan, accepted by the parties constituted precisely such an offer. Additionally, prospective application would fail, in our view, to address Judge Straub's appealing arguments about the undesirability of letting defendants benefit from the impropriety of a scheme in which they were full participants. The trouble with barring jurymandering in the future only, is that Judge Straub's arguments against reversal would be every bit as meritorious in a future case in which the parties and the judge agreed to jury selection based on race or religion. And if they were to be accepted then, as Judge Straub suggests that they should be now, the wrong that he agrees has occurred would be repeatable in perpetuity. This, of course, might not occur if the court or the government had any proper expectations in this case that what was done was acceptable. But such a view is not sustainable. Apart from the existence of our dicta in Fay, 300 F.2d at 350-51, warning against jurymandering, the rules prohibiting officially created racial classifications unless they survive strict scrutiny are clear. See, e.g., Adarand Constructors, Inc. v. Pena, 515 U.S. 200, 224 (1995). Moreover, well before this opinion issued, both the court and the government gave unmistakable indications that they were aware of the likely impropriety of what had been done. The court did this when it suggested that the parties ought not broadcast the arrangement. And the government did so when it, admirably, suggested error in open court but asked for prospective application only. This, then, is not a case of \"sandbagging\" or surprise because of which it may be appropriate to apply a \"new\" rule in the future only. This is a situation in which, for motives that we do not at all question, the court together with the parties did something that they had good reasons to believe they should not do. Since the same circumstances may well occur again in the future, prospective application is apt to be chimerical and, hence, not suffice to safeguard society's fundamental interest in properly selected juries. It is also worth noting that insofar as the rule permitting waivers even of crucial constitutional rights is grounded in part on the concern that defendants may give themselves two chances at an acquittal by strategically passing over constitutional challenges at trial and raising them on appeal only if they lose, this worry is less pressing in cases in which the violations occur off the district court's own bat. When the court takes the lead in the proceedings, the opportunities for strategic manipulation by the parties are considerably diminished. Judge Straub makes one further point that needs attention. He says in footnote 3 that \"the evidence here proving guilt was powerful\" and that \"[w]e can have overwhelming confidence that these two [defendants] were [justly and fairly] convicted.\" Op. Dissenting in part at 9 n.3. The issue is not quite so easy. In order for these federal convictions to stand there must not only be proof that the acts alleged in the indictment were done (as to which we readily concur that the evidence was strong), but there must also be proof \"beyond a reasonable doubt\" that the acts were committed because the victim was using a public facility. We have held in Part II of this opinion that, despite the absence of any direct evidence of this essential defendant intent, the fact that a jury is permitted (but not required), see Francis v. Franklin, 471 U.S. at 315, to infer that defendants intended the foreseeable consequences of their acts, was enough to allow these convictions to withstand a serious challenge based on insufficiency of the evidence. (But see Judge F. I. Parker's contrary view on this point, infra Op. Dissenting in part and Concurring in part at 10.) Our holding in this respect was, necessarily, based on the strong reliance our system places on the findings of a properly selected and unbiased jury. Once it is conceded that the jury was not properly chosen, our confidence in the finding that the defendants' intended to attack the victim because he was using a public facility (a finding which, we repeat, is a fundamental prerequisite of the federal crime that is here charged) is necessarily shaken. And, inevitably, so is the validity of the conviction. We fully share Judge Straub's distress at prolonging the pain of the community and the family of the victim. But we cannot affirm a conviction whose correctness has been put in doubt by the fact that a highly uncertain element of the crime was found to exist by a jury that was not chosen in accordance with the most basic precepts of our legal system.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The \"deal\" that was offered the defendants was not only improper, it was also, perhaps, \"unfullfilable.\" See Brady, 397 U.S. at 755. In the case before us, the defendants' have challenged their conviction asserting, in part, that the racially and religiously selected jury they faced did not constitute a jury at all, and hence that their trial before it - regardless of their consent - was a nullity. This argument is by no means frivolous (even if we ultimately did not need to decide its merit). And the same argument might conceivably also cut the other way. Thus, had the defendants been acquitted, could not the government have contended that the acquittal, having been issued by such a non-jury, was a nullity and that double-jeopardy did not bar a retrial? Jeopardy, after all, attaches only after a jury is empaneled and sworn. Crist v. Bretz, 437 U.S. 28, 35 (1978). And, if it were held that a group of people seated on the basis of race or religion did not constitute a jury, it is not impossible that a court could conclude that no jeopardy had attached. Were that so, the \"deal\" offered to the defendants in exchange for the seating of Juror 108 would have proven worthless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Analogously, we cannot imagine that an agreement by the defense not to object on Batson grounds, to the prosecution's use of racially based peremptory challenges, if made in exchange for the prosecution's commitment to let the defense employ racial criteria in its peremptory challenges, could stand. And the fact that a court approved, or encouraged, such an agreement, far from insulating it from subsequent attack, would, doubtless, make it even more vulnerable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Although the author of this opinion has argued, and adheres to the view, that the dual sovereignty doctrine is in need of rethinking, see All Assets of G.P.S. Auto. Corp., 66 F.3d at 496-99 (Calabresi, J., concurring), and although he also believes that a reexamination of the doctrine is particularly appropriate in light of distinctions drawn by the Supreme Court in United States v. Balsys, 524 U.S. 666 (1998), between the relationships among the several sovereigns that constitute the United States, and those among these sovereigns and foreign countries, such a reconsideration of a Supreme Court doctrine is not the province of the Courts of Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Black's Law Dictionary (7th ed. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Bouvier's Law Dictionary (8th ed. 1914).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Because is clearly used as a preposition in its first use in § 245(b)(2): \"[A]ny person because of his race . . . .\" §245(b)(2)(emphasis added). It is also used as a preposition in its second appearance in § 245(b)(2), even though \"of\" does not follow \"because\": \"[A]nd because he is or has been-- . . . .\" Id. (emphasis added). The second because cannot be a conjunction because it does not connect two dependent clauses, e.g., \"We stopped at the filling station because we needed gasoline.\" Webster's Third International Dictionary 194 (14th ed. 1961). Even if \"because\" were construed as a conjunction, the definition of the conjunction because equally supports the plain meaning interpretation of the statute I urge. Because as a conjunction is defined as \"for the reason that\" or \"on account of the cause that.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Pursuant to Fed. R. Crim. P. 24(c), each member of the venire is assigned a number which determines the order of prospective jurors and ultimately, jury members. Thus, for example, prospective juror 50 would deliberate as a member of the final jury only when all but 11 of the prospective jurors numbered 1 to 49 had been excused.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. In part, I believe that the agreement between defense, prosecution and Judge to empanel a juror indicates a shared consensus that the resulting jury will fairly adjudicate the case. Where the parties decide that they prefer a jury containing the allegedly biased juror to a different jury without him, I believe that an appellate court can do little more to guarantee impartiality by reviewing the cold transcript of the juror's voir dire. The agreement of the parties who make a conscious, knowing and intelligent decision serves as an adequate guarantee of impartiality, enabling us to construe the defendants' behavior as a waiver of their earlier objection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. The majority disputes the deterrent value of a prospective rule, worrying that if a future panel were to find my argument equally applicable, the injuries would be \"repeatable in perpetuity.\" As a conceptual matter, my argument would not apply in a future case. This is because a future panel would have to address our representation here that this Circuit will reverse and remand any conviction obtained by a jury that was selected with race or religion in mind. My argument, which focuses on the deterrent value of court rulings, necessarily takes notice of and gives effect to such explicit warnings. In practical terms, I think the majority's concern is even more unwarranted. I am certain that the government (or a district court) will not select a jury in flagrant disregard of this Court's explicit warnings in the odd hope that our Court might alter its explicitly articulated view in so fundamental a matter. Warnings can be credible, even where a penalty is not assessed at the first possible moment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. It is also worth noting that a prospective rule is appropriate where, as here, the defendants failed to properly object to the allegedly erroneous decision by the District Court. Although the defendants did initially make a for-cause objection to Juror 108, they subsequently waived that objection when they gave their intelligent and knowing agreement to the plan to seat that juror. As I believe that this waiver is equivalent to a failure to object, we therefore may correct the District Court's decision only if it is (1) error, (2) that is plain, (3) that affects substantial rights and (4) that seriously affects the fairness, integrity or public reputation of judicial proceedings. See Johnson v. United States, 520 U.S. 461, 466-67 (1997). I think we may establish a prospective rule because the defendants here satisfy the first, but not the last, two prongs of the test. I am inclined to agree that the District Court erred, and that, given the ruling announced here, that error is plain. Cf. id. at 467-68. Therefore, we may conclude that the law in this Circuit prohibits the use of race and religion as criteria for the inclusion of a juror in the future. I do not, however, think that the error affected substantial rights in this trial, as the inclusion of Juror 108 was not \"structural error\" for the reasons discussed above. See id. at 468-69. Nor do I believe that, when examined in the context of this trial, the decision seriously affected the fairness, integrity or public reputation of the judicial proceedings. See id. at 469-70. As our discussion of the defendants' challenge to the sufficiency of the evidence indicates, the evidence of guilt was compelling and the trial, though not error-free, can give us confidence that the evidence was fundamentally weighed and evaluated as our laws and Constitution require. We can be confident that these two defendants were convicted based on the evidence and pursuant to fair and just proceedings. Since the defendants did not properly preserve their objection to the jury selection, we may not correct the errors made by the District Court.\u003c/span\u003e\n\n",
    "body_length": 210154,
    "citedas": [
      "277 F.3d 164"
    ],
    "attorneys": "James E. Neuman, New York, N.Y. for Defendant- Appellant Lemrick Nelson, Jr.Darell L. Paster, New York, N.Y. for Defendant- Appellant Charles Price. Alan M. VINEGRAD, Assistant United States Attorney and Valerie Caproni, Special Assistant United States Attorney for Loretta E. Lynch, United States Attorney for the Eastern District of New York, Brooklyn, NY and Jessica Dunsay Silver and Thomas E. Chandler, Civil Rights Division, United States Department of Justice for Bill Lann Lee, Assistant Attorney General, Civil Rights Division, United States Department of Justice, Washington, D.C. for Appellee United States of America. Walter E. Dellinger, Jeremy Maltby, and Erika R. Frick, O'Melveny \u0026 Myers, Washington, D.C. for Amici Curiae Naacp Legal Defense and Educational Fund, Inc. (Elaine R. Jones, Theodore M. Shaw, and Norman J. Chachkin, of counsel) and Lawyers' Committee for Civil Rights Under Law (Barbara R. Arnwine, Thomas J. Henderson, and Nancy J. Anderson, of counsel). Norman Redlich and Maritza U.B. Okata, Wachtell, Lipton, Rosen \u0026 Katz, New York, N.Y. for Amici Curiae American Jewish Congress (Marc D. Stern, of counsel), American Jewish Committee (Jeffrey Sinesky and Kara Stein, of counsel), Anti-Defamation League (Elizabeth J. Coleman and Steven M. Freeman, of counsel), Jewish Community Relations Council of New York (Marcia R. Eisenberg, of counsel), Jewish Reconstructionist Federation, Union of American Hebrew Congregations (Mark J. Pelavin, of counsel), Union of Orthodox Jewish Congregations of America (Nathan Diament, of counsel), and United Synagogue of Conservative Judaism (Harold Kalb, of counsel). Nathan Lewin, Miller, Cassidy, Larroca \u0026 Lewin, Washington, D.C. for Amici Curiae National Jewish Commission on Law and Public Affairs (\"colpa\") (Dennis Rapps, Colpa, and David Zwiebel, Agudath Israel of America, of counsel) and Family of Yankel Rosenbaum.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before: Calabresi, Parker, and Straub, Circuit Judges.",
    "citation_count": 86
  }
}
