{
  "id": "RaFWR2YBTlTomsSBueck",
  "document": {
    "title": "People v. Anderson",
    "full_title": "THE PEOPLE AND v. JAMES PHILLIP ANDERSON AND",
    "jurisdiction": "California Supreme Court",
    "date": "1987-10-13T00:00:00.000Z",
    "docket": "Crim. No. 21287",
    "body": "This is an automatic appeal (Pen. Code, § 1239, subd. (b)) from a judgment of death under the 1978 death penalty law (id., § 190.1 et seq.).\n\nDefendant was convicted of the offenses of first degree murder (Pen. Code, § 187), kidnapping for the purpose of robbery (id., § 209), and\n\nrobbery (id., § 211), against Donna Coselman and Louise Flanagan. As to each murder, two special-circumstance allegations were found to be true: multiple murder (id., § 190.2, subd. (a)(3)) and felony murder-robbery (id., subd. (a)(17)(i)).\n\nAs we shall explain, we conclude that the judgment must be affirmed as to guilt. We also conclude that three of the four special-circumstance findings must be upheld. Specifically, in spite of the fact that the jurors were not instructed in accordance with Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862], and People v. Turner (1984) 37 Cal. 3d 302 [208 Cal. Rptr. 196, 690 P.2d 669], that they were required to find that defendant had acted with intent to kill before they could find the felony-murder and multiple-murder special-circumstance allegations to be true, we conclude that the special circumstance findings cannot be vacated on that ground: we overrule Carlos and Turner and hold that on the facts of this case the court was not obligated to instruct on intent to kill. Finally, we conclude that the judgment must be reversed as to penalty: in violation of People v. Ramos (1984) 37 Cal. 3d 136 [207 Cal. Rptr. 800, 689 P.2d 430], the court instructed the jury in accordance with the so-called Briggs Instruction on the gubernatorial commutation power.\n\nI. Facts\n\nOn March 4, 1979, Fred Anders (Fred), his sister Sheila Anders (Sheila), and her friend, defendant James Anderson (defendant), were driving on Interstate 10 in Coachella. A car was stranded on the side of the road; standing nearby were Donna Coselman (Coselman) and her grandmother, Louise Flanagan (Flanagan), who were passing through the area. Fred pulled over. While Flanagan remained with the disabled vehicle, Coselman entered Fred's car and was taken to an orange grove off Interstate 10. Flanagan was later retrieved and was also driven there. Shortly thereafter Fred set off from the grove in his car and left Sheila and defendant behind. He soon came across a police officer and told him there was a problem involving the two women. Not long afterwards Coselman was found, with a rope around her neck, dead from strangulation. Sheila and defendant were arrested as they were walking not far from the grove. Sheila had Flanagan's purse and watch; her own purse contained Coselman's wallet. The next day Flanagan's body was found, with a rope around the neck, hanging from a tree in the grove.\n\nOn their arrest, defendant and Sheila made separate statements to the police. Defendant said he had stayed with Flanagan at the disabled vehicle while Fred and Sheila drove off with Coselman; sometime later Fred and Sheila returned alone, picked up Flanagan, and again drove off; he remained\n\nwith the disabled vehicle; Fred and Sheila returned alone yet again and picked him up; as they were traveling, Fred \"developed some kind of attitude problem\" and ordered Sheila and him out of the car; he had never been in the grove.\n\nSheila stated that after stopping to help the disabled vehicle, Fred, defendant, and she drove off with Coselman; when they arrived at the grove, Fred and defendant went off on foot with Coselman while she stayed with the car; a very short time later, defendant returned and said Fred wanted the two of them to go and bring back Flanagan; they did so; on their return, defendant set out to find Fred and then Flanagan set out to find Coselman; defendant soon returned alone and the two of them (defendant and Sheila) started to look for Flanagan; soon they heard the car start, and defendant unsuccessfully tried to catch up with it as it drove away; they then started walking out of the grove and as they did came across and picked up a purse and a watch that were lying on the ground; although she did not know who killed Coselman -- she had not learned of the death until after her arrest -- she believed it must have been Fred because defendant was not away from the car long enough to have done the deed.\n\nDefendant and Sheila were charged by information with two counts each of murder, kidnapping for the purpose of robbery, and robbery. As special-circumstances it was alleged that each murder was committed (1) in conjunction with another murder and (2) during the commission of a robbery. After a preliminary hearing both were held to answer. They moved for separate trials and change of venue, but were unsuccessful.\n\nAt trial Fred's testimony for the prosecution was in substance as follows. Catching sight of Coselman and Flanagan by their disabled car, defendant told him to stop and they both inspected the vehicle. He believed all that was needed to repair the car was to reconnect a wire. Defendant, however, said he would do the job and instructed him to get back into his car. He then coaxed Coselman into Fred's car and told Fred they were taking her to buy a replacement part.\n\nOnce on the highway, Fred continued, defendant instructed him to take the first off-ramp. Defendant then told Coselman he was going to rob her and she gave him all her money from her purse. He next directed Fred to the orange grove. There defendant left the car with Coselman and Sheila and tied Coselman to a tree. He told Fred that while Sheila stayed at the grove they would go back to get Flanagan. He (Fred) then refused to go but stayed with Coselman while Sheila and defendant drove back to get Flanagan. He then untied Coselman and tried to persuade her to go with him to the police, but she refused because she was afraid for her grandmother's life.\n\nDefendant and Sheila, Fred went on, returned with Flanagan. While Sheila and Flanagan remained in the car, defendant retied Coselman and told him to go back to the vehicle. He soon heard Coselman scream. He ran back and saw defendant strenuously pulling a rope behind Coselman as she lay face down on the ground. Defendant again directed him to go back and he did so. Defendant then came to the car and, accompanied by Sheila, took Flanagan into the grove. Defendant told him to stay where he was. He nevertheless began to follow. When defendant noticed, he yelled at him to return to the car. As he began running back he saw Coselman lying face down on the ground. He shook her and spoke to her, but she did not respond. He then ran to the car and left to find the police. In complying with defendant's orders with regard to these incidents, he acted out of fear.\n\nA few days before the crimes in question, Fred continued, defendant talked to him about robbing a gasoline station, and suggested that they shove the attendant into the bathroom and tie him up with a rope. He refused, and the robbery never took place.\n\nExpert testimony was presented on behalf of the prosecution to the effect that shoeprints had been discovered near the victims' bodies and that they matched the shoes worn by defendant and Sheila when they were arrested.\n\nDefendant testified in substance as follows. After stopping by the disabled vehicle, Fred brought Coselman into the car with Sheila and him and drove to the orange grove. Then, at Fred's direction, he and Sheila drove back to retrieve Flanagan. When they returned, he found Fred forcing Coselman to orally copulate him. Fred asked for the car keys; he handed them over and then walked back to the car. About five minutes later Fred met him, Sheila, and Flanagan at the car, and said he had lost the keys. He and Sheila went in one direction to look for them, and Fred and Flanagan went in another. He soon came on Coselman's body. He then heard the car start up, and as he was running back Fred drove away. He and Sheila then started walking toward the main road. As they walked, they noticed a purse with its contents partially spilled. As they were picking up the contents, he saw drag marks on the ground, followed them, and found Flanagan's body hanging from a tree. He and Sheila then continued to walk until they were apprehended by the police and arrested.\n\nSheila did not take the stand, but presented a defense of diminished capacity through three experts who had interviewed her and formed opinions as to her mental state at the time of the incidents in question. Their testimony was, in brief, as follows: Sheila had a mental defect known as \"inadequate personality\"; she was accordingly incapable of harboring the requisite intent for first degree murder -- i.e., premeditation and\n\ndeliberation -- and probably did not have the requisite intent to commit robbery or kidnapping; her complicity in the crimes, if any, was not intentional, but solely a product of her emotional attachment to defendant -- which was so strong that in order to support him she had actually worked as a prostitute.\n\nIn rebuttal to defendant's version of the events, a prosecution expert testified that no semen was found in Coselman's mouth.\n\nThe jury convicted defendant of first degree murder, kidnapping, and robbery, and found all the special circumstance allegations true. They convicted Sheila of kidnapping, robbery, and murder in the second degree. At the penalty phase they fixed defendant's punishment at death.\n\nII. Guilt Issues\n\nDefendant makes a number of contentions related to the issue of guilt. None, as we shall explain, establishes reversible error.\n\nA. Bruton-Aranda Error\n\nDefendant's main contention is that the introduction of certain extrajudicial statements by Sheila, which incriminate him in the crimes of which he stands convicted, was error under Bruton v. United States (1968) 391 U.S. 123 [20 L.Ed.2d 476, 88 S.Ct. 1620], and People v. Aranda (1965) 63 Cal. 2d 518 [47 Cal. Rptr. 353, 407 P.2d 265], as violative of his right to confront and cross-examine the witnesses against him. The Attorney General answers that the admission of these statements was not erroneous, and that in any event it caused no prejudice.\n\nDuring the presentation of Sheila's diminished capacity defense, each of the experts was cross-examined on the basis of his opinion and responded by recounting statements she had made incriminating defendant. One testified in effect that Sheila said she did what she did in the orange grove on the orders of defendant, whom she both loved and feared. Another gave similar testimony. The third said she made the following statements: (1) in the course of the Coselman robbery she told defendant something to the effect of \"Don't do this,\" \"Just get it over with,\" \"Stop it,\" or \"Don't hurt them\"; (2) after Coselman was killed defendant said to her, \"The other one is done, now it's your turn,\" she refused, and he then proceeded to kill Flanagan; (3) after strangling Flanagan, defendant wanted to hang her body in a very gruesome manner from a tree, he directed her to help, but she refused; and (4) she had a pretty strong feeling defendant killed Coselman and knew for a fact he killed Flanagan, but lied in her postarrest statement\n\nimplicating Fred because she was afraid defendant would otherwise get in trouble. On rebuttal the prosecution called an expert who stated that Sheila told him she and defendant robbed Coselman and she saw defendant strangle and hang Flanagan but refused to give him the help he requested.\n\nAfter the experts testified, defendant unsuccessfully moved for a mistrial and a new trial on the ground that because Sheila did not take the stand he had been denied his right of confrontation and cross-examination.\n\nUnder both the federal and state Constitutions a criminal defendant is guaranteed the right to confront and cross-examine the witnesses against him. (U.S. Const., 6th Amend.; Pointer v. Texas (1965) 380 U.S. 400, 403-405, [13 L.Ed.2d 923, 926-927, 85 S.Ct. 1065] [holding the confrontation clause applicable to the states]; Cal. Const., art. I, § 15.) This right is confirmed in Penal Code section 686, which provides in relevant part that \"[in] a criminal action the defendant is entitled . . . to be confronted with the witnesses against him, in the presence of the court . . . .\"\n\nThe primary purpose of the constitutional guarantee is to ensure that the defendant is able to conduct a \"personal examination and cross examination of the witness, in which [he] has an opportunity, not only of testing the recollection and sifting the conscience of the witness, but of compelling him to stand face to face with the jury in order that they may look at him, and judge by his demeanor upon the stand and the manner in which he gives his testimony whether he is worthy of belief.\" (Mattox v. United States (1895) 156 U.S. 237, 242-243, [39 L.Ed. 409, 411, 15 S.Ct. 337]; accord, California v. Green (1970) 399 U.S. 149, 158 [26 L.Ed.2d 489, 497, 90 S.Ct. 1930]; People v. Stritzinger (1983) 34 Cal. 3d 505, 515 [194 Cal. Rptr. 431, 668 P.2d 738]; In re Terry (1971) 4 Cal. 3d 911, 922 [95 Cal. Rptr. 31, 484 P.2d 1375]; People v. Green (1971) 3 Cal. 3d 981, 989 [92 Cal. Rptr. 494, 479 P.2d 998].) Thus, \"one of the important objects of the right of confrontation was to guarantee that the fact finder had an adequate opportunity to assess the credibility of witnesses.\" (Berger v. California (1969) 393 U.S. 314, 315 [21 L.Ed.2d 508, 510, 89 S.Ct. 540].)\n\nThe fundamental character of this right is beyond question. (See People v. Stritzinger, supra, 34 Cal. 3d at p. 515.) As the United States Supreme Court has stated, \"There are few subjects, perhaps, upon which this Court and other courts have been more nearly unanimous than in their expressions of belief that the right of confrontation and cross-examination is an essential and fundamental requirement for the kind of fair trial which is this country's constitutional goal.\" (Pointer v. Texas, supra, 380 U.S. at p. 405 [13 L.Ed.2d at p. 927].) Any denial or significant diminution of this right deprives the accused of an essential means to test the credibility of his\n\naccusers and thus \"calls into question the ultimate '\"integrity of the fact-finding process\"'. . . .\" (Chambers v. Mississippi (1973) 410 U.S. 284, 295 [35 L.Ed.2d 297, 309, 93 S.Ct. 1038]; see In re Montgomery (1970) 2 Cal. 3d 863, 867 [87 Cal. Rptr. 695, 471 P.2d 15].)\n\n\"Of course, the right to confront and to cross-examine is not absolute. . . . .\" (Chambers v. Mississippi, supra, 410 U.S. at p. 295 [35 L.Ed.2d at p. 309]; accord, Barber v. Page (1968) 390 U.S. 719, 722 [20 L.Ed.2d 255, 258-259, 88 S.Ct. 1318]; People v. Stritzinger, supra, 34 Cal. 3d at p. 515; People v. Enriquez (1977) 19 Cal. 3d 221, 235 [137 Cal. Rptr. 171, 561 P.2d 261].) When cross-examination is not possible, the defendant is not denied his constitutional right if the harm the witness's testimony threatens can reasonably be prevented. Specifically, it has been stated that when a declarant's statements have been put before the jury but the declarant is unavailable for cross-examination, the defendant's right of confrontation and cross-examination is not violated if the jury is instructed to disregard those statements to the extent they bear on his guilt. (Parker v. Randolph (1979) 442 U.S. 62, 73-74 [60 L.Ed.2d 713, 724, 99 S.Ct. 2132] (plur. opn.), disapproved on another point in Cruz v. New York (1987) 481 U.S. [95 L.Ed.2d 162, 107 S.Ct. 1714].) Such an instruction is generally an adequate means of protecting the defendant because we presume the jury will follow the instruction and hence the testimony will work no prejudice. In some circumstances, however, a limiting instruction is an inadequate means of protection.\n\nBroadly stated, the rule of Bruton v. United States -- which is rooted in the confrontation clause and accordingly governs state as well as federal prosecutions (Roberts v. Russell (1968) 392 U.S. 293, 294 [20 L.Ed.2d 1100, 1102, 88 S.Ct. 1921]) -- declares that a nontestifying codefendant's extrajudicial self-incriminating statement that inculpates the other defendant is generally unreliable and hence inadmissible as violative of that defendant's right of confrontation and cross-examination, even if a limiting instruction is given. (391 U.S. at pp. 126-137 [20 L.Ed.2d at pp. 479-486].) The otherwise valid presumption cannot operate in such a situation. \"[There] are some contexts in which the risk that the jury will not, or cannot, follow instructions is so great, and the consequences of failure so vital to the defendant, that the practical and human limitations of the jury system cannot be ignored. [Citations.] Such a context is presented here, where the powerfully incriminating extrajudicial statements of a codefendant, who stands accused side-by-side with the defendant, are deliberately spread before the jury in a joint trial. Not only are the incriminations devastating to the defendant but their credibility is inevitably suspect, a fact recognized when accomplices do take the stand and the jury is instructed to weigh their testimony carefully given the recognized motivation to shift blame onto\n\nothers. The unreliability of such evidence is intolerably compounded when the alleged accomplice, as here, does not testify and cannot be tested by cross-examination. It was against such threats to a fair trial that the Confrontation Clause was directed.\" (Id. at pp. 135-136, fns. omitted [20 L.Ed.2d at p. 485].) As the court's discussion reveals, the rule is fundamentally premised on the \"devastating\" nature of the codefendant's inculpating statement and its \"unreliability.\"\n\nThe rule and its basis were concisely stated by Justice Stewart in his concurring opinion in Bruton : \"the underlying rationale of the Sixth Amendment's Confrontation Clause precludes reliance upon cautionary instructions when the highly damaging out-of-court statement of a codefendant, who is not subject to cross-examination, is deliberately placed before the jury at a joint trial. A basic premise of the Confrontation Clause, it seems to me, is that certain kinds of hearsay [citations] are at once so damaging, so suspect, and yet so difficult to discount, that jurors cannot be trusted to give such evidence the minimal weight it logically deserves, whatever instructions the trial judge might give.\" (391 U.S. at pp. 137-138 [20 L.Ed.2d at p. 486].)\n\nIt is not the case, however, that a codefendant's out-of-court statement inculpating the other defendant is per se unreliable and hence inadmissible under the Confrontation Clause. (Lee v. Illinois (1986) 476 U.S. 530, 539-543 [90 L.Ed.2d 514, 525-527, 106 S.Ct. 2056, 2061-2063].) Rather, such a statement is only presumptively unreliable. (Ibid.) The presumption, however, is \"weighty\" (id. at p. 546 [90 L.Ed.2d at p. 530, 106 S.Ct. at p. 2065]), and can be overcome only \"by a 'showing of particularized guarantees of trustworthiness'\" (id. at p. 543 [90 L.Ed.2d at p. 528, 106 S.Ct. at p. 2064]) or \"'indicia of reliability'\" (id. at p. 543 [90 L.Ed.2d at p. 527, 106 S.Ct at p. 2063]).\n\nIn People v. Aranda, supra, 63 Cal. 2d 518, 528-530, we anticipated the effect of Bruton by holding that even if a limiting instruction is given it is error to admit at a joint trial a codefendant's extrajudicial self-incriminating statement when such statement inculpates another defendant. In coming to this conclusion we declined to rest on constitutional grounds, but acknowledged that the defendant's right of confrontation and cross-examination was implicated. (Id. at pp. 529-530.) Subsequently, however, we recognized that the Aranda rule is based at least in part on constitutional considerations. (See People v. Floyd (1970) 1 Cal. 3d 694, 719 [83 Cal. Rptr. 608, 464 P.2d 64].) The premise of Aranda is essentially the same as that of Bruton : jurors should not be permitted to be influenced by evidence that as a matter of law they cannot consider but as a matter of fact they cannot ignore. (Aranda, supra, 63 Cal. 2d at pp. 528-530.)\n\nUnder Bruton and Aranda, the admission of the statements Sheila made to the experts was plainly error. Her statement that her actions in the orange grove were not of her own volition but were done because she felt she had to follow defendant's orders clearly implied that both defendant and she were guilty of the crimes but that defendant was the more guilty. Clearer still were her statements that she felt strongly defendant killed Coselman and knew for a fact he killed Flanagan; that she refused defendant's orders to help him hang Flanagan; and that she lied when she implicated Fred and did so to keep defendant out of trouble. Sheila's statements, in a word, fall squarely within the Bruton-Aranda rule: they implicate her in the incidents in question and incriminate defendant as well.\n\nSheila's statements, moreover, are the very kind the rule was designed to bar. They are potentially prejudicial, amounting as they do to an accusation delivered by the person who claims not only to have witnessed defendant's acts but also to have been in fact his partner in crime. Accordingly, they are manifestly the type of \"evidence against a defendant . . . which [jurors] 'cannot put out of their minds.'\" (Bruton, supra, 391 U.S. at p. 129 [20 L.Ed.2d at p. 481]; see Aranda, supra, 63 Cal. 2d at pp. 528-530.) The statements are also unreliable. What Sheila said to the police and what she said to the examining experts are in conflict: in the latter -- which we consider here -- it was defendant whom she tried to inculpate, in the former it was Fred. All, however, are consistent as part of an evident attempt to shift blame from herself to someone else. Sheila's statements incriminating defendant must therefore be deemed \"inevitably suspect.\" (Bruton, supra, 391 U.S. at p. 136 [20 L.Ed.2d at p. 485].)\n\nFinally, the statements Sheila made bear insufficient \"'indicia of reliability' to rebut the presumption of unreliability that attaches to codefendants' confessions . . . .\" (Lee v. Illinois, supra, 476 U.S. at p. 543 [90 L.Ed.2d at p. 527, 106 S.Ct. at p. 2063].) Indeed, as stated above, they are highly unreliable, evidently intended as they were to shift blame.\n\nIn asserting that no Bruton-Aranda error occurred, the Attorney General urges that the rule is inapplicable on the facts of this case. He first argues that Sheila's statements do not substantially incriminate defendant. The point is wholly without merit: as we have just shown, the statements plainly and directly implicate defendant in the murder of Coselman and Flanagan.\n\nRelying on language in People v. Jackson (1979) 92 Cal. App. 3d 556 [155 Cal. Rptr. 89], People v. Romo (1975) 47 Cal. App. 3d 976 [121 Cal. Rptr. 684], and People v. Epps (1973) 34 Cal. App. 3d 146 [109 Cal. Rptr. 733], the Attorney General next maintains it is not Bruton-Aranda error to admit extrajudicial statements that incriminate the defendant as well as the\n\ndeclarant codefendant when substantial independent evidence links the defendant to the crime. But at least when, as here, the classic Bruton situation is present -- the codefendant's extrajudicial statements inculpate the defendant, the codefendant chooses not to take the stand, and the statements are deliberately spread before the jury in a joint trial -- the substantiality of the other evidence goes not to whether the court erred in admitting the statements but to whether the manifest error thus committed was prejudicial. (See Parker v. Randolph, supra, 442 U.S. at pp. 74-75 [60 L.Ed.2d at pp. 724-725].) To the extent Jackson, Romo, and Epps suggest otherwise they are unsound (see People v. Jackson, supra, 92 Cal. App. 3d at p. 564 (dis. opn. of Kaus, P. J.)) and are accordingly disapproved.\n\nThe Attorney General then argues that Bruton and Aranda apply only when there is present a codefendant's confession -- viz., a complete and express acknowledgment of intentional participation in the crime (People v. Morse (1969) 70 Cal. 2d 721 [76 Cal. Rptr. 391, 452 P.2d 607]) -- as opposed to any statement that incriminates the other defendant as well as the declarant. He is incorrect.\n\nBoth Bruton and Aranda use the broad term \"statement\" and the narrow term \"confession\" interchangeably, and neither expressly nor impliedly limits its reach to the latter. (See Bruton v. United States, supra, 391 U.S. at pp. 126, 132, 135 [20 L.Ed.2d at pp. 479, 483-485]; People v. Aranda, supra, 63 Cal. 2d at pp. 528, 530, 531.)\n\nMoreover, all statements inculpating the declarant codefendant and the other defendant appear to fall within the rationale of the rule. Indeed, as People v. Fulks (1980) 110 Cal. App. 3d 609, 616-617 [168 Cal. Rptr. 203], correctly implies, what is material for Bruton-Aranda analysis is not how the statement under review should be classified in the abstract -- as a confession, an admission, or even an exculpatory declaration -- but rather whether on the facts of the individual case it operates to inculpate the other defendant. Thus, the Attorney General fails to demonstrate that the applicability of the rule should turn on whether the statement in question can be technically categorized as a confession.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe Attorney General's final argument, which rests on People v. Braun (1973) 29 Cal. App. 3d 949 [106 Cal. Rptr. 56], is that the Bruton- Aranda rule does not apply because Sheila's statements were admitted not for their truth to implicate her in the murders, but solely to impeach the experts' opinion of her mental state. The argument runs as follows: the rule\n\nis predicated on \"the justified presumption that the jury is unable to follow an instruction which says, in essence, that 'a confession is true insofar as it admits that A [the declarant] has committed criminal acts with B and at the same time effectively [ignores] the inevitable conclusion that B has committed those same criminal acts with A'\" (People v. Braun, supra, 29 Cal. App. 3d at p. 972); the predicate is not present when, as here, the self- incriminating statements are not admitted against the declarant; in such a case, therefore, the rule should not apply.\n\nWe are not persuaded. First, although both Bruton (391 U.S. at p. 131 [20 L.Ed.2d at p. 482]) and Aranda (63 Cal. 2d at p. 529) recognize the peculiarly difficult, if not impossible, task that the jury faces in taking the declarant codefendant's confession into account so far as it incriminates him but ignoring it so far as it incriminates the other defendant, neither suggests that the rule is premised on the presence of such a factual setting and hence applies only when such circumstances obtain.\n\nSuch a predicate, moreover, is simply too narrow in light of the rationale of the Bruton and Aranda decisions. The unreliability of a codefendant's incriminating statements is plainly not affected by the purpose for which they are introduced at trial. Nor is their impact: as we have observed, the accusation of the person who claims not only to have witnessed the defendant's act but also to have been his partner in crime -- for whatever purpose it is received -- is manifestly the kind of evidence that jurors cannot put out of their minds. Rather, the true predicate is presented in the situation -- like that in the case before us -- in which the \"extrajudicial statements of a codefendant, who stands accused side-by-side with the defendant, are deliberately spread before the jury in a joint trial.\" (Bruton, supra, 391 U.S. at pp. 135-136 [20 L.Ed.2d at p. 485]; see Aranda, supra, 63 Cal. 2d at pp. 528-529.)\n\nIndeed, that the applicability of the rule does not turn on the admission of the codefendant's extrajudicial statements for their truth is clearly implied in Bruton and Aranda themselves.\n\nIn Aranda our discussion was based on the reasoning of Jackson v. Denno (1964) 378 U.S. 368 [12 L.Ed.2d 908, 84 S.Ct. 1774, 1 A.L.R.3d 1205], in which the United States Supreme Court held that a defendant is constitutionally entitled to have the court or possibly a separate jury determine his confession was voluntary before it is submitted to the trial jury for an assessment of its credibility.\n\nWe explained: \"The court did not believe that a jury could separate the issue of the voluntariness of an extrajudicial statement from the issue of its\n\ntruth. 'If there are lingering doubts about the sufficiency of the other evidence, does the jury unconsciously lay them to rest by resort to the confession? Will uncertainty about the sufficiency of the other evidence to prove guilt beyond a reasonable doubt actually result in acquittal when the jury knows the defendant has given a truthful confession. [ para. ] It is difficult, if not impossible, to prove that a confession which a jury has found to be involuntary has nevertheless influenced the verdict or that its finding of voluntariness, if this is the course it took, was affected by other evidence showing the confession was true.' [Citation.] It quoted from Justice Frankfurter's dissent in Delli Paoli to the effect that a jury should not be permitted to be influenced by evidence against a defendant that as a matter of law they cannot consider but as a matter of fact they cannot disregard, and cited Morgan, Some Problems of Proof under the Anglo-American System of Litigation (1956) pages 104-105, to the same effect.\" (63 Cal. 2d at p. 528.)\n\nIn basing our discussion on Jackson, therefore, we impliedly recognized that the jury's task was humanly impossible and hence a limiting instruction practically ineffective whenever such potentially prejudicial evidence was presented to the jury.\n\nIn Bruton it is clearer still that the applicability of the rule does not depend on whether the codefendant's extrajudicial statement is admitted for its truth. In its discussion the United States Supreme Court looked back to Douglas v. Alabama (1965) 380 U.S. 415 [13 L.Ed.2d 934, 85 S.Ct. 1074], and discerned Bruton error there -- even though the codefendant's incriminating statements in that case were not introduced for the truth of the matters stated therein, but only to refresh a witness's recollection. (391 U.S. at pp. 126-127 [20 L.Ed.2d at p. 480].)\n\nIn any event, it is not entirely accurate to say that Sheila's statements were not introduced for their truth. The jury, to be sure, was instructed to accept the statements only as bearing on the experts' opinion of her mental state. But during one expert's testimony, the following exchange took place.\n\n\"The Court: . . . [The] information given by the defendant [Sheila] Anders, to the doctor, is not being offered for the truth of those statements, but the information upon which the doctor based his opinion, and you are to accept it in that limited area . . . .\n\n\"[Prosecutor]: Thank you, Your Honor. Pardon me, Your Honor, but as these statements of this defendant relate to the events of the date [of the murders], I would be offering them for the truth of the matters asserted, in that I think they are admissions.\n\n\"The Court: Well, as to her, [Sheila]?\n\n\"[Prosecutor]: As to her only, of course.\n\n\"The Court: But not as to [defendant].\"\n\nThus, it is not improbable that as a result of the court-created confusion the jury or at least some of its members may have considered Sheila's statements on the issue of her guilt or innocence while attempting to ignore them insofar as they incriminated defendant -- the very task that Bruton and Aranda held jurors were incapable of performing.\n\nMoreover, in his closing argument the prosecutor dwelled on the experts' testimony and quoted liberally from Sheila's extrajudicial statements incriminating defendant. Although he pointed out that his argument was intended solely to discredit the experts' opinions of Sheila's mental state, the inevitable effect of the argument was to increase the difficulty of the jury's task of ignoring the statements as they related to defendant. Indeed, at some points the prosecutor appeared to be arguing that Sheila's statements were to be considered for their truth. For example, he stated, \"she told [one expert] she implicated Freddie, her own brother, because she was afraid that [defendant] was going to get into trouble . . . . Doesn't that show she was still trying to protect [defendant], even after she said she saw him commit these two sickening murders, horrifying acts, and yet this doctor has the opinion that he already told you; after that, she still has the ability to try to blame it on her own brother, rather than tell the truth about what happened.\"\n\nTo use words we used in Aranda, \"In his argument to the jury, the prosecutor linked the cases of the two defendants together and in effect urged [Sheila's statements] as evidence against [defendant].\" (63 Cal. 2d at p. 527.) Thus, \"In view of this summation, it is highly unlikely that the jury could have disregarded [Sheila's statements] when it decided the question of [defendant's] . . . guilt or innocence.\" (Id. at p. 527, fn. 5.)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe plurality opinion in Parker v. Randolph, supra, 442 U.S. 62, refutes the Attorney General's claim that the Bruton-Aranda rule is inapplicable on\n\nthe facts of this case. The Parker plurality opinion gave Bruton the narrowest reading the United States Supreme Court has ever given that decision in concluding that the rule did not apply to a situation in which the defendant and his codefendant have given \"interlocking\" self-incriminating statements. In Cruz v. New York, supra, 481 U.S. [95 L.Ed.2d 162, 107 S.Ct. 1714], however, the high court rejected that conclusion and held that the codefendant's \"interlocking\" statement is within the rule and, as such, is presumptively unreliable. But even as stated in Parker, the rule is applicable here.\n\nIn pertinent part the reasoning of the Parker plurality opinion is as follows. \" Bruton recognized that admission at a joint trial of the incriminating extrajudicial statements of a nontestifying codefendant can have 'devastating' consequences to a nonconfessing defendant, adding 'substantial, perhaps even critical, weight to the Government's case.' [Citations.] Such statements go to the jury untested by cross-examination and, indeed, perhaps unanswered altogether unless the defendant waives his Fifth Amendment privilege and takes the stand. The prejudicial impact of a codefendant's confession upon an incriminated defendant who has, insofar as the jury is concerned, maintained his innocence from the beginning is simply too great in such cases to be cured by a limiting instruction. The same cannot be said, however, when the defendant's own confession -- \"probably the most probative and damaging evidence that can be admitted against him,' [citation] -- is properly introduced at trial. The defendant is 'the most knowledgeable and unimpeachable source of information about his past conduct,' [citation], and one can scarcely imagine evidence more damaging to his defense than his own admission of guilt. Thus, the incriminating statements of a codefendant will seldom, if ever, be of the 'devastating' character referred to in Bruton when the incriminated defendant has admitted his own guilt. The right protected by Bruton -- the 'constitutional right of cross-examination,' [citation] -- has far less practical value to a defendant who has confessed to the crime than to one who has consistently maintained his innocence. Successfully impeaching a codefendant's confession on cross-examination would likely yield small advantage to the defendant whose own admission of guilt stands before the jury unchallenged. Nor does the natural 'motivation to shift blame onto others,' recognized by the Bruton Court to render the incriminating statements of codefendants 'inevitably suspect,' [citation], require application of the Bruton rule when the incriminated defendant has corroborated his codefendant's statements by heaping blame onto himself.\" (442 U.S. at pp. 72-73 [60 L.Ed.2d at p. 723].)\n\nThe facts of this case plainly come within even the narrow compass of the Bruton rule that the Parker plurality opinion traced. Sheila's extrajudicial statements are potentially prejudicial because they directly implicate\n\ndefendant, who had maintained his innocence from the beginning, in the murders of Coselman and Flanagan. They are also inherently unreliable: present is the natural motivation on the part of Sheila to shift blame onto others; absent is any corroboration in the form of statements by defendant heaping blame onto himself.\n\nWhether the error is reversible is the question to which we now turn. It is established, of course, that Bruton-Aranda error is not prejudicial per se. Brown v. United States (1973) 411 U.S. 223, 231-232 [36 L.Ed.2d 208, 215, 93 S.Ct. 1565], Schneble v. Florida (1972) 405 U.S. 427, 430 [31 L.Ed.2d 340, 346, 92 S.Ct. 1056]; People v. Floyd, supra, 1 Cal. 3d at p. 721, People v. Flores (1968) 68 Cal. 2d 563, 568, fn. 5 [68 Cal. Rptr. 161, 440 P.2d 233]; see, e.g., Harrington v. California (1969) 395 U.S. 250, 252-254 [23 L.Ed.2d 284, 286-288, 89 S.Ct. 1726]; People v. Leach (1975) 15 Cal. 3d 419 [124 Cal. Rptr. 752, 541 P.2d 296].) But because it implicates a federal constitutional right, such error must be scrutinized under the harmless- beyond-a-reasonable-doubt standard of Chapman v. California (1967) 386 U.S. 18 [17 L.Ed.2d 705, 87 S.Ct. 824, 24 A.L.R.3d 1065]. (People v. Leach, supra, at p. 446; see, e.g., Brown v. United States, supra, at pp. 231- 232 [36 L.Ed.2d at p. 215]; Schneble v. Florida, supra, at p. 430 [31 L.Ed.2d at p. 344]; Harrington v. California, supra, at pp. 252-254 [23 L.Ed.2d at pp. 286-288]; People v. Floyd, supra, at p. 721; People v. Flores, supra, at p. 568.)\n\nUnder that test, \"we must determine on the basis of 'our own reading of the record and on what seems to us to have been the probable impact . . . on the minds of the average jury,' [citation], whether [Sheila's] admissions were sufficiently prejudicial to [defendant] as to require reversal.\" (Schneble v. Florida, supra, 405 U.S. at p. 432 [31 L.Ed.2d at p. 345]; accord, Harrington v. California, supra, 395 U.S. at p. 254 [23 L.Ed.2d at pp. 287-288]; People v. Leach, supra, 15 Cal. 3d at p. 447.)\n\nIn performing this task we look for guidance to the following cases, in which the reversibility of Bruton-Aranda error has been considered: Brown v. United States, supra, 411 U.S. 223; Schneble v. Florida, supra, 405 U.S. 427; Harrington v. California, supra, 395 U.S. 250; People v. Leach, supra, 15 Cal. 3d 419; People v. Floyd, supra, 1 Cal. 3d 694; In re Whitehorn (1969) 1 Cal. 3d 504 [82 Cal. Rptr. 609, 462 P.2d 361]; In re Lara (1969) 1 Cal. 3d 486 [82 Cal. Rptr. 628, 462 P.2d 380]; In re Hill (1969) 71 Cal. 2d 997 [80 Cal. Rptr. 537, 458 P.2d 449]; In re Sears (1969) 71 Cal. 2d 379 [78 Cal. Rptr. 180, 455 P.2d 116]; and People v. Flores, supra, 68 Cal. 2d 563.\n\nIn each of the cases in which the error was held harmless, two elements were present: (1) the properly admitted evidence was overwhelming; and (2) the evidence provided by the incriminating extrajudicial statement was\n\ncumulative of other direct evidence presented either through eyewitness testimony (People v. Floyd, supra, 1 Cal. 3d at pp. 702, 720-721), or out of the defendant's own mouth (Schneble v. Florida, supra, 405 U.S. at pp. 430- 432 [31 L.Ed.2d at pp. 344-345]; People v. Leach, supra, 15 Cal. 3d at pp. 446-448; In re Whitehorn, supra, 1 Cal. 3d at pp. 512-517; In re Lara, supra, 1 Cal. 3d at pp. 488-490; People v. Flores, supra, 68 Cal. 2d at pp. 565, 568), or both (Brown v. United States, supra, 411 U.S. at pp. 224-227, 230-232 [36 L.Ed.2d at pp. 211-215]; Harrington v. California, supra, 395 U.S. at pp. 252-254 [23 L.Ed.2d at pp. 286-288]; In re Hill, supra, 71 Cal. 2d at pp. 1013-1015). By contrast, in In re Sears, supra, 71 Cal. 2d at pages 383-388, in which the error was not held harmless, neither element was present.\n\nFrom these cases, therefore, the following rule may be derived: if the properly admitted evidence is overwhelming and the incriminating extrajudicial statement is merely cumulative of other direct evidence, the error will be deemed harmless.\n\nHere the properly admitted evidence is overwhelming: Fred's crucial testimony was largely that of an eyewitness; it was internally consistent; and it was corroborated by physical evidence -- notably, the presence near the bodies of shoeprints matching defendant's and Sheila's shoes. Moreover, there is other direct evidence that incriminates defendant in substantially the same respects as Sheila's extrajudicial statements -- viz., the testimony of Fred. His testimony, it is true, does not provide an eyewitness account of the killing of Flanagan, as Sheila's statements do. Its failure to do so, however, is not critical on the facts of this case. At trial the prosecution and defense in effect agreed that one and the same person murdered both victims; they disagreed on who that person was. Fred's testimony identified defendant as the killer -- with respect, specifically, to Coselman; Sheila's statements did the same -- with respect, specifically, to Flanagan. Fred's testimony, therefore, effectively incriminates defendant on the same material point as do Sheila's statements. Thus, it follows that Sheila's extrajudicial statements implicating defendant in the kidnapping, robbery, and murder of Coselman and Flanagan were merely cumulative of other properly admitted direct evidence. Accordingly, we conclude that in this case the Bruton-Aranda error was harmless beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nB. Change of Venue\n\nDefendant next contends the court erred in denying his motion for change of venue under Penal Code section 1033 on the ground that pretrial publicity had prejudiced potential jurors against him.\n\nSection 1033 states in relevant part: \"In a criminal action . . . the court shall order a change of venue . . . [on] motion of the defendant, to another county when it appears that there is reasonable likelihood that a fair and impartial jury cannot be had in the county . . . .\" We have explained that \"Whether raised on petition for writ of mandate or on appeal from judgment of conviction, the reviewing court must independently examine the record and determine de novo whether a fair trial is or was obtainable. [Citations.] The factors to be considered are the nature and gravity of the offense, the nature and extent of the news coverage, the size of the community, the status of the defendant in the community, and the popularity and prominence of the victim.\" (People v. Harris (1981) 28 Cal. 3d 935, 948 [171 Cal. Rptr. 679, 623 P.2d 240].)\n\nOf these factors, only the first weighs in favor of a change of venue in this case. \"Murder is, of course, a crime of the utmost gravity, and these murders were especially heinous.\" (People v. Harris, supra, 28 Cal. 3d at p. 948.)\n\nThe other four factors are either neutral or weigh against a change of venue. The news coverage was neither extensive nor inflammatory. There was no evidence of unfavorable pretrial television or radio coverage. Defendant submitted only 15 newspaper articles from 3 different papers with a total circulation of 32,000. None of the articles was in any way sensational. Concededly, the articles contained certain information directly or indirectly supporting the prosecution's case, such as the fact that Fred had incriminated defendant, had taken a polygraph examination, and had testified at the preliminary hearing without immunity. The last article, however, was printed in April 1979 -- about five months before jury selection began. Through the passage of time, therefore, the danger of prejudice was significantly reduced.\n\nThe size of the community is a neutral factor here. The smaller the community, the greater the likelihood the accused will not get a fair trial in a case of this nature. At the time the offense was committed, Riverside County had a population of about 600,000, and the jury was chosen from an area containing about 130,000 residents. Thus, defendant was tried in a community larger than many in which a venue change has been required (e.g., Maine v. Superior Court (1968) 68 Cal. 2d 375 [66 Cal. Rptr. 724, 438 P.2d 372] [Mendocino County, population 52,400]; Fain v. Superior Court (1981) 2 Cal. 3d 46 [84 Cal. Rptr. 135, 465 P.2d 23] [Stanislaus County, population 184,600]; People v. Tidwell (1970) 3 Cal. 3d 62 [89 Cal. Rptr. 44, 473 P.2d 748 [Lassen County, population 17,500]), but smaller than some in which it has not been required (e.g., People v. Harris, supra, 28 Cal. 3d at p. 949 [San Diego County, population over 1 million]).\n\nThe status of both defendant and his victims in the community weighs against a venue change. Here they were merely passing through the area and had no local notoriety or popularity.\n\nWhen, as here, we review a denial of a motion for change of venue on appeal from a judgment of conviction, we may also examine the voir dire to see if the defendant's actual jury may have been prejudiced by pretrial publicity. (People v. Harris, supra, 28 Cal. 3d at p. 949.) \"Before discussing the voir dire in this case, it should be emphasized that the controlling cases 'cannot be made to stand for the proposition that juror exposure . . . to news accounts of the crime with which he is charged alone presumptively deprives the defendant of due process.' [Citation.] 'It is not required . . . that the jurors be totally ignorant of the facts and issues involved. . . . It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.'\" (Id. at pp. 949-950.)\n\nIn this case we find no evidence of prejudice. Eight of the jurors had no knowledge of the underlying facts or issues. Of the four remaining jurors, three said they had heard or read only a little about the case and the other acknowledged recalling the matter generally but none of its details; each declared in substance that he had formed no opinion and could and would reach his decision on the facts presented at trial.\n\nC. Application for Funds for Psychiatric and Psychological Examinations\n\nUnder Penal Code section 987.9, defendant made an application for funds for psychiatric and psychological examinations to the Honorable Richard Marsh of the Riverside Superior Court, who was not the trial judge. Because he was unfamiliar with section 987.9 procedure, Judge\n\nMarsh consulted with other judges of the court, including the trial judge, and thereafter conducted an in camera hearing and approved the funds. Defendant then moved to disqualify all the judges who were made aware of his application on the ground that the provision impliedly prohibited any judge who participated in passing on a request from presiding over the trial. A municipal court judge heard and denied the motion.\n\nDefendant contends in substance that Judge Marsh's disclosure of his application and the subsequent denial of his disqualification motion effectively violated the confidentiality requirement of section 987.9 and thereby infringed his rights against self-incrimination and to due process and effective assistance of counsel.\n\nSection 987.9 states in relevant part: \"In the trial of a capital case the indigent defendant, through his counsel, may request the court for funds for the specific payment of . . . experts . . . . The fact that such an application has been made shall be confidential and the contents of the application shall be confidential. Upon receipt of such application, a judge of the court, other than the trial judge presiding over the capital case in question, shall rule on the reasonableness of the request . . . .\"\n\nThe confidentiality requirement was evidently intended to prevent the prosecution from learning of the application for funds and thereby improperly anticipating the accused's defense. (66 Ops.Cal.Atty.Gen. 407, 408-410 (1983); see Keenan v. Superior Court (1982) 31 Cal. 3d 424, 430 [180 Cal. Rptr. 489, 640 P.2d 108].) The mandate that a judge other than the trial judge rule on the application -- the \"other-judge\" provision -- was clearly designed to support the confidentiality requirement and to further its purpose.\n\nAs the cited Attorney General's opinion explains: \"To satisfy the demands of the California cases which have placed restrictions on discovery by the prosecution, the section provides that the fact of any application for such funds, as well as its contents, be confidential, and that any hearings and rulings made thereon take place in camera, i.e., in a closed meeting with the judge outside the presence of others including the prosecution. [Citations.] . . .\n\n\"In Prudhomme v. Superior Court [1970] 2 Cal. 3d 320, our Supreme Court held that a defendant may not be compelled by a discovery order to disclose information to the prosecution (such as the names, addresses and expected testimony of defense witnesses) unless the information sought 'cannot possibly tend to incriminate [him]' or 'conceivably . . . lighten the prosecution's burden of proving its case in chief.' [Citation.] Compelled\n\ndisclosure otherwise would violate a defendant's federal constitutional right against self-incrimination. [Citation.] In Reynolds v. Superior Court (1974) 12 Cal. 3d 834, 843 (notice of alibi) the court admitted it was 'more solicitous of the privilege against self-incrimination than federal law . . . requires' [citation] and in Allen v. Superior Court (Dec. 1976) 18 Cal. 3d 520 it iterated that solicitude, affirmed the stringent standards it set forth in Prudhomme for protection of the privilege, and, now founding it on article I, section 15, of the California Constitution [citation], issued a writ of prohibition to restrain enforcement of a discovery order compelling disclosure of the names of prospective defense witnesses in a criminal case. [Citation.]\n\n\"Section 987.9 was enacted in September 1977 as an urgent measure to accompany the Legislature's restoration of capital punishment . . . . At the time it was enacted we can safely presume the Legislature was aware of the decisional background wrought by the Prudhomme Reynolds Allen line of cases which placed restrictions on discovery by the prosecution that would compromise the defense. [Citation.] In light of it the purpose for the confidentiality provisions of section 987.9 is seen as an effort to fill the constitutional need of providing the indigent defendant in a capital case with sufficient monies for ancillary services necessary to prepare and present a complete and effective defense but in such a way that would not run afoul of the constitutional warnings of Prudhomme and Allen against premature forced disclosures of certain of its aspects, i.e., those which would 'tend to incriminate the defendant' or 'might conceivably lighten the prosecution's burden.' Undoubtedly the Legislature felt an impermissible disclosure would occur if a defendant's need for monies for ancillary services and its particulars were made known to the prosecution. It thus provided for their confidentiality in section 987.9 to avoid that possibility and freed the defense from the course it otherwise would have had to steer between the Scylla of publicly applying for needed funds and in so doing disclosing some of the defense to the prosecution and the Charybdis of keeping the defense secret but, in so doing, foregoing the necessary monies for its preparation and presentation.\" (66 Ops.Cal.Atty.Gen., supra, at pp. 408-410, fn. omitted, italics in original.)\n\nWe agree with defendant that the confidentiality requirement of section 987.9 was violated here. In considering the application, Judge Marsh sought the advice of other judges of the court and communicated, at the very least, the fact that an application had been made. Further, he discussed the matter with the trial judge -- to whom, the provision clearly implies, disclosure should not be made.\n\nThe violation, however, does not constitute reversible error. Per se reversibility is, of course, the exception to the general rule requiring a showing of\n\nprejudice. (See People v. Bostick (1965) 62 Cal. 2d 820, 823-827 [44 Cal. Rptr. 649, 402 P.2d 529].) Defendant fails to show that a violation such as occurred in this case falls within this exception. Thus, reversibility here depends on whether defendant was deprived of a fair trial or otherwise suffered prejudice as a result. (Cf. People v. Pompa-Ortiz (1980) 27 Cal. 3d 519, 529-530 [165 Cal. Rptr. 851, 612 P.2d 941] [irregularities in preliminary examination procedures].) The fundamental and immediate harm that a violation of section 987.9 threatens, of course, is the disclosure of potentially significant information to the prosecution.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Such harm did not flow proximately from the violation here: there is simply no evidence that the information communicated by Judge Marsh made its way either directly or indirectly to the prosecution.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nD. Jury-selection Issues\n\nDefendant next raises two contentions that relate to the selection of the jury. He first argues that the court erred in not conducting the death-qualification of each potential juror in sequestration under the rule of Hovey v. Superior Court (1980) 28 Cal. 3d 1 [168 Cal. Rptr. 128, 616 P.2d 1301].\n\nIn Hovey we concluded that prospective jurors who are subjected to death-qualifying voir dire in open court may as a result be more likely to convict and sentence to death than they otherwise would. (Id. at pp. 69-81.) As a consequence we established the practice that is currently used by the courts of this state: \"In order to minimize the potentially prejudicial effects [of open-court voir dire], this court declares, pursuant to its supervisory authority over California criminal procedure, that in future capital cases that portion of the voir dire of each prospective juror which deals with issues which involve death-qualifying the jury should be done individually and in sequestration.\" (Id. at p. 80, fn. omitted.)\n\nInitially, we are doubtful that defendant can be deemed to have preserved the issue on appeal. Before trial he moved that each potential juror be examined individually and separately. The court granted the motion and ruled, without objection on the part of defendant, that after examination each potential juror not challenged for cause could remain in the jury box while the following potential jurors were subjected to voir dire. A proper objection could have prevented the claimed error. By failing to object, therefore, defendant may be deemed to have waived the issue.\n\nBut assuming we may properly consider the contention, we conclude that it is without merit. The Hovey rule is expressly prospective; defendant's trial, however, took place before its effective date. To avoid this result, defendant argues that the rule is of constitutional dimension and must therefore be applied retroactively. In Hovey, however, we clearly indicated that we adopted the rule pursuant to our supervisory authority over California criminal procedure and not under constitutional compulsion, and that we did so because the prejudicial effects associated with death-qualifying voir dire in open court had not been shown to be actual but only potential. (28 Cal. 3d at pp. 69-81.) Because defendant has not shown that such prejudicial effects are, in fact, actual, we decline to hold that the Hovey rule is of constitutional dimension.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nDefendant next contends that the court's apportionment of peremptory challenges in accordance with Penal Code section 1070.5 -- 36 to the prosecution, 26 to the defendants jointly, and 5 each to the defendants individually -- was constitutionally impermissible. Because he merely states the point without offering either argument or authority in support, we have no reason to reexamine our holding in People v. Lara (1967) 67 Cal. 2d 365, 394-395 [62 Cal. Rptr. 586, 432 P.2d 202], that section 1070.5 \"does not violate either defendant's right to trial by an impartial jury or any other constitutional right.\"\n\nE. \" Other Crimes\" Evidence\n\nDefendant contends the court improperly admitted evidence of two prior criminal acts: (1) his plan to rob a gasoline station, which was described by Fred; and (2) his living on what Sheila earned as a\n\nprostitute, which was related by certain of the expert witnesses in explaining the basis of their opinion on her mental state.\n\nEvidence of other crimes is generally inadmissible. (See People v. Thompson (1980) 27 Cal. 3d 303, 314-318 [165 Cal. Rptr. 289, 611 P.2d 883]; People v. Schader (1969) 71 Cal. 2d 761, 772-773 [80 Cal. Rptr. 1, 457 P.2d 841]; People v. Kelley (1967) 66 Cal. 2d 232, 238-239 [57 Cal. Rptr. 363, 424 P.2d 947].) To this general rule, however, there is an exception: when other-crimes evidence is sought to be introduced for a permissible purpose -- to prove an intermediate fact, such as modus operandi, from which an inference of an ultimate fact, such as the identity of the perpetrator, may be drawn -- it is not automatically excluded. (See, e.g., People v. Alcala (1984) 36 Cal. 3d 604, 631 [205 Cal. Rptr. 775, 685 P.2d 1126]; People v. Thompson, supra, at p. 315; People v. Kelley, supra, at p. 239.) Before such evidence may be admitted, however, three conditions articulated in Thompson must be met: (1) the ultimate fact sought to be proved must be material; (2) the evidence of the uncharged crimes must tend to prove or disprove the material fact; and (3) there must be no extrinsic policy requiring exclusion. (27 Cal. 3d at p. 315; accord, People v. Alcala, supra, at pp. 631-632.)\n\nDefendant may not now complain of the admission of the evidence relating to pimping as violative of the Thompson rule. \"Because of [his] failure to make a timely and specific objection on this ground, . . . the point must be deemed waived.\" People v. Green (1980) 27 Cal. 3d 1, 22 [164 Cal. Rptr. 1, 609 P.2d 468].)\n\nAs to the evidence of the plan to rob the gasoline station, an important question must be resolved at the threshold: does the Thompson rule apply at all? The evidence here relates to an unconsummated plan and hence does not appear to be other-crimes evidence in the strict sense. In Thompson we explained, \"The primary reasoning that underlies [the] . . . rule of exclusion . . . is the insubstantial nature of the inference [of a criminal disposition] as compared to the 'grave danger of prejudice' to an accused when evidence of an uncharged offense is given to a jury.\" (27 Cal. 3d at p. 317.) In the context of this case, however, evidence of the plan to rob implicates the fundamental concern underlying Thompson as much as would evidence of a completed robbery and therefore stands as the virtual equivalent of such evidence. Accordingly, we conclude that the Thompson rule does in fact apply in the circumstances before us.\n\nUnder Thompson, we have some doubt that the admission of the evidence was error. The first two Thompson conditions, to be sure, are satisfied: the evidence of the plan had a tendency to prove that defendant's modus operandi included tying up his victim with rope and hence that he, not Fred,\n\ncommitted the robberies -- an ultimate fact at issue here.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The third condition, however, may not have been met. It is true that an important extrinsic policy declares that \"[if] evidence is 'merely cumulative with respect to other evidence which the People may use to prove the same issue,' it is excluded under a rule of necessity.\" (People v. Thompson, supra, 27 Cal. 3d at p. 318; accord, People v. Guerrero (1976) 16 Cal. 3d 719, 724-725 [129 Cal. Rptr. 166, 548 P.2d 366].) But in this case we are reluctant to label the evidence of the plan as \" merely cumulative\": the other evidence going to identification was the testimony concerning the events of March 4, 1979, given by Fred -- who the jury could have believed was an accomplice.\n\nAssuming the court erred in admitting the evidence of defendant's plan to rob the gasoline station, we must now decide whether the claimed error was prejudicial under People v. Watson (1956) 46 Cal. 2d 818 [299 P.2d 243]. (People v. Alcala, supra, 36 Cal. 3d at pp. 635-636.) We hold that it was not. Although in general other-crimes evidence involves the risk of prejudice (e.g., People v. Thompson, supra, 27 Cal. 3d at p. 318), the evidence here was not sensational in nature or inflammatory in effect. Further, the properly admitted evidence against defendant was overwhelming. It follows that it is not reasonably probable that a result more favorable to defendant would have been reached in the absence of the claimed error. (People v. Watson, supra, at p. 837.)\n\nF. Admission of Photographs\n\nDefendant contends the court erred by receiving into evidence certain photographs of the bodies of the victims at the crime scene offered by the prosecution apparently to show premeditation and deliberation or intent to kill. We have serious doubt whether the photographs were properly admitted. Some, which do not reveal the manner of death, appear to go only to the issue whether a human being had been killed. As such they seem relevant only on what in this case is a nonissue and therefore should not have been received into evidence. (People v. Turner, supra, 37 Cal. 3d 302, 320-321.) The other photographs, which do reveal how the victims were killed, are indeed relevant. But they are also largely cumulative of expert and lay testimony regarding the cause of death, the crime scene, and the position of the bodies. In any event, whatever error may have been committed was harmless: the photographs, as defendant impliedly concedes, are not unduly gruesome and the evidence of guilt was overwhelming. (Id. at p. 321.)\n\nG. Accomplice Instructions\n\nDefendant finally contends that the court erred by leaving to the jury the question whether Fred was an accomplice and as such deserved distrust, instead of resolving it for them as a matter of law.\n\n\"An accomplice is . . . defined as one who is liable to prosecution for the identical offense charged against the defendant . . . .\" (Pen. Code, § 1111; accord, People v. Tewksbury (1976) 15 Cal. 3d 953, 960 [127 Cal. Rptr. 135, 544 P.2d 1335].) \"This definition includes all principals in a criminal act . . . but does not include accessories . . . . Whether a person is an accomplice is a question of fact for the jury unless there is no dispute as to either the facts or the inferences to be drawn therefrom.\" (Ibid.) The defendant must establish accomplice status by a preponderance of the evidence. (Id. at p. 968.)\n\nIn this case defendant has failed to carry his burden. He argues in essence that the acts that Fred himself admitted on the stand necessarily establish his criminal liability as an aider and abetter. Criminal liability attaches in a theory of aiding and abetting, however, only if the subject \"[acts] with knowledge of the criminal purpose of the perpetrator and with an intent or purpose either of committing, or of encouraging or facilitating commission of, the offense.\" (People v. Beeman (1984) 35 Cal. 3d 547, 560 [199 Cal. Rptr. 60, 674 P.2d 1318].) Here Fred vigorously and steadfastly denied that he acted with the requisite criminal intent, but asserted he did what he did solely out of fear of defendant.\n\nIII. Special Circumstance Issues\n\nA. Felony-murder Special Circumstances\n\nDefendant contends the court failed to instruct in accord with Carlos v. Superior Court, supra, 35 Cal. 3d 131, that intent to kill was an element of the felony-murder special circumstances. In response, the Attorney General urges us to reconsider Carlos. We would generally be reluctant to do so: \"stare decisis and respect for the judicial process require adherence to decisions rendered so recently by a substantial majority of this court.\" (People v. Hamilton (1985) 41 Cal. 3d 408, 439 [221 Cal. Rptr. 902, 710 P.2d 981] (conc. \u0026 dis. opn. of Mosk, J.).) But because, as we shall explain, one of the bases of Carlos has proved to be unsound, we undertake a reexamination of that decision. As will appear, we conclude that the broad holding of Carlos that intent to kill is an element of the felony-murder special circumstance cannot stand, and that the following narrow holding must be put in its place: intent to kill is not an element\n\nof the felony-murder special circumstance; but when the defendant is an aider and abetter rather than the actual killer, intent must be proved before the trier of fact can find the special circumstance to be true.\n\nIn Carlos v. Superior Court, supra, 35 Cal. 3d 131, we held that intent to kill was an element of the felony-murder special circumstance whether or not the defendant was the actual killer. Our reasoning involved the following two steps. First, Penal Code section 190.2, subdivision (a)(17) (hereafter section 190.2(a)(17)) -- which defines the relevant special circumstance -- and section 190.2, subdivision (b) (hereafter section 190.2(b)) -- which governs the liability of the intentional aider and abetter -- may reasonably be read both to require and not to require intent to kill generally, and are therefore ambiguous on the point. Second, in light of certain rules of construction -- specifically, the rule that penal statutes, and especially felony-murder provisions, should be interpreted in favor of the defendant and the rule that statutes should be construed to avoid serious constitutional questions -- the provisions should be interpreted to require intent to kill for the actual killer as well as for his aider and abetter. (Id. at pp. 138-154.)\n\nIn taking the second step identified above, we relied heavily on Justice White's majority opinion in the then-recent decision of the United States Supreme Court in Enmund v. Florida (1982) 458 U.S. 782 [73 L.Ed.2d 1140, 102 S.Ct. 3368]. Although we recognized that \"The holding in Enmund was carefully limited to the case of a defendant who did not kill, attempt to kill, or contemplate that life would be taken,\" on our reading we believed that \"The reasoning of the case . . . raises the question [under the Eighth Amendment] whether the death penalty can be imposed on anyone who did not intend or contemplate a killing, even the actual killer. The court's analysis of the deterrent and retributive purpose of the death penalty focuses on the subjective intent and moral culpability of the defendant, and in this context there is no basis to distinguish the killer from his accomplice. The threat of capital punishment is unlikely to deter an accidental or negligent killing, and in terms of moral responsibility for an unintended homicide, all participants in the underlying felony would seem equally culpable.\" (35 Cal. 3d at p. 150, italics added.)\n\nOur understanding of the thrust of the Enmund reasoning was in accord with the position its author had taken in Lockett v. Ohio (1978) 438 U.S. 586 [57 L.Ed.2d 973, 98 S.Ct. 2954]. In his separate opinion in that case, Justice White declared: \"I would hold that death may not be inflicted for killings consistent with the Eighth Amendment without a finding that the defendant engaged in conduct with the conscious purpose of producing death. . .\" (Id. at p. 628 [57 L.Ed.2d at p. 1004], italics added.)\n\nMoreover, our understanding was shared by many commentators. For example, Professors Nelson Roth and Scott Sundby wrote: \"The Enmund majority's discussion of culpability, although dealing with a nontriggerman, also extends to those whose actions directly but unintentionally lead to the victim's death. Although it may be a rare case where a defendant who directly caused the death of another would not have the requisite culpability . . ., the Court's concern with severe punishment of unintentional crimes applies with equal force whether the defendant's actions or a co-felon's actions directly led to the victim's death.\" (Roth \u0026 Sundby, The Felony-Murder Rule: A Doctrine at Constitutional Crossroads (1985) 70 Cornell L.Rev. 446, 484, italics added.)\n\nSimilarly, Professors F. Patrick Hubbard, Brenton Burry, and Robert Widener opined that \"the rationales of Enmund and other cases suggest that the death sentence for either [a robber who actually but unintentionally kills his victim] or [his accomplice] would be unconstitutional for two reasons. First, it would probably be disproportionate to the crimes involved. . . . Thus retributive notions of just deserts would not be served by killing them. In addition, as Justice White noted in Enmund, such robbers are not likely to be deterred by the very slight chance that a death will occur.\" (Hubbard et al., A \"Meaningful\" Basis for the Death Penalty: The Practice, Constitutionality, and Justice of Capital Punishment in South Carolina (1982) 34 S.C.L.Rev. 391 513-514, fns. omitted.)\n\nOver two years after we filed Carlos, however, the United States Supreme Court made it plain that we had read Enmund more broadly than it had intended. In Cabana v. Bullock (1986) 474 U.S. 376 [88 L.Ed.2d 704, 106 S.Ct. 689], the court stated that \"The Eighth Amendment is satisfied so long as the death penalty is not imposed upon a person ineligible under Enmund for such punishment. If a person sentenced to death in fact killed, attempted to kill, or intended to kill, the Eighth Amendment is not violated by his or her execution . . . . \" (Id. at p. 386 [88 L.Ed.2d at p. 716, 106 S.Ct. at p. 697], italics added.) In these words the court declared that the Eighth Amendment did not require intent to kill for the execution of the judgment of death -- less still for the determination of death-eligibility.\n\nA year later, the court made the point even more clearly. In Tison v. Arizona (1987) 481 U.S. [95 L.Ed.2d 127, 107 S.Ct. 1676], the majority noted: \"The dissent objects to our classification of California among the States whose statutes authorize capital punishment for felony murder simpliciter on the ground that the California Supreme Court in Carlos v. Superior Court [citation] construed its capital murder statute to require a finding of intent to kill. [Citation.] But the California Supreme Court only did so in light of perceived federal constitutional limitations stemming from our then\n\nrecent decision in Enmund.\" (Id. at p. , fn. 8 [95 L.Ed.2d at pp. 141-142, 107 S.Ct. at p. 1686].) In so stating -- and notwithstanding its mischaracterization of the basis of Carlos (see 35 Cal. 3d at pp. 134-136, 138-152, 153-154) -- the court impliedly declared its disagreement with our reading of Enmund.\n\nBecause one of the bases on which we rested our decision in Carlos has thus proved to be unsound, we believe that it is our duty to reconsider the question whether and under what circumstances intent to kill is an element of the felony-murder special circumstance.\n\nWe begin with the words of the statutory provisions. Section 190.2(a)(17) defines the relevant special circumstance as, \"The murder was committed while the defendant was engaged in or was an accomplice in the commission of, attempted commission of, or the immediate flight after committing or attempting to commit [robbery, kidnapping, rape, sodomy, child molesting, oral copulation, burglary, arson, or trainwrecking].\"\n\nSection 190.2(b) provides in relevant part that \"Every person whether or not the actual killer found guilty of intentionally aiding, abetting, counseling, commanding, inducing, soliciting, requesting, or assisting any actor in the commission of murder in the first degree\" shall suffer death or life imprisonment without possibility of parole in any case in which any special circumstance other than a prior murder conviction is charged and found true.\n\nWe turn to consider the meaning of these statutory provisions. If section 190.2(a)(17) is read alone, it does not require a finding of intent to kill: the plain language of the provision neither expressly nor impliedly demands such a finding.\n\nThis reading is supported by a consideration of the language used to define each of the special circumstances in the 1978 death penalty law. (Pen. Code, § 190.2, subd. (a) (hereafter § 190.2(a).) As we recognized in Carlos : \"In paragraph 17 of the new enactment, the felony murder special circumstance, the absence of any express requirement of intentionality suggests that the circumstance applies to a defendant whether or not he intended to kill. That inference gains force from the fact that 10 of the 18 remaining special circumstances expressly require an intentional killing, implying that the omission of that requirement in paragraph 17 was deliberate.\" (35 Cal. 3d at p. 140.)\n\nThe reading is supported as well by a comparison of the felony-murder special circumstance under the 1977 law and the same special circumstance\n\nunder the 1978 law. Again as we recognized in Carlos : \"The 1978 initiative repealed provisions of the 1977 act requiring . . . a wilful, deliberate, and premeditated killing before the jury could find a felony murder special circumstance. The deletion of an express statutory provision implies an intent to change the substantive law [citation]; the repeal of language requiring that the defendant act 'with the intent to cause death' [citation] thus implies a purpose to permit a special circumstance finding without proof of intent.\" (Id. at p. 143.)\n\nIf section 190.2(a)(17) is read together with section 190.2(b), our reading of the felony-murder special circumstance is not undermined but merely modified by the addition of an exception to the general rule that intent to kill is not required. Section 190.2(a) defines the special circumstances that apply to all first degree murderers, and establishes that intent to kill is an element of some of those special circumstances but not of others; section 190.2(a)(17) defines the felony-murder special circumstance and contains no intent-to-kill requirement. In turn, read in its context, section 190.2(b) lays down a special rule for a certain class of first degree murderers: if the defendant is guilty as an aider and abetter, he must be proved to have acted with intent to kill before any special circumstance (with the exception of a prior murder conviction) can be found true.\n\nAlthough in the abstract the introductory phrase of section 190.2(b) -- \"Every person whether or not the actual killer\" -- encompasses both the actual killer and his aider and abetter, the statutory provision must nevertheless be read to govern the liability of the aider and abetter only. First, section 190.2(b) provides that every person \"found guilty of intentionally aiding, abetting, counseling, commanding, inducing, soliciting, requesting, or assisting any actor in the commission of murder in the first degree\" is death-eligible. (Italics added.) In so doing, the provision uses words that generally and traditionally describe the involvement of an aider and abetter rather than the actual perpetrator. (See, e.g., People v. Durham (1969) 70 Cal. 2d 171, 181 [74 Cal. Rptr. 262, 449 P.2d 198]; People v. Steelik (1921) 187 Cal. 361, 367 [203 P.2d 78]; see also CALJIC No. 3.01 (4th ed. 1979 and 1984 rev.).) These words, therefore, practically compel our reading of the provision.\n\nSecond, section 190.2(b) must be read to govern the liability of the aider and abetter only in light of its broader statutory context. If it were taken to refer to the actual killer as well as his aider and abetter, the provision would effectively reach back and insert an intent-to-kill requirement into each of the special circumstances (with the exception of a prior murder conviction) and thereby render superfluous the express intent requirement that some of them already contain.\n\nWhen we consider extrinsic aids, we do not change our reading of the statute but in fact become convinced of its soundness. First, the analysis by the Legislative Analyst strongly suggests as much. It begins with a summary of the 1977 law, which generally permitted a sentence of death or life without parole only for the actual killer or the person in control of the actual killer. The analysis then proceeds to describe each major part of the 1978 proposition. In evident reference to what was to become section 190.2(b), it states: \"Also, this proposition would specifically make persons involved in the crime other than the actual murderer subject to the death penalty or life imprisonment without possibility of parole under specified circumstances.\" (Ballot Pamp., Gen. Elec. (Nov. 7, 1978) Prop. 7 (hereafter Voter Pamp.), Analysis of Legis. Analyst, p. 32, italics added.) The statement clearly implies that section 190.2(b) governs the liability of the aider and abetter and provides that the aider and abetter is death-eligible if he is proved to have acted with intent to kill.\n\nSecond, our reading of the statutory provisions is reflected in the ballot arguments. The opponents of the initiative claimed that \"a man or woman could be sentenced to die for lending another person a screwdriver to use in a burglary, if the other person accidentally killed someone during the burglary. Even if the man or woman was not present during the burglary, had no intention that anyone be killed or hurt, in fact urged the burglar not to take a weapon along, they could still be sentenced to die.\" (Voter Pamp., Argument Against Prop. 7, p. 35.) In rebuttal, the proponents stated: \"Alright [ sic ], Let's Talk About False Advertising. [ para. ] The opposition maintains if someone were to lend a screwdriver to his neighbor and the neighbor used it to commit a murder, the poor lender could get the death penalty, even though 'he had No Intention that anyone be killed.' [ para. ] Please turn back and read Section 6b [now section 190.2(b)] . . . . It says that the person must have Intentionally aided in the commission of a murder to be subject to the death penalty under this initiative.\" (Id., Rebuttal to Argument Against Prop. 7, p. 35.)\n\nThe premise of our decision in Carlos was our determination that section 190.2(a)(17) is ambiguous. As shown above, on further reflection we now believe that premise was mistaken: given a fair reading, section 190.2(a)(17) provides that intent is not an element of the felony-murder special circumstance.\n\nIn Carlos we rested our contrary view on two bases. The first was our belief that to read the provision without an intent-to-kill requirement would cause \"anomalous results\" and would be \"difficult to defend\": an actual killer who commits one of the five so-called \"[Penal Code] section 189 felonies\" listed in the provision -- arson, rape, robbery, burglary, and child\n\nmolesting -- would be subject to the death penalty whether or not he intended to kill; by contrast, an actual killer who commits one of the four so-called \"nonsection 189 felonies\" -- kidnapping, sodomy, oral copulation, and trainwrecking -- would generally be subject to the death penalty only if he intended to kill. (35 Cal. 3d at pp. 140-141.)\n\nOn reconsideration, we now find this concern misplaced. The \"anomalous results,\" if such they be, appear to flow from the Legislature's selection of felonies for inclusion in section 189 rather than from the lack of an intent-to-kill requirement in section 190.2(a)(17). Moreover, the consequences of this statutory scheme seem not so \"difficult to defend\": those who framed and voted for the 1978 initiative could have considered \"nonsection 189 felonies\" marginally less serious for the purposes of the death penalty law. For example, they may have believed kidnapping less inherently dangerous than arson, rape, robbery, burglary, and child molesting. They may have judged that sodomy and forcible oral copulation occur less frequently than rape and therefore stand less in need of deterrence. And the same reasoning would be especially apt in the case of trainwrecking, an anachronism that is rare in comparison with any of the section 189 felonies.\n\nFinally, the \"anomalous results\" that we sought to prevent by the introduction of a general intent-to-kill requirement -- viz., the lower threshold of death-eligibility for \"section 189 felons\" -- are in fact not prevented. Even if intent were required, \"section 189 felons\" would become death-eligible on proof of intent alone. \"Nonsection 189 felons,\" by contrast, would generally become death-eligible only if premeditation and deliberation as well as intent were proved. (See Pen. Code, §§ 189, 190.2, subd. (a).)\n\nThe second basis of our analysis in Carlos was our belief that unless section 190.2(a)(17) were read to require intent to kill, the meaning and function of section 190.2(b) would be hard to determine: \"In the first place, paragraph 17, alone of the listed paragraphs, already contains language equating the liability of principal and accomplice. In addition, the requirement that the accomplice 'intentionally' aid in the commission of a murder is inherently ambiguous when applied to a felony murder, for it could mean either that the accomplice must intentionally aid in a killing, or that he need only intentionally aid the commission of the underlying felony.\" (35 Cal. 3d at p. 142.)\n\nOn reexamination we now find this basis, too, to be lacking. First, section 190.2(a)(17) does not treat the liability of the murderer and his aider and abetter, but rather the liability of the perpetrator of the underlying felony and his aider and abetter. Thus, the statutory provision does nothing more than declare that both the perpetrator of the underlying felony and his aider\n\nand abetter are felony murderers. Section 190.2(b) then declares that the felony-murder aider and abetter is eligible for the death penalty if intent to kill is proved. Second, given a realistic reading the statutory requirement that the aider and abetter intentionally aid, abet, counsel, command, induce, solicit, request, or assist any acts in the commission of first degree murder -- even when applied to felony murder -- is not ambiguous: the aider and abetter must intentionally aid in a killing.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThus, in Carlos we mistook the first and crucial step in our analysis by determining that section 190.2(a)(17) is ambiguous: given a fair reading in conjunction with section 190.2(b), the provision can realistically be read only to require intent to kill for the aider and abetter but not for the actual killer.\n\nBut even if the provision were ambiguous, we now believe that an application of the rules of construction we used in Carlos would not change our reading. First, even if \"the defendant is entitled to the benefit of every reasonable doubt . . . as to the true interpretation of words or the construction of language used in a statute\" (Ex parte Rosenheim (1890) 83 Cal. 388, 391 [23 P. 372]), it must be emphasized that the canon entitles the defendant only to the benefit of every realistic doubt. This rule of\n\nconstruction \"'is not an inexorable command to override common sense and evident statutory purpose. It does not require magnified emphasis upon a single ambiguous word in order to give it a meaning contradictory to the fair import of the whole remaining language.'\" (People v. Hallner (1954) 43 Cal. 2d 715, 721 [277 P.2d 393], quoting United States v. Brown (1948) 333 U.S. 18, 25-26 [92 L.Ed. 442, 448, 68 S.Ct. 376].) Or in the words of Justice Black, writing for the court in United States v. Raynor (1938) 302 U.S. 540, 552 [82 L.Ed. 413, 420, 58 S.Ct. 353], the rule does not \"require[] that a penal statute be strained and distorted in order to exclude conduct clearly intended to be within its scope -- nor does any rule require that the act be given the 'narrowest meaning.' It is sufficient if the words are given their fair meaning in accord with the evident intent of [the legislative body].\"\n\nHere -- even when we factor into our analysis our traditional disfavor of the felony-murder rule -- we no longer have any realistic doubt as to the meaning of section 190.2(a)(17): the fair import of the provision is that intent is not an element of the felony-murder special circumstance.\n\nSecond, while it is true that \"when the constitutionality of a statute is assailed, if the statute be reasonably susceptible of two interpretations, . . . by one of which grave and doubtful constitutional questions arise and by the other of which such questions are avoided, our duty is to adopt the latter\" (United States v. Delaware \u0026 Hudson Co. (1909) 213 U.S. 366, 407-408 [53 L.Ed. 836, 849, 29 S.Ct. 527]; accord, People v. Davis (1981) 29 Cal. 3d 814, 829 [176 Cal. Rptr. 521, 633 P.2d 186]), the statute must be realistically susceptible of two interpretations and the interpretation to be rejected must raise grave and doubtful constitutional questions. Here, as we shall explain, neither of these factors counsels in favor of our former reading of section 190.2(a)(17) or against our present reading.\n\nTo begin with, as shown above, section 190.2(a)(17) is not realistically susceptible of two interpretations. Moreover, we no longer believe, as we did at the time of Carlos, that our reading of the statutory provision raises grave and doubtful constitutional questions.\n\nFirst, Bullock and Tison have compelled us to dismiss, as a matter of federal constitutional law, the concerns that our understanding of the reasoning of Enmund had engendered. Second, we are no longer of the opinion that the reading of section 190.2(a)(17) that we adopt today raises grave and doubtful constitutional questions under the Eighth Amendment and the equal protection clause by creating \"a statutory classification which [imposes] a minimum penalty of death or imprisonment without parole upon persons who did not intend to kill, while permitting some deliberate killers\n\nto escape with a sentence of life with possibility of parole . . . .\" (35 Cal. 3d at p. 148.)\n\nWhether or not we approve of the wisdom of the statutory classification, it appears to be generally accepted that by making the felony murderer but not the simple murderer death-eligible, a death penalty law furnishes the \"meaningful basis [required by the Eighth Amendment] for distinguishing the few cases in which [the death penalty] is imposed from the many cases in which it is not.\" (Furman v. Georgia (1972) 408 U.S. 238, 313 [33 L.Ed.2d 346, 392, 92 S.Ct. 2726] (conc. opn. of White, J.); accord, Godfrey v. Georgia (1980) 446 U.S. 420, 427 [64 L.Ed.2d 398, 405-406, 100 S.Ct. 1759] (plur. opn.).)\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e It also appears to be generally accepted that a death penalty law that makes the felony murderer but not the simple murderer death-eligible does not violate the equal protection clause. (See Gray v. Lucas, supra, 677 F.2d at p. 1104.)\n\nDespite all the foregoing points, defendant urges that we adhere to the statutory interpretation we adopted in Carlos out of respect for the doctrine of stare decisis. But \"Although the doctrine does indeed serve important values, it nevertheless should not shield court-created error from correction.\" (Cianci v. Superior Court (1985) 40 Cal. 3d 903, 924 [221 Cal. Rptr. 575, 710 P.2d 375].) This is especially so when, as here, the error is related to a \"matter of continuing concern\" to the community at large. (United States v. Reliable Transfer Co. (1975) 421 U.S. 397, 409, fn. 15 [44 L.Ed.2d 251, 261, 95 S.Ct. 1708].) After careful reflection, we have concluded that the doctrine should not bar us from reconsidering the Carlos decision.\n\nFor the reasons stated, therefore, we overrule Carlos and hold as follows: intent to kill is not an element of the felony-murder special circumstance; but when the defendant is an aider and abetter rather than the actual killer, intent must be proved.\n\nWe turn now to the case at bar. The court must instruct on intent to kill as an element of the felony-murder special circumstance when there is evidence from which the jury could find (see People v. Flannel (1985) 25 Cal. 3d 668, 684-685 [160 Cal. Rptr. 84, 603 P.2d 1]) that the defendant was an aider and abetter rather than the actual killer. Here, all the evidence showed that defendant either actually killed the victims or was not involved\n\nin the crimes at all; there was no evidence that he was an accomplice. Accordingly, the court did not err in failing to instruct on intent.\n\nB. Multiple-murder Special Circumstances\n\n1. Defects in Pleading and in Proof at the Preliminary Hearing\n\nDefendant contends in substance that the multiple-murder special-circumstance findings should be vacated on the ground that the prosecution could not effectively allege these special circumstances in the information or establish them by probable cause at the preliminary hearing. Penal Code section 190.2, subdivision (a)(3) (hereafter section 190.2(a)(3)) states the relevant special circumstance as, \"The defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" Specifically, defendant argues that it was logically impossible to allege or establish that he \"has in this proceeding been convicted\" of multiple murder before trial in this proceeding had commenced, and hence that the allegations should have been stricken. For the reasons that follow, we reject the contention.\n\nAt the threshold, we doubt that defendant's claim is preserved for appeal. As he frankly acknowledges, he did not move in the superior court to set aside the information on this ground pursuant to Penal Code section 995. Of course, his failure to do so would ordinarily constitute a waiver of any defects in the commitment and accordingly bar him from complaining about any alleged irregularity at the preliminary hearing. (Pen. Code, § 996.)\n\nBut even if defendant is deemed to have preserved his claim, he gains nothing: as will appear, we must reject the point on the merits. In interpreting section 190.2(a)(3) we are guided by well-settled principles. \"In construing constitutional and statutory provisions, whether enacted by the Legislature or by initiative, the intent of the enacting body is the paramount consideration. [Citations.] '[We] are mindful that the goal of statutory construction is ascertainment of legislative intent so that the purpose of the law may be effectuated.'\" (In re Lance W. (1985) 37 Cal. 3d 873, 889 [210 Cal. Rptr. 631, 694 P.2d 744].)\n\nWe believe that section 190.2(a)(3) must be read to define the relevant special circumstance as, in substance, multiple murder when all the offenses in question are tried in the same proceeding. Penal Code section 190.2, subdivision (a)(2) (hereafter section 190.2(a)(2)) states as a special circumstance, \"The defendant was previously convicted of murder in the first or second degree.\" Section 190.2(a)(3), as quoted above, states, \"The\n\ndefendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" Read together, these two provisions are plainly complementary, and were evidently intended to define a single basic special circumstance -- multiple murder -- which can be satisfied by convictions in a single proceeding or in more than one proceeding.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWe turn to the case at bar. Charging two counts of murder, the information alleged as to each that \"in addition to [the victim named in that count], defendants murdered [the other victim] on or about the same date, within the meaning of Penal Code section 190.2.\" It is plain that these allegations conform with section 190.2(a)(3) as we have read that provision. It is also plain that the prosecution could allege such special circumstances in the information and establish them by probable cause at the preliminary hearing. Hence, even if the allegations had been timely challenged on the ground on which defendant now rests, they could not properly have been stricken.\n\n2. Failure to Instruct on Intent to Kill\n\nDefendant contends that the court failed to instruct in accord with People v. Turner, supra, 37 Cal. 3d 302, that intent to kill was an element of the multiple-murder special circumstances.\n\nOur analysis of the felony-murder special circumstance (Pt. III A, ante) is equally applicable here. First, the language of sections 190.2(a)(3) and 190.2(b) strongly supports the reading that intent to kill is not required unless the defendant is an aider and abetter rather than the actual killer. Second, a comparison of the multiple-murder special circumstance under the 1977 law -- which contained an express intent-to-kill requirement (former Pen. Code, § 190.2, subd. (c)(5), Stats. 1977, ch. 316, § 9, pp. 1257-1258) -- and the multiple-murder special circumstance under the present law -- which contains no such requirement -- compels that reading.\n\nIn construing section 190.2(a)(3) to the contrary in Turner, we relied on our decision in Carlos. But we have now rejected the reasoning of Carlos. With its support gone, Turner must also fall.\n\nAccordingly, we overrule Turner to the extent it holds that intent to kill is an element of the multiple-murder special circumstance, and adopt the following reading of the relevant statutory provisions: intent to kill is not an\n\nelement of the multiple-murder special circumstance; but when the defendant is an aider and abetter rather than the actual killer, intent must be proved.\n\nWe turn again to the facts of this case. As stated above, there was no evidence that defendant was an aider and abetter. Accordingly, the court did not err in failing to instruct on intent.\n\n3. \" Multiple\" Multiple-murder Special-circumstance Allegations\n\nDefendant correctly contends it was error for the prosecution to allege two multiple-murder special circumstances instead of one. The plain words of section 190.2(a)(3) -- \"The defendant has in this proceeding been convicted of more than one offense of murder\" -- suggest that no matter how many murder charges are tried together, they constitute a single multiple-murder special circumstance. That reading is supported by certain constitutional considerations: \"A plurality held in People v. Harris (1984) 36 Cal. 3d 36 [201 Cal. Rptr. 782, 679 P.2d 433], 'alleging two special circumstances for a double murder improperly inflates the risk that the jury will arbitrarily impose the death penalty, a result also inconsistent with the constitutional requirement that the capital sentencing procedure guide and focus the jury's objective consideration of the particularized circumstances of the offense and the individual offender. (Jurek v. Texas (1976) 428 U.S. [262] at pp. 273-274 [49 L.Ed.2d 929, 96 S.Ct. 2950].)' (36 Cal. 3d at p. 67.) Pursuant to our reasoning in Harris, appropriate charging papers should allege one multiple-murder special circumstance separate from the individual murder counts.\" (People v. Allen (1986) 42 Cal. 3d 1222, 1273 [232 Cal. Rptr. 849, 729 P.2d 115].) It follows that one of the multiple-murder special-circumstance findings must be vacated.\n\nIV. Penalty Issues\n\nDefendant persuasively contends that the court committed reversible error under People v. Ramos, supra, 37 Cal. 3d 136. In accordance with the so-called Briggs Instruction, the court delivered the following charge: \"You are instructed that under the State Constitution, a governor is empowered to grant a commutation or modification after sentence following conviction of a crime. Under this power a governor may in the future commute or modify a sentence of life imprisonment without possibility of parole to a sentence that would include the possibility of parole.\"\n\nIn People v. Ramos, supra, 37 Cal. 3d at page 153, we held that \"the Briggs Instruction is incompatible with [the] guarantee of 'fundamental fairness' [established in the due process clauses of our Constitution (Cal.\n\nConst., art. I, §§ 7, 15)] both because it is seriously and prejudicially misleading and because it invites the jury to be influenced by speculative and improper considerations.\" Consequently, as we held in People v. Montiel (1985) 39 Cal. 3d 910, 928 [218 Cal. Rptr. 572, 705 P.2d 1248], when a court charges the jury in accordance with this instruction, it commits serious error and necessarily subjects the defendant to prejudice. (See generally, People v. Ramos, supra, 37 Cal. 3d at pp. 153-159.)\n\nUnder Ramos, therefore, we conclude that the court committed reversible error by charging the jury in accordance with the Briggs Instruction. The judgment of death must therefore be reversed.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe judgment is affirmed as to guilt; with the exception of one of the multiple-murder special-circumstance findings, the special-circumstance findings are upheld; and the judgment is reversed as to penalty.\n\nDisposition\n\nThe judgment is affirmed as to guilt; with the exception of one of the multiple-murder special-circumstance findings, the special circumstance findings are upheld; and the judgment is reversed as to penalty.\n\nLUCAS, C. J. I concur in the judgment, and in all aspects of the majority opinion with one exception. I am less certain than the majority that admission of codefendant Sheila Anders's statements to psychiatrists constituted Bruton/Aranda error. (See Bruton v. United States (1968) 391 U.S. 123 [20 L.Ed.2d 476, 88 S.Ct. 1620]; People v. Aranda (1965) 63 Cal. 2d 518 [47 Cal. Rptr. 353, 407 P.2d 265].) Although these statements implicated defendant, they were elicited on cross-examination of these psychiatrists for the limited purpose of impeaching their opinions supporting Sheila's diminished capacity defense, and the jury was so advised. Under these circumstances, I doubt that any denial of defendant's right of confrontation occurred here.\n\nIn any event, in light of the majority's conclusion that any error in admitting the statements was harmless, I simply state my reservations to the finding of error without prolonged discussion.\n\nBROUSSARD, J. Today the majority of this court overrule Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862] and People v. Turner (1984) 37 Cal. 3d 302 [208 Cal. Rptr. 196, 690 P.2d 669],\n\nand hold that under California law a person can be executed for an unintentional killing. I am compelled to dissent from that portion of the majority's opinion.\n\nIn Carlos this court, by a six-to-one majority, held that the special circumstance of felony murder under the 1978 death penalty initiative applies only when the defendant actually intended to kill.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Thirteen subsequent decisions of this court have confirmed the Carlos interpretation of the 1978 law.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Now the majority overrule this line of precedent and declare that in California a person can be executed for an accidental or negligent killing.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e They say that this is the clear meaning of the 1978 death penalty initiative, even though they can arrive at this meaning only by interpreting part of the 1978 law to mean the opposite of what it says. The Carlos opinion, however, demonstrates that neither the inconsistent and murky language of the initiative, the circumstances of its enactment, nor the accepted principles of statutory construction require us to conclude that the initiative permits execution of an unintentional killer. There is no good reason for this court to depart from the reasonable construction of the initiative established in Carlos and approved in numerous subsequent decisions.\n\nPeriodically, when the political winds gust in a new direction, it becomes necessary to remind all concerned of the virtues of a steady course. As lawyers and judges, we sometimes deliver our reminder in Latin: stare\n\ndecisis. The reminder is particularly pertinent today, for the Attorney General has asked this court to reconsider not only Carlos v. Superior Court, supra, 35 Cal. 3d 131, and People v. Turner, supra, 37 Cal. 3d 302, but also virtually every other decision construing the 1977 or 1978 death penalty laws. As appellate counsel remarked in one case, to argue or decide an appeal under such circumstances is like standing on quicksand; if all premises are open to question, one can never reason to a conclusion. Justice Cardozo observed that \"the labors of judges would be increased almost to the breaking point if every past decision could be reopened in every case, and one could not lay one's own course of bricks on the secure foundation of the courses laid by others who have gone before him.\" (Cardozo, The Nature of the Judicial Process (1921) p. 149.)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nFrom the vast array of commentary on the importance of following precedent, I have selected as most pertinent to the present setting the words of Justice Ryan of the Illinois Supreme Court. In 1979 that court, in a four-to-three decision, upheld the constitutionality of the Illinois death penalty statute. (People ex rel. Carey v. Cousins (1979) 77 Ill.2d 531 [397 N.E.2d 809], cert. den. (1980) 445 U.S. 953 [63 L.Ed.2d 788, 100 S.Ct. 1603]). Two years later, a member of the majority was replaced by a new justice who believed the statute was unconstitutional. There was now a four-to-three majority for unconstitutionality, on what was certainly a question of continuing public importance. The court, however, again upheld the statute, this time by a six-to-one vote. (People v. Lewis (1981) 88 Ill.2d 129 [430 N.E.2d. 1346].) Justice Ryan, who dissented in the earlier case, wrote: \"This court, not seven individual justices, has considered the constitutionality of our death penalty statute and this court found it to be constitutional. Those of us who disagree with that conclusion voiced our dissent. Having done so, it is now our obligation to accept the law as pronounced by this court. This is not to say that the holdings of this court are cast in stone and forever unchangeable. However, nothing has changed since this court's decision in Cousins except one member of the Court that decided Cousins has retired. As Mr. Justice Clark stated in his concurrence, the circumstances which warrant changes in the law do not include changes in personnel of the court. If the law were to change with each change in the makeup of the court, then the concept that ours is a government of law and not of men would be nothing more than a pious cliche.\" (P. 1364, conc. opn. of Ryan, J.)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nA. The alleged reason for reconsidering Carlos.\n\nThe majority open their discussion by explaining their reasons for reconsidering Carlos -- a curious explanation, because it appears to concede that Carlos was correctly decided.\n\nThe majority note that Carlos was based in part on the United States Supreme Court decision in Enmund v. Florida (1982) 458 U.S. 782 [73 L.Ed.2d 1140, 102 S.Ct. 3368]. Carlos noted that Enmund was susceptible of alternative interpretations: a narrow one which would require proof of intent to kill before an accomplice could be executed, and a broader one which would require such proof for the actual killer as well. Since Enmund himself was an accomplice, the decision did not decide the intent requirement for the actual killer. As Justice Brennan, speaking for four of the five members of the Enmund majority, remarked in Tison v. Arizona (1987) 481 U.S. , [95 L.Ed.2d 127, 152, 107 S.Ct. 1676], the constitutionality of the death penalty for the unintentional killer was a question \"reserved\" by Enmund -- an unsettled question which might be decided either way in a later case.\n\nCarlos accordingly turned to the principle that \"where a statute is susceptible of two constructions, by one of which grave and doubtful constitutional questions arise and by the other of which such questions are avoided, our duty is to adopt the latter.\" (United States v. Delaware \u0026 Hudson Co. (1909) 213 U.S. 366, 407-408 [53 L.Ed. 836, 849, 29 S.Ct. 527], quoted in Carlos, 35 Cal. 3d at p. 148.) Applying this principle, it became our duty to construe the 1978 death penalty law to impose an intent to kill requirement for the actual killer.\n\nThe majority, as I read their opinion, dispute none of this. They agree that Carlos's interpretation of Enmund was a reasonable one; indeed they cite commentary, unavailable when Carlos was decided, which supports our view. Neither do they dispute the proposition that courts have a duty to interpret statutes to avoid serious constitutional questions, nor that such duty required us to interpret the 1978 law to include an intent to kill requirement for actual killers. In short, the majority appear to agree that Carlos was correctly reasoned on this fundamental point, and in view of the importance of the point, that is equivalent to conceding that Carlos was correctly decided.\n\nIn short, the majority do not say that Carlos was wrong but that it is outdated. They assert that two subsequent Supreme Court decisions (Cabana v. Bullock (1986) 474 U.S. 376 [88 L.Ed.2d 704, 106 S.Ct. 689] and Tison v. Arizona, supra, 481 U.S. [95 L.Ed.2d 127, 107 S.Ct. 1676], both five-to-four decisions, read Enmund more narrowly then we did.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The language the majority quote from those decisions, however, offers little support for their assertion; it consists only of insignificant dictum from Cabana v. Bullock\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and a mistaken footnote in Tison v. Arizona.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn any case, the majority's assertions fail on several grounds. In the first place, Carlos was not based solely on the fear that Enmund v. Florida, supra, 458 U.S. 782, might invalidate the 1978 law. Our decision also considered the text of the statute, the ballot arguments, and the rule that a defendant is entitled to the benefit of any reasonable doubt concerning the interpretation of a penal law. None of these considerations are affected by the cited United States Supreme Court decisions.\n\nFurthermore, the majority's assertion that Cabana v. Bullock, supra, 474 U.S. 376 and Tison v. Arizona, supra, 481 U.S. [95 L.Ed.2d 127, 107 S.Ct. 1676] undermine the reasoning of Carlos clearly rests on a misunderstanding. Carlos did not say that one interpretation of Enmund was right and another wrong. We said that Enmund could reasonably be interpreted to require proof of intent for the actual killer. The fact that a bare majority of the court in Tison adopted a narrower view in no way refutes that assertion. And in a still later case, Booth v. Maryland (1987) 482 U.S. [96 L.Ed.2d 440, 107 S.Ct. 2529], another five-to-four majority appeared to reject much of the reasoning of Tison.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFinally, the majority's confidence that the constitutional issues raised by Enmund have been conclusively settled may be unwarranted. The pattern of five-to-four decisions demonstrates that four of the eight justices currently sitting believe that the death penalty can be justified, if at all, only by considerations of deterrence and culpability, and that both deterrence and culpability turn on the intent of the defendant. Such a theory forecasts the unconstitutionality of executing any person, including an actual killer, who did not intend to kill. A constitutional theory which would receive a favorable hearing from one half of the United States Supreme Court\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e is a matter of serious concern. It was and remains our duty to construe the 1978 death penalty initiative to avoid the risk that it will be declared unconstitutional under that theory.\n\nIn short, Carlos was correctly decided in 1983, and its reasoning, unimpaired by future cases, should govern today. It is disingenous to claim that a passing remark in Cabana v. Bullock and a mistaken footnote in Tison v. Arizona justify reconsideration of that decision.\n\nB. The meaning of the statutory language.\n\nThe majority assert that the 1978 death penalty law is \"realistically\" susceptible of only one meaning: that intent to kill is required for accomplices to a felony murder, but not for the actual killer. Anyone familiar with principles of statutory construction will recognize that something is wrong with this assertion -- the word \"realistically\" does not belong. It has long been established (see Ex parte Rosenheim (1890) 83 Cal. 388, 391 [23 P. 372]) that if a penal statute is reasonably susceptible of more than one interpretation, the courts should give it that interpretation which favors the\n\ndefendant. (See, e.g., People v. Garfield (1985) 40 Cal. 3d 192, 200 [219 Cal. Rptr. 196, 707 P.2d 258]; People v. Davis (1981) 29 Cal. 3d 814, 828 [176 Cal. Rptr. 521, 633 P.2d 186]; People v. King (1978) 22 Cal. 3d 12, 23 [148 Cal. Rptr. 409, 582 P.2d 1000]; Bowland v. Municipal Court (1976) 18 Cal. 3d 479, 488 [134 Cal. Rptr. 630, 556 P.2d 1081].) This rule derives from the fundamental precept that a \"defendant is entitled to the benefit of every reasonable doubt, whether it arise out of a question of fact, or as to the true interpretation of words or the construction of language used in a statute.\" (In re Tartar (1959) 52 Cal. 2d 250, 257 [339 P.2d 553]; People v. Davis, supra, 29 Cal. 3d 814, 828; People v. Craft (1986) 41 Cal. 3d 554, 560 [224 Cal. Rptr. 626, 715 P.2d 585].) But all of these cases refer to \"reasonable\" interpretation and \"reasonable\" doubt. The majority inexplicably substitute the word \"realistic\" for \"reasonable\" and, as if to stress that the change is deliberate, italicize the words.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e But they do not tell us how a \"realistic\" interpretation differs from a \"reasonable\" one, or a \"realistic\" doubt from a \"reasonable\" doubt. Pending an explanation, I will assume the majority intend no change in the rules of statutory construction, and will speak of \"reasonable\" doubt and \"reasonable\" interpretations of a statute.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nI turn then to the question whether Penal Code section 190.2 is reasonably susceptible of only a single interpretation, one which requires intent to kill for accomplices to felony murder but not for killers.\n\nSection 190.2, subdivision (a)(17) (hereinafter paragraph (17)) is the felony-murder special circumstance.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e It provides for a special circumstance if \"the murder was committed while the defendant was engaged in or was an accomplice in the commission of, attempted commission of, or the immediate flight after committing or attempting to commit\" nine listed felonies -- robbery, kidnapping, rape, sodomy, lewd and lascivious conduct, oral copulation, burglary, arson, and train wrecking. It is silent as to intent to kill. As\n\nwe acknowledged in Carlos, one could infer from this silence the absence of an intent requirement.\n\nAs Carlos pointed out, however, a construction of paragraph (17) without an intent requirement would have anomalous results. Because section 189, the felony-murder provision, lists five of the felonies listed in paragraph (17) -- robbery, rape, lewd conduct, burglary, and arson -- a defendant convicted of one of those offenses could be executed without proof of intent to kill. One convicted of one of the other felonies listed in paragraph (17) -- kidnapping, forcible sodomy, forcible oral copulation, or train wrecking -- could not be convicted of first degree murder, and thus could not be executed, without proof of intent. Rather than blaming this anomaly on careless draftmanship, the majority unwisely attempt to defend it. They suggest that the voters may have believed kidnapping less inherently dangerous than arson, rape, robbery, burglary, or child molesting. Paragraph (17) expressly includes kidnapping in violation of section 209 -- that is, kidnapping for ransom or robbery -- and it seems quite unlikely that the voters thought this crime less dangerous than burglary. The majority also suggest that forcible sodomy and oral copulation occur less frequently than rape and therefore stand less in need of deterrence. Are these crimes less frequent? Is there any reason to think the drafters thought they were? That the voters thought they were? Frequency is in any case irrelevant, since the objective, I assume, is to impose the death penalty for the most atrocious murders, not the most common murders. Isn't it more reasonable to assume that the voters believed that all felonies listed in paragraph (17) would be treated alike?\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn any event, the majority agree with Carlos that section 190.2 requires proof of intent to kill for accomplices such as Carlos; they maintain only that it does not extend this requirement to the actual killer. They cannot derive this distinction from paragraph (17), which expressly applies to both actual killers and accomplices and says nothing about intent for either. Instead, for that, the majority turn to section 190.2, subdivision (b), which states that \"[every] person whether or not the actual killer found guilty of intentionally aiding, abetting, counseling, commanding, inducing, soliciting, requesting, or assisting any actor in the commission of murder in the first degree shall suffer death or confinement in state prison for a term of life without the possibility of parole. . . .\" The majority acknowledge that \"in the abstract the introductory phrase of section 190.2 [, subdivision] (b) --\n\n'[every] person whether or not the actual killer' -- encompasses both the actual killer and his [accomplice].\" (Maj. opn. at p. 1142.) I would go further, and maintain that such is the single plain meaning of those words. In an attempt to avoid the plain meaning of those words, the majority note that the statute goes on to speak of persons found guilty of \"aiding, abetting, counseling, commanding, inducing, soliciting, requesting assisting\" in the commission of a murder. They do not, however, adhere to the straightforward, literal meaning of the subdivision, and apply it to require intent to kill for every person, including actual killers, who also assist other murderers. That would be an unreasonable interpretation, for there is no conceivable reason to require proof of intent to kill for the actual killer who acts with a confederate, but not for one who acts alone.\n\nThe majority, however, assert that the only reasonable meaning of subdivision (b) is one which imports an intent requirement for accomplices but not the actual killer. They do not go through the language of the section, word by word and phrase by phrase, to show how such is the clear and necessary import of the words and phrases employed. If they did, it would become apparent that the only way to arrive at the majority's interpretation is to turn the subdivision's opening phrase upside down. \"Every person whether or not the actual killer\" must be transformed into \"Every person except the actual killer.\" I recognize that when a court deals with a statute as poorly drafted as this one, it will often be necessary to depart from the literal language of the statute; it may even be necessary to construe some phrase to mean the opposite of its apparent meaning. But if the court concludes that it must construe a phrase to mean the opposite of what it apparently means, it cannot justify this by the single plain-meaning rule.\n\nIndeed, the basic problem with the majority opinion is that it simply adopts one reasonable interpretation of subdivision (b), justifying that interpretation by arguments which would be unnecessary and inappropriate if the language had a single clear meaning. It invokes, for example, a comparison of the language of the 1978 and 1977 law, the presumption that the deletion of former language is intended to change the law, and the ordinary judicial construction of words describing accomplices. It ignores, however, similar canons of construction, such as the one which requires the court to give meaning and effect to all words and phrases. (See, e.g., Clements v. T. R. Bechtel Co. (1954) 43 Cal. 2d 227, 233 [273 P.2d 5]; Select Base Materials v. Board of Equal. (1959) 51 Cal. 2d 640, 645 [335 P.2d 672]; Mahdavi v. Fair Employment Practice Com. (1977) 67 Cal. App. 3d 326, 334 [136 Cal. Rptr. 421].) Having in this manner arrived at one reasonable interpretation of subdivision (b), the majority then announce that this is the plain meaning of the statute and the only reasonable construction.\n\nI think it is clear that subdivision (b) has no single clear meaning on its face. The majority have advanced one reasonable interpretation of that subdivision. But theirs is not the only reasonable interpretation. As five justices of this court, including the author of the present majority opinion, recognized in 1983, one can also reasonably argue that a subdivision which purports to apply to \"every person whether or not the actual killer\" does in fact apply to every person whether or not the actual killer.\n\nThus the issue in this case, as Carlos, supra 35 Cal. 3d 131, is one of choosing between alternative reasonable interpretations. One interpretation, however, is now fortified by precedent. The interpretation of subdivision (b) to require proof of intent to kill for \"all persons\" including the actual killer, has been reaffirmed many times by this court (see cases cited, fn. 2, ante). Nothing has changed which warrants yet another reconsideration of that matter.\n\nC. The ballot presentation and arguments.\n\nThe majority refer to the 1978 ballot to support their position. They first quote the presentation by the Legislative Analyst. He said that \"this proposition would specifically make persons involved in the crime other than the actual murderer subject to the death penalty or life imprisonment without possibility of parole under specified circumstances.\" The majority consider this an evident reference to subdivision (b); I think it refers to the proposition as a whole. In any event, the analyst's statement is unquestionably true; both Carlos, supra, 35 Cal. 3d 131, and the majority today interpret the statute so that an accomplice is subject to the death penalty under some circumstances. But the analyst did not tell the voters what the circumstances were, nor whether a particular circumstance -- intent to kill -- applied to the actual killer.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe majority then refer to the ballot arguments. The opponents of the initiative charged that it would impose the death penalty upon the accomplice of an unintentional killer. The proponents responded: \"The opposition maintains if someone were to lend a screwdriver to his neighbor and the neighbor used it to commit a murder, the poor lender could get the death penalty, even though 'he had No Intention that anyone be killed.' [ para. ]\n\nPlease turn back and read Section 6b [now § 190.2, subd. (b)]. . . . It says that the person must have Intentionally aided in the commission of a murder to be subject to the death penalty under this initiative.\" After reading this argument, the voters who supported the initiative could be confident that the lender of the screwdriver could not get the death penalty. But what about the \"neighbor\" who \"accidentally killed someone\" during the burglary? The argument leaves his fate obscure. If the drafters of the 1978 law believed that it, unlike the 1977 law, would leave the accidental killer subject to the death penalty, here was their opportunity to explain that change to the voters. But no explanation was offered.\n\nAs we said in Carlos, \"[the] adoption of a law to permit infliction of the death penalty upon an accidental killer would be a momentous step, raising grave moral questions.\" (35 Cal. 3d at p. 145.)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e It certainly would be a very significant departure from the 1977 law, perhaps the most significant change effected by the initiative. One could reasonably expect a change of this magnitude would be made clear in both legal text and ballot argument. The absence of any such language suggests that the drafters did not intend to permit execution of an unintentional killer. More importantly, it compels a conclusion that the voters in approving the initiative were unaware that it could be construed to permit such an execution.\n\nD. Canons of intepretation of penal statutes.\n\nAs we observed earlier, \"[when] language which is reasonably susceptible of two constructions is used in a penal law ordinarily that construction which is more favorable to the offender will be adopted. [ para. ] The defendant is entitled to the benefit of every reasonable doubt, whether it arises out of a question of fact, or as to the true interpretation of words or the construction of language used in a statute.\" (People v. Davis, supra, 29 Cal. 3d 814, 828.)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe majority reject the application of this principle with the claim that Carlos's construction of the 1978 law is unreasonable. Of course, there is no reason to discuss any extrinsic aid -- the language of the prior statute, the ballot arguments, constitutional considerations, etc. -- unless one is choosing between reasonable alternatives. With respect to all other extrinsic aids, however, the majority argue that such aids fail to support the choice we made in Carlos, and may even support the majority's construction. When it comes to considering the rule interpreting penal statutes in favor of the defendant, however, the majority simply argue that such an interpretation is unreasonable. I accept this as a tacit acknowledgment that if the majority's interpretation and the Carlos interpretation were reasonable alternatives, this canon of construction would support the Carlos view.\n\nE. Interpretation to avoid doubtful constitutionality.\n\nThe majority recognize the rule that a statute should be construed to avoid grave and doubtful constitutional questions, and that when Carlos was decided a construction of the 1978 law which would permit the execution of an unintentional killer might violate the Eighth Amendment as construed in Enmund v. Florida, supra, 458 U.S. 782. (Maj. opn., ante, at pp. 1139-1140, 1146-1147.) The majority assume that such questions raised by Enmund have been fully and finally resolved. As we explained earlier, this assumption is itself dubious. (Ante, p. 1154.)\n\nCarlos also noted two other constitutional problems which have not been addressed by the United States Supreme Court. First, the court in Godfrey v. Georgia (1980) 446 U.S. 420, 427 [64 L.Ed.2d 398, 405-406, 100 S.Ct. 1759], required that a state death penalty law provide a \"meaningful basis for distinguishing the few cases in which [the penalty] is imposed from the many cases in which it is not.\" We questioned whether a law which included some who killed accidentally, while excluding the nonfelony but premeditated murder, would meet this standard.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nWe also noted that the statute classifies otherwise similarly situated persons -- convicted murderers -- and provides that a person who committed a willful and premeditated murder is not subject to the death penalty unless a special circumstance is present. An interpretation of section 190.2 that\n\nallows the death penalty for unintentional felony murderers, may violate the equal protection clause.\n\nUnder accepted constitutional theory, a classification which directly abridges a fundamental constitutional right is tested by the stringent \"compelling interest test.\" I can think of no more fundamental right than life itself, nor a more direct abridgement of that right than execution. I doubt, however, that the classification imposed by the California statute (as construed by the majority) could even meet the rational-relationship test employed by courts to test classifications which do not affect fundamental rights. The state has an interest in deterring unintended felony murders, but surely it is no greater than its interest in deterring premeditated murder, so it cannot justify a greater punishment. (Enmund, supra, 458 U.S. 782, would suggest that the state's interest in deterring unintentional felony murder is far less than its interest in deterring premeditated murder.) And while the unintentional felony murderer bears a measure of responsibility for his victim's death, and can be subject to retributive punishment accordingly, surely he bears no greater responsibility than the murderer who premeditates. In sum, even if one could find a rational basis for punishing unintentional felony murderers as severely as premeditating killers, there is no rationale that would justify punishing them more severely.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe majority's response to these arguments is to assert that \"[whether] or not we approve of the wisdom of the statutory classification, it appears to be generally accepted. . . .\" But many practices are generally accepted until they are constitutionally challenged. The majority cite only one case, Gray v. Lucas (5th Cir. 1982) 677 F.2d 1086, to support their conclusion that the classifications of the 1978 law are constitutional. If that decision is distinguishable or erroneous, then the constitutional issues raised in Carlos remain unsettled.\n\nGray concerned a challenge to a Mississippi law which imposed the death penalty on felony murderers but not ordinary murderers. The decision of the court upholding that law can be distinguished on several grounds: (1) The jury expressly found that Gray committed an intentional felony murder. The Gray court noted that imposing the death penalty upon unintentional felony murders \"might pose a difficult question of constitutional law,\" (667 F.2d at p. 1103), but found it unnecessary to reach the issue. (2) In addressing the issue whether imposition of the death penalty on intentional felony murderers violated equal protection, the court assumed that the rational-basis test applied. In California, however, precedents such as\n\nPeople v. Olivas (1976) 17 Cal. 3d 236 [131 Cal. Rptr. 55, 551 P.2d 375] (which held \"liberty\" a fundamental interest), might compel use of a more exacting standard. (3) Gray found a rational basis for the challenged classification under the hypothesis that the Mississippi Legislature may have believed felony murder and ordinary murder posed two different problems, and planned to address the felony-murder problem first. That rationale could not be applied to the California statute: the 1978 law dealt comprehensively with felony and premeditating murderers. The voters were told expressly that the initiative applied to all murderers. (4) Gray asserted that the legislature could reasonably judge that \"the death penalty would be more effective in deterring felony murders since an experienced felon is more likely to assess the consequences of his acts,\" or conversely that it \"might not effectively deter simple murders since such persons are likely as a group to act on passion or impulse and thus be unmindful of the consequences of their crime.\" (677 F.2d at p. 1104.) But whatever its rationality in distinguishing between intentional felony murderers and intentional non-felony murderers under Mississippi law, that reasoning breaks down completely when applied to the unintentional felony murderer. When a person who does not intend to kill contemplates the consequences of his acts, the possibility of the death penalty will not \"enter into the cold calculus that precedes the decision to act.\" (Enmund, supra, 458 U.S. at p. 799 [73 L.Ed.2d at p. 1153].) No one has suggested a rational basis for believing that the death penalty is a more effective deterrent of unintentional felony murder than of premeditated murders.\n\nIn Newland v. Board of Governors (1977) 19 Cal. 3d 705, 711 [139 Cal. Rptr. 620, 566 P.2d 254], we promised that when constitutional issues are raised, we would undertake \"a serious and genuine judicial inquiry into the correspondence between the classification and the legislative goals.\" When the court undertakes such an inquiry, it will find the imposition of greater punishment upon unintentional felony murderers than upon premeditated murderers presents a substantial constitutional question.\n\nF. Stare decisis.\n\nThe doctrine of stare decisis necessarily implies that the fact a current majority disagrees with a prior decision is not in itself sufficient to justify overruling it. Otherwise all prior decisions would be exposed to continuous challenge, the concept of precedent would be meaningless, and the decisions of this court will sway with the political winds. In short, it is not enough for the majority to say that Carlos, supra, 35 Cal. 3d 131, was wrongly decided; something more is needed to justify a departure from stare decisis. The majority offer nothing except to note that the matter is one of continuing concern, as if stare decisis meant only the duty to follow inconsequential\n\nprecedent. Taking the opposite road, I submit three reasons why, even assuming Carlos erred in its interpretation of the 1978 law, that decision should not be overruled.\n\nFirst, it is rare for this court to overrule a recent precedent construing a statute. The Legislature is competent to correct a statutory construction with which it disagrees, and does so regularly. The voters too have that power, and exercised it in 1973 to overturn a decision by this court finding the death penalty to be cruel or unusual punishment. The absence of legislative or initiative action suggests that there is no consensus among either the Legislature or the voters that an unintentional murderer should be executed, and argues against the court taking this step on its own.\n\nSecond, since Carlos was filed in December of 1983, intent-to-kill instructions have been given routinely in all capital cases. (Some trial judges, anticipating our decision, gave such instructions in pre- Carlos cases.) We have heard no complaint that such instructions have led to confusion, inefficiency, or brought about mistaken or unjust verdicts.\n\nIndeed, the only reason Carlos is an issue today is that this court has failed to decide a number of cases that were tried prior to December of 1983 in which an intent-to-kill instruction was not given.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Some of those cases, including the present one, will have to be retried anyway,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e but in others Carlos stood as a possible barrier to the execution of that minority of murder defendants unlucky enough to have their cases still pending before this court in January of 1987. The majority tear down that barrier, heedless of the effect of their decision upon cases not yet tried.\n\nThird, overruling Carlos now, four years after it was filed, creates arbitrary distinctions between defendants. Some of those tried before December 1983 received an intent-to-kill instruction. Of those who did not, some have had convictions reversed, and their case retried with an intent-to-kill instruction.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e None of the above are affected by the present decision. The\n\nimpact of the present decision falls on the minority of pre-1983 defendants whose appeals, for one reason or another, have not been resolved by this court four or more years after their trials. Whether a particular defendant falls within that group -- and thus perhaps whether he lives or dies -- is largely a matter of chance.\n\nFinally, I am impressed by the failure of anyone to argue that it is desirable for the state to execute unintentional murderers. To the contrary, many would think such an execution disproportionate to the culpability of the defendant. Indeed at oral argument the Attorney General said that if a case of an unintentional felony murder arose, he would expect the prosecutor or the jury to use their discretion to avoid the death penalty. However, we cannot rely on prosecutors or juries to refrain from applying the 1978 death penalty law as the majority have construed it, harsh and arbitrary as that construction may be.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Sooner or later the present decision will result in an execution unjust to the defendant and unnecessary to protect any interest of the public. We should therefore decline to reconsider Carlos, and leave it for the People or the Legislature to act if they desire to change established precedent.\n\nG. The penalty verdict.\n\nThe trial court's instruction on the Governor's commutation power -- the Briggs Instruction -- violated the California Constitution. (People v. Myers (1987) 43 Cal. 3d 250, 270-272 [233 Cal. Rptr. 264, 729 P.2d 698]; People v. Montiel (1985) 39 Cal. 3d 910, 928 [218 Cal. Rptr. 572, 705 P.2d 1248]; People v. Ramos (1984) 37 Cal. 3d 136, 153 [207 Cal. Rptr. 800, 689 P.2d 430].) Those decisions mandate that the imposition of a death sentence following a penalty trial in which the Briggs Instruction was given be reversed as a \"miscarriage of justice\" within the meaning of article VI, section 13 of that Constitution.\n\nThe Attorney General, however, asks us to overrule those decisions. The majority properly reject that plea, for principles of stare decisis require us to adhere to prior precedents establishing that the giving of the Briggs Instruction is reversible error.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Of course, those same principles should also\n\ncommand our adherence to Carlos v. Superior Court, supra, 35 Cal. 3d 131 and People v. Turner, supra, 37 Cal. 3d 302.\n\nKAUFMAN, J. Concurring and Dissenting. I concur in the reversal of the judgment of death under compulsion of People v. Ramos (1984) 37 Cal. 3d 136, 158-159 [207 Cal. Rptr. 800, 689 P.2d 430] and People v. Montiel (1985) 39 Cal. 3d 910, 928 [218 Cal. Rptr. 572, 705 P.2d 1248].\n\nI concur fully in the majority opinion insofar as it discusses and overrules Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862] and in all other respects except for its purported holding there was Aranda-Bruton error here. (Bruton v. United States (1968) 391 U.S. 123 [20 L.Ed.2d 476, 88 S.Ct. 1620]; People v. Aranda (1965) 63 Cal. 2d 518 [47 Cal. Rptr. 353, 407 P.2d 265].) In my view the entire discussion as to whether there was in fact Aranda-Bruton error is both legally incorrect and unnecessary to the decision, since the majority concludes that any such error was in any event harmless beyond a reasonable doubt. I therefore dissent from the majority's conclusion that Aranda-Bruton error actually occurred here.\n\n\u003cspan class=\"fn\"\u003e1. To the extent People v. Mardian (1975) 47 Cal. App. 3d 16 [121 Cal. Rptr. 269], on which the Attorney General relies, supports the proposition that the Bruton-Aranda rule applies only when a confession is invalid, it is disapproved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In support of his claim that the Bruton-Aranda rule does not apply on the facts of this case, the Attorney General also cites the plurality opinion in Parker v. Randolph, supra, 442 U.S. 62. Whatever modification, if any, the opinion in that case effected or attempted to effect in the scope of the rule, it left untouched the core of Bruton : \"When, as in Bruton, the confessing codefendant has chosen not to take the stand and the implicated defendant has made no extrajudicial admission of guilt, limiting instructions cannot be accepted as adequate to safeguard the defendant's rights under the Confrontation Clause.\" (Id. at p. 74 [60 L.Ed.2d at p. 724].) Our case therefore lies plainly within the scope of the rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Defendant also argues the admission of Sheila's statements was reversible error under Evidence Code section 352 on the ground they are more prejudicial than probative. He is not persuasive. First, it is doubtful the issue can be deemed to have been preserved on appeal. Defendant failed to make an objection based either expressly or impliedly on section 352. In People v. Frank (1985) 38 Cal. 3d 711 [214 Cal. Rptr. 801, 700 P.2d 415], it is true, we stated that \"[on] an appeal from a judgment imposing the penalty of death, a technical insufficiency in the form of an objection will be disregarded and the entire record will be examined to determine if a miscarriage of justice resulted.\" (Id. at p. 729, fn. 3, italics added.) Defendant's failure even to allude to section 352, however, is distinguishable from such a \"technical insufficiency\" as appears in Frank, where the defect in the objection was merely that it \"could have been more specific.\" (Ibid.) Second, although Sheila's statements were potentially prejudicial, we cannot say that such harm as they threatened outweighs their strong probativeness on the issue of her state of mind. Third, even if the statements ought not to have been admitted, the error was plainly harmless. Since as we have concluded the admission of the statements survives scrutiny under the Chapman test, it follows a fortiori that it did not \"result[] in a miscarriage of justice\" requiring reversal under Evidence Code section 353, subdivision (b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant claims that the harm threatened by a section 987.9 violation also includes the generation of bias in the trial judge. We have serious doubt concerning the merit of the point. It is not apparent how knowledge of the fact of an application or even its contents can prejudice the trial judge against the defendant. If the confidentiality requirement and the related other-judge provision were fundamentally intended to prevent the trial judge from learning of the application, we could perhaps conclude that the Legislature believed the trial judge's knowledge could result in bias and that we should follow its lead. But as we have explained, such is not the fundamental purpose of the statutory provision. In any event, there is no evidence in the record that Judge Marsh's consultation biased the trial judge in any way against defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The prosecution, to be sure, did learn of the application. It did so, however, not from Judge Marsh but rather from the defendant himself, who, apparently making no attempt to move to disqualify ex parte, disclosed his application in open court in connection with this motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant claims the open-court voir dire resulted in making the jurors more guilt and death-penalty prone. To support his point, he cites the following evidence: after sitting through the death-qualifying voir dire, one prospective juror, who was initially ambivalent toward the death penalty, informed the judge she could not vote for death. The claim lacks merit: if this evidence proves anything, it seems to prove the opposite -- viz., that death-qualification may make jurors less likely to convict or fix the penalty at death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We note that the prosecutor did not seek to introduce the evidence to establish identity, but rather to show that defendant knew that Fred's car contained rope -- a fact not at issue below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In Carlos we supported our discussion of the language and history of section 190.2(a)(17) with the observation that the adoption of a law permitting the imposition of the death penalty on an actual killer who nevertheless did not intend to kill would be a \"momentous step, raising grave moral questions. Nothing in the ballot arguments suggested that the framers intended to take such a step; certainly nothing communicated any such intention to the voters.\" (35 Cal. 3d at p. 145.) Putting aside, as we must, our own moral views on the propriety of the death penalty (see People v. Frierson (1979) 25 Cal. 3d 142, 189 [158 Cal. Rptr. 281, 599 P.2d 587] [conc. opn. of Mosk, J.]), we are no longer of the opinion that the adoption of such a law would represent a \"momentous step.\" First, at no time before or after Carlos has the United States Supreme Court held that a felony murderer who actually killed, but did not intend to do so, could not be exposed to the death penalty. Second, under the death penalty law in effect on February 17, 1972, a felony murderer who actually killed, but did not intend to do so, was exposed to the death penalty. (Former Pen. Code, § 189, Stats. 1970, ch. 771, § 3, p. 1456; former Pen. Code, § 190, Stats. 1957, ch. 1968, § 1, p. 3509.) Article I, section 27, of the California Constitution declares that law immune from state constitutional challenge. Thus, the adoption of a law permitting the imposition of the death penalty on an actual, even though unintentional, felony murderer represents merely a return to the status quo ante. Moreover, although nothing in the ballot arguments suggests the framers intended to expose to the death penalty the felony murderer who actually killed but did not intend to do so, we now believe that the very text of the proposed law carries such an implication. The voter pamphlet states: \"This initiative measure proposes to repeal and add sections of the Penal Code; therefore, existing provisions proposed to be deleted are printed in and new provisions proposed to be added are printed in italic type to indicate that they are new.\" (Voter Pamp., Text of Proposed Law, p. 33.) The Voter Pamphlet then prints former Penal Code section 190.2, subdivision (c)(3) -- which contained an express intentionality requirement -- in strikeout type (id. at pp. 41-42), and present Penal Code section 190.2(a)(17) -- which contains no such requirement -- in italics (id. at pp. 42-43).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See, e.g., Gray v. Lucas (5th Cir. 1982) 677 F.2d 1086, 1103, certiorari denied (1983) 461 U.S. 910 [76 L.Ed.2d 815, 103 S.Ct. 1886]; see also Model Penal Code and Commentaries, sections 210.2, 210.6, pages 13-43, 107-171 (generally permitting the death penalty for unintentional felony murders while not permitting it for some intentional murders).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In reading section 190.2(a)(3) as we do, we do not ignore the actual language of the provision. That language unproblematically defines the special circumstance as proved. We simply decline to read that language as specifying what the prosecution must charge : otherwise, the special circumstance could never be alleged and hence would be rendered nugatory, and thus the intent of the legislative body would be frustrated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In reliance on People v. Myers (1987) 43 Cal. 3d 250, 272-273 [233 Cal. Rptr. 264, 729 P.2d 698], the Attorney General asserts that the giving of an unadorned Briggs Instruction can be harmless, and that it was so here. We reject that claim. We adhere to the holding of Montiel, supra, 39 Cal. 3d 910 -- which was authored by then Associate Justice Lucas and signed by four other members of the court -- and accordingly decline to follow what the Attorney General assumes to be the contrary \"holding\" of Myers, a plurality opinion signed by only two members of the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. People v. Turner, supra, applied Carlos to hold that intent to kill was an essential element of the multiple-murder special circumstance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. People v. Whitt (1984) 36 Cal. 3d 724 [205 Cal. Rptr. 810, 685 P.2d 1161]; People v. Ramos (1984) 37 Cal. 3d 136 [207 Cal. Rptr. 800, 689 P.2d 430]; People v. Turner, supra, 37 Cal. 3d 302; People v. Armendariz (1984) 37 Cal. 3d 573 [209 Cal. Rptr. 664, 693 P.2d 243]; People v. Anderson (1985) 38 Cal. 3d 58 [210 Cal. Rptr. 777, 694 P.2d 1149]; People v. Boyd (1985) 38 Cal. 3d 762 [215 Cal. Rptr. 1, 700 P.2d 782]; People v. Hayes (1985) 38 Cal. 3d 780 [214 Cal. Rptr. 652, 699 P.2d 1259]; People v. Chavez (1985) 39 Cal. 3d 823 [218 Cal. Rptr. 49, 705 P.2d 372]; People v. Guerra (1985) 40 Cal. 3d 377 [220 Cal. Rptr. 374, 708 P.2d 1252]; People v. Fuentes (1985) 40 Cal. 3d 629 [221 Cal. Rptr. 440, 710 P.2d 240]; People v. Silbertson (1985) 41 Cal. 3d 296 [221 Cal. Rptr. 152, 709 P.2d 1321]; People v. Hamilton (1985) 41 Cal. 3d 408 [221 Cal. Rptr. 902, 710 P.2d 981], revd. on other grounds, U.S. [92 L.Ed.2d 734, 106 S.Ct. 3328)]; and People v. Ratliff (1986) 41 Cal. 3d 675 [224 Cal. Rptr. 705, 715 P.2d 665].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Among the cases now subject to the death penalty are the following: (a) A burglar startles a resident, who dies of a heart attack. (Cf. People v. Stamp (1969) 2 Cal. App. 3d 203 [82 Cal. Rptr. 598].) (b) A robber inflicts only a minor injury, but the victim dies weeks later of unexpected medical complications. (c) While defendant is on the way to committing an armed robbery, his gun fires accidentally, killing his accomplice. (Cf. People v. Johnson (1972) 28 Cal. App. 3d 653 [104 Cal. Rptr. 807].) (d) While defendant is driving the get-away car, he causes an accident, killing a bystander. (Cf. People v. Fuller (1978) 86 Cal. App. 3d 618 [150 Cal. Rptr. 515].) Indeed the defendant would be subject to the death penalty even if he were driving carefully, so long as he could be said to be \"the actual killer,\" and even if his victim was the robber.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Imagine, for example, the chaos if some years in the future a newly constituted California Supreme Court, taking its view of stare decisis from the present decision, were to overrule the present decision and reinstate Carlos, thus invalidating most death penalty judgments during the interim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. A similar event occured in California. We upheld the constitutionality of the 1977 death penalty law in People v. Jackson (1980) 28 Cal. 3d 264 [168 Cal. Rptr. 603, 618 P.2d 149], a four-to-three decision. When Justice Manuel died, the court was deadlocked, three to three, on the constitutional issue. Justice Tobriner nevertheless voted to affirm the penalty judgment in People v. Harris (1981) 28 Cal. 3d 935, 964 [171 Cal. Rptr. 679, 623 P.2d 240], on the ground that he was bound by the prior decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. To be consistent with their reasoning, the majority should hold their decision to have only prospective effect, or extend retroactivity limited to cases tried after the filing of Tison v. Arizona, supra, 481 U.S. [95 L.Ed.2d 127, 107 S.Ct. 1676]. Under their reasoning a defendant tried after Enmund v. Florida, supra, 458 U.S. 782, but before Tison, should have received an intent-to-kill instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The issue before the court in Cabana v. Bullock, supra, 474 U.S. 376 was whether the finding of intent to kill must be made by a jury or could be made by a reviewing court. In introducing that issue, the United States Supreme Court described its prior decision in Enmund. The language quoted by the majority is part of that introduction. It does not address any issue before the court in Cabana v. Bullock, and does not consider or purport to resolve any controversy concerning the meaning of Enmund.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Tison v. Arizona, supra, 481 U.S. , , footnote 8 [95 L.Ed.2d 127, 141-142, 107 S.Ct. 1671, 1686] said that the California Supreme Court \"construed its capital murder statute to require a finding of intent to kill . . . only . . . in light of perceived federal constitutional limitations stemming from our then recent decision in Enmund.\" The majority, however, recognized that this statement is a \"mischaracterization of the basis of Carlos \" (maj. opn., ante, at p. 1141) since Carlos was based upon a number of other reasons in addition to the perceived effect of Enmund.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Booth v. Maryland endorsed the following language from a California Court of Appeal opinion: \"We think it obvious that a defendant's level of culpability depends not on fortuitous circumstances such as the composition of his victim's family, but on circumstances over which he has control. A defendant may choose, or decline, to premeditate, to act callously, to attack a vulnerable victim, to commit a crime while on probation, or to amass a record of offenses. . . . In contrast, the fact that a victim's family is irredeemably bereaved can be attributable to no act of will of the defendant other than his commission of homicide in the first place. Such bereavement is relevant to damages in a civil action, but it has no relationship to the proper purposes of sentencing in a criminal case.\" (People v. Levitt (1984) 156 Cal. App. 3d 500, 516-517 [203 Cal. Rptr. 276], quoted in Booth v. Maryland, supra, 482 U.S. , , fn. 7 [96 L.Ed.2d 440, 449].) If we apply this reasoning to the present setting, we would conclude that a defendant can choose to kill, but he cannot choose to kill unintentionally; the fact that his unintentional act results in a death is not attributable to an act of defendant's will. It is, therefore, a matter which has no relationship to the proper purposes of criminal sentencing. Such reasoning, admittedly, differs from the reasoning of Tison v. Arizona, supra, 481 U.S. [95 L.Ed.2d 127, 107 S.Ct. 1676]; the Booth dissenters, all of whom joined the majority in Tison, argued that Booth and Tison were inconsistent. (See Booth, 482 U.S. , [96 L.Ed.2d 440, 458-460] (Scalia, J., dis.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. At this writing, the United States Supreme Court has eight members. Justice Powell has retired, and his successor has not yet been confirmed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. One can surmise that the majority substituted \"realistic\" for \"reasonable\" because they have concluded that the Carlos interpretation of the 1978 law was \"reasonable.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The creation of a new rule of construction, under which the court cannot adopt a reasonable construction favorable to the defendant if such action is \"unrealistic,\" would be a revolutionary step. If the majority actually intend to take that step, one would expect them to address the matter candidly, to justify their decision, and to explain what difference it makes to the result in the present case. One would also expect some elucidation of the concept of a \"realistic\" interpretation; standing alone, the word carries ominous overtones of judicial submission to political realities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Carlos noted the longstanding judicial antipathy toward the felony-murder rule, which has led courts to give it the narrowest possible application. (People v. Satchell (1971) 6 Cal. 3d 28, 33-34 [98 Cal. Rptr. 33, 489 P.2d 1361, 50 A.L.R.3d 383].) That antipathy stems from the artificial and arbitrary character of the rule. When the felony-murder rule standing alone -- without proof of malice or premeditation -- serves as a basis for the death penalty, the danger of arbitrariness is increased, and the need for a limiting construction greater. All statutory references are to the Penal Code unless otherwise noted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The majority correctly point out that the Carlos opinion did not eliminate all anomalies. The 1978 law, as interpreted by the present majority, requires proof of intent to kill, deliberation, and premeditation for some felony murderers, but not for others. Carlos eliminated this irrational distinction with respect to the element of intent, but not for deliberation and premeditation. As between an opinion which eliminates some of the anomalies in the law, and one which retains them all, the former would seem preferable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The majority also refer to the practice of printing the ballot pamphlet with provisions to be deleted in strikeover type and those to be added in italic type. But the voter who sought to utilize this tool would discover that the entire 1977 law was to be repealed and that all provisions of the 1978 law, including those identical to the 1977 law, were considered new provisions. Any attempt to determine the meaning of the new law by comparing the provisions in italic type with those in strikeover type would be a laborious task, and at the end the voter would only discover the uncertainties and ambiguities discussed in this case, and many others as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The majority disagree with Carlos's claim that the elimination of an intent to kill requirement would be a \"momentous step,\" but their discussion mistakenly equates \"momentous\" with \"unconstitutional.\" (See maj. opn., ante, p. 1145, fn. 8 .) Although Carlos did discuss the constitutionality of executing an unintentional killer, that is a separate issue; the point of the quoted language from Carlos is simply that the elimination of an intent requirement is of sufficient importance, compared to the other changes effected by the 1978 law, that one would expect the ballot arguments to discuss the question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Davis itself offers an analogy to the present case. It construed section 190.5 of the 1977 death penalty law, which provided that \"the death penalty shall not be imposed upon any person who is under the age of 18 years at the time of the commission of the crime.\" This section said nothing about imposing a punishment of life imprisonment without possibility of parole. One could argue that on its face the statute unambiguously permitted that punishment; Justice Richardson, who on the same ground dissented in Carlos, so argued. Yet the majority, by Justice Mosk, found the statute ambiguous, and construed it to bar such punishment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The quoted language from Godfrey v. Georgia, supra, 446 U.S. 420, assumes that the state standards will permit the death penalty in only a few of the many murder cases. It would be interesting to see statistics that show what percentage of murders in California fall within one or another of the 19 special circumstances. I suspect the 1978 California law has the opposite effect from that envisioned by the United States Supreme Court: that it serves to distinguish those few murder cases in which the death penalty may not be imposed from the many in which, in the discretion of the prosecutor and jury, it may be imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The premeditating killer, without special circumstances, can be sentenced at most to life with possibility of parole; the murderer with felony-murder special circumstances must be sentenced at least to life without possibility of parole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A substantial percentage of those cases were in fact decided by this court, but the decisions were vacated after a change in the membership of the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Because the present case must be retried, it is an inappropriate one for overruling Carlos. Since the new jury will be unfamiliar with the case, the new trial will probably include all evidence from the first trial, including that bearing on intent to kill. Carlos would add only a requirement that the new jury also determine whether defendant intended to kill; hardly a difficult determination under the facts of this case. In short, Carlos makes very little difference in this case, and defendant will have little incentive to seek review of this decision in the United States Supreme Court. But having overruled Carlos in a case where it does not matter, the majority will be able to cite this case to affirm a death penalty upon a defendant who did not intend to kill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. A few cases in which the defendant was sentenced to life imprisonment without possibility of parole were affirmed by the Court of Appeal and not heard before this court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. One could refer to this construction of the 1978 law as \"draconian,\" a term which refers to a severe and arbitrary law. (See Black's Law Dict. (5th ed. 1979) p. 443.) Yet, Drakon's laws, harsh though they may have been, distinguished between premeditated and unpremeditated homicide, and imposed the lesser punishment of exile upon those who did not premeditate. (See Hooper, Greek Realities (1967) p. 137; see generally Stroud, Drakon's Law on Homicide (1968 U. Cal. Publications) 3 Classical Studies.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Citing People v. Myers, supra, 43 Cal. 3d 250, 272-273, the Attorney General contends that Ramos error may be harmless and that it was so here. The majority, in response, adhere to People v. Montiel, supra, 39 Cal. 3d 310, which held Ramos error reversible per se, and reject any contrary holding of Myers. In my view, there is no need to posit a nonexistent conflict between Montiel and Myers. The simple answer to the Attorney General's contention is that Myers does not support it; our decision in that case declared that \"in view of the very serious potential for prejudice emphasized in Ramos, we strongly doubt that we could ever confidently conclude that there was no reasonable possibility that this instruction improperly tainted the jury's decision-making process.\" (43 Cal. 3d at p. 272.)\u003c/span\u003e\n\n",
    "body_length": 156531,
    "citedas": [
      "43 Cal. 3d 1104",
      "742 P.2d 1306",
      "240 Cal. Rptr. 585"
    ],
    "attorneys": "Philip Deitch, under appointment by the Supreme Court, for Defendant and Appellant. John K. Van de Kamp and George Deukmejian, Attorneys General, Robert H. Philibosian and Steve White, Chief Assistant Attorneys General, Daniel J. Kremer, Assistant Attorney General, Harley D. Mayfield, Frederick R. Millar, Jr., Robert M. Foster, John W. Carney and Jay M. Bloom, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Opinion by Mosk, J., with Panelli, Arguelles and Eagleson, JJ., concurring. Separate concurring opinion by Lucas, C. J. Separate concurring and dissenting opinions by Broussard, J., and by Kaufman, J.",
    "citation_count": 13
  }
}
