{
  "id": "a7TeTGYBTlTomsSBEQ-f",
  "document": {
    "title": "11/24/80 PEOPLE v. AARON PEOPLE V. THOMPSON PEOPLE",
    "full_title": "PEOPLE v. AARON; PEOPLE V. THOMPSON; PEOPLE V. WRIGHT",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1980-11-24T00:00:00.000Z",
    "docket": "Docket Nos. 57376, 61140, 61194",
    "body": "Stephen Aaron, Jr., was convicted by a jury in Recorder's Court of Detroit, Michael J. Connor, J., of first-degree murder for a homicide committed during the perpetration of an armed robbery. The trial court instructed the jury that they could convict the defendant of first-degree murder if they found that he killed the victim during the commission or attempted commission of an armed robbery, and refused the defendant's request for instructions on lesser offenses. The Court of Appeals, Danhof, P.J., and R. B. Burns and R. M. Maher, JJ., affirmed the defendant's conviction (Docket No. 20464). On application by the defendant for leave to appeal, the Supreme Court, in lieu of granting leave to appeal, remanded the case to the trial court for entry of a judgment of guilty of second-degree murder, and the defendant was resentenced to life imprisonment, 396 Mich 843 (1976). The defendant, upon reconsideration, was granted leave to appeal on the ground that the jury was not instructed on the element of intent required for second-degree murder; instead the trial court relied on the felony-murder doctrine which allows the element of malice to be supplied by the intent to commit the underlying felony.\n\nRobert G. Thompson was convicted by a jury in Saginaw Circuit Court, Eugene Snow Huff, J., of armed robbery and of first-degree felony murder as the result of a death which occurred during the armed robbery. The trial court instructed the jury that it was not necessary for the prosecution to prove premeditated design or intent to commit the homicide but that a finding of the intent to rob sufficed to make the homicide first-degree murder. The Court of Appeals, M. F. Cavanagh, P.J., and Bronson, J. (M. J. Kelly, J., Dissenting), held that reversible error resulted from the trial court's failure to instruct the jury on the element of malice in the felony-murder charge (Docket No. 26215). The people appeal.\n\nJesse Wright was convicted by a jury in Washtenaw Circuit Court, Edward D. Deake, J., of two counts of first-degree murder for setting fire to a dwelling, causing the death of two people. The trial court instructed the jury that proof that the deaths occurred during the perpetration of arson was sufficient to establish the intent necessary to convict the defendant of first-degree murder. The Court of Appeals, D. C. Riley, P.J., and R. M. Maher, J. (J. H. Gillis, J., Dissenting), reversed the convictions in a per curiam opinion on the ground that it was error to remove the element of malice from the jury's consideration (Docket No. 28298). The people appeal.\n\nIn an opinion by Justice Fitzgerald, joined by Chief Justice Coleman and Justices Kavanagh, Levin, and Moody, the Supreme Court held :\n\nThe common-law felony-murder doctrine which allows the element of malice required for murder to be satisfied by the intent to commit the underlying felony is abrogated. In order to convict a defendant of murder, it must be shown that he acted with intent to kill or to inflict great bodily harm, or with a wanton and willful disregard of the likelihood that the natural tendency of his behavior was to cause death or great bodily harm. Further, the issue of malice must be submitted to the jury. The first-degree murder statute continues to operate: all murder committed in the perpetration or attempted perpetration of the enumerated felonies is first-degree murder.\n\n1. Felony murder has never been a static, well-defined doctrine at common law, but throughout its history has been characterized by judicial reinterpretation to limit the harshness of its application. Historians and commentators have concluded that it is of questionable origin and that the reasons for the doctrine no longer exist, making it an anachronistic remnant for which there is no logical or practical basis in modern law. At early common law the felony-murder doctrine went unchallenged because practically all felonies were punishable by death and it was of no moment whether the condemned was hanged for the initial felony or for the death accidentally resulting from the felony, so that no inJustice was caused directly by application of the doctrine. During the nineteenth and twentieth centuries the doctrine was continuously modified and restricted in England until it was ultimately rejected by an act of Parliament in 1957.\n\n2. Even though the felony-murder doctrine survives in the United States, the numerous modifications and restrictions of it by courts and legislatures reflect dissatisfaction with the harshness and inJustice of the doctrine. To the extent that these modifications reduce the scope and significance of the common-law doctrine, they also call into question its continued existence.\n\n3. The felony-murder doctrine violates the basic principle of that criminal liability for causing a result is not justified in the absence of some culpable mental state in respect to it. The doctrine punishes all homicides committed in the perpetration or attempted perpetration of proscribed felonies, whether intentional, unintentional, or accidental, without the necessity of proving the relation between the homicide and the perpetrator's state of mind. The felony-murder doctrine completely ignores the concept of guilt on the basis of individual misconduct, and thus erodes the relation between criminal liability and moral culpability. The most egregious violation of the basic rule of culpability occurs when felony murder is categorized as first-degree murder, because all other first-degree murders carrying equal punishment require a showing of premeditation, deliberation, and willfulness, while felony murder only requires a showing of intent to do the underlying felony. The purpose of the statutes creating degrees of murder is to punish more severely the more culpable forms of murder, but an accidental killing occurring during the perpetration of a felony would be punished more severely than a second-degree murder requiring intent to kill, intent to cause great bodily harm, or wantonness and willfulness. Furthermore, a defendant charged with first-degree felony murder is permitted to raise defenses only to the mental element of the felony, thus precluding certain defenses available to a defendant charged with premeditated murder who may raise defenses to the mental element of murder (e.g., self-defense or accident). When the felony-murder doctrine originated, proof of the intention to commit a felony met the test of criminal culpability based on the vague definition of malice aforethought governing at that time, but today malice is a term of art which does not include the nebulous definition of intentional wrongdoing. Thus, although the felony-murder doctrine did not broaden the definition of murder at early common law, it does so now. This enlargement of the scope of murder is unacceptable because it is based on a concept of culpability which is totally incongruous with the general principles of our jurisprudence today.\n\n4. In Michigan, murder is not defined by statute, but by the common law. An early case defined it as where a person of sound memory and discretion kills any reasonable creature in being, in the peace of the state, with malice prepense or aforethought, either express or implied. Malice aforethought is the criterion which elevates a homicide, which may be innocent or criminal, to murder. However, the nature of malice aforethought is the source of much of the confusion that attends the law of homicide. It is preferable not to rely upon that misleading expression but rather to consider the various types of murder which the common law came to recognize: 1) intent-to-kill murder, 2) intent-to-do-serious-bodily-injury murder, 3) depraved-heart murder, wanton and willful disregard that the natural tendency of the defendant's behavior is to cause death or great bodily harm, and 4) felony murder. Each of the four types of murder has its own mental element which independently satisfies the requirement of malice aforethought. It is, therefore, not necessary for the law to imply or for the jury to infer the intention to kill once the finder of fact determines the existence of any of the first three mental states because each one, by itself, constitutes the element of malice aforethought. The felony-murder doctrine does not abolish the requirement of malice, nor does it equate the mens rea of the felony with the mens rea required for a non-felony murder. The doctrine provides a separate definition of malice, thereby establishing a fourth category of murder. The effect of the doctrine is to recognize the intent to commit the underlying felony, in itself, as a sufficient mens rea for murder.\n\n5. Michigan does not have a statutory felony-murder doctrine which designates as murder any death occurring in the course of a felony without regard to whether it was the result of accident, negligence, recklessness or willfulness. Rather, the statute makes a murder occurring in the course of one of the enumerated felonies a first-degree murder. The purpose of the statute is to graduate punishment, and it only serves to raise an already established murder to the first-degree level, not to transform a death, without more, into a murder. The use of the term \"murder\" in the statute requires that a murder must first be established before the statute is applied to elevate the degree.\n\n6. The term \"murder\" as used in the statute includes all types of murder at common law. That Michigan has never specifically adopted the felony-murder doctrine, although some cases appear to assume its existence, does not end the inquiry. Under the general rule that the common law prevails in this state unless abrogated by the Constitution, the Legislature, or the Supreme Court, the common-law felony-murder doctrine is the law. A number of decisions of the Court have significantly restricted the doctrine, and lead to the Conclusion that it should be abolished. The trend of the decisions has been to narrow the kinds of felony to which the rule may be applied, to restrict the class of persons to whom it may be applied, and to permit the jury to consider the nature of the felony where a non-enumerated felony is involved. There is no logical reason why cases involving the enumerated felonies should be treated differently than those involving non-enumerated felonies for the purpose of establishing malice. The enumerated felonies are not necessarily inherently dangerous to human life, and those which may seem so when viewed in the abstract may not be so dangerous when viewed in light of the circumstances of a particular case. The first-degree murder statute enumerates certain felonies solely for the purpose of elevating the degree of murder committed in the perpetration or attempted perpetration of those felonies; it nowhere indicates an intention to enumerate felonies for the purpose of defining malice. Therefore, the Court abolishes the rule which defines malice as the intent to commit the underlying felony.\n\n7. It is no longer acceptable to equate the intent to commit a felony with the intent to kill, intent to do great bodily harm, or wanton and willful disregard of the likelihood that the natural tendency of a person's behavior is to cause death or great bodily harm. Malice requires an intent to cause the very harm that results or some harm of the same general nature, or an act done in wanton or willful disregard of the plain and strong likelihood that such harm will result. In a charge of felony murder, it is the murder which is the harm which is being punished. A defendant who only intends to commit the felony does not intend to commit the harm that results and may or may not be guilty of perpetrating an act done in wanton or willful disregard of the plain and strong likelihood that such harm will result. The intent to commit the felony, of itself, does not connote a man-endangering state of mind. Hence, it does not constitute a sufficient mens rea to establish the crime of murder.\n\n8. Malice is an essential element of any murder, whether the murder occurs in the course of a felony or otherwise. The mental state involved in the perpetration of a felony may evidence an intent to kill, an intent to do great bodily harm, or wanton and willful disregard that the natural tendency of the defendant's behavior is to cause death or great bodily harm. The Conclusion must be left to the jury to infer from all of the evidence. Otherwise, juries might be required to find the fact of malice where they were satisfied from the whole evidence that it did not exist.\n\n9. Abrogation of the category of malice arising from the intent to commit the underlying felony does not make irrelevant the fact that a death occurred in the course of a felony. A jury can properly infer malice from evidence that a defendant intentionally set in motion a force likely to cause death or great bodily harm. Whenever a killing occurs in the perpetration or attempted perpetration of an inherently dangerous felony, the jury may consider the nature of the underlying felony and the circumstances surrounding its commission in order to establish malice. If the jury concludes that malice existed, they can find there was a murder and, if they determine that the murder occurred in the perpetration or attempted perpetration of one of the enumerated felonies, by statute the murder would become first-degree murder. This means that the jury may not find malice from the intent to commit the underlying felony alone. The defendant will be permitted to assert any of the applicable defenses relating to mens rea which he would be allowed to assert if he were charged with premeditated murder.\n\n10. The decision in this case applies to all trials in progress and those occurring after the date of the opinion.\n\nJustice Ryan concurred in the holding and result, but he disagreed with some of the Court's reasoning.\n\n1. It is clear that under Michigan law the substantive offense of common-law murder, a homicide committed with malice, express or implied, must be proven before the statutory provisions which declare differing penalties for the different degrees of murder come into operation. Malice aforethought is the intention to kill, actual or implied, under circumstances which do not constitute excuse or justification or mitigate the degree of the offense to manslaughter. The intent to kill may be implied where the actor actually intends to inflict great bodily harm or the natural tendency of his behavior is to cause death or great bodily harm. In this state there is no common-law definition of malice as the intent to commit an inherently dangerous felony.\n\n2. The felony-murder rule is a method of proof which establishes a conclusive implication, or an imputation as a matter of law, or a conclusive presumption of the implied intent to kill from factual proof of the intent to commit the underlying felony. The rule operates as a matter of law to relieve the prosecution completely of its burden of proving at all, much less beyond a reasonable doubt, the necessary factual element of malice, i.e., the intent to kill, actual or implied. It irrebuttably satisfies the burden, as opposed to shifting the burden, of proof.\n\n3. Under the felony-murder rule the defendant's state of mind with respect to the killing is irrelevant. The only mens rea involved pertains solely to the underlying felony. Because malice, correctly understood, is a characterization of a particular state of mind with respect to a killing, it follows that the common-law offense of felony murder does not require malice. Yet, historically, acceptance of this reality has, in general, been resisted by many courts and commentators who insist, erroneously, that felony murder requires malice. Their theory begins with the proposition that felony murder, like all murder, requires malice and ends with the proposition that malice is imputed, as a matter of law, from the intent to commit the underlying felony. This is a useless fiction at best. The offense of felony murder requires only (1) the commission or attempt to commit a felony and (2) a killing causally connected with the commission or attempt. Because malice is the sine qua non of murder, courts, when confronted with the crime of felony murder which does not require malice, have resorted to conceptualizing felony murder in a way that professes obedience to the \"murder requires malice\" commandment. As a result, malice is said to include an intent to perpetrate a (dangerous) felony. Thus, obeisance is mistakenly paid to the axiom that murder requires malice by including within the definition of malice a case in which it is not an element. The price paid is continuing confusion in the law of homicide. Malice has nothing to do with common-law felony murder; it is not an element of the crime, and is not properly considered by the jury. Except for its name, felony murder bears little if any resemblance to the offense of murder. It is a mistaken analysis, therefore, that permits one to deem the intent to commit a felony a kind of malice, and felony murder a kind of common-law murder.\n\n4. The Court has never specifically adopted the common-law crime of felony murder, nor ever expressly considered whether Michigan has or should continue to have a common-law felony-murder doctrine. Although there is language in the Michigan Reports that ostensibly adverts to felony murder, the Discussion is invariably superficial, tangential, opaque, and almost always clearly dictum. As a result, the very existence of felony murder in Michigan has been ardently disputed by the Court of Appeals, in which there now exists a sharp split of authority. Inasmuch as resolution of the divergent views is made unnecessary by the holding today, it is sufficient to state only that if felony murder existed in Michigan, by virtue of today's decision it no longer does.\n\n5. The Court has correctly outlined the injudicious and unprincipled premises on which the common-law doctrine of felony murder rests. The basic infirmity of the felony-murder rule lies in its failure to correlate, to any degree, criminal liability with moral culpability. It permits one to be punished for a killing, with the most severe penalty in the law, without requiring proof of any mental state with respect to the killing. This incongruity is more than the state's criminal jurisprudence should be permitted to bear.\n\n6. The effect of this decision is not to redefine malice or murder. Those terms will mean what they have always meant in this state: murder is a killing accompanied by malice; malice is the intent to kill, the intent to inflict great bodily harm, or wanton and willful disregard of the likelihood that the natural tendency of one's behavior is to cause death or great bodily harm. Moreover, malice is and always has been a question of fact for the trier of fact and, as all questions of fact, may be established by direct evidence, circumstantial evidence, or both. These principles are unaffected by this case. The Court simply declares that the offense popularly known as felony murder shall no longer exist in Michigan, if indeed it ever did.\n\nJustice Williams, Concurring in the result, wrote that it is the language of the statute which determines whether there need be proof of malice in a felony murder case. The critical language which defines first-degree murder is not that it is a homicide, but a murder which is perpetrated in certain circumstances. Proof of malice is not essential to all forms of homicide, but it is essential to all forms of murder, and therefore, proof of a felony murder under the statute requires proof of malice as does any other murder.\n\nThe existence and scope of the felony-murder doctrine have perplexed generations of law students, commentators and jurists in the United States and England, and have split our own Court of Appeals. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In these cases, we must decide whether Michigan has a felony-murder rule which allows the element of malice required for murder to be satisfied by the intent to commit the underlying felony or whether malice must be otherwise found by the trier of fact. We must also determine what is the mens rea required to support a conviction under Michigan's first-degree murder statute. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nFacts\n\nIn Thompson, defendant was convicted by a jury of first-degree felony murder as the result of a death which occurred during an armed robbery. The trial Judge instructed the jury that it was not necessary for the prosecution to prove malice, as a finding of intent to rob was all that was necessary for the homicide to constitute first-degree murder. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The Court of Appeals held that reversible error resulted from the trial court's failure to instruct the jury on the element of malice in the felony-murder charge. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn Wright, defendant was convicted by a jury of two counts of first-degree felony murder for setting fire to a dwelling causing the death of two people. The trial court instructed the jury that proof that the killings occurred during the perpetration of arson was sufficient to establish first-degree murder. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The Court of Appeals reversed the convictions, holding that it was error to remove the element of malice from the jury's consideration. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nDefendant Aaron was convicted of first-degree felony murder as a result of a homicide committed during the perpetration of an armed robbery. The jury was instructed that they could convict defendant of first-degree murder if they found that defendant killed the victim during the commission or attempted commission of an armed robbery. The trial court refused defendant's request to instruct on lesser included offenses. The Court of Appeals affirmed \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and we remanded the case to the trial court for entry of a judgment of conviction of the lesser included offense of second-degree murder and for resentencing. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Defendant subsequently filed an application for reconsideration with this Court.\n\nIn Thompson and Wright we granted leave to appeal limited to the question: \"Whether the Court of Appeals erred in reversing the murder conviction in this case because of the lack of an instruction on a requirement for finding malice in a felony-murder situation.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn Aaron, we granted leave to appeal to consider whether defendant's conviction of first-degree murder could be reduced to second-degree murder where the jury was instructed only on felony murder. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nII. History of the Felony-Murder Doctrine\n\nFelony murder has never been a static, well-defined rule at common law, but throughout its history has been characterized by judicial reinterpretation to limit the harshness of the application of the rule. Historians and commentators have concluded that the rule is of questionable origin and that the reasons for the rule no longer exist, making it an anachronistic remnant, \"a historic survivor for which there is no logical or practical basis for existence in modern law\". \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe first formal statement of the doctrine is often said to be Lord Dacres ' case, Moore 86; 72 Eng Rep 458 (KB, 1535). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Lord Dacres and some companions agreed to enter a park without permission to hunt, an unlawful act, and to kill anyone who might resist them. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e While Lord Dacres was a quarter of a mile away, one member of his group killed a gamekeeper who confronted him in the park. Although Lord Dacres was not present when the killing occurred, he, along with the rest of his companions, was convicted of murder and was hanged. Contrary to the construction placed on this case by those who see it as a source of the felony-murder rule, the holding was not that Lord Dacres and his companions were guilty of murder because they had joined in an unlawful hunt in the course of which a person was killed, but rather that those not present physically at the killing were held liable as principals on the theory of constructive presence. Moreover, because they had agreed previously to kill anyone who might resist them, all the members of the group shared in the mens rea of the crime. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Thus, because Lord Dacres ' case involved express malice, no doctrine finding malice from the intention to commit an unlawful act was necessary or in fact utilized. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nAnother early case which has been cited \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e for the origin of the felony-murder doctrine was decided after Lord Dacres ' case. In Mansell \u0026 Herbert's case, 2 Dyer 128b; 73 Eng Rep 279 (KB, 1558), Herbert and a group of more than 40 followers had gone to Sir Richard Mansfield's house \"with force to seize goods under pretence of lawful authority\". \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e One of Herbert's servants threw a stone at a person in the gateway which instead hit and killed an unarmed woman coming out of Mansfield's house. The question was agreed to be whether the accused were guilty of murder or manslaughter. Since misadventure was not considered, it can be assumed that the throwing of the stone was not a careless act but that the servant who threw the stone intended at least to hit, if not kill, some person on Mansfield's side. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Although the court divided, the majority held that if one deliberately performed an act of violence to third parties, and a person not intended died, it was murder regardless of any mistake or misapplication of force. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The minority would have held it to be manslaughter because the violent act was not directed against the woman who died. Thus, Herbert's case involved a deliberate act of violence against a person, which resulted in an unintended person being the recipient of the violent act.\n\nSome commentators \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e suggest that an incorrect version of Dacres ' case, which was repeated by Crompton, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e formed the basis of Lord Coke's statement of the felony-murder rule:\n\n\"If the act be unlawful it is murder. As if A. meaning to steale a deere in the park of B., shooteth at the deer, and by the glance of the arrow killeth a boy that is hidden in a bush: this is murder, for that the act was unlawfull, although A. had no intent to hurt the boy, nor knew not of him. But if B. the owner of the park had shot at his own deer, and without any ill intent had killed the boy by the glance of his arrow, this had been homicide by misadventure, and no felony.\n\n\"So if one shoot at any wild fowle upon a tree, and the arrow killeth any reasonable creature afar off, without any evill intent in him, this is per infortunium : for it was not unlawful to shoot at the wilde fowle: but if he had shot at a cock or hen, or any tame fowle of another mans, and the arrow by mischance had killed a man, this had been murder, for the act was unlawfull.\" \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe above excerpt from Coke is, along with Lord Dacres ' and Herbert's cases, most often cited \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e as the origin of the felony-murder doctrine. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Unfortunately, Coke's statement has been criticized as completely lacking in authority. \"A telling historical comment on the essential non-logic of the rule is made by those who see its genesis as a blunder by Coke in the translation and interpretation of a passage from Bracton.\" \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The passage from Bracton is as follows:\n\n\"But here it is to be distinguished whether a person is employed upon a lawful or unlawful work, as if a person has projected a stone towards a place across which men are accustomed to pass, or whilst a person pursues a horse or an ox, and some one has been struck by the horse or the ox, and such like, this is imputed to his account. But if he was employed in a lawful work, as if a master is flogging his scholar for the sake of discipline, or if when a person was casting down hay from a cart, or cutting into a tree and such like, if he had taken as diligent care as he could, by looking out and by calling out, * * * or the master not exceeding moderation in flogging his scholar, blame is not imputable to him.\" (Emphasis added.) \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThis authority, however, does not support Coke's unwarranted extension which Stephen termed \"astonishing\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and \"monstrous\". \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e As one writer points out:\n\n\"It can be seen at a glance that all Bracton intends to convey by this is that the killing in the cases he mentions would be unlawful; he in no way states that it would amount to murder ('murdrum'), which term indeed had quite a special and peculiar significance at the time at which he wrote, being properly confined to crimes of the nature of secret assassinations. Bracton, in fact, was too familiar with the Roman law * * * to have made such a mistake.\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nStephen notes also that the example Bracton uses would not come within the category of murder as Bracton defines it. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nIn addition to his citation to Bracton, Coke cites three cases to support his statement of the felony-murder rule. Yet Stephen, \"upon careful search into Coke's authority\", concludes that Coke's statement of the rule is \"entirely unwarranted by the authorities which he quotes\". \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Another early writer, commenting on the harsh doctrine propounded by Coke, states, \"'This is not distinguished by any statute but is the common law only of Sir Edward Coke'.\" \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nAt early common law, the felony-murder rule went unchallenged because at that time practically all felonies were punishable by death. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e It was, therefore, \"of no particular moment whether the condemned was hanged for the initial felony or for the death accidentally resulting from the felony\". \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Thus, as Stephen and Perkins point out, no inJustice was caused directly by application of the rule at that time. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nHale, in his Pleas of the Crown, refused to extend the doctrine to include all unlawful acts and instead gave examples of killings resulting from unlawful acts, some of which he said were murders and others manslaughter. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Stephen understood Hale as requiring an act which was intended to inflict bodily injury of some kind or else the killing would be manslaughter. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nChief Justice Holt, writing in Rex v Keate, Comberbach 406; 90 Eng Rep 557 (KB, 1697), said that Coke's statement was a very exaggerated proposition of law and that for unintentional homicides to constitute murder there must be an intent to commit a felony or a design to do mischief toward a person. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nFoster stated that an unintentional killing resulting from an unlawful act would amount to murder only if done \"in the prosecution of a felonious intention\". \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Stephen, commenting on Foster's statement of the rule, said, \" one rule is less bad than the other, principally because it is narrower.\" \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e The only authority cited by Foster is the dictum of Holt, C.J., in Rex v Plummer, Kelyng 109; 84 Eng Rep 1103 (1701), which cited no other authority than Coke for the requirement of a felonious design. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Foster's position was reiterated by Hawkins, Blackstone and East. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nCase law of Nineteenth-Century England reflects the efforts of the English courts to limit the application of the felony-murder doctrine. See, e.g., Regina v Greenwood, 7 Cox, Crim Cas 404 (1857); Regina v Horsey, 3 F \u0026 F 287; 176 Eng Rep 129 (1862), \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e culminating in Regina v Serne, 16 Cox, Crim Cas 311 (1887). In the latter case, involving a death resulting from arson, Judge Stephen instructed the jury as follows:\n\n\" of saying that any act done with intent to commit a felony and which causes death amounts to murder, it should be reasonable to say that any act known to be dangerous to life and likely in itself to cause death, done for the purpose of committing a felony which causes death, should be murder.\"\n\nIn this century, the felony-murder doctrine was comparatively rarely invoked in England \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e and in 1957 England abolished the felony-murder rule. Section 1 of England's Homicide Act, 1957, 5 \u0026 6 Eliz 2, c 11, ยง 1, provides that a killing occurring in a felony-murder situation will not amount to murder unless done with the same malice aforethought as is required for all other murder.\n\nThus, an examination of the felony-murder rule indicates that the doctrine is of doubtful origin. Derived from the misinterpretation of case law, it went unchallenged because of circumstances which no longer exist. The doctrine was continuously modified and restricted in England, the country of its birth, until its ultimate rejection by Parliament in 1957.\n\nIII. Limitation of the Felony-Murder Doctrine in the United States\n\nWhile only a few states \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e have followed the lead of Great Britain in abolishing felony murder, various legislative and judicial limitations on the doctrine have effectively narrowed the scope of the rule in the United States. Perkins states that the rule is \"somewhat in disfavor at the present time\" and that \"courts apply it where the law requires, but they do so grudgingly and tend to restrict its application where circumstances permit\". \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nThe draftsmen of the Model Penal Code have summarized the limitations imposed by American courts as follows: \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\n(1) \"The felonious act must be dangerous to life.\" \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\n(2) and (3) \"The homicide must be a natural and probable consequence of the felonious act.\" \"Death must be 'proximately' caused.\" \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Courts have also required that the killing be the result of an act done in the furtherance of the felonious purpose and not merely coincidental to the perpetration of a felony. These cases often make distinctions based on the identity of the victim (i.e., whether the decedent was the victim of the felony or whether he was someone else, e.g., a policeman or one of the felons) and the identity of the person causing the death. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\n(4) \"The felony must be malum in se.\" \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\n(5) \"The act must be a common-law felony.\" \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\n(6) \"The period during which the felony is in the process of commission must be narrowly construed.\" \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\n(7) \"The underlying felony must be 'independent' of the homicide.\" \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nSome courts, recognizing the questionable wisdom of the rule, have refused to extend it beyond what is required. \" do want to make clear how shaky are the basic premises on which [the felony-murder rule] rests. With so weak a foundation, it behooves us not to extend it further and indeed, to restrain it within the bounds it has always known.\" Commonwealth ex rel Smith v Myers, 438 Pa 218, 227; 261 A2d 550, 555 (1970). \"We have thus recognized that the felony-murder doctrine expresses a highly artificial concept that deserves no extension beyond its required application. Indeed, the rule itself has been abandoned by the courts of England, where it had its inception. It has been subjected to severe and sweeping criticism.\" People v Phillips, 64 Cal 2d 574, 582-583; 51 Cal Rptr 225; 414 P2d 353, 360 (1966). \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nOther courts have required a finding of a separate mens rea connected with the killing in addition to the intent associated with the felony. In State v Millette, 112 NH 458, 462; 299 A2d 150, 153 (1972), the Court stated:\n\n\"Neither the legislature nor our court ever adopted a presumption of malice from the commission of an unlawful act whether felony or misdemeanor. While language in our cases defining murder may be construed to presume malice from a homicide occurring during the commission of the named inherently dangerous felonies [citations omitted] malice remains an indispensable element in the crime of murder. 'Malice is not an inference of law from the mere act of killing; but like any other fact in issue, it must be found by the jury upon competent evidence.'\"\n\nThis Court has held, at least with killings occurring during commission of non-enumerated felonies, that malice may be inferred but the nature of the felonious act must be considered. People v Jeffrey Carter, 387 Mich 397, 422; 197 NW2d 57 (1972). Similarly, New Mexico has declared that where a non-first-degree felony (this category would include many of Michigan's enumerated felonies) is involved, the presumption that the defendant has the requisite mens rea to commit first-degree murder \"is a legal fiction we no longer can support\". State v Harrison, 90 NM 439, 442; 564 P2d 1321 (1977).\n\nThe Iowa Supreme Court has recently ruled that the issue of malice aforethought necessary for murder must be submitted to the jury and that it may not be satisfied by proof of intent to commit the underlying felony. State v Galloway, 275 NW2d 736, 738 (Iowa, 1979).\n\nMany state legislatures have also been active in restricting the scope of felony murder by imposing additional limitations. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nKentucky \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e and Hawaii \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e have specifically abolished the felony-murder doctrine. The commentary to Hawaii's murder statute is instructive as to that state's reasoning in abolishing the doctrine:\n\n\"Even in its limited formulation the felony-murder rule is still objectionable. It is not sound principle to convert an accidental, negligent, or reckless homicide into a murder simply because, without more, the killing was in furtherance of a criminal objective of some defined class. Engaging in certain penally-prohibited behavior may, of course, evidence a recklessness sufficient to establish manslaughter, or a practical certainty or intent, with respect to causing death, sufficient to establish murder, but such a finding is an independent determination which must rest on the facts of each case.\n\n\"In recognition of the trend toward, and the substantial body of criticism supporting, the abolition of the felony-murder rule, and because of the extremely questionable results which the rule has worked in other jurisdictions, the Code has eliminated from our law the felony-murder rule.\" \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nOhio \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e has effectively abolished the felony-murder rule. It defines as involuntary manslaughter the death of another proximately resulting from the offender's commission or attempt to commit a felony. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nSeven states have downgraded the offense and consequently reduced the punishment. Alaska, \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e Louisiana, \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e New York, \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e Pennsylvania \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e and Utah \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e have reduced it to second-degree murder. Minnesota \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e classifies felony murder as third-degree murder (with the exception of a killing in the course of criminal sexual conduct in the first or second degree committed with force or violence, which is punished as first-degree murder) which involves a sentence of not more than 25 years. Wisconsin \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e makes felony murder a class B felony which is punishable by imprisonment not to exceed 20 years.\n\nThree states require a demonstration of mens rea beyond the intent to cause the felony. The Arkansas statute \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e states that the defendant must cause the death \"under circumstances manifesting extreme indifference to the value of human life\". Delaware's first-degree murder statute \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e requires that the defendant cause death recklessly in the course of a felony or with at least criminal negligence in the course of one of the enumerated felonies. It defines as second-degree murder death caused with criminal negligence in the course of non-enumerated felonies. \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e New Hampshire's capital and first-degree murder statutes require that death be caused knowingly in connection with certain enumerated felonies while its second-degree murder statute requires that death be caused \"recklessly under circumstances manifesting an extreme indifference to the value of human life\". \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nSome of the limitations on the felony-murder doctrine which have been imposed by the courts, as mentioned above, have been codified by statute. These limitations include restrictions on the underlying felony, requiring that it be forcible, violent or clearly dangerous to human life, \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e that death be proximately caused, \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e that death be a natural or probable consequence \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e or a reasonably foreseeable consequence \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e of the commission or attempted commission of the felony, that the felon must have caused the death, \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e and that the victim must not be one of the felons. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\n\nOther restrictions of the common-law rule include the enumeration of felonies which are to be included within the felony-murder category, \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e and the reduction to manslaughter of killings in the course of non-enumerated felonies. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e The commentary following New York's revision of its felony-murder statute, deleting \"any felony\" and inserting specifically enumerated felonies, states: \"The purpose of the indicated limitations is to exclude from felony murder, cases of accidental or not reasonably foreseeable fatality occurring in the course of a non-violent felony.\" \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e The limitation is a response to a significant aspect of the common-law felony-murder rule -- the fact that it ignores the relevance of factors, e.g., accident, which mitigate culpability.\n\nFinally, a limitation of relatively recent origin is the availability of affirmative defenses where a defendant is not the only participant in the commission of the underlying felony. The New York statute provides, as do similar statutes of nine other states, \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e an affirmative defense to the defendant when he:\n\n\"(a) Did not commit the homicidal act or in any way solicit, request, command, importune, cause or aid the commission thereof; and\n\n\"(b) Was not armed with a deadly weapon, or any instrument, article or substance readily capable of causing death or serious physical injury and of a sort not ordinarily carried in public places by law-abiding persons; and\n\n\"(c) Had no reasonable ground to believe that any other participant was armed with such a weapon, instrument, article or substance; and\n\n\"(d) Had no reasonable ground to believe that any other participant intended to engage in conduct likely to result in death or serious physical injury.\" \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nThe commentary to the New York statute states that the provision is premised \"upon the theory that the felony-murder doctrine, in its rigid automatic envelopment of all participants in the underlying felony, may be unduly harsh * * *\". \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e The comment acknowledges that there may be some cases where it would be \"just and desirable to allow a non-killer defendant of relatively minor culpability a chance of extricating himself from liability for murder, though not, of course, from liability for the underlying felony\". \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\n\nThe numerous modifications and restrictions placed upon the common-law felony-murder doctrine by courts and legislatures reflect dissatisfaction with the harshness and inJustice of the rule. Even though the felony-murder doctrine survives in this country, it bears increasingly less resemblance to the traditional felony-murder concept. To the extent that these modifications reduce the scope and significance of the common-law doctrine, they also call into question the continued existence of the doctrine itself.\n\nIV. The Requirement of Individual Culpability for Criminal Responsibility\n\n\"If one had to choose the most basic principle of the in general * * * it would be that criminal liability for causing a particular result is not justified in the absence of some culpable mental state in respect to that result * * *.\" \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\n\nThe most fundamental characteristic of the felony-murder rule violates this basic principle in that it punishes all homicides, committed in the perpetration or attempted perpetration of proscribed felonies whether intentional, unintentional or accidental, without the necessity of proving the relation between the homicide and the perpetrator's state of mind. This is most evident when a killing is done by one of a group of co-felons. The felony-murder rule completely ignores the concept of determination of guilt on the basis of individual misconduct. The felony-murder rule thus \"erodes the relation between criminal liability and moral culpability\". People v Washington, 62 Cal 2d 777; 44 Cal Rptr 442; 402 P2d 130 (1965).\n\nThe felony-murder rule's most egregious violation of basic rules of culpability occurs where felony murder is categorized as first-degree murder. All other murders carrying equal punishment require a showing of premeditation, deliberation and willfulness while felony murder only requires a showing of intent to do the underlying felony. Although the purpose of our degree statutes is to punish more severely the more culpable forms of murder, People v Garcia, 398 Mich 250, 258; 247 NW2d 547 (1976), an accidental killing occurring during the perpetration of a felony would be punished more severely than a second-degree murder requiring intent to kill, intent to cause great bodily harm, or wantonness and willfulness. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e Furthermore, a defendant charged with felony murder is permitted to raise defenses only to the mental element of the felony, thus precluding certain defenses available to a defendant charged with premeditated murder who may raise defenses to the mental element of murder (e.g., self-defense, accident). Certainly, felony murder is no more reprehensible than premeditated murder.\n\nLaFave \u0026 Scott explain the felony-murder doctrine's failure to account for a defendant's moral culpability as follows:\n\n\"The rationale of the doctrine is that one who commits a felony is a bad person with a bad state of mind, and he has caused a bad result, so that we should not worry too much about the fact that the fatal result he accomplished was quite different and a good deal worse than the bad result he intended. Yet it is a general principle of that one is not ordinarily criminally liable for bad results which differ greatly from intended results.\" \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\n\nTermed as a \"somewhat primitive rationale\" \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e it is deserving of the observation made by one commentator that \"the felony-murder doctrine gives rise to what can only be described as an emotional reaction, not one based on logical and abstract principles\". \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e\n\nAnother writer states:\n\n\"It is an excuse based on the rough moral notion that a man who intentionally commits a felony must have a wicked heart, and therefore 'ought to be punished' for the harm which he has done accidentally. It is to guard against this kind of reasoning that our modern rules of evidence exclude in most cases any communication to the jury of a prisoner's previous misdeeds.\" \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nThis Court has previously recognized this principle in a context analogous to the felony-murder situation:\n\n\"Every assault involves bodily harm. But any doctrine which would hold every assailant as a murderer where death follows his act, would be barbarous and unreasonable.\" Wellar v People, 30 Mich 16, 20 (1874).\n\nWhile it is understandable that little compassion may be felt for the criminal whose innocent victim dies, this does not justify ignoring the principles underlying our system of . As Professor Hall argues in his treatise on :\n\n\"The underlying rationale of the felony-murder doctrine -- that the offender has shown himself to be a 'bad actor,' and that this is enough to exclude the niceties bearing on the gravity of the harm actually committed -- might have been defensible in early law. The survival of the felony-murder doctrine is a tribute to the tenacity of legal conceptions rooted in simple moral attitudes. For as long ago as 1771, the doctrine was severely criticized by Eden [Baron Auckland], \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e who felt that it 'may be reconciled to the philosophy of slaves; but it is surely repugnant to that noble, and active confidence, which a free people ought to possess in the laws of their constitution, the rule of their actions.'\" \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e\n\nThe United States Supreme Court has reaffirmed on several occasions the importance of the relationship between culpability and criminal liability.\n\n\" * * * is concerned not only with guilt or innocence in the abstract but also with the degree of criminal culpability.\" Mullaney v Wilbur, 421 U.S. 684, 697-698; 95 S Ct 1881; 44 L Ed 2d 508 (1975).\n\n\"The contention that an injury can amount to a crime only when inflicted by intention is no provincial or transient notion. It is as universal and persistent in mature systems of law as belief in freedom of the human will and a consequent ability and duty of the normal individual to choose between good and evil. A relation between some mental element and punishment for a harmful act is almost as instinctive as the child's familiar exculpatory 'But I didn't mean to,' and has afforded the rational basis for a tardy and unfinished substitution of deterrence and reformation in place of retaliation and vengeance as the motivation for public prosecution.\" Morissette v United States, 342 U.S. 246, 250-251; 72 S Ct 240; 96 L Ed 288 (1952).\n\n\"Whether a death results in the course of a felony (thus giving rise to felony-murder liability) turns on fortuitous events that do not distinguish the intention or moral culpability of the defendants.\" Lockett v Ohio, 438 U.S. 586, 620; 98 S Ct 2954; 57 L Ed 2d 973 (1978) (Mr. Justice Marshall's Concurring opinion).\n\nThe failure of the felony-murder rule to consider the defendant's moral culpability is explained by examining the state of the law at the time of the rule's inception. The concept of culpability was not an element of homicide at early common law. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e The early definition of malice aforethought was vague. The concept meant little more than intentional wrongdoing with no other emphasis on intention except to exclude homicides that were committed by misadventure or in some otherwise pardonable manner. \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e Thus, under this early definition of malice aforethought, an intent to commit the felony would in itself constitute malice. Furthermore, as all felonies were punished alike, it made little difference whether the felon was hanged for the felony or for the death. \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e\n\nThus, the felony-murder rule did not broaden the concept of murder at the time of its origin because proof of the intention to commit a felony met the test of culpability based on the vague definition of malice aforethought governing at that time. Today, however, malice is a term of art. It does not include the nebulous definition of intentional wrongdoing. Thus, although the felony-murder rule did not broaden the definition of murder at early common law, it does so today. We find this enlargement of the scope of murder unacceptable, because it is based on a concept of culpability which is \"totally incongruous with the general principles of our jurisprudence\" \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e today.\n\nAs Professor Hall observed in his treatise on criminal; law:\n\n\"The modern tendency has been to oppose policy-formation such as that embodied in or extended from the felony-murder doctrine. It has insisted on a decent regard for the facts and on sanctions that represent fair evaluation of these facts and not of the supposed character of the offender. Most emphatically the progressive tendency has been to repudiate the imposition of severe penalties where bare chance results in an unsought harm.\" \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\n\nV. The Felony-Murder Doctrine in Michigan\n\nA. Murder and Malice Defined\n\nIn order to understand the operation of any state's felony-murder doctrine, initially it is essential to understand how that state defines murder and malice.\n\nIn Michigan, murder is not statutorily defined. This Court early defined the term as follows:\n\n\"Murder is where a person of sound memory and discretion unlawfully kills any reasonable creature in being, in the peace of the state, with malice prepense or aforethought, either express or implied.\" People v Potter, 5 Mich 1 (1858). See, also, People v Scott, 6 Mich 287, 292 (1859); Maher v People, 10 Mich 212, 218 (1862); People v Garcia, 398 Mich 250, 258; 247 NW2d 547 (1976).\n\nThus, malice aforethought is the \"grand criterion\" \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e which elevates a homicide, which may be innocent or criminal, \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e to murder. However, \" nature of malice aforethought is the source of much of the confusion that attends the law of homicide\". People v Morrin, 31 Mich App 301, 310-311; 187 NW2d 434 (1971), lv den 385 Mich 775 (1971). See, also, Moreland, Law of Homicide (Indianapolis: Bobbs-Merrill, 1952), pp 205-206. Overbroad and ill-considered instructions on malice have plagued appellate courts for decades. See, e.g., People v Morrin, supra; People v Borgetto, 99 Mich 336; 58 NW 328 (1894); Nye v People, 35 Mich 16 (1876).\n\nWe agree with the following analysis of murder and malice aforethought presented by LaFave \u0026 Scott:\n\n\"Though murder is frequently defined as the unlawful killing of another 'living human being' with 'malice aforethought', in modern times the latter phrase does not even approximate its literal meaning. Hence it is preferable not to rely upon that misleading expression for an understanding of murder but rather to consider the various types of murder (typed according to the mental element) which the common law came to recognize and which exist today in most jurisdictions:\n\n\"(1) intent-to-kill murder;\n\n\"(2) intent-to-do-serious-bodily-injury murder;\n\n\"(3) depraved-heart murder [wanton and willful disregard that the natural tendency of the defendant's behavior is to cause death or great bodily harm]; and\n\n\"(4) felony murder.\" \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e\n\nUnder the common law, which we refer to in defining murder in this state, each of the four types of murder noted above has its own mental element which independently satisfies the requirement of malice aforethought. \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e It is, therefore, not necessary for the law to imply or for the jury to infer the intention to kill once the finder of fact determines the existence of any of the other three mental states because each one, by itself, constitutes the element of malice aforethought. \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e\n\nOur focus in this opinion is upon the last category of murder, i.e., felony murder. We do not believe the felony-murder doctrine, as some courts and commentators would suggest, abolishes the requirement of malice, nor do we believe that it equates the mens rea of the felony with the mens rea required for a non-felony murder. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e We construe the felony-murder doctrine as providing a separate definition of malice, thereby establishing a fourth category of murder. The effect of the doctrine is to recognize the intent to commit the underlying felony, in itself, as a sufficient mens rea for murder. This analysis of the felony-murder doctrine is consistent with the historical development of the doctrine. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e\n\nThe question we address today is whether Michigan recognizes the felony-murder doctrine and, accordingly, the category of malice arising from the underlying felony. The relevant inquiry is first whether Michigan has a statutory felony-murder doctrine. If it does not, it must then be determined whether Michigan has or should have a common-law felony-murder doctrine.\n\nB. Statutory Felony Murder\n\nMichigan does not have a statutory felony-murder doctrine which designates as murder any death occurring in the course of a felony without regard to whether it was the result of accident, negligence, recklessness or willfulness. Rather, Michigan has a statute which makes a murder occurring in the course of one of the enumerated felonies a first-degree murder:\n\n\"Murder which is perpetrated by means of poison, lying in wait, or other wilful, deliberate, and premeditated killing, or which is committed in the perpetration, or attempt to perpetrate arson, criminal sexual conduct in the first or third degree, robbery, breaking and entering of a dwelling, larceny of any kind, extortion, or kidnapping, is murder of the first degree, and shall be punished by imprisonment for life.\" MCL 750.316; MSA 28.548.\n\nThe Michigan Legislature adopted verbatim the first-degree murder statute of Pennsylvania, the statute we have today. \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e In creating the statutes which divided murder into degrees, it was the intention of the Pennsylvania Legislature to reform the penal laws of that state by making punishment more proportionate to the crime and, in particular, to narrow the category of capital offenses. It was not its apparent intention to adopt by statute the common-law felony-murder rule. The provision covering murder in the course of the enumerated felonies was added when the bill creating the degree statutes was being debated on second reading by a motion on the floor. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e In Commonwealth ex rel Smith v Myers, supra, 224, the Pennsylvania Supreme Court stated:\n\n\"Clearly this statutory felony-murder rule merely serves to raise the degree of certain murders to first degree; it gives no aid to the determination of what constitutes murder in the first place.\"\n\nMichigan case law also makes it clear that the purpose of our first-degree murder statute is to graduate punishment and that the statute only serves to raise an already established murder to the first-degree level, not to transform a death, without more, into a murder.\n\n\"The statute does not undertake to define the crime of murder, but only to distinguish it into two degrees, for the purpose of graduating the punishment.\" People v Doe, 1 Mich 451, 457 (1850). See, also, People v Samuel Scott, supra, 293.\n\n\"It speaks of the offense as one already ascertained and defined, and divides it into degrees * * *.\" People v Potter, supra, 6 (emphasis added).\n\n\"Neither murder nor manslaughter is defined in our statutes. The [first-degree murder statute] simply classifies a murder perpetrated in a particular manner as murder in the first degree. It has no application until a murder has been established.\" People v Charles Austin, 221 Mich 635, 644; 192 NW 590 (1923) (emphasis added).\n\nExamples of decisions from other states which have murder statutes identical or similar to Michigan's first-degree murder statute in that they also use the term \"murder\" and which have concluded that the statute is merely a degree-raising device include the following: Commonwealth ex rel Smith v Myers, supra; Commonwealth v Exler, 243 Pa 155; 89 A 968 (1914); State v Millette, supra; Warren v State, 29 Md App 560, 565; 350 A2d 173, 178 (1976); Evans v State, 28 Md App 640; 349 A2d 300 (1975), aff'd 278 Md 197; 362 A2d 629 (1976); State v Galloway, supra; Grant v State, 60 Tex Crim 358; 132 SW 350 (1910); Pharr v State, 7 Tex Crim 472, 477 (1879); State v Shock, 68 Mo 552 (1878).\n\nIn Evans, the Court said:\n\n\"It is sometimes falsely asserted that [Md Code Ann, art 27,] ยงยง 408-410 constitute the felony-murder doctrine in Maryland. That is not true. The felony-murder doctrine * * * is the common law rule -- defining one of the at-least three varieties of implied malice -- which raises a homicide resulting from the perpetration or attempted perpetration of a felony to the murder level generally. It is only at that point, after the felony-murder rule has already operated, that ยงยง 408-410 come into play to provide further that in the case of certain designated felonies, the already established murder shall be punished as murder in the first degree.\" 28 Md App 640, 686, fn 23.\n\nGalloway is particularly noteworthy as it is a 1979 Iowa Supreme Court case concerning a question similar to the one involved here. \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e The defendant there requested that an instruction be given which would require the jury to find that he shot the victim with malice aforethought while attempting to perpetrate the crime of robbery. The trial court refused to give the instruction and the Supreme Court reversed. The Galloway court said:\n\n\"Under the rule at common law the instruction given by the trial court would have been correct. * * *\n\n\"But the Iowa statute differs from the common law and differs from the statutes of many other states. * * * The effect of the Iowa statute is to make murders which occur in connection with the perpetration of the named felonies first-degree murder. This has been our rule for many years. [Citation omitted.]\n\n\"Under this rule it was error for the trial court not to include the language requested. Malice aforethought is a necessary element for murder. [Iowa Code (1977)] ยง 690.1. And murder must be committed in order to implement our felony-murder rule.\" 275 NW2d 738.\n\nProfessor Perkins is in accord:\n\n\"Such a statute, let it be emphasized, makes no attempt to define murder. 'It has no application until a murder has been established.' If the homicide meets the requirements of murder in general, and is shown to have been committed in any of these ways, then the statute applies and makes the killing murder in the first degree. If the death would not otherwise be murder at all this statute does not make it first degree murder, because it speaks of all 'murder' so perpetrated -- not all 'homicide.'\" Perkins, (2d ed), p 90.\n\nThus, we conclude that Michigan has not codified the common-law felony-murder rule. The use of the term \"murder\" in the first-degree statute requires that a murder must first be established before the statute is applied to elevate the degree.\n\nC. Common-Law Felony Murder in Michigan\n\nThe prosecution argues that even if Michigan does not have a statutory codification of the felony-murder rule, the common-law definition of murder included a homicide in the course of a felony. \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e Thus, the argument continues, once a homicide in the course of a felony is proven, under the common-law felony-murder rule a murder has been established and the first-degree murder statute then becomes applicable. This Court has ruled that the term murder as used in the first-degree murder statute includes all types of murder at common law. People v Samuel Scott, supra, 292-293. Hence, we must determine whether Michigan in fact has a common-law felony-murder rule.\n\nOur research has uncovered no Michigan cases, nor do the parties refer us to any, which have expressly considered whether Michigan has or should continue to have a common-law felony-murder doctrine. While there are some cases containing language which may be construed as assuming the existence of such a rule in Michigan, \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e the language is clearly dictum as the question was neither at issue nor expressly considered. \"It 'is a well-settled principle that a point \"assumed without consideration is of course not decided\".'\" People v Allen, 39 Mich App 483, 499; 197 NW2d 874 (1972) (Levin, P.J., Dissenting), adopted 390 Mich 383; 212 NW2d 21 (1973).\n\nHowever, our finding that Michigan has never specifically adopted the doctrine which defines malice to include the intent to commit the underlying felony is not the end of our inquiry. In Michigan, the general rule is that the common law prevails except as abrogated by the Constitution, the Legislature or this Court. Const 1963, art 3, ยง 7. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\n\nThis Court has not been faced previously with a decision as to whether it should abolish the felony-murder doctrine. Thus, the common-law doctrine remains the law in Michigan. Moreover, the assumption by appellate decisions that the doctrine exists, combined with the fact that Michigan trial courts have applied the doctrine in numerous cases resulting in convictions of first-degree felony murder, requires us to address the common-law felony-murder issue. The cases before us today squarely present us with the opportunity to review the doctrine and to consider its continued existence in Michigan. Although there are no Michigan cases which specifically abrogate the felony-murder rule, there exists a number of decisions of this Court which have significantly restricted the doctrine in Michigan and which lead us to conclude that the rule should be abolished. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e\n\nThe first of these decisions is People v Pavlic, 227 Mich 562; 199 NW 373 (1924), cited by Perkins as the leading American decision regarding the types of felony included within the felony-murder rule. \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e In Pavlic, defendant was convicted of involuntary manslaughter as a result of selling moonshine whiskey to the deceased, the drinking of which, followed by exposure to the weather, resulted in his death. Defendant argued that he was not guilty of manslaughter because the selling of intoxicating liquor at that time was a felony and where death results from the commission of a felony, the homicide is murder and not manslaughter. The Pavlic Court said:\n\n\"Notwithstanding the fact that the statute has declared it to be a felony it is an act not in itself directly and naturally dangerous to life. So if one in the commission of such an act unintentionally causes the death of another, he is not guilty of murder, nor is he guilty of manslaughter unless he commits the act carelessly and in such a manner as manifests a reckless disregard of human life.\"\n\nPavlic's requirement that the act be \"in itself directly and naturally dangerous to life\" is a significant inroad into the felony-murder rule. It is not a large step from requiring such a degree of dangerousness to allowing a jury to infer intent to kill, intent to do great bodily harm or wanton and willful disregard from the nature of and circumstances surrounding a defendant's acts.\n\nThe next case relevant to our inquiry is People v Andrus, 331 Mich 535; 50 NW2d 310 (1951), involving an unarmed robbery in which the victim died as the result of a beating administered during the crime. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e The jury returned a verdict of manslaughter which the defendant contended was error because the proofs indicated murder in the first degree because the homicide was committed in the perpetration of a robbery. The Andrus Court, citing People v Treichel, 229 Mich 303; 200 NW 950 (1924), held that lesser included offenses were proper:\n\n\"Conceding that the verdict might have been guilty of murder in the first degree because committed in the perpetration of a burglary, the Court declined to hold that such verdict was the only one permissible. Attention was directed to testimony indicating that defendants did not make their attack on their victim with the intention of killing him, and did not anticipate that such result would follow. As in the case at bar, the proofs indicated a purpose to prevent interference with the contemplated search for money. Clearly, had defendants intended to kill Frank Cline they would not have resorted to tying his hands and feet with the clothesline which English had taken into the store. The record indicates that in charging the jury as stated the trial Judge followed the decision in the Treichel Case. In view of the analogous situation presented there, he was justified in doing so.\"\n\nWe have subsequently held that there are lesser included offenses in felony murder and that second-degree murder is a necessarily lesser included offense of first-degree murder. People v Andrew Carter, 395 Mich 434; 236 NW2d 500 (1975); \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e People v Jenkins, 395 Mich 440; 236 NW2d 503 (1975); People v Paul, 395 Mich 444; 236 NW2d 486 (1975). One obvious reason for this holding is that a jury is always entitled to disbelieve evidence of the felony so that the felony-murder rule would not come into play. However, the above-quoted language in Andrus illustrates that the Court primarily was concerned with lack of intent to kill. The practical effect of Andrus, while not specifically abolishing intent to commit a felony as a category of malice, is to allow the jury not to find malice even though they may find that the intent to commit a felony existed.\n\nIn People v William Austin, 370 Mich 12; 120 NW2d 766 (1963), this Court adopted the Pennsylvania Redline \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e limitation on the felony-murder rule. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e The Austin Court held that the killing of a felon by the intended robbery victim was a justifiable homicide and that the felony-murder rule would not be extended to hold the co-felons accountable for the death. In People v Jeffrey Carter, supra, 411, we spoke further of this limitation:\n\n\"Finally, to constitute murder, even though malice may be implied from felonious acts, the killing must be attributable to the accused. So, in People v Austin, 370 Mich 12 (1963), the killing of one of three robbers by the victim of the attempted robbery was held to be justifiable homicide. It was not a killing committed by the felons.\"\n\nPeople v Jeffrey Carter is also significant because there we held that when a non-enumerated felony is involved, the jury must be allowed to consider the nature of the felony:\n\n\"Both murder and manslaughter deal with the wrongful killing of another person. If there has been a killing during the commission of one of the felonies enumerated under first-degree murder, this establishes the degree. If the killing occurs during the commission of some other felony, malice may be implied but the nature of the felonious act must be considered. Many felonies are not inherently dangerous to human life. To hold that in all cases it is murder if a killing occurs in the commission of any felony would take from the jury the essential question of malice.\"\n\nThe effect of this decision is to greatly reduce the scope of Coke's unlawful act doctrine and Foster's \"any felony\" rule. Furthermore, we perceive no logical reason why cases involving the enumerated felonies should be treated differently than those involving non-enumerated felonies for the purpose of establishing malice. The enumerated felonies are not necessarily inherently dangerous to human life. Those which may be seen as inherently dangerous to human life when viewed in the abstract may not be so dangerous when viewed in light of the circumstances of a particular case. This is especially true in light of our Conclusion that Michigan's first-degree murder statute enumerates felonies solely for the purpose of elevating the degree of murder committed in the perpetration or attempted perpetration of those felonies. The statute nowhere indicates an intention to enumerate felonies for the purpose of defining malice.\n\nOur review of Michigan case law persuades us that we should abolish the rule which defines malice as the intent to commit the underlying felony. Abrogation of the felony-murder rule is not a drastic move in light of the significant restrictions this Court has already imposed. Further, it is a logical extension of our decisions as discussed above.\n\nWe believe that it is no longer acceptable to equate the intent to commit a felony with the intent to kill, intent to do great bodily harm, or wanton and willful disregard of the likelihood that the natural tendency of a person's behavior is to cause death or great bodily harm. In People v Hansen, 368 Mich 344, 350; 118 NW2d 422 (1962), this Court said that \" requires an intent to cause the very harm that results or some harm of the same general nature, or an act done in wanton or wilful disregard of the plain and strong likelihood that such harm will result\". In a charge of felony murder, it is the murder which is the harm which is being punished. A defendant who only intends to commit the felony does not intend to commit the harm that results and may or may not be guilty of perpetrating an act done in wanton or willful disregard of the plain and strong likelihood that such harm will result. Although the circumstances surrounding the commission of the felony may evidence a greater intent beyond the intent to commit the felony, or a wanton and willful act in disregard of the possible consequence of death or serious injury, the intent to commit the felony, of itself, does not connote a \"man-endangering-state-of-mind\". \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e Hence, we do not believe that it constitutes a sufficient mens rea to establish the crime of murder.\n\nAccordingly, we hold today that malice is the intention to kill, the intention to do great bodily harm, or the wanton and willful disregard of the likelihood that the natural tendency of defendant's behavior is to cause death or great bodily harm. We further hold that malice is an essential element of any murder, as that term is judicially defined, whether the murder occurs in the course of a felony or otherwise. The facts and circumstances involved in the perpetration of a felony may evidence an intent to kill, an intent to cause great bodily harm, or a wanton and willful disregard of the likelihood that the natural tendency of defendant's behavior is to cause death or great bodily harm; however, the Conclusion must be left to the jury to infer from all the evidence. Otherwise, \"juries might be required to find the fact of malice where they were satisfied from the whole evidence it did not exist\". Maher v People, supra. \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e\n\nVI. Practical Effect of Abrogation of the Common-Law Felony-Murder Doctrine\n\nFrom a practical standpoint, the abolition of the category of malice arising from the intent to commit the underlying felony should have little effect on the result of the majority of cases. In many cases where felony murder has been applied, the use of the doctrine was unnecessary because the other types of malice could have been inferred from the evidence. \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e\n\nAbrogation of this rule does not make irrelevant the fact that a death occurred in the course of a felony. A jury can properly infer malice from evidence that a defendant intentionally set in motion a force likely to cause death or great bodily harm. See, e.g., Guilty Plea Cases, 395 Mich 96, 131; 235 NW2d 132 (1975); People v Haack, 396 Mich 367, 375; 240 NW2d 704 (1976). Thus, whenever a killing occurs in the perpetration or attempted perpetration of an inherently dangerous felony, People v Pavlic, supra, in order to establish malice the jury may consider the \"nature of the underlying felony and the circumstances surrounding its commission\", People v Fountain, 71 Mich App 491, 506; 248 NW2d 589 (1976). If the jury concludes that malice existed, they can find murder and, if they determine that the murder occurred in the perpetration or attempted perpetration of one of the enumerated felonies, by statute the murder would become first-degree murder.\n\nThe difference is that the jury may not find malice from the intent to commit the underlying felony alone. The defendant will be permitted to assert any of the applicable defenses relating to mens rea which he would be allowed to assert if charged with premeditated murder. The latter result is reasonable in light of the fact that felony murder is certainly no more heinous than premeditated murder. The prosecution will still be able to prove first-degree murder without proof of premeditation when a homicide is committed with malice, as we have defined it, and the perpetration or attempted perpetration of an enumerated felony is established. Hence, our first-degree murder statute continues to elevate to first-degree murder a murder which is committed in the perpetration or attempted perpetration of one of the enumerated felonies.\n\nAs previously noted, in many circumstances the commission of a felony, particularly one involving violence or the use of force, will indicate an intention to kill, an intention to cause great bodily harm, or wanton or willful disregard of the likelihood that the natural tendency of defendant's behavior is to cause death or great bodily harm. Thus, the felony-murder rule is not necessary to establish mens rea in these cases.\n\nIn the past, the felony-murder rule has been employed where unforeseen or accidental deaths occur and where the state seeks to prove vicarious liability of co-felons. In situations involving the vicarious liability of co-felons, the individual liability of each felon must be shown. It is fundamentally unfair and in violation of basic principles of individual criminal culpability to hold one felon liable for the unforeseen and unagreed-to results of another felon. In cases where the felons are acting intentionally or recklessly in pursuit of a common plan, the felony-murder rule is unnecessary because liability may be established on agency principles. \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e\n\nFinally, in cases where the death was purely accidental, application of the felony-murder doctrine is unjust and should be precluded. The underlying felony, of course, will still be subject to punishment. The draftsmen of the Model Penal Code report that juries are not disposed to accept unfounded claims of accident in Ohio where all first-degree murder requires a purpose to kill. \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e\n\nThus, in the three situations in which the felony-murder doctrine typically has applied, the rule is either unnecessary or contrary to fundamental principles of our .\n\n\"It is submitted that this is one of the most persuasive arguments in favor of abolition of the doctrine: it is not necessary to the establishment of criminal liability in the majority of cases in which it has been applied, and its application to those cases in which death occurred wholly by accident -- i.e., without intent or likelihood of harm -- is contrary to the modern trend toward establishment of culpability as the basis of criminal liability.\" \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e\n\n\" is unsatisfactory and inelegant to have a rule of law which, whenever it is applied, is either unnecessary (as in the case where dangerous violence is knowingly used) or unjust (as in the case where the risk of death is not foreseen).\" \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e\n\nThe Pennsylvania Supreme Court has called the felony-murder rule \"nonessential\", \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e and the commentators to the Hawaii statute abolishing felony murder concluded that \" rule certainly is not an indispensable ingredient in a system of criminal Justice\". \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e The penal code of India has done away with felony murder and the doctrine \"is also unknown as such in continental Europe\". \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e England, the birthplace of the felony-murder doctrine, has been without the rule for over 20 years and \"its passing apparently has not been mourned\". \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e One writer suggests that the experience in England demonstrates that its demise would have little effect on the rate of convictions for murders occurring in the perpetration of felonies. \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\n\nWe are in full agreement with the following Conclusion of the Model Penal Code draftsmen:\n\n\"We are, in any case, entirely clear that it is indefensible to use the sanctions that the law employs to deal with murder, unless there is at least a finding that the actor's conduct manifested an extreme indifference to the value of human life. The fact that the actor was engaged in a crime of the kind that is included in the usual first degree felony-murder enumeration or was an accomplice in such crime will frequently justify such a finding. * * * But liability depends, as we believe it should, upon the crucial finding. The result may not differ often under such a formulation from that which would be reached under the present rule. But what is more important is that a conviction on this basis rests upon sound ground.\" \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e\n\nVII. Conclusion\n\nWhatever reasons can be gleaned from the dubious origin of the felony-murder rule to explain its existence, those reasons no longer exist today. Indeed, most states, including our own, have recognized the harshness and inequity of the rule as is evidenced by the numerous restrictions placed on it. The felony-murder doctrine is unnecessary and in many cases unjust in that it violates the basic premise of individual moral culpability upon which our is based.\n\nWe conclude that Michigan has no statutory felony-murder rule which allows the mental element of murder to be satisfied by proof of the intention to commit the underlying felony. Today we exercise our role in the development of the common law by abrogating the common-law felony-murder rule. We hold that in order to convict a defendant of murder, as that term is defined by Michigan case law, it must be shown that he acted with intent to kill or to inflict great bodily harm or with a wanton and willful disregard of the likelihood that the natural tendency of his behavior is to cause death or great bodily harm. We further hold that the issue of malice must always be submitted to the jury.\n\nThe first-degree murder statute will continue to operate in that all murder committed in the perpetration or attempted perpetration of the enumerated felonies will be elevated to first-degree murder.\n\nThis decision shall apply to all trials in progress and those occurring after the date of this opinion.\n\nIn Aaron, the judgment of conviction of second-degree murder is reversed and this case is remanded to the trial court for a new trial. In Thompson and in Wright, the decisions of the Court of Appeals are affirmed and both cases are remanded to the trial court for new trial.\n\n[EDITOR'S NOTE: The page numbers of this document may appear to be out of sequence; however, this pagination accurately reflects the pagination of the original published document.]\n\nWilliams, J. (concurring in part).\n\nI concur in the result reached by my brothers Fitzgerald and Ryan. I agree with my brother Fitzgerald's and my brother Ryan's opinions as to their definitions of murder and as to definitions of malice in People v Morrin, 31 Mich App 301, 310-311; 187 NW2d 434 (1971).\n\nIn my opinion, it is the language of the statute that determines whether there need be proof of malice in a so-called felony-murder case. MCL 750.316; MSA 28.548, until its amendment this year, read as follows:\n\n\" All murder which shall be perpetrated by means of poison, or lying in wait, or any other kind of wilful, deliberate and premeditated killing, or which shall be committed in the perpetration, or attempt to perpetrate any arson, rape, robbery, burglary, larceny of any kind, extortion or kidnapping, shall be murder of the first degree * * *.\" (Emphasis supplied.)\n\nWhat is critical in the statutory language is that the section begins \"All murder which\" and ends \"shall be murder of the first degree\". In other words, what becomes murder of the first degree is not any homicide which is in connection with a poisoning, for example, or certain named felonies but a murder which is in connection with a poisoning or certain named felonies. The proof of malice is not essential to all forms of homicide, but it is essential to all forms of murder. Maher v People, 10 Mich 212, 218 (1862). Hence, proof of a so-called felony murder under MCL 750.316 requires proof of malice as does any other murder.\n\nI concur in Justice Fitzgerald's rule of retrospectivity.\n\n[EDITOR'S NOTE: The page numbers of this document may appear to be out of sequence; however, this pagination accurately reflects the pagination of the original published document.]\n\nRyan, J. (concurring in part, Dissenting in part).\n\nI concur in the results reached by Justice Fitzgerald in these cases but write separately to express my disagreement with the reasoning employed in his opinion.\n\nI\n\nIn Thompson \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and Wright, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e we granted leave to appeal limited to the following issue:\n\n\"Whether the Court of Appeals erred in reversing the murder conviction in this case because of the lack of an instruction on a requirement for finding malice in a felony-murder situation.\"\n\nIn Aaron, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e leave was granted limited to this issue:\n\n\"Whether, in light of MCL 750.316 and 750.317; MSA 28.548 and 28.549, a defendant charged with felony murder may be convicted of second-degree murder as a lesser included offense if proof of malice is unnecessary to conviction of felony murder yet is necessary to conviction of second-degree murder.\"\n\nProper resolution of the stated issues requires us to determine what the terms \"murder\" and \"malice\" mean in our jurisprudence, and to determine what the common-law felony-murder rule is, and how it operates.\n\nII\n\nA. Murder\n\nI agree with the definition of murder which appears in Justice Fitzgerald's opinion and repeat it here for the reader's convenience:\n\n\"'Murder is where a person of sound memory and discretion unlawfully kills any reasonable creature in being, in the peace of the state, with malice prepense or aforethought, either express or implied.' People v Potter, 5 Mich 1 (1858). See, also, People v Samuel Scott, 6 Mich 287, 292 (1859); Maher v People, 10 Mich 212, 218 (1862); People v Garcia, 398 Mich 250, 258; 247 NW2d 547 (1976).\"\n\nThe common-law offense of murder, which is incorporated into our murder statutes, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e includes at a minimum two essential or ultimate factual elements: (1) a homicide, (2) committed with malice, express or implied. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Maher v People, 10 Mich 212, 217-218 (1862); People v Austin, 221 Mich 635, 644; 192 NW 590 (1923); People v Morrin, 31 Mich App 301, 310; 187 NW2d 434 (1971); People v Fountain, 71 Mich App 491, 499; 248 NW2d 589 (1976).\n\nIn am also in agreement with Justice Fitzgerald that our murder statutes operate not to define murder, but rather to declare differing penalties for the different statutory degrees of murder as defined at common law:\n\n\"'The statute does not undertake to define the crime of murder, but only to distinguish it into two degrees, for the purpose of graduating the punishment.' People v Doe, 1 Mich 451, 457 (1850). See, also, People v Samuel Scott, supra, 293.\n\n\"'It speaks of the offense as one already ascertained and defined, and divides it into degrees * * *.' People v Potter, supra, 6 (emphasis added).\n\n\"'Neither murder nor manslaughter is defined in our statutes. The [first-degree murder statute] simply classifies a murder perpetrated in a particular manner as murder in the first degree. It has no application until a murder has been established.' People v Charles Austin, 221 Mich 635, 644; 192 NW 590 (1923) (emphasis added).\" See ante, Justice Fitzgerald's opinion, p 719.\n\nThus it is clear that under Michigan law the substantive offense of murder, that is, a homicide with malice, express or implied, must be proven before the punishment-grading statutory provisions come into operation. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nB. Malice\n\nI also agree with the definition of malice which is contained in Justice, then Judge, Levin's opinion in People v Morrin, supra, 31 Mich App 310-311:\n\n\"A person who kills another is guilty of the crime of murder if the homicide is committed with malice aforethought. Malice aforethought is the intention to kill, actual or implied, under circumstances which do not constitute excuse or justification or mitigate the degree of the offense to manslaughter. The intent to kill may be implied where the actor actually intends to inflict great bodily harm or the natural tendency of his behavior is to cause death or great bodily harm.\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e (Footnotes omitted.)\n\nOur jurisprudence contains no common-law definition \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e of malice as the intent to commit an inherently dangerous felony. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nC. The Felony-Murder Rule\n\nIn Morrin, directly following the definition of malice, Justice, then Judge, Levin noted parenthetically that \" common-law felony-murder rule is an example of implied intent or implied malice aforethought\". This parenthetical language suggests that the felony-murder rule is a method of proof which establishes a \"conclusive implication\", \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e or an \"imputation (as a matter of law)\", \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e or a \"conclusive presumption\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e of the implied intent to kill out of factual proof of an intent to commit a felony.\n\nUnder the felony-murder rule, as it is generally understood then, evidence establishing the intent to commit a felony, by operation of law irrebuttably satisfies the prosecution's burden of proving the necessary factual element of the intent to kill. Stated otherwise, upon proof of the intent to commit a felony, the felony-murder rule operates to relieve the prosecution of its burden of proving at all, much less beyond a reasonable doubt, the factual element of malice; that is, the intent to kill, the intent to inflict great bodily harm, or wanton and willful disregard of the likelihood that the natural tendency of one's behavior is to cause death or great bodily harm.\n\nThe result then is that under the felony-murder rule the defendant's state of mind with respect to the killing is irrelevant. The only mens rea involved pertains solely to the underlying felony. Because malice, correctly understood, is a characterization of a particular state of mind with respect to a killing, it follows that the common-law offense of felony murder does not require malice. Yet, historically, acceptance of this reality has, in general, been resisted by many courts and commentators who insist, erroneously in my view, that felony murder requires malice. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Their theory begins with the proposition that felony murder, like all murder, requires malice and ends with the proposition that malice is imputed, as a matter of law, from the intent to commit the underlying felony. This is a useless fiction at best. The offense of felony murder requires only (1) the commission or attempt to commit a felony and (2) a killing causally connected with the commission or attempt.\n\nSurvival of the fiction that felony murder requires malice but that malice is imputed is undoubtedly attributable to unreasoned allegiance to the axiom that murder requires malice, express or implied. Because malice is the sine qua non of murder, courts, when confronted with the crime of felony murder which does not require malice, have resorted to conceptualizing felony murder in a way that professes obedience to the \"murder requires malice\" commandment. As a result, a fourth type of mental state has been created by some courts and commentators and included under the heading of malice, so that malice is said to include:\n\n1) An intent to kill;\n\n2) An intent to inflict great bodily harm;\n\n3) Wanton and willful disregard of the likelihood that the natural tendency of one's behavior is to cause death or great bodily harm; and\n\n4) An intent to perpetrate a (dangerous) felony. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Thus, with disingenuously circular reasoning, obeisance is mistakenly paid to the axiom that murder requires malice by including within the definition of malice a case in which it is not an element. The price paid is continuing confusion in the law of homicide. Consequently, I disagree with the following statement by my brother Fitzgerald: \"We construe the felony-murder doctrine as providing a separate definition of malice * * *.\" Malice has nothing to do with common-law felony murder; it is not an element of the crime, and is not properly considered by the jury. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Except for its name, felony murder bears little if any resemblance to the offense of murder. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e It is a mistaken analysis, therefore, that permits one to deem the intent to commit a felony a kind of malice, and felony murder a kind of common-law murder.\n\nIII\n\nPerhaps for reasons relating to a failure to fully grasp the nature of the relationship between felony murder and murder, felony murder has led a dubious and enigmatic existence in the jurisprudence of this state. I fully agree with Justice Fitzgerald's observation that this Court has \"never specifically adopted\" the common-law crime of felony murder, nor ever \"expressly considered whether Michigan has or should continue to have a common-law felony-murder doctrine\". \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Although there is language in Michigan Reports that ostensibly adverts to felony murder, \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e the Discussion is invariably superficial, tangential, opaque, and, as my brother Fitzgerald notes, almost always \"clearly dictum\". \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e As a result, the very existence of felony murder in Michigan has been ardently disputed by our Court of Appeals, in which there now exists a sharp split of authority represented on one side by Fountain \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e and on the other side by Till. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Inasmuch as resolution of the divergent views is made unnecessary by our holding today, I offer no intimation as to which view is \"correct\". It is sufficient to state only that if felony murder existed in Michigan, by virtue of today's decision it no longer does.\n\nIV\n\nThat we differ greatly in how we understand the concept of felony murder and its relationship to murder should not obscure the fact that Justice Fitzgerald and I are in agreement on the principal issue: the merits of the felony-murder rule.\n\nPart IV of his opinion correctly outlines, in my view, the injudicious and unprincipled premises on which the common-law doctrine of felony murder rests. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The basic infirmity of felony murder lies in its failure to correlate, to any degree, criminal liability with moral culpability. It permits one to be punished for a killing, usually with the most severe penalty in the law, without requiring proof of any mental state with respect to the killing. This incongruity is simply more than we are willing to permit our criminal jurisprudence to bear.\n\nFor these reasons I concur in today's holding and the Disposition of these consolidated cases.\n\nV\n\nThe effect of this decision is not, as my brother suggests, to redefine malice or murder. Those terms will mean what they have always meant in this state: murder is a killing accompanied by malice; malice is the intent to kill, the intent to inflict great bodily harm, or wanton and willful disregard of the likelihood that the natural tendency of one's behavior is to cause death or great bodily harm. Moreover, malice is and always has been a question of fact for the trier of fact \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and, as all questions of fact, may be established by direct evidence, circumstantial evidence, \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e or both. These principles are unaffected by this case.\n\nToday we simply declare that the offense popularly known as felony murder, which, properly understood, has nothing to do with malice and is not a species of common-law murder, shall no longer exist in Michigan, if indeed it ever did.\n\n\u003cspan class=\"fn\"\u003e1. Compare People v Fountain, 71 Mich App 491; 248 NW2d 589 (1976); People v Martin, 75 Mich App 6; 254 NW2d 628 (1977); People v Wright, 80 Mich App 172; 262 NW2d 917 (1977); People v Robert G Thompson, 81 Mich App 348; 265 NW2d 632 (1978); People v Hansma, 84 Mich App 138; 269 NW2d 504 (1978); People v Wilson, 84 Mich App 636; 270 NW2d 473 (1978); People v Langston, 86 Mich App 656; 273 NW2d 99 (1978); People v Dietrich, 87 Mich App 116; 274 NW2d 472 (1978); People v Derrick Smith, 87 Mich App 584; 274 NW2d 844 (1978); People v Hines, 88 Mich App 148; 276 NW2d 550 (1979), with People v Till, 80 Mich App 16; 263 NW2d 586 (1977); People v Wilder, 82 Mich App 358; 266 NW2d 847 (1978); People v Butts, 85 Mich App 435; 271 NW2d 265 (1978); People v Lovett, 85 Mich App 534; 272 NW2d 126 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. MCL 750.316; MSA 28.548.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. \"In other words, if you believe the evidence beyond a reasonable doubt, that the defendant, Robert Thompson, killed the decedent, Mary Emma Hendry, that at the time of such homicide the said defendant was perpetrating or attempting to perpetrate said assault upon the deceased, Mary Emma Hendry, with intent to rob, then it is not necessary for the state to prove a premeditated design or intent. And you should find the defendant, Mr. Thompson, guilty of murder in the first degree, under count two of the information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Now, what I'm saying, members of the jury, is that then there may be with the intent to commit a robbery but without the intent of injuring anyone. If in this frame of mind he enters a place, and in committing or attempting to commit the robbery he kills a person, that killing would be murder under the law even though there was no ill will, hatred or malevolence toward the person killed. Because the evil intent to commit the robbery carries over to make that crime murder in the first degree under the law in this state.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. People v Robert G Thompson, supra, 350.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"Defendant is charged with a crime of murder in the first degree. The law insofar as it applies to the case states that all murder which shall be committed during and as a result of the committing or attempting to commit arson shall be murder in the first degree. The defendant pleads not guilty to this charge. To establish this charge the people must prove each of the following elements beyond a reasonable doubt: first, that Joe Thomas and Odel Barnes died on or about October 3rd, 1975; second, that the death was caused by the defendant or that occurred as the direct result of the commission of the crime of arson, that is that Joe Thomas and Odel Barnes died as the result of an arson of the dwelling at 420 South Washington, Ypsilanti, Michigan; third, that at the time of the burning which caused the death of Joe Thomas and Odel Barnes the defendant consciously intended to commit the crime of arson; fourth, that at the time of the burning which caused the death of Joe Thomas and Odel Barnes the defendant was committing the crime of arson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"For murder of the first degree there must be proof beyond a reasonable doubt that the killing occurred as a result of the crime of arson and that the defendant was at the time engaged in committing, or attempting to commit, or was aiding another in the commission of that crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. People v Wright, supra, 179.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. People v Aaron, 63 Mich App 230; 234 NW2d 462 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. 396 Mich 843 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. 402 Mich 938 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. 403 Mich 821 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Moreland, Kentucky Homicide Law With Recommendations, 51 Ky L J 59, 82 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See, e.g., Crum, Causal Relations and the Felony-Murder Rule, 1952 Wash U L Quarterly 191; Morris, The Felon's Responsibility for the Lethal Acts of Others, 105 U of Pa L Rev 50, 58 (1956). Note, Recent Extensions of Felony Murder Rule, 31 Ind L J 534, fn 3 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. \" Le Seignor Dacres \u0026 auters accord de enter en un pke \u0026 de hunter la, \u0026 de tuer touts que eux resisteront : \u0026 accordant al ceo ils entront en le Park, \u0026 un vient al un de eux, Et demand, que il avoit de faire la; \u0026 l'auter luy occide, le seignor esteant un quarter dun mile de cest leiu, \u0026 rien scavoit de ceo: uncore ceo fuit adJudge murder en luy, \u0026 en touts ses companions. Et auxi un auter vient en un Orchard, pur gatherer pears \u0026 un a luy vient \u0026 rebuke luy, \u0026 il luy tua, le quel fuit adJudge murder.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Kaye, The Early History of Murder and Manslaughter, Part II, 83 L Quarterly Rev 569, 578-579, 593 (1967); see, also, King v Borthwick, 1 Doug 207, 212; 99 Eng Rep 136, 138-139 (KB, 1779).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Note, Felony Murder as a First Degree Offense: An Anachronism Retained, 66 Yale L J 427, 430, fn 23 (1957) (hereinafter cited as Anachronism Retained) ; Recent Developments, : Felony-Murder Rule -- Felon's Responsibility for Death of Accomplice, 65 Colum L Rev 1496, fn 2 (1965) (hereinafter cited as Felon's Responsibility).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Anachronism Retained, fn 15 (supra) , p 431, fn 23; Recent Cases, -- Homicide, 59 Dickinson L Rev 183, 185 (1955); Recent Decisions, -- Murder -- Felony Murder Rule, 9 Duquesne L Rev 122, 123 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Taken from the syllabus of Dyer. 2 Dyer's Reports, translated by John Vaillant (1794). Further evidence of the defendants' intentions is supplied by the following excerpt from Herbert's case: \"And the party who came to take the goods proclaimed, and said (before his coming) ' that he would make him a Cokes who kept the goods ;' and said also, ' that he would make him to know the basest in his house.'\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Kaye, fn 14 (supra) , 578.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Id., pp 581, 589.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. 2 Mich Criminal Jury Instructions (Ann Arbor: Institute of Continuing Legal Education), Felony-Murder Commentary, pp 16-107 -- 16-109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Kaye, fn 14 (supra) , p 593. The holding in Dacres ' case regarding constructive presence was discussed in Herbert's case. However, Brooke, one of the Judges in Herbert's case, was later to misconstrue the holding in Dacres ' case, forgetting that it was not the unlawful hunt which made the killing murder in Dacres ' case, rather it was the agreement to kill beforehand and the theory of constructive presence which combined to require the convictions of murder for Lord Dacres and his companions. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Coke, Third Institutes (1797), p 56.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. 2 Torcia, Wharton's (14th ed), ยง 145, p 204; Hurst, -- The Felony-Murder Doctrine Repudiated, 36 Ky L J 106 (1947); Moesel, A Survey of Felony Murder, 28 Temple L Quarterly 453 (1955); 3 Stephen, Sir James Fitzjames, A History of the of England (London: MacMillan, 1883), p 57; Constructive Murder, 65 The Law Times 291 (1878) (hereinafter cited as Constructive Murder) ; 7A Hawaii Rev Stat, ยง 707-701, Commentary, p 345.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Professors Moreland and Perkins also give explanations for the origin of the felony-murder rule. Moreland sees the felony-murder rule as an extension of the doctrine of malice aforethought. For this proposition he cites Lambard, who states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'And therefore if a thief do kill a man whom he never saw before and whom he intended to rob only, it is murder in the judgment of law, which implyeth a former malicious Disposition in him rather to kill the man than not to have his money from him.'\" 3 Stephen, fn 23 (supra) , pp 50-51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreland observes that this was an attempt to justify the rule as an inference of fact in order to satisfy the definition of malice aforethought prevailing at that time. But, in Moreland's opinion, it does not carry conviction as such. Moreland, Law of Homicide (Indianapolis: Bobbs-Merrill, 1952), p 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eStephen, commenting on the above passage from Lambard, states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The law can hardly be justified in 'presupposing' that a thief 'carryeth that malicious mind that he will achieve his purpose though it be with the death of him against whom it is directed,' from the fact that he trips a man up in order to rob him and happens to kill him.\" 3 Stephen, fn 23 (supra) , p 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePerkins contends that the primary purpose of the felony-murder rule was to deal with homicides committed during unsuccessful attempted felonies. An attempt to commit a felony was only a misdemeanor at common law. The felony-murder rule placed the defendant in the position he would have been in had the felony been successful without the homicide, for in either case it would be a capital crime. Perkins, (2d ed), p 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Felon's Responsibility, fn 15, (supra) , p 1496, fn 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. 2 Bracton, De Legibus Angliae (1879), p 277. One commentator questions whether this statement actually represents the law as it existed in Bracton's time. He also notes that the examples mentioned by Bracton are distinguished by willful action in the face of manifest danger to human safety. Wilner, Unintentional Homicide in the Commission of an Unlawful Act, 87 U of Pa L Rev 811 (1939).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 3 Stephen, fn 23 (supra) , p 57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Id., p 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Constructive Murder, fn 23 (supra) , p 292.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. 3 Stephen, fn 23 (supra) , p 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. \"The first is the passage in Bracton already observed upon, in which Bracton says, that if a man unintentionally kills another in doing an unlawful act, 'hoc imputatur ei.' He does not say that such an act amounted to murder, and it would not fall under the definition of murder which he gives, nor does he say that such an offence was in his day punishable with death. As I have already said, he says that the punishment of homicide in his day was various (poena homicidii commissi facto variatur). As to the punishment given in this particular class of cases he is silent. The rest of Coke's authorities are three passages from the Year-books. The first is found not in the Year-books themselves but in FitzHerbert, Corone, 354, and is from the iter of Northampton in the third Edward III. This entry says that a jury found that a man killed a child by misadventure, having thrown a stone which fell on the child, whereupon the Justices remanded him to wait for the king's pardon, and refused to let him out of prison on mainprise, but directed the sheriff to treat him humanely. This has obviously nothing to do with the matter. The first case referred to in the Year-books is 2 Hen 4, 18. The only case I can find to which this can possibly refer is No. 6 in 2 Hen 4, p 18, which is a well-known authority as to the liability of a man whose fire burns the goods of another. In the course of the argument Thyrning says that if a man kills another by misadventure the slayer forfeits his goods and must get his pardon. The Year-book of 11 Hen 7, p 23a, which is the other authority cited, says that if two men fight with sword and buckler by consent and one kills the other it is felony, unless they fight by the king's command; also that it is felony to kill a man by beating him, though without the intention of killing him. This, no doubt, says that to kill a man by an illegal act of personal violence is felony, though the act is not intended to kill, and it may be that the word 'felony' means murder and not manslaughter, as the last remark seems to refer to instances of premeditated violence; but be this as it may, it is a long way from the proposition for which Coke cites it.\" Id., pp 57-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. 6 Hobbes, English Works (1840), Dialogue of the Common Laws, pp 86, 87, as quoted in Moesel, fn 23 (supra) , p 453, fn 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. By a practice known as \"benefit of clergy\" a defendant could avoid the death penalty. At early law, members of the clergy could be tried only by an ecclesiastical court. The test for determining entitlement to the benefit was the ability to read. The effect of the benefit was to shield from the death penalty those who qualified for its protection since a court of the Church could not pronounce a judgment of blood. However, a series of statutes in the late Fifteenth and early Sixteenth Centuries removed the more culpable homicides from the protection of the benefit of clergy. 12 Hen 7, c 7 (1496); 4 Hen 8, c 2 (1512); 23 Hen 8, c 1, ยงยง 3, 4 (1531); 1 Edw 6, c 12, ยง 10 (1547). Anachronism Retained, fn 15 (supra) , pp 428-429; Perkins, A Re-examination of Malice Aforethought, 43 Yale L J 537, 542-543 (1934); Moesel, fn 23, (supra) , p 455.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Commonwealth v Redline, 391 Pa 486, 494; 137 A2d 472, 476 (1958). Accord, Powers v Commonwealth, 110 Ky 386, 414; 61 SW 735, 741 (1901); Perkins, fn 24 (supra) , p 44; 2 Torcia, fn 23 (supra) , ยง 147, p 212; 3 Stephen, fn 23 (supra) , pp 75-76; LaFave \u0026 Scott, , p 546, fn 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. 3 Stephen, fn 23 (supra) , pp 75-76; Perkins, fn 24 (supra) , p 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. 1 Hale, Pleas of the Crown, p 465. See also Perkins, fn 24 (supra) , p 38; Moreland, fn 24 (supra) , p 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. 3 Stephen, fn 23 (supra) , p 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See, also, Wilner, fn 26 (supra) , p 812; 3 Stephen, fn 23 (supra) , p 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Foster, Crown Law (2d ed, 1791), p 258. See also 3 Stephen, fn 23 (supra) , p 75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. 1 Hawkins, Pleas of the Crown (8th ed, 1824), p 86; 4 Blackstone, Commentaries (Hammond ed, 1898), pp 192, 200-201; 1 East, Pleas of the Crown (1803), pp 255-260. See also Moreland, fn 24 (supra) , p 42; Moesel, fn 23 (supra) , p 453; Perkins, fn 33 (supra) , p 559.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. In Greenwood, defendant was charged with murder and rape of a child under ten. The trial Judge instructed the jury that if they found that the prisoner had intercourse with the victim and she died from its effects, then that act being a felony, this would in itself be such malice as to justify them in returning a verdict of murder. The jury retired, but returned and told the Judge that they were satisfied that the defendant had raped her and that her death resulted therefrom, but they were not agreed on finding defendant guilty of murder. The trial Judge told them that under these circumstances, they could ignore the doctrine of constructive malice if they saw fit and find the defendant guilty of manslaughter, which they did.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Horsey, defendant was charged with murder in connection with wilfully setting fire to a stack of straw. The fire had spread to a barn and burned to death a man, possibly a tramp, who, unknown to defendant, was inside the barn. The defendant had already been convicted of the arson. The trial Judge instructed the jury that where a defendant in the course of committing a felony caused the death of a human being, that was murder even though he did not intend it. And though it may appear unreasonable, it was the law and it was their duty to act upon it. However, obviously disliking the rule, the Judge instructed the jury that if they found that the victim came in after defendant set fire to the stack of straw, that the victim's own act intervened between the death and the act of defendant. Thus his death could not be the natural and probable consequence of defendant's act. Seizing upon this \"preposterous loophole\" (Moreland, fn 24 (supra) , p 43), the jury found defendant not guilty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Preveser, The English Homicide Act: A New Attempt to Revise the Law of Murder, 57 Colum L Rev 624, 635 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Hawaii, Kentucky and Ohio.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Perkins, fn 24 (supra) , p 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Model Penal Code (Tentative Draft No 9, 1959), ยง 201.2, Comment 4, p 37. See also Perkins, fn 24 (supra) , p 43; 2 Torcia, fn 23 (supra) , ยง 147, pp 212-214; LaFave \u0026 Scott, fn 34 (supra) , pp 547-558; Michael \u0026 Wechsler, and Its Administration (Chicago: Foundation Press, 1940), pp 213-218; Adlerstein, Felony-Murder in the New Criminal Codes, 4 American Journal of 249 (1976); Ludwig, Foreseeable Death in Felony Murder, 18 U of Pittsburgh L Rev 51 (1956); Seibold, The Felony-Murder Rule: In Search of a Viable Doctrine, 23 Catholic Lawyer 133 (1978); State v Harrison, 90 NM 439, 441; 564 P2d 1321, 1323 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Model Penal Code creates a rebuttable presumption of recklessness manifesting extreme indifference to the value of human life if the actor was engaged in the commission, attempted commission or flight after commission of robbery, rape by force or intimidation, arson, burglary, kidnaping or felonious escape. The draftsmen of the code would have liked to have followed the British example by dispensing with felony murder but \"such a course was thought to be impolitic\". Wechsler, Codification of in the United States: The Model Penal Code, 68 Colum L Rev 1425, 1446-1447 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See, e.g., People v Pavlic, 227 Mich 562; 199 NW 373 (1924); Commonwealth v Bowden, 456 Pa 278; 309 A2d 714 (1973); Jenkins v State, 230 A2d 262 (Del, 1967), aff'd 395 U.S. 213; 89 S Ct 1677; 23 L Ed 2d 253 (1969); State v Moffitt, 199 Kan 514; 431 P2d 879 (1967); People v Washington, 62 Cal 2d 777; 44 Cal Rptr 442; 402 P2d 130 (1965); People v Phillips, 64 Cal 2d 574; 51 Cal Rptr 225; 414 P2d 353 (1966); People v Goldvarg, 346 Ill 398; 178 NE 892 (1931); State v Thompson, 280 NC 202; 185 SE2d 666 (1972); People v Jeffrey Carter, 387 Mich 397; 197 NW2d 57 (1972); Pliemling v State, 46 Wis 516; 1 NW 278 (1879); People v Golson, 32 Ill 2d 398; 207 NE2d 68 (1965); Wade v State, 581 P2d 914 (Okla Crim App, 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn determining whether a particular felony is \"inherently dangerous\", California courts look to the elements of the felony in the abstract and not to the specific factual circumstances. Other courts consider both the nature of the felony and the individual factual circumstances. See Adlerstein, fn 47 (supra) , pp 252-253 and citations therein. See also Anno: What felonies are inherently or foreseeably dangerous to human life for purposes of felony-murder doctrine, 50 ALR3d 397.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See, e.g., People v Louis Scott, 29 Mich App 549; 185 NW2d 576 (1971); Wade v State, fn 48 (supra) ; State v Mauldin, 215 Kan 956, 958; 529 P2d 124, 126 (1974); State v Glover, 330 Mo 709; 50 SW2d 1049 (1932); State v Diebold, 152 Wash 68; 277 P 394 (1929); People v Treichel, 229 Mich 303; 200 NW 950 (1924); Jenkins v State, fn 48 (supra) ; State v Moffitt, fn 48 (supra) ; Pliemling v State, fn 48 (supra) ; State v Leopold, 110 Conn 55; 147 A 118 (1929); Powers v Commonwealth, fn 34 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See, e.g., Commonwealth v Redline, fn 34 (supra) ; Jackson v State, 92 NM 461; 589 P2d 1052 (1979); People v Jeffrey Carter, fn 48 (supra) ; People v William Austin, 370 Mich 12; 120 NW2d 766 (1963); People v Washington, fn 48 (supra) ; Commonwealth ex rel Smith v Myers, 438 Pa 218; 261 A2d 550 (1970); Commonwealth v Campbell, 89 Mass (7 Allen) 541; 83 Am Dec 705 (1863); People v Wood, 8 NY2d 48; 167 NE2d 736 (1960); Sheriff v Hicks, 89 Nev 78; 506 P2d 766 (1973); State v Canola, 73 NJ 206; 374 A2d 20 (1977); People v Morris, 1 Ill 3d 566; 274 NE2d 898 (1971); Morris, fn 12 (supra) , pp 69-74; Crum, fn 12 (supra) . See also Anno: Criminal liability where act of killing is done by one resisting felony or other unlawful act committed by defendant, 56 ALR3d 239.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See, e.g., People v Samuel Scott, 6 Mich 287 (1859); People v Pavlic, fn 48 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. See, e.g., Commonwealth v Exler, 243 Pa 155; 89 A 968 (1914); State v Burrell, 120 NJL 277; 199 A 18 (1938).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. See, e.g., People v Archie Smith, 55 Mich App 184; 222 NW2d 172 (1974), aff'd in part 396 Mich 825 (1976); State v Diebold, fn 49 (supra) ; People v Huter, 184 NY 237; 77 NE 6 (1906); People v Walsh, 262 NY 140; 186 NE 422 (1933); Huggins v State, 149 Miss 280; 115 So 213 (1928); State v Taylor, 173 La 1010; 139 So 463 (1931); State v Montgomery, 191 Neb 470; 215 NW2d 881 (1974); State v Golladay, 78 Wash 2d 121; 470 P2d 191 (1970), overruled on other grounds State v Arndt, 87 Wash 2d 374; 553 P2d 1328 (1976); People v Joyner, 32 App Div 2d 260; 301 NYS2d 215 (1969), rev'd 26 NY2d 106; 257 NE2d 26; 308 NYS2d 840 (1970); State v Opher, 38 Del 93; 188 A 257 (1936). See also Anno: What constitutes termination of felony for purpose of felony-murder rule, 58 ALR3d 851.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. See, e.g., Garrett v State, 573 SW2d 543 (Tex Crim App, 1978); People v Moran, 246 NY 100; 158 NE 35 (1927); State v Fisher, 120 Kan 226; 243 P 291 (1926); State v Severns, 158 Kan 453; 148 P2d 488 (1944); State v Shock, 68 Mo 552 (1878); People v Huter, fn 53 (supra) ; People v Ireland, 70 Cal 2d 522; 450 P2d 580; 75 Cal Rptr 188 (1969). See also Anno: Application of felony-murder doctrine where the felony relied upon is an includable offense within the homicide, 40 ALR3d 1341. Particularly noteworthy are People v Wilson, 1 Cal 3d 431; 462 P2d 22; 82 Cal Rptr 494 (1969), and People v Sears, 2 Cal 3d 180; 465 P2d 847; 84 Cal Rptr 711 (1970), in which the California Supreme Court, while recognizing that the first-degree felony-murder statute literally required defendant's convictions, refused to uphold such convictions because \"the statutory source of the rule does not compel us to apply it in disregard of logic and reason\". People v Wilson, supra, 441.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See also People v Washington, fn 48 (supra) , 134; People v Henderson, 19 Cal 3d 86, 92-93; 137 Cal Rptr 1; 560 P2d 1180, 1183 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See the authorities cited in fn 47 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Ky Rev Stat, ยง 507.020.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Hawaii Rev Stat, ยง 707-701.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. 7A Hawaii Rev Stat, ยง 707-701, Commentary, p 347.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Ohio Rev Code Ann, ยง 2903.04 (Page).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Manslaughter by definition does not require malice. As the primary purpose of the felony-murder rule is to supply malice from the underlying felony, the rule has no usefulness as such in Ohio.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Alas Stat, ยงยง 11.41.110, 11.41.115.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. La Rev Stat Ann, ยง 14:30:1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. NY Penal Law, ยง 125.25 (McKinney).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Pa Cons Stat Ann, tit 18, ยง 2502 (Purdon).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Utah Code Ann, ยง 76-5-203(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Minn Stat Ann, ยงยง 609.185, 609.195.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Wis Stat Ann, ยงยง 940.02(2), 939.50(3)(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Ark Stat Ann, ยง 41.1502.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Del Code, tit 11, ยง 636.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Id., ยง 635.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. NH Rev Stat Ann, ยงยง 630:1, 630:1-a, 630:1-b.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. See, e.g., Ala Code, ยง 13A-6-2; Ill Ann Stat, ch 38, ยง 9-1 (Smith-Hurd); Iowa Code Ann, ยง 707.2; Minn Stat Ann, ยง 609.185; Mont Rev Codes Ann, ยง 94-5-102; Tex Penal Code Ann, tit 5, ยง 19.02 (Vernon).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. See, e.g., Ohio, fn 60 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. See, e.g., Wis, fn 68 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. See, e.g., Me Rev Stat, tit 17-A, ยง 202.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. See, e.g., Alabama, fn 73 (supra) ; Ark, fn 69 (supra) ; Cal Penal Code, ยงยง 187-189 (West); Miss Code Ann, ยง 97-3-19; NY, fn 64 (supra) ; ND Cent Code, ยง 12.1-16-01; Or Rev Stat, ยง 163.115; Wash Rev Code Ann, ยง 9A.32.030.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. See, e.g., Colo Rev Stat, ยง 18-3-102; Conn Gen Stat, ยงยง 53a-54c; NJ Rev Stat Ann, ยง 2C:11-3a; NY, fn 64 (supra) , Or, fn 77 (supra) ; Utah, fn 66 (supra) ; Wash, fn 77 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. The majority of states which have a statutory felony-murder rule enumerate the felonies included.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. See, e.g., Idaho Code, ยง 18-4003; La, fn 63 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. NY, fn 64 (supra) , 39 McKinney's Consolidated Laws of NY Ann, Part 1, Commentary, p 400.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. Alas, fn 62 (supra) ; Ark, fn 69 (supra) ; Colo, fn 78 (supra) ; Conn, fn 78 (supra) ; Me, fn 76 (supra) ; NJ, fn 78 (supra) ; ND, fn 77 (supra) ; Or, fn 77 (supra) ; Wash, fn 77 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. NY, fn 64 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. Id., 39 McKinney's Consolidated Laws of NY Ann, Part 1, Commentary, p 401.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Gegan, Criminal Homicide in the Revised New York Penal Law, 12 NY L Forum 565, 586 (1966). See, also, Crum, fn 12, (supra) ; 9 Duquesne L Rev 122 (fn 16 (supra) ).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. A good example of this point is provided by one of the cases involved here. In People v Wright, the trial Judge instructed that as to the intent element of the possible verdicts, first-degree murder required intent to commit the crime of arson, second-degree murder required intent to kill or that defendant \"consciously created a very high degree of risk of death to another with knowledge of its probable consequences\", and involuntary manslaughter involved willful, wanton and reckless disregard of the consequences. Thus, a higher degree of culpability was required for second-degree murder and involuntary manslaughter than for first-degree murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. LaFave \u0026 Scott, fn 34 (supra) , p 560.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. LaFave \u0026 Scott, fn 34 (supra) , p 554. The authors include the following footnote:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"No doubt this explains the history of the felony-murder doctrine * * * by which we start with the proposition that death resulting from the commission of a felony is murder without limitation; through the imposition of limitations; and down to a modern tendency to abolish the doctrine altogether * * *.\" Id., pp 554-555, fn 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Note, 31 Ind L J 534, fn 12 (supra) , p 543.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Turner, The Mental Element in Crimes at Common Law, 6 Cambridge L J 31, 43 (1938).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. Eden (later Lord Auckland), Principles of Penal Law (1771), pp 206-210.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. Hall, General Principles of (Indianapolis: Bobbs-Merrill, 1947), p 455.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. Anachronism Retained, fn 15 (supra) , p 428. Some commentators see the felony-murder rule as a direct descendant of this time where the results of an act were punished irrespective of the actor's intent. See, e.g., Note, 31 Ind L J 534, fn 12 (supra) , p 535; Turner, fn 91 (supra) , pp 43, 55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. 2 Pollock \u0026 Maitland, History of English Law (2d ed), p 469; Anachronism Retained, fn 15 (supra) , p 439. Perkins, fn 33 (supra) , p 545; Moreland, fn 24 (supra) , p 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. Fns 33-35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. First Report From His Majesty's Commissioners on (1834), p 29. (In: Parliamentary Papers [1834], Vol 26, p 105.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. Hall, fn 93 (supra) , p 460.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. \"[Malice aforethought] is the grand criterion which now distinguishes murder from other killing.\" 4 Blackstone, fn 42 (supra) , p 198.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. People v Charles Austin, 221 Mich 635, 644; 192 NW 590 (1923); Maher v People, 10 Mich 212, 217-218; 81 Am Dec 781 (1862); People v Morrin, 31 Mich App 301, 310; 187 NW2d 434 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. LaFave \u0026 Scott, , p 528. In this opinion, we continue to use the term \"malice\" for the sake of convenience. However, we will narrowly define the term to avoid making it the \"misleading expression\" referred to by LaFave \u0026 Scott. We see no reason why trial Judges, in instructing on the mental element required for first-degree murder committed in the course of an enumerated felony, need specifically refer to the term \"malice\". Juries may simply be instructed that they must find one of the three elements described later in this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. Of course, first-degree premeditated murder requires proof of the specific intent to cause death. People v Garcia, 398 Mich 250; 247 NW2d 547 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. See, e.g., the dicta in the following three cases: People v Potter, 5 Mich 1, 7 (1858):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Now, at the common law, if a mortal blow was malicious, although not given with intent to kill, or if death ensued from an act accompanying an unlawful collateral act, or under circumstances which showed general malice, such as a reckless disregard of the safety or lives of others, the killing would be murder, and would be punishable in the same manner as though perpetrated with the deliberate design of taking the life of the victim.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePeople v Samuel Scott, 6 Mich 287, 293 (1859):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Each grade of murder embraces some cases where there is a direct intent to take life, and each grade also embraces offenses where the direct intent was to commit some other crime. As the law names all of the offenses, an attempt to commit which renders the person who takes life guilty of murder in the first degree, no difficulty can arise in defining the degree of any murder committed, without the actual design either of taking life or of doing bodily harm to the person assailed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWellar v People, 30 Mich 16, 19 (1874):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is not necessary in all cases that one held for murder must have intended to take the life of the person he slays by his wrongful act. It is not always necessary that he must have intended a personal injury to such person. But it is necessary that the intent with which he acted shall be equivalent in legal character to a criminal purpose aimed against life. Generally the intent must have been to commit either a specific felony, or at least an act involving all the wickedness of a felony.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, also, Clark \u0026 Marshall, A Treatise on the Law of Crimes (7th ed), pp 636, 640; LaFave \u0026 Scott, , pp 529, 545; 1 Anderson, Wharton's \u0026 Procedure, ยง 243, p 527; Stephen, General View of the of England, p 116.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile we recognize that certain opinions of this Court would seem to require that a jury infer the intention to kill from the intention to commit great bodily harm, we construe that language as dictum. See, e.g., Guilty Plea Cases, 395 Mich 96, 131; 235 NW2d 132 (1975); People v Haack, 396 Mich 367, 375; 240 NW2d 704 (1976). In any event, to the extent that such language deviates from the common law, we note that none of the juries in the instant cases was instructed that they must infer the intention to kill from the intention to commit the underlying felony. No opinion of this Court has specifically addressed whether the common law should be modified to require that the intention to kill must be inferred from the intention to do great bodily harm or from the wanton and willful disregard for life and we leave that question for an appropriate case. Nor do we read People v Morrin, 31 Mich App 301; 187 NW2d 434 (1971), as resolving this question. We understand the three examples of implied malice set forth in Morrin as being treated in law as functionally equivalent (while not identical) to intent to kill, each substituting as malice in its own right. Our opinion today is limited to the question of whether we should continue to recognize the common-law rule which allows the mental element of murder to be satisfied by proof of the intention to commit the underlying felony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. Some courts and commentators have suggested that the felony-murder rule abolishes the requirement of malice aforethought. This is mistaken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Confusion results from the assumption sometimes entertained that the felony-murder rule results in conviction of murder where the killing has been without malice. Nothing could be farther from the common-law concept which is that one perpetrating or attempting to perpetrate a dangerous felony 'possesses a malevolent state of mind which the law calls \"malice\"; * * *' in other words the intent to engage in such a felony is malice aforethought.\" Perkins, fn 24, p 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOthers suggest that the \"malice\" or mens rea necessary for the felony is the same as the \"malice aforethought\" required for non-felony murder. This is also incorrect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" mens rea or 'malice' necessary for the felony is in every instance different from the mens rea or 'malice aforethought' required for murder; but for certain killings the law will allow the latter to be conclusively proved from the former. This is not to identify them at all -- it is merely to say that in certain cases proof of the particular state of mind required for murder will be established by the mens rea of certain felonies; it will be malice 'implied' rather than 'express.' The difference is significant for it preserves the felony-murder rules as a mens rea -imposing mechanism and avoids the reification of malice * * *.\" Morris, fn 12 (supra) , pp 60-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. See, (supra) , p 712.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. In 1969, the Michigan Legislature amended the statute to add to the enumerated felonies the crimes of kidnapping, extortion and larceny of any kind. 1969 PA 331.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is interesting to note that Pennsylvania had made at least two substantive changes to the statute which we adopted in 1837 and still have. Before 1974, the Pennsylvania statute made a criminal homicide murder in the first degree if done in the commission or attempted commission of the enumerated felonies. In 1974, the Pennsylvania murder statute was substantially changed, requiring an intentional killing for first-degree murder and designating felony murder as second-degree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. Keedy, History of the Pennsylvania Statute Creating Degrees of Murder, 97 U of Pa L Rev 759, 771-773 (1949); People v Potter, 5 Mich 1, 6; 71 Am Dec 763 (1858); People v Fountain, fn 1 (supra) , 498-499; Felony Murder Commentary, fn 20 (supra) , pp 16-111, 16-112.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. As the Galloway Court noted, the Iowa first-degree murder statute has since been legislatively modified. See Iowa Code Ann, ยง 707.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. This is an overly simplified statement of the common-law rule. As pointed out in Part II of this opinion, the felony-murder rule at common law was reinterpreted and redefined and progressively diminished. Furthermore, kidnapping and extortion were not felonies at common law. See Clark \u0026 Marshall, A Treatise on the Law of Crimes (7th ed), ยง 2.02, p 111. Thus, under the definition of felony murder requiring that the unlawful act shall be a felony, killings in the course of these crimes would not have amounted to murder at common law. See Torcia, Clarification of the Felony-Murder Statute ?, 63 Dickinson L Rev 119, 120 (1959).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. See, e.g., People v Samuel Scott, fn 51 (supra) , 292-293; Wellar v People, 30 Mich 16, 18-19 (1874); People v Page, 198 Mich 524, 536; 165 NW 755 (1917); People v Crandell, 270 Mich 124, 126; 258 NW 224 (1935); People v Wright, 315 Mich 81, 87; 23 NW2d 213 (1946). Samuel Scott and Wellar do not even involve felony-murder charges. As to Page, see Note, The Felony-Murder Doctrine in Michigan, 25 Wayne L Rev 69, 71-72 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. See, also, People v Duffield, 387 Mich 300, 308; 197 NW2d 25 (1972); In re Sanderson, 289 Mich 165, 174; 286 NW 198 (1939); In the Matter of Lamphere, 61 Mich 105, 108; 27 NW 882 (1886); Bugbee v Fowle, 277 Mich 485, 492; 269 NW 570 (1936); Bassier v J Connelly Construction Co, 227 Mich 251, 257; 198 NW 989 (1924); Bean v McFarland, 280 Mich 19, 21; 273 NW 332 (1937); Myers v Genesee County Auditor, 375 Mich 1, 7; 133 NW2d 190 (1965); Placek v Sterling Heights, 405 Mich 638, 656-657; 275 NW2d 511 (1979); Gruskin v Fisher, 405 Mich 51, 58; 273 NW2d 893 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. \" is for this Court to decide whether a common-law rule shall be retained unless the Legislature states a rule that is inconsistent with or precludes a change in the common-law rule.\" Gruskin v Fisher, fn 111 (supra) , p 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. Perkins, fn 24 (supra) , p 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. The prosecutors in Thompson and Wright argue that Andrus is not a felony-murder case. They base this contention on the statement of the Court, found at page 541, that \" the case at bar the attack on Frank Cline which resulted in his death, and the alleged robbery, involved the same facts and circumstances\". This statement is taken out of context, as it is in response to a joinder-of-counts argument. The defendants in Andrus claimed the defense of alibi. The jury was charged on a felony-murder theory. See Michigan Supreme Court Records and Briefs (86-87 October Term, 1951), Docket No. 86, Record on Appeal, p 590.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. The Andrew Carter Court also gave the following definitions of first- and second-degree murder:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"First-degree murder is second-degree (common-law) murder plus an element, viz., either premeditation or the perpetration or attempt to perpetrate an enumerated felony. People v Allen, 390 Mich 383; 212 NW2d 21 (1973). Conversely, second-degree murder is first-degree murder minus premeditation or the enumerated felony.\" 395 Mich 437-438.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. Commonwealth v Redline, fn 34 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. The problem of causation which is frequently at issue in a felony-murder factual situation and which is relevant with or without the existence of a felony-murder rule is not at issue here. See, e.g., People v Podolski, 332 Mich 508; 52 NW2d 201 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. Perkins, fn 24 (supra) , p 46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. It appears that this was a concern of the jury in People v Wright, involved here. The jury sent a communication to the Judge after they had begun deliberations, asking if conviction of arson required conviction of first-degree murder or whether they could return a verdict of arson in conjunction with second-degree murder or involuntary manslaughter. The trial Judge stated that he was unable to answer the question because he would be directing a verdict, and instead reinstructed the jury on the available verdicts. The jury returned shortly thereafter with a verdict of first-degree felony murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. Seibold, fn 47 (supra) , p 135, fn 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. Id., p 153.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. Model Penal Code, fn 47 (supra) , p 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. Seibold, fn 47 (supra) , p 135, fn 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. Turner, fn 91 (supra) , p 66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. Commonwealth ex rel Smith v Myers, fn 51 (supra) , p 226.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. 7A Hawaii Rev Stat, ยง 707-701, Commentary, p 346.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. Model Penal Code, fn 47 (supra) , p 36.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. Seibold, fn 47 (supra) , p 137.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. Id., p 159.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. Model Penal Code, fn (supra) , p 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 402 Mich 938 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 403 Mich 821 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 MCL 750.316; MSA 28.548 (first degree); MCL 750.317; MSA 28.549 (second degree).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 The definition of murder as a homicide committed with malice, express or implied, and the definition of malice as \"the intention to kill, actual or implied \", see Part II B, (infra), does not conflict with our recent holding in People v Richardson, 409 Mich 126; 293 NW2d 332 (1980), that the trial Judge reversibly erred by instructing the jury that \" the law implies malice 'from unprovoked, unjustifiable, or inexcusable killing'\". Id., 144 (emphasis in original). We declared in Richardson, and I reiterate today:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The necessary factual element of malice may be permissibly inferred from the facts and circumstances of the killing, but it can never be established as a matter of law by proof of other facts.\" Id. (Emphasis changed.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe implication of malice as a matter of law improperly withdraws that question of fact from the jury's consideration. Id. With respect to our definition of malice as I understand it, \"implied\" does not denote the withdrawal of the question of malice from the jury's consideration by proof of other facts. It refers instead to states of mind other than the intent to kill that are embraced by our concept of malice, namely, the intent to inflict great bodily harm and wanton and willful disregard of the likelihood that the natural tendency of one's behavior is to cause death or great bodily harm. As Justice, then Judge, Levin explained,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is murder only if there is intent to kill, actual or implied. Where there is no actual intent to kill, intent to kill will be implied only in certain circumstances, e.g., where the actor actually intends to inflict great bodily harm or the natural tendency of his behavior is to cause death or great bodily harm * * *.\" People v Morrin, 31 Mich App 301, 314, fn 17; 187 NW2d 434 (1971) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTherefore, the last two states of mind, notwithstanding their classification under the heading \" implied intent to kill\", must still be proved affirmatively, and under no circumstances may they be established as a matter of law. It is always the jury's prerogative to conclude that these states of mind do not exist. See People v Richardson, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 To the extent that my concurrence in Justice Coleman's Dissenting opinion in People v Allensworth, 401 Mich 67, 75; 257 NW2d 81 (1977), can be read as indicating otherwise, I hereby admit error there. See People v Till, 80 Mich App 16, 36; 263 NW2d 586 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 See also People v Doss, 406 Mich 90, 99; 276 NW2d 9 (1979); People v Van Wyck, 402 Mich 266, 269; 262 NW2d 638 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 At fn 104, Justice Fitzgerald quotes from Perkins, (2d ed), p 45, the following:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'Confusion results from the assumption sometimes entertained that the felony-murder rule results in conviction of murder where the killing has been without malice. Nothing could be farther from the common-law concept which is that one perpetrating or attempting to perpetrate a dangerous felony \"possesses a malevolent state of mind which the law calls 'malice'; * * *\" in other words the intent to engage in such a felony is malice aforethought.'\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn support of the last sentence in this quotation, Perkins cites, in fn 19 at p 45, these authorities:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'The felony-murder doctrine ascribes malice aforethought to the felon who kills in the perpetration of an inherently dangerous felony.' People v Washington, 62 Cal 2d 777, 780; 44 Cal Rptr 442, 445; 402 P2d 130, 133 (1965). It 'supplies the element of malice.' Simpson v Commonwealth, 293 Ky 831; 170 SW2d 869 (1943). The law 'implyeth a former malicious Disposition in him * * *.' Lambard, Eirenarcha 241 (1619).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile the felony-murder doctrine \"ascribes\" malice, \"supplies the element of malice\", or by law \"implyeth\" malice, it does not change the definition of malice, which remains the intent to kill, actual or implied. Factual proofs of an intent to commit an (inherently dangerous) felony are, under the felony-murder rule, allowed to conclusively establish the essential or ultimate factual element of an implied intent to kill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The felony-murder rule has been defined as a method of conclusively proving the implied intent to kill (malice) by proving either the intent to commit a felony, see Justice Fitzgerald's opinion, ante, fns 103-104, or the intent to commit an inherently dangerous felony. See Perkins, (2d ed), p 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt would appear, by virtue of this Court's decision in People v Jeffrey Carter, 387 Mich 397; 197 NW2d 57 (1972), that the felony-murder rule, if it existed at all in Michigan, applied only upon proof of the intent to commit a statutorily enumerated felony. In Jeffrey Carter, the prosecution argued that statutory second-degree (i.e., common-law) murder could be proved by showing a homicide committed during the perpetration of \"any\" felony. The specific felony proffered in Jeffrey Carter was kidnapping which, according to Perkins, (supra) , at 39-42, is considered a \"dangerous felony\" which has been used in applications of the felony-murder rule. At the time of the Jeffrey Carter prosecution, kidnapping was not one of the felonies enumerated in the first-degree murder statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis Court rejected the \"any felony\" or \"dangerous felony\" argument with respect to second-degree murder:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Both murder and manslaughter deal with the wrongful killing of another person. If there has been a killing during the commission of one of the felonies enumerated under first-degree murder, this establishes the degree. If the killing occurs during the commission of some other felony, malice may be implied but the nature of the felonious act must be considered. Many felonies are not inherently dangerous to human life. To hold that in all cases it is murder if a killing occurs in the commission of any felony would take from the jury the essential question of malice.\" (Emphasis added.) 387 Mich 422.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile this statement may be read by some as indicating that proof of a homicide during the commission of a statutorily enumerated felony could establish first-degree murder, it is clear that such an interpretation would require casting aside the well-established precedent, discussed above at page 736, that our murder statutes do not define murder but only serve to graduate punishment of an already established murder. It would be anomalous to say that the term \"murder\", as used in the first-degree murder statute, contemplates one kind of \"common-law malice\" which would include the intent to commit a felony, while the term \"murder\" as used in the second-degree statute contemplates a kind of \"common-law malice\" which does not include the intent to commit a felony. In other words, only in the first-degree murder statute would the term \"murder\" be read as \"killing\". But, as was suggested by our decision in People v Andrew Carter, 395 Mich 434; 236 NW2d 500 (1975), \" degree murder not = killing + either premeditation or perpetration of a felony enumerated in the first degree murder statute\". Corrigan \u0026 Grano, (1976 Annual Survey of Michigan Law), 23 Wayne L Rev 473, 505 (1977) (emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn any event, for purposes of convenience, the use of the phrase \"the intent to commit a felony\", as used throughout the rest of this opinion, should be read as also meaning \"the intent to commit an inherently dangerous felony\" and \"the intent to commit a statutorily enumerated felony\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 See and compare Mullaney v Wilbur, 421 U.S. 684, 686; 95 S Ct 1881; 44 L Ed 2d 508 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 See, e.g., People v Fountain, 71 Mich App 491, 494-495, fn 2 (\"In effect malice was imputed to the act of killing from the intent to commit the underlying felony by operation of law.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 A conclusive presumption has been explained as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In the case of what is commonly called a conclusive or irrebuttable presumption, when fact B is proven, fact A must be taken as true, and the adversary is not allowed to dispute this at all.\" McCormick, Evidence (2d ed), ยง 342, p 804.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the context of the felony-murder rule, proof of a \"basic\" or \"evidentiary\" fact, that is, the intent to commit a felony, establishes, as a matter of law, the existence of the \"ultimate\" or \"elemental\" fact, malice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 See, e.g., Justice Fitzgerald's opinion, p 714.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 See id., Perkins on (2d ed), p 46, quoted in People v Morrin, 31 Mich App 301, 322, fn 28; Moreland, Law of Homicide (Indianapolis: Bobbs-Merrill, 1952), pp 205-206. Under this view of felony murder, \"the intent to engage in such a felony is malice aforethought \". Perkins, (supra) , p 45 (emphasis in original). See, e.g., People v Till, 80 Mich App 16, 29; 263 NW2d 586 (1977) (\" perpetration or attempt to perpetrate a dangerous felony is equivalent to malice.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 The prosecutor in Aaron seems to recognize this:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" 'malice' required for felony murder is unique and by its very nature cannot be utilized as an element of either first-degree premeditated murder or second-degree murder.\" Brief at p 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis species of \"malice\" is unique because it is really a pseudo-malice -- no malice at all. To illustrate, suppose a crime consists of elements A, B, and C. Suppose also that a rule of law provides that whenever B is established, C is established and whenever B is not established, C is not established. Does it make sense to say that C is an element of the crime? The answer clearly is \"no\". The elements of the crime are A and B. Some would argue that C is still an element of the crime, but conclusively (irrebuttably) presumed upon proof of B. I concede that a conclusive presumption with respect to an element of a crime does not necessarily render the element a nullity. It only does so when the presumption's basic fact is another element of the crime, as in the cases of felony murder and the foregoing hypothetical, in which cases the conclusive presumption is not that at all, but merely a roundabout way of saying the element is not part of the crime. (As to felony murder, it might be said that the \"presumed fact\" is malice and the basic fact is the mens rea of the underlying felony.) In contrast, when the presumed fact is truly an element of the crime, the presumption, especially if it is conclusive, may run afoul of the Fourteenth Amendment Due Process Clause. See In re Winship, 397 U.S. 358; 90 S Ct 1068; 25 L Ed 2d 368 (1970); Mullaney v Wilbur, 421 U.S. 684; 95 S Ct 1881; 44 L Ed 2d 508 (1975); Ulster County Court v Allen, 442 U.S. 140; 99 S Ct 2213; 60 L Ed 2d 777 (1979). Such presumptions may unconstitutionally dilute the \"beyond a reasonable doubt\" standard of criminal culpability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 The difference in kind between felony murder and murder is marked not only by the absence of malice in the former. Felony murder is an entirely parasitic crime with no bottom of its own: it stands or falls with the underlying felony, as is reflected in its title. Furthermore, felony murder is the only homicide (with the possible exception of one type of involuntary manslaughter) as to which the defendant's state of mind (mens rea) with respect to the killing is irrelevant. On this factual question, the prosecutor need offer no evidence. These particular attributes render felony murder sui generis in the law of homicide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 Justice Fitzgerald's opinion, p 722.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 See People v Potter, 5 Mich 1, 6-7 (1858); People v Samuel Scott, 6 Mich 287, 293 (1859); Maher v People, 10 Mich 212, 218-219 (1862); Wellar v People, 30 Mich 16, 19-20 (1874); People v Utter, 217 Mich 74, 86, 88; 185 NW 830 (1921); People v Pavlic, 227 Mich 562, 565-567; 199 NW 373 (1924); People v Treichel, 229 Mich 303, 307-308; 200 NW 950 (1924); People v Crandell, 270 Mich 124, 125; 258 NW 224 (1935); People v Andrus, 331 Mich 535, 544; 50 NW2d 310 (1951); People v Jeffrey Carter, 387 Mich 397, 422; 197 NW2d 57 (1972); People v Andrew Carter, 395 Mich 434, 437-439; 236 NW2d 500 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 Justice Fitzgerald's opinion, p 722.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 People v Fountain, 71 Mich App 491; 248 NW2d 589 (1976) (Michigan has no felony-murder rule).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 People v Till, 80 Mich App 16; 263 NW2d 586 (1977) (Michigan does have a felony-murder rule). See cases cited in Justice Fitzgerald's fn 1. See, generally, Saltzman, Does Michigan Have a Felony-Murder Rule ?, 59 Mich Bar J 97 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 I do not concur in that portion of Part IV of Justice Fitzgerald's opinion discussing the relationship between felony murder, malice, and murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 This has been the rule since at least 1862, when this Court, in Maher v People, supra, declared:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"To give the homicide the legal character of murder, all the authorities agree that it must have been perpetrated with malice prepense or aforethought. This malice is just as essential an ingredient of the offense as the act which causes the death ; without the concurrence of both, the crime cannot exist; and, as every man is presumed innocent of the offense with which he is charged till he is proved to be guilty, this presumption must apply equally to both ingredients of the offense -- to the malice as well as to the killing. Hence, though the principle seems to have been sometimes overlooked, the burden of proof, as to each, rests equally upon the prosecution, though the one may admit and require more direct proof than the other; malice, in most cases, not being susceptible of direct proof, but to be established by inferences more or less strong, to be drawn from the facts and circumstances connected with the killing, and which indicate the Disposition or state of mind with which it was done. It is for the court to define the legal import of the term, malice aforethought, or, in other words, that state or Disposition of mind which constitutes it; but the question whether it existed or not, in the particular instance, would, upon principle, seem to be as clearly a question of fact for the jury, as any other fact in the cause, and that they must give such weight to the various facts and circumstances accompanying the act, or in any way bearing upon the question, as in their judgment, they deserve: and that the court have no right to withdraw the question from the jury by assuming to draw the proper inferences from the whole, or any part of, the facts proved, as presumption of law. If courts could do this, juries might be required to find the fact of malice where they were satisfied from the whole evidence it did not exist.\" (Emphasis changed.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThus, we held in Maher that the essential element of malice was a question of fact which could not be withdrawn from the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 Of course, circumstantial evidence may properly include, if the killing occurred during the commission or attempted commission of any felony, the nature of the felony and attending circumstances. In some cases, no doubt, this evidence may persuade the trier of fact beyond a reasonable doubt that the defendant acted with malice. For this reason and those explained in Part VI of Justice Fitzgerald's opinion, the impact of today's decision on the administration of criminal Justice is not likely to be profound.\u003c/span\u003e\n\n",
    "body_length": 152585,
    "citedas": [
      "299 N.W.2d 304",
      "409 Mich. 672"
    ],
    "attorneys": "Frank J. Kelley, Attorney General, and Robert A. Derengoski, Solicitor General, for the people. William L. Cahalan, Prosecuting Attorney, Edward Reilly Wilson, Principal Attorney, Appeals, and Don W. Atkins, Assistant Prosecuting Attorney, for the people in Aaron. Robert L. Kaczmarek, Prosecuting Attorney, Peter C. Jensen, Special Prosecutor, and Patrick M. Meter, Assistant Prosecuting Attorney, for the people in Thompson. William F. Delhey, Prosecuting Attorney, and Lynwood E. Noah, Senior Assistant Prosecuting Attorney, and Elizabeth Osgood Pollard, Assistant Prosecuting Attorney, for the people in Wright. Carl Ziemba for defendant Aaron. State Appellate Defender (by Daniel J. Wright) for defendant Thompson. Marc L. Goldman and R. Michael Stillwagon for defendant Wright.",
    "category": [
      "243",
      "78",
      "75"
    ],
    "judges": "Fitzgerald, J. Coleman, C.j., and Kavanagh, Levin, and Blair Moody, Jr., JJ., concurred with Fitzgerald, J. Ryan, J. (concurring in part, Dissenting in part). Williams, J. (concurring in part).",
    "citation_count": 37
  }
}
