{
  "id": "j4C-PWYBTlTomsSBRrbK",
  "document": {
    "title": "United States Fidelity and Guaranty Company v. Braspertro Oil Services Company",
    "full_title": "UNITED STATES FIDELITY AND GUARANTY COMPANY AND AMERICAN HOME ASSURANCE COMPANY -COUNTER-DEFENDANTS-APPELLANTS, v. BRASPETRO OIL SERVICES COMPANY, PETR\u0026OACUTE;LEO BRASILEIRO S.A.-PETROBRAS, BANK OF TOKYO-MITSUBISHI, LTD., FORMERLY KNOWN AS BANK OF TOKYO, LTD.-JAPAN, AND LONG-TERM CREDIT BANK OF JAPAN, LTD. -COUNTER-CLAIMANTS-APPELLEES.",
    "jurisdiction": "Second Circuit",
    "date": "2004-05-20T00:00:00.000Z",
    "docket": "Docket Nos. 02-9185, -9187",
    "body": "Argued: October 3, 2003\n\nPlaintiffs-counter-defendants-appellants, United States Fidelity and Guaranty Company (\"USF \u0026 G\") and American Home Assurance Company (collectively, \"Appellants\" or the \"Sureties\"), appeal from judgments of the United States District Court for the Southern District of New York (Koeltl, J.), entered after a two-month, technically-complex bench trial that resulted in a damages award of over $370 million and generated a record on appeal of over 15,000 pages. At an earlier stage in this litigation, we were constrained to resolve the issue of subject matter jurisdiction. See U.S. Fid. \u0026 Guar. Co. v. Braspetro Oil Serv. Co., 199 F.3d 94 (2d Cir. 1999) (per curiam) (affirming exercise of subject matter jurisdiction pursuant to the commercial activities exception to the Foreign Sovereign Immunities Act). The District Court's decision in this case has been described as \"perhaps the most important in the field of surety law in several decades\" and as having \"[redefined] the ground rules . . . for surety companies.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nOne of the bedrock principles of our American system of law is that triers of fact, rather than appellate courts, are best situated to resolve issues of fact. Appellants, however, have effectively asked this Court to act in contravention of this principle by presenting us with a number of \"legal\" arguments that, upon close examination, devolve to a common nucleus - an invitation to this Court to set aside one or more of the factual findings underlying the District Court's determination that the Sureties were liable under the performance bonds at issue. We find no clear error in any of the District Court's factual findings and no merit in any of the challenges to the District Court's legal rulings as to Appellants' liability.\n\nBut that is not the end of the matter, as the Sureties have raised two arguments that we do find to be meritorious. Specifically, Appellants contend that the District Court erred in awarding defendants-counter-claimants-appellees $62,592,000 in liquidated damages and $36,730,905 in attorneys' fees and expenses. With regard to these discrete issues, we find ourselves in agreement with the Sureties. Therefore, we vacate those portions of the judgments of the District Court holding Appellants liable for a total of $99,322,905 in liquidated damages and attorneys' fees and expenses, and remand for recalculation of prejudgment interest and for other proceedings consistent with this opinion. We affirm the judgments of the District Court in all other respects.\n\nBACKGROUND\n\nFamiliarity with the facts giving rise to these appeals is assumed, as those facts are set forth in the District Court's comprehensive published opinions. See U.S. Fid. \u0026 Guar. Co. v. Braspetro Oil Serv. Co., 219 F. Supp. 2d 403 (S.D.N.Y. 2002) (\"Braspetro I\"); U.S. Fid. \u0026 Guar. Co. v. Braspetro Oil, 226 F. Supp. 2d 459 (S.D.N.Y. 2002) (\"Braspetro II\"). We relate below those facts and proceedings relevant to the present appeals.\n\nI. The Parties\n\nAppellants provide surety bonds to guarantee obligations in the construction industry. Defendant-counter-claimant-appellee Petroleo Brasileiro S.A.-Petrobras (\"Petrobras\"), is an instrumentality of the Brazilian government. \"Between 1953 and August 6, 1997, Petrobras held a monopoly in Brazil on the prospecting, production, refining, processing, marketing, and transportation of oil, petroleum from other derivatives, natural gas, and other liquid hydrocarbons, as well as other related activities.\" Braspetro I, 219 F. Supp. 2d at 411. Defendant-counter-claimant-appellee Braspetro Oil Services Co. (\"Brasoil\") is an instrumentality of the Brazilian government and is a wholly-owned \"grandchild\" subsidiary of Petrobras. Id. Although Brasoil executed the construction contracts that are the subject of these appeals, Brasoil appointed Petrobras through a series of service agreements to be Brasoil's agent - first, to oversee the bidding process leading up to the execution of those contracts; and later, to oversee their implementation. Id. at 414-15. Defendants-counter-claimants-appellees Bank of Tokyo Mitsubishi, Ltd. and Long-Term Credit Bank of Japan, Ltd. (collectively, the \"Japanese Banks\") provided financing in connection with one of the construction contracts that are the subject of these appeals. Id. at 409, 413. (The appellees, collectively, will be referred to in this opinion as the \"Obligees.\")\n\nII. The Construction Projects \u0026 Contracts\n\nIn 1994 and 1995, Brasoil let out for bid two contracts - the \"P-19 Contract\" and the \"P-31 Contract\" (collectively, the \"Contracts\"). The Contracts pertained to two of several massive naval construction projects in Brazil - the \"P-19 Project\" and the \"P-31 Project\" (collectively, the \"Projects\"). The P-19 Contract was let out for bid in 1994; the P-31 Contract, in 1995. Id. at 415-16, 424-25. The P-19 Project involved \"the acquisition and conversion of an existing semi-submersible drill rig to be deployed offshore in the Marlim [oilfield].\" Id. at 415. The P-31 Project involved \"the conversion of the Vidal de Negreiros (the 'Vidal'), a Very Large Crude Carrier ('VLCC') into a Floating Production, Storage, and Offloading ('FPSO') unit.\" Id. at 424. Both Contracts were for engineering, procurement, and construction work, to be performed on a turn-key, lump-sum basis. Equipment and materials constituted most of the Projects' costs, and bids were to be submitted on a lump-sum basis, including profit and overhead. Id. at 419-21, 426.\n\nThe bidding process for each of the Contracts was conducted in accordance with Brazilian law, under which each of the Contracts was to be awarded to the lowest qualified bidder. The successful bidder on each of the Contracts was a construction consortium (the \"Consortium\") led by defendant Industrias Verolme-Ishibras, S.A. (\"IVI\").\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e See id. at 413, 415-16, 424-25. The P-19 Contract, which was executed on February 10, 1995, required the P-19 Project to be completed by July 23, 1997 (which date was later extended to September 21, 1997). See id. at 420-21. The P-31 Contract, which was executed on October 25, 1995, required the P-31 Project to be completed by January 11, 1998 (which date was later extended to April 14, 1998). See id. at 425-26.\n\nThe Consortium bid $165,532,660 for the P-19 Contract and $163,000,021 for the P-31 Contract, respectively. The Consortium, however, had underestimated and thus underbid both Projects, each by a substantial margin, based on its own unrealistic budgetary assumptions -especially with respect to contingencies for increased labor and equipment costs, exchange-rate fluctuations, and consequent financing costs. See id. at 416-18, 425.\n\nUnder the Contracts, progress payments were made according to milestones, which subdivided each of the Projects into individual tasks. Each task was assigned a weight or value according to a payment schedule. The Consortium invoiced Petrobras on a monthly basis, with each invoice listing the milestones that had been completed in the previous month. Petrobras was responsible for confirming that the milestones reported in each invoice had been met and then approving each invoice for payment. The Contracts also gave Petrobras broad rights to inspect the work on the Projects and insist on strict compliance with the terms of the Contracts. In addition, the Contracts permitted Brasoil to make direct payments to vendors at the Consortium's request.\n\nThe Contracts specified certain \"default events\" by the Consortium that would permit Brasoil to terminate the Contracts. These default events included bankruptcy, certain unjustified work interruptions, and failure to comply with \"contract clauses, specifications, designs[,] or deadlines.\" Id. at 478. In addition, the Contracts imposed \"multas\" (which translates from the Portuguese as \"penalties\" or \"fines\"), certain of which (\"multas moratórias,\" which translates as \"delay penalties\") were to be applied in the event of a failure to perform on the part of the Consortium that resulted in a delay in performance - that is, a delay in bringing the P-19 and/or P-31 facilities on line. The delay penalties were based on 0.1% of the total price of each of the respective Contracts, to be imposed for each day of delay, and were in addition to, not in lieu of, the Consortium's other liability for \"losses or damages.\" Finally, the Contracts expressly provided that they were to be interpreted in accordance with Brazilian law. Id. at 475.\n\nThe P-19 and P-31 bid documents required the Consortium to obtain performance bonds issued by a \"first rate\" insurance company, and the Consortium retained the Sureties to fulfill this purpose. See id. at 416. On April 5, 1995, the Sureties issued a performance bond for the P-19 See id. at 419-22, 426-28.\n\nIII. The Performance Bonds\n\nProject (the \"P-19 Bond\"), in the amount (or \"penal sum\") of $110,532,660, on behalf of the P-19 Consortium as principal, and in favor of Brasoil as obligee. Id. at 418. On August 30, 1995, the Japanese Banks, which provided financing for the P-19 Project, were added as co-obligees on the P-19 performance bond. Id. On October 25, 1995, the Sureties issued a performance bond for the P-31 Project (the \"P-31 Bond\"), in the penal sum of $163,000,021, on behalf of the P-31 Consortium as principal, and in favor of Brasoil as obligee. Id. at 424. Ultimately, the premiums for the P-19 and P-31 performance bonds (collectively, the \"Bonds\") totaled approximately $7.5 million. Id. at 482. The District Court found (and the Sureties do not dispute) that the Sureties did not review the Contracts before issuing the Bonds.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Id. at 419, 426.\n\nBoth the P-19 and the P-31 Bonds were in the form of an American Institute of Architects Document A312 (\"AIA 312\") Performance Bond, id. at 418, 426, a three-page, standard form bond containing twelve paragraphs. Id. at 418. Four of these paragraphs, identical in each of the Bonds, are relevant to these appeals.\n\nUnder Paragraph 3, before the Sureties' obligations under either of the Bonds could arise, Brasoil had to satisfy three conditions precedent. Specifically, Brasoil was required to: (i) notify the Consortium and the Sureties that Brasoil was considering declaring a default and attempt to arrange a conference (called a \"Section 3.1 meeting\") to resolve the situation; (ii) \"declare[] a Contractor Default and formally terminate[] the [Consortium's] right to complete the [C]ontract\"; and (iii) agree \"to pay the Balance of the Contract Price . . . in accordance with the terms of the . . . Contract.\" Id. at 418. Paragraph 12.1 of the Bonds defined \"Balance of the Contract Price\" to mean \"[t]he total amount payable by [Brasoil] to [the Consortium] under the . . . Contract after all proper adjustments ha[d] been made, . . . reduced by all valid and proper payments made to or on behalf of the [Consortium] under the . . . Contract.\" Id. at 450.\n\nParagraph 4 provided the Sureties with four options once Brasoil had met the conditions precedent in Paragraph 3. The Sureties could: (i) \"[a]rrange for [the Consortium], with consent of [Brasoil], to perform and complete the . . . Contract\"; (ii) themselves \"[u]ndertake to perform and complete the . . . Contract itself, through agents or through independent contractors\"; (iii) \"[o]btain bids or negotiated proposals from qualified contractors acceptable to [Brasoil] for a contract for performance and completion of the . . . Contract . . . and pay to [Brasoil] the amount of damages . . . in excess of the [applicable contract price] incurred by [Brasoil] resulting from the [Consortium's] default\"; or (iv) waive their rights to take the foregoing measures, and either (a) \"[a]fter investigation, determine the amount for which [they] may be liable to [Brasoil] and, as soon as practicable after the amount is determined, tender payment [therefor to Brasoil],\" or (b) \"[d]eny liability in whole or in part and notify [Brasoil] citing reasons therefor.\" Id. at 418-19.\n\nParagraph 6 limited the Sureties' liability under each of the Bonds \"to the amount of [the Bonds] . . . without duplication\" to cover: (i) \"[t]he responsibilities of [the Consortium] for correction of defective work and completion of the . . . Contract\"; (ii) [a]additional legal, design, professional[,] and delay costs resulting from the [Consortium's] Default, and resulting from the actions or failure to act of the Sure[ties] under Paragraph 4\"; and (iii) \"[l]iquidated damages, or if no liquidated damages [were] specified in the . . . Contract, actual damages caused by delayed performance or non-performance of the [Consortium].\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Id. at 470-71.\n\nIV. Project Delays \u0026 Spiraling Costs\n\nFrom the outset of both the P-19 and P-31 Projects, the Consortium began falling well behind schedule and experiencing substantial cost overruns. For example, the Consortium did not close on the purchase of the drilling platform that was needed in P-19 until twenty-four days after the date upon which the Consortium and Petrobras' manager had agreed that the platform would be delivered (and seventy-nine days after the delivery date that was specified in the P-19 Contract). The Consortium also failed to order promptly various pieces of critical equipment with lengthy \"lead-times,\" and, consequently, much of this equipment was delivered several months after its delivery had originally been anticipated. See id. at 422-23, 425.\n\nIn addition, the Consortium elected not to \"lock in\" prices - which it could have done before submitting its final bids on the P-19 and P-31 Projects - for equipment and materials from suppliers and subcontractors that had submitted bids to the Consortium, in computing its own bids on P-19 and P-31. This decision became extremely problematic to the Consortium, and thus to Brasoil and Petrobras, when prices on platform-conversion equipment and materials began to skyrocket in the wake of a global surge in conversion projects similar to P-19 and P-31. The consequent increase in demand for such equipment and materials resulted, in turn, in even greater delays. See id.\n\nV. The Deterioration of the Consortium's Financial Condition\n\nAs early as November 1995, the Consortium began experiencing difficulties paying for supplies and services that were essential to the P-19 Project; consequently, suppliers were threatening to curtail services unless payments were made. On November 14, 1995, a Consortium Project Manager wrote to a high-ranking Petrobras engineer and requested that the schedule of progress payments in P-19 be changed because the Consortium's working capital had been depleted in securing additional (or \"gap\") financing for the $14 million difference between the $41 million allocated in the P-19 Contract for the purchase of the drilling platform and the $55 million that the Consortium ultimately had to pay for the platform. Id. at 428.\n\nOn December 6, 1995, representatives of IVI met with the executive committee of Petrobras to explain the Consortium's cash flow problems and seek financial assistance from Petrobras. In particular, IVI asked for a $15 million advance to significantly restructure IVI's business operations, which had incurred substantial costs due to labor disputes, losses from changes in the foreign exchange rate, and a surplus of personnel (resulting from a number of previously-executed labor agreements). The proposed $15 million advance was to be repaid in five equal installments. Id.\n\nPetrobras responded with a proposal conditioning any financial assistance on: (1) the establishment of \"blocked accounts\" to ensure that the monies allocated to each of the Contracts would be used only in the performance of the respective Project;\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and (2) the cancellation of all Petrobras/Brasoil projects that had been awarded to IVI and its partners but not yet commenced, including P-31 and another conversion project, which was designated as \"P-32.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e After a brief negotiation, the parties agreed: (1) that the Consortium would relinquish P-32 in exchange for Petrobras adjusting the benchmark payment schedules in the P-19, P-31, and P-34 contracts to allow greater funds to be provided to the Consortium earlier in time; and (2) to establish a system of blocked accounts so that any funds paid to the Consortium by Petrobras would be used solely to complete Petrobras projects. However, the Consortium refused to relinquish P-31, claiming that it needed P-31 to complete P-19 and P-34. See id. at 428-29.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn early January 1996, IVI informed Brasoil that, by December 1997, the Consortium would incur a loss of approximately $61 million in connection with P-19, P-31, and P-34. To stave off this loss, the Consortium requested that Petrobras provide it with approximately $32 million in contract payments in advance of the previously agreed-upon schedules. Id. at 431. A few days later, USF \u0026 G began to demand detailed financial information from IVI relating to its ongoing projects, payments to suppliers, and advances received from Petrobras. Although these initial demands focused on the P-34 Project, the Sureties were aware by mid-January 1996 of IVI's deepening financial difficulties relating to all of its projects, including P-19 and P-31. See id. at 437-38. On February 1, 1996, the Consortium informed USF \u0026 G that Petrobras had agreed to make additional funds available to IVI, and that all future funds would be disbursed by Petrobras into project-specific blocked accounts, which funds the Consortium would then use to pay its subcontractors and suppliers. Id. at 438.\n\nOn February 12, 1996, Brasoil and the Consortium executed \"Amendment One\" to the P-31 Contract, thereby revising the payment schedule so that the Consortium would receive larger payments when purchase orders were placed for certain equipment and providing for the use of a system of blocked accounts. All other terms of the P-31 Contract, including the contract price and completion date, remained the same. Id. at 431. On March 1, 1996, Brasoil and the Consortium entered into \"Amendment One\" to the P-19 contract, thereby revising the payment schedule to increase the payment to the Consortium for the purchase and delivery of the to-be-converted vessel from twenty-five percent to thirty-five percent of the contract price and establishing a system of blocked accounts for the P-19 Project. On March 20, 1996, the Consortium sent a letter to Petrobras detailing further problems that the Consortium was experiencing with the P-19 Project, but indicating that it was still on schedule for completion. Id. at 433.\n\nOn May 16, 1996, a high-ranking engineer at Petrobras circulated an internal memo stating that the measures that had been taken to date to support the Consortium had been insufficient and predicting that the Consortium \"would not achieve the financial stability required for the normal development of the [P]rojects.\" Id. at 434. In particular, the memo noted that the Consortium had failed to implement a workforce-reduction plan and had been unable to secure external financing for equipment purchases. The memo concluded that, for the Consortium to continue work on the Projects, Petrobras would have to make over $43 million in direct payments to suppliers of major equipment in advance of the progress payments (\"direct and advance payments\"), and then deduct the amounts of those direct and advance payments from regular progress payments that were to be disbursed to the Consortium beginning in December 1996. This solution was designed to permit work to continue and provide time for a global solution to the financial problems facing the Consortium to be found. At best, however, Petrobras' decision to make the direct and advance payments merely deferred the point - from May 1996 until about June 1997 - when the Consortium would incur a net cash flow deficit. The memo also projected that cost-overruns in P-19, P-31, and P-34 would ultimately total about $89 million (up from the earlier projected overrun of about $61 million). Finally, the memo recommended that the Sureties be consulted to provide input regarding these latest developments. Id. at 434-35.\n\nSignificantly, the District Court found that, at the time the memo was written, (i) the projects were \"more or less on schedule\"; (ii) for Petrobras/Brasoil to \"continu[e] with the Consorti[um] was the cheapest alternative available to complete the [P]rojects\"; and (iii) \"no other yard in Brazil . . . had the facilities to convert P-19 and P-31.\" Id. at 435. In particular, the court found that: \"there were no other companies in Brazil that could [have been] brought in to complete the [P]rojects, even assuming that IVI would [have] permit[ted] the continued use of its yards,\" id.; and, moreover, that securing an alternate facility at that time was not feasible, because the cost of \"moving the Projects to any other yards in the world that could have completed the Projects, even if they could [have been] hired to complete the work,\" would have been prohibitive due to the inordinate amount of time and effort that would have been involved in relocating the Projects. See id.\n\nIn a May 1996 meeting, the Sureties were informed that Petrobras was making direct and advance payments for equipment and that IVI was consulting with a Brazilian investment bank concerning a possible restructuring or reorganization. IVI agreed to keep the Sureties updated on a monthly basis or as needed. Id. at 437. The District Court found \"no contemporary evidence that the Sureties viewed the actions of Petrobras in assisting IVI to meet the Consorti[um]'s contractual commitments by, among [other] means, making advances and establishing blocked accounts as inconsistent with any obligations under the Performance Bonds.\" Id. at 437. The court found, however, that by May 1996 both the Sureties and Petrobras had begun developing strategies to preserve their respective rights against one another. A meeting was held on July 18, 1996, at which Petrobras provided USF \u0026 G with a \"full and complete briefing . . . concerning the condition of the [P]rojects and the Consorti[um]'s financial problems.\" Id. at 438. Soon thereafter, USF \u0026 G was informed specifically of the direct payments Petrobras had been making to equipment suppliers, and of the most recent projections indicating that cost overruns on the projects would total around $89 million. The District Court found that USF \u0026 G had neither objected to the direct and advance payments nor instructed Petrobras to discontinue making them. Id.\n\nFrom June 1996 until about February 1997, Brasoil directly paid certain suppliers approximately $25 million for equipment needed in P-31, and approximately $18 million for equipment needed in P-19. The Consortium had transmitted a series of letters to Brasoil, requesting that it make the direct and advance payments. The letters were captioned \"advance and direct payment,\" and each letter referenced the number of the applicable contract and provided that the direct and advance payments were being made without regular invoicing and, together with interest, would be discounted from future progress payments beginning in December 1996.\n\nAs a factual matter, the District Court found that \"[a]ll of the direct [and advance] payments were specifically designated for equipment required to complete the Projects,\" and that the direct and advance payments were \"related to and [were] valid and proper payments under the [Contracts.].\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The financial situation of the Consortium continued to worsen. On December 8, 1996, representatives of the Consortium informed Petrobras that the projected cost overruns in P-19 and P-31 had ballooned from the May 1996 estimated total of $90 million to $189 million. On December 19, 1996, Petrobras determined that the contract balance in the P-19 contract had been exhausted and that funds for the P-31 contract would be exhausted in March 1997. See id. at 440.\n\nA few days later, the Consortium, Brasoil, and Petrobras undertook to address these issues.\n\nThe Consortium and Brasoil amended the P-19 and P-31 Contracts again, this time increasing them by approximately $10.5 million and $17 million, respectively; both amendments were signed on February 3, 1997, to be effective December 19, 1996.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Id. at 440-41. In addition, the Consortium requested, and Petrobras approved, further advances for needed equipment - in the amounts of $16 million and $15 million in P-19 and P-31, respectively. Id. at 441. Petrobras also ceased discounting the regularly-scheduled progress payments by the amounts of the previously disbursed direct and advance payments. Id. at 436.\n\nVI. Interactions Among Petrobras, Brasoil, and the Sureties Prior to the Default Notice\n\nOn December 27, 1996, Petrobras invited the Sureties to a meeting, the agenda of which was a potential solution to be applied in the event that Brasoil declared an event of default. Id. at 442. Prior to this meeting, on January 6, 1997, Petrobras had provided USF \u0026 G with updated financial information relating to P-19, P-31, and P-34, including the Consortium's latest estimates of how far over budget the projects ultimately would be - at that time, the Projects were well on their way to coming in $189 million over budget - as well as the total amount of the recently approved amendments ($47.7 million), and the difference between the amounts that had been approved for payment and the Consortium's estimated deficits at completion ($141 million). See id. Notably, these projected contract deficits did not merely represent claims for pending change order requests by the Consortium, but, as the District Court found, \"included overruns caused by the drastic underbidding of the P-19 and P-31 Projects by the Consorti[um]; the Consorti[um]'s increased costs due to [its] poor financial condition; the overheated nature of the market . . . ; and the poor administration of the projects by the Consorti[um].\" Id.\n\nOn January 8, 1997, representatives of the Sureties, Petrobras, and Brasoil met to discuss what to do about the rapid financial disintegration of the Projects and the Consortium's mishandling of them. For the Sureties' part, they refused to take any action until such time as the Consortium was \"formally declared in default.\" Id. at 443. In addition, the Sureties stated that, if a default were declared, \"work on the [P]rojects would have to stop for several months while the Sureties 'investigated.'\" Id. Precisely what was to be the subject of the investigation was not made clear. The very concept of a work stoppage was anathema to Petrobras and Braosil, however, and both agreed that, regardless of whether a default were declared, the Consortium would have to remain involved in the Projects for at least some time.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e At a meeting held the following day, the Sureties engaged in even more foot-dragging, stating that as long as the P-19 and P-31 Contracts were in effect, no investigation would take place, and even refusing to admit, when asked by Petrobras, whether the P-19 and P-31 Bonds were valid.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nOn January 10, 1997, Petrobras demanded that the Sureties convene Section 3.1 meetings as required in the Bonds. See id. After receiving the Section 3.1 meeting notices, the Sureties contacted the Indemnitors and informed them that, in the event a default was declared in P-19 and/or P-31, the Sureties had the right to inspect at any time the books and records of the principals and the Indemnitors, including members of the Consortium and IVI. Even prior to the formal declarations of default (which are discussed below), however, the Consortium had granted the Sureties free access to project records, and the Sureties had been kept fully informed of the reasons the projects were over budget and behind schedule. See id.\n\nIn the early months of 1997, the Sureties took a number of steps to discourage Brasoil from declaring a default in P-19 or P-31. Id. at 444. First, the Sureties threatened to stop work on the Projects for anywhere from three to six months, to allow the Sureties to investigate the reasons for default. The District Court found that such a delay would have been \"catastrophic\" to Petrobras, costing it millions of dollars in lost oil and gas revenues per each day that the P-19 and P-31 production facilities were ultimately delayed in being brought on-line. Second, the Sureties continued to refuse to make any effort to determine whether the bonds were valid, thus intimating to Brasoil that, in the event of a default, it could be facing a worst case scenario - i.e., no contractor and no bond. And third, the Sureties refused to indicate whether they would accept control of the Projects if Brasoil were to terminate the Contracts, and even went so far as to suggest that, if Brasoil were to declare a default on the Projects, it would be jeopardizing its ability to obtain bonding for any future work.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See id. at 444-45.\n\nOn March 6, 1997, a Petrobras working group recommended that up to $172 million in direct funding be provided through new blocked accounts to allow the Consortium to complete the P-19, P-31, and P-34 Contracts, with such funding to be acknowledged by contract amendments or debt instruments. See id. at 446. Consequently, between April 23 and December 9, 1997, Brasoil and the Consortium entered into seven letter agreements, of which the Sureties were advised and pursuant to which Brasoil advanced the Consortium funds for the completion of P-19, P-31, and P-34. Pursuant to the first letter, Brasoil advanced $52.6 million, to be deposited into a new set of blocked accounts, with withdrawals to be used exclusively for the Contracts. Each of the letter agreements expressly stated that it did not \"entail [a] novation of any of the contractual rights or obligations assumed by the parties, nor of the [Bonds].\" The initial agreements in this series also noted that Brasoil was considering declarations of default; later agreements would acknowledge that such defaults had indeed been declared. Id.\n\nAfter the April 23 letter agreement took effect, Brasoil was no longer simply advancing the Consortium funds that it had already earned in performing work on the Projects. In fact, after April 23, 1997, Brasoil had begun using its own funds to make direct payments for expenses on the Projects. (Accordingly, the funds deposited in the new set of blocked accounts remained the property of Brasoil.) In addition, around the same time, Brasoil began making direct payments to suppliers independently of the new system of blocked accounts. Of the $52.6 million advanced, \"$28.2 million was used to purchase essential equipment for the P-31 Project and $17.6 million was used to purchase essential equipment for the P-19 Project. The remainder was used for P-34 expenses.\" Id. at 448 (citations omitted). Even this new system, however, did little to stem the ever-rising tide of the Projects' financial-management dilemmas. For example, by May 1997, the Consortium was projecting that work in P-31 during March, April, and May of 1997 would require $82.5 million, eighty percent of which was to be used for essential equipment and materials. But the Consortium had no means to pay for these expenses, as it had not earned enough from the work that it had previously performed on the Projects. Thus, because of the Consortium's negative cash flow, had Brasoil not begun making direct payments as noted above, the Projects would have come to a halt, costing Petrobras (Brasoil's primary \"client\" and indirect parent) millions of dollars per day in lost revenues.\n\nVII. Default Notices\n\nBrasoil formally declared the Consortium to be in default in P-19 on May 12, 1997, and in P-31 on June 16, 1997. As of those dates, the total amounts in the P-19 and P-31 Contracts, including all previously agreed-upon amendments, had been disbursed, yet the work on neither Project had been completed. See id. at 449. The default notices stated that \"despite cancellation of the Consortium's right, . . . [its] obligation to complete the [P]roject remain[ed] intact, and [would] be the subject of new financial arrangements between Brasoil and the Consortium, until subsequent deliberation ha[d] been concluded.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Id. In the subsequent notices to the Sureties informing them that the Consortium had been declared to be in default in P-19 and P-31, \"Brasoil/Petrobras agree[d] to pay the balance of the Contract Price to the [S]ureties,\" but stated that, \"[u]nfortunately, there [was] no balance remaining.\" Id.\n\nThe District Court found that, if anything, the Sureties conducted little more than a token investigation of their options under the Bonds, instead electing to prepare for the litigation that was obviously imminent.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e For example, the court found that, in a May 16, 1997 letter to Petrobras, the Sureties warned Brasoil \"not to take any action in connection with the P-19 Project that might jeopardize the Sureties['] rights to complete the [P-19] [P]roject\" and stated that any further expenditures on the P-19 Project would be considered invalid. Id. at 452. Then, on May 22, 1997, counsel for the Sureties sent Petrobras a \"First Document Request\" that was markedly similar to a discovery demand made pursuant to Fed. R. Civ. P. 34. See id. at 451-52. In fact, the Sureties proposed an \"investigation\" that was entirely unrealistic in scope and duration, threatening to halt work in P-19 alone well into August 1997. See id. at 451. As the District Court noted, time was of the essence on the Projects, and a delay of months would have been catastrophic to Petrobras and Brasoil. See id. at 452.\n\nIn any event, the Sureties declined to take over the Projects, leaving Brasoil to try to minimize its damages by itself completing the Projects. Initially, Brasoil continued to use the Consortium to complete the P-19 Project, paying the Consortium its necessary expenses without any allowance for profit. P-19 was subsequently moved to another shipyard on August 17, 1997. In the fall of 1997, Brasoil discovered that the P-19 platform required extensive repairs due to substandard work done by the Consortium. The repairs were not completed until April 1998. The P-31 Project was completed using several Consortium subcontractors at a substantial additional cost. Finally, in July 1998, Brasoil sold P-31 to a third party. See id. at 452-54.\n\nVIII. Proceedings in the District Court\n\nOn June 26, 1997, Brasoil demanded that the Sureties perform their obligations under the P-19 Bond within fifteen days. Id. at 453. On August 18, 1997, the Sureties denied liability under the Bonds, and filed two separate actions in the District Court. In the first action, the Sureties sought a declaratory judgment that they had no liability to the Obligees under the Bonds. The Obligees counterclaimed for the amounts that they were allegedly owed under the Bonds. In the second action, the Sureties sought indemnification from individual members of the Consortium and from Petrobras, claiming, inter alia, that Petrobras had tortiously interfered with the Consortium's payment obligations to Marubeni America Corporation (\"Marubeni\"), which had provided $38 million in equipment financing to the Consortium in the P-19 Project.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Judge Koeltl consolidated the declaratory judgment action and the tortious interference claim from the indemnity action and severed the Sureties' remaining indemnification claims. The consolidated actions were tried without a jury.\n\nFollowing a bench trial, on July 25, 2002, the District Court issued a 165-page published decision in favor of the Obligees. With respect to liability, first, the District Court found that Brasoil's default termination was valid because the Consortium had defaulted on the Contracts. In particular, the District Court concluded that a default had occurred when Brasoil had exhausted amounts equal to the contract prices before the Consortium had completed the work in the Contracts. Second, the District Court found that all of the contract funds had in fact been exhausted, rejecting the Sureties' arguments that the direct and advance payments made by Brasoil (and Petrobras) should not have been included in determining whether the contract funds had been exhausted. Third, the District Court found that Brasoil had terminated the Contracts in compliance with the Bonds. Fourth, the District Court found that Brasoil had complied with its obligations to pay the Balance of the Contract Price. Fifth, the District Court found that Brasoil had not materially altered the contracts by making direct and advance payments. See generally id. at 476-84.\n\nWith respect to damages, the District Court calculated cost-of-completion damages, pursuant to Paragraph 6.1 of the bonds, to be $174,209,776 and, in addition, awarded the Obligees $62,592,000 in liquidated damages, pursuant to Paragraph 6.3. See id. at 470-72. The court also awarded the Obligees $36,730,905 in attorneys' fees, pursuant to Paragraph 6.2, and $96,475,528 in prejudgment interest. Thus, final judgment was entered in favor of the Obligees in the amount of $370,008,209.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e See Braspetro II, 276 F. Supp. 2d at 469-70. Finally, the District Court dismissed the Sureties' tortious interference claim against Petrobras, finding inter alia that: (i) Petrobras, as the indirect parent of Brasoil, was privileged to act as it did; and (ii) as no further sums were owed to the Consortium under the P-19 Contract at the time of the alleged tortious interference, Petrobras had no obligation to allow the Consortium to use contract funds to pay the third-party lender. See Braspetro I, 219 F. Supp. 2d at 488-89. These timely appeals followed.\n\nDISCUSSION\n\nOn appeal, the Sureties argue that: (1) they are not liable under the Bonds; (2) the District Court's award of damages, attorneys' fees, and prejudgment interest should be reversed; and (3) the Sureties' tortious interference claim was wrongly dismissed. We address each of these points seriatim.\n\nI. The Sureties' Liability Under the Bonds\n\nThe Sureties contend that they are not liable under the Bonds because (a) certain conditions precedent to the Sureties' obligations were not satisfied and (b) Brasoil altered the payment schemes in the Contracts without the Sureties' consent, thereby discharging the Sureties.\n\n\"We review the [D]istrict [C]court's findings of fact for clear error and its conclusions of law de novo.\" Harris Trust \u0026 Sav. Bank v. John Hancock Mut. Life Ins. Co., 302 F.3d 18, 26 (2d Cir. 2002) (citations omitted).\n\nA. Conditions Precedent to the Sureties' Obligations\n\nAs a general matter, we note that \"[t]he status of a 'favorite of the law' once enjoyed by the surety, at a time when most suretyship obligations were uncompensated, is clearly a thing of the past.\" Julia Blackwell Gelinas, Defenses Available to the Surety, in A.B.A., The Law of Performance Bonds 201, 201 (Lawrence R. Moelmann \u0026 John T. Harris eds., 1999) [hereinafter Moelmann \u0026 Harris]. As courts have done for over a century, we look to standard principles of contract interpretation to determine the rights and obligations of a surety under a bond. See generally William H. Woods, Historical Development of Suretyship from Prehistoric Custom to a Century's Experience with the Compensated Corporate Surety, in A.B.A., The Law of Suretyship 3, 30-39 (Edward G. Gallagher ed., 2d ed. 2000).\n\nOne of those principles is that, before a surety's obligations under a bond can mature, the obligee must comply with any conditions precedent. \"A condition precedent is an act or event, other than a lapse of time, which, unless the condition is excused, must occur before a duty to perform a promise in the agreement arises.\" Oppenheimer \u0026 Co. v. Oppenheim, Appel, Dixon \u0026 Co., 86 N.Y.2d 685, 690 (1995) (internal quotation marks omitted). Here, Paragraph 3 of the Bonds contained a number of conditions precedent to the Sureties' obligations under the Bonds. See Braspetro I, 219 F. Supp. 2d at 477.\n\nThe Sureties maintain, in particular, that: (1) the Consortium did not default on the Contracts, as (a) \"exhaustion of contract funds\" is not an \"event of default,\" and (b) in any event, Brasoil did not in fact exhaust the contract funds; (2) Brasoil did not terminate the Consortium's rights under the Contracts; and (3) Brasoil failed to agree to pay the Sureties the \"Balance of the Contract Price,\" as defined in the Bonds. For the reasons set forth below, we reject these arguments and find that all of the conditions precedent to the Sureties' obligations under the Bonds were met.\n\n1. The Consortium's Default Under the Contracts\n\nThe District Court found that (i) the Consortium had a \"fundamental obligation . . . to deliver the completed platforms for the agreed prices\"; (ii) the Consortium was unable to meet this obligation; (iii) that inability constituted a failure to comply with \"clauses, specifications, designs[,] or deadlines\" in the Contracts; and (iv) such a failure was among the events of default specified in the Contracts. Id. at 478. Based on these findings - all of which, we note, are essentially factual in nature - the District Court concluded as a matter of law that the Consortium had defaulted under the Contracts. Id. As our review of the record reveals no clear error in any of the District Court's factual findings recited above, our task is to analyze whether the court was correct in concluding, under Brazilian law, in light of the above facts, that the Consortium defaulted on the Contracts.\n\nBefore turning to our analysis of that conclusion, however, we briefly address the Sureties' contention that the court was incorrect in finding, as a factual matter, that the Consortium was wholly unable to complete the work in the Contracts for the amounts agreed.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The Sureties contend that the District Court's findings regarding the Consortium's default were based \"entirely on the opinion of Paulo Aragão,\" the Obligees' Brazilian law expert. That, however, is simply not As the Obligees correctly note, the District Court's opinion was \"premised on the Contracts, the parties' contemporaneous correspondence, the testimony, and the [Consortium's] admissions that [it] had received the full price, but lacked the funds or credit to continue to perform, and would stop work unless Brasoil gave in to [the Consortium's] demands for money, to which [it was] not entitled under the Contracts.\" Indeed, the record is replete with evidence that both supports the District Court's findings and wholly contradicts the Sureties' position that the Consortium could have completed the Contracts if left to its own devices. For example, the Sureties argue that \"the mere fact that the Consorti[um] may have needed to find money [to complete the Contracts after the contract funds were exhausted] - such as from a third party lender or from [its] own bank accounts - does not mean that [it was] in default under either the Contracts or Brazilian law.\" But, in taking this position, the Sureties entirely overlook the reality of the situation, as described by the Consortium itself in a series of letters from the early months of 1997.\n\nFor example, in a letter from the Consortium to Petrobras dated February 18, 1997, requesting that additional monies be deposited in the blocked accounts so that the Consortium could continue the work in P-19 and P-31, the Consortium plainly stated that it was unable to increase its level of debt. Likewise, in a letter dated March 26, 1997, the Consortium admitted that the original Contract amounts were insufficient to complete the work in P-19 and P-31 and requested additional monies, describing these as \"essential for continuing the work, [that is,] for the purpose of completing the [P]rojects.\" Then, beginning in April 1997, in a series of letter agreements, the Consortium requested that \"steps be taken to obtain the additional resources necessary to continue the services under the [C]ontracts . . . , since the balances of the [Contracts were] exhausted.\" These communications reveal that the Consortium had exhausted its cash reserves, had no available credit on which to draw, and, without additional funding from the Obligees, would have been forced to bring the Projects to a halt. In light of these facts, we find no error in the District Court's finding that the Consortium was unable to complete the Contracts for the agreed amounts.\n\nWe next turn our attention to whether, as the Sureties argue, exhaustion of the contract funds was an event of default under Brazilian law, which is a different question altogether. As a preliminary matter, we note that Fed. R. Civ. P. 44.1 states that:\n\nA party who intends to raise an issue concerning the law of a foreign country shall give notice by pleadings or other reasonable written notice. The court, in determining foreign law, may consider any relevant material or source, including testimony, whether or not submitted by a party or admissible under the Federal Rules of Evidence.\n\nAnd, as we have stated, \"pursuant to Fed. R. Civ. P. 44.1, a court's determination of foreign law is treated as a question of law, which is subject to de novo review.\" Curley v. AMR Corp., 153 F.3d 5, 11 (2d Cir. 1998).\n\nHere, as the Obligees point out, the District Court's interpretation of Brazilian law on the issue of whether exhaustion of the contract funds constituted an event of default was informed by a summary report on Brazilian law, prepared by Paulo Aragão. See Braspetro I, 219 F. Supp. 2d at 478. The court decided this issue, based on Aragão's report and trial testimony, in a relatively straightforward manner and apparently without the Sureties' challenging either the contents of Aragão's report or his credibility at trial. On appeal, however, the Sureties have vigorously disputed Aragão's view on this issue and, taking this dispute to an entirely new level, the parties have advanced competing views on whether exhaustion of the contract funds may have constituted an anticipatory repudiation of the Contracts. More fundamentally, the parties and their experts hotly dispute whether the doctrine of anticipatory repudiation is even recognized in Brazilian law.\n\nMindful of \"the difficulty of applying Brazilian law,\" Panama Processes, S.A. v. Cities Serv. Co., 789 F.2d 991, 995 (2d Cir. 1986), we think it helpful first to examine the differences between immediate breach and anticipatory repudiation, as established in American law:\n\nFailure by [a] promisor to perform at the time indicated for performance in the contract establishes an immediate breach. But the promisor's renunciation of a contractual duty before the time fixed in the contract for . . . performance is a repudiation. Such a repudiation ripens into a breach prior to the time for performance only if the promisee elects to treat it as such.\n\nFranconia Assocs. v. United States, 536 U.S. 129, 142-43 (2002) (internal quotation marks omitted; citing, inter alia, Restatement (Second) of Contracts §§ 235(2), 250 (1979)); see Roehm v. Horst, 178 U.S. 1, 13 (1900) (explaining that repudiation \"give[s] the promisee the right of electing either to . . . wait till the time for [the promisor's] performance has arrived, or to act upon [the renunciation] and treat it as a final assertion by the promisor that he is no longer bound by the contract\"). Thus, in American law, a fundamental difference between an immediate breach and an anticipatory repudiation is whether the object of the promise - i.e., performance - is due at present or in the future. In other words, in a case where performance is withheld and is presently due, the doctrine of anticipatory repudiation is wholly inapplicable.\n\nHere, there is no dispute that, at the time of the declarations of default, the Consortium was presently obligated to perform under the Contracts. Moreover, the Consortium, in informing the Obligees that it was unable to continue without additional funding and/or financing from them, was admitting its inability to perform under the Contracts in the present, not at some point in the future.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Therefore, we conclude that at least one point on which the parties and their experts disagree - that is, whether the doctrine of anticipatory repudiation is recognized in Brazilian law - is of no moment.\n\nWhat is relevant, however, is a point on which the Brazilian experts and authorities cited by the parties all agree - that, under Brazilian law, as under American law, where performance of the promisor's obligation is presently due, but has become impossible due to some established, verifiable occurrence or circumstance, an immediate, or present, breach has occurred.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Thus, under either Brazilian or American law, the pertinent inquiry is whether the Consortium's inability to complete the Contracts for the agreed prices constituted an immediate and present breach. We conclude that it did.\n\nIn the spring of 1997, when the Obligees declared the Consortium in default, performance on the part of the Consortium certainly was presently due. Indeed, the Projects were well underway. By the Consortium's own admissions, however, completion of the Projects by the Consortium for the agreed prices in the Contracts had become impossible due to a host of factors, including, not least, underbidding of the Contracts by the Consortium, as well as changes in the global market for conversion projects. See Braspetro I, 219 F. Supp. 2d at 442. Once the funds in the Contracts had been exhausted, the Consortium freely admitted that it could not complete the Projects with its own resources and consistently communicated to the Obligees a thinly-veiled threat that, without additional funding or financing from them, the Projects were going to come to a halt, which would have represented an enormous monetary loss to the Obligees. See id. at 445.\n\nThese facts constituted established, verifiable occurrences or circumstances demonstrating the impossibility of the Consortium's performance. Thus, under Brazilian law, we conclude that the Consortium's inability to proceed without additional monies beyond the amounts in the Contracts constituted an immediate, actual breach of the Contracts.\n\nIndeed, to hold otherwise would set a most troubling precedent. Were we to hold that the Consortium could not have been in breach until delivery of the P-19 and P-31 facilities was due, as the Sureties and their experts seem to urge, then, for example, where a contractor had seriously underbid a large-scale, multi-year construction contract and, early on, exhausted its own funds and financing in trying to complete the work (as did the Consortium), the owner could not claim a breach until the anticipated date of delivery had arrived. This would unfairly place the burden of the contractor's non-performance on the owner, inevitably lead to a greater volume of litigation, and inefficiently increase the costs of large-scale construction projects.\n\nOn a final note, the Sureties also argue on appeal that, even if exhaustion of the contract funds is an event of default under Brazilian law, the funds in the P-19 and P-31 Contracts were never in fact exhausted and, therefore, the Consortium was not in default. Specifically, the Sureties argue that the direct and advance payments made by the Obligees were extra-contractual payments or \"loans,\" and, thus, that the District Court's finding that these payments were made \"under the Contracts\" - in particular, that the payments were being used to pay for the completion of the Contracts and were to be set off by later progress payments - was clearly erroneous.\n\nOur review of the record has unearthed nothing to suggest that the District Court's findings relating to the nature and extent of the direct and advance payments were clearly erroneous. In particular, the court found that:\n\nOn April 23, 1997, Brasoil and the Consorti[um] entered into the first of seven letter agreements . . . whereby Brasoil made funds available for the completion of the P-19, P-31, and P-34 Contracts. . . . The initial agreements in the series . . . noted that Brasoil was considering declarations of Contractor default, and later agreements acknowledged that such defaults had been declared.\n\nThe direct payments pursuant to the letter agreements enabled the Consorti[um] to continue work on the [P]rojects.\n\nThe April 23, 1997 letter expressly stated that it was not a novation of the original Contracts. [Dr. David Fischel, a Consortium project manager who oversaw the Projects,] testified that he understood [that] the letter did not change any of the duties and responsibilities of the parties under the [C]ontracts. This letter and its successors did not alter the price or compensation arrangements of the . . . [C]ontracts. Brasoil expressly stated that it was considering declaring contractor defaults under the . . . [B]onds. Thus, there was no commitment to keep the Consorti[um] on the job through the completion of the [C]ontracts. There was also no commitment on the part of Brasoil to advance additional funds in subsequent months or to provide funding for any particular expenses. The Sureties were advised of the April 23, 1997 letter because Dr. Fischel discussed the letter with the Sureties' American counsel.\n\nOf the $52.6 million advance provided by Brasoil pursuant to the April 23, 1997 letter agreement, $28.2 million was used to purchase essential equipment for the P-31 Project and $17.6 million was used to purchase essential equipment for the P-19 Project.\n\nThe Petrobras Defendants did not enter into a blanket commitment to fund all of the Consorti[um]'s costs until completion of the [P]rojects. The [Obligees] proceeded on a step by step basis[,] . . . select[ing] what they wished to pay for from the lists submitted by the Consorti[um].\n\nOn May 6 and May 9, 1997, the Consorti[um] signed letter agreements acknowledging that Brasoil would advance an additional $74.32 million for expenses necessary to complete the P-19 and P-31 [P]rojects.\n\nThe system whereby Brasoil made direct payments of expenses had been in effect for less than three weeks when, on May 12, 1997, Brasoil formally declared the . . . Consortium to be in default under the P-19 Contract.\n\nThe direct payment regime was in effect for approximately eight weeks for P-31, which was declared in default on June 16, 1997. A total of $43.44 million was spent to cover necessary P-31 job expenses for April and May. The Sureties were not prejudiced by these expenditures . . . because the payments were used to complete the P-31 Project and would have been necessary in any case.\n\nBraspetro I, 219 F. Supp. 2d at 447-49 (citations omitted).\n\nTo reiterate, as the court noted and as the Sureties were aware, the Obligees made no commitment to keep the Consortium on the job post-default, nor any commitment to advance additional funds or to provide funding for any specific expenses. Id. at 448. Moreover, the direct and advance payments were \"used to purchase essential equipment\" on the Projects and \"would have been necessary in any case.\" Id. at 448, 449. Our review of the record reveals no clear error in the District Court's comprehensive fact-finding on this point, and, thus, we find no merit in the Sureties' contention that the direct and advance payments were extra-contractual payments or loans.\n\nFinally, even if we were to conclude that the direct and advance payment were \"loans\" from the Obligees to the Consortium, under New York law, the mere fact that the Consortium made such \"loans\" would not discharge the Sureties' obligations under the Bonds, because any such \"loans\" would have been made not for the benefit of the Consortium but for the sole purpose of keeping the Projects on track while a \"global solution\" was sought. See id. at 450. Indeed, the rule is well settled that \"[i]f the owner to relieve the contractor's distress had loaned to him at any time a sum of money[,] it would be hypercritical to hold that he had thereby lessened the incentive of the contractor to finish his contract, and thereby release the surety.\" British Am. Tobacco Co. v. U.S. Fid. \u0026 Guar. Co., 177 A.D. 582, 583 (1st Dep't 1917); see also St. John's College v. Aetna Indem. Co., 201 N.Y. 335, 342 (1911):\n\n[A] temporary loan for the express purpose of preventing an abandonment of the contract by the contractors and to avoid labor troubles[, and] not made simply as a loan for the benefit of the contractors, but also for the benefit of the owner and the defendant in case of a failure on the part of the contractors to complete their work[,] . . . is not within the reason of the rule that prevents a recovery against a surety when his contract has been materially changed. [Such] payments made cannot, under any view that can be taken of them, be said to remove in any degree the incentive that the contractor[] had prior thereto for completing the contract.\n\nIndeed, were we to discharge the Sureties on the basis of any such so-called loans, \"it would be both harsh and unjust\" to the Obligees. See St. John's College, 201 N.Y. at 342.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Accordingly, we affirm the District Court's findings (i) that the contract funds were exhausted when the termination notices were sent to the Consortium, and (ii) that the condition precedent requiring that the Contracts be in default at the time of the termination notices was satisfied.\n\n2. Termination of the Consortium's Rights Under the Contracts\n\nAnother condition precedent to the Sureties' obligations under the Bonds was a clear notice of default terminating the Consortium's rights under the Contracts. Braspetro I, 219 F. Supp. 2d at 477.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The District Court found that the Obligees had complied with this condition precedent, since the termination notices sent by Petrobras plainly declared the Consortium in default on the Contracts and terminated the Consortium's right to complete the Contracts. Id. at 449 (regarding P-19); see also id. at 452 (regarding P-31). On appeal, the Sureties argue that these termination notices were not clear because (i) they stated that the obligations of the Consortium to complete the Contracts remained intact, and (ii) the Consortium continued to work on the Projects for some period of time thereafter.\n\nContrary to the Sureties' assertion, Brasoil did, in fact, expressly and unequivocally terminate the Consortium's \"right . . . to complete the [P-19] [P]roject\" (on May 12, 1997), and the Consortium's \"right . . . to complete the work\" in the P-31 Project (on June 16, 1997). This alone is sufficient to distinguish the instant case from those in which courts have found that the contractor default was not declared with sufficient clarity. See, e.g., L \u0026 A Contracting, 17 F.3d at 111 (finding that \"evidence [was] insufficient as a matter of law to establish a declaration of default\" where \"[n]one of the letters [obligee-general contractor] sent to [principal-subcontractor] and [surety] even contained the word 'default'\" and where \"other items of correspondence\" did not contain an \"unequivocal declaration of default\").\n\nFurther, the particular language used by Brasoil in the default notices is not only a form of termination of a contractor's rights that is generally recognized in the suretyship context, see William S. Piper, The Surety's Investigation, in Bond Default Manual, supra note 3, at 28-29, but also a form of termination that comports with the language in the Bonds themselves, which, as we have noted, were standard-form contracts, carefully drafted by sophisticated lawyers familiar with the conventions of the construction industry, see Int'l Fid. Ins. Co. v. County of Rockland, 98 F. Supp. 2d 400, 413 (S.D.N.Y. 2000); see generally John H. Gregory \u0026 Michael Jay Rune, II, Liability of the Performance Bond Surety (Under Contract of Suretyship), in Moelmann \u0026 Harris 123, 128-29; 5 Construction Law ¶ 17.05 (Steven G.M. Stein et al. eds., 2004). Moreover, while the Bonds required Brasoil, in declaring a default, to \"formally terminate[] the [Consortium's] right to complete the [C]ontract[s],\" there was nothing in the Bonds or the Contracts to suggest any particular method for declaring a default. Cf., e.g., Dragon Constr., Inc. v. Parkway Bank \u0026 Trust, 678 N.E.2d 55, 56, 58 (Ill. App. Ct. 1997) (finding that bond was void where obligee did not follow the specific termination and notification procedures provided in the contract, which was incorporated by reference in the bond).\n\nNor does the fact that the Consortium remained on the Projects for some time post-default alter the fact that the Consortium's rights under the Contracts had been terminated. All of the Consortium's work on the Projects subsequent to the Obligees' declarations of default was subject to \"new financial arrangements\" between Brasoil and the Consortium, arrangements that were entered into subsequent to the declarations of default and independent of the Contracts. See Braspetro I, 219 F. Supp. 2d at 449. Moreover, the District Court found that the Obligees had a duty to mitigate their damages and that keeping the Consortium on the Projects post-default was, given the exorbitant expense that moving the platforms would have represented, a form of mitigation. See id. at 451, 482-83. Thus, this case is plainly distinguishable from those in which a court released a surety on the grounds that the obligee-owner simply \"allowed\" the defaulting contractor to remain on the job to finish the contract. See, e.g., Balfour Beatty Constr., 986 F. Supp. at 86 (finding that the surety was discharged where the obligee-general contractor \"allowed [the defaulting subcontractor] to complete the project,\" failed to notify the surety of the default, and thereby \"den[ied] the [surety] the opportunity to exercise any of its options under the performance bond\"). For our part, we find no error in the District Court's fact-finding or reasoning regarding the Obligees' efforts to mitigate their damages.\n\nAs noted above, the District Court found that \"[t]he [Obligees] plainly stated that they were declaring a default, and the declaration occurred under circumstances . . . that would have made it clear that the [Obligees] were declaring a default if any uncertainty did exist.\" See Braspetro I, 219 F. Supp. 2d at 450-51. Our review of the record reveals no clear error in the court's factual findings on this issue, and we affirm the District Court's ultimate conclusion that the May 12 and June 16 default notices clearly terminated the Consortium's rights under the Contracts.\n\n3. The Balance of the Contract Price\n\nAs another condition precedent to the sureties' Obligations under the Bonds, the Obligees, after declaring the Consortium in default, were required to pay the Sureties the \"Balance of the Contract Price\" in each of the Contracts (collectively, the \"Balances\"). Each of the Bonds defined the Balance of the Contract Price as \"[t]he total amount payable . . . under the . . . Contract after all proper adjustments ha[d] been made . . . reduced by all valid and proper payments made to or on behalf of [the Consortium] under the . . . Contract\" - a not atypical provision.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOn appeal, the Sureties argue that the Obligees failed to comply with this condition precedent and that the District Court erred in finding that they had so complied - in particular, that the court erroneously counted toward the Balances certain payments that had been made by the Obligees to the Consortium but that, according to the Sureties, were not \"valid and proper payments made to or on behalf of the [Consortium] under the . . . Contract[s],\" as required by the Bonds. For a number of reasons, we find no merit in the Sureties' argument.\n\nFirst, in determining whether the Obligees complied with this condition precedent, the relevant inquiry is whether the Obligees actually agreed to pay the Balance of the Contract Price - not, as the Sureties urge, whether the Obligees agreed with the Sureties' assessment of what the respective Balances were at the time of the declarations of default. With the former inquiry in mind, we note the District Court's findings:\n\nOn May 12, 1997, the [Obligees] sent letters to the . . . Consortium and to the Sureties declaring a default under the P-19 Contract and terminating the . . . Consortium's right to complete the project. . . . In their notice to the Sureties, the [Obligees] stated: \"Pursuant to paragraph 3.3 of the [P-19] Bond . . . Petrobras/Brasoil agrees to pay the [B]alance of the Contract Price to the [S]ureties. Unfortunately there is no balance remaining.\"\n\nOn June 16, 1997, the [Obligees] declared the . . . Consortium to be in default [in P-31] and demanded that the Sureties perform under the [P-31 Bond]. . . . In the notice to the Sureties, the [Obligees] . . . informed the Sureties that [the Obligees] agreed to pay the [B]alance of the [C]ontract [P]rice pursuant to ¶ 3.3 of the [P-31] Bond, but that no balance remained.\n\nId. at 449, 452 (citations omitted). Our review of the record reveals no clear error in any of these findings. In light of the foregoing facts, the Sureties - although they may have disagreed with the Obligees' position that the Balances remaining due under the Contracts were zero - cannot reasonably maintain that the Obligees did not agree to pay the Balance of the Contract Price, nor can we gainsay the court's ultimate finding that the Obligees agreed to pay the Sureties the Balances as required under the Bonds.\n\nSecond, the thrust of the Sureties' argument here - that the District Court improperly allowed for \"extra-contractual loans\" and payments \"outside the contract\" to be counted toward the Balances, and thus erred in concluding that the Balances had been exhausted by the time the Consortium was declared in default on the Contracts - appears to be based on nothing more than a strained and self-serving interpretation of the relevant language in the Bonds. In particular, as noted above, paragraph 12.1 of the Bonds provided that the Balance of the Contract Price was properly \"reduced by all valid and proper payments made to or on behalf of the [Consortium] under the . . . Contract[s].\" In addition, paragraph 7 provided that the Balance of the Contract Price was not to \"be reduced or set off on account of any . . . obligations\" of the Consortium that were \"unrelated to the [Contracts].\" The Sureties insist that paragraph 12.1, as informed by paragraph 7, applies only to payments made in strict accordance with the payment schedules in the original Contracts, and that, in light of this limitation, advances made beyond earned percentages and payments made pursuant to contract amendments may not be counted as \"valid and proper payments . . . under the . . . Contract[s].\"\n\nWe find the Sureties' interpretation of the Bonds inconsistent with their plain meaning and with the underlying purpose of the Sureties' undertaking (i.e., to secure the Obligees' right to performance under the Contracts), and we therefore reject it. The plain language of the Bonds reveals the parties' intent that, in the event of default, all valid and proper payments under the Contracts were to be deducted from the Balance of the Contract Price. The only limiting language is found in paragraph 7, which excludes only those obligations found, in fact, to be unrelated to the Contracts. Here, the facts in the record demonstrate that the payments deducted from the Balance of the Contract price were related to the Contracts. Therefore, we concur in the District Court's conclusion that all payments related to the Contracts were properly deducted from the Balances as provided in the Bonds.\n\nAnd finally, insofar as the Sureties dispute the District Court's determination as to how and when the Balances were exhausted, that dispute is a factual one. We note that the District Court heard extensive testimony and reviewed volumes of evidence on this issue before finding, as a matter of fact, how and when the Obligees had exhausted the Balance of the Contract Price in each of the Contracts. See generally Braspetro I, 219 F. Supp. 2d at 450-52. Specifically, regarding P-19, the court found that:\n\nBrasoil's cumulative payments on P-19 exceeded the adjusted contract balance of the P-19 Contract in or about January 1997. . . . Brasoil spent approximately $55.6 million over the [P-19 Contract] schedule . . . prior to the declaration of default.\n\nOf this amount approximately 69% was spent on equipment and materials, 17% was spent on labor and 15% on other cost categories such as \"as new\" material and equipment, consumables, rentals, classification, and maneuvering. All of the money was spent on valid [P]roject costs.\n\nId. at 450 (citations omitted). And regarding P-31, the court found that:\n\nThe adjusted contract balance on the P-31 Contract was exhausted, and there was no \"Balance of the Contract Price\" to be tendered to the Sureties under the P-31 Bond because Brasoil had paid more than the adjusted contract price to the . . . Consortium for expenses that were proper under the P-31 Contract prior to the declaration of default. Specifically, Brasoil spent $61.6 million on P-31 in excess of [P-31 Contract] payments prior to the default date. 81% of the $61.6 million was spent on equipment for P-31, 9% was spent on labor, and the balance [was spent] on other essential project costs such as equipment rental and overhead.\n\nId. at 452 (citations omitted). Having reviewed the record, we find no clear error in the court's factual findings regarding how and when the Balances were exhausted.\n\nFor all the foregoing reasons, we affirm those portions of the judgments of the District Court finding that the Obligees complied with all conditions precedent to the Sureties' obligations under the Bonds.\n\nB. The Amendments to the Contracts and the Direct and Advance Payments\n\nAs a general matter, it is well established that sureties on a bond have no right to insist upon a \"sacrosanct prohibition of change.\" United States v. McMullen, 222 U.S. 460, 468 (1912) (Holmes, J.). If a principal and an obligee modify a bonded contract, and the surety consents thereto, the law has no objection to any such modification, and the surety will not be discharged from its obligations under the bond. See id.; see generally 5 Construction Law ¶ 17.07[4][b][iii], at 17-88 (\"[T]he modern view is that the surety's obligations . . . will not be discharged . . . if the surety . . . acquiesces [in] the modification.\").\n\nWhether the surety has consented \"is simply a question of construction and good sense, taking words and circumstances into account.\" McMullen, 222 U.S. at 468; see Tide Water Oil Co. v. Globe Indem. Co., 238 F. 157, 158 (2d Cir. 1916); see generally Arthur Adelbert Stearns \u0026 James L. Elder, The Law of Suretyship § 6.13, at 129-30 (5th ed. 1951) [hereinafter Stearns on Suretyship]. Further, it is generally recognized that such consent need not have been \"expressly given, but may be implied from the surrounding circumstances or from [the surety's] conduct.\"\n\nStearns on Suretyship § 6.13, at 129. In analyzing such conduct, \"[t]he reasonable and probable fix the bounds of contemplation.\" Assets Realization Co. v. Roth, 226 N.Y. 370, 377 (1919) (Cardozo, J.).\n\nMoreover, even where a surety has not consented to a change in the bonded contract, to discharge a compensated surety from its bond, the change must increase the surety's risk, be material or substantial, or be prejudicial to the surety. St. John's College, 201 N.Y. at 341; see also Aniero Concrete Co. v. New York City Sch. Constr. Auth., 1998 U.S. Dist. LEXIS 3938, at *39-40 (S.D.N.Y. Mar. 30, 1998).\n\nOn appeal, the Sureties argue that they did not consent to the Obligees' implementation of the direct and advance payment system and, moreover, that this system constituted a material alteration of the Contracts that resulted in prejudice to the Sureties. In particular, the Sureties contend that the Obligees, in amending the Contracts and making the direct and advance payments, exhausted the monies in the Contracts prematurely, leaving the Sureties empty-handed but on the hook for the costs of completion. Ultimately, the Sureties argue, these changes discharged the Sureties from their obligations under the Bonds.\n\nIn point of fact, the Sureties' contention that they did not consent to the amendments or to the direct and advance payments is belied by the Sureties' refusal to object to any of the changes once the Obligees had informed the Sureties that the changes had been implemented.\n\nSpecifically, the District Court found that:\n\nDuring [a July 18, 1996 meeting], Petrobras gave USF \u0026 G full details concerning the direct payments Petrobras was making to equipment suppliers and IVI's financial projection that the projects would result in an $89 million cost overrun.\n\nMr. Wilson[, an attorney who was the head of USF \u0026 G's surety claims department between 1992 and April 1998,] . . . testified that USF \u0026 G was fully informed about the direct payments and did not object to them or tell Petrobras to stop making them. David [Fischel] testified credibly that following his July 1996 meeting with Mr. Wilson, he kept Mr. Wilson informed of the deficit projections on the projects and the reasons for them.\n\n[Moreover], the Sureties avoided telling Petrobras to stop making direct payments to equipment suppliers or that such payments were in violation of any contracts.\n\nId. at 438 (citations omitted). Having reviewed the record, we find no clear error in these findings. The record discloses that the Sureties, while attempting to effect a \"reservation of rights\" in certain communications with the Obligees, simply stood by, took no action, and offered no opinion while the Obligees amended the Contracts and implemented the system of direct and advance payments, both of which actions were taken for the sole purpose of keeping the Projects afloat and moving forward.\n\nIt is well settled that \"[t]he law does not favor the indifferent, unseeing surety who fails to help himself.\" St. Paul Fire \u0026 Marine Ins. Co. v. Commodity Credit Corp., 646 F.2d 1064, 1072-73 (5th Cir. 1981) (citing Magee v. Manhattan Life Ins. Co., 92 U.S. 93, 98 (1875)). And, as we have stated, \"[t]he policy behind surety bonds is not to protect a surety from its own laziness or poorly considered decision.\" Cam-Ful Indus. v. Fid. \u0026 Deposit Co., 922 F.2d 156, 162 (2d Cir. 1991); see, e.g., Mohasco Indus., Inc. v. Giffen Indus., Inc., 335 F. Supp. 493, 497 (S.D.N.Y. 1971) (\"A surety cannot rest supinely, close his eyes, and fail to seek important information, and then seek to avoid liability under the guaranty by claiming he was not supplied with such information.\" (internal quotation marks omitted)). In light of these principles, and in view of the most reasonable and probable construction of the Sureties' conduct under the circumstances, see Assets Realization Co., 226 N.Y. at 377, we conclude that the Sureties consented to the amendments to the Contracts and to the Obligees' implementation and operation of the direct and advance payment system.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nWe also reject the Sureties' contention that they were prejudiced by the steps that the Obligees took, as the Sureties describe it, to \"prop up\" the Consortium. The Sureties assert that they or the Obligees could, at considerable savings, have brought in another contractor before the funds in the Contracts were exhausted. The District Court, however, found that the Obligees had no right to terminate the Contracts before the contract funds had been exhausted, and that the Obligees' continued funding of the Consortium's efforts, subsequent to the exhaustion of contract funds and declarations of default, cost the Obligees less than bringing in another contractor would have, even if that were possible, which is uncertain at best. See Braspetro I, 219 F. Supp. 2d at 430-31, 451. Moreover, as the District Court noted, \"the Sureties plainly attempted to discourage any declaration of default,\" and, in any event, the Obligees were under no obligation to declare a default at the earliest possible moment.\" Id. at 450. Our review of the record reveals no clear error in the District Court's factual findings regarding these issues specifically or regarding the status of the Projects in 1997 generally.\n\nFurther, we find no error in the District Court's finding that (i) the Obligees had a duty under the Bonds to mitigate their damages, and (ii) that, in requiring the Consortium to continue working on the Projects post-default, subject to \"new financial arrangements between [Brasoil] and the Consortium,\" the Obligees acted in accordance with that duty. See id. at 449. It is notable in this regard that the Obligees worded the notices of default carefully to terminate the Consortium's right, but not its obligation, to complete the Contracts. Indeed, in taking steps to ensure that the Consortium could not simply abandon the Projects, the Obligees were acting not only in their own interests, but also in the interests of the Sureties, who were, after all, obligated under the Bonds for the costs of completing the Contracts (as discussed below).\n\nSimilarly, we find no merit in the Sureties' contention that the Obligees's post-default funding of the Consortium's work on the Projects prejudiced the Sureties because they could have called in the second low bidder on each of the Contracts to complete them after the declarations of default. First, once the Contracts were awarded and the original bid bonds discharged,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e the original bidders had no obligation and, more importantly, no incentive to honor those bids. We can only imagine the enthusiasm with which those earlier, unsuccessful bidders would have approached the Projects, had the Obligees called out for help two years after the original bids were submitted and rejected, and with costs on the Contracts having skyrocketed out of control by hundreds of millions of dollars. Second, there is simply nothing in the record to support the view that the Obligees had any reasonable alternative to requiring the Consortium to continue working on the Projects post-default, subject to new financial arrangements.\n\nThird, we consider the Obligees' actions not in a vacuum, but in light of the fact that the Sureties informed the Obligees on a number of occasions that the Projects would have to grind to a halt for up to six months while the Sureties investigated and before they would take any action under the Bonds. During that time, the Obligees would have had to fend for themselves to keep the Projects afloat. As the District Court noted, \"[t]he Sureties only made a token effort to explore the possibility of taking over the Contracts[;] . . . did not seriously pursue the option of bringing in a replacement contractor[; and] . . . did not set about conducting any good faith investigation of their options under the Performance Bonds[,] but rather continued their efforts to prepare for litigation and to develop litigation positions while characterizing their activities as [an] 'investigation.'\" Id. at 451. Indeed, the Obligees were not even reasonably certain that, subsequent to some protracted \"investigation,\" the Sureties would honor the Bonds, as the Sureties had flatly refused to concede even that the Bonds were valid under Brazilian law. See id. While we have stated that a surety cannot be held liable beyond the face value, or \"penal sum,\" of a bond for breaching a duty of good faith under the bond, see United States v. Seaboard Sur. Co., 817 F.2d 956, 964 (2d Cir. 1987); see generally 5 Construction Law ¶ 17.09[1], this is not to say that a surety has no duty to act in good faith under its bond. To the contrary, under New York law, there is an implied duty of good faith and fair dealing in every contract,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and surety bonds are no exception. Here, we observe that the Sureties, in artfully dodging the issue of the validity of the Bonds, and in persistently threatening to stop work on the Projects for up to six months, stretched the definition of \"good faith and fair dealing\" to its limits. In contrast, the Obligees acted both reasonably and in good faith, which is significant in determining whether, in fact, the Sureties were prejudiced by the Obligees' actions. See Transamerica Ins. Co. v. City of Kennewick, 785 F.2d 660, 662 (9th Cir. 1986) (per curiam) (finding under state law that only negligent conduct on part of obligee disentitled it to good-faith defense to surety's claim of prejudice); accord Argonaut Ins. Co. v. Town of Cloverdale, 699 F.2d 417, 420 (7th Cir. 1983).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nUltimately, however, what is most significant is that the District Court found that the monies associated with the amendments and the direct and advance payments were used for the sole purpose of completing the Contracts. See Braspetro I, 219 F. Supp. 2d at 481-82. In light of that finding, which the Sureties have not challenged on appeal, it is clear that, while the amendments and the direct and advance payments may have reduced the Sureties' access to remaining contract funds to cover the costs of completion, those costs were directly reduced, thereby \"reliev[ing] the Sureties of performance obligations that they otherwise would have had.\"\n\nId. at 482.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Nor did the Obligees' continued employment of the Consortium post-default impair the Sureties' interests, because the Consortium was employed for the sole purpose of completing the Contracts in what the Obligees determined to be the most economical manner under the circumstances , i.e., by supporting the Consortium's efforts to complete the Projects. (Indeed, this is hardly an uncommon scenario. See generally 5 Construction Law ¶ 17.07[9][a].)\n\nConsidering the foregoing facts, and in light of the status of the Contracts in May and June of 1997 (in particular, the titanic difficulty and expense that locating alternate facilities and personnel to complete the Projects would have represented at that time), we find no error in the District Court's fact-finding on this point. The Obligees had no reasonable alternative but to maintain the status quo by requiring the Consortium to continue working on the Projects, pursuant to new, post-default financial arrangements between the Consortium and Brasoil; and the monies expended by the Obligees toward this end would have been spent on the Projects in any case.\n\nFinally, the Sureties contend that the District Court erred in finding that neither the amendments nor the direct and advance payments diminished the Consortium's incentive to complete the Contracts. See Braspetro I, 219 F. Supp. 2d at 457, 482. We find no merit in this contention.\n\nHere, the District Court found that the amendments to the Contracts were neither material nor prejudicial to the Sureties because:\n\n[t]he amendments did not reduce the Consorti[um]'s incentive to work on or to complete the jobs. By allowing the Consorti[um] to continue construction, the amendments postponed the date of the Contractor Default and relieved the Sureties of performance obligations that they otherwise would have had. Nor could the amendments be considered \"significant\" or \"material\" in the context of the [C]ontracts as a whole. The total amount due under the [C]ontracts and the technical requirements of the [C]ontracts remained exactly the same.\n\nId. at 482. Similarly, the court found that the direct and advance payments were neither material nor prejudicial because the payments \"did not change the parties' obligations under the [C]ontracts.\" Id.\n\nSimple logic demonstrates that, once the Consortium had conceded the impossibility of its completing the Contracts as agreed, the Consortium's incentive to complete the Contracts could \"[]not assert itself as contemplated\" and, thus, \"cease[d] to have any value as security either to the [Obligees] or to the [Sureties].\" Arant, supra note 26, at 848. Indeed, that incentive \"was rendered impotent by the circumstances [that] produced the [Consortium's] disability to proceed.\" Id.; see also St. John's College, 201 N.Y. at 342. Thus, we find no error in the District Court's finding that the Consortium's incentive to complete the Contracts was not lessened either by the amendments thereto or by the direct and advance payments.\n\nWe note that the facts underlying these appeals - i.e., the impossibility of the Consortium completing the Contracts as agreed - fall neatly within the compass of the cited authorities. In light of the foregoing, we conclude that the Sureties were not prejudiced in any way by the amendments to the Contracts or by the direct and advance payments.\n\nIn the final analysis, the Bonds were \"given for the security and benefit of [the Obligees],\" and we believe that to sustain the Sureties' arguments relating to their liability under the Bonds \"would be putting a construction upon the . . . [Bonds that] might practically defeat the purposes for which [they were] given.\" First Presbyterian Church v. Housel, 115 Ill. App. 230, 239 (1904).\n\nAccordingly, we affirm those portions of the judgments of the District Court finding the Sureties liable to the Obligees under the Bonds.\n\nII. Damages, Attorneys' Fees \u0026 Prejudgment Interest\n\nWe next turn to the Sureties's contention that the District Court's monetary award should be reversed because: (a) the court's cost-of-completion damages calculation was fundamentally flawed; (b) the multas moratórias clauses in the Contracts were not enforceable as liquidated damages provisions under New York law; (c) the Bonds did not obligate the Sureties to pay the Obligees' attorneys' fees incurred in litigation between them over the Bonds; and (d) the court's award of prejudgment interest was inconsistent with New York law.\n\nA. Cost-of-Completion Damages\n\nAccording to the maxims of basic suretyship law, and pursuant to paragraph 6.1 in the Bonds, the Sureties were responsible, in the event of default by the Consortium, for the cost of the \"completion of the . . . Contract[s].\"\n\nUnder a performance and completion bond, a surety generally has two options upon its principal's default. First, the surety may undertake to complete the principal's work itself; this obligation may be satisfied by the surety funding the principal to complete its work. Second, the surety has the option of paying the obligee under the bond its damages, essentially the obligee's cost of completion.\n\nGranite Computer Leasing Corp. v. Travelers Indem. Co., 894 F.2d 547, 551 (2d Cir. 1990) (citations omitted); see also Seaboard Sur. Co., 817 F.2d at 959. Because the Sureties chose not, either on their own or through agents, to incur the costs of completion, the Sureties must reimburse the Obligees for those costs in the form of an award of damages.\n\nIn his decision, Judge Koeltl limited the amount of cost-of-completion damages to \"the costs that were incurred [by Brasoil] after the default was declared and the Sureties refused to fulfill their obligation to either perform the remainder of the Contract[s] or pay the damages resulting from their failure to do so.\" Braspetro I, 219 F. Supp. 2d at 471. In calculating the amount of cost-of-completion damages, however, Judge Koeltl expressly based the award on the amounts of monies that the Obligees' expert had testified were spent by Brasoil in completing the Contracts after the contractor defaults were declared. See id. at 470-72. The Sureties argue that the District Court misapprehended the law and grossly miscalculated the amount of the cost-of-completion damages; that, in calculating the proper measure of damages, the amount of monies spent after the date of default is irrelevant; and that such post-default expenditures necessarily included many payments for \"costs incurred\" prior to the declared default. The Sureties also argue that for the court to have held them liable for the monies spent by Brasoil in completing the Contracts after the Consortium had defaulted effectively transformed the Bonds from performance bonds into payment bonds. For a number of reasons, we find the Sureties' arguments unpersuasive.\n\nFirst, the utility of a rule of damages that looked to \"costs incurred\" - as opposed to one that looked to \"monies spent\" - after a date certain would be very low, especially on a massive construction project, where such a rule would likely be applied. It is very easy to calculate monies spent after a given date, whereas calculating \"costs incurred\" after that date would likely be much more difficult on such a project, given the long lead times on certain deliveries, progress payment schedules, and the use of retained percentages (or \"retainage\").\n\nSecond, the Sureties' proposed \"costs incurred\" rule runs counter to the very nature of the suretyship relationship, which provides that a surety's liability to perform under a performance bond is coextensive with that of the principal contractor. See Morse/Diesel, Inc. v. Trinity Indus., Inc., 67 F.3d 435, 445 (2d Cir. 1995); see also Seaboard Sur. Co., 817 F.2d at 962; see generally Klinger et al., supra note 21, at 82-83, 99 \u0026 nn.10, 86, 87; Gregory \u0026 Rune, supra, at 123, 126-28. Under the Sureties' proposed rule, for example, a surety honoring a bond claim could avoid paying any \"costs\" that the defaulting contractor had \"incurred\" prior to default (in pre-ordering equipment, for example) even where no payment had been made for the item(s) associated with those \"costs.\" Such a scenario is reasonably representative of what occurred in P-19 and P-31, in which a substantial portion of the work consisted of purchasing heavy equipment that had to be pre-ordered well in advance of delivery. Under the Sureties' rule, the costs associated with that equipment were \"incurred\" at the time the equipment was ordered, regardless of when it was paid for. Such a result highlights why the \"costs incurred\" method of computing damages is simply unworkable and why, instead, the relevant inquiry involves determining what monies were spent in completing the work after the date of default.\n\nFinally, a plain reading of the Bonds reveals that they obligated the Sureties to pay all costs associated with completing the projects, and not merely the costs \"incurred\" by Brasoil after the Consortium defaulted. Indeed, it is axiomatic that the very purpose of a performance bond is \"to assure completion of the contract.\" Pearlman v. Reliance Ins. Co., 371 U.S. 132, 140 (1962).\n\nThe Sureties contend, however, that at trial Judge Koeltl recognized the distinction between \"monies spent\" and \"costs incurred\" as he questioned one of the Obligees' expert witnesses - one Antonio Carlos Alvarez Justi, a chief engineer on the P-31 Project - about the Obligees' damages calculations, but then, in calculating the amount of damages, failed to account for that distinction. In this vein, the Sureties rely chiefly on an exchange between Judge Koeltl and Justi, which went as follows:\n\nTHE COURT: Do you know, by the way, how much was spent on work [in P-31] that was performed after the June 1997 purported notice of default?\n\n[JUSTI]: I don't have that number, the exact figure, but that number is probably higher than [$]100 million. In June of 1997 when we declared the default [in P-31], the contract value had been totally used up. The contract value was [$]180 million.\n\nIf the final figure was [$]313 million, so the difference . . . must have been the amount we spent after June of 1997.\n\nTHE COURT: But some of the money that was spent after June 1997 was for work that was actually performed before June of 1997, wasn't it?\n\n[JUSTI]: Yes, you're right, especially in the case of the equipment.\n\nThe equipment was being paid as it was being completed.\n\nThat is why I don't have the exact figure in my mind.\n\nThe Sureties are correct in pointing out that Judge Koeltl acknowledged that some of the monies spent by Brasoil post-default were associated with equipment, materials, and the like that had been ordered by the Consortium prior to default. Where the Sureties have gone astray, however, is in trying to use this fact as the keystone in their argument that Judge Koeltl erred in his damages calculation, which focused on the monies spent by Brasoil.\n\nIn the decision below, Judge Koeltl set forth his ratio decidendi for the cost-of-completion damages calculation in P-19 as follows:\n\nThe Petrobras defendants argue that [the] cost overrun is the proper measure of damages. However, . . . $58 million of the actual costs of the project were spent from May 12, 1997, the date of the notice of default, through the date of the last P-19 Project expenditure . . . , which occurred in April[] 1998. . . . [T]he Sureties' obligations under ¶ 4 of the P-19 Bond were conditioned on Brasoil's compliance with ¶ 3 of the Bond, including the requirement that Brasoil declare a Contractor Default. Thus, before May 12, 1997, the Sureties were not obligated to perform the remainder of the contract, arrange for its completion, or determine the amount for which they may have liable to Brasoil and tender payment. The damages suffered by Brasoil arise from the failure of the Sureties to perform after the Contractor Default was declared. Accordingly, the Sureties are not liable for the project costs that Brasoil paid prior to the declaration of default.\n\nThis approach to damages is consistent with the language of the [P-19] Bond, which identifies \"the responsibilities of the Contractor for correction of defective work and completion of the Construction Contract\" as the primary measure of damages for which the Sureties may be liable (up to the limit of the amount of the P-19 Bond).\n\nBraspetro I, 219 F. Supp. 2d at 470-71 (emphasis added). Judge Koeltl based his calculation of cost-of-completion damages in P-31 on similar findings. See id. at 471-72. As a factual matter, credible evidence was adduced at trial as to the amounts of monies that were spent in completing the Projects after their respective dates of default. Regarding post-default expenditures in both P-19 and P-31, the court credited, among other evidence, the testimony of Frederick C. Hamilton, a forensic accountant and CPA specializing in construction projects. Hamilton testified that $58 million dollars was spent in completing the P-19 Project after the date of default in P-19 (May 12, 1997), and that $121 million was spent in completing the P-31 Project after the date of default in P-31 (June 16, 1997). In light of this evidence, we see no clear error in the District Court's having relied on these figures in calculating and awarding cost-of-completion damages in P-19 and P-31.\n\nFurther, we see no legal error in Judge Koeltl's reasoning. The Bonds obligated the Sureties for the costs of completing the Projects after the Consortium defaulted, and, indeed, that is precisely what Judge Koeltl's calculation of damages reflects. In both P-19 and P-31, the District Court awarded the Obligees the precise amount of monies that Brasoil had spent in completing the Project from the date of default forward, up to the limit in the Bonds. We find that this method of computing cost-of-completion damages is entirely consistent with New York law:\n\nThe proper measure of damages in a case such as this, where the contractor [has defaulted] . . . [,] is the difference between the contract price and the cost of completing the work left undone. In practical application, however, the rule of damages is more clearly and appropriately stated to be the difference between the amount remaining due and owing under the original agreement and the actual cost of completing the work required by the [Contracts].\n\nSarnelli v. Curzio, 104 A.D.2d 552, 553 (2d Dep't 1984) (mem.) (citations omitted); accord Manniello v. Dea, 92 A.D.2d 426, 428 (3d Dep't 1983); see also Wolff \u0026 Munier, Inc. v. Whiting-Turner Contracting Co., 946 F.2d 1003, 1011 (2d Cir. 1991) (same).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Accordingly, as the Sureties introduced no evidence of any \"fraud, overreaching, or other evidence of bad faith\" on the part of the Obligees, see Wolff \u0026 Munier, 946 F.2d at 1011, the District Court was correct in awarding the Obligees their actual costs incurred in completing the Contracts, as measured by the monies that were spent by Brasoil in doing so, up to the limits in the Bonds.\n\nFinally, we need not tarry long with the Sureties' contention that the District Court, in holding the Sureties liable for the monies spent by Brasoil in completing the Contracts, up to the limits in the Bonds, effectively transformed the Bonds from performance bonds into payment bonds. The \"purpose of a 'payment' bond . . . is to protect the equity of the owner in his property against the claims of unpaid [creditors].\" HNC Realty Co. v. Bay View Towers Apartments, Inc., 64 A.D.2d 417, 424 (2d Dep't 1978); see also Surety Information Office, It's All About Risk, at http://www.sio.org/html/CDI-private.html (last visited May 20, 2004) (\"A [p]erformance [b]ond protects the owner from financial risk should the contractor default on its contract. A [p]ayment [b]ond states that persons supplying labor and materials on a project will be paid subject to any restrictions and limitations imposed by statute, the contract, or the bond.\"); see generally Russell, supra note 3, at 39-41.\n\nClearly, the interests protected by performance bonds are very different from those protected by payment bonds. In the case of a project that is never completed, for example, the owner still has an interest in maintaining the property free of any mechanics' liens by unpaid materialmen, suppliers, or laborers - hence, the utility of a payment bond. A performance bond, on the other hand, gives the owner a degree of assurance that the project will be completed, but does little to ensure that the property will emerge from the construction and development phase free of any liens by unpaid third parties who performed work for the contractor prior to its default. In sum, while there may be some practical overlap in the function of performance and payment bonds, ultimately the District Court did not hold the Sureties liable under the Bonds for monies owed by the Consortium to unpaid sub-contractors or materialmen, which would have been appropriate under a payment bond. Rather, the court held the Sureties liable only for those costs associated with completing the Contracts, as was appropriate under the P-19 and P-31 performance bonds. In light of the foregoing, we affirm the District Court's award of cost-of-completion damages.\n\nB. Liquidated Damages\n\nUnder paragraph 6.3 of the Bonds, in the event of the Consortium's default, the Sureties were obligated to pay liquidated damages to the Obligees if, and only if, such damages were provided for in the Contracts. The District Court determined that, under Brazilian law, the \"multas moratórias\" provision (which, translated literally, provided for a delay-related \"fine\" or \"penalty\" in the amount of 0.1% of the total contract price per day, not to exceed 20%) in each of the Contracts was \"equivalent\" to a liquidated damages provision under American law. Braspetro I, 219 F. Supp. 2d at 485. The court noted that it was obvious to the drafters of the Contracts that losses in oil and gas production would result from any delay in the completion of the Projects, but that assigning in advance an accurate value to those losses was both difficult and speculative. In the court's view, 0.1% of the total contract price per day represented a \"reasonable estimate\" of the damages that would arise from a delay in completion. Accordingly, the court concluded that the multas moratórias provisions were \"valid and enforceable\" as liquidated damages provisions under New York law. See id.\n\nOn appeal, the Sureties argue that the multas moratórias provisions in the Contracts were not reasonable attempts to value Brasoil's estimated losses but, rather, were essentially penal in nature. Therefore, argue the Sureties, the District Court erred in enforcing those provisions as valid liquidated damages clauses under New York law and awarding liquidated damages to the Obligees. For the reasons set forth below, we agree with the Sureties in this regard.\n\nAs a preliminary matter, we note that New York law governs the interpretation of the Bonds, including, of course, any dispute over the proper interpretation, or application, of paragraph 6.3. See Braspetro I, 219 F. Supp. 2d at 474. Complicating this issue, however, is the fact that the Bonds obligated the Sureties for liquidated damages only if such damages were provided for in the underlying Contracts, which are not governed by New York law, but rather by Brazilian law. See id. at 475. Nonetheless, because the Bonds are creatures of New York law, the question of whether a certain provision in the Contracts qualifies as a valid and enforceable \"liquidated damages\" clause as that term was understood by the drafters of the Bonds is primarily a question of New York law. But in determining whether the multas moratórias provisions trigger the Sureties' liability under the Bonds, we recognize that we must also consider the nature of those provisions under Brazilian law, because it is the law of Brazil that gives meaning to those provisions. See id. at 475; see also United States v. Funds Held ex rel. Wetterer, 210 F.3d 96, 106 (2d Cir. 2000); Hutner v. Greene, 734 F.2d 896, 901 (2d Cir. 1984).\n\nThe law of New York provides that \"a contractually agreed upon sum for liquidated damages will be sustained where (1) actual damages may be difficult to determine and (2) the sum stipulated is not plainly disproportionate to the possible loss.\" United Merchants \u0026 Mfrs. v. Equitable Life Assurance Soc'y (In re United Merchants \u0026 Mfrs., Inc.), 674 F.2d 134, 142 (2d Cir. 1982) (internal quotation marks omitted); see Truck Rent-A-Center, Inc. v. Puritan Farms 2nd, Inc., 41 N.Y.2d 420, 424 (1977) (noting that \"a liquidated damage[s] provision is an estimate made by the parties at the time they enter into their agreement, of the extent of the injury that would be sustained as a result of breach of the agreement.\"); see also Walter E. Heller \u0026 Co. v. Am. Flyers Airlines Corp., 459 F.2d 896, 899 (2d Cir. 1972); City of Rye v. Pub. Serv. Mut. Ins. Co., 34 N.Y.2d 470, 473 (1974). New York courts will construe a purported liquidated damages provisions strictly, see Elmira v. Larry Walter, Inc., 76 N.Y.2d 912, 913-14 (1990) (mem.), and will sustain such a provision only where the specified amount \"is a reasonable measure of the anticipated harm,\" BDO Seidman v. Hirshberg, 93 N.Y.2d 382, 396 (1999) (internal quotations omitted). Thus, the rule has evolved that where the damages flowing from a breach of a contract are easily ascertainable, or the damages fixed are plainly disproportionate to the contemplated injury, the stipulated sum will be treated as a penalty and disallowed. See, e.g., Mosler Safe Co. v. Maiden Lane Safe Deposit Co., 199 N.Y. 479, 485 (1910).\n\n\"Whether the sum stipulated represents a liquidation of the anticipated damages or a penalty is a question of law, with due consideration for the nature of the contract and the attendant circumstances.\" J.R. Stevenson Corp. v. County of Westchester, 113 A.D.2d 918, 920-21 (2d Dep't 1985) (mem.); see also Mosler Safe Co., 199 N.Y. at 485. Under no circumstances, however, will liquidated damages be allowed where the contractual language and attendant circumstances show that the contract provides for the full recovery of actual damages, because liquidated and actual damages are mutually exclusive remedies under New York law. See X.L.O. Concrete Corp. v. John T. Brady \u0026 Co., 104 A.D.2d 181, 184 (1st Dep't 1984) (reciting the well settled rule that \"when the parties by their contract provide for the consequences of a breach, lay down a rule to admeasure the damages[,] and agree when they are to be paid, the remedy thus provided must be exclusively followed\" (quoting McCready v. Lindenborn, 172 N.Y. 400, 409 (1902) (per curiam)); see also Fed. Realty Ltd. P'ship v. Choices Women's Med. Ctr., 289 A.D.2d 439, 441 (2d Dep't 2001) (mem.) (noting that a \"reasonable [liquidated damages clause] precludes any recovery of actual damages\"); accord N. Hempstead v. Sea Crest Constr. Corp., 119 A.D.2d 744, 745-56 (2d Dep't 1986); J.R. Stevenson Corp., 113 A.D.2d at 921.\n\nBrazilian law, too, has approved the practice of establishing liquidated damages at the outset of a contractual agreement. As codified in articles 918 and 919 of the Brazilian Civil Code of 1916, Brazilian law recognizes a contractual provision known as the \"multas compensatórias\" clause (translated, the \"compensatory penalty clause\" or \"compensatory fine\").\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Brazilian compensatory penalty clauses, like American liquidated damages clauses, represent an attempt on the part of a contract's drafters to assess the damages that would result in the event of a default. Under the heading of compensatory penalty clauses, there are both \"alternative\" compensatory penalty clauses and \"cumulative\" compensatory penalty clauses. See generally Rio de Janeiro Court of Appeals (TJRJ) (7th Panel), Civil Appeal No. 1436/97, Rep. Luiz Roldao de Freitas Gomes, 05.07.1997, 07.01.1997 (explicating the nature of, and differences among, the various forms of penalty clauses in Brazilian law). While a cumulative compensatory penalty clause is sometimes used to deter a delay in completion of a contract, there exists separately and distinctly from the forms of compensatory penalties a purely delay-related penalty - the \"multas moratórias,\" which functions primarily as a deterrent to delays in completion. See generally Silvio de Salvo Venosa, Treoria Geral das Obrigações e Teoria Geral dos Contratos [General Theory of Obligations and General Theory of Contracts] 167 (Atlas ed., 3d ed. 2003).\n\nThere are significant differences between compensatory and delay-related penalties under Brazilian law. Of primary concern here, delay-related penalties can be recovered in addition to actual damages, whereas compensatory penalties cannot. See Rio de Janeiro Court of Appeals (TJRJ) (7th Panel), Civil Appeal No. 1436/97, Rep. Luiz Roldao de Freitas Gomes, 05.07.1997, 07.01.1997 (noting that \"a delay penalty clause . . . represents the pre-estimate of losses resulting from [a] delay [in] performance of the obligation, [with] which compliance in full can also be demanded\") (emphasis added).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Indeed, article 919 of the Code states that \"[w]hen the penalty clause is stipulated for the case of delinquency, . . . the creditor can . . . demand satisfaction of the penalty plus performance of the main obligation.\" Notably, article 1.056 of the Code states that \"in the case of failure to comply with an obligation, or to do so in the proper time, the obligated party is liable for losses and damages.\" Thus, the obligor who delays in fulfilling the obligation may be liable for the actual damages flowing from the breach plus any delay-related penalty. This, then, is a critical point in the interplay between Brazilian and American law. As noted above, under New York law, liquidated and actual damages are mutually exclusive. Under Brazilian law, in contrast, some forms of \"penalties\" are allowed in addition to actual damages, while others are not, depending primarily on whether the penalty is compensatory (multas compensatórias) or delay-related (multas moratórias) in nature. Thus, while some Brazilian compensatory penalty provisions could be deemed enforceable under New York law as valid liquidated damages provisions, a purely delay-related penalty could not be, because such a penalty could, under Brazilian law, be recovered in addition to the actual damages for a delay in the performance of the obligation, which the obligee would already have recovered.\n\nHere, for a number of reasons, the multas moratórias provisions in the Contracts cannot be considered valid liquidated damages provisions under New York law. First, we do not believe that the provisions represented a reasonable measure of the anticipated harm to Brasoil from a delay in the Projects' completion. See BDO Seidman, 93 N.Y.2d at 396. At the time of the drafting of the Contracts, any projected losses in oil and gas production resulting from construction-related delays in the Projects' completion would necessarily have been sustained by Petrobras rather than by Brasoil. There is no dispute that Petrobras was to be the ultimate end user of the P-19 and P-31 oil and gas production platforms and associated equipment. Brasoil, on the other hand, was not a seller or producer of oil and natural gas, and, therefore, the multas moratnrias clauses in the Contracts cannot be considered a reasonable estimate of Brasoil's - in contrast to Petrobras's - damages in the event of delayed oil and gas production.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Tellingly, on appeal, the Obligees have offered nothing more than the thinnest speculation that Brasoil sustained, or could have sustained, such damages.\n\nAlso significant is the fact that the delay-related penalties themselves were but one of several forms of penalties provided in the Contracts. The P-31 Contract, for example, expressly included - in addition to a multas moratórias provision - a multas compensatórias clause that provided for the Consortium to be charged a compensatory penalty in the amount of 100% of the contract price in the event that the Consortium defaulted on its \"labor, social security[,] or tax obligations.\" Examining the multas moratórias provisions in their proper context highlights the essentially penal character of those provisions.\n\nIn any event, putting the final nail in the coffin of the Obligees' liquidated damages claim is the fact that the Obligees - under Brazilian law implicitly, and pursuant to the Contracts expressly - were permitted to recover delay-related damages from the Sureties as part of the Obligees' actual damages. We observe that sub-clause 9.6 of the P-31 Contract provided that \"[t]he penalties established in this clause [did] not exclude any others foreseen in this Contract or prescribed by Law, nor the [Consortium's] liability for losses or damages it may [have] cause[d] to [Brasoil] as a result of non-compliance with the conditions of [the P-31] Contract.\" The P-19 Contract contained a similar provision. Thus, the Contracts provided for the recovery of actual damages in addition to, and apart from, recovery under the multas moratórias provisions. As discussed above, however, liquidated damages and actual damages are mutually exclusive remedies under New York law.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nGiving \"due consideration for the nature of the contract and the attendant circumstances,\" J.R. Stevenson Corp., 113 A.D.2d at 921; see Mosler Safe Co., 199 N.Y. at 485, we find that the multas moratórias provisions in the Contracts were not reasonable attempts to estimate actual damages and, indeed, were essentially penal in character. Moreover, in light of all the foregoing, we conclude that the multas moratórias provisions were not sufficiently analogous to a liquidated damages provision, as such a provision is understood by New York law, to trigger the Sureties' liability for liquidated damages under the Bonds.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Accordingly, we vacate the District Court's award of liquidated damages to the Obligees.\n\nC. Attorneys' Fees\n\n\"Under the American Rule[,] it is well established that attorney[s'] fees 'are not ordinarily recoverable in the absence of a statute or enforceable contract providing therefor.'\" Summit Valley Indus., Inc. v. United Bhd. of Carpenters \u0026 Joiners, 456 U.S. 717, 721 (1982) (quoting Fleischmann Distilling Corp. v. Maier Brewing Co., 386 U.S. 714, 717 (1967)); see also Oscar Gruss \u0026 Son, Inc. v. Hollander, 337 F.3d 186, 199 (2d Cir. 2003) (\"Under the general rule in New York, attorneys' fees are the ordinary incidents of litigation and may not be awarded to the prevailing party unless authorized by agreement between the parties, statute, or court rule.\").\n\n\"This policy 'provides freer and more equal access to the courts . . . [and] promotes democratic and libertarian principles.'\" Oscar Gruss \u0026 Son, 337 F.3d at 199 (quoting Mighty Midgets, Inc. v. Centennial Ins. Co., 47 N.Y.2d 12, 22 (1979) (alterations in original)). Under the American Rule, however, \"parties may agree by contract to permit recovery of attorneys' fees, and a federal court will enforce contractual rights to attorneys' fees if the contract is valid under applicable state law.\" McGuire v. Russell Miller, Inc., 1 F.3d 1306, 1313 (2d Cir. 1993); see Alland v. Consumers Credit Corp., 476 F.2d 951, 956 (2d Cir. 1973); see also United States v. Carter, 217 U.S. 286, 322 (1910).\n\nWhere a district court has awarded attorneys' fees under a valid contractual authorization, we recognize that it has broad discretion in doing so, \"and an award of such fees may be set aside only for abuse of discretion.\" McGuire, 1 F.3d at 1313. With regard to the validity and purpose of the contractual provision itself, however, our standard of review is different: \"We review the district court's interpretation of contracts de novo.\" Oscar Gruss \u0026 Son, 337 F.3d at 198 (emphasis added); see Lee v. BSB Greenwich Mortgage Ltd. P'ship, 267 F.3d 172, 178 (2d Cir. 2001). And, as we have noted in previous cases, \"[u]nder New York law, it is well established that '[a] compensated, corporate surety . . . is not a favorite of the law and its contract of suretyship will be construed in a manner most favorable to [the] claimant.'\" Cam-Ful Indus., 922 F.2d at 163 (quoting Timberline Elec. Supply Corp. v. Ins. Co. of N. Am., 72 A.D.2d 905, 906 (4th Dep't 1979) (mem.), aff'd mem., 52 N.Y.2d 793 (1980)).\n\nThe relevant contract language, taken from Paragraph 6 of the Bonds, is as follows:\n\nTo the limit of the amount of this Bond, but subject to commitment by the Owner of the Balance of the Contract Price to mitigation of costs and damages on the Construction Contract, the Suret[ies] [are] obligated without duplication for:\n\n6.2 Additional legal, design professional, and delay costs resulting from the Contractor's Default, and resulting from the actions or failure to act of the Suret[ies] under Paragraph 4 . . . .\n\nThus, whether the Sureties are liable for attorneys' fees - here, a not insubstantial $36.7 million - turns on the meaning of the term \"legal costs\" as used in the Bonds.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn construing the relevant language, we are mindful that, \"while parties may agree that attorneys' fees should be included as another form of damages, such contracts must be strictly construed to avoid inferring duties that the parties did not intend to create.\" Oscar Gruss \u0026 Son, 337 F.3d at 199. Moreover, it is well settled in New York law that, \"[i]nasmuch as a promise by one party to a contract to indemnify the other for [attorneys'] fees incurred in litigation between them is contrary to the well-understood rule that parties are responsible for their own [attorneys'] fees, the court should not infer a party's intention to waive the benefit of the [American Rule] unless the intention to do so is unmistakably clear from the language of the promise.\" Hooper Assocs., Ltd. v. AGS Computers, Inc., 74 N.Y.2d 487, 492 (1989) (emphasis added); see also Monaghan v. SZS 33 Assocs., L.P., 73 F.3d 1276, 1284 (2d Cir. 1996); DiPerna v. ABC, Inc., 200 A.D.2d 267, 269-70 \u0026 n.3 (1st Dept. 1994). Thus, the task before us is to determine whether the use of the term \"legal costs\" in paragraph 6.2 is unmistakably clear in obliging the Sureties to reimburse the Obligees for their attorneys' fees in this matter.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nDetermining the correct interpretation of this term appears to be a matter of first impression in the Second Circuit, and, moreover, there appears to be no New York case law directly on point.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The only New York case that is even somewhat relevant, Elmira v. Larry Walter, Inc., 150 A.D.2d 129, 133 (3d Dep't 1989), aff'd mem., 76 N.Y.2d 912 (1990), stands for the proposition that \"counsel fees are not available as an item of damage in the absence of statutory or contractual authority.\" But where such authority exists, all \"recoverable expenditures directly occasioned and made necessary by the breach\" are recoverable, including \"legal expenses . . . incurred to rebid the contract.\" Id. (internal quotations omitted). This does not get us very far, however, as the crux of the issue here is whether the authority for the award of attorney fees for this litigation exists in the language of the Bonds.\n\nIn the one case that has been identified as having endeavored to interpret the relevant language, North American Specialty Insurance Co. v. Chichester School District, 158 F. Supp. 2d 468 (E.D. Pa. 2001), the district court had occasion to construe (under Pennsylvania law) the very same provision confronting us here, paragraph 6.2 of the AIA 312 performance bond. In that case, the court awarded attorneys' fees to the owner arising from a dispute between it and the surety over the bond, but did so without discussion. See id. at 473-75. Indeed, it does not appear that the precise issue before us - i.e., whether the term \"legal costs\" as used in the AIA standard-form bond necessarily encompasses attorneys' fees - was addressed in Chichester, either by the parties or the court. See id.\n\nIn a later proceeding in the same case, however, the court found that: the unequivocal import of [paragraph 6.2] indicate[d] that [the surety] was to pay [attorneys' fees] . . . to the extent they fell within [its] scope of responsibility as surety, regardless of whether any litigation [had] ensued from the contract. While the precise amount of the award was tied to the [obligee's] successful proof in litigation that the fees resulted from . . . [a default], the actual entitlement to the fees themselves had no connection to whether or not [the obligee] prevailed in the litigation. In fact, had th[e] lawsuit never been commenced, the [obligee] would have nonetheless been able to recover, through the ordinary course of contractual dealings, legal fees incurred by its solicitor in administering the problems resulting from [the contractor's] default. Far from collateral to the substantive issues, then, legal costs were integral to the relief originally sought by the [obligee].\n\nN. Am. Specialty Ins. Co. v. Chichester Sch. Dist., 2002 U.S. Dist. LEXIS 11730, at *17-18 (E.D. Pa. Jan. 3, 2002). A careful reading of the district court's analysis reveals that the court seemed to base its conclusion - that the surety would be liable for the obligee's attorneys fees regardless of litigation - on the fact that the surety would be liable for the obligee's \"legal fees incurred by its solicitor in administering the problems resulting from\" the contractor's default \"had th[e] lawsuit never been commenced.\" Id. at *18 (emphasis added). The fact that the bond language provides that, in the event of a default, a surety may be liable to its obligee for costs in \"administering the problems resulting from [the] default\" supports, if anything, the view that the \"legal costs\" contemplated by the drafters of the AIA 312 bond form were purely administrative in nature -e.g., the incidental legal costs that reasonably arise when the obligees must retain counsel to assist in drafting or redrafting contracts and related documents, as necessary to complete the project. Broadening the scope of our inquiry, we find that there seems to be no universally-accepted dictionary definition of the term \"legal costs.\" One definition of \"costs\" is as follows:\n\n\"The expenses of litigation, prosecution, or other legal transaction; esp. in an action at law, those allowed in certain cases by law or by the court in favour of the winning and against the losing party.\" Oxford English Dictionary (2d ed. 1989). Black's, too, provides this as one of its several definitions of \"costs\" and adds the following: \"The charges or fees taxed by the court, such as filing fees, jury fees, courthouse fees, and reporter fees. Also termed court costs.\" Black's Law Dictionary 350 (7th ed. 1999). Finally, Webster's provides as one definition of \"costs\" the following: \"expenses incurred in litigation: as (a) those payable to the attorney or counsel by his client especially when fixed by law, (b) those given by the law or the court to the prevailing against the losing party in equity and frequently by statute - called also bill of costs.\"\n\nMerriam-Webster's Third New International Dictionary Unabridged (2002). In sum, one of three standard dictionaries includes attorneys' fees in its definition of legal costs, while the others do not; and thus, these sources bring us no closer to resolving the disputed language.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe only thing that is unmistakably clear here is that we grapple with a contract term that is susceptible to two, equally valid interpretations. And, while the parties have zealously advocated competing interpretations, they have failed to provide us with even a shred of extrinsic evidence, which might have aided us in choosing between them. Nor does the case law shed a significant degree of light on the term \"legal costs\" in this context. Thus, even giving full weight to the general principle that we must construe the challenged provision in the \"manner most favorable to [the] claimant,\" Cam-Ful Indus., 922 F.2d at 163, we conclude that it is not unmistakably clear that the use of the term \"legal costs\" in the Bonds was intended to obligate the Sureties to pay the Obligees' attorneys' fees in litigation between the Sureties and the Obligees over the Bonds.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nIn the final analysis, it is the Obligees who bear the heavy burden of persuading us to depart from the American Rule, see Oscar Gruss \u0026 Son, 337 F.3d at 199 (discussing the sound policy considerations underlying the American Rule), and we find that they have not met that burden. Accordingly, we vacate those portions of the District Court's judgments awarding the Obligees $36,730,905 in damages for \"additional legal costs\" under Paragraph 6.2 of the Bonds.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nD. Prejudgment Interest\n\nUnder New York law, \"[i]n the event of payment [on a bond], the amount recoverable from [the] surety shall not exceed the amount specified in the undertaking except that interest in addition to this amount shall be awarded from the time of default by the surety.\" N.Y. Gen. Oblig. Law § 7-301 (McKinney 2001). This statutory rule codifies the older, common-law rule that \"the surety on the bond[] is chargeable under New York law . . . with interest from the time the surety 'could have safely paid the [same,] providing [the surety] then unjustly withholds [payment].'\" United States v. Anchor Warehouses, Inc., 92 F.2d 57, 58 (2d Cir. 1937) (quoting uzzeo v. Am. Bonding Co., 226 N.Y. 171, 178 (1919)); see also Aetna Cas. \u0026 Surety Co. v. B.B.B. Constr. Corp., 173 F.2d 307, 309 (2d Cir. 1949).\n\nNew York law further provides that:\n\nInterest shall be computed from the earliest ascertainable date the cause of action existed, except that interest upon damages incurred thereafter shall be computed from the date incurred. [But] [w]here such damages were incurred at various times, interest shall be computed upon each item from the date it was incurred or upon all of the damages from a single reasonable intermediate date.\n\nN.Y. C.P.L.R. 5001(b) (McKinney 1992 \u0026 Supp. 2004) (emphasis added); see also Tynan Incinerator Co. v. Int'l Fid. Ins. Co., 117 A.D.2d 796, 798 (2d Dep't 1986) (mem.) (applying C.P.L.R. 5001(b) to action for breach of surety bond). \"The award of [prejudgment] interest under [C.P.L.R. 5001] is founded on the fact that the aggrieved party has been damage[d] by a loss of the use of money or its equivalent and that unless interest is added the party aggrieved is not made whole. [Thus, prejudgment] interest is compensation for the use of money.\" Bulk Oil (U.S.A.), Inc. v. Sun Oil Trading Co., 697 F.2d 481, 484-85 \u0026 n.8 (2d Cir. 1983).\n\nHere, the District Court awarded prejudgment interest under section 7-301, using the latter of the methods provided in C.P.L.R. 5001(b) - i.e., the court computed the interest accrued from a \"reasonable intermediate date.\" In particular, the District Court \"adopt[ed] the means . . . provided in section 5001(b) for the determination of the reasonable intermediate date by using,\" as the court termed it, \"the chronological midpoint\" in the post-default completion of each of the Contracts. The court found that,\n\nfor the construction cost damages on each of the [P]rojects, prejudgment interest accrue[d] from a date halfway between the date on which the Sureties['] prejudgment interest obligation arose (July 11, 1997 for the P-19 Bond and August 18, 1997 for the P-31 Bond) and the last date on which the damages were incurred (April 30, 1998 for the P-19 Bond and November 30, 1998 for the P-31 Bond).\n\nBraspetro II, 226 F. Supp. 2d at 468-69 (internal citations omitted). Thus, the court determined that prejudgment interest had accrued in P-19 from mid-December of 1997, and in P-31 from early April of 1998.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nOn appeal, the Sureties argue that, in awarding interest, the District Court erred in a number of ways - namely, (i) in finding that the Sureties had defaulted on the Bonds, (ii) in overlooking the fact that \"Brasoil did not,\" as the Sureties maintain, \"demand a specific amount due,\" and (iii) in failing to account for the fact that, at the time from which the court accrued interest, it would have been \"difficult, if not impossible\" for the Sureties to compute the costs of completing the Contracts (that is, the amount due on the Bonds). For a number of reasons, set forth below, we find the Sureties' arguments unavailing.\n\nFirst, the Sureties' contention that the District Court erroneously determined them to be in default under the Bonds is essentially a factual dispute, and, as a factual matter, the District Court found that:\n\nWith respect to the P-19 Bond, Brasoil supplied the additional written notice contemplated in ¶ 5 on June 26, 1997. Accordingly, the Sureties were in default on the P-19 Bond beginning on July 11, 1997, [fifteen] days after the letter was sent, and received, by telefax.\n\nThere is no evidence that Brasoil sent a ¶ 5 letter in connection with the P-31 Bond before the commencement of th[e] [declaratory judgment] action. On August 18, 1997, [however,] by filing the current action, the Sureties necessarily denied liability on the . . . [B]onds. Pursuant to ¶ 5, no further notice was required from Brasoil once the action was filed. Accordingly, the Sureties were in default on the P-31 Bond beginning on August 18, 1997.\n\nBraspetro I, 219 F. Supp. 2d at 486 (citations omitted). Reciting what is by now a familiar refrain, we find no clear error in the District Court's findings in this regard, and thus no error in the court's determination that the Sureties defaulted on the Bonds on the dates specified.\n\nSecond, the Sureties' reliance on Brasoil's failure to demand, by the dates of default, precise amounts as due and owing from the Sureties under the Bonds is misplaced, as this was not a prerequisite to the Sureties' liability under the Bonds nor a bar to the Obligees' recovery of prejudgment interest under New York law. Indeed, as a general matter, on a bond claim, it is the responsibility of the surety to \"assess the financial exposure for the claim so that appropriate initial reserves are promptly established to cover a loss should liability later be determined and the surety become[] obligated to fulfill its obligation.\" Piper, supra, at 26. Further, although New York law requires that, for a court to award prejudgment interest, the court must first find that the obligee has made a demand pursuant to the bond, and that the surety unjustly has withheld payment, see, e.g., Town of Clarkstown v. N. River Ins. Co., 803 F. Supp. 827, 830 (S.D.N.Y. 1992), no New York law has been identified as requiring the obligee to have demanded a sum certain from the surety, see Morse/Diesel, Inc. v. Trinity Indus., Inc., 875 F. Supp. 165, 177 (S.D.N.Y. 1994) (expressly allowing for scenario in which a surety could be held liable for prejudgment interest under New York law before \"the amount of [the surety's] liability has been fixed\"), rev'd on other grounds, 67 F.3d 435 (2d Cir. 1995).\n\nThe Tuzzeo case provides an illuminating comparison to the present case. There, the court found that, while some of the claims that had been made on the bond were ultimately rejected, \"others to the number of [488] were accepted.\" Tuzzeo, 226 N.Y. at 177. Yet even in light of that high level of uncertainty on the part of the surety - where literally hundreds of claims had been made on the bond, many of them specious, and where \"[t]he valid claims and the amount of each were unascertainable with certainty to compel or reasonably justify payment by the defendant as surety . . . , except through the machinery of a court of equity,\" id. (emphasis added) - the court nonetheless awarded interest on the basis of the surety's failure to pay on the claims, and found that interest had accrued not from the moment of the resolution of the action, but rather from its inception, see id. at 179; see also Aetna Cas. \u0026 Surety Co., 173 F.2d at 309.\n\nAlso illustrative is Morse/Diesel v. Trinity Industries, the principal case relied on by the Sureties in their contention that they should not have been held liable for prejudgment interest. There, the district court declined to award interest against surety-defendant Aetna Insurance Co. (\"Aetna\"), but only because the court found, as a factual matter, that \"no default by Aetna ha[d] been shown.\" Morse/Diesel, 875 F. Supp. at 176. Here, in contrast, the Sureties defaulted on the Bonds, distinguishing their situation from that of defendant Aetna in Morse/Diesel.\n\nThe Sureties' position is analogous, however, to that of the defendants in Town of Clarkstown. There, the principal, a contractor on a capital improvement project, failed to complete the necessary improvements, and was declared in default by the owner/obligee, which then notified the surety of same by letter. See 803 F. Supp. at 828. The district court awarded interest on the claim, finding that the surety had \"delay[ed] payment beyond proper notification of liability,\" that is, the surety's receipt of the owner-obligee's letter. Id. at 830 (internal quotation marks omitted); accord Fid. N.Y. FSB v. Aetna Ins. Co., 234 A.D.2d 261, 262 (2d Dep't 1996) (mem.).\n\nWhen the Consortium defaulted on the Contracts, the Sureties' obligation - to either complete the Contracts or pay the cost of completion - matured. The Sureties, however, chose to do neither of those things. Indeed, as discussed at length above, the Sureties took a number of steps to block the Obligees' efforts to pursue their rights under the Bonds and, moreover, failed to conduct any form of good-faith investigation under the Bonds. See Braspetro I, 219 F. Supp. 2d at 444. While we note that the Sureties arguably had a duty to protect their own interests, as well as those of the Consortium, by investigating the status of the Projects as thoroughly as possible, see generally Piper, supra, at 31-34, we reiterate our conclusion that the Sureties were not acting in good faith toward the Obligees in threatening to halt the Projects for three-to-six months during that investigation.\n\nFurther, while the ultimate value of the claims on the P-19 and P-31 Bonds may have been uncertain at the time the Sureties defaulted on the Bonds, other issues were certain. In particular, the Sureties' obligations under the Bonds in the event of default by the Consortium were well known to the Sureties, as were, of course, the penal amounts of the Bonds themselves. In the event of the Consortium's default, the Sureties had two basic options: (1) the Sureties could have either (a) arranged for the Consortium to complete the Contracts, (b) completed the Contracts themselves or through agents; or (c) found a qualified replacement contractor to complete the Contracts and, in addition, paid damages to the Obligees resulting from the Consortium's default; or (2) the Sureties could have waived their rights to take any of the foregoing measures and either (a) investigated, determined the amount of the claim, and paid the Obligees that amount; or (b) denied liability. But no matter which of these options the Sureties elected under paragraph 4 in the Bonds, paragraph 6 obligated the Sureties fully for the cost of completion of the Contracts.\n\nNot only did the Sureties fail to pay those costs, the Sureties refused even to make a timely, good faith effort to determine the ultimate value of those costs.\n\nFurther, to whatever extent the Sureties were in doubt as to the amount due under the Bonds, the Sureties had the option of filing a federal interpleader action, naming the Obligees as defendants, and depositing the penal sums of the Bonds into the registry of the district court or, alternatively, bonding that amount payable to the clerk of the district court. See 28 U.S.C. 1335(a); Fed. R. Civ. P. 22; see generally 7 Charles Alan Wright et al., Federal Practice \u0026 Procedure §§ 1701-04 (3d ed. 2001); see, e.g., Aetna Cas. \u0026 Surety Co., 173 F.2d at 309; Stuyvesant Ins. Co. v. Dean Constr. Co., 254 F. Supp. 102 (S.D.N.Y. 1966), aff'd, 382 F.2d 991 (2d Cir. 1967) (per curiam). Instead, the Sureties filed an action seeking a declaratory judgment that they were not liable under the Bonds, and waited for that action to wend its way through the courts, while Brasoil paid hundreds of millions of dollars of its own funds to complete the Projects. The Obligees should not have been forced to devote their own resources exclusively to the completion of the Projects while the Sureties, meanwhile, huddled together plotting courtroom strategy. Having lost the use of those funds for a time, the Obligees, to be rendered whole, are now entitled to prejudgment interest. Moreover, we find no abuse of discretion in the District Court's finding, pursuant to C.P.L.R. 5001(b), that interest accrued from \"reasonable intermediate dates.\"\n\nIn light of the foregoing, we find that the District Court properly held the Sureties liable for prejudgment interest under New York law. However, we vacate those portions of the District Court's judgments awarding prejudgment interest so that the proper amount of interest can be recalculated in light of our conclusions, set forth above, that liquidated damages and attorneys' fees should not have been awarded.\n\nIII. Tortious Interference\n\nFinally, we turn to the sole issue raised in No. 02-9187, i.e., the Sureties' contention that the District Court erred in dismissing their tortious interference claim. In deciding whether the District Court should have dismissed this claim, \"[w]e review the [D]istrict [C]court's findings of fact for clear error and its conclusions of law de novo.\" Wilson v. Nomura Sec. Int'l, Inc., 361 F.3d 86, 89 (2d Cir. 2004).\n\nThe allegations in that claim are set out at length in a prior decision of the District Court. See U.S. Fid. \u0026 Guar. Co. v. Petroleo Brasileiro S.A.-Petrobras, 2001 WL 300735, at *8, *20, *23-24 (S.D.N.Y. Mar. 27, 2001) (denying Petrobras' motion to dismiss tortious interference claim on the pleadings); see also Braspetro I, 219 F. Supp. 2d at 467-70. In a nutshell, the Sureties issued a performance bond that guaranteed IVI's repayment of a $38 million loan that had been made by Marubeni in June 1995 for the purchase of equipment in connection with the P-19 Project. As collateral for the loan, IVI had assigned to Marubeni up to $52.5 million in future receivables from the P-19 Contract. In June 1997, Petrobras refused to release money from the blocked accounts to pay Marubeni, and consequently IVI defaulted on the loan. When the Sureties refused to honor Marubeni's claim on the bond, Marubeni sued the Sureties in state court.\n\nAs discussed above, see supra note 15, the New York State Supreme Court subsequently entered judgment against the Sureties in the amount of $12.8 million. Essentially, the Sureties' tortious interference claim boils down to an allegation that Petrobras improperly prevented IVI from making further loan payments to Marubeni and, thereby, caused IVI to breach various agreements with Marubeni, including the loan agreements.\n\nTo prevail on a tortious interference claim under New York law, a plaintiff must prove \"the existence of a valid contract and damages caused by the wrongdoer's knowledge of and intentional interference with that contract without reasonable justification.\" LaBarte v. Seneca Resources Corp., 285 A.D.2d 974, 977 (4th Dep't 2001) (mem.) (internal quotations marks omitted); see also Foster v. Churchill, 87 N.Y.2d 744, 749-50 (1996). Moreover, a defendant acting in its economic interest is liable for tortious interference only if that defendant was acting with a malicious or illegal purpose. Foster, 87 N.Y.2d at 750.\n\nHere, the District Court found that neither Petrobras nor Brasoil had interfered with any of the contracts between the Consortium and Marubeni. Braspetro I, 219 F. Supp. 2d at 470, 489.\n\nThe court also found that neither Petrobras nor Brasoil caused Marubeni to take any action with respect to IVI. Id. at 470. Further, the court found that, even if there had been interference and Marubeni had succumbed to that interference, there was justification for any such interference. Specifically, the court found that, as \"the ultimate parent company and the representative of Brasoil for the projects, Petrobras had an economic interest in the decision whether to pay the amounts owed by IVI to Marubeni.\" Id. at 469; see also id. at 489. Finally, the court found that Petrobras did not act maliciously, fraudulently, or illegally. Id. at 469, 489.\n\nOn appeal, the Sureties reiterate their argument that \"Petrobras refused to permit . . . IVI to pay Marubeni with [IVI's] own funds\"\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e and \"hoped\" that, by refusing to allow payment, it would cause Marubeni to declare IVI to be in default. Under these circumstances, claim the Sureties, the District Court erred in finding that there was no tortious interference. Suffice it to say that, based on our review of the record, we find none of the District Court's detailed and comprehensive findings in this regard to be erroneous, much less clearly erroneous.\n\nThe Sureties also argue that the District Court's finding that the P-19 funds had been exhausted was erroneous because the court, applying collateral estoppel, based this finding \"in part\" on an earlier resolution of the same issue by the New York State Supreme Court. We note that the District Court found specifically that the IVI \"receivables\"\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e had been exhausted as of April 1997 and that, in light of this, Petrobras had rightfully advised Brasoil not to make additional payments to IVI or to Marubeni. Id. at 450. The Sureties, however, take issue with the fact that the District Court, in addition to making the previously-described factual findings based on the relevant evidence adduced at trial, also remarked that, as \"the Sureties ha[d] already litigated [the exhaustion] issue [in New York state court] and lost[,] they [were] collaterally estopped from re-litigating this issue.\" Id. at 469.\n\nWe need not resolve the Sureties' argument that the District Court misapplied the doctrine of collateral estoppel. First, the District Court's reference to the New York state court litigation was the \"belt\" to the court's \"suspenders\" finding that the IVI receivables had been exhausted as of April 1997 - a finding that, as noted above, was based on the facts presented to the District Court at trial. Second, even if we were to conclude that this finding was in error, the Sureties' tortious interference claim would still fail because, as we have explained above, the Sureties have failed to satisfy the other elements of that claim. Accordingly, we find that the District Court properly dismissed the Sureties' tortious interference claim.\n\nWe have considered Appellants' remaining arguments and find them to be without merit.\n\nCONCLUSION\n\nFor the foregoing reasons, we vacate so much of the judgments as awarded liquidated damages, attorneys' fees, and prejudgment interest, and remand the case for the recalculation of prejudgment interest and any further proceedings consistent with this opinion. We affirm the judgments entered by the District Court in all other respects. The parties are to bear their own costs.\n\n\u003cspan class=\"fn\"\u003e1. Construction Headline News, Court Decision Requires Surety Companies to Pay More than $330 Million (Oct. 1, 2002), at http://www.interface-consulting.com/CHN/ SuretyCompanies_AGDCommunications.htm; see also Michael Bradford, Petrobras Wins Platform Bond Case: Award of at Least $273.5 Million May Tighten Surety Market Still Further, Bus. Ins., vol. 36, no. 35 (Sept. 2, 2002), available at 2002 WL 9518178.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. While we refer to the \"Consortium\" in this opinion, there were in fact several distinct consortia, one for each of the projects underway at the time. In referring to the \"Consortium,\" we refer collectively to the \"P-19 Consortium\" and the \"P-31 Consortium\" - each a separate entity created by various underlying investors and financiers for the sole purpose of executing and completing the corresponding contract. IVI and another company, defendant SV Engenharia SA, sharing a number of corporate officers, led both of these consortia. See Braspetro I, 219 F. Supp. 2d at 413-14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. A surety, in issuing a performance bond, undertakes the risk that the contractor will be unable to complete the project and/or to absorb any losses that may occur in the performance of the contract. Accordingly, before issuing bond, a surety typically will have undertaken a rigorous investigation of the contractor's financial condition and relevant prior experience. However, the surety's review of the contract itself is usually limited to those points that affect the premium cost of a given bond, such as the final contract price, stipulated or estimated contract length, etc. See generally Jeffrey S. Russell, Surety Bonds for Construction Contracts 97-106 (2000). In most cases, the surety does not make a determination whether the contractor can actually perform the contract for the specific bid price, as the surety generally lacks the expertise to make such a determination, and because the surety, having pre-qualified the contractor, generally does not anticipate a loss. See generally Gary Rouse, Extra-Contractual Damages Considerations, in A.B.A., Bond Default Manual 305, 307-11 \u0026 n.15 (Duncan L. Clore ed., 2d ed. 1995) (quoting Armen Shahinian, The General Agreement of Indemnity, in The Law of Suretyship 27-1 (Edward G. Gallagher ed., 1993)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Sureties also executed indemnification agreements with various parties, including members of the Consortium and IVI (the \"Indemnitors\"), to provide the Sureties with protection in the event that they were required to make payments under the Bonds. 219 F. Supp. 2d at 419.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The blocked-accounts system adopted by Petrobras and the Consortium worked as follows: Five days prior to the time a disbursement of funds would be needed, IVI would submit bank payment orders with supporting documentation to Petrobras for approval. Petrobras would determine whether the costs were related to one of the Contracts, and, if they were, then Petrobras would approve the expenditures. See 219 F. Supp. 2d at 432. The District Court found that the money in the blocked accounts had been managed properly - i.e., that there had been no improper commingling of the monies deposited in the P-19 and P-31 blocked accounts. See id. 31, including P-32, as noted above, and also a project designated as \"P-34,\" for which the Sureties issued a performance bond on behalf of the Consortium in favor of Brasoil, charging the Consortium a $2.5 million premium. Neither P-32 nor P-34 is implicated in these appeals, although P-32 and P-34 are sometimes mentioned in this opinion, as well as in the decision Court's finding that as of December 1995: (i) the Consortium was in compliance with both the P-19 and P-31 Contracts, (ii) the Contracts were being performed on time, and (iii) the Consortium at 413-14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Consortium was the successful bidder on several projects in addition to P-19 and P-below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Despite the Consortium's financial difficulties, however, it is worth noting the District was owed monies due under the Contracts. 219 F. Supp. 2d at 430.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. With the exception of a single $11.8 million direct payment made by Petrobras relating to P-19, Brasoil was the source of all the direct and advance payments. For its part, Brasoil had borrowed the funds for these payments from Petrobras. The District Court found that the intercompany indebtedness was reflected on the books and records of both companies in their regular accounting and that interest had been charged on the balances in these accounts in accordance with Brazilian law. See 219 F. Supp. 2d at 436. Id. at 435.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The District Court found that these amendments were the result of a series of negotiations to resolve a number of change orders that had been pending. See 219 F. Supp. 2d at 440.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In January 1997, the construction work on P-19 was about 84% complete, and the engineering work on that project, 88% complete; at the same time, the construction work on P-31 was 55% complete, and the engineering work on it, 75% complete. Thus, it would have been impractical in January 1997 for Petrobras and Brasoil to move the Projects to another yard or to bring in a replacement contractor, even if another yard had been available or another contractor qualified to complete the work could have been found - neither of which, as the District Court noted, appears to have been the case. See 219 F. Supp. 2d at 444.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. For a time, there was some dispute amongst the parties over whether the Bonds were valid under Brazilian Law. That issue was resolved by a determination of the District Court that the Bonds were valid and is no longer in contention. See 219 F. Supp. 2d at 475.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Indeed, the District Court found substantial evidence that these actions constituted an attempt by the Sureties to stall Brasoil (and Petrobras) from initiating any action on the Bonds. The District Court noted that, in early 1997, the \"Sureties had all the information reasonably required to make an immediate decision on which of the four options under [paragraph] 4 of the [B]onds to elect once Brasoil [had] declared a default.\" 219 F. Supp. 2d at 443.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The language quoted above is from the P-19 default notice. The language in the P-31 notice is slightly, but insubstantially, different.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This is hardly an atypical scenario: principal is in default, it may prove difficult for the surety to determine which party is in the right and whether its own performance is due under the bond. As one text explains: \"There is no simple scenario for a performance bond dispute. Most often a dispute will involve claims, counterclaims, charges, and countercharges. Seldom will any one party be altogether in the right. Often the parties are in a defensive posture when bond claims begin to surface. Usually, the project is behind schedule. Generally, prior to the time the surety is officially called upon to perform, lines have been drawn and personalities have clashed. It is no wonder that performance bond claims are fertile fields for surety litigators.\" Cates Constr., Inc. v. Talbot Partners, 980 P.2d 407, 425-26 (Cal. 1999) (quoting Cushman \u0026 Stamm, Handling Fidelity and Surety Claims, Performance Bonds § 6.4, at 168 (1984)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. As collateral for this financing, the Consortium assigned to Marubeni (with Brasoil's consent) up to $52.5 million in future receivables from the P-19 contract. See 219 F. Supp. 2d at 467. In July 1995, the Sureties provided a $38 million payment bond in favor of Brasoil, as owner, for the benefit of Marubeni, as claimant. The Consortium made regular payments to Marubeni through April 1997, at which time payments ceased. On April 23, 1997, Petrobras informed Marubeni that the P-19 Contract was in default; Brasoil/Petrobras would soon be declaring an event of default and making a claim under the P-19 Bond; the Sureties were expected to resist payment; and, thus, collecting under the performance bond would likely take up to five years. There was also some discussion regarding the possibility of Marubeni making a claim under the payment bond if the Consortium did not make its required payment by the end of April. See id. at 467-68. In June 1997, Petrobras refused to release money from the blocked accounts to pay Marubeni, after which Marubeni notified the Sureties of the Consortium's default on the loan. In September 1997, Marubeni sued the Sureties in New York state court to recover under the terms of the payment bond. In January 2000, the state court entered judgment against the Sureties in the amount of $12.9 million. After exhausting their appeals, see Marubeni Am. Corp. v. U.S. Fid. \u0026 Guar. Co., 280 A.D.2d 269 (1st Dep't) (mem.), leave to appeal denied, 96 N.Y.2d 712 (2001) (tbl.), the Sureties paid Marubeni $14.4 million (including interest). See 219 F. Supp. 2d at 468-69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The exact amounts awarded under each contract were as follows: (i) in P-19, $58,000,000 in cost-of-completion damages, $32,600,000 in liquidated damages, $38,907,839 in prejudgment interest, and $19,932,660 in attorneys' fees; and (ii) in P-31, $116,209,776 in cost of-completion damages, $29,992,000 in liquidated damages, $57,567,689 in prejudgment interest, and $16,798,245 in attorneys' fees. See 219 F. Supp. 2d at 470-72; 226 F. Supp. 2d at 469-70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Sureties and their Brazilian law experts appear to believe that, in finding that \"[a] fundamental obligation of the Consorti[um] was to deliver the completed platforms for the agreed prices,\" 219 F. Supp. 2d at 478, the District Court implied that the Consortium could not spend more in completing the Contracts than it had been awarded under them. If the court had advanced this position, it would of course have been mistaken, as the Consortium was free to spend as much as it liked in completing the Contracts, if only it could complete the Contracts on time. But the Consortium was not free to spend all of its money, exhaust its financing, and then hold the Projects hostage in an attempt to leverage more funds and greater access to financing from the Obligees. In other words, the Consortium had a fundamental obligation to complete the Contracts on time and without demanding any additional funding or financing from the Obligees on the threat of stopping the work - which is the clear import of the District Court's statement. Indeed, the court did not find that it was the Obligees' payment of the contract funds that resulted in default, but rather that it was the Consortium's exhaustion of those funds along with all of its other resources and the ultimate result of that course of action - i.e., the admitted impossibility of the Consortium completing the Contracts without being bailed out by the Obligees - that constituted the default. In particular, the court found that: The contract deficits, after taking into account changes in scope that had been recognized in the contract amendments that had been approved in December[] 1996, included overruns caused by the drastic underbidding of the P-19 and P-31 Projects by the Consorti[um]; the Consorti[um]'s increased costs[;] . . . and the poor administration of the projects by the Consorti[um]. Id. at 442. Thus, contrary to the supposition of the Sureties and their experts, the court unequivocally lay the default at the feet of the Consortium and, moreover, did so in what our review of the record reveals to have been entirely appropriate language. the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We recognize that the line between anticipatory repudiation and present breach can, on occasion, be uncertain. In the circumstances of this case, however, and especially given that the Consortium's actions threatened to hold the Projects hostage, we have no trouble finding that a breach occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See, e.g., Superior Court of Justice (STJ) (3d panel), Special Appeal (RESP) No. 309,626, Rep. Ruy Rosado Aguiar Jr., 06.07.2001, 08.20.2001, at 1-2 (finding breach by contractor where owner had \"well-grounded and irrefutable fears of default on the contractual obligation[,] due to the unjustified [conduct of the contractor]\"); Sao Paolo Court of Appeals (TJSP) (11th panel), Appeal (Ap) No. 154,348-2, Rep. Laerte Nordi, 03.22.1990, 05.23.1990 (finding breach by contractor where owner requested progress reports from contractor, which then failed to provide the requested information and, in addition, sought to use owner's actions as grounds to terminate the contract); Rio Grande do Sul Court of Appeals (TJRS) (1st Panel), Appeal (Ap) No. 582000378, Rep. Athos Gusmao Carneiro, 02.08.1983, 04.06.1983 (finding breach by contractor where the court found that compliance with the contract was \"really not feasible from the economic standpoint\"); see also Jorge Cesa Ferreira da Silva, A Boa Fé e a Violação Positiva do Contrato [Good Faith and Positive Breach of Contract] 256 \u0026 n.411 (2002) (\"Apart from [a] repudiation . . . , the [promisor's] conclusive conduct may be deemed to be a default as well.\" (emphasis added)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Whether the direct and advance payments unfairly prejudiced the Sureties by accelerating, without their consent, the payment schedules in the Contracts is an entirely different issue, which we discuss below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See L \u0026 A Contracting Co. v. S. Concrete Serv., Inc., 17 F.3d 106, 110-11 (5th Cir. 1994) (holding that a clear declaration of default is a precondition to a surety's liability under a performance bond); Balfour Beatty Constr., Inc. v. Colonial Ornamental Iron Works, Inc., 986 F. Supp. 82, 86 (D. Conn. 1997) (\"Performance bond requirements for notice of default and demand that the surety step in and perform under the bond must be met before an obligee can recover damages under the performance bond.\"); Bank of Brewton, Inc. v. Int'l Fid. Ins. Co., 827 So. 2d 747, 752-53 (Ala. 2002) (plain language of AIA 312 form establishes that owner must comply with ¶ 3 in order to trigger surety's obligations); see generally Marilyn Klinger et al., Contract Performance Bonds, in A.B.A., The Law of Suretyship 81, 83 (Edward G. Gallagher ed., 2d ed. 2000); Benjamin D. Lentz, Default, Notice of Default, Impact Upon Surety's Obligations Where Notice Is Not Given, in Moelmann \u0026 Harris 19, 24-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The general rule is that: [t]he surety has a priority right to the unpaid balance of the contact funds[,] which it may use to complete performance of the bonded contract. . . . The surety's right to such unpaid contract funds has priority over a bank holding an assignment from the contractor[;] . . . over a lending institution [that] has properly filed a security interest[;] . . . [and even] over the trustee in bankruptcy for the contractor, at least to the extent of the surety's loss on th[e] contract.\" 5 Construction Law ¶ 17.09[2], at 17-114 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The District Court also concluded that the Sureties, in not objecting to the direct and advance payments, \"thus waived any objections to the [direct and advance payments] of which they had been informed.\" 219 F. Supp. 2d at 438. We need not reach the issue of whether, by failing to object to the direct and advance payments, the Sureties waived their right to do so, see Werking v. Amity Estates, Inc., 2 N.Y.2d 43, 52 (1956) (\"A waiver is the intentional relinquishment of a known right with both knowledge of its existence and an intention to relinquish it.\" (internal quotation marks omitted)), in light of our conclusion that the Sureties consented to the changes and that they were not prejudicial to the Sureties. We note, however, that the Sureties have not explicitly challenged the District Court's determination of waiver, perhaps in light of the fact that, under paragraph 8 of the Bonds, the Sureties \"waive[d] notice of any change, including changes of time, to the . . . Contract[s] or to related subcontracts, purchase orders[,] and other obligations.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See David C. Dreifuss, Bond, Contractual and Statutory Provisions and General Agreement of Indemnity, in Bond Default Manual 1, 4: \"[A] bid bond provides that if the bidder submitting the bid that the owner intends to accept does not enter into a contract and provide other documents required by the contract (such as performance and payment bonds) the surety may be called upon to pay some amount to the obligee. . . . [Thus], the bid bond provides protection to the obligee that is forced to enter into a higher contract amount as a result of the lowest responsible bidder failing to fulfill the requirements necessary to enter into the contract itself.\" See also Russell, supra note 3, at 37-38; 5 Construction Law ¶ 17.06.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See Chem. Bank v. Stahl, 272 A.D.2d 1, 14 (1st Dep't 2000); cf. Fasolino Foods Co. v. Banca Nazionale del Lavoro, 961 F.2d 1052, 1056 (2d Cir. 1992) (holding that claim for breach of good faith and fair dealing was precluded, but only because there was not an express agreement between the parties); see generally PSE Consulting, Inc. v. Frank Mercede \u0026 Sons, Inc., 838 A.2d 135, 151-53 (Conn. 2004) (comparing how various jurisdictions have applied the duty of good faith and fair dealing).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See generally H. W. Arant, Rationale of the Rule that an Obligee's Premature Payment at 443. Discharges His Surety, 80 U. Pa. L. Rev. 842, 851 (1932): The function of the surety is to secure the creditor in the enjoyment of the performance promised by the principal. It seems reasonable to assume that his undertaking is intended to operate as a security so long as the creditor acts with good faith and reasonable prudence. Advancing percentages [that] might be retained, under some circumstances, is consistent with both.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See Argonaut Ins. Co., 699 F.2d at 420 (concluding that, where unauthorized advances are expended for the purposes of completing a bonded contract, the amount at risk to the surety is, therefore, unaffected); Ramada Dev. Co. v. U.S. Fid. \u0026 Guar. Co., 626 F.2d 517, 522 (6th Cir. 1980) (holding that the surety was not released to the extent of improperly paid funds because the contractor had applied the released funds to progress on the contract); accord Nat'l Sur. Corp. v. United States, 118 F.3d 1542, 1548 (Fed. Cir. 1997); Gibbs v. Hartford Accident \u0026 Indem. Co., 62 So. 2d 599, 602 (Fla. 1952); Ardsley, Inc. v. United Pac. Ins. Co., 332 P.2d 1000, 1001 (Nev. 1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. This method also comports with general principles relating to the calculation of damages in construction contracts. See generally Dan B. Dobbs, 3 Dobbs Law of Remedies § 12.19(3), at 449 (2d ed. 1993) (\"The cost of completion rule is most commonly used to measure damages and in the absence of some very special factors, that measure of damages is surely adequate. Indeed, it is in its effects a virtual equivalent of specific performance . . . .\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. On January 11, 2003, Brazil adopted a new Civil Code. See Alessandra Dalevi, It's the Law: After 22 Years of Discussion, the Brazilian Senate Has Approved a New Civil Code, http://www.brazzil.com/cvrjan98.htm (last visited May 20, 2004). As the events giving rise to these appeals occurred under the Brazilian Civil Code of 1916 [hereinafter the \"Code\"], all references in this opinion shall be to that version of the Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Accord Rio de Janeiro Court of Appeals (TJRJ) (13th Panel), Civil Appeal No. 08305/02, Rep. Nametala Jorge, 07.03.2002, 07.24.2002 (\"[T]he delay-related fine . . . does not replace or offset the obligated party's default, along with performance of the main obligation, plus losses and damages for delays due to the fault of the obligated party.\"); Rio de Janeiro Court of Appeals (TJRJ) (18th Civil Chamber), Civil Appeal No. 12458/00, Rep. Binato de Castro, 10.03.2000, 10.18.2000 (\"[A] contract fine [for late performance] and the penalty imposed for restitution of losses . . have different natures[] [and] there is nothing that would prevent them from being combined.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The Obligees attempt to counter this argument by noting that the District Court found Petrobras and Brasoil to be alter egos. But the court made this finding only in the limited context of its having ruled on a Foreign Sovereign Immunity Act defense, not in the larger context of the case as a whole, and not in the particular context of liquidated damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See Fed. Realty Ltd. P'ship, 289 A.D.2d at 441; Sea Crest Constr. Corp., 119 A.D.2d at 746; J.R. Stevenson Corp., 113 A.D.2d at 921; X.L.O. Concrete Corp., 104 A.D.2d at 184-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Having determined that the multas moratórias provisions are not enforceable under New York law as liquidated damages provisions, we need not address the Sureties' other argument - that, under Brazilian usury law, any award of liquidated damages under the Bonds should have been capped at ten percent of the contract price.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. For its part, the District Court appears to have simply assumed that the relevant language in the bonds was intended to encompass, in the event of default, \"legal costs\" (including attorneys' fees) that would arise in litigation, as a separate item of damages from, and in addition to, those \"legal costs\" that would necessarily arise in rebidding the Contracts and/or redesigning the Projects. See 219 F. Supp. 2d at 471 (\"In accordance with ¶ 6.2 of the P-19 Bond, Brasoil is . . . entitled to attorneys' fees.\"); see also id. at 471 (\"Brasoil is entitled to recover $146,201,776 against the P-31 Bond, plus attorneys' fees.\"); id. at 485 (\"The Sureties are liable for the legal fees of this action, as provided for in the Bonds.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. For pertinent examples of language that we would deem to be \"unmistakably clear\" in this regard, see, e.g., City of Sacramento v. Trans Pac. Indus., Inc., 159 Cal. Rptr. 514, 522 (Ct. App. 3d Dist. 1979) (awarding attorneys' fees to obligee in suit against surety, \"on the basis of [surety's] contractual obligation to pay, 'in case suit is brought upon this bond, such reasonable attorney[s'] fees as shall be fixed by the [c]court'\"); Klein v. Collins, 106 So. 120, 123 (La. 1925) (awarding attorneys' fees where bond \"provide[d] that 'any attorney[s'] fees connected with the enforcement of this contract shall be a charge against the builders and their surety'\"); Winnsboro v. Barnard \u0026 Burk, Inc., 294 So. 2d 867, 887 (La. Ct. App. 1974) (allowing attorneys' fees where bond provided that surety \"'shall pay to or for the account of the Owner reasonable attorneys' fees for endorsement of the contract and/or the institution of legal proceedings, if such proceedings become necessary'\"); Commonwealth v. Manor Mines, Inc., 544 A.2d 538, 543 (Pa. Commw. Ct. 1988) (granting attorneys' fees where \"the parties executed a performance bond, wherein [the surety] agreed to be liable for the amount of the bond plus five per cent attorney[s'] fees added for collection'\"); Whitten v. Alling \u0026 Cory Co., 526 S.W.2d 245, 249 (Tex. Civ. App. 1975) (awarding attorneys' fees where the bond form stated: \"The maximum amount for which the undersigned shall be liable hereunder, at any one time shall be Fifty Thousand ($50,000) Dollars, plus all costs and expenses, (including counsel fees) incurred in attempting to collect any amounts due under the Guaranty.\" (emphasis in original; internal quotation marks omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Nonetheless, we do not believe certification to be appropriate in this case. As this issue turns purely on the language of these particular Bonds and the term \"legal costs\" may well mean different things in different contexts, the question does not meet the \"likelihood of recurrence\" requirement that New York imposes for certifications. See, e.g., Grabois v. Jones, 89 F.3d 97, 99 (2d Cir. 1996). In any event, given the New York holdings that deviations from the American Rule must be clearly stated, we are comfortable deciding this issue without certification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. At least one other current dictionary of legal usage does not include attorneys' fees in its definition of legal \"costs.\" See David Mellinkoff, Mellinkoff's Dictionary of American Legal Usage 128 (1992). In defining \"costs,\" Professor Mellinkoff notes that: Costs usually refers only to those items that by statute, court rule, or contract a court may (sometimes must) award to the successful litigant, to be recovered from the loser, e.g., filing fees, jury fees, reporter fees, etc. Costs does not include all of the expenses of litigation, e.g., attorneys' fees are not usually included. methodology in determining when to construe a contractual fee-shifting provision in derogation of the American Rule. See Bd. of Managers of the Mews at N. Hills Condo. v. Farajzadeh, 2002 WL 171614, at *1 (Dist. Ct. Nassau County Jan. 8, 2002) (considering \"whether the requirement that each party bear [its] own [attorneys'] fees unless there is an 'express' provision to the Id. (final emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We note that one New York trial court in recent years applied a somewhat different contrary, requires the rejection of an award of [attorneys'] fees if the provision is at all ambiguous\"; and following the District of Columbia Court of Appeals and other courts in finding \"that any ambiguity is to be resolved pursuant to normal rules of contract interpretation, and does not automatically rule out a recovery\"); see also Urban Masonry Corp. v. N\u0026N Contractors, Inc., 676 A.2d 26, 33-34 (D.C. 1996). We agree with the main thrust of the Board of Managers case - i.e., that \"normal rules of contract interpretation\" should apply in disputes over contractual fee-shifting provisions. See Scholastic, Inc. v. Harris, 259 F.3d 73, 82 (2d Cir. 2001); see also British Int'l Ins. Co. v. Seguros la Republica, S.A., 342 F.3d 78, 82 (2d Cir. 2003); Hugo Boss Fashions, Inc. v. Fed. Ins. Co., 252 F.3d 608, 618 (2d Cir. 2001). But to whatever extent this general principle fails to account for the New York Court of Appeals's \"unmistakably clear\" standard in cases such as the one before us, we reject it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Given our conclusion that attorneys' fees were not provided for in the Bonds, we need not reach the parties' subsidiary dispute over whether the Obligees' demand for attorneys' fees was properly pled.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The exact dates chosen by the District Court as \"chronological midpoints\" are unclear. The precise dates are irrelevant to the issue at hand, however, as the Sureties do not challenge the court's specific calculation of prejudgment interest, but rather the validity of its award.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. As discussed above, the District Court found that these funds did not, in fact, belong to IVI, and that the funds in the accounts in question after April 23, 1997, belonged to Brasoil. See 219 F. Supp. 2d at 448, 470. Based on our review of the record, this factual finding is not clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The term \"receivables\" is defined in the June 30, 1995 assignment agreement between IVI and Marubeni as \"all periodical or other payments and all other moneys and claims for moneys from time to time due or to become due to [IVI] by Brasoil under [the P-19 Contract].\" 219 F. Supp. 2d at 467.\u003c/span\u003e\n\n",
    "body_length": 169504,
    "citedas": [
      "369 F.3d 34"
    ],
    "attorneys": "Lawrence S. Robbins, Robbins, Russell,Englert, Orseck \u0026 Untereiner Llp, Washington,D.C. (Roy T. Englert, Jr., Gary A. Orseck, Alan E.Untereiner, Arnon D. Siegel, Robbins, Russell,Englert, Orseck \u0026 Untereiner Llp, Washington,D.C.; Ian A.L. Strogatz, Brian P. Flaherty \u0026 AnthonyR. Twardowski, Wolf, Block, Schorr \u0026 Solis-Cohen,Llp, Philadelphia, Pa., on the briefs), for Plaintiffs-Counter-Defendants-Appellants. Howard L. VICKERY, Cameron \u0026 HornbostelLlp, New York, N.Y. (Peter A. Hornbostel,Alexander W. Sierck, Jonathan S. Sanoff, JayniEdelstein Alegeri, Cameron \u0026 Hornbostel, NewYork, N.Y.; John R. Horan, Kathleen M. Kundar,Oleg Rivkin, Fox Horan \u0026 Camerini Llp, NewYork, N.Y.; Lisa C. Cohen, Steven R. Schindler,Schindler Cohen \u0026 Hochman Llp, New York, N.Y.,on the brief), for Defendants-Counter-Claimants-Appellees. Armen Shahinian \u0026 Scott D. Baron, Wolff \u0026Samson PC, New York, N.Y., for Amicus Curiae,The Surety Association of America.",
    "category": [
      "124"
    ],
    "judges": "Before: Cardamone, Miner and Calabresi, Circuit Judges.",
    "citation_count": 158
  }
}
