{
  "id": "aoOhPmYBTlTomsSBV9GW",
  "document": {
    "title": "Rogers v. Frito-Lay",
    "full_title": "MILDRED LEE ROGERS v. FRITO-LAY, INCORPORATED ; HOWARD L. MOON V. ROADWAY EXPRESS, INC. .",
    "jurisdiction": "Fifth Circuit",
    "date": "1980-02-15T00:00:00.000Z",
    "docket": "Nos. 77-2443, 77-3263",
    "body": "The issue before us can be simply stated: section 503 of the Rehabilitation Act of 1973 requires every contract in excess of $2,500 with any federal department to \"contain a provision requiring that, in employing persons to carry out\" the contract, the contracting parties \"shall take affirmative action to employ and advance in employment qualified handicapped individuals.\" 29 U.S.C. § 793.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e It also provides that any handicapped individual who believes any contractor has failed to comply with this agreement may file a complaint with the Department of Labor.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Does this statute also impliedly authorize such an individual to file a civil action in a United States District Court seeking damages for the contractor's failure?\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nBecause each of these cases comes to us on appeal from a judgment of dismissal for failure to state a claim, we assume that, as alleged in the complaints, each of the plaintiffs is a qualified handicapped person and each was discharged because of handicaps. This merely means our inquiry is warranted; it is not decisive, for the heart of the problem is whether Congress intended to benefit the qualified handicapped by giving them a particular right: the right to sue in federal court for relief from the discriminatory conduct of federal contractors.\n\nThe Rehabilitation Act of 1973 was adopted after presidential vetoes had stymied two earlier attempts to enhance federal aid to handicapped persons. Most of the controversy surrounding the bill and its predecessors focused on wide ranging programs, to be federally funded, designed to aid handicapped persons in assuming a full role in society, and on the appropriations that would be required if the measure were adopted. Consequently, Congress devoted little of its discussion to its intentions regarding section 503. See Sen.Rep.No. 93-318, 93d Cong., 1st Sess., pp. 12-16 (1973), U.S.Code Cong. \u0026 Admin.News, p. 2076. The statute's muteness, therefore, is not given meaning by voices in the legislative background. The plaintiffs ask us to find not only significance in the silence, but also the specific message of intent to bestow a private cause of action.\n\nFederal courts are not common law courts of general jurisdiction. Limited by the express language of the Constitution, and the functional role it allots to the judiciary, we can recognize the cause of action only if it has been created by statute. See Cannon v. University of Chicago, 1979, 441 U.S. 677, 717, 99 S. Ct. 1946, 1968, 60 L. Ed. 2d 560, 587 (Rehnquist, J., concurring). Therefore, our answer to the question in this case depends, the authorities and the parties all agree, on whether Congress intended, when this statute was enacted, to create such a method of enforcing the statutory policy. Because Congress did not speak to us unequivocally, either in the statute or in some other authoritative fashion, we must seek an answer in the history of enactment of the statute and in analogies to what the courts have derived from other statutes.\n\nHaving done so, in a manner we describe below, we have concluded that Congress has not authorized a private cause of action.\n\nI.\n\nIn two cases decided within the last five years, the Supreme Court, summarizing its reflections in other prior cases, has told us how to seek intimations sufficient to read statutory silence as affirmative or negative. Cort v. Ash, 1975, 422 U.S. 66, 95 S. Ct. 2080, 45 L. Ed. 2d 26; Cannon v. University of Chicago, 1979, 441 U.S. 677, 99 S. Ct. 1946, 60 L. Ed. 2d 560. We are directed to consider four factors; but we are warned, as we should surely already know, that mechanical adherence to any multiple-part test is injurious and negates the very judgmental wisdom that is sought from courts. See id. at 717, 99 S. Ct. at 1968, 60 L. Ed. 2d at 587 (Rehnquist, J., concurring). Our obligation is to determine, to the best of our abilities, whether Congress intended to create the private right of action plaintiffs seek to bring in federal court; even were we satisfied that some of the Cort factors supported implying such a right, we could not do so if unconvinced that Congress intended such a remedy. See Transamerica Mortgage Advisors, Inc. v. Lewis, 1979, 444 U.S. 11, 100 S. Ct. 242, 62 L. Ed. 2d 146; Touche Ross \u0026 Co. v. Redington, 1979, 442 U.S. 560, 99 S. Ct. 2479, 61 L. Ed. 2d 82.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nA. Was the plaintiff one of the class for whose especial benefit the statute was enacted?\n\nThe statute was intended at the least to direct federal agencies to use their purchasing power so as to improve employment opportunities for \"qualified handicapped persons.\" But it would be facile simply to conclude that, because Congress had handicapped persons in mind when it enacted section 503 and mentioned them in the statute, the first Cort factor is satisfied. What Cort demands is not that we determine whether Congress intended to aid a particular class of persons, but that we ascertain whether Congress intended to \"create a federal right in favor of the plaintiff.\" Cort v. Ash, 1975, 422 U.S. 66, 78, 95 S. Ct. 2080, 2088, 45 L. Ed. 2d 26, 36. To this end, \"the right or duty-creating language of the statute has generally been the most accurate indicator of the propriety of implication of a cause of action.\" Cannon v. University of Chicago, 1979, 441 U.S. 677, 690 n. 13, 99 S. Ct. 1946, 1954 n. 13, 60 L. Ed. 2d 560, 571 n. 13.\n\nThe words of the statute, which are remarkably plain and jargon-free, do not indicate that it is aimed at overcoming those barriers to the employment of a qualified handicapped person that can be surmounted only by costly action or major programs. What is required of the employer could be as simple as providing a ramp for wheelchairs over a stairway or as complex as installing altered machinery, or it may, of course, be that apparently simple but much more difficult problem of eliminating prejudice, a disease so deep rooted that it caused Clemenceau to say, \"a citizen is sometimes called upon to make a greater sacrifice for his country than the sacrifices of his life, namely, to sacrifice his prejudices.\"\n\nThe statutory language does not imply on its face any intention to endow the handicapped with a direct suit after suffering handicap-based discrimination. It merely requires those who give out federal contracts to obligate contractors to take affirmative steps to employ and advance handicapped persons.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The duty it directly creates is imposed upon federal departments and agencies, not upon contractors. The statute does not confer a clearly defined right on the benefitted class. There is no intimation that every qualified handicapped person has a right to affirmative action in his particular case; what is apparent is that those who control federal contracts have a duty to make and enforce contracts containing the requisite clause. The handicapped may have simply the right to petition those who administer federal contracts to perform their duty.\n\nThe language of the statute is thus unlike those statutes that unequivocally focus on the benefitted class in their right or duty-creating language. See, e. g., id., 441 U.S. at 681 n. 3, 99 S. Ct. at 1950 n. 3, 60 L. Ed. 2d at 567 n. 3 (\"No person . . . shall be excluded . . . .\" 20 U.S.C. § 1681); Allen v. State Board of Elections, 393 U.S. 544, 554-55, 89 S. Ct. 817, 825-26, 22 L. Ed. 2d 1, 11. (\"No person shall be denied . . . .\"). It is, however, Not unlike language that the Cannon court indicated would be sterile ground for implying a cause of action: \"(t)here would be far less reason to infer a private remedy in favor of individual persons if Congress . . . had written (the statute) simply as a ban on discriminatory conduct by recipients of federal funds or as a prohibition against the disbursement of public funds to . . . institutions engaged in discriminatory practices.\" Cannon v. University of Chicago, 1979, 441 U.S. 677, 690-93, 99 S. Ct. 1946, 1954-55 and n. 14, 60 L. Ed. 2d 560, 571-573 and n. 14 (footnote omitted). Here, that is precisely what Congress did.\n\nThe duty-creating phrases are not conclusive, but they make inference of a private cause of action more difficult. When a statute is structured as a directive to federal agencies and does not clearly define a right inhering in individual members of a benefitted class, there must be persuasive evidence in the legislative history that Congress intended to confer such a right before the courts are justified in concluding that one exists. See Transamerica Mortgage Advisors, Inc. v. Lewis, 1979, 444 U.S. 11, 100 S. Ct. 242, 62 L. Ed. 2d 146.\n\nB. Is there any indication of legislative intent, explicit or implicit, either to create such a remedy or to deny one?\n\nIn trying to learn Congressional intent by examining the legislative history of a statute, we look to the purpose the original enactment served, the discussion of statutory meaning in committee reports, the effect of amendments whether accepted or rejected and the remarks in debate preceding passage.\n\nThe scant discussion of section 503 that occurred during the process of enactment of the Rehabilitation Act of 1973 does not indicate that Congress contemplated a private right of action for handicapped persons. The only explicit statements of Congressional intent are found in connection with later legislation, corollary to section 503. We are urged to find meaning in section 503 as a result of later statutes and of remarks by individual Congressmen made at a later time.\n\nThe retroactive wisdom provided by the subsequent speech of a member of Congress stating that yesterday we meant something that we did not say is an ephemeral guide to history. Though even God cannot alter the past, historians can, Compare Samuel Butler, Creation Revisited, c. 14, and other mortals are not free from the temptation to endow yesterday with the wisdom found today. What happened after a statute was enacted may be history and it may come from members of the Congress, but it is not part of the legislative history of the original enactment.\n\nLater statutes may provide guidance. The Supreme Court has on occasion referred to the language of a later statutory amendment,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e whether independent or amendatory, in interpreting an earlier one. When thus utilized, the role of the later statute is not primarily historical: it repeals, modifies, adds to or subtracts from the earlier one by its own force. Its enactment stems from Congressional legislative power to repeal or alter what it has done. When such a statute has been adopted, the question becomes one of interpreting the two enactments together.\n\nThe two amendments to Title V that have been adopted leave the question of individual right to sue almost as murky as did the original text. In 1974 Congress amended the newly enacted Rehabilitation Act. One of the purposes and results of the amendment was to clarify the definition of \"handicapped person\" under sections 503 and 504 of the Act. Although the adopted amendment did not affect the substance of either section, the legislators utilized the legislative process to express their views on the intended scope of those sections as originally adopted.\n\nThe most extensive discussions of the two sections appear in the Senate Conference Committee Report on the amendments. Sen.Conf.Rep.No. 93-1270, 93d Cong., 2d Sess. 25-28 (1974). Even then, little attention was directed to enforcement of section 503, but section 504 enforcement was discussed in detail. The Report equated section 504 to section 601 of the Civil Rights Act of 1964, 42 U.S.C. § 2000d and section 901 of the Education Amendments of 1972, 20 U.S.C. § 1681. Like those sections, the conferees stated, section 504 is to be enforced by administrative and judicial means, including a private judicial remedy for those harmed by violations of the section.\n\nThe Committee failed to make similarly explicit any understanding that section 503 would entail a private judicial remedy. It did, however, note the intent that \"sections 503 and 504 be administered in such a manner than a consistent, uniform, and effective federal approach to discrimination against handicapped persons would result.\" Sen.Conf.Rep.No. 93-1270, Supra, at 27.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This might prompt the conclusion that a private judicial remedy was intended under both sections. But the occasional mentions of section 503 contain no direct statement of an intention to create a private cause of action. Even as straws in the wind, these statements indicate cross currents rather than a stout breeze from one direction.\n\nThe appellants find their strongest argument in an implication they seek to draw from enactment in 1978 of an amendment to the Rehabilitation Act of 1973 that added a new section providing for attorney's fees in any action \"to enforce or charge a violation of a provision of this subchapter.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e This undoubtedly authorizes an attorney's fee in actions brought to enforce section 503; but it does not necessarily follow that the amendment is intended to authorize private individuals to file civil actions under that section.\n\nWe are aware that the Senate report states: \"the availability of attorney's fees should assist in vindicating private rights of action in the case of section 502 and 503 cases, as well as those arising under section 501 and 504,\" S.Rep.No. 95-890, 95th Cong.2d Sess. 19 (1978), and that the House report contains similar language.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIt may, therefore, fairly be said that the 1978 committees of both Houses assumed that a private cause of action had somehow been created in the past. The existence of such a postulate is neither logical nor legislative basis to conclude that the 1973 statute did in fact create the action; and, if the 1973 statute did not authorize the cause of action, the 1978 statute evidences no intention to create one. An assumption is not a law.\n\nA statement indicating that section 503 creates a private cause of action was made by a Senate Committee in 1979.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e \"The Committee\" in 1978 or 1979 is not the committee that recommended the legislation enacted in 1974. Had this statement been made in the report of the committee that recommended the legislation, it would indeed be part of the statutory history. When uttered five years later it is mere commentary. Moreover, a committee is not the Congress. It cannot create a Congressional intent that did not exist, or amend a statute by a report. Cf. In re Beef Industry Antitrust Litigation, 5 Cir. 1979, 589 F.2d 786 (opinion of two Congressmen on applicability of House of Representative's rule is not binding on court; rather, court must evaluate rule with attention to practice of entire Congress).\n\nThe legislative history of section 503 is void of explanatory statements contemporaneous with its passage. What happened subsequently is either ambiguous, or an assumption not shown to have been warranted; it is also the product of members of a Congress so distant in time from the enacting Congress that we cannot accept their remarks as an accurate expression of the earlier Congress's intent. We must, therefore, rely on whatever may be implicit in the statute.\n\nThe strongest argument for implication of a cause of action is that such a right is created by other provisions of the same law. That analogy is false; it attempts to achieve like conclusions from different premises.\n\nThe Rehabilitation Act contains both the provision (section 503) requiring federal contracts to obligate contractors to take affirmative action, 29 U.S.C. § 793, and, in the section immediately following, a provision forbidding discrimination in federal grants. The language of the two sections is different:\n\n29 U.S.C. § 793 ( § 503) 29 U.S.C. § 794 [ § 504]\n\nAny contract in excess of No otherwise qualified indi\n\n$2500 entered into by any vidual in the United States\n\nFederal department. . . . . . shall, solely by\n\nfor the procurement of per- reason of his handicap, be\n\nsonal property and nonper- excluded from participation\n\nsonal services . . . shall in, be denied the benefits\n\ncontain a provision requiring of, or be subjected to dis-\n\nthat, in employing persons crimination under any pro-\n\nto carry out such contract gram or activity reviewing\n\nthe party contracting with Federal financial assistance\n\nthe United States shall take . . . .\n\naffirmative action to employ\n\nand advance in employment\n\nqualified handicapped indi-\n\nviduals. . . .\n\nA number of courts have held that section 504 creates a private cause of action in favor of qualified handicapped persons discriminated against in programs that receive federal grants. See, e. g., United Handicapped Federation v. Andre, 8 Cir. 1977, 558 F.2d 413; Kampmeier v. Nyquist, 2 Cir. 1977, 553 F.2d 296, 299; Lloyd v. Regional Transportation Authority, 7 Cir. 1977, 548 F.2d 1277; Davis v. Bucher, E.D.Pa.1978, 451 F. Supp. 791; Doe v. New York University, S.D.N.Y.1978, 442 F. Supp. 522 (dictum); Barnes v. Converse College, D.S.C.1977, 436 F. Supp. 635; Gurmankin v. Costanzo, E.D.Pa.1976, 411 F. Supp. 982, Aff'd, 3 Cir. 1977, 556 F.2d 184. Moreover, in Cannon v. University of Chicago, 1979, 441 U.S. 677, 99 S. Ct. 1946, 60 L. Ed. 2d 560, the Supreme Court found an implied cause of action in Title IX of the Education Amendments of 1972 for violation of § 901(a) which provides, \"No person in the United States shall, on the basis of sex, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving Federal financial assistance.\"\n\nThe parallel in construction between Title IX and section 504 is evident. The differences between this common design and the mandate of section 503 are equally clear: section 503 does not outlaw discrimination; it requires affirmative action covenants to be inserted in government contracts.\n\nSection 503 also incorporates a specific method of enforcing the contractual provision; contractors who do not abide by their undertaking may be subjected to sanctions by the Department of Labor. The statute expressly discusses administrative enforcement and the regulations emphasize conciliation and persuasion as methods of dispute resolution. See 41 C.F.R. § 60-741.26(g)(2). Section 504, on the other hand, does not expressly provide for administrative enforcement.\n\nSave for their common endeavor to aid the handicapped, the two sections have little in common. The words of section 503 convey no message that the same remedies should be available as those afforded for violation of section 504.\n\nThe type of assistance afforded by section 503 to aid persons whom the government wishes to benefit by its contracting power has been afforded in the past. Both Executive Order 11246, promulgated in 1965, and its predecessor 10925, promulgated in 1961, required government contractors to agree to include nondiscrimination and affirmative action provisions in their contracts with the Government. We have declined to infer a private cause of action under such an executive order containing language similar to that of section 503. See Farkas v. Texas Instruments, Inc., 5 Cir. 1967, 375 F.2d 629, Cert. denied, 389 U.S. 977, 88 S. Ct. 480, 19 L. Ed. 2d 471 (Exec. Order 10925); See also Farmer v. Philadelphia Electric Co., 3 Cir. 1964, 329 F.2d 3 (Exec. Order 10925 and predecessors); Traylor v. Safeway Stores, Inc., N.D.Cal.1975, 402 F. Supp. 871 (Exec. Order 11246 as amended by 11375). The rationale of these decisions is that litigation would disrupt the administrative scheme established by the order and the supplementing regulations.\n\nThese decisions should have given Congress fair grounds to believe that, when it enacted section 503, federal courts would not infer a private cause of action under it and that, if it intended a different result, it should make its mandate explicit. Cf. Cannon v. University of Chicago, 1979, 441 U.S. 677, 698, 99 S. Ct. 1946, 1957-58, 60 L. Ed. 2d 560, 576 (uses the interpretation of Title VI at the time Title IX was enacted to divine Congressional intent concerning Title IX). Indeed, the Executive Order is referred to in the scant legislative history of section 503.\n\nMoreover, our court, like others, has generally not inferred private causes of action under statutes regulating employee-employer relationships. See, e. g., Jeter v. St. Regis Paper Co., 5 Cir. 1975, 507 F.2d 973 (no private right of action under Occupational Health and Safety Act, 29 U.S.C. §§ 651-678); Martinez v. Behring's Bearings Service, Inc., 5 Cir. 1974, 501 F.2d 104 (no private right of action for wrongful death under Fair Labor Standards Act, 29 U.S.C. § 215(a)(3)); Flores v. George Braun Packing Co., 5 Cir. 1973, 482 F.2d 279 (no implied right against employer for deprivation of job based on illegal employment of foreign nationals under Immigration and Nationality Act, 8 U.S.C. §§ 1101(a)(15)(A)(ii), 1182(9)(14), 1324); Breitwieser v. KMS Industries, Inc., 5 Cir. 1972, 467 F.2d 1391, Cert. denied, 1973, 410 U.S. 969, 93 S. Ct. 1445, 35 L. Ed. 2d 705, (no implied right of action to bring a wrongful death action under child labor provisions of Fair Labor Standards Act, 29 U.S.C. § 212); United States v. Lovknit Manufacturing Co., 5 Cir. 1951, 189 F.2d 454, Cert. denied, 342 U.S. 896, 72 S. Ct. 229, 96 L. Ed. 671 (no implied right of action under Walsh-Healey Act, 41 U.S.C. §§ 35-45; dictum).\n\nC. Is it consistent with the underlying purposes of the legislative scheme to imply such a remedy for the plaintiff?\n\nAs we have already indicated in differentiating section 503 from both section 504 and Title IX, Congress provided a complete administrative scheme to remedy Section 503 violations. The implementing regulations, set forth at length in the footnote, provide explicit details for the operation of that plan.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The administrative emphasis is on \"conciliation and persuasion\" and on \"informal means\" of resolution. The regulations make no provision for a private cause of action, suggesting that a private judicial remedy may be difficult to harmonize with the administrative enforcement framework. In addition, Title IX contained a provision for the award of attorney's fees, passed contemporaneously with the act, which indicated that the very Congress that passed the law believed a private cause of action existed. No corresponding reason exists to buttress the thesis that section 503 was intended to authorize private litigation.\n\nThe provision of an express administrative remedy for qualified handicapped persons creates at least some basis to conclude that a private right of action would be inconsistent with the purposes of the legislative scheme.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e As the Supreme Court has noted, \"This principle of statutory construction reflects an ancient maxim Expressio unius est exclusio alterius.\" National Railroad Passenger Corp. v. National Association of Railroad Passengers, 1974, 414 U.S. 453, 458, 94 S. Ct. 690, 693, 38 L. Ed. 2d 646, 652. \"(W)hen legislation expressly provides a particular remedy or remedies, courts should not expand the coverage of the statute to subsume other remedies,\" the Court reasoned. Id. For, \" \"(w)hen a statute limits a thing to be done in a particular mode, it includes the negative of any other mode.' Botany Worsted Mills v. United States, 278 U.S. 282, 289, 49 S. Ct. 129, 132, 73 L. Ed. 379 (1929).\" Id. See also Transamerica Mortgage Advisors, Inc. v. Lewis, 1979, 444 U.S. 11, 100 S. Ct. 242, 247, 62 L. Ed. 2d 146, 155 (\"where a statute expressly provides a particular remedy or remedies, a court must be chary of reading others into it.\").\n\nTo determine the message to be found in the void of express Congressional statement, we resort neither to our own notions of sound policy nor to our concept of what best suits the public weal.\n\nWhere there is silence, as Cannon commands, we seek for affirmative evidence of Congressional intent. Silence may indicate only that the question never occurred to Congress at all, or it may reflect mere oversight in failing to deal with a matter intended to be covered, or it may demonstrate deliberate obscurity to avoid controversy that might defeat the passage of legislation, or it may, indeed, be a result merely of an assumption by Congress that the courts would recognize a private cause of action. The issue is not whether, on the merits, balancing on-the-one-hand with on-the-other, advocates of judicial remedies have a better case than opponents, but whether, considering the purpose and function of the statute and its legislative history, we can find a legislative intent to recognize a judicial remedy.\n\nThe task does not lend itself to certitude or dogmatism. Yet principle can shed helpful light even if not the clarity necessary for absolute confidence. The standard is that those who contend a statute has endowed them with a cause of action must establish their proposition. The appellants have not shown that section 503 presents the \"atypical situation in which All of the circumstances that the Court has previously identified as supportive of an implied remedy are present,\" Cannon v. University of Chicago, 1979, 441 U.S. 677, 717, 99 S. Ct. 1946, 1968, 60 L. Ed. 2d 560, 587, or even that sufficient of them attended its enactment to warrant the implication.\n\nFor these reasons, we decline to do judicially what Congress has not done legislatively, and we AFFIRM both judgments.\n\nGOLDBERG, Circuit Judge, dissenting.\n\nI respectfully dissent.\n\nThe issue presented in this case is one of first impression in the appellate courts. We have been asked to decide whether there exists a private right of action in the federal courts under § 503 of the Rehabilitation Act of 1973 (the Act), As amended, 29 U.S.C.A. § 793 (West 1975 and Supp.1979), in favor of qualified handicapped individuals who allege that they were victims of handicap-based discrimination in their employment with federal contractors.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e This question is, I think, one of great significance both for the millions of handicapped individuals who have waited and labored to see their right to equal treatment established in the law along with the rights of other groups who have been victims of invidious discrimination and also for the jurisprudence of implied private rights of action. I will therefore set forth in some detail my reasons for reaching a conclusion contrary to that reached by my brethren, but it is important to recognize from the outset certain factors which set this case apart from the run-of-the-mill situation in which courts are required to decide whether a private right of action inheres in a statute not explicitly creating one.\n\nFirst, the Supreme Court has observed that \"the legislative history of a statute that does not expressly create or deny a private right of action will typically be equally silent or ambiguous on the question.\" Cannon v. University of Chicago, 441 U.S. 677, 99 S. Ct. 1946, 1956, 60 L. Ed. 2d 560 (1979). Untypically, however, the history of the legislative consideration of § 503 contains direct evidence of a congressional intent that a private cause of action is to be found implicit in the statute. While these statements were not contemporaneous with the passage of the Act, I will show that settled judicial authority requires that we give great weight to such indications of congressional intent and that this case is a particularly appropriate one for doing so.\n\nSecond, both the Department of Labor and its Office of Federal Contract Compliance Programs (OFCCP) the agency charged with administering § 503 have taken the position that a private cause of action exists under § 503; that such a cause of action is not inconsistent with the congressional purposes underlying the Act and, rather than hindering the Act's administrative enforcement scheme, will assist it; and that exhaustion of administrative remedies should not be required in every case.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e There is thus little room for judicial second-guessing of the impact of a private cause of action on the congressionally-established administrative enforcement scheme.\n\nWhen these and all the other relevant factors are considered within the analytical framework established by Cort v. Ash, 422 U.S. 66, 95 S. Ct. 2080, 2088, 45 L. Ed. 2d 26 (1975), and refined in more recent decisions, See, e. g., Transamerica Mortgage Advisors, Inc. v. Lewis, 444 U.S. 11, 100 S. Ct. 242, 62 L. Ed. 2d 146 (1979) (TAMA ); Touche Ross \u0026 Co. v. Redington, 442 U.S. 560, 99 S. Ct. 2479, 61 L. Ed. 2d 82 (1979); Cannon v. University of Chicago, supra, I think the correct answer to our question is easily fathomed: § 503 creates a private right of action in the federal courts, without a requirement that administrative remedies be exhausted in every case.\n\nBecause litigation under § 503 even the concept of handicap discrimination itself is relatively new to the federal courts, some background regarding that section and the claims involved here will be helpful. Section 503(a) of the Act, in pertinent part, requires that contracts \"in excess of $2,500 entered into by any Federal department or agency for the procurement of personal property and nonpersonal services . . . for the United States shall contain a provision requiring that, in employing persons to carry out such contracts the party contracting with the United States shall take affirmative action to employ and advance in employment qualified handicapped individuals as defined\" in the Act. Section 503(b) provides an administrative complaint mechanism permitting any handicapped individual who believes any contractor is not in compliance with such contract to file a complaint with the Department of Labor.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e OFCCP has authority for administration of this section and has promulgated regulations. See 41 C.F.R. Part 60-741 (1978).\n\nThe regulations require that federal agencies insert in all covered contracts a clause stating, Inter alia, \"The contractor will not discriminate against any employee or applicant for employment because of physical or mental handicap in regard to any position for which the employee or applicant for employment is qualified.\" 41 C.F.R. § 60-741.4 (1978). These regulations also permit individuals to file complaints with the agency, alleging that a violation of the Act or regulations has occurred, and establish the procedures by which the agency itself investigates and attempts to resolve the complaint. See 41 C.F.R. § 60-741.26 (1978). While the agency has stipulated that proven violations \"should be resolved by informal means, including conciliation and persuasion, whenever possible,\" the regulations provide other enforcement procedures in case these informal means fail, including judicial enforcement of the contractual provisions, the withholding of progress payments, termination of the contract, and debarment of the contractor. See 41 C.F.R. § 60-741.28 (1978). In cases where informal resolution fails, however, none of these mechanisms is clearly geared to produce individual relief for the complainant.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nTo illustrate the type of claim that may be raised under § 503 and to show how this particular claim was handled, I set forth the facts presented by Howard L. Moon, the appellant in No. 77-3263.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Mr. Moon was employed as Terminal Manager by defendant/appellee Roadway Express, Inc. (Roadway), a federal contractor covered by § 503. On August 3, 1974, while still employed by Roadway, Mr. Moon was injured in an automobile accident and, as a result, his left leg was amputated. He returned to work with Roadway in June, 1975, where he remained until he was terminated on February 18, 1977, missing only one day at work during that time. Since his termination, Mr. Moon has been unemployed.\n\nMr. Moon filed a complaint with the OFCCP on April 15, 1977, charging that his termination was in violation of § 503. On May 15, 1978, the OFCCP released the results of its investigation, stating:\n\nInvestigation by this department indicated that the contractor terminated the complainant from employment because of his handicapping condition although the complainant continually demonstrated that he could perform the duties of Terminal Manager. The contractor has refused to reasonably accommodate the complainant with employment, and has therefore violated its obligations under the affirmative action provisions.\n\nThe OFCCP further invited Roadway to join it in attempting an informal resolution of the matter.\n\nNevertheless, Mr. Moon received a letter from the OFCCP on November 9, 1979, informing him that the Solicitor's Office, to which his case file had been forwarded, had returned the file and advised that \"they will take no further action on your complaint. Therefore, we are administratively closing it.\" Mr. Moon was told he might write the Director of OFCCP seeking reconsideration of this determination: \"the Director . . . May, for reasonable cause, reconsider or order the reconsideration of this determination.\" (emphasis supplied)\n\nI\n\nOnly a cave dweller or other layman would not realize that there has been a remarkable change of attitude by the Supreme Court regarding the inference of private rights of action in the last fifteen years. Compare J. I. Case Co. v. Borak, 377 U.S. 426, 84 S. Ct. 1555, 12 L. Ed. 2d 423 (1964) With Touche Ross \u0026 Co. v. Redington, 442 U.S. 560, 99 S. Ct. 2479, 61 L. Ed. 2d 82 (1979). The Court has recently come to emphasize that \"what must ultimately be determined is whether Congress intended to create the private remedy asserted\" and, consequently, that the question is \"basically a matter of statutory construction.\" TAMA, supra, 100 S. Ct. at 245; Touche Ross \u0026 Co. v. Redington, supra, 99 S. Ct. at 2485; Cannon v. University of Chicago, supra, 99 S. Ct. at 1953 (1979). To me, this basic insight appears eminently wise. \"Federal courts are not common law courts of general jurisdiction.\" Majority Opinion at 1078. Our interpretation of a statute is not an occasion for our exercise of our own notions as to what we think Congress ought to have done, but rather an opportunity to give effect to that which Congress did in fact attempt to do. But there is no magic in the insight that our task is one of statutory construction, capable of vanishing the often almost intractable problems courts face in a case such as the present one. While this insight does help to focus our inquiry,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e it is quite often true, from the nature of the case, that when a court must decide whether a statute contains an implied remedy, the ordinary indicia of congressional intent will be of little assistance. If, for example, Congress made its intent to allow private actions explicit in the statute, there would be no need for litigation such as that before us. Nevertheless, the Supreme Court continues to make it clear that even in such cases as these courts are to find implied remedies when persuasive evidence of congressional intent supports them. See, e. g., Cannon v. University of Chicago, supra. Furthermore,\n\n(w)hile the absence of anything in the legislative history that indicates an intention to confer any private right of action is hardly helpful to the respondent, it does not automatically undermine his position. This Court has held that the failure of Congress expressly to consider a private remedy is not inevitably inconsistent with an intent on its part to make such a remedy available. Cannon v. University of Chicago, supra, 99 S. Ct. at 1953. Such an intent may appear implicitly in the language or structure of the statute, or in the circumstances of its enactment.\n\nTAMA, supra, 100 S. Ct. at 246. A court's quest must thus always be for the elusive beast, congressional intent. And it must be emphasized that courts are guilty of judicial legislation not only when they do that which Congress has not authorized, but also when they refuse to give effect to the congressional purpose.\n\nThe Supreme Court has established an analytical framework designed to drive from the brush the congressional intent regarding the establishment of an implied remedy under a statute. See Cort v. Ash, 422 U.S. 66, 95 S. Ct. 2080, 2088, 45 L. Ed. 2d 26 (1975). When we apply the four factors Cort identifies as \"relevant\" to the inquiry at hand,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e we must do so with our eyes wide open and in such a manner as to be most sensitive to that which we seek: persuasive evidence of congressional purpose. I cannot agree more that courts must avoid \"mechanical adherence\" to a \"multi-part test.\" Maj. Op. at 1078. But because I believe the majority has applied the analytical framework of Cort too restrictively at times even too mechanically to the circumstances of the present case, I must state my disagreement.\n\nParticularly relevant to my conclusion is the decision in the Cannon case. The Supreme Court there held that a private cause of action existed under § 901(a) of Title IX of the Education Act Amendments of 1972 (Title IX), 20 U.S.C.A. § 1681(a) (West 1978).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Although the language of that statute is quite different from that of § 503 of the Rehabilitation Act,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e much evidence shows that Congress' intent regarding the enforcement of each statute was roughly the same,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and many parallels do in fact exist between the enforcement mechanisms established under them.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e While Cannon does not control the disposition of this case, it is in many ways a pathfinder for those of us who must wind our way through the thickets of legislative history, the tundra of administrative implementation, and the timeworn plains of judicial precedent. But one must also recognize that Cannon is not the benchmark for the evaluation of whether or not Congress intended to create an implicit private right of action. As the Supreme Court pointed out, \"Title IX presents the atypical situation in which All the circumstances that the Court has previously identified as supportive of an implied remedy are present.\" Cannon, supra, 99 S. Ct. at 1968. Nevertheless, application of the analytical concepts of Cannon to § 503 compels my finding of an implied remedy.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nA.\n\nThe first inquiry is whether the plaintiff is \" \"one of the class for whose Especial benefit the statute was enacted' . . . that is, does the statute create a federal right in favor of the plaintiff?\" Cort v. Ash, supra, 95 S. Ct. at 2088. The thrust of this inquiry, as it bears on the legislative intent, is to determine whether, in passing the statute, Congress intended to benefit a clearly defined class that is, to create protections in the federal law for them and not to enact the law \"for the protection of the general public.\" Cannon, supra, 99 S. Ct. at 1954. This inquiry is a necessary one, for, if Congress did not intend to benefit a special class to which the plaintiffs belong, but intended instead to benefit the public generally, it is inherently less likely that Congress intended to create a private remedy which was not explicitly specified in the statute; else the whole criminal code, for example, might be found to have an implicit civil counterpart. See Cort v. Ash, supra, 95 S. Ct. at 2088-89. Properly conceived, this inquiry is a \"threshold question. \" Cannon, supra, 99 S. Ct. at 1953. I would conclude, as has every district court to examine § 503 in this context,\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e that § 503 reaches the threshold.\n\nRecent Supreme Court cases make it clear that our question is answerable \"by looking to the language of the statute itself.\" Id. See TAMA, supra, 100 S. Ct. at 245; Touche Ross \u0026 Co. v. Redington, supra, 99 S. Ct. at 2489. In explaining the application of this factor in Cannon, the Court used as one illustration the language involved in the early case of Texas \u0026 Pacific R. Co. v. Rigsby, 241 U.S. 33, 36 S. Ct. 482, 60 L. Ed. 874 (1916):\n\n(T)he statutory reference to \"any employee of any such common carrier\" in the 1893 legislation requiring railroads to equip their cars with secure \"grab irons or handholds,\" see 27 Stat. 531, 532, made \"irresistible\" the Court's earliest \"inference of a private right of action,\" in that case in favor of a railway employee who was injured when a grab iron gave way.\n\nCannon, supra, 99 S. Ct. at 1953.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Thus, to determine whether § 503 benefits a special class, we must ascertain whether it \"expressly identifies the class Congress intended to benefit\" and is drafted \"with an unmistakable focus on the benefited class.\" Id. at 1954-55.\n\nThe language of § 503 meets this test. Section 503(a) mandates that contracts made for the federal government must contain clauses requiring the contractor, \"in employing persons to carry out such contract,\" to \"take affirmative action to employ and advance in employment qualified handicapped individuals.\" Furthermore, § 503(b) authorizes \"any handicapped individual\" to file a complaint with the Department of Labor when he or she believes the contractor has failed to comply with his obligations, and the complaints authorized include individual complaints of discrimination.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Taken together, these elements of § 503 focus unmistakably on the class benefited, a class in which appellants have alleged their membership; the language of § 503 is at least as favorable to implication as the language involved in Rigsby, which, as I have noted, the Court approved in Cannon.\n\nDespite this fact, the majority suggests that more may be required of the statutory language before we may look favorably upon the question of inferring a private cause of action. Virtually ignoring the first half of the Cort formulation which tells us to ask whether the statute was enacted for the \"especial benefit\" of the plaintiff class, the majority seizes upon the second half which asks whether a \"federal right\" was created in favor of the class. It then relies heavily upon the statement in Cannon that \"the right or duty creating language of the statute has generally been the most accurate indicator of the propriety of implication of a cause of action.\" Cannon, supra, 99 S. Ct. at 1954 n. 13. Clearly, as the majority points out, the language of § 503 does not fit neatly into the pattern the Court identified in Cannon as the most fertile field for implication.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e But equally clearly, I think, the Court did not intend to require a statute to incorporate some talismanic incantation before it can be deemed to create a federal right for its intended beneficiaries. We should look to the substance of the obligations created by the statute and not wear the kind of judicial blinders that force us to exalt the form of language over its content. After all, the Supreme Court has told us only that a particular form of language may be the \"most accurate indicator\" of whether an implied remedy is present; it did not make that form a Sine qua non. When the statutory language falls into the pattern identified in Cannon, it may itself provide direct evidence of congressional intent to create an implied remedy. When it does not, but nevertheless reveals a clear intent to benefit the plaintiff class, other indicia of congressional intent must be considered. See TAMA, supra, 99 S. Ct. at 245-46. As evidence of the congressional intent present in § 503, I propose to examine whether or not it may fairly be read as creating a \"federal right\" in favor of the plaintiff class. I think it can.\n\nFirst, § 503(a) Requires the affirmative action clause to be incorporated in all covered contracts. While the obligation may be contractual, it is not a bargained term. Contractors must agree to it to do business with the federal government. In fact, the OFCCP regulations provide that whether or not the affirmative action clause is physically incorporated into the contract or whether or not the contract is even a written one, the clause shall be deemed a part of the contract by \"operation of the Act.\" 41 C.F.R. § 60-741.23 (1978). Thus, in operation, § 503 is very much like Title VI or Title IX with their explicit declarations of policy. Indeed, the Department of Health, Education and Welfare (HEW) requires contractual assurances under those provisions. See 45 C.F.R. §§ 80.4 \u0026 86.4 (1978).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nSecond, as noted, § 503(b) permits the intended beneficiaries of the Act to invoke its protections by filing an administrative complaint. These provisions make § 503 in its entirety both more and less than Title IX in terms of the explicit conferral of a benefit on the beneficiary class. While it is only indirectly declarative of the federal policy, it explicitly provides for an individual right of relief.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nLooking at all these circumstances realistically, I think we should find that § 503 establishes protections in the federal law for qualified handicapped individuals and indicates that Congress meant these rights to vest on individual discriminatees. The structure and substance of the statute create the federal right the majority requires. While the language of § 503 does not fit the pattern most favorable for finding an implied remedy and it is appropriate to scrutinize closely the other factors relevant to the question of the congressional intent, I nevertheless would find that \"the threshold question under Cort,\" Cannon, supra, 99 S. Ct. at 1946, is squarely met here.\n\nB.\n\nIf the first Cort factor casts only an oblique light on congressional intent to create an implied remedy, the second factor illuminates the question directly. The inquiry here searches for \"any indication of legislative intent, explicit or implicit, either to create such a remedy or to deny one.\" Cort v. Ash, supra, 95 S. Ct. at 2088. The Supreme Court has told us that this factor \"requires consideration of legislative history.\" Cannon, supra, 99 S. Ct. at 1956.\n\nTo say that the history of the legislative consideration and elucidation of the Act is complex is to be guilty of an understatement more daring, perhaps, than even a Hemingway would risk.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The cases require, however, that a court wind its way, Theseus-like, through its labyrinthine corridors of vetoes, amendments, and even more amendments, following always the Ariadne's thread of the legislative consideration of § 503. I therefore propose to investigate the legislative history of the Rehabilitation Act, the Rehabilitation Act Amendments of 1974 (the 1974 Amendments), and the attorney's fees provisions of the Rehabilitation, Comprehensive Services, and Developmental Disabilities Amendments of 1978 (the 1978 Amendments). I will then discuss the significance to be attached to Congress' statements of its intentions in § 503.\n\n1. The Rehabilitation Act.\n\nAs Congress passed and repassed the Act in 1972 and 1973, it established wide-ranging federal and federally-funded programs to aid in the more complete integration of handicapped individuals into the mainstream of society. See S.Rep.No.93-318, Supra, at 2090-92. Most of the discussion in Congress and, after the vetoes, most of the controversy, focused on these programs and the appropriations they required. Consequently, Congress devoted little of its discussion to its intentions regarding the noncontroversial antidiscrimination provisions of Title V of the Act including § 503.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nFurther, Congress had already considered and resolved its questions regarding the use of the power of the federal purse to enforce civil rights as early as 1964 in its consideration of Title VI. See NAACP v. Medical Center, Inc., supra, 599 F.2d at 1253-54. Then, in enacting Title IX of the Education Act Amendments of 1972, it again trod this same ground. When it came to consider §§ 503 and 504 of the Rehabilitation Act in 1972 and 1973, which were in the pertinent ways analogous to these other statutes, it not surprisingly found no occasion to pause to reconsider or further explain its intentions in adopting this mode of attack.\n\nSuch discussion as did take place is of little aid in ascertaining whether Congress contemplated a private right of action under § 503. The statements most nearly addressing the question are at best of dubious import. During the original consideration of the legislation in 1972, Senator Humphrey submitted a statement, introduced on the floor by Senator Cranston, in which he commented on the inclusion of the predecessors of §§ 503 and 504 in the Act. He indicated his belief that these provisions \"carr(ied) through the intent\" of bills he had introduced to amend Titles VI and VII of the Civil Rights Act of 1964 \"to guarantee the right of persons with a mental or physical handicap to participate in programs receiving Federal assistance, and to make discrimination in employment because of these handicaps, and in the absence of a bona fide occupational qualification, an unlawful employment practice.\" 118 Cong.Rec. 32310 (1972).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e While this statement does not establish that a private cause of action was intended under § 503, equally certainly it does not show an intent to deny such a remedy. Nor, in fact, do any of the other statements made during the consideration of the Act.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e As was apparent to the Congress at the time, it had attempted so much in the legislation that its full implications could not be immediately apparent.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n2. The 1974 Amendments\n\nCongress began its clarification of those implications when it amended the Act in 1974. In particular, it focused on the problems of § 503's implementation in its amendment of the definition of \"handicapped individual\" applicable to that section.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e As the original conference report shows, Congress meant the amendment to effectuate more fully its original intention to provide all qualified handicapped individuals protection against discriminatory practices, and, under § 503, to require affirmative action for their benefit under contracts in which federal funds were expended. It meant, in addition, to clarify its intention that discrimination against the handicapped was to be treated as similarly as possible to that against other minority groups in those contexts in which the Act applied. See S.Conf.Rep.No.93-1270, 93d Cong., 2d Sess. 25, 26 (1974).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIn explaining how §§ 503 and 504 were to be implemented under this new definition, the conference report pointed out that:\n\nSection 504 was patterned after, and is almost identical to, the anti-discrimination language of Section 601 of the Civil Rights Act of 1964 (Title VI) . . . and Section 901 of the Education Amendments (sic) of 1972 (Title IX) . . . . This approach to the implementation of Section 504, which closely follows the models of the above-cited anti-discrimination provisions, would . . . permit a judicial remedy through a private action.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nAnd, immediately following this statement, the report continues:\n\nIt is intended that Sections 503 and 504 be administered in such a manner that a consistent, uniform and effective Federal approach to discrimination against handicapped persons would result.\n\nId. at 27.\n\nSenator Stafford, ranking minority member of the Subcommittee on the Handicapped of the Committee on Labor and Public Welfare and a leading advocate of this legislation on the floor during all stages of its consideration, addressed these same considerations during the Senate debate. After referring to §§ 503 and 504 along with Title VI and Title IX, and quoting part of the original Senate report, he stated:\n\nAs the Senators are aware, the sections I have just cited establish Federal Government policies as they relate to programs receiving Federal financial assistance and the prohibition against discrimination on any basis. It was the committee's intent that the enforcement under sections 503 and 504 would be similar to that carried out under section 601 of the Civil Rights Act and 901 of the Education Amendments (sic) of 1972.\n\nI cannot stress strongly enough the need for strong enforcement of Sections 503 and 504 . . . .\n\n120 Cong.Rec. 30551 (1974).\n\nTaken together, these statements present cogent, though not decisive, evidence that Congress contemplated a private right of action under § 503. First, the statement in the report regarding the existence of a private right of action under § 504 has been given great weight in cases finding that such cause exists under that section.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Second, while the statement immediately following, to the effect that administration of §§ 503 and 504 should be \"consistent\" and \"uniform,\" is not unambiguous, it may fairly be read to suggest that Congress intended an implied remedy under § 503 and at the least indicates an implicit Congressional recognition that, since a private right of action would not be inconsistent with its purposes in § 504, neither would it be inconsistent with those underlying § 503.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Third, Senator Stafford's statement, developing the themes of the report, expressly recognizes the similarity of the original congressional intent underlying §§ 503 and 504, and a further similarity between that underlying those sections and Title VI and Title IX. In Cannon, in which the Supreme Court held that a private cause of action existed under Title IX, it relied heavily on expressions of congressional understanding that Title IX was to have similar enforcement mechanisms to those of Title VI and that a private cause of action existed under the latter provision. Cannon, supra, 99 S. Ct. at 1956-60. In this case, one again finds Congress building on its understanding of the enforcement mechanisms of Title VI and Title IX. In sum, this material constitutes at least some evidence that Congress contemplated a private cause of action under § 503.\n\nWe need not, however, rely on this evidence alone. Congress in 1978 provided even more persuasive evidence that § 503 had been intended to create a private cause of action in the federal courts.\n\n3. The 1978 Amendments\n\nThe attorney's fees provision of the 1978 Amendments constitutes an unimpeachable statement by Congress that it understood § 503 to include an implied private remedy and provides strong evidence of its original intent. In fact, if Congress did not understand that in § 503 it had already created such a remedy, this provision insofar as it applies to § 503 which it clearly does would make little sense; for there would be no private action to which it would apply.\n\nThe 1978 amendments added a new section, § 505, 29 U.S.C.A. § 794a (West Supp.1979), to the Act, which in relevant part provides:\n\nIn any action or proceeding to enforce or charge a violation of a provision of this subchapter, the court, in its discretion, may allow the prevailing party, other than the United States, a reasonable attorney's fee as part of the costs.\n\ns 505(b), 29 U.S.C.A. § 794a(b). By its terms this provision applies to § 503 and explicitly presumes private and independent judicial actions. Cf. Cannon, supra, 90 S. Ct. at 1958-9. (attorney's fees for Title VI) Since attorney's fees are to be made available to parties \"other than the United States,\" the statute contemplates the presence of private plaintiffs who attempt \"to enforce or charge a violation of\" the section. Furthermore, the language clearly looks to an \"action or proceeding\" before \"the court,\" not before an administrative agency.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Lest there be any doubt about the implications of this enactment, I turn to its legislative history, which resoundingly supports my interpretation both of the amendment and § 503.\n\nFirst, while the original house bill (H.R.12467) explicitly provided fees for private actions brought under §§ 501, 503 or 504 of the Act,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e the Senate bills' attorney's fee provision the source for § 505 as set out above dropped the reference to the individual sections and made itself applicable generally to all sections of Title V. The Senate report, however, further clarified the intent underlying the provision:\n\nThe committee believes that the rights extended to handicapped individuals under Title V, that is, Federal government employment, physical accessibility in public buildings, Employment under federal contracts, and nondiscrimination under federal grants are and will continue to be in need of constant vigilance by handicapped individuals to assure compliance and The availability of attorney's fees should assist in vindicating private rights of action in the case of section 502 and 503 cases, as well as those arising under section 501 and 504.\n\nS.Rep.No. 95-890, 95th Cong., 2d Sess. 19 (1978) (emphasis supplied).\n\nThe debates on the floor of the Senate further support my conclusions concerning both the intent underlying § 505 and that underlying § 503. Senator Cranston, who had been Senate floor manager of all the previous legislation and who authored the attorney's fee provision, listed the sections of the Act covered by the provision, including \"employment under federal contracts,\" and added, \"Private enforcement of these Title V rights is an important and necessary aspect of assuring that these rights are vindicated and enforcement is uniform.\" 124 Cong.Rec. 15590 (daily ed. Sept. 20, 1978). Later a colloquy between Senators Cranston and Bayh indicated explicitly that both Senators understood that Title V of the Act authorized private suits, just as they understood Title VI and Title IX did. This colloquy further indicated that the Senators understood Title V of the Act, including § 503, to have originally contemplated private suits and, correspondingly, that what the Congress said and did now was merely a clarification of that original intent and an attempt to ensure its vindication. Senator Bayh cited cases such as Bossier Parish School Board v. Lemon, supra, as correctly interpreting congressional intent under Title VI by allowing such private suits. He concluded:\n\nI thank the distinguished Senator from California for taking time to make clear the Continuing intention of Congress that private actions be allowed under titles VI and VII of the Civil Rights Act of 1964, title IX of the Education Amendments (sic) of 1972 and title V of the Rehabilitation Act of 1973.\n\n124 Cong.Rec. S15593 (daily ed. Sept. 20, 1978) (emphasis supplied).\n\nNot one of these statements was ever questioned during the consideration of this legislation.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\n4. The Significance of the Legislative Materials\n\nTaking into account the totality of the legislative consideration of § 503, this much at least is indisputable: Congress had told us though subsequent to the passage of § 503 that it originally intended an implied remedy under § 503 and now firmly understands that such a remedy exists. We may know this not only from individual statements of members of Congress and not only from the reports of congressional committees, but also from an enactment of positive law the attorney's fees provision voted upon by all members of Congress, premised on that understanding of the original intent and that, insofar as it applies to § 503, makes no sense if that understanding is wrong.\n\nNevertheless, the majority has decided that Congress is wrong and leaves dangling the attorney's fees provision for § 503. They hold that all the legislative materials I have discussed are unpersuasive and read from the congressional silence in 1973 an intent to disallow private actions under § 503. I take as typical of the majority's approach to this matter its conclusions regarding the consideration and passage of the attorney's fees amendments in 1978:\n\nIt may, therefore, fairly be said that the 1978 committees of both Houses assumed that a private cause of action had somehow been created in the past. The existence of such a postulate is neither logical nor legislative basis to conclude that the 1973 statute did in fact create the action; and, if the 1973 statute did not authorize the cause of action, the 1978 statute evidences no intention to create one. An assumption is not law.\n\nMaj. Op. at 1082. There are several problems with this type of analysis. First of all, it ignores the fact that Congress in 1978 and, indeed, in 1974 did not merely tell us that it Assumed a private cause of action existed, but told us that it had originally intended such an implied remedy that this was its \"continuing intention.\" Second, the majority fails to give due regard to the fact that we deal here not only with the views of two committees, but also with an action taken by both Houses of Congress in enacting laws. As I have shown, the attorney's fees provision is premised on the existence of an implied remedy. Finally, and perhaps most significantly, the Supreme Court in Cannon considered and rejected precisely the type of reasoning the majority employs. The crux of the question before us is Not whether Congress in 1974 or 1978 intended Then to create a private cause of action under § 503, but whether we may give weight to these later statements in interpreting the original intent. The Supreme Court has told us in Cannon not only that we can give them persuasive weight, but that we must.\n\nAfter the seventh circuit originally held that no implied remedy existed under Title IX, it granted a petition for rehearing to determine \"whether the inclusion of Title IX within the provisions of the Civil Rights Attorney's Fees Award Act of 1976 . . . require(d) a different resolution of the Title IX issue . . . .\" Cannon v. University of Chicago, 559 F.2d 1063 (7th Cir. 1976), Rev'd, 441 U.S. 677, 99 S. Ct. 1946, 60 L. Ed. 2d 560 (1979). In reaffirming its original result, the seventh circuit concluded:\n\nAs we read the legislative history of the Attorney's Fees Award Act, it provides no support for plaintiff's argument that the inclusion of Title IX within the Act was intended to provide a private right of action under Title IX. At best, the remarks to which plaintiff has referred us suggest only that some members of Congress may have assumed that private suits were authorized under all of the statutes included within the Act. But, even if the entire Congress shared the assumption that a private right of action was authorized by Title IX, none of the precedents on which plaintiff relies would be controlling, for they involved subsequent legislative history explicitly declarative of Congress's own intent in passing a given statute, rather than a mere assumption concerning a judicial construction that had been or might be placed on a statute after its enactment.\n\nId. at 1079.\n\nIn reversing the seventh circuit, the Supreme Court rejected this mode of analysis. After taking note of the lower court's conclusion that the 1976 Attorney's Fees Act did not intend \"to create a remedy that did not previously exist,\" the Court reasoned as follows:\n\nWe find nothing objectionable in this conclusion, as far as it goes. The legislative history quoted in the opinion of the Court of Appeals makes clear that the supporters of the legislation did not intend it to amend Title IX to include an express cause of action where none existed before. Instead, they clearly only meant to provide attorney's fees in the event that that statute as it had always existed implicitly created a cause of action. 559 F.2d at 1079-1080.\n\nOn the other hand, the language added to § 1988 by the 1976 amendment and the legislative history surrounding it does indicate that many \"members of Congress may have assumed that private suits were authorized under\" Title IX, Id., at 1079, and, more importantly, that many members felt that private enforcement of Title IX was entirely consistent with, and even necessary to, the enforcement of Title IX and the other statutes listed in § 1988. . . .\n\nAlthough we cannot accord these remarks the weight of contemporary legislative history, we would be remiss if we ignored these authoritative expressions concerning the scope and purpose of Title IX and its place within \"the civil rights enforcement scheme\" that successive Congresses have created over the past 110 years.\n\n99 S. Ct. at 1952 \u0026 n.7. This reasoning is fully applicable to the subsequent legislative consideration of § 503 I have set out above and particularly to the 1978 Amendments' provision of attorney's fees.\n\nFurthermore, the third circuit, in concluding that an implied remedy existed under Title VI, reached a conclusion similar to that I urge here regarding the significance of the later addition of attorney's fees provisions covering that statute. The court stated:\n\nIt is also persuasive evidence of intent that Congress has repeatedly enacted attorneys' fee legislation implicitly predicated on the fact that Title VI may be enforced in a private action. While this legislation does not amount to a conclusive demonstration that a private cause of action exists, the fact that Congress has explicitly provided for attorneys' fees under Title VI, coupled with the fact that Congress has had the opportunity to foreclose a private action but has not done so, supports our interpretation of legislative intent and our construction of the legislative scheme envisaged by the enacting Congress.\n\nNAACP v. Medical Center, Inc., supra, 599 F.2d at 1255. (footnotes omitted).\n\nFinally, it is a well-established principle that the post-enactment treatment of a statute by Congress is cogent evidence of the intent of Congress at the time of its passage. This principle is not premised on the power of Congress to repeal or amend the original enactment, as the majority suggests; rather it derives from the understanding that Congress is a creditable interpreter of its own actions and that courts should pay heed to its interpretations. See, e. g., Chrysler Corp. v. Brown, 441 U.S. 281, 99 S. Ct. 1705, 1716-17, 60 L. Ed. 2d 208 (1979); Red Lion Broadcasting Co. v. F. C. C., 395 U.S. 367, 89 S. Ct. 1794, 1801, 23 L. Ed. 2d 371 (1969); Federal Housing Administration v. The Darlington, Inc., 358 U.S. 84, 79 S. Ct. 141, 145, 3 L. Ed. 2d 132 (1958); Lloyd v. Regional Transportation Authority, supra, 548 F.2d at 1285 (7th Cir. 1977).\n\nThe majority has stated that the statutory silence regarding the existence of a private remedy \"is not given meaning by voices in the legislative background.\" Maj. Op. at 1078. It is, however, given meaning by a multitude of voices in the legislative foreground, and one of the central questions in this case is whether we shall listen to them. For all the reasons I have indicated, I think we should. I propose that we give full credit to the good faith and authoritative attempts of Congress to make its original intent known in a case such as this, absent some grounds for believing it unreasonable to do so. In the case at hand, we have not merely the individual statements of one of two members of Congress, but a series of authoritative and uncontradicted statements by those intimately involved with this legislation from its inception and by committees in both houses.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Furthermore, in the 1978 attorney's fees provision, we have an enactment of positive law premised on Congress' \"settled understanding,\" See Chrysler Corp. v. Brown, supra, 99 S. Ct. at 1716-17, that it already created a private remedy in § 503.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e In these circumstances, I think it is unreasonable Not to find a congressional intent to create such a remedy. The majority has cautioned, paraphrasing Samuel Butler, of the dangers of attempts by mortals to rewrite history. Their approach to these significant and authoritative legislative materials, however, would unfairly relegate them to the anagrammatical antecedent of Mr. Butler's Erewhon.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nC.\n\nCannon guides the application of the third Cort criterion: \"A private remedy should not be implied if it would frustrate the underlying purpose of the legislative scheme. On the other hand, when that remedy is necessary or at least helpful to the accomplishment of the statutory purpose, the Court is decidedly receptive to its implication under the statute.\" Cannon, supra, 99 S. Ct. at 1961 (footnote omitted).\n\nThe majority sets forth two reasons for concluding that this factor is an impediment to the inference of a private right of action under § 503. First, in the fact that the OFCCP has emphasized \"conciliation and persuasion\" and \"informal means\" of resolution in its regulations and has failed to provide for a private remedy, they find the suggestion that a private remedy is inconsistent with the administrative enforcement mechanism. Second, they argue that \"(t)he provision of an express administrative remedy for qualified handicapped persons creates at least some basis to conclude that a private right of action would be inconsistent with the purposes of the legislative scheme,\" Citing National Railroad Passenger Corp. v. National Association of Railroad Passengers, 414 U.S. 453, 94 S. Ct. 690, 693, 38 L. Ed. 2d 646 (1974) (Amtrak) and TAMA, supra, 100 S. Ct. at 247. I think the position now taken by the OFCCP and the Department of Labor on these questions and the Supreme Court's analysis of the administrative scheme under Title IX, which bears close functional similarities to that under § 503,\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e provide definitive rebuttals to these contentions.\n\nFirst, the OFCCP and the Department of Labor, charged with the enforcement of § 503, have taken the clear position that § 503 contains an implied remedy under the circumstances present in these cases.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e In their own right, the views of the agency charged with the administrative enforcement of a statute are entitled to great deference from the courts in their construction of the statute. See, e. g., Miller v. Youakim, 440 U.S. 125, 99 S. Ct. 957, 969, 59 L. Ed. 2d 194 (1979); Board of Governors of Federal Reserve System v. First Lincolnwood Corp., 439 U.S. 234, 99 S. Ct. 505, 514, 58 L. Ed. 2d 484 (1978); Red Lion Broadcasting Co. v. F.C.C., 395 U.S. 367, 89 S. Ct. 1794, 1802, 23 L. Ed. 2d 371 (1969); Zemel v. Rusk, 381 U.S. 1, 85 S. Ct. 1271, 1278, 14 L. Ed. 2d 179 (1965); Udall v. Tallman, 380 U.S. 1, 85 S. Ct. 792, 801, 13 L. Ed. 2d 616 (1965). More specifically, however, the OFCCP has explicitly addressed and dismissed the concerns expressed by the majority. It has stated its belief not only that \"a private right of action would be consistent with Congress' intent,\" but also that such a private remedy would \"greatly assist\" its enforcement efforts. It believes this assistance necessary because it has insufficient resources to investigate and resolve the growing backlog of § 503 administrative complaints. See Appendix P 3. Moreover, the OFCCP has specifically rejected the notion that a private action under § 503 would seriously interfere with its attempts at informal conciliation. It has indicated its belief that \"the prospect of litigation would have a sobering effect on the parties concerned, and actually encourage informal conciliation.\" And, while conceding a private action might on occasion negatively affect such negotiations, \"it has concluded that when all the relevant factors are weighed, including the Department's limited resources, the ultimate objective that of effectively enforcing the statute will best be served by permitting a private right of action.\" See Appendix P 4.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e In deciding the Title IX issue in Cannon, the Supreme Court gave great weight to the analogous contentions advanced there by HEW regarding the relationship between a private remedy and the administrative enforcement scheme. See Cannon, supra, 99 S. Ct. at 1962-63 \u0026 nn. 41 \u0026 42. Under all these circumstances, I can perceive no justification for this court's refusal to accept, or even acknowledge, the OFCCP's position regarding the consistency of an implied remedy with the statutory goals or the administrative enforcement scheme.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nSecond, the Supreme Court in Cannon analyzed Title IX's purposes, administrative scheme, and the consistency of a private remedy with these, and concluded that a private remedy \"is not only sensible but is fully consistent with and in some cases necessary to the orderly enforcement of the statute.\" Cannon, supra, 99 S. Ct. at 1962. (footnote omitted) Because of the close analogies between Title IX's purposes and enforcement scheme and those of § 503, I think the application of Cannon's method of analysis to § 503 compels the same result here.\n\nOne of Congress' primary purposes in § 503 was to protect handicapped individuals from discrimination in employment by federal contractors. In analyzing Title IX in Cannon, the Supreme Court identified \"two related, but nevertheless somewhat different, objectives. First, Congress wanted to avoid the use of federal resources to support discriminatory practices; second, it wanted to provide individual citizens effective protection against those practices.\" Cannon, supra, 99 S. Ct. at 1961. From the very nature of § 503, I conclude that it seeks these same objectives, and, as in Cannon, I do not believe the latter goal can be labelled \"secondary.\" In fact, an examination of the legislative history reveals beyond doubt that protection of handicapped individuals from discrimination was a primary purpose of the legislation.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e As under Title IX, the remedy of withdrawal of the federal monies under § 503 may serve the first mentioned purpose.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e But, again, as under Title IX, \"(t)hat remedy is, however, severe and often may not provide an appropriate means of accomplishing the second purpose if merely an isolated violation has occurred.\" Cannon, supra, 99 S. Ct. at 1961. In that situation, a court remedy for the injured individual would certainly be more appropriate. See id. at 1961-62. Furthermore, the simple logic of the situation tells us that the OFCCP will be hesitant to invoke the rather draconian remedies provided for in its regulations in such situations,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e and thus the injured individual should not be required to demonstrate that a contractor's discriminatory practices are so pervasive as to require such remedies. See id. at 1962. \"The award of individual relief to a private litigant who has prosecuted her own suit is not only sensible but is fully consistent with and in some cases even necessary to the orderly enforcement of the statute.\" Id. (footnote omitted)\n\nI think it useful here to set out individually the additional factors the Supreme Court relied upon in Cannon in concluding that a private action was consistent with Title IX's purposes and to show how they apply to this case.\n\n1. The Court \"has never withheld a private remedy where the statute explicitly confers a benefit on a class of persons and where it does not assure those persons the ability to activate and participate in the administrative process contemplated by the statute.\" Id. at 1962-63 n. 41.\n\nUnlike § 902 of Title IX, 20 U.S.C.A. § 1682 (West 1978), § 503(b) does allow an individual to activate the administrative process. Again, however, the Administrative schemes under the statutes are analogous. Both allow an individual to trigger the administrative process; neither allows him to participate in that process.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Compare 41 C.F.R. § 741-26 (1978) With 45 C.F.R. § 86.71 (1978), Adopting by reference 45 C.F.R. § 80.7 (1978).\n\n2. Even if administrative proceedings \"result in a finding of a violation, a resulting voluntary compliance agreement need not include relief for the complainant.\" Cannon, supra, 99 S. Ct. at 1962-63 n. 41.\n\nIt appears that if the OFCCP finds a violation after investigation and achieves voluntary compliance, at least some \"corrective action\" regarding the complaint must be taken, although what action must be taken is not certain. See 41 C.F.R. § 60-741.26(g)(2) (1978). The OFCCP has full authority to determine what \"corrective action\" will be required. The complainant has no control over the disposition of his case even when his perception of his own best interest clashes with the perception of the OFCCP.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nFurthermore, if the voluntary compliance mechanism fails to provide relief for the individual complainant, the regulations make no express provision for obtaining individual relief. See 41 C.F.R. § 60-471.28 (1978). Thus, in such cases, an individual right of action is necessary to fulfillment of the second statutory purpose.\n\n3. \"(T)he agency may simply decide not to investigate a decision that often will be based on a lack of enforcement resources, rather than on any conclusion on the merits of the complaint.\" Cannon, supra, 99 S. Ct. 1962-63 n. 41.\n\nThe OFCCP regulations similarly leave it discretion to decide not to investigate. See 41 C.F.R. § 60-741.26(g)(1) (1978). In fact, the OFCCP itself has pointed out the problems created by this discretion: \"The net effect of such discretion is that there is no assurance that compliance decisions are not tempered by political, procurement, personal or other potentially competing or conflicting considerations.\" Office of Federal Contract Compliance Programs Task Force, Preliminary Report on the Revitalization of the Federal Contract Compliance Program 153 (1977). (Task Force) Furthermore, the OFCCP has conceded that it does not have adequate resources to protect fully the individual interests of handicapped employees and has supplied data to support its position. See Appendix, P 3. In these circumstances, if a private remedy does not exist, the individual whom Congress sought to protect may be left without any recourse.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nIn addition, it must be pointed out that the Supreme Court in Cannon considered and rejected the proposition advanced by the majority in this case that the existence of an administrative scheme such as that before us here is a bar to the inference of private action. The seventh circuit relied heavily upon the Title IX administrative mechanism in holding that that statute did not contain an implied remedy. See Cannon v. University of Chicago, 559 F.2d 1063, 1072-74 (7th Cir. 1976), Rev'd, 441 U.S. 677, 99 S. Ct. 1946, 60 L. Ed. 2d 560 (1979). After reviewing Title IX's statutory and administrative scheme as indicated above, the Supreme Court rejected this argument. See 99 S. Ct. at 1962-63 n. 41. Because of the close similarities which I have pointed out between Title IX's scheme and that under § 503, I think this court should adopt the same position as did the Supreme Court in Cannon.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nFinally, Congress apparently sees no inconsistency between the existence of a private remedy and its purposes in § 503. Its provision of attorney's fees for cases under § 503 must indicate as much. Cf. Cannon, supra, 99 S. Ct. at 1952 n. 7, 1962 n. 41 (attorney's fees under Title VI and Title IX).\n\nFor all these reasons, I find inference of a private right of action consistent with the underlying purposes of § 503. Such right is helpful, even necessary, to its purposes and certainly would not frustrate them. Furthermore, for these same and additional reasons, I would conclude that exhaustion of administrative remedies should not be required from appellants in these cases.\n\nFirst, the OFCCP has taken the position that, in suits such as those before us, there should be no strict requirement of exhaustion of the administrative process before a private action may proceed. See Appendix P 2. It appears to opt instead for a flexible approach, such as that urged by HEW under Title IX, under which a district court has the option of deferring to the agency's decision, if one has been reached, or staying its hand if the agency so requests and asserts that administrative enforcement might be hampered by the private suit. See Cannon, supra, 99 S. Ct. at 1952-53 n. 8. In Cannon, the Court indicated that great weight should be given to the agency position on such matters. Id. at 1962-63 n. 41. Clearly we should do so here also.\n\nThis result also would be in accord with that reached under the similar administrative scheme involved in Cannon. There the Court added, \"Because the individual complainants cannot assure themselves that the administrative process will reach a decision on their complaint within a reasonable time, it makes little sense to require exhaustion. See 3 K. Davis, Administrative Law Treatise § 20.01, at 57 (1958).\" Id. The mere fact that some administrative procedure is supplied does not mean that in every case an individual must moil through it. Many governmental functions may be better managed because exhaustion of the administrative process is required before individual action may be taken. The protection of the rights of the handicapped under § 503 does not, for the reasons discussed above, fall within this ban. Administrative and judicial remedies under § 503 may better be perceived as operating in tandem, not as part of a hierarchy.\n\nD.\n\nThe last Cort factor requires that we consider whether inference of a federal private right of action is inappropriate because the action is one \"traditionally relegated to state law, in an area basically the concern of the States.\" As was stated in Cannon, \"(n)o such problem is raised by a prohibition against invidious discrimination of any sort.\" In fact,\n\nsince the Civil War, the Federal Government and the federal courts have been the \"Primary and powerful reliances' in protecting citizens against such discrimination. Steffel v. Thompson, 415 U.S. 452, 464, 94 S. Ct. 1209, 1218, 39 L. Ed. 2d 505 (emphasis in original), quoting F. Frankfurter \u0026 J. Landis, The Business of the Supreme Court 65 (1928). Moreover, it is the expenditure of federal funds that provides the justification for this particular statutory prohibition. There can be no question but that this aspect of the Cort analysis supports the implication of a private federal remedy.\n\nCannon, supra, 99 S. Ct. at 1963.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nII\n\nIn sum, I think this case is a clear one for the finding of an implied remedy. First, the statutory language reveals a definite intent to confer a benefit upon appellants' class and provides a substantial predicate upon which to premise a private remedy. Second, persuasive evidence of legislative purpose indicates that such a private cause of action was intended to inhere in § 503. There exist not only explicit statements of individual members of Congress and committees of both Houses to support this conclusion, but an enactment of positive law premised upon the existence of such a remedy in § 503 as it was originally enacted. And the agency charged with administering the statute construes it to contain an implied remedy. Settled judicial authority requires that these indicia of congressional intent be given great persuasive value. Further, a private remedy is wholly consistent with the underlying statutory goals. The actions of Congress, the position of the agency charged with enforcing the statute, and judicial precedent make this certain beyond the slightest doubt. Finally, this area is not one pre-empted by state authority.\n\nHaving considered in great detail the factors identified by the Supreme Court as relevant to determining the congressional intent, I think there is only one reasonable conclusion: Congress intended qualified handicapped individuals to have a private remedy under § 503. The handicapped face two distinct barriers to full participation in our society one physical or mental and the other attitudinal. For those individuals who have overcome the physical or mental barrier and established their qualifications, Congress has established protections, under the terms of § 503, from the invidious discrimination that results from the attitudinal barrier. Those protections include a private cause of action in the federal courts. The majority, by its niggardly approach to the inference of the private remedy, has denied this valuable right. Recent Supreme Court decisions have made it clear that private remedies are not lightly to be inferred. The majority, I fear, has overreacted to these words of caution and, instead of vindicating the congressional purpose, defeat it. Their approach would, in my opinion, reduce Cort to ashes.\n\nAPPENDIX\n\nAFFIDAVIT OF WELDON J. ROUGEAU\n\nWeldon J. Rougeau, Director of the Office of Federal Contract Compliance Programs, Department of Labor, being duly sworn, deposes and says:\n\n1. The Department of Labor's Office of Federal Contract Compliance Programs (OFCCP) is responsible for the enforcement of Section 503 of the Rehabilitation Act of 1973.\n\n2. It is the position of the Office of Federal Contract Compliance Programs that complainants should have a private right of action under Section 503, and that they should be permitted to pursue such actions without first exhausting the Department of Labor's administrative process. While a person bringing a private action may seek individual or class relief, it is the Department's view that the sanctions of debarment, termination of contract funds, or the withholding of contract progress payments may be imposed on a contractor only by the Department.\n\n3. OFCCP believes that a private right of action would be consistent with Congress' intent, and would greatly assist the Department of Labor's effort to enforce Section 503. Such assistance has become necessary because of the large backlog of Section 503 administrative complaints, which the Department of Labor, due to limited resources, will not be able to investigate and resolve expeditiously.\n\nThe following Department of Labor data on Section 503 administrative complaints, which were filed and processed for fiscal year 1978 and for the first three-quarters of fiscal year 1979, clearly illustrate the developing agency backlog:\n\nFY 79\n\nFY 78 (1st 3/4's)\n\n*fn* Open Inventory 1270 1537\n\nComplaints Received 2682 2004\n\n*fn** Cases Established 2027 1412\n\nCases Closed 1760 813\n\nEnding Inventory 1537 2136\n\n4. The Department of Labor disagrees with the district court's views in Rogers v. Frito-Lay, Inc., 433 F. Supp. 200 (N.D.Tex.1977); Anderson v. Erie Lackawanna Ry. Co., 468 F. Supp. 934 (N.D.Ohio (1979)), and Wood v. Diamond State Telephone Co., 440 F. Supp. 1003 (D.Del.1977) that a private right of action would jeopardize informal efforts to resolve Section 503 complaints. The Department believes that the prospect of litigation would have a sobering effect on the parties concerned, and actually encourage informal conciliation. The Department, of course, acknowledges that in some situations conciliation efforts might be negatively affected. But it has concluded that when all relevant factors are weighed, including the Department's limited resources, the ultimate objective that of effectively enforcing the statute will best be served by permitting a private right of action.\n\n/s/ Weldon J. Rougeau\n\n\u003cspan class=\"fn\"\u003e1. 29 U.S.C. § 793 provides: S 793. Employment under Federal contracts (a) Amount of contracts or subcontracts; provision for employment and advancement of qualified handicapped individuals; regulations. Any contract in excess of $2,500 entered into by any Federal department or agency for the procurement of personal property and nonpersonal services (including construction) for the United States shall contain a provision requiring that, in employing persons to carry out such contract the party contracting with the United States shall take affirmative action to employ and advance in employment qualified handicapped individuals as defined in section 7(7) (29 USCS § 706(7)). The provisions of this section shall apply to any subcontract in excess of $2,500 entered into by a prime contractor in carrying out any contract for the procurement of personal property and nonpersonal services (including construction) for the United States. The President shall implement the provisions of this section by promulgating regulations within ninety days after the date of enactment of this section (enacted Sept. 26, 1973). (b) Administrative enforcement; complaints; investigations; departmental action. If any handicapped individual believes any contractor has failed or refuses to comply with the provisions of his contract with the United States, relating to employment of handicapped individuals, such individual may file a complaint with the Department of Labor. The Department shall promptly investigate such complaint and shall take such action thereon as the facts and circumstances warrant, consistent with the terms of such contract and the laws and regulations applicable thereto. This provision is part of the same act as section 504, 29 U.S.C. § 794, but must be distinguished from it. Section 504 provides as follows: S 794. Nondiscrimination under Federal grants and programs No otherwise qualified handicapped individual in the United States, as defined in section 7(7) (29 USCS § 706(7)), shall, solely by reason of his handicap, be excluded from the participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance or under any program or activity conducted by any Executive agency or by the United States Postal Service. The head of each such agency shall promulgate such regulations as may be necessary to carry out the amendments to this section made by the Rehabilitation, Comprehensive Services, and Developmental Disabilities Act of 1978 (Act Nov. 6, 1978; see Amendment note). Copies of any proposed regulation shall be submitted to appropriate authorizing committees of the Congress, and such regulation may take effect no earlier than the thirtieth day after the date on which such regulation is so submitted to such committees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Both appellants also attempted to allege causes of action arising under section 504 of the Act, 29 U.S.C. § 794, but those claims were abandoned in the district courts in both instances. The appeal here arises solely under the section 503 claim. We should also note that, while appellant Moon brought his action solely in his own behalf, appellant Rogers brought her action as a class action. Because the district courts dismissed both actions for the reason that they found no private right of action, this difference in status is not significant in our decision. The Department of Labor's Office of Federal Contract Compliance Programs (OFCCP) has authority for administration of this section and has promulgated regulations. See 41 C.F.R. § 60-741 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Lest this simple statement of the issue appear to provide an ingenuous answer, we note that plaintiffs ask us not to infer a private action to force the inclusion of affirmative action clauses in federal contracts, but to infer a private action to remedy actions of federal contractors that they claim discriminate against the handicapped.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Because we are satisfied that the fourth factor in Cort is satisfied this is not a matter traditionally relegated to state law we do not discuss it. The crucial inquiry is whether Congress intended a private judicial remedy as part of section 503. The most fruitful direction for that inquiry is a focus on the first three factors in Cort. See Touche Ross \u0026 Co. v. Redington, 1979, 442 U.S. 560, 575, 99 S. Ct. 2479, 2489, 61 L. Ed. 2d 82. Although we conform our analysis to the framework set down in Cort, we must remember that the framework is primarily a guide for the process of statutory construction. See Transamerica Mortgage Advisors, Inc. v. Lewis, 1979, 444 U.S. 11, 100 S. Ct. 242, 62 L. Ed. 2d 146. Thus, we are not entitled to infer the presence of a private judicial remedy in the face of Congressional silence if the language and structure of the statute do not support the inference, even though in other circumstances silence would not be dispositive. See id. (discussing Cannon v. University of Chicago, 1979, 441 U.S. 677, 99 S. Ct. 1946, 60 L. Ed. 2d 560).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We are aware that the affirmative action clause inserted in federal contracts pursuant to 29 U.S.C. § 793 bans discrimination on the basis of handicaps. See 41 C.F.R. § 60-741.4 (1978). There is also language in the legislative history indicating that the section has an antidiscrimination component. See Rep.No. 93-318, 93d Cong., 2d Sess. (1973). See generally, Note, Private Rights of Action for Handicapped Persons under Section 503 of the Rehabilitation Act, 13 Val.U.L.Rev. 453 (1979). However, its principal thrust is to ensure that federal contractors will take affirmative steps to employ the handicapped, See S.Rep.No. 93-318, 93d Cong., 2d Sess. (1973); S.Conf.Rep.No. 93-1270, 93d Cong., 2d Sess. (1974), and the legislative history does not provide any basis for defining the nature of the antidiscrimination component we are asked to read into the affirmative action language of the statute. The plaintiffs do not assert a claim based on putative status as third party beneficiaries of a federal contract, and we do not undertake to discuss the issues, neither briefed nor argued on appeal, whether a federal contract containing provisions required by statute creates a third-party beneficiary relationship, See Restatement of Contracts, §§ 133-147 (1932), and what would be the jurisdictional basis for a suit by such a third-party beneficiary in a federal court. If the thesis is plausible, we would also need to consider whether implication of a third-party beneficiary claim turns on the same considerations as implication of a private cause of action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Cannon v. University of Chicago, 1979, 441 U.S. 677, 686 n. 7, 99 S. Ct. 1946, 1952 n. 7, 60 L. Ed. 2d 560, 569 n. 7. The Cannon court noted, despite its partial reliance on later legislative history, that \"we cannot accord these remarks the weight of contemporary legislative history . . . .\" Id. In contrast to the situation here, there was in Cannon substantial contemporary legislative history supporting the court's view of the statute, Id. at 694, 99 S. Ct. at 1956-57, 60 L. Ed. 2d at 574.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This apparently prompted Senator Robert Stafford, who was not one of the conferees but was a leading advocate of the Rehabilitation Act throughout its consideration, to state that it was intended that enforcement under both sections 503 and 504 would be similar to enforcement under section 601 of the Civil Rights Act and section 901 of the Education Amendments. 120 Cong.Rec. 30551 (1974). It is noteworthy, however, that immediately following its suggestion that enforcement of sections 503 and 504 should be \"uniform,\" the conference committee indicated that enforcement of the two sections would be handled by separate agencies. Sen.Conf.Rep.No. 93-1270, Supra at 27-28. It assigned to the Secretary of HEW \"responsibility for coordinating the section 504 enforcement effort\" because of that department's experience in combatting discrimination. Of course, that experience includes familiarity with coordinating private causes of action and administrative enforcement. Section 503 enforcement authority was, however, left to the Department of Labor, in response to Executive Order No. 11758, 39 Fed.Reg. 2075 (Jan. 15, 1974), as amended by Executive Order No. 11784, 39 Fed.Reg. 19443 (May 30, 1974). That order allows the Secretary of Labor to proscribe regulations for enforcement of section 503, including regulations providing for the waiver of section 503's requirements. Congress's adoption of the separation of enforcement of the two sections, and its apparent willingness to have enforcement of section 504 only in the hands of the department with expertise in dealing with private lawsuits, suggests that its desire for \"uniform\" enforcement may not have encompassed enforcement techniques. It is also difficult to believe that Congress intended a private cause of action under section 503 since it failed to comment on an Executive Order which allows contracting departments to exempt contracts from the section's provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This amendment added a new section, section 505, 29 U.S.C.A. § 794a (West Supp.1979), to the Act, which in relevant part provides: In any action or proceeding to enforce or charge a violation of a provision of this subchapter, the court, in its discretion, may allow the prevailing party, other than the United States, a reasonable attorney's fee as part of the costs. Section 505(b), 29 U.S.C.A. § 794a(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For instance, the House Report states that this part of the amendments \"permits courts to award attorney's fees to successful parties in judicial actions to enforce the provisions of Title V.\" H.R.Rep.No. 95-1149, 95th Cong.2d Sess. (1978), Reprinted in (1978) U.S.Code Cong. \u0026 Admin.News, pp. 7312, 7313. See also id. at 7332.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In a report issued September 13, 1979, the Senate Committee on Labor and Human Resources, considering legislation to amend Title VII of the Civil Rights Act of 1964 to prohibit discrimination against individuals because they are handicapped, stated \"the Committee's intent that any handicapped individual aggrieved by a violation of Title V\" has the right to proceed in federal court, \"and to receive backpay and attorney's fees if successful.\" Sen.Rep.No. 96-316, 96th Cong., 1st Sess. 12-13 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 41 C.F.R. § 60-741-4 provides: S 60-741.4 Affirmative action clause. Each agency and each contractor and subcontractor shall include the following affirmative action clause in each of its covered government contracts or subcontracts (and modifications, renewals, or extensions thereof if not included in the original contract). AFFIRMATIVE ACTION FOR HANDICAPPED WORKERS (a) The contractor will not discriminate against any employee or applicant for employment because of physical or mental handicap in regard to any position for which the employee or applicant for employment is qualified. The contractor agrees to take affirmative action to employ, advance in employment and otherwise treat qualified handicapped individuals without discrimination based upon their physical or mental handicap in all employment practices such as the following: employment, upgrading, demotion or transfer, recruitment, advertising, layoff or termination, rates of pay or other forms of compensation, and selection for training, including apprenticeship. (b) The contractor agrees to comply with the rules, regulations, and relevant orders of the Secretary of Labor issued pursuant to the Act. (c) In the event of the contractor's noncompliance with the requirements of this clause, actions for noncompliance may be taken in accordance with the rules, regulations and relevant orders of the Secretary of Labor issued pursuant to the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. A strange argument is made by the Office of Federal Contract Compliance Programs in other cases, and relied upon to some degree by the dissent, that a private cause of action should be implied because the executive branch lacks personnel to perform its duty and that, therefore, the Third Branch should supply the need.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The district courts which have considered this question are fairly evenly divided. Those finding no right of action, including both of the courts below, are: Anderson v. Erie Lackawanna Railway Co., 468 F. Supp. 934 (E.D.Ohio 1979); Wood v. Diamond State Telephone Co., 440 F. Supp. 1003 (D.Del.1977); Moon v. Roadway Express, Inc., 439 F. Supp. 1308 (N.D.Ga.1977); Rogers v. Frito-Lay, 433 F. Supp. 200 (N.D.Tex.1977). Favoring implication are Hart v. County of Alameda, No. C-79-0091 WHO (N.D.Cal.Sept. 10, 1979); Duran v. City of Tampa, 430 F. Supp. 75 (M.D.Fla.1977); Drennon v. Philadelphia General Hospital, 428 F. Supp. 809 (E.D.Pa.1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Department of Labor and the OFCCP have taken these positions in litigation in the District Court for the Southern District of New York, Phyllis Chapman v. Consolidated Edison Company of New York, Inc., (No. 79-Civ.-0730 (MEL)). The National Center for Law and the Handicapped, Inc., Amicus Curiae in this case, has submitted to this court copies of the brief submitted there on behalf of the United States and of the affidavit of Weldon J. Rougeau, Director of the OFCCP. Both these documents support the positions set out in the text. The affidavit of Mr. Rougeau is included as an Appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The full text of the relevant portions of Section 503, 29 U.S.C.A. § 793 (West 1975 and Supp.1979), is set out below: (a) Any contract in excess of $2,500 entered into by any Federal department or agency for the procurement of personal property and nonpersonal services (including construction) for the United States shall contain a provision requiring that, the party contracting with the United States shall take affirmative action to employ and advance in employment qualified handicapped individuals as defined in section 706(7) of this title. The provisions of this section shall apply to any subcontract in excess of $2,500 entered into by a prime contractor in carrying out any contract for the procurement of personal property and nonpersonal services (including construction) for the United States. The President shall implement the provisions of this section by promulgating regulations within ninety days after September 26, 1973. (b) If any handicapped individual believes any contractor has failed or refuses to comply with the provisions of his contract with the United States, relating to employment of handicapped individuals, such individual may file a complaint with the Department of Labor. The Department shall promptly investigate such complaint and shall take such action thereon as the facts and circumstances warrant, consistent with the terms of such contract and the laws and regulations applicable thereto. Section 503(c), not involved in this case, allows the President to waive the application of § 503 when \"special circumstances in the national interest so require.\" A \"handicapped individual\" for purposes of this section is defined in 29 U.S.C.A. § 706(7)(B) (West Supp.1979) as \"any person who (i) has a physical or mental impairment which substantially limits one or more of such person's major life activities, (ii) has a record of such impairment, or (iii) is regarded as having such an impairment.\" See also 41 C.F.R. § 60-741.2 and Appendix A (1978) (Regulations and Guidelines of Office of Federal Contract Compliance Programs).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The administrative enforcement scheme is discussed in more detail in Part I.C. Infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Because appellant Moon's action was dismissed for failure to state a claim, the facts were not fully developed below. However, for purposes of this exposition, the allegations of the complaint have been taken as true and additional facts have been gleaned from appellant's brief and from letters to appellant from the OFCCP regarding the handling of his administrative complaint. Mildred Rogers, the appellant in No. 77-2443, also premised her action on a claim of discriminatory firing. She brought her suit as a class action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The recognition that our task is statutory construction tells us, for instance, that we cannot recognize the doctrine of \"statutory torts.\" See Touche Ross \u0026 Co. v. Redington, supra, 99 S. Ct. at 2485. See generally Note, Implied Rights of Action to Enforce Civil Rights: The Case for a Sympathetic View, 87 Yale L.J. 1378, 1383 (1978). This recognition tells us further that, in the absence of some indication that Congress intended an implied remedy, the mere fact that such a remedy might be useful in enforcing the statutory goals will be of little significance. See TAMA, supra, 100 S. Ct. at 249; Touche Ross \u0026 Co. v. Redington, supra, 99 S. Ct. at 2489.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In determining whether a private remedy is implicit in a statute not expressly providing one, several factors are relevant. First, is the plaintiff \"one of the class for whose Especial benefit the statute was enacted,\" Texas \u0026 Pacific R. Co. v. Rigsby, 241 U.S. 33, 36 S. Ct. 482, 484, 60 L. Ed. 874 (1916) (emphasis supplied) that is, does the statute create a federal right in favor of the plaintiff? Second, is there any indication of legislative intent, explicit or implicit, either to create such a remedy or to deny one? See, e. g., National Railroad Passenger Corp. v. National Assn. of Railroad Passengers, 414 U.S. 453, 458, 460, 94 S. Ct. 690, 693, 694, 38 L. Ed. 2d 646 (1974) (Amtrak). Third, is it consistent with the underlying purposes of the legislative scheme to imply such a remedy for the plaintiff? See, e. g., Amtrak, supra; Securities Investor Protection Corp. v. Barbour, 421 U.S. 412, 423, 95 S. Ct. 1733, 1740, 44 L. Ed. 2d 263 (1975); Calhoon v. Harvey, 379 U.S. 134, 85 S. Ct. 292, 13 L. Ed. 2d 190 (1964). And finally, is the cause of action one traditionally relegated to state law, in an area basically the concern of the States, so that it would be inappropriate to infer a cause of action based solely on federal law? See Wheeldin v. Wheeler, 373 U.S. 647, 652, 83 S. Ct. 1441, 1445, 10 L. Ed. 2d 605 (1963); Cf. J. I. Case Co. v. Borak, 377 U.S. 426, 434, 84 S. Ct. 1555, 1560, 12 L. Ed. 2d 423 (1964); Bivens v. Six Unknown Federal Narcotics Agents, 403 U.S. 388, 394-395, 91 S. Ct. 1999, 2003-2004, 29 L. Ed. 2d 619 (1971) Id., at 400, 91 S. Ct. 1999, 2003-2004, 29 L. Ed. 2d 619 (1971) Id., at 400, 91 S. Ct. at 2006 (Harlan, J. concurring in judgment). Cort v. Ash, supra, 95 S. Ct. at 2088.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Section 901(a) of Title IX provides in pertinent part: No person in the United States shall, on the basis of sex, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving Federal financial assistance. In Cannon, the Court analyzed this provision and its legislative history under the framework set forth in Cort v. Ash, supra. It found that all four factors supported implication of a private cause of action. Cannon, supra, 99 S. Ct. at 1964. Particularly compelling was the fact that Congress explicitly patterned this provision on Title VI of the Civil Rights Act of 1964, 42 U.S.C.A. § 2000d (Title VI), which Congress understood in 1972 as having created a private right of action. See id. at 1958-1960. Title VI provides in pertinent part: No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance. In one of the first court of appeals decisions after Cannon, the third circuit followed it and Cort v. Ash, supra, to find private rights of action under both Title VI and § 503's sister provision, § 504 of the Rehabilitation Act, 29 U.S.C.A. § 794 (West Supp.1979). See NAACP v. Medical Center, Inc., 599 F.2d 1247 (3d Cir. 1979). In its Title VI holding, NAACP was in accord with its numerous predecessors, discussed in Cannon, supra, 99 S. Ct. at 1957-58 \u0026 n.21. Its § 504 holding, the court believed, was compelled by its Title VI holding: \"Section 504 is virtually identical to Title VI and was consciously intended by Congress to track that statute.\" NAACP, supra, 599 F.2d at 1258. That conclusion was not without its antecedents. See, e. g., Doe v. Colautti, 592 F.2d 704 (3d Cir. 1979), amended (Feb. 23, 1979); Davis v. Southeastern Community College, 574 F.2d 1158 (4th Cir. 1978), Rev'd on other grounds, 442 U.S. 397, 99 S. Ct. 2361, 60 L. Ed. 2d 980 (1979); United Handicapped Federation v. Andre, 558 F.2d 413 (8th Cir. 1977); Gurmankin v. Costanzo, 556 F.2d 184 (3d Cir. 1977); Kampmeier v. Nyquist, 553 F.2d 296 (2nd Cir. 1977); Lloyd v. Regional Transportation Authority, 548 F.2d 1277 (7th Cir. 1977). But see Trageser v. Libbie Rehabilitation Center, Inc., 590 F.2d 87 (4th Cir. 1978), Cert. denied, 442 U.S. 947, 99 S. Ct. 2895, 61 L. Ed. 2d 318 (1979) (no private right of action to challenge employment discrimination under § 504). In reversing Davis, supra, the Supreme Court pretermitted the implied right of action issue. See 99 S. Ct. at 2366 n.5. Section 504 states, in relevant part: No otherwise qualified handicapped individual in the United States, as defined in section 706(7) of this title, shall, solely by reason of his handicap, be excluded from the participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance or under any program or activity conducted by any Executive agency or by the United States Postal Service. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Compare 29 U.S.C.A. § 793 (West 1975 and Supp.1979) With 20 U.S.C.A. § 1681(a) (West 1978). The significance of this difference is discussed in Part A Infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Part B Infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Part C Infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. It is important to note the special place civil rights statutes have held in the implication doctrine. In Santa Clara Pueblo v. Martinez, 436 U.S. 49, 98 S. Ct. 1670, 1678, 56 L. Ed. 2d 106 (1978), the Supreme Court stated, \"(w)e have frequently recognized the propriety of inferring a federal cause of action for the enforcement of civil rights, even when Congress has spoken in purely declaratory terms. See, e. g., Jones v. Alfred H. Mayer Co., 392 U.S. 409, 414 n.13, 88 S. Ct. 2186 n.13, 20 L. Ed. 2d 1189 (1968); Sullivan v. Little Hunting Park, Inc., 396 U.S. 229, 238-40, 90 S. Ct. 400, 405-6, 24 L. Ed. 2d 386 (1969).\" See also Cannon, supra, 99 S. Ct. at 1955 n.13. Commentators have also taken note of this special treatment. See Note, Implied Rights of Action to Enforce Civil Rights: The Case for a Sympathetic View, 87 Yale L.J. 1378 (1978); Karst, Federal Remedies, 54 U.Det.J.Urb.L. 1025 (1977); Sheldon \u0026 Berndt, Sex Discrimination in Vocational Education: Title IX and Other Remedies, 62 Calif.L.Rev. 1121 (1974). While this background does not alter my application of the Cort criteria, I believe that it requires a court to undertake its inquiry regarding the implication of a private cause of action under this civil rights statute with an especially sympathetic eye.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See, e. g., Hart v. County of Alameda, supra, at 3 - 4; Anderson v. Erie Lackawanna R. Co., supra, 468 F. Supp. at 936; Wood v. Diamond State Tel. Co., supra, 440 F. Supp. at 1008; Moon v. Roadway Express, Inc., supra, 439 F. Supp. at 1309; Rogers v. Frito-Lay, supra, 433 F. Supp. at 202.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The section of the statute to which the Court referred states: \"any employee of any such common carrier who may be injured by any locomotive, car or train in use contrary to the provision of this act shall not be deemed thereby to have assumed the risk . . . .\" 27 Stat. 532.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. It is of no significance to the issue at hand that § 503 fails to mention explicitly the nondiscrimination component implicit in its affirmative action requirement. Common sense tells us that \"affirmative action\" is a more comprehensive concept, which of necessity incorporates a duty of nondiscrimination. As was stated in Southern Illinois Builders Ass'n v. Ogilvie, 471 F.2d 680, 684 (7th Cir. 1972), \"The obligation to take affirmative action imparts more than the negative obligation not to discriminate.\" See also Mele v. Dept. of Justice, 395 F. Supp. 592, 594-95 (D.N.J.1975), Aff'd sub nom. Mele v. E.E.O.C., 532 F.2d 747 (3d Cir. 1976). Further, the OFCCP regulations require that the \"affirmative action\" clause in the contract state, \"The contractor will not discriminate against any employee or applicant for employment because of physical or mental handicap in regard to any position for which the employee or applicant for employment is qualified.\" 41 C.F.R. § 60-741.4 (1978). See id. at § 60-741.5(c)(4) (adoption of affirmative action program does not \"relieve a contractor from liability for discrimination under the Act.\") Finally, the legislative history furnishes abundant evidence that Congress intended § 503 to be an antidiscrimination provision. In the report accompanying the bill which became the Rehabilitation Act, for example, the Senate Committee on Labor and Public Welfare characterized § 503(b) as an antidiscrimination measure: \"The bill further provides that a handicapped individual who has a discrimination complaint against a Federal contractor may file a complaint with the Department of Labor.\" S.Rep.No.93-318, 93d Cong., 2d Sess., Reprinted in (1973) U.S.Code Cong. \u0026 Admin.News, pp. 2076, 2123. The reports accompanying the earlier versions of the Act, See note 19 Infra, contained virtually identical language. See S.Rep.No.92-1135, 92d Cong., 2d Sess. 49 (1972); S.Rep.No.93-48, 93rd Cong., 1st Sess. 53 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Cannon identified statutes like Title IX (\"No person shall be excluded . . . .\" 20 U.S.C.A. § 1681 (West 1978)) and § 5 of the Voting Rights Act (\"No person shall be denied . . . .\" 42 U.S.C.A. § 1973c (West Supp.1979)) as containing the type of language most conducive to judicial inference of a private action. See 99 S. Ct. at 1954 n.13. Interestingly, however, it included in its list of prototypical statutes that involved in Texas \u0026 Pac. R. Co. v. Rigsby, supra. As note 14 Supra shows, this statute was not explicitly declarative of a federal right, but merely stated that railroad employees injured by the company's violation of the statute were not to be deemed to have assumed the risk of such injuries.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. I do not believe that it is an insuperable obstacle to the inference of a private right of action under § 503 that the affirmative action obligation is to be assumed contractually. In McDaniel v. University of Chicago, 548 F.2d 689 (7th Cir. 1977), where the court concluded that the plaintiff class of laborers and mechanics were the special beneficiaries of the Davis-Bacon Act, 40 U.S.C. § 276a Et seq., the court reasoned as follows: The Davis-Bacon Act by its terms mandates that the contract between the federal government and the contractor provide that laborers and mechanics hired by the contractor be paid the minimum wages determined by the Secretary of Labor to be prevailing for the corresponding class of laborers in the locality. The laborer is not only the principal beneficiary of the statute, but also the third-party beneficiary of a contract provided for by the statute. 548 F.2d at 693. Furthermore, in Lau v. Nichols, 414 U.S. 563, 94 S. Ct. 786, 789, 39 L. Ed. 2d 1 (1974), the Court, in granting relief to plaintiffs under Title VI, relied in part upon the fact that some of the affirmative duties to which plaintiffs sought to hold defendants were assumed in a funding contract between defendants and HEW. Moreover, Justice Stewart in his concurrence noted somewhat cryptically that \"respondents do not contest the standing of petitioners to sue as beneficiaries of the federal funding contract.\" Id. at 790 n.2. Lau is often cited for the proposition that a private cause of action exists under Title VI. See, e. g., NAACP v. Medical Center, supra, 599 F.2d at 1256. Cf. Lloyd v. Regional Transportation Authority, supra, 548 F.2d at 1287 n.31. (Finding private right of action under § 504 of the Act, noting the aspect of Lau discussed above and suggesting that on remand plaintiffs might in discovery seek to ascertain whether such agreements existed there between defendants and federal agencies). And this circuit in Bossier Parish School Board v. Lemon, 370 F.2d 847, 850-51 (5th Cir. 1967), Cert. denied, 388 U.S. 911, 87 S. Ct. 2116, 18 L. Ed. 2d 1350 (1967), afforded some not easily definable significance to \"contractual assurances\" between the federal government and the defendant school board for the benefit of members of plaintiff's class in allowing plaintiffs to bring a private desegregation action under Title VI and the 14th Amendment. Finally, in finding that § 215 of the Investment Advisors Act of 1940, 15 U.S.C. § 806-15, contained an implied remedy of recission of contracts declared \"void\" by that section, the Supreme Court held that the suit for recission could be brought in federal court despite the fact that such suits for recission of a contract would traditionally be relegated to the state courts. See TAMA, supra, 100 S. Ct. at 246-47 \u0026 n.8. Thus, while the right of action argued for here arises from § 503 itself, plaintiffs might be held to have a right to sue in federal court as third-party beneficiaries of the contract mandated by § 503(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The express provision of an individual complaint mechanism in § 503(b) differentiates § 503 from the type of provision set out in Cannon, supra, 99 S. Ct. 1955-56 n.14, which the Court characterized as a \"simple directive\" and to which the majority in this case has suggested § 503 is analogous. The provision discussed in Cannon provided: The Secretary shall not make any grant, loan guarantee, or interest subsidy payment, nor shall the Secretary enter into any contract with any institution of higher education, or any other post-secondary institution, center, training center, or agencies representing such institutions unless the application, contract, or other arrangement for the grant, loan guarantee, interest subsidy payment, or other financial assistance contains assurances satisfactory to the Secretary that any such institution, center, or agency will not discriminate on the basis of sex in the admission of individuals to any program to which the application, contract, or other arrangement is applicable. 117 Cong.Rec. 30411 (1971). When § 503 is read in its totality, it is more than a \"directive\" and confers a benefit directly on appellants' class.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Before it finally became law, the Rehabilitation Act of 1973 had two predecessors succumb to presidential vetoes. The vetoes were directed, as was most of the discussion during the legislation's perambulations around the halls of Congress, at its spending portions. Nevertheless, I have followed § 503 from its origin in the first Senate bill. A summary of the history of this Act is contained in S.Rep.No.93-318, Supra, at 2078-2090. The Rehabilitation Act Amendments of 1974 proved slightly less peripatetic than their sire; they were only vetoed once. Their history is summarized in S.Rep.No.93-1297, 93d Cong.2d Sess., Reprinted in (1974) U.S.Code Cong. \u0026 Admin.News, pp. 6373, 6376-6381. Their amendment of the definition of \"handicapped individuals\" applicable to § 503 is relevant to the question at hand. The Rehabilitation, Comprehensive Services and Developmental Disabilities Amendments of 1978 required only one passage to become law. Its provision of attorneys' fees for § 503 is considered below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In the reconsideration of the legislation after the vetoes, discussion became even more truncated. See 119 Cong.Rec. 5885 (1973) (Sen. Randolph).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Senator Humphrey concluded, \"The time has come to firmly establish the right of these Americans to dignity and self-respect as equal and contributing members of society, and to end the virtual isolation of millions of children and adults from society.\" Senator Humphrey made the same statement during the Senate's second passage of the legislation. See 119 Cong.Rec. 635 (1973). See also 119 Cong.Rec. 6145 (1973) (Sen. Humphrey).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See, e. g., 119 Cong.Rec. 7114 (1973) (Rep. Vanik).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. For example, Representative Quie stated during consideration of the original bill, \"(T)here are so many new and far-reaching aspects of this bill that I think it will take years before the true impact of all that we have done here is felt around the country.\" 119 Cong.Rec. 36313-14 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Quoted in note 3 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Congress feared that the original definition, which referred to the individual's ability to benefit from vocational rehabilitation programs, would be too restrictive if applied to § 503. See S.Conf.Rep.No.93-1270, 93d Cong., 2d Sess. 25 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In the debates on the attorney's fees provision of the 1978 Amendments, Senator Cranston quoted in this precise manner from S.Rep.No.93-1297, Supra, at 6390-91, which accompanied the bill on its second passage. See 124 Cong.Rec. S15593 (daily ed. Sept. 20, 1978). Obviously, this report contained virtually the same language as the conference report. The full text of this passage from the conference report states: Section 504 was patterned after, and is almost identical to, the antidiscrimination language of section 601 of the Civil Rights Act of 1964, U.S.C. 2000d-1 (relating to race, color, or national origin), and section 901 of the Education Amendments of 1972, 42(20) U.S.C. 1683 (relating to sex). The section therefore constitutes the establishment of a broad government policy that programs receiving Federal financial assistance shall be operated without discrimination on the basis of handicap. It does not specifically require the issuance of regulations or expressly provide for enforcement procedures, but it is clearly mandatory in form, and such regulations and enforcement are intended. The language of section 504, in following the above-cited Acts, further envisions the implementation of a compliance program which is similar to those Acts, including promulgation of regulations providing for investigation and review of recipients of Federal financial assistance, attempts to bring non-complying recipients into voluntary compliance through informal efforts such as negotiation, and the imposition of sanctions against recipients who continue to discriminate against otherwise qualified handicapped persons on the basis of handicap. Such sanctions would include, where appropriate, the termination of Federal financial assistance to the recipient or other means otherwise authorized by law. Implementation of section 504 would also include pre-grant analysis of recipient to ensure that Federal funds are not initially provided to those who discriminate against handicapped individuals. Such analysis would include pre-grant review procedures and a requirement for assurances of compliance with section 504. This approach to implementation of section 504, which closely follows the models of the above-cited anti-discrimination provisions, would ensure administrative due process (right to hearing, right to review), provide for administrative consistency within the Federal government as well as relative ease of implementation, and permit a judicial remedy through a private action. S.Conf.Rep.No.93-1270, Supra, at 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See, e. g., Lloyd v. Regional Transportation Authority, supra, 548 F.2d at 1285-86; NAACP v. Medical Center, Inc., supra, 599 F.2d at 1258. The court in Lloyd examined the passage In toto and read it as contemplating \"judicial review of an administrative proceeding as contradistinct from an independent cause of action in federal court.\" It allowed the action to proceed, however, since HEW had not yet issued regulations. Despite its professed agreement with Lloyd's general Cort analysis, the court in NAACP apparently interpreted the language as contemplating an independent cause of action in federal court since it let the action proceed despite the presence of HEW's regulations. Especially in light of Senator Cranston's later reading of this passage, see note 26 Supra, and text accompanying, I am inclined to agree with the position taken in NAACP. Cases on the existence of a private right of action under § 504 are collected in note 8 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In Hart v. County of Alameda, No. C-79-0091 WHO (N.D.Cal.Sept. 10, 1979), the court relied in part upon this statement in finding an implied remedy under § 503. Id. at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The provision was explicitly modelled on the Civil Rights Attorney's Fee Awards Act of 1976, 42 U.S.C.A. § 1988 (West Supp.1979). See 124 Cong.Rec. S15590-1 (daily ed. Sept. 20, 1978) (Sen. Cranston). In Cannon, the Supreme Court examined the meaning of the parallel language in the 1976 Act and reached the same conclusions that I have set forth in the text regarding its meaning. See 99 S. Ct. at 1951-52 n.6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The House Committee on Education and Labor commented as follows: Section 119 of H.R.12467 as amended would add a new section 505 to the act. The new section permits courts, at their discretion, to award to the prevailing party, other than the United States, in any action or proceeding to enforce sections 501, 503 or 504 of the act, a reasonable allowance to cover the costs of attorneys' fees. Section 501 relates to affirmative action in Federal employment of the handicapped, section 503 relates to affirmative action in employment of the handicapped by certain Federal contractors, and section 504 relates to nondiscrimination against the handicapped by recipients of Federal financial assistance. The proposed amendment is not in any way unique. At present there are at least 90 separate attorneys' fees provisions to promote enforcement of over 90 different Federal laws. In fact, disabled individuals are one of the very few minority groups in this country who have not been authorized by the Congress to seek attorneys' fees. The amendment proposes to correct this omission and thereby assist handicapped individuals in securing the legal protection guaranteed them under title V of the act. H.R.Rep.No.95-1149, 95th Cong., 2d Sess. (1978), Reprinted in (1978) U.S.Code Cong. \u0026 Admin.News p. 7332.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. One other point regarding the legislative commentary on § 503 should be mentioned. In 1979, the Senate Committee on Labor and Human Resources, the successor to the Committee on Labor and Public Welfare, reported a bill which would amend Title VII of the Civil Rights Act of 1964, 42 U.S.C.A. § 2000e Et seq. (West 1974), to add the handicapped to the groups within its protections. In its report appears the following statement: The Committee stresses that the amendments made to the Civil Rights Act of 1964 by this bill do not in any way affect the rights, remedies, and procedures already accorded to handicapped individuals by title V of the Rehabilitation Act of 1973, as amended. Nor are the responsibilities of covered entities, Federal departments, agencies, and instrumentalities imposed by title V altered in any way by this legislation. The Committee wishes to make clear and definite the specific protections against discrimination in employment provided under title V of the Rehabilitation Act and the right of handicapped individuals to enforce those protections in a court of law. Congress enacted title V of the Rehabilitation Act in 1973 to eliminate discrimination, on the basis of handicap, in Federal employment and federally funded activities. In amending title V in 1978, this Committee stated that it was adding section 505 \"to enhance the ability of handicapped individuals to assure compliance with the civil rights provisions of title V * * *. (S.Rept.No. 95-890, 95th Cong., 2d Sess., p. 18 (1978) . . .'. This Committee stated in 1978 its belief that the rights extended to handicapped individuals under title V * * * are, and will remain, in need of constant vigilance, by handicapped individuals to assure compliance, and the availability of attorney's fees should assist in vindicating private rights of action in the case of section 502 and 503 cases, as well as those arising under section 501 and 504. (S.Rept.No. 95-890, 95th Cong., 2d Sess., p. 19 (1978)) . . . . It is, and has always been the Committee's intent that any handicapped individual aggrieved by a violation of title V has the right under existing law to proceed privately in federal court to enforce the rights and remedies afforded under title V of the Rehabilitation Act of 1973, as amended, and to receive back pay and attorney's fees if successful. S.Rep.No. 96-316, 96th Cong., 1st Sess., pp. 12-13 (1979). This report clearly supports the interpretation of congressional intent set forth in this section. It also indicates that the Committee's understanding of the meaning of § 503 is so well-established that it must take it into account in its attempt to amend Title VII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The majority notes that \" \"The Committee' in 1978 or 1979 is not the committee that recommended the legislation enacted in 1974.\" Maj. Op. at 1082. It is interesting to observe, however, that 11 of the 16 members of the relevant Senate Committee in 1978 were on the committee in 1973 when the Act was passed. Compare (1978) U.S.Code Cong. and Admin.News XCIX With (1973) U.S.Code Cong. and Admin.News LXXXIV. Further, 15 of the 37 members of the relevant House committee in 1978 were also on the Committee in 1973. Compare (1978) U.S.Code Cong. and Admin.News CXVII With (1973) U.S.Code Cong. and Admin.News XCVIII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See also note 31 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. I would also reject explicitly three other arguments raised by appellees to attempt to refute this evidence of the intent of Congress to furnish an implied remedy under § 503. Appellees first argue that we are to read from the lack of success of the numerous attempts to amend Title VII of the Civil Rights Act of 1964, 42 U.S.C.A. § 2000e Et seq. (West 1974), to protect the handicapped a congressional intent to deny a private right of action to beneficiaries of § 503's requirements. Faced with a similar argument that provision of certain express remedies under one section of a statute was evidence of congressional intent to deny a private remedy under another section which made no such express provision, the Supreme Court in Cort found \"this excursion into the extrapolation of legislative intent entirely unilluminating,\" since nothing in the legislative history indicated that Congress had in fact harbored such intentions. See Cort, supra, 95 S. Ct. at 2090 n. 14. Here, I find appellees' extrapolatory excursion entirely unilluminating. First, to credit appellees' argument one would be required to weigh more heavily than Congress' direct statements on its purpose in § 503, as discussed above, appellees' mere speculations about congressional intentions in refusing to amend Title VII. I would decline to read so much into the inaction and silence of the Congress. Second, § 503 and Title VII have vastly different coverages, the former reaching only federal contractors and the latter covering most private employers. The attempts to amend Title VII may thus represent attempts only to establish broader protections against employment discrimination for handicapped individuals. Representative Dodd, for example, explained in the 1976 Congressional Oversight Hearings on the Rehabilitation Act his motivations for proposing one amendment like those to which appellees point: It is my belief that we as a nation have been grossly negligent in failing to eradicate the barriers of discrimination which the mentally and physically handicapped face both in the public and private sectors of our society. The Rehabilitation Act of 1973 stands on an affirmative step by the Congress to remove these discriminatory barriers at least from the Federal Government, the Federal Contractors and recipients of Federal financial assistance. However, We must go beyond the protections afforded the handicapped in the Rehabilitation Act and prohibit private discrimination in the areas of employment, architectural barriers, housing and transportation. To that end, last year I introduced legislation to prohibit discrimination against the mentally and physically disabled in the House in employment; and last fall I conducted extensive hearings on private employment discrimination to develop a background on the problems the handicapped face in this area. Oversight Hearings on Rehabilitation of the Handicapped Programs Before the Subcommittee on the Handicapped of the Committee on Labor and Public Welfare, 94th Cong., 2d Sess. Part I, 321-22 (1976) (emphasis added). See also S.Rep.No.96-316, 96th Cong., 1st Sess. 3 (1979). In sum, I do not believe that the failure of Congress to amend Title VII can support the inferences appellees attempt to draw from it. Appellees' second argument, given some weight by the majority, is based on the judicial treatment of Executive Order 11,246, 3 C.F.R. § 339 (1964-1965 Comp.), as amended by Executive Order 11,315, 3 C.F.R. § 684 (1966-1970 Comp.). That order requires in § 202 that all government contracts, subject to certain specified exemptions, contain a provision in which the contractor agrees that he \"will not discriminate against any employee or applicant for employment because of race, color, religion, sex, or national origin\" and that he \"will take affirmative action to assure that applicants are employed, and that employees are treated during employment, without regard to their race, color, religion, sex or national origin.\" In several cases in the courts of appeals, decided before the enactment of § 503, the courts concluded that no private right of action could be inferred from the Executive Order or its predecessors. See, e. g., Farkas v. Texas Instrument, Inc., 375 F.2d 629 (5th Cir. 1967), Cert. denied, 389 U.S. 977, 88 S. Ct. 480, 19 L. Ed. 2d 471; Farmer v. Philadelphia Electric Co., 329 F.2d 3 (3rd Cir. 1964). Appellees argue, in effect, that because of these decisions Congress must have known when it enacted § 503 that courts would not infer a private cause of action under it and thus must not have intended one. Although this argument has some initial appeal and receives perhaps some indirect support from Cannon, I find it ultimately unpersuasive when placed against Congress' own expressions of its purposes in § 503. First, such support as it receives from Cannon can only amount to a \"presumption\" which must evaporate in face of the legislative history of § 503. In Cannon, the Court noted that when Congress in 1972 explicitly modelled Title IX on Title VI numerous cases had held that Title VI created a private right of action. It stated further that \"because of their (the legislators') repeated references to Title VI and its modes of enforcement, we are especially justified in presuming both that those representatives were aware of the prior interpretation of Title VI and that that interpretation reflects their intent with respect to Title IX.\" Cannon, supra, 99 S. Ct. at 1958. Here, however, while one does find some mention of the Executive Order in the legislative history of § 503, there is no indication whatever that Congress intended to make its enforcement fully comparable to that which had existed under the Executive Order. There is, on the other hand, the evidence discussed above which supports the existence of a private right of action under § 503 and which stresses that administration of that section is to be comparable to that of Title VI. Therefore, we should not here indulge in any \"presumptions\" of legislative intent based on the history of Executive Order 11,246. Furthermore, both Farkas and Farmer relied upon the \"history of the orders, the rules and regulations made pursuant to them, and the actual practice in the enforcement of the nondiscrimination provisions.\" Farmer, supra, 329 F.2d at 9; Farkas, supra, 375 F.2d at 633. As the Supreme Court recently pointed out, the history of the Executive Order is quite murky; in fact, even the legislative authority for its issuance is a matter of debate. See Chrysler Corp. v. Brown, supra, 99 S. Ct. at 1719. Under these circumstances, it is difficult to see how Congress Could have intended a private remedy, and certainly the President could not himself create a new private judicial remedy. Regarding § 503, the history is quite different, and it is on that distinct history we should rely. This distinct history suffices also to distinguish this case from those cases in this circuit which appellees and the majority cite for the proposition that courts are reluctant to infer private causes of action under statutes regulating employee-employer relationships. See, e. g., Jeter v. St. Regis Paper Co., 507 F.2d 973 (5th Cir. 1975) (no private right of action under Occupational Health and Safety Act, 29 U.S.C. §§ 651-678); Martinez v. Behring's Bearings Service, Inc., 501 F.2d 104 (5th Cir. 1974) (no private right of action for wrongful death under Fair Labor Standards Act, 29 U.S.C. § 215(a)(3)); Flores v. George Braun Packing Co., 482 F.2d 279 (5th Cir. 1973) (no implied right against employer for deprivation of job based on illegal employment of foreign nationals under Immigration and Nationality Act, 8 U.S.C. §§ 1101(a)(15)(A)(ii), 1182(a)(14)); Breitwieser v. KMS Industries, Inc., 467 F.2d 1391 (5th Cir. 1972), Cert. denied, 410 U.S. 969, 93 S. Ct. 1445, 35 L. Ed. 2d 705 (1973) (no implied right of action to bring a wrongful death action under child labor provisions of Fair Labor Standards Act, 29 U.S.C. § 212); United States v. Lovknit Manufacturing Co., 189 F.2d 454 (5th Cir. 1951) (no implied right of action under Walsh-Healey Act, 41 U.S.C. §§ 35-45; dictum).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. It is no accident that the administrative schemes are similar. While one statute deals with contracts and the other with grants, both express federal policies of nondiscrimination for recipients of federal funds; both must use the leverage of the spending power to assure compliance with these policies. Further, as pointed out in the preceding section, Congress explicitly contemplated that the enforcement schemes would be similar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See note 2 Supra and Appendix P 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. There exist other reasons for concluding that an implied remedy will not interfere with administrative enforcement. First, officials of the Department of Labor have indicated on a number of occasions their preference for, and intent to shift toward, a compliance review procedure, and their intent to shift away from a solely complaint-oriented process, to achieve a more efficient allocation of their resources. See Office of Federal Contract Compliance Programs Task Force, Preliminary Report on the Revitalization of its Federal Contract Compliance Program 101-104 (1977); 2 Empl.Prac.Guide (CCH) P 5027 (Statement of Weldon Rougeau); 1978 Hearings, Supra, at 258-59, 264, 270, 271 (testimony of Donald Elisburg and Weldon Rougeau). Thus, one might infer that the existence of a private right of action will leave the OFCCP free to pursue more vigorously its preferred mode of enforcement. Second, one must expect that OFCCP's complaint process will still remain an important part of § 503's enforcement. For some individuals, an attempt to attain a voluntary remedy will certainly be more attractive than an adversary proceeding in federal court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. It is important to note that Title IX, like § 503, contemplates the use of voluntary compliance procedures. Compare 20 U.S.C.A. § 1682 (West 1978) and 45 C.F.R. § 86.71 (1978), Adopting by reference 45 C.F.R. § 80.8 (1978), With 41 C.F.R. § 60-741.28 (1978). In Cannon, the Supreme Court did not find that this direction to seek voluntary compliance with Title IX rendered a private right of action inconsistent with its underlying purposes of prohibiting discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. While Congress' attention was not often focused directly on § 503 during the consideration of the bills, Senator Dole stated at one point, \"The primary goal of this bill is to assist handicapped individuals in achieving their full potential for participation in our society,\" and singled out, in particular, the \"antidiscrimination provisions.\" 119 Cong.Rec. 24589 (1973). See 118 Cong.Rec. 32310 (1972) (Sen. Humphrey); 119 Cong.Rec. 635 (1973) (id.); 119 Cong.Rec. 24566 (1973) (Sen. Cranston); 119 Cong.Rec. 24587 (1973) (Sen. Taft); 119 Cong.Rec. 24587-8 (1973) (Sen. Williams). The 1974 amendment to the definition of \"handicapped individual\" applicable to § 503 also reflects Congress' desire to establish broad protections against discrimination for handicapped individuals. See note 25 and accompanying text Supra. Finally, in a letter to the OFCCP from members of the Senate's Subcommittee on the Handicapped of the Committee on Labor and Public Welfare, where the Act and the 1974 Amendments originated, one finds the clearest expression of congressional intent regarding § 503: The enactment of the Rehabilitation Act of 1973 (P.L. 93-112) was a major step in renewing our national commitment to providing for equal employment opportunity for handicapped individuals. Section 503 of that legislation was specifically designed to assure that the right to decent and fulfilling jobs for disabled individuals would be enforced with respect to all employers holding federal contracts of $2,500 or more. S.Rep.No.93-1297, 93rd Cong., 2d Sess., Reprinted in (1974) U.S.Code Cong. \u0026 Admin.News, pp. 6373, 6425. See also id. at, pp. 6426, 6427.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. 41 C.F.R. § 60-741.28 (1978) provides for four enforcement procedures after voluntary compliance measures fail: judicial enforcement, withholding progress payments, termination of the contract, and debarment. Compare id. with 45 C.F.R. § 86.71 (1978), Adopting by reference 45 C.F.R. § 80.8(a), (c), (d) (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. This \"simple logic\" also has support in experience. In 1978 hearings on the administration of § 503, Donald Elisburg, Assistant Secretary of Labor for Employment Standards, stated, \"Within this last year, we have taken administrative proceedings against the first five contractors that action has ever been brought against under this program.\" Hearings before the Subcommittee on Select Education of the Committee on Education and Labor of the House of Representatives, 95th Cong., 2d Sess. 265 (1978). (1978 Hearings) While he added that other such proceedings were contemplated, it must be noted that these actions are the result of \"around 4,500 complaints\" Id. at 255.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. During the 1978 Hearings on the Rehabilitation Act, Guy Guber, an employment rights specialist in the Job Development Program of the Center for Independent Living, cited as one of the \"major problems\" with the § 503 enforcement process the limited participation allowed to complainants. See 1978 Hearings, Supra, at 191.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Guy Guber, See note 42, Supra, pointed out in the 1978 Hearings, \"The alleged best interests of the complainant which are represented by OFCCP staff during informal negotiations with respondents do not always coincide with what a complainant perceives as his own best interest.\" 1978 Hearings, Supra, at 192.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. If the OFCCP decides not to pursue a complaint, the complainant may seek review of the decision with the Director. See 41 C.F.R. § 60-741.26(g)(1) (1978). If that route provides no remedy, it is not clear that a complainant has any rights to further administrative action. In discussing the analogous point in Cannon, the Court suggested that a complainant might sue \"under the Administrative Procedure Act to compel the agency to investigate and cut off funds. E. g. Adams v. Richardson, 156 U.S.App.D.C. 267, 480 F.2d 1159 (1973).\" But in Adams, where appellants sought to compel HEW to take action regarding certain school districts which were allegedly in violation of Title VI, HEW argued that the decision to investigate was encompassed within the doctrine of prosecutorial discretion and was thus unreviewable, as an action committed to agency discretion. In distinguishing the prosecutorial discretion cases, the court noted that the appellants did not \"challenge HEW's decision with regard to a few school districts in the course of a generally effective enforcement program,\" but alleged that HEW had consciously \"adopted a general policy which is in effect an abdication of its statutory duty.\" Adams, supra, 156 U.S.App.D.C. at 270, 480 F.2d at 1162. Thus, an individual complainant under § 503 might not be able to get review of a decision not to investigate. In any case, such an attempt to review OFCCP's decision would be \"far more disruptive\" of its enforcement mechanism than would a private suit against the contractor. See Cannon, supra, 99 S. Ct. at 1962-63 n. 41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As one commentator has observed, \"Thus it is clear that in civil rights cases, in contrast with most other types, the mere existence of an administrative enforcement mechanism does not bar implication of private rights of action.\" Note, Implied Rights of Action to Enforce Civil Rights: The Case for a Sympathetic View, 87 Yale L.J. 1378, 1391 (1978). Cannon, of course, is a case in point. Numerous other examples exist, however. Compare, e. g., Lau v. Nichols, 414 U.S. 563, 94 S. Ct. 786, 39 L. Ed. 2d 1 (1974); Allen v. State Board of Elections, 393 U.S. 544, 89 S. Ct. 817, 22 L. Ed. 2d 1 (1969); Tunstall v. Brotherhood of Locomotive Firemen and Enginemen, 323 U.S. 210, 65 S. Ct. 235, 89 L. Ed. 187 (1944); NAACP v. Medical Center, Inc., 599 F.2d 1247 (3d Cir. 1979) With, e. g., TAMA, supra; Touche Ross \u0026 Co. v. Redington, supra; Amtrak, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. These cases reveal an additional reason for my conclusion on this factor. While Texas, where Rogers arises, has a statute protecting handicapped individuals from employment discrimination in some situations, Tex.Rev.Civ.Stat. Art. 4419e § 3(f) (1975), Georgia, where Moon arises, has no such statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Denotes established cases carried over from the previous fiscal year.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Denotes cases where Section 503 coverage was established.\u003c/span\u003e\n\n",
    "body_length": 147032,
    "citedas": [
      "611 F.2d 1074"
    ],
    "attorneys": "James C. Barber, Dallas, Tex., for plaintiff-appellant in No. 77-2443. William A. Wright, Susan A. Cahoon, Duane C. Aldrich, Atlanta, Ga., for defendant-appellee in No. 77-2443. Beverly B. Bates, Atlanta, Ga., for plaintiff-appellant in No. 77-3263. Brian J. Linn, Staff Atty., Nat. Center for Law and the Handicapped, Inc., for Nat'l Center for Law and the Handicapped, Inc., Kent Hull, Director, South Bend, Ind., amicus curiae in No. 77-3263. Charles Kelso, Ann Margaret Pointer, Atlanta, Ga., for defendant-appellee in No. 77-3263.",
    "category": [
      "124",
      "251"
    ],
    "judges": "Before Goldberg, Fay and Rubin, Circuit Judges.",
    "citation_count": 120
  }
}
