{
  "id": "0c_5YWYBTlTomsSBxESD",
  "document": {
    "title": "Belden v. State",
    "full_title": "GARY LEE BELDEN (DEFENDANT), v. THE STATE OF WYOMING (PLAINTIFF).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "2003-07-31T00:00:00.000Z",
    "docket": "No. 01-57",
    "body": "HILL, C.J., delivered the opinion of the Court; GOLDEN, J., filed a dissenting opinion in which VOIGT, J., joins; VOIGT, J., also filed a dissenting opinion.\n\n¶1 Gary Lee Belden (Belden) appeals convictions for first-degree sexual assault in violation of Wyo. Stat. Ann. § 6-2-302(a)(i) and first-degree murder in violation of Wyo. Stat. Ann. § 6-2-101(a). Belden asserts multiple errors in his trial including claims of judicial and prosecutorial misconduct, admission of prejudicial uncharged misconduct evidence, exclusion from an in camera hearing that was a critical stage of the trial proceedings, and a violation of the Wyoming Constitution through the appointment of an Assistant United States Attorney as a special prosecutor. We find no prejudicial error and affirm the convictions.\n\nISSUES\n\n¶2 Belden presents five issues for review:\n\nIssue I\n\nWhether the trial court committed judicial misconduct when he repeatedly interfered with the proceedings and usurped the roles of both trial counsel and the jury?\n\nIssue II\n\nWhether the trial court abused its discretion when it admitted evidence of two incidents of sexual assault allegedly committed by Belden?\n\nIssue III\n\nWhether the prosecutor committed prosecutorial misconduct when he solicited opinion testimony of Belden's guilt, argued propensity on prior bad acts, misstated the facts and shifted the burden of proof in closing argument and asked the jury to convict for reasons other than the evidence?\n\nIssue IV\n\nWhether Belden was deprived of his right to be present at a critical stage of the proceedings by not being present during a hearing concerning prosecutorial misconduct?\n\nIssue V\n\nWhether the district court violated the Wyoming Constitution by allowing an Assistant United States Attorney to function as special prosecutor?\n\nThe State's statement of the issues parallels Belden's but with slightly different language:\n\nI. Did the district court commit judicial misconduct by repeatedly and unnecessarily interfering with the proceedings, and usurp the role of trial counsel and the jury?\n\nII. Did the district court abuse its discretion when it admitted evidence of two prior charges of sexual assault against [Belden]?\n\nIII. Did the prosecutor commit prosecutorial misconduct when a witness gave unsolicited opinion testimony on [Belden's] guilt; or did the prosecutor in closing improperly argue propensity from [Belden's] prior acts of misconduct, misstate the facts, ask the jury to convict for reasons other than the evidence, or improperly shift the burden of proof to [Belden]?\n\nIV. Did [Belden] have a constitutional right to be present at the hearing in camera on the objection to the State's closing argument, and does the record show that [Belden's] absence was other than knowing and voluntary?\n\nV. Did the district court violate the Wyoming Constitution by allowing an Assistant United States Attorney to act as special prosecutor?\n\nFACTS\n\n¶3 In August of 1985, Belden was employed as a baker at the ARA facility at the Shute Creek Exxon Plant near Diamondville, Wyoming. On August 29, 1985, Belden, using the pseudonym Richard Price, was scheduled to begin his shift at 9:30 p.m. Instead of punching in for work, however, Belden quit his job without notice. Various co-workers described Belden's appearance as \"suspicious,\" \"impatient and nervous,\" \"real anxious,\" \"real jittery,\" and \"nasty, aggravated, upset.\" One co-worker noted Belden's nervousness as well as scratches on his chest, neck, and face. Belden proceeded to dispose of several personal items before leaving the facility in a co-worker's truck, which he did not have permission to use. Belden also left various items behind that he never attempted to recover, including a motorcycle and his final paycheck.\n\n¶4 Belden's co-worker in the bakery, Terrie Smith, returned to the mobile home she shared with her friend, Nancy Lane, after completing her shift early the next morning on August 30, 1985. Smith discovered the naked, battered body of Nancy Lane on the living room floor of the trailer. Lane had been brutally beaten and then strangled to death. Her body bore injuries indicating that she had been the victim of a sexual assault prior to death. Investigators were able to collect a semen sample along with scrapings from under Lane's fingernails and a hair found on her body.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\n¶5 Belden was not located until December of 1987 when he was arrested in Utah. Investigators went to Utah to question him. Belden claimed he had permission to use the truck that he had taken on the night of August 29, 1985. He also stated that he knew the victim through her roommate, who was also his co-worker at the bakery. Belden voluntarily provided the investigators with blood and hair samples. DNA analysis revealed that Belden was the source of the semen found in the victim's body. DNA tests of the fingernail scrapings were generally inconclusive but tended to exclude Belden as the source.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\n¶6 For reasons that remain unclear in the record, the investigation into the victim's death remained dormant until sometime in 1998. The re-opened investigation ultimately led to charges of sexual assault in violation of Wyo. Stat. Ann. § 6-2-302(a)(i)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and first-degree murder in violation of Wyo. Stat. Ann. § 6-2-101(a)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e against Belden. A jury trial was held from October 9, through October 17, 2000. Belden's defense was that he had consensual intercourse with the victim on the night of August 29 but that she was alive when he left her trailer. Belden suggested that either the victim's ex-boyfriend or her roommate's estranged husband might have been involved in her death. Nevertheless, the jury returned a guilty verdict on both charges. Additional facts will be set out in our discussion below, as necessary.\n\nDISCUSSION\n\nI. Judicial Misconduct\n\nA. Standard of Review\n\n¶7 We have never explicitly established a standard for the appellate review of claims alleging judicial misconduct during a jury trial. Belden urges us to utilize the standard enunciated by the Supreme Court of Kansas:\n\nAllegations of judicial misconduct during trial must be decided on the particular facts and circumstances surrounding such alleged misconduct; and in order to warrant or require the granting of a new trial it must affirmatively appear that the conduct was of such a nature that it prejudiced the substantial rights of the complaining party.\n\nState v. Hamilton, 731 P.2d 863, 869 (Kan. 1987). In addition to the standard set forth above and cited by Belden, the Kansas Supreme Court has further stated:\n\nA mere possibility of prejudice from a remark of the judge is not sufficient to overturn a verdict or judgment. If a proper and reasonable construction will render the remark unobjectionable, the remark is not prejudicial.\n\nState v. Kleypas, 40 P.3d 139, 220 (Kan. 2001) (quoting State v. Nguyen, 883 P.2d 937, 939 (Kan. 1992)).\n\nSec. 6-2-101. Murder in the first degree[.]\n\n(a) Whoever purposely and with premeditated malice, or in the perpetration of, or attempt to perpetrate, any sexual assault, arson, robbery, burglary, escape, resisting arrest or kidnapping, or by administering poison or causing the same to be done, kills any human being is guilty of murder in the first degree.\n\n¶8 The State, on the other hand, suggests that we have hinted in previous opinions that an abuse of discretion standard is appropriate:\n\nIt occasionally happens that some occurrence upon a trial will warrant and may require comment by the court upon the conduct of a witness by way of caution, admonition, or censure, and, when such comment is within due bounds, and appropriate to the character of the occurrence, it will not be subject to a valid exception.\n\nKendrick v. Healy, 192 P. 601, 612 (Wyo. 1920). See also Kennedy v. State, 422 P.2d 88, 93-94 (Wyo. 1967) (remark by trial court not in violation of the standard set forth in Kendrick \"nor an abuse of discretion\").\n\n¶9 In Jansen v. State, 892 P.2d 1131 (Wyo. 1995), we confronted a claim that the trial court prejudiced the defendant when it rebuked his counsel for improperly marking an exhibit during closing argument:\n\nThe trial court acts as a referee of the contest between the parties. It should be fair and impartial as between the parties and their attorneys and allow them considerable freedom in the presentation of their respective cases in their own way..... Although we have said that the court must assiduously avoid any appearance of partiality, we recognize also that the court must be firm, maintain control of the proceeding and assure that what occurs is within the rules of law and procedure to the end that the jury receives and considers only lawful evidence conducive to its arriving at a just result. * * * [A]lthough where circumstances reasonably necessitate, it is within the province of the trial court to admonish or rebuke counsel. * * * Maintaining a semblance of order in those trials is left largely to the trial court and is not a basis for reversal absent a clear showing of prejudice. McCabe v. R.A. Manning Construction Co., Inc. 674 P.2d 699, 708-09 (Wyo. 1983).\n\nThe test for the clear showing of prejudice does not relate to the number of rulings in favor of each counsel, but rather assurance \"that what occurs is within the rules of law and procedure to the end that the jury receives and considers only lawful evidence conducive to its arriving at a just result.\"\n\nJansen, 892 P.2d at 1142 (emphasis in original). In practical terms, there is no difference between the two standards proffered by Belden and the State. The trial court has a certain amount of discretion to control the proceedings before it. The court is constrained, however, by the requirement that all criminal defendants are entitled to a fair trial. If the actions of the trial court prejudice a defendant's right to a fair trial, then, obviously, an abuse of discretion is present. The concept of an abuse of discretion is subsumed within the specific standard set forth by the Kansas Supreme Court. Accordingly, for purposes of reviewing claims of judicial misconduct, we will apply that standard. In applying that standard, however, we think it is appropriate to do so within the context set forth by the Second Circuit Court of Appeals:\n\nReviewing Pisani's claim is difficult because, of course, we are unable to observe directly the interaction of personalities during trial; our review is necessarily limited to \"'the cold black and white of a printed record.'\" United States v. Grunberger, 431 F.2d 1062, 1067 (2d Cir. 1970)(quoting United States v. Ah Kee Eng, 241 F.2d 157, 161 (2d Cir. 1957)). For this reason, we have no handy tool with which to gauge automatically whether the trial judge's conduct has improperly tipped the balance of the trial against the defendant. United States v. Nazzaro, 472 F.2d 302, 304 (2d Cir. 1973). Our disposition of the claim must flow from careful deliberation after close scrutiny of the record. Our role, however, is not to determine whether the trial judge's conduct left something to be desired, or even whether some comments would have been better left unsaid. Rather, we must determine whether the judge's behavior was so prejudicial that it denied Pisani a fair, as opposed to a perfect, trial. United States v. Robinson, 635 F.2d 981, 984 (2d Cir. 1980), cert. denied, 451 U.S. 992, 101 S.Ct. 2333, 68 L.Ed.2d 852 (1981). If we conclude that the conduct of the trial had so impressed the jury with the trial judge's partiality to the prosecution that this became a factor in determining the defendant's guilt, then the convictions should be reversed. United States v. Guglielmini, 384 F.2d 602, 604 (2d Cir. 1967).\n\nUnited States v. Pisani, 773 F.2d 397, 402 (2nd Cir. 1985). In other words:\n\nThe test to determine if a judicial comment in the jury's presence constitutes reversible error is whether the remark was such that it was reasonably calculated to benefit the state or to prejudice the defendant's rights. For comments by the trial judge to constitute reversible error the defendant must show that the remarks were prejudicial and that he or she was harmed thereby.\n\n75 Am.Jur.2d Trial § 309 (1991 and 2001 Supp.). With these general standards in mind, we turn to Belden's complaints about the trial court's conduct.\n\nB. Discussion\n\n¶10 Belden's multiple claims of judicial misconduct are based upon comments by the district court judge during the course of the trial. We will quote extensively from the transcript during our discussion of those claims. This will necessarily increase the length of our discussion substantially; however, it is essential to our analysis and resolution of Belden's claims. Our quotations from the transcript will include the allegedly improper comments and, when necessary, additional portions of the proceedings in order to place the comments in context.\n\n¶11 In his initial claim, Belden asserts that the following exchange between the judge, the defendant, and defense counsel during the testimony of the victim's roommate interfered with his attorney-client relationship. The State had called the victim's roommate to the witness stand. Part of the defense theory of the case was that there were viable suspects beyond Belden who had a motive and opportunity to commit this crime. One of the suspects to whom the defense pointed was the estranged husband of the roommate. To establish his viability as a potential suspect, the defense sought to establish through the roommate's testimony that her estranged husband had been involved in a three-way sexual relationship with her and the victim, and that he had wanted to continue the relationship but the victim was reticent. The defense also sought to inquire into the roommate's husband's history of sexual assault and violence towards women. The prosecution objected to that line of questioning. In response, the court sent the jury out, and the following took place in camera\n\nTHE COURT: Please sit down. Answer the question, if you will. Do you remember the question?\n\nTHE WITNESS: Pardon? If my ex-husband had a-a desire for [the victim], as well?\n\nTHE COURT: Now, what do you mean by a desire for [the victim] as well?\n\n[DEFENSE COUNSEL #1]: A sexual desire for [the victim]?\n\nTHE COURT: What's the next question?\n\nQ: Is that correct, he had a sexual desire for [the victim]?\n\nA: He did.\n\nTHE COURT: What's the next question?\n\nQ: In fact, he tried to go to bed with [the victim] on many occasions and plotted with you for help?\n\nA: He had got us into bed at least one time that I remember.\n\nQ: And it upset him that she would not go to bed with him?\n\nA: More than likely.\n\nQ: In fact, as you said, at one time, he did get the two of you into bed together?\n\nA: Correct.\n\nQ: And when you had taken Terrie back-or Brandy [roommate's daughter], excuse me. Taken Brandy back to live with him, he wanted you to come back and live with him again, didn't he?\n\nA: He-I-as I remember, he did.\n\nQ: That's-oh, and then I did also, your Honor, want to ask questions about during their marriage, him beating and strangling her.\n\n[PROSECUTION]: What purpose?\n\nTHE COURT: Wait. The testimony about [roommate's exhusband] wanting to have a sexual relationship with [the victim] is being offered for the purposes of demonstrating that he might have had a motivation to sexually assault [the victim]. Now, that's what that's being offered for, is that correct?\n\n[DEFENSE COUNSEL #1]: Well, the -\n\nTHE COURT: Am I getting the picture?\n\n[DEFENSE COUNSEL #1]: Sexual assault and murder, yes. I'm mainly looking at the murder.\n\nTHE COURT: That's the next question I have. How does this show that he night have-Just explain it to me, [Defense counsel].\n\n[DEFENSE COUNSEL #1]: The underlying sex goes towards the murder, your Honor. [The roommate's ex-husband] had a motive to kill because-two reasons, one, he wanted [roommate] back; also, he wanted [the victim] and maybe she wouldn't have him.... And if he did sexually assaulted [ sic ] her, he certainly could have sexually assaulted her without any emission.\n\nTHE COURT: Oh, [Defense counsel].\n\n[DEFENSE COUNSEL #1]: This is a muddy case, your Honor. There's a very viable suspect and we need him out here.\n\nTHE COURT: Well, you are being vague with me. You are not being direct with me.\n\n[DEFENSE COUNSEL #1]: Okay.\n\nTHE COURT: And you've got to tell me what inferences and conclusions can be logically drawn from the testimony that you are asking to be admitted. Now, you know, there's no indication that [roommate's ex-husband], in spite of any desire to have sexual relations with [the victim], in fact, had sexual relations with [the victim]; and I don't know how having a desire to have sexual relations with [the victim] equates to a reason for killing her.\n\n[DEFENSE COUNSEL #1]: He had sex -\n\nTHE COURT: And you're going to have to show that to me because I'm just too dumb to understand it.\n\n[DEFENSE COUNSEL #1]: He has had sex with her, your Honor, in the past. He wanted sex with her again. He has had a prior sexual assault conviction in which he committed sexual assault, but there was no emission. He did not ejaculate. So the fact that there's not any physical evidence-or any biological evidence of him raping her, that doesn't preclude that he did. A hair of his was found near the body, on that-on that blanket. It puts him there, or conceivably there. And as you know, we've described-we're just trying to point to other people who had equal opportunity, motive and capability of committing such a crime. And I think it's relevant. I'm not trying to be vague. I think that's -\n\nTHE COURT: And I'm not trying to [be] disingenuous with you, [defense counsel]. But, you know, if it comes across to me as being totally nonsense and illogical and I can't understand it-\n\n[DEFENSE COUNSEL #1]: Well, I guess I see it as logical, your Honor. His wife had left him.\n\nTHE COURT: You're not listening to me.\n\n[DEFENSE COUNSEL #1]: Okay.\n\nTHE COURT: You know, the big problem lawyers have is they listen to themselves and they don't listen to anybody else. I'll hit you right straight between the eyes with it.\n\n[DEFENSE COUNSEL #1]: Okay.\n\nTHE COURT: If it has the effect on me that it has on me, what do you think is going to happen with the Jury? Now, what's the objection of the Defense-or of the Prosecution?\n\n[PROSECUTION]: Your Honor, first of all, he's not laid proper foundation for any of this. He just starts asking questions.\n\n[PROSECUTION]: Your Honor, it's a 404 (b) problem. He's trying to show [roommate's ex-husband], who is not even here, has a propensity for this kind of crime and, therefore, he's a suspect in this. It's not relevant to what we're doing here at all and it gets into the love triangle that we talked about yesterday, Judge. [the victim's] character -\n\nTHE COURT: You know, I don't know what you guys are talking about. You mystify me, too.\n\n[PROSECUTION]: Well, I can -\n\nTHE COURT: I see this as more damaging to the defense than it is helpful. And, you know, I want you two defense lawyers to hear that from me. You know why I want you to hear that from me? You know, I want you and your client to insist-particularly your client, to insist that this kind of testimony be received.\n\n[DEFENSE COUNSEL # 2]: I'm trying not to intercede in this, your Honor. If you want my comment, I will.\n\nTHE COURT: Now, I don't want to block the Defense, but I don't want in my record any allegations of ineffective assistance of Counsel [ sic ]. And I'll put it right out in the open.\n\n[DEFENSE COUNSEL # 2]: I appreciate -\n\nTHE COURT: And I don't-I'm not trying to intimidate you guys. I know I can't intimidate you, [defense counsel #2]. I know that I can't.\n\n[DEFENSE COUNSEL # 2]: Thank you, your Honor.\n\nTHE COURT: Because you're just not that kind of a guy. But I can make you think about things.\n\n[DEFENSE COUNSEL #2]: Your Honor, --\n\nTHE COURT: And that's all I'm trying to do.\n\n[DEFENSE COUNSEL #2]: Your Honor, if I may?\n\nTHE COURT: Yes.\n\n[DEFENSE COUNSEL #2]: The only thing he's getting into is to ask this Witness, which he's already-the questions that she's testified to. We will hook this all up with our witness at the end of the case. This is all foundational to our laying what we believe is our defense, which is that [roommate's husband] is a viable candidate for the person who committed this crime. She testified that [her husband]-we don't want to go into his record. We don't want to go into a lot about the threesome, just the simple questions that we asked and she answered and then we're going on with it.\n\nTHE COURT: You want to-you want to establish, number one, that [roommate's ex-husband] had a sexual interest in the decedent?\n\n[DEFENSE COUNSEL #2]: That's correct.\n\nTHE COURT: Number two, there was at least some sexual activity between [roommate's ex-husband] and the decedent?\n\n[DEFENSE COUNSEL #2]: Well, I don't know if we wanted to go there but we felt -\n\nTHE COURT: Well, she has already testified to some kind of sexual conduct. Three people in bed -\n\n[DEFENSE COUNSEL #2]: I think we have to go there.\n\nTHE COURT: Pardon?\n\n[DEFENSE COUNSEL #2]: I think we have to go there just to some extent because, as we said, we don't want to try to demean anybody here, but just those points that you've talked about. And then she's already testified that she couldn't contact him for quite some period of time. And that he had at least-you know, he had been very abusive towards her and tried to strangle her.\n\nTHE COURT: You want to show he has the propensity for violence?\n\n[DEFENSE COUNSEL #2]: Well, he does, yeah. But we're not getting into any convictions. We've done that with-with [the victim's ex-boyfriend], of course. I think-you know, if you don't want us to do it here-you know, she's given statements to this. We're going to have an investigator-our expert is going to say they had a Mr. [roommate's exhusband's name] and he'd done this. Their reports show that he had done this; their reports show that he'd done that; and he's a person that needed to be looked at very closely. And as [a sheriff's investigator] testified, they didn't even check it. She even told them at one time that she suspected her own husband of being the-the man who killed [the victim]. And I'm not-you know, she said that. I think that is very relevant to our case.\n\nTHE COURT: Mr. Belden, do you agree with your attorneys; and do you want them to do all of those things that they have just described to me?\n\n[DEFENSE COUNSEL #2]: You can answer the question.\n\n[BELDEN]: I'll go with the advice of my attorneys, sir.\n\nTHE COURT: Pardon?\n\n[BELDEN]: I'll go with the advice of my attorneys.\n\n(An off-the-record discussion was held between [the defense attorneys] and Mr. Belden.)\n\nTHE COURT: Now, Mr. Belden, tactical decisions have to be made in every case of how to proceed. And, you know, your attorneys do the best they can.\n\n[DEFENSE COUNSEL #2]: He's just said-he's told us what to do. We will stop.\n\nTHE COURT: You'll what?\n\n[DEFENSE COUNSEL #2]: He doesn't want us to go any further.\n\nTHE COURT: Now, Mr. Belden, I don't want to talk you out of something.\n\n[BELDEN]: You didn't, sir.\n\nTHE COURT: Okay.\n\n[BELDEN]: You had no -\n\nTHE COURT: I don't want to talk your lawyers out of something. I just want to make sure that you are-all of you are doing what you think is best.\n\n[DEFENSE COUNSEL #2]: We're not going to-we want to go into this, that there was a sexual interest. We are going to not inquire into whether or not he had any propensities of violence towards her.\n\nTHE COURT: See, I think that's a wise decision.\n\n[DEFENSE COUNSEL #2]: Thank you, your Honor.\n\nTHE COURT: See, I think that is a wise, wise decision. I don't think the Defense ought to be making suggestions about propensity in this case.\n\n[DEFENSE COUNSEL #2]: And we are not going into that area. But the rest of it, you know, the fact that they-that he had a sexual attraction and had sex and wanted to have sex, I think that is essential.\n\nTHE COURT: Now, Mr. Belden, I'm not on your side.\n\n[BELDEN]: I understand, sir.\n\nTHE COURT: But I'm not on their side, either.\n\n[BELDEN]: I understand that, also, sir.\n\nTHE COURT: I'm on the side of doing my damnedest to make sure that you get a fair trial. And I'm on the side of doing my damnedest to make sure that the people of the State of Wyoming get a fair trial.\n\n[BELDEN]: Understood.\n\nTHE COURT: That's my only interest, Mr. Belden; and I can only ask you to believe me. You may or may not believe me.\n\n[BELDEN]: I do, sir. I do believe you.\n\nTHE COURT: But that's my only interest. Now, Mr. Belden, I'll tell you why I think the decision that you and your Counsel have just made is a wise one. There is a 99% probability that I am going to allow information about your past conduct-contact with [a woman Belden allegedly sexually assaulted previously] and what's the -\n\n[PROSECUTION]: [another alleged sexual assault victim]\n\nTHE COURT: And [the second alleged victim] to be placed before the Jury. And I'm going to give the Jury a cautionary instruction about not considering that information with regard to the charge of sexual assault. And I'm giving that instruction to the Jury if I give that information about [the two victims] to the Jury because I don't want them thinking you have a propensity to get involved in rapes.\n\n[BELDEN]: Yes, sir.\n\nTHE COURT: And if you and your Counsel begin talking about propensity, the Jury is liable to say, \"Well, hell, let's talk about the Defendant's propensity.\" Do you follow me, Mr. Belden?\n\n[BELDEN]: Yes, sir, I do.\n\nTHE COURT: And do you understand me?\n\n[BELDEN]: Yes, sir.\n\nTHE COURT: That's why I say to you and your Counsel that I think your decision not to talk about the propensity of other people is a wise decision. And that's why I am incredulous that the-that the State wants to block propensity evidence.\n\n[PROSECUTION]: Well, your Honor, the only thing -\n\nTHE COURT: I don't need any comment from you, [prosecutor].\n\n[PROSECUTION]: I had a good one.\n\nTHE COURT: What was your comment?\n\n[PROSECUTION]: I'll withdraw it, Judge.\n\nTHE COURT: Okay.\n\n[DEFENSE COUNSEL #2]: I would ask you to take this into consideration with regard to whether you put in anything about the other charges with regard to the Defendant because, your Honor, whether we limit them to one charge or the other, it goes to everything.\n\nTHE COURT: I know, [defense counsel #2]. You're going to argue that every chance you get to me, but I haven't made the final ruling.\n\n[DEFENSE COUNSEL #2]: And that's the only reason that I'm still arguing. If you had ruled, your Honor, I would not raise the subject.\n\nTHE COURT: Let's not get into it now, is what I was trying to say to you.\n\n[DEFENSE COUNSEL #2]: Thank you. I just wanted to bring it up.\n\nTHE COURT: I know. I know what you are doing. You're a bulldog and you will just hammer and hammer and hammer every chance you get to prevail on your side of the argument. And you've just done that, but let's not get into it now.\n\n[DEFENSE COUNSEL #2]: Thank you.\n\nTHE COURT: All right. Now, Prosecution, there is already testimony of sexual interest. There's also testimony concerning some kind of sexual conduct between [roommate's husband] and the decedent. It's already been testified to by this Witness and I will allow that testimony to stand. And I guess that-that then puts you at this point into another line of questioning, [defense counsel #1]?\n\n[DEFENSE COUNSEL #1]: It does.\n\n[DEFENSE COUNSEL #2]: Did we get this before the Jury?\n\n[DEFENSE COUNSEL #1]: I think that was -\n\nTHE COURT: Mrs.-and I can't -\n\n[DEFENSE COUNSEL #2]: Nordell.\n\nTHE COURT: I was going to call you [husband's last name] and I can't do that. [The roommate] testified that she and [the victim] and [roommate's husband] had been in bed together.\n\n[DEFENSE COUNSEL #2]: Okay. I think that's enough.\n\n[DEFENSE COUNSEL #1]: Wasn't that out of the presence of the -\n\nTHE COURT: I didn't write it down specifically and that's not exactly how she said it. \"He got us in bed together,\" I think is the way she said it.\n\n[DEFENSE COUNSEL #1]: Wasn't that out of the presence of the Jury?\n\n[PROSECUTION]: No, she said it.\n\n[DEFENSE COUNSEL #1]: Did she say it? I'm a little lost.\n\nTHE COURT: Just wait. I didn't right [ sic ] down the page and the line, [court reporter], and I'll try to look it up. I don't know if you can help me. (Pause.) What I heard was while the Jury was gone. Here are the questions and answers while the jury was gone.... [Court reads back exchange at the beginning of this citation] And then away we went.\n\n[DEFENSE COUNSEL #1]: We would be happy, your Honor, if I could ask her if [her ex-husband] had a sexual desire for [the victim], the thing about trying to get them into bed together and did he want her back -\n\nTHE COURT: Okay. You may put your objection on the record. I intend to permit it. [Prosecutor], make your -\n\n[PROSECUTION]: Okay. Your Honor, --\n\nTHE COURT: -- objection if you want to put an objection on the record.\n\n[PROSECUTION]: We do.\n\nTHE COURT: Well, do it.\n\n[PROSECUTION]: Your Honor, we would object to that as far as relevance to this. I don't see where that is relevant to what we're here for today. The issue at question is 6-2-312, the same thing we talked about yesterday with [the victim's] character.\n\nTHE COURT: The objection will be overruled. The-The objection is overruled. Bring the jury back in.\n\nBelden contends that the district court judge inappropriately interposed himself into his attorney-client relationship by encouraging him not to pursue a particular tactical strategy: i.e., pursuing the line of questioning designed to establish the victim's roommate's husband as a viable suspect because of his desire for the victim within the context of his past history of physical and sexual violence towards women. Belden insists that the court's interference was not harmless because it infringed on his Sixth Amendment right to effective counsel and prevented the jury from hearing evidence relevant to the defense's theory of the case. The State, on the other hand, contends that the decision to refrain from pursuing that line of questioning was an independent decision made after Belden and his counsel had conferred and the district court did nothing but praise them after that decision had been taken.\n\n¶12 Both parties cite United States v. Goodwin, 770 F.2d 631 (7th Cir. 1985). In that case, the defendant's counsel informed the trial judge that his client did not intend to take the stand. 770 F.2d at 635-36. After a hesitant reply from the defendant that she did not intend to testify, the trial judge advised her of the pros and cons of her decision and then recessed the proceedings so that she could consult her family and counsel. 770 F.2d at 636. Thereafter, defense counsel informed the court that his client would take the stand because she had been left with the impression that the judge was advising her to do so. Id. The trial judge informed her that he was merely advising her of the options available to her and not trying to influence her decision. Id. The defendant elected to testify anyway. On appeal, the defendant claimed that the trial judge had essentially coerced her to take the stand. After reviewing the comments made by the trial judge, the Seventh Circuit expressed serious concerns about them:\n\nWe find this colloquy disturbing. While we appreciate the trial judge's extreme care and solicitude in attempting to ensure that Goodwin's initial decision not to testify was voluntary, we believe that the judge went too far in this case. A trial judge must take great care not to assume the functions of trial counsel. The trial judge in this case went beyond his limited function of ensuring that Goodwin's decision not to testify was voluntary when he expressed surprise at her decision, explained some of the pros and cons of her taking the stand, and strongly implied that her only chance for acquittal was to testify. Although his observations may have been correct, they were not appropriate. A trial judge's role in this situation is limited to making sure that the defendant understands his or her rights and ensuring that the defendant's final decision is made voluntarily, with no coercion or undue influence. It is primarily the responsibility of the defendant's counsel, not the trial judge, to advise the defendant on whether or not to testify and to explain the tactical advantages and disadvantages of doing so. If a judge deems it necessary to comment on what he or she views as an inadvisable decision in this critical area, then the court should discuss the matter with the defendant's counsel. Discussing the issue directly with the defendant may inappropriately involve the judge in the unique attorney-client relationship, raising possible Sixth Amendment concerns as well as, in this case, the more obvious Fifth Amendment problems.\n\nGoodwin, 770 F.2d at 637. Nevertheless, the appellate court rejected the defendant's claim because it was not convinced that the trial judge's comments had overborne her will or, even if they had, that it was prejudicial error. Id.\n\n¶13 While Goodwin involved judicial comments on the defendant's constitutional right to testify or not, and this case involves the tactical question of the defense's case theory, the general principals identified by the Seventh Circuit Court are equally applicable here. The district court's concern about the potential effects of the line of questioning being pursued by Belden's counsel and the possibility of a later claim of ineffective assistance of counsel is commendable. However, the court's actions in this case went too far. Like the court in Goodwin, even though the district court's observations on the perils of defense counsel's tactical choices in pursuing the question of the husband's history of sexual assault and physical violence towards women may have been correct, they were not appropriate.\n\nIf the court had a concern about counsel's approach and felt it necessary to comment on the issue, then it should have raised the matter directly with counsel. \"Discussing the issue directly with the defendant may inappropriately involve the judge in the unique attorneyclient relationship.\" 770 F.2d at 637.\n\n¶14 Despite our concerns over the court's comments, we are confident that there was no prejudice to Belden. The decision to abandon the line of questioning was made by Belden and his counsel after consultation. After that decision was made, the court stressed that it did not want to talk Belden or his counsel out of anything. Belden and his counsel stated that the judge had not done so. A careful reading of the colloquy reveals that prior to that point, the court made no comments indicating whether or not it believed the line of questioning was appropriate. The court's inquiry up to that point had been an attempt to determine exactly where the defense was going with its questioning of the witness. After learning the substance of the defense strategy, the court asked Belden if he agreed with it. Belden's counsel told him that he could answer that question. The court did not express an opinion on the appropriateness of the defense strategy until after defense counsel and Belden had clearly indicated that they did not intend to pursue that strategy. Accordingly, we find that the court's comments did not prejudice Belden or otherwise interfere with the attorney-client relationship. To the extent that the court's comments constituted error, it was harmless.\n\n¶15 As part of its case, the State sought to introduce evidence relating to two prior charges of sexual assault against Belden. In Belden's next claim, he contends that the trial court effectively became an adversary when it told the State under what theory it would allow the admission of that uncharged misconduct evidence. Belden points to the following soliloquy, which took place outside the presence of the jury (emphasis supplied by Belden):\n\nTHE COURT:... Now, I want to caution the Prosecution on this issue. I have real concern about the clerks in the Wyoming Supreme Court. You know, when I try to look at the State's case in the light that the State sees it, what I see is that two and two adds up to four. And I see that in several fashions. One is [ sic ] the pictures and the semen and the DNA. You know, the pictures and the testimony says \"Here's a body that's brutally beaten, that has been involved in sexual intercourse, and semen is leaking from the body,\" according to your opening statement, and two and two adds up to four.\n\nAnd the other kind of two and two thing is is [ sic ] that you're saying, \"You know, look, even if you assume, [defense counsel], that there was consensual sex in the past, when this man had consensual sex, he ended up being accused of rape and charged criminally and, therefore, two plus two equals four. He has a motive for silencing this person who he had consensual sex with, that he wasn't-didn't have a longstanding relationship with.\"\n\nNow, that is just, it seems to me, a common sense analysis of what you folks think happened in this case. But, you know, if we begin to set aside common sense and we begin to start to apply technical rules of law, the first technical rule of law that rejects common sense is the technical rule of law that says \"If you have a propensity to rape someone, it's nonadmissible [ sic ] in evidence.\" Now, right?\n\n[PROSECUTION]: Yes.\n\nTHE COURT: And, you know, if I extend that kind of technical analysis further, there's a problem in the State's case concerning uncharged misconduct. This man is not charged with premeditated murder. This man is charged with sexual assault felony murder. And it's one thing for motive to be introduced for purposes of showing a reason for premeditated murder and another thing to introduce motive in a sexual assault felony murder case. And it's an issue that the Defense has not raised.\n\nIt is an issue that the Defense has not raised. They have not yet said to me that the motive ought to be a motive for sexual assault, not a motive to premeditate and intentionally kill someone. And you folks want to push this business of the prior alleged misconduct of this guy too far. And you're not only-you're going to push those clerks and those members of the Supreme Court over the edge and they are not going to do what you want everyone to do and that is to use common sense. It's built in for them to do that because of the uncharged misconduct.\n\nIn this case, it's built in. All they have to do is say \"This is just overly prejudicial.\" They don't-and, you know, they can hang it up by saying I abused my discretion. And, furthermore, they can say \"It was not relevant to the issue of sexual assault and it certainly wasn't relevant to the issue of sexual assault felony murder.\" Now, they can say that. But to say that, it seems to me, flies in the face of common sense because a person can have a motive to cover up sexual assault. And that's what I think is the key to this testimony. He has a motive to cover up the intercourse. Don't call it sexual assault, call it intercourse. Because he wants to avoid accusations.\n\nNow, that's your theory. And I'm willing to let you have that theory without endorsing it, without rejecting it, just saying that it's something that I think the State is entitled to introduce in this case.\n\nBased on those comments, Belden contends that the trial court supplied the State with the theory for admission of the uncharged misconduct evidence. Implied in Belden's argument is that this evidence would not otherwise have been admitted because the State had not offered any appropriate grounds for its admission.\n\n¶16 When the record is examined, Belden's claim that the court was supplying the State with a basis for admitting that testimony is utterly without merit. The comments noted above were made by the trial court in chambers during a conference between the parties on the morning of the third day of the trial on October 11, 2000. The question before the court was whether or not to admit testimony from two witnesses who alleged that Belden had sexually assaulted them. The question had also been raised whether or not to allow testimony or to simply present the jury with a written history relating the accusations that were made against Belden and their disposition. The portion of the transcript cited above is taken verbatim from what appeared in Belden's brief. Belden neglected to include the remark made by the prosecution less than a page before the cited material wherein motive is specifically referenced as the basis for the admission of the evidence. Belden also neglects to mention that there was a hearing on the admissibility of uncharged misconduct evidence on August 28, 2000. The State argued motive for the admission of this evidence at that time. In addition, the State filed a brief on September 11, 2000, in which it again argued motive as a basis for admission. In fact, Belden's own brief in response to the State's argument to admit this evidence specifically affirms that the State was urging admission based upon a contention that it showed a \"motive to silence\" the victim. Reading the cited portion of the transcript above, it is clear that the trial court is not giving the prosecution the basis for admitting the proposed evidence; rather, it is merely discussing how, at that time, it was considering the prosecution's arguments in favor of the evidence. In other words, the court is merely reiterating the argument made to it by the prosecution--nothing else. Belden's argument that the court committed misconduct by supplying the State with the basis for the admission of this evidence is contrary to the record and without merit.\n\n¶17 At the end of his argument on this claim in his brief, Belden makes a cursory allegation of additional misconduct by the trial court in favoring the State in its rulings on evidence before the jury:\n\nThere are other minor examples of the trial court helping the state in front of the jury. After a defense objection, the trial court told the state to ask the witness if he agreed with those statements. * * * After another defense objection, the trial court told the state: \"As long as you talk about motive and as long as you talk about the homicide, you may talk about it with this witness.\"\n\nA review of the relevant portions of the transcript dispels any question of misconduct on the court's part. The first incident occurred during the prosecution's cross-examination of a defense expert who had testified on what sort of injuries and physical evidence would typically be found in a sexual assault situation.\n\n[PROSECUTION]: Now, the Department of Justice document that-that we-we looked up on the Internet and we printed off in all of its 190 some pages-I guess 199 pages, has a lot of information about sexual assault. And one of the statements out of this big, thick document that I see here is it says that genital trauma evidence-genital trauma is useful-useful-to show both recent sexual contact and force. Would you agree with that?\n\n[WITNESS]: I would agree.\n\nQ: And it goes on in that same paragraph to say that while the examiner will usually not find genital injuries, this should not influence their testimony regarding the validity of the rape since most rape victims do not experience genital injury as a result of a rape. And they site [ sic ] as a source for that Bower and Dalton [ sic ], 1997. They go on to say in one study vaginal injury -\n\n[DEFENSE COUNSEL]: Your Honor, I -\n\n[PROSECUTION]: -- that I want to -\n\n[DEFENSE COUNSEL]: Your Honor, I'm going to object at this time. I think it's an improper way to present evidence and to question the Witness. If they want to show a document to him, ask him if he's familiar with it, they can. If they want to present the document, I think they have to do that through their own witness. I object to the form of the question.\n\n[PROSECUTION]: The Witness testified that he expected to find more bruising on this-on this victim.\n\n[DEFENSE COUNSEL]: That's not what that reference is even to.\n\n[PROSECUTION]: Well, I'm going to get to that reference in just a few minutes.\n\nTHE COURT: You may ask him if he agrees with those statements.\n\nIn response to the defense's objection, the court told the prosecution it could ask this witness if he agreed with statements made in the document relating to injuries characteristic of sexual assaults. We are at a loss to understand how the judge's ruling constituted a comment helping the prosecution. The court essentially overruled the defense objection. In that sense it was, of course, helpful to the State. That is the nature of objections-one side or the other is \"favored\" when one is sustained or overruled. There is no reasonable interpretation here, however, that could support any claim of bias on the part of the judge in making this ruling. The judge simply made a ruling on a question of evidence that is an inherent part of a trial court's function. Belden's claim of misconduct or bias is meritless.\n\n¶18 The second incident cited by Belden occurred during re-cross of the same witness:\n\n[PROSECUTION]: [Belden] had motive, did he not?\n\nA: I'm not sure what it was.\n\nQ: In 1976, he met [one of the uncharged misconduct victims], you're aware of that, aren't you?\n\n[DEFENSE COUNSEL]: Your Honor, I'm going to object at this time because it's a limiting instruction on how that can be used and I think he should be very careful.\n\n[PROSECUTION]: I'll try to be as careful as I can, Judge.\n\nTHE COURT: As long as you talk about motive and as long as you talk about the homicide, you may talk about it with this Witness.\n\nThe court had ruled that uncharged misconduct evidence related to other alleged sexual assaults by Belden was admissible for the purpose of demonstrating motive for him to kill the victim. This witness, a Nebraska law enforcement officer, had been called by the defense to testify about the investigation and to support the defense claim that other suspects had a motive kill the victim. The court's comment merely told the prosecutor that he could continue his line of inquiry but only so long as he stayed within the parameters under which the uncharged misconduct evidence was admitted. The comment was not in any way indicative of misconduct or bias on the part of the trial court. Belden's claim is not cogent and is without merit.\n\n¶19 Next, Belden asserts that the trial judge improperly intruded into the trial process by commenting on evidence, denigrating counsel for both parties, and repeatedly making comments that reduced the seriousness of the proceedings. The main instance cited by Belden occurred when the prosecution attempted to introduce a photograph of a motorcycle, which Belden had left behind in 1985. The picture was taken shortly before trial and defense counsel objected because the photograph did not portray the motorcycle as it existed in 1985. The trial court sustained the objection and the following colloquy transpired:\n\n[DEFENSE COUNSEL]: Excuse me, Counsel. I'm going to object to any further questions by Counsel concerning these photographs because it's been ruled that they are nonadmissible [ sic ].\n\n[PROSECUTION]: That's fine. I wasn't going to ask you about the photographs.\n\nQ: Did that motorcycle look like it was in pretty good shape for being out in the weather for fifteen years?\n\nA: Yes.\n\nQ: Did it look rideable [ sic ]?\n\nA: Yes.\n\nQ: Did the handlebars look like they'd been in a crash or were inoperable?\n\nA: No, sir.\n\nTHE COURT: Give me the photograph.\n\n(The Witness handed the photograph to the Court.)\n\nTHE COURT: Thank you. (Pause.)\n\n[PROSECUTION]: I'll still move for its admission, Judge. We'll try it a little later. (Pause.) I'll move for its admission.\n\n[DEFENSE COUNSEL]: Your Honor, if they get a picture of the-of the motorcycle when it was taken-I would assume, if they had done an investigation about this, that they have a picture of it when they took it into custody. That's what's relevant. I object to this photograph because it doesn't depict the motorcycle at the time it was taken into custody. I will say that they can have that photograph. That's what it looks like today. Whether it looked like that fifteen years ago or not, I guess we have to say it looked like that fifteen years ago.\n\n[PROSECUTION]: I think [defense counsel's] objection goes to the weight rather than the admissibility. Move for it's [ sic ] admission.\n\nTHE COURT: Well, I don't know.\n\n[DEFENSE COUNSEL]: I don't think it -\n\nTHE COURT: You've puzzled me and the Jury, guys, because I don't know what the significance of it is.\n\n[DEFENSE COUNSEL]: Your Honor, I don't either, but -\n\n[PROSECUTION]: Let me ask one more question.\n\n[DEFENSE COUNSEL]: -- they're putting it in, so I figure they've got some significance to it. And if there is some significance, I want to see the photograph of the vehicle at the time of the events that took place, not now.\n\n[PROSECUTION]: Judge, let me ask one more question and maybe I can tie up the significance and relevance.\n\nTHE COURT: I think I glean what it is, but I'm not certain, so you may ask the question.\n\nQ: If you owned that motorcycle, sir, would you just have left it out at the man camp?\n\n[DEFENSE COUNSEL]: Objection, your Honor.\n\nTHE COURT: Sustained.\n\n[DEFENSE COUNSEL]: Jesus.\n\nTHE COURT: I think that what you're trying to do is to have this Witness comment upon the value of that motorcycle.\n\n[PROSECUTION]: I am.\n\n[DEFENSE COUNSEL]: Your Honor, I object to even this discussion going on before the Jury. And I-and I think what Counsel has done is highly prejudicial, highly improper, and I think he should be strongly admonished. And I feel like I almost should ask for a mistrial.\n\nTHE COURT: Well, if you're going to ask for a mistrial, ask for one.\n\n[DEFENSE COUNSEL]: For the record, I will, because of the comments that this man has made.\n\nTHE COURT: [Prosecutor], do you want to respond?\n\n[PROSECUTION]: I would like to you, your Honor.\n\n[DEFENSE COUNSEL]: May we do this outside the hearing of the Jury?\n\nTHE COURT: No, you did it in front of the Jury. We're going to do it all in front of the Jury.\n\n[PROSECUTION]: Thank you, your Honor. Judge, that photograph depicts-the witness has identified the photograph of a motorcycle that he has stated for the record was the property of the Defendant. Now, the photograph depicts the motorcycle at the impound lot here at the Lincoln County Sheriff's Office. Now, I thought that the victim-the Witness was aware of the circumstances surrounding the taking of the photograph. That's my mistake. But other than that, your Honor, he says that the photograph is an accurate depiction of the motorcycle as he observed it on Sunday evening, no changes or alterations. And, certainly, the property of-a piece of property that belongs and has been connected to this particular Defendant, abandoned by this particular Defendant according to the testimony of the officer, it appears is relevant for certain purposes. Now, would the Court -\n\nTHE COURT: The motion before the Court is not the admissibility of the picture or the relevance of the motorcycle. The issue before the Court is a motion for mistrial and a request for me to reprimand you for your comments about the motorcycle in front of the damn Jury. That's what [ sic ] before the Court. Now, if you want to address that, you can.\n\n[PROSECUTION]: I did not mis- --\n\nTHE COURT: Don't talk to me about the motorcycle.\n\n[PROSECUTION]: Judge, in talking in front of this Jury, I did not misrepresent the condition of the motorcycle. I have not tried to put before this Jury any sort of unfairly prejudicial evidence in any way. I'm just trying to do my job. And I would ask that the motion for mistrial be denied.\n\nTHE COURT: [Defense counsel], is there anything more you would like to say for the record?\n\n[DEFENSE COUNSEL]: I need to voire dire the Witness so I can do that.\n\nTHE COURT: Go ahead. Voir dire.\n\n[DEFENSE COUNSEL]: Did you try to start that motorcycle?\n\n[WITNESS]: No, sir.\n\n[DEFENSE COUNSEL]: Do you know anything about the electrical system of this motorcycle?\n\n[WITNESS]: No, sir.\n\n[DEFENSE COUNSEL]: You don't know-were you aware in your investigation that the motorcycle had been damaged by somebody who had borrowed it from [Belden], and had wrecked it and that it was inoperable? Do you know that? It's in all of your reports.\n\n[WITNESS]: Yes.\n\n[DEFENSE COUNSEL]: So you-but the motorcycle, so far as you know, you're trying to say it was operable or it was not operable?\n\n[WITNESS]: It appears to be not operable.\n\n[DEFENSE COUNSEL]: But you never checked it?\n\n[WITNESS]: No, sir.\n\n[DEFENSE COUNSEL]: Okay. Your Honor, that's why I object.\n\n[PROSECUTOR]: Judge, that goes to weight.\n\nTHE COURT: Fellows, enough's enough. Enough's enough from both of you. You're treating the Jury and me like we're a bunch of dummies.\n\n[DEFENSE COUNSEL]: I'm not trying to, your Honor.\n\nTHE COURT: Ladies and Gentlemen, you know what this is all about, don't you? Is there anybody confused about what's going on about the motorcycle? If so, raise your hands[.] No hands have been raised. Now, the motion for mistrial is denied. [Prosecutor], I won't reprimand you for anything other than wasting our time over this issue of the motorcycle. Now, Ladies and Gentlemen, it's time for the noon recess and we'll take it now....\n\n(Jury left the courtroom.)\n\n[DEFENSE COUNSEL]: Your Honor, for the record, I have to at this time make a further and second motion for a mistrial on the basis and for the reasons-and I do this with a great deal of trepidation and-well, I do this because I have to. I feel that the Court has commented upon a very important part of the evidence to the Jury in its remarks and, as such, I think that the-the Defendant has been severely prejudiced; and I ask for a mistrial.\n\nTHE COURT: State with particularity what the comment is to which you object so that -\n\n[DEFENSE COUNSEL]: The comment -\n\nTHE COURT: -- so that if I have, in fact, commented on the evidence, I will have an opportunity to cure the problem that you perceive.\n\n[DEFENSE COUNSEL]: Yes, your Honor. And I appreciate and I think it's only fair that I do that. The comments were to the-to the Jury and the way you said it was the Jury knows what this is all about with this motorcycle. And the-the implication, at least that I took, was that it was-it's a minor thing. As a matter of fact, this motorcycle is a major issue. They're trying to say he left a perfectly good motorcycle and that shows flight. The fact of the matter is if we'd ever gotten into it, the motorcycle was-was destroyed by somebody else. There was a-he-he couldn't get it fixed. We now have before this Jury the comments that the Court thinks that this thing is all a big bunch of hog wash. I don't think I can cure it. I don't think any comments by the Court can cure it. I just think it's been a comment upon the evidence. I think we should have stopped.\n\nTHE COURT: All right. [Defense counsel], you opened it up and I'm going to tell the Jury that my comments were directed at lawyers, not at evidence, and that I am tired of the nonsense between you two lawyers in front of this Jury.\n\n[DEFENSE COUNSEL]: And I-as I said in my motion -\n\nTHE COURT: And I will tell them that in no uncertain terms, [defense counsel].\n\n[DEFENSE COUNSEL]: As I said in my motion, I think that making any further comments will be more harmful and, your Honor, --\n\nTHE COURT: Now, let me tell you something else, [defense counsel]. Both sides of this case better start looking at the Jury. Both attorneys better start looking at the Jury and they better be measuring their conduct as reflected in the demeanor of the Jury. Both of you.\n\n[DEFENSE COUNSEL]: I've only made one objection, your Honor.\n\nTHE COURT: You both better look at how your behavior is affecting the Jury. You're both not aware of that. I think that other people in this courtroom are observing what the Jury-how the Jury is reacting to your conduct in this case, Counsel. And I just think that both of you need to look at it because you're wearing my patience thin and you are wearing, both of you, the Jury's patience thin. Now, you have something more, another objection, [defense counsel][?] State it.\n\n[DEFENSE COUNSEL]: No, your Honor, I-I have stated that-you know, I-I just think I need to make my-I simply got up and objected because of the-the picture was not a recent depiction. It was sustained. And then we went-continued it from Counsel. I had to do something, Judge. He can't continue to talk about an objection that's sustained by the Court. I-I don't want to-to do this. This is the last thing-and I have every-I have most adamant respect that I could ever have for this Court and I know that you know that. And I don't wish to pursue this and I don't wish to make a scene out of it, but [the prosecutor] continued to talk about something when you had sustained it.\n\nTHE COURT: Now, [defense counsel], you are seeing this case in your own eyes and you are seeing it in the-with the viewpoint of having your way. You forget what it's like to be a judge. You forget that when an objection is lodged to a piece of evidence or testimony and the objection is sustained, that does not preclude Counsel from trying again and again and again. And each time the efforts are made, an objection is sustained, they can try again and again and again until the patience of the Court wears out.\n\nNow, my patience wore out with both of you on the photograph over a motorcycle because it was absolutely obvious to the Jury, as it was to me, that what you're really talking about is whether or not a piece of junk was abandoned or whether a valuable piece of property was left behind. And you guys were going to go on and on and on about when a photograph was taken and I had enough of that from both of you. Because you, [prosecutor], never asked the Witness whether it was operable, whether it was inoperable, whether it was junk, whether it had any value at all. [Defense counsel] finally gets up and asks some questions along those lines. But you didn't, [defense counsel]. And the argument becomes about when is a damn photograph taken? And I had enough of both of you. And that's what I commented on, the conduct of Counsel.\n\n[DEFENSE COUNSEL]: Again, your Honor, I'm going to ask that-I would withdraw my motion for mistrial, but I would ask -\n\nTHE COURT: No, don't withdraw it.\n\n[DEFENSE COUNSEL]: But I would ask the Court not to comment further to the jury.\n\nTHE COURT: I won't let you withdraw it, [defense counsel]. I won't let you.\n\n[DEFENSE COUNSEL]: I would, in all due respect. And I'm not going to say anything more about the situation. I understand completely what the Court is saying. I think I understand completely what I did, but I do believe that we are compounding the matter if we say anything more.\n\nTHE COURT: Now, you guys just better pay attention to me. You have been in a pissing match, the two of you, from the moment you walked into my courtroom. And it's going to be-it's a contest of who is going to be the big stud duck in this case. Both of you have been bumping heads to win the argument between the two of you. You've been paying more attention to who's going to be the top dog than you have to what in the world are you trying to do in this case[.]\n\nThis isn't a contest between you being right, [defense counsel], and him being wrong; and you being right, [prosecutor], and him being wrong. This is a case-the whole issue in this case is is [ sic ] what testimony is admissible, what evidence is admissible and what conclusions and inferences can be drawn from that testimony and the evidence. And if it is objectionable evidence, then you should fight on the admissibility, not on who's right, not on who's stud duck, not on a damn photograph, but the significance of what was left behind.\n\nNow, I'm telling you guys this because I'm not sure that you're aware that you're doing it. I'm just not sure that the two of you are aware that you're doing it. You're both fine, fine attorneys. You're both skilled trial attorneys. But you've got to lay aside the business of winning the quarrel between yourselves. The issues are \"Can I win the argument with the Judge? Can I win the argument of admissibility or inadmissibility.\"\n\nYou know, you've been going on and on and and [ sic ] leaving me out. I want to be left out. You know, I don't want to have to rule but, boy, when you-but you're leaving me out because you're quarreling back and forth with each other.\n\n[DEFENSE COUNSEL]: With all due respect, your Honor, I made the objection and I stated it to you. And I didn't think it was badgering with Counsel, but I will attempt to not do so.\n\nTHE COURT: You're-[defense counsel], you're the worst. You've been making comments throughout the trial: \"If he knew what to do.\" \"That's not the right objection.\" \"He still hasn't figured it out.\"\n\n[DEFENSE COUNSEL]: Well, that was three days ago, your Honor.\n\nTHE COURT: Well, you know, this morning, you make comments about how you wish we could get on with getting some relevant evidence in here. \"Don't know why we're doing all of this.\" \"Maybe somewhere along the line we'll get to the point where we get to the material things in this case.\" Now, I may share that view with you, [defense counsel], but, you know, where do you get off in the middle of the examination of witnesses, during the course of the trial, making those kind of comments? Those are comments to show [the prosecutor] up in front of the Jury. Those are comments to build yourself up and put him down.\n\n[DEFENSE COUNSEL]: I'm sorry, your Honor.\n\nTHE COURT: And what does that do to [the prosecutor]? He just bristles up like the young banty [ sic ] rooster that he is. And, you know, the hackles on his neck come up and he's going to show you and he's not going to put up with that. That's the kind of stuff that's going on in this case.\n\nNow, I want to have some fun with you guys. I don't mind some humorous interjections in this case because it tends to cause us-cause all of us not to take ourselves too seriously. And I generally poke fun at myself first and the lawyers second as an antidote to this business of us taking ourselves too seriously. But I'm tired of it, guys, and it-it's only taken two and half days.\n\nAnd so, [defense counsel], I understand-[defense counsel], I understand what you're talking to me about and why you feel frustration about wanting to get on with the case -\n\n[DEFENSE COUNSEL]: But I feel it's more than that.\n\nTHE COURT: -- because you see him anticipating the defense in his case in chief.\n\n[DEFENSE COUNSEL]: But, your Honor, I feel it's a deliberate attempt at more than that. And that's all I'm trying to combat. I really think it's a deliberate attempt to-you know, to say something else to the Jury. I think that's what this photograph is about. He even asked that witness \"Would somebody leave a valuable motorcycle like that?\" That was his whole intent in putting that in, your Honor.\n\nTHE COURT: Certainly.\n\n[DEFENSE COUNSEL]: Well, that's incorrect. I think you have to agree with me that that's incorrect. That was the basis of my objection. I knew that that's what he was going to do. And I'm sorry that I didn't just sit down after I made the objection, but I didn't know how to keep that from going on. I mean, he was obvious about what he was doing and that's what upset me so much, Judge, because I do think that is totally improper.\n\nTHE COURT: But the issue is whether a piece of junk was abandoned or whether a valuable piece of evidence was left behind -\n\n[DEFENSE COUNSEL]: That's true.\n\nTHE COURT: -- while somebody fled. And, you know, the resolution of that issue is for the Jury. The fact that needs to be established is was it junk or wasn't it junk? And [the witness] -\n\n[DEFENSE COUNSEL]: Doesn't know.\n\nTHE COURT: The photograph doesn't establish that. Somebody's knowledge of the motorcycle establishes whether it's junk or whether it's not junk. I can't tell whether it's junk by looking at a photograph and neither can you and neither can the Jury. They can see that there's a motorcycle that looks like it's in good shape except for the seat.\n\nAnd so, you know, the question really was to [the witness], \"Do you know the value of that motorcycle?\" Was it operable?\" So, you know, let's just forget it.\n\n[DEFENSE COUNSEL]: Thank you, your Honor.\n\nTHE COURT: Now, [defense counsel], I am going to tell the Jury that the Defense thought I was commenting upon the motorcycle and the evidence; and I'm going to tell this Jury \"I don't want you to think that my comments had anything to do with the motorcycle or the evidence.\"\n\n[DEFENSE COUNSEL]: I understand that.\n\nTHE COURT: \"My comments were intended by me to be comments on the lawyers.\"\n\n[DEFENSE COUNSEL]: And I understand that, your Honor, and I -\n\nTHE COURT: And I'm going to tell them that, [defense counsel].\n\n[DEFENSE COUNSEL]: I think it's going to cause more problems.\n\nTHE COURT: This Jury knows that I like you guys. They know that. I told them that right off the bat in the beginning of the case. And I have told this Jury that I'm like you two guys. I've put myself in the same category with you. Now, just quit the belly bumping.\n\n(The Jury returns after the recess.)\n\nTHE COURT: Ladies and Gentlemen, -- I've got to plug myself in here.\n\nThis is a portion of an instruction that I will give you later on in the trial but I want you to hear it now, at least this portion of it.\n\nI'll read you the entire instruction: These instructions have been given you because it is my duty to instruct you as to all the law that you must consider and I have not, in giving them or by any ruling made or by anything I have said or done during the trial, intended or attempted to give any intimation or opinion as to what the facts and proof were or as to which witnesses are worthy of belief or what your verdict should be. If, during the trial, you have formed an impression that the Court has a feeling one way or another about the case, you shall disregard any such impression because you jurors are the sole judges of the evidence and the credibility of the witnesses. The feelings of the Court, if any, are irrelevant.\n\nI read that instruction to you because I do not want you to think that any of the comments that I made to you at the end of the morning session were a comment on any of the evidence. Anything that I said at the end of the morning recess was not a comment on the evidence. It was a comment on the actions of the attorneys and that's what I intended it to be. I did not intend it to be a comment on any evidence. I intended my comments to be comments about the attorneys.\n\nIt is within the trial court's discretion to comment upon the conduct of a witness or counsel through a caution, admonition, or censure as the circumstances may warrant. Kendrick, 27 Wyo. at 154; see also 75 Am.Jur.2d Trial § 309 (1991). However, determining the weight of the evidence and assessing the credibility of the witnesses is within the exclusive province of the jury. Wilkening v. State, 922 P.2d 1381, 1384 (Wyo. 1996). When making comments in front of the jury, the trial judge should take great care to ensure that he does not intrude into the jury's province.\n\n¶20 Belden contends that the court's comments prejudiced him when it refused to hear the motion for a mistrial outside the presence of the jury because the State was allowed to present its theory behind the evidence and its importance. Second, he complains that the court's comments constituted derogatory remarks about counsel for both parties. He also insists that the court's statement that the motorcycle evidence was \"a waste of time\" was a direct comment on the evidence and, consequently, the court usurped the jury's function to determine the facts and credibility.\n\n¶21 While we find the district court's comments unsettling, we are unable to conclude that they were prejudicial to Belden for several reasons. First, the particular statement cited by Belden was specifically addressed towards the prosecutor: \"[Prosecutor], I won't reprimand you for anything other than wasting our time over this issue of the motorcycle.\" From the context in which it appears, the statement is not a comment on the evidence; rather, it is an expression of frustration on the part of the trial court over what it has perceived as unnecessary, dilatory tactics by the prosecution. However, it would not be unreasonable for one to construe the court's comments to constitute a statement relating to the court's opinion of the value of that evidence. Even if we accept that interpretation, the fact remains that the comment was directed at the prosecution and its attempt to lay a foundation for the admission of the photograph of the motorcycle. It takes a rather large leap in logic to conclude that these comments-directed towards the prosecution-so \"impressed the jury with the trial judge's partiality to the prosecution that this became a factor in determining the defendant's guilt.\" Pisani, 773 F.2d at 402. Along these lines, we would note that evidence relating to the motorcycle was, at most, peripheral to the ultimate question of Belden's guilt. Each party gave the motorcycle a single, fleeting mention during their lengthy closing arguments. Accordingly, we find that the comments by the trial court did not prejudice Belden to the point where he was denied a fair trial.\n\n¶22 Furthermore, any prejudicial effects of the court's comments were mitigated by the timely instruction given to the jury. The instruction, noted above, was given to the jury immediately upon their return from their noon recess before the trial resumed. The instruction explicitly stated that the jury was to give no consideration to the court's comments and that they were the sole determiners of the evidence and the credibility of the witnesses. This instruction was given again to the jury just prior to deliberations. The court took appropriate and immediate remedial action to correct any implication that his comments may have suggested an opinion on the value of the evidence or that he favored a particular party. We assume that juries follow a court's curative instructions. Metzger v. State, 4 P.3d 901, 908 (Wyo. 2000); see also Burke v. State, 746 P.2d 852, 857 (Wyo. 1987).\n\n¶23 In his final claim of judicial misconduct, Belden contends that there were numerous examples of improper comments that denigrated counsel for both parties and reduced the seriousness of the proceedings. He acknowledges that most of the incidents are minor but argues that in total they showed a pattern of \"impugning counsel and the proceedings.\" Again, in order for us to set the proper perspective for Belden's claims, we will quote extensively from the record. We will not discuss each citation separately. Instead, we will discuss and analyze the merits of Belden's claims after setting out the relevant portions of the transcripts. In several instances, we have expanded the portion of the transcript cited by Belden in order to provide a context for the comments made therein. Belden added the underlining in the transcript citations below in the appendix to his brief:\n\nTHE COURT: Each side is entitled to another peremptory challenge relative to the alternate. Exercise your eighth challenge, Mr. Prosecutor. (Pause.)\n\nYou get two more peremptory challenges, [defense counsel], number eight and number nine. And the Prosecution gets two more, number eight and number nine. (Pause.)\n\n[DEFENSE COUNSEL]: I think we've got to do some-\n\n(The State exercised its eighth peremptory challenge.)\n\nTHE COURT: You gave me two, Counsel. Do you want one back?\n\n([Prosecutor] retrieved the paper.) (Pause.)\n\n(The Defense exercised their eighth peremptory challenge.)\n\nTHE COURT: You know, I take the plug out my ear so I don't hear you whispering. (Laughter.)\n\n[DEFENSE COUNSEL]: You know I wouldn't say anything.\n\nTHE COURT: And then when you talk to me, I can't hear you.\n\n[DEFENSE COUNSEL]: Who is the-in your system who-as the jury sits now, would the alternate be?\n\nTHE COURT: [Names alternate]. (Pause.)\n\nI don't know if the loss of hearing is a blessing or a curse, Ladies and Gentlemen. I do know it's real handy when you don't want to listen to your wife. (Laughter.) You just pretend you don't hear.\n\n[PROSECUTOR #1]: You don't need a hearing loss.\n\n[PROSECUTOR #2]: That's exactly right, Judge. You don't need the hearing aids for that.\n\nTHE COURT: My daughter calls it male selective hearing loss. (Laughter.)\n\n[PROSECUTOR #1]: Thank you, Judge.\n\n[Witness], I'm going to hand you a series of photographs that were taken during the course of the autopsy and we'll go through them. I'll-we'll introduce them and then we'll talk about them. I'll bring them up on the LCD, if we can. And if, folks, you can't hear, may I-if this gets too loud, the Doctor's kind of soft spoken, so if somebody can't hear, your Honor, Counsel, Members of the Jury, just somebody speak up and we'll try to go as loud as we can. And I'm going to ask [Prosecutor #2] to make sure I've turned this thing on. I hit one button and I don't know if I did it right.\n\n[Prosecutor #2]: You spent the weekend with it, I thought.\n\nTHE COURT: He loses his confidence when he's in front of a group. (Laughter.)\n\n[PROSECUTOR #2]: Can you shut the lights off?\n\n[PROSECUTOR #1]: I'll remember that, Judge. I'll practice.\n\nTHE COURT: He doesn't want to be embarrassed by a machine.\n\n[DEFENSE COUNSEL]: You have to turn on the computer.\n\n[PROSECUTOR #1]: We've got the computer on. We're just waiting for the light bulb to come on.\n\n[PROSECUTOR #2]: Okay. It warms up for a second.\n\nTHE COURT: No objection? You're excused, Doctor. Thank you for coming.\n\nLadies and Gentlemen, it is time for you to take the noon recess. We'll do what we're going to do-and let me give you some explanation about it. There is a witness that is only available today because of other commitments and we are trying to preserve the testimony of that witness for presentation to you at a later time. We're going to do that by videotaping that testimony while you are gone and that videotape will be presented to you later on in the trial. That's the most that I'll tell you at this point.\n\nI think that to accomplish what we want to accomplish, we'll probably take close to an hour and a half. I would-I was told by the attorneys that it would be about an hour, but I was also told by the attorneys that this Witness would be about an hour. And so, you know, I come awful close to buying stock in the Brooklyn Bridge from time to time. It seems like I would probably buy some if the salesman was a lawyer. (Laughter.)\n\n[DEFENSE COUNSEL]: I doubt it, Judge.\n\n[PROSECUTOR #1]: Let me hand you an item-have we marked this? I don't believe we have. I think it's-I'm looking for a specific item.\n\nOur-It's our Exhibit No. 61, which is a rape kit taken on 1/7/88. This is it. I don't see it on there.\n\nOh, we haven't tagged it. Okay. Thank you. (Pause.)\n\nTHE COURT: How are you doing, Pat?\n\nTHE REPORTER: I'm fine.\n\nTHE COURT: I'm talking to Pat.\n\n[PROSECUTOR #1]: I knew you weren't asking me.\n\nTHE COURT: Yeah, I'm not going to ask you if you need a break.\n\n(The jury re-enters the courtroom after a conference in chambers.)\n\nTHE COURT: Good morning, folks. How are you all? Did you have trouble getting down from Afton? Snowing up there?\n\n[Juror]: No.\n\nTHE COURT: Boy, it was snowing buckets in Evanston when we left. Lord, I thought it was going to be a major snowstorm, but when we got on this side of the First Sister and got out on the Cumberland Flats, it kind of quit. It was foggy, cloudy, wet, but no snow.\n\n[Juror]: It is now.\n\nTHE COURT: It is now, snowing on the flats?\n\n[Juror]: Yes.\n\nTHE COURT: I was laughing before I came into court. You know, I was kidding [prosecutor] and [defense counsel]. I tell them that they're-the only essential difference between the two of them is their size and their weight. That they basically both have the same kind of character and personality when it comes to the job of trying cases.\n\nI was joking with Pat and Ken that the best way to keep these two guys under control is to keep myself under control because what I don't tell them is is [ sic ] that maybe there are three of a kind in this courtroom. And Ken said to me, \"Yeah, if you get involved in it, it's going to look-it's going to make WWF look like a church social.\" (Laughter.)\n\nSo I say that because, you know, I've been dinging at them and I want you folks to hear it and to say it in their presence because they're good men and they fight hard for their cause.\n\nOkay, [prosecutor].\n\n(Witness sworn in.)\n\n[PROSECUTOR]: Good morning, folks. As the littlest of the three, I'm going to keep myself under control.\n\n[PROSECUTOR]: And do you recall reading the [victim's] diary about the events of this week, that is, August 25, 26th, 27th, 28th, 29th?\n\n[WITNESS]: Yes, sir.\n\nQ: Does [the victim] talk about [her ex-boyfriend] in this diary?\n\nA: Yes, she does.\n\nQ: Does she talk about her terrible fear for [the exboyfriend]? Did she -\n\nA: No.\n\nQ: Would you say that, in fact, it appears that she's very-she was glad to see him, wasn't she, one week -\n\n[DEFENSE COUNSEL]: I'm going to object to the form of the question. It [ sic ] leading and suggestive.\n\n[PROSECUTOR]: Well, we'll read the diary.\n\n[DEFENSE COUNSEL]: Why don't you just ask the question, Counsel, without leading the Witness? And I object to his reading the document. If he wants to show him a document and refresh his memory, he may do so.\n\n[PROSECUTOR]: I'm not going to read the diary. I'm trying to read the diary so I can point out the passage so I can refresh the Witness's recollection.\n\nTHE COURT: You guys are doing what you are doing and you're not involving me. As far as I'm concerned, you have withdrawn the question, [prosecutor].\n\n[PROSECUTOR]: I have, your Honor.\n\nTHE COURT: So ask another one.\n\nAnd, [defense counsel], if you have an objection, I know what you will do. You will object.\n\n[DEFENSE COUNSEL]: I was just anticipating. He got the diary and walked back there and said, \"Let me read it\" and that's what I was concerned about your Honor. I'm sorry. I didn't mean to disrupt the Court.\n\n[DEFENSE COUNSEL]: Were you able to see any kind of lesion?\n\n[Witness]: Yes, I did.\n\nQ: That's interesting, because the pathologist yesterday who took the photographs wasn't able to show them to us.\n\nA: Well, the photograph I saw -\n\n[PROSECUTOR]: Your Honor, I would raise an objection. That's not what the pathologist said. He said, \"I would rather not identify them from the photograph because they are not the best quality. I'd rather testify from my reports.\"\n\nTHE COURT: We're not going to have an argument between Counsel.\n\n[PROSECUTOR]: We're not going to, you Honor.\n\nTHE COURT: I've had enough of that kind of stuff from the lawyers.\n\n[PROSECUTION]: We don't want to start, your Honor. I'll withdraw it. We can take care of it.\n\n[DEFENSE COUNSEL]: Okay. I expect we'll see him again, so I'll ask him. One last thing. [The prosecutor] showed you a-I guess it was a lab report. I lost track of all the exhibit numbers. And asked you if there was anything in there that indicated the presence of a spermicide and you said no?\n\n[WITNESS]: That's correct.\n\nQ: Okay. If I may, I'll show you another lab report. (An off-the-record discussion was held between [defense counsel] and [the prosecution].) (Pause.)\n\nQ: And if you would mainly read the bottom paragraph now-not out loud, or I guess you can if you like. You can read it out loud. If that would indicate there was a spermicide present -\n\n[PROSECUTION]: Your Honor, wait a minute. May I look at that? Is that an exhibit?\n\n[DEFENSE COUNSEL]: No.\n\n[PROSECUTION]: Oh, may I look at it? I thought you were pulling -\n\n[DEFENSE COUNSEL]: It's your lab report, May 16. (Pause.)\n\n(An off-the-record discussion was held between [defense counsel], and [the prosecution].)\n\n[PROSECUTOR]: There's no foundation and we would object to that because it's earlier than the lab report.\n\n[DEFENSE COUNSEL]: I got it from you folks.\n\nTHE COURT: Well, mark it.\n\n[DEFENSE COUNSEL #2]: Mark it.\n\nTHE COURT: Mark it and offer it. Let's not sit here and discuss it between the lawyers. You know, you either talk to the Judge, you talk to the Jury or you talk to no one.\n\n[PROSECUTOR]: Your Honor, we're not going to raise an objection to the introduction.\n\nTHE COURT: Then why are you wasting my time, Counsel?\n\n[PROSECUTOR]: I didn't know what it was, your Honor.\n\nTHE COURT: You are. You are now.\n\n[PROSECUTOR]: Okay. Where was-did you find out any information where that blue pickup was last seen?\n\n[WITNESS]: The last I heard was Deputy -\n\n[DEFENSE COUNSEL]: Your Honor, I'm going to object. I don't know what he heard or how he heard or-so I think I'm going to object.\n\nTHE COURT: It's hearsay.\n\n[PROSECUTOR]: Your Honor, not getting into the truth of the matter, just to show what he did next.\n\nTHE COURT: I would anticipate it's going to put the vehicle in a location that's going to cause some palpitations -\n\n[PROSECUTOR]: Okay.\n\nTHE COURT: -- for Defense Counsel, which means it's being offered for the truth of the matter stated.\n\n[DEFENSE COUNSEL]: I don't know what it's being offered for.\n\nTHE COURT: Sounds to me like hearsay.\n\nTHE COURT: And I will permit Counsel to go ahead; and I'll see if he's going to do what I expect him to do.\n\n[PROSECUTOR]: (Con't [ sic ] Redirect Examination by [the prosecutor] of [the witness]:) Roger, will you look at your report again, what I've put in parentheses, and read that?\n\n[THE WITNESS]: \"We turned around and went to\" -\n\n[DEFENSE COUNSEL]: Wait, --\n\n[PROSECUTOR]: To yourself.\n\n[DEFENSE COUNSEL]: -- that's what I objected -\n\nTHE COURT: Just to yourself.\n\n[PROSECUTOR]: Yes, read it to yourself, sir. (Pause.)\n\nTHE COURT: I am beginning to lose patience in this case, Gentlemen, and I'm giving you some warning.\n\n[PROSECUTOR]: Roger, does that report indicate you made an extensive search for that vehicle?\n\nA: It appears so, yes.\n\nTHE COURT: Now, that is an improper question. There is-the objection is sustained. The answer is disallowed. (Pause.) That is a hearsay document and the document is not allowed to talk.\n\n[PROSECUTOR]: Understood, your Honor.\n\nQ: Roger, after looking at your report, do you remember where you went to look for this vehicle?\n\nA: We went into the Diamondville area.\n\nQ: Anywhere specific?\n\nA: After looking at the report, we must have been to all of the areas of Diamondville, on the main roads.\n\nTHE COURT: Away we go.\n\n[PROSECUTOR]: Your Honor, I have nothing further.\n\n[PROSECUTOR]: Your Honor, we did a trial deposition in this case with a [witness] and would ask permission to show that.\n\nTHE COURT: Is it a video or is it a written?\n\n[PROSECUTOR]: It's a video.\n\nTHE COURT: All right. How long is it?\n\n[PROSECUTOR]: Fifteen, thirty minutes?\n\n[DEFENSE COUNSEL]: Not that long, I don't think. Twenty?\n\n[PROSECUTOR]: It wasn't that long, fifteen to thirty minutes, your Honor. (Pause.)\n\nTHE COURT: Was there a judge presiding when you did this?\n\n[PROSECUTOR]: No. Neither one of us raised any objections.\n\nTHE COURT: All right.\n\n[DEFENSE COUNSEL]: We get along better.\n\n[PROSECUTOR]: We get along good, your Honor. (Laughter.)\n\nTHE COURT: It's the tag team matches that are driving me nuts. (Pause while the television was set up.)\n\nA JUROR: We need some popcorn.\n\nANOTHER JUROR: Yeah, that sounds good.\n\n[PROSECUTOR #2]: You can lay a little foundation, if you might ask the Judge, to tell the Jury why this is videotaped.\n\n[PROSECUTOR]: Is it-was it a burden on you to have somebody just quit without notice?\n\n[WITNESS]: Oh, bakers were unusual people. Like myself, why, I had everything planned out the day before, the night before we went to work. If somebody upset that schedule that I had in my mind, they might as well send me back home. And this is the way I worked because I had everything planned out. And they're kind of unusual people because of the variance of baking is a very complicated thing with a non-controlled shop. An uncontrolled shop. You don't have a chemist. You don't have anybody to analyze your water, your salt or anything like that and-and the temperature, the specific gravity and everything comes into this to make a good product. And so it's a [ sic ] very complicated with an uncontrolled shop and it's hard to get a good product. We was at-at an elevation where everything dryed [ sic ] out too fast. Your cakes had to have your custard in them to keep them more moist, more oil and stuff-(The video continued but the Reporter reported the following colloquy:)\n\n[PROSECUTOR #1]: I don't think there was much more. We didn't have a heart to stop him.\n\n[PROSECUTOR #2]: We can stop it here, Judge.\n\nTHE COURT: Pull the plug.\n\nTHE VIDEO WITNESS: And [Belden] was a very, very-done his job-(The video continued but the Reporter reported the following colloquy:)\n\n[DEFENSE COUNSEL #1]: Oh, maybe we ought to hear that.\n\n[DEFENSE COUNSEL #2]: Yeah, let's hear that.\n\nTHE COURT: Now, fellows, you took the deposition. You know what this Witness said; and if there is nothing that's material or relevant to this case, then just pull the plug.\n\n[PROSECUTOR #2]: Okay. Sorry. Just -\n\nTHE COURT: Just because you guys did it doesn't mean we have to hear it. (Pause.)\n\nI really have hit a slump at the end of the week, folks. Do you want to hear how to make biscuits?\n\n[JUROR]: No. I'm hungry.\n\n[JUROR #2]: I want to eat them.\n\nTHE COURT: I'm pretty good at dutch oven biscuits.\n\n[JUROR #3]: That sounds pretty good right now. [Court takes noon recess]\n\n[DEFENSE COUNSEL]: I don't have anything further.\n\n[PROSECUTOR #1]: Got about five questions, pretty short. I don't know, your Honor, if -\n\nTHE COURT: Then let's do it, do the questions before the recess.\n\n[DEFENSE COUNSEL]: I'll keep track. (Pause.) (An off-the-record discussion was held between [the prosecutors].)\n\nTHE COURT: Do you know what the hardest thing for a lawyer to say is, Ladies and Gentlemen?\n\n[PROSECUTOR #2]: Just a few questions?\n\nTHE COURT: That's the easiest thing to say. The hardest thing to say is no questions. (Laughter.)\n\n[PROSECUTOR #1]: [Prosecutor #1] narrowed me down, your Honor, so it will go quicker.\n\nTHE COURT: And when they say \"I only have about five questions,\" that means \"I only have about five subjects.\" (Laughter.)\n\n[PROSECUTOR]: Okay. Thank you. No further questions, your Honor. [Defense counsel] would like to talk to you for just a bit.\n\n[DEFENSE COUNSEL]: And if I could have the original exhibit?\n\n[PROSECUTOR]: Yes. I might need to look at those, if you could make sure I've got the right ones. I'll get them back to you, though, because I'm more afraid of you than I am the Judge.\n\nTHE COURT: And justifiably so. (Laughter.)\n\n[DEFENSE COUNSEL]: I know, Judge.\n\n[PROSECUTOR #1]: No further questions. Thank you.\n\n[DEFENSE COUNSEL]: I guess-(Pause.) No, I don't have any questions.\n\nTHE COURT: Thank you, [witness]. You may step down; and you're excused.\n\nTHE WITNESS: Thank you.\n\n[PROSECUTOR #1]: Your Honor, now we would like to take up an issue with the Court out of the presence of the Jury, if we may. (Pause.)\n\nTHE COURT: I was thinking about going back to Maryland and having a boo law base [ sic ]. (Laughter.)\n\n[DEFENSE COUNSEL]: What?\n\n[PROSECUTOR #2]: How about a stone crab in Annapolis? That would be good.\n\nTHE COURT: How long will it take, the rest of the afternoon? You see the clock.\n\n[PROSECUTOR #2]: I don't think it will take long, Judge.\n\nTHE COURT: I have one juror that needs to go Farson. [ sic ]\n\n[PROSECUTOR #2]: They can go.\n\n[DEFENSE COUNSEL]: It's about those other two-that other little piece. I think they're done.\n\nTHE COURT: The last two witnesses?\n\n[PROSECUTOR #2]: Yes, sir.\n\nTHE COURT: Then I will send the Jury home -\n\n[DEFENSE COUNSEL]: Okay.\n\nTHE COURT: -- because I think-we're not going to do that in forty minutes, I don't think. You've been fighting about it now for -\n\n[DEFENSE COUNSEL]: I thought it had been settled. I don't know.\n\nTHE COURT: Well, we will see. I'm going to send them home because depending on what the ruling is, the State is going to rest.\n\n[PROSECUTOR #2]: Well, it depends on what the ruling is, but, yes, sir.\n\nTHE COURT: Yeah. This will be the end of the State's case. I will end-I will determine when the case-blah, blah, blah.\n\n[PROSECUTOR #2]: Yes, sir.\n\nTHE COURT: My ruling will determine whether two more-the information from two more individuals is provided.\n\n[PROSECUTOR #2]: That's correct, your Honor.\n\nTHE COURT: Okay. And then the State will rest?\n\n[PROSECUTOR #2]: That's right.\n\n[PROSECUTOR]: In light of the matters that we've discussed this morning, we're going to ask the Clerk to read something into the record and to you folks [the Jury].\n\nTHE COURT: [Clerk]?\n\n[CLERK]: I'll need the podium. I'll read very slow.\n\n[DEFENSE COUNSEL]: See how you like it.\n\nTHE COURT: They're going to try to make you nervous and embarrass you, [clerk]. Don't let these ladies get away with it. (Laughter.)\n\n[DEFENSE COUNSEL]: Well, let me ask you this. Did you-you reviewed the material?\n\n[WITNESS]: Yes, sir, I did.\n\nQ: And is it fair to say that based-and these were all of the police reports and all of that information that-that had been provided to us?\n\nA: That's correct.\n\nQ: And based upon that, did you-did you find leads that do not appear to have been followed up on and a number of different suspects that that information pointed to?\n\n[PROSECUTOR]: Same objection, your Honor. That's a matter for the-that can be brought out and has been brought out by other witnesses. And it is not subject-it is not the proper subject of expert testimony. In fact, I don't think this is expert testimony.\n\nTHE COURT: What do you think it is?\n\n[PROSECUTOR]: I think-well, I would rather-I have heard nothing that would qualify this particular Witness as an expert, to begin with. I think it's lay testimony. I don't think that it's going to be any more helpful to the Jury. I don't think it's proper opinion testimony. (Pause.)\n\n[DEFENSE COUNSEL]: Your Honor, they have presented the testimony of [another witness] and this is just-(Pause.)\n\n[PROSECUTOR]: Well, Judge, --\n\nTHE COURT: If you're going to stand up and say \"He didn't object and I did,\" sit down.\n\n[PROSECUTOR]: No. I'm-I was going to advance a couple more arguments, but I think the Court probably knows what I'm going to say and I will-I feel I'm kind of on thin ice on making too-making an argument in front of the Jury concerning this material, other than to advance the objections as argued, your Honor. (Long pause.)\n\n[DEFENSE COUNSEL]: 701, Judge. (Pause.) Your Honor, I believe it comes under 702. 701 and 702, both. (Pause.)\n\nTHE COURT: I'll reserve a ruling. Ask a question.\n\n[DEFENSE COUNSEL]: Yes, your Honor.\n\nQ: Did you in your materials review the investigation as it relates to [the victim's ex-boyfriend]?\n\nA: Yes, I did.\n\nQ: Did you review it as it relates to [the roommate's exhusband] and [the roommate's brother]?\n\nA: Yes, I did.\n\nQ: And also [the victim's roommate]?\n\nA: Yes.\n\nQ: And as it relates to, I believe, people that-to any other unknown, possible people?\n\nA: Yes, I did.\n\nQ: And your-you reviewed this material as you would if you had been a-the investigator reviewing all of these reports as they came into you; is that correct?\n\nA: Yes, that is correct.\n\nQ: And you are prepared now to offer testimony as to what you found from the records that were supplied to you from the police, including the-the records of [a police investigator] and the other investigators?\n\nA: Yes.\n\nQ: Okay. Let's talk about some of these individuals then. Let's first talk about [Belden]. What-what did your review and your investigation reveal with regard to [Belden]?\n\n[PROSECUTOR]: Your Honor, --\n\nTHE COURT: Sustained.\n\n[PROSECUTOR]: -- same objection.\n\nTHE COURT: Now, I'm not going to let him open it up-let you open it up to a narrative, [defense counsel]. And I am not going to allow either side to come in and offer expert opinion on the ultimate issue -\n\n[DEFENSE COUNSEL]: I'm not going to ask him that.\n\nTHE COURT: -- to be decided by the Jury in this case.\n\n[DEFENSE COUNSEL]: Your Honor, we are not offering that.\n\n[PROSECUTOR]: Your Honor?\n\n[DEFENSE COUNSEL]: We're not offering that.\n\n[PROSECUTOR]: I have to make the following objection outside the hearing of the Jury. Based on that last question of [defense counsel], I have to talk to the Court either at side bar or in chambers.\n\nTHE COURT: We'll have to send them out because I can't do side bars. I have a hard enough time hearing you people when you're yelling at me. (Laughter.) All right, folks, step out.\n\nTHE COURT: I'm going to see what kind of donnybrook we have. Because, you know, [the defense witness] is going to tell this Jury about [the victim's roommate's ex-husband] having committed assaults and violence in other jurisdictions and there is not one scintilla of evidence before the Jury -\n\n[DEFENSE COUNSEL]: Because you denied us the opportunity to try to present that when we had the witness who could have done it, your Honor. I am sorry.\n\nTHE COURT: Mr.-[defense counsel] -\n\n[DEFENSE COUNSEL]: You told me I couldn't go into that, your Honor.\n\nTHE COURT: [Defense counsel], I have not seen any offers of proof concerning charges against [the roommate's estranged husband] nor convictions of [his]. Now, you know, I am trying to avoid this being an argument between two judges, [defense counsel]. I let you drag me into that before noon. And when I realized that I had walked into a quagmire, I shut up and I backed off because I said to myself, \"Hey, Judge, you just let yourself get into what you said you weren't going to let yourself get into in this case.\" And I said, \"Judge, you just let yourself get drug into the same thing that you've been saying [a prosecutor] got himself drug into.\"\n\nAnd so, [defense counsel] I am not going to get into another argument where it is an ex judge [ sic ] arguing with sitting judge. You do your job as a lawyer and I'll do my job as a judge. And you either make offers of proof, you either submit testimony and evidence or you don't. And if you do, there will either be objections to it or there will not be objections to it. If there is [ sic ] objections, I'll rule on them the best I can. But I don't intend to bump heads with you any more, [defense counsel].\n\n[DEFENSE COUNSEL]: I'm not trying to bump heads with you and I've never asked for any-any quarter and -\n\nTHE COURT: We spent a whole morning because I let myself get drug into this business of two judges arguing. And I'm ashamed of myself. I'm ashamed of myself for letting that happen.\n\nNow, come back to the stand, [witness]. (Pause.) ([Witness] retook the stand.)\n\nTHE COURT: Bring in the Jury.\n\n[DEFENSE COUNSEL]: What about a motive for [the victim's roommate's ex-husband]?\n\n[WITNESS]: My review of the reports would indicate that there is a motive, in my opinion, that [the roommate's exhusband] would have for committing the murder.\n\nQ: What would that motive be?\n\n[PROSECUTOR]: Objection, improper opinion testimony, your Honor, from a lay witness.\n\nTHE COURT: Sustained.\n\nQ: [The roommate's ex-husband] had-never mind.\n\nTHE COURT: You got it, [defense counsel].\n\nQ: Let's go on.\n\nTHE COURT: I think you've got it. That's why I sustained the objection, because I think you're in the position to do what you want to do, [defense counsel].\n\n[DEFENSE COUNSEL]: Thank you, your Honor.\n\n[DEFENSE COUNSEL]: Without specifically going to why, you apparently have come to a conclusion that [the victim's roommate's brother] is a possible suspect?\n\n[WITNESS]: Yes.\n\nQ: What kind-let me ask you this. You had described this crime to me based upon what you'd seen as what kind of a crime? You had a term for it?\n\nA: I'm sorry, I'm -\n\nQ: Okay. Maybe I can't go that way then. [The brother] was in the area, so he had opportunity?\n\nTHE COURT: Motive, [defense counsel].\n\n[DEFENSE COUNSEL]: Yeah.\n\nQ: Well, he had opportunity. Yeah, now was there-do you-based upon your review of everything, do you think he had anything that would give him motive?\n\nA: Yes.\n\n[DEFENSE COUNSEL]: In reviewing that report, in connection with the day that that took place, September 1, does that report indicate when [an alibi witness] said [the victim's ex-boyfriend] was at his trailer at South Pass City?\n\n[PROSECUTOR]: Your Honor, --\n\n[DEFENSE COUNSEL]: You can just answer yes or no.\n\n[PROSECUTOR]: Your Honor, objection.\n\nTHE COURT: Yes or no. [Defense counsel], you're-you know, I think it's obvious to me and the Jury that you want this Witness to tell us what [the alibi witness] said about the date.\n\n[DEFENSE COUNSEL]: Yes.\n\nTHE COURT: And I don't intend to let you do that.\n\n[DEFENSE COUNSEL]: Okay. We'll go someplace else.\n\nQ: But based upon that information, I take it you believe that -\n\nTHE COURT: However-however, [defense counsel], I will allow you to have him testify that he encountered information that caused him to conclude that there was a discrepancy between what [the alibi witness] might say and what [the exboyfriend] has told us.\n\n[DEFENSE COUNSEL]: Okay. That's what I was just going to ask.\n\nTHE COURT: I'll let him go that far, but I will not let him purport to tell this Jury what [the alibi witness] would testify.\n\n[DEFENSE COUNSEL]: Okay.\n\nQ: Now, based upon that information, do you have an opinion-apparently, you have an opinion. Did you hear the Judge's statement? (Laughter.)\n\nA: Yes.\n\nTHE COURT: Just ask him did the Judge summarize it correctly?\n\n[DEFENSE COUNSEL]: Did the Judge summarize it correctly?\n\nA: Sort of. I'm not aware of what the testimony was in the courtroom for the testimony of [the ex-boyfriend], that he, in fact, testified from the report.\n\nQ: All right.\n\nA: I find an inconsistency between what [the ex-boyfriend] said and what [the alibi witness] said.\n\n[DEFENSE COUNSEL]: Now, is-does [the ex-boyfriend] have further opportunity between 9:00 and midnight, in your opinion?\n\n[WITNESS]: Yes.\n\nQ: Please explain that to me.\n\nA: The vehicle was observed at [the ex-boyfriend's] trailer at approximately between 11:30 and 12:00, 12:01. [The exboyfriend] was not. He was not observed or-until the following morning. I believe it was approximately 9:00 in the morning.\n\nQ: Okay.\n\nA: So there is a time period of nine hours that no one saw him.\n\nQ: But if his car is there, how is he going to get back and forth? How is he going to do it?\n\nA: I would be speculating -\n\nQ: Well, you think there is -\n\n[PROSECUTOR]: The Witness just said he was speculating which we've heard a lot of this afternoon from this Witness. I'm glad he's finally identified what he's doing; and I would object to his speculation.\n\n[DEFENSE COUNSEL]: Judge, I object to the objection, the form of the objection.\n\nTHE COURT: Well, the objection is sustained; and your objection to the manner in which the objection was given is sustained.\n\n[DEFENSE COUNSEL]: Thank you.\n\nTHE COURT: You're reminding me of myself, [defense counsel].\n\n[DEFENSE COUNSEL]: All right.\n\nTHE COURT: Blowing off steam.\n\n[PROSECUTOR]: I was. And it was fun.\n\nTHE COURT: All right. (Laughter.)\n\n[DEFENSE COUNSEL]: So we've talked about [the exboyfriend]. Now, let's assume that he was in his car and he's home at midnight. Now, do you have any opinion as to whether or not he still had any opportunity to commit this crime, at least the crime of murder?\n\nA: Yes.\n\nQ: And is there any indication-well, what is that? Tell me that.\n\nA: An analysis of the reports would indicate that there were two parties that placed a red pickup truck at [the exboyfriend's] trailer prior to midnight. It was not there after midnight.\n\nQ: Okay. Now, what about-is [the ex-boyfriend's] whereabouts accounted for between midnight, if he had driven home, and the next morning?\n\nA: No independent corroboration, just his statement that he went home and went to sleep.\n\nQ: Now, there was some DNA tests taken of the fingernails of the decedent and I believe you were not shown those tests until just recently?\n\nA: That's correct.\n\nQ: Do you attach any significance to that?\n\nA: I do.\n\nQ: What is that significant of?\n\nA: The result indicated that under-or in the scrapings of the right fingernails of the victim, there's DNA comparison that matches to [the ex-boyfriend].\n\nQ: Or they said they couldn't rule him out?\n\nA: That is correct.\n\nQ: Now, you are aware that there is no DNA-or they did the same DNA analysis of those fingernails to include [Belden] but he was excluded?\n\nA: That's -\n\nQ: Are you aware of that?\n\nA: That's what the report stated, yes.\n\nQ: Now, as an investigator, with your kind of experience, if you had a witness who was telling the truth when they say somebody was scratched, would you expect that you might find any evidence as a result of that scratching -\n\nA: Yes.\n\nQ: -- based upon what you've learned in this case? I mean, the DNA was found?\n\nA: Okay.\n\nQ: Okay. Excuse me.\n\nA: I'm not sure I understand the question or whether there were two questions there.\n\nQ: Yeah.\n\nTHE COURT: Well, answer them both.\n\nTHE WITNESS: Okay. Thank you, your Honor. (Laughter.) My experience would indicate to me that -\n\nTHE COURT: I'm sorry. I couldn't resist.\n\n[DEFENSE COUNSEL]: I deserved it, every bit of it. That was a terrible question.\n\n[PROSECUTOR]: And I want to object to both of them.\n\nTHE COURT: Okay. The objection to both is sustained. Now, let's start over again.\n\n[PROSECUTOR]: All right. It looks to me like before you left the Lincoln Police Department, you were what we refer to in my office as a sharp pencil. Have you ever heard that phrase?\n\n[WITNESS]: In reference to a trooper, I have, but not to an attorney.\n\nQ: A supervisor. You were a supervisor, correct?\n\nA: I was.\n\nQ: And your job was basically to make sure that people stayed within budget. You were to liaison with the press. You were to serve as a guest speaker at various things. Oh, you were to make sure that those University of Nebraska athletes knew if they really got out of line, they might end up in jail, and that sort of thing; is that correct?\n\nA: Yes, sir-no, sir.\n\nQ: Oh, then let's read your vitae. We'll go on. Perhaps you misrepresent it -\n\n[DEFENSE COUNSEL]: Your Honor, -- your Honor, I would offer his curriculum vitae as an exhibit.\n\n[PROSECUTOR]: And also ask, your Honor, the Witness wanted to get in a little crack and that's fine, but we'll get along-he and I will get along a lot better if we can keep that to a minimum.\n\nTHE COURT: Both of you -\n\n[PROSECUTOR]: I'll promise not to yell if you promise not to put in the cracks.\n\nTHE COURT: And you'll all get along better with me if neither one of you do either one of those things. All right?\n\nTHE WITNESS: Yes, sir.\n\nTHE COURT: I have lost my control once today and I don't want to do it again.\n\n[PROSECUTOR]: That's fine, Judge.\n\nTHE COURT: Okay.\n\n[PROSECUTOR]: Okay. Now, you said you look for two things when you're solving a crime, motive and opportunity; is that correct?\n\n[WITNESS]: I believe I said that those are two of the things that I'm looking for. There are other things.\n\nQ: Sure. Like means-means, motive, opportunity, isn't that what they always teach you fellows? Or maybe not you, but law enforcement, in general, in looking at a criminal -\n\n[DEFENSE COUNSEL]: Your Honor, I object. That's a snide underhanded, you know, editorial comment that is improper.\n\n[PROSECUTOR]: And I object to the objection, your Honor. It -\n\n[DEFENSE COUNSEL]: It's an improper question.\n\n[PROSECUTOR]: Up to this point, your Honor, I've tried to keep in check how-any comments about [defense counsel] and his editorializing but at this point, I object to the objection and leave it at that.\n\nTHE COURT: Well, it wasn't underhanded, but it was snide. It was right out front. So the objection to the form of your question and the manner of your question is sustained. And I won't sustain your objection to [defense counsel's] objection.\n\nOkay. Now, let's take a recess. It's time for a recess for all of us because, you know, between [defense counsel], me and you, [prosecutor], it becomes the pot and kettle and-I don't know what I am. I'm maybe in the thunder mode. I don't know. But the pot, the kettle and-and the tea pot.\n\n[DEFENSE COUNSEL]: Your Honor, --\n\nTHE COURT: And it's time for us to just take a break.\n\n[DEFENSE COUNSEL]: Your Honor, the only thing I would say is this Witness has been delayed two extra days from what he anticipated and I need to get him going as quickly as I can.\n\nTHE COURT: [Defense counsel], look behind you at the clock. We've been here since 1:00 and it's almost 3:00. And I think you would like a break, too, wouldn't you, [witness]?\n\nTHE WITNESS: That's fine, your Honor.\n\nTHE COURT: Fifteen minutes, Ladies and Gentlemen.\n\n[PROSECUTOR]: Good. You and I are both tongue-tied. We are both like George Bush. We massacre those syllables.\n\nWhat does that mean?\n\n[WITNESS]: She had a bruise on her head.\n\nQ: You're aware that Dr. Allen testified that that wound was sufficient to have debilitated her?\n\nA: I was not here. I -\n\n[DEFENSE COUNSEL]: Your Honor, I'm going to object to that question because it mistakes [ sic ] the testimony. He said it might, not that it did. It could.\n\nTHE COURT: I will not settle the dispute about what the pathologist said. The jury will resolve that. If your objection is the form of the question, --\n\n[DEFENSE COUNSEL]: Misstates the evidence is my objection, your Honor.\n\nTHE COURT: Then I will not rule on it.\n\n[DEFENSE COUNSEL]: That's fine, your Honor, but that's my objection.\n\n[PROSECUTOR]: How about [the roommate's brother]? Is he mentioned in [the victim's] diary, ever?\n\n[WITNESS]: Oh, I don't recall that, [the brother] being mentioned in the diary.\n\nQ: Is there any indication that-you made some-some insinuation concerning illegal activities, that [the roommate] would have-or [the roommate] would have a motive based upon some sort of illegal activities that were going on?\n\nTHE COURT: Now, --\n\nA: Yes, --\n\nTHE COURT: Now, Counsel, --\n\n[DEFENSE COUNSEL]: He asked the question. I think we're entitled to an answer.\n\nTHE COURT: Just wait. I don't need your help, [defense counsel]. I don't need your help. When I need your help, I'll ask for it.\n\n[DEFENSE COUNSEL]: Yes, sir, but I don't think that -\n\nTHE COURT: I don't need your help, [defense counsel]. You sit there and I'll hear you at the proper time.\n\n[DEFENSE COUNSEL]: Okay, your Honor, just as long as I get to say my piece.\n\nTHE COURT: Now, I don't know which [the roommate or her brother] you are talking about.\n\n[PROSECUTOR]: I misspoke and I tried to correct myself. [The roommate].\n\nQ: Okay. The -\n\nTHE COURT: Now, [defense counsel]?\n\n[DEFENSE COUNSEL]: Your Honor, I think he can answer the question that's been asked.\n\nTHE COURT: Well, he can answer the question as soon as I can identify who [the prosecutor] is talking about, --\n\n[DEFENSE COUNSEL]: Okay. I'm sorry that you were -\n\nTHE COURT: -- in fairness to the witness. [Defense counsel], you just be a lawyer.\n\n[DEFENSE COUNSEL]: I'm sorry, your Honor. I -\n\nTHE COURT: And you don't try to do my job any more, [defense counsel].\n\n[DEFENSE COUNSEL]: I'm trying to do my job.\n\nTHE COURT: You're trying to tell me what to do and I've had enough of it.\n\n[DEFENSE COUNSEL]: I'm sorry you perceive it that way, your Honor. That's not what I'm trying to do.\n\nTHE COURT: Now, clean up your question, [Prosecutor].\n\n[DEFENSE COUNSEL]: Just one question-two questions following that up. And I think you tried to answer this. Is there any evidence that indicates that-I mean, you said there had to be an encounter because at least we know that [Belden] and [the victim] had sex?\n\n[WITNESS]: Correct.\n\nQ: Correct. There's no evidence as to when that sex took place, is there?\n\nA: Not that I found, no.\n\nQ: And it is possible, I guess, that they could have had seX before 8:00 o'clock?\n\nA: Yes.\n\nQ: It is possible that they could have had sex after 8:00 o'clock?\n\nA: Yes.\n\nQ: It is possible they could have had sex any time on the 28th or 29th-up until they found her dead body, correct? I mean, to be fair?\n\nA: Yes, sir.\n\nQ: And it's also possible and it's-there's nothing in the records that indicate that the sex took place at the time that the murder took place, is there?\n\nA: No, sir.\n\n[PROSECUTOR]: Objection, your Honor.\n\n[DEFENSE COUNSEL]: Thank you.\n\nTHE COURT: Enough, enough, enough, enough. The Jury knows. It's been gone over and over and the Jury has heard it. It's now in the hands of the Jury to decide.\n\n[DEFENSE COUNSEL #1]: What other kinds of things do you see that cause that type of injury?\n\n[WITNESS]: Well, we've discussed, unfortunately, physicians cause that. For anybody who has ever had an initial pap smear, you have to have-use the speculum and we, from time to time, will cause injury to the-to the vaginal side walls, to the perineal body. Consensual sex, vigorous sex, is very-very consistent with trauma, abrasions, lacerations. And probably the thing that I see the most is infections.\n\n([Prosecutor #1] began coughing and left the courtroom.)\n\n[DEFENSE COUNSEL #2]: Do we need to hold up a second?\n\n[PROSECUTOR #2]: Could we hold up just a moment while [prosecutor #1] goes and recovers from whatever happened to him? It wasn't as serious as it might be. It should be brief.\n\n([Prosecutor #1] entered the courtroom.)\n\n[PROSECUTOR #1]: Now, I'm embarrassed, your Honor.\n\n[DEFENSE COUNSEL #1]: It's all this sex talk.\n\n[PROSECUTOR #1]: It's that alkaline water.\n\n[PROSECUTOR #2]: He's got six kids. I don't think it's the subject.\n\n[DEFENSE COUNSEL #1]: That's what scares him.\n\nTHE COURT: Talk about vigorous sex and [prosecutor #1] fled the courtroom. (Laughter.)\n\n[DEFENSE COUNSEL #1]: Well, now I'm lost. (Laughter.) Let's see.\n\nTHE COURT: We've got to stop and be serious, folks. I'm sorry I did that.\n\n[DEFENSE COUNSEL]: No, you're not. (Laughter.)\n\nTHE COURT: All right. Now, let's get back. This is serious business.\n\nTHE COURT: Okay. Do you want to try to do a witness in twenty minutes or do you want to go home? This is going to send the case into Tuesday, Ladies and Gentlemen.\n\n[DEFENSE COUNSEL]: Your Honor, I have to go all the way back to Cheyenne. And if I can leave now, I-you know, but I don't want to take up any more time with this Jury and I'll stay here. You know, Judge, I never-when I started practicing law, we tried these cases until midnight and we started out the next morning at 6:00 o'clock, so I'm ready to go.\n\nTHE COURT: If that's the Jury's pleasure and yours, I'll do it, otherwise I would like to go home. And I think these jurors ought to hang me if I did that to them. (Laughter.)\n\n[DEFENSE COUNSEL]: Well, I wanted to hang that judge, too.\n\nTHE COURT: I think it's time for us to go home. We've had really a tough day, Gentlemen. At least I have. It's time for us to quit and it's time for us to send these good folks home to their families.\n\n[DEFENSE COUNSEL]: Thank you, your Honor.\n\nTHE COURT: Because we're going to impose upon them next week as well. And, folks, I'm sorry about that. But this is an important case and it's a serious case. It's one that deserves all the attention that-that it requires. And you shouldn't be trying to take short cuts with it. And, you know, the most admirable thing about this whole case has been you folks. You know, my behavior isn't anything which you can-you would want to throw a stick at. Maybe you would want -\n\n[JUROR]: We've heard about you before. We came prepared. (Laughter.)\n\nTHE COURT: Yeah. It's been a little bit touch and go here. And so has [the prosecutor] and so has [the defense counsel]. And we've been the three principal culprits in the case. But, you know, you folks have just been superb. Your attention has never wavered. You are bright and you have been interested and you know what? You've been good natured. You really have. I sure as hell haven't. (Laughter.)\n\nTHE COURT: Yeah, I do. (Laughter.) You can-you can talk to-you can talk to other judges if they happen to be available, but, you know, I'm the only district judge. And, you know, I don't talk to very many judges, so it's one of those things that you do alone. And you folks can only do it with the other folks that are on the jury.\n\nAnything I should take up with them that I haven't talked about, Counsel? [Prosecutor #2], you're the only one paying attention to me.\n\n[PROSECUTOR #2]: No, we were all-(Laughter.)\n\n[PROSECUTOR #1]: We were rapt with attention. And, no, there's nothing else that we need to talk about.\n\n[DEFENSE COUNSEL]: Bullshit.\n\nTHE COURT: [Defense counsel's] packing his bag for a fast retreat.\n\n[DEFENSE COUNSEL]: I'm honest, Judge. I was-I was not listening to you, but then that's the difference between me and [Prosecutor #1].\n\n[PROSECUTOR #1]: Oh, --\n\n[DEFENSE COUNSEL]: I finally got back at him. Sorry. That's-that's just a little -\n\nTHE COURT: We can yell and scream at each other as lawyers and be madder than hell at each other and say harsh and mean things to each other, but that's just only for the minute. That doesn't mean anything. That's just kind of the heat of the battle sort of things.\n\nOld Ed Herschler and I would go round and round and round and when it was all done, he would say, \"Come on, kid. I'll buy you a drink.\" Oh, hell.\n\nAll right. We'll see you 9:00 o'clock tomorrow morning.\n\n[DEFENSE COUNSEL]: That's what you wrote?\n\n[PROSECUTOR]: Asked and answered.\n\nTHE COURT: You sit. You sit. I've had enough of this. Next question.\n\n[DEFENSE COUNSEL]: Thank you, your Honor.\n\nTHE COURT: We're not going to have two lawyers arguing. I've had an ex-judge and me arguing and that wasn't any good.\n\nTHE COURT: Thank you, [prosecutor].\n\n[DEFENSE COUNSEL]: May I have that report?\n\n[PROSECUTOR]: You've got it.\n\n[DEFENSE COUNSEL]: No. I don't have a copy.\n\n[PROSECUTOR]: Well, you-you have may it. [ sic ]\n\n[DEFENSE COUNSEL]: I can't find it.\n\nTHE COURT: You may step down, [witness], while they're arguing with each other.\n\n[DEFENSE COUNSEL]: Well, I don't have this one because it was 10/2. Can we just make a copy of that? (Pause.) Your Honor, at this time, what I would like to do is to set up and play the videotape deposition and then we have one other witness, but we'll do him last.\n\nTHE COURT: All right. Fine. Set it up. We'll just sit here and wait.\n\n[PROSECUTOR]: Okay. Now, in regards to the injuries that-or the absence of injuries that you describe around the genital area of [the victim], it's true, isn't it, Doctor, that if [the victim] had been rendered either unconscious or debilitated in a serious-substantial fashion, she would not be able to struggle and it's quite likely that injuries to that area might not have occurred?\n\n[WITNESS]: I disagree with that.\n\nQ: So every rape that you've always seen, there's always significant bruising to the inner thighs and the vaginal area?\n\nA: Typically, commonly, --\n\nQ: No, that's-the question was every rape. Now, Doctor, you like to go on and I know you want to earn your $1,200, but, please, Doctor -\n\nA: Sir, I'm-I'm really offended by that.\n\nQ: Just, please, answer my questions.\n\nA: I'm really offended by that.\n\nQ: Well, that's irrelevant -\n\nA: I'm here to answer -\n\n[PROSECUTOR]: I ask that the Witness be instructed to answer the questions that I'm asking.\n\n[DEFENSE COUNSEL #1]: Objection, your Honor. He's just arguing. Just ask the question.\n\nTHE COURT: It's time to stop. If you two want to get acquainted and begin to learn how to talk to each other in a proper fashion in the courtroom, I know a place I can put you so you can get acquainted.\n\nNow, Doctor, you are a witness, not an advocate.\n\n[DEFENSE COUNSEL #2]: I'm going to object, your Honor.\n\nTHE COURT: You will answer the questions. If he calls for a yes or no question-answer from you, you will answer yes; you will answer no; or you will give us some version of \"I cannot answer that question yes or no,\" but you will not volunteer.\n\nNow, [prosecutor] you know the difference between asking questions and arguing with the witness. The two of you are engaged in argument. You are not engaged in questions and answers. I won't permit it from you, [prosecutor].\n\n[PROSECUTOR]: Yes, sir.\n\nTHE COURT: You know better.\n\n[PROSECUTOR]: Yes, sir.\n\nTHE COURT: And I think, Doctor, that you've testified before and you know the rules and so I'm going to hold you to those rules. Do you understand, sir?\n\nTHE WITNESS: Yes, sir.\n\nTHE COURT: Now, proceed.\n\n[PROSECUTOR]: So, Doctor, let me get this right. In your opinion-well, let me put it this way. Since you're an expert, I'll give you a hypothetical. You come upon a young woman thirty years of age in a trailer. We're down in-what county is San Antonio in?\n\n[WITNESS]: Bexar County.\n\nQ: Bexar County. So down in Bexar County, San Antonio, you come across a young woman in a trailer. She's got fabric around her neck. Fluid seeping out of her nose and her mouth. She's sustained a blow to the top of her head. She's got a cheek that's all swollen up on the left side. She's spread out on the living room of her-of her trailer with her legs spread. She's got semen at the entrance to her vagina and deep within her vagina. And I take it from your testimony today, Doctor, that you would tell the good deputy sheriffs of Bexar County, \"Thank God, boys, we don't have a rape here?\"\n\nA: No, I wouldn't tell them that without having all of the information processed and without finding out more about the circumstances around the death, including people that are being considered as suspects. This is nothing that you rush into and make a judgment after three or four weeks and-and say that there's a sexual assault based on one small injury that can occur after other kinds of trauma.\n\nQ: Doctor, that wasn't the hypothetical I gave you; and I didn't ask you to focus in on one small piece of evidence, did I?\n\nA: No, but you -\n\nQ: You have to take the whole-the whole scene into consideration?\n\nA: And then you have to do all the other things that I've said.\n\nQ: And that's what Dr. Allen did in this case, isn't it?\n\nA: That's-that's true. That's -\n\n[PROSECUTOR]: Thank you very much. I have no further questions of this Witness. (Pause.)\n\n[DEFENSE COUNSEL]: I'm not asking the questions.\n\nTHE COURT: Dr. Bux, I think they're through dinging at you.\n\nTHE WITNESS: Thank you, Judge.\n\nTHE COURT: Thank you for coming. I hope you enjoyed your trip up here.\n\n[DEFENSE COUNSEL]: And he told you that he'd been driving around there, trying to wait for her to get there, correct?\n\n[WITNESS]: Yes, sir.\n\nQ: And he told you at that time-I wanted to try to put this in order but you're-you know, since you have some question about when he was there, I've had to kind of go around here.\n\n[PROSECUTOR]: Objection, your Honor, to the argumentative -\n\n[DEFENSE COUNSEL]: I'm trying -\n\n[PROSECUTOR]: If he could just stick to a question and answer format rather than having [defense counsel] give argument, I guess, for lack of a better phrase.\n\nTHE COURT: Ask a question. The whole commentary is a waste of the Jury's and my time.\n\n[DEFENSE COUNSEL]: And then you ask him-(Pause.) \"And, anyway, you drove around until\"-and what was his answer?\n\n[WITNESS]: I don't recall.\n\nQ: Well, here it is, right there.\n\nA: \"At least until sun up.\"\n\nQ: And then what was the next statement?\n\nA: I asked him \"Which would have probably\"-and he said, \"About 5:00 or 6:00.\"\n\nQ: So he'd been out, driving around, going by, trying to find his sister who was living at [the victim's] trailer and we know he's driving around from at least 2:00 o'clock -\n\nTHE COURT: Ask a question, [defense counsel], or you're going to get an objection.\n\nQ: Okay.\n\n[DEFENSE COUNSEL]: You would tell me that you think the investigation that you did and the follow-ups that you did with regard to [the victim's ex-boyfriend], [the roommate's exhusband] and everybody else was a good, thorough investigation?\n\n[WITNESS]: Yes, sir, as a whole.\n\nQ: As a whole. Although you can't give us any specific reasons why you excluded these people, you just did it because your investigative sense told you to, is that what you're telling me?\n\nA: No, sir. I could give you several reasons.\n\nQ: Start.\n\nA: Pardon?\n\nQ: Start.\n\n[PROSECUTOR]: Objection to the tone of [defense counsel's] voice. He's becoming argumentative.\n\n[DEFENSE COUNSEL]: I apologize -- I apologize to you, [witness]. I really do. I really apologize to you.\n\nTHE COURT: Look at the clock, [defense counsel]. (Pause.) I would like to finish the Witness before we take the noon recess.\n\n[DEFENSE COUNSEL]: I will. (Pause.) I think all of it's argument, so I will-I have no further questions.\n\nTHE COURT: [Prosecutor], do you have anything more?\n\n[PROSECUTOR]: Yes, your Honor. In regards to -\n\nTHE COURT: I roll my eyes at you, [prosecutor]. Did you see me?\n\n[PROSECUTOR]: I looked at you, Judge; and I am going to risk incurring your wrath by asking a few questions, but just a few.\n\nWhile we certainly wish that the trial court could have been more circumspect, we discern no error that would support a reversal of the jury's judgment. The foregoing comments do not evince any bias on the part of the trial court in favor of one side or the other. The court's attempt to relieve tension through humor was, at worst, ill advised, but it either was not prejudicial at all, or not so prejudicial as to impair Belden's right to a fair trial. The court's comments were directed either at itself or towards counsel of both parties. It must be stressed that counsel for Belden and the State actively engaged in banter with the trial court without ever questioning the propriety of the attempts at humor. Attempts at humor or levity that were directed at or referenced a criminal defendant would certainly raise serious concerns implicating the fairness of a trial. However, none of the comments made by the judge or counsel in this case were of that nature.\n\n¶24 While one could characterize the court's comments admonishing counsel as intemperate or unwise, we do not find them to have been necessarily prejudicial, or so prejudicial to defendant, as to deprive him of a fair trial. The court directed its comments equally at counsel for both sides. It is difficult to discern the atmosphere of a trial or how the jury perceived the proceedings from the sterile, black and white transcript. It is telling, however, that the party in the best position-Belden's defense counsel-never gave indication that they believed the court's comments were motivated by bias or had the effect of prejudicing Belden. There was no objection, request for an in camera hearing, or motion for a new trial based upon the court's comments. In short, there is no evidence in the transcript or in the record that the court's comments admonishing counsel for their conduct caused prejudice and deprived Belden of a fair trial.\n\n¶25 This case spanned seven days of trial from October 9 through October 17, 2000, generated 1,390 pages of transcript, and almost 1,000 pages of record. Belden and the State were represented by highly competent counsel who zealously advocated on behalf their clients. Both sides vigorously presented their positions to the jury. The various quotations taken from the record transcript in this case appear lengthy in this format but in the context of the proceedings below they are but a miniscule portion. After a careful review of the entire record, we are convinced that there was no prejudice to Belden from the comments made by the district court to the extent that he was deprived of his right to a fair trial.\n\nII. Uncharged Misconduct Evidence\n\n¶26 The State sought admission of evidence that Belden had been accused on two previous occasions of rape under W.R.E. 404(b). The district court allowed the evidence to go before the jury in the form of a statement read by the clerk of court:\n\nThe following information is admitted for a limited purpose and relevant to the charge of first degree murder: The purpose is to show that [Belden] may have a had a motive or reason for killing [the victim]. You shall not consider this information for any other purpose or purposes.\n\nIn August, 1976, the Defendant met [woman #1]... Approximately, one week after they became roommates, Defendant and [woman #1] engaged in sexual intercourse. [Woman #1] accused the Defendant of rape. [Belden] was charged with the commission of a crime, but he was not convicted of sexual assault.\n\nIn June 1984, the Defendant met [woman #2] and they agreed to have a dinner date. On the night of the date, the Defendant and [woman #2] engaged in sexual intercourse. [Woman #2] accused the Defendant of rape. [Belden] was charged with the commission of a crime, but he was not convicted of sexual assault.\n\nAt the conclusion of the case, the district court included the following instruction to the jury:\n\nThe information relative to [woman #1] and [woman #2] was admitted for a limited purpose relevant to the charge of first degree murder: The purpose was to show that [Belden] may have had a motive or reason for killing [the victim]. You shall not consider this testimony for any other purpose, or purposes.\n\nIn addition, by allowing the information to be admitted, the Court does not pass on the weight to be afforded the information, if any, or whether the information proves or fails to prove the purpose for which the information was received; those are matters for you to decide.\n\nThe evidence was admitted over the objection of Belden. On appeal, Belden contends that the district court abused its discretion because the evidence was irrelevant, overly prejudicial, and denied him his Constitutional right to confront adverse witnesses.\n\nA. Standard of Review\n\n¶27 Our review of rulings by a trial court, admitting or excluding evidence, is premised upon deference to the trial court, and we do not reverse a case because of evidentiary rulings unless an abuse of discretion is demonstrated. Horton v. State, 764 P.2d 674, 676-77 (Wyo. 1988). \"Judicial discretion is a composite of many things, among which are conclusions drawn from objective criteria; it means a sound judgment exercised with regard to what is right under the circumstances and without doing so arbitrarily or capriciously.\" Vaughn v. State, 962 P.2d 149, 151 (Wyo. 1998).\n\nO'Brien v. State, 2002 WY 63, ¶ 27, 45 P.3d 225, 234 (Wyo. 2002).\n\nB. Discussion\n\n¶28 The State's theory of the case was that Belden had a motive to kill the victim because he had been accused in the past of rape after engaging in sexual intercourse with other women. The motive to kill was his desire to prevent another accusation of rape. The district court admitted the evidence, as noted above, but specifically limited it to the question of Belden's motive to kill the victim.\n\n¶29 Belden attacks the admission of this evidence by claiming that motive is irrelevant to a charge of felony murder, which is predicated on the first-degree sexual assault charge. Belden insists that the use of the evidence to show motive \"was a sham of an excuse to introduce prejudicial propensity evidence.\" In support of this claim, Belden contends that the prosecution made a propensity argument during its closing:\n\nAnd, finally, two and a half years later when they finally track him down, what does he say? He denies any involvement with [the victim]. He says, \"Oh, I was at that house once or twice. Once-I didn't go inside the house. No, I wasn't involved with those people. I wasn't involved with those people.\" That's what he says. Subsequently, blood is obtained from him and we discover that the chances are one in 700 billion that that semen is somebody else's.\n\nThere's evidence from the victim in this case that shows she knew the Defendant briefly and in passing, but the evidence shows they're not involved in any way, shape or form. They have no relationship whatsoever. And, finally, the evidence shows that in the past, the Defendant had had sexual intercourse with women and been accused of rape. It is our contention, Ladies and Gentlemen, that these facts point out one inescapable conclusion, that the Defendant sexually assaulted and murdered [the victim]. [Emphasis supplied by Belden.]\n\nBelden insists that this is a blatant propensity argument especially in light of the fact that the State did not link the evidence to a motive to kill until later in the closing. In his final attack, Belden contends that the court erred by introducing the evidence through the written statement read to the jury. If the trial court believed that the evidence was too prejudicial to allow the women to testify, then Belden argues it was too prejudicial to be admitted in any form. Belden also claims that the admission of the evidence through the statement read to the jury deprived him of his Sixth Amendment right to confrontation.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n¶30 Procedurally, the possibility that the State might offer evidence related to previous accusations of sexual assault against Belden was disclosed through a court filing by the State detailing the evidence it would offer in a trial. A hearing was scheduled, and the State filed a memorandum in support of its position. A hearing was held on August 28, 2000. It is very important to note that the two women who brought the accusations against Belden appeared at that hearing and gave testimony under oath regarding the specifics of the alleged incidents at that hearing. The State followed up the hearing with a detailed brief defending admission of the evidence. Belden responded with a brief opposing the State's evidence.\n\n¶31 The district court considered the issue up until the conclusion of the State's presentation of its trial case. At that time, the district court reviewed the parties' arguments and very carefully considered whether or not to admit this evidence balancing its probative value against the potential for prejudice within the context of the factors we set out in Vigil v. State, 926 P.2d 351 (Wyo. 1996). In making its ruling, the court set out in detail its reasoning:\n\nNow, the testimony of [the two women] that was given to this Court, clearly in its-in the allegations of prior rapes, direct attention to and reflect upon the character of [Belden]. And by Rule 404(b), that testimony is rendered inadmissible unless those prior allegations of rape are relevant for some other purpose than reflecting or showing the character of [Belden].\n\nNow, the State has claimed many purposes or reasons why it should be relevant, but all of those reasons have been rejected by the Court except one and that is motive. The State claims that the allegations [by the two women] are relevant and, therefore, admissible for the purpose of showing that the Defendant had a motive for killing [the victim]. It is not whether he committed the act of rape of these two ladies, or not, which the State believes is important. Instead, it is the accusation and the subsequent prose-unsuccessful prosecution for sexual assault which the State believes is important. It is the accusation and the prosecution, the unsuccessful prosecution which the State believes supplies the motive. It is not whether the rape occurred or whether it didn't occur. (Pause.)\n\nIn short, the State wants to argue to the Jury that once having consensual sexual intercourse with [one of the women] and then being accused of rape and tried and unsuccessfully-not tried unsuccessfully for that crime, that gave [Belden] a reason or motive for silencing [the victim] after consensual seX by killing her.\n\nNow, I raised and the Defense now argues to the Court that motive to kill is not relevant -not relevant. It is not relevant to either first degree sexual assault or first degree sexual assault felony murder. The idea advanced by the Defense is that motive to kill or motive for killing is an explanation of why someone might have intended to kill another person, but it is not an explanation of why someone might have intended to sexually assault someone. In short, the Defense argues that the motive alleged by the State goes to intent, the intent to kill. The State-the Defense argues that intent to kill is not an element of first degree sexual assault felony murder and, therefore, intent to kill is not a part of this case. In other words, the alleged motive is irrelevant in this case.\n\nNow, [defense counsel], I have to disagree and I do disagree. And, [Belden], I take no joy in it. The State of Wyoming, through its legislature, has defined what constitutes first degree murder and it has given us a whole list of acts that constitute first degree murder. Among the kinds of conduct that the legislature has said constitutes first degree murder are the crime of sexual assault felony murder and first degree premeditated murder. In the case of first degree premeditated murder, the State of Wyoming has said that there must be premeditation and intent and that it must be proved by proof beyond a reasonable doubt by the State if the charge is first degree premeditated murder.\n\nBut, on the other hand, the legislature has said \"We will relieve the State of the burden of proving intent or premeditation if it's sexual assault felony murder.\" In short, the State-the Wyoming Legislature has said that killings that occur in the perpetration of sexual assaults are so destructive to the fabric of our society that we will just make it the most severe crime on our books. And we will legislate and decree that all that the State needs to prove in sexual assault felony murder is that the sexual assault occurred and the victim was killed in the perpetration of that assault. In other words, your burden of proof is different, Mr. Prosecutors. But just because the burden and elements of proof are different for sexual assault felony murder does not mean that intent to kill is not a part of the crime alleged. It does not mean that intent to kill is not a part of the incident that occurred. It just means that the State doesn't have to prove it. When a person is killed in the perpetration of a sexual assault, the killing is either accidental or it is intentional.\n\nWhat's an example of an accidental killing? The victim momentarily fights off her attacker and attempts to flee, trips and falls, strikes her head and dies.\n\nFirst degree murder, if the killing is accidental, motive relative to the intent to kill would not be relevant. On the other hand, if the killing was intentional and, in other words, not accidental, rather, it was intentional, motive or reason to kill is relevant. It flat is relevant. It is part of the picture. It may not have to be proved intent or motive, but it is part of the picture. It is part of the story. At least from the standpoint of the State, it is.\n\n[The court goes on to review the evidence, which shows that this was not an accidental death.]\n\nIn summation, the Court concludes that the motive of [Belden] to kill is a relevant issue to be placed before the Jury, with the Jury to determine whether or not the alleged motive makes sense or whether it makes no sense at all; and for the Jury to determine whether or not it will accept or reject the motive and the arguments of the State.\n\nThe district court correctly concluded that motive, while not an element of felony murder, could still be relevant.\n\nAlthough... proof of motive is ordinarily not essential, evidence tending to show motive is always relevant and admissible, particularly in cases of circumstantial evidence, or where the intent of accused is at issue, or accused denies the commission of the crime, unless its probative value is substantially outweighed by the risk of prejudice from its admission.\n\nEvidence tending to show the absence of motive is likewise relevant and admissible....\n\nThe admission of evidence with respect to motive is within the discretion of the court. Wide latitude in the admission of evidence of motive is permissible, particularly in cases where a corrupt motive or fraudulent intent is an important element of the crime charged.\n\n22A C.J.S. Criminal Law § 726 (1989 and 2001 Supp.) (citations omitted). Motive is especially relevant in this case because Belden admitted to being present at the victim's residence during the timeframe wherein the crime occurred but denied perpetrating the crime. Other jurisdictions have allowed evidence of motive in felony murder cases. See People v. Wells, 302 N.W.2d 196, 200 (Mich.App. 1980); Jackson v. State, 590 A.2d 177, 183 (Md.App. 1991); Williamson v. State, 590 S.W.2d 847, 849 (Ark. 1979); and Fry v. State, 748 N.E.2d 369, 372 (Ind. 2001). As one court has framed it:\n\nOrdinarily, evidence tending to support a theory of the case being tried is admissible. See State v. McElrath, 322 N.C. 1, 366 S.E.2d 442 (1988). In the present case, the State was not required to prove a motive for the murder of the victim. \"The existence of a motive is, however, a circumstance tending to make it more probable that the person in question did the act, hence evidence of motive is always admissible where the doing of the act is in dispute.\" 1 Brandis on North Carolina Evidence § 83 (3d ed. 1988).\n\nState v. Coffey, 389 S.E.2d 48, 55 (N.C. 1990). Belden denied killing the victim. Accordingly, evidence relating to a motive for Belden to kill the victim was certainly relevant.\n\n¶32 Belden also claims that the evidence should not have been admitted because it was too prejudicial. The trial court analyzed the proposed evidence in light of the Vigil factors, which include the balancing test set out in W.R.E. 403. Obviously, evidence probative to the State's case will have a prejudicial effect on Belden. After its analysis, the court concluded that the probative value outweighed the prejudicial effect. The court determined that the State's need to show motive for a crime that Belden denied committing outweighed the prejudicial effect of that evidence on him. We conclude that the trial court did not abuse its discretion.\n\n¶33 Belden complained that the State used the evidence not to show motive but to establish a propensity on his part to commit sexual assault crimes. We evaluate claims of prosecutorial misconduct for plain error if there was no objection. Trujillo v. State, 2002 WY 51, ¶4, 44 P.3d 22, ¶4 (Wyo. 2002). There was no objection to the prosecutor's statements during closing noted above. To show plain error, Belden needs to demonstrate \"the violation of a clear and unequivocal rule of law, clearly reflected in the record, resulting in the abridgment of a substantial right of the party to his material prejudice.\" Id. (citing Arevalo v. State, 939 P.2d 228, 232 (Wyo. 1997)).\n\n¶34 At the commencement of his closing argument, the prosecutor quickly summarized the evidence produced during trial. At the conclusion of that summary, the prosecutor made the statement with which Belden finds fault: \"It is our contention, Ladies and Gentlemen, that these facts point out one inescapable conclusion, that the Defendant sexually assaulted and murdered [the victim].\" Belden highlights the phrase \"sexually assaulted\" and contends that the prosecutor was using the prior allegations of sexual misconduct to support an argument that he had a propensity to sexually assault women.\n\nThis is a mischaracterization of the prosecutor's statement. Read in context, the prosecutor is referring not to the prior sexual assault accusations but to all of the other facts he had listed. It is reasonable to interpret the statement so that the reference to the prior sexual assault accusations refers to the phrase \"and murdered [the victim].\" While not worded elegantly, the prosecutor's statement is not an argument based on propensity. Belden has failed to show plain error.\n\n¶35 Finally, Belden has claimed that the admission of the evidence of the prior sexual assault accusations through a written statement read by the clerk of court violated his Sixth Amendment right to confrontation. Again, Belden did not object, so a plain error analysis applies. A defendant may waive his Sixth Amendment right to confrontation:\n\nWe recognize that examination of the circumstances of each case is essential when considering any waiver of constitutional rights because \"[v]ariations in the factual context giving rise to the issue of waiver of any one right of the accused are infinite.\"... (citation omitted). We also recognize that we must accord proper weight to the role of defense counsel in fashioning an overall trial strategy, including one involving waiver of the right to confrontation, for the defendant's best advantage.... (citation omitted). A well developed body of case law protects defendants from constitutionally defective actions of their attorneys. See Strickland v. Washington, 466 U.S. 668, 687, 104 S.Ct. 2052, 80 L.Ed.2d 674 (1984). Given these safeguards, we reject Plitman's argument that a defendant in every instance personally must waive the right to confront the witnesses against him. We therefore join the majority of circuit courts of appeals and hold that defense counsel may waive a defendant's Sixth Amendment right to confrontation where the decision is one of trial tactics or strategy that might be considered sound.\n\nUnited States v. Plitman, 194 F.3d 59, 64 (2nd Cir. 1999).\n\n¶36 During the trial, the court indicated in a conference in chambers that it would give the defense a choice to allow admission of the evidence of the prior sexual assault accusations through witness testimony or through a written sanitized version read to the jury. While maintaining their objection to the admission of this evidence at all, defense counsel specified a preference for the written statement. Prior to having the statement read to the jury, the court presented the statement to both parties and incorporated their suggestions into the final product. Under these circumstances, it is clear that defense counsel made a tactical decision to support the written statement over having Belden's accusers testify. It is important to remember that defense counsel had cross-examined both accusers during the motions hearing in August. Thus, Belden's counsel had an opportunity to observe the accusers, hear their testimony, and test them through crossexamination. Once the trial court ruled that the evidence was admissible, defense counsel had to determine how to proceed while defending the best interests of their client. Apparently, defense counsel concluded that it would be best to avoid having the accusers take the stand. Accordingly, defense counsel supported the admission of the evidence through the written statement even though that would mean waiving Belden's Sixth Amendment right to confrontation. That was a tactical decision we will not question with hindsight. Belden has failed to demonstrate that the decision constituted plain error and his claim must fail.\n\nIII. Prosecutorial Misconduct\n\n¶37 Belden alleges several instances of prosecutorial misconduct including soliciting testimony from a witness on the question of guilt, arguing propensity based upon uncharged misconduct evidence, misstating evidence, shifting the burden of proof during closing argument, and asking for a conviction for reasons other than on the basis of the evidence.\n\nA. Standard of Review\n\n¶38 Belden did not interpose an objection at trial to any of the prosecutor's statements, which he now alleges were improper. We review claims of misconduct by a prosecutor during closing argument under the following principles:\n\nThe general rule in Wyoming is that a failure to interpose a timely objection to improper argument is treated as a waiver, unless the prosecutor's misconduct is so flagrant as to constitute plain error, requiring reversal. Montoya v. State, 971 P.2d 134, 136 (Wyo. 1998); Armstrong v. State, 826 P.2d 1106, 1115 (Wyo. 1992). A plain error analysis requires the appellant to demonstrate the violation of a clear and unequivocal rule of law, clearly reflected in the record, resulting in the abridgment of a substantial right of the party to his material prejudice. Arevalo v. State, 939 P.2d 228, 232 (Wyo. 1997). We are reluctant to find plain error in closing arguments \"lest the trial court becomes required to control argument because opposing counsel does not object.\" James v. State, 888 P.2d 200, 207 (Wyo. 1994) (quoting Taul v. State, 862 P.2d 649, 659 (Wyo. 1993)).\n\nTrujillo, ¶4.\n\nB. Discussion\n\n¶39 One of the alleged instances of prosecutorial misconduct cited by Belden was the portion of the prosecutor's closing argument set out in the previous issue, which Belden claimed improperly argued propensity. We addressed that issue in the previous section and stand by our analysis set out there.\n\n¶40 Belden claims the prosecutor elicited opinion testimony that he was guilty of sexual assault:\n\n[PROSECUTOR]: And part of what led you to believe that you knew who perpetrated this crime was DNA evidence; is that not correct?\n\n[WITNESS]: Yes.\n\nQ: Can you relate to the jury what DNA evidence you had at that time?\n\nA: DNA indicated that [Belden] had sexually assaulted her and had left semen within her body at that time.\n\nBelden argues that the prejudicial effect of this statement is \"obvious,\" and that the State was complicit in eliciting it because it wanted to convey to the jury that the DNA evidence proved his guilt.\n\n¶41 It is error per se for the prosecutor to directly solicit an opinion from a witness on the guilt of the defendant. If, however, the witness expressed an opinion through a non-responsive answer, we review for prejudice. In this case, we do so under our plain error standard since Belden did not object. See Dudley v. State, 951 P.2d 1176, 1179 (Wyo. 1998). The first two elements are established since the witness' statement is clearly reflected in the record and expresses an opinion on Belden's guilt ( i.e., that he \"had sexually assaulted her.\") After carefully reviewing the entire record, however, we conclude that the remark did not materially prejudice Belden. The witness' response was clearly not responsive to the prosecutor's question. The witness was a sheriff's department investigator who was not testifying as an expert on DNA or sexual assaults. The witness only testified about the investigation and his role in it. Furthermore, there was no dispute that the semen found in the victim was from Belden, so identity was not an issue. After the witness made the remark, the prosecutor moved on with his questioning. Thus, the remark was an isolated statement that was not referred to again either by this witness or the prosecution. In order for us to find prejudicial plain error, we would have to make a finding that there was \"a reasonable possibility that, had the jury not heard the [witness'] statement, the verdict would have been different.\" Dudley, 951 P.2d at 1180. Given the voluminous nature of the record including the other evidence produced at trial and the other factors noted above, we cannot conclude that but for the statement the verdict would have been more favorable to the defendant. Accordingly, we find no material prejudice.\n\n¶42 Belden contends that the prosecutor \"asked the jury to convict for reasons other than the evidence\" when he concluded his closing argument with:\n\nAnd based on all of that evidence, the direct and circumstantial evidence that's been presented to you, I ask you, please, do your duty. Review all of the evidence and return with a just and proper verdict; that is, that the Defendant is guilty of the crimes of sexual assault in the first degree and murder in the first degree.\n\nAccording to Belden, the prosecutor was telling the jury it was their duty to convict. Belden states that the jury's duty was to \"review the evidence and make a just determination of the facts\" and return a verdict based solely on that determination. He contends that the prosecutor's argument was improper and \"highly prejudicial.\"\n\n¶43 While we do not quibble with Belden's description of a jury's duty, we think he has misconstrued the prosecutor's argument. We do not understand the prosecutor to be arguing that the jury had a duty to convict Belden. The portion of the argument cited by Belden is merely the second half of the final paragraph in the prosecutor's argument. Immediately preceding the statement quoted above, the prosecutor stated:\n\nNow, folks, rape and murder are secretive crimes, often times incapable of proof by direct evidence. Here, we have direct evidence. A one in 700 billion chance that somebody other than this man perpetrated these heinous crimes. That's direct evidence.\n\nThe prosecutor was noting that it was the jury's duty to review the evidence and reach a verdict. The prosecutor closed his argument by advocating his position that the evidence supported a verdict of guilty. See Armstrong v. State, 826 P.2d 1106, 1116 (Wyo. 1992).\n\n¶44 Even if we accepted Belden's interpretation, we would not find prejudice. The jury was instructed that it constituted the exclusive province to weigh and consider all the evidence and determine the credibility of the witnesses. Immediately after the prosecutor's closing, the court noted that the defense had objected\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e to certain portions of the closing and reiterated the substance of its instruction to the jury. Given the curative instructions by the court and the fleeting nature of the comment, we do not find any material prejudice.\n\n¶45 Next, Belden contends that the prosecutor misrepresented the facts in the case. The victim kept a diary in which she wrote about the daily events of her life and the people in it. Belden wanted to \"dispel the implication that because, [the victim's] diary contained no reference to any romantic or sexual relationship with him, that none had existed.\" Belden insisted that in order to prove its point it would have to put before the jury evidence of a number of sexual encounters of the victim to show that she had relationships that were not noted in her diary. To avoid the potential complications of offering such evidence, the prosecution and defense entered into a stipulation that \"[c]ertain events occurred in the life of [the victim], which she did not write about in her diary.\" During his closing argument, the prosecutor made the following argument:\n\nPlease, Ladies and Gentlemen, take the time during your deliberations to examine this document [the diary] closely. Read the passages of June and July and August of 1985. It will take you a long time. It will take you a long time to go through this but at the end that reading [ sic ], you will know [the victim]. You will know that [the victim] was-at the time of her death, she was involved with one fellow. She'd had a sexual interlude with that fellow earlier in the week of her death. That she was kind of flirting with another fellow, a guy by the name of [the man's name]. You'll find that she no more had a relationship with this man [Belden] than she had a relationship with the man in the moon because she was the type of person to put those things down. And she did. Please read this document. [Emphasis added by Belden.]\n\nBelden claims that this was a misstatement of the facts and in flagrant violation of the stipulation.\n\n¶46 We cannot agree with Belden's characterization. The stipulation stated that the parties agreed that the victim did not write about every event in her diary. There is nothing in the stipulation that would prevent the prosecutor from arguing that if the victim had an intimate relationship with Belden, that it would have been mentioned in the diary. The prosecutor is not arguing \"because she wrote everything in her diary the absence of any reference to a relationship with Belden must mean there wasn't one.\" We do not think it is inconsistent for the prosecutor to agree that the victim did not write everything in her diary while contending an intimate relationship would be one of the things that she would write about in the diary. The prosecutor did not contradict the substance of the stipulation and merely made an argument through an inference based upon the evidence adduced at trial. There was no misconduct.\n\n¶47 Finally, Belden contends that the prosecutor shifted the burden of proof to him during his closing argument:\n\n[PROSECUTOR]: The Defendant's semen is found in and around her and there is no evidence that she ever, ever, ever consented to have sex with the Defendant. [Emphasis supplied by Belden.]\n\nBelden claims that the prosecutor's argument creates an implication that the burden of proof was on him to demonstrate that the sexual conduct between him and the victim was consensual.\n\n¶48 Belden's claim has no merit. \"In presenting closing argument, the prosecutor is entitled to reflect upon the evidence and to draw reasonable inferences from that evidence in order to assist the jury in its function.\" Armstrong, 826 P.2d at 1116. The prosecutor was making an argument based upon the trial evidence. It is not error for the prosecutor to argue that its evidence is uncontradicted or that the evidence does not support the defendant's theory of the case. Vigil, 926 P.2d at 358-59 (\"It is not improper for the government to draw attention to the failure or lack of evidence on a point, if it is not intended to call attention to the failure of the defendant to testify.\") (quoting Knowles v. United States, 224 F.2d 168, 169 (10th Cir. 1955)). The prosecutor certainly did not comment on the defendant's failure to testify. The prosecutor's argument was proper advocacy on behalf of his client.\n\nIV. Belden's Absence From in Camera Conference\n\n¶49 During the prosecutor's closing argument, defense counsel objected to his characterization of a witness' testimony. The trial court excused the jury and directed the court reporter to read the witness' testimony. The transcript indicates that Belden left the room and was not present during the conference on the objection. On appeal, Belden claims that his absence from the hearing meant he was deprived of his constitutional right to be present at all critical stages of the trial.\n\nA. Standard of Review\n\n¶50 An accused has the right to be present during every stage of the criminal proceeding that is critical to the outcome if his presence would contribute to the fairness of the procedure. The Sixth Amendment and the due process clauses of the Fifth and Fourteenth Amendments to the United States Constitution guarantee this right. Seeley v. State, 959 P.2d 170, 177 (Wyo. 1998). The right of the accused to be present at the critical stages of a trial is also explicitly guaranteed by Wyoming law. Wyo. Const. art. 1, § 10; Wyo. Stat. Ann. § 7-11-202 and W.R.Cr.P. 43(a). \"The question of whether a defendant had the right to be present at a specific phase of his trial is an issue of law and, as such, is subject to de novo review.\" Seeley, 959 P.2d at 175. A deprivation of the right to be present at all critical stages of a trial is subject to harmless error analysis. Seeley, 959 P.2d at 178; Arizona v. Fulminante, 499 U.S. 279, 306-10, 111 S.Ct. 1246, 1263-65, 113 L.Ed.2d 302 (1991); United States v. Gomez, 67 F.3d 1515, 1528 (10th Cir. 1995); Luu v. People, 841 P.2d 271, 273-75 (Colo. 1992).\n\nB. Discussion\n\n¶51 The record is silent as to why Belden was absent during the conference on the objection to the prosecutor's closing argument. The transcript simply notes that Belden left the room. Belden contends that the conference was an important part of the trial proceedings and his exclusion prejudiced him and deprived him of a right to a fair trial. Belden suggests that had he been present, he could have: offered suggestions on other times the disputed testimony may have arisen during trial; asked for an explanation of the proceedings and its significance; and conferred with his counsel on the appropriate course of action.\n\n¶52 A defendant's right to be present during trial proceedings is not absolute. People v. Starks, 679 N.E.2d 764, 768-69 (Ill.App. 3 Dist. 1997). A \"defendant's presence is not required when it 'would be useless, or the benefit but a shadow.'\" Seeley, 959 P.2d at 177 (quoting Snyder v. Com. of Mass., 291 U.S. 97, 106-07, 54 S.Ct. 330, 332-33, 78 L.Ed.2d 674 (1934)). We have held that a defendant's presence is not required \"at a conference or argument upon a question of law.\" Lobatos v. State, 875 P.2d 716, 724 (Wyo. 1994). In addition, the defendant's absence can be harmless if \"the issue is not one on which counsel would be likely to consult the defendant, or it is not one for which the defendant, if consulted, would be likely to have an answer that would sway the judge.\" United States v. Rodriguez, 67 F.3d 1312, 1316 (7th Cir. 1995). A short absence can be insignificant, especially if the defendant's counsel is present throughout the proceedings. United States v. Harris, 908 F.2d 728, 739-40 (11th Cir. 1990).\n\n¶53 Assuming for purposes of our review that Belden's absence deprived him of his constitutional right to be present, we do not find any prejudice. While the record is silent as to why Belden was absent from the conference, there is no indication that the absence was anything but voluntary. Furthermore, the absence was for a brief period of time. The conference was concerned with the propriety of the prosecutor's closing argument. Belden fails to convince us that his presence during this conference could have had any appreciable effect on the outcome of his trial. There is nothing to indicate that Belden possessed any special information on the question before the trial court that his counsel did not or that his presence could have altered the judge's decision on the objection in any way. If we assume Belden's absence constituted a deprivation of a constitutional right, the error was harmless.\n\nV. Appointment of Special Prosecutor\n\n¶54 Belden contends that the appointment of an Assistant United States Attorney as a special prosecutor violated art. 6, § 19 of the Wyoming Constitution, which provides:\n\nNo member of congress from this state, nor any person holding or exercising any office or appointment of trust or profit under the United States, shall at the same time hold or exercise any office in this state to which a salary, fees or perquisites shall be attached. The legislature may by law declare what offices are incompatible.\n\nA. Standard of Review\n\n¶55 Belden suggests that the applicable standard of review is the standard de novo one this Court applies to questions of law and constitutional issues. However, the State correctly points out that this claim was never put before the trial court and is being raised for the first time in this appeal. This Court generally does not consider issues raised for the first time on appeal. Yetter v. State, 987 P.2d 666, 670 (Wyo. 1999). We have, however, considered claims of error despite the defendant's failure to object at trial. \"Our rule is that in the absence of fundamental error affecting a substantial right of the appellant an issue raised for the first time on appeal will not be considered.\" Davis v. State, 859 P.2d 89, 94 (Wyo. 1993). We review those claims not objected to at trial and raised for the first time on appeal for plain error. Britton v. State, 976 P.2d 669, 671 (Wyo. 1999). The burden of establishing plain error is assigned to the appellant even when the claimed error would constitute a violation of a constitutional right. Id. As we noted earlier, plain error is found when: The violation of a clear and unequivocal rule of law, clearly reflected in the record, resulting in the abridgment of a substantial right of the party to his material prejudice is demonstrated. Arevalo v. State, 939 P.2d 228, 232 (Wyo. 1997).\n\nB. Discussion\n\n¶56 We need only address the material prejudice prong of the plain error standard in order to resolve Belden's claim. Belden claims that he was materially prejudiced by the appointment of an Assistant United States Attorney as special prosecutor because it was a \"structural error.\" According to Belden, the special prosecutor's \"presence, in blatant violation of the Wyoming Constitution, affected the framework of [his] trial by challenging the sovereignty of the state court proceedings, manifesting a situation ripe for conflicts of interest, and affording the state an unfair advantage in the form of a prosecutorial overmatch.\"\n\n¶57 The constitutions of the United States of America and the State of Wyoming, in conjunction with Wyoming's criminal statutes, rules of procedure and evidence, operate in criminal cases to achieve a single purpose: to ensure that an accused receives a fair trial. Belden claims that the mere appointment of an Assistant United States Attorney as a special prosecutor was an affront to the sovereignty of Wyoming and permeated the entire proceedings with prejudice. We strongly disagree with Belden's contentions. Belden does not claim any actual prejudice on account of the appointment of the special prosecutor amounting to a denial of his due process right to a fair trial. Belden received what he is constitutionally guaranteed. There is nothing in the record to suggest that the presence of an Assistant United States Attorney acting as a prosecutor affected the trial proceedings in any manner so as to impede Belden's right to a fair trial. The only thing Belden offers us is unsupported allegations. Belden cannot sit silently while the special prosecutor is appointed and the entire trial process is completed and then complain on appeal when the result is adverse to him. Since there was no material prejudice to Belden's right to a fair trial through the appointment of the special prosecutor, we decline to address his claim any further.\n\nCONCLUSION\n\n¶58 We have reviewed the entire record and transcript of the trial and carefully considered the issues raised by Belden. Our review did not disclose any prejudicial error and, accordingly, Belden's sentence and conviction are affirmed.\n\nGOLDEN, Justice, dissenting, with whom VOIGT, Justice, joins.\n\n¶59 Because I believe that Belden was denied his right to a fair trial by the improper admission of prejudicial uncharged misconduct evidence and judicial and prosecutorial misconduct, I must respectfully dissent.\n\n¶60 The fundamental issue in this case was the identity of the victim's attacker and killer. Proof of a motive could assist in identifying the killer; however, motive that is too general, universal or applicable to a large number of persons is not helpful for identification. In this case, the motive accepted by the trial court was too general under the specific facts of this case to have been admissible without violating W.R.E. 404 and 403. The trial court's instruction to the jury that Belden may have had a motive to kill the victim followed by statements that he had been accused of a crime, charged, but not convicted left the jury to guess as to what connection these statements had to the evidence in this case.\n\n¶61 No evidence showed that Belden was worried about another rape accusation or had felt compelled to kill other women that he had sexual intercourse with to avoid accusations, and to assign him that potential motive would have required jury speculation. The jury might have guessed that his motive was to eliminate the victim as a witness to his sexual assault upon her; however, that motive applied to whomever killed the victim and is too general to have been admissible as peculiar to Belden. Nor was there any evidence that Belden had increased incentive to kill this victim for fear of severe punishment. Contrary evidence not revealed to the jury indicated that his experience with accusations led to very little punishment because he was previously acquitted of one charge and the other was dismissed after he pled guilty to a misdemeanor.\n\n¶62 Furthermore, these statements were too unfairly prejudicial to be admitted. Belden was charged with sexual assault felony murder, meaning evidence of an intent to commit a murder was not required and the jury must first convict of sexual assault before it could convict for felony murder. Admitting evidence that Belden had previously been accused of sexual assault was plainly too prejudicial because this evidence only proved that he had been accused of other sexual assaults. In other words, it was propensity evidence and was inadmissible.\n\n¶63 Uncharged misconduct that demonstrates evidence of a motive to commit the charged crime is admissible in a felony murder trial; however, the circumstances that allow its admission are limited. Evidence of a potential motive, such as the one presented in this case, is rarely admissible. Proof of a motive that is \"peculiar to the defendant\" or arises from an emotion that is \"directed at the victim or class of victims\" are examples of admissible evidence of motive. The evidence is admitted because it reliably identifies the perpetrator while eliminating the risk that the accused will be convicted for his bad character. 1 Edward J. Imwinkelreid, Uncharged Misconduct Evidence, § 3:15 to 3:18 (Rev. ed. 1999). For example, had the trial court in this case found that proof existed that Belden had made statements indicating that he would kill to avoid another rape accusation then it is probable that the evidence would have been admissible as evidence of motive. Because the ultimate fact for the jury to decide from this type of uncharged misconduct evidence is identity, if the previous misconduct was so similar to this case's facts because in those previous cases, Belden had left work and arrived at their residences, brutally beaten and sexually assaulted them and then had strangled them and it was only fortuitous that each had lived, then it is again probable that the evidence would have been admissible. Without this type of proof, the trial court could not admit previous sexual assault accusations without running afoul of Rules 404 and 403. The lack of motive evidence as well as the dissimilarity to this crime's facts resulted in an admission of evidence that simply proved that he had committed this crime because he had committed other crimes. My conclusion is borne out by the prosecutor's own words in his closing argument that stated:\n\nAnd, finally, the evidence shows that in the past, the Defendant had had sexual intercourse with women and been accused of rape. It is our contention, Ladies and Gentlemen, that these facts point out one inescapable conclusion, that the Defendant sexually assaulted and murdered [the victim.]\n\nSuch a statement by the prosecutor used the uncharged misconduct to prove the sexual assault and was in violation of the court's limiting instructions.\n\n¶64 The prosecutor also committed misconduct when he elicited an answer from an investigator that DNA indicated that Belden had \"sexually assaulted\" her and had left semen in her body. Eliciting an opinion of the accused's guilt in this manner is reversible error. Whiteplume v. State, 841 P.2d 1332, 1338 (Wyo. 1992); Bennett v. State, 794 P.2d 879, 881 (Wyo. 1990); Stephens v. State, 774 P.2d 60, 68 (Wyo. 1989). Finally, in his closing argument, the prosecutor admonished the jury to \"do your duty. Review all of the evidence and return with a just and proper verdict; that is, that the Defendant is guilty of the crimes of sexual assault in the first degree and murder in the first degree.\" This statement can only be read as an exhortation that implied this jury could only do its duty if it reached a certain verdict. Wilks v. State, 2002 WY 100, ¶¶27, 28, 49 P.3d 975, 987 (Wyo. 2002).\n\n¶65 Finally, I must disagree with the majority's conclusion after thorough examination of the judicial conduct in this case, that such conduct did not deprive Belden of a fair trial. Had Belden complained of a few individual statements, I would agree with the majority's conclusion; however, we cannot consider all of these many statements in isolation from one another. Both the majority and Justice Voigt's dissenting opinion find that the judge engaged in numerous incidents of improper conduct and it is this sheer number that requires that I depart with the view that the conduct was not prejudicial.\n\n¶66 I would reverse and remand this case for new trial.\n\nVOIGT, Justice, dissenting.\n\n¶67 I agree with the reasoning and conclusions contained in Justice Golden's dissenting opinion. I write separately to emphasize that I would reverse primarily due to judicial misconduct. The record reveals that this was not a situation where a remark or two by the trial judge raised a question of potential bias. Instead, the record reveals judicial harassment and intimidation of counsel, and gross and continuing interference by the trial judge in counsels' attempts to try their respective cases. Beyond that, the trial judge's inappropriate attempts at levity endangered the sense of seriousness and dignity due a murder trial. The trial judge berated counsel for engaging in a \"big stud duck\" contest, but it is clear that he was the one most caught up in the contest for the jury's attention and approbation.\n\n¶68 The trial judge in this case violated several specific rules:\n\n(1) Trial judges must be mindful of the influence they wield, and that their words may mold the opinion of the jurors to the extent that a party may be prejudiced. Randolph v. State, 117 Nev. 970, 36 P.3d 424, 433 (2001), cert. denied, 123 S.Ct. 183 (2002). The trial judge should be conscious of the fact that all concerned, including parties, witnesses and jurors, look to him for justice and that comments he makes and the attitude he conveys toward counsel and the trial may have an important effect thereon. State v. Sanchez, 611 P.2d 721, 722 (Utah 1980). The trial judge must exercise restraint over his conduct and utterances, must suppress his personal predilections, and must control his temper and emotions, and when it becomes necessary during trial for the judge to comment upon the conduct of witnesses, spectators, counsel, or others, he should do so in a firm, dignified and restrained manner. State v. Walker, 252 Kan. 279, 845 P.2d 1, 11 (1993). The trial judge should be the exemplar of dignity and impartiality, should avoid repartee, should avoid any conduct that tends to demean the proceedings, and should not permit any person in the courtroom to embroil him in conflict. State v. Gadelkarim, 256 Kan. 671, 887 P.2d 88, 95 (1994).\n\n(2) It is not the job of the trial judge to represent the defendant or to secondguess strategy employed by defense counsel. Kailukiak v. State, 959 P.2d 771, 776 (Alaska App. 1998), abrogated on other grounds by Harmon v. State, 11 P.3d 393 (Alaska App. 2000). The trial judge must not interject himself into the attorney-client relationship between the defendant and counsel. Rhyne v. State, 38 P.3d 163, 167 (Nev. 2002). The trial judge must allow counsel freedom to present their respective cases, regardless of whether the trial judge may feel the case is proceeding on the wrong theory or that the trial judge would try the case differently. McCabe v. R.A. Manning Const. Co., Inc., 674 P.2d 699, 708 (Wyo. 1983).\n\n(3) Critical decisions in a criminal case should not rest, in whole or in part, on an attempt to teach an attorney a lesson. State v. Bible, 175 Ariz. 549, 858 P.2d 1152, 1198 (1993), cert. denied, 511 U.S. 1046 (1994). The concept of judicial independence does not equate to unbridled discretion on the part of the judge to bully and threaten. In re Hammermaster, 139 Wash.2d 211, 985 P.2d 924, 936 (1999).\n\n(4) Well-conceived judicial humor may be a welcome relief in a long, tense trial. People v. Riel, 22 Cal.4th 1153, 96 Cal.Rptr.2d 1, 998 P.2d 969, 985 (2000), cert. denied, 531 U.S. 1087 (2001) ( quoting People v. Melton, 44 Cal.3d 713, 753-54, 244 Cal.Rptr. 867, 750 P.2d 741, cert. denied, 488 U.S. 934 (1988)). Injecting levity into a trial may, however, create a scintillating and relaxed atmosphere that may adversely influence the jury's perception of the significance of the trial.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Parodi v. Washoe Medical Center, Inc., 111 Nev. 365, 892 P.2d 588, 589-90 (1995). Further, counsel may fear interjecting disapproval of such atmosphere. Id.\n\n¶69 When read as a whole, the record compels the conclusion that the appellant did not receive a fair trial. The multiple incidents of judicial misconduct colored the entire proceeding to such an extent that we cannot be assured that the verdict would have been the same in the absence of such misconduct. I would reverse and remand for a new trial.\n\n\u003cspan class=\"fn\"\u003e1. Chief Justice at time of oral argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Upon discovering the victim's body, Terry Smith had placed a blanket over her. Investigators were unable to determine if the hair had come from the blanket or had been deposited during the course of the assault. DNA testing would later identify the hair as belonging to Smith's then estranged husband.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The DNA analysis of the fingernail scrapings could not identify any one specific person as the source. However, while Belden was excluded as the probable source, the victim's former boyfriend could not be excluded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. At the time of the murder, Wyo. Stat. Ann. § 6-2-302(a)(i) (Michie 1977 Republished ed. and Supp. 1983) provided: Sec. 6-2-302. Sexual assault in the first degree. (a) Any actor who inflicts sexual intrusion on a victim commits a sexual assault in the first degree if: (i) The actor causes submission of the victim through the actual application, reasonably calculated to cause submission of the victim, of physical force or forcible confinement[.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. At the time of the murder, Wyo. Stat. Ann. § 6-2-101(a) (Michie 1977 Republished ed. and Supp. 1983) provided:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Belden also cites the Wyoming Constitution, art. 1, § 10 but does not provide any analysis under that provision. Accordingly, we only consider his argument under the federal constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The defense objections were to portions of the prosecutor's closing that are not the subject of any claim of error in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The jurors asking for popcorn to watch a videotaped exhibit comes to mind.\u003c/span\u003e\n\n",
    "body_length": 174569,
    "citedas": [
      "73 P.3d 1041",
      "2003 WY 89"
    ],
    "attorneys": "Representing Appellant:Kenneth M. Koski, Public Defender, and Donna D. Domonkos, Appellate Counsel. Argument presented by Ms. Dovv.monkos. Representing Appellee:Hoke MacMillan, Attorney General; Paul S. Rehurek, Deputy Attorney General; D. Michael Pauling, Senior Assistant Attorney General; Theodore E. Lauer, Prosecution Assistance Program; and Charles L. Peters and Kerry Gaines, Student Interns. Argument presented by Ms. Gaines.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Hill, C.J., and Golden, LEHMAN*fn1, Kite, and Voigt, JJ.",
    "citation_count": 42
  }
}
