{
  "id": "q6J7R2YBTlTomsSBWGL5",
  "document": {
    "title": "Professional Engineers v. Department of Transportation",
    "full_title": "PROFESSIONAL ENGINEERS IN CALIFORNIA GOVERNMENT (PECG) ET AL. AND v. DEPARTMENT OF TRANSPORTATION ET AL. AND .",
    "jurisdiction": "California Court of Appeal",
    "date": "1996-03-15T00:00:00.000Z",
    "docket": "No. C018317",
    "body": "PUGLIA, P.J.:\n\nThis appeal involves a facial challenge to a 1993 statute (Stats. 1993, ch. 433) extending the authority of defendant Department of Transportation to contract with private entities for the performance on state highway projects of design, inspection, and related work which has traditionally been performed by civil service employees. We shall hold that the statute is not violative of the constitutional civil service mandate. (Cal. Const., art. VII, § 1.)\n\nIn 1990, the superior court issued a permanent injunction against the Department of Transportation and its then Director, defendant Leo J. Trombatore, prohibiting them in specified circumstances from contracting with private entities to perform state work. In light of the intervening 1993 statute, defendants (collectively \"Caltrans\") moved to dissolve the 1990 injunction. The superior court denied the motion, concluding the 1993 statute is unconstitutional as in violation of the civil service article of the Constitution. (Cal. Const., art. VII, § 1.) Caltrans appeals from this order. (see Code Civ. Proc., § 904.1, subd. (a)(6).) We shall reverse.\n\nI\n\nArticle VII, section 1 of the Constitution states: \"(a) The civil service includes every officer and employee of the State except as otherwise provided in this Constitution. (b) In the civil service permanent appointment and promotion shall be made under a general system based on merit ascertained by competitive examination.\"\n\nArticle VII, Section 1 (hereafter \"Article VII\") and its predecessor, Article XXIV have often been described simply as the \"civil service mandate.\" (See e.g., Professional Engineers v. Department of Transportation (1993) 13 Cal. App. 4th 585, 593-594; California State Employees' Assn. v. State of California (1988) 199 Cal. App. 3d 840, 844, 245 Cal. Rptr. 232.) The civil service mandate has been judicially interpreted as a restriction on contracting out state work to the private sector. ( California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 844, and cases cited therein.) The restriction on contracting out does not arise from the express language of the constitution but rather \"from an implicit necessity for protecting the policy of the organic civil service mandate against dissolution and destruction. [Citation.]\" ( California State Employees' Assn. v. Williams (1970) 7 Cal. App. 3d 390, 397, 86 Cal. Rptr. 305.)\n\nPlaintiffs are Professional Engineers in California Government (PECG), a labor organization representing engineers employed by the State of California, and Richard T. Baker, a California taxpayer and citizen. Plaintiffs initiated the underlying action to enjoin certain contracting practices engaged in by Caltrans alleged to violate the organic civil service mandate and statutory authority.\n\nOn April 17, 1990, the superior court issued a permanent injunction prohibiting Caltrans from: (a) contracting outside civil service for \"project development services\" without demonstrating the existence of facts satisfying the criteria for such contracting, as set forth in [Government Code] sections 14101 and 14130 et seq.; \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e (b) entering into cooperative agreements with local entities where part or all of the work is to be performed by private entities; and (c) awarding contracts to private entities for construction survey staking. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDuring the next several years, the superior court entered additional orders relating to Caltrans' compliance with the injunction. On January 25, 1991, the court found Caltrans had violated the injunction by contracting with private entities for 1,200 personnel years of project development work without providing an adequate factual basis. On April 1, 1991, the court rejected Caltrans' \"total program\" approach to outside contracting, by which contracting needs were determined on a fiscal year basis by comparing annual project obligations with available personnel. On May 18, 1993, the court held Caltrans' decision to maintain staffing for fiscal year 1992-1993 at 1991-1992 levels, because of a projected reduction in staffing needs in future years and a desire to avoid short-term hiring and layoff expenses, was not supported by the evidence.\n\nThe statutory framework of Caltrans' authority to contract out was in place before the enactment of the 1993 statute at issue in this appeal. That authority, as relevant to our inquiry, is addressed generally in Government Code sections 14101, 14131 and 14134, subdivision (a). (Further statutory references to sections of an undesignated code are to the Government Code.)\n\nSection 14101 states: \"[Caltrans] shall contract with qualified architects and engineers for the performance of work when it is determined by the Director of Transportation, with the approval of the Director of Finance, that the obtainable staff is unable to perform the particular work within the time the public interest requires such work to be done.\"\n\nSection 14131 states: \"The department may contract for the services of engineers, architects, surveyors, planners, environmental specialists, and materials testing specialists to provide professional and technical services relating to project study reports, project development, surveying, and construction inspection whenever the director determines that the guidelines adopted pursuant to Section 14134 are applicable. Services contracted for shall not cause the displacement of any permanent, temporary, or part-time employee of the department. For purposes of this section, 'displacement' means layoff, demotion, involuntary transfer to a new class, or involuntary transfer to a new work location requiring the employee to change his or her place of residence in order to be able to continue in his or her job classification.\"\n\nSection 14134, subdivision (a) states: \"[Caltrans], after consultation with the [California Transportation Commission and local transportation agencies, shall adopt guidelines for determining the appropriateness of contracting with private firms or on projects developed cooperatively with local jurisdictions. The guidelines shall include, but not be limited to, consideration of the following:\n\n\"(1) Ensuring that all available federal, state, and local funds, including supplemental federal funds, are captured and used in a timely manner.\n\n\"(2) Reducing short-term fluctuations in the department's workload relating to project study reports, project development, surveying, and construction inspection while still enabling the department to be plan-ready.\n\n\"(3) Facilitating the expeditious use of locally raised funds for state highway projects, recognizing that, in this instance, local governments are partners in state highway construction and that locally financed projects should not be unnecessarily delayed.\n\n\"(4) Ensuring that the cost effectiveness of contracting is considered equally with other factors when a determination of the appropriateness of contracting is made.\n\n\"(5) Ensuring that contract selection is performed in accordance with applicable state laws regarding the selection of professional architectural, engineering, environmental, or land surveying services, and to ensure the selection process avoids or prohibits unlawful or unfair procedures or activities.\"\n\nChapter 433 of the 1993 Statutes (hereafter \"Chapter 433\") became effective as an urgency statute on September 24, 1993. Chapter 433 makes changes to sections 14130 et seq. which, Caltrans argues, render the 1990 injunction moot. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Caltrans immediately revised its contracting projections for fiscal year 1993-1994 to give effect to the 1993 legislation and issued new guidelines for contracting out. (See § 14134.) Plaintiffs filed an application in the superior court for an order holding Caltrans in contempt for violating the 1990 injunction. On December 23, 1993, the court denied plaintiffs' application but indicated it would treat the matter as a motion for clarification or modification of the injunction and directed the parties to brief and argue the effect of Chapter 433 on the injunction. In response Caltrans moved that the injunction be dissolved.\n\nOn April 19, 1994, after briefing and argument, the superior court refused to modify or dissolve the 1990 injunction and ruled that all orders made pursuant to the injunction are to be maintained in full force. Caltrans appeals.\n\nII\n\nThe decision whether to grant, deny, modify, dissolve, or refuse to dissolve an injunction is within the sound discretion of the trial court and will not be disturbed on appeal absent a clear showing of abuse. ( Union Interchange, Inc. v. Savage (1959) 52 Cal. 2d 601, 606, 342 P.2d 249.) However, where the underlying facts are not in dispute, or the issues presented do not turn on factual matters, the reviewing court exercises independent judgment. ( San Diego Union v. City Council (1983) 146 Cal. App. 3d 947, 952-953, 196 Cal. Rptr. 45.) \"'\"It is a rule so universally followed and so often stated as to need only to be referred to that the granting, denial, dissolving or refusing to dissolve a permanent or preliminary injunction rests in the sound discretion of the trial court upon a consideration of all the particular circumstances of each individual case\"' and '\"will not be modified or dissolved on appeal except for an abuse of discretion.\"' (Union Interchange, Inc. v. Savage [supra] 52 Cal. 2d 601, 606 [342 P.2d 249], quoting Kendall v. Foulks (1919) 180 Cal. 171, 174 [179 P. 886].) A court has inherent power to vacate an injunction upon a showing of a change in the controlling law. ( Union Interchange, Inc. v. Savage, supra, 51 Cal. 2d at p. 604; Sontag Chain Stores Co. v. Superior Court (1941) 18 Cal. 2d 92, 95 [113 P.2d 689].)\" ( Salazar v. Eastin (1995) 9 Cal. 4th 836, 849-850, 890 P.2d 43.) If an intervening change in the controlling law renders the injunction inequitable, refusal to vacate is an abuse of discretion. (See Welsch v. Goswick (1982) 130 Cal. App. 3d 398, 404-405, 181 Cal. Rptr. 703.)\n\nIn its April 19, 1994 order, the superior court reached essentially two Conclusions. First, the court analyzed Caltrans' ongoing contracting practices and concluded those practices violate the 1990 injunction. Second, the court analyzed the provisions of Chapter 433 and concluded that statute is unconstitutional on its face and hence affords no basis to modify or dissolve the injunction. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n\"A facial challenge to the constitutional validity of a statute . . . considers only the text of the measure itself, not its application to . . . particular circumstances . . . .\" ( Tobe v. City of Santa Ana (1995) 9 Cal. 4th 1069, 1084, 892 P.2d 1145.) In order to prevail in a facial attack on a legislative enactment, the challenger must establish that under no circumstance can the legislation be applied without violating the Constitution. \"Petitioners cannot prevail by suggesting that in some future hypothetical situation constitutional problems may possibly arise as to the particular application of the statute . . . . Rather, petitioners must demonstrate that the act's provisions inevitably pose a present total and fatal conflict with applicable constitutional prohibitions.\" ( Pacific Legal Foundation v. Brown (1981) 29 Cal. 3d 168, 180-181, 172 Cal. Rptr. 487, 624 P.2d 1215, emphasis in original; Tobe v. City of Santa Ana, supra, at p. 1084.) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIII\n\nArticle VII does not prohibit all government contracting with the private sector, only that which implicates the policies immanent in the constitutional provision. Those policies are twofold: \"(1) to encourage efficiency and economy in state government, and (2) to eliminate the 'spoils system' of political patronage by ensuring that demonstrated fitness -- rather than political considerations -- spur all appointments to public service. [Citation.]\" ( Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th at p. 592.)\n\nIn two early decisions, State Comp. Ins. Fund v. Riley (1937) 9 Cal. 2d 126, 69 P.2d 985 and Burum v. State Comp. Ins. Fund (1947) 30 Cal. 2d 575, 184 P.2d 505, the Supreme Court held the test for determining if a contract between a state agency and a private entity violates the civil service article is whether the services contracted for, whether temporary or permanent, are of such a nature that they could be performed \"adequately or competently or satisfactorily\" by one selected under the provisions of civil service. ( California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at p. 396.) This \"nature of the services\" test examines whether the particular tasks being performed are within the expertise of those who are or can be employed through civil service. (7 Cal. App. 3d at p. 396.)\n\nIn California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d 390, we delivered a critical dictum on the \"nature of the services\" test: \"Whatever may have been the efficacy of the 'nature of the services' test when it was conceived in 1937, it is now evident that rigid application of that test would lead to untoward and possibly chaotic results. Theoretically, it might bar payment of a bill for lubricating a state car which could have been lubricated by employees in a state garage; prevent repair of an office machine by a dealer's serviceman rather than the state's equipment maintenance personnel; bar an office remodeling contract because the state has a staff of construction craft workers and can hire more; forbid an architectural design contest for a noteworthy public building; prevent the retainer of independent scientific consultants whose skills are matched by state-employed scientists.\" ( Id. at p. 396, fn. 3.)\n\nIn the event, we applied a different standard: the \"new state function\" test. Following the lead of two Supreme Court decisions interpreting a similar civil service provision of the Charter of the City and County of San Francisco ( San Francisco v. Boyd (1941) 17 Cal. 2d 606, 110 P.2d 1036 and Kennedy v. Ross (1946) 28 Cal. 2d 569, 170 P.2d 904), we held the civil service mandate does not prohibit outside contracting where the function involved is not one previously performed by state employees, regardless of the specific skills utilized in performing that function. ( California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at p. 397.) The civil service mandate \"does not prohibit legislative experimentation in new forms to fit new functions. It compels expansion of civil service with expansion of state agency structure but does not force expansions of state agency structure to match extensions of state function.\" (7 Cal. App. 3d at p. 399.)\n\nThe \"new state function\" test examines whether the privately contracted services \"displace existing civil service functions or, instead, embrace a new state activity or function.\" ( Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th at p. 593.) For example, in Williams we held creation of the state Medi-Cal program in 1965 established a new state function and therefore partial contracting with private firms for administration of the program, as authorized by the legislation, did not violate the civil service article. In Department of Transportation v. Chavez (1992) 7 Cal. App. 4th 407, we held contracts with private firms for the maintenance of highway rest stops violated Article VII because, although contracting out was specifically authorized by legislation which tasked Caltrans with responsibility for rest stop maintenance, the work had nevertheless been performed by civil servants for the ensuing 20 years. We explained that by the time Caltrans contracted the work to the private sector, rest stop maintenance was no longer a new state function. ( Chavez, supra, 7 Cal. App. 4th at p. 416.)\n\nIV\n\nUncodified section 1 of Chapter 433 provides: \"It is the intent of the Legislature that the Director of Transportation have the continued flexibility to contract out, according to Article 2.5 (commencing with Section 14130) of Chapter 2 of Part 5 of Division 3 of Title 2 of the Government Code, at a level or levels necessary in the judgment of the director to timely deliver transportation projects. It is the intent of the Legislature that this act be construed as affording the Director of Transportation a new and independent basis upon which to justify contracting out actions taken during the time that Sections 2, 4, 5, 6, and 9 of this act are effective.\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nConsistent with this intent, Chapter 433 makes changes and additions to section 14130 et seq. which authorize Caltrans to contract out work. The statutory changes at issue here generally are of two types: (1) those that expressly or implicitly authorize contracting out and (2) those that recite legislative findings and declarations purporting to justify contracting out.\n\nNew section 14130.1 (section 4 of Chapter 433) provides that engineering services necessary to complete the \"seismic safety retrofit program,\" initiated in 1989 by legislation reactive to the Loma Prieta earthquake (stats. 1989 First Extraordinary Session, ch. 18) shall be considered a \"short-term workload demand.\" Read in conjunction with other provisions of section 14130 et seq., this provision authorizes such work to be contracted out to private entities.\n\nNew section 14130.2 (section 5 of Chapter 433) authorizes Caltrans to ignore engineering services necessary to locally funded projects in determining its staffing needs and to \"balance the need for outside contracting for these services on a program basis, rather than on an individual contract basis.\" Implicitly, this provision also authorizes work necessary to locally funded projects to be contracted out to private entities.\n\nNew section 14130.3 (section 6 of Chapter 433) deals with public contracting goals for business participation in certain Caltrans work by minority, women and disabled veteran owned firms. It recites that contracts with such firms have been or are being terminated \"as a result of recent court decisions\" and that such termination conflicts with public contracting goals (see section 10115, Pub. Contract Code), and declares the intent of the Legislature that such contracts be reinstated.\n\nConsistent with this legislative finding and intent, new section 14137 (section 9 of Chapter 433) provides in relevant part: \"(a) Contracts in force or awarded on or before July 1, 1993, for services negotiated pursuant to Chapter 10 (commencing with Section 4525) of Division 5 of Title 1 [dealing with contracts with private architects, engineering, land surveying, and construction project management firms], including, but not limited to, contracts awarded but not executed, between the department and private contractors, including, but not limited to, minority, women, and disabled veteran owned firms, shall not be terminated, but shall continue to the Conclusion of those contracts subject to the same terms and conditions of the contracts as they read on July 1, 1993.\"\n\nSection 14130 (section 2 of Chapter 433) as amended authorizes contracting out expressly in its subdivision (c) and implicitly in its subdivision (d) and otherwise contains legislative findings and declarations justifying contracting out. As relevant it provides: \"(a) The Legislature hereby finds and declares all of the following:\n\n\"(1) There is a compelling public interest in ensuring that all federal, state, local, and private funds available for the state highway program are captured and used in a timely manner in order to generate maximum employment and business opportunities in California.\n\n\"(2) In order to maximize the use of federal, state, local, and private funds and to maintain a competitive posture in seeking supplemental federal funds, California must have a comprehensive and integrated highway construction plan in place.\n\n\"(3) Changes in federal, state, and local revenues and the growing private participation in state highway construction can result in significant fluctuations in workload relating to project study reports, project development, surveying, and construction inspection. To maintain a more stable work force in the department and avoid the costly process of short-time hiring and layoff while still responding in a timely manner to funding opportunities and uncertainties, additional flexibility through outside contracting and cooperative agreements with local public agencies is needed to supplement the department's program staff.\n\n\"(4) The department's experience with contracting out indicates that the use of private consultants to supplement the department's workforce has permitted the department to substantially enhance its project delivery. The department, with the help of the private engineering community, has recently accelerated nearly one billion dollars ($1,000,000,000) worth of construction projects on the state highway system. This significant increase in project delivery capability must continue in order for the department to meet its commitments for timely project delivery. Without the ability to continue a stable contracting out program, the Legislature finds and declares that the department will not be able to perform project delivery adequately, competently, or satisfactorily, thereby necessitating the use of private consultants to supplement its in-house staff.[ \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n\"(5) The use of private consultants to assist in project delivery is a new state function and does not duplicate the existing functions of the department.\n\n\"(b) Therefore, it is the intent of the Legislature that the department contract for the services of engineers, architects, surveyors, planners, environmental specialists, and materials testing specialists, in order to provide professional and technical project development services to the department whenever the department is inadequately staffed to satisfactorily carry out its program of project study reports, project development, surveying, and construction inspection in a timely and effective manner. Compliance with the state's participation goals for these contracts shall be a factor for consideration by the Legislature in evaluating future budget requests by the department. It is the further intent of the Legislature to permit, through cooperative agreements with the department, local public agencies to undertake that program of activities on state highway projects for which they are a funding source.\n\n\"(c) The department may utilize contracting out for state highway projects funded by federal and state moneys to support state transportation infrastructure funded by local resources, to ensure timely retrofitting for seismic safety on state transportation infrastructure, and to ensure timely and cost-effective project delivery.\n\n\"(d) In furtherance of the Legislature's intent to encourage contracting out by the department, the department shall not be required to utilize state employees to perform all engineering and related services to the maximum extent required to meet the goals of this article. The department is not required to staff to an internal level that matches its ability to assimilate and productively use new staff.\n\n\"(e) In consultation with Caltrans Equal Employment Advisory Council, whose membership shall include persons representing statewide community organizations, the department shall prepare and adopt an affirmative action plan for its management and other personnel positions which reflects the ethnic demographics of the state, taking into consideration the availability of the workforce in the various ethnic groups. The department shall make genuine efforts to achieve in its workforce the ethnic and racial composition of the labor force population of the state. These efforts shall include, but not be limited to, the department's personnel hiring and recruitment policies and practices, as well as training and management development.\n\n\"(f) . . . . . . . . . . . . . . . . . . . . . . . . .\"\n\nUncodified section 13 of Chapter 433 requires Caltrans to submit a report to the Legislative Analyst on or before September 1, 1996, comparing costs on two comparable highway projects, one using primarily civil service staff and the other using primarily private sector consultants. \"The Legislative Analyst shall include in the ascertainment of facts and recommendations made to the Legislature with respect to the Budget Act of 1997[] a report on the cost-effectiveness of [Caltrans'] use of contracted services rather than state employees.\" (Ch. 433, § 13, subd. (b).)\n\nV\n\nPointing to section 14130, subdivision (a)(5), Caltrans contends Chapter 433, as a whole, establishes a new state function. Section 14130, subdivision (a)(5) provides: \"(a) The Legislature hereby finds and declares all of the following: . . . (5) The use of private consultants to assist in project delivery is a new state function and does not duplicate the existing functions of the department.\" This new function, Caltrans argues, is \"the new level of private contractor participation, the new emphasis of and encouragement of contracting out, the new standards of justification, and the new, enriched blend of public and private professionals on state highway projects.\" (Emphasis in original.)\n\nThe superior court characterized the Legislature's \"new state function\" declaration in section 14130, subdivision (a)(5) as mere ipsi dixit and dismissed it as a futile attempt to make Chapter 433 what it is not. With this Conclusion of the superior court, we agree.\n\nNotwithstanding the Legislature's finding to the contrary, Caltrans' own description of the activities authorized by Chapter 433 discloses they do not constitute a new state function but simply a new technique for performing an existing function. As Caltrans readily concedes, it has always been responsible for project development of state highway projects. Under the statute as revised in Chapter 433, the state remains responsible for financing and controlling all project development work covered by section 14130 et seq. Chapter 433 simply expands Caltrans' power to contract with private entities to perform that work. We cannot accept Caltrans' legal Conclusion that an \"enriched\" blend of private contracting to meet responsibilities historically discharged by Caltrans' employees creates a \"new state function\" within the meaning of that test as explicated in California State Employees Assn. v. Williams, supra, 7 Cal. App. 3d 390.\n\nWe are not unmindful of the \"'well settled [rule] that the legislative determination that the facts exist which make the law necessary, must not be set aside or disregarded by the courts, unless the legislative decision is clearly and palpably wrong and the error appears beyond reasonable doubt from facts or evidence which cannot be controverted, and of which the courts may properly take notice.' ( In re Miller [1912] 162 Cal. 687, 696 [124 P. 427]; see, also, Jardine v. City of Pasadena [1926] 199 Cal. 64, 72 [248 P. 225, 48 A.L.R. 509].)\" ( Lockard v. City of Los Angeles (1949) 33 Cal. 2d 453, 461, 202 P.2d 38, cert. denied 337 U.S. 939 [93 L. Ed. 1744, 69 S. Ct. 1516].) Nevertheless, we reject the Legislature's \"new state function\" declaration for two reasons. First, it is not a finding of a legislative fact but a legal Conclusion. Second, even if a legislative fact, given Caltrans' concession of its historical responsibility for project development, it is \"palpably wrong.\" ( Lockard v. City of Los Angeles, supra, 33 Cal. 2d at p. 461.)\n\nCaltrans alternatively argues Chapter 433 outlines a new, \"experimental\" technique for performing an existing function, which can itself constitute a new state function within the meaning of Article VII.\n\nIn Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th 585, the court considered whether the civil service mandate of Article VII was violated by section 143 of the Streets and Highways Code. That section authorizes Caltrans to contract with private developers for the construction and operation of tollways under lease with the state. Pursuant to this authority, Caltrans entered into contracts for the development and construction of four \"demonstration projects.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The court concluded these agreements fell outside the state civil service mandate as they involved a new state function. The court explained: \"Without question Caltrans engineers could design the roads in question and other civil servants could construct them. Nor are the design and construction of roads[] new state functions or activities. But appellants take too literal an approach when they say that the demonstration projects do not translate into a new state function under Williams. As the trial court correctly pointed out, the novelty of the contracts and legislation lies in the privatization of project financing and management. After all, the private sector, not the state, will pay for the services engaged pursuant to the exclusive franchise agreements.\n\n\"Under section 143 and the agreements, the state is embarking on a new experimental program enlisting private financing, design, construction and operation of transportation facilities to solve state transportation needs that cannot be met with available public revenue. We agree with the trial court that the constitution does not discourage this experiment. Indeed, to strike down these efforts would denigrate a key purpose of the civil service mandate -- to promote efficiency and economy in state government. Of course these efficiencies and economies remain to be proven, but the very purpose of the demonstration projects is to explore the feasibility of the private financing/management approach.\" (13 Cal. App. 4th at pp. 593-594, fn. omitted.)\n\nThe Professional Engineers court permitted Caltrans essentially to privatize a portion of its historic functions on an experimental basis on the premise state funding for such activities was no longer available. Although the court described this as a new state function, in reality it was a partial suspension of an existing function. In a footnote, the court observed no case has ever prohibited the state from transferring an existing state function to private hands where no public funds are used. (13 Cal. App. 4th at p. 593, fn. 4.)\n\nJust as the state may expand existing functions to meet new demands or circumstances, it may also eliminate functions as conditions warrant. Government bureaucracy is not fated forever to expand, assuming dominion over an ever increasing set of tasks previously performed by the private sector or left undone. In times of shrinking budgets, the state may, and indeed must, reduce or eliminate services in order to survive. (See Calif. State Employees Assn. v. State of Calif., supra, 199 Cal. App. 3d at p. 853.) Professional Engineers v. Department of Transportation, supra, provides an example of such prudent government action.\n\nChapter 433 is not a temporary transfer of responsibility for project development work from Caltrans to the private sector. As previously explained, Caltrans remains responsible for financing and controlling the work, but Chapter 433 authorizes more of the work to be contracted out to the private sector. This is neither a new state function nor the elimination of an existing function. The characterization of Chapter 433 as an \"experimental\" measure does not change this fact. An act which is constitutionally infirm cannot be saved from condemnation merely by calling it experimental. (See New State Ice Co. v. Liebmann (1932) 285 U.S. 262, 279 [76 L. Ed. 747, 754, 52 S. Ct. 371].)\n\nVI\n\nAlthough Chapter 433 does not create a new state function within the meaning of Williams, this does not necessarily render it unconstitutional. As previously explained, government contracting with the private sector is prohibited only when contrary to the policies underlying Article VII. Those policies are \"to encourage efficiency and economy in state government\" and \"to eliminate the 'spoils system' of political patronage.\" ( Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th at p. 592.)\n\nIn California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d 840, we enlarged upon the interrelationship between the objective of efficiency and economy and the \"nature of the services\" test first announced by the Supreme Court in State Compensation Ins. Fund v. Riley, supra, 9 Cal. 2d 126: \"Under a constitutional scheme which commends efficiency and economy it is reasonable to postulate that at some point a service which is more costly when performed under civil service than when contracted out may on that account be one which cannot be performed satisfactorily, adequately or competently.\" (199 Cal. App. 3d at p. 851.) The history of Article VII demonstrates the voters wished to eliminate political partisanship. \"The voters did not intend, however, to impose upon the state a civil service system which eschews all considerations of fiscal responsibility and economy in favor of an infinitely expanding public payroll.\" (199 Cal. App. 3d at p. 853.)\n\nCalifornia State Employees' Assn. v. State of California, supra, involved a facial challenge to section 19130, subdivision (a), which outlines the circumstances under which a state agency may enter into personal service contracts with private parties. That provision read in relevant part: \"Personal services contracting is permissible to achieve cost savings when all the following conditions are met: (1) The contracting agency clearly demonstrates that the proposed contract will result in actual overall cost savings to the state, . . . (2) Proposals to contract out work shall not be approved solely on the basis that savings will result from lower contractor pay rates or benefits. . . . (3) The contract does not cause the displacement of civil service employees. . . . (4) The contract does not adversely affect the state's affirmative action efforts. (7) The contract is awarded through a publicized, competitive bidding process. . . . (11) The potential economic advantage of contracting is not outweighed by the public's interest in having a particular function performed directly by state government.\" ( § 19130; 199 Cal. App. 3d at pp. 844-845.)\n\nBecause of the restrictions placed on outside contracting by section 19130, we found no conflict with the purposes of Article VII: \"Far from displacing or destroying the constitutional scheme, subdivision (a) of section 19130 is carefully crafted to permit personal service contracts to achieve cost savings only when they will have no detrimental effect on the integrity of the civil service system. Thus it requires more than a demonstration of cost savings to satisfy subdivision (a); it must also satisfactorily be shown that civil service objectives are protected, including maintenance of state pay rates, nondisplacement of civil service employees, affirmative action, and nondiscrimination. The statute combines considerations of efficiency and economy with other interests, including those of state employees.\" (199 Cal. App. 3d at p. 846, citations omitted.)\n\nCalifornia State Employees' Assn. v. State of California, supra, stands for the proposition that work which is part of an existing state function and involves the types of services traditionally performed by civil service employees may nevertheless be contracted out if to do so will result in greater efficiency and economy without compromising the integrity of the civil service.\n\nVII\n\nThe superior court found a number of provisions of Chapter 433 facially unconstitutional, to wit: section 14130, subdivisions (a)(1), (a)(4), (a)(5), and (d); section 14130.1; section 14130.2, subdivision (a)(2); section 14130.3; and section 14137.\n\nSection 14130.1 authorizes Caltrans to contract out for engineering services necessary to complete the \"seismic safety retrofit program.\" (See also § 14130, subd. (c).) Section 14130.2 authorizes contracting out for engineering services for projects financed by local jurisdictions. (See also § 14130, subd. (c).) Section 14137 requires executory contracts with private contractors, including minority, women, and disabled veteran owned firms, to be continued to completion without termination. Section 14130, subdivision (c) authorizes contracting out for state highway projects funded by federal and state moneys to ensure timely and cost-effective project delivery. The efficacy of these authorizations depends on whether the legislative findings and declarations purporting to justify them are adequate to dispel constitutional concerns.\n\nThe remaining parts of Chapter 433 found to be unconstitutional consist of the legislative findings and declarations justifying the statute's authorizations to contract out. Section 14130.1 declares engineering services necessary to complete the \"seismic safety retrofit program\" shall be considered a \"short-term workload demand.\" Section 14130.3 finds that the burden of judicially ordered termination of contracts awarded to private sector consultants falls disproportionately upon minority, women and disabled veteran owned firms; is inconsistent with public contract goals; and, unless reversed, will result in the loss of 1,200 jobs in California.\n\nIn section 14130 the Legislature finds and declares that a compelling public interest exists in capturing and timely using all available highway construction funds, whether federal, state, local or private (subd. (a)(1)); that maximal use of such funds requires a comprehensive and integrated highway construction plan in place (subd. (a)(2)); that the volatility of such revenues creates significant workload fluctuations which will necessitate costly short-time hiring and layoff absent the flexibility provided by outside contracting and cooperative agreements with local public agencies to supplement Caltrans' staff (subd. (a)(3)); and that contracting out has permitted Caltrans substantially to enhance its productivity and must continue unabated in order for Caltrans to meet its commitments, failing which Caltrans will not be able to perform project delivery \"adequately, competently or satisfactorily\" (subd. (a)(4)). In section 14130, subdivision (d), the Legislature expressly excuses Caltrans from maximum utilization of state employees to perform engineering and related services and from hiring to a level that can be productively used and assimilated. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe superior court concluded that Chapter 433 is constitutionally flawed because it authorizes outside contracting \"without a factual showing that the contracts are permissible under Article VII.\" This Conclusion is a summary statement of the court's more detailed critique of the legislative findings and declarations contained in Chapter 433, which the court concludes provide inadequate justification for that statute's authorizations to contract out. As will appear, we disagree with the court's critique.\n\nThe superior court expressly rejected the legislative findings in section 14130, subdivision (a)(4) in favor of its earlier finding preceding enactment of Chapter 433, which finding the court judicially noticed, that any inability of staff to perform project delivery adequately, competently, or satisfactorily has been caused by Caltrans' \"policy and practice since the 1980s of maintaining civil service staff at a level inadequate to perform the workload . . . .\" Furthermore, according to the court, section 14130, subdivision (a)(4) \"unreasonably generalizes the inadequacy of the civil service\" as it is not based on actual workloads or staffing for particular fiscal years. The court also concluded that section 14130, subdivision (d) \"detracts from the constitutional civil service mandate in Article VII.\" As will be explained, in reaching these Conclusions the trial court ignored legislative findings justifying the maintenance of Caltrans' staff at levels that will not necessitate costly short-term hirings and layoffs due to workload fluctuations resulting from the volatility of funding sources. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nTurning to the seismic safety retrofit provisions of Chapter 433, the superior court concluded section 14130.1, considered in the context of sections 14130, subdivision (a)(3) and 14134, subdivision (a)(2), cannot justify contracting out such work. Section 14130.1, subdivision (b) declares in effect that engineering services necessary to complete the seismic safety retrofit program are \"a short-term workload demand.\" Section 14130, subdivision (a)(3) declares additional flexibility in outside contracting is necessary to maintain a stable work force and to avoid unnecessary costs of short-term hirings and layoffs. Section 14134, subdivision (a)(2) lists as a guideline for determining the appropriateness of outside contracting: \"Reducing short-term fluctuations in the department's workload relating to project study reports, project development, surveying, and construction inspection while still enabling the department to be plan-ready.\" Read together, these provisions authorize contracting out of seismic safety retrofit work. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe superior court concluded, contrary to the legislative finding, seismic safety retrofit work is no more short-term than any other work performed by Caltrans and is subject to unavoidable delays and unanticipated expansions. The court concluded outside contracting of such work cannot be justified by its characterization as short-term.\n\nThe superior court also determined that section 14130.2, subdivision (a)(2), relating to locally funded projects, is unconstitutional as in derogation of the civil service mandate. This provision permits Caltrans to ignore engineering services necessary for performing work on such projects in determining staffing needs. The superior court judicially noticed its earlier order of May 18, 1993, in which it concluded Caltrans has historically used civil service staff to perform such work and, notwithstanding the legislative finding to the contrary regarding the volatility of revenue sources ( § 14130, subd. (a)(3)), \"questioned Caltrans' premise that highway improvement work reimbursed by public agencies from local sales tax revenues is too unpredictable to be considered to any extent in determining project development staffing needs.\"\n\nThe final part of Chapter 433 which the superior court determined to be unconstitutional relates to the continuation of existing contracts as directed by section 14137 based, inter alia, on the legislative findings and declarations in section 14130.3. The superior court concluded these provisions are unconstitutional for lack of a factual basis establishing such contracts are permissible under Article VII. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn concluding Chapter 433 is unconstitutional on its face, the superior court disagreed with and rejected contemporaneous express and implied legislative findings that certain engineering and related services cannot be performed adequately, competently or satisfactorily by civil service staff ( § 14130, subd. (a)(4)), and that engineering services necessary to complete the seismic safety retrofit program are a short-term workload demand ( § 14130.1, subd. (b)). According to the superior court, Caltrans \"[did] not produce[] credible evidence to demonstrate that contracting has become an effective tool to manage temporary, short-term peaks in workload since the trial of this matter, when they failed to produce such evidence.\"\n\nThe superior court's analysis violates basic principles of judicial review of a legislative enactment. \"'In considering the constitutionality of a legislative act we presume its validity, resolving all doubts in favor of the Act. Unless conflict with a provision of the state or federal Constitution is clear and unquestionable, we must uphold the Act.'\" ( Amwest Surety Ins. Co. v. Wilson (1995) 11 Cal. 4th 1243, 1252-1253, 906 P.2d 1112, citations omitted.) \"'\"Legislative power, except where the constitution has imposed limits upon it, is practically absolute; and where limitations upon it are imposed they are to be strictly construed, and are not to be given effect as against the general power of the legislature, unless such limitations clearly inhibit the act in question.\"'\" (11 Cal. 4th at p. 1255.)\n\nA party challenging the constitutionality of a legislative provision has the burden of rebutting the presumption of validity. ( City of Walnut Creek v. Silveira (1957) 47 Cal. 2d 804, 811, 306 P.2d 453.) \"In construing [a] challenged statute, '\" . . . 'all presumptions and intendments favor [its] validity . . . and mere doubt does not afford sufficient reason for a judicial declaration of invalidity. Statutes must be upheld unless their unconstitutionality clearly, positively and unmistakenly appears. . . .'\"' ( In re Ricky H. (1970) 2 Cal. 3d 513, 519 [86 Cal. Rptr. 76, 468 P.2d 204].) Courts may not substitute their social and economic beliefs for the judgment of the Legislature elected by the people to enact appropriate regulatory legislation. ( Ferguson v. Skrupa (1963) 372 U.S. 726, 730 [10 L. Ed. 2d 93, 97, 83 S. Ct. 1028, 95 A.L.R.2d 1347].) Nor do courts sit as superlegislatures to determine the wisdom, desirability or propriety of statutes enacted by the Legislature. (Estate of Horman (1971) 5 Cal. 3d 62, 77 [95 Cal. Rptr. 433, 485 P.2d 785], cert. den. 404 U.S. 1015 [30 L. Ed. 2d 662, 92 S. Ct. 672]; People v. Hurd [1970] 5 Cal. App. 3d 865, 877, 85 Cal. Rptr. 718.)\" ( Goodman v. Cory (1983) 142 Cal. App. 3d 737, 741-742, 191 Cal. Rptr. 272.)\n\n\"'Legislative findings, while not binding on the courts, are given great weight and will be upheld unless they are found to be unreasonable and arbitrary.'\" ( Amwest Surety Ins. Co. v. Wilson, supra, 11 Cal. 4th at p. 1252.) \"In passing upon the validity of legislation . . . 'the rule is well settled that the legislative determination that the facts exist which make the law necessary, must not be set aside or disregarded by the courts, unless the legislative decision is clearly and palpably wrong and the error appears beyond reasonable doubt from the facts or evidence . . . .'\" ( Lockard v. City of Los Angeles, supra, 33 Cal. 2d at p. 461.)\n\n\"The presumption of constitutionality accorded to legislative acts is particularly appropriate when the Legislature has enacted a statute with the relevant constitutional prescriptions clearly in mind. In such a case, the statute represents a considered legislative judgment as to the appropriate reach of the constitutional provision. Although the ultimate constitutional interpretation must rest, of course, with the judiciary, a focused legislative judgment on the question enjoys significant weight and deference by the courts.\" ( Pacific Legal Foundation v. Brown, supra, 29 Cal. 3d at p. 180.) \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThere is nothing in the record to support the superior court's Conclusion, implied by its holding of unconstitutionality, that the Legislature was clearly and palpably wrong in its findings and declarations concerning the volatility of highway construction revenue sources as a cause of workload fluctuations; the costliness of short-term hirings and layoffs caused by such fluctuations; the avoidance of such costs and the enhancement of productivity realized by contracting out to the private sector work which state employees could not otherwise perform economically and efficiently i.e. adequately, competently or satisfactorily; and the short-term nature of engineering services associated with the seismic safety retrofit program.\n\nThe burden is not on Caltrans to prove the facts support the legislative determination but on plaintiffs, i.e. those who attack the statute, to prove they do not. Judicial notice of prior factual determinations of the superior court does not satisfy plaintiffs' burden inasmuch as circumstances may have changed in the interim.\n\nFollowing the enactment of Chapter 433, plaintiffs filed an application in the superior court for an order holding Caltrans in contempt for violating the 1990 injunction. In support of the application, plaintiffs submitted declarations discussing Caltrans' past and projected contracting practices, a planned reduction in civil service staff through attrition, and the relative costs of using consultants compared with using civil service employees. The court denied plaintiffs' application but indicated it would treat the matter as a motion for clarification or modification of the injunction and directed the parties to brief and argue \"whether the enactment of Chapter 433 warranted modification of the injunction.\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In response Caltrans moved to dissolve the injunction. The parties briefed the matter as directed and submitted further declarations.\n\nIn its order denying Caltrans' motion, the superior court concluded section 14130, subdivision (a)(4) \"unreasonably generalizes the inadequacy of civil service [staff]\" based on staffing shortages which were artificially maintained. According to the superior court, the legislature \"necessarily\" concluded staff was inadequate \"without determining the facts essential to a finding of whether civil service staff can adequately deliver the workload of highway projects,\" i.e. whether additional staff can be obtained to increase project delivery as much as outside contracting.\n\nThere is nothing in the record to support the superior court's assertion the Legislature failed to consider whether additional civil service staff could be obtained to perform the project delivery work adequately, competently or satisfactorily. The court may not simply rely on its finding preceding enactment of Chapter 433 that any inadequacy of staff was caused by a policy and practice of maintaining staff at an artificially low level. The undisputed fact remains, as found by the Legislature, that at the time Chapter 433 was enacted staff was inadequate to perform the work. Regardless of the reasons why this condition had existed, the Legislature was not precluded from legislating based on then-existing circumstances. There is nothing in the record to refute the implicit legislative finding that sufficient additional staff could not be obtained on a cost-effective basis. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe superior court concluded the characterization of the seismic safety retrofit program as a short-term workload demand has limited significance inasmuch as the length of the program is comparable to other projects performed by civil service staff and the legislative determination does not take into consideration available or obtainable civil service staff. The reasoning of the superior court in this regard is flawed. Although it may be true the length of the seismic safety retrofit program is comparable to that of a typical Caltrans construction project, this does not alter the fact that this particular program, unlike the ongoing general construction workload of Caltrans, has a finite life. Presumably, after all bridges are retrofitted as needed, the program will terminate. Thus it is not unreasonable for the Legislature to find it would be more economical to contract out such work than to hire additional staff who must then be laid-off when the short-term retrofit program is completed.\n\nIn concluding Caltrans did not take into consideration available and obtainable staff, the superior court was persuaded by the fact, judicially determined, that Caltrans had been doing most of the seismic safety retrofit work with civil service staff rather than outside contractors. However, this reasoning presumes there is something unique about the seismic safety retrofit work other than its finite life. On the contrary, there is nothing in the record to suggest such work is any different from other Caltrans projects. The critical factor for purposes of staffing is that for a finite period Caltrans' overall workload has been increased by virtue of the seismic safety retrofit program. It matters not how Caltrans allocates its staff to individual tasks. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe superior court concluded section 14137 is unconstitutional as it overrides the court's earlier determination that the designated contracts \"were not justified by facts satisfying the criteria for contracting under section 14130, et seq.\" This Conclusion also is unsupportable. In its earlier determination, the superior court did not conclude the designated contracts violate the civil service mandate. Rather, the court concluded Caltrans violated Article VII by entering into contracts outside state civil service \"without factually establishing that it could not timely perform the work by hiring and training additional civil service professionals or that contracting was an effective method of meeting short-term peaks in the Caltrans state highway project workload.\" In other words, there was never a determination the facts show the contracts violate Article VII; there was only a failure of proof at the time. The court left open the possibility Caltrans may justify outside contracting in the future on a contract-by-contract basis. The court entered an injunction specifically prohibiting Caltrans from contracting outside state civil service \"unless and until [it] demonstrates the existence of facts which satisfy the criteria for [outside contracting].\" \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIn section 14137, the Legislature has found the facts and circumstances justify each of the designated contracts. In effect, the Legislature has relieved Caltrans of the burden of presenting evidence to justify the individual contracts. In so doing, the Legislature has not overridden the superior court's earlier determination but has supplied the factual basis the superior court determined was lacking. Consistent with the previously discussed rules of judicial review of legislative enactments, we presume the facts and circumstances support the Legislature's implied findings absent contrary evidence.\n\n\"The history of . . . Article[] demonstrates the voters wished to adopt a civil service system free from the whims of political partisanship and appointment. The voters did not intend, however, to impose upon the state a civil service system which eschews all considerations of fiscal responsibility and economy in favor of an infinitely expanding public payroll. Rather, the Legislature was entrusted to consider various alternatives with regard to civil service administration. In devising such alternatives, the Legislature may not ignore the purposes behind the constitutional civil service system; neither, however, must it abdicate fiscal responsibility and forego opportunities to realize substantial savings to the taxpayers. The goal of maintaining the civil service must be balanced with the goal of a fiscally responsible state government.\" ( California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 853.)\n\nThe Legislature has determined that certain highway construction work, even though part of existing state functions traditionally performed by state employees, cannot, under conditions it has now found to exist, be performed adequately, competently or satisfactorily by state employees, but can be performed efficiently and economically if contracted out to the private sector. This is entirely consistent with the civil service mandate, a key purpose of which is to encourage efficiency and economy in state government. ( Calif. State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 851.)\n\nFurthermore we are satisfied the provisions of Chapter 433 do not impair the integrity of the civil service and are consistent with the policy of the civil service mandate to eliminate the spoils system by ensuring that appointments to public service are based on merit. Section 14101, to which Chapter 433 is subject, directs Caltrans to contract outside civil service when \"the obtainable staff is unable to perform the particular work within the time the public interest requires such work to be done.\" Section 14131 prohibits the displacement of any permanent, temporary, or part-time civil service employee and section 14132 requires compliance with affirmative action goals. Although competitive bidding is not required, contracts with private entities must be based on professional qualifications and demonstrated competence for the work in question. ( §§ 4526, 14132.1, 14133.) Finally, Caltrans is required to ensure that \"the cost effectiveness of contracting [out] is considered equally with other factors when a determination of appropriateness of contracting [out] is made\" ( § 14134, subd. (a)(4)); that \"contract selection is performed in accordance with applicable state laws regarding the selection of professional architectural, engineering, environmental, or land surveying services\"; and that \"the selection process avoids or prohibits unlawful or unfair procedures or activities\" ( § 14134, subd. (a)(5)). (Cf. California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 846.)\n\nAs with the statute at issue in Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th 585, a purpose of Chapter 433 is to determine the economic viability of contracting certain work to the private sector. Caltrans is required to submit a report to the Legislative Analyst by September 1, 1996, comparing projects using primarily civil service staff with similar projects using primarily outside consultants. (Ch. 433, § 13.) As long as legislation does not present a risk of reintroducing the spoils system to state government, the Legislature must be given reasonable latitude to experiment with different methods of job performance. We are satisfied the safeguards contained in the statute adequately respect and protect the integrity of the state civil service mandate.\n\nVIII\n\nAs we read it, Chapter 433 requires continuation of certain preexisting contracts with private entities for project development and related services, authorizes contracting out for engineering and related services with respect to the seismic safety retrofit program ( § 14130.1) and locally funded projects ( § 14130.2), and authorizes contracting out for project development services, including project study reports, project development, surveying, and construction inspection ( § 14130, subds. (a)(3), (b)), on state highway projects funded by federal and state moneys in order to ensure timely and effective project delivery. ( § 14130, subd. (c).) The statute of which Chapter 433 is a part also authorizes Caltrans to apply the statutory guidelines and criteria for contracting out \"to the total project development program for the fiscal year [without any] further requirement to identify or refer to specific facts or guidelines which justify contracting out regarding individual contracts.\" ( § 14131; see also § 14130.2, subd. (b).)\n\nThe 1990 injunction prohibits: (a) outside contracting for project development services absent a showing of facts which satisfy the criteria for contracting under sections 14101 and 14130 et seq.; (b) cooperative agreements with local public entities pursuant to Streets and Highways Code section 114 where some or all of the work is to be performed by private consultants; and (c) outside contracting for construction survey staking. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nChapter 433 is constitutional on its face. Whether it is now or will be applied constitutionally or consistent with its terms are questions which are not before us. We do note that the activities prohibited by the 1990 injunction preceded the enactment of Chapter 433 and would appear to be consistent with the objects and purposes of that statute as set out expressly in legislative findings and declarations, the underlying factual bases of which were not competently challenged in the superior court. As such, they may not be enjoined absent a showing the statute is improperly applied contrary to its terms or in derogation of the civil service mandate. Since the 1990 injunction and the factual findings and legal Conclusions upon which it rests deal with the activities of Caltrans under a statutory scheme which has been substantially altered by Chapter 433, the injunction must be dissolved. (See Salazar v. Eastin, supra, 9 Cal. 4th 836, 850.) \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe judgment (order) is reversed and the matter remanded to the trial court with directions to enter an order dissolving the 1990 injunction and to take such further proceedings as are required by law. The Department of Transportation and its Director are to receive their costs on appeal.\n\nMORRISON, J., Concurring.\n\nBLEASE J.; Dissenting:\n\nThe majority opinion concedes that if Chapter 433 authorizes the Department of Transportation (Caltrans) to contract out when it is neither a cheaper nor a faster means to deliver highway projects, then it violates the constitution's civil service mandate. (Cal. Const., art. VII, § 1; hereafter article VII.) The opinion also concedes that Chapter 433 could be used to let such contracts, in violation of the constitution. However, it argues that \"on its face\" Chapter 433 does not authorize such action because the Legislature impliedly found that contracting out would be cheaper. For this reason it reverses the trial court's order and directs that the court dissolve an injunction which prohibits contracting out unless Caltrans can demonstrate that is a cheaper or faster mode of project delivery.\n\nThe majority's novel and implied finding was never advanced by Caltrans as a justification for contracting out and is unwarranted. I agree with the trial court that Chapter 433 authorizes Caltrans to contract out in violation of the constitution's civil service mandate. If, however, the majority is correct and Chapter 433 does not authorize contracting out regardless whether that is a cheaper or faster mode of project delivery, then it does not conflict with the injunction. For that reason, even under the majority view, the trial court did not err in refusing to dissolve the injunction.\n\nINTRODUCTION\n\nIn this case a complex web of judicial decisions, executive actions, and legislation stems from a state policy to contract out in violation of article VII.\n\nHistory has shown that patronage hiring of public employees corrupts the political process, leads to waste, and depletes the quality of the public workforce. The People enacted article VII of the State Constitution to avoid this. Early on the California Supreme Court recognized that the civil service provisions will not work if the merit appointment system can be circumvented by simply contracting out civil service jobs. \"To give effect to the constitution it is as much the duty of the courts to see that it is not evaded as that it is not directly violated.\" ( Sheehy v. Shinn (1894) 103 Cal. 325, 340, 37 P. 393.)\n\nAccordingly, case law under article VII prohibits the state from contracting out work traditionally performed by civil service employees unless it can show compliance with criteria developed to avoid the resurgence of patronage. A key safeguard is that civil service work cannot be contracted out when it can be performed by the existing civil service staff or by hiring more civil service staff without proof that it is more economical or efficient to do so.\n\nIn this case an organization of civil service employees, Professional Engineers in California Government (Plaintiffs), brought an action to enjoin Caltrans from contracting out highway design and construction inspection work in violation of this safeguard against patronage. Caltrans attempted to justify the contracts as authorized by Government Code section 14101 \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and by the (then) newly-enacted sections 14130-14135. The case proceeded to trial.\n\nThe trial court found that Caltrans was contracting out in violation of article VII. It found that civil service engineers traditionally performed the work, that it could be accomplished in a timely manner by hiring of more engineers subject to civil service, and that the justifications proffered by Caltrans lacked any factual basis. Caltrans did not justify the practice of contracting out as cost effective.\n\nIn a nutshell, the trial court found the reasons Caltrans asserted to justify contracting out were false. This included the justifications that it was necessary under the original version of section 14130 for timely delivery of highway projects and to avoid the costly process of short-time hiring and layoff. The trial court found that Caltrans was contracting out because the Governor, through the Department of Finance, had ordered that the increase in state government employees be limited, regardless of the Constitution's civil service mandate.\n\nIn light of these findings, the trial court enjoined the practice of contracting out this highway development work. However, the trial court recognized that contracting out was justified if the case law criteria were satisfied. Accordingly, the injunction provides that Caltrans can contract out whenever it can demonstrate that it cannot timely perform the work by hiring civil service employees or that contracting out is a cheaper method of meeting short-term peaks in the Caltrans workload. The judgment of the trial court was not appealed and is final.\n\nAt first Caltrans complied with the injunction. In the ensuing enforcement proceedings Caltrans showed that it could successfully hire and productively use new civil service employees to perform much of the engineering work in a timely manner when it made a good faith effort so to do. The Legislature also initially acquiesced. In Statutes 1991, chapter 313 (Chapter 313), it provided that contracting out should be determined on the basis of the total highway development program ( §§ 14130 et seq.) but provided that civil service employees should be utilized to the maximum extent feasible. It directed that Caltrans shall:\n\n\"(a) Have state employees perform all engineering and related services to the maximum extent required to meet the goals [of the article authorizing contracting out of engineering services].\n\n\"(b) Use every practical means to staff to a level which matches its ability to assimilate and productively use new staff.\" (Stats. 1991, ch. 313, § 1.)\n\nHowever, the impetus to evade the civil service requirement was not spent. The facts adduced in enforcement proceedings show that, after the initial period of progress, Caltrans chose not to comply with the injunction. Despite numerous attempts, Caltrans was unable to demonstrate that, for most of the work contracted out, it was staffing to a level which matches its ability to assimilate and productively use new staff. The orders ensuing from these enforcement proceedings, like the judgment from which they derived, were not appealed and became final.\n\nUnable to make headway with the judicial branch's tiresome requirement that Caltrans produce evidence that contracting out was warranted as cheaper or more efficient, Caltrans sought a sanction from the Legislature for its practice of contracting out. The result is Chapter 433.\n\nChapter 433 overlays the earlier versions of sections 14130 and following with additional findings and declarations. Of greatest significance, Chapter 433 added a wholly inconsistent provision that: \"The department is not required to staff to an internal level that matches its ability to assimilate and productively use new staff.\" (Ch. 433, § 2; § 14130, subd. (d), emphasis added.) Chapter 433 similarly relieved Caltrans of the constitutional responsibility of staffing work traditionally performed by civil service employees in support of locally-financed highway development projects. \"The department is not required to staff at a level to provide services for other agencies.\" (Ch. 433, § 5; § 14130.2, subd. (a)(2), emphasis added.)\n\nHaving secured the passage of Chapter 433, Caltrans first sought to employ it as a shield against enforcement of the injunction, and then, as a sword, to dissolve the injunction. Under cover of the Chapter 433 findings, Caltrans again advanced the same justifications for contracting out which the trial court found were false in the earlier proceedings.\n\nFollowing the passage of Chapter 433, the trial court took further evidence. Based on this evidence and the findings in the earlier proceedings, the court painstakingly responded to each of the claims predicated on Chapter 433 and determined that the enactment does not warrant the dissolution of the injunction.\n\nMy colleagues would reverse the trial court's judgment and permit contracting out without requiring the state to show that it is more economical or efficient than would be the case with civil service staff. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e They concede that some of the findings or declarations enacted in Chapter 433 are completely untenable. Nonetheless, they order the dissolution of the injunction, concluding that other findings and declarations in Chapter 433 provide a facially constitutional authorization for contracting out in contradiction of the injunction.\n\nAs I will show in detail, the majority's analysis starts off on the wrong foot. It ignores the trial court findings which undergird the injunction, yet asserts that Plaintiffs have mounted a facial attack on Chapter 433.\n\nThis stands the litigation on its head. Chapter 433 does not provide a basis upon which to dissolve the injunction unless it applies to and conflicts with it. Perforce, its constitutionality must be measured by the validity of this application.\n\nThe inquiry into the validity of Chapter 433 requires a determination whether the substantive provisions of the enactment, the rules of decision, conflict with the injunction. This requires that these rules of decision be construed to apply to the injunction. The substantive kernel of Chapter 433, applicable to the injunction, is small. It consists of four provisions: (1) that Caltrans need not hire new engineering staff that it can assimilate and productively use, (2) it need not do so regarding services traditionally provided to local government financed projects, (3) the seismic safety retrofit program shall be considered a short-term workload demand, and (4) contracts that were previously ordered terminated in enforcement proceedings in this case be reinstated. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nI agree with the trial court that these provisions are unconstitutional because they: \"authorize [Caltrans] to privately contract for engineering services to deliver transportation projects whether or not qualified civil service employees are available or obtainable to timely perform the services.\"\n\nThe majority addresses only one of these provisions, that Caltrans need not staff to a level matching its ability to assimilate and productively use new staff. In a footnote they concede that this provision \"arguably violates the civil service mandate.\" They would avoid the patent conflict by a tortured construction of the term \"productively use.\" They construe \"productively\" to mean \"unproductively\", meaning that Caltrans need not employ new staff where that is more costly than contracting out. Presumably the majority would apply the same tortured reasoning to save the provision which frees Caltrans from the obligation to provide traditional services to locally financed projects.\n\nAs noted, the construction is wholly insupportable in light of the history of the provision and the unchallenged findings which undergird the trial court's injunction.\n\nIronically, if the majority's reading is correct, it eviscerates Caltrans's claim that Chapter 433 conflicts with the injunction. The injunction already permits Caltrans to contract out when it can show that contracting out is more productive, that it saves money, or is required for the timely delivery of highway projects. If that is what Chapter 433 authorizes, it does not change the law in any way which conflicts with the injunction.\n\nAt its root, the majority's rationale is that the injunction must be dissolved because the Legislature has made an implied finding that the contracting out for engineering services is cheaper than hiring sufficient civil service staff for the task. This premise is untenable in light of the history of the litigation and the statutes considered as a whole. This is evidently the reason why Caltrans never advanced this as a ground for dissolving the injunction.\n\nIf, however, the majority opinion is correct that Plaintiffs failed to carry a burden to prove that contracting out is more costly, it would justify no more than a remand to the trial court to provide an opportunity to carry the burden. It is manifestly unfair to saddle Plaintiffs, who prevailed in the trial court, with a burden of proof nunc pro tunc on appeal.\n\nNo one heretofore suggested that Chapter 433 is predicated on such a rationale and that Plaintiffs had such a burden of proof. There is no reason to suppose that the Plaintiffs could not carry this burden of proof if required. Indeed, the evidence adduced in the enforcement proceeding following the enactment of Chapter 433 already supports that Conclusion.\n\nAccordingly, even under the majority's incorrect view, the maximum relief to which Caltrans is entitled is a remand for a retrial on the issue of whether the injunction should be dissolved.\n\nI amplify these matters in the Discussion to follow. I take as a factual predicate the findings of the trial court in support of the injunction. I include as appendices the decision issued by the trial court in support of the original final judgment in this matter (App. I, pp. 1-28) and its carefully reasoned order denying the motion to dissolve the injunction imposed by the earlier final judgment. (App. II, pp. 1-27.) I incorporate these orders in this opinion and ask that they be viewed as a statement of facts and procedural background. The orders lay out the history of the litigation and the adjudication of law and of fact upon which the order under appeal rests. They entirely dispel the core premises of the majority.\n\nI. THE TRIAL COURT FINDINGS\n\nThe trial court's orders disclose that in 1990 it enjoined \"Caltrans and its director from contracting outside the state civil service for project development services under sections 14101 or 14130 et seq. of the Government Code unless and until they demonstrate the existence of facts which satisfy the criteria for contracting under sections 14101 and 14130 et seq.\" (App. I, p. 27.)\n\nThe trial court expressly upheld these Government Code provisions as facially constitutional. \"The contractual authority of Caltrans under sections 14101 and 14130 et seq. of the Government Code does not facially violate article VII of the California Constitution.\" (App. I, p. 27; emphasis added.) The court explained that \"contracts let under either section 14101 or 14130 et seq. are hedged with significant safeguards against the political patronage and favoritism that characterized the spoils system of employment . . . . By express provision under section 14130 et seq. ( § 14131) [ \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e] and by necessary implication under section 14101[ \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e], civil service employees may not be displaced by the contracts.\" (App. I, p. 20.)\n\nHowever, the court found, based upon facts adduced in a seven day trial, that these statutes had been applied by Caltrans and the executive department to contract for services that could be competently and efficiently performed by civil service employees in violation of the civil service mandate of article VII. (App. I, p. 20.)\n\n\"The Court finds that Caltrans contracted for project development and construction inspection services as a direct result of a gubernatorial/executive branch policy against the expansion of state government. Caltrans contracted for the performance of these services, not because it was unable to obtain and hire new civil service employees to perform the services, but because Caltrans'[s] requests for additional staff were refused by the Department of Finance from 1983-84 through 1986-87.\" (App. I, p. 21.)\n\n\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nNo appeal was taken from the 1990 judgment. No one suggests a basis for collateral attack on that judgment. No one suggests a basis to avoid issue preclusion as to matters adjudicated in that judgment.\n\nThe 1990 judgment was followed by extensive and recurrent compliance proceedings which resulted in additional findings of fact and law. For example, the trial court determined that when Caltrans initially sought to comply with the 1990 judgment, defendants \"were able to hire, assimilate and productively use qualified staff.\" (App. II, p. 20.) It entered enforcement orders that affirmed certain of the Caltrans's contracts and invalidated others, specifically recognizing that Caltrans would require time to eliminate its staff shortages. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAs related, these orders were not appealed and their embedded findings are also not in dispute.\n\nFollowing the enactment of Chapter 433, the court entered the order under review and took evidence on defendants' motion to dissolve the injunction. It found, among other things, that the \"information provided to the Court by defendants indicates that their contracting activity during 1993-94 is contributing to the displacement of permanent, temporary and part-time civil service staff in the performance of project development work.\" (App. II, p. 12.) For this reason the court reaffirmed the injunction which it issued in 1990.\n\nCaltrans does not challenge the new findings. Their sole challenge to the injunction is based on Chapter 433, necessarily implying that the injunction conflicts with the enactment.\n\nII. THE CASE LAW STANDARDS FOR CONTRACTING OUT.\n\nThe place to begin a detailed evaluation of Caltrans' claims is with the case law which governs contracting out in compliance with article VII.\n\nThere are four pertinent Supreme Court decisions. In State Compensation Ins. Fund v. Riley (1937) 9 Cal. 2d 126, 69 P.2d 985, the court denied a mandamus to compel payment to an attorney hired as an independent contractor to represent the fund, notwithstanding that the fund had its own regularly appointed counsel. The court said that what was \"not alleged\" was that the \"services here involved could not be rendered by one selected under the provisions of the Civil Service Act . . . .\" ( Id. at pp. 134-135.) The court said:\n\n\"The true test is not whether the [attorney] is an 'independent contractor' or an 'employee', but whether the services contracted for . . . are of such a nature that they could be performed by one selected under the provisions of civil service. If the services could be so performed then . . . it is mandatory upon [the] appointing power to proceed in accordance with the provisions of the Constitution . . . .\" ( Id. at p. 135; emphasis added.)\n\nThe services could have been provided by the civil service, said the court, since \"attorneys are included within civil service . . . .\" (Ibid.)\n\nThis rule was repeated in Burum v. State Compensation Ins. Fund (1947) 30 Cal. 2d 575, 580, 184 P.2d 505, which also arose on the pleadings. The court, ruling on the pleadings, held a contract for attorneys' services did not violate article VII since it was alleged that the particular services in question \"'could not be performed adequately or competently or satisfactorily' by attorneys selected under civil service . . . .\" ( Id. at p. 582.)\n\nTwo other Supreme Court decisions fill out the authority which is binding upon us, San Francisco v. Boyd (1941) 17 Cal. 2d 606, 110 P.2d 1036, and Kennedy v. Ross (1946) 28 Cal. 2d 569, 170 P.2d 904. In both cases, which arose under the specific civil service provisions of the San Francisco charter, the court found that the services at issue were not within the civil service positions given protection in the charter. In that sense they were new functions, not covered by the charter.\n\nIn Boyd the court held that a contract for the temporary services (five years) of a civil engineer to provide the governing board with information relative to traffic conditions was not within the charter, which exempted from the civil service \"persons employed in positions in any department for expert professional temporary services . . . when such positions are exempted from [the] classified civil service . . . by order of the civil service commission.\" The commission had so acted. The court said: \"The proposed contractor is not to be placed in any position provided for by the charter.\" ( San Francisco v. Boyd, supra, 17 Cal. 2d at pp. 618-619.)\n\nThus, Kennedy reached the unstartling Conclusion that \"the provisions of the charter do not foreclose the authorized agency from entering into contracts with individuals for the performance of professional services as independent contractors.\" ( Kennedy v. Ross, supra, 28 Cal. 2d at pp. 572-573.) Kennedy cited to a policy statement in Boyd that the charter provisions show that \"'it was the intention of the framers . . . that civil service should apply only to persons employed in permanent positions in municipal departments to the end that public service should be free from political shifting and control resulting from changes in administration.'\" ( Id. at p. 573; emphasis in original.) Kennedy drew the Conclusion that \"the petitioner and his assistants do not by the contract become city employees in either permanent or temporary positions in the sense intended by the charter provisions.\" (Ibid.) This Conclusion \"is based on the assumption that the engagement outside the list of eligibles . . . are not such as could adequately be rendered by an existing department of the city.\" (Ibid.; emphasis added.) At this point Kennedy cites to Riley as rejecting \"as a conclusive test of the lawful exercise of the power to make an independent contract that the person involved was an independent contractor.\" (Ibid.)\n\nBoyd and Kennedy formed the basis of the leading opinion of this court in California State Employees' Assn. v. Williams (1970) 7 Cal. App. 3d 390, 86 Cal. Rptr. 305. The state had contracted with private carriers to administer the state's Medi-Cal program. As applied to the new services for which the contract was let, Williams rejected the formulation of the so-called \"nature of the services\" test of Riley and Burum, which was described as involving an \"inquiry whether persons performing tasks or exercising skills under the contract are or can be employed through civil service methods.\" ( Id. at p. 396, fn. omitted.) The court said that the Medi-Cal \"contract calls for tasks or skills such as tabulation, compilation, audit, disbursement and office management\" which \"duplicate those routinely performed in civil service agencies . . . .\" ( Id. at p. 397.) It adopted a test attributed to Boyd and Kennedy, which it characterized as a \"new state function\" test. \"Thus the Kennedy case makes a functional inquiry rather than one focused on occupational tasks or skills. To paraphrase Kennedy, if the services cannot be adequately rendered by an existing agency of the public entity or if they do not duplicate functions of an existing agency, the contract is permissible.\" (7 Cal. App. 3d at pp. 396-397.)\n\nWilliams does not depart from Riley and Burum. It simply places new state activities outside the purview of article VII in the same manner as Boyd and Kennedy read the San Francisco charter. It summarized the requirements of article VII in the following manner:\n\n\"The constitutional policy of a merit employment system . . . engenders no demand for achieving expansions of state function exclusively through the traditional modes of direct administration. It does not prohibit legislative experimentation in new forms to fit new functions. It compels expansion of civil service with expansions of state agency structure but does not force expansions of state agency structure to match extensions of state function. To the contrary, the state civil service suffers no displacement and the underlying constitutional policy is not offended when a new state activity is conducted by contract with a separate public or private entity.\" (7 Cal. App. 3d at p. 399.)\n\nIn this context, the phrase \"expansions of state agency structure\" means expansion under the existing functions of the state as contrasted with a \"new state activity\" viewed as an \"extension[] of [a] state function.\" Williams is emphatic that the rule it advances applies only to new state functions. That was the subject of an opinion which it entered on rehearing. The Attorney General had raised the question whether Williams intended to supplant the \"old rule\" of Riley and Burum. The court answered: \"Our opinion in this case specifically declared that we were dealing with a situation not involved in [Riley and Burum], that is, a new state function not previously conducted by any state agency . . . . The 'new rule' is confined to that situation. This court has no authority to supplant the 'old rule' formulated in decisions of the State Supreme Court.\" ( Williams, supra, 7 Cal. App. 3d at p. 401; emphasis added.)\n\nThe next noteworthy case is California State Employees' Assn. v. State of California (1988) 199 Cal. App. 3d 840, 245 Cal. Rptr. 232. We there upheld, against a facial challenge, a provision of Government Code section 19130, which authorizes the contracting out of specified personal services to achieve cost savings without the displacement of civil service personnel. We explicitly noted, in keeping with Riley and Burum, that section 19130 applies only if \"the nature of the services in question is such they cannot be performed 'adequately or competently or satisfactorily' by employees selected through civil service.\" ( Id. at p. 851; emphasis added.) We quoted with approval the statement in Williams that \"'To paraphrase Kennedy, if the services cannot be adequately rendered by an existing agency of the public entity or if they do not duplicate functions of an existing agency, the contract is permissible.'\" ( Id. at p. 849.)\n\nIn California State Employees' Assn. v. State of California, supra, we emphasized several safeguard aspects of the legislation which brought it within this exception. We said that subdivision (b) of section 19130 expressly encompassed the Riley/Burum exception that contracting out was permissible only when \"the services contracted are not available within civil service, cannot be performed satisfactorily by civil service employees, or are of such a highly specialized or technical nature that the necessary expert knowledge, experience and ability are not available through the civil service system.'\" (199 Cal. App. 3d at p. 852.)\n\nWith regard to subdivision (a) of section 19130, which did not contain the Riley/Burum clause, we said that \"the Riley/Burum exception is an implicit part of\" it. ( California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 852.) We further said that subdivision (a) is \"carefully crafted to permit personal service contracts to achieve cost savings only when they will have no detrimental effect on the integrity of the civil service system.\" ( Id. at p. 846.) It requires more than cost savings. \"It must also satisfactorily be shown that civil service objectives are protected, including maintenance of state pay rates . . ., nondisplacement of civil service employees . . ., affirmative action . . ., and nondiscrimination . . . .\" (Ibid.) \"Moreover, subdivision (a) requires cost comparisons, quality controls, and, most importantly, a publicized, competitive bidding process.\" ( Id. at p. 847; emphasis added.) It is important therefore to note that section 19130 does not apply to Chapter 433 ( § 14133, subd. (a)), nor is competitive bidding required ( §§ 14133, subd. (b), 14132.1, 4525). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn California State Employees' Assn. v. State of California, supra, we also noted another safeguard, that contracts must be approved by the State Personnel Board under Public Contract Code section 10337. This requires that there be \"standards and controls adopted by the Board as necessary to safeguard the 'merit employment principles and requirements contained in Article VII . . . .'\" (199 Cal. App. 3d at pp. 852-853.)\n\nThis requirement also does not apply to Chapter 433. The article, of which Public Contract Code section 10337 is a part, \"shall not apply to . . . contracts for architectural and engineering services subject to the provisions of [the article]\" of which section 4525 is a part. (Pub. Contract Code, § 10335.)\n\nThe majority opinion points to Professional Engineers v. Department of Transportation (1993) 13 Cal. App. 4th 585, 16 Cal. Rptr. 2d 599. In Professional Engineers the court held that the projects under review, private toll roads, constituted \"new state functions or activities,\" bringing it under the rationale of Kennedy and Boyd and Williams. ( Id. at p. 593.) For the same reason, in Department of Transportation v. Chavez (1992) 7 Cal. App. 4th 407, this court upheld the provisions of section 19130, subdivision (b)(2), which expressly permits the contracting out of personal services where \"'the contract is for a new state function and the Legislature has specifically mandated or authorized the performance of the work by independent contractors.'\" ( Id. at p. 414.)\n\nProfessional Engineers concerned a contract, authorized by the Legislature, empowering Caltrans to contract with private developers to construct and operate tollway facilities under lease agreements with the state. (13 Cal. App. 4th at p. 589.) Caltrans did so, letting contracts for the development and construction of four demonstration projects. The court upheld the contracts against a constitutional challenge saying that \"the state is embarking on a new experimental program enlisting private financing, design, construction and operation of transportation facilities to solve transportation needs that cannot be met with available public revenue.\" (13 Cal. App. 4th at p. 593.) The court further said that \"the constitution does not discourage experimentation. Indeed, to strike down these efforts would denigrate a key purpose of the civil service mandate -- to promote efficiency and economy in state government.\" (13 Cal. App. 4th at pp. 593-594, fn. omitted.)\n\nThe majority opinion characterizes Professional Engineers as permitting \"Caltrans essentially to privatize a portion of its historic functions on an experimental basis on the premise state funding for such activities was no longer available.\" Be that as it may, the rationale has no application to this case. This is not a case of privatization of an existing state function. Nor does it, as the majority concedes, involve a new state function. There is no cessation of state funding; state funds are at stake. Rather, Chapter 433 advances a scheme by which public moneys, available for the hiring of civil service employees, is to be spent on contracting out.\n\nI distill from the case law the rule that the contracting out of work traditionally performed by civil service staff is not permissible unless the government (or other proponent of the contract) can prove that contracting out is more economical or efficient. Even where cost savings can be demonstrated, it must also be demonstrable that contracting out is constrained by safeguards to prevent inroads on the integrity of the civil service. In particular, to inhibit patronage, the contracting out of traditional civil service work should not be within the unfettered discretion of a public official; arguably, it must be subject to an open publicized competitive bidding process.\n\nThe majority opinion would permit contracting out without adherence to any of the safeguard criteria developed in the case law. This total break with precedent is not warranted by Chapter 433. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e It is questionable whether a statute constitutionally could expressly bar the application of these safeguards. \"The primary purpose of a constitution is to place limitations upon the legislative authority as well as upon the powers of its co-ordinate branches of government. When, instead of forbidding an act, it contains a provision prescribing a course to be pursued by a department, board, commission, or an official, all statutes must be consonant therewith and any resolution, order or decree contrary to such provision by whatsoever body ordained is void.\" ( Allen v. State Board of Equalization (1941) 43 Cal. App. 2d 90, 93, 110 P.2d 73.)\n\nIt would raise serious constitutional questions if we construed a statute to bar the safeguards against patronage developed in the case law, including the safeguard that the state be prepared to prove in a judicial forum that contracting out is warranted by considerations of economy or efficiency. The case law is grounded in a constitutional provision enacted to overcome a pernicious tendency inherently afflicting both of the political branches of the government. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nHowever, this question is not presented by Chapter 433. No provision of Chapter 433 alters the traditional burden of proof that the government show that contracting out is warranted by considerations of economy or efficiency. Accordingly, there is no valid basis for a claim that Chapter 433 conflicts with the injunction because it imposes this burden upon the state.\n\nIII. THE PROCEEDINGS UNDER REVIEW\n\nCaltrans moved the trial court to dissolve the injunction on the ground that Chapter 433 cuts the ground from beneath it. The trial court denied the motion, holding that the statutory scheme, as amended by Chapter 433, could not be applied to justify the conduct it found in violation of article VII. \"The Court concludes that Chapter 433 . . . is unconstitutional in that it authorizes defendants to contract with private consultants for the performance of project development services without a factual showing that the contracts are permissible under article VII.\" (App. II, at p. 26; emphasis added.)\n\nThe court entered a judgment reaffirming the injunction and the orders of enforcement. The trial court did not err in this ruling.\n\nThe majority opinion attacks the ruling on the ground that it is \"a determination that the legislation [i.e., Chapter 433] is unconstitutional on its face.\" (Emphasis added.)\n\nThe majority opinion first jettisons two provisions of Chapter 433 as indefensible. The nonsense finding that a stable contracting out program is necessary to avoid the use of private consultants to supplement in-house staff ( § 14130, subd. (a)(4)) is conceded to be \"illogical.\" The majority also concedes that the legislative finding that contracting out is a new state function ( § 14130, subd. (a)(5)) is \"mere ipsi dixit.\"\n\nHaving cut its losses, the majority proceeds under the view that the trial court found numerous provisions of Chapter 433 \"facially unconstitutional.\" This tactic indiscriminately lumps together the provisions of Chapter 433.\n\nThe question is whether there is a conflict between the injunction and one or more specific provisions of Chapter 433. Most of the provisions are not in conflict because they are preamble or policy provisions, rather than substantive provisions. Their function is to supply reasons for the substantive provisions rather than to confer power or determine rights. (See 1A Sutherland, Statutory Construction (5th ed. 1993) §§ 20.03, 20.12, pp. 83-84, 97.)\n\nIt is meaningless to ask whether a preamble or policy provision is constitutional, since it does not supply a rule of decision that can conflict with a constitution. (See 1A Sutherland, supra, § 20.04, p. 86.) \"An act cannot be declared unconstitutional for matters contained in the preamble if the text of the act is free from constitutional objection.\" (Ibid.) For the same reason it is meaningless to say that such a provision conflicts with an injunction. If there is a conflict between Chapter 433 and the injunction it must be found in a substantive provision of the statute -- one that supplies a rule of decision. As related, there are four such provisions of interest.\n\nA.\n\nThe first substantive provision is section 14130, subdivision (d):\n\n\"(d) In furtherance of the Legislature's intent to encourage contracting out by the department, the department shall not be required to utilize state employees to perform all engineering and related services to the maximum extent required to meet the goals of this article. The department is not required to staff to an internal level that matches its ability to assimilate and productively use new staff.\" (Emphasis added.)\n\nThis provision conflicts with the injunction because it supplies a rule of decision that Caltrans may contract out even if it is not a cheaper or faster means of project delivery.\n\nAs noted, this provision was enacted in the face of an uncodified provision which said that Caltrans shall \"(b) Use every practical means to staff to a level which matches its ability to assimilate and productively use new staff.\" (Stats. 1991, ch. 313, § 1.) This is the exact opposite of that now provided by Chapter 433 in section 14130, subdivision (d): \"The department is not required to staff to an internal level that matches its ability to assimilate and productively use new staff.\" (Emphasis added.)\n\nAs also noted, the majority's view that \"productively use new staff\", in section 14130, subdivision (d), means \"unproductively\" use new staff creates a grammatical anomaly and cannot be squared with the antecedent usage of that phrase. It is also inconsistent with the sunset provision of Chapter 433, which effectively would restore the 1991 uncodified provision. ( § 14130, subd. (f); Ch. 433, § 3.) Lastly, it does not conform to the direction in Chapter 433, section 1, that its provisions be construed as affording a new and independent basis to justify contracting out.\n\nFor all of these reasons I conclude that section 14130, subdivision (d) is a rule of decision authorizing Caltrans to contract out civil service work even when the same work could be done as cheaply and efficiently with existing or additional civil service staff. This conflicts with the injunction and with the constitutional civil service mandate in article VII.\n\nTherefore, I agree with the trial court that this provision of Chapter 433 is unconstitutional and cannot be applied as a basis to dissolve the injunction.\n\nIf this reasoning is not correct, the trial court was nonetheless correct in refusing to dissolve the injunction. If subdivision (d) only says that Caltrans need not hire additional civil service staff where short-term hiring costs make it cheaper to contract out the work, it is constitutional. For the same reason it furnishes no new or independent basis to contract out and does not conflict with the injunction. Accordingly, it furnishes no basis to dissolve the injunction. A contrary view is simply double-talk that seeks to have it both ways.\n\nB.\n\nThe next substantive provision to discuss is section 14130.2, subdivision (a):\n\n\"(a) The Legislature hereby finds and declares:\n\n\"(1) In cases where a local jurisdiction chooses to provide its own financing from, among other sources, retail transactions and use taxes, for construction of a project in the state highway system, other provisions of law allow the local jurisdiction to request that certain work necessary to deliver the project be performed by the department.\n\n\"(2) Engineering services necessary for the department to deliver the project are not required to be considered in determining the department's project delivery staffing needs. The department is not required to staff at a level to provide services for other agencies.\"\n\nThis also conflicts with the injunction for the reasons given concerning section 14130, subdivision (d). Fairly read in historical context, and construed to afford a new and independent basis for contracting out and in light of the sunset provision ( § 14130, subd. (c)), the only meaning that can reasonably be assigned is that Caltrans is authorized to contract out this work on locally funded projects even if additional civil service staff could be hired to perform it as cheaply and as promptly.\n\nThis conflicts with the injunction and it also conflicts with the constitutional civil service mandate of article VII. Therefore, I agree with the trial court that this provision of Chapter 433 is unconstitutional and cannot be applied as a basis to dissolve the injunction.\n\nIf that is not correct, the trial court was nonetheless correct in refusing to dissolve the injunction. If subdivision (a) only says that Caltrans need not hire additional civil service staff to provide engineering services where short-term hiring costs make it cheaper to contract out the work, it is constitutional. However, it furnishes no new or independent basis to contract out and does not conflict with the injunction. Accordingly, it furnishes no basis to dissolve the injunction.\n\nC.\n\nThe next substantive provision, section 14130.1, is as follows:\n\n\"(b) For the purpose of contracting for services under this article, engineering services necessary to complete the seismic safety retrofit program prescribed by Article 4.8 (commencing with Section 179) of Chapter 1 of Division 1 of the Streets and Highways Code shall be considered a short-term workload demand.\"\n\nThe first question, again, is whether this provision conflicts with the injunction. The majority does not squarely address this question; it simply concludes that section 14130.1, in concert with the findings provisions in Chapter 433, principally section 14130, subdivision (a)(3), \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e authorizes contracting out the seismic safety work.\n\nOn its face, section 14130.1 is cryptic. Characterizing seismic safety work as a \"short-term workload demand\" has no facial bearing on the question whether it is or is not to be contracted out. It takes on meaning only if it is intended to be a rule of decision directing that all of the seismic safety work be contracted out. So read, section 14130.1 says that such work shall be contracted out even if it is neither cheaper nor results in faster delivery of the projects than if performed by civil service staff.\n\nAs with the preceding substantive provisions, this conflicts with the injunction and it also conflicts with the constitutional civil service mandate. Therefore, I agree with the trial court that section 14130.1 is unconstitutional and cannot be applied as a basis to dissolve the injunction.\n\nOnce again, if that is not correct, the trial court was nonetheless correct in refusing to dissolve the injunction. If section 14130.1 only says that Caltrans need not hire additional civil service staff to provide engineering services for seismic safety retrofitting where short-term hiring costs make it cheaper to contract out the work, it is constitutional. However, it furnishes no new or independent basis to contract out and does not conflict with the injunction. Accordingly, it furnishes no basis to dissolve the injunction.\n\nD.\n\nThe remaining substantive provision, section 14137, in pertinent part, is as follows:\n\n\"(a) Contracts in force or awarded on or before July 1, 1993, for services negotiated pursuant to Chapter 10 (commencing with Section 4525) of Division 5 of Title 1, including, but not limited to, contracts awarded but not executed, between the department and private contractors, including, but not limited to, minority, women, and disabled veteran owned firms, shall not be terminated, but shall continue to the Conclusion of those contracts subject to the same terms and conditions of the contracts as they read on July 1, 1993.\"\n\nSection 14137 has specific allied findings provisions, in section 14130.3, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e in pertinent part as follows:\n\n\"The Legislature further finds and declares all of the following:\n\n\"(a) As a result of the public contracting goals for minority, women, and disabled veteran business participation in the provision of design services for state highways, and directly as a result of these programs, new consultant firms have come into existence. This new consultant community is largely dependent upon the department for its workload. As a result of recent court decisions, which caused the termination or the initiation of termination of substantial contracts, the economic burden has fallen disproportionately upon the minority, women, and disabled veteran business enterprise community. The cancellation or termination of minority, women, and disabled veteran business enterprise contracts would be inconsistent with the public contract goals contained in Article 1.5 (commencing with Section 10115 of Chapter 1 of Part 2 of Division 2 of the Public Contract Code.\n\n\"(b) The economic burdens on the minority, women, and disabled veteran business enterprise community in a recessionary period are particularly devastating. The Legislature seeks to create additional business enterprise opportunities by the reinstatement of contracts either terminated or initiated for termination by the department after July 1, 1993.\n\n\"(c) The failure to reinstate the minority, women, and disabled veteran business enterprise and other consultant contracts will result in the direct loss of approximately 1,200 jobs in California.\" (Emphasis added.)\n\nSection 14137 differs from the prior provisions in that it is directed to the invalidation of specific and final orders of the trial court. This raises a question of separation of powers, whether the Legislature has encroached upon the judicial power.\n\nThe answer turns on the line between the legislative and judicial powers. \"The opinion of Mr. Justice Field in the Sinking-Fund Cases, 99 U.S. 700, 761 [25 L. Ed. 496, 25 L. Ed. 504], sets forth this distinction as follows: 'The distinction between a judicial and a legislative act is well defined. The one determines what the law is, and what the rights of parties are, with reference to transactions already had; the other prescribes what the law shall be in future cases arising under it. Wherever an act undertakes to determine a question of right or obligation, or of property, as the foundation upon which it proceeds, such act is to that extent a judicial one, and not the proper exercise of legislative functions.'\" ( East Bay M. U. Dist. v. Dept. of P. Wks. (1934) 1 Cal. 2d 476, 479-480, 35 P.2d 1027.)\n\nThe trial court had determined the rights and obligations of the parties to this litigation under contracts entered into under the law preceding Chapter 433. The state did not appeal and the decision is final. The Conclusion is inescapable that the Legislature has encroached upon the judicial power because it seeks to undo a final judicial determination of those rights and obligations.\n\nPeople v. Frisbie (1864) 26 Cal. 135 is instructive on this point. The defendant was sued for failure to pay an assessed property tax. He answered the complaint and tendered as an affirmative defense that the land was not situated in the county which issued the assessment. A demurrer to the answer was sustained on the ground this was not a cognizable defense under the pertinent revenue act. When the defendant declined to answer judgment was rendered against him.\n\nBefore the judgment became final the Legislature enacted a statute amending the revenue act to provide that it was a defense that the property in issue was located in another county and that the taxes had already been paid in the appropriate county. The amendment also provided that in pending suits this new ground of defense could be interposed even if such a suit had proceeded to judgment. If the judgment was not satisfied the defendant could have the matter reopened to litigate this defense.\n\nThe defendant applied to reopen his case and the motion was granted. The People appealed from the order on the ground that the statutory amendment usurped the functions of the judiciary. The Supreme Court rejected the claim and affirmed the order. The Supreme Court first noted that the original judgment in the action was not final and thus the statute did not invade vested rights. It then reasoned that since the State was the plaintiff it could consent to a reopening of the judgment in its favor and was permitted to do so by means of the enactment. Finally, the Supreme Court noted that the enactment did not attempt to reopen a judgment in a single specified action: \"for this Act is general in its application, and is essentially a law, and not merely a direction given to a Court.\" ( People v. Frisbie, supra, 26 Cal. at p. 141.)\n\nNone of the salient rationales of Frisbie is presented in this case. This is a legislative attempt to reopen a final judgment, unfavorable to the State, in a single specified action -- a usurpation by the Legislature of the functions of the judiciary.\n\nThe only argument advanced by the majority opinion is that reopening the final enforcement order is permitted because the final judgment in issue was predicated upon a failure of proof. The majority suggests the Legislature has cured this lacunae with an implied finding that in each of the contracts to which section 14137 applies the work can be performed more cheaply or the project delivered more promptly if it is contracted out. I defer until later Discussion of the untenability of the supposed finding.\n\nIn any event, the majority's claim does nothing to cure the separation of powers flaw. The Legislature is not permitted to reopen, much less readjudicate, matters resolved in a final judgment because that usurps a judicial function. A legislative belief that the facts are incorrectly adjudicated in a final judgment is not a permissible basis for reopening a judgment. It is completely immaterial whether the judgment is based on a failure of proof, weak evidence in favor of the losing party, or strong evidence in support of the losing party that the Legislature would have accepted if it had been the trier of fact.\n\nSince section 14137 unconstitutionally violates the separation of powers it furnishes no basis to dissolve the injunction.\n\nIV\n\nThat brings me to the majority opinion's claim that these unconstitutional substantive provisions are rendered constitutional by an implied Legislative finding that all of the Caltrans work affected by them can be more cheaply performed by contracting it out.\n\nThe claim is founded upon a rule of statutory construction employed to resolve cases of statutory ambiguity. It finds no application in this case because there is no ambiguity in the statute. Even if an issue of ambiguity were presented, the majority's implied finding would not provide a basis to overturn the injunction.\n\nA.\n\nThe proffered implied finding is reminiscent of the Red Queen in Through the Looking Glass, who was able to believe as many as six impossible things before breakfast. The history of these statutes and this litigation is incompatible with such a finding.\n\nAt the outset the statutory scheme expressly eschews a requirement that contracting out be justified by cost-effectiveness. The only constraint on contracting out is a determination that it is appropriate under guidelines adopted under section 14134. ( § 14131.) But under those guidelines cost-effectiveness is to be considered \"equally\" with other considerations, including the objective of reducing short-term fluctuations in the project development workload.\n\nThis provision was superseded by the former uncodified provision (Stats. 1991, ch. 313), discussed above, which required the state to employ such staff as could be assimilated and productively used. However, as related, that provision is in conflict with and superseded by section 14130, subdivision (d).\n\nWe are bound by the trial court's factual determination that the necessity to contract out, if any, arises out of an artificial, political constraint on the hiring of new civil service staff. In the many proceedings which produced the injunction and enforcement, Caltrans, the administrative agency which is the necessary source of evidence that contracting out is cost-effective, has been unable to provide any such evidence. How then could we plausibly imply that the Legislature in enacting Chapter 433 made an implied finding that contracting out is cost-effective? If the Legislature predicated Chapter 433 on such a finding how could it fail to assert this among the plethora of cryptic, illogical, and untenable express findings and declarations?\n\nThe majority opinion predicates this finding in significant part on section 14130, subdivision (a)(3), (fn. 11, ante) which makes the assertion that the volatility of revenue sources requires additional flexibility in contracting out to \"avoid the costly process of short-time hiring and layoff\" of Caltrans' workforce. However, this provision was not enacted by Chapter 433. It has been a part of the statutory scheme since it was first enacted in 1988 and was in force when the trial court found it supplied no justification for the contracting out practices in issue.\n\nThe majority suggests that the antecedent factual findings are immaterial \"inasmuch as circumstances may have changed in the interim.\" (Emphasis added.) This is no more than a sophistry that tenders a mischievous invitation to the Legislature. There is nothing in the injunction which prohibits Caltrans from producing evidence of such a change. Despite ample opportunities to make some such showing, including an enforcement proceeding which followed the enactment of Chapter 433, nothing of this nature has been tendered or suggested.\n\nAs the majority concedes, the only evidence in the record of the proceeding we review which bears on the question of the truth or falsity of the finding is adverse to it. The Plaintiffs adduced evidence that the cost for one personnel year for a civil service staff member would be $75,000 or less and the cost of a personnel year for a consultant is $138,000. This affords an inference that contracting out some of the work in issue is more expensive than performing it in-house.\n\nThe avowed purpose of Chapter 433 is to establish a \"stable contracting out program.\" (Emphasis added.) A large block of work is in issue, if the amount of work is stable over the four year period that Chapter 433 is in force it is reasonable to infer that the costs of hiring civil service staff to perform some of it will not exceed the pay differential.\n\nMoreover, the trial court was not required to and did not disregard the earlier adjudication of law and fact in the case. Quite properly, the trial court took notice of all of its earlier findings in the case, including factual findings that the majority reads as contradicted by Chapter 433. (App. II, p. 17, fn. 8. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e) These findings, together with subsequent findings, are a predicate to the order under review.\n\nThe majority opinion, (ironically) ignoring the posture of the case, chastises the trial court for \"ignoring legislative findings.\" The majority's assertion that there is \"nothing in the record\" which supports the trial court's rejection of the legislative findings can only be maintained by omitting from the record the history of the litigation and the express findings of the trial court, including those predicated upon evidence taken after the enactment of Chapter 433.\n\nThe 1993 order reaffirming the 1990 injunction was brought about when the parties sought \"clarification and/or modification of the injunction and subsequent enforcement orders in light of the enactment of Chapter 433 . . . .\" (App. II, p. 2.) In connection therewith the court took additional evidence relating to the contracting practices of Caltrans since the enactment of Chapter 433. It considered \"whether [the findings added to] Chapter 433 . . . provide[] new justifications for contracting which are consistent with article VII and render the injunction obsolete.\" (App. II, p. 10.) It concluded they did not. The court said:\n\n\"Since the 1980's, defendants have sought to privately contract a portion of their project development workload by systematically restricting the level of civil service staff available to perform the work. Defendants have pursued such contracting for project development work on the basis of administrative and management policies which conflict with and detract from the civil service mandate in article VII . . . . Unable to justify the contracting under article VII, defendants have nonetheless persisted in carrying it out, in violation of both the Court's injunction and the constitutional provisions.\" (App. II, p. 25.)\n\nThe trial court understandably found the Chapter 433 findings constitutionally insufficient to justify the contractual practices which it had found violate article VII and the implementing statutes. \"To the extent that defendants justify their contracts with private consultants on the basis of the provisions of Chapter 433 . . . instead of a factually supported determination pursuant to Government Code sections 14131 and 14134, the contracts are invalid and defendants are in violation of the injunction.\" (App. II, pp. 26-27; emphasis added.)\n\nB.\n\nFinally, if it was material and plausible to imply a finding that all the contracting out in issue results in cheaper or more prompt delivery of the highway projects than would occur if civil service staff were used, it would supply no basis for this court to direct the trial court to dissolve the injunction. This, in effect is a reversal on the ground of no substantial evidence. In such a case the appropriate Disposition is to remand for a new trial.\n\nWhere the existence of \"constitutional facts\" upon which the validity of an enactment is presumed, nonexistence can properly be established by proof. (See, e.g., D'Amico v. Board of Medical Examiners (1970) 6 Cal. App. 3d 716, 727, 86 Cal. Rptr. 245; U.S. v. Carolene Products Co. (1938) 304 U.S. 144, 152 [82 L. Ed. 1234, 1241, 58 S. Ct. 778].) If the ground of a reversal is a failure of proof, a direction to enter judgment for the appellant is only appropriate when, \"on no theory grounded on reason and Justice could the party defeated on appeal make a further substantial showing in the trial court . . . .\" (See Davis v. Chipman (1930) 210 Cal. 609, 623, 293 P. 40 [internal quotation omitted]; also see, e.g., 9 Witkin, Cal. Procedure (3d ed. 1985) Appeal, § 629.) There is no basis for concluding that Plaintiffs could not make a further substantial showing in support that contracting out this work is not cheaper than performing it in-house. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIt is especially unfair to direct a Disposition in light of the fact that Caltrans never proffered this justification in the trial court. Indeed, even at oral argument before this court, Caltrans disclaimed the view that contracting out this work is cheaper than performing it in-house. The implied finding on which reversal is predicated is the belated invention of my colleagues.\n\nFor all the foregoing reasons, I would affirm the order refusing to dissolve the injunction.\n\nAPPENDIX A\n\nArticle 2.5 of Chapter 2, Part 5, Division 3, Title 2, of the Government Code (commencing with section 14130), as revised by chapter 433, reads in relevant part:\n\nSection 14130\n\n\"(a) The Legislature hereby finds and declares all of the following:\n\n\"(1) There is a compelling public interest in ensuring that all federal, state, local, and private funds available for the state highway program are captured and used in a timely manner in order to generate maximum employment and business opportunities in California.\n\n\"(2) In order to maximize the use of federal, state, local, and private funds and to maintain a competitive posture in seeking supplemental federal funds, California must have a comprehensive and integrated highway construction plan in place.\n\n\"(3) Changes in federal, state, and local revenues and the growing private participation in state highway construction can result in significant fluctuations in workload relating to project study reports, project development, surveying, and construction inspection. To maintain a more stable work force in the department and avoid the costly process of short-time hiring and layoff while still responding in a timely manner to funding opportunities and uncertainties, additional flexibility through outside contracting and cooperative agreements with local public agencies is needed to supplement the department's program staff.\n\n\"(4) The department's experience with contracting out indicates that the use of private consultants to supplement the department's workforce has permitted the department to substantially enhance its project delivery. The department, with the help of the private engineering community, has recently accelerated nearly one billion dollars ($1,000,000,000) worth of construction projects on the state highway system. This significant increase in project delivery capability must continue in order for the department to meet its commitments for timely project delivery. Without the ability to continue a stable contracting out program, the Legislature finds and declares that the department will not be able to perform project delivery adequately, competently, or satisfactorily, thereby necessitating the use of private consultants to supplement its in-house staff.\n\n\"(5) The use of private consultants to assist in project delivery is a new state function and does not duplicate the existing functions of the department.\n\n\"(b) Therefore, it is the intent of the Legislature that the department contract for the services of engineers, architects, surveyors, planners, environmental specialists, and materials testing specialists, in order to provide professional and technical project development services to the department whenever the department is inadequately staffed to satisfactorily carry out its program of project study reports, project development, surveying, and construction inspection in a timely and effective manner. Compliance with the state's participation goals for these contracts shall be a factor for consideration by the Legislature in evaluating future budget requests by the department. It is the further intent of the Legislature to permit, through cooperative agreements with the department, local public agencies to undertake that program of activities on state highway projects for which they are a funding source.\n\n\"(c) The department may utilize contracting out for state highway projects funded by federal and state moneys to support state transportation infrastructure funded by local resources, to ensure timely retrofitting for seismic safety on state transportation infrastructure, and to ensure timely and cost-effective project delivery.\n\n\"(d) In furtherance of the Legislature's intent to encourage contracting out by the department, the department shall not be required to utilize state employees to perform all engineering and related services to the maximum extent required to meet the goals of this article. The department is not required to staff to an internal level that matches its ability to assimilate and productively use new staff.\n\n\"(e) In consultation with Caltrans Equal Employment Advisory Council, whose membership shall include persons representing statewide community organizations, the department shall prepare and adopt an affirmative action plan for its management and other personnel positions which reflects the ethnic demographics of the state, taking into consideration the availability of the workforce in the various ethnic groups. The department shall make genuine efforts to achieve in its workforce the ethnic and racial composition of the labor force population of the state. These efforts shall include, but not be limited to, the department's personnel hiring and recruitment policies and practices, as well as training and management development.\n\n\"(f) This section shall remain in effect only until January 1, 1998, and as of that date is repealed, unless a later enacted statute, which is enacted before January 1, 1998, deletes or extends that date.\" (Amended by Stats. 1993, c. 433, § 2 eff. Sept. 24, 1993.)\n\nSection 14130.1\n\n\"(a) The Legislature finds and declares that following the 1989 Loma Prieta Earthquake, the Legislature enacted Chapter 18 of the Statutes of 1989, First Extraordinary Session, which added Article 4.8 (commencing with Section 179) to Chapter 1 of Division 1 of the Streets and Highways Code, thereby establishing a seismic safety retrofit program for publicly owned bridges. Certain of the contracts for those retrofit projects are required to be executed by December 31, 1993.\n\n\"(b) For the purpose of contracting for services under this article, engineering services necessary to complete the seismic safety retrofit program prescribed by Article 4.8 (commencing with Section 179) of Chapter 1 of Division 1 of the Streets and Highways Code shall be considered a short-term workload demand.\n\n\"(c) This section shall remain in effect only until January 1, 1998, and as of that date is repealed, unless a later enacted statute which is enacted before January 1, 1998, deletes or extends that date.\" (Added by Stats. 1993, c. 433, 4, eff. Sept. 24, 1993.)\n\nSection 14130.2\n\n\"(a) The Legislature hereby finds and declares:\n\n\"(1) In cases where a local jurisdiction chooses to provide its own financing from, among other sources, retail transactions and use taxes, for construction of a project in the state highway system, other provisions of law allow the local jurisdiction to request that certain work necessary to deliver the project be performed by the department.\n\n\"(2) Engineering services necessary for the department to deliver the project are not required to be considered in determining the department's project delivery staffing needs. The department is not required to staff at a level to provide services for other agencies.\n\n\"(b) The department may balance the need for outside contracting for these services on a program basis, rather than on an individual contract basis.\n\n\"(c) This section shall remain in effect only until January 1, 1998, and as of that date is repealed, unless a later enacted statute which is enacted before January 1, 1998, deletes or extends that date.\" (Added by Stats. 1993, c. 433, § 5, eff. Sept. 24, 1993.)\n\nSection 14130.3\n\n\"The Legislature further finds and declares all of the following:\n\n\"(a) As a result of the public contracting goals for minority, women, and disabled veteran business participation in the provision of design services for state highways, and directly as a result of these programs, new consultant firms have come into existence. This new consultant community is largely dependent upon the department for its workload. As a result of recent court decisions, which caused the termination or the initiation of termination of substantial contracts, the economic burden has fallen disproportionately upon the minority, women, and disabled veteran business enterprise community. The cancellation or termination of minority, women, and disabled veteran business enterprise contracts would be inconsistent with the public contract goals contained in Article 1.5 (commencing with Section 10115) of Chapter 1 of Part 2 of Division 2 of the Public Contract Code.\n\n\"(b) The economic burdens on the minority, women, and disabled veteran business enterprise community in a recessionary period are particularly devastating. The Legislature seeks to create additional business enterprise opportunities by the reinstatement of contracts either terminated or initiated for termination by the department after July 1, 1993.\n\n\"(c) The failure to reinstate the minority, women, and disabled veteran business enterprise and other consultant contracts will result in the direct loss of approximately 1,200 jobs in California.\n\n\"(d) This section shall remain in effect only until January 1, 1998, and as of that date is repealed unless a later enacted statute, which is enacted before January 1, 1998, deletes or extends that date.\" (Added by Stats 1993, c. 433, § 6, eff. Sept. 24, 1993.)\n\nSection 14131\n\n\"The department may contract for the services of engineers, architects, surveyors, planners, environmental specialists, and materials testing specialists to provide professional and technical services relating to project study reports, project development, surveying, and construction inspection whenever the director determines that the guidelines adopted pursuant to Section 14134 are applicable. Services contracted for shall not cause the displacement of any permanent, temporary, or part-time employee of the department.\n\n\"For purposes of this section, 'displacement' means layoff, demotion, involuntary transfer to a new class, or involuntary transfer to a new work location requiring the employee to change his or her place of residence in order to be able to continue in his or her job classification.\" (Amended by Stats. 1991, c. 313, § 2, eff. Aug. 2, 1991.)\n\nSection 14131.1\n\n\"The department, in applying the criteria for contracting for services established pursuant to this article, shall consider the workload relating to project study reports, project development, surveying, and construction inspection based on the total program relating to those factors for each fiscal year. In determining the appropriateness of contracting, the provisions of this article and the guidelines adopted pursuant to this article may be applied to the total program relating to project study reports, project development, surveying, and construction inspection for the fiscal year. Application of the provisions of this article and the guidelines to each individual contract for services is not required.\n\n\"Once the department applies the provisions of this article and the guidelines to the total project development program for the fiscal year and determines the total personnel years allocated for contracting out for the fiscal year, there shall be no further requirement to identify or refer to specific facts or guidelines which justify contracting out regarding individual contracts.\" (Added by Stats. 1991, c. 313, § 3, eff. Aug. 2, 1991.)\n\nSection 14132\n\n\"(a) In addition to the requirements set forth in this section, in the department's contracting out for the services of engineers, architects, surveyors, planners, environmental specialists, and material specialists, the department shall comply with the criteria governing the state's participation goals for minority, women, and disabled veteran owned firms as specified in Article 1.5 (commencing with Section 10115) of Chapter 1 of Part 2 of Division 2 of the Public Contract Code. These goals shall apply to the overall dollar amount expended each year by the department pursuant to this article.\n\n\"(b) The department shall develop a list of qualified minority, women, and disabled veteran business enterprises that have been certified as a minority, women, or disabled veteran business enterprise, and that are interested in performing engineering, architectural, environmental, landscape architectural, or land surveying services under contract with the department, utilizing existing resources such as the Office of Small and Minority Business, the Minority Business Development Agency, and the Small Business Administration. Notice of the development of the list and request for statements of interest shall be published in professional publications at least 60 days prior to the deadline for submittal of statements of interest. The qualifications required for minority business enterprises and women business enterprises shall be the same as those required for any other firm or individual contracting with the department for the purposes of this article.\n\n\"(c) Any minority, women, or disabled veteran business enterprise not initially included on the list of interested firms may file statements of interest at any time, and the department shall evaluate the statements and notify the minority or women or disabled veteran business enterprise of their eligibility for placement on the list within 60 days of the request. Any minority, women, or disabled veteran business enterprise that is eligible to be counted toward the department's participation goals and that meets the standard requirements shall be added to the list of interested firms immediately.\" (Amended by Stats 1993, c. 433, § 7, eff. Sept. 24, 1993.)\n\nSection 14132.1\n\n\"(a) At the election of the department, contracts for engineering, architectural, environmental, landscape architectural, or land surveying services made pursuant to this article in an amount equal to or less than two hundred fifty thousand dollars ($250,000) may be advertised and awarded in accordance with this section.\n\n\"(b) For purposes of this article, the following definitions apply:\n\n\"(1) 'Firm' means any individual, firm, partnership, corporation, association, or other legal entity permitted by law to practice the profession of engineering, architecture, environmental, landscape architecture, or land surveying.\n\n\"(2) 'Engineering, architectural, environmental, landscape, architectural, or land surveying services' include professional services of an engineering, architectural, environmental, landscape architectural, or land surveying nature as well as incidental services that members of these professions and those in their employ may logically or justifiably perform.\n\n\"(3) 'Prequalified list' means a list of engineering, architectural, environmental, landscape architectural, or land surveying firms that possess the qualifications established by the department to perform specific types of engineering, architectural, environmental, landscape architectural, or land surveying services, with each firm ranked in order of its qualifications.\n\n\"(c) The department may establish prequalified lists of engineering, architectural, environmental, landscape architectural, or land surveying firms, including minority, women, and disabled veteran business enterprise firms, in accordance with the following process:\n\n\"(1) For each type of engineering, architectural, environmental, landscape architectural, or land surveying services work for which the department elects to use this process for advertising and awarding contracts, the department shall request annual statements of qualifications from interested firms. The request for statements of qualifications shall be announced statewide through the California State Contracts Register and publications of respective professional societies. Each announcement shall describe the general scope of services to be provided within each generic project category for engineering, architectural, environmental, landscape architectural, and land surveying services that the department anticipates may be awarded during the period covered by the announcement. A generic project category shall be defined such that each specific project to be awarded within that generic project category shall be substantially similar to all other projects within that generic project category, shall be within the same size range and geographical area, and shall require substantially similar skills and magnitude of professional effort as every other project within that generic project category.\n\n\"(2) The department shall evaluate the statements of qualifications and a short list of the most qualified firms that meet the criteria established and published by the department shall be developed. Discussions shall be held regarding each firm's qualifications with all short-listed firms. The firms shall then be ranked according to each firm's qualifications and the evaluation criteria established and published by the department. Prequalified lists of engineering, architectural, environmental, landscape architectural, or land surveying firms shall be maintained by the department for not more than two years. Each prequalified list shall include no less than three firms. At any time during the term of a prequalified list, any minority business enterprise, women business enterprise, or disabled veteran business enterprise not initially included on the list of prequalified firms that has been certified as a minority, women, or disabled veteran business enterprise, and that submits a statement of qualifications shall be evaluated by the department. The qualifications required for minority, women, and disabled veteran business enterprises shall be the same as those required for any other firm or individual contracting with the department for the purpose of this article. Discussions shall be held with each firm that meets the minimum qualifications to be short-listed and, after Discussions with the department, each additional minority business enterprise, women business enterprise, or disabled veteran business enterprise firm that is at least as qualified as the lowest ranked firm on the prequalified list shall be added to the list.\n\n\"(3) During the term of the prequalified lists, as specific projects are identified by the department as being eligible for contracting under the guidelines adopted pursuant to Section 14134, the department shall contact the highest ranked firm on the appropriate prequalified list to determine if that firm has sufficient staff and is available for performance of the project. If the highest ranked firm is not available, the department shall continue to contact firms on the prequalified list, in order of rank, until a firm that is available is identified.\n\n\"(4) The department shall negotiate a contract for the services with the identified firm, at a price that the department determines is fair and reasonable to the department.\n\n\"(5) If the department is unable to negotiate a satisfactory contract with the identified firm, negotiations with that firm shall be terminated and negotiations shall be undertaken with the next ranked firm that is available for performance. If a satisfactory contract cannot be negotiated with the second identified firm, negotiations shall be terminated and the negotiation process shall be continued with the remaining qualified firms, in order of their qualifications, until a satisfactory contract is negotiated.\n\n\"(6) Once a satisfactory contract is negotiated and awarded to a firm from the prequalified list, that firm shall be removed from the prequalified list. If the department is unable to negotiate a satisfactory contract with a firm on two separate occasions, that firm shall be removed from the prequalified list.\n\n\"(d) This section shall remain in effect only until January 1, 1997, and as of that date is repealed, unless a later enacted statute, which is enacted before January 1, 1997, deletes or extends that date.\" (Added by Stats. 1992, c. 1086, § 2.)\n\nSection 14133\n\n\"(a) Contracts made pursuant to this article are not subject to Article 4 (commencing with Section 19130) of Chapter 6 of Part 2 of Division 5.\n\n\"(b) Contracts for engineering, architectural, landscape architectural, . . . environmental, or land surveying services that the department elects to advertise and award in accordance with Section 14132.1 are not subject to Chapter 10 (commencing with Section 4525) of Division 5 of Title 1. All other contracts for engineering, architectural, environmental, landscape architectural, or land surveying services made pursuant to this article are subject to Chapter 10 (commencing with Section 4525) of Division 5 of Title 1. Notwithstanding Section 10295 of the Public Contract Code, the determination as to whether the guidelines for contracting adopted pursuant to Section 14134 have been met shall be the sole responsibility of the Director of Transportation. The Department of General Services shall have 30 working days upon receipt of a contract under this article in which to act on the contract, except in cases where further clarification is required by the department to execute the contract.\" (Amended by Stats 1992, c. 1086, § 3.)\n\nSection 14134\n\n\"(a) The department, after consultation with the commission and local transportation agencies, shall adopt guidelines for determining the appropriateness of contracting with private firms or on projects developed cooperatively with local jurisdictions. The guidelines shall include, but not be limited to, consideration of the following:\n\n\"(1) Ensuring that all available federal, state, and local funds, including supplemental federal funds, are captured and used in a timely manner.\n\n\"(2) Reducing short-term fluctuations in the department's workload relating to project study reports, project development, surveying, and construction inspection while still enabling the department to be plan-ready.\n\n\"(3) Facilitating the expeditious use of locally raised funds for state highway projects, recognizing that, in this instance, local governments are partners in state highway construction and that locally financed projects should not be unnecessarily delayed.\n\n\"(4) Ensuring that the cost effectiveness of contracting is considered equally with other factors when a determination of the appropriateness of contracting is made.\n\n\"(5) Ensuring that contract selection is performed in accordance with applicable state laws regarding the selection of professional architectural, engineering, environmental, or land surveying services, and to ensure the selection process avoids or prohibits unlawful or unfair procedures or activities.\n\n\"(b) These guidelines shall serve as general criteria for the determination of the appropriateness of contracting for services relating to project study reports, project development, surveying, and construction inspection and shall not be deemed to require the department to contract for specific projects solely because they may meet these criteria.\n\n\"(c) The department may contract with local jurisdictions, rather than with private firms, for professional and technical services relating to project study reports, project development, surveying, and construction inspection. In such a case, the services shall be only for a project located within the area of the local jurisdiction.\" (Amended by Stats. 1991, c. 313, § 4, eff. Aug. 2, 1991.)\n\nSection 14135\n\n\"Each contract for engineering, architectural, or landscape architectural services entered into pursuant to this article and any construction contract resulting therefrom is subject to all of the following conditions:\n\n\"(a) The engineering, architectural, or landscape architectural firm providing design services for a project is not eligible to bid on or to be awarded the construction contract for that project.\n\n\"(b) The department shall provide a regular civil service employee as the resident engineer on any construction contract that results from project design services performed by engineers, architects, or landscape architects selected pursuant to this article.\n\n\"(c) All contract plans and changes to plans prepared by an engineer, architect, or landscape architect selected pursuant to this article shall be subject to review and approval by a licensed engineer, architect, or landscape architect of the department.\" (Amended by Stats. 1991, c. 314, § 6.)\n\nSection 14137\n\n\"(a) Contracts in force or awarded on or before July 1, 1993, for services negotiated pursuant to Chapter (commencing with Section 4525) of Division 5 of Title 1, including, but not limited to, contracts awarded but not executed, between the department and private contractors, including, but not limited to, minority, women, and disabled veteran owned firms, shall not be terminated, but shall continue to the Conclusion of those contracts subject to the same terms and conditions of the contracts as they read on July 1, 1993.\n\n\"(b) This section shall remain in effect only until January 1, 1998, and as of that date is repealed, unless a later enacted statute which is enacted before January 1, 1998, deletes or extends that date.\" (Added by Stats. 1993, c. 433, § 9, eff. Sept. 24, 1993.)\n\nAPPENDIX I\n\nMARCH 26, 1990\n\nIN THE SUPERIOR COURT OF THE STATE OF CALIFORNIA IN AND FOR THE COUNTY OF SACRAMENTO\n\nPROFESSIONAL ENGINEERS IN CALIFORNIA GOVERNMENT (PECG), a California corporation on behalf of its members, and RICHARD T. BAKER, a citizen and taxpayer of the State of California, Plaintiffs and Petitioners, v. DEPARTMENT OF TRANSPORTATION, STATE OF CALIFORNIA (Caltrans); LEO J. TROMBATORE, in his capacity as Director of Caltrans; and DOES I through XXX, inclusive, Defendants and Respondents.\n\nNo. 336697 Dept 29\n\nSTATEMENT OF DECISION\n\nIn this case, the court must determine whether constitutional state civil service requirements are violated (1) when Caltrans contracts with private consultants for state highway project development services, construction inspection, and construction survey staking pursuant to Government Code section 14101 and related statutes and/or (2) when Caltrans enters into cooperative agreements with local public agencies for such engineering services pursuance to Streets and Highways Code section 114.\n\nFACTUAL BACKGROUND\n\nThe Department of Transportation (\"Caltrans\") is responsible for laying out, constructing, improving and maintaining all state highways between the termini designated by law and in the locations approved by the California Transportation Commission. (Sts. \u0026 Hy. Code §§ 90, 91.) In exercising this responsibility, Caltrans determines the kind, quality and extent of all highway work done under its control, and prepares and approves all plans, specifications and estimates for such highway work. (Sts. \u0026 Hy. Code § 137; Pub. Contract Code § 10120.)\n\nHistorically, Caltrans has used state civil service professionals to perform project development work for state highways. Such work includes all of the tasks required prior to the advertisement of a contract for the construction of a state highway: initial project concept and scope studies, environmental studies and clearance documents, route location adoption studies, design engineering (preparation of plans, specification and estimates), and right-of-way acquisition.\n\nfor the actual construction of state highways, Caltrans has historically contracted with private entities under the State Contract Act. (Pub. Contract Code § 10100 et seq.) Simultaneously, it has used state civil service professionals to perform construction inspection, the monitoring of the performance of a construction contract for compliance with applicable plans and specifications, and to perform construction survey staking, the setting of construction stakes and marks to establish the lines and grades required for the performance of a construction contract in accordance with applicable plans and specifications.\n\nDuring the 1986-87 fiscal year, Caltrans began targeting a significant portion of project development work and construction inspection support for performance under contracts with private engineering firms pursuant to Government Code sections 14101 and 19130 and under cooperative agreements with local public entities pursuant to Streets and Highways Code section 114. In addition, Caltrans began including construction survey staking as an item in construction contacts under the State Contract Act.\n\nThe significant increase in the work targeted for performance under contracts and cooperative agreements rather than by state civil service professionals was a direct response to two concurrent circumstances: a significant increase in Caltrans' highway project workload and a lack of sufficient civil service professionals to perform the work.\n\nThe workload of Caltrans began increasing markedly in the early 1980s with an increase in the funds available for the construction and improvement of state highways, particularly fuel excise tax funds, funds produced by sales tax measures enacted in a growing number of local jurisdictions, and funds from local developers. In addition, the Legislature mandated Caltrans to expedite program development work and promote the timely expenditure of transportation funds to avoid inflationary increases in highway construction costs. (See Gov. code § 14529.5.) As a result, the state highway projects scheduled or programmed for development and construction in the State Transportation Improvement (\"STIP\") by the California Transportation Commission (\"commission\") increased.1a\n\nAt the same time as its highway project workload was increasing, Caltrans was unable to increase the number of civil service professionals in its employe because of a gubernatorial/executive branch policy to curtail growth in state government and because of an assumption that the increases in the Caltrans workload were short-term and future funding for state highway projects was uncertain. Under this policy, Caltrans personnel were maintained at a constant level, and workload increases were addressed by the redirection of personnel to high priority areas, the deferral of low priority areas and the introduction of efficiency measures. Requests by Caltrans for additional staff positions for state highway project work were refused during the development of the Governors's budgets for the 1983-84 through 1986-87 fiscal years.\n\nDespite the redirection of staff and efficiency measures undertaken by Caltrans to cope with its increasing highway project workload, Caltrans was unable to adequately perform its workload under the STIP and to responde to the growing demands of public agencies with local tax measure revenues for transportation improvements. Accordingly, significant delays in STIP projects and local tax measure projects were occurring by the 1986-87 fiscal year. To remedy these delays within existing civil service staffing, Caltrans developed plans for contracting with private consultants under Government Code sections 14101 and 19130 and for increasing the number of its cooperative agreements with local public agencies for a targeted portion of its project development workload under Streets and Highways Code section 114. Caltrans had entered into cooperative agreements with local public agencies for project development work to some extent in the past.\n\nThis solution of contracts and cooperative agreements to the highway project workload delays met with acceptance. Funds for 270 personnel years (PYs) of project development work by consultants under contract with Caltrans were included in the budget for the 1986-87 fiscal years. This figure of 270 PYs reflected the difference between the number of PYs needed to perform the project development workload for the year and the estimated number of PYs of project development work that state civil service professionals employed by Caltrans had the capacity to perform. These estimates were obtained with Personnel Year Project Scheduling and Cost Analysis (PYPSCAN), a tool developed by Caltrans for estimating project schedules and capital outlay support.\n\nThe budget for the 1987-88 fiscal year appropriated 425 PYs of project work to be contracted. In addition, in a deviation from the gubernatorial/executive branch policy of curtailing state government, funds were appropriated for an increase of 500 in Caltrans civil service staff for project development work, a number which Caltrans management believed it was capable of assimilating without disruption of its operations. The 425 PYs of contract services represented the difference between the number of PYs needed to perform the project development workload and the number of PYs that Caltrans staff had the capacity to perform with the addition of 500 new employees.\n\nThe budget for the 1988-89 fiscal year followed the approach of 1987-88 budget on a larger scale. The budget appropriated funds for approximately 925 PYs of consultant contracts and 900 to 1000 new staff positions -- a revision in the number of new employees that Caltrans management believed it could assimilate without disruption of its operations.\n\nCaltrans explained its rationale for contracting in 1986 memoranda to the director of finance regarding proposed contracts under section 14101 of the Government Code:\n\n\"The public interest in accelerating transportation improvements is well evidenced by the increasing amount of private funds being made available for this purpose and by the recent passage of three local tax measures aimed at providing increased funding for transportation improvements. This increased commitment to improving transportation services has placed substantial pressure on the Department to ensure that project delivery schedules are met for all STIP and locally funded projects. In order to provide project delivery as quickly as possible, the Department must be able to increase engineering resources at a very rapid rate. To accomplish this, the Department has provided contract funds for project delivery in the 1987/88 budget to further augment the increase in Department staff of 395 PYs, also included in that budget. The Department cannot meet the increased need for project delivery only by hiring new staff because: (1) the 1987/88 budget limits the Department's hiring ability to an increase of 395 people plus those new hires needed to offset normal attrition; and (2) new hires are typically Junior Civil Engineers who lack the experience to perform productively until they can receive proper training. Consequently, the only way to accomplish the work in a timely fashion is to obtain experienced outside help to supplement the Department's hiring efforts.\" [Emphasis in original.]\n\nThe approach to solving Caltrans' project development workload delays, combining an increase in civil service employees with contracts and cooperative agreements for performance of the work, was codified in legislation enacted in 1988. (Stats. 1988, ch. 9.) This legislation became effective January 1, 1989, and was to be repealed in 1993 by its own terms in the absence of other legislation extending its effectiveness. (Stats. 1988, ch. 9, Gov. Code § 14136.)\n\nThis legislation expressed a two-fold legislative intent: first, the legislative intent that Caltrans contract for the services of engineers and various other professionals for the provision of professional and technical project development services \"whenever the department is inadequately staffed to satisfactorily carry out its project development program in a timely and effective manner,\" and second, the legislative intent that local public agencies be permitted to undertake state highway project development activities for which they are a funding source. (Gov. Code § 14130, subdivision (b).) This two-fold intent was based on legislative findings of a compelling public interest in the timely capture and use of all federal, state, local and private funds available for the state highway program; of a need for California to be \"plan-ready\" in order to maximize the use of all available funds; and of a need to supplement Caltrans staff with contracts and cooperative agreements to avoid the costly process of short-term hiring and layoff while timely responding to funding opportunities and uncertainties. (Gov. Code § 14130.)\n\nIn addition to defining the authority of Caltrans to contract and enter into cooperative agreements for project development services, this 1988 legislation established a formula for determining the amount of project development services to be contracted. (Gov. Code § 14524.2.) During any year when the estimated staffing needed to perform the project development workload exceeded the project development staffing of Caltrans during the 1986-87 fiscal year, Caltrans was authorized to include in its budget request a level of staffing equal to its 1986-87 staffing level plus one-half of the excess and to contract for other half of the excess.\n\nDespite the efforts of Caltrans since the 1986-87 fiscal year to contract with private firms and to enter into cooperative agreements with local public entities for the performance of highway project development work, Caltrans had limited success in these efforts. By September 1988, it had executed contracts for only about 20 percent of the PYs allocated for that purpose since 1986-87. In addition contractors, though experience in highway design, were unfamiliar with Caltrans standards and procedures and required additional oversight by Caltrans personnel. Finally, the contracted project development work as well as the construction survey staking performed as an item of construction contracts were, at lest initially, more costly than the work performed directly by Caltrans employee.\n\nANALYSIS\n\nThe Court must determine whether the statutory authority of Caltrans to contract outside the state civil service for state highway project development services, construction inspection, and construction survey staking is consistent with article VII of the California Constitution. If so, the Court must determine whether Caltrans has exercised its statutory contractual authority in accordance with article VII.\n\nAs statutory sources of Caltrans' authority to contract with private consultants, the Court considers Government Code section 14101, the express statutory basis of many of the contracts awarded by Caltrans for project development services and construction inspection from the 1986-87 through the 1989-90 fiscal years.2a The Court also considers Government Code section 14130 et seq., which authorizes Caltrans to contract for project development services effective January 1, 1989, prior to the trial of this action, and which, according to counsel for Caltrans, provides the authority oh which Caltrans intends to rely in the future for contracting outside the state civil service. Although no contracts based expressly upon section 14130 et seq. are before the Court, Caltrans' authority and actions under section 14101 are inextricably intertwined with section 14130 et seq. The substantive criteria of section 14130 et seq. for contracting by Caltrans encompass and elaborate upon the substantive criteria of section 14101. Further, the legislative findings, standards and procedures of section 14130 et seq. appear to codify and explain much of the actual contracting practice of Caltrans since the 1986-87 fiscal year.3a\n\nContracts with Private Consultants\n\nArticle VII of the California Constitution establishes a civil service system of employment for state government, providing for appointments and promotions based on merit ascertained by competitive examination. This constitutional provision derives from the former article XXIV of the California Constitution which was adopted in 1934 by the electorate, revised in 1970 without relevant substantive changes, and readopted verbatim in 1976 as article VII as part of a constitutional reorganization measure.\n\nThe ballot pamphlet before the voters in 1934 indicated that:\n\n\"The purpose of this constitutional amendment is to promote efficiency and economy in State government. The sole aim of the act is to prohibit appointments and promotion in State service except on the basis of merit, efficiency and fitness ascertained by competitive examination. Appointments of inefficient employees for political reasons are thereby prohibited, thus eliminating the 'spoils system' from State employment. . . .\n\n\"Having by constitutional mandate prohibited employment on any basis except merit and efficiency, thereby eliminating as far as possible the 'spoils system' of employment, the Legislature is given a free hand in setting up laws relating to personnel administration for the best interests of the State....\" (Ballot Pamp., Proposed Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 6, 1934), argument in favor of Prop. 7, p.12.)\n\nThus the constitutional provision was adopted by the voters to eliminate the 'spoils system' of political patronage as the method of state employment, to replace the 'spoils system' with a constitutionally mandated merit system of appointments and promotions in state service, and thereby to promote efficiency and economy in state government. The constitutional provision otherwise left the Legislature with broad discretion to fashion laws relating to personnel administration for the best interests of the State. ( Pacific Legal Foundation v. Brown, (1981), 29 Cal. 3d 168, 182-84, fn. 7, 172 Cal. Rptr. 487, 624 P.2d 1215.)\n\nImplicit in Article VII is a restriction on, but not a prohibition against, contracting by state government agencies with private entities for the performance of government work. This restriction is not express; rather it \"emanates from an implicit necessity for protecting the organic civil service mandate against dissolution and destruction.\" California State Employees' v. Williams (1970) 7 Cal. App. 3d 390, 397, 86 Cal. Rptr. 3051.)\n\nTo determine the extent of restriction imposed by article VII on contracting outside state government in particular situations, the courts have fashioned a number of tests. One or more of these test may apply to a particular situation; no one of the tests supersedes the others (California State Employees' Assn. v. William, supra, 7 Cal. App. 3d 390, 397, 401; California State Employees' Assn. v. State of California (1988) 199 Cal. App. 3d 840, 851-853, 245 Cal. Rptr. 232.)\n\nUnder the \"nature of the services\" test, a court inquires whether the performance of services for which a state agency has contracted involves tasks or skills that can be performed by persons employed through civil service methods. If the tasks or skills can be performed by state civil service personnel within the scope of the agency's ongoing function, the agency must obtain the services pursuant to the constitutional civil service mandate and its implementation by the Civil Service Act (Gov. Code § 18500 et seq.). ( Burum v. State Comp. Ins. Fund (1947) 30 Cal. 2d 575, 579-582, 184 P.2d 505; State Compensation Ins. Fund v. Riley (1937) 9 Cal. 2d 126, 134-35.) Only services which cannot be \"adequately or competently or satisfactorily\" performed by civil service personnel may be contracted.\n\nUnder the \"new state function\" test, a court inquires whether the services for which a state agency has contracted involve an activity or function not previously performed by state agencies or, conversely, whether the services duplicate the functions and duties of existing agencies. ( California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at p. 397, interpreting San Francisco v. Boyd, (1941) 17 Cal. 2d 606, 110 P.2d 1036; Kennedy v. Ross (1946) 28 Cal. 2d 569, 171 P.2d 1.) This test is based on a recognition that the functions of government have evolved over time as new public services have been undertaken, that the systems and methods of public administration have shifted significantly as a result, and that interactions between public and private enterprise in the course of this shift have obliterated the traditional distinctions between public and private action. ( California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 844.)\n\nFinally, other factors may justify state agency contracts with entities outside the state government -- even though the services do involve skills, tasks and functions already performed by state agencies -- if the contracts further a public interest or policy that is consistent with the purposes of the constitutional civil service mandate, and requirements and conditions of the contracting process safeguard the integrity of the state civil service system. ( California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d 840, 851-853.) For example, substantial cost savings resulting from the performance of state work under contract may render the contract permissible under Article VII to the extent that the cost savings advance the state's interest in efficiency and economy, primary objectives of article VII, and to the extent that the contract is awarded through such devices as competitive bidding and specifies qualifications for the personnel who will perform the contracted services. In such circumstances, the contract may satisfy a modernized version of the \"nature of the services\" test: the services to be performed under contract are such that they cannot be \"adequately or competently or satisfactorily\" performed by state civil service employees.\n\nThus, under article VII, the Legislature may not authorize contracts which have a detrimental effect on the integrity of the state civil service principle. The Legislature has flexibility and discretion, however, to authorize contracts based on considerations and factors which further the public interest consistent with state civil service objectives of merit, efficiency and economy and which are administered in accordance with standards and procedures that protect against political patronage and favoritism. The Legislature is not precluded by article VII from fashioning methods of public administration which responde to the growing and changing needs of the public. (See Pacific Legal Foundation v. Brown, supra, 29 Cal. 3d at p. 180, 196; California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at pp. 397-398.)\n\nUnder Government Code section 14101, the Legislatture has given Caltrans authority to contract for architectural and engineering services. This statute, added to the Government Code in 1945 (Stats. 1945, ch. 118), derives from a provision of the Political Colde enacted in 1929 which permitted but did not require the director of the department to contract, with the consent of the director of finance, for the preparation of plans for a public structure by a duly qualified architect. (Stats. 1929, ch. 291.) A 1955 amendment of section 14101 made it mandatory for Caltran to contract with qualified architects and engineers for the performance of work when the director of Caltrans determines, with the approval of director of finance, that \"the obtainable staff is unable to perform the work within the time the public interest require such work to be done.\" (Stats. 1955, ch. 976.) Pursuant to sections 4524 et seq. of the Government Code, contracts for the performance or architectural and engineering services under section 14101 must be awarded on the basis of professional qualifications and demonstrated competence to perform the work and must comply with administrative regulations implementing the procedural requirements of Government Code section 4525 et seq. (See Pub. Contracts Code § 10335.)\n\nUnder Government Code section 14130 et seq., the Legislature seeks to provide Caltrans with authority until January 1, 1993 to contract for the services of engineers and various other professionals for the performance of professional and technical project development services \"whenever the department is inadequately staffed to satisfactorily carry out its project development program in a timely and effective manner.\" (Gov. Code § 14130, subd. (b).) This legislation became effective January 1, 1989, and is to be repealed on January 1, 1993 by it own terms in the absence of other legislation extending its effectiveness. (Stats. 1988, ch. 9, Gov. Code § 14136.)\n\nSections 14130 et seq. authorize, but do not require, Caltrans to contract for professional and technical project development services whenever the director of Caltrans determines that guidelines, adopted by Caltrans in consultation with the commission and local transportation agencies, apply. (Gov. Code § 14131, 1434.) These guidelines are to serve as general criteria for determining the appropriateness of contracting for various project development services. (Gov. Code § 141134, subd. (b).) At a minimum, these guidelines must require consideration of whether a contract for project development services would -- consistent with the legislative findings and intent on which the enactment of section 14130 et seq. was based (Gov. Code 14130) -- ensure the timely capture and use of all available funds for state highway projects; reduce short term fluctuations in the project development workload while enabling the department to be plan-ready; facilitate the expeditious use of locally raised funds for state highway projects \"recognizing that in this instance, local governments are partners in state highway construction and that locally financed projects should not be unnecessarily delayed\"; and be cost-effective. (Gov. Code § 14134, subs (a)(1)-(a)(4).) In addition, the guidelines must require a contract selection process in accordance with fair procedures and state laws on the selection of contractors for architectural, engineering, environmental or land surveying services. (Gov. Code § 14134.)\n\nContracts authorized by section 14130 et seq. may not displace any Caltrans employee. In addition, contractors are to be selected on the basis of their qualifications in a detailed process defined by Government Code Section 4524 et seq., Caltrans regulations implementing section 4525 et seq., and specified additional procedures. (Gov. Code §§ 14132, 14333, subd. (b).) Finally, Caltrans may not select for the performance of a highway construction contract an engineering or architectural firm that provided design services for the project; must provide a civil service employee as a resident engineer (to perform construction inspection) on any construction contract that results from project design services provided under contract; and must review and approve all contract plans and plan changes performed under contract. (Gov. Code § 14135.)\n\nA strict application of the \"nature of the services\" test and the \"new state function\" test to Caltrans' contracts with private consulting firms for the performance of project development and construction inspection services under sections 14101 and 14130 et seq.4a would result in a determination that the contracts violate article VII of the California Constitution. (See Burum v. State Compensation Ins. Fund, supra, 30 Cal. 2d 575, 184 P.2d 505; California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d 390.) Historically and routinely until 1986-87, Caltrans civil service professionals performed both project development and construction inspection services. Contracts under section 14101 were let only for highly technical and specialized services like archaeological services, hazardous waste investigations and aerial mapping.\n\nNonetheless, Caltrans contracts for project development services and construction inspection under sections 14101 and 14130 et seq. may be permissible under article VII to the extent that the contracts serve public interests consistent with state civil service objectives of merit, efficiency and economy and are administered in accordance with standards and procedures that protect the state civil service against dissolution and the spoils system of employment based on political patronage and favoritism. (See California State Employee's Association v. State of California, supra, 199 Cal. App. 3d at p. 851-853.) Under such circumstances, the services performed under the contracts could not be \"adequately or competently or satisfactorily\" by state civil servants. ( Id. at p. 851.)\n\nThe Legislature has recognized the critical dependence of the state's economy on its transportation system and the strong public interest in facilitating interregional travel in the state through the state highway system. (See Gov. Code §§ 14529.5, subd. (c), 14529.6, subd. (d), 65088, subd. (a); Stats. 1988, ch. 24, § 2, subd. (a)(1).) In addition, the Legislature has recognized the importance of expediting project development services so that all available funds for the construction and maintenance of the state transportation systems may be timely captured and used and so that inflationary losses in available funds are avoided. (See Gov. Code §§ 14130, subd. (a)(1)-(2), 14529.5.) Finally, the Legislature has recognized the importance of contracts with private consultants and cooperative agreements with local public agencies as a method of avoiding the \"costly process of short-term hiring and layoff while still responding in a timely manner to funding opportunities and uncertainties\" causing short-term fluctuations in the Caltrans workload. (Gov. Code § 14130, subd. (a)(3).)\n\nThese public interests in expediting the development and construction of a state highway system to meet the growing transportation needs of the state's population and economy and these legislative views on the use of contracts for short-term peak workloads are consistent with the constitutional civil service objectives of efficiency and economy in state government. Contracts which further these public interests and implement these legislative view reasonably fall within the Legislature's discretion under article VII of the California Constitution to set up laws relating to personnel administration for the best interest of the State.\" (See Pacific Legal Foundation v. Brown, supra, 29 Cal. 3d at 183-184; California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at p. 853.) Quite conceivably, contracts let under Government Code section 14101, \"when obtainable staff is unable to perform the work within the time the public interest requires such work to be done,\" or contracts let under Government Code section 14130 et seq., \"whenever the department is inadequately staffed to satisfactorily carry out its projects development program in a timely and effective manner,\" further these public interests, implement these legislative views, and hence are consistent with the objectives of article VII of the California Constitution. The fact that the performance of work under individual contracts pursuant to these sections may be more expensive than or may be equal in quality, quantity and speed to the performance of the work by state civil service employees is immaterial if, overall, the contracts promote efficiency and economy in the performance by state government of its public responsibilities.\n\nFurthermore, contracts let under either section 14101 or 14130 et seq. are hedged with significant safeguards against the political patronage and favoritism that characterized the spoils system of employment and was replaced by the civil service system of employment based on merit. Contractors must be selected in the course of a detailed process on the basis of professional qualifications and demonstrated competence to perform the work. (Gov. Code §§ 4525 et seq., 14132, 14133, subd. (b).) By express provision under section 14130 et seq. (Gov. Code § 14131) and by necessary implication under section 14101, civil service employees may not be displaced by the contracts. In these ways, contracts under both section 14101 and section 14130 et seq. are carefully and consciously designed to protect the integrity of the constitutional civil service system and the merit principle on which it is based.\n\nThus, the authority of Caltrans to contract outside state government under Government sections 14101 and 14130 et seq. is not facially violative of article VII of the California Constitution. Such contracts may, consistent with the purposes of the state civil service, reasonably cover work which cannot be \"adequately or competently or satisfactorily\" performed by civil service employees. (See California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at pp. 851.)\n\nNonetheless, the facts underlying the contracts let by Caltrans under section 14101 for project development and construction inspection services since the 1986-87 fiscal year indicate that Caltrans applied its contractual authority under 14101 in violation of article VII.\n\nThe Court finds that Caltrans contracted for project development and construction inspection services as a direct result of a gubernatorial/executive branch policy against the expansion of state government. Caltrans contracted for the performance of these services, not because it was unable to obtain and hire new civil service employees to perform the services, but because Caltrans' requests for additional staff were refused by the Department of Finance from 1983-84 through 1986-87. Subsequently, Caltrans' requests for additional staff were balanced and tempered by requests for contracting funds, an artificial approach incorporated into Government Code section 14524.2 as an inflexible formula that did not consider the actual availability of qualified persons for employment through the civil service and the actual ability of Caltrans to assimilate and train such persons within the time frame deemed necessary.\n\nIn addition, no evidence supports the claims of Caltrans that the increases in their workload beginning in 1983-84 were short-term or temporary and, therefore, were most economically and efficiently addressed through contracting. The increases in Caltrans' workload were largely attributable to new funding sources like local tax measures and private developers which, based on the evidence presented in this lawsuit, gave no indication of subsiding.\n\nFinally, the assumption that contracting would enable Caltrans to perform its project development work in a more timely and effective manner than the hiring of new civil service staff proved to have a very limited validity. Caltrans was only able to execute contracts for approximately 20 percent of its allocation for contracts from 1986-87 through 1988-89. In addition, the contractors required specific orientation to Caltrans standards and procedures and, therefore, performed more slowly and required more oversight by Caltrans staff than had been planned. Thus contracting did not likely provide any more immediate or effective a remedy for Caltrans' increasing workload than would have been provided by the hiring and training of qualified staff over the 18-month period considered necessary by Caltrans. The department failed to demonstrate that contracting was an effective tool to manage temporary, short-term peaks in workload.\n\nThus the stated justifications for contracts under section 14101 for project development and construction inspection -- justifications articulated in Government Code section 14130 -- lacked factual basis in this case. Having a basis in only in theory, the contracts let by Caltrans from 1987-87 through 1988-89 under section 14101 served only to displace the established role of civil service professionals in Caltrans, in violation of article VII of the California Constitution.\n\nCooperative Agreements with Local Entities\n\nCaltrans has authority to enter into cooperative agreements with local public entities under section 114 or the Streets and Highways Code. The language presently contained in subdivision (a) of section 114 was enacted in 1935, after the civil service provisions of the California Constitution were adopted by the electorate, and amended in 1977 (Stats. 1935, ch. 29; Stats. 1977, ch. 547); the language derives from a statute enacted in 1927 and amende in 1933, prior to the adoption of the constitutional civil service provision. (Stats. 1927, ch. 794; Stats. 1933, ch. 767, § 5, p. 2033.) Pursuant to subdivision (a), when the commission has allocated funds for the construction, improvement or maintenance of any portion of a state highway within a city or county, Caltrans may enter into cooperative agreements with a local public entity for the performance of the work by Caltrans or the local entity of for the apportionment of the expense of the work between Caltrans and the local entity. (See also Sts. \u0026 Hy. § 130.)\n\nSubdivision (b) of section 114, added by two amendments in 1988, makes it mandatory for Caltrans to enter into cooperative agreements with a local entity for the performance of project development services on a state highway. The first amendment, enacted as part of the legislation adding sections 14130 et seq. of the Government Code, was based on a legislative intent that local public agencies be permitted to undertake state highway project development activities for which they are a funding source. (Stats. 1988, ch. 9, § 4; see Gov. Code § 14130, subd. (b).) The amendment required Caltrans to enter into a cooperative agreement with a local public agency for the performance of project development services \"when the department would otherwise contract for those services and where local public agency resources currently available are qualified to perform the services.\" (Stats. 1988, ch. 9, § 4.) The second amendment, superseding the first, requires Caltrans to enter into cooperative agreement with a local public entity \"if the department determines that the entity has qualified and available staff to perform the necessary project services.\" (Stats. 1988, ch. 1218.)\n\nCooperative agreements under section 114 of the Street and Highways Code between Caltrans and local public entities arise out of a markedly different statutory and historical context than do contracts with private consultants under sections 14101 or 14130 et seq. Subject to the ultimate control of the state highways by Caltrans, local public agencies have shared responsibility for the construction, improvement, maintenance and funding of state highways within their geographical jurisdictions since the 1920s. (See Sts. \u0026 Hy. §§ 90 et seq.) Upon delegation by Caltrans, cities and counties have been authorized to exercise Caltrans' powers and jurisdiction, except the power of approval, with respect to state highways. (See, e.g., Sts. \u0026 Hy. § 116.)\n\nIn addition, a variety of political subdivisions of the state share responsibility with Caltrans and the commission for planning and programming the state transportation infrastructure. (See Gov. Code §§ 14000, subds. (b), (e), 14000.5, subd. (b), 14030 sub. (c).) The commission bases the STIP both on a state transportation improvement program proposed by Caltrans and on transportation improvement programs proposed by regional transportation planning agencies, county transportation commissions and various counties. (Gov. Code §§ 14526, 14527, 14529, subd. (e), 65080 et seq.)\n\nThis historical and statutory role of political subdivisions of the state in the planning, development, construction, maintenance and funding of the state highway system reflects a considered judgment by the Legislature on the appropriate method of performing the state's transportation responsibility. A legislative decision to elaborate upon and expand the established role of political subdivisions in the performance of these responsibilities, under the continuing direction of Caltrans and the commission, does not represent a qualitative change in the historical legislative scheme and does not offend or even implicate the constitutional state civil service mandate. (Cf. California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at pp. 398-399.) Accordingly, the authority of Caltrans under section 114 to enter into cooperative agreements with local public entities for the performance of state highway project development and contract inspection is not facially violative of article VII of the California Constitution.\n\nNotably, however, Caltrans has unconstitutionally applied its authority under section 114 to the extent that it has entered into cooperative agreements with local public entities which contain provisions permitting the local entities to perform the work covered by the agreements through private consultants under contract. Such provisions in cooperative agreements, like those in the cooperative agreements between Caltrans and various counties which were presented to this Court at trial, are outside the terms and scope of section 114. With respect to cooperative agreements for project development services in particular, Caltrans is permitted to enter into the agreements only when its director determines that the local entities have available and qualified staff to perform the work. (Sts. \u0026 Hy. § 114, subd. (b).) Moreover, such provisions in cooperative agreements, permitting local public entities to contract with private consultants, would enable the local entities directly and Caltrans indirectly to contract outside the state civil service without statutory or constitutional authorization and without safeguards against the political patronage and favoritism of the spoils system of employment.\n\nContracts for Construction Survey Staking\n\nSince 1986-87, Caltrans has been including construction survey staking as an item of the construction contracts awarded to private firms under the State Contract Act. (Pub. Contracts Code § 10100 et seq.) Prior to that time, Caltrans civil service professionals directly and routinely performed construction survey taking.\n\nCaltrans offers no jurisdiction for contracting construction survey staking outside the state civil service other than its administrative discretion to assign the tasks associated with construction contracts in any way that it deems appropriate. This reason, however, does not constitute an adequate basis under article VII of the California Constitution for displacing an established and adequately performed function of its state civil service employees. ( Burum v. State Compensation Ins. Fund, supra, 30 Cal. 2d at p. 581.)\n\nTHEREFOR IT IS ORDERED that judgment issue:\n\n1. Declaring that the contractual authority of Caltrans under sections 14101 and 14130 et seq. of the Government Code does not facially violate article VII of the California Constitution;\n\n2. Declaring that Caltrans has violated article VII of the California Constitution by contracting outside the state civil service under section 14101 or the Government Code for state highway project development and construction inspection services without factually establishing that it could not timely perform the work by hiring and training additional civil service professionals or that contracting was an effective method of meeting short-term peaks in the Caltrans state highway project workload;\n\n3. Enjoining Caltrans and its director from contracting outside the state civil service for project development services under sections 14101 or 14130 et seq. of the Government Code unless and until they demonstrate the existence of facts which satisfy the criteria for contracting under sections 14101 and 14130 et seq.;\n\n4. Declaring that section 114 of the Streets and Highways Code does not facially violate article VII of the California Constitution;\n\n5. Declaring that Caltrans has violated article VII of the California Constitution by entering into cooperative agreements with local public entities under section 114 of the Streets and Highways Code which contain provisions permitting the local public entities to perform the work covered by the agreements through private consultants under contract;\n\n6. Enjoining Caltrans from entering into cooperative agreements with local public entities under Streets and Highways Code section 114 when such agreements provide for the performance of the work, in part or in whole, by private consultants under the contract with the public entities;\n\n7. Declaring that Caltrans has violated article VII of the California Constitution by including construction survey staking as an item in contracts awarded to private firms under the State Contract Act, Public Contract Code sections 10100 et seq., for the construction of state highways;\n\n8. Enjoining Caltrans from including construction survey staking as an item in contracts awarded to private firms under the State Contract Act. Public Contract Code sections 10100 et seq., for the construction of state highways.\n\nDated:\n\nJUDGE OF THE SUPERIOR COURT\n\nAPPENDIX II\n\nAPRIL 19, 1994, FILED\n\nSUPERIOR COURT OF CALIFORNIA, COUNTY OF SACRAMENTO\n\nPROFESSIONAL ENGINEERS IN CALIFORNIA GOVERNMENT (PECG), a California corporation on behalf of its members, and RICHARD T. BAKER, a citizen on behalf of himself and all taxpayers of the State of California, Petitioners and Plaintiffs, vs. DEPARTMENT OF TRANSPORTATION, STATE OF CALIFORNIA (CALTRANS); and LEO J. TROMBATORE, in his capacity as Director of the Department of Transportation; and DOES I through XXX, inclusive, Respondents and Defendants.\n\nNo. 336697, Dept. 29\n\nConsolidated with No. 342501 and 346893\n\nORDER\n\nThe injunction set forth in paragraph 6A of the judgment entered April 17, 1990, prohibits defendants from contracting outside the civil service for project development services under section 14101 or 14130 et seq. of the Government Code unless they demonstrate the existence of facts which satisfy the criteria for contracting under sections 14101 or section 14130 et seq. The parties seek clarification and/or modification of the injunction and subsequent enforcement orders in light of the enactment of Chapter 433 or the Statues 1993, which amended and added to the provisions of section 14130 et seq.1b\n\nBACKGROUND\n\nAs explained in a statement of decision filed March 26, 1990, the Court issued the injunction after determining that defendants were violating article VII of the California Constitution by contracting outside the civil service with private consultants for the performance of a portion of the project development, construction inspection and survey staking workload historically performed by civil service employee.2b The Court determined that sections 14101 and 14130 et seq. validly authorized defendants to contract under article VII only in circumstances which promoted efficiency and economy in state government without jeopardizing the integrity of the civil service system. The Court found, however, that the defendants had misapplied the statutory authority.\n\nBetween 1987 and 1990, defendants had contracted with private consultants for the performance of project development work principally under Government Code section 14101. They had justified the contracts on the ground that adequate civil service staff could not be obtained to timely perform the work. Evidence presented at trial, however, established that defendants had created shortages in the civil service staff when their workload was increasing during the 1980s. (Statement of Decision, pp. 4, 21-22.) They added no staff to meet the increasing workload during the 1983-84 through 1986-87 fiscal years because of an executive policy against the expansion of state government and because of assumptions that the increasing workload was short-term and future funding for state highway projects was uncertain. Subsequent staff additions were tempered and balanced with budget authority to contract for project development work without evidence that defendants were unable to unable to obtain sufficient civil service staff to timely perform the work. Thus, the budget authority to contract served to displace the civil service staff from its historical performance of project development work, in violation of article VII of the California Constitution. (Statement of Decision, pp. 22-23.)\n\nPursuant to the injunction and subsequent enforcement orders entered by the court, defendants made significant efforts through the 1991-92 fiscal year to hire and train sufficient civil service staff to perform its project development workload and eliminate the shortages created during the 1980s. (Ruling re Contempt, August 29, 1991, p. 6.) During this period, defendants contracted pursuant to Government Code section 14130 et seq. for the portion of the workload beyond the capacity of available civil service staff. On a number of occasions, they were unable to factually demonstrate to the Court that the contracts satisfied the criteria for contracting in section 14130 et seq., hence the restriction on contracting outside the civil service under article VII. (Ruling re Contempt, August 29, 1991; Order after Hearing, January 25, 1991; Order, April 1, 1991.)\n\nFor the 1992-93 fiscal year, defendants decided to limit the hiring of civil service staff and maintain 1991-92 staffing level while contracting with private consultants for the performance of project development work which exceeded the capacity of civil service staff. (Letter of Determination for Fiscal Year 1992-93 Regarding Contracting for Project Development Services, June 29, 1992.) Defendants based this decision on a projected decline in the workload of highway projects from 1991-92 to 1996-97 attributable to uncertain or declining revenues for such projects, the completion of seismic retrofitting work by 1996-97 and the declining and unpredictable nature of work funded by local agencies. In defendants' view, any civil service staff hired to perform the 1992-93 workload would have to be terminated by 1996-97, a costly process of short-time hiring and layoffs to be avoided through contracting pursuant to section 14130 et seq.\n\nIn an order entered May 18, 1993, the Court determined that defendants' decision to contract for project development work in 92-93 while maintaining their civil service staff at its 91-92 level lacked an adequate factual basis for contracting outside the civil service under Government Code 14130 et seq., the Court's injunction and article VII. The Court found that defendants' projection of a workload decline was tenuous and unreliable; despite the projected uncertainties and decline in revenues, defendants were increasing and accelerating projects for early delivery in 1992-93 and 1993-94; no evidence indicated that the increase and acceleration of projects was necessary to timely capture and use funds available for highway projects; and no evidence indicated that the workload of projects scheduled for delivery in future years was being reduced. The Court rejected as unreasonable the blanket exclusion of all seismic retrofitting and all locally funded work from the workload projections used to determine civil service staffing needs. The Court concluded that defendants were underestimating their workload without an adequate factual basis, stabilizing their civil service staff at a level insufficient to perform the actual workload, and necessitating the use of contracts with private consultants for the performance of scheduled and unscheduled work beyond the capacity of civil service staff.\n\nIn response to the May 18th order, defendants sough to minimize and phase out contracts with private consultants for project development work during the 1993-94 fiscal year. (Letter of Determination for Fiscal Year 1993-94 Regarding Contracting for Project Development Services, June 28, 1993.) Defendants decided to use their 1992-93 budget authority of 855 PYEs (personnel-year equivalents) in the amount of $106 million for contracts to avoid significant disruptions in work already in progress, to avoid delay in projects involving public safety, and to provide unique expertise not available or obtainable through the civil service. To perform the remaining project development work which had been targeted for performance by private consultants during 1992-93, defendants made limited term, retired annuitant and temporary civil service appointments and used cash overtime.\n\nAt defendants' request, the Court considered whether defendant's decision to minimize and phase out contracting during 1992-93 complied with the injunction. The Court found that it did in an order entered August 6, 1993. The Court recognized that defendants planned to continue some contracts which, as indicated in its order of May 18, 1993, defendants had entered without adequate factual justification to satisfy the injunction, section 14130 et seq., and article VII. The Court found, however, that defendants planned to continue such contracts only to the extent necessary to protect the public interest and planned to enter new contracts only under circumstances permissible under article VII.\n\nOn September 29. 1993, following the Legislature's enactment of urgency amendments and additions to Governemtn Code section 14130 et seq. in Chapter 433 of the Statutes of 1993, defendants revised their plans for minimizing contracts with private consultants for the performance of project development work during 1993-94. (Revised Letter of Determination for Fiscal Year 1993-94 Regarding Contracting for Project Development Services, September 29, 1993.) Defendants indentified 757 PYEs of seismic retrofitting work and 502 PYEs of reimbursed work for local agencies in defendants' workload which were eligible for contracting pursuant to chapter 433. Defendants authorized contracts for 952 PYEs, the sum of their 1992-93 budget authority to contract for 855 PYEs plus a redirection of 1992-93 budget resources from expert witnesses, equipment and fleets to contracts for 97 PYEs.\n\nTo justify contracting for 952 PYEs of project development work instead of hiring additional permanent civil service staff to accomplish the work, defendants relied on provisions of chapter 433. Defendants referred to the \"legislative direction [in section 14137] to continue contracts in existence on July 1, 1993, to insure timely delivery of transportation improvements\"; to the goal in section 14130 subdivision (a), of \"generating maximum employment and business opportunities in California\"; and to \"future funding uncertainties, the projected decline in project development workload, and the goal [in section 14130, subdivision (b)] to maintain a stable work force which avoids short-time hiring and layoff.\" Defendants indicated that the 952 PYEs of contracts for project development work would not displace any permanent state employees.\n\nAfter revising their plans for contracting during 1993-94, defendants initiated the termination of limited term appointments and a 50 percent reduction in temporary help to eliminate an \"over-staffed condition [i.e., staffing in excess of budget authority] versus the approved workload, and 1% legislative reduction, and potential contracting dollar commitments.\" (Defendants' Report filed October 15, 1993, Exhibit 10, Memoranda from W.J. Evans, Division of Budgets, dated September 28 and October 7, 1993.) Effective January 4, 1994, defendants froze the hiring of persons not currently employed by Caltrans, including limited-term appointments, TAUs, and new and extended retired annuitant appointments.\n\nFor the 1993-94 fiscal year through January 1994, defendants contracted for 898 PYEs of project development work, including 170 PYEs of seismic retrofitting and 91.8 PYEs of locally funded work.3b (Defendants' Response to Court's Request for Further Information, filed February 28, 1994. The remaining 636.2 PYEs were contracts for project development and construction inspection work, some of which may have been in force or awarded on or before July 1, 1993, and were continued pursuant to Government Code section 14137. Defendants froze further contracting for 1993-94 on January 14, 1994. In February, they reported that they may contract for the performance of an additional 80 PYEs of seismic retrofitting work, bringing the total PYEs of contracted project development work to 978 for the 1993-94 fiscal year.4b (Defendants' Response to Court's Request for Further Information, filed February 28, 1994.)\n\nFor the 1993-94 fiscal year through January 1994, there was a net loss of 97 in permanent full-time civil service staff and a net loss of 15 in student assistants. There was a net gain of 58 in non-full-time-permanent civil service staff, primarily retired-annuitant appointments and some limited-term appointments.5b Cash overtime was restricted to the extent necessary to remain within budget authority for civil service capital outlay support staff.\n\nThe project development work to be performed by civil service staff during the 1993-94 fiscal year includes 344 PYEs of seismic retrofitting and 416 PYEs of locally funded work.\n\nCONTENTIONS\n\nPlaintiffs contend that the amendments and additions made to Government Code section 14130 et seq. by chapter 433 do not authorize defendants to contract outside the civil service for the performance of project development services unless they establish specified factual circumstances, none of which presently exists. Plaintiffs contend that to the extent the amendments and additions of chapter 433 authorize defendants to contract without establishing specified factual circumstances, the amendments and additions authorize contracting in violation of the civil service mandate in article VII of the California Constitution and the separation of powers requirement in article III of the California Constitution. Plaintiffs conclude that chapter 433 does note provide a basis for modifying the injunction and that defendants lack the factual basis required by the injunction to contract outside the civil service during the 1993-94 fiscal year.\n\nDefendants assert that chapter 433 expanded their contracting authority under Government Code section 14130 et seq. beyond the scope of that authority when the injunction issued. Defendants' cite legislative findings and declarations enacted by chapter 433 to provide new justifications for contracting outside the civil service without the necessity of showing specified factual circumstances. Defendants argue that these new legislative justifications are consistent with the civil service mandate in article VII of the California Constitution and do not violate the separation of powers requirement in article III of the California Constitution. Defendants conclude that chapter 433 has changed the law and facts on which the injunction was based to the extent that sufficient grounds for the injunction no longer exist. Defendants request the Court to dissolve the injunction.\n\nANALYSIS\n\nThe injunction issued April 17, 1990, was intended to ensure that defendants contracted with private consultants for project development services only to the extent permitted by article VII of the California Constitution. Below, the Court determines: I. whether defendants' contracting activity during the 1993-94 fiscal year complies with the injunction, hence article VII, and II. whether Chapter 433 of the Statutes of 1993 provides new justifications for contracting which are consistent with article VII and render the injunction obsolete.\n\nI\n\nDefendants' existing and planned contracts for project development work during 1993-94 do not comply with the injunction in three ways. First, defendants' contracts are based on a determination pursuant to section 14131 -- the Revised Letter of Determination for Fiscal Year 1993-94 Regarding Contracting for Project Development Services, issued September 29, 1993 -- which fails to state or reference facts demonstrating that the criteria for contracting in section 14130 et seq. are satisfied. Instead of facts, the revised determination relies on legislative findings, goals and directions enacted by chapter 433. To justify contracts for seismic retrofitting, the revised determination relies, without a factual showing, on a legislative characterization of seismic retrofitting work as short-term workload demand (§ 14130.1) and a legislative policy goal of maintaining a stable work force and avoiding short-term hiring and layoff by contracting for the performance of workload peaks created by short-term workloads. (See §§ 14130, subds. (a)(3) and (b), 14134, subd. (a)(2); Contracting Out Guidelines Pursuant to Government Code Section 14134(a), issued September 29, 1993.) To justify contracts for locally funded work, the revised determination relies, without a factual showing, on a legislative policy directive that locally funded work need not be considered in the determination of project delivery staffing needs (§ 14130.2) and the legislative policy goal of maintaining a stable work force to avoid short-term hiring and layoff when \"less predictable\" workload under the control of others does not occur. (Ibid.) To justify contracting generally, the revised determination refers to a legislative direction to continue contracts for engineering services which were in force or awarded on or before July 1, 1993 (§ 14137) and a legislative recognition of a compelling public interest in the timely use of funds for the state highway program to generate maximum employment and business opportunities in California. (§ 14130, subd. (a)(1).)\n\nSecond, information provided to the Court by defendants reveals that the type and amount of project development work contracted by defendants during 1993-94 does not correspond to the type and amount authorized by the revised determination under section 14130 et seq. The revised determination authorizes contracts for 952 PYEs of seismic retrofitting and locally funded work, but defendants plan to contract for the performance of 978 or more PYEs, the majority of which involve project development and construction inspection services instead of seismic retrofitting and locally funded work. The bulk of the retrofitting and locally funded work authorized for contracting is being performed by civil service staff. Defendants have not determined pursuant to section 14131 that their contracts with private consultants for project development and construction inspection services during 1993-94 satisfy the criteria for contracting under section 14130 et seq.6b\n\nThird, information provided to the Court by defendants indicates that their contracting activity during 1993-94 is contributing to the displacement of permanent, temporary and part-time civil service staff in the performance of project development work. Temporary, limited-term and retired annuitant appointments, hired to perform work which had been targeted for performance by private consultants prior to the order of May 18, 1993, were slated for termination or substantial reduction after the passage of chapter 433 and defendants' revised determination in September 1993. The reduction was instituted to avoid a shortfall in budget authority \"due to an over-staffed condition versus the approved workload, the 1% legislative reduction, and potential contracting dollar commitments.\" While defendants augmented their budget authority for contracting by redirecting budget resources from expert witnesses, fleets and equipment, they took no similar steps to augment their budget authority for civil service staff. Rather they restricted cash overtime and froze the hiring of person from outside Caltrans for permanent civil service vacancies and for limited-term, retired-annuitant and other temporary appointments. Thus, without considering the availability of civil service staff to perform project development work, defendants favored the use of private consultants to perform the work under contract.\n\nThe Court concludes that, contrary to the injunction issued April 17, 1990, defendants are contracting during 1993-94 without factually demonstrating that the criteria for contracting under section 14130 et seq. are met. Their noncompliance with this central requirement of the injunction, as well as information about their actual contracting during the fiscal year, indicates that defendants are displacing civil service staff from the project development work the staff has historically performed. Defendants are repeating, in violation of the constitutional civil service mandate, their practice since the mid 1980s of maintaining civil service staff at a level inadequate for the performance of the work and thereby artificially creating a need for contracts with private consultants to timely accomplish the work.\n\nII\n\nThe Court next determines whether Chapter 433 of the Statutes of 1993 provides justifications for defendants' contracting under article VII, whether or not they comply with the factual requirements of the injunction. The Court begins with the Legislature's statement of its intent in enacting chapter 433, that \"the Director of Transportation have the continued flexibility to contract our, according to [section 14130 et seq.], at a level or levels necessary in the judgment of the director to timely deliver transportation projects.\" (Stats. 1993, ch. 433, § 1.) The Legislature further stated its intent that the enactment \"be construed as affording the Director of Transportation a new and independent basis upon which to justify contracting out actions....\" (Ibid.)\n\nPursuant to this stated intent, the Legislature (A) found that using private consultants to assist in project delivery is a new state function which does not duplicate the existing functions of the department, (B) found that the civil service will not be able to perform project delivery competently, adequately or satisfactorily without a stable program of contracting, (C) found that the seismic safety retrofit program set for in Streets and Highways Code section 179 et seq. is a short-term workload demand, (D) directed defendants to continue contracts in force or awarded on or before July 1, 1993, and (E) set forth policy directives to encourage contracting.\n\nIn reviewing the sufficiency of these statutory findings and directives to justify defendants' contracting under article VII, the Court is governed by the presumption of constitutionality accorded to legislative acts and the deference given a focused legislative judgment as to the appropriate reach of a constitutional provision.7b ( Pacific Legal Foundation v. Brown (1981) 29 Cal. 3d 168, 180, 172 Cal. Rptr. 487, 624 P.2d 1215.) \"Courts have nothing to do with the wisdom of laws or regulations, and the legislative power must be upheld unless manifestly abused so as to infringe on constitutional guaranties. The duty to uphold the legislative power is as much the duty of appellate courts as it is of trial courts, and under the doctrine of separation of powers neither the trial nor appellate courts are authorized to 'review' legislative determinations. The only function of the courts is to determine whether the exercise of legislative power has exceeded constitutional limitations.\" ( Lockard v. City of Los Angeles (1949) 33 Cal. 2d 453, 461-462, 202 P.2d 38. See Eye Dog Foundation v. State Board of Guide Dogs for the Blind (1967) 67 Cal. 2d 536, 545, 63 Cal. Rptr. 21, 432 P.2d 717; Coffee-Rich v. Fielder (1972) 27 Cal. App. 3d 792, 810, 104 Cal. Rptr. 252.)\n\nAs stated in Lockard, \"'The rule is well settled that the legislative determination that the facts exist which make the law necessary, must not be set aside or disregarded by the courts, unless the legislative decision is clearly and palpably wrong and the error appears beyond reasonable doubt from facts or evidence which cannot be controverted, and of which the courts may properly take notice.'\" (Id. at p. 461, quoting In re Miller (1912) 162 Cal. 687, 696, 124 P. 427. See Dittus v. Cranston (1959) 53 Cal. 2d 284, 1 Cal. Rptr. 327, 347 P.2d 671; Dittus v. Cranston (1960) 186 Cal. App. 2d 837, 839-840, 9 Cal. Rptr. 314, quoting Stevenson v. Colgan (1891) 91 Cal. 649, 652, 27 P. 1089.) The courts may set aside the legislative findings on which the constitutionality of a statute is based only if the legislative findings could not reasonably be true on their face or in light of judicially noticeable facts.\n\nA\n\nIn section 14130, subdivision (a)(5), the Legislature finds that \"the use of private consultants to assist in project delivery is a new state function and does not duplicate the existing functions of the department.\" By subdivision (a)(5), the Legislature seeks to give defendants authority to privately contract for project delivery services under a judicially created exception to the constitutional civil service mandate and the implicit restriction against contracting outside the civil service in article VII. (See California State Employees' Assn. v. Williams (1970) 7 Cal. App. 3d 390, 397-399, 86 Cal. Rptr. 305.) The judicially created exception permits contracts for services which do not duplicate existing state agency functions performed by the civil service and thus do not displace the civil service or threaten the constitutional civil service policy with dissolution and destruction. ( Id., at p. 397; Professional Engineers v. Department of Transportation (1993) 13 Cal. App. 4th 585, 592-593.) The judicially created exception does not permit the use of contracts to expand existing state agency functions. (See California State Employees' Assn. v. Williams, supra, 7 Cal. App. 3d at p. 399.)\n\nFrom facts which the Court may properly judicially notice,8b it is evident that defendants' contracts with private consultants for the performance of engineering services to deliver highway projects duplicate an existing state function historically performed by civil service staff. The contracts are intended to supplement the work of civil service staff (see § 14130, subd. (a)(4)), and defendants use private consultants interchangeably with civil service staff to provide project design and development, construction inspection, locally funded seismic retrofitting, and other project delivery services. Unlie the private development of toll roads at issue in Professional Engineers, supra, no new methods of managing, financing, or otherwise performing project delivery work distinguish the work performed by private consultants from the historically and presently performed by civil service staff.\n\nSubdivision (5)(a) is palpably wrong in finding that defendants' use of private consultants to perform project delivery services is a new state function, years after civil service staff began performing the function. (See Department of Transportation v. Chavez (1992) 7 Cal. App. 4th 407, 415-416.) The contracts for project development services impermissibly displace the civil service's performance of an existing state function and jeopardize the civil service mandate in article VII. Thus, subdivision (a)(5) cannot constitutionally justify the contracts.\n\nB\n\nIn section 14130, subdivision (a)(4), the Legislature finds that \"without the ability to continue a stable contracting out program, ... the department will not be able to perform project delivery adequately, competently, or satisfactorily.\" In support of this finding, subdivision (a)(4) indicates that the use of private consultants has substantially enhanced project delivery; that private consultants recently helped to accelerate nearly one billion dollars worth of state highway projects; and that this increase in project capability must continue for timely project delivery.\n\nSubdivision (a)(4) seeks to give defendants authority to contract with private consultants for project delivery services under another judicially created exception to the restriction against contracting outside the civil service in article VII. The judicially created exception permits the state to contract privately for services which are of such a nature that civil service staff cannot perform them \"adequately, competently, of satisfactorily.\" ( Burum v. State Compensation Ins. Fund (1947) 30 Cal. 2d 575, 579-582, 184 P.2d 505; State Compensation Ins. Fund v. Riley (1937) 9 Cal. 2d 126, 134-136, 69 P.2d 985.) Under the judicially created exception, it may be permissible for the state to contract outside the civil service when the contract will result in overall cost savings to the state and thereby promote, consistent with the purposes of the civil service system under article VII, efficiency and economy in state government. (See California State Employees' Assn. v. State of California (1988) 199 Cal. App. 3d 840, 846-847, 853, 245 Cal. Rptr. 232.) It may also be permissible to contract \"when obtainable staff is unable to perform the work within the time the public interest requires such work to be done\" (§ 14101) or \"whenever the department [Caltrans] is inadequately staffed to satisfactorily carry out its project development program ... in a timely and effective manner.\" (§ 14130, subd. (b).)\n\nThe legislative finding in subdivision (a)(4) categorically establishes the inadequacy of defendants' civil service staff to timely deliver the workload. Without consideration of defendants' actual workloads in particular fiscal years or the actual number of regular and temporary civil service staff who could be obtained to accomplish the workloads in those years, the Legislature determines that defendants' workload will inevitably exceed the capability of civil service staff and, therefore, a \"stable contracting out program\" to supplement civil service staff will inevitably be necessary to timely responde to funding opportunities and timely deliver projects.\n\nSuch is not the case. As the Court may judicially notice,9b the inadequacy of civil service staff to timely deliver the workload of highway projects has been traceable, not to lack of available or obtainable personnel qualified to perform the work, but to defendants' policy and practice since the 1980s of maintaining civil service staff at a level inadequate to perform the workload and in contracting privately for the portion of the workload and in contracting privately for the portion of the workload exceeding the staff's capacity. Initially, defendants failed to add civil service staff to handle workload increases on the basis of an executive policy against the expansion of state government. Subsequently, they sough to stabilize civil service staff at a level below that necessary to accomplish the workload on the unsubstantiated grounds that the workload was declining, that portions of the workload were unpredictable or short-term peaks, and that private consultants had to be used in the short-term to avoid costly short-term hiring and layoff of civil service staff.10b\n\nWhen, in response to the Court's orders enforcing the injunction during 1991 and 1992, defendants sought to increase civil service staff to perform the workload, they were able to hire, assimilate and productively use qualified staff. In addition, after defendants' formulation of a plan to phase out most contracting during 1993-93 pursuant to the Court's order of May 18, 1993, they were able to secure limited-term and temporary civil service staff to \"backfill\" contracts with private consultants. Such efforts reduced the shortages of civil service staff impeding the timely delivery of highway projects.\n\nThus subdivision (a)(4) unreasonably generalizes the inadequacy of the civil service from staffing shortages which were purposely created by defendants while they implemented \"a stable contracting out program\" to supplement the civil service. The Legislature necessarily reached this generalization without determining the facts essential to a finding of whether civil service staff can adequately deliver the workload of highway projects: whether sufficient permanent and temporary staff are obtainable to perform the actual workload, and if so, whether such staffing can significantly increase defendants' project delivery capability as much as \"a stable contracting out program.\" Without consideration of such facts, defendants may artificially restrict the employment of sufficient civil service staff to perform the workload, privately contract the portion of the workload exceeding the restricted capability of the civil service, and thereby debilitate the civil service system mandated by article VII.\n\nThe legislative finding in subdivision (a)(4), conclusively establishing the inadequacy of the civil service to perform the project delivery workload, is clearly wrong and cannot constitutionally justify defendants' contracts for project development.\n\nC\n\nSection 14130.1 characterizes the engineering services necessary to complete the seismic safety retrofit program prescribed by Streets and Highways Code section 179 et seq. as a short-term workload demand. Read in the context of section 14130, subdivision (a)(3), and section 14134, subdivision (a)(2), this characterization serves to authorize defendants to contract for the performance of the engineering services necessary for the retrofit program on the ground that such contracting will avoid costly short-time hiring and layoff of civil service staff.\n\nAs indicated in the order of May 18, 1993, the characterization of the seismic retrofit program as a short-term workload demand has limited significance. Its length is comparable to or longer than many of the highway projects in defendants' workload. As in the case of many highway projects, it is subject to unavoidable delays and to an expansion of its scope by unanticipated events.11b\n\nAs a justification for contracting under article VII, the characterization of the seismic retrofit program as a short-term workload demand is deficient. Read in the context of section 14130, subdivision (a)(3), and section 14134, subdivision (a)(2), the characterization authorizes defendants to presume that contracts for engineering services necessary to the seismic retrofit program are justified without consideration of the civil service staff available and obtainable to perform the project development workload, including the retrofit program. Ironically, while defendants presume that contracting for the engineering services is justified, they are using predominately civil service staff to perform the services.\n\nThe characterization of engineering services for the seismic retrofit program as a short-term workload demand does not, but itself, provide an adequate constitutional justification for defendants' contracts for such services.\n\nD\n\nIn section 14137, the Legislature directs defendants to continue to completion those engineering contracts which were in force or were awarded on or before July 1, 1993. In effect, this action overrides the Court's determination in its order of May 18, 1993, that defendants' contracts with private consultants for project development work during the 1992-93 fiscal year were not justified by facts satisfying the criteria for contracting under section 14130 et seq.12b The section also effectively relieves defendants of their responsibility pursuant to section 14131 to determine whether the continued contracts satisfy the criteria for contracting under section 14130 et seq.\n\nSection 14137 states no facts to establish that the contracts which it continues are permissible under article VII. In enacting the section as part of chapter 433, the Legislature may have implicitly and retroactively determined that the contracts cover project development work which is a new state function pursuant to subdivisions (a)(5) of section 14130, which cannot be adequately performed by the civil service pursuant to subdivisions (a)(4) of section 14130, or which is a short-term workload demand pursuant to section 14131.1. As set forth above, however, these provisions do not provide justifications for contracting project development work outside the civil service.\n\nThe contracts continued by section 14137 have no identifiable justification under article VII. Thus, section 14137 unconstitutionally directs defendants to continue the contracts.\n\nE\n\nSeveral provisions in chapter 433 reflect the Legislature's intent to give the \"Director of Transportation ... the continued flexibility to contract out [under section 14130 et seq.] at a level or levels necessary in the judgment of the director of timely deliver transportation projects.\" (Stats. 1993, ch. 433, § 1.) Section 14130, subdivision (d), seeks to \"further the Legislature's intent to encourage contracting out\"; it authorizes defendants not to use state employees for all engineering and related services \"to the maximum extent required to meet the goals of [section 14130 et seq.]\" and not to \"staff to an internal level that matches its ability to assimilate and productively use new staff.\" Similarly, with respect to engineering services necessary to deliver a project whose construction is to be funded by a local jurisdiction, section 14130.2, subdivision (a)(2), authorizes defendants not to consider the project in determining its staffing needs and not to staff at a level to provide services for other agencies. Finally, section 14130, subdivision (a)(1), and section 14130.3 seek to generate employment and business opportunities in California, including opportunities for minorities, women, and disabled veterans, by reinstating contracts terminated as a result of recent court decision.\n\nThses statutory provisions establish a policy which detracts from the constitutional civil service mandate in article VII. The provisions authorize defendants to privately contract for engineering services to deliver transportation projects whether or not qualified civil service employees are available or obtainable to timely perform the services. Pursuant to the provisions, defendants may calculate their civil service staffing needs without considering the full workload to be performed, may limit their procurement of civil service staff regardless of actual staffing needs or ability to productively use new staff, and are required to reinstate contracts for the purpose of fostering employment and business opportunities without regard to the constitutional civil service mandate. As a result, defendants purposely create a need for \"a stable contracting out program\" to timely deliver transportation projects, institutionalize the use of contracting in project delivery, and displace civil service employees from the function they have historically performed, in violation of article VII.\n\nConclusion\n\nSince the 1980s, defendants have sought to privately contract a portion of their project development workload by systematically restricting the level of civil service staff available to perform the work. Defendants have pursued such contracting for project development work on the basis of administrative and management policies which conflict with and detract from the civil service mandate in article VII of the California Constitution. Unable to justify the contracting under article VII, defendants have nonetheless persisted in carrying it out, in violation of both the Court's injunction and the constitutional provisions.\n\nIn Chapter 433 of the Statutes of 1993, the Legislature has sought to provide defendants with justifications under article VII to implement their administrative and management policies for contracting. The legislative findings and directives comprising the justifications, however, are obviously erroneous, unreasonable and inconsistent with the constitutional civil service mandate. Whether or not the \"stable contracting out program\" intended by chapter 433 may have one or more valid public purposes, the program impermissibly contravenes the implicit restriction in article VII against contracting outside the civil service for the performance of state functions. (See State Compensation Ins. Fund v. Riley, supra, 9 Cal. 2d at p. 135-136; Department of Transportation v. Chavez, supra, 7 Cal. App. 4th at p. 417; California State Employees' Assn. v. State of California, supra, 199 Cal. App. 3d at pp. 844-845.) Only by appropriate constitutional amendment can the contracting program of chapter 433 be lawfully implemented. (See State Compensation Ins. Fund v. Riley, supra, 9 Cal. 2d at. p. 134.)\n\nThe Court concludes that Chapter 433 of the Statutes of 1993 is unconstitutional in that it authorizes defendants to contract with private consultants for the performance of project development services without a factual showing that the contracts are permissible under article VII. The enactment of Chapter 433, accordingly, does not warrant the modification of dissolution of the injunction in this action.\n\nIT IS ORDERED that the injunction issued April 17, 1990, and the orders issued to enforce the injunction are affirmed and remain in full force. To the extent that defendants justify their contracts with private consultants on the basis of the provision of Chapter 433 of the Statutes of 1993 instead of a factually supported determination pursuant to Government Code sections 14131 and 14134, the contracts are invalid and defendants are in violation of the injunction.13b\n\nIT IS FURTHER ORDERED that, to provide defendants with time to comply with this order, defendants shall file their report pursuant to the Court's order of August 6, 1993, on May 18, 1993 instead of April 15, 1993.\n\nDATED: APR 19 1994\n\nJUDGE OF THE SUPERIOR COURT\n\n\u003cspan class=\"fn\"\u003e1. As defined by the court, \"'project development services' or 'project development work' refers to the engineering services involved in the delivery of highway projects and includes construction inspection and oversight. Such services or work does not refer to highway construction . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The 1990 judgment reads in relevant part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"6. Defendants Department of Transportation, State of California (Caltrans), and its Director, their agents, officers, employees, and representatives, and all persons acting in concert or participating with them, are hereby permanently enjoined from engaging in or performing any and all of the following acts:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A. Contracting outside the state civil service for project development services under [Government Code] sections 14101 or 14130 et seq. of the Government Code unless and until they demonstrate the existence of facts which satisfy the criteria for contracting under [Government Code] sections 14101 or the criteria and guidelines for contracting under [Government Code] section 14130 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"B. Entering into cooperative agreements with local public entities under Streets and Highways Code section 114 when such agreements provide for the performance of the work, in part or in whole, by private consultants under contract with the public entities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"C. Including construction survey staking as an item in contracts awarded to private firms under the State Contract Act, Public Contract Code sections 10100 et seq., for the construction of state highways . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The relevant provisions of Article 2.5 of Chapter 2, Part 5, Division 3, Title 2, of the Government Code ( §§ 14130 et seq.) are set out in the Appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In so ruling, the court stated: \"In Chapter 433 of the Statutes of 1993, the Legislature has sought to provide defendants with justifications under article VII to implement their administrative and management policies for contracting. The legislative findings and directives comprising the justifications, however, are obviously erroneous, unreasonable and inconsistent with the constitutional civil service mandate. Whether or not the 'stable contracting out program' intended by chapter 433 may have one or more valid public purposes, the program impermissibly contravenes the implicit restriction in article VII against contracting outside the civil service for the performance of state functions. [Citations omitted.] Only by appropriate constitutional amendment can the contracting program of chapter 433 be lawfully implemented. [Citation omitted.] The Court concludes that Chapter 433 of the Statutes of 1993 is unconstitutional in that it authorizes defendants to contract with private consultants for the performance of project development services without a factual showing that the contracts are permissible under article VII. The enactment of Chapter 433, accordingly, does not warrant the modification or dissolution of the injunction in this action.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe trial court did not find that Caltrans was applying Chapter 433 in a way that was violative of Article VII, but that Chapter 433 unconstitutionally authorizes Caltrans to do so. This is a determination that the legislation is unconstitutional on its face.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Dissent proceeds on the theory that the trial court found Chapter 433 unconstitutional as applied by Caltrans rather than on its face. However, as discussed, the decision from which this appeal is taken and the proceedings underlying it demonstrate the superior court was presented with two separate questions: first, whether Chapter 433 is constitutional on its face; and second, if it is, whether Chapter 433 authorizes contracting practices that the injunction prohibits. Because the trial court answered the first question in the negative, it never reached the second.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Sections 2, 4, 5, 6, and 9 of Chapter 433 contain the provisions which are directly at issue here. They are effective only until January 1, 1998, unless extended by a later act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We note the illogic of the declaration that \"without the ability to continue a stable contracting out program\" Caltrans will be forced to use \"private consultants to supplement its in-house staff.\" In other words, if Caltrans is prohibited from contracting outside civil service it will be forced to contract outside civil service. Nevertheless, it is clear enough that the Legislature finds Caltrans cannot properly perform project delivery unless it can contract out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Streets and Highways Code section 143 authorized Caltrans to \"solicit proposals and enter into agreements with private entities, or consortia thereof, for the construction by, and lease to, private entities of four public transportation demonstration projects . . . .\" ( § 143, subd. (a).) Leases shall be for 35 years during which the private developers operate the facilities and collect tolls to be applied to capital outlay, costs, and a reasonable rate of return. ( § 143, subds. (b), (c), (d).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn enacting section 143 as an urgency measure, the Legislature indicated \"'public sources of revenues to provide an efficient transportation system have not kept pace with California's growing transportation needs'\" and alternate funding sources are needed. ( Professional Engineers v. Department of Transportation, supra, 13 Cal. App. 4th at p. 589.) According to the Legislature, \"privately financed projects could 'take advantage of private sector efficiencies' and 'more quickly bring reductions in congestion in existing transportation corridors.' [Citation.]\" (13 Cal. App. 4th at p. 589.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. As noted, section 14130, subdivision (a)(5) declares the use of private consultants to assist in project delivery a new state function. As we have indicated (Part V, infra), notwithstanding this declaration, chapter 433 does not create a new state function within the meaning of article VII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Considered in isolation from its overall context as part of Chapter 433, the provision excusing Caltrans from staffing \"to an internal level that matches its ability to assimilate and productively use new staff\" ( § 14130, subd. (d), emphasis added) arguably violates the civil service mandate, suggesting, as it does, that new staff, if employed, could perform engineering and related services historically performed by Caltrans \"productively,\" i.e. adequately, competently and satisfactorily. However, construing that provision \"with reference to the whole system of law of which it is a part\" ( Select Base Materials v. Board of Equal. (1959) 51 Cal. 2d 640, 645, 335 P.2d 672) and in a manner which favors its validity ( Turner v. Bd. of Trustees (1976) 16 Cal. 3d 818, 827, 129 Cal. Rptr. 443, 548 P.2d 1115), we deem the reference to \"productive[] use\" to refer to such use only in the context of \"short-time hiring\" as that term is used in section 14130, subdivision (a)(3). Such \"productive[] use\" would still entail costly layoffs, making it less desirable than outside contracting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Dissent suggests we have essentially construed \"productively\" to mean \"unproductively\" (Dissent, p. 8) because our interpretation of section 14130, subdivision (d) permits Caltrans to contract out \"even if it is not a cheaper or faster means of project delivery.\" (Dissent, p. 27.) This assertion is unfounded. The source of the Dissent's confusion is in assuming the phrase \"productively use new staff\" means such staff can perform a given task more cheaply and efficiently than outside contractors. However, \"productive\" means no more than effective in bringing about a desired result. (Webster's Third New International Dictionary (1971) p. 1810.) There is no reason to assume that because civil service staff may be utilized \"productively,\" i.e. effectively, it would not be more productive, given short term hiring and layoff expenses, to utilize outside contractors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We grant Caltrans' request that we judicially notice recent amendments to the Streets and Highways Code (stats. 1994, ch. 1012) regarding seismic safety retrofit work. (Evid. Code, § 451, subd. (a).) These amendments further evidence a legislative intent that Caltrans contract out such work.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Plaintiffs also argue section 14137 violates the California Constitution's article III by attempting to exercise powers reserved to the executive. We disagree. Section 14130 reinstates contracts \"subject to the same terms and conditions\" previously existing. As we read this section, the executive retains any preexisting power to terminate those contracts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It cannot be doubted that when it enacted Chapter 433 the Legislature had in mind article VII as judicially construed. Section 14130, subdivision (a)(5) refers expressly to the new state function exception to article VII. Section 14130, subdivision (a)(4) articulates a judicial qualification to the nature of the services test i.e. the ability of state employees to perform services \"adequately, competently or satisfactorily.\" Other provisions undertake to establish justifications for contracting out from considerations of efficiency and economy which would be unnecessary but for article VII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The parties were specifically directed to address the following questions:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"How does Chapter 433 expand [Caltrans'] authority to contract outside the civil service for engineering services beyond their authority under Government Code section 14101 and Government Code section 14130 et seq., as those statutes read until the enactment of Chapter 433?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Is the expansion of [Caltrans'] authority [by Chapter 433] consistent with the provisions of article III, section 3, and article VII of the California Constitution?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Are any of [Caltrans'] contracting activities for the 1993-94 fiscal year not authorized by Chapter 433?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. With perhaps one exception, none of the evidence presented by plaintiffs in respect to their application for order of contempt or opposition to the motion to modify or dissolve the injunction was relevant to impeach the legislative findings supporting the enhanced power to contract out authorized by Chapter 433. The bulk of this evidence related to Caltrans' purported failure to comply with the injunction, i.e. its excessive use of consultants while reducing staff. The single exception is evidence relating to the cost of contracting out compared to the cost of utilizing internal staff. In his supplemental declaration, Bruce Blanning, an executive assistant for plaintiff PECG, suggested the cost of one personnel year for civil service staff in fiscal year 1994-1995 was expected to be in the range of $70,078 to $75,000, whereas the cost of a personnel year for a consultant was expected to be $138,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEven assuming this evidence of differing costs of staff and consultants was accurate, it did not address the additional expenses associated with short-term hiring and layoffs or the expenses relating to the maintenance of excess civil service staff on the payroll during periods of reduced workload. The Dissent suggests we may infer from the evidence presented \"that contracting out some of the work in issue is more expensive than performing it in-house.\" (Dissent, p. 39.) In other words, we may infer these other expenses ignored by plaintiffs would not bring the cost of additional staff above the cost of outside consultants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn our view, such an inference is too great a leap in logic. A goal of Chapter 433 is to \"maintain a more stable workforce\" in order to \"avoid the costly process of short-time hiring and layoff.\" ( § 14130, subd. (a)(3).) Chapter 433 authorizes Caltrans to establish a core of civil service staff to perform the steady workload of the department augmented by outside consultants during periods of peak workload. Plaintiffs' evidence of the comparative costs of contracting out and continually resizing civil service staff to meet a labile workload is insufficient as a matter of law to impeach the implied legislative finding that the costs associated with short-term hiring and layoff justify Chapter 433's enhanced authority to contract out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Caltrans does not contend, and hence we do not address, whether work associated with the seismic safety retrofit program can be considered a new state function.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Dissent's analysis evidences this same confusion regarding the prior superior court findings. For example, regarding the 1990 order, the Dissent states: \"The court found, based upon facts adduced in a seven day trial, that these statutes [ §§ 14101 and 14130 et seq.] had been applied by Caltrans and the executive department to contract for services that could be competently and efficiently performed by civil service employees in violation of the civil service mandate of Article VII.\" (Dissent, p. 11.) Later, the Dissent suggests section 14137 \"is directed to the invalidation of specific and final orders of the trial court\" and \"the trial court had determined the rights and obligations of the parties to this litigation under contracts entered into under the law preceding Chapter 433.\" (Dissent, pp. 33, 34.) Finally, the Dissent suggests section 14137 violates the separation of powers between the legislative and judicial branches by attempting \"to reopen . . . matters resolved in a final judgment.\" (Dissent, p. 36.) As we explain, neither the 1990 order nor the subsequent orders of the superior court adjudicated the validity under Article VII of the contracts targeted by section 14137. Thus, Chapter 433 contains no legislative findings which contradict or override earlier superior court determinations. The Dissent's separation of powers argument sinks of its own weight.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Streets and Highways Code section 114 reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) When the commission or other public entity has allocated any funds for the construction, improvement, or maintenance of any portion of a state highway within a city or a county, the department may enter into a cooperative agreement with the city or the county or other public entity for the performance of the work by the department or by the city or the county or other public entity, or for the apportionment of the expense of the work between the department and the city or the county or other public entity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) The department shall enter into a cooperative agreement with a city, county, or other public entity to perform professional and technical project development services, if the department determines that the city, county, or other public entity in which the project is located has qualified and available staff to perform the necessary project services.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Dissent argues this matter should be remanded for a new trial to afford plaintiffs an opportunity to present evidence undermining the legislative facts supporting Chapter 433. (Dissent, pp. 42-43.) We decline to do so. This appeal involves the continuing validity, in light of Chapter 433, of an injunction issued on plaintiffs' complaint in 1990, long before Chapter 433 was even a gleam in the Legislature's eye. Whether the complaint is an appropriate vehicle under present circumstances for further litigation or, if not, whether it can be so adapted, are questions which should be presented to the trial court on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 References to a section are to sections of the Government Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 They also would sanction contracting out without any other judicially developed safeguards against the revival of political patronage, chief among them the requirement of a publicized competitive bidding process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The majority opinion also identifies these provisions as the substantive core of the enactment, distinguishing them from the remainder of the material parts of the enactment, \"consisting of the legislative findings and declarations justifying the statute's authorizations to contract out.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Section 14131 provides in pertinent part; \"Services [obtained by contracting out] shall not cause the displacement of any permanent, temporary, or part-time employee of the department.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Section 14101 provides that Caltrans may contract out for the services of architects and engineers when \"it is determined by the Director of Transportation . . . that the obtainable staff is unable to perform the particular work within the time the public interest requires such work to be done.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Specifically, the trial court held that \"the contracts let by Caltrans from 1986-87 through 1988-89 under section 14101 served only to displace the established role of civil service professionals in Caltrans, in violation of article VII of the California Constitution.\" (App. I, at p. 23.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 For example, the court found the following in a 1991 enforcement order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The Court observes that defendants may justifiably contract under Government Code section 14130 et seq. and article VII . . . to avoid the inflationary costs of delays in the construction of specific projects only to the extent that defendants continue to take all feasible actions to eliminate the Caltrans staff shortages which are producing the delays and which are the result of defendants' past illegal practice between 1985 and 1990 of substituting consultants under contract for civil service staff. The Court finds that, at this time, defendants are taking all feasible steps to eliminate the staff shortages and the resulting artificial need for contracting outside the civil service.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Section 4525 applies to Chapter 433 contracts over $250,000. ( § 14133, subd. (b).) Under section 4525 the agency head negotiates the contract. Whether the section applies to contracts under $250,000, as to which section 4525 does not apply ( § 14133, subd. (b)), is problematical in view of Chapter 433, (uncodified) section 1. The convoluted structure of the Chapter 433 scheme, where things are in because they are out and things out because they are in, is an administrator's dream.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The safeguards are contained in the Riley/Burum test, whether \"the nature of the services in question is such they cannot be performed 'adequately or competently or satisfactorily' by employees selected through civil service.\" This is the objective test by which to measure whether the spoils system has been avoided. Without such a measure the claim can always be made that contracting out is more efficient than civil service. That is all the more so when the measures of efficiency have been eliminated, as here where the measure of the relative cost of doing the work by private means ( § 19130) has been eliminated ( § 14133, subd. (a)), and competitive bidding is not required ( § 14133, subd. (b)). This opens the door to letting contracts out to favored applicants by the patronage head of the Department of Transportation, which it is the manifest purpose of article VII to prevent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn this regard it is an empty requirement, that \"contract selection [must be] performed in accordance with applicable state laws . . . .\" ( § 14134, subd. (a)(5); emphasis added.) There do not appear to be any of consequence. The critical measures of efficiency (cost effectiveness, competitive bidding), whether private enterprise can do the job better, are not applicable. As repeatedly noted, Chapter 433 is to \"be construed as affording the Director of Transportation a new and independent basis upon which to justify contracting out . . . .\" (Ch. 433, (uncodified) § 1.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 These considerations undercut the ordinary deference accorded the Legislature, which is expressed in various doctrines under the general rubric that statutes are presumed to be constitutional. The strength of the presumption and the degree of judicial deference to determinations of legislative fact are not woodenly applied, but vary with the particular context of constitutional adjudication. (See Karst, Legislative Facts in Constitutional Adjudication (1960) 1 Supreme Court Rev. 75, 87-88.) The civil service mandate is imposed to curb a pernicious temptation of faction to which the majoritarian branches are inherently susceptible. Too much deference by the judiciary puts the fox in charge of the chicken coop.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 Section 14130, subdivision (a)(3) is as follows.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Changes in federal, state, and local revenues and the growing private participation in state highway construction can result in significant fluctuations in workload relating to project study reports, project development, surveying, and construction inspection. To maintain a more stable work force in the department and avoid the costly process of short-time hiring and layoff while still responding in a timely manner to funding opportunities and uncertainties, additional flexibility through outside contracting and cooperative agreements with local public agencies is needed to supplement the department's program staff.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 I note in passing that none of these findings affords a basis to permit contracting out where that would violate the civil service mandate. The interest in advancing employment opportunities to minorities, women, and disabled veterans must be pursued in a manner consistent with the civil service mandate, e.g., by measures that afford such opportunities for new hiring of civil service staff. Nor does the interest in increasing employment per se justify avoiding the civil service mandate. The claim that more jobs are created by contracting out suggests that this is an uneconomical means of performing the work, in conflict with a principle of the civil service provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Footnote 8 provides, in pertinent part: \"The Court takes judicial notice pursuant to Evidence Code § 452, subd. (d), of the findings in the statement of decision underlying the judgment entered April 17, 1990, and the findings in the orders issued after evidentiary hearings to enforce the judgment.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 The majority apparently agrees that Plaintiffs may profer such a showing in the trial notwithstanding that the injunction is dissolved. \"Whether the complaint is an appropriate vehicle under present circumstances for further litigation or, if not, whether it can be so adapted, are questions which should be presented to the trial court on remand.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a The STIP, adopted annually by the commission, schedules projects that fall within specified statutory priorities and that will be funded during the next seven years from state and federal funds reasonably expected to be available in each county for programming. (Gov. Code. §§ 14524, 14525. 14529. 14529.6.) The STIP includes projects in the immediately prior STIP and projects submitted or recommended by Caltrans pursuant to Government Code section 14526 and county transportation agencies and regional transportation planning agencies pursuant to Government Code section 14527. (Gov. Code §§ 14529, 65082.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a These contracts were also expressly based on Government Code section 19130. Because Caltrans has not sought to justify its contracts under section 19130 in this action, however, the Court does not consider that section.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a Compare, e.g., the language of sections 14130 and 14134 with Exhibits 11, 16, 57-60, 72 at pp. 10-11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a Contracts for construction inspection do not appear to be within the scope of section 14130 et seq., which covers only project development services occurring prior to construction. The Court find, therefore, that contracts for construction inspection services are covered only by section 14101.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1b All further statutory references are to the Government Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2b As used in this order, \"project development services\" or \"project development work\" refers to the engineering services involved in the delivery of highway projects and includes construction inspection and oversight. Such services or work does not refer to highway construction which has been performed historically by private enterprises under contract with the state. As used in this order, \"civil service\" of \"civil service staff\" refers to defendants' regular and temporary employees in the engineering and engineering related classes of the civil service system.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3b Defendants' report of 170 PYEs for seismic retrofitting work is not supported by the information in Exhibit A to Defendants' Response to Court's Request for Further Information, filed February 28, 1993. Exhibit A lists approximately 131 PYEs for retrofitting work.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4b The total PYEs planned for contracts during the 1993-94 fiscal year may be greater than 978. In January and February 1994, defendants reported to the Court that, in addition to their 1993-94 budget authority for contracting, they may use part or all of $29.9 million in budget authority for contracting carried over from prior years to supplement the 952 PYEs they authorized in September 1993 for contracts in the 1993-94 fiscal year.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5b Defendants report a net gain of 71 in retired annuitant and limited term appointments for the month of January 1994. This net gain exceeds the net gain in comparable appointments for the three-month period from July through September 1993, before defendants' directive to terminate limited-term appointments and reduce temporary help by 50 percent and before their hiring freeze effective January 6, 1994, precluding limited-term and retired-annuitant appointments. The Court is unable to reconcile the January 1994 net gain in retired annuitant and limited term appointments with defendants' directive and hiring freeze. Possibly, the net gain reflects emergency appointments related to the repair of highway facilities damaged in the Northridge earthquake on January 17, 1994. Defendants exempted emergency appointments from the hiring freeze.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6b Defendants claim that once they determine the amount and type of PYEs which meet the statutory criteria for contracting, they may contract for any project development services within that amount and the department's budget authority. As authority for this practice, defendants point to sections 14131.1 and 14130.2, which permit them to apply the criteria for contracting on a total program basis and do not require them to justify individual contracts with specific facts and criteria. The Court finds, however, that the total program approach does not permit defendants in the determination pursuant to section 14131 to authorize contracts for certain types of work on the basis of criteria specific to those types and then use the contract authorization for different work to which the criteria do not apply. For example, defendants may not use the total program approach to authorize contracts for seismic retrofitting work by characterizing the work as a short-term workload demand pursuant to section 14130.1 and then use the contract authorizations for construction inspection work. Nor does the total program approach permit defendants to contract for 978 PYEs, a number in excess of the 952 PYEs authorized in their determination pursuant to section 14131. Such use of the total program approach turns the determination procedure pursuant to section 14131 on its head, transforming it from a means of ensuring that contracting is constitutionally permissible to a means of authorizing contracts without regard to their constitutionality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7b The deference which may be owed the Legislature's judgment on the consistency of chapter 433 with article VII may be lessened by the questions raised during the passage of chapter 433 regarding its constitutionality: \"The restrictions place on Caltrans by the court have been based on the constitutionality of contracting for services that may otherwise be performed by state civil service employees. As the legislation expands the statutory authority for contracting for services, questions have been raised regarding the constitutionality of this measure. Should this measure become statute, given the outstanding constitutional questions and the previous rulings of the trial court, it is unclear what, if any, effect it may have on contracting out for services.\" (Assembly Committee on Transportation, Report on Senate Bill No. 1209 (1993-1994 Reg. Sess.) for Hearing on August 16, 1993, p.4.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8b The Court takes judicial notice pursuant to Evidence Code § 452, subd. (d), of the findings in the statement of decision underlying the judgment entered April 17, 1990, and the findings in the orders issued after evidentiary hearings to enforce the judgment. May of the facts in these findings are also judicially noticeable pursuant to Evidence Code section 452, subdivisions (g) and (h).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9b See footnote 8 at page 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10b Defendants have not contended in this action that contracting for the performance of project development work is more cost effective than performance of the work by civil service staff. Defendants have not been able to produce credible evidence to establish that their costs of awarding, administering and monitoring the performance of contracts are significantly less than their costs of hiring, training and using civil service personnel. Studies are inconclusive and conflicting regarding the potential cost savings of contracting instead of using civil service. (See Senate Transportation Committee, Report on Senate Bill 1209 (1993-1994 Reg. Sess.), pp. 1-2; Assembly Committee on Transportation, Report on Senate Bill 1209 (1993-1994 Reg. Sess.) for Hearing on August 16, 1993, p. 4) With respect to the efficiency of contracting instead of using civil service, defendants have not produced credible evidence to demonstrate that contracting has become an effective tool to manage temporary, short-term peaks in workload since the trial of this matter, when they failed to produce such evidence. (See Statement of Decision, p. 22.) The Court notes that defendants have shown an ability to flexibility hire and layoff limited-term and temporary civil service staff during 1993.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11b In a report to the Court filed February 28, 1994, defendants indicated that the PYs of seismic retrofitting work performed during 1993-94 were less than those planned for the fiscal year because of the complexity of the toll bridge structures to be retrofitted and the resulting need for design analysis. In a previous report, defendants indicated that the impact of the Northridge earthquake on January 17, 1994, on their contracts for project development was unknown. (See Declaration of Martin Kiff, filed February 7, 1994, PP 11, 12.) The Court observes that the emergency work necessary for the evaluation, repair and reconstruction of state highway facilities damaged by the Northridge earthquake fall outside the scope of the instant order and the previous orders of the Court in this action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12b In section 14137, the Legislature implicitly adjudicates the constitutionality of the specific contracts it continues. This legislative adjudication overlaps the Court's exercise of its power to determine the constitutionality of defendants' contracts in its orders of May 18 and August 6, 1993. A serious question is raised as to whether the implicit legislative adjudication encroaches on the Court's authority in contravention of the separation of powers doctrine in article III, section 3, of the California Constitution. (See Mandel v. Myers (1981) 29 Cal. 3d 531, 549-50, 174 Cal. Rptr. 841, 629 P.2d 935. Cf. Mendly v. County of Los Angeles 94 Daily Appellate Report (March 30, 1994) 4034, 4039-4040.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13b Although defendants may have not authority to declare chapter 433 unconstitutional or to refuse to enforce its provisions under article III, section 3.5, of the California Constitution, this Court does have the authority to order defendants to refrain from implementing chapter 433 on the basis of a determination that chapter 433 is unconstitutional. (See Fenske v. Board of Administration (1980) 103 Cal. App. 3d 590, 595, 163 Cal. Rptr. 182.)\u003c/span\u003e\n\n",
    "body_length": 261649,
    "citedas": [
      "43 Cal.App.4th 894",
      "48 Cal.App.4th 1",
      "51 Cal.Rptr.2d 465",
      "96 Cal. Daily Op. Serv. 1819"
    ],
    "attorneys": "Daniel E. Lungren, Attorney General, Floyd D. Shimomura, Assistant Attorney General, Linda A. Cabatic, Supervising Deputy Attorney General, and Daniel G. Stone, Deputy Attorney General, for Defendants and Appellants. William M. McMillian, Chief Counsel, Richard W. Bower, Assistant Chief Counsel, O. J. Solander, Staff Counsel, and Stephanie G. Sakai, Staff Counsel, For Defendants and Appellants. Nossaman, Guthner, Knox \u0026 Elliot, Stephen N. Roberts, Stanley S. Taylor, and Patricia Lee Connors, Metropolitan Transportation Commission, Francis F. Chin, Kennedy \u0026 Wasserman, and R. Zachary Wasserman, Amici Curiae for Defendants and Appellants. David L. Kelly, Amicus Curiae for Defendants and Appellants. Loren E. McMaster, for Plaintiffs and Respondents. Association of California State Attorneys and Administrative Law Judges and Dennis F. Moss, Amici Curiae for Plaintiffs and Respondents. Williams, Romanski, Polverari \u0026 Skelton, and Anthony M. Santana, Amici Curiae for Plaintiffs and Respondents. California State Employees Association, Gary P. Reynolds, and Harry J. Gibbons, Amici Curiae for Plaintiffs and Respondents. California Union of Safety Employees, Sam A. McCall, Chief Legal Counsel, and Neil Robertson, Legal Counsel, Amici Curiae for Plaintiffs and Respondents.",
    "category": [
      "124",
      "243"
    ],
    "judges": "Puglia, P.j.; Morrison, J., Concurring. Blease J.; Dissenting separately.",
    "citation_count": 0
  }
}
