{
  "id": "v6WOSGYBTlTomsSB78C3",
  "document": {
    "title": "04/16/87 ANTONE D. RUFFIN v. UNITED STATES",
    "full_title": "ANTONE D. RUFFIN v. UNITED STATES ; JAMES R. SHAW V. UNITED STATES",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1987-04-16T00:00:00.000Z",
    "docket": "Nos. 83-640, 83-733",
    "body": "PER CURIAM: A jury convicted appellant Ruffin of second degree murder, D.C. Code ยง 22-2403 (1981), and mayhem, D.C. Code ยง 22-506 (1981), and convicted his co-defendant, appellant Shaw, as an accessory after the fact to simple assault, D.C. Code ยง 22-106 (1981). The trial court sentenced Ruffin to concurrent sentences of ten years to life in prison for the murder and of three to nine years for the mayhem. It imposed on Shaw a prison sentence of six months.\n\nRuffin appeals the denial of his pretrial motions (1) to dismiss the indictment on speedy trial grounds, based on the 33 months between his arraignment and trial, and (2) to suppress oral and written statements, as well as physical evidence, allegedly obtained in violation of the fourth and fifth amendments. He also asserts that (3) the mayhem and second-degree murder convictions merged, requiring vacation of the mayhem conviction, and (4) the trial court erred in refusing to instruct the jury on the lesser-included offense of involuntary manslaughter.\n\nWe reject Ruffin's arguments save two. The government concedes, and we agree, that on this record the mayhem merged into the second degree murder, since a single injury produced both a permanent disability and death. Thus, Ruffin's mayhem conviction must be vacated. We also agree with Ruffin that the police obtained his written statement in violation of the fifth amendment right to counsel. We conclude, however, that this constitutional violation was harmless beyond a reasonable doubt because the written statement was cumulative of Ruffin's admissible oral statement and of other evidence impeaching his testimony. Moreover, the evidence against Ruffin was overwhelming. Accordingly, we affirm Ruffin's conviction for second-degree murder.\n\nShaw attacks (1) the sufficiency of the evidence sustaining his conviction as an accessory after the fact. He also argues that (2) the trial court abused its discretion in refusing to order disclosure of portions of statements of three government witnesses under the Jencks Act, 18 U.S.C. ยง 3500 (1982), and (3) the court's instruction to the jury that the defendant has a vital interest in the outcome of the trial was prejudicial. None of Shaw's arguments has merit; thus, his conviction as an accessory after the fact to simple assault is affirmed.\n\nI. FACTS AND PROCEEDINGS\n\nFollowing a party on the night of February 2, 1980, appellant Ruffin's sister accepted a ride home from Clifford Wilson. Ruffin, who had attended the party, returned to his mother's house. When he arrived, he was advised that his sister had been raped. He drove to his sister's apartment, found her crying, and then searched the building. He found Wilson on the second-floor landing above the sister's apartment. Wilson, following his encounter with Ruffin, was left in an unconscious or semi-conscious state. He subsequently died. At trial, Ruffin admitted he struck Wilson but did so in self-defense.\n\nAppellant James Shaw, a police officer on administrative leave who was a friend of Ruffin, arrived on the scene and called the police. According to the testimony of several witnesses, Shaw told Ruffin not to talk to the police and also advised Ruffin to wipe the blood from his shoes. Shaw said he would handle the problem by telling the police that Wilson's injuries were caused in the course of his apprehension by Shaw. Six police officers testified that Shaw told them he had struck Wilson in self-defense during a struggle following a rape. Shaw also told one officer that Wilson's injuries had resulted from a fall in which Wilson had struck his head against the wall.\n\nThe police transported several witnesses from the scene to the homicide office to give statements, but that group did not include Ruffin. Later, on the morning of February 3, the police decided to question Ruffin, but, as the government concedes, there was no probable cause to arrest him at that time. Instead, Detective Hosea Dyson telephoned Ruffin and told him the police wanted to interview him. Dyson arranged to have Ruffin picked up at his sister's home by Officer James Brown at around noon that day.\n\nAt some time between 1:00 and 2:00 p.m., Dyson brought Ruffin to an interrogation room in the homicide office where Dyson told him he was not under arrest and read him his rights under Miranda v. Arizona, 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602 (1966). Ruffin did not sign a waiver of those rights at the time. He did, however, give an oral statement to Dyson, admitting that he had assaulted Wilson but maintaining that he had done so in self-defense. Dyson then called in Detective Clarence Muse, who, beginning at 2:30 p.m., took a written statement after Ruffin had signed a waiver of Miranda rights. The written statement was completed at 3:48 p.m. The police then took Ruffin's trousers and shoes for examination. Ruffin left the police station at about 6:00 p.m., after the arrival of a relative who brought Ruffin a change of clothes.\n\nRuffin later was charged with the murder of Wilson. Before trial, he moved to suppress his oral and written statements to the police, as well as the physical evidence (clothing), as fruits of unlawful seizures under the fourth amendment. He also moved to suppress the statements on the ground they had been obtained in violation of his fifth amendment rights under Miranda. The trial court denied the suppression motion. The court also denied Ruffin's motion to dismiss the indictment based on an asserted violation of his sixth amendment right to a speedy trial by virtue of the 33 months between arraignment and trial.\n\nII. RUFFIN: SPEEDY TRIAL\n\nRuffin has established a prima facie case of a speedy trial violation: 33 months between arraignment and trial. See, e.g., Miller v. United States, 479 A.2d 862, 865-66 (D.C. 1984) (delay of more than one year creates a prima facie case of violation). The burden has therefore shifted to the government to rebut that showing. Tribble v. United States, 447 A.2d 766, 768 (D.C. 1982). We employ in our analysis the factors addressed in Barker v. Wingo, 407 U.S. 514, 530-32, 33 L. Ed. 2d 101, 92 S. Ct. 2182 (1972).\n\nHaving noted the length of the delay, we next must determine reasons for that delay. Approximately seven and one-half months were directly attributable to continuances requested by Ruffin. None of this time is chargeable to the government. Another four months were the result of continuances obtained by Ruffin's trial attributable to the continuances requested by Shaw, in light of the fact the government chose to try the two defendants jointly. See Gaffney v. United States, 421 A.2d 924, 928 (D.C. 1980), cert. denied, 451 U.S. 941, 68 L. Ed. 2d 330, 101 S. Ct. 2026 (1981). Nevertheless, in light of the policy considerations favoring joinder, this responsibility does not weigh heavily against the government. Adams v. United States, 466 A.2d 439, 444-45 (D.C. 1983). This is especially true where, as here, Ruffin failed to object to any of the continuances his co-defendant requested. Another nine months are attributable either to the unavailability, on four occasions, of the trial Judge, or to other \"normal\" delay unavoidable in a criminal case. This nine months is attributable to the government but carries little weight. White v. United States, 484 A.2d 553, 558 (D.C. 1984). The government did request on continuance, made necessary because several witnesses under subpoena failed to appear. This continuance resulted in a delay of three months, which is directly chargeable to the government. Since this delay was not a \"deliberate attempt to delay the trial in order to hamper the defense,\" however, but is \"a valid reason, [ i.e. ] missing witness, should serve to justify appropriate delay,\" it is not given great weight. Barker, 407 U.S. at 531. In sum, approximately 25 1/2 months of the 33 were attributable to the government, but the reasons were typical of a congested criminal court calendar, in the context of a joint trial, and thus reveal nothing extraordinary.\n\nWe next determine whether there has been prejudice to the defendant from the delay. Since Ruffin remained on personal recognizance until he failed to appear for trial on February 1, 1983 (trial then recommenced on March 14, 1983), he did not suffer the \"oppressive pretrial incarceration\" that the speedy trial right is designed, in part, to avoid. Reed v. United States, 383 A.2d 316, 320 (D.C.), cert. denied, 439 U.S. 871, 99 S. Ct. 203, 58 L. Ed. 2d 183 (1978). A speedy trial will also minimize two other types of prejudice that may result from delay: the possibility that the defense will be impaired as a result of the lapse of time an the accused's anxiety attributable to the delay. Ruffin has not alleged that his defense was in any way impaired, and \"the absence of this most serious form of prejudice weighs heavily in our determination of whether appellant was deprived of his [speedy trial] right.\" Graves v. United States, 490 A.2d 1086, 1103 (D.C. 1984) (en banc), cert. denied, 474 U.S. 1064, 106 S. Ct. 814, 88 L. Ed. 2d 788 (1986). For the first time on appeal, counsel asserts that Ruffin suffered anxiety as a result of the delay. If Ruffin did suffer anxiety, it is not manifested on this record, especially because he did not file a speedy trial motion at any point during the 33 months between arraignment and trial.\n\nThis leads to consideration of the final Barker factor: Ruffin never asserted his speedy trial right before the day of trial. Indeed, he never opposed any of the continuances requested by the government, the court, or his co-defendant, Shaw. Ruffin himself requested four continuances. We agree with the government that the record demonstrates a complete absence of any indication of a desire for a speedy trial.\n\nIn light of this lack of the assertion of the right, the minimal prejudice to the defendant, and the fact that the bulk of the delay attributable to the government is \"neutral\" bureaucratic delay, we perceive no speedy trial violation in this case. We therefore proceed to consider the grounds urged for a new trial.\n\nIII. RUFFIN: ORAL STATEMENT\n\nRuffin contends that his oral statement to the police (he had \"stomp-kicked\" the deceased in self-defense) \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e was suppressible on both fourth and fifth amendment grounds. We conclude the trial court did not err in refusing to suppress Ruffin's oral statement. In reaching this result, we have examined whether the record supports the trial court's Conclusions that the government carried its burden of proving Ruffin (1) voluntarily went to the police station for questioning, in which case there was no fourth amendment violation, and (2) gave an oral statement while not in custody, in which case there was no fifth amendment violation.\n\nA. Fourth Amendment Inquiry\n\nIn taking a close look at the evidence to determine whether Ruffin went with the officers to the police station as a volunteer or as a captive, one is struck, initially, by how elusive the answer to that question is. This is not as compelling a case for reversal as others where the fourth amendment has been violated. E.g., Hayes v. Florida, 470 U.S. 811, 812, 84 L. Ed. 2d 705, 105 S. Ct. 1643 (1985) (suspect transported \"to the station house for fingerprinting, without his consent and without probable cause or prior judicial authorization\"); Dunaway v. New York, 442 U.S. 200, 203, 60 L. Ed. 2d 824, 99 S. Ct. 2248 (1979) (detectives ordered simply \"to 'pick up' petitioner and 'bring him in.'\"); United States v. Allen, 436 A.2d 1303, 1309 (D.C. 1981) (suspect frisked and told \"'you have to come to homicide with us'\"). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e On the other hand, the evidence of Ruffin's voluntary compliance with the police request is less convincing than in other cases where police actions have survived a fourth amendment challenge. E.g., United States v. Mendenhall, 446 U.S. 544, 547-48, 557-58, 64 L. Ed. 2d 497, 100 S. Ct. 1870 (1980) (federal agent \"simply asked,\" without threats or show of force, if suspect would accompany him to office for further questions, and suspect did so without resistance); Giles v. United States, 400 A.2d 1051, 1052 (D.C. 1979) (suspect responded by telephone to message from police and agreed to meet with them at police station). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e We therefore review the record of the suppression hearing in considerable detail to determine on what side of the fourth amendment line this case falls: consent or seizure.\n\n1.\n\nInitially, we note the approach the trial court must use to resolve this issue, as well as the standard of review this court must apply to the trial court's decision. According to the Supreme Court in Mendenhall, 446 U.S. at 557:\n\nThe question whether the respondent's consent to accompany the agents was in fact voluntary or was the product of duress or coercion, express or implied, is to be determined by the totality of all the circumstances, Schneckloth v. Bustamonte, 412 U.S. [218, 227 (1973)], and is a matter which the Government has the burden of proving. Id. at 222, citing Bumper v. North Carolina, 391 U.S. 543, 548, 20 L. Ed. 2d 797, 88 S. Ct. 1788 [(1968)].\n\nIn applying this approach to the present case, the trial court confronted a significant difference from Mendenhall : Ms. Mendenhall did not testify at the suppression hearing; Ruffin did. Accordingly, in contrast with Mendenhall, where only the government's evidence was under scrutiny, the trial court confronted the question whether the government carried its burden of proving voluntariness when, at the suppression hearing, there was sharply conflicting testimony about why Ruffin had agreed to go to police headquarters. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAlthough we are bound to accept the trial court's resolution of conflicting testimony, United States v. Alexander, 428 A.2d 42, 49-50 (D.C. 1981), the ultimate question -- whether Ruffin's actions in accompanying the police to the precinct were voluntary -- is one of law for this court to decide on the record. United States v. Gayden, 492 A.2d 868, 872 (D.C. 1985); cf. Miller v. Fenton, 474 U.S. 104, 106 S. Ct. 445, 450-51, 88 L. Ed. 2d 405 (1985) (voluntariness of confession is legal question, not issue of fact presumed, under statute, to be correct in federal proceeding). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e We therefore owe no deference to the trial court's ultimate Conclusion that Ruffin voluntarily accompanied the officers to the precinct.\n\n2.\n\nWe tun to the evidence. In the government's case in chief at the suppression hearing, Detective Dyson testified that he had \"called [Ruffin's] home address and asked him to come down to the office in reference to our investigation.\" The prosecutor then inquired, \"And did he do so voluntarily?\" Dyson replied, \"yes, sir.\" Dyson, therefore, did not report Ruffin's response as such; he merely testified as to his own opinion that Ruffin had come voluntarily. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e When asked on cross-examination whether \"Ruffin was brought to headquarters in handcuffs,\" Dyson answered, \"Not to my knowledge.\" The government then called Detective Clarence Muse, who recounted what had happened after he had seen Ruffin in the interview room, after the oral statement to Dyson. Muse stated on cross-examination that he was unsure whether Ruffin had been handcuffed -- \"he could have been\" -- and then testified about taking Ruffin's written statement.\n\nAlthough he could have done so, Ruffin did not ask for a ruling after Dyson and Muse had testified. Instead, he took the stand and testified that the police had \"called my sister's house and stated that they put out a bench warrant for my arrest and that I should give myself up. And I stated that I would come down to the station, and they stated they would send a police car after me. And they sent the police car to my sister's house and two policemen handcuffed me and took me down to homicide division.\"\n\nOn cross-examination, the prosecutor elicited from Ruffin, initially, that a police officer had spoken over the phone only to Ruffin's sister, not to Ruffin, and that this sister was the one who had told him a bench warrant had issued for his arrest.\n\nQ. And somebody from homicide called you [at your sister's home]?\n\nA. They called her and told her that it was --\n\nQ. Well, did they speak to you? Did you speak to anybody on the phone?\n\nA. No sir.\n\nQ. So that anything that you testified to before [about the bench warrant] was what you say you sister told you?\n\nA. Yes sir. [Emphasis added].\n\nRuffin's next response, however, indicated -- as he had on direct examination -- the Ruffin himself had spoken with the police before being picked up for the trip to the police station.\n\nQ. And after you got this telephone call somebody came to pick you up?\n\nA. No sir.\n\nQ. Well, what happened then?\n\nA. Well, they said they were -- would send a scout car. I said I would come down to the precinct. They said, no, they would send a scout car for me. So they sent the scout car to the scene of the incident. I met them back at my sister's house.\n\nQ. Did you tell them that you would meet them there?\n\nA. Yes, sir.\n\nQ. You made arrangements to meet them there?\n\nA. They made arrangements to meet me there. [Emphasis added.]\n\nRuffin acknowledged that he had been at his sister's house when the police \"first called\" there, arguably implying -- contrary to his initial answer on cross-examination -- that Ruffin had spoken with a police officer at that time. Ruffin also acknowledged that he could have asked his sister to testify in order to clarify the situation, but did not. On the other hand, Ruffin's testimony on direct and cross-examination, taken as a whole, was arguably not internally inconsistent. He may have meant that he had not spoken with Dyson when Dyson called the first time about the warrant -- that he had personally spoken with the police only when responding to a phone call \"after\" the first one. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Moreover, Detective Dyson had not expressly stated that he had made only one telephone call to solicit Ruffin's cooperation. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Nor did the prosecutor attempt to find out, during cross examination, whether Ruffin could explain his possible inconsistency about personally speaking with the police or whether Ruffin had discussed the supposed warrant with Dyson or any other police officer.\n\nAccordingly, Dyson's and Ruffin's testimony to this point, taken together, was inconclusive. There are at least two plausible interpretations: (1) two telephone conversations had taken place -- Dyson or some other police officer with Ruffin's sister about a bench warrant, followed by Dyson or some other officer with Ruffin making arrangements for a trip to headquarters -- or (2) only one conversation had taken place, between Dyson and Ruffin, in which case Ruffin's testimony about his sister's reference to a bench warrant would have been a lie. See also supra note 7.\n\nFrom the transcript itself, neither interpretation of the Dyson-Ruffin testimony is compelling. Moreover, Ruffin did specifically articulate circumstances -- a threat of arrest -- which caused him to feel constrained to surrender for questioning. Ruffin's testimony, if believed, thus tended to rebut whatever inference of voluntary consent could legitimately be attributed to Dyson's generalized opinion testimony. Dyson had not testified as to Ruffin's verbal response at the time of the police request; nor had Dyson testified that Ruffin, in any way, had manifested an understanding he was free to say no and thus was accompanying the police voluntarily. Dyson, therefore, provided no factual basis for disbelieving Ruffin's testimony. Nor did the prosecutor probe Ruffin deeply enough on cross-examination to establish, to a reasonable certainty, that Ruffin had testified inconsistently. By the time Ruffin completed his testimony, therefore, the evidence arguably was in equipoise, with the burden of production as to voluntariness thus shifting back to the government.\n\nIn rebuttal, Officer Williams testified that she had gone to pick up Ruffin and, at that time, had asked him \"if he would go down with us because they wanted to talk to him at homicide branch.\" Like Dyson, she did not mention Ruffin's response. Instead, she merely added that Ruffin was not placed under arrest or handcuffed. She did not testify that she had told Ruffin he was not under arrest.\n\nAlso in rebuttal, Officer Brown, who had driven Ruffin to headquarters, testified that \"apparently someone at the Homicide Branch had in fact talked to Mr. Ruffin and apparently he was voluntarily coming down.\" Brown further testified that he had been asked to inquire whether Ruffin was \"willing to voluntarily go down to the Homicide Branch.\" Like Dyson and Williams, however, Brown did not report Ruffin's response; at most, he provided vague, question-begging hearsay confirmation that Ruffin \"apparently\" was willing to come to headquarters voluntarily. Furthermore, like Williams, Brown added that Ruffin was not under arrest and that he had no reason to handcuff Ruffin. But also, like Williams, Brown did not testify that he had told Ruffin he was not under arrest. Brown further testified that he would have let Ruffin out of the squad car if Ruffin had asked to leave. But Brown did not testify that he had told Ruffin he was free to decline to come along or was free to change his mind and leave the car before arriving at headquarters.\n\nIn sum, the government established through its own witnesses -- at most -- that the police had asked, not told, Ruffin to come to headquarters; that Ruffin had done so without a fuss; that one or more officers believed Ruffin had done so voluntarily; that Ruffin had not been handcuffed; that the officers had not considered Ruffin to be under arrest (although no one had told him he was not); and that Ruffin could have asked to leave the squad car without consequence before he arrived for questioning (although no one had told him he could do so). None of the police officers, however, was examined or cross-examined about what Ruffin had said, if anything, when asked to go voluntarily to the police station. Moreover, the prosecutor did not recall Detective Dyson or call any other officer explicitly to rebut Ruffin's testimony that he had gone with the police because he had learned from his sister (who had learned from Dyson or some other officer) that an arrest warrant had issued -- testimony reflecting the nonconsensual mind set the Supreme Court recognized in Hayes. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e On the other hand, Ruffin appeared to have given inconsistent testimony during cross-examination, at first denying and then acknowledging he had spoken with a police officer. Defense counsel did not attempt on redirect to reconcile these statements. Nor did Ruffin call his sister to the stand to clarify and buttress his testimony.\n\nThe trial court, altogether disbelieving Ruffin, denied the motion to suppress. In commenting on Ruffin's testimony describing what transpired from his transportation to the precinct until his release at 6:00 p.m. the same day, the court stated:\n\nThe Court does not credit the defendant's version of the facts. They are inherently . . . incredible. They just don't logically follow. The Court finds as a matter of law he was not arrested. I distinguish the Allen case where he was frisked, he was constantly guarded. He was although given a ride downtown. e Court does not credit the fact that he was in handcuffs at any time, was permitted to leave. Clearly not custodial at all under Oregon v. Mathiason . . .\n\n3.\n\nIn evaluating the trial court's ruling, we must decide whether the trial court, on this record, could legitimately credit the government's witnesses, altogether disbelieve Ruffin's \"bench warrant\" testimony, and thereby conclude that the government had sustained its burden of proving voluntary consent. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nParticularly important to the analysis is an awareness that, although the question of voluntariness is ultimately one of law for this court, that question turns, in this case, on a factual finding as to whether the police told Ruffin they had issued a bench warrant for his arrest. If the trial court had credited Ruffin's statement about the bench warrant, it could not have concluded that he voluntarily had accompanied the police officers to the precinct. See supra note 9. On the other hand, by altogether disbelieving Ruffin's bench warrant testimony, the way was clear for the court to find on the basis of police evidence alone that Ruffin had accompanied the police voluntarily. Thus, we are dealing, fundamentally, with the question whether the trial court's finding that Ruffin's bench warrant testimony was inherently incredible is entitled to deference -- leading to an appellate court Conclusion that Ruffin voluntarily had gone to the police station -- even though the government was clearly in a position, but failed, to impeach or otherwise refute Ruffin's testimony with direct evidence.\n\nInitially, we note that the Supreme Court's decisions in Dunaway and Mendenhall are not determinative. In each, the facts were undisputed; neither decision concerned review of a trial court's factual findings. Our Dissenting colleague argues that the facts in Dunaway are \"nearly identical\" to those here. (infra) at 60. The key distinction the Dissent fails to note, however, is that in Dunaway the trial court apparently credited the defendant's factual account of what had taken place as a predicate for its legal Conclusion that the police had detained him involuntarily. 442 U.S. at 207 n.6. Here, in contrast, the trial court found appellant's factual presentation incredible while finding the government's evidence of voluntary consent persuasive. This case, therefore, is not \"nearly identical\" to Dunaway if appellant's testimony does not prevail.\n\nNor is Mendenhall dispositive. Noting that \"the material facts are not disputed,\" 446 U.S. at 552 n.5, the Supreme Court sustained the trial court's determination of voluntary consent. The court stressed \"the respondent was not told that she had to go to the office, but was simply asked if she would accompany the officers\" for further questioning. \"There were neither threats nor any show of force.\" 446 U.S. at 557-58. In response, \"she did so, although the record does not indicate a verbal response to the request.\" 446 U.S. at 548. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In the present case, therefore, if the police testimony alone had reflected the \" totality of all the circumstances,\" 446 U.S. at 557, Mendenhall would justify a determination of voluntary consent; without regard to Ruffin's testimony, the two cases are similar.\n\nIt is useful to note, however, that the four Dissenting Justices in Mendenhall stressed that \"Ms. Mendenhall did not testify at the suppression hearing and the officers presented no testimony concerning what she said, if anything, when informed that the officers wanted her to come with them to the DEA office.\" 446 U.S. at 576 (White, J., Dissenting). It follows, said the Dissenters, \"on the record before us, the Court's Conclusion can only be based on the notion that consent can be assumed from the absence of proof that a suspect resisted police authority. This is a notion that we have squarely rejected.\" 446 U.S. at 577 (white, J., Dissenting). While the Court majority in Mendenhall did not specifically eschew this generalized interpretation of its holding, the majority did note, in evaluating the evidence, that \"the respondent herself did not testify at the hearing.\" 446 U.S. at 557. The Court thus made clear that it ruling was limited to evaluating the uncontradicted implications of the police testimony itself, as well as the circumstantial factors. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe question, then, is whether the trial court can reject the testimony of a defendant who, as in Dunaway, asserts coercion, and then find voluntary consent on the basis of the police testimony and circumstantial factors, as in Mendenhall, as though the defendant had not taken the stand (or, perhaps more significantly, had taken the stand and lied). We begin with Staton v. United States, 466 A.2d 1245 (D.C. 1983), where the defendant, on appeal from the denial of a motion to suppress, challenged on fifth amendment grounds the trial court's ruling that his confession had been voluntary. We rejected the argument that \"the trial court was required to credit his unrebutted testimony concerning coercive police utterances.\" 466 A.2d at 1251. We stated that \"the trier need not believe the testimony of a witness even though the witness' testimony is uncontradicted [citations omitted], particularly where the witness has a personal interest in the result.\" 466 A.2d at 1252. We added, however, that \"appellant's allegations [of coercive police tactics], if true, raise grave questions about the voluntariness of his confession.\" Id. Accordingly, we said, although the \"trial court ordinarily 'need not make formal findings of fact or write an opinion' when ruling upon such motions to suppress,\" id. at 1253 (quoting Sims v. Georgia, 385 U.S. 538, 544, 17 L. Ed. 2d 593 2, 87 S. Ct. 639 (1967)), \"the trial court's determination 'must be reliable and clear-cut and Conclusion that the confession is in fact voluntary must appear from the record with unmistakable clarity.'\" Id. (quoting Wells v. United States, 407 A.2d 1081, 1089 (D.C. 1979)). Because it was not clear in Staton \"whether the trial court concluded that (1) appellant's uncorroborated testimony concerning coercion was incredible, although unrebutted, or (2) some or all of the coercive statements were in fact made, but given the totality of the circumstances, did not render appellant's statements involuntary,\" id., we remanded the record for further findings and for an explanation of how the trial court had reached its Conclusion, in order that we could afford meaningful review. In the present case, however, it is clear that the trial court credited the police testimony and altogether rejected Ruffin's uncorroborated \"bench warrant\" testimony as \"inherently incredible.\" Thus, no remand is necessary to ascertain the basis for the court's ruling.\n\nStaton, however, should not be read so broadly as to stand for the proposition that, under all circumstances, a trial Judge may disregard a defendant's uncontradicted testimony. For example, in Haynes v. Washington, 373 U.S. 503, 10 L. Ed. 2d 513, 83 S. Ct. 1336 (1963), the Supreme Court held a confession involuntary as a matter of law where (before the Miranda decision) (1) the defendant was to advised \"of his right to remain silent, warned that his answers might be used against him, or told of his rights respecting consultation with an attorney,\" 373 U.S. at 511; (2) the written confession itself contained a reference to coercive tactics (a form of corroboration of the defendant's testimony to that effect), 373 U.S. at 512; and, of considerable significance, (3) the allegedly overreaching officers, who were in court and heard the defendant's testimony, did not deny the accusations. 373 U.S. at 509-10. Under these circumstances, as a matter of law the confession could not have been voluntary, even though the trier of fact may have disbelieved the defendant.\n\nIn contrast, in Staton -- also a coerced confession case -- the defendant \"was repeatedly given Miranda warnings,\" 466 A.2d at 1252, and there was absolutely no corroboration of the defendant's claim of coercive police tactics. Further distinguishing Haynes, this court pointed out that the \"tenor\" of police testimony implied the defendant had given a voluntary statement, in contrast with the trial court's apparent perception that the defendant's self-serving testimony about coercive police tactics, although unimpeached and unrebutted, was incredible and thus altogether unworthy of serious consideration. See 466 A.2d at 1252.\n\nThe instant case is different from both Haynes and Staton in at least one significant respect: because we are considering voluntariness as it relates to accompanying police officers to the precinct station -- a fourth amendment inquiry -- in contrast with the voluntariness of giving the statement itself, Miranda warning are not at issue. It is clear, however, that no government witness told Ruffin he was free not to go with the officers. Accordingly, whatever the implications of Staton for voluntariness analysis when a defendant's inculpatory statement is at issue after Miranda warnings have been given, Staton is not necessarily dispositive of cases, such as this one, where Miranda (or analogous) warnings are not part of the calculus. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nWe reach this Conclusion for two reasons. First, a defendant usually will not be in a position to offer evidence directly corroborating alleged police coercion, for typically there will be no disinterested defense witness to the alleged police conduct. Thus, failure of corroboration should not be significant when, commonly, the defendant's own word will be the only direct evidence of coercion available. Second, given the government's burden of persuasion, a trial court's mere disbelief of the defendant should not be a conclusive basis for saving a circumstantial government case when it is clear to everyone that available police witnesses, in a position to discredit the defendant, have elected not to take the stand to do so. That failure of government witnesses to present direct evidence when there is no impediment to such testimony speaks more loudly to an appellate court reviewing a transcript -- alert, as we must be, to the shifting burdens of evidentiary production -- then does the weight of a trial court's credibility determination altogether rejecting a witness's testimony. The government's unwillingness to put on rebuttal testimony is indirect but objective corroboration of the defendant's story that an appellate court, ruling on voluntariness as a matter of law, cannot properly ignore in favor of a trial court's subjective credibility finding.\n\n4.\n\nAccordingly, the final question is whether the prosecutor's cross-examination of Ruffin, coupled with the police officers' testimony in rebuttal, was sufficient impeachment and/or rebuttal of Ruffin's bench warrant testimony to permit the trial court to disbelieve his claim and thereby compel a Conclusion that he went to the police station voluntarily.\n\nAs noted earlier, when Ruffin completed his testimony the burden of production as to voluntariness shifted back to the government, since the prosecutor had not probed deeply enough on cross-examination to establish, by a preponderance of the evidence, that Ruffin had testified inconsistently about speaking with the police and thus had lied about the bench warrant. Obviously, Ruffin's testimony created some doubt about his veracity but not enough to say, in fairness, that the government had carried its burden of persuasion without need for rebuttal.\n\nThis case is especially difficult because of inadequacies in the government's rebuttal. Neither Williams' nor Brown's testimony directly refuted Ruffin's testimony that he had felt compelled to accompany the officers because of his understanding that a bench warrant had been issued for his arrest. Nor was Detective Dyson recalled (or any other officer called) to discredit Ruffin's assertion that he had learned from his sister (who allegedly had spoken with the police) that a bench warrant had been issued. Moreover, not one of the government's three witnesses testified that Ruffin had been told he was not under arrest or had a choice in the matter. Finally, no officer testified that Ruffin had indicated an understanding he was free to decline the police request. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Accordingly, despite Ruffin's \"bench warrant\" testimony -- and despite the officers' own knowledge of what Ruffin had said to them and of what the police had, or had not, said to Ruffin's sister -- all the officers left out a vital testimonial link between the police requests and Ruffin's willingness to accompany them. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThere was, however, a direct clash between Ruffin's and the police officers' testimony about whether Ruffin had been handcuffed during his trip to the police station. Consistent with his testimony about a bench warrant, Ruffin said he had been handcuffed; Officers Brown and Williams testified that he had not. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The trial court believed the police, expressly stating that \"the Court does not credit the fact that was in handcuffs at any time.\" Although the absence of handcuffs would not necessarily imply that Ruffin had not been told about a bench warrant for his arrest, the trial court's finding of no handcuffs (a typical arrest procedure) suggests not only that Ruffin was not under arrest but also that his lying about handcuffs cast doubt on the very premise of his coercion testimony: that he had heard from the police through his sister about an arrest warrant.\n\nThe trial court, therefore, reasonably could have concluded on the basis of the government's rebuttal of Ruffin's handcuffs testimony, coupled with the apparent inconsistencies in Ruffin's own testimony about talking with the police, that the bench warrant story was a lie. Whereas neither Ruffin's cross-examination nor the government's rebuttal was enough in itself to refute Ruffin's bench warrant testimony, they were enough taken together to permit the inference that Ruffin had lied. Thus, the trial court had a reasonable basis for disbelieving Ruffin's factual allegations concerning the bench warrant. Accordingly, applying the analysis in Mendenhall to the other facts legitimately found by the trial court -- the police testimony by Dyson, Brown, and Williams, combined with no credible contrary assertions -- we must conclude that Ruffin accompanied the police to the precinct voluntarily.\n\nB. Fifth Amendment Inquiry\n\nOnce at headquarters, Ruffin was ushered into an interrogation room. Detective Dyson testifies that he had told Ruffin he was not under arrest and had read Ruffin his Miranda rights. Dyson further testified that, in response to a question, Ruffin had answered he was \"willing to talk\" and then had made an oral statement acknowledging he had \"stomp kicked\" the deceased -- in self-defense.\n\nThe trial court concluded that Ruffin was never in custody and thus had given all statements voluntarily. We disagree with that broad Conclusion; we believe that Ruffin, as a matter of law, was in custody as of the time Detective Muse gave the second Miranda warnings and began to elicit Ruffin's written statement. (infra) Part IV. A. On the other hand, we agree with the trial court that Ruffin voluntarily came to the police station. The question, then, is whether Ruffin remained a volunteer at the time he gave his oral statement or instead had become subject to custodial interrogation, giving rise to Miranda rights.\n\n\"The analysis is essentially the same for determining whether one is 'in custody'\" for fifth amendment purposes \"or has been 'seized' or 'illegally detained'\" under the fourth amendment. Gayden, 492 A.2d at 872 n.8. Basically, the question is whether the police, by words or conduct, including a show of authority, have manifested to a suspect that he or she is not free to leave. E.g., United States v. Barnes, 496 A.2d 1040, 1045 (D.C. 1985) (fourth amendment); Calaway v. United States, 408 A.2d 1220, 1224 (D.C. 1979) (fifth amendment). On this record, Ruffin's voluntary presence at the police station implied his voluntary consent to make the oral statement, which he did almost immediately upon arrival. There had been no seizure of the person at the time and thus no custodial interrogation. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAccordingly, we conclude the trial court did not err in refusing to suppress Ruffin's oral statement to the police.\n\nIV. RUFFIN: WRITTEN STATEMENT\n\nWe conclude the trial court erred, as a matter of law, in ruling that Ruffin was not in custody at the time he gave his written statement and thus erred in concluding that he gave the statement voluntarily.\n\nA. Custodial Interrogation\n\nThere is no dispute that Ruffin gave his oral statement virtually as soon as he arrived at the homicide office, sometime after noon (Detective Muse \"imagined\" Ruffin arrived between 1:00 and 2:00). Then, as soon as Ruffin had given his oral statement, Detective Muse was called in to the interrogation room to take a written statement, which he recorded between 2:39 and 3:48 p.m.\n\nWhen Ruffin had been ushered into the interrogation room, Detective Dyson had told him he was not under arrest. At no time thereafter, however, did a police officer tell him he was free to leave. Muse initially testified that Ruffin was not handcuffed, but, on cross-examination, he admitted he was unable to recall whether Ruffin was handcuffed to the desk in the interview room (as Ruffin himself had alleged), stating that he \"could have been\" because it was a policy, not always followed, to handcuff suspects. Advised of his Miranda rights, Ruffin asked Muse if he though he (Ruffin) needed a lawyer. Muse replied, \"ell, if it is self-defense, you can answer questions, . . . it would only clarify your part.\" Ruffin then signed a written waiver of his Miranda rights, after which he gave the written statement.\n\nUnder these circumstances, whatever inferences should be drawn from the record as to Ruffin's initial appearance at the homicide office, we must conclude that a reasonable person in Ruffin's position could not have believed he or she was free to leave, see Calaway, supra, 408 A.2d at 1224, once he had given the inculpatory oral statement and Detective Muse was called in to take a written statement. The period of time which had elapsed, the virtually continuous interrogation, the inherently coercive atmosphere, the eliciting of a signed waiver of Miranda rights despite Ruffin's announced concern that he might need a lawyer, and the lack of any indication to Ruffin that he was entitled to leave the stationhouse whenever he wished lead to a Conclusion that Ruffin was \"in custody\" as the time he gave the written statement to Detective Muse.\n\nB. Right to Counsel\n\nWe next consider the alleged violation of Ruffin's fifth amendment right to counsel. See United States v. Alexander, 428 A.2d 42, 47 (D.C. 1981). We conclude the trial court erred in ruling in the alternative that, even if Ruffin was in custody, he voluntarily waived his Miranda rights. The written statement, therefore, should have been suppressed.\n\nBefore taking the written statement, Muse advised Ruffin of his Miranda rights. According to Muse's own testimony, Ruffin then asked \"if I though he needed a lawyer.\" Muse responded, \"hy?\" Ruffin replied, \"Because of what read\" to him, i.e., his right to counsel. According to Muse, he then explained to Ruffin why counsel was not necessary:\n\nou said that . . . it was self-defense [and you] didn't have any reason not to answer questions because it was self-defense. And I said, well, if it is self-defense, you can answer questions, . . . it would only clarify your part, what your statements is reference to what took place.\n\nAlthough he did not initial the written waiver of counsel found on the police department form, Ruffin did dictate a three-page statement following this colloquy with Muse, initialing each page and signing it.\n\nThe interchange between Ruffin and Muse presents an issue left unresolved by the Supreme Court in Smith v. Illinois, 469 U.S. 91, 95-96 \u0026 n.3, 83 L. Ed. 2d 488, 105 S. Ct. 490 (1984) (per curiam): what is the effect of an ambiguous or equivocal request for counsel? In Edwards v. Arizona, 451 U.S. 477, 68 L. Ed. 2d 378, 101 S. Ct. 1880 (1981), the Court fashioned a per se rule that an accused who has invoked the Fifth Amendment right to assistance of counsel cannot be subjected to additional custodial interrogation until either (1) counsel is furnished or (2) the accused, with knowledge of the right, knowingly and intelligently relinquishes it. 451 U.S. at 484-85. Although we have held that initiation by the accused of substantive Discussion following an assertion of Miranda rights is a compelling factor in determining the existence of a valid waiver, Rogers v. United States, 483 A.2d 277, 285 (D.C. 1984), cert. denied, 469 U.S. 1227, 84 L. Ed. 2d 363, 105 S. Ct. 1223 (1985), the mere response by a suspect to additional questioning following an assertion of the right to counsel does not effect a waiver of the right, Edwards, 451 U.S. at 484. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e At issue here is whether, an to what extent, the Edwards rule applies in a case such as this, in which the request for counsel appears to be equivocal. As in every waiver case, the government has the burden of showing an intentional relinquishment or abandonment of the right, and we must indulge every reasonable presumption against waiver. Brewer v. Williams, 430 U.S. 387, 404, 51 L. Ed. 2d 424, 97 S. Ct. 1232 (1977); Turner v. United States, 443 A.2d 542, 554 (D.C. 1982); see Miranda, 384 U.S. at 486 n.55 (\"the standard for waiver is necessarily high\").\n\nAs the Court noted in Smith, 469 U.S. at 96, n.3, some courts have held that the Edwards' per se rule requires that interrogation cease following any indication at all from the accused, however equivocal, that he or she might want counsel before continuing to answer questions. These courts have held that resolution of any ambiguity against the defendant would subvert the prophylactic intent of Miranda. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e For example, in People v. Superior Court of Mono County, 15 Cal. 3d 729, 735-36, 125 Cal. Rptr. 798, 802-03, 542 P.2d 1390, 1394-95 (1975), cert. denied, 429 U.S. 816, 97 S. Ct. 58, 50 L. Ed. 2d 76 (1976), the accused's question to his interrogating officer, \"Do you think we need an attorney,\" was held to have required the cessation of questioning and the suppression of the statement that resulted from the continued interrogation of the accused. A similar result obtained in People v. Alexander, 79 Mich. App. 495, 261 N.W.2d 63, 64 (1977), cert. denied, 436 U.S. 958, 98 S. Ct. 3073, 57 L. Ed. 2d 1123 (1978), where the defendant asked the interrogating officer whether he thought that she needed an attorney, and the officer responded that she should just tell the officer what had happened. See People v. Fish, 660 P.2d 505, 509 (Colo. 1983) (\"An ambiguous indication of an interest in having counsel requires cessation of police interrogation.\"); Ochoa v. Texas, 573 S.W.2d 796, 800-801 (Tex. Crim. App. 1978) (statement by accused that \"he probably ought to talk to a lawyer\" required cessation of questioning); People v. Lewis, 47 Mich. App. 450, 209 N.W.2d 450, 451 (1973) (inquiry by defendant as to whether an attorney was available at the late hour of the interrogation was a sufficient request); cf. United States v. Prestigiacomo, 504 F. Supp. 681, 683 (E.D. N.Y. 1981) (statement by foreigner not fluent in English that \"maybe it would be good to have a lawyer\" was a sufficient request for counsel and required that interrogation cease).\n\nMost courts have held, however, that there is also another permissible response to an equivocal request for counsel: a question, or series of questions, designed to clarify only whether the suspect does or does not want to consult with an attorney before continuing the interrogation. See, e.g., United States v. Cherry, 733 F.2d 1124, 1130 (5th Cir. 1984); United States v. Riggs, 537 F.2d 1219, 1222 (4th Cir. 1976); United States v. Chansriharaj, 446 F. Supp. 107, 109-110 (S.D.N.Y. 1978); Giacomazzi v. State, 633 P.2d 218, 222 (Alaska 1981); State v. Acquin, 187 Conn. 647, 448 A.2d 163, 177 (1982), cert. denied, 463 U.S. 1229, 77 L. Ed. 2d 1411, 103 S. Ct. 3570 (1983); State v. Moulds, 105 Idaho 880, 888, 673 P.2d 1074, 1082 (App. 1983); State v. Wright, 97 N.J. 113, 477 A.2d 1265, 1268 (1984); State v. Cody, 293 N.W.2d 440, 446 (S.D. 1980); State v. Robtoy, 98 Wash. 2d 30, 653 P.2d 284, 290 (1982); Daniel v. State, 644 P.2d 172, 177 (Wyo. 1982); State v. Smith, 588 S.W.2d 27, 31 (Mo. App. 1979); State v. Smith, 34 Wash. App. 405, 661 P.2d 1001, 1002-03 (1983).\n\nWe believe that this latter, majority approach comports with the spirit of Edwards without unduly restricting the government's investigative authority. Accordingly, we conclude that the appropriate response to an ambiguous or equivocal assertion of the right to counsel by an accused -- typically, an indirect expression of interest in counsel -- is a request by police interrogators for clarification. For example, in a case such as this, an appropriate response to the question, \"Do you think I need a lawyer,\" would be to inform the suspect that the decision is one for him or her to make, Smith, 661 P.2d at 1002-03, and to then ask for the decision.\n\nAlthough this is one permissible response, it is not the only one possible; for, as the Court pointed out in Miranda, the investigating officer has discretion to determine whether the accused waives the right to counsel. 384 U.S. at 486 n.55. Nevertheless, a permissible response must seek clarification \"without persuasion or inducement,\" Moulds, 105 Idaho at 888, 673 P.2d at 1082, and \"may not take the form of an argument between interrogators and suspect about whether having counsel would be in the suspect's best interests.\" Thompson v. Wainwright, 601 F.2d 768, 772 (5th Cir. 1979). Nor may the limited inquiry be permissible after an equivocal request \"incorporate a presumption by the interrogator to tell the suspect what counsel's advice to him [or her] would be if were present. Such measures are foreign to the purpose of clarification, which is not to persuade but to discern.\" Id.\n\nDetective Muse's response to Ruffin's equivocal expression of interest in counsel was insufficient to protect Ruffin's right to counsel under Edwards. Muse sought not to clarify whether Ruffin wanted an attorney but to persuade him that he did not need one. Muse presumed to give Ruffin legal advice: that no lawyer was necessary as long as \"it was self-defense.\" He implied that all Ruffin had to do was to tell his side of the story to clear up any misunderstanding, and that since he had acted in \"self-defense\" the events of the evening were not serious enough to warrant counsel.\n\nThe \"right to advice of counsel surely is the right to advice from counsel, not from the interrogator,\" Thompson, 601 F.2d at 772. Accordingly, we hold that on the facts of this case Ruffin was deprived of his Fifth Amendment right to counsel, and that the statement he subsequently gave in response to further interrogation, reduced to writing by Detective Muse, was therefore inadmissible at trial.\n\nV. RUFFIN: PHYSICAL EVIDENCE\n\nOnce Ruffin had given his inculpatory oral statement, it became clear that he was not free to leave. The police said they wanted a second, written statement and, therefore, obtained a written waiver of Miranda rights, implying their own belief that Ruffin was now in custody. This time, too, Ruffin had been more attentive to the Miranda warnings, asking whether he needed a lawyer. He thereby implied his own belief he was not free to leave. Accordingly, we have concluded that at least by the time Detective Muse began to take Ruffin's written statement, Ruffin was in custody for Fifth Amendment purposes.\n\nAll seizures claimed to violate the Fourth Amendment must be evaluated to determine whether a seizure was reasonable considering the opposing interests of the defendant's right to privacy and the police officer's duty to detect and prevent crime. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e See Michigan v. Summers, supra, 452 U.S. at 697-98; Allen, supra, 436 A.2d at 1307. Even though the police took Ruffin's pants and shoes after they violated his Miranda rights in obtaining his written statement, we conclude that the seizure was reasonable under the Fourth Amendment. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAfter the police had taken Ruffin's written statement, they took his trousers and shoes, apparently to check for blood samples. The trial court apparently denied the motion to suppress on the ground that Ruffin's surrender of the clothing like his making of statements, was altogether voluntary, not the result of a seizure. We reject that premise. Once Ruffin was in custody, for Fifth Amendment purposes, he had been seized for Fourth Amendment purposes. See Gayden, 492 A.2d at 872 n.8; (supra) Part III. B.\n\nRuffin's oral statement, in which he admitted striking and \"stomp-kicking\" the decedent, provided independent evidence to establish the probable cause necessary to justify the seizure. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See Silverthorne Lumber Co. v. United States, 251 U.S. 385, 392, 64 L. Ed. 319, 40 S. Ct. 182 (1920); Derrington, supra note 21, 488 A.2d at 1330. Where probable cause already exists, a carefully tailored search and seizure to prevent the destruction of readily destroyed evidence is deemed incident to a lawful arrest, even if the suspect has not been formally arrested. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Rawlings v. Kentucky, 448 U.S. 98, 111, 65 L. Ed. 2d 633, 100 S. Ct. 2556 (1980); Cupp v. Murphy, 412 U.S. 291, 296, 36 L. Ed. 2d 900, 93 S. Ct. 2000 (1973); Bailey v. United States, 128 U.S. App. D.C. 354, 357, 389 F.2d 305, 308 (1967); see Sibron v. New York, 392 U.S. 40, 66-67, 20 L. Ed. 2d 917, 88 S. Ct. 1889 (1968). The police took Ruffin's pants and shoes to examine them for traces of the decedent's blood, skin and hair. They reasonably could anticipate that Ruffin would destroy this evidence if allowed to leave the homicide office with his clothing. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Compare Rawlings v. Kentucky, supra, 448 U.S. at 110-111 (money and knife); Cupp v. Murphy, supra, 412 U.S. at 296 (\"highly evanescent evidence\" of fingernail samples); Sibron v. New York, supra, 392 U.S. at 49, 66 (in course of limited weapons' search, burglary tools seized as potential instrument of crime of burglary); Bailey, supra, 128 U.S. App. D.C. at 357 (wallet on floor in car stopped by police).\n\nVI. RUFFIN: HARMLESS ERROR\n\nSince Ruffin's oral statement and clothes could properly be introduced in evidence against him, the question is whether the violation of his Fifth Amendment rights in obtaining his written statement was harmless beyond a reasonable doubt. Derrington, supra note 21, 488 A.2d at 1330; Lewis v. United States, 483 A.2d 1125 (D.C. 1984) (error in admitting voluntary statement obtained in violation of Miranda held to be harmless beyond a reasonable doubt since substance of statement was presented to jury through other, untainted testimony); Chapman v. California, 386 U.S. 18, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1967); see also Milton v. Wainwright, 407 U.S. 371, 33 L. Ed. 2d 1, 92 S. Ct. 2174 (1972) (harmless beyond a reasonable doubt to admit statements deliberately elicited after Sixth Amendment right to counsel had attached); Miley v. United States, 477 A.2d 720, 724 (D.C. 1984) (improper admission of statement obtained during custodial interrogation harmless beyond a reasonable doubt). Upon review of the trial transcript, we conclude there was not \"a reasonable possibility\" that the written statement might have contributed to Ruffin's convictions. Chapman v. California, supra, 386 U.S. at 23 (quoting Fahy v. Connecticut, 375 U.S. 85, 86-87, 11 L. Ed. 2d 171, 84 S. Ct. 229 (1963)).\n\nThe government's evidence against Ruffin was overwhelming without the written statement. It included the testimony of Ruffin's close friend, Donald Mitchell, who saw Ruffin repeatedly \"stomping\" Wilson in the face with his booted foot. Mitchell testified that he had seen Ruffin run out of his sister's apartment to look for Wilson after finding his sister crying and hysterical and being told Wilson had raped her and was still in the building. Mitchell had followed in search of Ruffin after others at the apartment told him to find Ruffin, and heard scuffling above as he left the apartment. He went upstairs and saw Ruffin \"stomping\" Wilson. Mitchell was permitted to demonstrate for the jury how Ruffin had kicked Wilson. Mitchell also testified that he had to grab Ruffin and pull him away, that there was a lot of blood around Wilson's head, and that Wilson was semiconscious. In addition, Mitchell testified that Shaw told Ruffin not to say anything when the police arrived, to wipe the blood off his shoes, and that he had apprehended the suspect and would take care of everything. Mitchell also testified, after Shaw's sister had testified how abusive Wilson could be, that, on the night (or early morning) in question, Ruffin had not wanted his sister Burnetta and her friend to go with Wilson in his car when they had left the party \"because knew how was and said that he would give [his sister] a ride home.\" \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nRuffin's oral statement \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e was presented to the jury through Detective Dyson's testimony. Ruffin had said, according to Dyson, that Wilson had attempted to kick him and he \"blocked that blow and countered with several blows, and then eventually stomped .\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Ruffin had also admitted being trained in the martial arts and using his martial skills in the incident.\n\nRuffin's written statement was read to the jury by Detective Muse. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The statement was exculpatory insofar as it set forth Ruffin's claim of self-defense. On direct examination, Ruffin testified that the written statement did not always accurately state what he had told the police. He explained that he had gone to find the decedent to ask him to return to the apartment to talk things over, but before he could do so the decedent had kicked him in the groin several times and punched him. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e He disputed Mitchell's testimony that he subsequently had to pull Ruffin off Wilson and that Wilson was not conscious after he kicked him; Ruffin claimed he had decided to stop on his own and that Wilson was getting up as he and Mitchell left. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e On cross-examination, Ruffin held steadfast to his claim he had acted in self-defense. The only questions by the prosecutor regarding Ruffin's written statement were brief, asking if he had initialed each page, said he did not like Wilson, and had a brown belt in karate.\n\nAlthough the government did not present eyewitness testimony about the initial moments of Ruffin's confrontation with Wilson, the government witnesses' description of the circumstances before and after the incident produced a very strong government case. Ruffin's testimony claiming self-defense was consistent with his oral statement and the material portions of his written statement.\n\nTo the extent that his testimony differed from his oral statement and the testimony of his relatives and friends, Ruffins' testimony was impeached, and the impeachment provided by the written statement was cumulative. Once Ruffin's written statement was in evidence, the prosecutor's references to it were comparatively brief and summary in nature in the course of a lengthy cross-examination and closing argument. At the beginning of his closing argument the prosecutor told the jury, in accordance with the trial court's instructions to the jury on malice, that it was unnecessary for the government to prove that Ruffin had gone to his sister's apartment with the specific intent to kill Wilson or hated him or felt hostility toward him, because the requisite malice was demonstrated by showing Ruffin \"had a heart that was reckless of the life and safety of Clifford Wilson.\" In rebuttal closing argument, nearly all of which focused on the co-defendant Shaw, the prosecutor, in asking the jury to convict Ruffin of second degree murder, and not manslaughter, mentioned Ruffin's remark in his written statement that he did not like Wilson as one of several reasons for a murder conviction, but focused principally on the revenge Ruffin sought for the rape of his sister. Accordingly, in view of the strength of the government's case, and the exculpatory and cumulative nature of the written statement, we conclude that the error in admitting the written statement at trial was harmless beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nVII. RUFFIN: LESSER INCLUDED OFFENSE INSTRUCTION\n\nFinally, we note, contrary to Ruffin's assertion, that the trial court properly declined to instruct the jury on the lesser included offense of involuntary manslaughter. The evidence supports at best, for Ruffin, an inference of intent to apply dangerous force or do bodily injury (voluntary manslaughter), not, as Ruffin alleges, an inference of intent to commit a misdemeanor, such as simple assault, not involving such force or injury. See United States v. Bradford, 344 A.2d 208 (D.C. 1975).\n\nVIII. SHAW'S CONTENTIONS\n\nAppellant Shaw contends the trial court abused its discretion in ruling, after an in camera inspection, that certain portion of prior statements of three government witnesses did not need to be disclosed under the Jencks Act, see Super. Ct. Crim. R. 26.2 (implementing Jencks Act, 18 U.S.C. ยง 3500 (1982), in the District of Columbia). The subject of the testimony of all three witnesses was a conversation that each had had with Shaw at the time of the assault, in which Shaw stated that he had injured Wilson in the course of an arrest. We have examined the undisclosed documents and find that none of them \"relates to the subject matter of the testimony of the witness\" under 18 U.S.C. ยง 3500 (b). Therefore, the trial court did not abuse its discretion in holding that the government was not required to produce these statements. See Reed v. United States, 403 A.2d 725, 732 n.9 (D.C. 1979).\n\nShaw also asserts the trial court erred by instructing the jury that a testifying defendant has an interest in the outcome of the trial. That claimed error is groundless. See United States v. Hill, 152 U.S. App. D.C. 213, 217, 470 F.2d 361, 365 (1972) (cited in Dyson v. United States, 450 A.2d 432, 440 (D.C. 1982)).\n\nFinally, we find ample evidence to support Shaw's conviction as an accessory after the fact to simple assault. An accessory after the fact is one who assists a principal to avoid apprehension or punishment. D.C. Code ยง 22-106 (1981). The government's evidence showed that Shaw affirmatively attempted to mislead the police into thinking that Shaw had been forced to inflict the injuries upon Wilson in the course of an arrest. Six police officers testified that in six separate conversations Shaw had told them that he had inflicted the injuries. That Shaw's statements were designed to aid the true culprit to avoid apprehension is made even clearer by the testimony that Shaw told Ruffin not to talk to the police and to wipe the blood from his shoes and in addition by Shaw's statement that he would tell the authorities that he had injured Wilson while attempting to apprehend him.\n\nAccordingly, we affirm Ruffin's conviction of second-degree murder and vacate his conviction of mayhem, and we affirm Shaw's convictions.\n\nMACK, Associate Judge, Concurring in part and Dissenting in part: Today the majority of this division takes a giant step towards trampling the constitutional protections guaranteed by the Fourth and Fifth Amendments. It treads on dangerous ground in holding, contrary to the reasoning of the United States Supreme Court in numerous cases, that the admission into evidence at trial of a written confession obtained in violation of the Fifth Amendment can be harmless error. The majority goes on to find the error harmless beyond a reasonable doubt, in spite of a record that is unequivocally to the contrary. Finally, it reaches the startling Conclusion, on facts indistinguishable from those present in Dunaway v. New York, 442 U.S. 200, 60 L. Ed. 2d 824, 99 S. Ct. 2248 (1979), that the government has been relieved of its heavy burden of proving that a suspect voluntarily waived a Fourth Amendment right to be free from illegal seizure, merely because a trial court has questioned the credibility of that suspect. I find these holdings to go beyond the outer limits of constitutional reason, caselaw, or common sense. I therefore do not agree that appellant Ruffin's second-degree murder conviction can be affirmed. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI\n\nFIFTH AMENDMENT ISSUES\n\nBecause the Fifth Amendment guarantees that no person shall \"be compelled in any criminal case to be a witness against himself [or herself],\" law enforcement officers cannot constitutionally extract involuntary confessions. I do not think it open to question that the United States Supreme Court has never applied \"harmless error\" analysis to uphold a conviction following the introduction into evidence of a post- Miranda confession obtained contrary to the mandate of that decision. See Miranda v. Arizona, 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602 (1966).\n\nIt has long been recognized that there is a \"compulsion inherent in custodial interrogation,\" Moran v. Burbine, 475 U.S. 412, 106 S. Ct. 1135, 1143, 89 L. Ed. 2d 410 (1986), and that \"the interrogation process is 'inherently coercive,'\" id. at 1144. The purpose of the rule in Miranda, that an individual under interrogation by government authority must be informed of the right to counsel, is in part \"to dissipate th compulsion.\" Moran v. Burbine, supra, 106 S. Ct. at 1143. \"Fifth Amendment rights can be adequately protected . . . only if the suspect clearly understands that at any time he [or she] can . . . call in an attorney to give advice and monitor the conduct of his [or her] interrogators.\" Id. at 1144.\n\nAppellant Antone Ruffin's Fifth Amendment right to be protected from compelled self-incrimination was violated in this case, as the majority concedes, by Officer Muse's circumvention of his responsibility to inform Ruffin of his right to counsel. Edwards v. Arizona, 451 U.S. 477, 481-82, 68 L. Ed. 2d 378, 101 S. Ct. 1880 (1981); see Michigan v. Jackson, 475 U.S. 625, 106 S. Ct. 1404, 1407, 89 L. Ed. 2d 631 (1986). In Edwards, the Supreme Court held that a request for counsel \"is per se an invocation of [] fifth Amendment rights, requiring that all interrogation cease.\" 451 U.S. at 485. The majority agrees that Ruffin's equivocal request for counsel required at least further inquiry concerning the request before any interrogation could resume. No further inquiry was made. The Conclusion of circumvention is buttressed by facts showing that Officer Muse, reacting to Ruffin's request, actually convinced the suspect that on the facts of his case -- since he was claiming self-defense -- he did not need a lawyer, and that Ruffin, who had had no prior dealings with the criminal Justice system, believed the officer.\n\nIt is only \"full comprehension of the right to . . . request an attorney,\" that can dispel the \"coercion is inherent in the interrogation process.\" Moran v. Burbine, supra, 106 S. Ct. at 1144. Because Officer Muse ignored his responsibilities under Edwards and Miranda to fairly inform Ruffin of his right to counsel, the inherent compulsion and coercive nature of the interrogation process was never dissipated. Without being fully informed of his rights, and in interrogators fully respecting any attempt to exercise those rights, no statement given to Officer Muse by Ruffin could ever \"truly be the produce of his free choice.\" Miranda, supra, 384 U.S. at 458.\n\nA\n\nThe majority is therefore right in concluding that the written confession was taken involuntarily in violation of the Fifth Amendment; it is wrong in concluding that the erroneous admission into evidence of the statement obtained by Officer Muse through this unconstitutional stratagem does not require automatic reversal of Ruffin's conviction. See Michigan v. Jackson, supra, 106 S. Ct. 1404 (affirming reversal of conviction where statement was taken following a request for counsel that was ignored, notwithstanding existence of several other valid confessions and without engaging in harmless error analysis); Edwards, supra, 451 U.S. 477 (admission of confession obtained following thwarted attempt to exercise right to counsel requires reversal of conviction; weight or sufficiency of other evidence introduced at trial is not an issue).\n\n\"Some constitutional errors require reversal without regard to the evidence in the particular case.\" Rose v. Clark, 478 U.S. 570, 106 S. Ct. 3101, 3106, 92 L. Ed. 2d 460 (1986). \"this limitation recognizes that some errors necessarily render a trial fundamentally unfair.\" Id. The admission of Ruffin's involuntary statement into evidence is one such error, and requires that his conviction be set aside without regard to the weight of any additional evidence introduced against him at trial. See id. at 3111 (Stevens, J., Concurring) (\"The admission of a coerced confession can never be harmless even though the basic trial process is otherwise completely fair and the evidence of guilt overwhelming\"); Chapman v. California, 386 U.S. 18, 23 \u0026 n.8, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1967) (introduction of a coerced confession violates one of the \"constitutional rights so basic to a fair trial that their infraction can never be treated as harmless error\") (cited for the contrary proposition by the major-error\") (cited for the contrary proposition by the majority, see ante at 39; id. at 42-43 (Stewart, J., Concurring) (same); id. at 52 n.7 (Harlan, J., Dissenting) (\"particular types of error [including the introduction of involuntary confessions] have an effect which is so devastating or inherently indeterminate that as a matter of law they cannot reasonably be found harmless\"). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe Supreme Court has repeatedly so held and has emphatically rejected application of any harmless error doctrine to errors of this type. See, e.g., Michigan v. Jackson, supra, 106 S. Ct. 1404 (automatically remanding for new trial without considering whether error was harmless); Edwards, supra, 451 U.S. 477 (same); Lego v. Twomey, 404 U.S. 477, 483, 30 L. Ed. 2d 618, 92 S. Ct. 619 (1972) (it is \"axiomatic . . . that a defendant in a criminal case is deprived of due process of law if his [or her] conviction is founded, in whole or in part, upon an involuntary confession . . . even though there is ample evidence aside from the confession to support the conviction\"); Chapman v. California, supra, 386 U.S. at 23 \u0026 n.8 (constitutional harmless error doctrine does not apply to introduction of involuntary confessions; reversal is automatically required); Jackson v. Denno, 378 U.S. 368, 376, 12 L. Ed. 2d 908, 84 S. Ct. 1774 (1964) (axiomatic that due process requires automatic reversal of conviction founded in whole or in part upon involuntary conviction); Haynes v. Washington, 373 U.S. 503, 518-19, 10 L. Ed. 2d 513, 83 S. Ct. 1336 (1963) (due process requires automatic reversal without regard to weight of other evidence; indeed, in many such cases, \"independent corroborating evidence left little doubt as to the truth of what the defendant had confessed\"); Lynumn v. Illinois, 372 U.S. 528, 537, 9 L. Ed. 2d 922, 83 S. Ct. 917 (1963) (claim that introduction of involuntary confession \"was a harmless in the light of other evidence of the [defendant's] guilt[] . . . is an impermissible doctrine\"); Rogers v. Richmond, 365 U.S. 534, 540-41, 5 L. Ed. 2d 760, 81 S. Ct. 735 (1961) (due process requires reversal of conviction following introduction of involuntary confession, regardless of other evidence, because \"ours is an accusatorial and not an inquisitorial system -- a system in which the State must establish guilt by evidence independently and freely secured\"); Spano v. New York, 360 U.S. 315, 324, 3 L. Ed. 2d 1265, 79 S. Ct. 1202 (1959) (admission of involuntary confession requires automatic reversal); Payne v. Arkansas, 356 U.S. 560, 568, 2 L. Ed. 2d 975, 78 S. Ct. 844 (1958) (\"where, as here, a coerced confession constitutes a part of the evidence before the jury and a general verdict is returned, no one can say what credit and weight the jury gave to the confession. And in these circumstances this Court has uniformly held that even though there may have been sufficient evidence apart from the coerced confession to support a judgment of conviction, the admission in evidence, over objection, of the coerced confession vitiates the judgment because it violates the Due Process Clause\"); Stroble v. California, 343 U.S. 181, 190, 96 L. Ed. 872, 72 S. Ct. 599 (1952) (if a confession is \"involuntary, the conviction cannot stand, even though the evidence apart from that confession might have been sufficient to sustain the jury's verdict\"); Malinski v. New York, 324 U.S. 401, 404, 89 L. Ed. 1029, 65 S. Ct. 781 (1945) (introduction of such a confession requires that judgment of conviction be set aside \"even though the evidence apart from the confession might have been sufficient to sustain the jury's verdict\"); Lyons v. Oklahoma, 322 U.S. 596, 597 n.1, 88 L. Ed. 1481, 64 S. Ct. 1208 (1944) (\"Whether or not the other evidence in the record is sufficient to justify the general verdict of guilty is not necessary to consider. . . If such admission of this confession denied a constitutional right to defendant the error requires reversal\"); Bram v. United States, 168 U.S. 532, 541, 42 L. Ed. 568, 18 S. Ct. 183 (1897) (\"If [a confession is] found to have been illegally admitted, reversible error will result, since the prosecution cannot on the one hand offer evidence to prove guilt, and which by the very offer is vouched for as tending to that end, and on the other hand for the purpose of avoiding the consequences of the error caused by its wrongful admission, be heard to assert that the matter offered as a confession was not prejudicial because it did not tend to prove guilt\").\n\n\"Violations of certain constitutional rights are not, and should not be, subject to harmless error analysis because those rights protect important values that are unrelated to the truth-seeking function of the trial.\" Rose v. Clark, supra, 106 S. Ct. at 3111 (Stevens, J., Concurring). The admission into evidence of a custodial statement obtained without Fifth Amendment safeguards, as one such violation, requires the Ruffin be afforded a new and fair trial. The majority's Conclusion to the contrary not only sanctions the inherently prejudicial introduction of involuntary confessions, but also puts this court in the position of condoning official violation of procedural safeguards designed to protect the citizen against unlawful police activity. As the press recently reminded,\n\nthe Miranda ruling states a basic guarantee that was given to Americans in the constitution and [the history of custodial interrogation set forth in that opinion] reveals what happens if that guarantee is not honored. Making light of Miranda is a grave error, for in so doing one belittles our freedoms. That can be a road back to 1930, or to 1800 or to 1600. It is a road on which we should not willingly set foot.\n\nRose, 'Miranda' Under Attack, The Washington Post, Nov. 25, 1986, at A21, col. 1.\n\nB\n\nEven if we were to accept the premise that the caselaw permits this court, in reaching its Disposition, to measure the weight of evidence introduced at trial over and above an involuntary confession, the majority would be in no better position. On the facts of this case, no fair reading of the record can permit the Conclusion that the admission into evidence of Ruffin's statement to Detective Muse was harmless error. The prosecution, in proving its case for the charge of second-degree murder, relied almost entirely upon this involuntary statement. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The majority painstakingly analyzes the question of whether there is other evidence in the record to prove that it was Ruffin who inflicted the injures leading to the death of the victim, apparently failing to realize that no one disputes that it was Ruffin who delivered the fatal blows. Indeed, Ruffin himself testified to that effect. Justice Frankfurter once remarked that \"ON the question you ask depends the answer you get.\" Bay Ridge Operating Co. v. Aaron, 334 U.S. 446, 484, 92 L. Ed. 1502, 68 S. Ct. 1186 (1948) (dissenting). Here, because the majority has posed the wrong question, it has arrived at the wrong answer.\n\nThe issue before the jury was not whether Ruffin had caused the victim's death, but whether he had done so with the malice necessary to convict of second-degree murder. The finding of malice, a contested state of mind, is peculiarly within the province of the jury; it is not generally one which this court can fairly make from a cold record. See Jones v. United States, 516 A.2d 929, 931 (D.C. 1986) (\"Intent being a state of mind, unless admitted by the defendant, it must be shown by circumstantial evidence 'because there is no way of fathoming and scrutinizing the human mind'\" (emphasis added; citation omitted)); see also Shelton v. United States, 505 A.2d 767, 770 (D.C. 1986) (same). The majority unrealistically ignores the obvious effect of what was presented to the jury as Ruffin's own admission of malice. It then finds the error harmless by engaging in a subjective evaluation of other evidence which is necessarily open to conflicting interpretations as to intent. In doing so, the majority never explicitly finds the malice which is a required part of any harmless error analysis, it perfunctorily treats Ruffin's claim of self-defense, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and omits even to mention Ruffin's alternative defense of adequate provocation caused by the news of his sister's rape. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe error in admitting the challenged statement could be harmless only if, beyond a reasonable doubt, it \"did not contribute to the verdict obtained.\" Chapman v. California, supra, 386 U.S. at 24. Here, the converse is true: there can be no doubt that the written statement did contribute to Ruffin's second-degree murder conviction. The government's case showed that Ruffin's combat with Clifford Wilson followed upon information given to hi that Wilson had raped Ruffin's sister. The government's case thus put in issue Ruffin's defenses to second-degree murder, that the killing was committed upon adequate provocation or in self-defense. \"hen a defense to second degree murder -- adequate provocation, for example -- has been put in issue, the Government must prove its absence beyond a reasonable doubt.\" United States v. Alexander, 152 U.S. App. D.C. 371, 392, 471 F.2d 923, 944, cert. denied, 409 U.S. 1044, 93 S. Ct. 541, 34 L. Ed. 2d 494 (1972). The trial court correctly instructed the jury that, in order to make a case for second-degree murder, the prosecution was required to \"prove beyond a reasonable doubt that the defendant did not injure the deceased in the heat of passion, caused by adequate provocation,\" and that if the jury did find heat of passion/provocation, \"that reduces [the charge] to manslaughter.\" The court also instructed the jury on the government's additional burden to prove beyond a reasonable doubt that Ruffin was not acting in self-defense.\n\nThe inadmissible written statement was the sole prosecution evidence that anything other than the news of his sister's rape had motivated Ruffin in fighting with Wilson. Nothing in Ruffin's oral statement, see majority opinion, ante at note 1, or in the testimony adversely described his mental state at the time of the incident. In contrast, in the written statement, Officer Muse recorded that he had asked Ruffin if Clifford Wilson, the victim, was a friend of his. Ruffin responded, \"Nope, frankly we don't get along. As far as I am concerned he is just another one of them 'herb-smoking Street Niggers.'\" Ruffin then remarked that he was \"teaching a lesson, you can't keep going around mistreating people and expecting nothing to happen.\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn addition to introducing this critically damaging admission in its case-in-chief, the government made extensive use of it in both its opening and closing arguments. In his opening, counsel for the government stated, \"Antone Ruffin, you'll hear, had some animosity toward Clifford Wilson.\" Later in the opening the prosecutor said that Ruffin \"didn't like Clifford Wilson. Clifford Wilson had had some dealings with [Ruffin's] family before and didn't like him. Clifford Wilson had it coming to him and wasn't sorry.\"\n\nThe prosecutor went back to this statement in his closing argument. He urged the jury \"to return the only verdict consistent with the evidence in the case, that is, second-degree murder against Antone Ruffin. The reason that I would ask you to return second-degree murder rather than manslaughter is that Antone Ruffin has told the police in his statement that he did not like Clifford Wilson, that he didn't like him . . . Antone Ruffin didn't like Cliff Wilson. Maybe he thought that this was a good excuse to try to get back at Cliff Wilson or whatever. . . . That is why this is a second-degree murder, ladies and gentlemen, and not manslaughter.\" (Emphasis added.) In defining malice for the jury, the prosecutor said that malice \"doesn't mean that hated Clifford Wilson or that he felt hostility toward Clifford Wilson. It doesn't necessarily mean those things. But those things can come into play.\" (Emphasis added.)\n\nIn sum, the prosecution relied entirely on Ruffin's written statement to meet its burden to disprove, beyond a reasonable doubt, self-defense or heat of passion upon adequate provocation and, in addition, relied upon it to show malice, a necessary element of second-degree murder. The second-degree murder conviction, by the prosecutor's own definition, was based on the involuntary, inadmissible, written statement; its admission into evidence cannot possibly be characterized as harmless. For this reason alone therefore, even if harmless error doctrine does apply, Ruffin's conviction must be reversed.\n\nII\n\nTHE FOURTH AMENDMENT VIOLATION\n\nIn my view, even if there had been no Fifth Amendment violation in this case, Ruffin's conviction must still be reversed. The Fourth Amendment provides that \"the right of the people to be secure in their persons, . . . against unreasonable searches and seizures, shall not be violated . . . but upon probable cause . . . \" In addition to the involuntary, inadmissible, written statement, the government relied upon the admission into evidence of an oral statement and blood-stained clothing. The Fourth Amendment requires that Ruffin's written and oral statements to the police, together with the pants and shoes seized from him, be suppressed as the fruits of his unlawful custody. Ruffin was seized by the police and taken to police headquarters without probable cause. The government did not show that Ruffin waived his Fourth Amendment right to be free of unlawful seizures or that he had consented to accompany the police to the stationhouse. The government unquestionably has the burden to show a waiver of fundamental rights and its failure to do so here required that all evidence obtained by virtue of the unlawful seizure be suppressed.\n\nThe issue of whether the statements and physical evidence should have been suppressed as the fruit of Ruffin's unlawful seizure is entirely distinct from the question of whether Ruffin's written statement to Detective Muse was obtained in violation of the Fifth Amendment, and the two questions must be analyzed separately. Lanier v. South Carolina, 474 U.S. 25, 106 S. Ct. 297, 298, 88 L. Ed. 2d 23 (1986) (per curiam) (summarily remanding decision which held that voluntariness of confession obtained following illegal seizure purged the taint of that seizure, reemphasizing separate nature of Fourth and Fifth Amendment analyses); Taylor v. Alabama, 457 U.S. 687, 690, 73 L. Ed. 2d 314, 102 S. Ct. 2664 (1982) (similar).\n\nIt is undisputed that Ruffin was picked up at his sister's home by two police officers and transported in the back of a squad car to police headquarters. It is also undisputed that when the police officers picked him up, they did so without probable cause to arrest or seize. It is fundamental that this type of activity by the police is an illegal seizure unless the target has agreed to waive his Fourth Amendment right and has consented voluntarily to accompany the police. Dunaway v. New York, supra, 442 U.S. at 207. The government \"has the burden of establishing a valid waiver,\" Michigan v. Jackson, supra, 106 S. Ct. at 1409 (citation omitted). Our function as a reviewing court is to \"indulge every reasonable presumption against waiver of fundamental constitutional rights.\" Id. (quoting Johnson v. Zerbst, 304 U.S. 458, 464, 82 L. Ed. 1461, 58 S. Ct. 1019 (1934)). \"Doubts must be resolved in favor of protecting the constitutional claim.\" Id.\n\nRather than protect the constitutional claim, the majority chooses to \"indulge every presumption,\" reasonable and unreasonable, in favor of the government. The prosecution never made any case that Ruffin had waived his Fourth Amendment right to be free from unreasonable seizures. The majority relies on the testimony of Detective Hosea Dyson. At the suppression hearing, Dyson testified as follows: \"I called [Ruffin's] home address and asked him to come down to the office in reference to our investigation.\" The prosecutor then asked, \"And did he do so voluntarily?\". Dyson responded, \"Yes, sir.\" Dyson, however, did not pick Ruffin up -- that was done by Officers Terra Alexander Williams and James Brown -- and Dyson therefore had no knowledge of whether Ruffin had agreed to accompany Williams and Brown voluntarily or not. Ruffin later testified that he had never spoken on the phone to Dyson and at the trial Dyson started to testify, until cut off by a hearsay objection, that it was a Lieutenant Alexander who had made the call. That it was Alexander who had made the call was also confirmed by Brown, who said that Lieutenant Alexander had told him where to pick up Ruffin. Dyson's legal Conclusion (given in response to the prosecution's rather leading question -- \"And did he do so voluntarily?\" -- \"Yes, sir\") is therefore entitled to no weight at all.\n\nPrecious little other testimony was introduced on the issue of voluntariness. Officer Williams testified that she had \"asked if he would go down with us because they wanted to talk him down at the Homicide Branch.\" Ruffin's response is not recorded. Officer Brown testified that he was ordered to pick up Ruffin, and stated that \"apparently someone at the Homicide Branch had in fact talked to Mr. Ruffin and apparently he was voluntarily coming down.\" Although Officer Brown testified that if Ruffin had asked, Brown would have let him out of the car, Brown's thoughts in this regard were never communicated to Ruffin; neither Brown nor Williams in any way indicated to Ruffin that he was free to refuse to accompany them.\n\nIn contrast, Ruffin testified that the police had spoken to Sebert Harvey, Ruffin's sister, not to Ruffin, and that they had informed her that if Ruffin did not agree to come down to headquarters a bench warrant would be issued for his arrest. The prosecution never rebutted this statement. See majority opinion, ante at 27 (\"despite Ruffin's 'bench warrant' testimony -- and despite the officers' own knowledge of what Ruffin had said to them and of what the police had, or had not, said to Ruffin's sister -- all the officers left out a vital testimonial link between the police requests and Ruffin's willingness to accompany them\").\n\nThe Supreme Court evaluated a nearly identical set of facts in Dunaway, supra, 442 U.S. 200. There, without probable cause, a police supervisor ordered detectives to pick up petitioner Dunaway and bring him in. Like Ruffin, Dunaway was not told that he was under arrest. He was driven to police headquarters in a police car and placed in an interrogation room and, initially like Ruffin, was given Miranda warnings. Dunaway subsequently made statements and drew pictures that incriminated him. Id. at 203. As in this case, the government there contended that Dunaway \"accompanied the police voluntarily and therefore was not 'seized.'\" Id. at 207 n.6. The Supreme Court rejected this claim, based, in part, on the trial court's determination that the seizure was not voluntary since \"this case does not involve a situation where the defendant voluntarily appeared [of his own accord] at police headquarters in response to a request of the police.\" Id. at 205 (quoting People v. Dunaway (Monroe County Ct., N.Y., Mar. 11, 1977), App. 116, 117). The Supreme Court also relied upon the ALI'S MODEL CODE OF PRE-ARRAIGNMENT PROCEDURE ยง 2.01 (3) and commentary, p. 91 (Tent. Draft No. 1, 1966), which states that a reasonable person faced with a request by police officers to come to police headquarters may feel compelled to do so unless the request \"is clearly stated to be voluntary.\" Quoted in Dunaway, supra, 442 U.S. at 207 n.6. The police did not tell Dunaway that he was free not to accompany them, just as they failed in this case to so inform Ruffin. The Supreme Court concluded that\n\nthe detention of petitioner was in important respects indistinguishable from a traditional arrest. Petitioner was not questioned briefly where he was found. Instead, he was taken from a neighbor's home to a police car, transported to a police station, and placed in an interrogation room. He was never informed that he was \"free to go\" . . .\n\nId. at 212. The Court continued:\n\nThe application of the Fourth Amendment's requirement of probable cause does not depend on whether an intrusion of this magnitude is termed an \"arrest\" under state law. The mere facts that petitioner was not told he was under arrest, was not \"booked\", and would not have had an arrest record if the interrogation had proved fruitless . . . obviously do not make petitioner's seizure even roughly analogous to the narrowly defined intrusions involved in Terry [ v. Ohio, 392 U.S. 1, 20 L. Ed. 2d 889, 88 S. Ct. 1868 (1968),] and its progeny. Indeed, any \"exception\" that could cover a seizure as intrusive as that in this case would threaten to swallow the general rule that Fourth Amendment seizures are \"reasonable\" only if based on probable cause.\n\nId. at 212-13. Finally, the Court held\n\nthe central importance of the probable-cause requirement to the protection of a citizen's privacy afforded by the Fourth Amendment's guarantees cannot be compromised in this fashion. . . . Detention for custodial interrogation -- regardless of its label -- intrudes so severely on interests protected by the Fourth Amendment as necessarily to trigger the traditional safeguards against illegal arrest.\n\nId. at 213, 216.\n\nThe only factor differentiating this case from Dunaway is that there the parties stipulated that had Dunaway attempted to leave police custody he would have been restrained. Here, the police testified that if Ruffin had attempted to leave he would have been free to do so. This is a distinction without a difference, for it is not the subjective intent of the police that determines when a seizure has taken place, but the extent to which that subjective intent has been communicated to the suspect. \"he subjective intention of the [law enforcement] agent in this case to detain the respondent, had she attempted to leave, is irrelevant except insofar as that may have been conveyed to the respondent.\" United States v. Mendenhall, 446 U.S. 544, 554 n.6, 64 L. Ed. 2d 497, 100 S. Ct. 1870 (1980) (Stewart, J., joined by Rehnquist, J.); see also id. at 560 n.1 (Powell, J., joined by Burger, C.J., and Blackmun, J., Concurring); id. at 575 \u0026 nn. 12 13 (White, J., joined by Brennan, Marshall, and Stevens, JJ., Dissenting); New York v. Quarles, 467 U.S. 649, 656 n.6, 81 L. Ed. 2d 550, 104 S. Ct. 2626 (1984) (citing United States v. Mendenhall, supra at 554 \u0026 n.6). In both Dunaway and this case, the government failed to show that law enforcement officials had in any way communicated to their suspects that they were free to refuse to accompany the police to the stationhouse. The result in Dunaway accordingly governs here: Ruffin was illegally seized and, since there were no intervening circumstances that could attenuate the taint of the illegal seizure, Dunaway, supra, 442 U.S. at 218, its \"fruits\" -- two statements and Ruffin's clothing -- should have been suppressed.\n\nMy colleagues make the unique argument that because Ruffin chose to testify at the suppression hearing, and the trial court did not find Ruffin's testimony at that hearing to be credible, the trial court's lack-of-credibility finding relieved the government of its normal burden to demonstrate a waiver of Fourth Amendment rights. Majority opinion, ante at 8-28. Since there is no logical connection between Ruffin's credibility and the government's initial heavy burden to show consent or waiver, merely to state this argument is to refute it. The fact that the trial court found Ruffin's testimony incredible could in no way diminish the burden upon the government to show a waiver of Fourth Amendment rights. The truth of falsity of the statements which the trial court found not credible -- that Ruffin was handcuffed and that he had been intimidated by unidentified police officers -- is neither determinative nor even relevant.\n\nThe majority begins with the observation that \"one is struck . . . by how elusive\" is the answer to the question whether Ruffin did or did not go voluntarily to the police station. Majority opinion, ante at 8. Given the fact that every doubt must be resolved in favor of protecting Ruffin's constitutional claim, this concession should be enough to end the inquiry. Instead, the majority tortuously resolves its initial doubt against Ruffin. Behind the circular twenty-page (on-again, off-again, burden-shifting) analysis engaged in by the majority is the singular Conclusion that by choosing to testify at the suppression hearing Ruffin took his chance that if he had the misfortune to be disbelieved by the trial court he would thereby relieve the government of its heavy burden to demonstrate a waiver of a constitutional right. See, e.g., majority opinion, ante at 18 \u0026 n.10, 26-28. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Given the questionable logic of this analysis, the level of solemnity with which it is trotted out would be humerous if its results were not so unfortunate. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe majority's reliance on Mendenhall, supra, 446 U.S. 544, is misplaced. There, the issue was whether heroin seized upon the search of the defendant at an airport was admissible into evidence. The defendant was stopped by drug enforcement against and asked to accompany them to an office a few yards away. In holding that the search that uncovered the heroin was lawful, the Supreme Court stated:\n\nit is especially significant that the respondent was twice expressly told that she was free to decline to consent to the search, and only thereafter explicitly consented to it . . . uch knowledge was highly relevant to the determination that there had been consent. And, perhaps more important for our purposes, the fact that the officers themselves informed the respondent that she was free to withhold her consent substantially lessened the probability that their conduct could reasonably have appeared to her to be coercive.\n\nId. at 558-59. The factors relief upon by the Court in Mendenhall -- the explicit statement to the defendant that she was free to refuse consent coupled with her explicit consent thereafter -- are the very factors that are absent in this case and were absent in Dunaway. The majority's preoccupation with Mendenhall and its failure to distinguish Dunaway are inexplicable.\n\nIn summary, I think the reversal of Ruffin's conviction, on both Fifth and Fourth Amendment grounds, is constitutionally required. Antone Ruffin is entitled to a new -- and this time fair -- trial.\n\nI respectfully Dissent.\n\nAPPENDIX A\n\nTHE INVOLUNTARY, INADMISSIBLE, WRITTEN STATEMENT\n\nThis is the involuntary written statement which, as the majority concedes, was constitutionally inadmissible:\n\nAttach PD 47 Here\n\nP.D. 118 Rev. 7/74\n\nMETROPOLITAN POLICE DEPARTMENT\n\nWASHINGTON, D.C.\n\nDEFENDANT/SUSPECT STATEMENT\n\n1. Complaint No.\n\n2. Nature of Investigation\n\nInjured Person to the Hospital\n\n3. Unit File No.\n\n4. Statement of: (Last, First, Middle)\n\nRuffin, Antone Dewitt\n\n5. DOB\n\n03-13-58\n\n6. Sex\n\nM\n\n7. Home Address\n\n8. Home Phone\n\n9. Location Statement Taken\n\nHomicide Office\n\n10. Name of Officer Taking Statement (if other than block 16 includes signature)\n\nClarence L. Muse\n\n11. Date/Time Started\n\n2/3/80 1439\n\n12. Waiver of Rights and Statement\n\nADR [handwritten initials]\n\nNot\n\nYou are under arrest. Before we ask you any questions you must understand what your rights are. You have the right to remain silent. You are not required to say anything to us at any time or to answer any questions. Anything you say can be used against you in court.\n\nYou have the right to talk to a lawyer for advice before we question you and to have him with you during questioning.\n\nIf you cannot afford a lawyer and want one, a lawyer will be provided for you.\n\nIf you want to answer questions now without a lawyer present you will still have the right to stop answering at any time. You also have the right to stop answering at any time until you talk to a lawyer.\n\nDo you understand these rights? yes.\n\nDo you wish to answer any questions? yes.\n\nAre you willing to answer questions without having an attorney present? yes.\n\nQ: Do you know the man who was injured inside the hallway of [address omitted] this morning?\n\nA: Yes sir.\n\nQ: Relate to me the circumstances as you know them, which led to the injuries received by the man?\n\nA: This morning about 0830 I was on the way to take my Bass Player home at 17th \u0026 Corcoran St. N.W., when I decided to drive by my mother's apartment which is at [address omitted]. When we got there, my mother and my sister were sitting in her car getting ready to drive off. I asked them where they were going and they said that they were going up to my other sister['s; name omitted] house because Cliff had tried to rape her. I told them that I would follow them up there. When we got to her apartment, she said that Cliff had tried to rape her. I asked her where he was and she said that he had just left, so I ran around the corner and up the steps to see if I saw him and there he was going up the steps. he was at the top of the steps and saw that he couldn't out run me so he stopped and turned around and tried to push me down the steps. I went backw rds a couple of steps and grabbed the hand rail and went back up. He tried to swing and I blocked the punch. He fell and tried to grab my feet and push me back down the steps. So to keep him from pushing me down the steps I started kicking.\n\nQ: How much punishment did you inflict on Cliff?\n\nA: I hit him with a left-right combination to both sides of his face and he went down, he tried to get up but he couldn't so he tried to kick me down the stairs, so I used my feet.\n\nQ: How and where did you kick him?\n\nA: I kick him once with a full house and to straight down stomps.\n\n[blocks 13 through 17, as on Page 3; end Page 1]\n\n[Page 2]\n\n[heading, blocks 1 through 12, as on Page 1]\n\nQ: When you last saw Cliff was he unconscious or was he alert?\n\nA: He was unconscious .\n\nQ: What was his condition?\n\nA: I did a job on him.\n\nQ: Do you know what part of the anatomy the kicks landed?\n\nA: I believe, around the forehead, mouth and nose, but I'm not sure.\n\nQ: How much blood was around when you last saw Cliff?\n\nA: A whole lot of it.\n\nQ: How long have you known Cliff?\n\nA: Long as I can remember.\n\nQ: Is he a friend of yours?\n\nA: Nope, frankly we don't get along. As far as I am concerned, he is just another one of them \"herb-smoking Street Niggers.\"\n\nQ: Does he use drugs?\n\nA: I don't know about using drugs, but I know that he smokes Angel dust and Herbs.\n\nQ: Did you have any blood on your shoes?\n\nA: Yes, sir.\n\n[blocks 13 through 17, as on Page 3; end Page 2]\n\n[Page 3]\n\n[heading, blocks 1 through 12, as on Page 1]\n\nQ: What happened to the blood on your shoes?\n\nA: I washed it off. I first wiped it off upstairs in my sisters apartment, but it didn't come off too good, so I went down stairs to the basement and washed it off.\n\nQ: Why didn't you stay on the scene and talk to the police there?\n\nA: I stayed there for a long time until the police told me to leave. They told me to get out of the hall so I just left.\n\nQ: How long have you known Officer SHAW?\n\nA: 8-10 years, I presume . Anyway it's been a pretty good time.\n\nQ: What happened to your Bass Player while this was happening?\n\nA: He came up the steps behind me and he must have said something like \"It not worth it\" because I stopped when I heard this and we went back down stairs.\n\nQ: Did Officer SHAW hit Cliff?\n\nA: I didn't see him hit him because I wasn't with him. I know what condition he was in when I left and it wasn't good.\n\nQ: Were you trying to kill Cliff?\n\nA: No sir, I was only defending myself and teaching him a lesson, you can't keep going round mistreating people and expecting nothing to happen.\n\nQ: Have you ever Boxed or taken Karate?\n\nA: Yes, both of them.\n\n13. I Have Read this Statement Given by me or Have Had it Read to me. I Fully Understand it and Certify that it is True and Correct to the Best of my Knowledge and Recollection.\n\nAntone D. Ruffin\n\nSignature of Person Giving Statement\n\n14. Date/Time Ended\n\n2/3/80 1548\n\n15. Page 3 of Pages.\n\n16. Officer Obtaining the Signature in Block 13:\n\nClarence Muse\n\nClarence L. Muse\n\n(Name and Signature)\n\n17. Person Witnessing the Signature in Block 13:\n\n(Name and Signature)\n\nGovernment Exhibit 27 (italics added for emphasis; bold face indicates standard printed language in original Form P.D. 118) (this is the involuntary written statement that the majority describes as \"exculpatory,\" see ante at 42-44).\n\nAPPENDIX B\n\nTHE CENTRAL ROLE OF THE INVOLUNTARY, INADMISSIBLE, WRITTEN STATEMENT\n\nIn returning its verdict of guilty to second-degree murder, the jury had to reject Ruffin's defenses of self-defense (which, if accepted, would have required acquittal) or alternatively adequate provocation caused by the news of his sister's rape (which, if accepted, would have reduced the conviction from second-degree murder to voluntary manslaughter). The majority affirms. It holds initially that the harmless error doctrine is applicable to the introduction of involuntary confessions, a notion I totally reject. Turning to the facts of this case, the majority goes on to find no reasonable possibility that the erroneous admission of the \"exculpatory\" written statement into evidence influenced the jury's rejection of Ruffin's theories of self-defense or adequate provocation and its verdict of guilty to second-degree murder. What follows is a summary of the central role the written statement played in Ruffin's trial.\n\nTHE PROSECUTOR'S OPENING ARGUMENT TO THE JURY\n\nIn his opening argument, the prosecutor relied several times upon the written statement. He told the jury that \" Antone Ruffin, you'll hear, had some animosity toward Clifford Wilson, anyway runs off in pursuit of Clifford Wilson, and [the bass player], his fried, follows.\" (Emphasis added.) The prosecutor, reciting facts and language drawn directly from the written statement, continued:\n\nAntone Ruffin charged up those stairs, according to his own statement, and . . . Clifford Wilson tried to push him back, he charged up the stairs. Antone Ruffin, who is highly trained in karate, has boxed . . . put him down on the floor with two kicks, left-right combination, put him down on his back, and then proceeded to stomp his face, and his head, and his body. And he kept doing it until finally [the bass player] heard what was going on and came up the stairs and pulled him off. [Emphasis added.]\n\nLater in his opening argument, the prosecutor reminded the jury that in the homicide office Ruffin\n\nmade a statement to the police, which he described what had happened. And which he says he told the police that basically what I have just told you. He said that he had -- he didn't like Clifford Wilson. Clifford Wilson had had some dealings with his family before and he didn't like him. Clifford Wilson had it coming to him and he wasn't sorry. And he said Wilson good and he stomped him. And you'll hear testimony about the descriptions that he gave about his stomping Clifford Wilson into unconsciousness and doing a job on Clifford Wilson, the barefoot man who was running up the stairs away from him. [Emphasis added.]\n\nTHE PROSECUTOR'S EXAMINATION OF DETECTIVE MUSE\n\nIn testimony taking up ten pages of the transcript, the prosecutor asked Detective Clarence Muse \"did you actually take a written statement from Mr. Ruffin?\" After answering \"Yes, I did,\" Detective Muse was handed Government Exhibit 27 and described it as a copy of the statement that he took from Ruffin. Detective Muse testified that he advised Ruffin of his rights and (without alerting the jury to his failure to cease interrogation, and his legal advice that Ruffin did not need a lawyer, ensured that Ruffin was willing to make the statement. \"He said, well, he didn't have anything to hide.\"\n\nAt the prosecutor's request, Detective Muse then read the full statement out to the jury.\n\nHaving done so, Detective Muse described how Ruffin took the opportunity \"to read the statement over to see if it was accurate.\" Detective Muse testified that Ruffin signed the statement on each page and also signed it at the end with the words: \"I read this statement given by me or have had it read to me. I fully understand it. I certify that it is true to the best of my knowledge and recollection.\" [This, and similar exchanges at other points during the trial, lent an undeserved air of propriety and veracity to the involuntary, inadmissible, written statement.] According to Detective Muse, Ruffin's demeanor during the giving of the statement was \"Calm and unemotional, even stark at times.\"\n\nTHE PROSECUTOR'S EXAMINATION OF DETECTIVE DYSON\n\nThe prosecutor returned to the inadmissible written statement during his examination of Detective Hosea E. Dyson. He asked \"Do you know whether or not Mr. Ruffin gave a written statement?\" Detective Dyson responded that Ruffin gave a written statement to Detective Muse.\n\nTHE DIRECT AND CROSS-EXAMINATION OF RUFFIN\n\nAfter the government had introduced the involuntary, inadmissible, written statement into evidence and into testimony as part of its case-in-chief, Ruffin chose to testify on his own behalf, thus waiving his Fifth Amendment privilege. His counsel, [in an effort to undo the damage caused by the introduction of the written statement, and to make it appear either involuntary or \"exculpatory,\"] requested Ruffin to describe the circumstances under which it was taken and the facts it set forth. Ruffin admitted that he did give the statement, although he claimed he had given it to Detective Dyson and not Detective Muse. He also acknowledged that the officer who recorded it \"said a couple of things pertaining to [my rights] but not exactly my rights.\" When handed a copy of Government Exhibit 27, Ruffin conceded that \"It is supposed to be the statement that I gave\" and verified his signature at the bottom of the statement.\n\nRuffin was then requested to read out his entire written statement to the jury. While Ruffin did so, his counsel regularly intervened to ask him whether the statement's portrayal of each successive event was true or false.\n\nRuffin disputed the time \"0830\" and said he had stated it as \"eight thirty.\" He claimed the statement was incorrect in saying that his mother was sitting in \"her\" car because she did not have a car or a driver's license. Ruffin said that the correct version about his blocking Clifford Wilson's punch was that \"they hit me.\" Ruffin denied that Wilson fell, tried to grab his feet, and push him down the steps; he said the correct version was that \"he was kicking me and I was kicking him back.\" Ruffin agreed that he started kicking to keep Wilson from pushing him down the steps. He denied the written statement's account that he hit Wilson on both sides of the face with a left-right combination; it should have been just that he hit Wilson \"in the face.\" In reference to the statement that Wilson fell down and tried to get back up, Ruffin said \"that is not the phrase that I used\"; he proffered instead that he mentioned Wilson as having \"hit the wall.\" Ruffin denied he admitted kicking Wilson with a full house and two straight down stomps, and denied also that he was a karate expert or had ever studied karate. He claimed having said he left Wilson \"conscious,\" not unconscious. In response to Detective Muse's question as to Wilson's condition, Ruffin denied doing a job on him; Ruffin said he referred to Wilson's condition as \"good.\" When asked where his kicks had landed, Ruffin disputed having said around the forehead, mouth and nose, and claimed he had named only the \"forehead.\" Rather than a whole lot of blood, Ruffin said he calculated just \"a little.\" Ruffin did not say that he had known Wilson as long as he could remember, he said, but instead \"about fourteen years or more.\"\n\nContradicting the written statement, Ruffin denied saying he didn't get along with Wilson (described in the statement as \"just another one of them 'herb-smoking Street Niggers'\") and insisted he had actually described Wilson as \"a friend of the family and a friend of mines.\"\n\nRuffin acknowledged his description of Wilson as an angel dust user. The statement also correctly recorded that had blood on his shoes. Ruffin contradicted the account of his attempt to wipe the blood off in his sister's apartment before doing so in the basement: \"I stated I wiped it off in the basement, not upstairs.\" Rather than saying he had known Officer Shaw for eight to ten years, Ruffin testified, \"I told them about -- I guess eight years or more.\" According to Ruffin, the statement falsely suggested the the word \"presume\" was in his vocabulary. Ruffin rejected the statement's assertion that the bass player had intervened in his struggle with Wilson: \"I stated that he came up the steps, called my name. That was all.\" Ruffin told the jury he never answered the question as to whether Officer Shaw hit Wilson. The statement wrongly recorded Ruffin's answer when Detective Muse asked him whether he was trying to kill Wilson: \"I only stated that I was trying to defend myself\"; Ruffin said he never added the part about \"teaching him a lesson, you can't keep going round mistreating people and expecting nothing to happen.\" Finally, Ruffin denied having said he had \"watched or taken karate.\"\n\nAfter Ruffin had read the written statement to the jury -- interspersed with his testimony as to which portions were true and which were false -- he was asked whether he had been harassed before giving the written statement to the police. Ruffin said that he had. Ruffin admitted that he had initialed the statement. He did not recall having been read his rights. According to Ruffin, Detective Muse told him at the time that the written statement would not be used against him. By then, his counsel's examination concerning the inadmissible written statement, originally introduced as part of the government's case-in-chief, had taken up fourteen pages of the transcript.\n\nRuffin was also cross-examined by counsel for his co-defendant, Officer Shaw, who was in an adversarial role due to Ruffin's testimony that Shaw beat the victim with a gun after Ruffin's fight with Wilson had ended. Again, the written statement was frequently brought to the attention of the jury. Ruffin's testimony concerning the death of Wilson was measured against his written statement. He was asked several further questions which required him to refer directly to the statement. This exchange occupied four pages of the transcript. The court then recessed because it was late in the day.\n\nThe following day, Ruffin was cross-examined by the prosecutor. He recounted once more his effort to locate Wilson in the building after leaving his sister's apartment and described their confrontation at the top of the stairs. The prosecutor, in an suggestive attempt to prove that Ruffin had acted with the malice required to convict of second-degree murder, and not in self-defense or upon adequate provocation, drew from the previous day's testimony, in which Ruffin had contradicted a critical admission in the involuntary, inadmissible, written statement:\n\nTHE PROSECUTOR: Now this, according to you, was an old family friend. You had no animosity whatever. Is that right?\n\nRUFFIN: Yes, sir.\n\nQ. An all you wanted to do was talk to him?\n\nA. Yes, sir.\n\nQ. You didn't stop three or four steps away to say \"Clifford, come on down!\"?\n\nA. No, sir. At the time he was running.\n\nQ. He turned around. He stopped and turned around?\n\nA. Yes, sir.\n\nQ. You didn't stop a few feet away from him and say \"Clifford, come on downstairs!\"?\n\nA. At the time I started to make a statement and before I could make a statement that's when he kicked me.\n\nQ. You weren't intending to fight at all.\n\nA. Yes, sir.\n\nQ. You were saying, \"Hey, Cliff, come on downstairs and let's talk about this!\" That's what you started to say?\n\nA. Not exactly that.\n\nQ. What exactly were you starting to say?\n\nA. I was gonna ask him to come back down to talk with my sister and me to see what happened.\n\nQ. You weren't mad at him were you?\n\nA. I was upset. I wouldn't say I was exactly mad at him.\n\nQ. You thought that this man had raped you sister.\n\nA. At this time, yes, sir.\n\nQ. But you were mad?\n\nRUFFIN: [No response.]\n\nTHE PROSECUTOR: I didn't hear the answer.\n\nTHE COURT: He hasn't answered. [Emphasis added.]\n\nBefore Ruffin left the witness stand, the prosecutor quizzed him for a further eight pages concerning the written statement. The prosecutor attacked Ruffin's credibility by focusing on the conflict in the testimony as to whether Ruffin had been subject to harassment by the police before giving the statement. The prosecutor then used the written statement again to impeach Ruffins' testimony, from the previous day, that his responses had been falsely recorded by the police: \"According to you, Detective Muse and Detective Dyson typed up the wrong names and the wrong times and everything else wrong with the statement?\" Ruffin responded, \"I believe some of the things were wrong, yes, sir.\" The prosecutor proceeded to establish that Detectives Muse and Dyson had had no prior contact with Ruffin and no motive to lie. The exchange continued:\n\nTHE PROSECUTOR: And yet it is your testimony that Detective Dyson and Detective Muse are making this all up? Is that right?\n\nRUFFIN: Only thing I can say is my statement is not correct.\n\nQ. Did you read the statement before you signed it?\n\nA. No, sir.\n\nThe prosecutor handed Ruffin the written statement, Government Exhibit 27, and continued:\n\nQ. That is you statement that you gave, isn't it?\n\nA. I guess so. I didn't see the statement.\n\nQ. Well, let me point down to the bottom of the page -- the bottom of the first page. That is your signature down there, isn't it?\n\nA. Yes, sir.\n\nQ. Up at the top of the page where you -- where it says that you have been advised of your rights, that you are not under arrest, and you are advised of several other rights, didn't you -- the initials are on there?\n\nA. Not pertaining to that, no, sir.\n\nQ. Your initials are right there next to that? The advising of rights section?\n\nA. It is next to it. But It don't mean it is pertaining to that.\n\nQ. You put you initials there?\n\nA. Yes, sir.\n\nQ. And you signed you name on the bottom?\n\nA. Yes, sir.\n\nQ. You did sign the third page, didn't you?\n\nA. Yes, sir.\n\nQ. And your statement says that it was started at two thirty-nine in the afternoon, doesn't it?\n\nA. That's what it stated.\n\nQ. 1439 hours and it ended at three forty-eight?\n\nA. Yes, sir.\n\nQ. And they made that up too?\n\nA. I would guess so.\n\nQ. None of the stuff in here is accurate?\n\nA. I would say . . .\n\n[Defense Counsel's objection sustained.]\n\nQ. So it is your testimony that Detective Dyson masquerading as Clarence Muse wrote down the parts in there that he wanted to write down and changed your words whenever he wanted?\n\nA. I don't recall seeing Detective Muse so I don't know.\n\nQ. You didn't say that you didn't like Clifford Wilson?\n\nA. No, sir.\n\nQ. So they are just making all that up?\n\nRUFFIN: [No response.]\n\n[Defense Counsel's objection sustained.] [Emphasis added.]\n\nJust a few questions later, the prosecutor rested his cross-examination. [He had extensively impeached Ruffin's credibility through the inadmissible written statement. Perhaps even more devastating, the conflict between Ruffin's testimony and the inadmissible written statement undermined his insistence that Wilson was a friend. To the contrary, the prosecutor skillfully used the written statement to prove the malice which was a required ingredient of Ruffin's second-degree murder conviction. In the hands of the prosecutor, the written statement effectively discredited Ruffin's alternative defenses of self-defense and adequate provocation, both of which the government had the burden to disprove beyond a reasonable doubt.\n\nOn redirect, in order to rehabilitate Ruffin's earlier testimony, his defense counsel was obliged to continue the focus on the written statement and the circumstances under which it was taken. That effort a rehabilitation] evidently failed to convince the jury.\n\nTHE PROSECUTOR'S CLOSING ARGUMENT TO THE JURY\n\nConsistent with his strategy throughout the entire trial, the prosecutor relief heavily on the inadmissible written statement in his closing argument. He reminded the jury that in order to return a verdict of guilty to second-degree murder, as opposed to voluntary manslaughter, it must find that Ruffin had acted with malice. Malice, he observed, \"doesn't necessarily mean that Antone Ruffin when he went into the apartment building had the intent to kill Clifford Wilson. It doesn't mean that he hated Clifford Wilson or that he felt hostility toward Clifford Wilson. It doesn't necessarily mean those things. But those things can come into play.\" (Emphasis added.) The prosecutor immediately thereafter discussed the government's burden to prove that Ruffin \"was not acting in the heat of passion caused by adequate provocation or excuse.\"\n\n\"e know from Antone Ruffin's own statement,\" the prosecutor argued, what happened at the top of the stairs. \"We know that Antone Ruffin knocked Clifford Wilson on his back and we know what was described in his own statement, with a left-right combination, that he kicked him with a roundhouse kick and straight down stomps to the head.\" (Emphasis added.)\n\nSumming up his argument, the prosecutor urged the jury to return a verdict of second-degree murder rather than voluntary manslaughter: \" The reason that I would ask you to return second-degree murder rather than manslaughter is that Antone Ruffin has told the police in his statement that he did not like Clifford Wilson, that he didn't like him . . . \" (Emphasis added.) Ruffin had time, the prosecutor pointed out, to cool down, because he had time to drive over to his sister's apartment after hearing about the rape incident and to ask her what had happened. \"Yet Antone Ruffin didn't like Cliff Wilson. Maybe he thought that this was a good excuse to get back at Cliff Wilson or whatever . . . That is why this is second-degree murder, ladies and gentlemen, and not manslaughter.\" (Emphasis added.)\n\nIn response to the prosecutor's closing argument, which relied entirely upon the inadmissible written statement to supply the essential element of malice, Ruffins' defense counsel discussed [as he was compelled to] the written statement in his closing argument. He emphasized Ruffin's claim that he acted in self-defense -- a claim immediately followed in the written statement by the words \"teaching him a lesson, you can't keep going round mistreating people and expecting nothing to happen.\"\n\nTHE JURY'S DELIBERATIONS\n\nThe following day, after receiving its instructions from the court, the jury retired to deliberate upon its verdict. It withdrew from the courtroom at 11:28 a.m. on March 22, 1983.\n\nAlong with their recollections of the trial, the jurors brought Ruffin's involuntary, inadmissible, written statement, Government Exhibit 27, into the jury room with them.\n\nAt 5:12 p.m. the jury, not having arrived at a verdict, informed the court that it was ready to retire for the evening. It was excused. The jury returned to the jury room at 9:50 a.m. the next morning. At 11:16 a.m. on March 23, 1983, the jury returned to the courtroom with its verdict. The jury found An tone Ruffin guilty of the second-degree murder of Clifford Wilson.\n\n[We know nothing of what took place during the seven hours and ten minutes that the twelve jurors spent alone with each other in the jury room.]\n\nConclusion\n\nRuffin's involuntary, inadmissible, written statement, Government Exhibit 27, was a lethal weapon in the hands of the skilled prosecutor who tried this case. It was also an illegal one -- forged at the expense of fundamental procedural safeguards guaranteed to Ruffin and to everyone else by the Fifth Amendment. The prosecutor deftly used that illegal weapon: (1) to destroy Ruffin's credibility; (2) to prove to the jury that he acted with malice, a required ingredient of his second-degree murder conviction; and (3) to undercut Ruffin's defenses that he had acted in self-defense or, alternatively, in the heat of passion upon adequate provocation caused by the news of his sister's rape.\n\nArguably, Ruffin might never have taken the witness stand were it not for a perceived need to undo the damage done to his defenses by the introduction of the inadmissible written statement as part of the government's case-in-chief.\n\nI utterly reject the notion that harmless error doctrine may be used to measure the impact upon a trial of the introduction of an involuntary statement. However, even if such speculation were permitted, on the record I have just described the error was not harmless. This court cannot conclude , beyond a reasonable doubt, that the erroneous introduction of Ruffin's involuntary written statement did not contribute to the verdict.\n\n\u003cspan class=\"fn\"\u003e1. According to Detective Dyson, Ruffin told him that after Ruffin had heard Wilson had raped his sister, he had found Wilson in his sister's apartment house. He had asked Wilson to come back to the apartment to talk things over. Wilson had responded by attempting to kick Ruffin, and Ruffin had blocked the kick and proceeded to defend himself. Then the following interchange took place:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDid he describe what he did in defense of himself?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eYes, sir. He mentioned that he struck the decedent several times and also executed a stomp kick, several stomp kicks, to the decedent's body.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDid you have any Discussions with Mr. Ruffin about whether or not he had any training in the martial arts?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eYes, sir, I did . . . e advised me that he had had formal training in Taekwondo and that he had reached the rank of brown belt . . . He advised me that he boxed CYO [Catholic Youth Organization] when he was young and that he also boxed while he was in the military.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See also Florida v. Royer, 460 U.S. 491, 503, 75 L. Ed. 2d 229, 103 S. Ct. 1319 (1983) (plurality opinion) (consensual inquiry in public place \"escalated\" into investigatory procedure in police interrogation room where \"consensual aspects of the encounter had evaporated\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Cf. Oregon v. Mathiason, 429 U.S. 492, 493-94, 50 L. Ed. 2d 714, 97 S. Ct. 711 (1977) (per curiam) (no custodial interrogation, in violation of fifth amendment, where suspect: telephoned police officer, who had left card at suspect's apartment; agreed to meet officer at state patrol office; and, once there, responded to questions after learning he was not under arrest but without receiving Miranda warnings); Calaway v. United States, 408 A.2d 1220, 1224-25 \u0026 n.8 (D.C. 1979) (no fifth amendment violation where detectives informed suspect he was not under arrest but they wanted to question him at their office; suspect agreed and made incriminating statements at police station before Miranda warnings were given).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This case presents the question of the defendant's and the government's respective burdens in going forward with evidence and, ultimately, in persuading the trial court. A defendant who files a motion to suppress \"has the burden of making a prima facie showing of illegality and demonstrating a causal connection between the illegality and the seized evidence.\" Duddles v. United States, 399 A.2d 59, 63 (D.C. 1979) (citations omitted). This means \"the defendant is obliged, in his [or her] definitive motion papers, to make factual allegations which, if established, would warrant relief (based on evidence discovered of the government and, if necessary, proffered from defendant's own view of the case).\" Id. When the defendant has done so, this will shift either the burden of production or the burden of persuasion to the government, depending on the circumstances. See Malcolm v. United States, 332 A.2d 917, 918 (D.C. 1975) (absent a warrant, burden of establishing probable cause is on government; given a warrant, burden of proving lack of probable cause or unlawful execution of warrant is on movant). We understand United States v. Mendenhall, 446 U.S. 544, 64 L. Ed. 2d 497, 100 S. Ct. 1870 (1980), and earlier Supreme Court cases to stand for the proposition that, once a defendant asserts he or she was \"seized\" or taken into \"custody\" by the police without a warrant, the burden of persuasion as to consent -- an exception to the warrant requirement -- shifts to the government.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This court's decision in Giles v. United States, 400 A.2d 1051 (D.C. 1979) provides no guidance here. In concluding that the defendant's presence at the police station was voluntary, this court did not indicate there was any evidentiary conflict at the suppression hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Dyson added that, after Ruffin had arrived at headquarters, Dyson \"advised him of his rights, that he was not under arrest at that particular time.\" By this Dyson meant that he advised Ruffin of \"rights that appear on the PD 47,\" i.e., those derived from Miranda v. Arizona, 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602 (1966), but with the words \"you are under arrest\" changed to \"you are not under arrest.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Ruffin's testimony is also susceptible to a third, albeit more speculative interpretation: that he had personally spoken to the police over the telephone, that he had relayed through his sister his willingness to \"come down to the precinct,\" and that the police accordingly had \"made arrangements\" through Ruffin's sister to meet Ruffin at his other sister's house.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Later, at trial, Detective Dyson testified that Lieutenant Alexander had telephoned the family home, unsuccessfully, in an effort to reach Ruffin. The possibility of more than one phone call from Dyson or another officer to Ruffin's residence, reaching Ruffin personally only on the second occasion, is therefore not farfetched.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In Hayes v. Florida, 470 U.S. 811, 812, 84 L. Ed. 2d 705, 105 S. Ct. 1643 (1985), the Court found \"no consent to the journey to the police station.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eArriving at petitioner's house, the officers spoke to petitioner on his front porch. When he expressed reluctance voluntarily to accompany them to the station for fingerprinting, one of the investigators explained that they would therefore arrest him. Petitioner, in the words of the investigator, then \"blurted out\" that he would rather go with the officers to the station than be arrested.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee Bumper v. North Carolina, 391 U.S. 543, 550, 20 L. Ed. 2d 797, 88 S. Ct. 1788 (1968) (search cannot be justified on basis of consent when consent has been given only after official conducting search has asserted he or she possesses a warrant).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We do not address whether Detective Dyson's testimony, before Ruffin took the stand, would have been enough to establish Ruffin's voluntary consent to come to headquarters. At the hearing on the motion to suppress, Ruffin did not ask for a ruling based on Detective Dyson's testimony alone. In any event, we conclude that, once Ruffin took the stand, followed by police testimony in rebuttal, the trial court properly considered all the evidence, not just the government's opening evidence. Cf. Hawthorne v. United States, 476 A.2d 164, 168 n.10 (D.C. 1984); Franey v. United States, 382 A.2d 1019, 1021 (D.C. 1978) (defendant who introduces evidence after denial of motion for judgment of acquittal at close of government's case thereby waives motion and cannot make that ruling subject of appellate review).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Apparently, Ms. Mendenhall was not told that she did not have to go with the officers to the office, but the fact that people respond to police requests \"without being told they are free not to respond, hardly eliminates the consensual nature of the response,\" Immigration and Naturalization Service v. Delgado, 466 U.S. 210, 216, 80 L. Ed. 2d 247, 104 S. Ct. 1758 (1984), if the totality of the circumstances indicates voluntary consent beyond \"a mere submission to a claim of lawful authority.\" Royer, 460 U.S. at 497 (plurality opinion); accord, Schneckloth v. Bustamonte, 412 U.S. 218, 233-34, 36 L. Ed. 2d 854, 93 S. Ct. 2041 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Mendenhall majority also considered circumstantial evidence: whether \"the incident would reasonably have appeared coercive\" to a 22-year-old black female who was not a high school graduate and who \"may have felt unusually threatened by the officers, who were white males.\" 446 U.S. at 558. The Court concluded that, \"while these factors were not irrelevant, [citations omitted], neither were they decisive.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Mendenhall and other cases, (supra) note 11, establish the proposition that, when there has not been a show of force by the police, a mature suspect's voluntary consent to come to headquarters may be inferred merely from a police request followed by the suspect's \"acquiescence\" if there is no evidence that the suspect resisted police authority or otherwise reasonably perceived he or she was, or would be, under arrest. When, however, a testifying defendant does allege such coercion as the basis for accompanying the police to headquarters, the logic of Haynes would have a court \"attribute significance to the failure of the State, after listening to the [defendant's] direct and explicit testimony, to attempt to contradict that crucial evidence,\" especially \"in light of the availability and willing cooperation of the policemen who, if honestly able to do so, would have readily denied the defendant's claims.\" 373 U.S. at 510. This point is telling. We do not believe a trial court's mere perception that a defendant's unimpeached, though uncorroborated, testimony is incredible should be enough to defeat a claim of coercion to accompany the police to the precinct for questioning when (1) the government has the burden of persuasion, (2) there is no evidence either that the police have told the defendant he or she is free to decline the request, or that the defendant clearly understands he or she may do so, and (3) the prosecutor has not called available rebuttal witnesses to refute the defendant's assertions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. One can only speculate as to why the prosecutor and defense counsel declined to examine or cross-examine the police officers and Ruffin about what, if anything, Ruffin had said when asked to come to headquarters voluntarily. nor is it clear why the prosecutor declined to recall Detective Dyson to rebut Ruffin's bench warrant testimony. A likely explanation is that both lawyers feared the answers would be harmful to their respective positions. As a result, we lack important, relevant information. The government, having the burden of proof, took the greater risk if the court were to credit uncontradicted defense testimony which the government was in a position to undermine through its own witnesses but elected to ignore.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe trial court, in the interest of finding the truth, should step in to clarify the situation after both counsel have so obviously avoided an undoubtedly relevant, indeed critical, question. See Womack v. United States, 350 A.2d 381, 382-83 (D.C. 1976). In such circumstances, the trial court's absolute deference to the adversary system permits counsel for both sides to dance around the truth in a criminal case. When that happens, the trial court is entitled, and perhaps even obligated, to perform an inquisitorial role. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Because a police officer does not know what a suspect, who is asked to come to the police station for questioning, is likely to say at a suppression hearing, the officer who confronts a complaint suspect may, as a practical matter, have to make sure that the suspect knows he or she is not under arrest at the time the officer makes the request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In the government's case-in-chief, Detective Dyson had merely answered \"not to my knowledge\" when asked whether Ruffin had come to headquarters in handcuffs. In rebuttal, it became apparent that Detective Muse's uncertainty about whether Ruffin had been handcuffed related to the period after Ruffin had given his oral statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The fact that Ruffin did not sign a written waiver of his Miranda rights before giving his oral statement is therefore irrelevant and, in any event, would not be dispositive of a suppression motion even if Ruffin had been in custody. See Walden v. United States, 351 A.2d 515, 517 (D.C. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The fact that Ruffin had given an oral statement to Detective Dyson before his interchange with Detective Muse, coupled with Ruffin's equivocal request for counsel, does not affect our analysis, for \"the mere fact that he may have answered some questions or volunteered some statements on his own does not deprive him of the right to refrain from answering any further inquiries until he has consulted with an attorney and thereafter consents to be questioned.\" Miranda, 384 U.S. at 445.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The pertinent language in Miranda, construed in Edwards, is the following:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[If the defendant] indicates in any manner and at any stage of the process that he [or she] wishes to consult with an attorney before speaking there can be no questioning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e384 U.S. at 444-45. In Fare v. Michael C., 442 U.S. 707, 719, 61 L. Ed. 2d 197, 99 S. Ct. 2560 (1979), the Court called this rule a \"rigid\" one, noting that under Miranda \"an accused's request for an attorney is per se an invocation of his Fifth Amendment rights, requiring that all interrogation cease.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The government contends that Ruffin did not claim in the trial court that his seized clothing should be suppressed and cannot raise the issue now. Irby v. United States, 342 A.2d 33, 40 (D.C. 1975); Anderson v. United States, 326 A.2d 807, 810 (D.C. 1974), cert. denied, 420 U.S. 978, 43 L. Ed. 2d 659, 95 S. Ct. 1405 (1975); D.C. Code ยง 23-104(a)(2) (1981); Super. Ct. Crim. R. 12(b)(3). The government maintains it therefore did not introduce any evidence to show Ruffin had consented to the seizure of his clothes when he had been at the homicide office for approximately four hours. At the suppression hearing defense counsel urged the court to suppress all the evidence secured by the police at the homicide office. The trial court announced that it would treat the motion to suppress as encompassing Ruffin's statements as well as the physical objects. The court also referred to the clothing in its decision to admit all the evidence against Ruffin. The government did not object to seek reconsideration. Before trial, new defense counsel announced that he would renew the motion to suppress but in broader terms than the motion filed by prior counsel. Accordingly, we disagree with the government's contention that the issue was not raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The trial court found that Ruffin had consented to the seizure. This court may affirm the denial of a motion to suppress which is correct as a matter of law on another ground. Duddles v. United States, 399 A.2d 59, 64 (D.C. 1979). We do not reach the question of whether the exclusionary rule applies to \"fruits\" of a Miranda violation. Derrington v. United States, 488 A.2d 1314, 1330 and n.21 (D.C. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. According to Detective Dyson, Ruffin told him that after he had heard his sister had been raped by Wilson, he had found Wilson in his sister's apartment house. He asked Wilson to come back to the apartment to talk things over. Wilson responded by attempting to kick him, and he blocked the kick and proceeded to defend himself. The interchange that followed is set forth (supra) in note 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Ruffin was arrested on an arrest warrant days after he left the homicide office. The fruits of the search were not necessary to support probable cause to arrest him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The co-defendant, Shaw, had told Ruffin to wipe the blood off his shoes, and he had tried to do so. See supra Part I and (infra) Part VI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Shaw's sister also testified that she thought Wilson was using PCP, and that later that day Ruffin, as he was leaving the police station, had said \"He lucky the nigger ain't dead.\" See also infra note 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See (supra) note 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The government's witnesses testified that Wilson had been put out of Ruffin's sister's apartment without his coat or shoes although it was a very cold night. Ruffin did not deny that Wilson was barefoot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In his written statement, Ruffin claimed that as he approached Wilson, Wilson had tried to push him down the hallway stairs and then tried to punch him. Ruffin blocked the punch, and hit Wilson \"with a left-right combination to both sides of his face.\" Wilson fell and tried to grab Ruffin's feet and push him down the stairs. Ruffin explained that he started kicking Wilson to keep from being pushed down the steps. He kicked him \"once with a full house and two straight down stomps.\" Admitting that he \"did a job on him,\" and had probably kicked him around the forehead, mouth and nose, Ruffin claimed that when he last saw Wilson he was still conscious. Ruffin saw a lot of blood, and had tried unsuccessfully to wipe the blood off his shoes. He also said that he had waited in the hallway until the police arrived and told him to leave. Ruffin also claimed that he had stopped kicking Wilson when someone said \"It's not worth it,\" and denied that he was doing anything more than defending himself; he viewed his actions as teaching Wilson a lesson, that \"you can't keep going around mistreating people and expect nothing to happen.\" Ruffin admitted he did not get along with Wilson, who he thought was just another one of them \"herb smoking Street Niggers,\" and that he had boxed and taken karate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Ruffin also took issue with various non-essential details in his written statement, such as in whose car his sister was sitting before al altercation with the decedent, whether he knew karate terms, and whether he had known Shaw for eight or ten years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Ruffin testified that as he and Mitchell were on their way back to the apartment, they met Shaw who told them to go back to the apartment and went upstairs himself. Ruffin then heard, as he was turning the corridor of the steps, \"some loud thumping\" coming from upstairs, \"like someone being hit.\" He turned and saw Shaw hitting Wilson with the butt of a gun and kicking him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In analyzing whether the error was harmless, our Dissenting colleague relies on Supreme Court decisions concerning coerced confessions obtained under circumstances totally different from those here. Moreover, in concluding that the prosecutor relied heavily, and apparently in the Dissent's view exclusively, on Ruffin's written statement, our colleague has ignored Ruffin's oral statement and other evidence of Ruffin's attitude toward Wilson on the night/morning of the assault.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 I concur in the reversal of Ruffin's mayhem conviction and the affirmance of co-defendant Shaw's accessory after the fact conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Apart from misciting Chapman, the majority relies upon one other Supreme Court authority, Milton v. Wainwright, 407 U.S. 371, 33 L. Ed. 2d 1, 92 S. Ct. 2174 (1972), to support its Conclusion that harmless error theory may be applied to the introduction of a coerced confession. Milton has little, if any, relevance to this case. That decision involved a confession challenged in a proceeding -- a confession obtained prior to the Miranda decision outlining the Fifth Amendment requirements for custodial interrogation; the Milton confession was also characterized by the state courts as \"voluntary\" without contradiction by the United States Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The involuntary, inadmissible, written confession is set forth in Appendix A to this Dissent. The central role it played in the trial is summarized in Appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 If accepted, the self-defense claim would have required acquittal. On this issue, it is noteworthy that nobody, apart from Ruffin himself, witnessed the opening stages of Ruffin's struggle with the victim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 If accepted, the adequate provocation claim would have reduced Ruffin's second-degree murder conviction to voluntary manslaughter. Fifteen years is the maximum term of imprisonment for voluntary manslaughter; Ruffin was sentenced to ten years to life for his second-degree murder conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The majority cryptically refers to \"other evidence\" of Ruffin's attitude towards the victim; nowhere does it indicate what that evidence is. Majority opinion, ante at note 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The authorities cited for this proposition, Hawthorne v. United States, 476 A.2d 164, 168 n.10 (D.C. 1984), and Franey v. United States, 382 A.2d 1019 (D.C. 1978), are not on point. In Franey, the defendant was prosecuted for burglary, and the prosecution had no direct evidence that he was present at the scene of the crime, only that he was found in an alley nearby with fruits of the crime. As part of his case, the defendant admitted that he had been at the scene but stated that he had a good reason for being there. We held that, in assessing the sufficiency of the evidence to sustain the conviction, the defendant's admission could be taken into account. Hawthorne held the same. The settings of these cases are totally unrelated to the present one. Even if they were not, those defendants provided affirmative evidence of guilt, whereas Ruffin provided no affirmative evidence of voluntariness. The relevance of Hawthorne and Franey to this case is therefore difficult to discern.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Even operating within the framework created by the majority, the government did not meet its burden to show consent. Ruffin testified that he accompanied the police to the station because he believed that a bench warrant had been or would otherwise be issued for his arrest. He stated that he received this information from his sister, who had spoken to someone at the police station. No rebuttal was ever offered to Ruffin's testimony that the police had made reference to a bench warrant. The majority states that by testifying that Ruffin was not handcuffed, the two officers who picked him up -- Brown and Williams -- allow this court to find voluntariness: \"[Ruffin's] lying about handcuffs cast doubt on the very premise of his coercion testimony: that he had heard from police through his sister about an arrest warrant.\" Majority opinion, ante at 28. But under Hawthorne and Franey, since there too the burden of proof lies on the government, this means that a defendant whose testimony is incredible could be convicted even though the record is barren of sufficient evidence that he or she has committed a crime!\u003c/span\u003e\n\n",
    "body_length": 145315,
    "citedas": [
      "524 A.2d 685"
    ],
    "attorneys": "Bruce Kleinman for appellant Antone D. Ruffin. Martin S. Echter for appellant James R. Shaw. Kenneth J. Melilli, Assistant United States Attorney, with whom Joseph E. diGenova, United States Attorney, and Michael W. Farrell, Assistant United States Attorney, were on the brief, for appellee.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Mack, Ferren and Rogers, Associate Judges.",
    "citation_count": 21
  }
}
