{
  "id": "Sc_5YWYBTlTomsSBO0Nv",
  "document": {
    "title": "State v. Campbell County School District",
    "full_title": "STATE OF WYOMING, ET AL. (DEFENDANTS), v. CAMPBELL COUNTY SCHOOL DISTRICT, ET AL. (PLAINTIFFS). CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING, ET AL. (PLAINTIFFS/ INTERVENING ), v. STATE OF WYOMING, ET AL. (DEFENDANTS). BIG HORN COUNTY SCHOOL DISTRICT NO. ONE, STATE OF WYOMING, ET AL. (INTERVENING ), v. CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING, ET AL. (PLAINTIFFS). STATE OF WYOMING, ET AL. (DEFENDANTS), v. CAMPBELL COUNTY SCHOOL DISTRICT, STATE OF WYOMING, ET AL. (PLAINTIFFS).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "2001-02-23T00:00:00.000Z",
    "docket": "No. 00-120,, No. 00-121,, No. 00-122,, No. 00-123",
    "body": "As amended March 16, 2001\n\nAppeals from the District Court of Laramie County The Honorable Nicholas G. Kalokathis, Judge\n\n[¶1] The school districts and the Wyoming Education Association (WEA) in these cases challenge the constitutionality of the Wyoming statutes which establish the method for financing the operation and construction of public schools. This court reluctantly concludes that, while great effort has been made by many and some improvement has been achieved, the constitutional mandate for a fair, complete, and equal education \"appropriate for the times\" in Wyoming has not been fully met. Although these cases were not formally consolidated, we are issuing one opinion because the legal analyses and conclusions apply similarly to the issues raised in all the cases. A single opinion will provide clarity and consistency in this court's direction to the legislative and executive branches of our state's government as those branches continue to work toward a constitutionally acceptable school financing system for Wyoming's youth.\n\n[¶2] As will be more fully developed in the course of this opinion, we hold:\n\n• The cost-based model approach chosen by the legislature which relies upon past statewide average expenditures is capable of supporting a constitutional school finance system.\n\n• The funding legislation must be modified as follows, on or before July 1, 2002, in order to provide a constitutionally adequate education appropriate for our times:\n\n• The model and statute must be adjusted for inflation each biennium, with 1996-97 as the base year, utilizing the Wyoming cost-of-living index (WCLI), beginning in 2002-03, so long as a cost of education model using historic costs is relied upon for the basis of education funding. The legislature shall conduct a review of all components of the model in 2001 and every five years thereafter to assure it remains an accurate reflection of the cost of education.\n\n• Administrative and classified salaries must be adjusted to account for differences in experience, responsibility, and seniority.\n\n• Cost of maintenance and operation, including utility costs, must be determined by either development of a formula which uses enrollment measured by ADM, building square footage, and number of buildings in the district or actual costs fully reimbursed, subject to state oversight.\n\n• Pending future development of an accurate formula with which to distribute adequate funds, actual and necessary costs of educating economically disadvantaged youth and limited English speaking students shall be fully funded, subject to state oversight.\n\n• The costs of providing teachers and equipment for vocational and technical training must be included as line items in the MAP model and funded accordingly.\n\n• Any small school adjustment must be based on actual differences in costs which are not experienced by larger schools.\n\n• Any small school district adjustment must be based on documented shortfalls under the MAP model that are not equally suffered by larger districts.\n\n• Statewide average costs must be adjusted for cost-of living differences using either the entire WCLI or another reasonable formula which includes a full housing component, including the rental of shelter costs, and a medical component to cover costs not included in the benefits portion of the salary component.\n\n• Kindergarten Error - The legislature, on or before July 1, 2002, shall provide a one-time supplement to fully fund each school district's 1998-99 kindergarten component cost in the total aggregate amount of the $13,930,000 funding error.\n\n• Capital Construction - The legislature must fund the facilities deemed required by the state for the delivery of the \"full basket\" to Wyoming students in all locations throughout the state through either a statewide tax or other revenue raising mechanisms equally imposed on all taxpayers.\n\n• Capital Construction - All facilities must be safe and efficient. Safe and efficient facilities are those that attain a score of 90 or above for building condition, an educational suitability score and technological readiness score of 80 or above, and a score of 4 for building accessibility. The total cost of compliance is $563,099,986. The legislature must provide a plan by July 1, 2002, to remedy these deficiencies within 6 years. \"Immediate need\" facilities and those facilities that fall below the square footage requirements must be remedied within two years which computes to $164,415,836. Facilities that are deemed \"inadequate\" must be remedied within four years which computes to $231,309,380. These amounts are measured in 1998 dollars which will need to be adjusted for inflation at such time as t he funding is distributed.\n\nISSUES\n\n[¶3] The issues raised by all the parties are summarized as follows:\n\n1. Is the cost-based block grant model a constitutionally adequate tool?\n\n2. Were the inputs and adjustments cost-based?\n\n3. Do the statutes governing capital construction provide a constitutional means to achieve capital construction funding?\n\nFACTS\n\n[¶4] The battle over the school finance system in Wyoming has been waged since the l970s and continues today. Our collective inability to develop a solution to this legal, social, and political problem in a constitutionally satisfactory manner stems from the complexity of the issues, the importance of the education of our children to all our citizens, and the historical dominance of local control over public education. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Over the years, public education has been funded primarily by local property taxes with growing state general fund appropriations and some federal funding. By the l970s, the discrepancy in the level of funding across the state was striking. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Sweetwater County Planning Committee for Organization of School Districts v. Hinkle, 491 P.2d 1234, 1237 (Wyo. 1971). We recognized these inequities thirty years ago in Hinkle, which involved two school districts fighting over inclusion of the Bairoil school district in their districts in order to enhance their tax bases. Noting that such inequities were unconstitutional, this court stated:\n\nIf ad valorem taxes for school purposes were equalized throughout the state, as required by Art. 1, § 28, Wyoming Constitution, and by the equal protection clause of the Fourteenth Amendment to the United States Constitution, cases such as the one being dealt with would not arise. 491 P.2d at 1236-37 (footnote omitted).\n\n[¶5] As long ago as Hinkle, this court reluctantly made suggestions to the legislature of ways in which the constitutional problems could be addressed by a statewide financing system. Almost ten years passed without improvement. By l980, the situation was actually worse, and this court declared the entire school finance system unconstitutional in Washakie County School District Number One v. Herschler, 606 P.2d 310 (Wyo. 1980). That decision concurred with Hinkle in holding that disparities were dramatic and a system based principally upon local property taxes, whereby property poor districts have less total revenue per student than property rich districts, fails to afford equal protection in violation of the state constitution. Washakie further determined that education was a fundamental right under the Wyoming Constitution and wealth based classifications with regard to this right were subject to the strict scrutiny test, which placed the burden on the state to prove a compelling state interest is served by the classification that cannot be satisfied by any other convenient legal structure. The court expressly held, \"whatever system is adopted by the legislature, it must not create a level of spending which is a function of wealth other than the wealth of the state as a whole.\" Washakie, 606 P.2d at 336.\n\n[¶6] Although Washakie was focused on operational financing, the holding was equally applicable to capital construction.\n\nWe see no reason to give particular attention to the question of finances for the physical facilities with which to carry on the process of education. It is a part of the total educational package and tarred with the same brush of disparate tax resources. The only constitutional limitation with respect to school buildings is found in § 5, Art. XVI, Wyoming Constitution, wherein it is provided that \"No school district shall in any manner create any indebtedness exceeding ten per cent (10%) on the assessed value of the taxable property therein for the purpose of acquiring land, erection, enlarging and equipping of school buildings.\" There is no constitutional requirement that school buildings must be built by creation of debt. There are other areas of consideration, for example, a statewide reserve fund for building construction. The point is that statewide availability from total state resources for building construction or contribution to school buildings on a parity for all school districts is required just as for other elements of the educational process. The legislature has worked in that direction. See §§ 21-15-101, et seq., W.S.1977, providing for school district capital construction entitlements. 606 P.2d at 337.\n\n[¶7] In 1983, the legislature took action in response to Washakie and created a system which provided, in part, for the recapture from the districts with higher than average tax revenue and redistribution of some portion of that excess to districts with lower than average revenues. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e That legislation was intended to be transitional while the legislature studied the cost of education in an attempt to achieve equality among the districts, recognizing their special needs. Campbell County School District v. State, 907 P.2d 1238, 1247 (Wyo. 1995). However, the 1983 system became permanent, and no cost study was ever undertaken. Id.\n\n[¶8] Twelve years later, failing to achieve a legislative solution to the continued inequities in funding, the school districts again came to this court. The result was Campbell, 907 P.2d 1238, in which this court held, in part: 1) discrepancies in the funding and distribution formulas were not based on differences in the cost of education and, therefore, violated the equal protection and education provisions of the Wyoming Constitution; 2) the strict scrutiny standard applied to a review of all components of the school financing system; and 3) lack of financial resources is not an acceptable reason for failure to provide a constitutionally sound education system.\n\n[¶9] With respect to capital construction financing, the court again made no distinction concerning the constitutional mandate. The court noted its directive in Washakie, which provided \"statewide availability from total state resources for building construction . . . on a parity for all school districts,\" had been \"virtually ignored.\" Campbell, 907 P.2d at 1275. The court further held that \"[s]afe and efficient physical facilities . . . are a necessary element of the total educational process. State funds must be readily available for those needs.\" Id. The finance system for capital facilities construction was included in Campbell's finding of unconstitutionality.\n\n[¶10] The court rejected the claim that a judicial determination of the nature and extent of the constitutional right to a quality education violates the separation of powers doctrine and concluded its proper role is to interpret the constitution \"in order to determine the duties those provisions impose upon the legislature.\" 907 P.2d at 1265. Accordingly, having determined the 1983 statutory scheme to be unconstitutional, this court directed the legislature to\n\nfirst design the best educational system by identifying the \"proper\" educational package each Wyoming student is entitled to have whether she lives in Laramie or in Sundance. The cost of that educational package must then be determined and the legislature must then take the necessary action to fund that package. Because education is one of the state's most important functions, lack of financial resources will not be an acceptable reason for failure to provide the best educational system. All other financial considerations must yield until education is funded. 907 P.2d at 1279.\n\nThe court provided a deadline of July 1, l997, by which the legislature should accomplish its directive. 907 P.2d at 1280.\n\nI. Operational Financing\n\n[¶11] The legislature began immediately to respond to the Campbell decision. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e It retained the services of Management Analysis \u0026 Planning Associates, L.L.C. (MAP), a well recognized and credentialed consulting firm with expertise in public school finance, to assist in developing a school operation financing system which would meet the constitutional standard established by this court. MAP's task was to develop a revenue distribution model which would assure adequate resources were distributed to provide a proper education for every Wyoming child based on the cost of education. It chose a block grant model to preserve as much local control as possible. The concept was that the model would produce the cost per average daily membership (ADM) and that cost would then be multiplied by an individual district's ADM to determine that district's allocation of funds. The first step was to identify the educational mission Wyoming had chosen, which came to be called the \"basket of goods and services,\" that must be available to all Wyoming school children and which the legislature codified as a list of core knowledge and skill areas. Wyo. Stat. Ann. § 21-9-101(b) (LEXIS 1999). The second step was to identify the instructional components necessary to deliver the prescribed goods and services. In the third step, MAP was to determine the cost of the various components required, and the final step was the development of any adjustments which would be necessary for particular districts or students.\n\n[¶12] To determine the components of the delivery system, MAP relied upon professional literature, advice from professional associations, effective practices in other states, the professional judgment of groups of expert Wyoming educators randomly selected from various sized schools and school districts, and its own professional judgment. From all this information, MAP developed prototypical model schools capable of delivering the \"basket\" of educational goods and services required by the legislature. These model schools were to be the tools necessary to calculate the per pupil cost of educating Wyoming students.\n\n[¶13] MAP then set out to accomplish the most difficult part of its task - determining the cost of providing the various components of the delivery system. It attempted to determine what providing the \"basket of goods and services\" should cost a school district in Wyoming. Over 80 percent of the school district costs are for personnel, primarily classroom teachers. To determine what it should cost to provide those classroom teachers, MAP looked at the counties where the greatest competition existed for professional jobs, Albany and Laramie. Teacher salaries in those counties were slightly lower than the statewide average. MAP chose the higher statewide average of $20,573 as the starting teacher salary for the model. Statewide average increases for advanced education and greater experience were then added to the beginning salary for a total prototype salary of $31,758. The average salary figures used by MAP were based upon the 1996-97 \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e school year.\n\n[¶14] The MAP study was presented to the legislature in 1997 with four computer simulations of various funding scenarios including Example 3 (MAP 3) which was the result of consultation with the Wyoming experts concerning class size and the required number of teachers. MAP 3 was not funded by the legislature, and to do so would have cost an additional $75,000,000. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The budget actually adopted by the legislature resulted in fewer teachers and larger classrooms for middle and high schools than provided for in the MAP 3 model.\n\n[¶15] Following the 1997 legislative session, various school districts and the Wyoming Education Association (WEA) filed suit challenging the constitutionality of the legislature's actions. The trial court held the MAP model was based on a valid cost of education study and the state carried its burden to prove the level of funding for elementary schools was adequate to deliver the required educational goods and services to those schools. However, the court expressed concerns that numerous technical adjustments contained in the model were not cost-based. In addition, the court concluded the state had failed to carry its burden of proof that funding for the middle and high schools was adequate to deliver the required \"basket.\" Consequently, the court found the system, in part, unconstitutional. The court, in recognition of the legislature's continuing work, reserved ruling on several issues including capital construction, which was not included in the MAP effort, pending the 1998 special and budget legislative session. The deadline for the completion of the capital construction portion of the financing system was extended to July 1, 1999.\n\n[¶16] Additional legislation was enacted during the 1998 special and budget legislative session which addressed the budget for middle and high schools, the small school adjustment, and other technical adjustments. A second trial commenced, which was in essence a continuation of the first, with most of the same parties involved. A coalition of small school districts, satisfied with the legislature's actions, had reached a settlement with the state.\n\n[¶17] Following the trial court's initial 1997 finding that the funding for the middle and high schools failed to meet the constitutional standard for providing the necessary funding for the full \"basket\" as determined by the legislature, two developments occurred. First, the legislature increased funding for middle schools from $5,770/ADM to $6,174/ADM and for high schools from $6,050/ADM to $6,405/ADM. See Wyo. Stat. Ann. § 21-13-309(m)(ii) (LEXIS Supp. 2000); 1997 Wyo. Spec. Sess. Laws ch. 3, § 303; 1998 Wyo. Sess. Laws ch. 2, § 701; 1999 Wyo. Sess. Laws ch. 110, § 102. This resulted in slightly more teachers and smaller class sizes than the 1997 legislation. However, the class size remained larger, and the number of teachers remained smaller, than MAP 3.\n\n[¶18] Second, the legislature conducted the Wyoming Education Funding Adequacy Study in March 1998 in an effort to demonstrate the funding was adequate. A panel of professional educators from around the region was selected, specifically excluding any Wyoming educators. The educators were divided into teams and generally asked to review the resources contained in MAP 3, the 1997 legislation funding (HEA 2), and the 1998 legislation funding (SEA 2) to determine if the basket could be successfully delivered to every student. The teams were told to make numerous factual assumptions including the assumption that salaries were adequate to attract and retain qualified faculty. All the teams concluded that each of the resource levels provided adequate funds to deliver \"the basket.\" Importantly, however, they uniformly manipulated the models to add funds in some categories at the expense of others and decreased class sizes by adding additional teachers to the models. The same exercise was conducted in 1999 to consider the increased funding provided by the legislature that year, with the same result.\n\n[¶19] As additional evidence of the adequacy of funding, the state argued the districts that were litigating were also fully accredited under the existing financing. There was conflicting testimony by those districts whether they individually believed they were fully providing the \"basket of goods and services\" with existing financing.\n\n[¶20] After the second trial, the trial court concluded the constitution and the ruling in Campbell did \"not demand perfection, but only that the level of funding be reasonably calculated to deliver an adequate education to students regardless of location.\" After considering all the evidence, the court found in general that \"the State has met its burden of proving that the revised school funding system is adequate to provide the basket of educational goods and services to Wyoming's students.\" With regard to the technical issues and adjustments, the trial court approved of some and held others unconstitutional. Those remaining before this court on appeal include:\n\n1. Kindergarten Error\n\n[¶21] Both the MAP model and the funding legislation for the 1998-99 school year contained an error in the ADM calculation for kindergarten students. Kindergarten students were counted as full ADMs rather than one-half ADMs, which had the effect of reduced funding. That error was corrected in the 1999 budget. Wyo. Stat. Ann. § 21-13-309(m)(i), (p), (s) (LEXIS Supp. 2000). The school districts claim they were entitled to reimbursement for the amount they should have received during the 1998-99 school year had kindergarten students been properly included in the calculation. The trial court held that, absent proof the shortcoming impacted the school districts' ability to deliver the \"basket,\" their claim was denied.\n\n2. External Cost Adjustment \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n[¶22] The MAP models used cost data based on the 1996-97 school year. The school districts contend the model was outdated from the beginning, and the state contends other inclusions in the budget, which were not required by the cost-based model, offset any shortcoming. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n[¶23] Since the model is based on data from past years, the trial court recognized inflationary cost increases will, at some point, cause funding levels to become unconstitutionally inadequate. The legislature addressed this problem in Wyo. Stat. Ann. § 21-13-309(r) (LEXIS Supp. 2000), which provides:\n\n(r) The joint appropriations interim committee shall submit a recommendation to the legislature and governor, not later than November 1 of each year, regarding whether an external cost adjustment should be made, and if so, the amount of the adjustment.\n\nNeither the legislature nor the governor is required to act on such a recommendation. The joint appropriations interim committee recommended that the school finance formula for school year 2000-2001 be adjusted 1.3 percent for new inflation. The adjustment was adopted pursuant to Wyo. Stat. Ann. § 21-13-309(o)(i)(A) (LEXIS Supp. 2000), but the provision specifically excluded any inflation adjustment for the years preceding the 2000-2001 school year. See § 21-13-309(o)(i)(A)(II). The trial court recognized that at some point the failure to adjust for inflation would cause schools to be unable to deliver the full \"basket,\" but concluded that point had not yet been reached.\n\n3. Small School Adjustment\n\n[¶24] All parties agreed some type of small school adjustment is warranted because small schools face higher fixed costs per ADM than larger schools and cannot take advantage of economies of scale assumed in the model. In the 1997 process of developing the prototypes, MAP recommended a graduated adjustment because the marginal costs decline with the increase in students. For example, as students are added to a base of 30 for elementary schools, the cost of providing an adequate education declined from approximately $9,000 per ADM to approximately $6,000. These adjustments are made for elementary schools (K-8) of 200 or less and high schools (9-12) of 400 or less. In these small schools, additional adjustments are provided to fully reimburse the actual costs of student activities, food services, and utilities. The trial court concluded the evidence did not support the state's position that these adjustments were based upon actual cost differences, the legislature had consistently ignored its own experts on this point, and the small school adjustment was unconstitutional. Although the trial court agreed a small school adjustment is necessary to assure equality in education despite school size, it held such adjustments must reflect actual additional costs.\n\n4. Small School District Adjustment\n\n[¶25] Neither the original MAP report nor the 1997 legislation provided for a small school district adjustment, and the MAP expert testified such an adjustment was not justified by the data. However, prior to the 1999 legislative session, the small school districts proposed adjustments (known as the \"small school settlement\") in exchange for their withdrawal from the litigation. After modification by MAP experts, the proposal, ultimately adopted by the legislature, provided adjustments for small school districts which were defined as those with 1,350 ADM or less. Wyo. Stat. Ann. § 21-13-328(a) (LEXIS 1999). Qualifying districts receive $50,000 for each attendance center in addition to the one in which the district office is located. Wyo. Stat. Ann. § 21-13-328(b) (LEXIS 1999). For districts with less than 900 ADM, an additional amount is provided for administration and additional funds are provided for maintenance and operations costs for districts with fewer than 1,100 ADM. Wyo. Stat. Ann. § 21-13-328(c), (d) (LEXIS 1999). The trial court determined that the state did not establish these adjustments were cost-based.\n\n5. Funding for Special Needs Students\n\n[¶26] The 1999 legislation made adjustments allowing additional funds based on a concentration of certain special needs students in a district. The challengers claim that these adjustments are not cost-based and consequently result in either underfunding or no funding at all the actual costs of educating these students.\n\na. Limited English Speaking Students - Wyo. Stat. Ann. § 21-13-325 (LEXIS 1999)\n\n[¶27] If a district has a concentration of limited English speaking students equal to or in excess of 5 percent of its total ADM, it receives 15 percent more funding than the model provides for that grade level for each identified student. No evidence was provided to indicate what additional costs are actually incurred due to higher concentrations of limited English speaking students.\n\nb. Economically Disadvantaged Students - Wyo. Stat. Ann. § 21-13-322 (LEXIS 1999)\n\n[¶28] If a district has economically disadvantaged students (measured by those enrolling in the federally subsidized lunch program) in excess of 150 percent of the statewide average, it receives $500 per economically disadvantaged student. The challengers contend the enrollment is not an accurate measurement of economically disadvantaged students, particularly at the middle and high school levels, the 150% trigger is arbitrary, and the additional $500 per student funding was not cost-based.\n\nc. Gifted and Talented Students\n\n[¶29] No specific adjustment was made for gifted and talented students. MAP contended the model adequately provided funds for those students by assuming that 3 percent of the student population is gifted and providing an additional $9 per ADM.\n\n[¶30] The trial court found, while none of these adjustments was based on actual cost data, they were the product of professional judgment and, as such, were adequate. The court also relied upon MAP's contention that the small class size in its model would allow the flexibility to deal with these special needs students as well as behaviorally disordered students.\n\n6. Seniority Adjustment\n\n[¶31] Wyo. Stat. Ann. § 21-13-323 (LEXIS 1999) provides an adjustment for teacher seniority based on the aggregate years of experience the teachers in the district have for the prior school year multiplied by the statewide average annual increase in salary for the designated base year of 1996-97. The school districts contend this adjustment does not reflect the actual cost for the district, which is correct. However, the trial court concluded that every district was treated the same and subjected to the same fiscal controls and the seniority adjustment did not violate the constitutional restrictions.\n\n[¶32] No adjustments are made for seniority for classified and administrative staff. The trial court concluded these items should be dealt with like all components which will experience inflation, recognizing at some point unadjusted funding will prevent the districts from fulfilling the constitutional mandate but that point had not yet been reached.\n\n7. Regional Cost Adjustment\n\n[¶33] Pursuant to MAP's recommendation, the legislature provided a regional cost-of-living adjustment to be applied to the model. Wyo. Stat. Ann. § 21-13-309(o)(ii) (LEXIS Supp. 2000), provides as follows:\n\n(ii) The amount, after the adjustment under paragraph (o)(i) of this subsection has been made, shall be further adjusted for regional cost of living differences. The adjustment for regional cost of living differences shall be based upon the Wyoming cost-of-living index, with the medical component omitted and with the housing component included but modified by excluding the price for rental of shelter subcomponent, as computed by the division of economic analysis, department of administration and information under rules promulgated by it with respect to the methodology under which the index shall be computed. The version of the index used shall be the average of the six (6) consecutive semi-annual index reports completed by January 1 prior to the school year for which it is to be used.\n\nThe statute is based on the WCLI which provides data on 140 commodities throughout the state weighted based on the percentage of individual income spent on the item. Housing represents 40.9 percent, and the shelter portion of the housing component is over 30 percent, of the total 100 percent. MAP recommended removing the rental of shelter and medical portion of the index. It rationalized that, if housing were more expensive, districts would be located where other amenities exist and a full housing adjustment would overcompensate teachers. The medical costs were excluded from the index because monies to cover health insurance costs were included in the salary/benefits component of the model. The trial court disagreed and concluded that regional cost-of-living adjustments were appropriate but the modified index was inappropriate, did not accurately reflect the actual disparity in the cost of hiring teachers in various locations throughout the state, and was unconstitutional.\n\n8. Special Education and Transportation\n\n[¶34] In 1999, the legislature provided an adjustment of the cost of special education and transportation, which reimbursed the districts for 100 percent of the amount actually expended during the previous school year. Wyo. Stat. Ann. § 21-13-321(b) (LEXIS 1999). However, if the ratio of special education or transportation spending to total district spending increases, the state reduces the funding by \"the excess which is over one hundred percent (100%) but less than one hundred ten percent (110%).\" Section 21-13-321(b)(ii)(C). That reduction is then refunded to the districts during the succeeding year if the Department of Education (DOE) \"finds those excess expenditures were necessary to provide essential special education services for the school year in which they occurred.\" Section 21-13-321(b)(ii)(D). The court concluded this approach was acceptable even though it did not provide full reimbursement in the same year and found \"administrative oversight does not constitute a penalty. Nor does the delay deprive the district of the ability to deliver the basket to special education students.\"\n\n9. Other Adjustments\n\n[¶35] The school districts also complain there were no adjustments for the actual cost of vocational and technical education, extra-duty pay, additional education for certified personnel, and routine maintenance. Again, the trial court found these items were either considered in the development of the model or were not significant enough to result in a district's inability to deliver the \"basket of goods and services.\"\n\n[¶36] In conclusion, the trial court found the small school adjustment, the small school district adjustment, and the regional cost-of-living adjustment unconstitutional and the balance of the 1999 revised school finance system constitutional.\n\nII. Capital Construction\n\n[¶37] The legislature finally enacted legislation in the 1999 general session regarding the financing of capital construction of school facilities. In the 1999 trial, two school districts \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and the WEA challenged the constitutionality of the statutory system for financing capital construction. The trial court granted judgment for the plaintiffs at the close of the state's case and found the system unconstitutional.\n\n[¶38] The primary source of revenue for major capital facilities renovation and construction is the sale of bonds paid for out of mills levied against a school district's assessed valuation. The Wyoming Constitution prohibits a school district from bonding beyond 10 percent of the assessed value of the school district. Wyo. Const. art. 16, § 5. Prior to Campbell, the statutes provided two mechanisms to assist counties with low assessed valuations in financing needed school facilities. First, a mill levy supplement program allowed the \"equalization\" of mills after two mills were levied. The result was that any additional mills were equalized to the level of 100 percent of the statewide average per ADM. No one contends that this provision enhanced the funds available to the poorer counties. The provision only allowed districts to pay off their bonds more quickly and thereby eased the effect of the constitutional limit. Second, the state had a grant fund to provide to needy districts so long as they had reached 80 percent of their bonding capacity. However, those funds were often diverted into the foundation program and were wholly insufficient to address the needs. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Despite those two provisions, the court in Campbell found the system unconstitutional.\n\n[¶39] In 1999, the legislature responded to Campbell by continuing the mill levy supplement program and revising the grant program. Districts must now reach 90 percent of their bonding capacity and demonstrate that the proposed capital construction projects will remedy or replace facilities which have been determined to be not only \"inadequate\" but also \"in need of immediate capital construction.\" Wyo. Stat. Ann. § 21-15-111(c), (e) (LEXIS 1999). Districts with sufficient local wealth can construct capital facilities without meeting the definition of \"inadequate\" or \"immediate need.\" The statute also required the DOE to adopt regulations setting certain standards for capital facilities, conduct an assessment of capital construction needs, and define \"deficient facilities.\" Wyo. Stat. Ann. §21-15-107 (LEXIS 1999). If a facility is deemed \"inadequate\" and \"in immediate need,\" the DOE reports the same to two legislative committees which must make recommendations to the governor and the legislature who then may or may not act to appropriate funds. Section 21-15-107(h), (k). The trial court held this system did not address the constitutional infirmities struck down in Campbell.\n\nSubmission Subsequent to Oral Argument\n\n[¶40] Subsequent to oral argument, the state submitted a memo discussing Article 15, Section 17 of the Wyoming Constitution as \"additional authority\" to address information it quotes from the Legislative Service Office. The challengers responded and claimed this was an attempt by the state to present additional evidence rather than additional authority and requested this court to ignore the memo. We agree with the challengers and decline to consider the memo.\n\nSTANDARD OF REVIEW\n\n[¶41] \"When a trial court in a bench trial makes express findings of fact and conclusions of law, we review the factual determinations under a clearly erroneous standard and the legal conclusions de novo.\" Rennard v. Vollmar, 977 P.2d 1277, 1279 (Wyo. 1999). A finding is clearly erroneous when, although there is evidence to support it, the reviewing court on the entire evidence is left with the definite and firm conviction that a mistake has been committed. Hopper v. All Pet Animal Clinic, Inc., 861 P.2d 531, 538 (Wyo. 1993). Stated in the alternative: \"[A] determination that a finding is against the great weight of the evidence means a finding will be set aside even if supported by substantial evi dence.\" Id.\n\n[¶42] Because education is a fundamental right and our citizens are entitled to equal protection under our state constitution, all aspects of the school finance system are subject to strict scrutiny, and statutes establishing the school financing system are not entitled to any presumption of validity. The standard of review has been clear for almost 20 years.\n\nAmong other valuable lessons, Washakie teaches that this court will review any legislative school financing reform with strict scrutiny to determine whether the evil of financial disparity, from whatever unjustifiable cause, has been exorcized from the Wyoming educational system. Washakie, 606 P.2d at 335. The triggering issue in Washakie was wealth-based disparities; however, we now extend that decision beyond a wealth-based disparity to other types of causes of disparities.\n\nBecause the right to an equal opportunity to a proper public education is constitutionally recognized in Wyoming, any state action interfering with that right must be closely examined before it can be said to pass constitutional muster. Such state action will not be entitled to the usual presumption of validity; rather, the state must establish its interference with that right is forced by some compelling state interest and its interference is the least onerous means of accomplishing that objective. Miller v. City of Laramie, 880 P.2d 594, 597 (Wyo. 1994).\n\nThe level of scrutiny to be applied was decided in 1980 in Washakie. The evidence of this trial concerning the interaction of the various finance components revealed the necessity that the system as a whole be reviewed under one level of scrutiny. Campbell, 907 P.2d at 1266-67.\n\n[¶43] While the state concedes that strict scrutiny is the standard to be applied to the general structure of the system of fund allocation, it argues that the details of that system, or the inputs and adjustments to the MAP model, need only meet the rational basis test requiring the challengers to prove harm. We disagree. This court plainly recognized in Campbell \"the interaction of the various finance components revealed the necessity that the system as a whole be reviewed under one level of scrutiny.\" 907 P.2d at 1267. The interdependence of the various components is even more prominent under the revised system, which relies upon a model literally built upon those components. The state suggests an inconsistency exists within the trial court's order finding the MAP cost-based model constitutional while not a \"perfect\" system of measuring costs and yet questioning individual adjustments as not cost-based and, therefore, unconstitutional. We do not observe any such inconsistency. The trial court's conclusion was simply that the model was capable of providing the \"basket\" of goods. That conclusion certainly does not logically foreclose a simultaneous conclusion that individual adjustments resulted in unacceptable disparities in funding not based upon cost. The existence of acceptable disparities based upon costs in a constitutional system does not mean, as the state suggests, all disparities are then cost-based. While perhaps no longer dependent on wealth differences alone, disparities under the MAP model may be due to political decisions or a failure to adequately measure differences in cost because of time constraints or gaps in the data, and those reasons are no more acceptable than wealth differences.\n\n[¶44] The state argues that Lincoln County School District No. One v. State, 985 P.2d 964 (Wyo. 1999), stands for the proposition that the rational basis test should be used to determine if the details of the school finance system result in a cost-based system. The issue in that case was whether the statute allowing wealth-based discrepancies to continue during the transition to the new financing system should be reviewed on a rational basis rather than strict scrutiny standard. We held that transitional funding did not interfere with educational rights because it allowed funding above costs to continue for a time. Here we are considering whether or not a permanent system is funding the actual cost of education. If it fails to do so, the constitutional right to an equal and adequate education is obviously compromised, and the strict scrutiny standard is appropriate.\n\n[¶45] The legislation is not entitled to a presumption of constitutionality and withstands the test of strict scrutiny only if, when a disparity in funding is proven, it can prove that a compelling state interest justifies the disparity and the methods chosen to protect that state interest result in the least possible limitation upon the constitutional right in question. Campbell, 907 P.2d at 1266.\n\nThe state bears the burden of proving funding disparities are cost-justified or a compelling reason justifies disparity. Where the evidence establishes funding and spending disparities unjustified by educational cost differentials, the challengers are not burdened with proving disparity of educational quality or educational opportunity; those disparities are presumed. 907 P.2d at 1276.\n\nWe hold this test applies to the complete system for distribution of funds for operating public schools as well as for construction of the necessary facilities in which to operate them.\n\nDISCUSSION\n\nI. Operation Financing\n\n[¶46] Following this court's decision in Campbell, the legislature retained the services of MAP to assist the state in developing a school finance distribution model which would purportedly assure adequate resources were distributed, with any disparities in funding based solely on cost, to provide a proper education for every child in Wyoming. To do so, MAP proposed, in its response to the Request for Qualifications issued by the legislature, it would first be necessary to determine the cost of the delivery of the goods and services contemplated by the \"basket\" in each economic region of Wyoming by going \"shopping\" for them. MAP contemplated the \"shopping\" as follows:\n\n\"Shopping\" in this context will involve determining salary and other compensation rates for professionals with training and experience comparable to teachers, counselors, administrators, etc., wage rates for classifications of employee skills utilized by school districts (e.g., craftspersons, secretaries, and food service workers), and the costs of consumable items and services used by schools (e.g., petroleum, instructional materials, utilities, selected maintenance and repair items, food).\n\n[¶47] However, MAP did not undertake that effort. Apparently concerned about the cost and time necessary to obtain the information, MAP chose instead to determine the \"costs\" to be included in the model based on statewide averages of past school district expenditures and professional judgment. Those costs would then be adjusted to reflect differences in student populations and cost of living throughout the state. This approach raises three fundamental questions this court must resolve to uphold the constitutionality of the system. First, can a system which attempts to estimate the actual cost of education, rather than measure it, meet the standard established by Campbell? Second, does MAP's approach accurately estimate the actual costs a school district should incur to deliver the educational system deemed adequate by the legislature? A corollary of this second issue is whether the disparities from district to district are based upon differences in accurately estimated costs or mere arbitrary assumptions. If the answer to the first two questions is in the affirmative, the final question arises: Did the legislation actually adopted adequately fund those estimated costs?\n\n[¶48] With regard to the first question, it seems to us that actual measurement of the costs, \"shopping\" in the words of MAP, would have been far preferable. Certainly, such an approach would have avoided many of the complex questions and confusion presented in this litigation and would have minimized the need for our scrutiny of the system. However, we cannot say reliance on professionally developed estimates, based upon sound evidence including average past expenditures, results in an unconstitutional system. In addition, even the challengers do not argue the use of a model as a proxy for the cost of education is, in and of itself, improper. Consequently, we conclude the cost-based model approach chosen by the legislature is capable of supporting a constitutional school finance system. Surprisingly, we note the model has resulted in a similar magnitude of funding disparities as existed with the old wealth-based system. Prior to the new legislation, schools experienced an $8,133 per student difference between the highest and lowest funded districts. Today, the same districts (Sheridan County School District No. 3 which is the highest district and Park County School District No. 6 which is the lowest district) experience even a larger disparity of $10,016. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Supposedly, this disparity is now due to cost differences and not wealth differences. That conclusion can only be tested by strict scrutiny of the reasons for those differences in per student funding which is a task we are constitutionally obligated to undertake.\n\n[¶49] The second question is much more difficult to answer. The challengers argue a system built upon average past expenditures is necessarily flawed because the existing system was declared unconstitutional and, they argue, was already inadequately funding education. However, while Campbell concluded the old system had resulted in unconstitutional disparities between districts, absent was a holding that the system, as a whole, was underfunding education. Certainly, some districts were underfunded as a result of low assessed property valuations. At the same time, other districts were \"wealthy.\" The record in this case does not compel the conclusion that statewide average costs would necessarily fall below the cost of providing a constitutionally sound education.\n\n[¶50] While the situation is not ideal, MAP and the legislature had to start somewhere and trying to \"shop\" the actual costs of a system not yet fully implemented has as many inherent problems in attaining accuracy as does use of existing expenditures in a system currently delivering an education not deemed, as a whole, adequate. In general, we conclude use of past statewide average expenditures to estimate the cost of education was appropriate.\n\n[¶51] This leads us to the third question as to the adequacy of the legislation in funding the estimated costs. In addition to holding the constitution requires an equal educational opportunity for all Wyoming children, this court, in Campbell, held our constitution commands the legislature \"to provide and fund an education system which is of a quality 'appropriate for the times'\" and that command goes\n\nwell beyond simply allowing the legislature to dispense a minimal level of elementary and secondary education and then fund it as best it can amidst other competing priorities. Supporting an opportunity for a complete, proper, quality education is the legislature's paramount priority; competing priorities not of constitutional magnitude are secondary, and the legislature may not yield to them until constitutionally sufficient provision is made for elementary and secondary education.\n\n. . . The constitution requires it be the best we can do. 907 P.2d at 1279.\n\nThis court made it clear it is the job of the legislature to \"design the best educational system by identifying the 'proper' educational package each Wyoming student is entitled to have.\" Id. Almost all states' highest appellate courts have considered challenges to school finance systems, and eighteen have concluded that the finance system was either unequal or inadequate, or both, under their state constitutions. Arizona, Ohio, and New York revisited and overturned decisions upholding school finance systems. Unlike the majority of states which emphasized additional funding, equalized funding, or basic education, Wyoming views its state constitution as mandating legislative action to provide a thorough and uniform education of a quality that is both visionary and unsurpassed. To that end, this court required the legislature to consider education as a paramount priority over all other considerations and has identified class space, class size, teacher quality, and local innovation as factors critical to its determination that the legislature is providing a quality education. Campbell, 907 P.2d 1238; Washakie, 606 P.2d 310; see also Joseph S. Patt, School Finance Battles: Survey Says? It's All Just a Change in Attitudes, 34 Harv. C.R.-C.L. L. Rev. 547, 548-49 (1999); Campaign for Fiscal Equity, 2001 WL 96215. Based upon the expert testimony in Campbell, we identified some aspects of a quality education, which included small classes and low pupil/teacher ratios for both rural and urban schools and ample, appropriate provisions for at-risk students and talented students. We are now faced with the difficult and unwelcomed task of determining whether the funding adopted by the legislature in 1999 meets the constitutional standard of the \"best we can do.\"\n\n[¶52] The trial court concluded the funding was adequate for two reasons: 1) five of the challenging school districts had been accredited by the DOE, indicating to the court the \"basket\" was being delivered with the funding provided; and 2) the \"adequacy studies\" convened by the state had concluded the funding was adequate. We are not persuaded the accreditation of five school districts is helpful in determining whether the \"basket,\" only recently identified by the legislature, can be provided over the long term. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n[¶53] After the trial court found in the first trial the state had not carried its burden of proving the funding for the middle and high schools met the constitutional standard, the state undertook two different studies with panels of out-of-state experts to prove the funding, although less than MAP would have provided, could be deemed adequate to deliver the \"basket.\" Eighteen out-of-state experts were utilized to remove any bias and were told they were undertaking a theoretical exercise without identifying the location of the schools. They were divided into four panels \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and asked: \"Granted a fixed level of resources but with the freedom to use those resources as you see fit, can you design and staff a program that you believe would successfully deliver the basket to every student?\" Each team received three different \"fixed levels of resources,\" the resources contained in MAP 3, the 1997 legislation funding (HEA 2), and the 1998 legislation funding (SEA 2). They were provided the legislative list of the skills and knowledge areas constituting the \"basket\" but were not provided Wyoming's graduation standards, which are to be phased in over the next five years. Instead, they used varying curriculum standards from schools with which the panel members had experience. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The fourteen assumptions imposed are critical to evaluating the relevancy of the conclusions because some were not consistent with the Wyoming legislation. Those inaccurate assumptions included: l) assume all special education costs were fully reimbursed when there is a year delay in those reimbursements; 2) assume all transportation, utilities, and food services were fully reimbursed when such reimbursement is also subject to a year delay in certain circumstances or unless the small school adjustment applies; 3) assume salaries are adequate to attract and retain qualified employees when that is disputed if unadjusted for inflation; and 4) assume the district was free to shift resources among categories in any way when none of the categories in the prototype model is funded above cost.\n\n[¶54] Each panel concluded the funding at each of the three funding levels was adequate, but each panel also added teachers to reduce the class size. Given the theoretical nature of the exercise, the inaccuracy of some of the assumptions, and the conclusion that more teachers and smaller class sizes were necessary, the adequacy panels can hardly be considered unequivocal endorsements of the adequacy of the 1999 funding system. We conclude the adequacy reviews are of little probative value.\n\n[¶55] This court has no desire, nor is it our constitutional responsibility, to pass judgment on each line item of the funding model. Those are legislative choices for which the legislators are accountable to their respective constituencies. However, the fundamental question of what is an education \"appropriate for the times\" is a constitutional one that we must answer. The state cites no authority requiring this court's constitutional inquiry to end upon blessing of the model without examination of its inputs. Our discussion in Campbell regarding the application of the doctrine of separation of powers to this issue is equally relevant today.\n\nConstitutional provisions imposing an affirmative mandatory duty upon the legislature are judicially enforceable in protecting individual rights, such as educational rights. Although this court has said the judiciary will not encroach into the legislative field of policy making, as the final authority on constitutional questions the judiciary has the constitutional duty to declare unconstitutional that which transgresses the state constitution. When the legislature's transgression is a failure to act, our duty to protect individual rights includes compelling legislative action required by the constitution.\n\nIn school reform litigation, defenders of the funding scheme routinely advance the argument that the judiciary's determination of the nature and extent of the constitutional right to a quality education violates the separation of powers doctrine. That argument was aptly answered by the Kentucky Supreme court:\n\nThe judiciary has the ultimate power, and the duty, to apply, interpret, define, construe all words, phrases, sentences and sections of the Kentucky Constitution as necessitated by the controversies before it. It is solely the function of the judiciary to so do. This duty must be exercised even when such action serves as a check on the activities of another branch of government or when the court's view of the constitution is contrary to that of other branches, or even that of the public. Rose v. Council For Better Educ. Inc., 790 S.W.2d 186, 209 (Ky. 1989).\n\nOur proper role is interpreting the meaning of the language of §§ 1 and 9 of Art. 7 in order to determine the duties those provisions impo se upon the legislature. Campbell, 907 P.2d at 1264 (some citations \u0026 footnote omitted).\n\n[¶56] The state has argued strongly that decisions concerning the level of funding for the school finance system are a matter for the legislature upon which the court cannot encroach. The complexity of the block grant model system chosen by the legislature forces this court to scrutinize all aspects of the system because, if one assumption fails, many others are jeopardized. For this reason we now consider whether the contested components accurately reflect the cost a school district should incur to provide that component.\n\nA. Teacher Salaries\n\n[¶57] By far, the most expensive component of any education system is personnel, primarily classroom teachers. The record demonstrates those costs reflect 80 percent of the total. Consequently, the estimate of this component cost deserves the closest scrutiny. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e If it cannot be concluded that the estimate of teacher costs reflects the actual cost of the teachers necessary to deliver the basket, the system cannot be constitutional. There are two aspects to estimating these costs, the number of teachers needed and the appropriate salary to be paid to those teachers. The trial court found that the method of determining the teacher salary component of the MAP model was acceptable and described it as follows:\n\n25. Because there is only one purchaser of teacher services, MAP determined the price of hiring a new teacher, typically with little or no experience, by studying the most competitive market in the state for professionals with similar educational qualifications. This market is in Albany and Laramie Counties.\n\n26. MAP compared the beginning teacher salaries offered by the three school districts in these two counties with the statewide average or mean starting salary. The beginning salary in Albany and Laramie Counties was slightly lower than the statewide average. MAP chose to use the higher figure, the statewide mean starting salary of $20,573.00, for the model.\n\n27. To the average starting salary ($20,573.00), MAP added the average increase due to advanced education ($1,796.00), and the average increase due to greater experience ($9,389.00) for a total of $31,758.00 as the cost per teacher in the prototypical model.\n\n28. The \"mandatory benefits\" for teachers, principally social security and Medicare taxes, are added to this figure, as is the cost of health insurance. For teachers, these amount to $6,034.00 and $3,641.00 respectively, as shown in the elementary, middle, and high school prototypical models.\n\n[¶58] The numbers used for the component were based upon 1996-97 school district expenditures. At that time, Wyoming's starting salary compared favorably with other states in the region. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Extensive evidence in the record indicates recruiting and retaining teachers is becoming more difficult not just in Wyoming but also nationally, \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and certain communities in Wyoming may have more difficulty given the economic reality in their area. The use of a statewide average salary equalizes the previous disparity by supplementing the salary component for those districts that had lower than average salaries. The districts with higher than average salaries would presumably have paid higher salaries because of a higher cost of living, and, while the model would initially reduce their salary component to the average, it would ultimately adjust it upward based upon the regional cost-of-living adjustment. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The allocation to each district is then adjusted to account for increases in teacher seniority above the statewide average used in the salary component. Districts whose seniority increases over time receive additional funds. Likewise, districts whose teachers' seniority decreases will experience a reduction in funding. This adjustment, while revenue neutral to the state, has the potential to put additional pressure on individual districts which experience large numbers of teachers retiring in the next few years. Theoretically, as those teachers are replaced with more junior ones, the total salary costs of those districts should decrease.\n\n[¶59] The number of teachers needed to deliver the \"basket\" was also determined as part of the salary component of the model. The number of students per class dictates to a large degree how many teachers will be necessary. Class size is the biggest driver of education costs. At the same time, no other factor has been identified as more important to the quality of education than class size.\n\nThe evidence demonstrates that class size has an effect on student outcomes, and that smaller class size can boost student achievement, particularly among at risk children. The advantages of small classes are clear. A teacher in a small class has more time to spend with each student. Fewer students mean fewer administrative tasks for each teacher. Student discipline and student engagement in the learning process improve in smaller classes. Campaign for Fiscal Equity v. State, 2001 N.Y. Slip Op. 21051, 2001 WL 96215, at *35 (N.Y. Sup. Jan. 9, 2001).\n\n[¶60] MAP identified an experiment conducted in Tennessee in the 1980s which systematically varied class size and which MAP described as \"one of the most powerful findings in all of instructional research.\" The Tennessee Student Teacher Achievement Ratio (STAR) project was a landmark study of the effect of class size on student achievement. 2001 WL 96215, at *36.\n\nThe STAR project demonstrated that there is a significant causal relationship between reducing class size and improving student achievement. The effects were positive and durable, particularly for students who started in the smaller classes in kindergarten and stayed in them for 3-4 years. Such students continued to perform at a higher level on average than those students in the large class sizes. Id.\n\nIn the study, one group of elementary classes had 15 students, and a control group had 22 students and a teacher aide. Students in the small classes experienced substantially higher achievement and continued to experience that higher achievement several years after elementary school. MAP's recommendations included what it, in consultation with Wyoming educators, believed were appropriate class sizes (MAP 3), \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and those small class sizes were relied on as an important element of a quality education throughout the development of MAP's funding recommendations. In creating the simulations for review by the legislature, MAP also developed a slightly different class size/teacher number scenario (MAP 4), which its experts opined was capable of delivering the basket.\n\n[¶61] According to the MAP report, increasing class size by only one student saved $12 million. Leaving the class size decision ultimately up to the legislature, MAP stated, \"the essence of the decision facing the Legislature in this case is a determination of the most cost effective class sizes Wyoming can now afford, considering its total resources and competing priorities.\"\n\n[¶62] The challengers contend the legislation ultimately adopted did not follow either the MAP 3 \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e or MAP 4 approaches and utilized larger classes and fewer teachers in the distribution formula. They are correct. A comparison of the two MAP prototypes (MAP 3 based on input from Wyoming educators), the 1997 legislation after the governor's veto, and the 1999 legislation follows:\n\nMAP 3 MAP 4 97 Legislation after Veto 99 Legislation\n\nMiddle School\n\nNumber in Class 20 21 23 21\n\nNumber of Teachers 17.5 16.7 15.2 17.7\n\nHigh School\n\nNumber in Class 17 19 22 21\n\nNumber of Teachers 41.2 36.8 31.8 33.3\n\n[¶63] The legislature did not fully embrace either the MAP 3 or MAP 4 prototype. The elementary school model was funded basically pursuant to the MAP 3 model. However, the high school model reduced teachers from the MAP 4 model by three and a half and increased the class size by two. Considering the revenue deficits the state believed it was facing in the years 1997-99, the legislature's motivation to shave the recommended class size and avoid the corresponding costs is understandable. However, if its approach fails to provide a proper education as commanded by the constitution, this court cannot condone the result. The difficulty both this court and the legislature face is determining how small the class sizes should be to assure a constitutionally adequate education.\n\n[¶64] At the 1999 trial, Dr. James Guthrie, a principal of MAP, testified that, since MAP began work in Wyoming, the per pupil increase in funds through the development of the school finance formula had, by the 1999 legislation, provided Wyoming educators with sufficient resources to offer an \"extraordinary [and] indeed [a] superior quality of schooling for the students in this state.\" Dr. Guthrie was asked if there was a proper range for classroom sizes in middle schools and high schools and whether the class sizes adopted by the 1999 legislation were appropriate. He responded that, as opposed to the scientifically verified benefit of small elementary school class sizes, no such research existed with regard to middle schools and high schools. However, it was his professional opinion that a class size of 21 for the higher grade levels would clearly be within the acceptable range and would enable a teacher to provide a proper education. The challengers provided no evidence to demonstrate the class size of 21 would prohibit the delivery of a proper education.\n\n[¶65] At this time, there is a lack of scientific data to support a specific class size range for middle schools and high schools. The evidence in this record indicates the class sizes adopted in the 1999 legislation were not unreasonable. That is not to say that any further deviation from the MAP 3 or MAP 4 models would be tolerated. It only means that, based on the information and evidence available today, the middle and high school class sizes do not appear to be unreasonable. We anticipate the statewide assessment processes being developed by the DOE, namely WyCAS, Terra Nova, and the National Assessment of Educational Progress, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e will likely provide regular insight into the adequacy of the class sizes and the system's continued ability, or lack thereof, to deliver the basket.\n\n[¶66] A conclusion that the teacher salaries, as computed by the MAP model and as driven by class size, are reasonable is supported by the record. However, this conclusion must be qualified. The MAP experts contend the system must be reviewed on a regular basis to ensure continued cost-based components which permit delivery of the basket. Additionally, witnesses for both the state and the challengers testified to the looming teacher shortage crisis caused by one-third of teachers who will be retirement-eligible by the year 2004, significantly fewer graduates seeking teaching positions, and the aggressive recruitment of Wyoming teachers by other states offering considerably higher salaries and benefits. Already, Wyoming is documenting the failure to receive any applications to fill teaching positions in art, music, health, math, counseling, speech pathology, psychology, and administration. The legislature does not have the luxury of waiting until the crisis fully materializes before taking the action necessary to remain viably competitive regionally and nationally. During the 1999 trial, Dr. Guthrie testified that, in order to keep the model current, every five to six years the legislature must undertake a procedure to re-examine the model components to ensure their sustained validity. Therefore, we hold that, in order for teacher salaries, which comprise 80 percent of the total cost of education, and the school financing system as a whole to maintain cost-based validity, the legislature shall conduct a review of the components in 2001 and at least every five years. If, during the course of such a review process, evidence becomes available which indicates class sizes should be adjusted in order to provide Wyoming children with the best education available, the legislature shall act accordingly.\n\n[¶67] An additional qualification on the sufficiency of teacher salaries is required. Dr. Guthrie also testified at the 1999 trial that, in order for the model to remain cost-based, an external cost adjustment for inflation or deflation, as warranted, must be applied on an annual or, at a minimum, biennial basis. The external cost adjustment is to be discussed at some length in the pages which follow, but, suffice it to say, if teacher salaries are not adequately adjusted for inflation in keeping with our holding on the external cost adjustment, they will no longer be constitutionally cost-based. For these reasons, as qualified, we conclude the trial court's determination that the state met its burden of proving the revised system adequately provides for teacher salaries is not clearly erroneous and affirm its decision.\n\nB. Other Salaries\n\n[¶68] Salaries for administrators, including superintendents and principals, are based on statewide averages. The average salary bears no relationship to the size of the school or district or to the relative responsibilities of the employees. The formula provides compensation for a superintendent in the smallest district at the same rate as the superintendent in the largest district, despite greatly different responsibilities. Unlike the teacher salary component, the formula fails to provide any form of seniority adjustment for administrators or increase due to additional degrees or educational units, notwithstanding the fact that such adjustments are the accepted practice of Wyoming school districts. The effect is that the compensation for administrators' salaries bears little relationship to the actual costs incurred by any Wyoming school district and results in funding disparities for which the state has shown no compelling state interest. [¶69] A similar approach is taken with classified personnel such as aides, clerks, and operation and maintenance personnel, with similar problems resulting in unacceptable disparities. We reverse the trial court's decision to the contrary as clearly erroneous and hold that administrative and classified salaries should be adjusted in a fashion similar to teacher salaries to account for differences in experience, responsibility, and seniority. We further hold these changes shall be implemented no later than July 1, 2002.\n\nC. School District Operations\n\n[¶70] Costs of maintenance and operation, which include utility costs, are incorporated in the model based upon 1996-97 statewide averages per pupil relying again upon past expenditures by Wyoming districts. MAP recognized that a better estimate of this cost component could be achieved through a system based on the age and condition of the district's buildings rather than enrollment and suggested that a combination of per pupil costs and square footage would be the most accurate manner to approximate actual costs. However, MAP concluded that reliable information upon which to calculate such an adjustment was not available. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e It recommended the data be collected and in the interim an average per pupil number be utilized because \"it is unlikely that the proposed formula will work an undue hardship on school districts for the period of time required to gather the necessary information.\" If there is one truth we have learned throughout the history of the educational funding issue, it is that we cannot predict how long it will take for the legislature to correct disparities. On its face, this component is not based upon the real and necessary costs of maintenance and operation of the state's schools. Many of these costs, utilities in particular, are not subject to the direct control of the districts and are unavoidable. Other programs should not suffer in order for districts to cover these costs. We reverse the trial court's decision and hold this component must be adjusted either by development of a formula which uses enrollment measured by ADM, building square footage, and number of buildings in the district or by reimbursement of actual costs subject to state oversight. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e This change shall be implemented no later than July 1, 2002.\n\nD. Transportation and Special Education\n\n[¶71] Pursuant to Wyo. Stat. Ann. §§ 21-13-320(b) and 21-13-321(b) (LEXIS 1999), special education and transportation costs are funded at 100 percent of a district's previous year's actual expenditures. However, the legislation provides that, if the ratio of spending on either of these two categories to total district spending increases, the amount of funding received for that category will be reduced by \"the excess which is over one hundred percent (100%) but less than one hundred ten percent (110%).\" Wyo. Stat. Ann. §§ 21-13-320(e)(iii) (transportation), 21-13-321(b)(ii)(C) (special education) (LEXIS 1999). The following year, the DOE shall increase the amount the district receives by the amount reduced the previous year if the excess expenditures are found to be necessary to provide special education services or transportation operations for the school year in which they occurred. Wyo. Stat. Ann. §§ 21-13-320(e)(iv) (transportation), 21-13-321(b)(ii)(D) (special education) (LEXIS 1999).\n\n[¶72] The school districts contend the 10 percent withholding limitation represents an arbitrary limit on reimbursement of actual costs incurred in providing essential educational services. However, districts experiencing an increase in spending will receive funding for the increase once they demonstrate to the DOE that these expenditures were necessary to provide services during the school year. Id. There is no limit upon the reimbursement of necessary transportation or special education expenditures. The legislation only requires that significant increases in expenditures be justified. Given the full reimbursement of legitimate expenses and the relatively small percentage of the budget these items represent, this does not amount to an infringement upon the right to an adequate education. We affirm the trial court's holding which stated that the special education and transportation reimbursement \"is not a constitutionally actionable penalty.\"\n\nE. Adjustments for Characteristics of Student Populations\n\n[¶73] As MAP explained:\n\nSome number of students in every school district present extraordinary educational challenges that frequently require services of a nature or quantity that imply extra costs. . . .\n\nThe proposed Cost Based Block Grant Model has embedded within it a strategy for meeting the challenges presented by students with special characteristics.\n\nCritical to the assessment of whether these adjustments for students who present special challenges are cost-based is the underlying principle that MAP built into the model of \"small schools, small classes, teaching specialists, and professional development resources for teachers.\" If the classes and schools remain small, MAP contends the adjustments are adequate and represent the reasonable additional costs schools will incur to deal with these students. It is interesting to note that MAP makes no mention of any additional costs that may be incurred by schools which are much larger than the prototypes. Most Wyoming students attend schools that are much larger than those assumed in the prototype. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\n1. Special Needs Students\n\n[¶74] Certain types of students require additional instruction which results in higher than average educational costs. Generally, special needs students are those considered to be \"at risk\" students and gifted and talented students. At -risk students include economically disadvantaged youth (EDY) and limited English speaking students (LES students). \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e MAP and the legislature concluded additional funding was needed to allow Wyoming schools to properly deal with students at-risk of failure. At -risk students require specially tailored programs and more time spent on all aspects of academic endeavor in order to improve their academic achievement. The primary need of schools with concentrations of these students is increased adult attention in the school setting. The record contains no evidence of any effort to determine either the actual expenditures of Wyoming schools or the cost schools should incur when dealing with at-risk students appropriately.\n\n[¶75] In the 1997 order, the trial court determined the number of students who have applied for and are qualified to receive federally subsidized free and reduced priced lunches, used in legislation as an indicator of EDY, was questionable and the trigger for the additional funding was arbitrary.\n\nUsing such lunch counts, particularly at the secondary levels, may under count the number of economically disadvantaged youth if, for varying reasons, they do not take advantage of the federal program. The formula for eligibility for such adjustment is an arbitrary 150% of the statewide average per district. No adjustment is provided for school districts that have 149% of the statewide average and complete adjustment is made for anyone with more than 150%.\n\n[¶76] The trial court similarly found that the adjustment for LES restricts reimbursement to an arbitrary cutoff point. It reserved ruling on these issues while the legislature reviewed this problem. However, in the 1999 order, the trial court upheld the EDY and LES adjustments even though there was no change in those adjustments and no new evidence to indicate the allocations were cost-based. The trial court was apparently convinced that the MAP model made accommodations in other areas, such as smaller class sizes, and therefore the EDY and LES adjustments were constitutional. We reverse, and our conclusion is supported by the trial court's 1997 findings.\n\n[¶77] In addressing EDY, the model provides $500 for each student enrolled in the free and reduced lunch program in school districts where the concentration of these students is equal to or greater than 150 percent of the statewide average. Schools with 149 percent of the statewide average and schools with students at risk for reasons other than the need to enroll in the free lunch program receive no additional funding. This formula cannot, and does not, represent the real and appropriate cost of educating EDY. The testimony of Laramie County School District No. One in this case is painfully similar to its testimony over five years earlier in Campbell. Then, the school district received only half of the $1.2 million required to fund the costs of its alternative high school, an undisputedly appropriate method of dealing with at-risk students, leaving the rest to be deducted from other programs. Under the new system, Laramie County's situation remains unchanged. Not only is the EDY adjustment not cost-based, its completely arbitrary 150 percent trigger results in dramatic differences in funding even among districts that border each other and, consequently, are likely to have similar student characteristics. While use of the free lunch enrollment may serve as a partial proxy by roughly identifying EDY, it fails to capture students equally at-risk for other reasons. MAP rejected other measures such as identifying low achieving students by arguing it would reward failing schools. While that argument may have superficial appeal, it ignores the reality that a large concentration of low achieving students causes increased costs. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\n[¶78] The amount of the supplement for EDY is likewise arbitrary and admittedly not based on the cost of the full range of at-risk programs. Instead the $500 figure was based upon the approximate cost per student of a program called \"Success for All\" which was aimed at improved reading at the elementary level. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e While this program may be one appropriate method for dealing with at-risk elementary school children, relying on it exclusively ignores the needs of the full range of at-risk students. The record contains no evidence concerning the cost of dealing with economically disadvantaged middle or high school youth which, we can assume, requires more than enhanced reading programs and may necessitate programs and services such as alternative schools, after school programs, and additional security.\n\n[¶79] Similar issues are raised with the formula for supplemental funding of the costs incurred in educating LES students. When certain concentrations of these students occur in a district, extra resources, such as bilingual aides and teachers, are needed. Without any evidentiary support, MAP recommended additional funding where such students exceed 20 students per grade level or 25 percent of the schoolwide ADM. Then, based upon experience in Connecticut, the funding was proposed and adopted at 1.15 times the number of identified students, or approximately $900 per student. Given the lack of evidence that $900 reflects the actual additional costs and the relatively small amount of funding likely to be required to cover those costs, actual reimbursement of identifiable, legitimate, state-approved costs, such as bilingual teachers, more appropriately meets the standard established in Campbell.\n\n[¶80] The state's response to the obvious problems with these formulas repeats MAP's mantra that small schools and small class sizes are already contained in the model and are the most recognized method for dealing with at-risk students. The state further contends that schools are free to use their block grants to add more teachers and create smaller classes. This argument wears fairly thin when it is always conditioned upon the caveat that the model, and its class sizes, was only a recommendation to the legislature which was free to, and did, adopt somewhat larger classes and fewer teachers. Further, even the state agrees no other components of the models were overfunded, which leaves the schools without any real option but to take funds from other programs. To do so would damage those same programs by reducing their funds below cost.\n\n[¶81] The problems in developing a formula to accurately capture the true cost of adequately dealing with at-risk students seem insurmountable. If so, the legislature must assure that schools are fully reimbursed for the funds necessary to educate at-risk students with the most effective and current methods possible. No one can argue the urgent need our society faces to minimize the failure of students and the increased social costs that unavoidably follow. We hold the adjustments for funding EDY and LES students result in disparities in funding which are not justified by any compelling state interest and which do not reflect the cost of adequately educating these students. The state is directed to fund the actual and necessary costs of EDY and LES students, subject to state oversight. Although we do not foreclose the possibility of the state in the future developing an accurate formula with which to distribute adequate funds in lieu of direct reimbursement, for the above stated reasons, accomplishing that task will not be easy or swift. Until that time, we cannot allow the needs of at-risk students to be ignored or other students to be denied a complete education because a school's funds must be diverted to address those needs. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e We do not foreclose the possibility that some portion of the actual costs may be covered by the $500 EDY supplement and the 15 percent LES supplement and do not prohibit the use of those formulas for partial funding. These changes shall be implemented on or before July 1, 2002.\n\n[¶82] Finally, the challengers argue the funding for gifted and talented students is arbitrary and attenuated from actual costs. MAP recommended, and the legislation provides, additional funding so that gifted and talented students' potential may be realized. The state provides an additional $9 per total ADM to fund gifted and talented programs. This amount is based upon the \"assumption that three percent of the entire student population is comprised of gifted students.\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Over time, society's view and the views of educational researchers concerning intelligence and giftedness have changed. There is no objective definition of \"gifted.\" Rather, a broad measure of intelligence has been recognized. Where there used to be a \"unitary construct in which gifted students were believed simply to have more of what everyone else had,\" there is now a \"more refined definition[] . . . where giftedness is seen as multi-dimensional.\" \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The significance of this shift in the definition of giftedness is that \"[t]here is an emerging consensus in the field that efforts should move from a focus on nurturing the talents of a few identified students to programs that aid to seek out and develop talents in as many students as possible.\" Students who are educated using methods focusing on the talent development of as many students as possible have been shown to perform as well as or better than students who have been taught in more dated and conventional gifted and talented programs.\n\n[¶83] MAP recommended Wyoming revise its program due to the modern view of giftedness, and MAP recommended a \"modest increase\" in statewide funding for gifted and talented students. Ultimately, the legislature provided more than double the amount recommended by MAP.\n\n[¶84] The gifted and talented program, which existed prior to the new legislation, provided that districts could identify up to 3 percent of their students as gifted and receive up to $150 per student or a prorated amount assuming the state's $350,000 limit had been exceeded. The new statute results in approximately $450,000 being appropriated for gifted students, but it is distributed on an ADM basis and results in approximately $9 per ADM. There is a net increase in funding distributed on an equitable basis. While this court may have reached a different result concerning how much money is enough to allow gifted students to develop their maximum potential, that judgment is the prerogative of the legislature. No evidence exists in the record to support a finding that this approach does not meet the standards of the constitution.\n\n2. Vocational Education\n\n[¶85] No adjustment is made for the admittedly higher costs of educating vocational students. The state contends those costs are contained within the assumptions in the model for numbers of teachers and costs of equipment and supplies. However, those amounts were based on statewide average expenditures, which necessarily resulted in penalizing schools with extensive vocational programs. Moreover, the trial court determined in its 1997 order: \"There are higher costs associated with the provision of vocational and technical training in Wyoming schools, and there is no provision in the prototypical models for funding those higher costs.\" However, without any change in the model to adjust for vocational and technical training, the trial court upheld the absence of a vocational adjustment in its 1999 order. We reverse the trial court's 1999 holding as being clearly erroneous and base our conclusion on the record evidence from both the 1997 and 1999 trials which is consistent with the trial court's 1997 findings.\n\n[¶86] The elimination of disparities required by Campbell did not anticipate the reduction in existing programs. Vocational and technical training is included in the legislature's \"basket of educational goods and services.\" MAP has admitted \"[i]t is generally accepted in the education community that vocational education is more expensive to provide than other forms of instruction.\" What has traditionally made vocational education more costly than academic education are relatively smaller classes and the need for more costly equipment and supplies. We hold that, in order to provide vocational and technical training, the actual costs of providing vocational teachers and equipment must be examined, included as a line item in the MAP model, and funded accordingly. These changes shall be implemented on or before July 1, 2002.\n\n3. External Cost Adjustment/Inflation Adjustment\n\n[¶87] The cost figures in the most current legislation do not account for inflation since 1996-97. Both MAP and the trial court recognize the obvious. There will undoubtedly come a time when inflationary cost increases render the funding levels inadequate to deliver the basket. The legislature addressed this problem in § 21-13-309(r), which provides:\n\n(r) The joint appropriations interim committee shall submit a recommendation to the legislature and governor, not later than November 1 of each year, regarding whether an external cost adjustment should be made, and if so, the amount of the adjustment.\n\nOf course, neither the legislature nor the governor is obligated to act on such a recommendation, if made.\n\n[¶88] In this regard, the only inflationary adjustment since at least 1996-97 has been the adoption of § 21-13-309(o)(i)(A), which provides 1.3 percent for new inflation effective for the 2000-2001 school year, but specifically excludes any inflation adjustment for the years preceding the 2000-2001 school year. See § 21-13-309(o)(i)(A)(II). The tough question for both the legislature and this court is when and how should inflation adjustments be made in order to ensure the finance system is consistently cost-based. Wyoming teacher salaries now rank 42 nd in the nation. Salaries actually being paid by districts are now 6 percent to 40 percent greater than the salaries within the statutory prototype. By pure force of logic, it is evident the 1996-97 salaries which were found to adequately reflect the cost of teachers at that time have not been held constant by the funding contained in the statute and are now significantly below costs. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e While we agree that the lack of an internal, automatic cost adjustment in the statute may not in and of itself render the system unconstitutional, without such adjustments, legislative inaction appears inevitable, and, ultimately, funding of education will be below cost in contravention of the constitution. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\n[¶89] As previously noted, MAP advised the legislature that teacher salaries must be inflation-adjusted on an annual or, at a minimum, biennial basis and that the model components must be thoroughly reviewed every five to six years to ensure continued cost-based validity. Therefore, we hold that the legislature shall conduct a review of all the components every five years to ensure that funding accurately reflects the actual costs school districts are paying because of current market or economic conditions. Because the numbers contained within the model and codified in the statute are based on actual 1996-97 costs, an inflation adjustment is overdue. Four years have passed, and only a 1.3 percent adjustment has occurred which does not reflect the actual inflation during those four years. Based on the state's own evidence in this record and common sense, we cannot condone that result.\n\n[¶90] This court does not relish the idea of reviewing this matter on a continuing basis in perpetuity and is quite sure the legislature does not desire that result either. As long as the state continues to rely upon a cost of education model based upon historic actual costs to determine the appropriate funding for schools, regular and timely inflation adjustments are essential to funding the real cost of education. We adopt the opinion of the state's experts \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e and hold that the model and statute must be adjusted for inflation/deflation every two years at a minimum. Given the acceptance of all parties of validity of the WCLI, adjustments made consistent with that index will be presumed to be adequate. If other methods of adjustment are chosen by the legislature, they must be structured to assure quality of education remains adequate. It will be of great assistance to this court and all interested parties if the adjustment is adopted as a separate component of the model which would avoid the potential confusion, as occurred in this case, whether adjustments to the model for other reasons should be considered as inflation adjustments. The model and statute must be adjusted for inflation no later than July 1, 2002, and each biennium thereafter so long as a cost of education model using historic costs is relied upon for the basis of education funding. The amount of the adjustment required will depend, obviously, on the timing of the adjustment.\n\n[¶91] Because teacher quality is critical to providing a constitutional education and all parties recognize the looming national problem of a teacher shortage, the legislature is also directed to monitor the supply of qualified teachers and take appropriate action should national conditions continue to worsen to the detriment of Wyoming schools. It is unacceptable for essential teaching positions to remain unfilled or to be cons istently filled by unqualified applicants.\n\n4. Adjustments for School Characteristics\n\n[¶92] MAP and the legislature also recognized the model needed adjustments to accommodate differences in schools due to size and location which impact their costs of education. The question we must resolve is whether the adjustments are based on actual differences in cost or whether they represent unconstitutional disparities in funding.\n\na) SMALL SCHOOL ADJUSTMENT\n\n[¶93] Recognizing that small schools had certain fixed costs spread over fewer ADMs, all parties acknowledged the model probably failed to fund smaller schools at their actual cost of operation. A small school adjustment was provided consistent with the MAP study. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The statute provides that a small school's allocation shall be adjusted as specified in \"the cost of education study, dated April 1997, and the spreadsheet provided by the consultant performing the study related thereto, both of which are on file in the legislative service office.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Wyo. Stat. Ann. § 21-13-309(s) (LEXIS Supp. 2000) These incremental adjustments were apparently based upon MAP's calculation of the difference between the ADM unit value generated by the original MAP model and the \"small school\" ADM unit value. The small school ADM unit value was determined by MAP, without any detail provided in its report, multiplied by the small school's ADM up to the 200 and 400 ADM threshold at which point the original model takes over. Theoretically, this adjustment, if the \"small school\" ADM unit value accurately reflects the small school's costs, would result in small schools being fairly reimbursed. In the interim between 1997 and 1999, MAP visited small schools throughout Wyoming and recommended changes to the legislature. At the same time, the small schools sought a settlement of the litigation, and the legislation ultimately adopted reflected that settlement.\n\n[¶94] The revised statute provides for an additional adjustment to the foundation allocation for small schools which results in 100 percent reimbursement for utilities, food services, and school activities. Wyo. Stat. Ann. § 21-13-319(b)(i)-(iii) (LEXIS 1999). The state and the small schools contend this second adjustment is necessary because these are fixed costs over which the schools have little control. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e However, there is no explanation why those costs are not included in the first adjustment which supposedly reflects small school costs per ADM. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\n[¶95] We agree with the trial court's conclusion that two problems arise with these adjustments. First, there is no cost-based reason for the 200 and 400 ADM threshold at which the adjustments apply. For schools below the threshold, their actual costs were compared with the costs assumed in the model, and, when a deficit was demonstrated, MAP and the legislature concluded those schools' costs were underfunded. No such comparison was made for schools above the threshold, resulting in disparities in funding not based upon costs. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Schools with 201 ADM receive neither adjustment when schools with 199 do. Yet, the economies of scale arguably continue above those thresholds. The trial court found:\n\nWhile Plaintiffs agree in principle with the concept of a small school adjustment, they contend that the adjustment as enacted in the legislation is not based on empirical data reflecting actual cost disparities. Plaintiffs' expert levied the following criticisms at the adjustment:\n\nThe MAP analysis fails the cost-based and rational standard on at least four counts: (1) it ignores scale economies for cost components other than instruction and instructional support salaries and benefits; (2) it sets an arbitrary limit on the maximum school size for which scale economies apply (i.e., the MAP model implies that scale economies stop at 200 for elementary and middle schools and 400 for high schools); (3) it does not fully rely on actual data from Wyoming schools to estimate the relationship between per unit costs and school size but rather uses an arbitrary scheme; and (4) ignores the possibility of scale economies due to district size.\n\nPlaintiffs' criticisms are well taken. This court has been unable to locate any evidence which supports the legislature's determination to selectively enhance funding for certain components or to cut off such enhancements at the maximum school sizes. The legislation funds all necessarily small schools as though their costs did not decline inversely as a function of school size. . . . Moreover, the legislation assumes that a school of 201 ADM benefits from economies of scale but that a school of 199 ADM suffers from diseconomies of scale. There is evidence that a small school adjustment which utilizes a gradually declining enhancement would accurately compensate for the real differences in the cost of education in small schools, but the state has consistently ignored its own experts on this point. Although it is readily apparent that a small school adjustment is necessary to protect the state's compelling interest in equality among the various schools, the state has failed to show that the adjustments reflect the actual costs of operating small schools.\n\n[¶96] The trial court apparently did not consider the spreadsheet admitted into evidence which does provide a gradual decrease in the first adjustment as ADM increases. However, because of the finding that the 200 and 400 ADM limits, and other provisions of the adjustment, are arbitrary and not cost-based, the court's conclusion would not likely have been different had the spreadsheet been considered by the trial court. We affirm the trial court's decision and hold the small school adjustment triggering mechanism is not based upon evidence of cost differences and is, therefore, unconstitutional.\n\n[¶97] Further, the second adjustment which provides additional supplemental funding in the form of full reimbursement of utilities, school activity costs, and food service costs insulates small schools from inflationary pressures while depriving large schools of the same protection. This adjustment also results in a \"double dipping\" by small schools for utility costs which were already considered in the operation and maintenance component of the model. The state fails to show any compelling state interest for this disparate treatment and instead argues the court should not be concerned about this relatively small budgetary item.\n\n[¶98] Certainly, a good portion of these costs are largely beyond the control of all districts, and, because statewide averages were relied upon to develop the model, these costs are underfunded for some districts. Rising costs in these areas, especially those currently being experienced for utilities, places inappropriate pressure on the schools to \"rob Peter to pay Paul.\" They cannot choose to forego paying their utility bills. Instead, other programs will suffer when those costs rise above the averages assumed in the model. We have already held that maintenance and operations costs, including utilities, should be fully funded at least until and unless the state develops a formula that more accurately captures actual costs other than the per pupil average used. Of course, such reimbursement could be conditioned on such incentive programs to control costs as are contemplated in the small school adjustment. In the area of school activities, no explanation is contained in the record of why small schools should not be subject to the average activity costs the same as large schools except that their costs vary widely. However, that same variance exists for large schools. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Absent a compelling justification for such disparate treatment, that portion of the adjustment is unconstitutional. Food service is presumed by MAP to be self-sustaining. However, it is obvious such may not be the case in some schools. Again, the evidence is absent from the record to support a conclusion concerning which schools are underfunded for food services.\n\nWe hold the actual costs of student activities and food services for all schools, both small and large, must be examined and compared to the MAP model. If the amount allocated per ADM fails to cover actual costs, the difference must be funded. These changes shall be implemented on or before July 1, 2002.\n\nb) SMALL SCHOOL DISTRICT ADJUSTMENT\n\n[¶99] The trial court likewise found the small school district adjustment lacked justification. The statutes provide for districts with 1,350 ADM or less to receive an additional $50,000 for each remote attendance center, districts with 1,100 ADM to also receive additional funds for maintenance and operations, and districts with 900 ADM or less to receive yet additional funds for administration. Section 21-13-328(a)-(c). The trial court found:\n\nNeither the original MAP proposal nor the 1997 legislation provided for a small school district adjustment. During the 1997 trial, Dr. James Guthrie, speaking to the idea of a small district adjustment for MAP said,\n\nWe could not find any compelling justification for keeping it. Earlier we had been advised by - at public hearings [that] small districts experienced diseconomies of scales at the districts and we wanted to genuinely explore the consequences of that embedded in a small school district reimbursement formula. But the more data that we collected, the more observations that we made, the more conversations that we had, the less justification that we could see for [a] small school district reimbursement formula and, thus, dropped it.\n\nMAP's opinion regarding the necessity of a small district adjustment did not change over time. In a February 17, 1998, letter, MAP's Dr. James Smith stated:\n\nMost of the sources of diseconomies will have been addressed when MAP's recommendations regarding small school adjustments for transportation, special education, utilities, student activities, and food service are adopted. While MAP concedes that there may be a theoretical case for a small district formula, the data [sic] available at this time does not support any further adjustment for these districts in Wyoming. Thus, based on the best available evidence, MAP recommends that no small district adjustment be adopted. We do recommend that this issue be revisited in the future in light of valid and reliable information. Therefore, we recommend that the Department of Education collect and analyze, over time, data aimed specifically at determining central administrative costs associated with operating small school districts.\n\n[¶100] The challengers contend the small school district adjustment is based upon incomplete and unreliable data and assumptions. The trial court found those claims were valid given the fact the state's expert recommended against such an adjustment. No persuasive data supported either the ADM cutoff or the $50,000 amount. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Even if the data relied upon were accurate as claimed by the small school districts, no attempt was made to review data from the larger districts to determine if the cutoff made sense. Certainly, large districts also have remote attendance centers. Yet the statewide averages for administration costs were considered adequate for them. Again, disparate treatment of schools based upon arbitrary standards cannot be justified. We affirm the trial court's decision and hold the small school district adjustment unconstitutional. If the legislature is convinced small school districts are not properly funded, any adjustment must be based upon documented shortfalls under the MAP model that are not equally suffered by larger districts.\n\nc) REGIONAL COST ADJUSTMENT\n\n[¶101] Given the geographic and economic diversity of the State of Wyoming, wide ranges in the cost of living exist. The MAP model which is based upon statewide average expenditures unavoidably resulted in estimated costs below those actually experienced in some areas of the state. That result was constitutionally unacceptable, and all parties recognized some form of a cost-of-living adjustment was essential to the validity of the new funding system. While MAP never \"went shopping\" as originally intended, it was understood the cost for individual school districts to purchase the necessary components of the education delivery system would be higher in some areas of the state than the average expenditures. Consequently, MAP recommended the foundation allocation produced by the model be adjusted based upon the WCLI. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e As noted by MAP, \"[b]ecause this index has been developed for the purpose of administering the state's property tax system, it cannot be subject to any suspicion that its use for purposes of education equalization is biased.\" The broad categories of items measured and their weighted relative importance to the consumer are: housing (40.9 percent), transportation (17 percent), food (15.8 percent), recreation and personal care (13.2 percent), medical (7.1 percent), and apparel (5.9 percent).\n\n[¶102] MAP recommended, and the legislature agreed, to exclude the medical component of the index, modify the housing component to exclude the rental of shelter subcomponent, and apply the remainder. Section 21-13-309(o)(ii). The medical portion was eliminated because the cost of personnel as contained in the model includes the cost for medical insurance. Although MAP recognized there were some medical costs in addition to insurance, it concluded there were insufficient time and resources to explore reweighting those costs for inclusion. Further, medical costs represented only 7.1 percent of the total. MAP also recommended excluding the rental of shelter component from the index because, it reasoned, differences in those costs would be due to the relative desirability of various locations in the state. If schools were able to pay teachers more because of those higher costs, the result would be overcompensation in desirable locations because the teachers would enjoy both the \"amenity\" of living in those locations and higher pay.\n\n[¶103] As discussed above, the MAP model selected by the legislature allocates funds to each district based upon statewide averages of the historic expenditures of those districts. If we can assume districts were not paying more for teachers than needed to attract and retain them, \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e the differences in teacher salaries across the state must necessarily be due to differences in cost of living or other unique characteristics of a particular location that required higher salaries in order to attract and retain teachers. If a high cost-of-living district necessarily paying higher salaries is allocated funds based on average salaries, that allocation is not cost-based. Application of the cost-of-living adjustment was an effort to more accurately represent the actual cost of hiring personnel in a particular location. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e To exclude the rental of shelter subcomponent of the WCLI is to presume a school district does not have to offer a salary that allows teachers to afford to live in that district. It is only reasonable to presume that teachers, like the rest of us, will behave over time in an economically rational manner and seek employment where they can afford to live. Consequently, to accurately reflect the cost of providing education, the funding system must enable schools to pay higher salaries if required to by the local economic conditions. Housing costs, like the cost of other commodities, are driven by supply and demand. High demand, creating higher prices, may be caused by the quality of life a location provides or economic growth fueled by external forces such as the energy booms with which we in Wyoming are so familiar. A school funding system, 80 percent of which represents personnel costs, which ignores that economic reality cannot be cost-based. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\n[¶104] We question the logic of the state's position that a district's subjective \"amenity value\" can be accurately quantified and conclude it should not be considered an element of compensation. The record does not contain any evidence which would support an attempt to quantify cost differences based on a subjective amenity value. Many would consider communities like Lander, Sundance, or Cody to have tremendous amenity value yet the cost of living in those communities is below the state average. High housing costs in communities impacted by energy development may have little to do with amenities but instead reflect high demand. The focus must be upon what it reasonably costs a district to attract and maintain quality teachers. Therefore, we reject the use of an amenity value.\n\n[¶105] The trial court held removal of the housing and medical components from the WCLI \"undermined its validity,\" and the state failed to prove the amenity value of a location corresponded to the housing component of the index. The court recognized that whatever method was chosen by the legislature to reflect regional differences need not be perfect but must be a \"reasonably comprehensive measure of those differences.\" We affirm the trial court and hold § 21-13-309(o)(ii) unconstitutional and order statewide average salaries must be adjusted for the full cost-of-living differences using either the entire WCLI or another reasonable formula which includes a full housing component, including the rental of shelter costs, and a medical component to cover costs not included in the benefits portion of the salary component. This change shall be implemented on or before July 1, 2002.\n\nd) KINDERGARTEN ERROR\n\n[¶106] The trial court found:\n\nBoth the MAP prototype and the school funding legislation for the 1998-99 school year contained an error in the ADM calculation for kindergarten students. Kindergarteners were counted at a full rather than ½ ADM, even though they only attend school for half of the school day. \"While it seems counterintuitive, the ½ K correction actually increases funding per prototypical ADM count because the numerator (expenditures) remains the same while the divisor becomes smaller, thus reflecting the actual funding of ½ K ADM.\" The 1999 revision to the school finance system corrected the ½ K error by dividing the ADM for each district's kindergarten students by 2. W.S.A. § 21-13-309(m)(i), (p), and (s).\n\nThe school districts claim they are entitled to payment of those funds which they would have been entitled to if the legislation had properly accounted for kindergarten students during the 1998-99 school year. Every district was underfunded in varying amounts, for a statewide total of $13,930,000. In denying this claim, the trial court found the school districts had failed to show harm. This is an incorrect application of the strict scrutiny test burden of proof, and that burden was in fact the state's to show a compelling state interest.\n\n[¶107] The state does not dispute the error or the underfunding but essentially claims it is \"water under the bridge\" since that funding was for previous years and awarding it now would result in overfunding. However, if no elements of the model are overfunded, as Joseph H. Simpson, Deputy State Superintendent of Schools, testified and as we believe is the circumstance, the money to supplement for the kindergarten error had to come from some other school district fund whether it was accumulated reserves or other components.\n\n[¶108] The school districts' claim is not in the nature of a tort action, precluded as essentially the state suing itself. Carbon County School District No. 2 v. Wyoming State Hospital, 680 P.2d 773, 775 (Wyo. 1984). No damages per se are being sought, merely those funds necessary to fully fund the school districts and permit them to provide kindergartners with their fundamental right to an education. Stated another way, the school districts seek the funds which were necessary for the state to fulfill its obligation to educate, as administered by the school districts. We have, heretofore, in this opinion provided solely prospective remedies for the identified model adjustment deficiencies. However, the kindergarten error is not like these other claims, it is not based on a theoretical or legal dispute. It is an admitted mistake in calculation and recordation at a legislative level. The claim is more in the nature of a request for determination of correlative rights between state entities. Campbell County School District v. Catchpole, 6 P.3d 1275, 1287 (Wyo. 2000).\n\n[¶109] The state has the obligation to appropriate the necessary monies to fund the educational basket. It does so through a model which has no overfunded components. It acknowledged an error in the kindergarten component computation which caused it to underfund school districts in 1998-99 for this component. The school districts, as the local agents of the state charged with administration of the funds to supply the basket to children, had to somehow absorb the state's admitted failure to properly fund the kindergarten component. Logically, these funds came from either reserves or other components and thereby potentially endangered delivery of other aspects of the basket. Shrugging off this failure of the state as \"water under the bridge\" is wholly ineffectual and unacceptable.\n\n[¶110] We reverse the trial court's denial of the claim and order the legislature, on or before July 1, 2002, to make a one-time apportioned supplement to fully fund each school district's 1998-99 kindergarten component cost, in the total aggregate amount of the $13,930,000 funding error.\n\nII. Capital Construction\n\n[¶111] The capital construction finance system remains unchanged in its essential elements and continues to be tarred with the \"same brush of disparate tax resources.\" As a result, we affirm the trial court's decision and hold the current capital construction system to be unconstitutional.\n\n[¶112] Briefly, the state's position is that the Wyoming legislature has complied with what it interprets is required for the capital construction finance system: no deficient facilities. Apparently relying on the state grant and loan program, the state asserts that each and every school district in the State of Wyoming has available for building construction or remediation the total resources of the state to the extent needed to replace deficient facilities. According to the state, the capital construction financing reforms provide for the equal treatment of all the state's school districts, and wealth-based classifications do not exist. Therefore, the state argues the trial court's determination should be overruled and the capital construction financing system should be held constitutional.\n\n[¶113] In response, the school districts claim a comparison of the former capital construction financing scheme to the current scheme demonstrates that the state has made no substantive changes and has failed to eliminate local wealth-based disparities. The school districts contend the evidence presented in the record reveals that the unfunded capital construction needs of school districts continue to mount, and the record supports the trial court's findings and conclusions.\n\nA. Funding\n\n[¶114] The state contends that the Campbell disposition of capital construction was result-oriented and provided no guidance to the legislature as to the means of accomplishing the result. The state claims the legislature looked to local bonding as the solution because Hinkle plainly stated that \"each school district, acting separately, will have to provide financing for capital construction needs through bond issues\" and there can be no wealth-based disparity caused by bond financing. Accordingly, the state insists that this court has preapproved local bonded indebtedness as the sole method by which to finance capital construction without subsequent overruling in Washakie and Campbell. Hinkle is not authority for this contention, and this assertion is incorrect. As this court has stated during thirty years of jurisprudence in Hinkle, Washakie, and Campbell, Wyoming schools are the responsibility of the state as a whole and must be financed by the state as a whole.\n\n[¶115] Since Hinkle, we have offered a number of suggestions explaining how the legislature could achieve constitutional school financing. Hinkle was a very simple case centering around Bairoil, a rich school district. 491 P.2d at 1236. Bairoil had been aligned with Rawlins because of its close proximity; however, a Sweetwater County school district, in an effort to enhance its assessed valuation, attempted to unify with the Bairoil school district. Under facts vividly illustrating the harm of wealth-based disparities, Hinkle pointed out that relying upon local wealth to finance a state school system was unconstitutional. 491 P.2d at 1237. With much detail, Hinkle described the needed legislation required to resolve the unconstitutional wealth-based disparities. 491 P.2d at 1238. The state is correct that Hinkle did not disapprove of bonds issued locally; however, Hinkle cannot be read so simplistically as to believe that it limited capital construction funding to local school district bonding. At an early stage, Hinkle recognized the inherent inequities of school financing primarily dependent upon local wealth and declared it unconstitutional. Almost ten years later, this court again rejected these inherent inequities in Washakie.\n\n[¶116] As Washakie noted, local real and personal property taxes had remained the primary source of revenue for school districts. 606 P.2d at 323. Washakie held that unconstitutional inequalities in the educational opportunities available to Wyoming students were created when school districts' funding levels primarily depended upon local wealth. Noting that the state constitution only limited bonded indebtedness, Washakie stated that there is no constitutional requirement that school buildings must be built by creation of debt. It offered for consideration the option of a statewide reserve fund for building construction. 606 P.2d at 337.\n\n[¶117] Twelve years later, the situation remained unchanged, and Campbell reiterated this court's constitutional objections to the capital construction financing. At that time, an independent, state-commissioned study (MGT study) reported the schools' need for new construction, renovation, and repair totaled $275 million, and the legislature had designated a mere $5 million as capital funding. Campbell, 907 P.2d at 1274.\n\n[¶118] Campbell noted that, under the financing statutes then in place, the primary source of revenue for major capital facilities renovation and construction remained the sale of bonds paid for out of mills levied against a school district's assessed valuation. The constitution prohibits a school district from bonding beyond 10 percent of the assessed value of the school district. Wyo. Const. art. 16, § 5. Due to low assessed valuation, five Wyoming school districts exceeded 100 percent of legal bonded indebtedness, and less wealthy districts could not rely on bonds to finance needed capital construction because total bonding capacity was far less than needed funds. At that point, bonding was futile.\n\n[¶119] Campbell determined that post-Washakie legislative changes, in actual operation, had not removed the inequities from this vital part of the total educational package. The requirement of \"statewide availability from total state resources for building construction or contribution to school buildings on a parity for all school districts\" had been virtually ignored. Washakie, 606 P.2d at 337. Capital construction financing was unavailable for many. Campbell, 907 P.2d at 1275.\n\n[¶120] Campbell reiterated that safe and efficient physical facilities with which to carry on the process of education are a necessary element of the total educational process and state funds must be readily available for those needs. Id. Since 1971, this court has rejected wealth-based disparities, and, since 1980, this court has stated that deficient physical facilities deprive students of an equal educational opportunity and any financing system that allows such deficient facilities to exist is unconstitutional. Despite this, the state presents a capital construction financing scheme that is fundamentally unchanged, unconstitutionally wealth-based, and inadequate. Once again, we plainly state that any capital construction financing system based primarily upon a school district's assessed valuation necessarily means that the financing system is primarily dependent upon local wealth. The disparities in local wealth will produce unconstitutional disparities in educational opportunity if the school districts' funding options are a function of assessed valuation. Washakie's many recommendations had one aspect in common: change the financing basis from local wealth to the \"wealth of the state as a whole,\" as permitted by the state constitution, and collect revenues and redistribute them in a manner that ensures a constitutional education is delivered in a safe and efficient facility. 606 P.2d at 336.\n\n[¶121] Since Campbell, the legislature has again studied capital construction needs, and, as must have been expected, needs have risen dramatically and now stand at over $565,000,000 along with over $303,000,000 in deferred maintenance. More importantly, by the state's own assessment as well as the school districts', the percentage of inadequate facilities has risen and threatens the educational opportunity and quality of yet another generation of school children.\n\n[¶122] The legislature failed to enact any changes in capital construction financing legislation until 1999. That legislation required the DOE to establish standards for adequacy for new construction and an assessment program for existing facilities. Following assessment, school districts must be notified when a building appears on the list and must report proposed remedies back to the DOE. The DOE and its advisory committees notify the legislature when school districts either cannot or will not remedy the inadequacy because it has exceeded bonding capacity or voters refuse to pass bonds for funding. School districts can finance capital construction for deficient facilities in immediate need through either bond issuance that may earn them a state mill levy supplement for debt service \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e or through a lengthy, laborious application process for a state grant. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e A state grant is available only if a district is at least at 90 percent of bonded indebtedness. The grant proposal is submitted to the governor and legislature for consideration by the legislature with no assurance of approval. The state argues that, because the statutes require the DOE to define and identify inadequate facilities and to make recommendations to the legislature to eliminate those inadequacies, the statute makes the wealth of the state available to all schools. This argument fails for two reasons. First, districts which have not bonded to 90 percent, which is beyond their control, cannot qualify despite proven need. Second, the statute lacks any plan or mandate to assure legislative approval and ultimate funding. The record is devoid of evidence that the legislature has funded or intends to fund the undisputed deficiencies any time soon. Despite notice in 1998 in the MGT study that needs exceeded $565 million, the DOE recommended only $54.6 million between 1998 and 2001 and only $30 million has actually been appropriated by the legislature.\n\n[¶123] We perceive the state's failure to reform the capital construction financing system consistent with this court's direction in Washakie and Campbell is caused by the political difficulties created by such reforms. This situation, perhaps as much as any other in our state's history, underscores the need for and wisdom of three separate and independent branches of government. It is the duty of the judiciary to assure the mandates of our state constitution are followed even if it is politically unattractive. We repeat our long held conviction that any system that places the primary financial burden of providing constitutionally adequate facilities on the school districts through local mill levy taxation and local bonds is wealth-based and inherently inequitable. We again affirm that the state bears the burden of funding and providing constitutionally adequate facilities to school districts that provide an equal opportunity for a quality education. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e To date, the Wyoming legislature has limited school funding taxation to property taxes although nothing prohibits it from imposing other taxation or revenue raising mechanisms. That decision, however, is the prerogative of the legislature.\n\n[¶124] Having made the decision to fund schools by property taxation, however, the legislature is required by the state constitution to uniformly tax and assess property. Wyo. Const. art. 1, § 28; art. 15, § 11. Additionally, the taxation and revenue provisions of the Wyoming Constitution limit taxation levies, bonded indebtedness, and recapture amounts. Wyo. Const. art. 15, §§ 4, 5, 17; art. 16, §§ 1, 3, 5. Presumably because of these requirements and limitations, the present school financing statutes require a 12 mill statewide levy, a 6 mill county levy, and a 25 mill school district levy be imposed for funding of school finance operations. The levies are uniformly imposed by school district, meaning that each school district imposes a minimum of 43 mills. The legislature, however, does not impose any kind of statewide mill levy for capital construction financing. Since Washakie, the constitution was amended to authorize the legislature to \"recapture\" 75 percent of revenues generated by the local 25 mill school levy which exceeded an amount determined by formula. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The capital construction statutes contained in Wyo. Stat. Ann. §§ 21-15-105 to -112 (LEXIS 1999) do not direct that any recapture funds fund the state capital construction account established in § 21-15-111, and the operations finance statute, Wyo. Stat. Ann. § 21-13-102(b) (LEXIS Supp. 2000), appears to devote the local 25 mill school levy to school operations finance.\n\n[¶125] Instead, the present statutory scheme funds capital construction by placing the financial burden primarily on school districts through bonded indebtedness. School districts have not imposed bonded indebtedness levies uniformly. In 1998, fifteen school districts imposed no mill levies for bonding and interest, and thirty-three imposed levies ranging from 1.2 to 17.48. Additional mill levies are imposed which cause nonuniformity for the total number of school district mills levied. Those totals range from a low of 43 total mills levied to a high of 62.98 mills levied. We have recognized since Hinkle that this nonuniformity is directly caused by disparities in local wealth and is therefore unconstitutional. In addition, imposing the burden on the local school districts to tax locally to provide \"local enhancement\" denies the poorer districts the opportunity to fund \"local enhancement,\" as authorized by Campbell. Campbell did not define the term but suggested that local innovations could become the standard required for the state as a whole. Specifically, Campbell stated:\n\nThe constitution requires the legislature to create and maintain a system providing an equal opportunity to a quality education. That system must be a function of state wealth. Once the legislature achieves the constitutional mandate of a cost-based, state-financed proper education, then assuming the legislature has a compelling reason for providing a mechanism by which local districts may tax themselves in order to enhance their programs in an equitable manner, that appears to be constitutionally permissible. However, we inject two notes of caution. First, in Skeen, the two dissenting state supreme court justices did not believe strict scrutiny permits a local enhancement mechanism. Skeen[ v. Minnesota], 505 N.W.2d [299,] 322 [(Minn. 1993)] (Page, Gardebring, JJ, dissenting). Second, local enhancement may also result in substantive innovations which should be available to all school districts as part of a proper education. The definition of a proper education is not static and necessarily will change. Should that change occur as a result of local innovation, all students are entitled to the benefit of that change as part of a cost-based, state-financed proper education. 907 P.2d at 1274 (footnote omitted).\n\nCampbell discussed this concept after deciding the term \"local control\" could mean only a \"local role\" in implementing a legislatively defined proper education. Because school districts felt strongly that state control might result in \"dumbing down\" the education provided to students, Campbell defined the state's standard as the \"best we can do\" and then provided for \"local enhancement\" to ensure that deciding what a \"proper\" education was would remain dynamic and continue to evolve.\n\n[¶126] Regarding capital construction, Campbell clearly allows a school district to build facilities considered innovative or world-class with money raised locally or by property taxes not subject to recapture under the constitutional provision and then leaves it to the legislature to ensure that type of local enhancement does not ultimately create a disparity in equal educational opportunity. Campbell's discussion about a \"local role\" contemplated that, by requiring the legislature to define and fund the \"proper education,\" the role of a local school district would necessarily change from primarily deciding how to pay for the \"proper education\" with inadequate funds to the new and necessary role of raising funding for \"local enhancement\" in order to assure innovation.\n\n[¶127] The Wyoming Constitution does not prohibit the state from imposing a statewide mill levy taxation level for capital construction, nor does it limit the number of mills that can be levied for such a fund. Wyo. Const. art. 15, §§ 4, 15. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e It merely requires that it be uniform. Wyo. Const. art. 1, § 28; art. 15, § 11. Nothing in the state constitution prevents the legislature from raising the entire amount needed of more than $565 million for capital construction by enacting statutes imposing a new category of statewide mill levy for capital construction at whatever level is required to raise the desired amount of money, and, if it so desires, the legislature can act within any time frame including raising all funding in a single year.\n\n[¶128] Seizing on one sentence in Campbell, the state argues that the legislature's only constitutional obligation is to adopt a system that prevents \"deficient\" facilities. Although elimination of facilities deemed deficient according to state standards would go a long way toward meeting the constitutional mandate, equality of opportunity ultimately requires a rough measure of equality of facilities over time. Having allowed the disparities and deficiencies to develop over half a century, the legislature cannot realistically be expected to cure them quickly, and prioritizing its efforts to concentrate on truly deficient facilities is appropriate. However, all the affected parties should not lose sight of the constitutional mandate of equal opportunity, and any system ultimately adopted must be capable of providing essentially equal facilities to all Wyoming's school children over the long term.\n\n[¶129] We hold the legislature must fund the facilities deemed required by the state for the delivery of the \"full basket\" to Wyoming students in all locations throughout the state through either a statewide tax or through other revenue raising mechanisms equally imposed on all taxpayers. Individual districts may fund additional facilities deemed appropriate enhancements to the delivery of education in their respective districts with locally raised revenues. The state must assure that over time appropriate local enhancements are adopted as state required facilities as the standards for an adequate education evolve. In addition, local enhancements which are not appropriate as statewide standards must not result in disparities in educational opportunities that deny students an equal education \"appropriate for the times\" as required by the state constitution.\n\n2. Inadequacies\n\n[¶130] The legislature has financed two independent studies since 1995 that identified capital construction needs. Following Campbell's order that constitutionally adequate funding be provided to remedy these needs, the legislature should have understood that it was obligated to enact a resource allocation plan to rebuild Wyoming's schools over some reasonable period of time. It is insufficient to simply categorize and prioritize unmet needs by DOE regulations and then place the financial burden primarily on the school districts. The legislature is required to shoulder that burden and fund those needs with statewide revenues.\n\n[¶131] As the trial court found, the current grant and loan program does not address \"inadequate\" facilities nor does it ensure that even \"emergency\" or \"immediate needs\" funding will be provided at all or in a timely manner. In other words, the financing scheme has little relation to providing sufficient funds for what it actually costs to provide constitutionally adequate facilities. In fact, § 21-15-107(c) requires the state superintendent to annually identify school districts which are inadequate and in immediate need. As Richard H. Miller testified, in order for a project to qualify for aid under § 21-15-107(e), the facility must be both inadequate and in immediate need. This effectively excludes all buildings which are deemed \"inadequate\" but do not qualify as in \"immediate need\" from receiving state funds and, thus, fails to place the wealth of the state at stake to remedy admittedly inadequate facilities.\n\n[¶132] Pursuant to the DOE rules, a study by MGT scored all buildings in each school district based upon various categories of capital construction needs. Neither the challengers nor the state complains that either the complex methodology used to assess the facilities or the resulting assessment was flawed or inaccurate. The evidence was uncontroverted, and review of the assessment indicates it sufficiently identified those educational facilities which were deficient.\n\n[¶133] The DOE emergency rules in effect at the time of trial defined \"inadequate\" facilities in part as having a score of 69 or below (based upon a scale of 1-100) and \"immediate need\" facilities in part when scored \"poor\" or lower which is defined as 49 or below. To illustrate the existing deficiencies, a review of the scores for safety/building code systems compliance resulted in a score of a 46.26 out of 100. Furthermore, a review of scores for educational suitability \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e identified 40 school buildings that scored a 49 or below, requiring $18,736,693 to remedy the deficiencies. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e In addition, 138 buildings were identified with a score of 69 or below, requiring $52,666,525 to remedy the deficiencies. The statewide average for technological readiness \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e was determined to be 31.65 out of 100 despite the statutory requirement that schools provide programs in applied technology and computer applications. Section 21-9-101(b). Uinta County School District No. 4 received a technological readiness score of a 2.4, and Park County School District No. 16 and Converse County School District No. 2 each received a score of 10. To remedy those facilities that are in immediate need in technological readiness would require $26,475,754, and $31,982,542 would be required to remedy all facilities which are deemed inadequate. A total of $84,649,067 is required to remedy the facilities which have been found by the state to be inadequate and in immediate need of repair in both categories of technological readiness and educational suitability. Additionally, the study identified $67,251,450 as necessary funding to assure each school district will meet the required square footage standards established by the DOE. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\n[¶134] We agree with the particular methodology used in the MGT study and conclude that legislative adherence to the standards established by the DOE rules, which rely on that methodology, is required to assure \"[s]afe and efficient physical facilities with which to carry on the process of education.\" Campbell, 907 P.2d at 1275. The following tables illustrate the statewide overview of the needed repairs and renovations by category:\n\nEXHIBIT 9\n\nNEEDED REPAIRS BY SEVERITY OF BUILDING CONDITION STATEWIDE-ALL BUILDINGS\n\nCategories Subtotal Cumulative Total\n\nReplacement of Unsatisfactory Buildings (below 30) $4,190,457 $4,190,457\n\nBuildings in Poor Condition (30-39) $6,115,318 $10,305,775\n\nBuildings in Poor to Fair Condition (40-49) $41,646,164 $51,951,939\n\nBuildings in Fair Condition (50-59) $84,259,994 $136,211,933\n\nBuildings in Fair to Good Condition (60-69) $107,612,766 $243,824,699\n\nBuildings in Good Condition (70+) $121,055,140 $364,879,839\n\nEXHIBIT 10\n\nSUITABILITY COSTS BY CONDITION CATEGORY\n\nCategories Subtotal Cumulative Total\n\nReplacement of Unsatisfactory Buildings (below 30) $5,335,590 $5,335,590\n\nBuildings in Poor Condition (30-39) $3,411,313 $8,746,903\n\nBuildings in Poor to Fair Condition (40-49) $9,989,790 $18,736,693\n\nBuildings in Fair Condition (50-59) $16,600,625 $35,337,318\n\nBuildings in Fair to Good Condition (60-69) $17,329,208 $52,666,525\n\nBuildings in Good Condition (70+) $46,080,850 $98,747,375\n\nEXHIBIT 11\n\nTECHNOLOGY COSTS BY TECHNOLOGY CATEGORY\n\nCategories Subtotal Cumulative Total\n\nReplacement of Unsatisfactory Buildings (below 30) $16,605,706 $16,605,706\n\nBuildings in Poor Condition (30-39) $5,410,211 $22,105,918\n\nBuildings in Poor to Fair Condition (40-49) $4,459,837 $26,475,754\n\nBuildings in Fair Condition (50-59) $2,709,095 $29,184,849\n\nBuildings in Fair to Good Condition (60-69) $2,797,693 $31,982,542\n\nBuildings in Good Condition (70+) $2,251,010 $34,233,552\n\nEXHIBIT 12\n\nDISTRICTS AND GRADE GROUPINGS WHERE GROSS SQUARE FEET PER PUPIL IS BELOW STATE STANDARDS\n\nCounty/District Type Existing GSF GSF Per Standard Percent of Standard Amt. Where Below 100% of Standard\n\nAlbany 1 Middle 155,649 191,800 81% $2,711,325\n\nConverse 1 Elementary 101,162 104,020 97% $214,350\n\nFremont 1 Middle 56,000 64,575 87% $643,125\n\nFremont 25 Elementary\n\nMiddle\n\nHigh\n\n1,049,300\n\n574,350\n\n598,290\n\n168,140\n\n69,650\n\n172,410\n\n938,420\n\n514,850\n\nAmt. Where Below 75% of Standard\n\n$3,160,350\n\n$3,215,325\n\n$3,160,350\n\n$3,215,325\n\n$1,538,850\n\nGoshen 1 Elementary 89,800 93,380 96% $268,500\n\nLaramie 1 Elementary\n\nMiddle\n\nHigh\n\n121,802\n\n86,104\n\n194,102\n\n856,753\n\n470,396\n\n514,227\n\n164,742\n\n67,869\n\n104,210\n\n814,518\n\n491,950\n\n163,940\n\n128,975\n\n214,620\n\n74%\n\n67%\n\n90%\n\n82%\n\n82%\n\n86%\n\n98%\n\n97%\n\n60% $5,115,000\n\n87%\n\n96%\n\n$14,441,025\n\n$7,796,550\n\n$6,304,725\n\n$254,850\n\n$133,575\n\n$5,115,000\n\n$9,292,650\n\n$1,717,500\n\nPark 1 Elementary 97,321 119,700 81% $1,678,425\n\nSublette 1 Middle 22,365 26,775 84% $330,750\n\nSweetwater 2 High 198,739 249,690 80% $3,821,325\n\nTeton 1 Elementary\n\nMiddle\n\nHigh\n\nLincoln 2 Elementary\n\nMiddle\n\nHigh\n\nNatrona 1 Elementary\n\nMiddle\n\n$1,068,450\n\n$840,300\n\n$1,691,250\n\nWashakie 1 Elementary 97,790 111,300 88% $1,013,250\n\nTotals 5,005,189 5,901,875 85% $11,490,675 \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e $67,251,450\n\nThe following was taken from the statutorily required report pertaining to the School Capital Construction Program submitted to the legislature in November of 2000 by the state superintendent: \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\n113,154\n\n81,196\n\n105,340\n\n127,400\n\n92,400\n\n127,890\n\n89%\n\n88%\n\n82%\n\nNOVEMBER 2000\n\nSCHOOLS IN IMMEDIATE NEED OF CAPITAL CONSTRUCTION DISTRICT TOWN SITE NAME CONDITION\n\nBig Horn 4 Basin Hyatteville Elementary 44.45\n\nCampbell 1 Gillette Paintbrush, portable 1 49.00\n\nCampbell 1 Gillette Twin Spruce Jr. High, portable 3 48.00\n\nCampbell 1 Gillette Twin Spruce Jr. High, Parish 47.88\n\nCampbell 1 Gillette N.E. Vo-Tech main building 41.82\n\nCarbon 2 Saratoga Hanna Elementary 45.43\n\nCrook 1 Hullett Hullett K-12, main building 44.95\n\nCrook 1 Sundance Sundance Jr/Sr Little Red School House 46.15\n\nCrook 1 Sundance High School IV 37.21\n\nFremont 1 Hudson Hudson Elementary n/a\n\nFremont 1 Lander Lander H.S. n/a\n\nFremont 38 Arapahoe Dist-owned metal building 49.34\n\nGoshen 1 Ft. Laramie Ft. Laramie middle school 40.43\n\nGoshen 1 Torrington S.E. Jr/Sr Old gym 30.00\n\nGoshen 1 Torrington S.E. Jr/Sr Red Brick School 23.91\n\nGoshen 1 Torrington Torrington HS Auto Mechanic Bldg. 43.01\n\nJohnson 1 Buffalo Buffalo HS 48.34\n\nJohnson 1 Kaycee Kaycee, 7-12 31.49\n\nLaramie 1 Cheyenne Clark Building 43.48\n\nLaramie 1 Cheyenne Churchill Elementary 45.74\n\nLaramie 1 Cheyenne Churchill Elem. portable 33.33\n\nNatrona 1 Casper CY Junior High, portable #2 29.17\n\nNatrona 1 Casper CY Junior High, portable #3 31.58\n\nNatrona 1 Casper Natrona HS portable #2 20.00\n\nNatrona 1 Casper Kelly Walsh HS portable #2 37.50\n\nNatrona 1 Casper Grant School portable 33.33\n\nNatrona 1 Casper Garfield School 33.53\n\nNatrona 1 Casper Verda James Elementary 44.26\n\nNatrona 1 Casper East Junior High 47.72\n\nPark 1 Powell Powell HS pool/auditorium 41.25\n\nPark 1 Powell Powell HS main building 45.93\n\nSheridan 1 Ranchester Slack, main building 42.22\n\nSheridan 1 Ranchester Slack, kindergarten 48.86\n\nSheridan 2 Sheridan Woodland Park elem. main building 40.83\n\nSheridan 3 Arvada Arvada Elem. main building 46.08\n\nSweetwater 1 Rock Springs Rock Springs East Jr. High 48.96\n\nWashakie 1 Worland Worland Middle School 47.63\n\nWashakie 2 Ten Sleep Ten Sleep Elementary/Middle/High 45.00\n\nWeston 1* Osage Kitty Moats, K-8 45.19\n\n* The school district marked with an asterisk was included in the DOE's 2001 capital construction budget request.\n\n[¶135] The deficiencies, which have been illustrated by the DOE's study, cannot stand. The state cannot rely on an inadequately funded grant program, available only to a small percentage of districts with \"immediate needs\" which have bonded to 90 percent of their capacity, to correct this unacceptable, unconstitutional condition of our state's schools. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e According to Mr. Miller's testimony and the state's Exhibit I-1, the legislature in 1998-99 appropriated $4.2 million in state grants. The legislature appropriated $30,787,404 to be expended during the two years beginning July 1, 2000, and ending June 30, 2002, for capital construction. $20,940,612 of that amount was appropriated for a state capital construction grant to Weston County School District No. 1 for a new elementary and high school. $8,826,692 was appropriated for a state capital construction grant to Weston County School District No. 7 for a new high school. One million dollars was appropriated for 2002 state capital construction assistance as a \"place holder\" until the state superintendent's recommendation was received in November of 2000. 2000 Wyo. Sess. Laws ch. 76, § 205. The DOE's 2001 capital construction budget request totals $33,074,783, which funds the needs of only two districts. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e It is unclear how the state superintendent selected the schools that were fortunate enough to receive a recommendation and decided against seeking funding for the other multitude of schools that the DOE deemed inadequate. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e It would be fair to assume her assessment of what amount would be politically acceptable necessarily would have been a consideration as well as the required deduction from the needed amount the districts could raise if they bonded to 90 percent of their bonding capacity. This can hardly be considered putting the wealth of the state at risk.\n\n[¶136] In providing a remedy in similar cases involving the constitutionality of public school finance systems, courts have taken a number of approaches including detailing requirements and setting up timetables for compliance, \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e appointing a special master, \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e or providing an initial opportunity to present a plan that assures immediate attention to achieve constitutional compliance. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e In Campaign for Fiscal Equity, 2001 WL 96215, at *35, the court ordered the defendants to put in place school financing reforms designed to redress constitutional and regulatory violations. The court provided a specific date to implement those reforms. In addition, the parties were ordered to appear before the court on a specific date to describe the progress of their reforms. The court also retained jurisdiction over the matter for as long as necessary to ensure the constitutional and statutory/regulatory violations were corrected. In addition, the United States Supreme Court affirmed the broad equitable power of lower courts to remedy continuing constitutional violations, especially where there have been repeated opportunities to resolve the problems. Hutto v. Finney, 437 U.S. 678, 687-88, 98 S. Ct. 2565, 57 L. Ed. 2d 522 (1978). We find this authority persuasive, and, although we are extremely reluctant to direct specific action by the legislature, it is clear from the inaction on capital construction over the last several decades, despite explicit rulings by this court, that a stronger message is needed.\n\n[¶137] We order all facilities must ultimately be made safe and efficient. The goal for providing facilities which are safe and efficient is to attain a score of 90 or above for building condition, an educational suitability score and technological readiness score of 80 or above, and a score of 4 for building accessibility. These scores will assure each facility achieves a rating of \"good.\" The total cost identified in the MGT study to comply with this test is $563,099,986 in 1998 dollars. We recognize that realistically these capital construction costs ought to be phased in over time. As a result, we hold that the legislature must provide a plan by July 1, 2002, to remedy these deficiencies within 6 years. In the interim, those facilities which are identified as in immediate need must be given the highest priority. In addition, we will presume that any facility which falls below the established square footage requirements is in immediate need and must also be given the highest priority. We order immediate need facilities and those facilities that fall below the square footage requirements must be remedied within two years which computes to $164,415,836 in 1998 dollars which will need to be adjusted for inflation at such time as the grants are made. Facilities that are deemed inadequate must be remedied within four years which computes to an additional $231,309,380. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nCONCLUSION\n\n[¶138] We recognize and respect the substantial time and effort expended by the legislature over the years in an effort to reform our state's public school finance system. We also note that much of this effort took place in an environment of tax revenue shortfalls. However, as Campbell made so very clear, the constitution provides that education funding is a fundamental right of our citizens and \"lack of financial resources will not be an acceptable reason for failure to provide the best educational system.\" 907 P.2d at 1279. We have reached the point where we can no longer allow the youth of Wyoming to be denied their constitutional right to an education \"appropriate for our times.\"\n\n[¶139] This case clearly demonstrates the quality of education is profoundly impacted by class size. As noted above, the evidence contained in the record supports the legislature's ultimate decision which provides class sizes that are not unreasonable at this time, although they clearly are not the most favorable of those proposed and considered. We conclude the state carried its burden to establish the school finance system is capable of fulfilling Wyoming children's fundamental constitutional right to an education \"appropriate for the times.\" But this holding is qualified as the adequacy of the finance system is wholly dependent on the state taking action to accomplish the modifications of the operational finance system as outlined in this opinion as soon as possible but, in any event, no later than July 1, 2002.\n\n[¶140] Nothing in this decision shall be construed in such a manner as to interfere with, impair, or adversely affect existing bond obligations of the various school districts throughout the state. Recognizing the time required to remedy the constitutional deficiencies in the statutes, we authorize school districts to continue to exercise their statutory authority to raise revenues to address capital construction needs in the interim.\n\n[¶141] Affirmed in part, reversed in part, and remanded for further proceedings consistent with this opinion. The trial court shall retain jurisdiction over this matter until the legislature has shown compliance with this court's order on or before July 1, 2002.\n\n\u003cspan class=\"fn\"\u003e1. What the United States Supreme Court said nearly fifty years ago remains true today: Today, education is perhaps the most important function of state and local governments. Compulsory school attendance laws and the great expenditures for education both demonstrate our recognition of the importance of education to our democratic society. It is required in the performance of our most basic public responsibilities, even service in the armed forces. It is the very foundation of good citizenship. Today it is a principal instrument in awakening the child to cultural values, in preparing him for later professional training, and in helping him to adjust normally to his environment. In these days, it is doubtful that any child may reasonably be expected to succeed in life if he is denied the opportunity of an education. Such an opportunity, where the state has undertaken to provide it, is a right which must be made available to all on equal terms. Brown v. Board of Education of Topeka, 347 U.S. 483, 493, 74 S. Ct. 686, 98 L. Ed. 873 (1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"Taking judicial notice of official reports of the state department of education, which we are privileged to do, we are made aware that this inequality ranges from a situation where in the Bairoil district a levy of one mill will bring in $351 per pupil, while in the Star Valley district (Lincoln County) a levy of one mill will bring in $4.70 per pupil.\" Sweetwater County Planning Committee for Organization of School Districts v. Hinkle, 491 P.2d 1234, 1237 (Wyo. 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. A complete summary of the legislative changes post-Washakie is contained in Campbell County School District v. State, 907 P.2d 1238 (Wyo. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. A detailed summary of the legislature's actions is contained in the trial court's Findings of Fact, Conclusions of Law, and Order dated December 31, 1997.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. There is a disputed fact in the evidence as to whether the average salary figures used by MAP were based upon the actual school expenditures for 1995-96 or 1996-97. The trial court found the 1996-97 actual expenditures were utilized to determine the component costs. We defer to this finding. Brown v. State, 944 P.2d 1168, 1170 (Wyo. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The total budget figure of $76,368,331 represents permanent plan funding without the cap of 115 percent and hold harmless floor of 90 percent as contemplated by the MAP 3 model transition plan funding. If applied as proposed by MAP, the cap would have prevented any district from receiving more than 115 percent of its previous year funding, and the 90 percent hold harmless floor would have prevented any district from receiving less than 90 percent of its previous year funding. The transition plan total budget figure, with the cap and floor applied, would have been $60,763,354. The transition period would be complete, and caps and hold harmless floor provisions would no longer be effective, in year 2000-2001.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. External cost adjustment is an adjustment made for inflation. In the course of this opinion, references to these two concepts will be used interchangeably.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The state has argued that the additional funding of $60 million accounted for inflation. However, it also claims the increased funding resulted in smaller classes and more teachers than originally provided in the 1997 legislation. The state cannot have it both ways. Since all the parties and the trial court credited the state with the smaller class size, we will do the same and consider the additional funding as accomplishing that result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Laramie County School District No. One and Natrona County School District No. One.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. At the time of Campbell, the state had reported needs of $275 million in capital construction and only $5 million had been designated by the state at that time for capital construction. Campbell, 907 P.2d at 1254.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Under the old funding system for 1995-96, Sheridan County School District No. 3 received $13,031 per student while Park County School District No. 6 received $4,898 per student. Under the current system for 1999-2000, Sheridan County School District No. 3 receives $16,219 per student while Park County School District No. 6 receives $6,203 per student.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Graduation standards are phased in over the next five years presumably because schools have not been providing students with the education necessary to meet these standards and need time to adjust their programs accordingly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Three panels (red, white, and blue panels) reviewed three funding levels for large middle schools of 300 students and high schools of 600 students. The fourth panel (green panel) reviewed the legislative funding as existed for small schools.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The \"white team\" used course materials from Crete, Nebraska, and Montana panel members assumed the curriculum would be similar to their own when, in fact, many differences exist.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In Campaign for Fiscal Equity v. State, 2001 N.Y. Slip Op. 21051, 2001 WL 96215, at *22 (N.Y. Sup. Jan. 9, 2001), the court recognized testimony that there was a clear statistically significant association between the performance of students and the salaries paid to teachers within a school district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Using 1995-96 data, Wyoming, ranked 38 th nationally and was second in the region only to Colorado and ahead of Nebraska, Idaho, Utah, and Montana. However, using 1997-98 data, Wyoming, in addition to Colorado, slipped behind its neighbors Utah, Idaho, and Nebraska in classroom salaries and ranked 42 nd nationally.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In Campaign for Fiscal Equity, 2001 WL 96215, at *23, the Supreme Court of New York noted that New York expected a need to fill 41,000 to 54,000 teacher slots in the next four years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The validity of the regional cost-of-living adjustment is in question and addressed more fully below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. MAP continually referred to an acceptable class size \"range\" within which the legislature could choose. However, the MAP 3 class sizes were the only ones endorsed by Wyoming educators.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. MAP 3 provided for class sizes of 16 for elementary schools.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. National Assessment of Educational Progress - an assessment which specifically permits comparison to students nationwide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This conclusion is difficult to understand because DOE's \"Statewide School Facilities Assessment\" report, concluded in December 1997, thoroughly examined and cataloged all school facilities in the state, including square footage and condition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The state's suggestion that a reimbursement approach would encourage schools to be wasteful and retain unnecessary buildings is without support in the record. However, if the legislature believes state oversight is necessary to avoid that possibility, it has the authority to accomplish that oversight.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The MAP report states that \"[m]ore than 80 percent of Wyoming's elementary students attend schools that have 200 students or more. Indeed, more than 20 percent of students attend elementary schools that are larger than 400 students. Similar patterns emerge for both middle and high schools.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. LES is also referred to as ESL which means English as a second language.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In Campaign for Fiscal Equity, 2001 WL 96215, at *61, the court evaluated the funding of New York's at-risk children and stated: \"[T]hese formulas and weightings do not accurately account for the costs of education caused by large numbers of at risk students in a single district.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The only other evidence concerning an actual cost of providing programs for EDY was Kentucky's funding at 15 percent greater than its foundation program which would have generated $800-$900 per disadvantaged student in Wyoming which MAP, apparently concerned about the cost, advised Wyoming to phase in over time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. We agree with the trial court that the legislation need not provide categorical funding for \"behaviorally disordered\" or \"compensatory education.\" Rather these needs are subsumed with other categories. Compensatory education is based on the notion that we can compensate for poverty through education. Compensatory education arose in connection with federal programs, from which Wyoming is a beneficiary. According to Dr. Guthrie, the EDY component of the MAP model is intended to cover compensatory education.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The 3 percent assumption is based upon a broader measure of intelligence and talent than other recognized measures which assume only 2 percent of students are gifted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. This language was set forth in the Wyoming Education Finance Issues Report, Programs for Students with Special Needs (Disadvantaged, Limited English Proficient, Gifted) issued by MAP on May 18, 1998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Since 1995, both state and national annual inflation rates have been documented as follows: WCLI (Wyoming Cost of Living Index) CPI-U (Consumer Price Index/West) Quarter/Year Percent Quarter/Year Percent 2/99 - 2/00 4.3 June 99-June 00 3.7 4/98 - 4/99 3.1 Dec. 98-Dec. 99 2.7 4/97 - 4/98 2.2 Dec. 97-Dec. 98 1.6 4/96 - 4/97 2.9 Dec. 96-Dec. 97 1.7 4/95 - 4/96 4.8 Dec. 95-Dec. 96 3.3 State of Wyoming, Department of Administration and Information, Division of Economic Analysis, 1997, 1998, 1999, 2000, and U.S. Department of Labor, Bureau of Labor Statistics. Annual inflation rates document the erosion of purchasing power. The WCLI and CPI represent actual inflationary increases between the dates as recorded. For example, the 4/95 - 4/96 WCLI increase of 4.8 indicates a 4.8 percent inflationary increase from the fourth quarter of 1995 to the fourth quarter of 1996.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. As previously noted in note 8, supra, the state points out that education funding was increased from 1997 to 1999 by $60 million. However, the class size funded in 1997 was also larger than any MAP recommendation, and that class size was reduced in 1999 causing a substantial increase in cost. It is clear that the $60 million enhancement did not address inflationary cost increases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Lawrence O. Picus, Ph.D., testified at the 1999 trial that an external cost adjustment should ideally be applied every year but, when inflation is running as low as in the past years, an adjustment every other year might also be acceptable. Professor Shelby Gerking, a University of Wyoming economist hired as a consultant by LSO to develop an external cost adjustment, testified in the same manner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The necessary small school definition is defined so as to only allow one small school in a quarter mile radius area. Wyo. Stat. Ann. § 21-13-318(a)(ii) (LEXIS 1999). That quarter mile radius area is similar to the municipal divisor struck down in Campbell. It is structured to phase out over a three-year period. Nevertheless, we agree with the trial court that this provision violates the equal protection provisions of our constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The court observes this is a novel manner in which to draft important legislation. This imprecise approach, adopting a critical formula by reference to a vaguely described document located in an agency office, certainly raises questions as to the accessibility to the public.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. No explanation is given why school activities are \"fixed costs.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Wyo. Stat. Ann. § 21-13-327 (LEXIS 1999) phases in the 100 percent reimbursement of utilities, food services, and activities over a three-year period for small schools established after July 1, 1998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. These adjustments have the potential of perpetuating the previous small school bias in the old system noted by MAP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. We can foresee an argument that some school districts spend excessively on school activities due to local preferences. Again, the state has authority to set standards for school activities and decline to fund those activities which do not meet the standards. If school districts determine additional activities are desirable, although not authorized by state standards, those activities may be funded by a local funding enhancement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Compounding the arbitrariness of the remote attendance center adjustment, such schools are defined by zip codes leaving remote centers located within the same zip code with the misfortune of being excluded from the funding even though, according to the state, they incur unfunded costs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The WCLI is computed by the Department of Administration and Information on a semi-annual basis for each county of the state and uses weighting factors to determine the relative importance of the various items in a consumer market basket as developed by the Bureau of Labor Statistics in its construction of the national Consumer Price Index.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. MAP concurs in this assumption and offers as evidence the fact that some districts were accumulating surpluses indicating they had more money to use for salaries and chose not to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. In Campaign for Fiscal Equity, 2001 WL 96215, at *60, the court recognized that \"[s]chool districts face signific ant variation in costs to deliver educational services, which in turn affects their ability to pay for various educational inputs.\" The court noted longstanding recommendations had been made by various blue ribbon panels to include regional cost estimates in the state aid formulas and the State Education Department had concluded that \"[t]he failure to explicitly recognize geographic cost differences within the major operating aid formulas has led to formula allocations which are inequitable.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The state argued Teton County, the district challenging the cost-of-living adjustment, did not prove it was suffering under the existing adjustment which excluded housing. The trial court made no findings on that point and concluded the adjustment was invalid for other reasons. Although substantial evidence was introduced concerning the harm to Teton County's schools which we find both persuasive and not surprising, the burden of proof was on the state to prove the system's disparities were cost-based, not upon the schools to prove harm. We note that, pursuant to Wyo. Stat. Ann. § 9-2-109(e) (LEXIS 1999), the compensation commission recommended a housing allowance for state employees working in Teton County of $678.75 effective July 1, 2000, to offset the higher cost of housing in Teton County, apparently recognizing the cost of hiring state employees in that location was higher than others. In contrast, the legislature's regional cost adjustment for Teton County teacher salaries only results in approximately $355 per teacher under the prototypical model, approximately one half of what is allocated for state employees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The trial court explained the mill levy supplement program: The mill levy supplement requires districts to levy two unequalized mills before they are eligible to receive the supplement. When districts qualify for the supplement, the third mill is then equalized to the level of 150% of the statewide average per adm. The mill levy supplement program does not alter the constitutional debt limitation, but rather serves to speed repayment of a district's current bonded indebtedness. Thus, the mill levy supplement does not resolve the problem of insufficient bonding capacity in districts with comparatively low assessed valuations. Districts with needs beyond their bonding capacity must, therefore, resort to an alternative funding source. In Campbell, we determined that the amount of money raised by local optional mills, in place at the time, was totally dependent upon the local wealth of individual school districts and the presence of such wealth bore no relationship to the expense of educating students in any particular community. The mill levy supplement program is fraught with the same wealth-based disparities. As we stated in Campbell, 907 P.2d at 1269: \"Property taxes, levied against assessed property valuation, generate different amounts of revenue for each school district since the assessed property valuation of each school district varies.\" The remarkable inequities that have arisen from the current capital construction finance system are illustrated in the Statistical Report Series No. 1 - 1998 School District Property Valuations, Mill Levies and Bonded Debt, a report prepared by the DOE. The report reveals the disparate assessed valuations of each school district. In Wyoming, there is a disparity in the assessed county valuation of $1,495,260,165 in Campbell County to $33,275,890 in Niobrara County. In context, this means that a mill levied in Campbell County would yield approximately $1.5 million a year while a mill levied in Niobrara County would yield approximately $33,000. At trial, Dr. Picus and Richard H. Miller each testified as to the effects of such disparity which is that, with voter approval, if there is enough local wealth, a school district could build a world-class school. On the other hand, a school without such wealth and bonding capacity would not be able to build a similar school.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The trial court accurately explained the grant program: The grant application process involves submission of a request to the Wyoming Department of Education, review by an advisory committee, review by the State Superintendent and, if approved, submission to the Governor and Legislature for consideration. See W.S.A. § 21-15-111. At any step along the way, funding for the proposed project may be reduced or eliminated. The grant program requires districts to bond at 90% of their assessed valuation and demonstrate that proposed capital construction projects will remediate or replace facilities which have been determined to be not only \"inadequate\" but also \"in immediate need of capital construction.\" See W.S.A. § 21-15-111 (c) and (e). The grant program makes significant progress toward the goal of eliminating wealth disparity, but it falls short for several reasons. First wealthy districts are free to use local wealth to meet any need the voters may approve without being subjected to the substantial set of limitations imposed upon the other districts. Second, unlike the wealthy districts, the others must nearly exhaust their bonding capacity before they can even apply for a grant. See W.S.A. § 21-15-111(e). Districts with comparatively low assessed valuations do not have equal access to the State's wealth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In Campaign for Fiscal Equity, 2001 WL 96215, at *56, the defendants in the case argued the state had increased its contribution to the City of New York's public schools in recent years while the city's local effort had declined since 1986. The court's response was that \"the State Constitution reposes responsibility to provide a sound basic education with the State, and if the State's subdivisions act to impede the delivery of a sound basic education it is the State's responsibility under the constitution to remove such impediments.\" As the New York Court of Appeals had earlier explained: \"[T]he Education Article imposes a duty on the Legislature to ensure the availability of a sound basic education to all the children of the State.\" Campaign for Fiscal Equity, Inc. v. State, 655 N.E.2d 661, 665 (N.Y. 1995). The New York Supreme Court continued: \"The State's power over education is plenary.\" 2001 WL 96215, at *56. We find this logic to be convincing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Article 15, Section 17 of the Wyoming Constitution (emphasis added) provides: There shall be levied each year in each county of the state a tax of not to exceed six mills on the dollar of the assessed valuation of the property in each county for the support and maintenance of the public schools. This tax shall be collected by the county treasurer and disbursed among the school districts within the county as the legislature shall provide. The legislature may authorize boards of trustees of school districts to levy a special tax on the property of the district. The legislature may also provide for the distribution among one or more school districts of not more than three-fourths of any revenue from the special school district property tax in excess of a state average yield, which shall be calculated each year, per average daily membership.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Article 15, Section 4 provides: For state revenue, there shall be levied annually a tax not to exceed four mills on the dollar of the assessed valuation of the property in the state except for the support of state educational and charitable institutions, the payment of the state debt and the interest thereon. Article 15, Section 15 provides: For the support of the public schools in the state there may be levied each year a state tax not exceeding twelve mills on the dollar of the assessed valuation of the property in the state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Educational suitability identifies the degree to which a facility is suitable for the education program being offered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. We must make it clear that the deficiencies noted in the record are based on the MGT study which has not been updated in three years. The figures and deficiencies we note are merely illustrations. Undoubtedly, the figures and deficiencies have not remained the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Technological readiness assesses the required infrastructure to support informational technology and the associated equipment, usually computers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The standard for school and classroom size for existing sites is as follows: elementary schools - minimum of 140 gross square feet per pupil; middle/junior high schools - minimum of 175 gross square feet per pupil; senior high schools - minimum of 210 gross square feet per pupil. Department of Education Rules for Site Selection and School Construction for Wyoming Public School Buildings ch. XVII (General Provisions), § 7 (Standards for School Classroom Size) (1/15/01).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. \"This amount is needed for districts that have less than 75 percent of the state standards. At less than 75 percent of current standards, these districts did not meet the old state standards.\" MGT of America, Inc., Wyoming Department of Education Statewide School Facilities Assessment at xiii (1/26/98).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. It is within this court's prerogative to take judicial notice of the official reports of state agencies. Dellapenta, 838 P.2d at 1159 (citing Washakie, 606 P.2d at 322 n.16; Hinkle, 491 P.2d at 1237).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. We do recognize that designing and planning school construction takes time and many of these schools may be in different stages of that process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. The budget request includes funding for Weston County School District No. 1 and Weston County School District No. 7. We reiterate that it is within this court's prerogative to take judicial notice of the official reports of state agencies. Dellapenta, 838 P.2d at 1159 (citing Washakie, 606 P.2d at 322 n.16; Hinkle, 491 P.2d at 1237).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. We also note that districts must first meet 90 percent of their bonding capacity which may or may not occur.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. See Jones v. Wittenberg, 440 F. Supp. 60 (N.D. Ohio 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. See Palmigiano v. Garrahy, 443 F. Supp. 956, 986-89 (D. R.I. 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. See Holt v. Sarver, 309 F. Supp. 362, 385 (E.D. Ark. 1970), aff'd, 442 F.2d 304 (8 th Cir. 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. We recognize the need for state oversight to ensure funding requests are appropriate. However, we strongly caution against using state oversight as a mechanism to reduce funding or to impede the ability to satisfy needs sufficiently established by the MGT study. The state may not second-guess what facilities have already been held deficient by this court and the trial court based upon the state's own uncontroverted evidence.\u003c/span\u003e\n\n",
    "body_length": 174734,
    "citedas": [
      "2001 WY 19"
    ],
    "attorneys": "Representing State of Wyoming, et al.:Rowena L. Heckert, Deputy Attorney General; Raymond B. Hunkins, SpecialAssistant Attorney General, of Jones, Jones, Vines \u0026 Hunkins, Wheatland, Wyoming;and Jack B. Speight, Robert T. McCue, and Dominique D. Y. Cone of Hathaway,Speight \u0026 Kunz, Llc, Cheyenne, WyomingRepresenting Laramie County School District No. One:Paul J. Hickey and Richard D. Bush of Hickey, Mackey, Evans and Walker,Cheyenne, WyomingRepresenting Natrona County School District No. One:Stuart R. Day and Kevin D. Huber of Williams, Porter, Day \u0026 Neville, P.C., Casper,WyomingRepresenting Campbell County School District, Sweetwater County School District No.One, Sweetwater County School District No. Two, and Uinta County School District No.One:Ford T. Bussart and Marvin L. Tyler of Bussart, West, Piaia \u0026 Tyler, Rock Springs,WyomingRepresenting Teton County School District No. One:Sara E. Van Genderen and R. Michael Mullikin of Mullikin, Larson \u0026 Swift Llc,Jackson, WyomingRepresenting Big Horn County School District No. One:Timothy J. Kirven of Kirven and Kirven, P.C., Buffalo, Wyoming; CatherineMacPherson of MacPherson Law Offices, Llc, Rawlins, Wyoming; and Gerald R.Mason of Mason \u0026 Graham, P.C., Pinedale, WyomingRepresenting Wyoming Education Association:Patrick E. Hacker and Gregory P. Hacker of Patrick E. Hacker, P.C., Cheyenne,Wyoming",
    "category": [
      "124"
    ],
    "judges": "Lehman, C.J.; Golden and Kite, JJ.; and Dan Spangler, D.J. (ret.)",
    "citation_count": 0
  }
}
