{
  "id": "JoJBPmYBTlTomsSBEYD4",
  "document": {
    "title": "United States v. Tipton",
    "full_title": "UNITED STATES OF AMERICA v. RICHARD TIPTON, A/K/A WHITTEY . UNITED STATES OF AMERICA V. CORY JOHNSON, A/K/A \"O\", A/K/A \"CO\" . UNITED STATES OF AMERICA V. JAMES H. ROANE, JR., A/K/A J.R. . UNITED STATES OF AMERICA V. RICHARD TIPTON, A/K/A WHITTEY; CORY JOHNSON, A/K/A \"O\", A/K/A \"CO\"; JAMES H. ROANE, JR., A/K/A J.R. . UNITED STATES OF AMERICA V. RICHARD TIPTON, A/K/A WHITTEY .",
    "jurisdiction": "Fourth Circuit",
    "date": "1996-07-08T00:00:00.000Z",
    "docket": "No. 93-4005, No. 93-4006, No. 93-4007, No. 93-4009, No. 93-4010",
    "body": "PHILLIPS, Senior Circuit Judge:\n\nRichard Tipton, Cory Johnson, and James Roane were tried to a jury on a 33-count indictment charging each with a number of federal crimes, including capital murder, growing out of their concerted drug-trafficking activities, principally in Richmond, Virginia during a several-year period.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Each was convicted on multiple charges, including capital murder; each was sentenced to death on one or more of the capital murder charges on which he was convicted and to various terms of imprisonment on other charges. Each has appealed challenging his conviction on various of the charges against him and the sentence(s) of death imposed upon him. Save for the necessity imposed by double jeopardy concerns to vacate their several convictions for drug conspiracy violations under 21 U.S.C. § 846, we find no error requiring reversal or remand among those assigned by appellants and we therefore affirm their respective convictions and sentences in all other respects.\n\nThe Government has cross-appealed the district court's order staying execution of the death sentences pending Congressional authorization of the means of execution. We vacate that order and remand for entry of appropriate orders.\n\nI.\n\nRecounted in summary form and in the light most favorable to the Government, the core evidence revealed the following. Tipton, Roane, and Cory Johnson were principal \"partners\" in a substantial drug-trafficking conspiracy that lasted from 1989 through July of 1992. The conspiracy's operations began in Trenton, New Jersey where Johnson and Tipton, both from New York City, became members. In August of 1990, the conspiracy expanded its operations to Richmond, Virginia where Roane joined the conspiracy in November of 1991. The Trenton-based operation came to an end on June 4, 1991 when police confiscated a large quantity of crack cocaine and firearms. In late 1991, the conspiracy's operations were expanded from the Central Gardens area of Richmond to a second area in Richmond called Newtowne.\n\nDuring the period of the conspiracy's operation, its \"partners\", including appellants, obtained wholesale quantities of powdered cocaine from suppliers in New York City, converted it by \"cooking\" into crack cocaine, then packaged it, divided it among themselves, and distributed it through a network of 30-40 street level dealers, \"workers.\" Typically, the appellants and their other partners in the conspiracy's operations took two-thirds of the proceeds realized from street-level sales of their product.\n\nOver a short span of time in early 1992, Tipton, Cory Johnson, and Roane were variously implicated in the murders of ten persons within the Richmond area--all in relation to their drug-trafficking operation and either because their victims were suspected of treachery or other misfeasance, or because they were competitors in the drug trade, or because they had personally offended one of the \"partners.\"\n\nOn January 4, 1992, Tipton and Roane drove Douglas Talley, an underling in disfavor for mishandling a drug transaction, to the south side of Richmond. Once there, Roane grabbed Talley from the rear while Tipton stabbed him repeatedly. The attack lasted three to five minutes and involved the infliction of eighty-four stab wounds to Talley's head, neck, and upper body that killed him.\n\nOn the evening of January 13, 1992, Tipton and Roane went to the apartment of Douglas Moody, a suspected rival in their drug-trafficking area, where Tipton shot Moody twice in the back. After Moody fled by jumping through a window, both Tipton and Roane pursued. Roane, armed with a military-style knife retrieved from an apartment where the knife was kept for co-conspirator Curtis Thorne, caught up with Moody in the front yard of the apartment where he stabbed him eighteen times, killing him.\n\nOn the night of January 14, 1992, Roane, Cory Johnson, and a third person retrieved a bag of guns that they had left at an apartment earlier that day. Roane then located Peyton Johnson, another rival drug dealer, at a tavern. Shortly after Roane left the tavern, Cory Johnson entered with another person and fatally shot Peyton Johnson with a semi-automatic weapon.\n\nOn January 29, 1992, Roane pulled his car around the corner of an alley, got out of the vehicle, approached Louis Johnson, whom appellant Johnson thought had threatened him while acting as bodyguard for a rival dealer, and shot him. Cory Johnson and co-conspirator Lance Thomas then got out of Roane's car and began firing at Louis Johnson. As Louis Johnson lay on the ground, either Cory Johnson or Thomas shot him twice at close range. Louis Johnson died from some or all of these gunshot wounds.\n\nOn the evening of February 1, 1992, Cory Johnson and Lance Thomas were told that Roane had gone to the apartment of Torrick Brown, with whom Roane had been having trouble. Johnson and Thomas armed themselves with semi-automatic weapons and went to the apartment where they joined appellant Roane outside. The three then knocked on Brown's door and asked his half-sister, Martha McCoy, if Brown was there. She summoned Brown to the door and Cory Johnson, Roane, and Thomas opened fire with semi-automatic weapons, killing Brown and critically wounding McCoy.\n\nIn late January, 1992, after being threatened by Cory Johnson for not paying for a supply of crack cocaine, Dorothy Armstrong went to live with her brother, Bobby Long. On February 1, Cory Johnson learned from Jerry Gaiters the location of Long's house. Thereafter, Tipton and an unidentified \"young fellow\" picked up Gaiters and Cory Johnson who were then driven by Tipton to a house where the group obtained a bag of guns. After dropping off the unidentified third party, the group proceeded to Long's house. Upon arriving at Long's house, Cory Johnson and Gaiters got out of the car and approached the house. While Tipton waited in the car, Cory Johnson and Gaiters went to the front door. When Long opened the door, Cory Johnson opened fire, killing both Dorothy Armstrong and one Anthony Carter. Bobby Long fled out the front door, but was fatally shot by Cory Johnson in the front yard.\n\nIn early February 1992, Cory Johnson began to suspect that Linwood Chiles was cooperating with the police. On February 19, 1992, Johnson borrowed Valerie Butler's automobile and arranged to meet with Chiles. That night, Chiles, Curtis Thorne, and sisters Priscilla and Gwen Greene met Cory Johnson and drove off together in Chiles's station wagon. Chiles parked the car in an alley, and Tipton soon drove in behind it in another car, got out, and came up alongside the stationwagon. With Tipton standing by, Cory Johnson told Chiles to place his head on the steering wheel and then shot Chiles twice at close range. Additional shots were fired, killing Thorne and critically wounding both of the Greene sisters. The autopsy report indicated that Thorne had been hit by bullets fired from two different directions.\n\nTipton was charged under 21 U.S.C. § 848(e) and 18 U.S.C. § with capital murder for eight of these killings (Talley, Moody, Louis Johnson, Long, Carter, Armstrong, Thorne, and Chiles); Cory Johnson, with seven (Louis Johnson, Long, Carter, Armstrong, Thorne, Chiles, and Peyton Johnson); and Roane, with three, (Moody, Louis Johnson, and Peyton Johnson).\n\nThe jury convicted Tipton of six of the eight capital murders with which he was charged under § 848(e) (Talley, Armstrong, Long, Carter, Chiles, and Thorne). One of the other two § 848(e) charges was dismissed (Louis Johnson) and the other resulted in acquittal (Moody). Tipton was also convicted of conspiracy to possess cocaine base with the intent to distribute (21 U.S.C. § 846), engaging in a CCE (21 U.S.C. § 848(a)), eight counts of committing acts of violence (the eight killings charged under § 848(e)) in the aid of racketeering activity (18 U.S.C. § 1959), two counts of using a firearm in relation to a crime of violence or a drug-trafficking crime (18 U.S.C. § 924(c)), and two counts of possessing cocaine base with intent to distribute (21 U.S.C. § 841(a)(1)).\n\nThe jury convicted Cory Johnson of all seven of the capital murders with which he was charged under § 848(e) (Louis Johnson, Long, Carter, Armstrong, Thorne, Chiles, and Peyton Johnson). He was also convicted of conspiracy to possess cocaine base with the intent to distribute (21 U.S.C. § 846), engaging in a CCE (21 U.S.C. § 848(a)), eleven counts of committing acts of violence (including the seven killings charged under § 848(e)) in aid of racketeering activity (18 U.S.C. § 1959), five counts of using a firearm in relation to a crime of violence or drug-trafficking offense (18 U.S.C. § 924(c)), and two counts of possession of cocaine base with the intent to distribute (21 U.S.C. § 841(a)(1)).\n\nThe jury convicted Roane of all three of the capital murders with which he was charged under § 848(e) (Moody, Peyton Johnson, and Louis Johnson.) He was also convicted of conspiracy to possess cocaine base with the intent to distribute (21 U.S.C. § 846), engaging in a CCE (21 U.S.C. § 848(a)), five counts of committing acts of violence (including the three killings charged under § 848(e)) in aid of racketeering activity (18 U.S.C. § 1959), four counts of using a firearm in relation to a crime of violence or a drug-trafficking offense (18 U.S.C. § 924(c)), and one count of possession of cocaine base with the intent to distribute (21 U.S.C. § 841(a)(1)).\n\nFollowing a penalty hearing on the capital murder counts, the jury recommended that Cory Johnson be sentenced to death on all of the seven § 848(e) murders of which he had been convicted; that Tipton be sentenced to death for three of the six § 848(e) murders of which he was convicted (Talley, Chiles, and Thorne); and that Roane be sentenced to death for one of the three of which he was convicted (Moody). The district court sentenced Johnson, Tipton, and Roane to death in accordance with the jury's recommendations pursuant to 21 U.S.C. § 848(l), and imposed various sentences of imprisonment upon each of the appellants for the several non-capital counts on which they were convicted and for those capital murder counts on which Tipton and Roane had been convicted but were not given death sentences.\n\nOn appellants' motion, the district court refused to order execution of the several death sentences on the grounds that Congress had neither directly authorized the means by which the death sentences imposed under § 848 should be carried out, nor properly delegated to the Attorney General the authority to issue the implementing regulations that were invoked by the Government. In consequence, the district court stayed execution of the death sentences it had imposed until such time as Congress had authorized the means of execution.\n\nThese appeals by Tipton, Roane, and Johnson and a cross-appeal by the Government from the district court's stays of execution of the death sentences followed.\n\nAppellants present some sixty issues for our review. Most are presented as issues common to all; some only in behalf of particular appellants.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e They pertain to the jury selection process, to the trial proper, and to the death penalty hearing and sentencing phases. Some warrant extended Discussion; others, for various reasons, warrant no more than recognition or summary Discussion. We will take first the issues jointly and separately presented by the appellants. Lastly, we will consider the Government's cross-appeal.\n\nII.\n\nWe first consider a number of joint challenges by all the appellants to various aspects of the jury-selection process.\n\nA.\n\nThe principal challenge is to the district court's having conducted portions of the jury voir dire out of the immediate presence of the appellants. Appellants jointly contend that this violated their constitutional right under the Fifth Amendment and their parallel statutory right under Rule 43, Fed. R. Crim. P., to be personally present throughout the voir dire process. The Government contends in opposition (1) that appellants effectively waived any constitutional or statutory right they possessed to be personally present throughout the process, or (2) that if the right was not effectively waived, any ensuing error was forfeited by the appellants' failure to object either contemporaneously or by post-verdict motions, so that it is only reviewable for plain error under Rule 52(b), Fed. R. Crim. P., and that under that Rule's standard this forfeited error does not warrant appellate correction.\n\nTo address these issues of waiver, forfeiture, and plain error review, a fairly detailed account of the relevant proceedings is required. The issues arose as a result of the district court's decision to handle the jury selection process in a series of discrete steps designed to accommodate what the district court obviously saw as special difficulties posed by the size of the venire--250 prospective jurors--and by the capital murder counts. Initially, as a matter of convenience for the prospective jurors, they would be examined in two separate, roughly equal groups, with the second group not required to report until the first group had been preliminarily screened. Preliminary screening of the two groups was intended to yield a group of around 70 prospective jurors who had not been found excusable for various individual reasons or not subject to challenges for cause. From that preliminarily qualified set of venirepersons, the petit jury and alternates would then be chosen by lottery and the exercise of peremptory challenges.\n\nThe preliminary screening process of the two groups was to be carried out in what developed as three distinct steps. In the first step, general questions would be addressed by the court to the whole group of prospective jurors concerning such generally non-sensitive sources of possible disqualifying bias as knowledge of the case or of the parties, witnesses, or counsel. This would be done in open court, with the various defendants all present with their counsel. If in response to specific questions from the court prospective jurors indicated by standing that a question posed a possible problem they would be called individually to the bench where, with counsel present, they would be further questioned on the matter by the court. In this step of the process, challenges for cause would be ruled upon or granted sua sponte, yielding a reduced set of prospective jurors. That set would then be further screened in a final step designed in particular to explore the sensitive subjects of death-penalty attitudes and possible racial prejudices. This step would be conducted by the Judge in chambers with only counsel and individual prospective-jurors present with him. Further challenges for cause would be ruled upon or granted sua sponte during this final step in the screening process, which would yield the final pool of prospective jurors from which the jury would be selected.\n\nJury voir dire proceeded essentially in accordance with this plan. The fact that at two of its proposed steps the process apparently would be conducted out of the immediate presence of the defendants was not, so far as the record shows, raised in advance as a possible problem by the court or any counsel in the case. That there might be a problem was first suggested only after twelve prospective jurors from the first group had been individually questioned by the court at the bench following their indications of problems in response to the first general question put to the group. At that point, counsel for one of the appellants remarked simply, \"I would remind [the court] that under Rogers v. United States, [853 F.2d 249 (4th Cir. 1988)], our clients must waive presence.\" JA 885. In immediate response, the Judge asked, \"Does everybody waive presence of their clients?\" Id. To this, defense counsel who had first raised the issue remarked, \"We better take one second to be sure. This is a capital case.\" Id. The record then indicates that following a conference of unspecified duration between counsel and their respective client-defendants, counsel for each of the appellants in turn stated to the court that his client, by name, waived. Id. The process then resumed according to plan with further questioning at the bench of those prospective jurors whose responses to general questions required further inquiry. During that phase of the process, a significant number of prospective jurors were excused for cause, either in response to challenges by counsel or by the court sua sponte.\n\nWhen this step had been completed and just as in-chambers individual questioning of the remaining unexcused members of the group was about to commence, the courtroom clerk inquired, apparently of defense counsel, \"if the defendants can go back to the lock-up or do you want them in the courtroom . . . to be available to talk to them if you want?\" Roane's counsel responded, \"Just send them back. . . . ,\" and Johnson's counsel added, \"They have waived.\" Though the record is not clear on the point, it would appear that the defendants were not actually taken from the courtroom at that time, but only later after the in-chambers process had been underway for some time. See JA 1101.\n\nDuring that in-chambers process, the district court concentrated in its questioning, as had been indicated to counsel, on death-penalty attitudes and possible racial or other bias, and routinely allowed Government and defense counsel to pursue limited further examination on those subjects. As a result of that examination, a number of prospective jurors were excused either upon challenge by counsel or by the Judge sua sponte because of intimations either of disqualifying death-penalty attitudes (running both ways) or possible racial biases.\n\nAlthough the second group of prospective jurors was brought in and briefly examined in a general voir dire before in-chambers examination of members of the first group had been completed, a sufficient pool of prospective jurors was obtained from the first group to allow the jury to be selected entirely from that pool. This was done, as planned, by the exercise of peremptory challenges to persons successively called to the jury box by lottery. This final step in the process was carried out in open court, with all appellants present and able to consult with counsel. A total of 52 peremptory challenges were allotted to the then four defendants for exercise with respect to the regular jurors and an additional two with respect to four alternates.\n\nThe upshot, for purposes of the denial-of-presence issue, is that appellants were personally and immediately present during some but not all portions of the overall voir dire process as it involved those prospective jurors from whom the regular and alternate jurors ultimately were selected. Specifically, they were personally and immediately present while the district court was addressing to the whole group general questions respecting possible sources of bias from relationships or knowledge of the case, and during the final jury selection process involving the exercise of peremptory challenges. They were not immediately present, though in the courtroom, during any of the Judge's examination of prospective jurors at the bench in the presence of their counsel. And they were not present during any of the in-chambers examination of individual prospective jurors.\n\nThe Confrontation Clause of the Sixth Amendment and the Due Process Clause of the Fifth Amendment together guarantee the right of federal defendants charged with felonies to be present at all critical stages of their trials. Illinois v. Allen, 397 U.S. 337, 338, 25 L. Ed. 2d 353, 90 S. Ct. 1057 (1969) (Sixth Amendment); Snyder v. Massachusetts, 291 U.S. 97, 106-08, 78 L. Ed. 674, 54 S. Ct. 330 (1933) (Fifth Amendment). Rule 43(a), Fed. R. Crim. P., deriving from these constitutional guarantees and the even broader common law privilege, see United States v. Gregorio, 497 F.2d 1253, 1257-59 (4th Cir. 1974), confers a comparable right to \"be present . . . at every stage of the trial.\" Included is the right to be present at the voir dire and \"impaneling of jurors.\" Snyder, 291 U.S. at 106 (dictum); Rule 43(a) (as quoted).\n\nThe Government does not contend that the appellants' constitutional and rule-based right did not extend to the specific portions of the voir dire from which they were absent. Instead, as indicated, the Government contends only that any such right as existed was effectively waived by defense counsels' several in-court announcements of waiver following consultations with their respective clients or that, if it was not waived, any ensuing error, having been forfeited, does not warrant appellate correction as \"plain error\" under Fed. R. Crim. P. 52(b). Responding to the Government's claim of waiver, appellants jointly have raised two difficult issues: first, whether under Fourth Circuit precedent the right of presence may ever and by any means be waived in capital cases;\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e second, whether--if waiver is possible in such cases--it may only be effected by a formal in-court proceeding not provided in this case.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nBecause we conclude that even if for either reason no effective waiver occurred here, any ensuing error, having been procedurally forfeited, does not warrant correction as plain error, we reserve decision on the difficult waiver issues and proceed to the Discussion of the plain error basis for our decision.\n\nUnited States v. Olano, 507 U.S. 725, 123 L. Ed. 2d 508, 113 S. Ct. 1770 (1993), guides us here, both as to the relationship between waiver of rights and forfeiture of errors at trial, and as to the proper application of Rule 52(b)'s \"plain error\" limitation on appellate correction (noticing) of forfeited errors.\n\nWhere a protected trial right has been effectively waived by a defendant, as the Government claims occurred here, all possibility of error respecting that right has been extinguished. Id. at 733. But even where a right has not been waived, any entitlement to have error in its denial or abridgement corrected on appellate review may be forfeited by the \"failure to make timely assertion of [the] right\" at trial. Id. Such a forfeiture, does not, as does waiver, extinguish the error, id., but it does impose stringent limitations, embodied in Rule 52(b), on the power of appellate courts to correct the error. Olano has now instructed, clarifying the matter, that under Rule 52(b) a court of appeals \"has authority\" to correct forfeited error only if it is \"plain\" and \"affects substantial rights,\" and even then is \"not required to do so\" unless the error is one that \"causes the conviction or sentencing of an actually innocent defendant\" or otherwise \"seriously affects the fairness, integrity or public reputation of judicial proceedings.\" Id. at 734-36.\n\nHere, where we have assumed for purposes of this case that there was not an effective waiver of the right at issue, there indisputably was, however, a forfeiture of entitlement to appellate correction of any ensuing error in denying or abridging the right. Not only was there no contemporaneous or post-verdict challenge to conducting portions of the jury voir dire outside the immediate presence of the appellants, counsel for each appellant specifically invited the procedure.\n\nProceeding then to the Olano analysis respecting forfeited error, we further assume, without deciding, that error did occur in the form of a \"deviation\" from the constitutionally-grounded legal rule that presence was required throughout the proceedings at issue.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See id. at 732-33. And, we also assume--as the Government seems to concede--that any such error as occurred was \"plain,\" in the sense that it is clear on the record that the challenged proceedings were held outside the immediate presence of appellants.\n\nThis brings us to the question whether the \"plain error,\" whose occurrence we assume arguendo, affected any \"substantial rights\" of the appellants. Olano has now instructed that this may ordinarily (and perhaps only) be established by a defendant's specific showing--the burden being upon him--that the error caused him actual prejudice by affecting the trial outcome. Id. at 734. But Olano also noted--without deciding--that aside from this most obvious means, there might be forms of forfeited error that, for Rule 52(b) purposes, \"affect substantial rights independent of any prejudicial impact,\" and still other forms from which prejudice should be presumed where the defendant could not make a specific showing. Id. at 734-35.\n\nAs did the Olano Court, we must address all three possibilities, assuming arguendo the existence of the latter two forms of correctible forfeited errors as to which actual prejudice either need not or cannot be proved. See id. at 737-41.\n\nWe first consider whether the assumed error here--conducting some phases of the jury voir dire out of the appellants' immediate presence--is one which could be found to \"affect substantial rights independent of any prejudicial impact.\" We can reserve, as did the Olano court, the question whether any such category of forfeited plain error does in fact exist. If it does, it seemingly could only involve violations of absolute rights entitled for overarching systemic reasons to absolute enforcement without regard to any demonstrable (or presumed) prejudicial impact on the defendant. See Arizona v. Fulminante, 499 U.S. 279, 309-10, 113 L. Ed. 2d 302, 111 S. Ct. 1246 (1991) (defining category of constitutional errors that may not be found harmless because, without regard to actual prejudice, they deprive defendants of \"basic protections\" of fundamentally fair trial). The constitutional and Rule-based right to presence at all critical stages of trial, though obviously important, is not such an absolute, systemic right. That it is not absolute is of course settled by those Supreme Court decisions, most notably Snyder and Allen, upholding the power of courts in certain circumstances to conduct trials (or portions) in absentia. See also Rushen v. Spain, 464 U.S. 114, 117-18, 78 L. Ed. 2d 267, 104 S. Ct. 453 (1983) (per curiam) (though right to personal presence is \"fundamental,\" errors in conducting proceedings out of presence of defendant may be found harmless). To the extent the right is based, as is that claimed here, upon the Due Process Clause (and Rule 43's codification), it exists only \"to the extent that a fair and just hearing would be thwarted by [the defendant's] absence,\" or, put otherwise, it is limited to \"those circumstances where a defendant's presence has a relation, reasonably substantial, to the fullness of his opportunity to defend himself.\" Snyder , 291 U.S. at 105-08. The right is thus by definition limited to those circumstances in which absence has a \"prejudicial impact\" on a defendant's opportunity effectively to assist in his defense. The courts accordingly have so interpreted it, not as one to be enforced \"independent of any prejudicial impact\" from a defendant's absence but as one actually dependent upon the existence of such an impact. See, e.g., United States v. Boone, 759 F.2d 345 (4th Cir. 1985) (absence from in-chambers conference between Judge and counsel respecting dismissal of juror did not, under the circumstances, frustrate trial's fairness); United States v. Fontenot, 14 F.3d 1364 (9th Cir. 1994) (absence from peremptory challenge conference between Judge and counsel not, under the circumstances, prejudicial); cf. Olano, 507 U.S. at 738-39, 123 L. Ed. 2d 508, 113 S. Ct. 1770 (comparable analysis employed in finding violation of Criminal Rule 24(c) not an \"error affecting substantial rights independent of any prejudicial impact\").\n\nAccordingly, we conclude that if there be a category of plain errors affecting substantial rights \"independent of any prejudicial impact,\" absence from portions of a jury voir dire is not among them.\n\nWe next consider whether, assuming there is a category of plain errors as to which prejudice should be presumed, the assumed error here falls in that category. We conclude that it does not.\n\nThere may be circumstances of involuntary absence from jury voir dire where prejudice should be presumed, but we think they could only involve absences throughout the entire process. See United States v. Crutcher, 405 F.2d 239, 244 (2d Cir. 1968) (complete absence never harmless error). Such an absence almost assuredly deprives a defendant of any effective means of giving informed advice or suggestions to his counsel respecting the ultimate decisions to challenge prospective jurors for cause or peremptorily. But not every absence of whatever nature and duration and during whatever phase of the voir dire necessarily has that effect. Some phases obviously are more critical than others. The potential prejudice from some absences may be relieved by other circumstances. It all depends. Where absence has not been total but only intermittent during the process the courts accordingly have not presumed prejudice but have analyzed the circumstances to determine whether prejudice has been specifically established. See, e.g., United States v. Bascaro, 742 F.2d 1335, 1349-50 (11th Cir. 1984) (although peremptory strike phase of voir dire is critical, no prejudice to defendants where attorneys conferred about peremptories outside their presence, but defendants were present both while questioning took place and when strikes actually entered); United States v. Alessandrello, 637 F.2d 131, 137-141 (3d Cir. 1980) (absence of defendants from in-chambers questioning of venirepersons respecting pre-trial publicity not prejudicial in view of their presence at substantial part of voir dire and their counsels' presence during in-chambers proceedings).\n\nThe absences here plainly were of the intermittent sort, not approaching the total denial of any effective participation in critical phases of the voir dire that might warrant a presumption of prejudice.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Accordingly if prejudice is to be found here, it must be by specific showing. Cf. Olano, 507 U.S. at 740-41 (comparable analysis employed to hold no presumption of prejudice from violation of Criminal Rule 24(c)).\n\nRelegated to this means of showing error that \"affected substantial rights,\" appellants' burden is to persuade us of actual prejudice, i.e., that their absences \"affected the outcome of the trial,\" or \"probably influenced the verdicts\" against them either on the guilt or sentencing phases. Olano, 507 U.S. at 734-35. We conclude that they have not carried that heavy burden.\n\nJust how one shows that his absence during portions of a jury selection process actually \"affected the outcome of [trial],\" or \"probably influenced the verdict\" against him has apparently never been definitively explored. Literally applied, the standard would seem to require a showing in the end that a defendant's absence resulted in selection of a jury that probably reached a verdict different from that which would have been reached by a jury selected with benefit of his presence at the times of his absence. If that be the ultimate burden, it is a stringent one indeed--near if not beyond the limits of practical possibility given the variables in the process and evidentiary restrictions. See Fed. R. Evid. 606(b). If we start analysis from the other end, it is obvious that at a very minimum a defendant must show that had he been present a somehow different jury would have been selected. The due process-based right to presence is not violated, hence could not be the source of prejudice, unless one's presence demonstrably would have made some difference. See Snyder, 291 U.S. at 106, 107 (no violation, hence no prejudice possible, \"when presence would be useless, or the benefit but a shadow\"). But, just as surely, showing only that some difference would have resulted could not suffice to show actual prejudice. If no more is shown, for example, than that jurors 1, 3, and 5 would have been excluded, this could not suffice to show that their presence caused the finally unfavorable \"outcome.\" Something more, for example, that jurors 1, 3, and 5 in the above hypothetical were demonstrably biased, surely must be shown, and even that might not, under all the circumstances, suffice.\n\nFortunately, we need not in this case seek to decide just what showing between these extremes is required. Appellants, relying primarily on their argument of presumed prejudice, offer nothing on actual prejudice beyond the conclusory assertion that \"even if defendants were required to demonstrate prejudice, that prejudice was patent in this case.\" Roane Br. 30. This obviously could not suffice to show specific prejudice.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAccordingly, we conclude that appellants have not carried their burden to show actual prejudice resulting from their absences during portions of the jury voir dire.\n\nHaving earlier held that their absences could not constitute error \"affecting substantial rights independent of prejudicial impact,\" nor \"presumed error affecting substantial rights,\" we need not consider whether, even if prejudicial, the assumed error so \"seriously affected the fairness, integrity or public reputation of judicial proceedings\" that correction was warranted. Olano, 507 U.S. at 741. Because appellants have not shown that their absence from portions of the jury voir dire \"affected substantial rights,\" we conclude that any error involved, having been forfeited, does not warrant correction.\n\nB.\n\nWe next consider appellants' claim that the district court erred in refusing to permit defense counsel to conduct adequate voir dire and in failing itself to conduct adequate voir dire regarding possible racial bias and attitudes respecting aggravating and mitigating factors if the capital sentencing phase were reached.\n\n1.\n\nAppellants moved pre-trial, with supporting affidavits, that defense counsel be permitted detailed participation in jury voir dire questioning on possible racial biases, pointing to the fact that each of the appellants was black and to the pervasiveness in society of racial prejudice. The court denied the motion but invited defense counsel to submit proposed questions pursuant to Fed. R. Crim. P. 24(a). Counsel submitted 62 such questions on such matters as beliefs in the trustworthiness and criminal propensities of black persons, whether the prospective jurors lived in racially separated neighborhoods or attended racially separated churches, and the like. The district court declined to incorporate these questions in its own in-chambers questioning of individual prospective jurors, and put only a single question respecting their possible racial bias: \"Do you harbor any bias or prejudice, racial or otherwise, that would prevent you from being fair to the defendants in this case?\" See, e.g., JA 1009. The court then permitted limited follow-up inquiry by counsel depending upon responses made to his general question. JA 1061.\n\nAppellants contend that this was insufficient to provide reasonable assurance that if bias did exist, it would be uncovered, as they say was their right. And, they argue that in this case its insufficiency was exacerbated by the fact that the district Judge was himself a black person, thereby making the concealment of racial bias more than ordinarily a risk.\n\nWe disagree and find no error in the district court's decision (1) not to allow detailed questioning of the type proposed by appellants, whether done by himself or defense counsel; and (2) to limit the questioning on this subject to the general question he put.\n\nNo question is raised of entitlement to some inquiry into possible racial bias--whether under the Constitution, see Ristaino v. Ross, 424 U.S. 589, 597, 47 L. Ed. 2d 258, 96 S. Ct. 1017 (1976) (constitutionally compelled where racial issues \"inextricably bound up with the conduct of the trial\") or under the Supreme Court's broader supervisory rule for federal courts, see United States v. Rosales-Lopez, 451 U.S. 182, 191, 68 L. Ed. 2d 22, 101 S. Ct. 1629 (1981) (compelled where \"circumstances . . . indicate . . . reasonable possibility that racial . . . prejudice might have influenced the jury\"). Inquiry was made here; the challenge is only to its confinement to the single question put by the trial Judge, with opportunity only for limited follow-up questioning by counsel.\n\nOnce the decision has been made to conduct any inquiry into this sensitive matter, the exact nature and scope of that inquiry is committed to the broad discretion of the district court, and is subject to review only for abuse. Rosales-Lopez, 451 U.S. at 189; Ham, 409 U.S. 524 at 527, 35 L. Ed. 2d 46, 93 S. Ct. 848; see also Fed. R. Crim. P. 24(a) (discretion extends to party participation in voir dire). Powerful conflicting considerations inform that discretion. On the one hand, there must be the concern to root out a form of bias that prospective jurors may be particularly reluctant to reveal. See, e.g., United States v. Lewin, 467 F.2d 1132, 1137 (7th Cir. 1972). On the other hand, there has to be an equally weighty concern where race is not directly in issue not to overemphasize in jurors' minds the facts and possible relevance of the racial identities of litigants or witnesses. See Ristaino, 424 U.S. at 596 n.8 (danger of creating impression that Justice in the courts turns on race or ethnicity); United States v. Barber, 80 F.3d 964, 967, 968 (4th Cir. 1996) (en banc) (danger of \"diverting the trial's focus from the guilt or innocence of the defendant to peripheral factors, such as the defendant's race . . .\").\n\nUndoubtedly taking these considerations into account, the Supreme Court has indicated that even where inquiry is constitutionally required because of inextricably involved racial issues, questioning may properly be confined to the sort of single, general question put to jurors here. Ham, 409 U.S. at 525 n.2, 527 (question \"Would you fairly try this case on the basis of the evidence and disregarding the defendant's race,\" held \"sufficient to focus the attention of prospective jurors on any racial prejudice they might entertain\").\n\nIn this case, given the critical circumstances that race was not itself an issue and that none of the offenses charged was interracial in nature, we cannot find abuse of discretion in the district court's decision to confine questioning on racial bias to the general question the court put with opportunity provided for follow-up questioning by counsel.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n2.\n\nAppellants tendered a set of proposed questions respecting prospective jurors' attitudes about various possibly mitigating factors as they might influence jurors' consideration of the penalty phase. They included inquiries into the prospective jurors' willingness to consider factors such as a defendant's \"deprived, poor background,\" \"emotional, physical abuse,\" \"young age,\" \"limited intelligence,\" and \"brain disfunction.\" The district court declined to incorporate these in its own questioning, and when counsel for appellants attempted to ask these or similar questions, refused to allow them. Appellants claim that this violated their constitutional and rule-based right to a voir dire adequate to assure an impartial jury on the critical capital sentencing issue. We disagree.\n\nIt is important in assessing this claim to identify the voir dire right at issue. In general terms it is the right, grounded in the Sixth Amendment, to a voir dire adequate to assure a defendant a jury, all of whose members are \"able impartially to follow the court's instructions and evaluate the evidence,\" Rosales-Lopez, 451 U.S. at 188, here instructions and evidence relevant to imposition of the death penalty. More specifically it is the right to an inquiry sufficient to ensure--within the limits of reason and practicality--a jury none of whose members would \"unwaveringly impose death after a finding of guilt\" and hence would uniformly reject any and all evidence of mitigating factors, no matter how instructed on the law. Morgan v. Illinois, 504 U.S. 719, 733-34, 119 L. Ed. 2d 492, 112 S. Ct. 2222 (1992) (right to such an inquiry established).\n\nJust how an inquiry adequate for this specific purpose should be conducted is committed to the discretion of the district courts. The Constitution no more \"dictates a catechism\" for its conduct than it does for any other subject of required voir dire inquiry. Id. at 729; Rosales-Lopez, 451 U.S. at 189; Aldridge v. United States, 283 U.S. 308, 310, 75 L. Ed. 1054, 51 S. Ct. 470 (1931). Obviously, the most direct way to get at the possibility that a prospective juror would always impose death following conviction is to put that very \"reverse-Witherspoon \" question directly to him and take it from there. Morgan, 504 U.S. at 724 n.3. But, just as obviously, that cannot be the \"only means of ensuring . . . an impartial jury\" on the life-or-death issue. Id.\n\nHere, by way of getting at that possible disqualifying bias, the district court first explained to each juror that if guilt of a capital offense was found in a first stage of the trial, the jury would then consider whether to impose the death penalty in a second stage at which the Government would try to convince the jury that aggravating factors warranted death while the defense would try to convince the jury that because of mitigation, death was not appropriate, and that this was then to be decided by the jurors on the basis of that evidence and the court's instructions on the law. See, e.g., JA 1170-72 (juror Catlett). Against this background, the court then asked each prospective juror: \"Do you have strong feelings in favor of the death penalty?\" See, e.g., JA 1172 (juror Catlett). If the juror answered with an unqualified \"No,\" the court moved on. E.g., JA 1172 (juror Catlett). If, however, the prospective juror gave any answer other than an unqualified \"No\" the court then asked directly whether \"you would always vote to impose the death penalty in every case where a defendant is found guilty of a capital offense.\" See, e.g., JA 1205 (juror Coleman).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e By this course of inquiry the district court obviously considered that the question, \"Do you have strong feelings in favor of the death penalty?\" was sufficient for the purpose if it received an immediate and unqualified \"No\" in response. Presumably, the thought was that except where the response was hesitant or equivocal, a direct \"reverse-Witherspoon \" question, such as \"Does this mean that you would not always vote to impose death following conviction?\" would be at least an unnecessary redundancy and possibly an imprudent risk of encouraging an opposite partiality. That only if \"strong feelings in favor\" were revealed need there be further inquiry into just how strong; that a person not strongly in favor of the death penalty necessarily is not one who feels so strongly that he will always impose the death penalty no matter what the circumstances. Cf. Lockhart v. McCree, 476 U.S. 162, 170 n.7, 90 L. Ed. 2d 137, 106 S. Ct. 1758 (1986). (\"State may challenge for cause prospective jurors whose opposition to the death penalty is so strong that it would prevent [their impartiality].\") We cannot say that such a view of the matter is so implausible as to make the inquiry inadequate as a matter of law. An inquiry which more explicitly embodies the \"reverse-Witherspoon \" question might give greater assurance--might in some cases be more prudent--but that is not the question for us. Under all the circumstances--the question's logical adequacy to address the ultimate issue of death-penalty impartiality, the context in which it was put, the court's repeated admonitions that under the law consideration of mitigating factors would be required--we could not find constitutional abuse in the court's confinement of its \"life-qualifying\" inquiry in this way.\n\nWe are bolstered in this Conclusion by the fact that in this case appellants never requested that a further specific \"reverse-Witherspoon \" question be put to those prospective jurors who already had responded unequivocally that they had no strong feelings in favor of the death penalty. The right to any inquiry on this subject is dependent upon request, Morgan, 504 U.S. at 736, and though appellants requested detailed questioning about specific mitigating factors, they neither requested that a specific \"reverse-Witherspoon \" question be put to any prospective juror nor objected contemporaneously to the district court's mode of inquiry as to basic death penalty attitudes.\n\nFrom what has been said, it follows that the district court's refusal to question or allow detailed questioning about specific mitigating factors did not constitute an abuse of discretion. The undoubted fact that such detailed questioning might have been somehow helpful to appellants in exercising peremptory challenges does not suffice to show abuse of the district court's broad discretion in conducting the requisite inquiry. See Mu'Min v. Virginia, 500 U.S. 415, 424-25, 114 L. Ed. 2d 493, 111 S. Ct. 1899 (1991). Because we conclude that the district court's inquiry into death penalty attitudes was sufficient to cull out any prospective juror who would always vote for the death penalty whatever the circumstances, we cannot find error in the court's refusal to conduct or allow further detailed inquiry about specific mitigating factors.\n\nC.\n\nAppellants jointly contend that three prospective jurors, Beazley, Ellis, and Gainsburg, were erroneously removed for cause by the district court in violation of appellants' rights under Witherspoon v. Illinois, 391 U.S. 510, 20 L. Ed. 2d 776, 88 S. Ct. 1770 (1968), and its progeny. We disagree.\n\nThe Sixth Amendment's guarantee of an impartial jury is violated by the exclusion of a prospective juror simply because he expresses some reservations about imposing the death penalty in any case. Id. at 520-23. It is not violated, however, by the exclusion of a juror whose expressed reservations are such as to make him \"irrevocably committed to . . . vote against the death penalty regardless of the facts and circumstances\" of a case, id. at 522 n.21, or, short of that, such as to \"prevent or substantially impair the performance of his duties as a juror in accordance with his instruction and his oath.\" Wainwright v. Witt, 469 U.S. 412, 424, 83 L. Ed. 2d 841, 105 S. Ct. 844 (1985) (quoting Adams v. Texas, 448 U.S. 38, 45, 65 L. Ed. 2d 581, 100 S. Ct. 2521 (1980)). Whether such reservations as are expressed cross the line into \"irrevocable commitment\" or \"substantial impairment\" is perforce committed in the first instance to trial court discretion based upon the voir dire inquiry. Because what is being inquired into is a state of mind whose determination turns largely on assessments of demeanor and credibility, matters peculiarly within the province of trial Judges, our review of those determinations is appropriately most deferential. Witt, 469 U.S. at 428; Keeten v. Garrison, 742 F.2d 129, 135 (4th Cir. 1984); Briley v. Bass, 750 F.2d 1238, 1246 (4th Cir. 1984).\n\nHere, we can find no abuse of discretion or error of law in the district court's exclusion of these three prospective jurors. Following the initial expression by each of some degree of reservation, each was extensively questioned further by the court and by opposing counsel. Each responded to some extent ambiguously as to the depth and likely consequence of his or her reservation. In the end, however, each expressed reservations, never retracted, sufficient to warrant the district court's determination that they would substantially impair the juror's performance of duty to vote for the death penalty if the evidence and law so dictated.\n\nProspective juror Ellis, asked at the outset by the court whether on the basis of the evidence and the court's instructions she could \"make an objective, reasoned and fair decision about imposing the death penalty\" responded \"I don't know,\" and to the court's follow-up question, \"What gives you pause?\" responded \"I'm not sure at this time if I could give the death penalty.\" Later, in response to the prosecution's question whether her personal opinion could \"substantially impair [her] service as a juror,\" she answered \"I would hope not,\" and to a reiterated, \"But could it?\" responded, \"It might.\" Still later, in response to defense counsel's question whether she could imagine cases \"where she could contemplate imposing the death penalty\" she stated that \"there are some cases where I could,\" and to a follow-up question whether in such cases her \"personal feeling would get in the way\" answered \"No.\" JA 1351-57. This simply left the court with facially ambiguous and arguably contradictory indications of the depth of her reservations. In those circumstances we have felt obliged to \"rely on the trial court's discretion in determining which responses best manifested the juror's true opinions.\" Briley, 750 F.2d at 1246.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We so conclude as to the court's removal of prospective juror Ellis.\n\nThe same analysis applies to the Court's removal for cause of the other two prospective jurors. Prospective juror Beazley first responded to the court's question whether he would be able to impose the death penalty \"disregarding any views that you might have as to what the law is or ought to be\" by saying, \"I doubt it,\" and explained, \"If I get on the jury and I have to give a death sentence, I don't think I could live with it . . . I really don't.\" Under probing by defense counsel he later said \"yes\" to questions whether he could \"imagine\" a crime sufficiently severe that he would impose the death penalty, and whether the multiple murders charged in this case would \"in your estimation justify it.\" But when in Conclusion he was asked \"what about a cold-blooded murder for profit?\" his final response on the subject was, \"I feel yes, but like I say, I'm just a nervous person. If I could live with it after I done it, I just wonder.\" JA 1063-65. We cannot quarrel with the district court's obvious determination that the first and last expressions by this venireman \"best manifested the juror's true opinion.\" Briley, 750 F.2d at 1246.\n\nSo also, with respect to prospective juror Gainsburg. After indicating some reservations about imposing the death penalty in any but \"a very limited number of situations,\" he responded to the court's question whether in this case he could make \"a fair, reasoned, objective determination\" whether to impose the penalty by saying, \"I would like to say yes. But I really suspect that my prejudices might to some extent affect my decision.\" Though later, under questioning by defense counsel, he stated that he \"absolutely would consider it,\" he immediately qualified this by saying, \"But I honestly believe that my decision would be based on my own biases and prejudices.\" And, when the court then asked if by this response he was saying that he didn't believe he could follow the court's instructions if they were \"not in sync\" with his biases and prejudices, he responded, \"I suspect that's what I'm telling you.\" JA 1401-05. The court did not err in excluding venireman Gainsburg based on the course of inquiry.\n\nD.\n\nAppellants' final joint challenge to the jury selection process is that in exercising its peremptory strikes the prosecution impermissibly struck a disproportionate number of women, thereby violating appellants' constitutional right as recognized in J.E.B. v. Alabama ex rel T.B., 511 U.S. 127, 128 L. Ed. 2d 89, 114 S. Ct. 1419, 1430 (1994) (equal protection under Fourteenth Amendment); see United States v. Lane, 866 F.2d 103, 104 n.1 (4th Cir. 1989) (Fifth Amendment provides comparable rights in federal prosecutions).\n\nAppellants did not contemporaneously object on this basis to the prosecution's exercise of peremptory challenges, and the Government contends that this forecloses them on the issue in this court. Ordinarily it would, see Clark v. Newport News Shipbuilding \u0026 Dry Dock, 937 F.2d 934, 939-40 (4th Cir. 1991), but appellants point out that J.E.B. was only decided after completion of the trial in this case and that at that time the rule in this circuit was that Batson v. Kentucky, 476 U.S. 79, 90 L. Ed. 2d 69, 106 S. Ct. 1712 (1986) (race-based peremptory challenges prohibited), did not extend to gender-based challenges, see United States v. Hamilton, 850 F.2d 1038, 1041-42 (4th Cir. 1988), so that their failure to object contemporaneously must be excused. To this, the Government responds that the failure is not excused, notwithstanding Hamilton, because at the time of trial, there was a direct conflict on the issue within the circuits and among the state courts, see, J.E.B., 114 S. Ct. at 1422 n.1, so that appellants were obliged under Fed. R. Crim. P. 51 to object in order to preserve the claim.\n\nWithout accepting the Government's position on procedural default, we nevertheless conclude that the bare showing of gender discrimination first attempted on this direct appeal does not suffice either to allow first instance consideration by this court (as appellants concede), nor to warrant a remand for first instance consideration by the district court.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIII.\n\nWe next address a number of challenges, some joint, some separate, to various trial court rulings at the guilt phase of the trial.\n\nA.\n\nBased on an underlying contention that the evidence on the conspiracy count tended to prove three separate conspiracies rather than the single one charged, appellants jointly and individually challenge a number of related district court rulings which denied (1) Roane's motions for severance and for an in limine exclusion of any evidence against him except that related to the Newtowne phase of any concerted drug trafficking activities, (2) related motions for instructions limiting the evidence properly to be considered against particular appellants, and (3) motions for a multiple-conspiracy instruction. We find no reversible error as to any of these.\n\nCritical to all of these challenges is the argument that the evidence could have supported findings only of three separate conspiracies, and not of the single one charged. Specifically, it is contended that the evidence only supported findings of an original conspiracy centered on Trenton, New Jersey involving the \"New York Boyz\" group that included Tipton and Johnson, a separate conspiracy centered on the Central Gardens area of Richmond in which only Tipton and Johnson of the appellants were involved, and another separate conspiracy centered on the Newtowne area of Richmond in which all three appellants--Roane for the first time--were involved. We disagree with this critical contention; the evidence supports the jury's finding of the single conspiracy charged and of Roane's connection to it.\n\nThe indictment charged that \"from on or about January, 1989, . . . and continuously thereafter up to and including the filing of this indictment,\" appellants and others conspired to possess with intent to distribute and to distribute cocaine base \"in the Eastern District of Virginia and elsewhere.\" The evidence amply supports the jury's finding that such a single conspiracy existed and that each applicant was a participant in that conspiracy. In summary, the evidence was sufficient to show the following: Such a conspiracy originated in the Trenton, New Jersey area in 1989, involving as its core members a group known as the \"New York Boyz\" and including as members Appellants Tipton and Johnson and co-defendant Lance Thomas. In 1991, law enforcement efforts resulted in a cessation of the conspiracy's operations in the Trenton area but not in its continued existence and operation elsewhere. At that time, some members of the conspiracy ceased their participation while some went to New York City and others, including Appellants Tipton and Johnson, and Lance Thomas, went to Richmond. Earlier, while still engaged in the Trenton operation, Tipton had organized a Central Garden operation in Richmond that expanded the conspiracy's geographical area while continuing to use its established mode of obtaining, processing, and distributing its drug product. The Central Garden operation was supplied from the New York drug source that supplied the Trenton-based operation. Under Tipton's leadership, it employed the same methods of intimidation and violence to dominate the crack cocaine trade in this new market area of its operation. Shortly after the Central Garden operation commenced, \"Hess,\" one of the New York Boyz group, came from New York to act as an enforcer for the operation; later, he returned to New York to deal with \"trouble\" resulting from a police raid on a house used by the New York Boyz. Appellant Johnson came from the New York area to the Richmond area in the summer of 1990 for the specific purpose, according to Tipton, of making sure that the losses taken in earlier operations were not repeated there. Throughout the Richmond-based operations, Tipton, as key man of the conspiracy's operations there, asserted his ability to call on the New York Boyz group--who remained in the New York area--to assist the Richmond operation. Seeking to further expand the conspiracy's operations in the Richmond area, Tipton directed the development of another distribution network in the Newtowne area of Richmond. By late 1991, it was the main focus and the most productive area of the conspiracy's operations in the Richmond area. It was during the early stages of this new market area's development that Appellant Roane joined the conspiracy. A cousin of Tipton's who \"had a spot\" in Newtowne, Roane was brought in at Tipton's instigation in the Fall of 1991 soon after being released from prison, to help develop that new area. From that point on, he participated as a full \"partner\" with Tipton, Johnson, and other conspiracy leaders in the ongoing operations of the conspiracy.\n\nAppellants emphasize the evidence that membership in the groups participating in the concerted drug trafficking activities in the Trenton and Richmond areas shifted over time and that the activities were widely separated geographically and in time. That evidence was of course relevant to the ultimate factual issue whether the single conspiracy charged did exist, but it surely did not prevent a properly supported finding that it did. See United States v. Banks, 10 F.3d 1044, 1053-54 (4th Cir. 1993) (single conspiracy properly found despite looseness of organizational structure, changing membership, shifting roles of participants, limited roles and knowledge of some members).\n\nOnce that underlying contention is rejected, all the claims of error dependent upon it fail. With its rejection, no appellant has any basis for claiming unfair prejudice from the introduction and consideration against him of any evidence about any activities of others in furtherance of the single conspiracy charged. The basic rule is that persons who have been indicted together, particularly for conspiracy, should be tried together. United States v. Brooks, 957 F.2d 1138, 1145 (4th Cir. 1992). Once the scope of that conspiracy is established, one's having come late to or having varied his level of participation in it from time to time puts him in a position \"no different from that of any co-conspirator who claims to be prejudiced by evidence that goes to the activities of co-conspirators.\" United States v. Leavis, 853 F.2d 215, 218 (4th Cir. 1988). The Government may not properly be \"deprived . . . of its right to detail the full scope of the conspiracy and to present its case in proper context\" simply because particular co-conspirators were not involved in the full scope of its activities. Id. That would be the effect of the severance and evidence exclusion and limitation rulings that were denied; the district court did not, therefore, abuse its discretion in denying them.\n\nAppellants' joint claim that \"at a minimum,\" Roane Br. 75, they were entitled to a \"multiple conspiracy\" instruction to enable fair presentation of this theory of defense fails essentially for the same reasons. A properly requested multiple conspiracy instruction is not of course required if the evidence only supports a finding of a single conspiracy as charged. United States v. Crockett , 813 F.2d 1310, 1316 (4th Cir. 1987). It may be required, as may instructions on specific defense theories generally, if sufficiently supported by the evidence. See United States v. Dornhofer, 859 F.2d 1195, 1198 (4th Cir. 1988). Even where so required, however, failure to give it is not reversible error unless a defendant can show that this caused him substantial prejudice. See United States v. Maldonado-Rivera , 922 F.2d 934, 962-63 (2d Cir. 1990). Assuming without deciding that the evidence here might have supported findings of multiple conspiracies, we are satisfied that failure to instruct the jury to that effect could not have resulted in unfair prejudice to any of the appellants, including Roane, the conspirator last in.\n\nTo find such prejudice, we would have to conclude that the evidence of multiple conspiracies was so strong in relation to that of a single conspiracy that the jury probably would have acquitted on the conspiracy count had it been given a cautionary multiple-conspiracy instruction. We are not persuaded of that. The evidence of the single conspiracy charged was not only strong enough to support the verdict reached, it was strong enough in relation to that of only multiple conspiracies that we do not believe failure to give a special instruction on this theory of defense possibly could have swayed the verdict on this count.\n\nB.\n\nWe next consider a number of challenges to the appellants' several convictions of continuing criminal enterprise (CCE) violations under 21 U.S.C. § 848(a) (Supp. 1996).\n\n1.\n\nIt is claimed that the indictment failed adequately to charge a CCE violation, specifically that it failed to identify the three drug-related violations comprising the \"continuing series of violations\" element of the offense and the five persons whose supervision, organization, or management by particular defendants constituted another element. There is no merit to this claim.\n\nThe indictment charged in Count 2 that, in violation of 21 U.S.C. § 848, all of the appellants engaged in a CCE by violating 21 U.S.C. §§ 841 and 846 (1988 \u0026 Supp. 1996), \"including, but not limited to, those violations alleged in [this] indictment, which are realleged and incorporated by reference herein, and . . . other violations . . . which . . . were part of a continuing series of violations of [those] statutes . . . undertaken . . . in concert with at least five other persons with respect to whom [appellants] occupied positions of organizer, supervisor, and manager, etc.\"\n\nThis language essentially tracked the statutory definition of the offense and hence satisfies basic constitutional guarantees. United States v. Amend, 791 F.2d 1120, 1125 (4th Cir. 1986). Appellants cannot claim any unfair surprise under the particular circumstances of this case from the failure of the indictment specifically to identify in Count 2 the predicate violations and the five \"supervisees\" upon which the Government's proof would focus. In the absence of a bill of particulars, sufficient protection against unfair surprise may be found in allegations in other counts of an indictment than that whose sufficiency is directly challenged. That form of protection amply served here. Count 2, as indicated, identified and incorporated by reference all violations of 21 U.S.C. §§ 841 and 846 charged against the appellants elsewhere in the indictment. That gave each of them ample notice of all the predicate drug-related violations relied upon by the Government at trial, including the conspiracy charged in Count 1, the drug distribution jointly charged in Count 32, and the several murders in furtherance of the CCE variously charged under 21 U.S.C. § 848(e). Similarly, allegations in other counts of the indictment gave adequate notice of all those persons, more than five, relied upon by the Government as the minimum of five \"supervisees\" essential to proof of CCE violations by each.\n\n2.\n\nIt is contended that the district court erred in allowing the jury to consider as predicate violations under the CCE Count any of the § 848(e) capital murders \"in furtherance of\" the CCE charged. Specifically, the argument is that as a matter of statutory interpretation one could not murder \"in furtherance of\" any CCE except one whose existence was proven independently of such a murder. There is a superficial plausibility to this argument, but the plain language of the relevant statutory provisions defeats it.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Section 848(e) provides in relevant part that \"a person is engaged in aCCE if . . . he violates any provision of this subchapter [I] or subchapter II of this chapter the punishment for which is a felony, and . . . such violation is part of a continuing series of violations of [either subchapter I or II] of this chapter.\" The \"murder-in-furtherance\" provision in § 848(e) is \"a provision of this subchapter [I],\" hence by the statute's plain terms may be counted \"a part of a continuing series of violations\" making up the proscribed \"continuing . . . enterprise.\" See United States v. Head, 755 F.2d 1486, 1490 (11th Cir. 1985) (telephone facilitation violations under 21 U.S.C. § 843(b) (1988) properly considered predicate violations in CCE prosecution). The district court did not err therefore in instructing the jury that it might consider any murder-in-furtherance violations found under § 848(e) among the predicate violations required to convict on the CCE Count.\n\nNor were appellants unfairly surprised by the way in which the 848(e) violations were charged as predicate violations in the CCE Count. This was done by incorporating and realleging the conspiracy count in the CCE Count, thereby realleging the several § 848(e) murders charged to each in the conspiracy count. Appellants were sufficiently on notice by this indictment that the various § 848(e) murders-in-furtherance charged to them in the several substantive counts, then identified in the conspiracy count as overt acts, were among the predicate violations charged in the CCE Count.\n\n3.\n\nAppellants make a cluster of interrelated challenges to the court's instructions on the Count 2 CCE charge. Specifically, they contend that the instructions given did not sufficiently emphasize that the jury must find all the CCE elements as to each of the defendants; did not advise that the jury must be unanimous as to which three (at least) predicate violations each committed and which five (at least) persons each supervised; and misstated the predicate violations element. We find no reversible error in any of these respects.\n\nThe instructions as a whole unmistakably told the jury that it must find each of the five elements of the CCE offense as to each defendant in the case. Appellants pick out snippets of the instructions which they claim could have misled the jury as to the need for individualized consideration of each element as to each defendant, but that possibility is belied by the instructions looked at whole. The court specifically instructed that the Government must prove each of the five elements that it had properly listed as to each of the defendants, and generally cautioned that as to all the charges, the case of each defendant must be considered \"separately and individually.\" JA 4018, 4056. See Cupp v. Naughten, 414 U.S. 141, 146-47, 38 L. Ed. 2d 368, 94 S. Ct. 396 (1973) (instructions as a whole control).\n\nThe failure to instruct that the jury must be unanimous as to the three (at least) predicate violations and the five (at least) supervisees does not constitute reversible error. The court gave a general unanimity instruction as to all elements of the offense. None of the appellants requested a \"special unanimity\" instruction on these two elements, nor objected to the court's failure to give one sua sponte. We review this challenge therefore only for plain error, and find none warranting correction.\n\nThere is, preliminarily, a question whether there was error, plain or otherwise. There is no general requirement of jury unanimity \"on the preliminary factual issues which underlie the verdict.\" Schad v. Arizona, 501 U.S. 624, 632, 115 L. Ed. 2d 555, 111 S. Ct. 2491 (1991) (plurality opinion) (quoting McKoy v. North Carolina, 494 U.S. 433, 449, 108 L. Ed. 2d 369, 110 S. Ct. 1227 (1990) (Blackmun, J., Concurring)). A special unanimity instruction is required only when there is a genuine risk of juror confusion or that a conviction could result from different jurors having concluded that the defendant committed quite different acts within those of a prescribed set or among multiple means of violating a statute. See, e.g., United States v. Holley, 942 F.2d 916, 925-29 (5th Cir. 1991) (multiple false statements charged in single count required special unanimity instruction). There is a division among the circuits on the question whether under this general principle a special unanimity instruction is required, upon request, as to the predicate violation element in CCE prosecutions. See United States v. Echeverri, 854 F.2d 638 (3d Cir. 1988) (required); United States v. Canino, 949 F.2d 928, 945-48 (7th Cir. 1991) (not required).\n\nWe need not decide that general question up or down in this case. Here, the record plainly indicates that appellants could have suffered no actual prejudice from the lack of a special unanimity instruction on the predicate violation element. The district court properly instructed that to convict each of the appellants on the CCE count the jury must find that he committed at least three, see United States v. Ricks, 802 F.2d 731, 733 (4th Cir. 1986) (en banc), of the predicate acts listed in the indictment. By its verdict, it is clear that the jury unanimously found each guilty of at least five predicate violations: the conspiracy charged in Count 1, the drug possession charged in Count 32, and at least three of the § 848(e) murders as variously charged to them. Assuming, without deciding, that unanimity on at least three predicate violations is required to convict, it is clear that unanimity occurred here as to each appellant so that no actual prejudice from the failure so to instruct could be shown. See Olano, 507 U.S. at 734 (burden is on defendant to show actual prejudice from forfeited error).\n\nAs to the failure to give a special unanimity instruction on the five supervisees element, we hold, in accord with a majority, if not all, of the circuits that have addressed the question, that none is required. See, e.g., United States v. Tarvers , 833 F.2d 1068, 1074 (1st Cir. 1987); United States v. Bond, 847 F.2d 1233, 1237 (7th Cir. 1988). We agree with those courts that the CCE focus in this element is upon the size of the enterprise--set at a floor of five--rather than upon the particular identities of those who make up the requisite number. See Bond, 847 F.2d at 1237 (sufficient that jurors unanimously find that at least some five were supervised by defendant, to require unanimity on identities inimical to statutory purpose).\n\nAppellants' final challenge to the CCE instruction seizes on an obvious slip of the tongue when the court said while instructing on the continuing series of violations element that the required proof was that the continuing series of violations \"was undertaken by the defendants\" (plural) rather than by each defendant individually. No contemporaneous objection to this obviously inadvertent misstatement was made, so it could only be reviewed for plain error. So reviewing it, it is obvious that no actual prejudice from it could be shown. In other parts of the instructions the court sufficiently emphasized, as earlier noted, that each element must be proved separately as to each defendant. From the instructions as a whole the jury was adequately advised that to convict each of the appellants on the CCE count, the jury must find that he individually committed at least three predicate violations and that in the course of doing so he individually supervised at least five other persons.\n\n4.\n\nJohnson and Tipton jointly claim error in the district court's having amended its jury instruction on the CCE supervision element after they had given their respective closing arguments. We find no reversible error.\n\nThe court initially instructed the jury that the terms \"organizer,\" \"supervisory position,\" and \"position of management,\" were to be \"given their usual and ordinary meaning\"; that they \"imply the exercise of power and authority by a person who occupies some position of management or supervision\" but who \"need not be the sole or only organizer, supervisor or manager of the activities in question.\" The Government did not object to this instruction when it was proposed at the court's charge conference. But, after it had been given and after Tipton and Johnson had concluded their closing jury arguments, the Government moved for a supplemental instruction that more fully reflected this court's interpretation of the terms in United States v. Butler, 885 F.2d 195, 200-01 (4th Cir. 1989). Over defense counsel's objection, the court gave a supplemental instruction whose central points were that \"a person may occupy a position of organizer, a supervisory position or any other position of management without having direct personal contact with [those organized, etc.]\" and that \"it is . . . possible for a single [CCE] to have more than one organizer [etc.].\"\n\nThere is no question of the court's discretionary power to give post-argument instructions \"to remedy omissions in pre-argument instructions or to add instructions necessitated by the arguments.\" Fed. R. Crim. P. 30 advisory committee's note to 1987 Amendment. But the rule plainly contemplates that parties will know what the court will instruct before they make their arguments. See id. Here that would have required either that the supplemental instruction not be given or that appellants be allowed to supplement their closing argument after it was given. Neither occurred, so there was a technical violation of the Rule. We conclude, however, that any error involved was harmless. The supplemental instruction added but one element not specifically reflected in the initial instruction: that to be an organizer, etc., a defendant need not have had direct contact with the person organized, etc. This was an accurate statement of the law under Butler. The fact that contact is not essential probably lies within the \"ordinary and usual\" meaning of the term. Certainly it did not \"contradict or repudiate the thrust of [appellants'] closing argument,\" United States v. McCown, 711 F.2d 1441, 1452 (9th Cir. 1983). Appellants indeed do not suggest how they would have changed their arguments had they been allowed to supplement them. Accordingly, though it might well have been better to allow supplemental argument or at least to inquire of the substance of any proposed before giving the supplemental instruction, we are satisfied that any error in not doing so was harmless.\n\nC.\n\nAppellants jointly contend that the district court erred in not making sufficiently clear in its instructions on the various capital murder counts under § 848(e) that to convict, the jury must find a substantive connection between the murders and the continuing criminal enterprise with which each was charged.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We disagree.\n\nThe specific contention focuses upon the court's instruction that to find a defendant guilty of § 848(e) murder, the jury must find \"First, that the defendant was engaged in or working in furtherance of the [CCE] charged in Count [2];\" second, \"that while . . . so engaged, the defendant either intentionally killed or counseled .. . the intentional killing of the individual named in a particular count; and three, that the killing actually resulted.\" Under this instruction, the claim goes, a defendant could be found guilty simply on the basis of a temporal coincidence of a murder with a CCE; no substantive connection between the two was required. Were this the only instruction touching the offense the contention would be a serious one. But, it is not. At the outset of its instructions on the various murder counts, the court pointed out that appellants were charged with two very specific, very distinct types of homicide including \"killing while engaged in or in furtherance of a [CCE].\" JA 4039. Further, the court noted in this portion of its instructions that it \"would not be enough\" to prove only that a defendant had killed someone; that \"each of the specific elements of the federal crime charged\" must be proved, JA 4041; and that the jury must find the defendant \"was engaged in or working in furtherance of the [CCE]\" and that the killing occurred \"while the defendant was so engaged.\" JA 4042.\n\nConsidered in total compass, see Cupp, 414 U.S. at 146-47, we believe that these instructions sufficiently required proof of a substantive as well as merely temporal connection between the § 848(e) murder and the § 848(a) CCE charged to a defendant, though it must be conceded that the substantive connection is not as clearly expressed as it might be. Any concerns that invalidating confusion on the point might actually have resulted are, however, removed by consideration of the trial evidence and the Government's arguments to the jury. The Government's evidence expressly linked each of the nine § 848(e) murders of which the appellants were severally convicted to a furtherance of the CCE's purposes: either silencing potential informants or witnesses, eliminating supposed drug trafficking rivals, or punishing underlings for various drug-trafficking misfeasances. In both its opening and closing arguments the Government emphasized that the § 848(e) murder charges were \"predicated upon the [CCE]\" in that they charged \"murder in furtherance of a [CCE].\" JA 3818, 1609, 3814-15. And it pursued this substantive connection-theme by arguing that each of the murders charged had occurred \"in an effort to further [appellants'] drug business,\" JA 1610, pointing out, murder by murder, the specific enterprise-connected motive for each. See, e.g., JA 1625-28, 1631-35. By contrast, the failure to have charged under § 848(e) an unconnected killing revealed in the evidence was explained on that basis. All this considered, we are satisfied that no reversible error resulted from the district court's instructions on the nature of the § 848(e) capital murders charged.\n\nD.\n\nAppellants challenge the court's instructions on the \"enterprise\" element of the offense charged under 21 U.S.C. § 1959\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e in several counts. Because none objected to the instructions at trial, we review only for plain error and find none warranting correction.\n\nThe specific claim is that in listing the elements of this offense, the district court failed to differentiate between \"an enterprise engaged in racketeering activity\" and the \"racketeering activity\" in which it was engaged. The court did mispeak in twice referring to \"racketeering activity\" when it should have referred to \"enterprise engaged in racketeering activity.\" The two are different concepts: An \"enterprise\" is an entity distinct from the \"racketeering activity\" in which it engages. See United States v. Turkette, 452 U.S. 576, 583, 69 L. Ed. 2d 246, 101 S. Ct. 2524 (1981) (pointing out distinction in RICO statute from which § 1959 elements derived). Had this been all the court said in its instructions on the offense, it is arguable that plain error would have occurred by effectively reading the \"enterprise\" element out of the offense. But that is not all that was said. Assessing the instructions as a whole, see Cupp, 414 U.S. at 146-47, we are satisfied that, as the Government contends, the jury was adequately told that the elements were separate and distinct ones and that both must be proved. Viewed in total context, the two isolated references to \"racketeering activity\" when \"enterprise engaged in racketeering activity\" was appropriate must have been understood as short-hand references to the \"enterprise\" itself. The court earlier had read § 1959 verbatim, including the reference to an \"enterprise engaged in racketeering activity.\" JA 4044-45. This clearly identified two different concepts. The point was further emphasized by the court's identification of an \"enterprise\" as including \"any group of individuals associated in fact which is engaged in or the activities of which affect interstate commerce.\" JA 4046. Further, the court had already explained before making the two challenged misstatements that what the defendants had to act to \"gain entrance to\" was an \"enterprise engaged in racketeering activity.\" JA 4044. And finally, in the course of the same passage in which the two misstatements occurred, the court instructed that the jury could convict if it found the defendants had acted for the purpose of maintaining or increasing their positions in \"the racketeering enterprise\" or had received or been promised in exchange for their acts pecuniary gain from \"the racketeering enterprise.\"\n\nIt obviously would have been better had the court not made the two challenged slips, but assessed in total context of the instructions, we could not find them plain error warranting correction. See United States v. Locascio, 6 F.3d 924, 941 (2d Cir. 1993) (district court's use of arguably erroneous \"short-hand\" language in § 1959 instruction not erroneous when viewed in total context).\n\nE.\n\nAppellants claim that their constitutional confrontation rights were violated by the Government's impeding their timely and effective access to a number of its witnesses who were under the Government Protection Program pursuant to 18 U.S.C. § 3521 (1988 \u0026 Supp. 1996), and further by the court's restriction of their cross-examination of those witnesses respecting the reasons for their refusals to submit to interviews by defense counsel. We find no error in these respects.\n\nIn a pre-trial order entered pursuant to 18 U.S.C. § 3432,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e the district court ordered the Government to provide the defense with the names and addresses of all its witnesses except those under Government protection ten days in advance of trial date. The Government complied by timely providing a list of 99 witnesses, including 18 identified as protected, giving addresses for all but the protected witnesses. The court then denied a defense motion that these addresses be submitted in camera to allow defense interviews before trial. The court ruled that the Government's refusal to disclose the addresses was authorized by its order and was consistent \"with the letter and spirit of the [Witness Protection] program,\" but stated that the court would arrange for defense interviews with protected witnesses before they testified. Once trial was underway, defense counsel were allowed access to these witnesses, some of whom agreed to be interviewed, but most of whom did not. In the course of this process the court denied a defense motion that the court supervise the defense counsels' access to these witnesses based upon an assertion that the prosecution had interfered with their access by advising one such witness that he need not submit to interview. Receiving the prosecution's response that he had indeed advised the witness that whether to interview was his decision, the court ruled that defense counsel was only entitled to request interviews, not to compel them, and admonished the prosecution that the defense was to have a meaningful opportunity to seek interviews.\n\nWe find no denial of constitutional rights in the court's handling of defense access to the protected witnesses. As the court ruled, only access is a matter of right, there is no right to have witnesses compelled to submit to interview, hence no violation by a prosecutor's advising witnesses to that effect. See United States v. Black, 767 F.2d 1334, 1338 (9th Cir. 1985); United States v. Walton, 602 F.2d 1176, 1179-80 (4th Cir. 1979). Except for not providing the addresses of protected witnesses, the Government effectively complied with the court's order and with 18 U.S.C. § 3432 by submitting its entire list at least three days before the taking of testimony at trial began. The failure to provide the addresses of protected witnesses was a technical violation of § 3432 (in its then form) that may not have been curable, as the district court sought to do, by drawing on the \"spirit\" of the \"Witness Protection Program,\" 18 U.S.C. § 3521 et seq. However, we agree with those courts that have held that a defendant claiming a violation of the right to access that § 3432 is designed to protect must show actual prejudice from any impairment or interference with the right, see United States v. Pepe, 747 F.2d 632, 654-55 (11th Cir. 1984), and appellants have shown no particularized prejudice here. Their access to protected witnesses was delayed, but this is justified when, as clearly was the case here, the threat of violence is palpable. See Walton, 602 F.2d at 1179-80. Access was ultimately provided, and though appellants quarrel with its timing and its circumstances, they have offered nothing indicating how exactly they were harmed by the delay. Accordingly, we conclude that no prejudicial error occurred respecting the appellants' constitutional right not to be denied effective access to witnesses.\n\nFinally, we find no violation of appellants' confrontation rights in the court's refusal to allow defense counsel to cross-examine protected witnesses about the reasons for their refusals to submit to interviews. The motives and biases of all these witnesses were otherwise freely exposed to cross-examination. The restriction imposed was well within the district court's discretion.\n\nF.\n\nAppellants severally challenge the sufficiency of the evidence to convict them on various of the counts on which the jury found them guilty. We assess these insufficiency claims under the familiar test of Jackson v. Virginia, 443 U.S. 307, 319, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979), which asks whether viewing the evidence in the light most favorable to the prosecution \"any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" And, applying that test, we find no error among those assigned.\n\nWe review a voluminous trial record here and our review has disclosed a number of insufficiency claims whose lack of merit warrants no extended Discussion--indeed whose only justification would appear to be an understandable abundance of caution. We will identify all the insufficiency claims made but confine detailed Discussion to those revealed by our review to warrant it.\n\n1.\n\nEach of the appellants challenges the sufficiency of the evidence to support the requisite finding under the CCE count that he acted as an organizer, supervisor, or manager with respect to five or more persons. See 21 U.S.C. § 848(a),(b). Our review of the record satisfies us that the evidence was more than sufficient to support the requisite jury findings on this issue as to each appellant. Briefly, the crux of the appellants' several contentions here--indeed their indispensable point--is that appellants did not organize, supervise, or manage anyone; that the persons relied upon by the Government as \"supervisees\" and with whom they indisputably engaged in drug trafficking activities were essentially independent retail dealers with whom their only relationships were those of seller and buyer. This essential factual theory of their defenses, and the indispensable point of their insufficiency claims, is completely belied by the record. That record reveals --certainly supports findings beyond a reasonable doubt--that these \"retailers,\" in more than sufficient numbers as to each of the appellants, acted as \"workers\" who were either or both organized, supervised, and managed by appellants while acting as principal \"partners\" in a concerted drug trafficking enterprise, and that some of these people served variously not only as street dealers for the enterprise but as sometime chauffeurs, hideout providers, weapons-keepers, and general underlings for each of the appellants.\n\nOur review of the record similarly discloses no merit in Roane's further claim that the evidence on the CCE count was not sufficient to prove that he had committed three (at least) predicate drug-related violations, nor in Roane's and Johnson's respective claims that neither was shown to have \"obtained substantial income as resources\" from the CCE, as required under § 848(c).\n\n2.\n\nTipton who, as earlier indicated, was convicted of six of the eight capital murders charged to him under § 848(e) and sentenced to death on three of the six (those involving Talley, Thorne, and Chiles) challenges the sufficiency of the evidence to convict him on all but the one involving Talley. We find the evidence sufficient to convict on all those challenged.\n\nThe five killings at issue resulted from two separate episodes, one involving the contemporaneous murders of Armstrong, Long, and Carter; the other involving the contemporaneous murders of Chiles and Thorne. We consider them in that order.\n\nAs our earlier summary account of the Armstrong, Carter, Long murder episode reveals, the actual killings were done by Cory Johnson. The evidence of Tipton's culpability was only that of aider and abettor; specifically that he was instrumental in planning the murders and directly aided their execution by driving Cory Johnson, the designated executioner, to the scene, awaiting accomplishment of the deed in a getaway car, then driving the executioner from the scene.\n\nSimilarly, though the evidence of the murders of Chiles and Thorne most surely identified Cory Johnson as the actual executioner of both, it also suffices to support verdicts against Tipton as principal or as aider and abettor in those murders. Specifically it suffices to support findings that Tipton and Johnson planned the executions of both victims for suspected treachery (Chiles) and thievery (Thorne) in relation to the drug-trafficking enterprise, and that Tipton was present at the scene as an active participant in seeing that the executions were carried out and that those responsible escaped detection.\n\n3.\n\nRoane and Johnson raise like challenges to their respective convictions on Counts 14 and 16. Each attacks the sufficiency of the evidence to convict him of two counts of violating 18 U.S.C. § 1959 by killing one Torrick Brown (Count 14) and wounding one Martha McCoy (Count 16), thereby committing violent crimes \"for the purpose of . . . maintaining or increasing [his] position in an enterprise engaged in racketeering activity . . . .\" The evidence on these two counts was that the killing of Brown and wounding of potential eyewitness McCoy were prompted by a purely personal grievance of Roane's against Brown for \"messing\" with his girlfriend. From this circumstance, each appellant contends that the evidence was insufficient to show any enterprise-related \"purpose\" in his participation in these deeds: on Roane's part, that it showed nothing but a private purpose of revenge; on Johnson's, no more than a private purpose to assist a friend in avenging an affront. But the evidence was sufficient to support jury findings that the deeds were done by Roane and other enterprise members, including Johnson, in part at least in furtherance of the enterprise's policy of treating affronts to any of its members as affronts to all, of reacting violently to them and of thereby furthering the reputation for violence essential to maintenance of the enterprise's place in the drug-trafficking business. The evidence also sufficed to support further findings that participation in this sort of group retaliatory action in behalf of fellow enterprise members was critical to the maintenance of one's position in the enterprise.\n\nSo considered, the evidence sufficed to show the requisite purpose as to each of these appellants. We agree with the Second Circuit that this purpose can be shown by proof that \"a defendant who holds a position in a RICO enterprise . . . committed an underlying crime of violence with a motive of retaining or enhancing that position\"; that such \"self-promotion\" need not be \"the defendant's only or primary concern\"; and that evidence suffices if from it a jury \"could properly infer that the defendant committed his violent crime because he knew it was expected of him by reason of his membership in the enterprise or that he committed it in furtherances of that membership.\" United States v. Concepcion, 983 F.2d 369, 381 (2d Cir. 1992).\n\nHere, the jury properly could have inferred from the evidence of the enterprise's policies of mutual support, violent retaliatory action, and group expectations of its members that both Johnson and Roane participated in the killing of Brown and the contemporaneous wounding of McCoy as \"an integral aspect of [their] membership\" in the enterprise and in furtherance of its policies. See id. As to Johnson, who had no personal grievance against either Brown or McCoy, the evidence clearly suffices to show \"maintenance of his position\" in the enterprise as the sole or certainly dominant purpose of his conduct. As to Roane, we agree with the Government that although the evidence clearly established private revenge as his primary purpose, it also supported a finding that once he had enlisted the aid of his fellow enterprise members in his behalf, he acted not only for himself but as a member of the enterprise in furthering its policies of retaliatory violence against any who sufficiently antagonized any of its members, and in order to maintain his position in it.\n\nG.\n\nAppellants contend, and the Government concedes, that their several convictions and sentences on the § 848 CCE and § 846 conspiracy counts cannot both stand because the § 846 conspiracy as charged is a lesser included offense within the § 848 CCE as charged. We agree. Rutledge v. United States, 134 L. Ed. 2d 419, 116 S. Ct. 1241 (1996) (so holding); see also United States v. Butler, 885 F.2d 195, 202 (4th Cir. 1989) (same). Accordingly, we must remand for vacatur of the § 846 judgments against each of the appellants.\n\nH.\n\nWe have considered the various other challenges made by appellants to guilt-phase rulings of the district court,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and find no reversible error with respect to any.\n\nIV.\n\nWe next consider a number of challenges to the district court's conduct of the capital-penalty phase of the trial.\n\nA.\n\nAppellants contend that the district court erred in denying their several motions for severance of their trials in the capital-penalty phase. They point to social science studies suggesting that joint trials in this phase lead to a higher percentage of death verdicts and to less individualized decisionmaking, and to the Supreme Court's recognition of the constitutionally-grounded need for \"a greater degree of reliability when the death sentence is imposed,\" Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978), as confirming that heightened vigilance in applying severance principles is required in the capital-penalty phase. Roane Br. 116-17. More specifically, they argue that joint capital-penalty trials necessarily reduce the jury's ability to give individualized consideration to aggravating and mitigating factors, and that, in particular, 21 U.S.C. § 848(m)(8), which requires the jury to consider as a mitigating factor that \"another defendant . . . equally culpable . . . will not be punished by death,\" perversely operates against jointly-tried defendants in the penalty phase by encouraging juries to finesse the difficult relative culpability inquiry by simply sentencing all to death. Roane Br. 118-19.\n\nFrom all this, appellants contend that \"joint capital sentencing hearings are prima facie inconsistent with the Eighth Amendment.\" Roane Br. 117. By this we understand them to concede that such joint trials are not per se unconstitutional and to assert only that discretion as to severance in this particular context is ultimately subject to constitutional constraints derived from the Supreme Court's \"individualized consideration\" jurisprudence as embodied in Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976), and its progeny. Without accepting the \"prima facie unconstitutional\" characterization, we basically agree with the position that trial court discretion as to severance in the capital-penalty phase must be considered so constitutionally constrained at its outer limits and, as a corollary, that our standard of review is for abuse of a discretion so constrained. Cf. Sampley v. Attorney Gen., 786 F.2d 610, 613 (4th Cir. 1986) (Sixth Amendment right to counsel ultimately constrains discretion in ruling on continuance motions).\n\nReviewing under that standard, we cannot find abuse of discretion here. The concerns raised by appellants are legitimate ones. But there are countervailing considerations that properly may be weighed in the discretionary balance. Because the relevant statutory provision, § 848(i)(1)(A), requires that, except in situations not present here, the penalty hearing shall be conducted before the same jury that determined guilt, severance here would have required three separate, largely repetitive penalty hearings before this jury. The same considerations of efficiency and fairness to the Government (and possibly the accused as well) that militate in favor of joint trials of jointly-charged defendants in the guilt phase, see Lockhart v. McCree, 476 U.S. 162, 181, 90 L. Ed. 2d 137, 106 S. Ct. 1758 (1986); Richardson v. Marsh, 481 U.S. 200, 210, 95 L. Ed. 2d 176, 107 S. Ct. 1702 (1987), must remain generally in play at the penalty phase. The district court was therefore entitled to weigh those considerations in the balance.\n\nMore important of course than any consideration of inconvenience or possible unfairness to the Government from sequential separate trials are the possibilities of unfairness to the accused persons from a joint penalty-phase trial--specifically the threat posed to individualized consideration of their situations, and in particular the quite different mitigating factors relevant to each. While such a potential risk was certainly present here, as it will be in any case involving multiple defendants, it could not of course have been entirely removed by conducting three sequential, largely repetitive hearings before the same jury. More critically, we are satisfied that the court's frequent instructions on the need to give each defendant's case individualized consideration sufficed to reduce the risk to acceptable levels. At the outset of the penalty phase, the court--obviously aware of the special risk--admonished the jurors that they \"must consider each defendant individually.\" JA 4137. In its concluding instructions on the jury's duty \"to decide whether each individual defendant shall live or die,\" JA 4810-11, the court reiterated that the duty was \"to make a decision regarding each defendant and each capital case,\" JA 4817. Further, in its instructions on the critical weighing process, the court especially emphasized the need for individualized consideration by pointing out that \"not all aggravating factors alleged are alleged against each of the three defendants, or in reference to each capital offense,\" JA 4794, and that each defendant relied on mitigating factors specific to his case. JA 4803. This critical point was further emphasized by the court's submission of separate packets of penalty verdict forms for each defendant. JA 4813. Still further emphasis occurred in the court's remonstrances to Government counsel to \"be specific\" and to \"do it individually,\" whenever objections were made to Government counsels' references to the defendants collectively. JA 4770-72, 4775.\n\nWe are entitled, in the absence of any directly negating evidence, to presume that the jury heard, understood, and did follow these instructions. See Richardson, 481 U.S. at 206. And we are bolstered in the general presumption by the results of this jury's deliberations. Only Johnson was sentenced to death on all of the capital murder counts on which he was convicted. Tipton was sentenced to death on three of the six on which he was convicted; Roane on one of three.\n\nWe therefore find no abuse of discretion in conducting a joint penalty-phase trial in this case.\n\nB.\n\nAppellants make a number of interrelated facial and as-applied constitutional challenges to certain of the capital sentencing provisions of § 848, hence to the death sentences each received upon jury recommendation for violations of the capital-murder provisions of § 848(e). We preface our Discussion of the challenges with a summary of the most directly relevant provisions and their applications in this case.\n\nIn general the provisions at issue prescribe a \"weighing-process\" involving jury consideration of \"information\" designed to establish the existence of aggravating and mitigating factors as the basis for deciding whether to recommend a death sentence. Non-exclusive \"statutory\" lists of both aggravating and mitigating factors are provided in subsections (n) and (m) respectively. Only those statutory and non-statutory aggravating factors of which a defendant has been given prior written notice by the Government may be considered by the jury, § 848(h)-(j), while any statutory or non-statutory mitigating factor may be considered, § 848(j), (m). In the weighing process, jurors may only consider those aggravating factors found unanimously to exist beyond a reasonable doubt, but any juror may consider any mitigating factor found by him to exist by a preponderance of the evidence, without regard to whether it has been found by any other. § 848(k). The prescribed weighing process is a sequential one. The jury first must determine that at least one of the four aggravating factors listed in subsection (n)(1) exists. Id. These (n)(1) factors all relate to the particular intention had by the defendant in relation to the § 848(e) murder of which he has been convicted: that he (A) \"intentionally killed\"; (B) \"intentionally inflicted serious bodily injury which resulted in . . . death\"; (C) \"intentionally engaged in conduct intending that the victim be killed or that lethal force be employed against the victim, which resulted in the death of the victim\"; or (D) \"intentionally engaged in conduct which [he] knew would create a grave risk of death to a person, other than one of the participants in the offense and [which] resulted in the death of the victim.\" If (somehow) none of these (n)(1) factors is unanimously found to exist, the jury proceeds no further and the death sentence may not be imposed. § 848(k). If any of the (n)(1) factors is unanimously found to exist, the jury then considers whether one or more of the other statutory factors listed in (n)(2)-(12) also exists. If it does not so find, it proceeds no further and the death sentence may not be imposed. Id. If it does find at least one additional statutory aggravating factor to exist, it may then also consider whether any properly noticed non statutory aggravating factors also exist. Id. If they find one (n)(1) aggravating factor, plus one further (n)(2)-(12) statutory aggravating factor to exist, the jurors may then weigh all the statutory and non-statutory aggravating factors they have unanimously found to exist against all mitigating factors properly being taken into account by individual jurors to determine \"whether the aggravating factors . . . sufficiently outweigh any mitigating factor or factors\" to warrant imposition of a death sentence. If the jurors unanimously so find, they may, but need not, recommend the death sentence. Id. If the jury so recommends, the court \"shall sentence the defendant to death\"; if the jury does not so unanimously recommend, the court may only impose a sentence other than death. § 848(e).\n\nFollowing this prescribed process, the Government re-introduced, in transcript form, all the guilt-stage evidence of the capital-murders of which appellants severally had been convicted. Further, it introduced evidence respecting various post-trial episodes in which, while in prison, each of the appellants had threatened reprisal against one or another of the witnesses who testified against him at trial. Finally, the Government introduced records of prior criminal convictions of Johnson and Roane.\n\nEach of the appellants introduced testimonial evidence designed to establish statutory and non-statutory mitigating factors. Principally, in each case, this evidence involved histories of childhood abuse in dysfunctional, unstable family situations and various forms of mental disorders and disabilities.\n\nFollowing the district court's comprehensive instructions on the application of these sentencing provisions to the aggravating and mitigating factor information before it, see JA 3963-95, the jury returned the several verdicts previously noted in the form of special findings and ultimate recommendations. With respect to each of the seven § 848(e) murders for which Johnson had been convicted, the six for which Tipton had been convicted, and the three for which Roane had been convicted, the jury unanimously found as statutory aggravating factors all four of the (n)(1) factors, plus the (n)(8) factor that each of the murders was \"the result of substantial planning and premeditation.\" With respect to the murders of Chiles and Thorne for which Tipton and Johnson had been convicted, the jury additionally found the (n)(5) factor--creation of a grave risk of death to persons other than the victim--to exist. With respect to the Talley murder for which Tipton was convicted, the jury also found the (n)(12) aggravating factor--commission of murder in an especially heinous, cruel, or depraved manner involving serious physical abuse--to exist. Further, as to each of the appellants with respect to each of the capital murders for which he had been convicted, the jury found as additional nonstatutory aggravating factors the commissions of multiple murders, substantial criminal histories, and memberships in a conspiracy that had as a goal the murders of persons other than the victims of the capital murders in issue. Finally, as to both Johnson and Tipton with respect to each of the capital murders for which they had been convicted, the jury found as an additional non-statutory aggravating factor that each had seriously wounded two other persons in the course of committing those murders.\n\nSome or all of the jurors found as to Johnson 18 mitigating factors; as to Tipton, 12; and as to Roane nine.\n\nOn verdict Decision Forms which recited compliance in detail with the court's instructions on the weighing process, the jury unanimously recommended the death sentence for Johnson on all seven of the § 848(e) capital murders for which he had been convicted, those of Louis Johnson, Long, Carter, Armstrong, Thorne, Chiles, and Peyton Johnson; unanimously recommended the death sentence for Tipton on three of the capital murders, those of Talley, Chiles, and Thorne, of the six for which he had been convicted; and unanimously recommended the death sentence for Roane on one of the capital murders, that of Moody, of the three for which he had been convicted. As to the other three murders of which Tipton had been convicted, those of Long, Armstrong, and Carter, and as to the other two of which Roane had been convicted, those of Louis Johnson and Peyton Johnson, the jury reported itself \"not unanimously persuaded\" on the evidence and in light of the court's instructions that the death sentence should be imposed upon those defendants. Sentences were imposed accordingly.\n\n1.\n\nAppellants jointly challenge, as facially unconstitutional, the § 848 sentencing provisions, § 848(h)(1)(B), (j), and (k), which permit non-statutory aggravating factors to be considered. Specifically, they contend that by delegating authority to Government prosecutors to introduce such factors for consideration in sentencing, Congress violated separation-of-powers principles, thereby invalidating the whole process.\n\nWe disagree. Assuming, without deciding, that by specifically authorizing consideration of non-statutory aggravating factors noticed by prosecutors, Congress actually delegated a legislative function to the Executive Branch, as opposed to merely recognizing a traditionally shared function with that branch, see United States v. Pretlow, 779 F. Supp. 758, 765-67 (D.N.J. 1991), any delegation involved was sufficiently circumscribed by \"intelligible principles\" to avoid violating separation of power principles. See Mistretta v. United States, 488 U.S. 361, 390, 102 L. Ed. 2d 714, 109 S. Ct. 647 (1989); accord United States v. McCullah, 76 F.3d 1087, 1106-07 (10th Cir. 1996).\n\n2.\n\nAppellants jointly claim that the (n)(8) aggravating factor--that \"the defendant committed the offense after substantial planning and premeditation\"--is unconstitutionally vague. Because the death penalty imposed upon each of them was based in part upon the jury's finding of that factor's existence, they contend that those death sentences are, as to each of them, invalid.\n\nWe disagree. No objection on this basis was made in the district court, so we review the claim only for plain error under the stringent Rule 52(b) standard as defined in Olano. See supra Part II.A. And, because mathematical precision in defining eligibility and selection factors often is not possible, \"vagueness review\" is quite \"deferential\" in any event. See Tuilaepa v. California, 129 L. Ed. 2d 750, 114 S. Ct. 2630, 2635 (1994). Under such deferential review, an aggravating factor such as the (n)(8) factor \"is not unconstitutional if it has some 'common sense core of meaning . . . that criminal juries should be capable of understanding.'\" See 114 S. Ct. at 2635-36 (quoting Jurek v. Texas, 428 U.S. 262, 279, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976) (White, J., Concurring)).\n\nThe specific claim of vagueness here is directed at use of the word \"substantial\" as a modifier of \"planning and premeditation\" in defining the (n)(8) factor. \"Substantial,\" the argument runs, is not sufficiently precise in meaning to serve the discretion-channeling function constitutionally required for applying eligibility factors in capital sentencing. 114 S. Ct. at 2635; Arave v. Creech, 507 U.S. 463, 470-71, 123 L. Ed. 2d 188, 113 S. Ct. 1534 (1993).\n\nWe disagree. While, as the Supreme Court has recognized, \"substantial\" may have quite different, indeed almost contrary, meanings depending upon its context, see Pierce v. Underwood, 487 U.S. 552, 564, 101 L. Ed. 2d 490, 108 S. Ct. 2541 (1988) (either, e.g., \"large,\" or, e.g., \"in the main\"); Victor v. Nebraska, 511 U.S. 1, 127 L. Ed. 2d 583, 114 S. Ct. 1239, 1250 (1994) (either \"not seeming or imaginary,\" or \"to a large degree\"), context, including clarifying jury instructions, may supply the needed \"common sense core of meaning . . . that criminal juries should be capable of understanding.\" Compare, e.g., Cage v. Louisiana, 498 U.S. 39, 41, 112 L. Ed. 2d 339, 111 S. Ct. 328 (1990) (in total context of reasonable doubt instruction, \"substantial doubt\" would be \"commonly understood [to] suggest a higher degree of doubt than [would 'reasonable' alone]\") with Victor, 114 S. Ct. at 1250 (in total context of reasonable doubt instruction, \"substantial doubt\" not likely to have been interpreted as higher degree than \"reasonable\").\n\nHere, we are satisfied that in total context of the statutory text and the district court's instructions on the (n)(8) aggravating factor, \"substantial\" as a modifier of \"planning and premeditation\" could only have been understood by the jury to mean a higher degree of planning than would have the words \"planning and premeditation\" alone--i.e., more than the minimum amount sufficient to commit the offense. The district court instructed in essentially this vein, that \"substantial planning means planning that is considerable, or ample for the commission of a crime at issue in this case: murder.\" JA 4796. We are therefore satisfied that the (n)(8) aggravating factor's use of the word \"substantial\" to modify \"planning and premeditation\" does not render § 848(n)(8) unconstitutionally vague, but instead, conveys with adequate precision a commonly understood meaning of \"considerable,\" or \"more than merely adequate,\" thereby ensuring that the (n)(8) factor served sufficiently to channel the jury's discretion in assessing eligibility for the death penalty. See McCullah, 76 F.3d at 1110, 1111 (accord).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n3.\n\nAppellants Roane and Tipton each claim that even if the (n)(8) aggravating factor is constitutionally valid, the information before the jury was insufficient to support the findings of its existence as to Roane's murder of Moody, and Tipton's murders of Chiles and Thorne. We review such insufficiency claims under the same Jackson v. Virginia standard applied to guilt findings. Lewis v. Jeffers, 497 U.S. 764, 111 L. Ed. 2d 606, 110 S. Ct. 3092 (1990).\n\nRoane's contention as to the Moody murder is that the information before the jury showed only that his involvement in Moody's murder was confined to an unplanned, spontaneous effort to prevent Moody's escape following his gun-shot wounding by Tipton. In essence, his claim is that only unpremeditated, reflexive action on his part, not \"substantial planning and premeditation\" preceded his stabbing murder of the fleeing Moody.\n\nWe disagree. This account of the relevant information before the jury respecting Roane's murder of Moody substantially understates the relevant circumstances revealed by the trial evidence. The jury had before it information that well before Moody's murder, a motive for it, to which Roane was privy with Tipton and Cory Johnson, had developed. Specifically, trial evidence showed that Moody and his superior, Peyton Johnson, a rival drug dealer, were thought by Tipton, Cory Johnson, and Roane to be standing in the way of their taking over the Newtowne drug market whose development was Roane's special function. Evidence from the guilt phase revealed that Roane had in fact stated that Tipton and Johnson \"and them didn't want Maurice [Peyton Johnson] and 'Little Doug'[Moody] to work in that area . . . selling cocaine.\" JA 3382. From this and other information respecting the details of Moody's murder, the jury properly could find that the visit of Roane and Tipton to Moody's apartment on the night of his murder was for the pre-planned, premeditated purpose of murdering him. It showed that they went there armed with the pistol used by Tipton in wounding Moody although members of the enterprise did not as a matter of policy ordinarily carry weapons. It showed that Moody's initial wounding and eventual killing were in the pattern of the comparable enterprise-related, cold-blooded assassinations of Talley some ten days earlier and of Moody's superior, Peyton Johnson, the night after Moody was killed. If consideration were narrowly confined only to Roane's conduct in killing Moody when he fled following Tipton's failed murder attempt, there might be a serious question whether that specific reactive conduct involved \"substantial planning and premeditation.\" But of course the issue was whether the murder, not its exact means, was the result of substantial planning and premeditation by Roane. And on that issue the jury had ample information upon which to base its finding beyond a reasonable doubt that Moody's murder was \"substantially planned and premeditated\" by Roane in concert with Tipton.\n\nTipton's contention as to the murders of Chiles and Thorne is, as the Government points out, simply a reiteration of his argument that the evidence was insufficient to support his convictions on those two murder counts. We have rejected that argument in Part III.F.2., supra, and the reasons given apply to this argument as well. Specifically, the information before the sentencing jury sufficed to support its finding that Tipton, in concert with Cory Johnson, substantially planned and premeditated those murders in which he and Johnson actively participated.\n\n4.\n\nAppellants jointly challenge the constitutionality of the (n)(1) aggravating factor both facially and as applied. They are correct that if this challenge succeeds on either basis, their several death sentences must be vacated because this particular factor's existence is an absolute prerequisite to imposition of the death penalty under the § 848 capital-sentencing scheme earlier summarized.\n\nConsideration of the facial challenge requires close attention to the statutory text of (n)(1) and to its intended functioning within the weighing process prescribed by § 848's capital-sentencing scheme. Under that scheme, a jury must, in order to recommend the death penalty, first find as an aggravating factor under (n)(1) that\n\n(1) The defendant--\n\n(A) intentionally killed the victim;\n\n(B) intentionally inflicted serious bodily injury which resulted in the death of the victim;\n\n(C) intentionally engaged in conduct intending that the victim be killed or that lethal force be employed against the victim, which resulted in the death of the victim;\n\n(D) intentionally engaged in conduct which--\n\n(i) the defendant knew would create a grave risk of death to a person, other than one of the participants in the offense; and\n\n(ii) resulted in the death of the victim.\n\nAppellants' facial challenge is based on the claim that the (n)(1) aggravating factor fails, as is constitutionally required, adequately to guide and channel sentencing discretion in imposing the death penalty. Roane Br. 133. We disagree.\n\nAppellants properly point out that under the Supreme Court's decision in Arave, \"when the purpose of a statutory aggravating circumstance is to enable the sentencer to distinguish those who deserve capital punishment from those who do not, the circumstance must provide a principled basis for doing so. If the sentencer fairly could conclude that an aggravating factor applies to every defendant eligible for the death penalty, the circumstance is constitutionally infirm.\" 113 S. Ct. at 1542 (citations omitted). And, they also point out, correctly we may assume, that the four separate circumstances, (A)-(D), set out as bases for finding the (n)(1) aggravating factor to exist essentially replicate the threshold mental states constitutionally required for death-penalty eligibility under Tison v. Arizona , 481 U.S. 137, 158, 95 L. Ed. 2d 127, 107 S. Ct. 1676 (1987), and Enmund v. Florida, 458 U.S. 782, 788, 792, 73 L. Ed. 2d 1140, 102 S. Ct. 3368 (1982). From these two propositions, they then contend that because \"every murderer must constitutionally satisfy one of these requirements to be subject to the death penalty,\" the several (n)(1) circumstances that merely replicate the required threshold eligibility states fail under Arave to provide a principled basis for distinguishing those who deserve capital punishment from those who do not.\n\nThis contention fails in its Conclusion. The four (n)(1) circumstances do essentially replicate the required mental states for constitutional imposition of the death penalty, but in doing so they reflect four distinctly different levels of moral culpability, ranging downward from direct \"intentional killing,\" (A), to intentionally engaging in conduct with known potential for causing death that did in fact cause it, (D). Depending upon the evidence, a properly instructed jury which has returned an unspecific general verdict of guilty on a § 848(e) capital-murder count may have found either that the defendant \"intentionally killed\" or only \"counselled, commanded, induced, procured, or caused\" or \"aided and abetted\" the intentional killing. § 848(e)(1)(A); 18 U.S.C. § (2)(a).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn requiring the jury at sentencing then to address and make findings respecting these different circumstances--some of which are necessarily implicit in any guilty verdict on a § 848(e)(1)(A) murder count-- § 848(n)(1) provides precisely the constitutionally required, principled basis for further distinguishing between those murderers thought deserving of death and those not thought to be. See Arave, 113 S. Ct. at 1543 (degree of culpability, as measured by specific mental state, is proper basis for making death penalty choices among murderers); Tison, 481 U.S. at 157-58 (\"highly culpable mental state . . . may be taken into account in making a capital sentencing judgment\"). They might well, for example, guide a discretionary decision to recommend death for one defendant found guilty under § 848(e) because he \"intentionally killed,\" i.e. , was a direct executioner, but not to recommend death for another defendant also found guilty not because he had been the actual executioner of a victim but because he had \"caused\" or \"procured\" his intentional killing by another and thereby had \"intentionally engaged in conduct intending that the victim be killed.\"\n\nWe therefore reject appellants' facial challenge to the constitutionality of § 848(n)(1).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\n5.\n\nAppellants jointly contend that, in any event, the (n)(1) aggravating factor was unconstitutionally applied as to each of them in the sentencing phase, thereby invalidating the several death sentences imposed upon them. The contention is a serious one, and we conclude that error did occur in the district court's submission and instructions respecting this factor, but we further conclude that the error was harmless beyond a reasonable doubt as to each appellant.\n\nOver appellants' objections, JA 4688, 4786, the district court, by its verdict forms and its instructions, allowed the jury, if it chose, to find more than one of the specific circumstances, (A)-(D), as a basis for its determination of the (n)(1) aggravating factor's existence. The special verdict forms listed these circumstances--as does the statute\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e--as if they might be found cumulatively, see JA 414 (Tipton form), and the court instructed that \"you must find at least one from the first category [the (n)(1) category] of aggravators.\" JA 4793, 4794 (emphasis added). Following the apparent authorization thus given, the jury, as previously noted, found all four circumstances as to each of the murders for which each of the appellants had been convicted, including of course those for which it then recommended death sentences.\n\nAppellants contend that allowing such a cumulation of \"multiple overlapping aggravating factors, based upon a single element of the crime\" to be considered in the weighing process unconstitutionally skewed the process in favor of death. And they argue that skewing was further exacerbated by the court's instruction to the jury that having already necessarily found in the guilt phase that each of the murders in issue was intentional, the purpose of requiring a re-finding of at least one of the specific intentions embodied in the (A)-(D) circumstances was simply \"to insure that this factor was considered by you at the first phase, or guilt phase.\" JA 4793.\n\nWe agree with appellants that the district court's verdict submission and instructions respecting the purpose of the (n)(1) factor(s) and their proper application by the sentencing jury was erroneous. The court's instructions misconstrued the essential purpose of the specific (A)-(D) circumstances set out as discrete alternative bases for making the required (n)(1) finding. That purpose, as earlier discussed, is not the anomalous one of merely re-confirming (or, by not confirming, impeaching?) the jury's earlier finding of intent in the guilt phase. It is instead to focus the jury's attention upon the different levels of moral culpability that these specific circumstances might reasonably be thought to represent, thereby channeling jury discretion in the weighing process.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e To allow cumulative findings of these intended alternative circumstances, all of which do involve different forms of criminal intent, runs a clear risk of skewing the weighing process in favor of the death penalty and thereby causing it to be imposed arbitrarily, hence unconstitutionally. Stringer v. Black, 503 U.S. 222, 230-32, 117 L. Ed. 2d 367, 112 S. Ct. 1130 (1992). On this basis, the Tenth Circuit recently has vacated a death sentence imposed for a § 848(e) capital murder where the district court had erroneously, in the Tenth Circuit's view, allowed the jury to find both the (C) and (D) circumstances to exist as (n)(1) aggravating factors. McCullah, 76 F.3d at 1111 (\"while the factors are not identical per se, [one] necessarily subsumes the [other],\" and so impermissibly duplicates).\n\nWe agree with the McCullah court that such a submission (here of all four (n)(1) circumstances) that permits and results in cumulative findings of more than one of the (n)(1) circumstances as an aggravating factor is constitutional error. As earlier indicated, however, we further conclude, as we properly may in appellate review, Stringer, 503 U.S. at 232, that the error was harmless beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nIn considering whether the error was so harmless, we keep in mind the two possible ways in which it could have prejudiced--not been harmless--in producing the challenged death sentences: first, by causing the jury to assess the weight of the (n)(1) circumstances it found on an unfair quantitative basis that gave four-fold effect to what was essentially a single factor--criminal intent; second, by allowing the jury to find a more morally culpable circumstance than was supported by the sentencing information, including the guilt-phase evidence, that was before it. With those two possible sources of actual prejudice in mind, we then ask what the record indicates the jury would have done had it been properly instructed on its consideration of the critical (n)(1) factor. If the answer is that it would surely have done just what it did in the end under the erroneous instruction--recommended each of the death sentences now challenged--harmlessness is thereby demonstrated as to each. See Clemons, 494 U.S. at 754 (so stating proper harmlessness test).\n\nTo get at this, we have first to establish what a proper instruction would have been as to those murders for which the challenged death sentences were imposed. Fortunately, we need not decide for the limited purpose at hand whether as a general proposition a proper (n)(1) instruction would always submit for jury consideration only those (n)(1) circumstances, (A)-(D), for which there was sufficient evidentiary support before the jury.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Here, though on a mistaken legal premise, that was indeed done as to each of the murders for which the death sentence was imposed. For as to each there was evidentiary support for all four of the circumstances submitted, including (A), the most culpable. Critically for our purpose, however, a proper instruction would also have directed that from among those circumstances, (A)-(D), submitted for consideration as alternatives, only one should be found as the basis of the required (n)(1) aggravating factor. Accordingly, the harmless-error question for us becomes whether if the jury had been instructed properly that as to each of the murders in issue it might consider circumstance (A) and one or more of (B), (C), and (D), but could only find one of these as the basis for its (n)(1) finding, it would have reached the same result it reached under the erroneous instruction. We are so convinced.\n\nFirst off, it is obvious that as to each of the murders in issue, the jury under a proper instruction would have found circumstance (A), intentional killing, as the sole basis for its (n)(1) finding. It did, after all, find this as the most culpable of the circumstances actually submitted to it; it is inconceivable that if confined to finding one, it would not have so found. Might it, however, having found only that one circumstance as an (n)(1) aggravating factor, then have accorded it so much less weight than it did to the four circumstances it improperly found that it would have come out differently in its weighing process? We are satisfied that it would not have, for several reasons.\n\nFirst, because, as the Government points out, each of the other three (n)(1) circumstances, (B), (C), and (D), that the jury found is necessarily subsumed as merely a \"lesser-included\" aspect of the (A) --\"intentionally killed\"--circumstance. That being so obviously the case, we cannot believe that the jury gave any greater weight to the aggregate of overlapping mental-state circumstances than it would have to the all-embracing (A) circumstance alone. We are bolstered in this conviction by the district court's careful instructions which emphasized both the impropriety of quantitative weighing of factors, and the overlapping, \"lesser-included\" relationship between the (A)-(D) circumstances it allowed the jury to find. In its original sentencing instructions, the court emphasized that the weighing process \"is not a mechanical\" one; that it is not \"determined by raw numbers\"; and that \"instead, you must consider them qualitatively.\" JA 4810. In supplemental instructions, responding to a jury inquiry, the court pointed out that one who under its instructions might be found to have \"intentionally engaged in conduct intending that the victim be killed\" under (C), might also be found, if he followed through on that intention with an \"actual stabbing and shooting,\" to have \"intentionally killed\" under (A). JA 4837-38. While, as indicated, this instruction was given on the erroneous premise that more than one such circumstance could properly be found, it nevertheless served to convey to the jury that, as necessarily subsumed circumstances, they were not to be given cumulative weight.\n\nMost critical, however, to our assessment that the jury did not in recommending the challenged death sentences give more weight to the aggregate of (n)(1) circumstances than it would have to the (A) circumstance alone under a proper instruction, is the actual result it reached on the various murders for which it had severally convicted the appellants. Though it found all the (n)(1) circumstances as to each appellant on each of these murders, it only recommended the death sentence in respect of those murders as to which the evidence supported a finding either that the particular appellant was the actual killer or was physically present as an active participant in the killing. This clearly indicates to us that whatever misapprehensions the jury may have received from the court's allowance of cumulative findings of (n)(1) circumstances, the jury properly accorded the weight it should have to the (A) circumstance in those cases where, under a proper instruction, it would have been found as the sole (n)(1) factor.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nNeither, on this assessment, is there any possibility of the other potential prejudice from erroneously allowing multiple (n)(1) findings: that this permitted the finding of a higher degree of culpability than was supported by the evidence. As to each of the murders for which the death sentence was imposed, the evidence clearly (and uniquely) supported a finding of the (A) circumstance.\n\nWe therefore conclude that beyond a reasonable doubt the district court's error in allowing the jury to find all of the (n)(1) circumstances as an aggravating factor was harmless in respect of the several death sentences imposed.\n\nC.\n\nWe have carefully considered appellants' other claims of error in the capital sentencing phase\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and find no error warranting correction or Discussion.\n\nV.\n\nWe consider last the Government's cross-appeal from the district court's order staying execution of the death sentences severally imposed upon appellants pending congressional authorization of the means of execution.\n\nAt the time these death sentences were imposed, no federal statute provided authorization for the specific means of executing such sentences. Before enactment of the Sentencing Reform Act of 1984 (the \"Sentencing Guidelines\"), 18 U.S.C. § 3566 had provided that with respect to death sentences imposed under the few then extant federal capital offenses the means of execution should be that \"prescribed by the laws of the place within which the sentence is imposed,\" or, failing such laws, as prescribed by the law of another state designated by the sentencing court. Section 3566, however, was repealed upon enactment of the Sentencing Reform Act and had not been replaced by any other generally applicable provision when these death sentences were imposed.\n\nEffective on February 18, 1993, however, the Attorney General of the United States had promulgated regulations providing that as to death sentences imposed under § 848(e), \"except to the extent a court orders otherwise, a sentence of death shall be executed . . . by intravenous injection of a lethal substance or substances in a quantity sufficient to cause death.\" 58 Fed. Reg. 4898, 4901-02 (1993) (codified at 28 C.F.R. § 26.3). Invoking these regulations as authority, the Government moved for issuance of an order of execution that would permit a United States Marshal to carry out appellants' several death sentences at a time and place to be designated by the Director of the Bureau of Prisons. The appellants objected to issuance of such an order, contending that the Attorney General's regulations were ultra vires its powers, hence provided no authority for judicial issuance of such an order; that Congress possessed the exclusive power to prescribe, as a legislative matter, the means by which federal death sentences should be executed; and that in the absence of congressional authorization, the appellants' death sentences could not be executed. The district court agreed and entered an order affirmatively staying the executions until such time as Congress provided specific authorization of means.\n\nSince entry of that order, Congress has enacted the Federal Death Penalty Act of 1994 as part of the Violent Crime Control and Law Enforcement Act of 1994, Pub. L. No. 103-322, 108 Stat. 1796. This legislation created a number of new capital offenses, and contained capital-sentencing provisions for the new capital offenses and for previously existing ones which, unlike 21 U.S.C. § 848(e), did not contain them. It also included a general implementation provision, 18 U.S.C. § 3596 (Supp. 1996), which authorized the execution of any defendant \"sentenced to death pursuant to this chapter,\" id. (emphasis added), essentially as was provided in former 18 U.S.C. 3566, i.e., under the law of the state of imposition or of a court-designated state. This provision, however, does not by its terms apply to death sentences imposed under § 848(e).\n\nAt the present time, therefore, the situation remains as it was when the district court issued its stay of execution order: The only formal authorization for the means of execution is the regulation issued by the Attorney General. We therefore address the correctness of the district court's holding that this regulation is not constitutionally valid because it purports to exercise a power which, being legislative, is exclusively that of Congress. And, we disagree with that holding.\n\nWe conclude, first off, that although Congress clearly may, if it chooses, preemptively legislate the means of executing federal death sentences, its power to do so is not exclusive of the power of the executive branch, where Congress has not acted preemptively, to provide those means as an aspect of its constitutional power to \"see that the laws be faithfully executed.\" U.S. Const. art. II, § 3. Congress has itself authorized the Attorney General to \"prescribe regulations for the government of [her] department, . . . [and] the distribution of its business . . . ,\" 5 U.S.C. § 301 (1996), has vested all functions of the Department of Justice in the Attorney General, and has authorized officers, employees, and agencies of the Department to perform those functions, 28 U.S.C. §§ 509, 510 (1996). Among those agencies are the United States Marshals, whose legislatively conferred obligation is to \"obey, execute, and enforce all orders of the United States District Courts,\" 28 U.S.C. § 566(a) (1993). We conclude that, absent directly preempting congressional action, the Attorney General had constitutional and statutory authority to provide by regulation the means for executing death sentences imposed under 21 U.S.C. § 848(e), there being no claim made here that lethal injection is itself an unconstitutional means.\n\nNext, we conclude that Congress has not, either expressly or by necessary implication, preempted the power of the executive branch, through the Attorney General, to authorize the means at issue. There is of course no claim that Congress has expressly provided some other means for executing § 848(e) death sentences, nor that it has expressly reserved that power to itself, nor that it has expressly forbidden exercise of the power by the Attorney General. Appellants essentially claim, however, that Congress has by necessary implication asserted its exclusive power to provide the means, thereby preempting any power otherwise possessed by the Attorney General to act in the absence of express congressional legislation. We disagree.\n\nThe claims of implied preemption are based essentially on the fact that from time to time Congress has exercised exclusive power in the matter (before repeal of § 3566) and an almost exclusive power (since enactment of the Violent Crime Control and Law Enforcement Act of 1994). But we know of no constitutional or separation-of-powers principle which dictates that where branches share power in a matter, the exercise of that power at any time and to any extent by the branch having primary power acts totally and for all time to preempt exercise of the power by the other branch in areas not expressly preempted by the former. Cf. Wilkerson v. Utah, 99 U.S. 130, 137, 25 L. Ed. 345 (1879) (in absence of statutory prescription for means of execution of sentence, sentencing court had authority to prescribe).\n\nFinally, we reject appellants' contention that even if the Attorney General had power to issue the regulation in issue, its application to appellants would violate the Ex Post Facto Clause because it was promulgated after the commissions of the capital offenses at issue. We agree with the Eleventh Circuit in Chandler, 996 F.2d at 1095-96, that this contention is foreclosed by Dobbert v. Florida, 432 U.S. 282, 53 L. Ed. 2d 344, 97 S. Ct. 2290 (1977) (application of constitutionally adequate capital-sentencing provision enacted after commission of offense not violative of Ex Post Facto Clause because procedural).\n\nVI\n\nWe affirm the convictions and sentences of all appellants in all respects except for their several convictions and sentences on the Count 1 conspiracy count under 21 U.S.C. § 846. We vacate those convictions and sentences for reasons given in Part III.G. of this opinion.\n\nOn the Government's cross-appeal, we vacate the district court's order staying execution of the several death sentences imposed upon each of the appellants and remand with instructions to enter appropriate orders for the executions in accordance with regulation promulgated by the Attorney General.\n\nSO ORDERED\n\nDisposition\n\nDistrict court's order staying execution of the several death sentences imposed upon each of the appellants vacated and remanded with instructions to enter appropriate orders for the executions in accordance with regulation promulgated by the Attorney General.\n\n\u003cspan class=\"fn\"\u003e1. All were jointly charged with conspiracy to possess with intent to distribute and to distribute in excess of 50 grams of cocaine base, in violation of 21 U.S.C. § 846 (Supp. 1996) (Count 1), and with engaging in a continuing criminal enterprise in violation of 21 U.S.C. § 848(a) (Supp. 1996) (Count 2). In addition, they were variously charged with capital murders in furtherance of a criminal enterprise, in violation of 21 U.S.C. § 848(e) and 18 U.S.C. § 2 (1988) (Counts 3, 5, 8, 17, 18, 19, 24 and 25); commission of violent crimes in aid of racketeering activity, in violation of 18 U.S.C. § 1959 (Supp. 1996) (Counts, 4, 7, 10, 13, 14, 16, 21-23, and 27-30); use of a firearm in relation to a crime of violence or a drug-trafficking offense, in violation of 18 U.S.C. § 924(c) (Supp. 1996) (Counts 6, 9, 12, 15, 20, and 26); and distribution (Count 31) and possession with intent to distribute (Counts 32-33) of cocaine base, in violation of 21 U.S.C. § 841(a)(1) (1988). Also charged in this indictment were alleged co-conspirators Vernon Lance Thomas, Jerry Gaiters, Sterling Hardy, and Sandra Reavis. Gaiters and Hardy pled guilty and testified for the Government at appellants' trial. Reavis, who was tried with appellants, and Thomas, who was tried separately, both were convicted on various charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We ordered that all common issues in these consolidated appeals be presented and argued in one brief. Appellant Roane's brief served this function, presenting potentially common issues along with issues specific only to his appeal. Appellants Tipton and Cory Johnson filed separate briefs presenting some issues specific to their respective appeals and identifying those issues raised in Roane's brief which they adopted as common issues. Their identifications of common issues are not always as precise as might be, see Tipton Br. 11, 12; Johnson Br. 27-30, and some issues identified as \"common\" may be questionable as such either conceptually or as adequately preserved for review by all the appellants. We have assumed an intention to adopt wherever the intention was not clear, and have treated all adopted as common so far as was conceptually possible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The difficulty on this issue is created by this circuit's 1963 decision in Near v. Cunningham, 313 F.2d 929 (4th Cir. 1963), a capital case in which it was held that the right to presence in such a case is \"so fundamental . . . that it may not be waived.\" Id. at 931 (principally relying on Hopt v. Utah, 110 U.S. 574, 578, 28 L. Ed. 262, 4 S. Ct. 202 (1884)). Near (which was not brought to the district court's attention) has never been expressly overruled on this point either by this court or by the Supreme Court. Whether it has been implicitly overruled is unsettled. At least one circuit has flatly held that intervening Supreme Court decisions have established that waiver is possible in such cases. See Campbell v. Wood, 18 F.3d 662, 671-72 (9th Cir. 1994) (concluding that Snyder, 291 U.S. at 106, 117, and Allen, 397 U.S. at 342, by rejecting as \"mere dicta\" earlier statements of nonwaivability in, e.g., Hopt and Lewis v. United States, 146 U.S. 370, 36 L. Ed. 1011, 13 S. Ct. 136 (1892), have rejected any such rule). A leading commentator also believes it \"highly doubtful\" in light of these decisions that \"there is [now] such a limitation on waiver.\" 3A Charles A. Wright, Federal Practice \u0026 Procedure § 723, at 18 (2d ed. 1982). On the other hand, another circuit is not that sure on the point. See Proffitt v. Wainwright, 706 F.2d 311, 312 (11th Cir. 1983) (on rehearing) (noting that earlier non-waivability holdings of the Supreme Court have not been expressly overruled, and reserving decision on the issue). And, expressing similar uncertainty, the drafters of amended Rule 43 consider that so far as the rule is concerned, the question of waiver in capital cases remains open \"for further clarification by the courts.\" Fed. R. Crim. P. 43 advisory committee's note to 1974 amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The difficulty of this issue involves uncertainty as to how, if waiver is at all possible in capital cases, it may be effected. It is now settled that without any formal proceeding, waiver of the right to presence may be implied from a defendant's sufficiently disruptive conduct during trial, see Allen, 397 U.S. at 342 (removal by court permissible); or from his voluntarily absenting himself from a trial at whose commencement he was present, see Taylor v. United States, 414 U.S. 17, 38 L. Ed. 2d 174, 94 S. Ct. 194 (1973) (per curiam), or from a stage of trial of whose nature he was aware, see United States v. Gagnon, 470 U.S. 522, 84 L. Ed. 2d 486, 105 S. Ct. 1482 (1985) (per curiam). But, the question whether non-disruptive defendants in custody such as appellants here may waive the right to presence by any means other than an express waiver following a formal on-the-record proceeding arguably remains open. Appellants, relying on Johnson v. Zerbst , 304 U.S. 458, 464, 82 L. Ed. 1461, 58 S. Ct. 1019 (1938) (proceeding required to insure \"intentional relinquishment or abandonment of a known right\"), contend that a formal in-court proceeding is required in such circumstances and was not provided here; the Government, that waiver may and should be implied here, as in Taylor and Gagnon, from a defendant's voluntary conduct, including his presumed acquiescence through failure to object contemporaneously to the conduct of proceedings in his absence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As indicated in earlier text, the Government relies only on its alternative claims of waiver and forfeiture, and has not contended that the general right of presence during jury voir dire does not necessarily extend to immediate physical presence during all its phases, and did not extend under the circumstances of this case to the specific phases here in issue. Because no such contention is advanced, we do not address it, and proceed on the stated assumption for purposes of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In their jointly adopted argument on the denial-of-presence issue, appellants suggest that this case does involve a \"complete exclusion of [the appellants] from the entirety of the voir dire,\" so that prejudice should be presumed. Roane Br. 29, 30. As we have pointed out, the record flatly belies this as an accurate statement of the extent of appellants' physical absences from the voir dire process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Appellants' brief seeks to offer more specific support for this conclusive assertion by referring to an affidavit of Appellant Roane appended to their motion for supplementation of the record or remand. See supra note 6. Although in denying that motion we refused to treat the affidavit as properly before us, we observe that it asserted no more than that had Roane been present, he would have insisted on excluding three identified jurors by peremptory challenges. As indicated in text, even if this were accepted as fact, it would not suffice as a showing of actual prejudice. Nor would the stated bases for his challenges--relationships to law enforcement officers and to the victim of a rape-murder--suffice without more to tip the balance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. We reject appellants' apparent contention that the district Judge's decision to confine questioning to himself, as Fed. R. Crim. P. 24(a) specifically authorizes, constituted in this case an abuse of discretion because the Judge was a black person. Aside from the shakiness of the reason advanced by appellants--that prospective jurors would be significantly more inhibited by questions put by the Judge himself than by questions put by others in his immediate presence--the adoption of such a per se rule would be unthinkable as a matter of policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Of the twelve regular jurors who sat on the case five responded unequivocally \"No\" to the question whether they had strong feelings in favor of the death penalty and were not questioned further on that subject by the court. JA 1496 (juror Hodson); JA 1483 (juror Hayes); JA 1465 (juror Harrison); JA 1172 (juror Catlett); JA 1470 (juror Harvey). The remaining seven, each of whom answered the \"strong feelings in favor\" question other than by an unequivocal \"No,\" were then asked the specific \"reverse-Witherspoon \" question by the court, and each answered it, after further questioning, in the negative. JA 1372 (juror Faircloth); JA 1349 (juror Eike); JA 1431 (juror Griffiths); JA 1436 (juror Guthrie); JA 1205 (juror Coleman); JA 1216 (juror Cooke); JA 1361 (juror Jackson).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Significantly, the court, taking account of the fact that the most directly contradictory expressions came in response to opposing counsels' understandably weighted questions, remarked: \"She gave a right answer to [the prosecutor] when he asked it, she gave a right answer for [defense counsel] when he asked it. She gave the wrong answer to me.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The specific claim, supported by references to the record and an affidavit of counsel, is that the raw figures of the proportion of women to men peremptorily challenged suffice to make out a prima facie case under J.E.B./Batson. According to the affidavit, of the twenty women who were called by lottery for possible selection as jurors in the final stage of the selection process, eight were struck by Government peremptory challenges while only two of the twenty-one men called in that stage were struck. Roane Br. 58. No other suggestion of gender discrimination than these raw figures is offered as the basis of a Batson/J.E.B. prima facie case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The argument actually is two-pronged: (1) § 848(e) violations are not properly considered predicate CCE violations under any circumstances; or (2) alternatively, they may only be considered where the murder-in-furtherance occurred after a CCE had already come into existence. We think the plain language of the relevant provisions defeats both.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. As the Government concedes, such a substantive connection must be implied as an essential element of § 848(e). Appellee's Br. 94; see United States v. Chandler, 996 F.2d 1073, 1097 (11th Cir. 1993). Appellants make no claim that such a connection may not be implied as a matter of statutory interpretation. Cf. United States v. Whiting, 771 F. Supp. 476, 477 (D. Mass. 1991) (no substantive connection implicit in \"engaging in\" prong, though implicit in \"in furtherance of\" prong).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In relevant part, § 1959(a) provides that (a) whoever, as consideration for the receipt of, or as consideration for a promise or agreement to pay, anything of pecuniary value from an enterprise engaged in racketeering activity, or for the purpose of gaining entrance to or maintaining or increasing position in an enterprise engaged in racketeering activity, murders . . . shall be punished . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. At the time, § 3432 provided that A person charged with treason or other capital offense shall at least three entire days before commencement of trial be furnished with a copy of the indictment and a list of the veniremen and the witnesses to be produced on the trial for proving the indictment, stating the place of abode of each venireman and witness. The statute has since been amended by the addition of a critical proviso: except that such list of veniremen and witnesses need not be furnished if the court finds by a preponderance of the evidence that providing the list may jeopardize the life or safety of any person. Pub. L. No. 103-322, Tit. VI, § 60025, 108 Stat. 1982 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. These include the court's failure to define the term \"reasonable doubt\" in its guilt phase instructions; its refusal to remove juror Cooke because of exposure to mid-trial publicity; and its denial of appellants' motions to dismiss all the capital charges because of a violation of 21 U.S.C. § 848(o)'s guarantee of a \"Right . .. to Justice without discrimination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Appellants relatedly argue, though they did not object below, that in its jury instructions, see JA 4795, the district court erroneously indicated that in considering the (n)(8) factor, the jury need find only substantial planning and not, also, substantial premeditation. That this was necessarily the meaning conveyed is not that clear. Even assuming that it was, we could not find in such a slip plain error requiring correction under the Olano standard. It is not conceivable that a jury which had found substantial planning of a murder would not also, if properly instructed, see Walton v. Arizona, 497 U.S. 639, 654, 111 L. Ed. 2d 511, 110 S. Ct. 3047 (1990), have found substantial premeditation of its commission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The alternative means to \"intentional killing\" that are provided in § 848(e)(1)(A) as elements of the offense simply replicate--for whatever reason--the alternative means, in addition to aiding and abetting, that make one \"punishable as a principal\" under the generally applicable provisions of 18 U.S.C. § 2(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We understand the appellants' facial constitutional challenge to be confined to the \"failure-to-channel-discretion\" theory discussed and rejected in the text. See Roane Br. (as adopted) 133-37. Picking up on an assertion in appellants' argument that repeating a guilt-phase element (intent) as an aggravating factor ((n)(1)) \"increases the bias in favor of the death penalty,\" id. at 136, the Government relies on Lowenfield v. Phelps, 484 U.S. 231, 98 L. Ed. 2d 568, 108 S. Ct. 546 (1988), as foreclosing any such \"impermissible-duplication\" claim. The appellants, however, expressly disavow that this is an independent basis of their challenge, asserting that it is \"much more than that,\" hence not affected by Lowenfield . Roane Br. 137, n.100. We have, as indicated, so understood their position, but to the extent an \"impermissible-duplication\" claim inheres as such in their challenge, we agree with the Government that Lowenfield forecloses it. See Chandler, 996 F.2d at 1092-93 \u0026 n.4 (accord).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See ante at 29-30. As there indicated, § 848(n)(1) in listing the (A)-(D) circumstances contains no conjunction signalling whether it was intended that only one of the circumstances should be found or that more than one might be. Predictably, this regrettable omission quickly has led to uncertainty on the point among district courts making early applications of the statute. In addition to the district court in this case, the district court in McCullah, 76 F.3d 1087, apparently had assumed that cumulative findings should be allowed. Other district courts, however, seemingly have assumed that only one should be allowed. See, e.g., Chandler, 996 F.2d at 1082; United States v. Pitera, 795 F. Supp. 546, 556 (E.D.N.Y. 1992); Pretlow, 779 F. Supp. at 771. Correctly pointing out that the statute does not in terms prohibit multiple findings, the Government contends on this appeal, as presumably it did in the district court, that the district court's submission for multiple findings was proper. Gov't Br. 126 n.80. We observe, however, that perhaps aware of the difficulty created by such an interpretation, the Government, in summarizing the (n)(1) provisions, elsewhere suggests that a disjunctive reading should be implied. Id. at 122 (implying an \"or\" reading). For reasons following, we simply disagree with that position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In fairness to the district court, it should be observed that the court also indicated in supplemental instructions to the jury that the (n)(1) circumstances served the function, beyond that of merely re-confirming its guilt-phase criminal intent finding, of pointing up specific levels of culpability depending upon the factual basis for the guilt finding. But, the court then, erroneously we conclude, reiterated that the jury could find more than one circumstance. JA 4837-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Tenth Circuit in McCullah recognized its power to conduct harmless error review of a comparable error, but for unstated reasons declined to do so and remanded for reweighing and resentencing by the district court. 76 F.3d at 1112; see Clemons v. Mississippi, 494 U.S. 738, 754, 108 L. Ed. 2d 725, 110 S. Ct. 1441 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We need not decide it because of the fortuity noted, but we would be amiss not to note the obvious potential for prejudicial error if a jury were permitted to consider and find the (A) circumstance when the guilt-phase evidence sufficed only to convict a defendant as a marginal aider and abettor who did not participate directly in the killing. See note 24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We do not overlook that the jury clearly was under misapprehension --not only as to the propriety of making multiple findings on the (n)(1) factor, but as to the relationship between the basis upon which it had found guilt for a particular murder and the (n)(1) circumstance which reflected that basis. Obviously worried about what (n)(1)(A)'s \"intentionally killed\" embraced, the jury requested supplemental instruction on the point. In response, the district court gave instructions which in ways were accurate and helpful, but it concluded with an unfortunate summation that clearly led the jury to believe that having found guilt, on whatever basis, whether as principal or aider and abettor, they had necessarily found, for (n)(1) purposes, that a defendant had \"intentionally killed,\" so that any and all of the (n)(1) circumstances might appropriately be found. JA 4837-39. This might well have prejudiced any defendant who received the death sentence for a murder in whose commission he was not a direct participant, but of course we are not presented with such a claim, there being no such defendant in this case. Our question is only whether, all things considered, such a misapprehension could possibly have prejudiced a defendant who had been found guilty because the jury determined that he had directly participated in the murder's commission, and we are convinced that the answer to that question is, beyond a reasonable doubt, no.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. These include, inter alia , facial challenges to the use of two non-statutory aggravating factors--substantial criminal histories and participation in a conspiracy having murder as a purpose--; failure to define reasonable doubt in the capital-sentencing instructions; failure to hold the Government to penalty-phase discovery and proof requirements; failure to instruct on proper use of mental and neurological impairments evidence; failure to declare a mistrial because of a prosecutor's comment on Tipton's failure to testify; and failure to order a new penalty-phase trial because of the Government's withdrawal of death-penalty notice against a co-defendant.\u003c/span\u003e\n\n",
    "body_length": 159476,
    "citedas": [
      "90 F.3d 861"
    ],
    "attorneys": "ARGUED: Scott Lawrence Nelson, MILLER, CASSIDY, LARROCA \u0026 LEWIN, Washington, D.C., for Appellant Roane; Eric David White, MORCHOWER, LUXTON \u0026 WHALEY, Richmond, Virginia, for Appellant Tipton; Craig Stover Cooley, Richmond, Virginia, for Appellant Johnson. Robert John Erickson, UNITED STATES DEPARTMENT OF JUSTICE, Washington, D.C., for Appellee. ON BRIEF: Paul F. Enzinna, MILLER, CASSIDY, LARROCA \u0026 LEWIN, Washington, D.C.; David Baugh, Richmond, Virginia, for Appellant Roane; Robert P. Geary, Richmond, Virginia, for Appellant Tipton; John F. McGarvey, Richmond, Virginia, for Appellant Johnson. Helen F. Fahey, United States Attorney, UNITED STATES DEPARTMENT OF JUSTICE, Washington, D.C., for Appellee.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Wilkinson, Chief Judge, Ervin, Circuit Judge, and Phillips, Senior Circuit Judge. Senior Judge Phillips wrote the opinion, in which Chief Judge Wilkinson and Judge Ervin joined.",
    "citation_count": 178
  }
}
