{
  "id": "o6WVSGYBTlTomsSBstRN",
  "document": {
    "title": "Richardson v. Nationwide Mutual Insurance Company",
    "full_title": "ANTOINETTE RICHARDSON v. NATIONWIDE MUTUAL INSURANCE COMPANY .",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "2003-06-12T00:00:00.000Z",
    "docket": "No. 01-SP-1451",
    "body": "As amended June 16, 2003.\n\nArgued April 23, 2002\n\nOpinion for the court by Associate Judge SCHWELB.\n\nDissenting opinion by Associate Judge GLICKMAN at page 52.\n\nAntoinette Richardson, a security guard at an apartment complex operated by National REO Management (REO), alleges that she suffered serious personal injuries, including brain damage, as a result of inhaling carbon monoxide fumes from a leaking gas furnace located on the premises. In a suit against REO which she brought in the Superior Court, Ms. Richardson alleged, inter alia, that REO failed to exercise due care in maintaining the furnace and that her injuries were proximately caused by REO's negligence.\n\nREO was insured under a comprehensive general liability (CGL) insurance policy issued by Nationwide Mutual Insurance Company (Nationwide). The policy contained an \"absolute\" pollution exclusion clause which provided, inter alia, that coverage was excluded for:\n\n(1) \"Bodily injury\" or \"property damage\" arising out of the actual, alleged or threatened discharge, dispersal, seepage, migration, release or escape of pollutants:\n\n(a) At or from any premises, site or location which is or was at any time owned or occupied by, or rented or loaned to, any insured[.]\n\nPollutants means any solid, liquid, gaseous or thermal irritant or contaminant, including smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste. . . . \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nRelying on the pollution exclusion, Nationwide brought an action against REO in the United States District Court for the District of Columbia, seeking a declaratory judgment that Nationwide was not required to defend or indemnify REO in connection with Ms. Richardson's suit. Ms. Richardson was permitted to intervene with respect to certain issues in Nationwide's action and, on July 26, 2000, the District Court granted summary judgment in favor of Nationwide, concluding that the pollution exclusion barred coverage as a matter of law. Nationwide Mut. Ins. Co. v. Nat'l REO Mgmt., Inc., 205 F.R.D. 1, 9-12 (D.D.C. 2000) (Nationwide I). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Ms. Richardson appealed, and on November 2, 2001, the United States Court of Appeals, noting the importance of the issue presented and the lack of any dispositive District of Columbia precedent, certified the following question of law to this court pursuant to D.C. Code § 11-723 (2001):\n\nIn light of the facts set forth below, does the pollution exclusion clause apply to injuries arising from alleged carbon monoxide poisoning?\n\nNationwide Mut. Ins. Co. v. Richardson, 348 U.S. App. D.C. 124, 126-27, 270 F.3d 948, 950-51 (2001) (Nationwide II).\n\nThe largely undisputed history of the adoption of the absolute pollution exclusion reveals that its purpose was to protect insurers, in light of then recently enacted federal environmental legislation, from liability in the billions of dollars for environmental cleanups of hazardous waste sites and industrial facilities. A reasonable person reading the entire clause at the time it was written by the insurance industry and approved by state regulators could fairly conclude that its language was fully consistent with this purpose, and that the exclusion therefore had no application to a malfunctioning furnace in an apartment house. Any ambiguity in the clause must, of course, be resolved in favor of the insured. Finding ourselves in agreement with the decisions of the three highest state courts which have considered factual scenarios and legal issues essentially identical to those here presented, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e with the views of the District agency responsible for the regulation of insurance, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and with the more persuasive rulings of other courts that have addressed similar issues, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e we answer the certified question in the negative.\n\nI. THE BUSINESS AND REGULATORY CONTEXT\n\nThe pollution exclusion clause relied upon by Nationwide in this case and quoted in footnote 1 of this opinion cannot be construed in the abstract, i.e., without an understanding of the business and regulatory context in which the policy of which it is a part was written. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e We therefore begin with a brief description of the procedures by which insurance policies are prepared, and, in particular, we explain how the clause here at issue came into being. In our view, this background illuminates the question whether, as Nationwide contends, the exclusion unambiguously bars coverage, or whether, as Ms. Richardson argues, a proper construction of the policy establishes that the exclusion does not apply.\n\nThe relevant context has been well described in the very helpful brief of the Commissioner of the District's Department of Insurance and Securities Regulation as amicus curiae:\n\nA contract of insurance is in its fundamentals simple. In exchange for a certain sum of money, the insurer agrees to perform if some uncertain future event comes about. The sum paid in advance is called the premium. The subject matter of the contract is called the risk. The contract itself is called a policy. If the policy is limited to only certain hazards or dangers, those are called perils.\n\nSeveral aspects of the organization of the business of insurance flow from its nature. To fix a premium, the insurer must calculate the expected cost of its performance. To do that successfully, it is generally necessary to aggregate and analyze past claims experience. Most insurers, however, do not acquire from their own operations sufficient experience from which to make a reliable calculation. Furthermore, information concerning such matters as local conditions and applicants' claims experience may also be important factors in fixing premiums. Consequently, insurers have historically combined to pool their claims experience as well as to acquire and share other information. . . .\n\nAnother aspect of the business of insurance is the use of form contracts. The use of forms is not a mere matter of convenience. Form policies ensure consistency and comparability between contracts. Premiums are more easily and routinely calculated. Experience gained under one form of policy can be more readily aggregated. Administration of many policies based on a single form is more efficient and readily routinized. The language used in the forms acquires particular meaning, based on repeated application to various circumstances. All of that tends toward achieving the great public office of insurance: to render certain and predictable in financial terms things which are uncertain and unpredictable in their nature.\n\nThe close relation between premium rates and forms of policies means that the same associations that aggregate and analyze claims experience also draft and license the use of policy forms. Such cooperation is expressly authorized by District law. [Citation omitted.] In the area of commercial liability insurance, the largest United States association is the Insurance Services Office (ISO). [Footnote omitted.] The policy at issue in this case is written on an ISO form.\n\nBrief for Commissioner at 4-6 (emphasis in original).\n\nThe foregoing passage reflects the reality that although the policy here at issue is an agreement between Nationwide and REO, its content, which is a part of a \"form\" prepared by the insurance industry, reflects the experiences of insurers generally. Moreover, as noted by the Commissioner, the business of insurance is closely regulated. Id. at 7. Statements made by representatives of the insurance industry to obtain approval of proposed policy language can therefore be quite significant. See, e.g., Doerr v. Mobil Oil Corp., 774 So. 2d 119, 132-34 (La. 2000) (chronicling inaccurate statements by representatives of the insurance industry regarding the meaning of earlier pollution exclusion clauses), opinion corrected on unrelated grounds, 782 So. 2d 573 (La. 2001) (per curiam); Morton Int'l, Inc. v. Gen. Accident Ins. Co. of Am., 629 A.2d 831, 848-55, 868-70 (N.J. 1993) (same), cert. denied, 512 U.S. 1245 (1994); 9 LEE R. RUSS \u0026 THOMAS F. SEGALLA, COUCH ON INSURANCE § 127:8, at 127-24, § 127:14, at 127-37 (3d ed. 1997) (hereinafter COUCH).\n\nAs the Supreme Court of New Jersey has recognized, \"the typical commercial insured rarely sees the policy form until after the premium has been paid.\" Morton Int'l, 629 A.2d at 852 (citations omitted). Moreover, insurance policies are\n\nwritten by the insurers, who are \"equipped with able counsel and other experts in the field,\" while the policyholders, who generally play no role in the drafting of such contracts \"are, in vast majority, not informed in the obscurities of insurance expertise and not equipped to understand other than plain language.\"\n\nCameron v. USAA Prop. \u0026 Cas. Ins. Co., 733 A.2d 965, 968 (D.C. 1999) (quoting Hayes v. Home Life Ins. Co., 83 U.S. App. D.C. 110, 112, 168 F.2d 152, 154 (1948) (Prettyman, J.)) (internal quotation marks omitted); see also Chase v. State Farm Ins. Co., 780 A.2d 1123, 1127 (D.C. 2001). Thus,\n\nto the extent that the pollution-exclusion clause ever was subjected to arms-length evaluation by interests adverse to the insurance industry, that evaluation occurred only when the clause was submitted to and reviewed by state regulatory authorities.\n\nMorton Int'l, 629 A.2d at 852. It is therefore important to consider the meaning of the \"form\" absolute pollution exclusion clause at issue in this case at the time that it was introduced by the insurance industry and reviewed by state regulators.\n\nII. THE HISTORY OF THE POLLUTION EXCLUSION\n\nPrior to World War II, insurance policies in this country were structured to cover liability arising only from specific perils expressly identified therein. See Brief for Commissioner at 10. Beginning in the 1940s, insurers began to offer CGL policies which were not limited to liability for particular perils; instead, coverage started from the premise that \"the risk covered was all liability, unless specifically excluded.\" Id. (emphasis in original). The insurance contract at issue in this case is such a CGL policy.\n\nWe now turn to the pollution exclusion itself. \"Before 1966, to be covered [under a CGL policy], an injury giving rise to liability had to be caused by an accident.\" Brief for Commissioner at 11 (emphasis in original). In 1966, the word \"accident\" in the CGL policy was replaced by \"occurrence,\" and this change was viewed as expanding the insurer's liability by including harms that came about gradually as well as those that occurred as a result of a single accidental event. Id.\n\nIn the 1970s, in order to counteract this perceived expansion of coverage, the insurance industry developed the \"original general pollution exclusion.\" That provision excluded coverage for\n\nBodily injury or property damage arising out of the discharge, dispersal, release or escape of smoke, vapors, fumes, acids, alkalis, toxic chemicals, liquids or gases, waste materials or other irritants, contaminants or pollutants into or upon land, the atmosphere or any water course or body of water.\n\n9 [COUCH] § 127:6. Over time, many policies began to include a \"sudden and accidental\" exception to this pollution exclusion: \"This exclusion does not apply if such discharge, dispersal, release or escape is sudden or accidental.\" See id. at § 127:8.\n\nDoerr, 774 So. 2d at 126; see also Brief for Commissioner at 11-12. According to the Supreme Court of New Jersey, the purpose of the \"sudden and accidental\" exception to the pollution exclusion was to deny coverage only to intentional polluters. Morton Int'l, 629 A.2d at 870-72 (summarized in 9 COUCH § 127:8); see also Claussen v. Aetna Cas. \u0026 Sur. Co., 380 S.E.2d 686, 689 (Ga. 1989) (\"Documents presented by the Insurance Rating Board [which represents the industry] to the Insurance Commissioner when the 'pollution exclusion' was first adopted suggest that the clause was intended to exclude only intentional polluters.\").\n\nSubsequently, in 1980, Congress passed the Comprehensive Environmental Response, Compensation, and Liability Act (CERCLA), 42 U.S.C. §§ 9601 et seq. CERCLA was enacted in order to\n\nallow the government and private individuals or entities to act as quasi-regulators over environmental pollution by allowing them to carry out the cleanup of hazardous waste sites and then recover the expenses of the cleanup from the responsible parties.\n\nDoerr, 774 So. 2d at 126 (citation omitted); see also Key Tronic Corp. v. United States, 511 U.S. 809, 815 n.6 (1994). In response to this legislation, parties alleged to have engaged in environmental pollution at hazardous waste sites began to claim that the standard CGL policy required their insurers to defend them in such actions and to indemnify them if they were found liable. Considerable litigation ensued, especially over the meaning of the \"sudden and accidental\" exception to the general pollution exclusion. Doerr, 774 So. 2d at 126 (citation omitted). Indeed, between 1970 and 1985, \"insurers [were] held liable for many billions of dollars in defense and response costs incurred pursuant to laws that did not even exist at the time the exclusion, with its exception, was written.\" Brief for Commissioner at 12; see also Western Alliance, 686 N.E.2d at 999 (relating absolute pollution exclusion to the \"enormous expense of environmental litigation\") (citing Koloms, 687 N.E.2d at 81).\n\n\"[T]he insurance industry reacted with lightning speed to the possibility that . . . it could find itself indemnifying industries facing the staggering retroactive pollution clean-up costs imposed by the 1980 enactment of [CERCLA].\" Essex Ins. Co. v. Tri-Town Corp., 863 F. Supp. 38, 39-40 (D. Mass. 1994) (quoted in Nationwide II, 384 U.S. App. D.C. at 128-29, 270 F.3d at 952-53). Specifically, insurers introduced the \"absolute\" pollution exclusion in a form very similar to the one at issue in this case. Doerr, 774 So. 2d at 126-27; Brief for Commissioner at 12-13. The Supreme Court of Louisiana explained that\n\n[b]y 1986, the \"absolute\" pollution exclusion had been introduced which omitted from the exclusion the \"sudden or accidental\" exception. [Citation omitted.] \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Throughout its development, the general purpose of these pollution exclusions has remained constant: \"to exclude coverage for environmental pollution, and under such interpretation, [the] clause will not be applied to all contact with substances that may be classified as pollutants.\" [9 COUCH] at § 127:6 n.62 (citing Stoney Run Co. v. Prudential-LMI Comm. Ins. Co., 47 F.3d 34, 37 (2d Cir. 1995)).\n\nImportantly, there is no history in the development of this exclusion to suggest that it was ever intended to apply to anyone other than an active polluter of the environment.\n\nDoerr, 774 So. 2d at 126-27. Indeed, the changes that led to the absolute pollution exclusion were \"intended by the insurance industry to bar coverage for the costs of environmental cleanups.\" Nationwide II, 384 U.S. App. D.C. at 128, 270 F.3d at 952 (citations omitted).\n\nIn Andersen, see note 3 to this opinion, a case factually almost identical to the present one in all relevant respects, the insurer sought to apply the absolute pollution exclusion to death and injury allegedly caused by the inhalation of carbon monoxide fumes from a faulty heating unit in an apartment complex. In ruling in favor of the insured, the Supreme Court of Ohio described the circumstances under which the absolute pollution exclusion came into being:\n\n[T]he genesis of the pollution exclusion does not support the notion that it was created to preclude the kind of claim involved in this case. In June 1970, the insurance industry \"went on record as being 'against' intentional polluters and promulgated the qualified pollution exclusion for insertion in all comprehensive general liability (CGL) insurance policies.\" (Footnotes omitted.) Reiter, Strasser \u0026 Pohlman[The Pollution Exclusion Under Ohio Law: Staying The Course, 59 U. CIN. L. REV. 1165, 1168 (1991)]. The insurance industry explained that \"accidental pollution continued to be insured under a CGL policy, but deliberate polluters would remain uncovered, unable to use insurance to avoid the financial consequences of their acts. On the basis of these representations, nearly every state, including Ohio, allowed the introduction of this new, qualified pollution exclusion.\" (Footnotes omitted.) Id.\n\nThe exclusion disputed in the case at bar, the absolute pollution exclusion, \"was drafted during the early 1980s and was incorporated into the standard form CGL [policies] in 1986.\" Stempel, Reason and Pollution: Correctly Construing the \"Absolute\" Exclusion in Context and in Accord With Its Purpose and Party Expectations (1998), 34 Tort \u0026 Ins.L.J. 1, 5. The purpose of the new exclusion was \"to replace the 1973 'sudden and accidental' [exception] because insurers were distressed by judicial decisions holding that the 1973 exclusion did not preclude coverage for gradual but unintentional pollution.\" Id. Further, \"[t]he absolute exclusion was designed to bar coverage for gradual environmental degradation of any type and to preclude coverage responsibility for government-mandated cleanup[s].\" Id.\n\nAndersen, 757 N.E.2d at 332-33; accord, Western Alliance, 686 N.E.2d at 999.\n\nThe parties to this appeal are emphatically at odds over the meaning of the pollution exclusion clause in REO's policy. There appears to be no substantial dispute, however, as to the clause's history or as to the events that led to its introduction into ISO's form CGL policy. See Koloms, 687 N.E.2d at 79 (describing the events leading up to the insurance industry's adoption of the pollution exclusion as \"well-documented and relatively uncontroverted\"). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIII. LEGAL ANALYSIS\n\nA. General background.\n\nAlthough, as we have noted, the background and history of the absolute pollution exclusion are not in serious dispute, the meaning of the clause has sharply divided the courts. Six years ago, the Supreme Court of Illinois found the arguments for each side of the controversy \"compelling\" and noted the \"vast divergence of the jurisprudence of the courts across the country which have already struggled with the question now facing this court.\" Koloms, 687 N.E.2d at 78. In certifying the present appeal to us, the United States Court of Appeals remarked that \"[c]courts across the nation are hopelessly divided over whether the clause is ambiguous as applied to[, inter alia,] carbon monoxide . . . .\" Nationwide II, 348 U.S. App. D.C. at 130, 270 F.3d at 954.\n\nSome courts have concluded that the language of the exclusion is unambiguous, that it plainly applies to the kind of factual scenario presented here, and that no consideration of the history of the clause or of other contextual or explanatory materials is required or appropriate. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Other courts have held that the clause is ambiguous because its enumeration of \"smoke, vapors, soot, fumes, acids, alkalis, chemicals and waste,\" and its repeated references to \"waste\" and to \"clean[ing] up,\" suggest industrial pollution and environmental contamination; because it contains words such as \"dispersal,\" \"discharge,\" \"escape,\" \"seepage,\" \"irritant\" and \"contaminant,\" which are said to be recognizable as terms of art in environmental law; because a strictly literal reading of the provision may yield incongruous results; and because the demonstrable intent of the industry in introducing the clause was to exclude coverage for entities that actively pollute the environment. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e For the reasons set forth below, we reject the purportedly literal approach appearing in the first group of decisions and align ourselves with what we regard as the more persuasive reasoning of the second group. Indeed, we agree with the Supreme Court of Washington that the insurance industry's attempt to apply the absolute pollution exclusion to the kind of situation presented here is \"simply an opportunistic afterthought, at odds with the original purpose of providing protection to insurance companies from a potentially vast and unforeseen liability for major environmental disasters.\" Kent Farms, Inc. v. Zurich Ins. Co., 998 P.2d 292, 295-96 (Wash. 2000) (citation omitted).\n\nB. The applicable principles of construction.\n\nThe language of the pollution exclusion at issue in this case is set forth at page 2 and footnote 1 of this opinion. The sentences on which Nationwide relies are relatively simple; indeed, their simplicity is what animates Nationwide's argument. Bodily injury from, inter alia, the \"release\" or \"escape\" of pollutants is excluded from coverage. \"Pollutant\" means, inter alia, any \"gaseous . . . irritant or contaminant,\" including \"fumes.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Ms. Richardson claims to have suffered bodily injury \"directly and proximately\" caused by the release of carbon monoxide gas fumes at the insured's premises. Therefore, according to Nationwide, the exclusion unambiguously applies.\n\n\"Where insurance contract language is not ambiguous, a written contract duly signed and executed speaks for itself and binds the parties, without the necessity of extrinsic evidence.\" Cameron, 733 A.2d at 968 (internal brackets and ellipsis omitted) (quoting In re Corriea, 719 A.2d 1234, 1239 (D.C. 1998)). An insurance policy is not ambiguous \"merely because the parties do not agree on the interpretation of the contract provision in question.\" Byrd v. Allstate Ins. Co., 622 A.2d 691, 694 (D.C. 1993) (citation omitted); Corriea, 719 A.2d at 1239. \"We may not 'indulge in forced constructions to create an obligation against the insurer.'\" Chase, 780 A.2d at 1127 (quoting Cameron, 733 A.2d at 968).\n\nBut when construing any writing, whether a statute or a contract, \"[w]e must not, of course, make a fetish out of plain meaning.\" James Parreco \u0026 Son v. District of Columbia Rental Hous. Comm'n, 567 A.2d 43, 46 (D.C. 1989). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In the words of Judge Learned Hand, \"it is one of the surest indexes of a mature and developed jurisprudence not to make a fortress out of the dictionary.\" Cabell v. Markham, 148 F.2d 737, 739 (2d Cir.), aff'd, 326 U.S. 404 (1945); \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Parreco, 567 A.2d at 46 (quoting Cabell). \"It is a fundamental rule that in the construction of contracts the courts may look not only to the language employed, but to the subject-matter and the surrounding circumstances, and may avail themselves of the same light which the parties possessed when the contract was made.\" Merriam v. United States, 107 U.S. 437, 441 (1882); accord, District of Columbia v. Northeastern Constr. Co., 63 App. D.C. 175, 176, 70 F.2d 779, 780 (1934). Indeed, the meaning of a contract \"must be ascertained in light of all of the circumstances surrounding the parties at the time the contract was made.\" 1010 Potomac Assocs. v. Grocery Mfrs. of Am., Inc., 485 A.2d 199, 205 (D.C. 1984) (citing RESTATEMENT (SECOND) OF CONTRACTS §§ 202 (1), 212 (1) (1981)). Nothing in Cameron, Corriea and like cases should be read as excluding from consideration the context in which the words of a contract were written. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\n\"The meaning of words . . . commonly depends on their context . . . . In interpreting the words and conduct of the parties to a contract, a court seeks to put itself in the position they occupied at the time the contract was made . . . .\" RESTATEMENT (SECOND) OF CONTRACTS, § 202 cmt. b. \"Even though words seem on their face to have only a single possible meaning, other meanings often appear when the circumstances are disclosed.\" Id. at § 214 cmt. b. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e To paraphrase Hively v. District of Columbia Dep't of Employment Servs., 681 A.2d 1158 (D.C. 1996), \"even where the words of a [contract] have a 'superficial clarity,' \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e a review of the . . . history [of the relevant provision] or an in-depth consideration of alternative constructions that could be ascribed to [contractual] language may reveal ambiguities that the court must resolve.\" Id. at 1161 (quoting Peoples Drug Stores v. District of Columbia, 470 A.2d 751, 754 (D.C. 1983)). \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e These principles are fully applicable to the kind of controversy now before us; as the Supreme Court of California explained in Montrose Chem. Corp. v. Admiral Ins. Co., 913 P.2d 878, 891 (Cal. 1995),\n\n[the insurer] contends that evidence of the drafting history of the standardized CGL policy provisions and definitions, and available interpretative materials, are irrelevant and should not have been considered by the Court of Appeals in construing the language of its CGL policies issued to [the insured]. Most courts and commentators have recognized, however, that the presence of standardized industry provisions and the availability of interpretative literature are of considerable assistance in determining coverage issues. (See, e.g., Maryland Casualty Co. v. Reeder (1990) 221 Cal. App.3d 961, 968, 270 Cal. Rptr. 719.) Such interpretative materials have been widely cited and relied on in the relevant case law and authorities construing standardized insurance policy language. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn the words of Justice Oliver Wendell Holmes, \"[a] word is not a crystal, transparent and unchanged, it is the skin of a living thought and may vary greatly in color and content according to the circumstances and the times in which it was used.\" Towne v. Eisner, 245 U.S. 418, 425 (1918). The following hypothetical illustrates our thesis: Suppose that on January 1, Ruritania \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and Illyria, \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e having fought a bitter war, agree to an armistice. The armistice provides that, no later than January 8, Ruritania and Illyria shall release \"all prisoners.\" An Illyrian who has been incarcerated in his own country for distributing unlawful drugs brings a lawsuit in which he claims that he is entitled to his freedom. It would surely be incongruous to exclude from evidence in that lawsuit the history that led to the armistice, when that history demonstrates beyond peradventure that the word \"prisoner\" as used in that document, although not so limited by its dictionary definition, necessarily refers to a prisoner of war and does not provide solace for dealers in hashish. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Similarly, in this case, it would be unreasonable to attempt to ascertain the meaning of the absolute pollution exclusion while ignoring the history that defines its raison d'être, namely, to avoid imposing on insurers the obligation to indemnify industries for the \"staggering\" pollution cleanup costs generated by the enactment of CERCLA. Essex Ins. Co., 863 F. Supp. at 39-40. Thus, assuming for the purposes of argument only that the language of the pollution exclusion appears unambiguous today, it may nevertheless have reasonably appeared to have an entirely different context-related meaning to persons who were writing and approving it in the 1980s, when insurers were seeking to avoid unanticipated liability in the billions of dollars for the harm caused by major industrial polluters.\n\nIn the present case, the parties to the insurance policy itself were REO and Nationwide, but the pollution exclusion, as we have seen, is based on a form contract written and presented to state regulators for their consideration and approval by representatives of the insurance industry after CERCLA became law. See Doerr, 774 So. 2d at 126-27; Andersen, 757 N.E.2d at 332-33; Koloms, 687 N.E.2d at 81. The meaning of the language of the absolute pollution exclusion in the form contract has not changed since it was introduced, and we must therefore look primarily to the circumstances then existing to determine whether, as Nationwide insists, the words used plainly and unambiguously rule out coverage. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nIf the language of the exclusion was ambiguous when written, then Nationwide's position is indeed difficult to sustain. \"To negate coverage by virtue of an exclusion, an insurer must establish that the exclusion is stated in clear and unmistakable language, is subject to no other reasonable interpretation, and applies to the particular case.\" Cont'l Cas. Co. v. Rapid-American Corp., 609 N.E.2d 506, 512 (N.Y. 1993). \"The insurer must establish not merely that the policy is capable of the construction it favors, but rather that such an interpretation is the only one that can fairly be placed on the language in question.\" Andersen, 757 N.E.2d at 332 (emphasis added) (citation omitted). \"It will not suffice for [the insurer] to demonstrate that its interpretation is more reasonable than the policyholder's.\" Id. at 333 (citation omitted). Rather, Nationwide must show that Ms. Richardson's construction is altogether unreasonable.\n\n\"The burden is on [Nationwide] to prove that the loss falls within an exclusion.\" Cameron, 733 A.2d at 969 (citing Lang v. F.G. Arwood \u0026 Co., 65 A.2d 194, 196 (1949) and New York Life Ins. Co. v. Miller, 65 App. D.C. 129, 134, 81 F.2d 263, 268 (1935)). Moreover,\n\n[i]n this jurisdiction, as elsewhere, it has long been \"a general rule of construction of policies of insurance . . . that any reasonable doubt which may arise as to the meaning or intent of a condition thereof, will be resolved against the insurer.\" United States Mut. Accident Ass'n of the City of New York v. Hodgkin, 4 App. D.C. 516, 523 (1894), error dismissed, 17 S. Ct. 1002 (1897). \"[I]t is the insurer's duty to spell out in plainest terms - terms understandable to the man in the street -any exclusionary or delimiting policy provisions.\" Holt v. George Washington Life Ins. Co., 123 A.2d 619, 621 (D.C. 1956) (citation omitted). \"Failing such unambiguous language, doubt should be resolved in favor of the insured.\" Id. at 622 (citation omitted). \"The rule that a real ambiguity in an insurance policy is to be construed against the company is not a rule of convenience or a mere technicality of legalists.\" Hayes v. Home Life Ins. Co., 83 U.S. App. D.C. 110, 112, 168 F.2d 152, 154 (1948) (Prettyman, J.). On the contrary, this rule is based on sound public policy, for the contracts in question are written by the insurers.\n\nCameron, 735 A.2d at 968. In recognition of these realities, ambiguities in an insurance policy are construed against the insurer and in favor of \"the reasonable expectations of the purchaser of the policy.\" Chase, 780 A.2d at 1127 (citation omitted).\n\nFinally, we must \"examine the language of the polic[y] and construe it as a whole.\" Kent Farms, 998 P.2d at 294 (citation omitted). \"Put another way, we are required to view the exclusion in light of the whole policy to determine whether, in that context, the exclusion applies.\" Id. at 295. To that end, we must \"examin[e] what the exclusion and similar exclusions are intended to accomplish.\" Id.\n\nC. The use of terminology mirroring the purpose of the exclusion.\n\nThe absolute pollution exclusion in REO's policy is entitled \"Pollution,\" and it excludes bodily injury arising out of the \"actual, alleged or threatened discharge, dispersal, seepage, migration, release or escape of pollutants.\" \"Pollutants\" include any solid, liquid, gaseous or thermal \"irritant or contaminant,\" including \"smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste.\" The eight enumerated pollutants collectively bring to mind byproducts of industrial pollution, Western Alliance, 686 N.E.2d at 999, rather than carbon monoxide from a furnace in an apartment house or a stove in a restaurant. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e In light of the circumstances that generated the adoption of the absolute pollution exclusion, it is hardly astonishing that the word \"waste\" is used five times in the clause in question, that the words \"clean up\" or \"cleaning up\" are used three times, and that many other phrases in the clause \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e are obviously focused on subjects similar to the cleanup of waste sites. Thus, when one reads the entire clause, rather than limiting oneself to the word \"fumes\" in isolation, one cannot reasonably avoid the impression that the revised exclusion has to do with the byproducts of the manufacturing process and with massive environmental cleanup costs, the very concerns that, as a matter of undisputed history, led to the adoption of the new language. Ms. Richardson argues that the exclusion contains terms of art in environmental law, that those who wrote it had environmental provisions in mind, and that the clause in question thus refers to pollution by environmental polluters. At the very least, according to Ms. Richardson, the use of this terminology creates an ambiguity which the court should resolve in favor of coverage. There is considerable support in reason and authority for Ms. Richardson's position.\n\nRead together, the examples in the clause of irritants and contaminants are exactly what one would expect to see in an exclusion \"designed to bar coverage for gradual environmental degradation of any type and to preclude coverage responsibility for government-mandated cleanups.\" Andersen, 757 N.E.2d at 333 (citation omitted). In other words, the exclusion uses terminology which mirrors the undisputed historical context of the adoption of the clause, as described in Andersen, Doerr, Western Alliance and Koloms, and in the Commissioner's brief. Moreover, the exclusion is replete with language used in environmental statutes and regulations of the kind that generated the absolute exclusion's adoption.\n\nThe phrase \"discharge . . . of pollutants\" did not first come into being in Nationwide's insurance policy. The Federal Water Pollution Control Act makes it \"the national goal that the discharge of pollutants into the navigable waters be eliminated by 1985.\" 33 U.S.C. § 1251 (a)(1) (emphasis added); see also § 1251 (a)(3) (\"national policy\" that \"discharge of toxic pollutants in toxic amounts\" be prohibited) (emphasis added). The Act further provides that \"[t]he term 'discharge' when used without qualification includes a discharge of a pollutant and a discharge of pollutants.\" § 1362 (16) (emphasis added).\n\nOther expressions in the pollution exclusion likewise reflect the terminology of environmental legislation and regulations. In CERCLA, \"[t]he term 'release' means any spilling, leaking, pumping, pouring, emitting, emptying, discharging, injecting, escaping, dumping or disposing into the environment . . . receptacles containing any hazardous substance or pollutant or contaminant.\" 42 U.S.C. § 9601 (22) (2000) (emphasis added). The \"seepage\" (or seeping) and \"migration\" of pollutants constitutes a \"release\" in violation of CERCLA. United States v. Shell Oil Co., 841 F. Supp. 962, 969 (C.D. Cal. 1993); Vt. v. Staco, Inc., 684 F. Supp. 822, 832-33 (D. Vt. 1988). Forms of the verb \"disperse\" also appear in environmental regulations. See, e.g., 40 C.F.R. Part 300 (2002).\n\nIn West American Ins. Co. v. Tufco Flooring E., Inc., 409 S.E.2d 692, 699-700 (N.C. Ct. App. 1991), the court recognized the use of environmental phraseology in the absolute pollution exclusion:\n\nThe operative policy terms of the pollution exclusion clause imply that there must be a discharge into the environment before coverage can be properly denied. The operative terms in the version of the pollution exclusion clause at issue in this case are \"discharge,\" \"dispersal,\" \"release,\" and \"escape.\" While they are not defined in the policy, the terms \"discharge\" and \"release\" are terms of art in environmental law and include \"escape\" by definition and \"dispersal\" by concept.\n\n\"Discharge\" is defined in the federal regulations interpreting the Resource, Conservation and Recovery Act (\"RCRA\"), section 1004(3) as the \"accidental or intentional spilling, leaking, pumping, pouring, emitting, emptying, or dumping of hazardous waste into or on any land or water.\" 40\n\nC.F.R. § 260.10 (1990).\n\nAfter quoting from the definition of \"release\" in CERCLA, 42 U.S.C. § 9601 (22), see page 26 of this opinion, the court concluded that\n\nany \"discharge, dispersal, release, or escape\" of a pollutant must be into the environment in order to trigger the pollution exclusion clause and deny coverage to the insured.\n\nId. at 700. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIn Nautilus Ins. Co. v. Jabar, 188 F.3d 27 (1st Cir. 1999), a woman was exposed to hazardous fumes discharged by roofing products used by the insured, Jabar, to repair the roof at her place of employment. In the personal injury suit that followed, Jabar requested Nautilus, his insurer under a CGL policy, to defend the action and to indemnify him for any liability. Relying on the absolute pollution exclusion, Nautilus contested coverage. The trial judge granted summary judgment in Jabar's favor, holding that the pollution exclusion did not apply to the facts before the court. The Court of Appeals affirmed, holding that the exclusion was ambiguous because it could reasonably be interpreted as applying only to environmental pollution, and that \"an ordinary person in Jabar's shoes would not understand that the policy did not cover personal injury claims like those asserted by the [plaintiff and her husband].\" Id. at 30. The court continued:\n\n[T]he terms used in the exclusion clause, such as \"discharge,\" \"dispersal,\" \"release\" and \"escape,\" are terms of art in environmental law and are generally used to refer to damage or injury resulting from environmental pollution. See Atlantic Mut. Ins. Co. v. McFadden, 595 N.E.2d 762, 764 (Mass. 1992) (\"[T]he terms used in the pollution exclusion 'discharge,' 'dispersal,' 'release,' and 'escape,' are terms of art in environmental law which generally are used with reference to damage or injury caused by improper disposal or containment of hazardous waste.\"); West American Ins. Co.[, 409 S.E.2d. at 699] (noting that the terms \"discharge\" and \"release\" are terms of art in environmental law). Given this language, it is entirely reasonable that an ordinarily intelligent insured would understand this provision to exclude coverage only for injuries caused by traditional environmental pollution.\n\nId. (emphasis added).\n\nRelying on the authorities cited in Nautilus, the New York Court of Appeals reached the same conclusion in Cont'l Cas. Co. v. Rapid-Am. Corp., 609 N.E.2d at 513. The United States Court of Appeals for the Second Circuit followed suit in Stoney Run Co. v. Prudential LMI Commercial Ins. Co., 47 F.3d 34, 37 (2d Cir. 1995).\n\nIn Western Alliance, 686 N.E.2d at 999, a case involving a diner's inhalation of carbon monoxide fumes produced by ovens at a restaurant, the Supreme Judicial Court of Massachusetts also recognized the significance of the use in the pollution exclusion clause of terminology of environmental law:\n\nIn addition to inclusion of the terms \"discharge,\" \"dispersal,\" \"release,\" and \"escape,\" the exclusion's definition of \"pollutants\" endeavors to particularize the more general words \"irritant or contaminant\" by reference to \"smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste.\" Each of the latter words brings to mind products or byproducts of industrial production that may cause environmental pollution or contamination. While [the insurer] may have expected the provision to sweep broadly, and in clause (1)(a) to apply to premises used as a residence or a business, the exclusion has to be interpreted and applied in a commonsense manner with due attention to the circumstances of the accident giving rise to a coverage claim.\n\nThe exclusion should not reflexively be applied to accidents arising during the course of normal business activities simply because they involve a \"discharge, dispersal, release or escape\" of an \"irritant or contaminant.\"\n\nSimilarly, in Motorists Mut. Ins. Co. v. RSJ, Inc., 926 S.W.2d 679, 681 (Ky. Ct. App. 1996), the court stated that\n\nthe basic premise that terms used in insurance contracts \"should be given their ordinary meaning as persons with the ordinary and usual understanding would construe them.\" City of Louisville v. McDonald, Ky. App., 819 S.W.2d 319, 320 (1991). The drafters' utilization of environmental law terms of art (\"discharge,\" \"dispersal,\" \"seepage,\" \"migration,\" \"release,\" or \"escape\" of pollutants) reflects the exclusion's historical objective - avoidance of liability for environmental catastrophes related to intentional industrial pollution.\n\nSee also Gainsco Ins. Co. v. Amoco Prod. Co., 53 P.3d 1051, 1065 (Wyo. 2002) (exclusion's reference to \"seepage, pollution and contamination\" indicates environmental-type harm) (quoting Enron Oil Trading \u0026 Transp. Co. v. Walbrook Ins. Co., 132 F.3d 526, 530 (9th Cir. 1997)); Atlantic Mut. Ins. Co. v. McFadden, 595 N.E.2d 762, 764 (Mass. 1992) (pollution exclusion's terms are terms of art in environmental law).\n\n\"[U]nless it is obvious that the terms used in an insurance contract are intended to be used in a technical connotation, we must construe them consistently with the meaning which common speech comports.\" Corriea, 719 A.2d at 1239 (citation and internal quotation marks omitted); see also Chase, 780 A.2d at 1127. Ambiguities are not to be created by judicial fiat. Nationwide insists that the terms of the exclusion are clear, and denies that the particular words on which Ms. Richardson relies are terms of art. According to Nationwide, Ms. Richardson's argument \"begs the question,\" and Nationwide inquires: \"[W]hat words could possibly be used to describe the underlying event that would be more plain or less susceptible to the charge that they are 'terms of art' than the words of the exclusion?\" This rhetorical question, however, is Nationwide's only direct answer to the analysis in West American, Nautilus and other decisions recognizing these words as terms of art. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn our view, the similarity between the language of the pollution exclusion and the terminology of environmental statutes, regulations, and judicial decisions is sufficiently striking to render a coincidence improbable. \"Coincidences happen, but an alternative explanation not predicated on happenstance is often the one that has the ring of truth.\" Bahura v. S.E.W. Investors, 754 A.2d 928, 943 (D.C. 2000) (citations omitted). Thus, even assuming, arguendo, that the word \"fumes\" as used in the exclusion today appears on the surface to be unambiguous, a review of the entire clause and of its history and context suggests that the perceived clarity is superficial, Peoples Drug Stores, 470 A.2d at 754; that especially at the time of its adoption, the exclusion did not clearly mean what Nationwide now says it means; and that its language could rationally be read as referring to the kinds of very substantial cleanup costs that insurers were confronting as a result of the enactment of statutes directed at environmental contamination. In our view, the frequent references to \"waste\" and to \"cleanups,\" the enumeration as irritants or contaminants of byproducts of industrial production, and the use of so many environmental terms, together create at least an ambiguity as to the intended meaning of the words used in the pollution exclusion clause. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nD. The need for a limiting principle.\n\nA substantial number of courts, as we have seen, have found the exclusion to be ambiguous by reason of the use therein of industrial and environmental terminology. But this has not been the sole basis on which ambiguity has been discerned; many courts have stated that without some limiting principle, the pollution exclusion clause is ambiguous because, if its language is read \"literally\" in the manner here favored by Nationwide, it leads to results that can fairly be characterized as unreasonable. Our dissenting colleague argues ingeniously, albeit without citation of any authority dealing with the pollution exclusion, that the position taken by the courts in these cases is unpersuasive. In challenging the need for an external limiting principle, Judge Glickman presents some interesting arguments not made by Nationwide or by the courts that support Nationwide's position. See post at pages 73-76. Nevertheless, the recognition by several federal appellate courts, and by the highest courts of New York and other states, of the necessity for such a limiting principle (with no contrary authority on the precise point at issue) makes these decisions worthy of consideration.\n\nIn Pipefitters Welfare Educ. Fund v. Westchester Fire Ins. Co., 976 F.2d 1037, 1043 (7th Cir. 1992), the court stated:\n\nThe terms \"irritant\" and \"contaminant,\" when viewed in isolation, are virtually boundless, for \"there is virtually no substance or chemical in existence that would not irritate or damage some person or property.\" Westchester Fire Ins. Co. v. City of Pittsburg[h], 768 F. Supp. 1463, 1470 (D. Kan. 1991). Without some limiting principle, the pollution exclusion clause would extend far beyond its intended scope, and lead to some absurd results. To take but two simple examples, reading the clause broadly would bar coverage for bodily injuries suffered by one who slips and falls on the spilled contents of a bottle of Drano, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and for bodily injury caused by an allergic reaction to chlorine in a public pool. Although Drano and chlorine are both irritants or contaminants that cause, under certain conditions, bodily injury or property damage, one would not ordinarily characterize these events as pollution.\n\n(Emphasis added.); see also, e.g., Meridian Mut., 197 F.3d at 1182; Nautilus, 188 F.3d at 30; Doerr, 774 So. 2d at 124; and Donaldson v. Urban Land Interests, Inc., 564 N.W.2d 728, 732 (Wis. 1997), all quoting Pipefitters. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e In Am. States Ins. Co. v. Kiger, 662 N.E.2d at 945, 948 (Ind. 1996), the Supreme Court of Indiana made essentially the same point:\n\nClearly, [the pollution exclusion] clause cannot be read literally as it would negate virtually all coverage. For example, if a visitor slips on a grease spill then, since grease is a \"chemical,\" there would be no insurance coverage. Accordingly, this clause requires interpretation.\n\nSee also Freidline v. Shelby Ins. Co., 774 N.E.2d 37, 39-40 (Ind. 2002) (following Kiger). Similarly, in Donaldson, 564 N.W.2d at 732, the Supreme Court of Wisconsin stated that \"[t]he reach of the pollution exclusion clause must be circumscribed by reasonableness lest the contractual promise of coverage be reduced to a dead letter.\"\n\nIn Pipefitters, the court went on to observe that, in order to avoid unreasonable results, many courts have taken \"a common sense\" approach to the construction of the pollution exclusion and have held that the exclusion does not apply to \"injuries resulting from everyday activities gone slightly, but not surprisingly, awry.\" 976 F.2d at 1043-44. The leakage and inhalation of carbon monoxide from a faulty heating unit in an apartment complex, as in the present case, may fairly be characterized as an everyday activity gone slightly awry, and significantly, the three state Supreme Courts that have decided the issue have all held that the absolute pollution exclusion does not bar coverage in such a case. Andersen, 757 N.E.2d at 332-34 (facts essentially identical to those here); Western Alliance, 686 N.E.2d at 998-1001 (carbon monoxide leak in restaurant); Koloms, 687 N.E.2d at 79-82 (same in commercial building). See also Donaldson, 564 N.W.2d at 732 (pollution exclusion does not apply to carbon dioxide fumes exhaled in poorly ventilated building); Freidline, 774 N.E.2d at 39-40 (absolute pollution exclusion does not defeat coverage where toxic fumes from carpet glue allegedly caused injury to occupants of office building). As the court stated in Reg'l Bank of Colo., 35 F.3d at 498,\n\n[w]hile a reasonable person of ordinary intelligence might well understand carbon monoxide is a pollutant when it is emitted in an industrial or environmental setting, an ordinary policyholder [or any other reasonable person] would not reasonably characterize carbon monoxide emitted from a residential heater which malfunctioned as \"pollution.\" \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e It seems far more reasonable that a policyholder [or other reasonable person] would understand the exclusion as being limited to irritants and contaminants commonly thought of as pollution and not as applying to every possible irritant or contaminant imaginable.\n\n(Bracketed language added.)\n\nThe essential teaching of Pipefitters - namely, that the exclusion cannot reasonably be applied to every situation which the words could conceivably reach - significantly undermines the claim that the exclusion is plain and unambiguous. To determine the true meaning of the exclusion, the court must consider the context in which the clause was written and the purpose that it was designed to accomplish. The history of the successive pollution exclusion clauses, summarized in Part II of this opinion, thus becomes not only relevant but, in our view, all but determinative. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nE. The purpose of the exclusion.\n\nThe principal purpose of the absolute pollution exclusion, as we have seen, is not in substantial doubt. The predominant reason for drafting this exclusion for pollution-related injuries was to avoid the enormous expense and exposure resulting from the explosion of environmental litigation. Koloms, 687 N.E.2d at 81; Doerr, 774 So. 2d at 127. \"[T]he purpose of the current [absolute] exclusion, like [that of] its predecessor, is to exclude governmental clean up costs from the scope of coverage.\" Koloms, 687 N.E.2d at 81 (quoting West American, 409 S.E.2d at 699) (internal quotation marks and brackets omitted); accord, Kerr-McGee Corp. v. Georgia Cas. \u0026 Sur. Co., 568 S.E.2d 484, 488 (Ga. Ct. App. 2002) (purpose was \"to bar coverage responsibility for government-mandated cleanup under the Superfund for gradual environmental damages of any type\") (numerous citations omitted).\n\nIn Kent Farms, a man was severely injured while delivering fuel to the insured when a faulty valve in the fuel tank's intake valve caused a major leak. In holding that the absolute pollution exclusion did not apply to this accident, the Supreme Court of Washington succinctly synopsized the relevant history as follows:\n\nThe qualified pollution exclusion clause, a precursor to the clause at issue here, came into existence so insurers could avoid the \"yawning extent of potential liability arising from the gradual or repeated discharge of hazardous substances into the environment.\" Waste Management of Carolinas, Inc. v. Peerless Ins. Co., 315 N.C. 688, 698, 340 S.E.2d 374 (1986). Later, various forms of absolute pollution exclusion clauses, including the clause here, were incorporated into insurance policies in the wake of expanded environmental liability under the Comprehensive Environmental Response, Compensation, and Liability Act of 1980, 42 U.S.C. [§§] 9601-9675 (1995) (CERCLA). See Queen City Farms, Inc. v. Central Nat'l Ins. Co., 827 P.2d 1024 (Wash. Ct. App. 1992) (surveying the history of the clause). These clauses were clearly intended to exculpate insurance companies from liability for massive environmental cleanups required by CERCLA and similar legislation. See generally Jeffrey W. Stempel, Reason and Pollution: Correctly Construing the \"Absolute\" Exclusion in Context and in Accord with its Purpose and Party Expectations, 34 Tort \u0026 Ins. L.J 1, 5 (1998). The insurance companies' objective in creating both clauses was to avoid liability for environmental pollution. To read the absolute exclusion clause more broadly ignores the general coverage provisions.\n\nThis exclusion clause does not deal with the discharge of substances that may also be pollutants directly onto (and into) an individual; rather, this clause specifically addresses those situations in which injury was caused by environmental damage. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e We, therefore, hold the absolute pollution exclusion clause relates to environmental damage, and not to the facts of this case.\n\n998 P.2d at 295 (emphasis added). The court went on to add:\n\nThe exclusion, when viewed in the context of its purpose, does not apply merely because a potential pollutant was involved in the causal chain. Instead, the exclusion applies to \"occurrences\" involving the pollutant as a pollutant. Our approach is consonant with the understanding of the average purchaser of insurance and consistent with the provisions of the insurance policy as a whole; that is, the pollution exclusion clause was designed to exclude coverage for traditional environmental harms. We will not expand the scope of the exclusion clause beyond its intended purpose.\n\nId. at 296 (emphasis in original).\n\nWe agree with the foregoing analysis. In light of the timing of the introduction of the absolute pollution exclusion and the problem which it was designed to address, the reasoning of the courts in Koloms, Andersen, Western Alliance, Doerr, West American, and Kent Farms is persuasive. Moreover, as the court noted in Doerr, 774 So. 2d at 127, there is no historical evidence suggesting that the exclusion was designed to achieve any other purpose; indeed, rather than disputing the history that we have summarized in this opinion, Nationwide and its supporting amicus, relying on rigorous \"plain language\" analysis, ask us not to consider history or context at all. We therefore follow Andersen, 757 N.E.2d at 333, and the other authorities we have cited, in holding that the purpose of the absolute pollution exclusion was to bar coverage for environmental degradation and for cleanups mandated by CERCLA and similar legislation.\n\nF. Other considerations.\n\nOur conclusion is bolstered by several other considerations. First, the Commissioner of the District's Department of Insurance and Securities Regulation, in his very helpful amicus brief, has effectively urged us to reject the approach of those courts which view the exclusion as unambiguously precluding coverage on facts such as those here presented. After exploring the limits of an uncritical literalism, the Commissioner stated:\n\nThe pollution exclusion properly prevents extraordinary risks from being distributed among ordinary policy holders. It properly requires those businesses that employ such hazardous instrumentalities to obtain insurance particular to the character of the risk. It is not, however, properly applied to exclude from coverage the type[s] of risks that are ordinary and common to most if not all policyholders. To do so through a literal, contextless reading of the exclusion has on the one hand the possibility to render the insurance contract illusory, while at the same time opening the door to equally dangerous and unreal readings that fail to exclude from coverage those risks that ought not to be spread among all policy holders. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\n\"Because of the Commissioner's role in the regulation of [the District's] Insurance law, his opinion regarding matters within his province is persuasive.\" Doerr, 774 So. 2d at 134. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nSecond, the pollution exclusion must, as we have noted, be read in conjunction with REO's entire CGL policy. An injury caused by a faulty furnace is the very kind of risk for which a CGL policy would be expected to provide protection. It is the result of an \"everyday activity gone slightly, but not surprisingly, awry.\" Pipefitters, 976 F.2d at 1044. Almost any mishap at an apartment complex could be caused by contact with some \"contaminant\" or \"irritant.\" In Nautilus, the court held that the insurer's construction of the exclusion, which parallelled the construction urged here by Nationwide, \"would render the Nautilus policy virtually meaningless to [the insured].\" 188 F.3d at 30. If the present case is different at all from Nautilus in this respect, this is so only as a matter of degree; a broad interpretation of the absolute pollution exclusion - the kind of construction against which the court warned in Pipefitters - would obviously curtail REO's coverage to a substantial degree. It is undisputed that the accident would have been covered by the policy prior to the introduction of the absolute pollution exclusion, see, e.g., Doerr, 774 So.2d at 133-34, and it is difficult to believe that such a major reduction in coverage would have been effected without any evident announcement describing the character of the change and without any adjustment of the insured's premiums. Cf. Dimmitt Chevrolet, Inc. v. Southeastern Fid. Ins. Co., 636 So. 2d 700, 703 (Fla. 1994) (noting claim that approval by state regulators of pollution exclusion, without a corresponding reduction in premiums, indicated that, as some insurance representatives asserted at the time, \"the clause did little more than clarify coverage\"). \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nFinally, there is at least some indication that, during the 1980s, when approval was being sought for the absolute pollution exclusion, representatives of the insurance industry sang a tune markedly different from the position now being taken by Nationwide and other insurers:\n\nFor example, during testimony at a 1985 hearing conducted by the Texas State Board of Insurance, Ward Harrel, a representative of Liberty Mutual Insurance Company, indicated that the pollution exclusion could be read literally to exclude coverage in situations where \"no one would read it that way,\" noting that \"our insureds would be at the State Board . . . quicker than a New York minute if, in fact, everytime [sic] a bottle of Clorox fell off a shelf at a grocery store and [sic] we denied the claim because it's a pollution loss.\"\n\nNat'l Union Fire Ins. Co. v. CBI Indus., Inc., 907 S.W.2d 517, 519-20 n.3 (Tex. 1995) (per curiam) (emphasis added), quoted in Doerr, 774 So. 2d at 134 n.16. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e In addition, there has been \"distinct criticism of the [absolute pollution exclusion] clause, or at least of the insurance industry's interpretation of it and activities in litigating it, on the grounds that . . . [, inter alia,] the insurance industry gained state regulatory approval for the clause by interpreting it much less strictly before it was approved.\" 9 COUCH, 127:14 at 127-37. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e If the absolute pollution exclusion had been represented, at the time of its introduction, as meaning what Nationwide now says it means, we question whether it would have been approved by regulators in the District and in other jurisdictions without, at least, a clearer exposition of the effect of the exclusion, and without an appropriate adjustment of the premiums to be paid by the insured to match the substantial reduction in coverage.\n\nIV. RESPONSE TO DISSENT\n\nOur dissenting colleague disagrees, sometimes quite emphatically, with our major conclusions and with the reasoning that has led us to reach them. Our decision, according to Judge Glickman, is \"methodologically flawed\" and \"turns the settled interpretive rule on its head and embraces its diametrical opposite.\" The majority, he writes, has \"disregard[ed] or misappl[ied] settled legal principles,\" has \"engaged in dubious appellate fact finding on a deficient record,\" and has \"thwart[ed] the purpose and overrid[den] the clear meaning of the [pollution exclusion] clause.\" As noted at pages 14-16, Judge Glickman is not alone in his view of the merits, and we acknowledge that this case presents difficult issues with respect to which reasonable persons can differ and regarding which distinguished courts have differed.\n\nIn our discussion of these issues we have previously addressed a number of Judge Glickman's contentions. We now undertake to respond specifically to those of our dissenting colleague's principal arguments with which we have not dealt fully in the preceding discussion.\n\nA. Plain language, context and history.\n\nJudge Glickman's main disagreement with the majority is rooted in his insistence that the pollution exclusion is unambiguous, that resort to historical context is unnecessary and improper, and, essentially, that if correct legal principles are applied, Nationwide wins in a cakewalk. But as we have explained at pages 17-22, the language of the clause must be examined as a whole, and in terms of what it would reasonably have meant to the insurance industry and to regulators when the exclusion was revised almost two decades ago. When all of the words of the exclusion are considered from that perspective, with due weight accorded to the historical circumstances that gave them birth, their purported clarity evaporates. To focus on the definitional words of the clause without reference either to the import of the clause as a whole or to the mischief that the exclusion was designed to redress would, indeed, \"make a fortress out of the dictionary,\" Cabell, 148 F.2d at 739, and mask the true intent of those who wrote and approved the exclusion.\n\nB. Indoor pollution.\n\nJudge Glickman reads the logic of our opinion to suggest that the \"absolute pollution exclusion\" can have no application to \"indoor\" pollution. We do not take this position. A simple illustration will suffice: If, for example, an insured produces carbon monoxide fumes during the manufacturing process, and if these fumes are then inhaled by persons on the premises, then the exclusion may well preclude liability on the part of the insurer for any injury suffered by those persons. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e That situation differs markedly, however, from the present case, in which the insured is not an industrial polluter but, rather, the manager of an apartment house, and in which the plaintiff allegedly inhaled fumes which entered her unit directly from a heating device in the furnace room. This situation has no conceivable connection with waste dumps or government-mandated cleanup costs or with any of the other problems that led to the adoption of the absolute pollution exclusion. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Assuming that indoor industrial or similar pollution falls within the exclusion, we find it revealing that the courts in, inter alia, Andersen, Western Alliance, and Koloms have sensibly declined to apply the exclusion to the kind of situation presented here. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nIn a passage that is not especially understated, Judge Glickman says, page 64, post, that in its discussion of hypothetical indoor pollution at a manufacturing plant, the majority has been forced into a \"remarkable about-face,\" that the majority has \"implicitly repudiat[ed] virtually all the cases and premises on which it relies,\" and that \"[w]ith this concession, the majority's position collapses.\" To catalogue all that we see as inaccurate in our colleague's argument is not easy, but we note the following:\n\n1. An \"about face,\" like beauty or its lack, is in the eye of the beholder, but so far as we are aware, there has been no change of direction of any kind in the majority opinion. Judge Glickman assuredly has not identified one, nor has he pointed to any contradiction between any statements in the majority opinion.\n\n2. The majority has not repudiated the cases on which it relies. None of these cases involved the escape of carbon monoxide or other fumes on industrial premises during the manufacturing process, and neither the judges in the majority nor our dissenting colleague can divine, without the use of a crystal ball, how the courts on whose decisions we have relied would decide a purely hypothetical case not before them. Indeed, the question - perhaps not an easy one - whether the absolute pollution exclusion would apply in such circumstances, is not before us either, for the facts of the present case are, from the perspective of the purposes of the exclusion, altogether different from the hypothetical circumstances under discussion.\n\n3. Surely, the reports of the demise or \"collapse\" of the majority's position are, to say the least, more than a little exaggerated.\n\nAt bottom, Judge Glickman's argument is that if the escape of carbon monoxide fumes is within the exclusion anywhere, it is within the exclusion everywhere. This means, according to our colleague, that what happened to Ms. Richardson as a result of a malfunctioning apartment house furnace was, for purposes of the exclusion, identical to the pollution of an indoor industrial site as a result of the release of pollutants in the manufacturing process. Further, Judge Glickman suggests, the words of the exclusion are so unambiguous that if the second of these situations is \"pollution,\" then the first must be too. This, according to our colleague, should be evident to any reasonable person. Judge Glickman takes this position notwithstanding the text of the entire exclusion clause, its repeated focus on waste, detoxification and the like, and the essentially undisputed purpose for which the clause was adopted. In our view, numerous authorities cited in this opinion, including, inter alia, Western Alliance, 686 N.E.2d at 999, Reg'l Bank of Colo., 35 F.3d at 498, and the Brief for the Commissioner, quoted at page 39, reject this approach as contextless and unreasonable, and we cannot agree that anything in the majority opinion has caused these authorities to \"collapse.\"\n\nC. The elimination of \"into or upon land, the atmosphere, or any water course or body of water.\"\n\nAccording to Judge Glickman, post at 88, \"[t]he deliberate removal of the phrase 'into or upon land, the atmosphere or any water course or body of water' signifies that the exclusion now does apply to indoor air pollution,\" because, as revised, \"the exclusion does not use language descriptive of the natural environment only.\" (Citations omitted.) As previously noted at pages 43-46, we do not assert that the exclusion can have no application to indoor pollution. But our dissenting colleague's position goes beyond any hypothetical indoor/outdoor distinction; he argues that the elimination of \"upon land, the atmosphere, or any water course or body of water\" cannot be reconciled with the proposition that the exclusion is restricted to environmental cleanups or to similar environmental degradation. His point is a serious one, and it makes this case more difficult than it would otherwise be.\n\nBut the Supreme Court of Illinois has confronted and rejected a similar contention in Koloms, 687 N.E.2d at 81-82, and we quote from that opinion at some length:\n\nASI [the insurer] submits that the deletion of the requirement that the pollution be \"[discharged] into or upon land, the atmosphere, or any watercourse or body of water\" should be viewed by this court as a clear signal of the industry's intent to broaden the exclusion beyond traditional environmental contamination. We disagree. This same argument was rejected in West American Insurance Co. v. Tufco Flooring East, Inc., [supra,] 409 S.E.2d 692, a case which involved the application of the pollution exclusion to damages caused by the release of fumes from a flooring sealant. In Tufco, the court noted that, even after its amendment in 1986, the absolute pollution exclusion continued to employ terms of art which bespeak of environmental contamination. The court reasoned:\n\n\"Because the operative policy terms 'discharge,' 'dispersal,' 'release,' and 'escape' are environmental terms of art, the omission of the language 'into or upon land, the atmosphere or any watercourse or body of water' in the new pollution exclusion is insignificant. The omission of the phrase only removes a redundancy in the language of the exclusion that was present in the earlier pollution exclusion clause. Consequently, we find that any 'discharge, dispersal, release, or escape' of a pollutant must be into the environment in order to trigger the pollution exclusion clause and deny coverage to the insured.\" Tufco, 409 S.E.2d at 700.\n\nSee also Center for Creative Studies, 871 F. Supp [941,] 946 [(E.D. Mich. 1994)] (\"the fact that the [former version] contained language relating to discharge 'into or upon land, the atmosphere . . .' is not significant\"). We agree with this analysis. In our view, the deletion of the aforementioned language does not portend an expansion of the pollution exclusion beyond the context of traditional environmental contamination.\n\nThe court's treatment of this issue in Koloms is significant because, in a case decided under the prior language of the exclusion, the same court had held that \"the atmosphere\" meant \"the external atmosphere which surrounds the earth\" rather than \"the multiple, diverse internal environs or surroundings of individual buildings.\" United States Fid. \u0026 Guar. Co. v. Wilkins Insulation Co., 578 N.E.2d 926, 933 (Ill. 1991). In Koloms, however, the court recognized that notwithstanding the removal from the exclusion of the words \"into or upon land, the atmosphere or any watercourse or body of water,\" the exclusion still refers to \"traditional environmental contamination,\" and we think that this is true whether that contamination manifests itself indoors or outdoors.\n\nJudge Glickman faults the reasoning of Koloms because, he says, post at 88 note 25, the revised version of the exclusion no longer contained the one phrase in the clause connoting that the exclusion applied only to external pollution. As we see it, however, the entire phrasing of the exclusion, beginning with the enumeration of eight pollutants collectively reminiscent of byproducts of industrial pollution, and including the extensive use of environmental terms, mirrors the very problem which the exclusion was designed to resolve - insurer liability for major government-mandated environmental cleanups. Conditions calling for such a cleanup may exist within a factory as well as at a waste dump, and the removal of the quoted language from the prior exclusion arguably confirms that the absolute exclusion would apply at an indoor industrial site. This is, however, a long way indeed from a faulty furnace in an apartment house. Moreover, if the deletion of the phrase had effected such a major reduction in coverage, this would surely have been publicly announced with some specificity, and would also have been reflected in the premiums which an insured would be required to pay. See the discussion at pages 39-40 \u0026 note 35. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nD. The application of CERCLA.\n\nJudge Glickman argues, pages 69-70, post, that \"federal environmental law in fact does address non-industrial air pollution.\" Therefore, according to our colleague, even if the absolute pollution exclusion was adopted in response to the enactment of CERCLA and other environmental legislation, Nationwide still prevails.\n\nIn support of this contention, Judge Glickman cites B.F. Goodrich Co. v. Murtha, 958 F.2d 1192, 1199-1200 (2d Cir. 1992), and United States v. Alcan Aluminum Corp., 990 F.2d 711, 725 (2d Cir. 1993). The first of these decisions addressed the question whether CERCLA provides an exemption for municipalities; the second involved the potential liability of Cornell University resulting from the university's disposition of coal waste water and related hazardous waste problems. These decisions do not bear the slightest resemblance to the situation before us. Indeed, in the B.F. Goodrich case, which concerned \"municipal solid waste,\" the court stated: \"In CERCLA[,] Congress enacted a broad remedial statute designed to enhance the authority of the EPA to respond effectively and promptly to toxic pollutant spills that threatened the environment and human health.\" 958 F.2d at 1197 (emphasis added). \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nThat is all a far cry indeed from REO's defective furnace. When the insurance industry, concerned about billions of dollars in liability for retroactive clean-up costs, see discussion at pages 11-12, presented the absolute pollution exclusion to state regulators, it may well have been concerned about a university's coal waste problems or a municipality's solid waste, but there is no indication that a defective furnace in an apartment building appeared within or near the industry's horizon. The B.F. Goodrich and Alcan cases therefore provide scant solace to our dissenting colleague's thesis.\n\nE. Purported vagueness.\n\nFinally, Judge Glickman argues that we should adopt Nationwide's \"plain meaning\" construction of the exclusion because, he says, the majority's interpretation of the clause is too vague. He cites Doerr, 774 So. 2d at 134-36, in which the court indicated that a number of different factors should be considered in the determination whether an insured is a \"polluter.\" This approach, according to our dissenting colleague, denies the exclusion its requisite clarity. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nBut it is the court's duty to determine whether or not the situation before it - here Ms. Richardson's inhalation of carbon monoxide fumes from an apartment house furnace -falls within the absolute pollution exclusion in REO's policy. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e We must make that determination on the basis of the language of the exclusion and the circumstances surrounding its adoption. Merriam, 107 U.S. at 441. If we conclude, as we believe that we must, that the case before us falls outside the exclusion because it does not involve the kind of situation for which the exclusion was designed, we are not free to hold otherwise because of the possibility that other, different cases may be more difficult to decide. In other words, it would be impermissible for the court to deny coverage to which an insured is entitled on the merits in order to avoid potential complexities in hypothetical future litigation. We note, in any event, that our dissenting colleague has also recognized a limiting principle to the language of the exclusion - it must be given its \"ordinary meaning in common parlance,\" see pages 59 and 60, post - and that the clarity and certainty of result which he claims for his approach, if adopted, might very well in the end also prove somewhat ephemeral.\n\nV. CONCLUSION\n\nFor the foregoing reasons, we answer the certified question in the negative.\n\nSo ordered.\n\nGLICKMAN, Associate Judge, dissenting:\n\nThe question in this appeal is whether the so-called \"absolute pollution exclusion\" precludes insurance coverage for injuries caused by indoor air pollution attributable to carbon monoxide from a building furnace. My colleagues in the majority conclude that the exclusion is limited to large-scale industrial pollution of the natural environment of the kind targeted by federal environmental laws. My colleagues therefore conclude that the exclusion does not apply to indoor air pollution that is not caused by an \"industrial\" polluter and that does not require \"an environmental cleanup.\" Ante at 46 \u0026 n.39. As I hope to show, these conclusions are untenable, for they are contradicted by the language, the drafting history and the purpose of the exclusion - all of which, I fear, the majority misreads and misunderstands. The absolute pollution exclusion was drafted deliberately to cover injuries arising from all kinds of environmental degradation by pollutants, including the degradation of the air in non-industrial indoor environments. There is no warrant for imposing an artificial limitation on the types of pollution or polluter to which the exclusion applies.\n\nWhat troubles me most about the majority opinion is not its mistaken conclusion, however, but the way the majority arrives at that conclusion. The language of the absolute pollution exclusion unambiguously denies coverage for injuries caused by indoor air pollution. The majority finds ambiguity in spite of the clarity of the language only by violating settled rules of insurance contract construction, resorting selectively to extrinsic historical \"evidence,\" and invoking subjective intuitions about \"reasonable\" coverage expectations. This approach is both methodologically flawed and inconsistent with past decisions of this court.\n\nIn Part I of the discussion that follows, I describe Ms. Richardson's claim and set out the pertinent provisions of the absolute pollution exclusion. Then, in Part II, I analyze the coverage question before us. I begin the analysis, as I believe we must, with the language of the exclusion. Reading the exclusion in accordance with settled rules of construction compels the conclusion that the exclusion unambiguously precludes insurance coverage for all indoor air pollution claims -whether or not those claims allege what the majority would call \"traditional environmental contamination.\" Ante at 48. Next, I address the majority's twin rationales for ignoring the plain language of the exclusion in favor of a judicial rewriting, namely that (1) the exclusion employs \"terms of art\" that should be given a specialized meaning rather than their plain meaning, and (2) the exclusion is in need of a \"limiting principle\" to avoid absurd consequences. Neither rationale, I argue, is valid. Finally, I examine the majority's reliance on the history of the absolute pollution exclusion and its own notions of reasonableness to support its narrowing interpretation of the exclusion. I argue that the majority's use of extrinsic evidence and its implicit resurrection of the reasonable expectations doctrine to override unambiguous contract language are improper.\n\nI.\n\nA. Ms. Richardson's Allegations of Indoor Air Pollution\n\nAccording to Antoinette Richardson's complaint, she suffered injuries as a result of indoor air pollution at the apartment building where she worked as a security guard. Between February 23 and March 9, 1995, Ms. Richardson alleged, \"there were complaints about the smell of gas within the apartment complex, and specifically apartment No. 204,\" the location of the security office. \"The cause of the smell was traced to a furnace located in the furnace room of this apartment complex which emitted fumes into the apartment,\" allegedly in violation of \"environmental\" regulations and other laws. The \"fumes emanating from [the] leaking gas furnace\" included \"hazardous levels of carbon monoxide\" which poisoned Ms. Richardson and caused her permanent brain damage.\n\nAlthough the majority treats Ms. Richardson's claim as though it does not involve pollution at all, it does. \"[P]ollution has been defined as '[c]ontamination of air . . . by the discharge of harmful substances.'\" Certain Underwriters at Lloyd's London v. C.A. Turner Constr. Co., Inc., 112 F.3d 184, 188 (5th Cir. 1997) (holding that release of toxic gas inside a tent constituted pollution within meaning of pollution exclusion) (dictionary citation omitted). Carbon monoxide is subject to extensive regulation as a known air pollutant, for example in the Clean Air Act, see, e.g., 42 U.S.C. §§ 7407, 7476 (a), 7512 (2000), and the National Primary Ambient Air Quality Standards for Carbon Monoxide, 40 C.F.R. § 50.8 (2002). As a substance whose \"inhalation . . . may reasonably be anticipated to cause death . . . [or] physiological malfunctions,\" carbon monoxide is also a \"pollutant or contaminant\" as defined by CERCLA. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e See 42 U.S.C. § 9601 (33) (2000). \"[T]he most commonly-known danger of carbon monoxide [arises from] breathing it in an enclosed space.\" Matcon Diamond, Inc. v. Penn Nat'l Ins. Co., 815 A.2d 1109, 1113 (Pa. Super. Ct. 2003). Indoor air pollution is a matter of widespread concern, which Congress recognized in 1986 when it passed the Radon Gas and Indoor Air Quality Research Act to \"gather data and information on all aspects of indoor air quality in order to contribute to the understanding of health problems associated with the existence of air pollutants in the indoor environment.\" Pub. L. 99-499, § 403 (a)(1), 100 Stat. 1758, 1759, reprinted in 42 U.S.C. § 7401 (2000). See also 24 C.F.R. § 982.401 (h)(2)(i) (establishing indoor air quality standards for government housing, including the requirement that \"[t]he dwelling unit must be free from dangerous levels of air pollution from carbon monoxide . . . and other harmful pollutants\"). One of the most celebrated indoor air pollution cases was decided by this very court. In Bahura v. S.E.W. Investors, 754 A.2d 928 (D.C. 2000), employees of the Environmental Protection Agency sued the owners and managers of buildings housing the EPA's national headquarters, claiming that the employees suffered neurological damage from \"their inhalation at the workplace of allegedly contaminated indoor air\" between 1986 and 1989. Bahura, 754 A.2d at 931. The plaintiffs' \"sick building syndrome\" injuries apparently were caused by inadequate ventilation of toxic chemicals used during building renovations. Id. at 932. We commented that \"[t]he evidence of serious environmental difficulties at the EPA's own headquarters was widely publicized and came to the attention of Congress.\" Id.\n\nIn this case the District Court found that \"the carbon monoxide fumes acted as a pollutant by allegedly migrating through the gas line and out of two separate furnaces to injure people.\" Nationwide Mut. Ins. Co. v. National REO Mgmt., Inc., 205 F.R.D. 1, 11 (D.D.C. 2000). The court was unquestionably correct in recognizing this as indoor air pollution.\n\nB. The Absolute Pollution Exclusion in the Standard Commercial General Liability Policy\n\nThe commercial general liability policy issued by Nationwide Mutual Insurance Company to the property manager of the apartment building where Ms. Richardson worked states in pertinent part that the insurance does not apply to:\n\nF. Pollution\n\n(1) \"Bodily injury\" or \"property damage\" arising out of the actual, alleged or threatened discharge, dispersal, seepage, migration, release or escape of pollutants:\n\n(a) At or from any premises, site or location which is or was at any time owned or occupied by, or rented or loaned to, any insured;\n\nSubparagraph[] (a) . . . do[es] not apply to \"bodily injury\" or \"property damage\" arising out of heat, smoke or fumes from a hostile fire.\n\nAs used in this exclusion, a hostile fire means one which becomes uncontrollable or breaks out from where it was intended to be.\n\nPollutants means any solid, liquid, gaseous or thermal irritant or contaminant, including smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste. Waste includes materials to be recycled, reconditioned or reclaimed.\n\nThis language is part of what is known as the absolute pollution exclusion.\n\nII.\n\nA. Applying the Accepted Rules for Construing Contracts of\n\nInsurance, the Absolute Pollution Exclusion Unambiguously Bars Coverage of Ms. Richardson's Indoor Air Pollution Claim\n\nUnlike the majority, I begin my analysis of the coverage question in this case by examining the terms of the absolute pollution exclusion; for \"[a]n insurance policy is a contract between the insured and the insurer, and in construing it we must first look to the language of the contract.\" Cameron v. USAA Prop. \u0026 Casualty Ins. Co., 733 A.2d 965, 968 (D.C. 1999) (emphasis added). \"The first step in the construction of [insurance] contracts is to determine what a reasonable person in the position of the parties would have thought the disputed language meant.\" Id. at 970 (emphasis added; citation and internal quotation marks omitted). \"The words used, even in their literal sense, are the primary and ordinarily the most reliable source of interpreting the meaning of any writing.\"\n\nJ. Parreco \u0026 Son v. District of Columbia Rental Hous. Comm'n, 567 A.2d 43, 46 (D.C. 1989) (quoting Cabell v. Markham, 148 F.2d 737, 739 (2d Cir. 1945) (Learned Hand, J.)) (emphasis added).\n\nThe words of a contract are \"not ambiguous where the court can determine [their] meaning without any other guide than a knowledge of the simple facts on which, from the nature of language in general, [their] meaning depends.\" Holland v. Hannan, 456 A.2d 807, 815 (D.C. 1983) (quoting Burbridge v. Howard Univ., 305 A.2d 245, 247 (D.C. 1973)). \"A court will not torture words to import ambiguity where the ordinary meaning leaves no room for ambiguity.\" Redmond v. State Farm Ins. Co., 728 A.2d 1202, 1206 (D.C. 1999) (citation and internal quotation marks omitted). We do not \"indulge in forced constructions.\" Cameron, 733 A.2d at 968. We take the words of a contract as we find them.\n\nThese principles are followed strictly when the contract is one of insurance. \"Unless it is obvious that the terms used in an insurance contract are intended to be used in a technical connotation, we must construe them consistently with the meaning which common speech [i]mports.\" Cameron, 733 A.2d at 968; see Pennsylvania Indem. Fire Corp. v. Aldridge, 73 U.S. App. D.C. 161, 162, 117 F.2d 774, 775 (1941); accord, In re Estate of Corriea, 719 A.2d 1234, 1242 (D.C. 1998) (\"The INAPRO policy does not define 'dishonest . . . purpose or intent,' and so we look to the meaning of the terms which common speech imports.\"). This rule applies with special force to exclusions from coverage, because \"it is the insurer's duty to spell out in plainest terms - terms understandable to the man in the street - any exclusionary or delimiting policy provisions.\" Cameron, 733 A.2d at 968. If the insurer fails to do so, as by defining words meant to have a technical or special meaning, the words in an exclusion \"should be given their common, ordinary, and it has been said their 'popular' meaning\" - for the \"vast majority\" of policyholders are \"not equipped to understand other than plain language.\" Id. at 968, 970 (citations and internal quotation marks omitted).\n\nTo honor this fundamental rule of construction faithfully in the case of the absolute pollution exclusion, we must do two things. Where the terms of the exclusion are defined explicitly in the policy, such as the term \"pollutants,\" we must follow the policy definitions, for it is \"obvious\" that those terms are \"intended to be used in a technical connotation.\" Where the terms are not defined explicitly, such as the terms \"discharge, dispersal, seepage, migration, release or escape,\" we must follow common usage, for it is not \"obvious\" that a technical usage applies to those terms.\n\nIf we follow these interpretive principles, we are compelled to say that the absolute pollution exclusion \"admits of only one construction.\" J. Parreco \u0026 Son, 567 A.2d at 46. The exclusion unambiguously precludes coverage of Ms. Richardson's claim that carbon monoxide fumes from a leaking furnace at the insured's premises infiltrated her office there and injured her.\n\nTo begin with, the carbon monoxide fumes were \"pollutants\" within the meaning of the exclusion because that term is defined specifically to include \"any\" \"gaseous\" \"contaminant,\" specifically including \"fumes.\" See, e.g., Bernhardt v. Hartford Fire Ins. Co., 648 A.2d 1047, 1051 (Md. Ct. Spec. App. 1994) (holding that carbon monoxide that leaked from a defective furnace and central heating system into tenants' apartments \"was a 'gaseous . . . irritant or contaminant' and constituted 'fumes' and 'chemicals' within the clear language of the definition of 'pollutant'\"); see also Assicurazioni Generali, S.p.A. v. Neil, 160 F.3d 997, 1000 (4th Cir. 1998) (holding that carbon monoxide contamination at a hotel \"plainly\" fell within the definition of \"pollutant\"); Longaberger Co. v. United States Fid. \u0026 Guar. Co., 31 F. Supp. 2d 595, 604 (S.D. Ohio 1998), aff'd 201 F.3d 441 (6th Cir. 1999) (holding that the pollution exclusion \"clearly covers the emission of carbon monoxide gas\" from a defective furnace in residence of the insured).\n\nSecond, the leakage of the carbon monoxide from the building furnace into Ms. Richardson's apartment constituted an \"actual discharge, dispersal, seepage, migration, release or escape\" of that pollutant within the meaning of the exclusion because we must give those undefined terms their ordinary meaning in common parlance. See, e.g., Bernhardt, 648 A.2d at 1051 (\"[T]he bodily injury claimed by the tenants 'arose out of the actual . . . discharge, dispersal, . . . or escape' of the carbon monoxide, 'at . . . premises owned . . . by the named insured.'\"). To take the simplest case, a standard dictionary meaning \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e of the noun \"escape\" is \"leakage or outflow esp[ecially] of steam or a liquid [as in] trying to stop an escape of gas from a broken conduit.\" WEBSTER'S THIRD NEW INTERNATIONAL DICTIONARY 774 (1993). The same dictionary adds that a primary meaning of the verb \"escape\" is \"to issue from confinement or an enclosure esp[ecially] by way of a break (as in a waterpipe) [or in] gas escaping from a main.\" Id.\n\nThird, focusing on the heading that introduces the exclusion, the contamination of the air in Ms. Richardson's apartment by carbon monoxide was, in common parlance, \"pollution\" of her indoor environment. Since the policy does not define \"pollution,\" the word fairly may be said to convey to a lay reader that the exclusion is limited to harms arising from environmental degradation and not, for instance, every toxic tort or products liability claim regardless of environmental impact. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e But as I have pointed out above, the concept of environmental pollution encompasses non-industrial contamination of the air within an apartment, office, garage or other building as much as it does \"what is commonly considered industrial environmental pollution.\" Assicurazioni Generali, S.p.A., 160 F.3d at 1000; see also Bernhardt, 648 A.2d at 1051 (\"[W]e are required to state the obvious -nowhere in this exclusion does the word 'industry' or 'industrial' appear. There simply is no such limitation.\"); West Am. Ins. Co. v. Band \u0026 Desenberg, 925 F. Supp. 758, 762 (M.D. Fla. 1996), aff'd 138 F.3d 1428 (11th Cir. 1998) (holding that absolute pollution exclusion bars insurance coverage for \"sick building syndrome\" claim alleging injury caused by release or dispersal of contaminants from attic space of building into the indoor air supply); Essex Ins. Co. v. Tri-Town Corp., 863 F. Supp. 38, 40-41 (D. Mass. 1994) (holding that carbon monoxide emissions from an ice resurfacing machine inside a hockey arena were within the scope of the pollution exclusion). There likewise is no language linking the scope of the exclusion to any particular environmental laws or regulations, none of which is referenced in the policy. The drafters of the exclusion \"encompasse[d] more than traditional conceptions of pollution.\" Certain Underwriters at Lloyd's London, 112 F.3d at 187-88 (quoting American States Ins. Co. v. Nethery, 79 F.3d 473, 477 (5th Cir. 1996)).\n\nThe majority's proposed limitations are not merely absent from the language of the pollution exclusion, they also are contradicted and hence foreclosed by that language. The exclusion states that it applies in the case of \"any premises, site or location\" owned or used by \"any insured.\" Those words negate any attempt to restrict the exclusion to waste sites and other industrial settings, or to industrial polluters. Thus, for example, when the majority states that the exclusion is \"obviously focused on subjects similar to the cleanup of waste sites\" and \"has to do with the byproducts of the manufacturing process,\" ante at 25, the majority is ignoring the express words of the exclusion. Similarly, when the majority distinguishes the present case because \"the insured is not an industrial polluter but, rather, the manager of an apartment house,\" ante at 43, the majority makes a distinction that the language of the exclusion expressly forbids. By its terms, the absolute pollution exclusion applies to pollution at apartment houses (\"any premises\") and to pollution for which apartment house managers (\"any insured\") are responsible.\n\nThe exclusion also states that it applies to the discharge of pollutants \"at\" as well as \"from\" any covered premises. This wording further negates any suggestion that the exclusion does not apply to indoor air pollution. \"If the exclusion spoke only of discharges from a . . . site, it could reasonably be argued that the words in question were . . . applicable only to those instances in which a pollutant traveled beyond the . . . site and into the atmosphere, water, or ground. The plain language of the exclusion belies such limited applicability, however; by its very terms the exclusion encompasses discharges that do not leave the . . . site.\" Madison Constr. Co. v. Harleysville Mut. Ins. Co., 735 A.2d 100, 109 (Pa. 1999). In a case arising out of an escape of carbon monoxide from malfunctioning equipment, the Third Circuit made the similar point that the pollution exclusion \"does not use the words 'into the atmosphere' or in any way indicate that 'environmental catastrophes' are the conditions that trigger a bar of coverage under the exclusion.\" Reliance Ins. Co. v. Moessner, 121 F.3d 895, 902 (3d Cir. 1997). \"In the absence of this language,\" the court continued, \"we will not construe the provision to create an ambiguity that does not exist.\" Id. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThe \"hostile fire\" exception to the absolute pollution exclusion also signifies that the exclusion applies to purely indoor pollution of the kind at issue in this case. The hostile fire exception provides that the pollution exclusion does not apply to bodily injury or property damage arising out of \"heat, smoke or fumes from a hostile fire,\" i.e., a fire that \"becomes uncontrollable or breaks out from where it was intended to be.\" The exception ensures that the pollution exclusion does not gut insurance coverage for outbreaks of fire on the premises by excluding coverage for smoke and fume inhalation, smoke damage and similar claims, whether such harms occur on or off the premises. See, e.g., Associated Wholesale Grocers v. Americold Corp., 934 P.2d 65, 77 (Kan. 1997). The hostile fire exception \"clearly applies to accidents that occur within a building and that do not result from what is commonly considered industrial environmental pollution.\" Assicurazioni Generali, S.p.A., 160 F.3d at 1000; accord, William P. Shelley \u0026 Richard C. Mason, Application of the Absolute Pollution Exclusion to Toxic Tort Claims: Will Courts Choose Policy Construction or Deconstruction?, 33 TORT \u0026 INS. L. J. 749, 755 n.31 (1998) (\"The 'hostile fire' exception . . . [constitutes] an implicit recognition that the Absolute [Pollution] Exclusion (to which the exception pertains) applies indoors as well.\") The hostile fire exception would be unnecessary if the pollution exclusion were limited as the majority contends to industrial environmental pollution (so-called \"traditional\" pollution), because ordinary fires and the smoke and fumes they generate do not fall within that category. It is particularly noteworthy that the hostile fire exception belies the majority's attempt to construe the term \"fumes\" in the pollution exclusion to mean only fumes generated from industrial pollution, ante at 24-25; for the exception itself uses the term \"fumes\" in a way that is inconsistent with the majority's reading.\n\nThe further implication of the hostile fire exception is that the exclusion applies with full force to injuries caused by fumes emanating from a non-hostile fire. That is the case here - Ms. Richardson has not alleged, and there is nothing to suggest, that the fire in the furnace became uncontrollable or broke out from where it was intended to be. See Bernhardt, 648 A.2d at 1049.\n\nThe arguments that the absolute pollution exclusion applies to injuries caused by indoor air pollution are sufficiently compelling that, in the end, they force the majority into a remarkable about-face. Implicitly repudiating virtually all the cases and premises on which it relies, the majority concedes that the absolute pollution exclusion \"may well\" bar coverage of indoor air pollution claims when \"an insured produces carbon monoxide fumes during the manufacturing process\" or when \"sick building syndrome\" is present. Ante at 43 \u0026 44 n.39. With this concession, the majority's position collapses. If the exclusion applies to claims of personal injury from indoor air pollution, then the exclusion does not bar coverage only (as the majority elsewhere in its opinion would have it) for the kinds of environmental degradation and cleanup costs on which CERCLA and similar legislation focused. And if the exclusion applies to indoor air pollution claims, it must apply to them regardless of the identity of the polluter or the source of the pollution. This conclusion is inescapable, because the exclusion by its terms applies to pollution, not polluters. The exclusion does not distinguish - it cannot fairly be read to distinguish - between carbon monoxide poisoning inside an apartment complex and the same carbon monoxide poisoning inside an industrial complex; nor between carbon monoxide poisoning caused by a defective furnace and the same carbon monoxide poisoning caused by a defective industrial process. If the claim of carbon monoxide inhalation injury is the same in each case, the absolute pollution exclusion treats it the same. Coverage for Ms. Richardson's claim does not turn on the fact that she was a security guard at an apartment building rather than a manufacturing plant.\n\nB. The Majority's Reliance on Supposed \"Terms of Art\" and a \"Need for a Limiting Principle\" to Find Ambiguity in the Absolute Pollution Exclusion is Misguided\n\nThe majority advances two textual reasons, which I now shall address in turn, why \"the perceived clarity\"of the absolute pollution exclusion is \"superficial.\" Ante at 31. First the majority contends that the use of \"terminology of environmental law,\" or \"terms of art,\" makes the exclusion ambiguous. Ante at 24-31. Second, the majority claims that the \"unreasonable results\" of a plain language reading require an adventitious \"limiting principle.\" Ante at 31-35. In each instance, the majority's analysis is flawed; neither reason justifies its conclusion that the exclusion is ambiguous as applied to Ms. Richardson's claim.\n\n1. \"Environmental Terms of Art\"\n\nIn its effort to show that the absolute pollution exclusion is ambiguous, the majority argues that \"the exclusion is replete with language used in environmental statutes and regulations of the kind that generated the absolute exclusion's adoption.\" Ante at 25. According to the majority, the definition of \"pollutants\" uses words that \"collectively bring to mind byproducts of industrial pollution,\" and the exclusion employs \" terminology of environmental law\" and other environmental \"terms of art\". Ante at 24, 28 \u0026 29. The majority concludes that the environmental terms \"together create at least an ambiguity as to the intended meaning of the words used in the pollution exclusion clause.\" Ante at 31.\n\nI recognize that some other courts have accepted this \"terms of art\" argument (while other courts have rejected it). Compare Nautilus Ins. Co. v. Jabar, 188 F.3d 27, 30 (1st Cir. 1999) (accepting \"terms of art\" argument) with Nat'l Elec. Mfrs. Ass'n v. Gulf Underwriters Ass'n, 162 F.3d 821, 825 (4th Cir. 1998) (rejecting \"terms of art\" argument). But there are several things wrong with the argument. To begin with, it impermissibly ignores the longstanding rule governing the construction of insurance contracts in this jurisdiction. As stated earlier, \"[u]nless it is obvious that the terms used in an insurance contract are intended to be used in a technical connotation, we must construe them consistently with the meaning which common speech [i]mports.\" Cameron, 733 A.2d at 968. The majority concedes that it is far from \"obvious\" that the terms in the pollution exclusion have a \"technical connotation.\" See, e.g., ante at 31 (\"[A]ssuming, arguendo, that the word 'fumes' as used in the exclusion today appears on the surface to be unambiguous, a review of the entire clause and of its history and context suggests that the perceived clarity is superficial. . . .\"). The typical commercial general liability policyholder has no inkling of the \"history and context\" of the pollution exclusion, the arcana of environmental law, or the terminology of that esoteric field. Since the policy does not reference environmental law in any way, the typical policyholder cannot be expected to construe the pollution exclusion with reference to that body of law rather than in its ordinary sense. See Shalimar Contractors, Inc. v. American States Ins. Co., 975 F. Supp. 1450, 1457 (M.D. Ala. 1997), aff'd 158 F.3d 588 (11th Cir. 1998) (holding that since pollution exclusion \"should be given the meaning that a person of ordinary intelligence would reasonably think the language had,\" its terms \"cannot be defined by resort to the highly technical and specific definitions under environmental laws, such as those contained in the Code of Federal Regulations\"). Nonetheless, the majority turns the settled interpretive rule on its head and embraces its diametrical opposite by actually preferring a technical connotation of the policy terms drawn from environmental law to the meaning which common speech imports.\n\nThe majority appears to be mistaken also in its major factual premise, at least judging by the evidence it adduces. The majority supposes that the key terms of the absolute pollution exclusion are drawn from or \"reflect\" the terminology of federal environmental laws such as the Water Pollution Control Act, \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e CERCLA, \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e RCRA, \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e and their implementing regulations. See ante at 26-27. That supposition is not accurate. When it was developed in the late 1960's and first published in 1970, \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e the first incarnation of the pollution exclusion already denied coverage for harms caused by the \"discharge, dispersal, release or escape of smoke, vapors, fumes, acids, alkalis, toxic chemicals, liquids or gases, waste materials or other irritants, contaminants or pollutants.\" (I have italicized the terms which the majority suspects derived from the federal laws). Congress did not enact CERCLA until 1980, however, see Pub. L. 96-510, 94 Stat. 2767 (1980), and RCRA did not come into being until 1976. See Pub. L. 94-580, 90 Stat. 2795 (1976). The insurance industry assuredly did not draft the pollution exclusion in (or before) 1970 with an eye to either of those laws.\n\nIt is true that the Water Pollution Control Act, which preceded the pollution exclusion of 1970, addressed the \"discharge\" of polluting matter into interstate waters. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e But this Act did not contain the other key terms of the exclusion - \"dispersal,\" \"release,\" \"escape,\" \"irritant,\" \"contaminant.\" The pollution exclusion therefore did not draw those terms from that Act or any of the laws that the majority cites. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nSince the key terms of the absolute pollution exclusion were not taken from the laws that the majority cites, the meaning of those terms cannot be circumscribed by those laws. But to make that point is to touch on another peculiarity of the majority's argument that should not go unremarked. Although the majority thinks that the absolute pollution exclusion should be interpreted in light of federal environmental laws, the majority makes no effort whatsoever to ascertain whether those laws are limited to industrial pollution or in fact might apply to non-industrial indoor air pollution. This omission undermines the credibility of the majority's position - especially since federal environmental law in fact does address non-industrial indoor air pollution, as I have noted already in Section I.A of this dissent. This is not an idle point. Without belaboring it, and simply to illustrate, the requirements of CERCLA are by no means applicable only to industrial pollution. The definition of a \"hazardous substance\" in CERCLA, see 42 U.S.C. § 9601 (14), \"makes no distinction dependent upon whether the substance's source was industrial, commercial, municipal or household. Whether the substance is a consumer product, a manufacturing byproduct, or an element of a waste stream is irrelevant.\"\n\nB.F. Goodrich Co. v. Murtha, 958 F.2d 1192, 1200 (2nd Cir. 1992). Similarly, potentially responsible parties under CERCLA may include individuals, municipalities, universities, and other entities besides industrial polluters. Id.; see also United States v. Alcan Aluminum Corp., 990 F.2d 711, 725 (2nd Cir. 1993) (holding that Cornell University may be liable under CERCLA). Moreover, \"[q]uantity or concentration [of the hazardous substance] is not a factor either.\" B.F. Goodrich, 958 F.2d at 1200. \"[E]ven minimal amounts of pollution\" are within CERCLA's purview. Alcan Aluminum, 990 F.2d at 720.\n\nThe majority is also mistaken when it asserts as a fact that the words \"smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste\" - the non-exclusive examples included in the definition of \"pollutants\" used in the absolute pollution exclusion - \"collectively bring to mind byproducts of industrial pollution.\" Ante at 24. The majority's wish is the father of that thought. It is equally true that the words in question may \"bring to mind\" byproducts of agricultural pollution, municipal pollution, vehicular pollution, and virtually any other form of pollution - easily including pollution from improperly maintained furnaces or other causes (notably including poor waste disposal practices) in apartment, office, or other buildings of every description.\n\nIt is not a \"coincidence,\" ante at 30, that the words used in the pollution exclusion are words commonly used elsewhere in connection with pollution, including in environmental legislation. As the heading of the exclusion states, its subject is pollution, so naturally its drafters employed words that are associated with that subject such as \"release,\" \"escape,\" \"dispersal,\" and \"contaminant.\" But these words are not \"terms of art\" connoting only a specific type of pollution. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e See National Elec. Mfrs. Ass'n v. Gulf Underwriters Ins. Co., 162 F.3d 821, 825 (4th Cir. 1998) (noting that the pollution exclusion \"contains neither technical terms nor terms of art\"). The terminology of the absolute pollution exclusion is as appropriate for discussing non-industrial indoor air pollution as it is for discussing industrial pollution or whatever else the majority may consider \"traditional\" environmental pollution. The drafters of the absolute pollution exclusion could have used words of limitation to exempt non-industrial indoor air pollution from its purview, but they did not do so. The implication is that they did not include the corresponding limitations either.\n\nWhen the words of the absolute pollution exclusion are given their plain meaning, the exclusion is broad but it is not ambiguous. It applies unambiguously to all forms of environmental pollution, whether in or out of doors, on or off the insured's premises, industrial or non-industrial, large-scale or small-scale, traditional or novel. Ironically, it is the majority that renders the exclusion ambiguous when it rejects its plain meaning in favor of a specialized meaning that is supposedly (if not actually) drawn from the complex body of the nation's environmental laws and regulations. It is not helpful to be told that the pollution exclusion refers only to \"traditional\" polluters, ante at 48, or that the exclusion does not apply to \"everyday activities gone slightly, but not surprisingly, awry.\" Ante at 34. With respect, formulations such as these are so vague as to be meaningless. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e The interpretive burden they will impose on policyholders, insurance companies, claimants and courts is staggering.\n\nConsider Doerr v. Mobil Oil Corp., 774 So.2d 119 (La. 2000), one of the leading cases that the majority expressly chooses to follow. See ante at 38. Doerr arose out of the discharge of hydrocarbons from a refinery into the Mississippi River and thence into the St. Bernard Parish water system. The Parish's insurer invoked the absolute pollution exclusion in its policy to disclaim coverage of claims filed by thousands of persons who drank or otherwise used the water. On a plain language reading of the exclusion, I dare say everyone would agree that it applied to injuries arising from the \"discharge\" of hydrocarbons (\"chemicals\" and \"contaminants,\" and hence \"pollutants\") into the river and their ensuing \"dispersal\" or \"migration\" into the Parish water system. The Supreme Court of Louisiana rejected a plain language reading, however. See Doerr, 774 So.2d at 135. Like the majority here, the Louisiana court construed the exclusion to apply only to pollution of the sort targeted by CERCLA and other environmental laws. That construction, the court held, necessitates an extensive factual inquiry to ascertain whether the exclusion bars coverage in any given case, including the seemingly straightforward case before it.\n\nTo begin with, the court said, \"the determination of whether an insured is a 'polluter,' is a fact-based conclusion that should encompass consideration of a wide variety of factors,\" including, \"the nature of the insured's business, whether that type of business presents a risk of pollution, whether the insured has a separate policy covering the disputed claim, whether the insured should have known from a read of the exclusion that a separate policy covering pollution damages would be necessary for the insured's business, who the insurer typically insures, any other claims made under the policy, and any other factor the trier of fact deems relevant to this conclusion.\" Id. \"Second,\" the court said, \"the determination of whether the injury-causing substance is a 'pollutant' is also a fact-based conclusion that should encompass a wide variety of factors.\" Id. Among the factors the court enumerated were \"the nature of the injury-causing substance, its typical usage, the quantity of the discharge, . . . whether the substance is one that would be viewed as a pollutant as the term is generally understood, and any other factor the trier of fact deems relevant to that conclusion.\" Id. \"Finally,\" the court concluded, \"the determination of whether there was 'discharge, dispersal, seepage, migration, release or escape' is likewise a fact-based conclusion that must result after a consideration of all relevant circumstances . . . [including] whether the pollutant was intentionally or negligently discharged, the amount of the injury-causing substance discharged, whether the actions of the alleged polluter were active or passive, and any other factor the trier of fact deems relevant.\" Id. at 135-36.\n\nDoerr's elaboration of the consequences of the majority's \"terms of art\" construction of the absolute pollution exclusion graphically demonstrates how that construction fails to clarify the exclusion and instead renders it ambiguous and unwieldy. One can only guess at the amount of unnecessary litigation the majority's interpretation will engender. Having repeatedly told insurers that exclusions must be \"spell[ed] out in plainest terms . . . understandable to the man in the street,\" Cameron, 733 A.2d at 968, this court should reject a construction that so thoroughly contradicts that goal. \"[C]courts are enjoined not to create ambiguity where none exists.\" Washington Props. v. Chin, Inc., 760 A.2d 546, 548 (D.C. 2000).\n\n2. The Need for a \"Limiting Principle\"\n\nAside from the supposed \"use therein of industrial and environmental terminology,\" the absolute pollution exclusion is ambiguous, the majority argues, \"because, if its language is read 'literally' in the manner here favored by Nationwide, it leads to results that can fairly be characterized as unreasonable.\" Ante at 31, 32. According to the majority:\n\nTo take but two simple examples, reading the clause broadly would bar coverage for bodily injuries suffered by one who slips and falls on spilled contents of a bottle of Drano, and for bodily injury caused by an allergic reaction to chlorine in a public pool. Although Drano and chlorine are both irritants or contaminants that cause, under certain conditions, bodily injury or property damage, one would not ordinarily characterize these events as pollution.\n\nPipefitters Welfare Educ. Fund v. Westchester Fire Ins. Co., 976 F.2d 1037, 1043 (7th Cir. 1992), quoted ante at 32-33. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nTo avoid such absurd results, the majority contends, we need a \"limiting principle\" that is not in the plain text of the pollution exclusion itself - what the majority calls \"an external limiting principle.\" Ante at 32. The correct external limiting principle, the majority concludes, is that the exclusion applies only to \"traditional\" industrial pollution. A few other courts (though not the Pipefitters court itself \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e have reasoned similarly, as the majority notes.\n\nReductio ad absurdum arguments frequently are untrustworthy, and this one should be examined with care. Cf. J. Parreco \u0026 Son, 567 A.2d at 46 (warning against judicial overeagerness to invoke the \"absurd result\" doctrine as a guide to construction). The question before the court is only whether the absolute pollution exclusion is ambiguous in its application to the facts of this case, not whether the exclusion would be ambiguous in its potential application to other facts. Accord, Pipefitters, 976 F.2d at 1044. \"The fact . . . that terms of a policy of insurance may be construed as ambiguous where applied to one set of facts does not make them ambiguous as to other facts which come directly within the purview of such terms.\" COUCH ON INSURANCE 3D § 21:14, at 21-26 (citations omitted). It might be absurd to apply the pollution exclusion to a slip on spilled Drano or an allergic reaction to chlorine in a swimming pool, but that is not the inquiry before us. It is not absurd to apply the exclusion to indoor air pollution. Since the exclusion unambiguously does apply to such air pollution if its plain terms are given their ordinary English meaning, that is the end of the matter.\n\nI do not rest with that point, however, because the majority's reductio ad absurdum argument fails on its own terms. The argument works only if (1) the pollution exclusion, when read literally, does apply to such events as slips on spilled Drano and allergic reactions to swimming pool chlorine; and (2) the limiting principle offered by the majority to avoid such application is a permissible and reasonable one. Neither of those requirements is met here.\n\nRead literally, the pollution exclusion applies to pollution. That is what its heading says. By saying so, the exclusion gives the ordinary reader to understand in no uncertain terms that it does not apply to events that do not involve pollution - even if those events do happen to involve interactions with substances that are capable of acting as contaminants or irritants. But as the Seventh Circuit itself said in discussing the hypothetical slip on spilled Drano and the allergic reaction to chlorine in a swimming pool, \"one would not ordinarily characterize these events as pollution.\" Pipefitters, 976 F.2d at 1043. Indeed one would not, and so one who reads the absolute pollution exclusion \"literally\" would not read it to apply to such events. To put it another way, by incorporating an explicit restriction to occurrences that involve pollution, the plain text of the exclusion contains the \"limiting principle\" that the majority thinks is needed. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nSince the text of the exclusion contains the necessary limiting principle, there is no justification for going outside the text to look for one. But the alternative limiting principle that the majority and some other courts adopt is unacceptable for additional reasons. To be acceptable, a proposed limiting principle at least must be consistent with the text of the exclusion and clear enough in its meaning to furnish real interpretive guidance. A limitation to industrial or \"traditional\" environmental pollution meets neither of these minimal conditions. As I have explained above, such a limitation is contrary to the text of the exclusion and is too vague to be useful. The majority's limiting principle is thus neither permissible nor reasonable.\n\nC. The Majority's Use of Extrinsic Evidence to Construe the Absolute Pollution Exclusion Is Improper, Incomplete, and Inaccurate\n\nFor all its importance, the issue of whether the language of the absolute pollution exclusion is genuinely ambiguous is not the majority's primary focus. Rather, the majority starts out from the premise that the exclusion \"cannot be construed in the abstract, i.e., without an understanding of the business and regulatory context in which the policy of which it is a part was written.\" Ante at 6. Accordingly, the majority undertakes to examine \"how the clause here at issue came into being.\" Ante at 6. The majority finds that the original pollution exclusion was revised in order to protect insurance companies from \"a potentially vast and unforeseen liability for major environmental disasters\" \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e and \"the staggering retroactive pollution clean-up costs imposed by\" CERCLA. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Given those purposes, the majority draws the conclusion that the exclusion was never intended to apply to a claim like Ms. Richardson's, or, indeed, \"to anyone other than an active polluter of the environment\" \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e (to quote yet another inscrutable formulation of which the majority approves). In light of these determinations, the majority deems the absolute pollution exclusion ambiguous and construes it to apply only to \"traditional\" industrial pollution of the environment.\n\nI have three main objections to the majority's exposition of the history and purposes of the absolute pollution exclusion. First, I think the majority misapplies the principle that permits limited consideration of extrinsic evidence of the circumstances surrounding the making of contract to ascertain \"what a reasonable person in the position of the parties would have thought the words meant.\" 1010 Potomac Assocs. v. Grocery Mfrs. of Am., Inc., 485 A.2d 199, 206 (D.C. 1984). The majority's approach, which is modeled on what courts in some (by no means all) other jurisdictions have done, is the antithesis of what this court has held is required in cases of this type. Second, this court is not in a position in the present case to examine and draw meaningful conclusions from the circumstances attending the development of the absolute pollution exclusion, for we have no detailed factual record before us to go on. Third, considered properly, the extrinsic evidence that is available to us indicates that the absolute pollution exclusion was drafted so as to preclude insurance coverage for claims arising out of indoor air pollution, and the regulatory history shows that the insurance industry did not mislead state regulators into thinking otherwise.\n\n1. Extrinsic Evidence is Relevant Only to Determine the Objective Meaning of the Language Used in the Pollution Exclusion\n\nThis court often has insisted that an unambiguous insurance contract \"speaks for itself and binds the parties without the necessity of extrinsic evidence.\" Cameron, 733 A.2d at 968 (quoting Corriea, 719 A.2d at 1239). \"If a policy [of insurance] is plain and unambiguous, the court will construe it without reference to any acts or conduct of the parties thereto which evince their interpretation of such contract.\" Bolle v. Hume, 619 A.2d 1192, 1197 (D.C. 1993) (citation and internal quotation marks omitted). These principles accord with generally accepted rules of contract interpretation. \"Extrinsic evidence of the parties' subjective intent may be resorted to only if the document is ambiguous.\" 1010 Potomac Assocs., 485 A.2d at 205. \"If the document is facially unambiguous, its language should be relied upon as providing the best objective manifestation of the parties' intent.\" Id. \"[I]intent is properly an objective, not subjective, issue.\" Dodek v. CF 16 Corp., 537 A.2d 1086, 1093 (D.C. 1988).\n\nOn its face the absolute pollution exclusion unambiguously applies to Ms. Richardson's indoor air pollution claim. There is nothing absurd or contrary to law or public policy about such an application, which numerous courts in other jurisdictions have endorsed. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e The foregoing principles of contract interpretation therefore counsel against consideration of extrinsic evidence of the subjective intent behind the exclusion.\n\nIt is true that in construing a contract, \"the court looks to 'what a reasonable person in the position of the parties would have thought the disputed language meant.'\" Christacos v. Blackie's House of Beef, Inc., 583 A.2d 191, 194 (D.C. 1990) (quoting 1010 Potomac Assocs., 485 A.2d at 205). To support its investigation of the history of the pollution exclusion, the majority relies on the corollary principle that \"extrinsic evidence may be considered to determine the circumstances surrounding the making of the contract so that it may be ascertained what a reasonable person in the position of the parties would have thought the words meant.\" 1010 Potomac Assocs., 485 A.2d at 205-06 (citations omitted); accord, Christacos, 583 A.2d at 194; see also Intercounty Constr. Corp. v. District of Columbia, 443 A.2d 29, 32 (D.C. 1982). The principle is sound, but I think the majority misapplies it in this case.\n\nIn the first place, this is a principle that is rarely applicable in the case of insurance contracts such as the one now before us, because the terms of those contracts are not negotiated between the insurer and the policyholders who purchase them. Whatever special meanings the words of the policy may be thought to have within the milieu of the insurance industry are unlikely to be known to policyholders from outside that milieu when they purchase the policy. That is one of the reasons why we presume that the words of an insurance policy are given the meaning they have in ordinary discourse rather than any technical meaning known only to the insurer. We would not invoke the \"surrounding circumstances\" principle to override this presumption if doing so led to an interpretation that disfavored the policyholder. The same should hold true regardless of whose ox is gored. As this court has long insisted, in construing insurance policies, \"[t]he clear meaning will be adopted whether favorable to the insured or not.\" Medical Serv. of the District of Columbia v. Llewellyn, 208 A.2d 734, 736 (D.C. 1965).\n\nSecondly, the test of what a reasonable person in the position of the parties would have thought the contract language means remains an objective one. The surrounding circumstances are relevant only to determine how a reasonable person who knows all that the parties knew would read the language of the contract. In most cases, including the present one, evidence of surrounding circumstances will be relevant only when the words used in the contract had a meaning in the particular commercial context, trade milieu, or the like that differs from their meaning in common usage. Evidence of such a differing meaning may show that the words are ambiguous or may override the ordinary meaning of the words. But this is a principle of limited applicability. It authorizes a court to use extrinsic evidence of how the words used in a contract were understood, objectively, in the context in which the contract was made. It does not authorize using extrinsic evidence of the parties' subjective intentions or purposes to override the objective meaning of those words in that context.\n\nA case that may serve to illustrate and clarify this somewhat subtle point is Carey Canada, Inc. v. Columbia Cas. Co., 291 U.S. App. D.C. 284, 940 F.2d 1548 (1991). \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e At issue in that case was whether an \"asbestosis\" exclusion in insurance policies excluded all asbestos-related disease claims from coverage. The district court found that \"asbestosis\" is a medical term that unambiguously refers to \"a single, specific disease caused by the inhalation of asbestos fibers.\" Id., 291 U.S. App. D.C. at 291, 940 F.2d at 1555 (citation omitted). This implied that the asbestosis exclusion did not bar coverage for other asbestos-related diseases. Countering this finding, however, the district court found from extrinsic evidence of the parties' negotiations that they intended to use the term \"asbestosis\" generically to exclude coverage for all asbestos-related diseases. Id. On appeal the D.C. Circuit held that basic contract interpretation principles did not permit this approach, because such extrinsic evidence is admissible \"only where the contract language is in fact ambiguous.\" Id., 291 U.S. App. D.C. at 293, 940 F.2d at 1557. Rejecting the insurance companies' contention that the court could find the term \"asbestosis\" ambiguous from evidence of the parties' negotiations or course of dealing, the court explained that \"objective evidence - a showing that anyone who understood the context of the contract would know it could not mean what an unskilled reader would suppose it to mean - is required.\" Id. (citations omitted). Such objective evidence of an ambiguity, the court said, would have to be found in the customs and usages of the insurance industry or the public record at the time the parties entered into their contract. \"To hold otherwise,\" the court added, \"without objective evidence of ambiguity, could defeat the intent of the parties to abide by the terms of the contract and to indemnify the insureds for asbestos-related claims other than those for the specific disease asbestosis, allowing one party to create ambiguity where none exists.\" Id., 291 U.S. App. D.C. at 294, 940 F.2d at 1558. Accordingly, the court remanded the case to the district court for that court to determine whether there was any evidence \"to establish that 'asbestosis' was objectively susceptible to more than one fixed usage and hence was ambiguous in the insurance industry at the time of the making of the contracts.\" Id. at n.4.\n\nThe majority in this case does not present extrinsic evidence that the words of the absolute pollution exclusion had a different objective meaning in the insurance industry (or other relevant context) when the exclusion was adopted from their meaning in common usage today. So far as appears, those words had the same meaning there and then as they do here and now. The majority uses extrinsic evidence differently, to show what kinds of pollution claims led the insurance industry to revise the old exclusion and propose the new \"absolute\" one. At best this is simply evidence of the insurance companies' subjective purposes and intentions. The \"ambiguity\" that the majority then discovers is simply that the exclusion is broader than necessary to preclude coverage for the gargantuan pollution claims that motivated the insurance industry to adopt the exclusion. As a matter of logic, this does not show an ambiguity; it is not even surprising, for given their experience with judicial interpretations of the earlier, qualified pollution exclusion, see infra, insurers had powerful reasons to be over inclusive rather than under inclusive in their draftsmanship. Contract provisions are often drafted broadly in order to achieve simplicity of application and avoid disputes over close cases, and so that they address novel and unforeseen situations in addition to the specific circumstances that gave rise to them. The majority's assumption that the meaning of the absolute pollution exclusion is limited by the specific historical circumstances that gave rise to it thus embodies a logical fallacy. But the more fundamental point is that the principle that extrinsic evidence is relevant to show the circumstances under which a contract was made does not justify the majority's use of that evidence to show subjective intent on the insurance companies' part.\n\nOf special concern is the majority's broad suggestion that \"[s]tatements made by representatives of the insurance industry to obtain approval of proposed policy language can . . . be quite significant\" in construing the language. Ante at 8. In line with this premise, the majority supports its narrow construction of the absolute pollution exclusion by insinuating that the industry misled insurance regulators about the true scope of the exclusion. See ante at 40-41 (asserting that there is \"at least some indication\" that insurers \"sang a tune markedly different from\" their present position, and \"question[ing] whether [the exclusion] would have been approved by regulators in the District and in other jurisdictions without, at least, a clearer exposition of the effect of the exclusion\"). Without saying so explicitly, the majority is invoking the controversial \"regulatory estoppel\" doctrine that was introduced in Morton Int'l, Inc. v. Gen. Accident Ins. Co. of Am., 629 A.2d 831 (N.J. 1993). In Morton, the New Jersey Supreme Court refused to construe the \"sudden and accidental\" language in the qualified pollution exclusion of 1973 (not the present absolute exclusion) in accordance with its plain meaning because the court found that insurers had induced regulators to approve the exclusion by misrepresenting its import. Id. at 876.\n\nThis court has never approved the regulatory estoppel doctrine. Although the majority fails to mention it, \"the overwhelming majority of state and federal courts . . . to have considered the issue have unequivocally rejected Morton and the regulatory estoppel argument, primarily on the basis that extrinsic evidence is not permitted to vary the terms of a clear and unambiguous pollution exclusion provision.\" Employers Ins. of Wausau v. Duplan Corp., No. 94 Civ. 3143 (CSH), 1999 U.S. Dist. LEXIS 15368, at *48-49 (S.D.N.Y. September 30, 1999) (citations omitted). That, of course, is the general rule that this jurisdiction follows. Nonetheless, for myself, I am not so sure that I would reject the Morton approach in its entirety. It makes considerable sense to me that insurance policies should be construed consistently with any regulatory conditions under which they were approved for issuance. But I would reserve decision on whether to adopt some form of the regulatory estoppel doctrine as an exception to the general rule (and, if so, on the precise articulation of that doctrine in this jurisdiction) until we have a case that actually presents the question. This is not that case, for as I discuss infra, we have no evidence that the insurance industry misrepresented the current absolute pollution exclusion to any regulators in the District of Columbia or elsewhere. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e The statements in\n\nthe majority opinion that appear to endorse the regulatory estoppel doctrine are non-binding dicta.\n\n2. The Majority's Use of Extrinsic Evidence is Inappropriate Given the Absence of an Adequate Factual Record\n\nEven if it were proper in this case to consider extrinsic evidence probative of the intent behind the absolute pollution exclusion, the record before us is deficient in such evidence. It does not contain, for example, sworn testimony or affidavits by the drafters or other parties involved in the development and approval of the exclusion. The record likewise is virtually devoid of potentially relevant documentary evidence, such as drafts and other internal ISO documents that might shed light on the intended scope of the exclusion, authoritative explanatory memoranda issued contemporaneously with the exception, or the records of regulatory proceedings in which the exception was approved.\n\nLacking such evidence, the majority relies for the most part on second-hand sources: judicial opinions from other jurisdictions, articles in professional journals, and even the assertions in the briefs submitted by the parties and amici. These selective, interpretive, and often highly opinionated sources may agree on the broad outlines of the history of the absolute pollution exclusion, but they disagree on the all-important details. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e As jurists we have an obligation to exercise considerable caution in relying on these often untested materials, for we are ill-equipped to evaluate the evidence they cite or whether they provide a complete and accurate historical picture. The following section may be taken to illustrate my point.\n\n3. The Limited Evidence We Do Have Shows That the Drafters of the Absolute Pollution Exclusion Meant It to Reach Indoor Pollution Claims\n\nSetting aside my qualms about the admissibility and the adequacy of the extrinsic evidence that has been made available for our consideration, I think that the majority misinterprets that evidence when it concludes that the absolute pollution exclusion was intended to address only industrial or \"traditional\" environmental pollution. The drafting history of the exclusion rebuts that interpretation, and there is no evidence that District of Columbia or state regulators were led to believe otherwise.\n\nThe original pollution exclusion, in widespread use between about 1973 and 1985, stated that:\n\nThis insurance does not apply . . . (f) to bodily injury or property damage arising out of the discharge, dispersal, release or escape of smoke, vapors, soot, fumes, acids, alkalis, toxic chemicals, liquids or gases, waste materials or other irritants, contaminants or pollutants into or upon land, the atmosphere or any water course or body of water; but this exclusion does not apply if such discharge, dispersal, release or escape is sudden and accidental.\n\nBallard \u0026 Manus, supra note 8, at 613 (citing ISO Form GL 00 02, Ed. 01-73). The Insurance Services Office (ISO) introduced the absolute pollution exclusion to replace the original exclusion in 1985. The ISO explained that the breadth of the new exclusion was intentional:\n\nGiven that recent court interpretations of the \"sudden and accidental\" pollution exclusion have found a great degree of coverage that was never intended nor contemplated in the rates, the drafters of the new pollution exclusion consciously used broad terms to ensure that coverage intent would be upheld. The new exclusion is designed to exclude all pollution damages except those arising out of products, completed operations and certain other off-premises emissions. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nKimber Petroleum Corp. v. Travelers Indem. Co., 689 A.2d 747, 753 (N.J. Super. Ct. App. Div.), cert. denied, 695 A.2d 669 (N.J. 1997) (quoting attachment to February 6, 1986 letter from the ISO to insurance company members of its General Liability Committee). In another publication, the ISO emphasized that the new pollution exclusion \"is intended to be all inclusive and, therefore, does not contain any specific exceptions, per se, such as the 'sudden and accidental' exception in the former exclusion which all but totally emasculated the intent of the exclusion.\" Id. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\n\nImportantly for present purposes, the drafters of the absolute pollution exclusion did not eliminate only the \"sudden and accidental\" language of its predecessor. In seeking to be \"all inclusive,\" the drafters also replaced the qualifying phrase \"into or upon land, the atmosphere or any water course or body of water,\" with broader language such as \"at or from any premises, site or location which is or was at any time owned or occupied by, or rented or loaned to, any insured.\" Numerous courts have held that the former phrase limited the original exclusion to pollution of the external natural environment as opposed to pollution of the interior of a building. The New York Court of Appeals, for example, held that \"the three places for discharge contemplated by the policy exclusion - into or upon land, the atmosphere, or any water course or body of water - read together support the conclusion that the clause was meant to deal with broadly dispersed environmental pollution\" and not pollution in a confined or indoor space. Continental Cas. Co. v. Rapid-American Corp., 609 N.E.2d 506, 513 (N.Y. 1993); accord, Essex Ins. Co. v. Avondale Mills, 639 So.2d 1339, 1342 (Ala. 1994); see also C.H. Heist Caribe Corp. v. American Home Assur. Co., 640 F.2d 479, 483 (3d Cir. 1981). Similarly, the Supreme Court of Illinois reasoned that the original pollution exclusion did not apply to indoor air pollution because \"the atmosphere\" meant \"the external atmosphere which surrounds the earth,\" not \"the multiple, diverse internal environs or surroundings of individual buildings.\" United States Fid. \u0026 Guar. Co. v. Wilkin Insulation Co., 578 N.E.2d 926, 933 (Ill. 1991); accord, Board of Regents of the Univ. of Minn. v. Royal Ins. Co. of Am., 517 N.W.2d 888, 892-93 (Minn. 1994); see also National Standard Ins. Co. v. Continental Ins. Co., No. CA-3-81-1015-D, 1983 U.S. Dist. LEXIS 13111, at *22 (N.D. Tex. 1983). The deliberate removal of the phrase \"into or upon land, the atmosphere or any water course or body of water\" signifies that the exclusion now does apply to indoor air pollution. See Board of Regents, 517 N.W.2d at 893 (\"[M]ost importantly, in defining what is being polluted, the exclusion does not use language descriptive of the natural environment only.\"); accord, Moessner, 121 F.3d at 902; Shalimar Contractors, 975 F. Supp. at 1456; Band \u0026 Desenberg, 925 F. Supp. at 762. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\n\nI am aware of no evidence that insurance regulators in the District of Columbia or elsewhere were misled into thinking that the absolute pollution exclusion is inapplicable to indoor air pollution or is otherwise narrower than its plain language states. In Kimber Petroleum, the New Jersey intermediate appellate court reviewed insurance industry pronouncements contemporaneous with the introduction of the exclusion and found to the contrary:\n\nHere, unlike in Morton, the insurance industry candidly acknowledged that the absolute pollution exclusion would totally prohibit coverage for pollution-related damages, allowing only for very narrow exceptions. We find no evidence that the insuranceindustry misled regulators. Rather, they consistently maintained that the absolute pollution exclusion clause excluded all pollution-related damages except for those falling within the completed operations and products hazards coverage if such coverage was purchased by the insured.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\n689 A.2d at 754. The court accordingly rejected the effort to apply the regulatory estoppel doctrine of Morton to the absolute pollution exclusion. The New Jersey Supreme Court denied review. See Kimber Petroleum Corp. v. Travelers Indem. Co., 695 A.2d 669 (N.J. 1997).\n\nIt is particularly noteworthy that the Commissioner of Insurance for the District of Columbia does not contend that the Department of Insurance was misled in any way when it approved the absolute pollution exclusion for use in the District. The Complex Insurance Claims Litigation Association (CICLA), an insurance industry organization participating in this appeal as an amicus, has attached as exhibits to its brief what it represents was the 1985 correspondence from the ISO submitting the exclusion to the District's then-Superintendent of Insurance for approval. CICLA points out that nothing in the correspondence suggested that the exclusion was inapplicable to indoor air pollution claims or was limited to industrial or what the majority calls \"traditional\" environmental pollution. The Commissioner does not dispute this point.\n\nAccording to the Commissioner's brief, the Insurance Department staff that reviewed the proposed absolute pollution exclusion was \"trained and experienced in insurance business practice and procedure.\" This trained and experienced staff was authorized to disapprove the exclusion if its terms were \"inequitable\" or contrary to legal requirements. See D.C. Code § 35-1531 (1981), recodified as amended at D.C. Code § 31-2502.27 (2001). Especially given the close scrutiny then being paid to pollution insurance by the insurance industry and insurance regulatory bodies, it is significant that the staff approved the absolute pollution exclusion without objection or qualification. Evidently the staff did not find the broad language of the exclusion ambiguous or misleading to the common reader. The fact that, in the District of Columbia and elsewhere, expert insurance regulators approved the language of the absolute pollution exclusion without change is a strong reason for this court to accord that language its plain meaning and a strong reason for us not to indulge in our own open-ended exploration of the history and intent of that language. We are not the insurance regulators in this jurisdiction.\n\nI reemphasize my view that we have no cause in this case to examine extrinsic evidence to interpret the insurers' intent behind the absolute pollution exclusion, and that we do not have a proper record on which to do so in any case. But if such examination is to be made, I think a fair reading of the available extrinsic evidence shows that the pollution exclusion was intended to apply to all forms of pollution, including indoor air pollution.\n\nD. Reasonable Expectations of Insureds\n\nBefore concluding this dissent, I think it important to point out one other respect in which the majority opinion deviates from governing precedent. Animating the majority opinion, I think it fair to say, is the view that \"[a]n injury caused by a faulty furnace is the very kind of risk for which a CGL [commercial general liability] policy would be expected to provide protection.\" Ante at 40. Underscoring that point, the majority exaggerates the impact of a straightforward reading of the absolute pollution exclusion - for instance, by mistakenly claiming that \"[a]lmost any mishap at an apartment complex\" could be denied coverage, and by quoting one court's alarmist view that the insurance policy would be rendered \"virtually meaningless\" to the insured. Id. The majority seems to be suggesting that even if the exclusion unambiguously does cover indoor air pollution claims, it should be interpreted not to do so in order to satisfy the reasonable coverage expectations of persons who purchase general liability insurance without reading the exclusion. Indeed, this \"reasonable expectations\" doctrine is the explicit premise of many of the cases on which the majority relies. See, e.g., Regional Bank of Colo. v. St. Paul Fire \u0026 Marine Ins. Co., 35 F.3d 494, 497-98 (10th Cir. 1994) (invoking reasonable expectations doctrine of Colorado law to find insurance coverage for injuries caused by exposure to carbon monoxide from a faulty heater, \"regardless of whether or not\" the pollution exclusion in the policy was ambiguous).\n\nPast cases of this court have squarely rejected this interpretation of \"the doctrine of reasonable expectations.\" See Chase, 780 A.2d at 1131-32; Smalls v. State Farm Mut. Auto. Ins. Co., 678 A.2d 32, 35 (D.C. 1996). As we held in those cases, while ambiguous policy provisions may be construed in a manner \"consistent with the reasonable expectations of the purchaser of the policy,\" unambiguous provisions will be \"enforced . . . as written, so long as they do not violate a statute or public policy.\" Chase, 780 A.2d at 1131-32 (quoting Smalls, 678 A.2d at 35; citation and internal quotation marks omitted). Where \"the . . . exclusion . . . is clear and unambiguous . . . . there is no\n\nlegal basis for considering whether it was consistent with [the policyholder's] reasonable expectations.\" Smalls, 678 A.2d at 35. \"[T]he reasonable expectations doctrine is not a mandate for courts to rewrite insurance policies and reallocate their assignment of risks between insurer and insured.\" Chase, 780 A.2d at 1132.\n\nIII.\n\nI dissent because the majority opinion disregards or misapplies settled legal principles and conflicts with controlling precedent. Instead of construing the absolute pollution exclusion according to the plain meaning of its terms, the majority unjustifiably embraces a technical and forced construction, thereby finding ambiguity where none exists. The majority compounds this error by resorting improperly to extrinsic evidence to qualify unambiguous policy language, by engaging in dubious appellate fact finding on a deficient record, and by misreading the history that we have. Finally, the majority wrongly exalts policyholders' uninformed expectations of insurance coverage over the clear language of an exclusion from that coverage. By doing these things, the majority thwarts the purpose and overrides the meaning of the clause.\n\nI would abide by the governing legal principles that the majority disregards. I would accord paramount importance to the text of the absolute pollution exclusion. I would follow common usage and read the exclusion as it is written. I would not try to reconstruct the history of the exclusion to restrict its meaning or second-guess the insurance regulators who approved the exclusion as it is. I would hold that the absolute pollution exclusion unambiguously precludes insurance coverage for indoor air pollution claims such as the one Ms. Richardson has presented.\n\n\u003cspan class=\"fn\"\u003e1. For reasons of space, we have quoted only the foregoing sentences in the text. The exclusion clause, however, cannot be properly understood unless it is read in its entirety. The clause provides as follows: This insurance does not apply to f. Pollution (1) \"Bodily injury\" or \"property damage\" arising out of the actual, alleged or threatened discharge, dispersal, seepage, migration, release or escape of pollutants: (a) At or from any premises, site or location which is or was at any time owned or occupied by, or rented or loaned to, any insured; (b) At or from any premises, site or location which is or was at any time used by or for any insured or others for the handling, storage, disposal, processing or treatment of waste; (c) Which are or were at any time transported, handled, stored, treated, disposed of, or processed as waste by or for any insured or any person or organization for whom you may be legally responsible; or (d) At or from any premises, site or location on which any insured or any contractors or subcontractors working directly or indirectly on any insured's behalf are performing operations: (i) If the pollutants are brought on or to the premises, site or location in connection with such operations by such insured, contractor or subcontractor; or (ii) If the operations are to test for, monitor, clean up, remove, contain, treat, detoxify or neutralize, or in any way respond to or assess the effects of pollutants. Subparagraphs (a) and (d) (i) do not apply to \"bodily injury\" or \"property damage\" arising out of heat, smoke or fumes from a hostile fire As used in this exclusion, a hostile fire means one which becomes uncontrollable or breaks out from where it was intended to be. (2) Any loss, cost or expense arising out of any: (a) Request, demand or order that any insured or others test for, monitor, clean up, remove, contain, treat, detoxify or neutralize, or in any way respond to or assess the effects of pollutants; or (b) Claim or suit by or on behalf of a governmental authority for damages because of testing for, monitoring, cleaning up, removing, containing, treating, detoxifying or neutralizing, or in any way responding to, or assessing the effects of pollutants. Pollutants means any solid, liquid, gaseous or thermal irritant or contaminant, including smoke, vapor, soot, fumes, acids, alkalis, chemicals and waste. Waste includes materials to be recycled, reconditioned or reclaimed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The somewhat complex procedural history of the case is set forth in Nationwide I, 205 F.R.D. at 3-8, but we address only so much of that history as is relevant to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Andersen v. Highland House Co., 757 N.E.2d 329 (Ohio 2001); Western Alliance Ins. Co. v. Gill, 686 N.E.2d 997 (Mass. 1997); Am. States Ins. Co. v. Koloms, 687 N.E.2d 72 (Ill. 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Part I of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Part III, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Our dissenting colleague chides us, post at 57, for beginning our inquiry by setting out the historical context in which the absolute pollution exclusion came to be included in comprehensive general liability policies. We have quoted the entire clause, and not merely parts of it, in footnote 1 to this opinion. In any event, \"[t]he meaning of words . . . commonly depends on their context . . . . In interpreting the words and conduct of the parties to a contract, a court seeks to put itself in the position they occupied at the time the contract was made.\" RESTATEMENT (SECOND) OF CONTRACTS § 202 cmt. b (1981). The court must therefore determine \"what a reasonable person in the position of the parties would have thought the disputed language meant,\" Christacos v. Blackie's House of Beef, Inc., 583 A.2d 191, 194 (D.C. 1990) (emphasis added) (citation omitted), at the time that the language was written. See also Part III B of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The new clause also omitted the requirement that the discharge be \"into or upon land, the atmosphere or any water course.\" Nationwide II, 384 U.S. App. D.C. at 128, 270 F.3d at 952 (citations omitted). See discussion at pages 46-48, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Given the essentially uncontradicted history leading to the adoption of the absolute pollution exclusion, as described by the highest courts of several states, see, e.g., Western Alliance, 686 N.E.2d at 999; Koloms, 687 N.E.2d at 79-81; Anderson, 757 N.E.2d at 332-33; Doerr, 774 So. 2d at 126-28, and by the District's Commissioner of Insurance, we do not agree with our dissenting colleague that the absence of \"a detailed factual record\" precludes us from considering that history.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. These authorities are summarized in Nationwide II, 384 U.S. App. D.C. at 132, 270 F.3d at 956. Perhaps the most forceful statement of this position can be found in the dissenting opinion of Justice Heiple in Koloms, 687 N.E.2d at 82: Choosing to override the clear language of the insurance contract, however, the majority purports to divine the unstated intent of the parties. With this analysis, coverage is found to be provided. What we have here is not a case of contract construction. It is, rather, a case of contract reconstruction. As such, it is thimblerigging pure and simple. It also indicates the depths to which a court will go to achieve a desired result. If any principle can be derived from this ruling, it is that words have no meaning. Nationwide and its supporting amicus, the Complex Insurance Claims Litigation Association, assert that the authorities which hold that the absolute pollution exclusion is unambiguous represent a substantial majority of the decisions. Ms. Richardson vigorously contests this thesis, and the cases are so numerous and so diverse in their factual scenarios that a precise assessment of the weight of authority is difficult. See William B. Johnson, Annotation, Construction and Application of Pollution Exclusion Clause in Liability Insurance Policy, 39 A.L.R. 4th 1047 (1985 \u0026 Supp. 2002); Claudia G. Catalano, Annotation: What Constitutes \"Pollutant,\" \"Contaminant,\" \"Irritant,\" or \"Waste\" Within Meaning of Absolute or Total Pollution Exclusion in Liability Insurance Policy, 98 A.L.R. 5th 193 (2002); Sara M. Thorpe and Matthew S. Foy, Carbon Monoxide and the Pollution Exclusion, FOR THE DEFENSE, May 2003, at 45. In Meridian Mut. Ins. Co. v. Kellman, 197 F.3d 1178 (6th Cir. 1999), the court, in holding that, under Michigan law, the pollution exclusion \"applies only to injuries caused by traditional environmental pollution,\" id. at 1181, cited twenty-two federal and state court decisions supporting its position and seventeen holding the other way. Id. at 1181-83. Some fifteen years ago, well before most of the cases now relied on by both parties were decided, one federal court described the division between the courts with respect to the \"sudden and accidental\" exception as follows: This court recognizes that there is a plethora of authority from jurisdictions throughout the United States which, depending on the facts presented and the allegations of the underlying complaints, go \"both ways\" on the issues presented today. The cases swim the reporters like fish in a lake. The [d]efendants would have this [c]court pull up its line with a trout on the hook, and argue that the lake is full of trout only, when in fact the water is full of bass, salmon and sunfish too. Pepper's Steel \u0026 Alloys v. United States Fid. \u0026 Guar. Co., 668 F. Supp. 1541, 1549-50 (S.D. Fla. 1987) (Spellman, J.) The current state of the absolute pollution exclusion is as uncertain today as the meaning of \"sudden and accidental\" was when Pepper's Steel \u0026 Alloys was decided.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. These decisions are summarized in Nationwide II, 384 U.S. App. D.C. at 130-31, 270 F.3d at 954-55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. But this argument takes the word \"fumes\" out of context, at the risk of distorting the meaning of the exclusion as a whole. See Part III C, infra. \"[A] word is known by the company it keeps.\" Jarecki v. G.D. Searle \u0026 Co., 367 U.S. 303, 307 (1961); see also Edwards v. United States, 583 A.2d 661, 664 (D.C. 1990) (quoting Jarecki). Nationwide's argument fails to take this familiar proposition into account.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. This is especially true where, as here, the party claiming that the words are plain is relying on a part of the language of the exclusion without reference to the larger context of the entire clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Although Judge Hand's subject was the construction of a statute, his reasoning applies with equal force to any writing, and certainly to an insurance policy. In this case we are dealing with contractual language drafted by representatives of the insurance industry, presented to state regulators, and intended to have a uniform meaning and general application wherever the form policy was utilized. In this respect, it is in some ways quite similar to a statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Cameron, for example, a decision which was written by the author of this opinion, there was no contention presented by any party that the words used in the \"surface water\" exclusion there at issue had a history, or were adopted in a context in any way comparable to the situation in the present case. The court's comment that \"extrinsic evidence\" is not to be considered where the words appear unambiguous was not intended to suggest that, where context affects meaning, the court should not consider the circumstances under which ostensibly unambiguous language was used. Khiem v. United States, 612 A.2d 160, 164 (D.C. 1992), cert. denied, 507 U.S. 924 (1993), is à propos: In Kraft v. Kraft, 155 A.2d 910 (D.C. 1959), the court pointed out that: It is well to remember that significance is given to broad and general statements of the law only by comparing the facts from which they arise with those facts to which they supposedly apply. 155 A.2d at 913. See also Armour \u0026 Co. v. Wantock, 323 U.S. 126, 132-33 (1944), where the Supreme Court aptly stated: It is timely again to remind counsel that words of our opinions are to be read in the light of the facts of the order under discussion. To keep opinions within reasonable bounds precludes writing into them every limitation or variation which might be suggested by the circumstances of cases not before the Court. General expressions transposed to other facts are often misleading. (Emphasis added in Khiem.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We ought not to assume too readily that our decisions should be construed in a way that makes them inconsistent with the Restatement, which is written by the American Law Institute (ALI), an organization comprised of especially distinguished judges, attorneys, and scholars. See, e.g., Poretta v. Superior Dowel Co., 137 A.2d 361, 373 (Me. 1957). \"The Restatement may be regarded both as the product of expert opinion and as the expression of the law by the legal profession.\" Id. Although we are not required to follow the Restatement, we should generally do so \"where we are not bound by the previous decisions of this court or by legislative enactment, . . . [for] by so doing uniformity of decision w[ill] be more nearly effected.\" Smith v. Normart, 75 P.2d 38, 42 (Ariz. 1938); see also Ellis v. James V. Hurson Assocs., 565 A.2d 615, 618 (D.C. 1989); Gallimore v. Washington, 666 A.2d 1200, 1213-14 (D.C. 1995) (dissenting opinion) (addressing an issue not reached by the majority).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Courts have recognized two categories of ambiguity: (1) the contractual language may be \"intrinsically unclear,\" or (2) it may, while clear on its face, \"become uncertain when applied to a particular object or circumstance.\" Koloms, 687 N.E.2d at 76 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In his amicus brief, the Commissioner has provided a number of instances in which rigorous literalism would achieve obviously unintended results even in this very case. As the Commissioner points out, for example, [p]aragraph (1)(a) [of the exclusion] requires that the place of the injury have been \"owned or occupied by, or rented or loaned to\" the insured. Property managers, however, do not typically own, occupy, lease or borrow premises from principal; therefore paragraph (1)(a) would not generally apply to them and there would be coverage in this case. See Kelly-Coppedge, Inc. v. Highlands Ins. Co., 980 S.W.2d 462[, 464-67] (Tex. 1998) (\"occupancy\" requires more than mere physical presence). Brief for Commissioner at 18 n.23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Some courts disagree. See, e.g., Deni Assocs. of Fla. v. State Farm Fire \u0026 Cas. Ins. Co., 711 So.2d 1135, 1138 (Fla. 1998) (\"this [c]court cannot examine the history of the exclusion because the language is clear and unambiguous and to resort to history would, therefore, be contrary to Florida law\"); accord, Cincinnati Ins. Co. v. Becker Warehouse, Inc., 635 N.W.2d 112, 119-20 (Neb. 2001). In our view, however, these decisions wrench the language of the policy from its context and, by \"mak[ing] a fortress out of the dictionary,\" Cabell, 148 F.2d at 739, distort the meaning of the exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See ANTHONY HOPE, THE PRISONER OF ZENDA (1894).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See WILLIAM SHAKESPEARE, TWELFTH NIGHT, OR WHAT YOU WILL.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As stated in a leading text: One cannot insist too often or too vigorously that language at its best is always a defective and uncertain instrument, that words do not define themselves, that terms and sentences in a contract do not apply themselves to external objects and performances, that the meaning of such terms and sentences consists of the ideas that they induce in the mind of some individual person who uses or hears or reads them, and that seldom in a litigated case do the words of a contract convey one identical meaning to the two contracting parties or to both parties and a third person. 5 MARGARET N. KNIFFIN, CORBIN ON CONTRACTS §24.7, at 30-31 (1998) (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. As Judge Glickman observes in his dissent, post at 66, \"the typical commercial general liability policyholder has no inkling of the 'history and context' of the pollution exclusion, the arcana of environmental law, or the terminology of that esoteric field.\" But unless the meaning of the language of the pollution exclusion has changed since it was written - and Nationwide has made no such claim - the proper inquiry is what the language meant to the representatives of the insurance industry and to regulators at the time that the language was written.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Our dissenting colleague correctly notes that carbon monoxide may fairly be considered a \"fume.\" But where \"fumes\" is one of eight terms, all of which bring to mind waste dumps and industrial pollution, the notion that the exclusion was intended to include carbon monoxide emanating from a furnace in an apartment building becomes, at least, a good deal less than certain. Judge Glickman also asserts, post at 69, that the enumerated pollutants may bring to mind, inter alia, agricultural, vehicular, and landlord-caused pollution, as well as industrial pollution. On this point, we agree with the interpretation of the named pollutants and of their significance by the unanimous Supreme Judicial Court of Massachusetts in Western Alliance, rather than with the reading of that listing suggested by our colleague.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. E.g., \"treat, detoxify and neutralize\" (used three times), as well as the reference in section 2 (b) of the exclusion to suits for damages by a governmental agency.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. But see the discussion at pages 46-48, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Obviously, decisions which apply the exclusion to the kind of scenario presented here reject, at least implicitly, the reasoning of the West American line of cases. For example, in Nat'l Elec. Mfrs. Ass'n v. Gulf Underwriters Ins. Co., 162 F.3d 821, 825 (4th Cir. 1998), the court, applying what it believed to be District of Columbia law, described a policy containing the absolute pollution exclusion as \"clear and unambiguous\" and as \"contain[ing] neither technical terms nor terms of art.\" (Emphasis added.) While using the emphasized language, the court failed to address, or even to mention, the line of cases in which, for reasons explicated in West American and Western Alliance, the courts have viewed these words as environmental \"terms of art.\" In the present case, the proposition that the words used in the absolute pollution exclusion are terms of art meshes nicely with the timing of the exclusion's birth and with the evident purpose - the avoidance of insurer liability for environmental cleanup costs - which, as a matter of history, the clause was designed to achieve. To exclude from consideration this meshing between the language of the exclusion and the concerns of the industry when the exclusion was adopted is to ignore reality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Our dissenting colleague suggests that many of the terms at issue were in the original pollution exclusion, which predated most of the environmental statutes and regulations, and that as a result, these terms cannot be said to be terms of art derived from laws that did not exist when the words were originally written. But when the relevant parties - the insurance industry and state regulators -considered the language in the 1980s, the precise issue at hand was the \"possibility that . . . [an insurance company] could find itself indemnifying industries facing the staggering retroactive pollution clean-up costs imposed by the 1980 enactment of the [CERCLA].\" Essex Ins. Co., 863 F. Supp. 39-40. Representatives of the insurance industry wrote these words, and the regulators approved them, against the backdrop of new environmental statutes and regulations which, if the costs of coming into compliance were chargeable to insurance companies, imperiled the insurers' financial viability. It is therefore fair to say, as the United States Court of Appeals for the First Circuit has explained, that the parties employed \"terms of art in environmental law [that] are generally used to refer to damage or injury resulting from environmental pollution.\" Nautilus, 188 F.3d at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Perhaps the \"Drano\" example is not the best illustration of the perceived unreasonableness of the clause, for arguably, as our dissenting colleague suggests, spilled Drano on which a person slips and falls is not acting as an \"irritant\"; we note, however, that the exclusion does not contain the words \"acting as\"; moreover, the word \"irritant\" is a broad term not defined in the policy. See Reg'l Bank of Colo. v. St. Paul Fire \u0026 Marine Ins. Co., 35 F.3d 494, 498 (10th Cir. 1994) (discussing vagueness of term \"irritant\"). The \"chlorine\" example invoked by the court in Pipefitters, on the other hand, is sound; if too much chlorine is placed or \"released\" into a swimming pool and \"seeps\" into a victim's body, then it is at least arguably acting as a \"contaminant.\" Placing too much chlorine in a swimming pool is not so very different, qualitatively, from releasing too much waste into a lake or a river. Our dissenting colleague's reference to common sense in this connection (post at note 15) may therefore be a two-edged sword. Moreover, if read literally in the manner Nationwide suggests, the pollution exclusion would apply to damage caused when a heating unit leaks carbon monoxide, while, incongruously, the insurer would be required to defend and indemnify, notwithstanding the exclusion, if the heating unit exploded. The analysis by the United States Court of Appeals for the Seventh Circuit in Pipefitters has been adopted by at least two other Courts of Appeals and by the highest courts of at least three states. See text, infra, at page 33. We are aware of no decision finding fault with the court's reasoning in Pipefitters, and Judge Glickman has cited none. Indeed, in Certain Underwriters at Lloyd's London v. C.A. Turner Constr. Co., 112 F.3d 184, 188 (5th Cir. 1997), a decision relied on by Nationwide which favors a \"literal\" approach to the issue before us, the court uncritically quoted the very language from Pipefitters which our dissenting colleague rejects. Finally, a representative of the insurance industry, testifying in 1985 before the Texas State Board of Insurance, acknowledged that, read literally, the pollution exclusion could be construed to exclude coverage in situations to which it was not designed to apply. See text, infra, at 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Pipefitters was also quoted at length in Nationwide II, 348 U.S. App. D.C. at 131, 270 F.3d at 955, but the court in that case has obviously left to this court the determination whether and to what extent Pipefitters should be viewed as persuasive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Judge Glickman argues, post at 54, that because carbon monoxide can pollute the atmosphere and is extensively regulated as a pollutant, it must have operated as a pollutant in this case. For the reasons stated by the court in Reg'l Bank of Colorado and quoted in the text preceding this footnote, we are constrained to disagree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Judge Glickman argues that \"[r]ead literally, the pollution exclusion applies to pollution. That is what its heading says.\" Post at 75. But read literally, the exclusion could apply to bodily injury if a liquid \"contaminant,\" e.g., vinegar (acetic acid) or lemon juice (citric acid), accidentally seeped or migrated or escaped, i.e., spilled, on the floor of a private dwelling and if a house guest were to slip and fall. Although the words of the exclusion could cover this situation, Judge Glickman would protest, and rightly so, that this is not pollution as that word is commonly understood. But that is our dissenting colleague's own limiting principle to the purportedly unrestricted language of the exclusion. To determine which limiting principle applies, we must necessarily go to context and history, and reasonable people may surely differ as to whether carbon monoxide from a defective furnace in an apartment house is \"pollution\" in the conventional sense of the word. Thus, on our dissenting colleague's own terms, the clause is ambiguous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. By contrast, Ms. Richardson alleges that a furnace in the furnace room of the complex at which she was employed emitted carbon monoxide fumes into her unit and poisoned her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Thus, in his amicus brief, the Commissioner rejects the position that the absolute pollution exclusion unambiguously means what Nationwide now says it means. We have no reason to believe that the Commissioner's understanding of the clause (or the understanding of the Commissioner's predecessor) at the time of the clause's submission differed from the Commissioner's understanding of it today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Our dissenting colleague insists that the approval of the absolute pollution exclusion by the District's regulators two decades ago demonstrates that the clause should be read \"literally\" as Nationwide reads it. Judge Glickman's thesis, however, faces a formidable obstacle in the Commissioner's brief, which explicitly rejects rigorous and contextless \"plain language\" analysis, provides examples showing how this type of analysis can run awry, and urges reversal of the summary judgment entered by the District Court in Nationwide's favor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. If the absolute pollution exclusion had been accompanied by a reduction in premiums, we would have expected Nationwide and its amicus to have apprised the court of any such reduction. Its silence on the issue, and the absence of any mention of a reduction in any of the court decisions cited to us, surely speaks volumes. With respect, we do not see how the announcements by the ISO quoted by Judge Glickman, see post at 86 \u0026 note 24, bear at all on our point that a purported major curtailment of coverage was not accompanied by a reduction in the cost of the policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Given the insurance representative's acknowledgment that a strictly literal reading of the exclusion would and should be avoided, we find footnote 21 to the dissent perplexing if not inexplicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. As previously noted, see page 8, the Supreme Court of New Jersey has catalogued a substantial number of misleading statements by representatives of the insurance industry to state regulatory bodies with respect to the earlier version of the pollution exclusion. Morton Int'l, 629 A.2d at 848-55, 868-70. Most, if not all, of these representations were made in the early 1970s. Counsel for Ms. Richardson has attached to one of his submissions an article in which it is alleged that the industry's deceptive practices continued in connection with the introduction of the absolute pollution exclusion during the 1980s, see John A. MacDonald, Decades of Deceit: The Insurance Industry Incursion Into the Regulatory and Judicial Systems, 7 COVERAGE at 3, 8 et seq. (Nov./Dec. 1997), and the passage from COUCH quoted in the text at page 41, suggests that this may possibly be so. Nevertheless, in light of the limited information provided to us, we do not exaggerate the significance of this point. Ms. Richardson has contended in this case that statements made to regulators by representatives of the insurance industry when the absolute pollution exclusion was presented for approval, e.g., Wade Harrel's statements to the Texas State Board of Insurance, which we have quoted at page 40, are relevant to the meaning of the exclusion. Contrary to our dissenting colleague's assertion, see pages 83-84, post, our analysis of Ms. Richardson's contention therefore cannot be dictum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Indeed, as Judge Glickman points out, post at 62, the exclusion by its terms applies to the discharge of pollutants \"at\" as well as \"from\" any premises, site or location of the insured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. We emphasize that this is not a case of \"sick building syndrome\" in which the use of defective construction materials has polluted the indoor environment and may well have necessitated an environmental cleanup.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Our dissenting colleague also argues that the policy's \"hostile fire\" exception to the exclusion would be unnecessary if the exclusion applied only to waste dumps or industrial pollution and the like. But a hostile fire can occur as readily in a factory, e.g., a tire manufacturing plant, as in an apartment house, and the exception can serve the same purpose in each. Surely the tire manufacturer who suffers a hostile fire should be compensated by insurance for the otherwise traditional environmental pollution caused by the resulting smoke, and the \"hostile fire\" exception assures that such compensation will be forthcoming.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. It is, of course, possible that even though, as we have demonstrated, the main thrust of the absolute pollution exclusion was to avoid insurer liability for government-mandated cleanups, the clause was also intended to eliminate coverage for landlords or restaurateurs when a furnace on their property has malfunctioned. Surely, however, such dramatic gutting of a general liability policy would have been explicitly identified by some participant on this much-publicized controversy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The court went on to provide illustrations of the breadth of the statute and stressed the importance of the policies that it was enacted to vindicate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We need not and do not decide in this case whether the court's approach in Doerr makes the inquiry more complicated than it needs to be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. As Judge Glickman has recognized in a different context, post at 74, \"[t]he question before the court is only whether the absolute pollution exclusion is ambiguous in its application to the facts of this case, not whether the exclusion would be ambiguous in its potential application to other facts.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The Comprehensive Environmental Response, Compensation and Liability Act, 42 U.S.C. §§ 9601 et seq. (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. This court has found dictionaries to be helpful in construing the words of insurance policies according to their common meaning. See, e.g., Chase v. State Farm Fire \u0026 Cas. Co., 780 A.2d 1123, 1128 n.2 (D.C. 2001); Corriea, 719 A.2d at 1242-43. \"Although courts should not make a fortress out of the dictionary . . . it is useful to have one around.\" Washington Metro. Area Transit Auth. v. District of Columbia Dep't of Employment Servs., 731 A.2d 845, 848 n.3 (D.C. 1999) (citation and internal quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Introductory clauses and headings may be helpful in construing an insurance policy because they furnish the reader with a frame for what follows. In Nationwide Mut. Ins. Co. v. Schilansky, 176 A.2d 786, 787-88 (D.C. 1961), for example, this court relied in part on a policy's title and subtitles to determine its meaning. See also International Multifoods Corp. v. Commercial Union Ins. Co., 309 F.3d 76, 85 (2d Cir. 2003); Mazzaferro v. RLI Ins. Co., 50 F.3d 137, 140 (2d Cir. 1995) (\"A contract of insurance must be read as a whole, including any introductory clause or heading, to determine the intent of the parties.\") (quoting Save Mart Supermarkets v. Underwriters at Lloyd's London, 843 F. Supp. 597, 607 (N.D. Cal. 1994)); Scarborough v. Travelers Ins. Co., 718 F.2d 702, 708 (5th Cir. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. I address in Part II.C.3, infra, the significance of the deliberate omission of the phrase \"into or upon the land, the atmosphere or any water course or body of water\" in the development of the absolute pollution exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The majority attributes the phrase \"discharge . . . of pollutants\" to the Water Pollution Control Act, 33 U.S.C. §§ 1251 et seq. (2000). Ante at 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The majority identifies CERCLA and its implementing regulations as the source of \"release,\" \"escape,\" \"dispersal,\" and \"contaminant,\" among other terms. Ante at 26-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The Resource Conservation and Recovery Act, 42 U.S.C. §§ 6901 et seq. (2000). Citing West Am. Ins. Co. v. Tufco Flooring East, Inc., 409 S.E.2d 692, 699-700 (N.C. Ct. App. 1991), the majority locates the word \"discharge\" in RCRA. Ante at 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The pollution exclusion first came into widespread use as an endorsement to the 1970 commercial general liability form issued by the Insurance Services Office. Insurers began incorporating the pollution endorsement directly into their standard commercial general liability policies as exclusion \"f\" in 1973. See Shelley \u0026 Mason, supra, at 752; see also Nancer Ballard \u0026 Peter M. Manus, Clearing Muddy Waters: Anatomy of the Comprehensive General Liability Pollution Exclusion, 75 CORNELL L. REV. 610, 625-27 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The language in the Water Pollution Control Act that the majority cites, contained in 33 U.S.C. §§ 1251 (a)(1), 1251 (a)(3) and 1362 (16), dates from the 1972 amendments. See Pub. L. 92-500, § 101 (a)(1), (a)(3), 502 (16), 86 Stat. 816, 887 (1972). However, the original version of the Water Pollution Control Act, enacted in 1948, contains several references to the \"discharge\" of pollutants. See Pub. L. 80-845 § 2 (d), 62 Stat. 1155, 1156-57 (1948). Since the case at bar concerns air pollution, I will add for the sake of thoroughness that the federal Clean Air Act also used the term \"discharge\" prior to 1970, see, e.g., Pub. L. 86-635 § 8, 73 Stat. 646 (1959), as did the Air Quality Act of 1967. See Pub. L. 90-148, §§ 103 (e), 108 (d)(1)(A), (g), (j)(1), 111, 81 Stat. 485, 487, 494-99 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Nor, evidently, did the key language derive from the pre-1970 Clean Air and Air Quality Acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. WEBSTER'S THIRD NEW INTERNATIONAL DICTIONARY 2359 defines a \"term of art\" as \"a word or phrase having a specific signification in a particular art, craft, or department of knowledge: a technical term.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Elsewhere the majority is disturbingly (perhaps also revealingly) coy about how it construes the absolute pollution exclusion. For example, when the majority finally states its conclusion, it \"hold[s] that the purpose of the absolute pollution exclusion was to bar coverage for environmental degradation and for cleanups mandated by CERCLA and similar legislation.\" Ante at 40. I could agree with that formulation myself - except that the majority does not mean what it says, because the rest of its opinion engrafts limitations on the term \"environmental degradation\" (e.g., it must be \"industrial\" or \"conventional\" or \"traditional\") that are meant to rob it of its full meaning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Similarly, the majority asserts that \"read literally, the exclusion could apply to bodily injury if a liquid 'contaminant,' e.g., vinegar (acetic acid) or lemon juice (citric acid), accidentally seeped or migrated or escaped, i.e., spilled, on the floor of a private dwelling and if a house guest were to slip and fall.\" Ante at 35 n. 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. The Pipefitters court found it unnecessary to determine \"to what extent, or even whether,\" to embrace a limiting principle of the sort the majority in the present case adopts. Id., 976 F.2d at 1044.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. I might add that even if the word \"pollution\" in the caption is discounted, it still would be unreasonable to read the exclusion as applying to a slip on spilled Drano or an allergic reaction to the chlorine in a swimming pool. The spilled Drano is not acting as an irritant or contaminant under any definition of those terms when a person merely slips on it because it is a liquid. And in ordinary usage one would not speak of the utilization of chlorine to disinfect a swimming pool as a \"discharge, dispersal, seepage, migration, release or escape\" of that substance. The majority's suggestion that the chlorine might be said to \"seep\" into a swimmer's body, ante at 33 n.29, is a creative but perverse way to read the exclusion. The common reader is credited with common sense. \"Policy language is not genuinely ambiguous unless it is susceptible of more than one reasonable interpretation.\" Chase, 780 A.2d at 1127-28 (emphasis in the original) (citation and internal quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Ante at 16, quoting Kent Farms, Inc. v. Zurich Ins. Co., 998 P.2d 292, 295-96 (Wash. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Ante at 11, quoting Essex Ins. Co. v. Tri-Town Corp., 863 F. Supp. 38, 39-40 (D. Mass. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Ante at 12, quoting Doerr, 774 So. 2d at 127.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. See generally Claudia G. Catalano, Annotation, What Constitutes \"Pollutant,\" \"Contaminant,\" \"Irritant,\" or \"Waste\" Within Meaning of Absolute or Total Pollution Exclusion in Liability Insurance Policy, 98 A.L.R. 5th 193 (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Although this case applied the law of Illinois and Florida rather than the law of the District of Columbia, the legal principles involved appear to be the same in all three jurisdictions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. The majority cites a reported vignette in which an insurance company representative told the Texas State Board of Insurance in 1985 that \"no one would read\" the absolute pollution exclusion to deny coverage \"every time a bottle of Clorox fell off a shelf at a grocery store.\" Ante at 40. As my earlier discussion of the Drano example makes clear, that statement is neither misleading nor contrary to the industry's current interpretation of the exclusion. The majority's implication that regulators were not given a \"clear[] exposition\" of the reach of the absolute pollution exclusion is pure speculation. As I discuss infra, we have little evidence of what regulators were told, but what we do have indicates that they were told explicitly that the exclusion was intentionally broad.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. This is no idle concern. The available journal articles on the subject, for instance, are typically written by attorneys who make no bones about the fact that they regularly represent either policyholders or insurance companies in coverage disputes. As might be expected, the scope of the absolute pollution exclusion is the subject of tendentious (and often highly rhetorical) debate among these authors. See John N. Ellison, Richard P. Lewis \u0026 Brian T. Valery, Recent Developments in the Law Regarding the \"Absolute\" and \"Total\" Pollution Exclusions, 13 ENVTL. CLAIMS J. 55, 55 (2001); Shelley \u0026 Mason, supra at 749; Jeffrey W. Stempel, Reason and Pollution: Correctly Construing the \"ABSOLUTE\" Exclusion in Context and in Accord with Its Purpose and Party Expectations, 34 TORT \u0026 INS. L.J. 1, 1 (1998); John A. McDonald, Decades of Deceit: The Insurance Industry Incursion into the Regulatory and Judicial Systems, COVERAGE, Nov./Dec. 1997 at 3; Edward Zampino, Richard C. Cavo \u0026 Victor Harwood III, The Sophist's Maze: The Polluters' Revision of the History of the \"Total\" Pollution Exclusion, 8 MEALEY'S LITIG. REP.: INS. 1 (Sept. 27, 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. The exceptions mentioned are inapplicable to the case at bar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. The majority finds it \"difficult to believe\" that the absolute pollution exclusion would have effected \"such a major reduction in coverage . . . without any evident announcement describing the character of the change and without any adjustment of the insured's premiums.\" Ante at 40. As the ISO statements indicate, however, there was an announcement (indeed, the development of the absolute pollution exclusion to quell the consternation in the insurance industry was well-publicized), and part of the expressed reason for the new absolute exclusion was to redress the perceived expansion of coverage beyond what had been \"contemplated in the rates.\" That is, from the industry's perspective, the \"major reduction in coverage\" was mainly to return to the coverage the industry thought it had offered under the former, qualified pollution exclusion. Given that rationale, and the lack of industry experience on which to draw, it is understandable if the absolute pollution exclusion was not accompanied by an immediate adjustment of premiums.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Without disputing that the phrase \"into or upon land, the atmosphere or any water course or body of water\" limited the scope of the former exclusion to pollution of the external environment, a few courts nevertheless have characterized the deletion of that phrase as \"insignificant.\" Tufco Flooring, 409 S.E. 2d at 700. According to these courts, \"[t]he omission of the phrase only remove[d] a redundancy in the language of the exclusion that was present in the earlier pollution exclusion clause,\" inasmuch as \"the operative policy terms 'discharge,' 'dispersal,' 'release,' and 'escape' are environmental terms of art\" that signified the same thing. Id.; accord, American States Ins. Co. v. Koloms, 687 N.E.2d 80, 81-82 (Ill. 1997). This \"redundancy\" argument is faulty, however, precisely because, as explained above, the words used in the exclusion are not \"terms of art\" that connote only external pollution. The deliberate removal of the one phrase in the exclusion that did have such a connotation was, therefore, not \"insignificant\" at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. The completed operations and products hazards coverages are not applicable to the case at bar.\u003c/span\u003e\n\n",
    "body_length": 185421,
    "citedas": [
      "826 A.2d 310"
    ],
    "attorneys": "David P. Sutton, with whom Robert J. Pleshaw was on the brief, for appellant. Catherine M. Colinvaux, with whom David P. Durbin was on the brief, for appellee. Robert R. Rigsby, Corporation Counsel at the time the brief was filed, Charles L.Reischel, Deputy Corporation Counsel, and Michael F. Wasserman, Assistant CorporationCounsel, filed a brief for the Commissioner of the District of Columbia Department ofInsurance and Securities Regulation, amicus curiae. Laura A. Foggan and John C. Yang filed a brief for the Complex Insurance ClaimsLitigation Association, amicus curiae.",
    "category": [
      "8",
      "251",
      "184",
      "188"
    ],
    "judges": "Before Schwelb, Glickman, and Washington, Associate Judges.",
    "citation_count": 7
  }
}
