{
  "id": "R7TwTGYBTlTomsSBW1DD",
  "document": {
    "title": "09/19/91 PEOPLE STATE MICHIGAN v. DONALD WATKINS",
    "full_title": "PEOPLE OF THE STATE OF MICHIGAN v. DONALD WATKINS . PEOPLE OF THE STATE OF MICHIGAN V. MICHAEL HUNTER . PEOPLE OF THE STATE OF MICHIGAN V. CHRISTIAN PHILLIPS",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1991-09-19T00:00:00.000Z",
    "docket": "Docket Nos. 86776, 86806, 87091",
    "body": "Two distinct, though interrelated, issues arise in this case: (1) whether the accusatory hearsay statements inculpating the complaining defendants, contained within the co-defendant confessions at issue, fall within the \"statement against interest\" exception of MRE 804(b)(3), and (2) whether the admission of those statements as substantive evidence against the complaining defendants violated their rights -- under both the United States and Michigan Constitutions -- to confront the witnesses against them. We discuss the first issue in part II(A) and the second issue in part II(B). We discuss in part II(C) whether the admission of the co-defendant confessions at the joint trial, whether that be deemed evidentiary or constitutional error or both, can be deemed harmless with regard to any of the complaining defendants.\n\nI. FACTS\n\nAlthough we generally adopt the statement of facts in the Dissent, see post, pp 679-682, we find it necessary to revisit the crucial, disputed co-defendant confessions by Kerry Jordan and Walter Miller. The complete text of those statements is set forth in appendices to the Dissent. Even a casual reading of the confessions leads to the unavoidable Conclusion that they contain precisely the kind of inherently suspect and unreliable accusatory hearsay which has historically concerned courts and commentators. Co-defendant Jordan said it all when he responded to the interrogator's question, \"Why are you telling me [this statement],\" by saying: \" Because I'm not going to take the fall alone.\" Post, p 706 (emphasis added).\n\nWe set forth in the appendix to this opinion the specific statements in the confessions that appear to inculpate, directly or indirectly, one or more of the complaining defendants, with the surnames of the participants substituted for the various nicknames used in the confessions. See post, pp 668-676.\n\nII. ANALYSIS\n\nA. THE HEARSAY ISSUE\n\nMRE 802 provides that hearsay evidence is not admissible except where the rules provide otherwise. MRE 804(b)(3), worded almost identically to FRE 804(b)(3), \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e provides for the admission as substantive evidence of hearsay \"statements against interest,\" defined as follows:\n\nStatement against interest. A statement which was at the time of its making so far contrary to the declarant's pecuniary or proprietary interest, or so far tended to subject him to civil or criminal liability, or to render invalid a claim by him against another, that a reasonable person in his position would not have made the statement unless he believed it to be true. A statement tending to expose the declarant to criminal liability and offered to exculpate the accused is not admissible unless corroborating circumstances clearly indicate the trustworthiness of the statement. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nMichigan, unlike the United States and many other states, has not adopted any \"catch-all\" exception to the rule against hearsay, cf. FRE 803(24); FRE 804(b)(5), and no other exception has been suggested or appears to apply to the disputed hearsay statements in this case. Thus, if those statements do not properly constitute statements against interest, their admission was erroneous.\n\nIt is undisputed that Jordan's and Miller's confessions each contain numerous specific statements admitting their own involvement in the crime, which were clearly against their penal interests when made and would therefore undoubtedly be admissible as substantive evidence against anyone under MRE 804(b)(3). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Those statements, however, are not the ones that concern us here. The relevant issue is whether the various statements detailed in the appendix, inculpating the complaining defendants, are also admissible under MRE 804(b)(3) simply because they appear within the same confession as statements concededly against the confessor's interest, or whether each discrete and specific statement must be shown to separately and intrinsically satisfy the requirements of MRE 804(b)(3).\n\nThe Dissent would follow a \"carry-over\" rule. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Under this rule, discrete assertions within a broader statement are viewed as against interest and therefore admissible -- even though they, specifically, are not in fact against the interest of the declarant, and may even favor the interest of the declarant -- on the theory that the trustworthiness of other assertions within the broader statement (which are concededly against the declarant's interest) \"carries over\" and permeates the entire statement with a sort of aura of trustworthiness. Simply to state the rule suggests its inherent implausibility. As we discuss below, the rule is neither generally sound nor, more importantly, can it properly be applied in the special context of accusatory hearsay statements in co-defendant confessions, with their unique and long-recognized dangers of self-serving unreliability.\n\nThe most distinguished authority which might arguably be read to support the carry-over rule is Dean Wigmore's treatise, which states that\n\nince the principle is that the statement [against interest] is made under circumstances fairly indicating the declarant's sincerity and accuracy (§ 1457 . . .), it is obvious that the situation indicates the correctness of whatever he may say while under that influence. In other words, the statement may be accepted, not merely as to the specific fact against interest, but also as to every fact contained in the same statement. [5 Wigmore, Evidence (Chadbourn rev), § 1465, p 339. Emphasis in original.]\n\nBut this passage leaves undefined the scope of the \"statement.\" Does \"statement\" refer to the narrowest discrete or severable assertions uttered by a declarant? Or, as the Dissent apparently assumes without analysis, does \"statement\" automatically encompass an entire confession which may run many pages and contain dozens if not hundreds of discrete and severable assertions? In other words, how does one determine whether a given statement is truly and properly \"contained in\" a statement against interest? Wigmore, referring to \"the living principle\" underlying the exception, states that \"a . . . useful test appears to be this: All parts of the speech or entry may be admitted which appear to have been made while the declarant was in the trustworthy condition of mind which permitted him to state what was against his interest.\" Id. at 341.\n\nUnfortunately, with all due respect to Dean Wigmore, the quoted passages suggest a fundamental misunderstanding of the \"living principle\" which in fact underlies the statement against interest exception. Wigmore's references to the declarant's \"trustworthy condition of mind,\" to the \"circumstances\" under which the statement is made, and to what the declarant says \"while under that influence\" depart from the true and proper rationale for trusting the reliability of statements against interest. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e That rationale, properly understood, has nothing to do with the situational or environmental \"circumstances\" or pressures surrounding the declarant as he makes the statement. The declarant is not necessarily in any generally \"trustworthy condition of mind,\" nor is he under any \"influence\" which would automatically render anything he said at that time and under those \"circumstances\" trustworthy.\n\nRather, as Wigmore himself states, \"he basis of the exception is the principle of experience that a statement asserting a fact distinctly against one's interest is unlikely to be deliberately false or heedlessly incorrect . . . .\" Id., § 1457, p 329. In other words, the rule is based on the commonsense intuition that a reasonable person would be expected to lie, if at all, only in his own favor, and would not harm himself by his own words. \"'The principle is founded on a knowledge of human nature. Self-interest induces men to be cautious in saying anything against themselves, but free to speak in their own favor. We can safely trust a man when he speaks against his own interest.'\" Id., quoting Gibblehouse v Stong, 3 Rawle 437, 438 (Pa, 1832).\n\nIt thus follows by the most elementary logic that our confidence in the trustworthiness of a purported statement against interest extends only insofar as the specific factual assertions contained within the statement are, in fact, against the declarant's interest. \"Such a statement . . . has a guaranty of trustworthiness only insofar as the truth-telling stimulus of the declarant is operative; that is only insofar as the statement or portions of the statement, is against the declarant's interest.\" Deike v Great Atlantic \u0026 Pacific Tea Co, 3 Ariz App 430, 433; 415 P2d 145 (1966) (emphasis added), cited and quoted in 5 Wigmore, § 1465, p 340, n 2.\n\nThe rationale for the statement against interest exception is thus fundamentally different from the rationale for many of the other traditional hearsay exceptions, such as those admitting dying declarations and excited utterances. As the United States Supreme Court has recently noted:\n\nThe basis for the \"excited utterance\" exception, for example, is that such statements are given under circumstances that eliminate the possibility of fabrication, coaching, or confabulation, and that therefore the circumstances surrounding the making of the statement provide sufficient assurance that the statement is trustworthy and that cross-examination would be superfluous. Likewise, the \"dying declaration\" . . . exception[ ] to the hearsay rule based on the belief that persons making such statements are highly unlikely to lie. See, e.g., Mattox [ v United States, 156 U.S. 237,] 244; 15 S Ct 337; 39 L Ed 409 [1895] (\"he sense of impending death is presumed to remove all temptation to falsehood, and to enforce as strict an adherence to the truth as would the obligation of oath\"); Queen v Osman, 15 Cox Crim Cas 1, 3 (Eng N Wales Cir, 1881) (Lush, L.J.) (\"o person, who is immediately going into the presence of his Maker, will do so with a lie upon his lips\") . . . . [ Idaho v Wright, 497 U.S. 805, ; 110 S Ct 3139; 111 L Ed 2d 638, 655 (1990) (some citations omitted); see also MRE 803(2), 804(b)(2).]\n\nUnder the logic of these and similar hearsay exceptions, it might well be said that the presumed trustworthiness of the statement derives from the permeating influence of the situation in which the declarant finds himself as he utters the statement, and from his general mental condition thereby created, and that any associated statements made around the same time and under the same circumstances can be presumed to absorb and share that trustworthiness.\n\nIt would defy logic and common sense, however, to suppose that the motive for truthfulness presumed to underlie a discrete, specific assertion against interest possesses any such permeating influence, or could somehow cloak all collateral assertions with an equivalent aura of reliability. The presumed trustworthiness of a statement against interest derives not from the circumstances in which the statement is made, or from the general mental condition of the declarant, but only from the specific factual character of the statement itself. The statement is trustworthy precisely, and only, to the extent that it is, in fact, against the interest of the declarant. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWigmore himself, in several passages, actually seems to reject the logic of the carry-over rule. For example, Wigmore specifically cautions that \"t must be remembered that it is not merely the statement that must be against interest, but the fact stated. It is because the fact is against interest that the open and deliberate mention of it is likely to be true.\" 5 Wigmore, § 1462, p 337 (emphasis in original). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In another passage, Wigmore emphasizes the need to parse very carefully the specific factual content of discrete assertions, and to avoid any careless assumption that a declarant's motivation either to lie or tell the truth with regard to one assertion necessarily carries over to any collateral assertion:\n\nA common illustration of this question is the use of a merchant's credit entry of payment received (thus against his interest) which at the same stroke has included (thus in favor of his interest) the debit entry of his claim leading to the payment; and, conversely, an agent's debit and credit account in which the receipts creating liability are on the whole equaled or exceeded by the payments or credits in his favor. When (in the former case) the entry of payment received, or (in the latter case) of an item creating liability is sought to be used, the argument has been made that since, taking both sides of the account together, the entrant is not left with any liability and perhaps appears to have a claim for a balance, the matter cannot be said to be against his interest. This argument . . . has since been repudiated. The answer to it is that the entrant's interest in making the favoring items does not really affect, as a countermotive, his interest against the individual charging items; the entries of the latter, taken by themselves, are to be trusted. [ Id., § 1464, pp 338-339. Emphasis in original.]\n\nApplying Wigmore's logic in this passage, if the declarant's motivation to make a discrete assertion in his interest \"does not really affect\" his incentive not to make a separate but closely associated assertion against his interest, then the reverse must also be true: The declarant's incentive not to make the assertion against interest does not logically lend any credibility to separate, even though closely associated, assertions not sharing that disincentive. Statements not against interest, \"taken by themselves,\" are not \"to be trusted.\"\n\nThe case law rejecting the carry-over rule is both ample and persuasive. Deike v Great Atlantic \u0026 Pacific Tea Co, supra, although a civil case, is squarely on point. Deike involved an action for conversion against the estate of a man who had allegedly robbed one of the plaintiff's A\u0026P stores. The trial court admitted as evidence of the decedent's guilt the custodial confession of a man who stated that he had robbed the store together with the decedent and another man. The court found this to be error requiring reversal because\n\nthere is no showing that that part of [ the declarant's ] statement implicating [ the decedent ] in the Seattle robbery was in fact against the declarant's interest -- pecuniary, proprietary, penal or otherwise. There is no showing that [the declarant] felt any compelling obligation as to the truthfulness of his implication of [ the decedent ]. This Court can only speculate upon the inducements or reasons which prompted [the declarant] to make the declaration. [3 Ariz App 433. Emphasis added.]\n\nThe California Supreme Court rejected the carry-over rule in People v Leach, 15 Cal 3d 419; 124 Cal Rptr 752; 541 P2d 296 (1975), which involved the hearsay statements of two co-defendants that each were introduced as evidence against both. The court stated:\n\ne construe the exception to the hearsay rule relating to evidence of declarations against interest . . . to be inapplicable to evidence of any statement or portion of a statement not itself specifically disserving to the interests of the declarant. [ Id. at 441. Emphasis added.]\n\nNew York's highest court has also rejected the carry-over rule. See People v Brensic, 70 NY2d 9, 16; 517 NYS2d 120; 509 NE2d 1226 (1987):\n\nIf the court decides to allow such evidence [a statement against interest introduced to inculpate the accused], it should admit only the portion of that statement which is opposed to the declarant's interest since the guarantee of reliability contained in declarations against penal interest exists only to the extent the statement is disserving to the declarant. . . . [Emphasis added.] \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nFederal courts have also rejected the carry-over rule. In United States v Lilley, 581 F2d 182, 188 (CA 8, 1978), the court addressed the applicability of FRE 804(b)(3) to a statement that \"contained some material which was against [the declarant's] interest and some allegations which were not against his interest and which were inculpatory of the accused.\" The court stated:\n\nThe restriction advocated by McCormick excluding portions of statements which are not against the declarant's interest is in keeping with the reasoning behind the 804(b)(3) exception to the hearsay rule. Rule 804(b)(3) is based on the guaranty of trustworthiness which accompanies a statement against interest. To the extent that a statement is not against the declarant's interest, the guaranty of trustworthiness does not exist and that portion of the statement should be excluded. Those portions of [the declarant's] statement inculpating appellant did not so far tend to subject him to criminal liability and were not so far contrary to his interests that a reasonable man would not have made them unless he believed them to be true. . . . Thus, all portions of [the declarant's] statement which were not against his interest should have been excluded from evidence because they lacked the indicia of truthfulness associated with Rule 804(b)(3). Also, the small portion of [the declarant's] statement which was against his interest should have been excluded absent severability from those portions of the statement inculpating the accused. [ Id. ]\n\nLikewise, the United States Court of Appeals for the Fifth Circuit has held:\n\nGiven the advantages readily to be perceived in the incrimination of another for a crime in which the declarant himself is implicated, the circumstance that the inculpatory-against-the-accused statement would have probative value against the declarant does not necessarily indicate that, insofar as it implicates the accused, it is sufficiently against the declarant's interest so as to be reliable. [ United States v Sarmiento-Perez, 633 F2d 1092, 1101-1102 (CA 5, 1981). Emphasis in original.]\n\nOther cases rejecting the carry-over rule, at least implicitly, include United States v Bailey, 581 F2d 341, 345, n 4 (CA 3, 1978), United States v Palumbo, 639 F2d 123, 127-128 (CA 3, 1981), United States v Riley, 657 F2d 1377, 1384-1385 (CA 8, 1981), and United States v Vernor, 902 F2d 1182, 1187 (CA 5, 1990).\n\nThere are some cases, of course, which support the carry-over rule followed by the Dissent, but such cases typically lack significant or persuasive explanation or analysis, and often arise in contexts not fully apposite to the instant case, such as hearsay statements introduced by an accused to exculpate himself. See, e.g., State v Abrams, 140 NJ Super 232, 235-236; 356 A2d 26 (1976), aff'd without opinion 72 NJ 342; 370 A2d 852 (1977) (following the carry-over rule in unpersuasive ipse dixit in the context of a statement introduced by the accused to exculpate himself); \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e State v Earnest (On Remand), 106 NM 411, 412; 744 P2d 539 (1987) (similarly unpersuasive ipse dixit applying the carry-over rule with no analysis or justification).\n\nEven if some form of carry-over rule were conceded, arguendo, to be appropriate in some circumstances, the overwhelming weight of authority, in both case law and treatises, emphatically rejects any extension of such a rule to the special context of accomplice confessions, given their uniquely suspect and inherently unreliable character. In this regard, it is appropriate to note that Dean Wigmore's treatise, even if it could be read to ambiguously support the carry-over rule to a limited extent, simply does not focus on the special and unique problems raised by accomplice confessions used to inculpate the accused in a criminal trial.\n\nJudge Weinstein's treatise does focus very informatively on those problems and takes an almost absolute position against the admission of inculpatory hearsay statements in accomplice confessions: \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nStatements Inculpating Accused. Particularly troublesome is the problem of inculpating statements against penal interest inculpating the accused. Since they are offered against the accused, and by definition declarant is unavailable, confrontation questions arise. Since they are made by someone subject to criminal prosecution, the possibility exists, especially when the statement is made in police custody, that declarant is seeking immunity or hopes to be allowed to plead to a lesser crime, in return for his help to the prosecution in obtaining a conviction. Cross-examination in such instances is particularly important and is usually quite extensive. Generally, the defendant is entitled to a charge with respect to the particular care that needs to be taken in evaluating such accomplice testimony. [4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[03], p 804-150.]\n\nAfter discussing the rigorous inquiry that a trial court should always undertake in assessing an alleged statement against interest in an accomplice confession offered to inculpate a criminal defendant, Judge Weinstein concludes that \"ecause of the dangers involved, exclusion should almost always result when a statement against penal interest is offered against an accused.\" Id. at 804-156 (emphasis in original); see also McCormick, Evidence (3d ed), § 279, pp 825-826.\n\nThat the carry-over rule cannot properly be applied in the context of co-defendant confessions is abundantly clear from the United States Supreme Court's reasoning in Lee v Illinois, 476 U.S. 530; 106 S Ct 2056; 90 L Ed 2d 514 (1986). The Court in Lee addressed the applicability of the Sixth Amendment right of confrontation to a hearsay co-defendant confession, and stated:\n\nThe true danger inherent in this type of hearsay is, in fact, its selective reliability. As we have consistently recognized, a codefendant's confession is presumptively unreliable as to the passages detailing the defendant's conduct or culpability because those passages may well be the product of the codefendant's desire to shift or spread blame, curry favor, avenge himself, or divert attention to another. [ Id. at 545. Emphasis added.]\n\nClearly, Lee envisioned a careful and searching analysis of each specific factual assertion contained within any broader statement or confession. While Lee applied constitutional confrontation analysis, the very same concerns of reliability inform the proper analysis under hearsay evidence law. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nClearly, the assumption behind the carry-over rule -- that discrete self-serving or neutral assertions within a broader statement somehow absorb an aura of trustworthiness from separate assertions which are against the declarant's interest -- is more than just inherently implausible as a general matter, though it is that. In the context of accomplice confessions, that assumption simply flies in the face of the obvious and long-recognized nature of such confessions as uniquely and especially suspect and unreliable with regard to accusations directed toward alleged accomplices.\n\nGiven the inapplicability of any carry-over rule to the confessions in this case, it is necessary to separately analyze the specific accusatory statements contained within them under MRE 804(b)(3). At the outset, the general question arises of how narrowly to divide such statements for analytical purposes. The answer is dictated by the logic of the statement against interest exception, as discussed above. Each factual assertion sought to be admitted under that exception must be viewed as narrowly and specifically as reasonably possible, and the court must separately ask whether each specific assertion is so intrinsically against the declarant's interest that a reasonable person would not have said it unless it were true. In other words, to the extent such statements can be logically and reasonably severed and dealt with independently, they should be. While this might, at first glance, seem an arduous task, it becomes quickly obvious that none of the accusatory statements in the confessions at issue here can reasonably be said to be statements against interest. Indeed, it appears likely, as a general matter, that accusatory statements in co-defendant confessions will almost never properly qualify as statements against interest. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nWhile we have listed, in the appendix, sixty-five separate statements contained within the confessions at issue in this case, it is obvious that many of those numbered \"statements\" themselves contain several distinct and severable statements or assertions. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e With all such assertions, the inquiry is analytically quite simple: Given everything else that the confessor admitted regarding his own participation in the alleged crimes, was it against his interest also to name and accuse the alleged accomplices and describe their conduct? With regard to the accusatory statements in these confessions, the answer clearly is no. This Conclusion is especially obvious with regard to statements such as no. 11 (\" said come on, let's go beep \"), no. 24 (Answering question, \"Did know what was going down?\" stating, \"Yes\"), no. 45 (\" told me to drive over on Cloverlawn because we were going on a mission\"), and no. 62 (\" is the boss and he would have had to order the hit or approve of it\").\n\nIt might be argued that some of the statements refer collectively to both the confessor and one or more of the codefendants, and thus are simultaneously against the confessor's interest and inculpatory of the codefendants. But such an argument would fail to appreciate the easily severable nature of such statements. For example, in statements nos. 14-16, 45, 51, and 54, Jordan and Miller describe driving about in search of the intended victim, with each of them present in the car along with Watkins and Phillips. These statements were certainly against Jordan's and Miller's interest insofar as they admitted that they themselves were present in the car and that they were part of a group searching for an intended murder victim. But having admitted those facts, was it against either's interest to go further and specify either Watkins or Phillips as also being present in the car and participating in the scheme? Obviously not. The same logic applies to statements such as no. 22 (\"Me and had Uzi's, had a .357 mag\"). It was obviously against Jordan's interest to say that he had an Uzi, but it was clearly not against his interest to add that Phillips also had an Uzi and that Watkins had a .357 magnum. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn sum, the specific accusatory hearsay statements at issue in this case are simply not statements against interest. Having chosen to confess their own involvement in the crime, Jordan and Miller had nothing to lose by also accusing and inculpating Watkins, Hunter, and Phillips. Indeed, they probably felt they had plenty to gain. See post, pp 657-664. In the end, however, it is unnecessary to speculate whether any particular additional circumstances rendered the hearsay statements at issue especially untrustworthy. It is enough to conclude, as the law and the facts clearly dictate, that they are simply not statements against interest under MRE 804(b)(3), that they therefore constitute inadmissible hearsay, and that their admission as evidence against Watkins, Hunter, and Phillips at trial was therefore erroneous. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nB. THE RIGHT OF CONFRONTATION\n\nThe Sixth Amendment of the United States Constitution provides:\n\nIn all criminal prosecutions, the accused shall enjoy the right . . . to be confronted with the witnesses against him . . . . [U.S. Const, Am VI.]\n\nThe Michigan Constitution similarly provides:\n\nIn every criminal prosecution, the accused shall have the right . . . to be confronted with the witnesses against him . . . . [Const 1963, art 1, § 20.]\n\nFor more than a quarter century, the United States Supreme Court, relying on the Sixth Amendment right of confrontation, has subjected hearsay statements in co-defendant confessions introduced to inculpate the accused to the most searching and intensive scrutiny. In Douglas v Alabama, 380 U.S. 415; 85 S Ct 1074; 13 L Ed 2d 934 (1965), the Court held that the Sixth Amendment was violated even though the hearsay accomplice confession was not formally admitted as evidence, but was read to the co-defendant as he remained mute on the stand, claiming his Fifth Amendment privilege against self-incrimination, purportedly to \"refresh\" his memory. The Court rejected that subterfuge and held that the defendant was denied the right to confront and cross-examine his co-defendant accuser. See id. at 419-420.\n\nIn Bruton v United States, 391 U.S. 123; 88 S Ct 1620; 20 L Ed 2d 476 (1968), the Court held that the danger posed by hearsay co-defendant confessions to the defendant's right of confrontation is so extreme that cautionary instructions to the jury regarding consideration of such evidence in joint trials must be deemed ineffective and constitutionally insufficient. The Court stated:\n\nhere are some contexts in which the risk that the jury will not, or cannot, follow instructions is so great, and the consequences of failure so vital to the defendant, that the practical and human limitations of the jury system cannot be ignored. Such a context is presented here, where the powerfully incriminating extra-judicial statements of a codefendant, who stands accused side-by-side with the defendant, are deliberately spread before the jury in a joint trial. Not only are the incriminations devastating to the defendant but their credibility is inevitably suspect, a fact recognized when accomplices do take the stand and the jury is instructed to weigh their testimony carefully given the recognized motivation to shift blame onto others. The unreliability of such evidence is intolerably compounded when the alleged accomplice, as here, does not testify and cannot be tested by cross-examination. It was against such threats to a fair trial that the Confrontation Clause was directed. [ Id. at 135-136. Citations omitted.]\n\nThe Court strongly reaffirmed Bruton in Cruz v New York, 481 U.S. 186; 107 S Ct 1714; 95 L Ed 2d 162 (1987), which held that Bruton 's rejection of the efficacy of cautionary instructions applies even in cases where the complaining defendant himself has confessed, where his confession \"interlocks\" to a substantial extent with the accusatory hearsay confession of his codefendant, and where the codefendant's confession is no more inculpatory of the defendant than the defendant's own confession. See id. at 191-193. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIn the instant case, of course, there was no cautionary instruction or redaction with regard to the disputed accusatory statements in the co-defendant confessions, because those statements were admitted as substantive evidence against the complaining defendants under MRE 804(b)(3). The issue here is simply whether such admission was proper. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The substantive inadmissibility of hearsay co-defendant confessions, while presumed in such cases as Douglas and Bruton, was squarely addressed by the United States Supreme Court in Lee v Illinois, supra. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Dissent concedes, as it must, that Lee is \"entral to our analysis\" in this case, see post, p 693, but we must take issue with its understanding of Lee and its application of Lee to this case.\n\nThe Court in Lee squarely \"reject [the state's] categorization of the hearsay [codefendant confession] involved . . . as a simple 'declaration against penal interest.' That concept defines too large a class for meaningful Confrontation Clause analysis. We decide this case as involving a confession by an accomplice which incriminates a criminal defendant.\" 476 U.S. 544, n 5. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Lee, of course, did not thereby categorically bar the admission of hearsay statements in co-defendant confessions to inculpate the accused. But Lee did thereby reject the possibility that an accusatory hearsay statement in a co-defendant confession, purportedly constituting a statement against interest, might on that ground be deemed presumptively admissible without any inquiry into its particularized guarantees of trustworthiness.\n\nIt is true that Lee avoided deciding whether, as a general matter, statements against penal interest fall within a \"firmly rooted hearsay exception,\" but that is because the Court clearly found it unnecessary to decide that issue, because it would not have affected or altered the Court's analysis. (If the issue had been relevant or dispositive, the Court surely would have addressed it.) Lee focused specifically on the problems related to hearsay co-defendant confessions introduced against the accused, and found that the \"concept\" of the statement against interest is simply too broad to be analytically useful (let alone dispositive) in that context. In part, footnote five in Lee appears to recognize that accusatory statements in co-defendant confessions will not usually, in fact, truly constitute statements against interest. As discussed in part II(A), the Court's reasoning in Lee strongly suggests that it fully understood the carry-over issue and properly rejected any carry-over rule, at least in this context. Thus, the Court may have thought the statement against interest exception \"defines too large a class\" because particular assertions within a statement generally against interest might not be specifically against interest themselves. See generally part II(A).\n\nFootnote five in Lee clearly indicates much more, however, than that the Court might simply have found the particular statements at issue to be not truly against the confessor's interest. Rather, as a general theoretical matter, the Court stated that \" concept [of the statement against interest] defines too large a class for meaningful Confrontation Clause analysis,\" and concluded that it had to analyze the case more narrowly within the context of \"a confession by an accomplice which incriminates a criminal defendant.\" 476 U.S. 544, n 5. Indeed, the Dissent in Lee argued strenuously that the hearsay statements inculpating the accused in that case truly were against the confessor's interest, even viewed narrowly and inseverably. See id. at 553, n 6 (Blackmun, J., joined by Burger, C.J., and Powell and Rehnquist, JJ., Dissenting); cf. part II(A), n 14. It appears that the Court, while not necessarily rejecting that view of the statements, nevertheless believed that they had to be subjected to rigorous scrutiny regarding their \"particularized guarantees of trustworthiness.\" Thus, the Court in Lee apparently believed that the statement against interest exception \"defines too large a class\" because, while that exception might confer presumptive reliability on most types of hearsay in most cases, it does not, without more, suffice to cure the especially suspect and uniquely unreliable nature of accusatory hearsay statements in co-defendant confessions.\n\nIndeed, central to any proper understanding of Lee is the recognition -- as the Court painstakingly emphasized -- that Lee, like the instant case, involved hearsay that did not merely fall outside any traditional exception that would have conferred presumptive reliability on it. The hearsay in Lee did not merely lack, at face value, any affirmative indicia of reliability. Rather, because it constituted accusatory hearsay contained in a co-defendant confession, it was properly presumed at the outset to be uniquely and especially suspect and unreliable, much more so than typical, run-of-the-mill hearsay.\n\nOur cases recognize that th truthfinding function of the Confrontation Clause is uniquely threatened when an accomplice's confession is sought to be introduced against a criminal defendant without the benefit of cross-examination. As has been noted, such a confession \"is hearsay, subject to all the dangers of inaccuracy which characterize hearsay generally. . . . More than this, however, the arrest statements of a co-defendant have traditionally been viewed with special suspicion. Due to his strong motivation to implicate the defendant and to exonerate himself, a codefendant's statements about what the defendant said or did are less credible than ordinary hearsay evidence.\" [ Lee, 476 U.S. 541, quoting Bruton, 391 U.S. 141 (White, J., Dissenting) (citations omitted by Lee ; emphasis added here).]\n\nThus, while Lee held that this \"presumption [of unreliability] may be rebutted\" in accordance with the general analysis of \"particularized guarantees of trustworthiness\" set forth in Ohio v Roberts, 448 U.S. 56, 66; 100 S Ct 2531; 65 L Ed 2d 597 (1980), see Lee, 476 U.S. 543, it is clear that the Roberts analysis should be conducted with much greater rigor in a Lee -type case. It is therefore not surprising that the Court's analysis of the disputed confession in Lee was constantly and explicitly sensitive to the special dangers of unreliability in that context. See id. at 544-546.\n\nThe Dissent argues that the disputed hearsay statements in the instant case satisfy the test of reliability set forth in Lee. See post, pp 695-701. We discern eight separate grounds on which the Dissent rests its finding that these statements bear sufficient particularized indicia of reliability: (1) the statements were voluntarily given, id. at 700, (2) none of the confessing co-defendants was offered any \"'leniency in exchange' for their statements,\" id., (3) the statements \"were so far contrary to [the confessors'] penal interest that they had to be true,\" id. at 700, (4) the statements indicated \"personal knowledge\" of the underlying events, id. at 701, (5) the confessors confessed soon after their arrests, id., (6) \"there is nothing in the record to support an inference that either Jordan or Miller made the statements implicating the others in an attempt to avenge himself, or to demonstrate that he was motivated by a desire to curry favor with his interrogators, or that the state gave either any reason to believe that it would help if he inculpated others,\" id., (7) there is \"no affirmative evidence of blameshifting\" in either Jordan's or Miller's confession, and both took a substantial helping of blame themselves, id. at 695, and (8) Jordan's and Miller's statements are \"consistent\" with, and therefore corroborate, each other, id. at 697, 701. Each of these grounds is addressed below, though not in order.\n\nGround 3 has already been refuted. The accusatory statements contained in these confessions are simply not, by any stretch of the imagination, statements against interest. See part II(A). Ground 1 was specifically rejected as inadequate by Lee. \" finding [of voluntariness] does not bear on the question of whether the confession was also free from any desire, motive, or impulse . . . either to mitigate [the confessor's] own culpability by spreading the blame or to overstate [the accused's] involvement . . . .\" 476 U.S. 544. Hearsay accusations against co-defendants are suspect precisely because the declarant is likely to make them not only voluntarily but eagerly, and because it will usually be in his own interest to do so.\n\nGrounds 4 and 5 find no support in Lee, and plainly do not materially assist in overriding the presumption of unreliability. These factors would appear likely to exist with virtually every co-defendant confession, and are thus unhelpful in singling out particularly reliable confessions. Virtually every co-defendant confession is likely to suggest that the confessor has \"personal knowledge\" of the relevant events (if not, such statements would hardly be useful evidence for the prosecution), and most confessions, by definition, are taken in police custody soon after arrest. That a statement appears or purports to be based on \"personal knowledge\" says little or nothing about its potential inaccuracies or biases. The very danger and infirmity of all hearsay is precisely that the defendant has no opportunity to cross-examine the declarant regarding his alleged \"personal knowledge,\" and regarding \"the many possible deficiencies, suppressions, sources of error and untrustworthiness, which lie underneath the bare untested assertion of a . . . .\" 5 Wigmore, § 1362, p 3 (describing the underlying theory of the rule against hearsay). Furthermore, the fact that the confessions were taken in police custody soon after arrest has been universally viewed by all persuasive authorities as weighing heavily against the reliability of such statements. See, e.g., Lee, 476 U.S. 541-542; 4 Weinstein \u0026 Berger, para. 804(b)(3)[03], p 804-154; McCormick, Evidence (3d ed), § 279, p 826; Sarmiento-Perez, 633 F2d 1102-1104; Brensic, 70 NY2d 15-16, 20. It is precisely in the context of custodial confessions made to police -- in contrast, for example, to \"a spontaneous declaration made to friends and confederates,\" Sarmiento-Perez, 633 F2d 1102 \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e -- that the concerns regarding unreliable co-defendant accusations are at their zenith.\n\nGrounds 2, 6, and 7 indicate an even more basic flaw in the analysis of the Dissent. By arguing that this record reveals no explicit promises or offers of deals by the police to these confessors, no affirmative proof that these particular confessors were actually motivated by a desire to avenge themselves, spread blame, or curry favor with the police, and \"no affirmative evidence of blameshifting,\" post, p 695, the Dissent erroneously suggests that accusatory co-defendant confessions should generally be admitted unless, on a case-by-case basis, such specific evidence of unreliability is produced. This turns Lee on its head. The very premise of Lee is that accusatory statements in co-defendant confessions are, by their very nature, presumptively unreliable, and that the mere absence of additional, specific indicia of unreliability cannot suffice to overcome that heavy presumption. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Even if the record in this or any case reveals no explicit promises or inducements by the police, it would depart from common sense to suppose that these or any accomplice confessors could be naively unaware of the fact, surely common knowledge \"on the street,\" that benefits may often be reaped by cooperating with the police and \"naming names.\" \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The controlling and persuasive authorities are in agreement that the motivation to spread the blame and curry favor with the police need not be affirmatively proven on a case-by-case basis, but rather must be presumed to inhere in the context of custodial confessions.\n\nThus, the ever-present likelihood that the police will try to induce statements inculpating suspected accomplices, and that, in any event, accomplice confessors will almost always desire to accuse and inculpate their alleged cohorts and will almost always believe (even without police encouragement) that they can help themselves by so doing, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e provides a basis for categorically doubting the reliability of all custodial co-defendant confessions. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e This approach is consistent with the reasoning of the Court in Cruz, supra, which rejected the notion that the \"devastating\" effect of co-defendant confessions noted by Bruton \"should be assessed on a case-by-case basis. Rather, that factor was one of the justifications for excepting from the general rule the entire category of co-defendant confessions that implicate the defendant in the crime.\" 481 U.S. 191 (emphasis added).\n\nWith regard to ground 7, it is not entirely clear what the Dissent means by \"affirmative evidence of blameshifting.\" Post, p 695. A confession is intrinsically suspect whenever, on its face, it imputes criminal liability to one or more accomplices by reporting or describing their alleged criminal conduct. To speak of \"blameshifting, \" of course, implies that the confessor's accusations may be inaccurate or biased. But there is no way to tell, from the confession itself, whether the accusations are, in fact, true or false. It is entirely possible, in this as in any co-defendant confession case, that the confessors' accusations are true and accurate. But the point of Lee and the general principles governing this area is that the hearsay character of such accusations precludes the vital probing and testing of confrontation and cross-examination, and that the context in which this kind of hearsay arises requires the presumption that such accusations are too unreliable to be properly admissible evidence. That presumption cannot logically be overcome simply because it seems, from the contents or wording of the confession itself, that the confessor is not shifting or spreading blame in an especially obvious or suspicious manner. A canny confessor seeking to protect himself and shift blame to others will obviously strive to make his confession seem as honest and free of \"blameshifting\" as possible.\n\nGround 7 also erroneously suggests that the mere fact that the confessor takes some helping of blame himself renders his accusations of others more reliable. At bottom, this amounts to no more than a resurrection in disguised form of the invalid carry-over theory regarding statements against interest. See generally part II(A). Lee plainly rejected any notion that accusatory statements in a co-defendant confession are rendered more reliable simply because the confessor also inculpates himself (which is virtually always going to be the case). The Dissent in Lee noted that the co-defendant confessor in that case severely inculpated himself, indeed, that his \"confession was less favorable in all respects to his own interests than [the complaining defendant's own] confession . . . .\" 476 U.S. 553. Yet the Court in Lee still found the accusatory statements intolerably unreliable, noting that \"he true danger inherent in this type of hearsay is . . . its selective reliability. . . . codefendant's confession is presumptively unreliable as to the passages detailing the defendant's conduct or culpability. . . .\" Id. at 545 (emphasis added).\n\nEven if the analysis of the Dissent with regard to grounds 6 and 7 were theoretically proper, the Dissent misapplies that analysis by simply ignoring the numerous statements in Jordan's and Miller's confessions which, in fact, do pointedly shift and spread blame onto the complaining defendants, minimize the confessors' own involvement, and suggest that the confessors were indeed motivated to inculpate the others in the hope of helping themselves. We have already noted the most dramatic of these statements: Jordan's declaration, at the very outset of his confession, that he was talking to the police \"[ b ] ecause I'm not going to take the fall alone \" (emphasis added). See, also, in the appendix, statements no. 23 (Jordan answering question, \"Why did you guys want to kill ?\" stating, \"It was really who wanted him\"), no. 42 (Miller, after many of the preparations for the crime had allegedly been completed by the others, claiming, \"That's when I found out what was going down\"), no. 62 (Miller answering question, \"Who ordered [the hit]?\" stating, \" is the boss and he would have had to order the hit or approve of it\"), no. 63 (Miller, in response to an open-ended question, volunteering statements that \" was in the narcotics business,\" that Hunter \"was an underboss enforcer for and body guard for\" another drug boss, and that after the other drug boss got killed, \" kind of took over action\"), and no. 65 (Miller answering question, \"If a hit would be planned ahead of time, would you be informed of it?\" stating, \"No, that would be between , , and , all I would do is drive, and I wouldn't find out until it was about to happen\").\n\nIndeed, the confessors in this case frequently attempted to shift responsibility even for their own actions onto the complaining defendants, by claiming, at various points, that they acted only in response to orders given by one or the other of the complaining defendants. See statements nos. 11, 27, 43-45, 51, 52, 54, and 62. Miller also denied participating in any of the actual shooting, and denied knowing why the hit was ordered. In sum, we can only express puzzlement at the Dissent's assertion that there is \"no affirmative evidence of blameshifting\" in these confessions. Post, p 695.\n\nFinally, with regard to ground 8, the Dissent errs in its reliance on the fact that Jordan's and Miller's confessions are \"consistent\" with each other. Post, pp 697, 701. In the first place, this observation misunderstands the \"interlock\" theory discussed in Lee, 476 U.S. 545-546, and in Cruz, 481 U.S. 193-194. The allegedly relevant consistencies in Lee and Cruz were between the codefendant's hearsay confession and the complaining defendant's own confession. In this case, Hunter and Phillips did not make any incriminating statements to the police, and Watkins' two statements were not introduced at trial. The interlock between Jordan's and Miller's confessions is far less significant in view of the fact that they had precisely the same presumptive motive to inculpate Watkins, Hunter, and Phillips.\n\nIn any event, the United States Supreme Court, just last year, squarely prohibited reliance on corroborative evidence of any kind in assessing whether presumptively unreliable hearsay bears sufficient \"particularized guarantees of trustworthiness\" for Confrontation Clause purposes. See Idaho v Wright, 497 U.S. 805; 110 S Ct 3139; 111 L Ed 2d 638 (1990). Wright held that \"'particularized guarantees of trustworthiness' must be shown from the totality of the circumstances, but we think the relevant circumstances include only those that surround the making of the statement and that render the declarant particularly worthy of belief.\" 111 L Ed 2d 655. \"To be admissible under the Confrontation Clause, hearsay evidence used to convict a defendant must possess indicia of reliability by virtue of its inherent trustworthiness, not by reference to other evidence at trial.\" 111 L Ed 2d 657. The Court reasoned that\n\nthe use of corroborating evidence to support a hearsay statement's \"particularized guarantees of trustworthiness\" would permit admission of a presumptively unreliable statement by bootstrapping on the trustworthiness of other evidence at trial, a result we think at odds with the requirement that hearsay evidence admitted under the Confrontation Clause be so trustworthy that cross-examination of the declarant would be of marginal utility. [ Id. ] \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nWright specifically rejected reliance on either corroborative physical evidence, hearsay statements, or trial testimony, see 111 L Ed 2d 659, 664-665, and thus clearly overruled the dicta in both Lee and Cruz regarding reliance on the \"interlocking\" consistency or corroboration of confessions. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn sum, the admission of the accusatory hearsay statements in these confessions as evidence against Watkins, Hunter, and Phillips plainly violated their right of confrontation under both the United States and Michigan Constitutions. Not only were the statements not in any sense against interest, but, just as in Lee, they were \"given in response to the questions of police, who . . . no doubt knew what they were looking for, and w not tested in any manner by contemporaneous cross-examination by counsel, or its equivalent.\" Lee, 476 U.S. 544. These statements suffer from the classic indicia of unreliability affecting virtually all custodial co-defendant confessions. The heavy presumption of unreliability is not overcome by any particularized indicia of inherent trustworthiness, applying the proper analysis. To the extent that we may properly draw any particularized inferences about the motivations which may actually have prompted Jordan and Miller to make these statements, such inferences tend to support excluding rather than admitting them. Jordan explicitly, and Miller implicitly, made clear that their primary concern was \"not to take the fall alone.\"\n\nIt may be that only a hearsay confessional statement strongly, specifically, and inseverably against the confessor's interest could ever conceivably qualify for admission under the test enunciated in Lee, and even then, the most rigorous and exacting scrutiny would be required to determine whether the prosecution has overcome the heavy presumption of unreliability. We agree with Judge Weinstein's wise counsel that \"ecause of the dangers involved, exclusion should almost always result when a statement against penal interest is offered against an accused.\" 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[03], p 804-156 (emphasis in original).\n\nIn this case both Michigan's rule against hearsay and the constitutional right of confrontation were plainly violated.\n\nC. HARMLESS ERROR\n\nWith regard to both evidentiary and constitutional errors, Michigan's harmless error rule requires that the appellate court be able to confidently conclude, beyond any reasonable doubt, that the error did not affect the jury's verdict. See People v Robinson, 386 Mich 551, 563; 194 NW2d 709 (1972). It is clear that the erroneous admission of Jordan's and Miller's confessions as evidence against the complaining defendants in this case -- whether that error be deemed constitutional or merely evidentiary -- cannot be deemed harmless with regard to either Watkins, Hunter, or Phillips. While the properly admitted evidence against these defendants was substantial, the hearsay confessions provided a uniquely devastating and detailed account of the alleged crime. Any doubt on this score is dispelled by the fact that the jury specially asked and was permitted to re-examine copies of the two confessions during deliberation. It would be virtually impossible to find the error harmless in light of such a direct indication that the jury was specifically concerned with the erroneously admitted evidence.\n\nFor these reasons, these defendants' convictions must be reversed and remanded for retrial without the erroneously admitted co-defendant confessions.\n\nIII. CONCLUSION\n\nThe right of confrontation is not a hairsplitting technicality designed to needlessly hamper or impede the operation of our criminal Justice system. It is a vital component of the Bill of Rights and the American tradition of Justice, which serves not only the goal of protecting the liberty of presumptively innocent defendants -- and thereby us all -- but also, and inseparably so, the ultimate truthseeking goal of the trial process itself. These goals are equally served by the exclusion of hearsay -- an intrinsically suspect and presumptively unreliable form of evidence -- unless it is properly found to fall within one of the established exceptions set forth in the Rules of Evidence.\n\nWe would reverse the judgment of the Court of Appeals and remand for retrial without the inadmissible hearsay.\n\nAPPENDIX\n\nA. THE JORDAN CONFESSION\n\n1. \", another guy who worked for me came over to 9555 Pinehurst and said that Cliff was at home.\"\n\n2. \"Then me, , went in a black ougar and drove over to Cliff's house. and another guy followed us in their car.\"\n\n3. \"We got the gun from Cliff and got in the car with us.\"\n\n4. \" said, 'I just saw go to the store, we should get him.'\"\n\n5. \" and got out of the car with . They waited by the alley for and brought him back to the car.\"\n\n6. [Answering question, \"Were they armed?\"] \"Yes, had an Uzi, had the gun we got from Cliff, didn't have anything.\"\n\n7. \"When we got to the car and , no and got in the back seat with him. They made him bend over and we went back to 9555 Pinehurst.\"\n\n8. \"We all went into the basement and they [apparently Watkins, Phillips, and Miller] questioned . They were questioning him about a guy name .\"\n\n9. \"I went outside. Then came to the house. I told we got in the basement and we went downstairs.\"\n\n10. \" said I'll beep [apparently, contact by beeper] because he didn't want us to kill him.\"\n\n11. \" said come on, let's go beep .\"\n\n12. \"Me, , , and drove over to the Mendota and beeped .\"\n\n13. \" gave an address off the top of his head on Cloverlawn and gave it to . was there with us.\"\n\n14. \"After we made the call, me, , , and went on Cloverlawn. At first we just drove down the street. We parked near Tireman. He was pulling off and we were behind him.\"\n\n15. \"We [Jordan, Phillips, Watkins, Miller, and Payne] went back to Mendota and beeped again. I don't remember if was there or not.\"\n\n16. \"After called, we went back on Cloverlawn, me, , , and and parked. We gave another address this time. Me, , , and got out of the car. We told to go and stand in front of the address we gave .\"\n\n17. \"We waited about twenty or thirty minutes and decided to leave because it was raining a little bit and had not showed up. We all got back into the car and started to leave and that's when we saw .\"\n\n18. \"We came around the block and parked on the side street, I think it was Belton; but I'm not sure. Me, and got out.\"\n\n19. \"Me and went to one side of the street. was on the other. We were walking towards . He was on [Watkins'] side of the street coming off the porch.\"\n\n20. \" went to get in his car. That's when the shooting started.\"\n\n21. \" took off in his car. We went back to our car and went back on Pinehurst. and got out and we got out for a while. Then me, and left.\"\n\n22. [Answering question, \"What kind of gun did you, (Watkins) and (Phillips] have?\"] \"Me and had Uzi's, had a .357 mag, the gun we got from Cliff.\"\n\n23. [Answering question, \"Why did you guys want to kill (Wilbert)?\"] \"Because was working with us, then he quit us and was working for . It was really who wanted him.\"\n\n24. [Answering question, \"Did (Hunter) know what was going down?\"] \"Yes.\"\n\n25. [Answering question, \"Are there any corrections (to the statement)?\"] \"Yes, when we picked up [apparently referring to statement no. 5], stayed in the car, and got out. had the Uzi, had the .357.\"\n\nB. THE MILLER CONFESSION\n\n26. \"On the day the shooting happened, came over to 9555 Pinehurst and said that Cliff wanted to give the gun [a .357 revolver] back to us.\"\n\n27. \" instructed us to get the gun.\"\n\n28. \"Me, , went in a black ougar, I think it's a 1979, over to Cliff's house.\"\n\n29. \" and a guy who I don't know got into a blue car and led the way to Cliff's.\"\n\n30. \"When we got to Cliff's he was on the porch, got the gun from him . . . . Before we left got out the car he was in and got into our car. After we got the gun we left.\"\n\n31. [Answering question, \"Was anyone in the car armed before Cliff gave you the revolver?\"] \"Yes, had a Mack-10, had a Uzi 9 mm, I was unarmed, and got the .357 from Cliff; but it wasn't loaded. The rest of the guns were loaded.\"\n\n32. \"We were just going around the block when spotted a gun who was walking out of a store. said, that's, then he said the guy's name; but I don't remember the name.\" [This was apparently Payne.]\n\n33. \"We turned the corner and pulled over. and me got out of the car and walked to an alley. got behind a garbage dumpster and I was in front of it.\"\n\n34. \"The guy who was walking came across the street and started turning into the alley when I stopped him. I said don't move. The guy stopped and said don't kill me. jumped out and was standing behind me. I grabbed the guy and walked him to the car and put him in the back seat with , then I got in the back seat with him.\"\n\n35. [Answering question, \"Were either you or (Phillips] armed?\"] \"Yes, I had the .357, it was unloaded, had the Uzi.\"\n\n36. \"When we got [back to 9555 Pinehurst] , and took into the basement.\"\n\n37. \" was not at the house when we first arrived, either or went down the street, found and told him what had happened.\"\n\n38. \" then came back to the house with either or and went into the basement.\"\n\n39. \"Me, and were in one part of the basement talking about what happened. We [apparently Miller and Phillips] told him [apparently Hunter] about us going over there and getting the gun, and bringing back with us.\"\n\n40. [After Phillips, Jordan, Hunter, Watkins, and Payne had left 9555 Pinehurst] \"I left 9555 Pinehurst and went over to Mendota where they were. When I got to Mendota I went up on the porch and , , , and the other guy sat on the porch talking about the guy who had beeped, all I remember is that the guy said he was waiting for someone to call him back.\"\n\n41. \"The guy finally called, when he called I was back on Pinehurst checking the house. I went back on Mendota and got the car and went and bought some gas and returned to Pinehurst. Everyone was there, , , , and the other guy .\"\n\n42. \"I parked the car and me, , and just started walking down the street and talking. That's when I found out what was going down.\"\n\n43. \" told me to get into the car and drive to Mendota and Westfield with the guy [apparently Payne], and wait.\"\n\n44. \"I went back to Pinehurst, got the guy , put him in the car and went to where told me to go.\"\n\n45. \", , and came and got into the car, told me to drive over on Cloverlawn because we were going on a mission and that we were going to meet the guy on Cloverlawn. I drove to Cloverlawn between Belton and Tireman, when we got there the guy who I took out of the Pinehurst house pointed out a little red car and said that's them. They guy [apparently Wilbert] was coming off of the porch and was getting into his car, I speeded up to try to catch up with him, but he pulled off. He made a right on Tireman and circled the block. I tried to follow him but lost him. I caught back up with him on the sidestreet off of Tireman. I followed him and stopped on Brighton and Majestic.\"\n\n46. \", and got out of the car and started to walk up Majestic towards the red car.\"\n\n47. \" went into the alley. and stayed on the sidestreet. By the time they got there the guy was gone. They came back into the car and I tried to follow the guy; but I lost him.\"\n\n48. \"We went back on Mendota, , , and the other guy went inside, I drove off and went and made a phone call.\"\n\n49. \"I went back to the house on Mendota, and stood on the porch. All of them came out, , , , and the guy .\"\n\n50. \" was mad. He didn't say anything but by knowing him I could tell he was mad.\"\n\n51. \" or said let's go and I got back in the car with , , and the other guy [apparently Payne].\"\n\n52. \" told me to go back on Cloverlawn and that they called the guy [apparently Wilbert] again and had given him another address.\"\n\n53. \"While driving down Cloverlawn I saw the red car on Mackenzie, I made a left on Joy oad, , and were out of the car by this time. I dropped them off on Cloverlawn by the alley, I went into a lot on Northlawn and Joy Road, turned around then made a left on Joy oad and picked all three of them up at Cloverlawn and Joy oad.\"\n\n54. \"Once they [Phillips, Jordan, and Watkins] got into the car I drove to Roselawn and made a right, going back to Tireman, then another right on Belton. I cruised up to the alley with the lights off and stopped. , and got out of the car and walked up to Cloverlawn. Before they got out either or told me to wait and that I was to crash into the red car if they tried to get away.\"\n\n55. \"As they [Phillips, Jordan, and Watkins] were walking away from our car I heard someone say, he turned around.\"\n\n56. \"I proceeded up Belton to Northlawn then to Mackenzie, turned and parked on the corner of Cloverlawn and Mackenzie. I saw the red car, it was like in the middle of the block. By the time I parked the shooting started.\"\n\n57. \"The red car pulled off, I realized that I wasn't where I was supposed to be and pulled off behind him. The red car made a left on Tireman, I stopped on Cloverlawn and Belton and picked up , and . We tried to chase the car but he got away.\"\n\n58. \"We went back to the house, Wykes, that's where we followed him to earlier, but he wasn't there. Then we went back to Mendota, , , and the other guy got out. I went and made another phone call and then went back to Mendota. Everyone was on the porch, , , , and the other guy . They took the car and told me to meet them back on Pinehurst. I walked back to Pinehurst, 9555, we all went inside and talked about what happened.\"\n\n59. \"Everyone was mad at me and blamed me for missing the guy. told me you better start learning how to think. The guy who I didn't know [apparently Payne] said you just signed my death warrant. We also discussed what to do with the guy who I didn't know [apparently Payne]. said to let him go. I left and went to my mother's house. Everyone was still on Pinehurst when I left.\"\n\n60. [Answering question, \"What type of weapons did the three guys have who did the shooting?\"] \" and had Uzi's, had the .357.\"\n\n61. [Answering question, \"Who loaded the .357?\"] \"I don't know but before left the car he checked it and said it was loaded.\"\n\n62. [Answering question, \"Who ordered (the hit)?\"] \" is the boss and he would have had to order the hit or approve of it.\"\n\n63. [Answering question, \"What relationship between you, (Phillips), (Jordan), (Watkins) and (Hunter)?\"] \"Me, and grew up knowing each other. I met after I got with the crew and that's also when I met . was in the narcotics business. He was an underboss enforcer for and body guard for Farmer, he's the guy who got killed on the expressway, Wendell Henry. After he got killed, kind of took over Farmer's action, he was still working for someone, but I don't know who. Me, , , were the enforcers for . An enforcer is a person who makes sure everything is going all right, and who straightens things out if there not.\"\n\n64. [Answering question, \"Do you know what happened to the guns that were used?\"] \"They were kept by the guys who had them.\"\n\n65. [Answering question, \"Are there any additions or corrections you want made?\"] \"The only other thing is that it was not a planned hit for that day, we were only supposed to get the gun, the rest just happened afterwards.\" [Answering question, \"If a hit would be planned ahead of time, would you be informed of it?\"] \"No, that would be between , , and , all I would do is drive, and I wouldn't find out until it was about to happen.\"\n\nBrickley, J. (concurring ).\n\nFew situations in generate more troubling and thorny issues than the substantive admissibility of an accomplice's custodial confession against a codefendant. The United States Supreme Court has long recognized the hazards exposed to the right of confrontation in cases where the state seeks to admit a non-testifying codefendant's confession. Bruton v United States, 391 U.S. 123; 88 S Ct 1620; 20 L Ed 2d 476 (1968).\n\nI agree with the result reached by the Chief Justice that the trial court erroneously allowed admission of the codefendant's confessions under the facts presented, and that the error was not harmless. The Chief Justice's position that the statement against interest hearsay exception is not based on the circumstances surrounding the giving of the statement, but on its contents and therefore admissibility should be limited to only those statements contrary to the declarant's penal interest has considerable logic. However, because the parties did not raise this particular issue in the lower courts, the defendants did not raise it on appeal, and the prosecutor raised the issue only in a footnote on the last page of his brief, I decline to endorse the Chief Justice's reasoning regarding the so-called carry-over rule in the context of declarations against penal interest. The lead opinion predicts all too accurately that \"as a general matter, . . . accusatory statements in co-defendant confessions will almost never properly qualify as statements against interest.\" Ante, pp 646-647. I would leave this issue open for another day.\n\nI respectfully cannot agree with the Dissent that the confessions at issue \"bear the particular guarantees of trustworthiness required by the Sixth Amendment.\" (Post, p 701.) The reliability of the confession of Jordan is powerfully undercut by his opening statement in reply to the question of why he was making a statement that he would not \"take the fall alone.\" Miller's confession appears even less reliable than Jordan's in that it minimizes Miller's involvement in the criminal transaction and maximizes the affirmatively bad acts of his codefendants. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Furthermore, unlike United States v Layton, 855 F2d 1388, 1402 (CA 9, 1988), this case involves a custodial confession , not a non-custodial statement against interest made to a trusted adviser. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Thus, both the circumstances surrounding the statements and the substance of the statements themselves mitigate against their admissibility, even without considering that co-defendant confessions are presumptively unreliable and that the statement against interest exception has not been conclusively validated as a \"firmly rooted\" hearsay exception.\n\nAs in Lee v Illinois, 476 U.S. 530; 106 S Ct 2056; 90 L Ed 2d 514 (1986), I would conclude that both the circumstances and the substance of these confessions indicate an unacceptable basis of reliability for Confrontation Clause purposes. For these reasons, I support the result, although not the entire reasoning of the Chief Justice's opinion.\n\nRiley, J. (dissenting).\n\nIn the instant case, we are asked to consider whether the trial court erred by permitting the prosecutor to introduce as substantive evidence incriminating statements of two non-testifying co-defendants at the defendants' joint trial and, if so, whether the error was harmless. While the lead opinion reasons that the trial court erred in admitting the statements because they were not against the declarants' penal interest, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e I would hold that the introduction of the non-testifying declarants' unredacted statements that implicated the defendants was not error, and consequently did not violate the Confrontation Clause of either Const 1963, art 1, § 20 or U.S. Const, Am VI. Thus, I would affirm the decision of the Court of Appeals. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nI\n\nIt was established at trial that on August 26, 1986, Michael Hunter sent Christian Phillips, Walter Miller, Donald Watkins, and Kerry Jordan to the home of Cliff Harris to retrieve a gun given to Harris by Hunter. Harris, who once sold cocaine for Hunter, used the gun to protect himself and the crack house out of which he worked. Having learned that the four were coming, Harris asked a friend, Bernard Payne, to \"watch his back\" while the return of the gun took place.\n\nPayne agreed and waited with Harris for the arrival of Hunter's men. However, before the four men arrived to retrieve the gun, Payne decided to leave the house and walk to the local grocery store. While walking back to Harris' house, Watkins, Miller, and Jordan accosted Payne and forced him at gunpoint into an awaiting automobile driven by Phillips. The four took Payne to a house on Pinehurst in Detroit to meet Hunter. Hunter told Payne to page his friend, Desmond Wilbert, who had also sold cocaine for Hunter, and to direct Wilbert to pick him up at an address on Cloverlawn in Detroit. He made it clear to Payne that he was not interested in harming him, but wanted Wilbert killed because he had heard that Wilbert was selling cocaine in direct competition with him on the west side of Detroit.\n\nPayne did as he was ordered, and all the men, except Hunter, left to await Wilbert's arrival. They missed their first opportunity to intercept Wilbert because he drove off before they could get out of the car and shoot him. After returning to their house, Hunter directed Payne to page Wilbert again and arrange a second pickup at the Cloverlawn address. When Wilbert returned to that address, Phillips, Watkins, and Jordan (stationed with two on one side of the street and one on the other) opened fire. Wilbert was able to escape in the car and survive the attack, but a sixteen-year-old passenger, Voncie Johnson, was killed.\n\nA few months later, all five defendants were apprehended for the murder of Voncie Johnson, the attempted murder of Desmond Wilbert, and the kidnapping of Bernard Payne. When questioned by the police, Jordan, Miller, and Watkins implicated themselves and the others in the criminal episode. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Jordan and Miller told the police that they and the others were ordered by Hunter to kill Wilbert and that is what they attempted to do. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Neither attempted to deny involvement in the shooting, and neither tried to blame anyone other than himself, or the other defendants for the killing.\n\nBefore trial, Jordan and Miller moved to suppress their statements. Both claimed the police promised them leniency in exchange for implicating the other members of the group. Judge Henry Heading of the Detroit Recorder's Court took testimony from Jordan, Miller, and the homicide detective who obtained the statements and concluded that both the declarants spoke freely to the police and that no promises or threats occurred, and denied their motion to suppress. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAt trial, the testimony of Payne and Harris implicated all five of the defendants in the murder of Voncie Johnson, the attempted murder of Desmond Wilbert, and the kidnapping of Bernard Payne. Their testimony was corroborated by a host of witnesses involved in the investigation. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e None of the defendants testified on their own behalf.\n\nToward the Conclusion of his case, the prosecutor moved for the admission of Jordan's and Miller's statements under MRE 804(b)(3). In a hearing conducted outside the presence of the jury, Judge Michael Talbot of the Detroit Recorder's Court, reviewed the statements in light of the relevant case law and held that Jordan's and Miller's statements could be introduced under the hearsay exception for declarations against penal interest. He reasoned that the statements had \"greater reliability than any other exception to the hearsay rule by the very nature admitting to the crime . . . .\" After both statements were read to the jury, and before closing arguments, Judge Talbot instructed the panel to disregard the opinion testimony made in the statements and to concentrate only on the testimony that related to the substantive matter.\n\nDuring the course of deliberations, the jury asked the court if they could listen to the testimony of Bernard Payne one more time, and review Jordan's and Miller's statements. In complying with the second request, Judge Talbot instructed the prosecutor to \"redact\" or \"white-out\" \"any opinion testimony\" in the statements so that the jury would adhere to his prior instruction to disregard any opinion testimony in the statements. After reviewing the redacted materials, counsel for the defense informed the court that they had no objection to permitting the jury to consider the redacted statements. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe jury unanimously convicted all five defendants for the stated charges after rehearing the testimony of Payne and examining the redacted statements of Miller and Jordan. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe Court of Appeals affirmed their convictions, finding that no error was committed by the trial court in admitting the codefendants' statements as substantive evidence because the statements bore a sufficient amount of trustworthiness to overcome the presumption of unreliability. People v Watkins, supra at 445-447. We granted leave to appeal to determine whether the trial court erred in permitting the prosecution to introduce, as substantive evidence at the defendants' joint trial, incriminating statements of two non-testifying codefendants, and if so, whether the error was harmless. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nII\n\nThe defendants have argued throughout the appellate process that, as a general rule, the Confrontation Clause does not permit the use of a non-testifying codefendant's incriminating statement to be used substantively against a codefendant. In support of this argument, they rely on Bruton v United States, 391 U.S. 123; 88 S Ct 1620; 20 L Ed 2d 476 (1968). In Bruton, the incriminating written statement of an accomplice was read to the jury after the accomplice invoked his privilege against self-incrimination and refused to testify. The United States Supreme Court reversed the accused's conviction, holding that the Confrontation Clause bars the use of a non-testifying codefendant's statement which implicates the accused in a crime. However, the Court added the caveat that \"here is not before us . . . any recognized exception to the hearsay rule insofar as petitioner is concerned and we intimate no view whatever that such exceptions necessarily raise questions under the Confrontation Clause.\" Id. at 128, n 3. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nToday we have a hearsay exception that addresses the caveat left open in Bruton. MRE 804(b)(3), \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and its federal counterpart FRE 804(b)(3), codify the common-law exception to the hearsay rule for statements against penal interest. See 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[01], p 804-123.\n\nThis exception to the hearsay rules is based on the premise that \"he circumstantial guaranty of reliability for declarations against interest is the assumption that persons do not make statements which are damaging to themselves unless satisfied for good reason that they are true.\" See Notes of the Advisory Committee, as reported in 11 Moore, Federal Practice, § 804.01[12 -- 6]. See also Weissenberger, Federal Evidence, § 804.20, p 512; 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[01], p 804-123; Lilly, Introduction to Evidence, p 261.\n\nThe rule expressly provides that a statement is not admissible if offered to exculpate the accused, unless corroborating circumstances clearly indicate the trustworthiness of the statement. However, it does not offer express guidance relative to when a statement is offered to inculpate the accused. See Notes of the Senate Committee on the Judiciary, as reprinted in 11 Moore, Federal Practice, § 804.01[12 -- 3].\n\nWhen this rule of evidence was being considered by Congress, the House Subcommittee on the Judiciary added an additional sentence that would have prohibited the use of an against penal interest statement that inculpated a codefendant. See Notes of the House Committee on the Judiciary, reprinted in 11 Moore, Federal Practice, § 804.01[12 -- 1]. However, the Senate Committee on the Judiciary deleted the House amendment because\n\nthe basic approach of the rules is to avoid codifying, or attempting to codify, constitutional evidentiary principles, such as the fifth amendment's right against self-incrimination and, here, the sixth amendment's right of confrontation. Codification of a constitutional principle is unnecessary and, where the principle is under development, often unwise. Furthermore, the House provision does not appear to recognize the exceptions to the Bruton rule, e.g., where the co-defendant takes the stand and is subject to cross examination; where the accused confessed, see United States v Mancusi, 404 F2d 296 (CA 2, 1968), cert den 397 U.S. 942 [1970]; where the accused was placed at the scene of the crime, see United States v Zelker, 452 F2d 1009 (CA 2, 1971). [11 Moore, Federal Practice, § 804.01(12 -- 3).]\n\nThe conference committee adopted the Senate version, omitting the House amendment, and justified its resolution with the reasoning employed by the Senate Committee: the rules of evidence should not attempt to codify constitutional principles on this issue. 11 Moore, Federal Practice, § 804.01[12 -- 4]. Accordingly, the drafters of the rule left to the courts the task of delineating prerequisites to the admissibility of inculpatory penal interest statements.\n\nBefore the adoption of the rules, commentators had almost universally disapproved the reluctance to admit declarations against penal interest. Dean Wigmore, who is regarded as the leading authority on the law of evidence, denounced the economic limitations on the declarations against interest exception as \"arbitrary,\" \"illogical,\" \"barbarous,\" and contrary to two hundred years of precedents. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e 5 Wigmore, §§ 1476, 1477, pp 349-362.\n\nProfessor Morgan, a leading authority on the law of evidence, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e concluded that excluding declarations against penal interest while admitting declarations against economic interest does not have \"even a superficial appearance of rational consistency . . . .\" Morgan, Declarations against interest, 5 Vand L R 451, 463 (1952).\n\nMoreover, Professor McCormick, another distinguished commentator on the law of evidence, agreed with Wigmore that the exclusion of the penal interest doctrine was not justified in law or in any other manner. Far from taking a \"firm position\" against Wigmore's position regarding the hearsay exception admitting declarations against penal interest, Professor McCormick unequivocally endorsed the arguments raised by Dean Wigmore in § 278 of his classic and very persuasive treatise on the law of evidence.\n\nWas the practice of excluding third-person confessions in criminal cases justified? It certainly could not be justified on the ground that an acknowledgment of facts rendering one liable to criminal punishment was less trustworthy than an acknowledgment of a debt. The motivation for the exclusion has no doubt been a different one, namely, the fear of opening a door to a flood of witnesses testifying falsely to confessions that were never made or testifying truthfully to confessions that were false. This fear was based on the likely criminal character of witness and declarant, reinforced by the requirement that declarant be unavailable. Wigmore rejects the argument of the danger of perjury since the danger is one that attends all human testimony, and concludes that \"any rule which hampers an honest man in exonerating himself is a bad rule, even if it also hampers a villain in falsely passing for an innocent.\" Under this banner, saluted also by Holmes, J., in a famous Dissent, courts began to relax the rule of exclusion of declarations against penal interest in particular situations or generally. [McCormick, Evidence (3d ed), § 278, p 823. See also the same treatise and section in the second edition (1972). Emphasis added.]\n\nEqually important were the state and federal court decisions that relaxed the requirements of excluding penal interest statements before the rules of evidence incorporated the penal interest hearsay exception. This trend began with Justice Oliver Wendell Holmes who, though in Dissent, argued:\n\nThe rules of evidence in the main are based on experience, logic and common sense, less hampered by history than some parts of the substantive law. There is no decision by this court against the admissibility of such a confession; the English cases since the separation of the two countries do not bind us; the exception to the hearsay rule in the case of declarations against interest is well known; no other statement is so much against interest as a confession of murder, it is far more calculated to convince than dying declarations, which would be let in to hang a man, Mattox v United States, 146 U.S. 140 [13 S Ct 50; 36 L Ed 917 (1892)]; and when we surround the accused with so many safeguards, some of which seem to me excessive, I think we ought to give him the benefit of a fact that, if proved, commonly would have such weight. The history of the law and the arguments against the English doctrine are so well and fully stated by Mr. Wigmore that there is no need to set them forth at greater length. 2 Wigmore, Evidence, §§ 1476, 1477. [ Donnelly v United States, 228 U.S. 243, 277-278; 33 S Ct 449; 56 L Ed 820 (1913) (Holmes, J., Dissenting). Emphasis added.]\n\nGiven the strength of Justice Holmes' analysis, several state courts began to relax their evidentiary rules excluding the declaration against interest in particular situations, \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e or generally. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e See McCormick, (supra) , § 278, p 823. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e For example, in rejecting the exclusion of a declaration against penal interest, the California Supreme Court reasoned that\n\na person's interest against being criminally implicated gives reasonable assurance of the veracity of his statement made against that interest. Moreover, since the conviction of a crime ordinarily entails economic loss, the traditional concept of a \"pecuniary interest\" could logically include one's \"penal interest.\" (Compare the theory that admits a third person's confession of a crime on the ground that the crime was also a tort, thus subjecting the declarant to civil liability for damages, a pecuniary interest. E.g., Weber v Chicago, R I \u0026 P R Co, 175 Iowa 358 [376-377]; [151 NW 852, 864 (1915); L.R.A. 1918A, 926]; McCormick, (supra) , § 255, p 549.) [ People v Spriggs, 60 Cal 2d 868, 874-875; 36 Cal Rptr 841; 389 P2d 377 (1964) (en banc).]\n\nIt is evident that both courts and commentators agreed that the arbitrary limitation of excluding penal interest statements was unfounded in reasoning and unjustified in law. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Conflicting opinions have emerged regarding how MRE 804(b)(3) ought to be applied to inculpatory statements. The lead opinion takes the narrow position that\n\nach factual assertion sought to be admitted under that exception [MRE 804(b)(3)] must be viewed as narrowly and specifically as reasonably possible, and the court must separately ask whether each specific assertion is so intrinsically against the declarant's interest that a reasonable person would not have said it unless it were true. [ Ante, p 646.]\n\nHowever, I believe that the lead opinion's proposal to exclude all collateral statements does not reach a satisfactory Conclusion to the \"inculpatory\" problem of MRE 804(b)(3). The legislative history of the rule, as previously discussed, persuasively illustrates that the drafters did not intend MRE 804(b)(3) to be meaningless in its application with regard to inculpatory statements. Under my colleagues' approach, the only function the rule would have is to permit the introductions of admissions, an element already covered by MRE 801(d)(2). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e This blanket exclusion would deprive the rule of much of its force because a large number of exculpatory statements are collateral.\n\nI believe the inculpatory statements should be admitted under MRE 804(b)(3) if they withstand an examination of the trustworthiness of the statements at the time of their making. This means the proponent would have to show that the statement directly implicates the declarant in the crime. In addition, the proponent of the statement would have to show that the collateral portion is so closely related in time and context to the disserving portion that it is equally trustworthy.\n\nUnder the foregoing principle, Jordan's and Miller's statements were, in my opinion, properly admitted under MRE 804(b)(3) as declarations against their own penal interest. Kerry Jordan admitted being involved in the entire incident. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e He detailed his and the codefendants' involvement in the murder of Johnson and acknowledged his role of firing shots from a machine gun at Desmond Wilbert's vehicle. None of the descriptions of the involvement of others in the events in any way shifted Jordan's responsibility for his actions. Under these facts, I believe that reliability and truthfulness were clearly established.\n\nWalter Miller had also fully implicated himself as an aider and abettor in the plot to kill Wilbert. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Miller did not attempt to shift blame to others, but accurately, and in precise detail, described his role in the events leading to the death of Johnson.\n\nIt can be inferred from both statements that Jordan and Miller directly implicated themselves in the crime. Moreover, their own detailed explanations of their personal involvement necessarily intertwined with the actions of Watkins, Phillips, and Hunter. Since the collateral portions of Jordan's and Miller's statements are so closely related in time and context to the inculpatory portion, I have no difficulty finding the inculpatory portion of the statements equally trustworthy. The statements were declarations against Jordan's and Miller's penal interest admissible under MRE 804(b)(3).\n\nIII\n\nI also recognize that the penal interest exception, as well as all exceptions to the hearsay rule, raise confrontation questions under the Sixth Amendment and art 1, § 20 of the Michigan Constitution. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Indeed, if the Confrontation Clause were read literally, hearsay could never be admitted because a defendant could not confront an accuser.\n\nThe United States Supreme Court has never interpreted the Confrontation Clause absolutely or literally. Mattox v United States, 156 U.S. 237, 243; 15 S Ct 337; 39 L Ed 409 (1895); Maryland v Craig, 497 U.S. 836; 110 S Ct 3157; 111 L Ed 2d 666, 677 (1990); Myatt v Hannigan, 910 F2d 680, 682 (CA 10, 1990). Indeed, the Court recognized that, if applied literally, the clause would abrogate virtually every hearsay exception, a result long rejected as \"unintended and too extreme.\" Ohio v Roberts, 448 U.S. 56, 63; 100 S Ct 2531; 65 L Ed 2d 597 (1980). See also Barker v Morris, 761 F2d 1396, 1399 (CA 9, 1986) (the clause is given a pragmatic, rather than a rigid, literal construction). Rather, the Court has shaped the profile of the confrontation guarantee by balancing the competing interest of hearsay, Chambers v Mississippi, 410 U.S. 284, 295; 93 S Ct 1038; 35 L Ed 2d 297 (1973), with the constitutional protection of confrontation. Mancusi v Stubbs, 408 U.S. 204, 213; 92 S Ct 2308; 33 L Ed 2d 293 (1972); Roberts, supra at 62, 65. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e As a result, the Court has required the prosecution to overcome the presumption of unreliability of a non-testifying declarant by establishing both the \"unavailability\" \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e of the declarant, and that the hearsay evidence bears \"adequate 'indicia of reliability.'\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Id. at 66. Because the hearsay rules and the Confrontation Clause are designed to protect similar values and stem from the same roots, Dutton v Evans, 400 U.S. 74, 86; 91 S Ct 210; 27 L Ed 2d 213 (1970) (plurality), the Court recognized that reliability will be presumed where the \"evidence falls within a firmly rooted hearsay exception.\" Roberts, supra at 66. Otherwise, the prosecution must show that the hearsay evidence bears \"particularized guarantees of trustworthiness.\" Id.\n\nCentral to our analysis of the confrontation implications of the declaration against penal interest hearsay exception is the decision in Lee v Illinois, 476 U.S. 530; 106 S Ct 2056; 90 L Ed 2d 514 (1986). In Lee, the petitioner and her co-defendant were tried jointly in a bench trial at which neither defendant testified. The codefendant, Thomas, had implicated both himself and Lee in the crimes, and the only apparent theory of admissibility of his statements against the defendant was the exception for a declaration against penal interest. The trial Judge expressly relied upon portions of Thomas' unredacted statement in finding Lee guilty of murder.\n\nJustice Brennan, writing for a five-member majority, found the state's grounds for holding that Thomas' statement to be reliable with respect to Lee's culpability did not meet the Confrontation Clause standard of demonstrating substantial indicia of reliability, \"flowing from either the circumstances surrounding the confession . . . to overcome the weighty presumption against the admission of such uncross-examined evidence.\" \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Lee, supra, 476 U.S. 546. The majority focused on two factors in reaching its Conclusion: the affirmative evidence of the codefendant's blameshifting statement, and the circumstances surrounding the making of the accomplice's confession. The majority first observed that the accomplice confessed in response to questions from the police only after he was told that the petitioner had already implicated him and asked him not to let her take the blame alone. 476 U.S. 544. Second, Justice Brennan noted that the accomplice had considered becoming a witness for the state against the petitioner and, therefore, had an added incentive to shift blame. Id. On the basis of these circumstances, the Court concluded that the confession did not bear sufficient indicia of reliability and concluded that the petitioner's Sixth Amendment right of confrontation had been violated.\n\nJustice Blackmun, writing for the Dissent, disagreed with the majority Conclusions with respect to reliability, stating that \"there is little reason to fear that Thomas' statements to the police may have been motivated by a desire to shift blame to petitioner.\" 476 U.S. 553. He concluded that \"in this case the practical unavailability of petitioner's co-defendant as a witness for the State, together with the unusually strong and convincing indications that his statements to the police were reliable, rendered the confession constitutionally admissible against petitioner.\" \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Id. at 557.\n\nThe reliability concerns that were present in the facts of Lee are not present in the instant case. There is no affirmative evidence of blameshifting on either Jordan's or Miller's statements. Jordan and Miller both confessed to participating in the kidnapping of Payne and conspiracy to murder Desmond Wilbert. Moreover, the testimony from the pretrial suppression hearing confirms that Jordan, who confessed within an hour of his arrest, and Miller, who confessed after reading a newspaper article describing the event and the defendants, spoke freely to the police and were not offered leniency in exchange for their statements. Both statements were declarations against penal interest and were properly admitted at trial.\n\nRecently, the United States Supreme Court reaffirmed this approach to evaluating confrontation challenges under the general test set out in Ohio v Roberts, supra. Idaho v Wright, 497 U.S. 805; 110 S Ct 3139; 111 L Ed 2d 638 (1990). In Wright, the Court was asked to consider whether certain statements made by a sexually abused child declarant to an examining pediatrician violated defendant's rights under the Confrontation Clause. In applying the Roberts analysis to the facts of the case, the Court first found that the declarant was unavailable within the meaning of the Confrontation Clause. Id., 111 L Ed 2d 652. The Court then found that the residual hearsay exception, Idaho Rule of Evidence, § 803(24), is not firmly rooted for Confrontation Clause purposes. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The Court then determined whether the state had carried its burden of overcoming the presumption of unreliability by establishing facts that the declarant's statement bore the indicia of reliability through a showing of the \"particularized guarantees of trustworthiness.\"\n\nIn evaluating the state's evidence, the Court held that the declarant's statement was unreliable for Confrontation Clause purposes because the Idaho Supreme Court had relied on corroborating evidence to determine if the child declarant was telling the truth. The Court held that the inquiry into reliability must be drawn from a totality of circumstances that surround the making of the statement alone. Wright, 111 L Ed 2d 655-656.\n\nThe difference between Wright and the instant case rests on the hearsay exception and the foundation required under each one. Idaho v Wright dealt with the miscellaneous hearsay exception where the only foundation was indicia of reliability. The Wright Court said that corroboration cannot support the introduction of the statement. In the instant case, however, the foundation for declarations against penal interest requires much more than indicia of reliability -- it requires unavailability and establishing that the statement is so contrary to the declarant's penal interest that a reasonable person would not have made it unless it were true. While it is unclear as to what extent Idaho v Wright permits inquiry into corroborating evidence, outside the residual hearsay exception, to support a declarant's statement, I am persuaded that even under Wright, it may be appropriate to look at other evidence to determine if the statement is trustworthy.\n\nFor example, in the instant case, Miller made a statement that he was the driver and not the shooter. The question, therefore, becomes was Miller attempting to shift blame or exculpate himself? By examining Bernard Payne's testimony and Kerry Jordan's statement, it is evident that Miller was telling the truth.\n\nThe United States Supreme Court has approved this mode of inquiry in Cruz v New York, 481 U.S. 186; 107 S Ct 1714; 95 L Ed 2d 162 (1987). In Cruz, the majority reasoned that the interlocking nature of a codefendant's confession goes to the \"reliability\" of the statement, not to harmfulness. Id. at 192. The Court concluded that the codefendant's statement \"confirms essentially the same facts as the defendant's own confession [and makes] it . . . more likely to be true.\" Id. Likewise, in the instant case, Jordan's statement confirms the facts in Miller's statement, as does Miller's in Jordan's. This, in my opinion, makes the statements more likely to be true.\n\nI also believe that even without the corroborating evidence, the circumstances surrounding the making of the statement are sufficient for Confrontation Clause purposes.\n\nThe defendants do not dispute that co-defendants Jordan and Miller, who made the statements and refused to testify at trial, were \"unavailable\" within the meaning of MRE 804(a). The inquiry, therefore, is, first, whether the circumstances surrounding the making of Jordan's and Miller's statements exhibit sufficient \"indicia of reliability\" to justify their admission as substantive evidence, and, second, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e if reliability is found, whether the statements bear the \"particular[ ] guarantees of trustworthiness\" that are required by the state to introduce the statements against the codefendants, notwithstanding the fact that they had no opportunity to cross-examine the declarant.\n\nI find factors outlined in United States v Layton, 855 F2d 1388, 1402 (CA 9, 1988), persuasive in testing the trustworthiness and reliability of inculpatory against interest statements. In Layton, the government sought a pretrial ruling to allow it to introduce certain statements, under the declaration against penal interest exception, made by the former Jonestown cult leader, Jim Jones, to his attorney that implicated himself and Layton in the killing of Congressman Leo Ryan. After Layton was convicted, and upon his second appeal, the Court of Appeals explained why the proferred statements satisfied the requirements of FRE 804(b)(3). In doing so, the Layton court outlined a number of factors to consider in determining whether a statement overcomes the presumption of unreliability:\n\n1. Was the statement made voluntarily? [ Barker v Morris, 761 F2d] at 1401; Steele v Taylor, 684 F2d 1193, 1204 (CA 6, 1982), cert den 460 U.S. 1053; 103 S Ct 1502; 75 L Ed 2d 932 (1983);\n\n2. Was the statement made contemporaneously with the occurrence of the events it references? United States v Nick, 604 F2d 1199, 1204 (CA 9, 1979) (per curiam);\n\n3. Did the declarant admit that he committed acts contrary to his penal interest or likely to bring him into disrepute? Barker, 761 F2d at 1401-[14]02;\n\n4. Was the statement corroborated? Id. at 1402; Nick, 604 F2d at 1204; United States v West, 574 F2d 1131, 1135 (CA 4, 1978).\n\n5. Did the declarant have personal knowledge of the matters addressed in the statement? Barker, 761 F2d at 1402;\n\n6. Was the statement uttered spontaneously? Dutton v Evans, 400 U.S. 74, 88-89 . . . ; and\n\n7. Was the person to whom the statement was made someone to whom the declarant would likely speak truthfully? Nick, 604 F2d at 1204. It should be reiterated, however, that \"he reliability factors discussed in other cases 'are not to be considered exhaustive, nor are all factors required to be present in order to admit the declarations.'\" Barker, 761 F2d at 1403 (quoting United States v Fleishman, 684 F2d 1329 [CA 9, 1982], cert den 459 U.S. 1044; 103 S Ct 464; 74 L Ed 2d 614 [1982]). [ Layton, 855 F2d 1405.]\n\nIn applying the Layton factors to the instant case, I believe the reliability requirement of the Confrontation Clause has been met.\n\nBefore trial, Judge Heading conducted a Walker \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e hearing to determine if the statements were voluntarily given or if the police offered leniency in exchange for Jordan's, Miller's, or Watkins' statements. An examination of the circumstances surrounding the taking of the statements by Judge Heading, as reviewed by the Court of Appeals, revealed that Jordan, Miller, and Watkins voluntarily spoke to the police and were not offered \"leniency in exchange\" for their statements. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Furthermore, before the statements were introduced at trial, Judge Talbot conducted another hearing to determine if the circumstances surrounding the taking of the statements violated the codefendant's confrontation rights. In my opinion, the pretrial inquiry, and the in-court hearing, were the keys in determining whether Jordan and Miller were particularly likely to be telling the truth when the statements were made. State v Earnest (On Remand), 106 NM 411, 412; 744 P2d 539 (1987); Steele v Taylor, 684 F2d 1204.\n\nMoreover, I would find that both Jordan and Miller made statements that were so far contrary to their own penal interest that they had to be true. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e This is evident by the fact that they admitted crimes punishable by life sentences. Barker, 761 F2d 1401-1402. Furthermore, both Jordan and Miller demonstrated their personal knowledge of the matters addressed in the statements. This is evident from the accurate detail of the shooting three months after the event occurred, Barker, supra, 761 F2d 1402, and that both confessed their participation in the shooting near or shortly after their arrests. Dutton v Evans, supra, 400 U.S. 88-89. More importantly, there is nothing in the record to support an inference that either Jordan or Miller made the statements implicating the others in an attempt to avenge himself, or to demonstrate that he was motivated by a desire to curry favor with his interrogators, or that the state gave either any reason to believe that it would help if he inculpated others. Lee v Illinois, 476 U.S. 545. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nI agree with the trial court and the Court of Appeals that with respect to all material points, the confessions are consistent and bear the particular guarantees of trustworthiness required by the Sixth Amendment. Both detail the obtaining of the gun from Cliff Harris, the kidnapping of Bernard Payne and his subsequent interrogation, and the events, orchestrated by Hunter, which led to the attempt to murder Wilbert and the killing of Voncie Johnson. Jordan and Miller both placed an Uzi in the hands of Jordan and Phillips, and a .357 magnum in the hands of Watkins.\n\nThe Confrontation Clause reliability and trust-worthiness concerns are dispelled in the instant case because each statement truly meets the foundational requirements for a declaration against penal interest. I have no difficulty concluding \"'that a reasonable in [Jordan's and Miller's] position would not have made the statement unless believed to be true.'\" United States v Vernor, 902 F2d 1182, 1187 (CA 5, 1990).\n\nIn my opinion, the presumption of unreliability has been overcome, and therefore, the defendants' confrontation challenge must fail.\n\nIV\n\nI respectfully disagree with my colleagues' opinion because it requires a trial court to examine each factual assertion \"as narrowly and specifically as reasonably possible,\" and have the trial court separately ask whether \" each specific assertion is so intrinsically against the declarant's interest that a reasonable person would not have said it unless it were true.\" See ante, p 646. The main reason for my disagreement with the rule advocated by the lead opinion is that its premise violates the constitutional holding of Chambers v Mississippi, supra. In Chambers, the trial Judge refused to admit the confession of another person that would have exculpated the defendant. Because the excluded testimony \"bore persuasive assurances of trustworthiness\" and was \"critical to Chambers' defense,\" the United States Supreme Court found a Fourteenth Amendment due process violation and held the exclusionary principle of the hearsay rule \"may not be applied mechanistically to defeat the ends of Justice.\" 410 U.S. 302. As did the Chambers Court, in the instant case I would consider a number of factors bearing upon the question of trustworthiness.\n\nFirst, each of [the declarant's] confessions was made spontaneously to a close acquaintance shortly after the murder had occurred. Second, each one was corroborated by some other evidence in the case . . . . Third, whatever may be the parameters of the penal-interest rationale, each confession here was in a very real sense self-incriminatory and unquestionably against interest. [410 U.S. 300-301.]\n\nThe existence of indicia of reliability led the Court to find a denial of due process in the exclusion of the confessions. It is clear that Chambers neither places a limit upon the admissibility of declarations against penal interest nor establishes the enumerated trustworthiness factors as prerequisites to admissibility for each proffered declaration. Moreover, if one carried the lead opinion's argument to its logical Conclusion, a trial Judge could preclude a statement offered by a defendant which inculpates a co-defendant declarant and exculpates the defendant who seeks its admission. This evidentiary barrier, suggested by my colleagues, clearly violates the Due Process Clause of the Fourteenth Amendment.\n\nThe second reason for my disagreement with the rule advocated by the lead opinion is that the cases cited as supporting their position do not reject the carry-over rule. Rather, these courts have held that inculpatory statements were erroneously admitted because they did not meet one of the factors of trustworthiness. See ante, pp 639-643.\n\nFor example, in United States v Sarmiento-Perez, 633 F2d 1092, 1102 (CA 5, 1981), the court held that a declarant's statement was not sufficiently against his own penal interest and, therefore, admitted in error. Also, in United States v Bailey, 581 F2d 341, 348 (CA 3, 1978), the court ruled that a statement introduced under the residual hearsay exception, rule 804(b)(5), not 804(b)(3) as in this case, lacked the \"'guarantees of trustworthiness'\" required by that rule. In a footnote, the court also held that the trial court properly denied the admission of the statement under FRE 804(b)(3) because the testimony of an FBI agent at trial indicated that the declarant was aware of the possible lenient treatment he could receive if he would implicate his role in a robbery and inculpate the role of the accomplice. The court opined that this fact indicated a lack of reliability in the statement. 581 F2d 346, n 4. Furthermore, in United States v Palumbo, 639 F2d 123, 128 (CA 3, 1981), the court held that a declarant's inculpatory statement in a cocaine case lacked the indicia of reliability required by FRE 804(b)(3). Additionally, in United States v Riley, 657 F2d 1377, 1384 (CA 8, 1981), the court held that although a declarant's statement was against interest, considering the circumstances of the taking of the statement, that the declarant was in police custody and informed that a conviction could jeopardize the custody of her child, the criteria of trustworthiness was not met.\n\nAs can be seen from the foregoing review of the cases relied on by my colleagues, they hold that trustworthiness was lacking in the making of the statements. They do not reject the rule of law I propose today. I believe that the factors of trustworthiness, outlined in Layton and Chambers, support my position that upon evaluation of the facts in the instant case, the defendants' confrontation rights were not violated.\n\nConclusion\n\nI would find that Jordan's and Miller's statements bore sufficient indicia of reliability to overcome the presumption against their admission into evidence. I am not persuaded that the trial court erred in permitting the jury to consider substantively the statements of Jordan and Miller as declarations against penal interest, because the guarantees of trustworthiness required by the Confrontation Clause have been met and, therefore, the defendant's confrontation rights were not violated. I would affirm the decision of the Court of Appeals. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nAPPENDIX A\n\nThe defendants are repeatedly referred to in Jordan's and Miller's statements by the following nicknames:\n\nWendall Henry -\"Farmer\"\n\nDonald Watkins -\"Duck\"\n\nKerry Jordan -\"K-9\"\n\nDesmond Wilbert -\"D\" or \"Des\"\n\nMichael Hunter -\"B\" or \"Bam\"\n\nChristian Phillips -\"Chris\"\n\nWalter Miller -\"Peter-Paul\"\n\nBernard Payne -\"Nard\"\n\nThe jury considered the following confession from Kerry Jordan:\n\nQ. Mr. Jordan, ave I explained your constitutional rights to you?\n\nA. Yes.\n\nQ. Do you understand them?\n\nA. Yes.\n\nQ. Are you willing to give me a statement regarding the fatal shooting of Voncie Johnson which occurred on [8]-26-86 on Cloverlawn?\n\nA. Yes.\n\nQ. Are you giving the statement freely and voluntarily?\n\nA. Yes.\n\nQ. Have I or any officer threatened you or promised you anything?\n\nA. No.\n\nQ. Why are you telling me?\n\nA. Because I'm not going to take the fall alone.\n\nQ. Tell me what happened.\n\nA. A guy, Cliff owed me a pistol. He used to work for me and quit coming around. Duck, another guy who worked for me came over to 9555 Pinehurst and said that Cliff was at home. Then me, Peter-Paul, Chris went in a black ougar and drove over to Cliff's house. Duck and another guy followed us in their car. We got the gun from Cliff and Duck got in the car with us. Duck said, \"I just Nard go to the store, we should get him.\" We parked the car and waited for Nard. Peter-Paul and Chris got out of the car with Duck. They waited by the alley for Nard and brought him back to the car.\n\nQ. Were they armed?\n\nA. Yes, Chris had an Uzi, Duck had the gun we got from Cliff, Peter-Paul didn't have anything.\n\nQ. Okay, continue.\n\nA. When we got him to the car Duck and Chris, no Duck and Peter-Paul got in the back seat with him. They made him bend over and we went back to 9555 Pinehurst. We all went into the basement and they questioned him. They were questioning him about a guy name D. I went outside. Then B came to the house. I told B we got Nard in the basement and we went downstairs. B asked Nard something but I don't remember what. Nard said I'll beep D because he didn't want us to kill him. Duck said come on, let's go beep him. Me, Chris, Peter-Paul, Duck and Nard drove over to the Mendota and Nard beeped D.\n\nQ. Who lives on Mendota?\n\nA. A friend of ours, Mary.\n\nQ. Okay, continue.\n\nA. Chris gave Nard an address off the top of his head on Cloverlawn and Nard gave it to D. B was there with us. After we made the call, me, Chris, Duck, Peter-Paul and Nard went on Cloverlawn. At first we just drove down the street. We D parked near Tireman. He was pulling off and we were behind him. We went back to Mendota and Nard beeped him again. I don't remember if B was there or not. After Nard called, we went back on Cloverlawn, me, Chris, Peter-Paul, Duck and Nard and parked. We gave him another address this time. Me, Chris, Duck and Nard got out of the car. We told Nard to go and stand in front of the address we gave D. We waited about twenty or thirty minutes and decided to leave because it was raining a little bit and D had not showed up. We all got back into the car and started to leave and that's when we saw D. We came around the block and parked on the side street, I think it was Belton; but I'm not sure. Me, Chris and Duck got out. Me and Chris went to one side of the street. Duck was on the other. We were walking towards D. He was on Duck's side of the street coming off the porch. D went to get in his car. That's when the shooting started. D took off in his car. We went back to our car and went back on Pinehurst. Duck and Nard got out and we got out for a while. Then e, Peter-Paul and Chris left.\n\nQ. Was D alone in the car?\n\nA. Now , there was another guy in the car with him.\n\nQ. Did D or the other guy return fire?\n\nA. I don't think so.\n\nQ. What kind of gun did you, Duck and Chris have?\n\nA. Me and Chris had Uzi's, Duck had a .357 mag, the gun we got from Cliff.\n\nQ. Why did you guys want to kill D?\n\nA. Because Nard was working with us, then he quit us and was working for D. It was really Duck who wanted him.\n\nQ. What happened to the guns?\n\nA. I threw mine away on State Fair, near Cameron. I don't know what Chris or Duck did with theirs.\n\nQ. How many shots did you fire?\n\nA. I'd say about ten.\n\nQ. How far away from D were you?\n\nA. About five or ten yards away.\n\nQ. Did B know what was going down?\n\nA. Yes.\n\nQ. What are the names of the following people?\n\n1. K-9? That's me.\n\n2. Duck? I don't know but he stays on Cameron.\n\n3. Chris? I don't know his name either. He stays on Woodingham.\n\n4. B? We call him Bam. I don't know where he stays.\n\n5. Peter-Paul? His first name is Walter. I don't know where he lives.\n\nQ. Have you read your statement?\n\nA. Yes.\n\nQ. Are there any corrections?\n\nA. Yes, when we picked up Nard, Duck stayed in the car, Chris and Peter-Paul got out. Chris had the Uzi, Peter-Paul had the .357.\n\nAPPENDIX B\n\nThe jury considered the following confession from Walter Miller. (See Appendix A as a guide for the nicknames used throughout the statement.)\n\nQ. Mr. Miller, have I explained your Constitutional Rights to you?\n\nA. Yes.\n\nQ. Do you understand them?\n\nA. Yes.\n\nQ. Have I or has any police officer threatened you or promised you anything?\n\nA. No.\n\nQ. Are you willing to give me a statement regarding the fatal shooting of Voncie Johnson which occurred 8-26-86 on Cloverlawn in the City of Detroit?\n\nA. Yes I am.\n\nQ. Are you giving me this statement freely and voluntarily?\n\nA. Yes.\n\nQ. Tell me what happened on that date.\n\nA. A guy named Cliff and some other guy were working for the Farmer, both of them quit working for Farmer about four months before he, Farmer got killed. When they quit working for us they kept a .357 revolver, which was a house gun for the East side house that they ran. On the day the shooting happened, Duck came over to 9555 Pinehurst and said that Cliff wanted to give the gun back to us. B, Michael instructed us to get the gun. Me, Chris Phillips, K-9, Kerry, went in a black ougar, I think it's a 1979, over to Cliff's house. Duck and a guy who I don't know got into a blue car and led the way to Cliff's. When we got to Cliff's he was on the porch, K-9 got the gun from him, then Cliff's mother came out and came up to our car and said hello. Before we left Duck got out the car he was in and got into our car. After we got the gun we left.\n\nQ. Was anyone in the car armed before Cliff gave you the revolver?\n\nA. Yes, K-9 had a Mack-10, Christian Phillips had a Uzi 9mm, I was unarmed, and Duck got the .357 from Cliff; but it wasn't loaded. The rest of the guns were loaded.\n\nQ. Okay, continue.\n\nA. We were just going around the block when Duck spotted a gun who was walking out of a store. Duck said, that's, then he said the guy's name; but I don't remember the name. We turned the corner and pulled over. Chris and me got out of the car and walked to an alley. Chris got behind a garbage dumpster and I was in front of it. The guy who was walking came across the street and started turning into the alley when I stopped him. I said don't move. The guy stopped and said don't kill me. Chris jumped out and was standing behind me. I grabbed the guy and walked him to the car and put him in the back seat with Duck, then I got in the back seat with him.\n\nQ. Were either you or Chris armed?\n\nA. Yes, I had the .357, it was unloaded, Chris had the Uzi.\n\nQ. Okay, continue.\n\nA. When we got the guy into the back seat, I told him to lady down on the floor and he did and we went back to 9555 Pinehurst. When we got there Chris, K-9 and Duck took him into the basement. I went upstairs and took care of a customer. B was not at the house when we first arrived, either Chris or K-9 went down the street, found B and told him what had happened. B then came back to the house with either Chris or K-9 and went into the basement. I was still upstairs with the customer; but when B arrived I went downstairs to see, to see what he had to say. Me, Chris and B were in one part of the basement talking about what happened. We told him about us going over there and getting the gun, and bringing the guy back with us. I went back upstairs with the customer and they all stayed downstairs. I could hear them talking; but I couldn't hear what they were actually saying. Chris, K-9, B and Duck and the other guy left. They were gone for about five minutes and they all came back. They stood at the side of the house and were talking, by that time I was walking the customer to the door, she left and the guys got back into the and left again. About three to five minutes later a guy I know as C came over, I asked him if he knew where the guys were and he told me that they were around the corner. I left 9555 Pinehurst and went over to Mendota where they were. When I got to Mendota I went up on the porch and Chris, K-9, B, Duck and the other guy sat on the porch talking about the guy who had beeped, all I remember is that the guy said he was waiting for someone to call him back.\n\nQ. Okay, continue.\n\nA. We stayed on the porch for about fifteen minutes, and I went back on Pinehurst to check on the house, and then went back to Mendota. Everyone was still on the porch and I joined them. The guy finally called, when he called I was back on Pinehurst checking the house. I went back on Mendota and got the car and went and bought some gas and returned to Pinehurst. Everyone was there, Chris, B, K-9, Duck and the other guy. I parked the car and me, Chris, K-9 and B just started walking down the street and talking. That's when I found out what was going down. B told me to get into the car and drive to Mendota and Westfield with the guy, and wait. I went back to Pinehurst, got the guy, put him in the car and went to where B told me to go. I parked the car and waited for about five to ten minutes. Chris, K-9, and Duck came and got into the car, Chris told me to drive over on Cloverlawn because we were going on a mission and that we were going to meet the guy on Cloverlawn. I drove to Cloverlawn between Belton and Tireman, when we got there the guy who I took out of the Pinehurst house pointed out a little red car and said that's them. They guy was coming off of the porch and was getting into his car, I speeded up to try to catch up with him, but he pulled off. He made a right on Tireman and circled the block. I tried to follow him but lost him. I caught back up with him on the sidestreet off of Tireman, I followed him and stopped on Brighton and Majestic. Chris, K-9 and Duck got out of the car and started to walk up Majestic towards the red car. Duck went into the alley. Chris and K-9 stayed on the sidestreet. By the time they got there the guy was gone. They came back into the car and I tried to follow the guy; but I lost him. We went back on Mendota, Chris, K-9, Duck and the other guy went inside, I drove off and went and made a phone call. I went back to the house on Mendota, and stood on the porch. All of them came out, Chris, K-9, Duck, B and the guy. B was mad. He didn't say anything but by knowing him I could tell he was mad. Chris or K-9 said let's go and I got back in the car with Chris, K-9, Duck and the other guy. Chris told me to go back on Cloverlawn and that they called the guy again and had given him another address. I drove to Cloverlawn and the red car wasn't there. We sat there for about five minutes and pulled off. I drove back to Joy oad, while driving east on Joy oad we spotted the red car going west, by the railroad tracks. I turned on Alpine then right on Tireman, then to Roselawn. When I got to Roselawn and Belton, we saw the red car making a right onto Belton then another right onto Northlawn, heading to Joy oad. I turned left on Belton to Cloverlawn then turned on Cloverlawn I proceeded towards Joy oad. While driving down Cloverlawn I saw the red car on Mackenzie, I made a left on Joy oad, Chris, K-9 and Duck were out of the car by this time. I dropped them off on Cloverlawn by the alley, I went into a lot on Northlawn and Joy Road, turned around then made a left on Joy oad and picked all three of them up at Cloverlawn and Joy oad. Once they got into the car I drove to Roselawn and made a right, going back to Tireman, then another right on Belton. I cruised up to the alley with the lights off and stopped. Chris, K-9 and Duck got out of the car and walked up to Cloverlawn. Before they got out either Chris or K-9 told me to wait and that I was to crash into the red car if they tried to get away. As they were walking away from our car I heard someone say, he turned around. I proceeded up Belton to Northlawn then to Mackenzie, turned and parked on the corner of Cloverlawn and Mackenzie. I saw the red car, it was like in the middle of the block. By the time I parked the shooting started. The red car pulled off, I realized that I wasn't where I was supposed to be and pulled off behind him. The red car made a left on Tireman, I stopped on Cloverlawn and Belton and picked up Chris, K-9 and Duck. We tried to chase the car but he got away. We went back to the house, Wykes, that's where we followed him to earlier, but he wasn't there. Then we went back to Mendota, Chris, K-9, Duck and the other guy got out. I went and made another phone call and then went back to Mendota. Everyone was on the porch, Chris, K-9, Duck, B and the other guy. They took the car and told me to meet them back on Pinehurst. I walked back to Pinehurst, 9555, we all went inside and talked about what happened. Everyone was mad at me and blamed me for missing the guy. B told me you better start learning how to think. The guy who I didn't know said you just signed my death warrant. We also discussed what to do with the guy who I didn't know. B said to let him go. I left and went to my mother's house. Everyone was still on Pinehurst when I left.\n\nQ. What type of weapons did the three guys have who did the shooting?\n\nA. Chris and K-9 had Uzi's, Duck had the .357.\n\nQ. Who loaded the .357?\n\nA. I don't know but before Duck left the car he checked it and said it was loaded.\n\nQ. Did you fire any shots?\n\nA. No I did not.\n\nQ. Do you know the hit was ordered?\n\nA. No I don't.\n\nQ. Who ordered it?\n\nA. B is the boss and he would have had to order the hit or approve of it.\n\nQ. Could you tell many people were in the red car?\n\nA. Two men.\n\nQ. Do you have a nickname?\n\nA. Yes, Peter-Paul.\n\nQ. How many shots were fired?\n\nA. No I don't.\n\nQ. Do you know who the men in the red car were?\n\nA. No I don't.\n\nQ. What relationship between you, Chris, K-9, Duck and B, Michael?\n\nA. Me, Chris and B grew up knowing each other. I met K-9 after I got with the crew and that's also when I met Duck. B was in the narcotics business. He was an underboss enforcer for and body guard for Farmer, he's the guy who got killed on the expressway, Wendell Henry. After he got killed, B kind of took over Farmer's action, he was still working for someone, but I don't know who. Me, Chris, K-9, were the enforcers for B. An enforcer is a person who makes sure everything is going all right, and who straightens things out if there not.\n\nQ. Do you know what happened to the guns that were used?\n\nA. They were kept by the guys who had them.\n\nQ. Have you read the statement?\n\nA. Yes I have.\n\nQ. Are there any additions or corrections you want made?\n\nA. The only other thing is that it was not a planned hit for that day, we were only supposed to get the gun, the rest just happened afterwards.\n\nQ. If a hit would be planned ahead of time, would you be informed of it?\n\nA. No, that would be between B, Chris, and K-9, all I would do is drive, and I wouldn't find out until it was about to happen.\n\n\u003cspan class=\"fn\"\u003e1. The only difference is that the Michigan rule refers to a \"reasonable person\" rather than a \"reasonable man.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A condition for the admissibility of a statement against interest under MRE 804(b)(3) is that the declarant be shown to be unavailable under MRE 804(a). It is undisputed that declarants Jordan and Miller were unavailable in this case because they asserted their Fifth Amendment privilege not to testify. See MRE 804(a)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We thus do not hold, as the Dissent erroneously suggests, see post, pp 689-690, that statements against penal interest are categorically inadmissible to inculpate an accused. We agree that the framers of FRE 804(b)(3), on which our own MRE 804(b)(3) is modeled, forswore such a simplistic approach, which would have rendered all our present Discussion superfluous. As we discuss in n 14, it is indeed possible to envision hypothetical statements in accomplice confessions which would be admissible against an accused under MRE 804(b)(3). In any event, we reject the seemingly result-oriented criticism that we render MRE 804(b)(3) \"meaningless,\" post, p 690, simply because our analysis will make it more difficult for the prosecution to introduce statements in accomplice confessions to inculpate the accused. The only proper inquiry is whether any given statement is indeed -- truly, properly, and specifically analyzed -- a \"statement against interest.\" Whatever results flow from our analysis simply reflect the true and proper scope of MRE 804(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Dissent devotes substantial Discussion to the historical issue regarding whether statements against penal interest should generally enjoy the same presumption of reliability as statements against economic interest. See post, pp 685-689. We are puzzled by this Discussion because we have absolutely no disagreement on this point with the Dissent, nor is this issue even disputed in this case. Our primary disagreement with the Dissent regarding MRE 804(b)(3) concerns the carry-over rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. There is nothing novel or unprecedented in questioning Dean Wigmore's reasoning, sound though it generally is. The United States Supreme Court recently rejected his reasoning on another important point relating to the Sixth Amendment right of confrontation. See Coy v Iowa, 487 U.S. 1012, 1018, n 2; 108 S Ct 2798; 101 L Ed 2d 857 (1988) (criticizing and rejecting Wigmore's view of the relationship between visual confrontation at trial and cross-examination).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This analysis is consistent with that offered nearly half a century ago by Professor Bernard Jefferson. See Jefferson, Declarations against interest: An exception to the hearsay rule, 58 Harv L R 1, 59-63 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is really quite curious that Wigmore overlooks the obvious and basic conflict between the logic of this passage and the carry-over rule suggested in § 1465. The notion that \"the statement may be accepted, not merely as to the specific fact against interest, but also as to every fact contained in the same statement,\" § 1465, p 339 (emphasis in original), is utterly at war with the eminently logical reminder that \"t is because the fact is against interest that the open and deliberate mention of it is likely to be true,\" § 1462, p 337 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. To the same effect is State v Allen, 139 NJ Super 285, 288; 353 A2d 546 (1976), which involved a hearsay statement sought to be introduced as exculpatory evidence by the defendant in a robbery case. In the disputed statement, the declarant admitted his own involvement in the robbery and named three accomplices, conspicuously leaving out the defendant. The court upheld the exclusion of the statement as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe robbery delineated by the evidence was not committed by one felon; it involved three persons. As a consequence, the statement by [the declarant] that he committed the offense does not in itself exculpate defendant Allen. Although that portion of the statement would come within the [statement against interest] hearsay exception . . ., it would not be material on the issue of Allen's guilt. The presence of [the declarant], even if true, would not necessarily exclude the hypothesis of guilt of Allen.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe remainder of the alleged statement referring to three other participants would not be admissible under [ the statement against interest exception ] because [ the declarant's ] reference to the involvement of others is clearly not against his own interest. Similarly, his Discussion relating to [one of the named confederates], his physical description and his involvement in the offense would be pure hearsay beyond the scope of any recognized exception. [ Id. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGiven the greater liberality in admitting exculpatory evidence, see n 9, Allen 's rejection of the carry-over rule even in that context provides especially strong support for rejecting it where, as here, the disputed statement is introduced to inculpate the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Although both MRE 804(b)(3) and its federal counterpart indicate skepticism regarding the trustworthiness of statements against penal interest \"offered to exculpate the accused,\" by requiring in that context that \"corroborating circumstances clearly indicate the trustworthiness of the statement,\" pressures exist to exercise relatively greater liberality in admitting exculpatory evidence, because of the defendant's fundamental due process right (a right of somewhat uncertain contours) to present any reliable exculpatory evidence. See, e.g., Green v Georgia, 442 U.S. 95; 99 S Ct 2150; 60 L Ed 2d 738 (1979); Chambers v Mississippi, 410 U.S. 284; 93 S Ct 1038; 35 L Ed 2d 297 (1973). As we note in n 14, most persuasive authorities favor applying the \"corroborating circumstances\" requirement to any hearsay statements offered to inculpate the accused as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Judge Weinstein is less critical of the carry-over rule in his general Discussion of the statement against interest exception, as applied to the full range of cases including civil litigation. See 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[02], p 804-138 (expressing mild criticism of Professor Jefferson's stringent rejection of the carry-over rule, see n 6, on the ground that \"xperience with our intelligent juries suggests that this view is too pessimistic\"); see also post, p 689, n 17 (the Dissent, citing this passage in Weinstein, while ignoring both its context and Weinstein's rigorous stance against admitting alleged statements against penal interest in the context of hearsay accusations in co-defendant confessions introduced to inculpate the accused). We would disagree with the suggestion that \"here is no reason why, when admitting [a hearsay statement], the court should not explain to the jury the theory upon which this hearsay is being introduced so that it can evaluate more accurately the probative force of the disserving, neutral, and self-serving elements of the statement.\" 4 Weinstein \u0026 Berger, (supra) . This appears to suggest that the court might permit the jury itself to assess whether or not an alleged statement against interest (or portion thereof) is or is not, in fact, \"disserving,\" \"neutral,\" or \"self-serving,\" and then to assess its \"probative force\" in that light. But the fundamental premise of evidence law is that the court alone, not the jury, decides threshold questions of admissibility. See, e.g., MRE 104(a). The jury cannot properly be permitted to \"evaluate . . . the probative force\" of a hearsay statement (or portion thereof) which is, in fact, \"neutral\" or \"self-serving,\" because such a statement does not properly fall within the statement against interest exception in the first place. The jury should not be permitted to \"evaluate\" any hearsay statement under the statement against interest exception until and unless the court has determined that that specific statement is indeed intrinsically against the declarant's interest and therefore admissible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Other cases emphasizing the special duty of courts to carefully scrutinize purported statements against interest contained in accomplice confessions, where offered to inculpate the accused, include Brensic, 70 NY2d 14-16, Standifur v State, 64 Md App 570, 586-587; 497 A2d 1164 (1985), State v Hoak, 107 Idaho 742, 747-748; 692 P2d 1174 (1984), and Sarmiento-Perez, 633 F2d 1101-1104.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Dissent's argument that our analysis of the specific alleged statements against interest in this case is \"unconstitutional\" under Chambers v Mississippi, n 9 (supra) , is without merit. See post, pp 702-703. In the first place, Chambers involved a criminal defendant's constitutional claim to introduce exculpatory hearsay evidence. Thus, the constitutional concern raised in Chambers could not possibly apply to a case, like this one, where the prosecution seeks to introduce inculpatory hearsay evidence. As we have already noted, see ns 8-9, it may well be, because of the very constitutional right enunciated in Chambers, that the relevant analysis would be more liberal with regard to admissibility where exculpatory rather than inculpatory evidence is involved. This would merely reflect our legal system's historic principle that it is better for ten guilty people to go free than for one innocent person to go to jail. We do not preJudge in any way the proper analysis in any hypothetical future case involving a hearsay statement against interest introduced to exculpate the accused.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurthermore, even if our analysis had been applied to Chambers in its full rigor, the result in Chambers would not have been affected. The specific disputed hearsay statements in Chambers, unlike in this case, were not accusatory statements implicating accomplices, but rather were confessional statements directly and inseverably incriminating the declarant. They were also not made while in police custody, but rather were confided to \"close acquaintance shortly after the murder had occurred.\" See Chambers, 410 U.S. 300. Finally, the Dissent ignores the fact that the Court in Chambers placed significant reliance on the fact that the hearsay declarant was actually available for cross-examination at the trial. Id. at 301 and n 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. A \"statement\" for MRE 804(b)(3) purposes obviously cannot be defined in any superficial grammatical sense: for example, as a complete sentence. A single sentence might easily string together many separate (and perhaps completely unrelated) assertions or statements, some of which may be against interest, some neutral, and some blatantly self-serving. Only the first category can properly qualify under MRE 804(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. It is conceivable, of course, that a hypothetical co-defendant confession might contain an accusatory statement which is also intrinsically and inseverably against the confessor's interest, even analyzing the statement narrowly and separately. Cf. Lee v Illinois, 476 U.S. 553, n 6 (Blackmun, J., joined by Burger, C.J., and Powell and Rehnquist, JJ., Dissenting) (arguing that certain inculpatory statements in the co-defendant confession in that case, in contrast to \"the typical confession implicating an accomplice,\" were \"inseverabl\" against the confessor's interest, while conceding that \"n most cases, the inculpation of the accomplice is 'collateral' to the confession, in that the allegations implicating the accomplice are not found in portions of the statement directly adverse to the declarant's penal interest\"). No such statements appear in the confessions at issue in this case, however. Moreover, even where a specific accusatory statement is properly found to be intrinsically and inseverably against the confessor's interest, most persuasive authorities hold that the proponent of the statement must still surmount the additional hurdles of demonstrating that the statement is sufficiently strongly and predominantly against the confessor's interest to dispel the inherently suspect nature of such accusations, demonstrating the absence of custodial circumstances typically rendering such accusations unreliable, and producing corroboration at least as strong as (and perhaps stronger than) that required by FRE 804(b)(3) and MRE 804(b)(3) with regard to statements offered to exculpate the accused. See, e.g., 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[03], pp 804-150 to 804-156; McCormick, Evidence (3d ed), § 279, p 826; Sarmiento-Perez, 633 F2d 1098-1104; Brensic, 70 NY2d 14-16. Again, however, because no statements of this sort are implicated in this case, we need not exhaustively address the standards which should govern their admissibility. A hearsay statement in a co-defendant confession which is not, on its face, specifically and intrinsically against the confessor's interest, is inadmissible under MRE 804(b)(3) without more, and no need exists in that event to inquire further into any possible circumstantial indicia of reliability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Because Jordan's and Miller's confessions, to the extent they do not inculpate or accuse Watkins, Hunter, or Phillips, are simply irrelevant to the guilt of the latter three, the confessions obviously should have been excluded altogether from their trial. It is well established, of course, that a jury cannot reasonably be expected to disregard an inculpatory co-defendant confession simply on the basis of a cautionary instruction. See Bruton v United States, 391 U.S. 123; 88 S Ct 1620; 20 L Ed 2d 476 (1968); Cruz v New York, 481 U.S. 186; 107 S Ct 1714; 95 L Ed 2d 162 (1987). While the Bruton rule was enunciated in the context of constitutional confrontation concerns, it clearly applies with equal force to co-defendant confessions that are inadmissible as a matter of hearsay evidence law. The introduction of inculpatory hearsay statements in co-defendant confessions that do not properly fall within the statement against interest exception will always raise grave constitutional concerns. Thus, Watkins, Hunter, and Phillips should either have been tried separately from Jordan and Miller or the disputed confessions should have been redacted, if feasible, in a manner sufficient to satisfy evidentiary and constitutional concerns. This Court addressed the redaction issue in People v Banks, 438 Mich 408; 475 NW2d 769 (1991). The joint trial problem will not arise on remand in this case, of course, because this Court has denied Jordan's and Miller's applications for leave to appeal from the Court of Appeals affirmance of their convictions, and they, therefore, need not be retried.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. On the same day that Cruz was decided, the Court addressed the efficacy of redacting co-defendant confessions in joint trials to eliminate references to the name or existence of the complaining defendant. See Richardson v Marsh, 481 U.S. 200; 107 S Ct 1702; 95 L Ed 2d 176 (1987). This Court addressed the redaction issue in People v Banks, n 15 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. It is conceded in this case that the co-defendant confessors were not available for confrontation because they chose to exercise their Fifth Amendment rights not to testify at trial. See Douglas v Alabama, supra at 419-420.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Dissent notes that Bruton, which predated the general modern acceptance of statements against penal interest as falling within the statement against interest hearsay exception, observed that \"here is not before us . . . any recognized exception to the hearsay rule insofar as petitioner is concerned and we intimate no view whatever that such exceptions necessarily raise questions under the Confrontation Clause.\" Bruton, 391 U.S. 128, n 3, quoted post, p 683. Far from suggesting that Bruton 's result might now be different in light of the statement-against-penal-interest exception, it is quite evident that this footnote dicta was meant merely to reassure the bench and bar that Bruton 's analysis did not necessarily extend to all hearsay introduced in criminal trials outside the narrow and specific context of co-defendant confessions. In any event, the Dissent's assertion that \"oday we have a hearsay exception that addresses the caveat left open in Bruton,\" post, p 683, incorrectly suggests that the issue arguably left open by the cited footnote in Bruton has remained open to this day. It has not. As discussed in the text, Lee, postdating by a decade the general acceptance of statements against penal interest, squarely addressed the issue and provides clear guidance on it, guidance directly contradicting the reasoning and Conclusion of the Dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Dissent asserts that \"he Lee Court did not hold . . . that an inculpatory statement admitted under the penal interest exception violates the Confrontation Clause,\" post, p 695, n 26. But the Court in Lee, just as in this case, was presented with the argument that the co-defendant confession there at issue was properly admissible in its entirety, as a statement against penal interest. Just as in this case, the co-defendant confession in Lee contained separate and discrete statements, some of which were clearly against interest and some of which were clearly self-serving accusations directed at the codefendant. It would be a gross distortion of Lee 's holding to suggest that Lee ruled the confession inadmissible simply because it concluded that the confession was not, overall, a statement against interest. Rather, as we discuss and explain in the text, Lee rejected, as a theoretical matter, the analytical usefulness of categorizing such accomplice confessions as \"statements against penal interest,\" even though that categorization might be partially accurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eLee did not \"le open the situation that we are addressing today.\" Post, p 695, n 26. The situation presented here is fundamentally similar, for relevant analytical purposes, to that presented in Lee, and is closely and directly governed by Lee 's analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See also, e.g., United States v Layton, 855 F2d 1388, 1406 (CA 9, 1988) (involving a statement \"uttered voluntarily to a trusted advisor\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As the Dissent elsewhere acknowledges, see post, p 696, it is, of course, the burden of the prosecution, as the proponent of the disputed evidence, to disprove and overcome the heavy presumption of unreliability cloaking such hearsay statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Dissent, with the benefit of 20-20 hindsight and advanced legal training, finds this argument \"remarkable.\" Post, p 700, n 31. We can only say that we find it perfectly predictable and unremarkable that a relatively uneducated layperson, under the stress and anxiety of custodial police interrogation, might (albeit mistakenly) think that he might possibly benefit from telling the police what they so clearly want to hear. We doubt that the police in such situations risk losing valuable voluntary confessions by pointing out to such confessors that, in fact, they may have nothing to gain.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Lee referred to the \"desire, motive, or impulse [the confessor] may have had either to mitigate the appearance of his own culpability by spreading the blame or to overstate [the accused's] involvement . . . .\" 476 U.S. 544 (emphasis added). The Court went on to observe that \"[ i ] t is worth noting that the record indicates that [the confessor] not only had a theoretical motive to distort the facts to [the accused's] detriment, but that he also was actively considering the possibility of becoming her adversary . . . .\" Id. (emphasis added). This language clearly indicates that the Court was simply \"noting\" the existence of further evidence that happened to support excluding the hearsay in Lee, not suggesting an evidentiary requirement for exclusion that must be satisfied in every case. It certainly does not suggest that the mere absence of such additional affirmative evidence of unreliability -- in the instant case, the absence of evidence that the police explicitly sought to induce the confessors to inculpate their suspected accomplices -- could overcome the heavy presumption of untrustworthiness. The Court noted that the record in Lee simply \"document\" what it viewed as a general and ever-present \"reality of the criminal process, namely, that once partners in a crime recognize that the \"jig is up,' they tend to lose any identity of interest and immediately become antagonists, rather than accomplices.\" Id. at 544-545.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See, e.g., McCormick, Evidence (3d ed), § 279, p 826 (\"It has been held that the fact of custody alone, with its attendant likelihood of motivation by a desire to curry favor with the authorities, bars a finding that the statement was against interest and requires exclusion\") (emphasis added); Sarmiento-Perez, 633 F2d 1102 (referring to motivation to curry favor, among others, as being among \" circumstances that inhere in the making of virtually every custodial confession \") (emphasis added); Brensic, 70 NY2d 15 (in custodial questioning, \"the declarant is likely to have a 'strong motive to falsify' in order to curry favor, shift blame, receive immunity from prosecution or obtain a favorable plea bargain\") (emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Wright does not conflict with the requirement in FRE 804(b)(3) and MRE 804(b)(3) of corroboration as a necessary condition of admitting a hearsay statement against penal interest where offered to exculpate a criminal defendant, a requirement that most persuasive authorities also apply to such statements where offered to inculpate a defendant. See part II(A), ns 9, 14. Wright simply holds, for Confrontation Clause purposes, that corroborative evidence can never be sufficient, even in part, to support the admission of presumptively unreliable hearsay -- that is, that such evidence cannot weigh dispositively in favor of admission when the other indicia do not already support admission. The corroboration requirement of FRE 804(b)(3) and MRE 804(b)(3) simply imposes, as a matter of evidence law, an additional and necessary condition of admissibility in one narrow context. That is, even where a hearsay statement is shown to be truly against interest and to otherwise bear sufficient inherent indicia of reliability to be admissible, the added requirement of corroboration is imposed in that one narrow context. Thus, even if a given hearsay statement against interest were properly found constitutionally admissible under Lee and Wright, without consideration of corroborative evidence, it might still be found inadmissible under the governing hearsay analysis (whether state or federal) for lack of the necessary corroboration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Both the Court and the Dissenting opinion in Wright were fully aware of the conflict with the Lee and Cruz dicta on this point. See Wright, 111 L Ed 2d 657-658 and n * (opinion of the Court), 662-663 (Kennedy, J., joined by Rehnquist, C.J., and White and Blackmun, JJ., Dissenting). It should be recalled that even in Lee the Court expressed considerable skepticism about the validity of the interlock theory, and, of course, found that it did not support the reliability of the disputed hearsay in that case. See Lee, 476 U.S. 545-546.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Indeed, it is conceivable from the text of Miller's statement that he may not have even realized he was uttering a statement against interest or confessing to criminal acts given a layperson's likely misapprehension of the intricacies of accomplice liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Similarly, it cannot be said, under the Layton factors that these confessions were \"made contemporaneously with the occurrence of the events [which they] reference[ ]\" or that the \"statement uttered spontaneously,\" or that \"the person to whom the statement was made someone to whom the declarant would likely speak truthfully.\" (Post, p 699.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Two Justices concurred in result, but not in reasoning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 178 Mich App 439; 444 NW2d 201 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Watkins' two statements were not introduced at trial because the prosecutor deemed them inconsistent and designed to shift blame. The prosecutor did, however, read the statements into the record for our benefit to demonstrate his discretion in not offering them to the jury for their review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 See appendices A and B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 The Court of Appeals reviewed Jordan's and Miller's claim that the statements were involuntarily given. After independently reviewing the record, the Court of Appeals concluded that the trial court did not err in finding that the statements were voluntarily given. People v Watkins, supra at 447-448.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Desmond Wilbert testified that he did not recognize his assailants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The record does not contain a copy of the redacted statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Defendants Phillips, Jordan, Miller, and Watkins were convicted of first-degree murder, MCL 750.316; MSA 28.548, assault with intent to commit murder, MCL 750.83; MSA 28.278, kidnapping, MCL 750.349; MSA 28.581, and possession of a firearm during the commission of a felony, MCL 750.227b; MSA 28.424(2). Defendant Hunter was also convicted of first-degree murder and assault with intent to commit murder. Phillips, Miller, and Watkins were sentenced to mandatory life on the murder convictions, life imprisonment on the assault convictions, 30-60 years for the kidnapping convictions, and the mandatory two-year term of imprisonment for the felony-firearm sentences. Defendant Jordan was sentenced to natural life for the murder conviction, life for the assault conviction, 25-50 years for kidnapping, plus the mandatory two-year term for possession of a firearm during the commission of a felony. Defendant Hunter was sentenced to life imprisonment for the murder conviction, and to a term of imprisonment of 50-100 years for the assault conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 435 Mich 867 (1990). We, however, denied defendants Jordan's and Miller's applications for leave to appeal. Orders of the Supreme Court, entered July 18, 1990 (Docket Nos. 86852 and 87090).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The lead opinion incorrectly characterizes my statement as an attempt to infer that Bruton has been undercut or overruled by the subsequent \"general acceptance of statements against penal interest . . . .\" See ante, p 653, n 18. In Bruton, the Court assumed the inadmissibility, against the accused, of the implicating confession of his co-defendant and centered upon the effectiveness of a limiting instruction, a question not at issue here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 MRE 804 provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Hearsay exceptions. The following are not excluded by the hearsay rule if the declarant is unavailable as a witness:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) Statement against interest. A statement which was at the time of its making so far contrary to the declarant's pecuniary or proprietary interest, or so far tended to subject him to civil or criminal liability, or to render invalid a claim by him against another, that a reasonable person in his position would not have made the statement unless he believed it to be true. A statement tending to expose the declarant to criminal liability and offered to exculpate the accused is not admissible unless corroborating circumstances clearly indicate the trustworthiness of the statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Although Dean Wigmore's reasoning has not been endorsed by all courts and commentators, the lead opinion's criticism of his reasoning pertaining to the carry-over issue is unfounded. See ante, p 635, n 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Professor Morgan was the Frank C. Rand Professor of Law at Vanderbilt University, the Royal Professor of Law Emeritus and former Acting Dean of Harvard Law School, Reporter for the A.L.I. Code of Evidence, and author of numerous articles on evidence and related subjects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 People v Lettrich, 413 Ill 172; 108 NE2d 488 (1952); Brady v State, 226 Md 422; 174 A2d 167 (1961); Hines v Commonwealth, 136 Va 728; 117 SE 843 (1923).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 People v Spriggs, 60 Cal 2d 868; 36 Cal Rptr 841; 389 P2d 377 (1964); People v Brown, 26 NY2d 88; 308 NYS2d 825; 257 NE2d 16 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 It is noteworthy to mention that before the adoption of the rules of evidence, six states, through judicial opinions, adopted the rule without legislative authorization. Deike v Great Atlantic \u0026 Pacific Tea Co, 3 Ariz App 430, 432-433; 415 P2d 145 (1966); State v Leong, 51 Hawaii 581; 465 P2d 560 (1970); State v Higginbotham, 298 Minn 1, 4-5; 212 NW2d 881 (1973); Sutter v Easterly, 354 Mo 282, 289, 295-296; 189 SW2d 284 (1945); People v Brown, n 15 (supra) ; Howard v Jessup, 519 P2d 913, 917 (Okla, 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 It is not my position that all commentators have disagreed with the argument urged by the Dissent. Professor Bernard Jefferson has written a law review article arguing that Wigmore and the drafters of the Model Rules of Evidence are incorrect in suggesting that a declaration against penal interest involves a truth-telling frame of mind that carries over to statements other than those against interest. Jefferson, Declarations against interest: An exception to the hearsay rule, 58 Harv L R 1, 63 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI find Professor Jefferson's argument, and the lead opinion's reliance on it, unpersuasive. In my opinion, Judge Weinstein correctly concluded that, \"xperience with our intelligent juries suggests that this view is too pessimistic.\" 4 Weinstein \u0026 Berger, Evidence, para. 804(b)(3)[02], p 804-138. Indeed, after a trial Judge examines a statement to determine its reliability and trustworthiness, there is no reason why, when admitting the statement, \"the court should not explain to the jury the theory upon which this hearsay is being introduced so that it can evaluate more accurately the probative force of the disserving, neutral, and self-serving elements of the statement.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 I do not agree with my colleagues' argument that, under their narrow analysis, an inculpatory statement could be admitted under MRE 804(b)(3) if the statement \"is also intrinsically and inseverably against the confessor's interest, even analyzing the statement narrowly and separately.\" Ante, p 649, n 14. My colleagues have not persuasively established a factual, or hypothetical, situation where such a statement could be entered under the rule. The only Conclusion I can draw from their argument is that inculpatory statements could never be admitted under the penal interest exception, a result unintended by the drafters of the rule, which renders MRE 804(b)(3) meaningless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 See appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 See appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 It is evident that since the adoption of the Federal Rules of Evidence, the United States Supreme Court has consistently harmonized the goal of the Confrontation Clause by interpreting it in a manner sensitive to its purposes and sensitive to the necessities of trial and the adversary process. Maryland v Craig, 497 U.S. 836, ; 110 S Ct 3157; 111 L Ed 2d 666, 681 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 Justice Blackmun summarized this point in opining:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court's cases have construed the Confrontation Clause in a pragmatic fashion, requiring \"substantial compliance\" with its purposes, see Ohio v Roberts, 448 U.S. at 69; California v Green, 399 U.S. [149] at 166 [90 S Ct 1930; 26 L Ed 2d 489 (1970)], but acknowledging the need to balance the interests of the accused against the public's \"strong interest in effective law enforcement,\" Roberts, 448 U.S. at 64; see also Mattox v United States, 156 U.S. 237, 243 (1895). [ Lee v Illinois, 476 U.S. 530, 557; 106 S Ct 2056; 90 L Ed 2d 514 (1986).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 \"Unavailability\" is not a prerequisite to the use of hearsay when the states seek to admit a coconspirator's statement made during the progress of the conspiracy. United States v Inadi, 475 U.S. 387, 394; 106 S Ct 1121; 89 L Ed 2d 390 (1986). This is because special characteristics regarding the type of statement constitute evidence which cannot be replicated by in-court testimony at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 In Mancusi v Stubbs, supra, 408 U.S. 213, the Court articulated the indicia-of-reliability standard as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe focus of the Court's concern has been to insure that there \"are indicia of reliability which have been widely viewed as determinative of whether a statement may be placed before the jury though there is no confrontation of the declarant,\" Dutton v Evans [400 U.S. 74, 89; 91 S Ct 210; 27 L Ed 2d 213 (1970)], and to \"afford the trier of fact a satisfactory basis for evaluating the truth of the prior statement,\" California v Green, [n 22] (supra) at 161. It is clear from these statements, and from numerous prior decisions of this Court, that even though the witness be unavailable his prior testimony must bear some of these \"indicia of reliability\" . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 I disagree with my colleagues' Conclusion that the Lee Court envisioned \"a careful and searching analysis of each specific factual assertion contained within any broader statement or confession.\" See ante, p 645 (emphasis in original). See Discussion pp 693-695.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 The Lee Court did not hold, as the lead opinion suggests, that an inculpatory statement admitted under the penal interest exception violates the Confrontation Clause, nor does the opinion suggest that the typical Roberts analysis is inapplicable when an inculpatory statement is introduced under the penal interest exception. See ante, pp 655-656. The majority in Lee declined to accept the invitation to treat this statement as a simple declaration against penal interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe reject respondent's categorization of the hearsay involved in this case as a simple \"declaration against penal interest.\" That concept defines too large a class for meaningful Confrontation Clause analysis. We decide this case as involving a confession by an accomplice which incriminates a criminal defendant. [ Lee, 476 U.S. 544, n 5. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court in Lee left open the situation that we are addressing today. That is, determining whether a statement introduced as a declaration against penal interest of one person, admitted substantively against a co-defendant under circumstances in which the co-defendant had no opportunity to confront and cross-examine the declarant and found reliable by the trial court, violates the Confrontation Clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The Wright Court noted that the residual hearsay exception \"accommodates ad hoc instances in which statements not otherwise falling within a recognized hearsay exception might nevertheless be sufficiently reliable to be admissible at trial.\" 111 L Ed 2d 653.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The United States Supreme Court has not decided whether a declaration against penal interest \"falls within a firmly rooted hearsay exception.\" Wigmore traced the development of the rule and concluded that a declaration against penal interest is firmly rooted in the common-law hearsay exceptions and is presumptively reliable. While the majority in Lee v Illinois did not address this issue, four Justices issued an opinion finding that FRE 804(b)(3) is indeed a firmly rooted exception. Id. at 551-552 (Blackmun, J., joined by Burger, C.J., Powell and Rehnquist, JJ.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. People v Walker (On Rehearing), 374 Mich 331; 132 NW2d 87 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Jordan and Miller gave their statements to police officers while in custody. This, of course, cuts against the reliability concerns of Layton and the trustworthiness guarantees required by Ohio v Roberts, and Lee v Illinois, supra. In my opinion, the presumption of unreliability has been overcome in this case because the trial court found that the statements were voluntarily made and no leniency in exchange for the statement occurred before trial. Moreover, the other factors of reliability which have been established support our Conclusion that the statement bears the guarantees of trustworthiness required by the Confrontation Clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. I find my colleagues' statement that \"common knowledge 'on the street'\" supports their theory that Jordan and Miller believed that substantial benefits would be gained by \"cooperating with the police and 'naming names'\" remarkable. See ante, pp 659-660. Why would a person with \"common knowledge on the street\" confess crimes punishable by life without parole ? What benefit is derived from inculpating co-defendants in a crime, when the confessor will never be able to associate with society again ?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In my opinion, my colleagues have relied more on speculation, rather than on the facts in the record and a proper understanding of Lee v Illinois, in criticizing my Discussion concerning the trustworthiness of Jordan's and Miller's statements. See ante, pp 657-666. There is always room for speculation in a criminal trial. Yet when the facts so overwhelmingly support the Conclusion that the statements bear the guarantees of trustworthiness, as in this case, I can only believe that the inculpatory statements were properly admitted against penal interest under MRE 804(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The result reached by the lead opinion and the Concurring opinion is that this case shall be remanded for a new trial without the use of Jordan's and Miller's statements. Since a majority has not been reached regarding how inculpatory statements can be used in future cases, they leave this issue open for another day.\u003c/span\u003e\n\n",
    "body_length": 163166,
    "citedas": [
      "475 N.W.2d 727",
      "438 Mich. 627"
    ],
    "attorneys": "Frank J. Kelley, Attorney General, Gay Secor Hardy, Solicitor General, John D. O'Hair, Prosecuting Attorney, and Timothy A. Baughman, Chief, Research, Training and Appeals, for the people. Chodak \u0026 Robiner (by Norman R. Robiner) for defendant Watkins. Gerald M. Lorence for defendant Hunter. Daniel J. Rust for defendant Phillips.",
    "category": [
      "36"
    ],
    "judges": "Cavanagh, C.j. Levin, J., concurred with Cavanagh, C.j. Brickley, J. (in Agreement). Griffin, J., concurred with Brickley, J. Riley, J. (minority OPINION(S)ing). Boyle and Mallett, JJ., concurred with Riley, J.",
    "citation_count": 0
  }
}
