{
  "id": "pKFWR2YBTlTomsSB2-c2",
  "document": {
    "title": "People v. Miranda",
    "full_title": "THE PEOPLE AND v. ADAM MIRANDA AND . IN RE ADAM MIRANDA ON HABEAS CORPUS",
    "jurisdiction": "California Supreme Court",
    "date": "1987-11-12T00:00:00.000Z",
    "docket": "Crim. Nos. 22787, 25350",
    "body": "Defendant Adam Miranda was convicted of (count I) first degree murder of Gary Black (Pen. Code, § 187)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with findings that he was armed with a firearm (§ 12022, subd. (a)) and used a firearm (§§ 12022.5, 1203.06, subd. (a)(1)); (count II) assault with intent to commit murder of Kelly Chandler (former § 217) with findings that he was armed with a firearm (§ 12022, subd. (a)), used a firearm (§§ 12022.5, 1203.06, subd. (a)(1)) and inflicted great bodily injury (§ 12022.7); and (count III) first degree burglary (§§ 459, 460) with findings that he was armed with a firearm (§ 12022, subd. (a)), used a firearm (§§ 12022.5, 1203.06, subd. (a)(1)), and inflicted great bodily injury (§ 12022.7). He was acquitted of (count IV) robbery (§ 211). A special circumstance allegation under the 1978 death penalty law was found true: that the murder was committed while defendant was engaged in the attempted commission of a robbery.\n\n(§ 190.2, subd. (a)(17)(i).) The jury additionally made special findings that the killing of Gary Black was wilful, deliberate and premeditated and that the killing occurred as a result of the attempt to commit the crime of robbery. The jury fixed the punishment at death; the appeal is automatic. (Cal. Const., art. VI, § 11; § 1239, subd. (b).)\n\nWe have ordered consolidated with the appeal a petition for habeas corpus in which defendant raises a claim of ineffective assistance of counsel. As explained hereafter, we deny defendant's petition for writ of habeas corpus and affirm the judgment.\n\nI. Guilt Phase\n\nA. Facts\n\n1. Prosecution Case\n\na) Counts I-III\n\nOn September 27, 1980, at approximately 2 a.m., defendant and codefendant Arnold Gonzales entered a 7-Eleven store on Eagle Rock Boulevard in Los Angeles. One of the men asked Christopher Bencomo, the store clerk, if he could buy beer. Bencomo replied that he could not sell beer because it was after 2 a.m. but that they could try at the AM-PM mini-market down the street. Defendant then asked Bencomo, \"If I was to rob you would you give me your money?\" Bencomo replied, \"Sure.\" Defendant then reached to his belt, lifted one side of his sweatshirt, and grabbed a handle of something. Bencomo took a step to the side and said, \"You don't want to do that because there's somebody in the back with a shotgun that will blow your head off.\" Defendant replied, \"thanks for the information,\" and the two men immediately left the store.\n\nSeveral minutes later, defendant and Gonzales entered the AM-PM mini-market located a couple of blocks from the 7-Eleven store. Gary Black and Kelly Chandler were working behind the counter and Donna Navarro was paying for gas. After Navarro went outside to fill her gas tank, one of the men asked Chandler whether he could buy beer. Chandler told him it was too late because it was after 2 a.m. Gonzales then asked to buy a pack of cigarettes and handed Chandler a dollar. As Chandler was giving Gonzales his change, he noticed defendant pointing a gun at him. Defendant stated, \"This is a hold up . . . put all the money in a brown paper bag.\" Black replied, \"Okay.\"\n\nChandler turned and looked at Gary Black. He then saw Gonzales look in the direction of the TV screen. The store had an audio tape system that recorded activities in the market and also displayed a picture of those activities at the scene. A microphone picked up the sound.\n\nImmediately thereafter, there was a gunshot and Chandler started yelling and screaming. Chandler noticed Gary Black was shot and was down. Gonzales then grabbed the back of defendant's shirt and tried to get him to leave the store. Gonzales said, \"Shoot him, shoot him\" as he was turning to leave. Defendant then fired two shots at Chandler and fled from the store. Chandler crawled to the phone, dialed the operator and reported the shooting.\n\nNavarro testified that while putting gas in her car she heard a shot, some screaming and a few more shots. She first observed Gonzales walking out of the store \"kind of fast.\" She then saw defendant following him and putting something in his waistband. Navarro told the police she recognized defendant since she had attended junior high school with him. She was absolutely certain of her identification of defendant.\n\nNo money was taken during the incident. Gary Black died as a result of the shooting. Chandler suffered physical injuries for which he was twice hospitalized and later spent 10 days in a mental hospital as a result of emotional trauma. Chandler testified at trial as an eyewitness to the robbery-murder.\n\nOn October 3, 1980, Police Sergeant Wynn and several other officers went to a bowling alley on Eagle Rock Boulevard for the purpose of arresting defendant for the murder of Gary Black. When the officers informed defendant he was under arrest, defendant denied his identity and stated his name was Jose Diaz. Defendant then tried to strike an officer and started to run. A struggle ensued between that officer and defendant. During the struggle defendant attempted to put his hand in his right front pants pocket.\n\nWhen the officers gained control over defendant, they handcuffed him and took him outside. During a search of his person, an officer removed a handgun from defendant's right front pocket containing five live rounds of ammunition. The officer also found a pocketknife.\n\nDuring a subsequent search at the police station, an unsealed envelope was discovered in defendant's right rear pants pocket. The officers opened the envelope and found a letter, which was written by defendant to his mother and contained incriminating statements.\n\nAfter being informed of his Miranda rights (Miranda v. Arizona (1966) 384 U.S. 436 [16 L.Ed.2d 694, 86 S.Ct. 1602, 10 A.L.R.3d 974]), defendant talked with Officer Kilgore for approximately two and one-half hours. Defendant told the officer he was with his girlfriend the night of the incident at the mini-market. When Officer Kilgore showed defendant the mini-market videotape, defendant \"laughed\" and said \"Is that supposed to be me?\" He said that he had written the letter found by officers to his mother and that it was a \"joke.\"\n\nFollowing the questioning, Officer Kilgore placed defendant in a jail cell adjacent to the cell of Gonzales. Both cells contained hidden microphones for purposes of monitoring and taping the conversations between the two men. These tapes were played for the jury at trial. The prosecution additionally introduced a videotape and soundtrack taken at the time of the mini-market shooting and a videotape of the events which occurred minutes before at the 7-Eleven store.\n\nb) Count IV\n\nPerry McKay, owner of the New York Cafe, testified that on July 24, 1980, at approximately 9 a.m. he was in the storage area of the restaurant when three armed men, one of whom he identified as defendant, appeared at the door. The armed men ordered everyone to lie down on the floor and then forced McKay to open the safe. They took approximately $4,000 from the safe and also took McKay's wallet. McKay testified he recognized defendant the day of the robbery because he had previously seen defendant around the restaurant on numerous occasions. On one occasion McKay discovered defendant in the hallway during closing hours and when he confronted defendant, defendant replied, \"I just want to get cigarettes.\"\n\n2. Defense Case\n\nTestifying in his own defense, defendant gave the following account of the shooting. On the night of September 27, 1980, he had been at the All Star Bowling Alley. A number of people had chipped in to buy a \"few cases of beer.\" He and Gonzales then went to the 7-Eleven store on Eagle Rock Boulevard. When they arrived, defendant asked the clerk, Bencomo, to sell him some beer. Bencomo told him it was too late. Defendant then asked Bencomo if he would sell him some beer if he was a relative. He also asked Bencomo if he would give him money if he was a relative. Bencomo replied, \"Sure.\" Defendant denied posing a hypothetical question concerning a robbery and denied that Bencomo told him there was a person with a shotgun in the store.\n\nAfter leaving the 7-Eleven store, defendant and Gonzales went to the AM-PM mini-market down the street. When they arrived, defendant went to the counter and asked Chandler to sell him some beer. Chandler refused. Defendant asked again, saying he had money and it was only five minutes after two. Chandler again said no and was rude. Gonzales then purchased cigarettes and Chandler gave him change. Defendant repeated his request to buy beer and Chandler again turned him down. Defendant then pulled out a gun and stated, \"Then give me your money.\"\n\nDefendant testified that at this point he was not intending to rob the store and that he did not remember what his intention was, but he \"was just mad\" at Chandler for being rude. Chandler then stepped back, crossed his hands and said, \"shoot me.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Defendant shot him twice.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Out of the corner of his eye defendant saw Gary Black move; he fired a shot at Black. Defendant testified he shot Black because \"he got up too fast.\" Defendant stated, \"I just moved the gun out of instinct toward him . . . when he [Black] up and moved toward my way the gun automatically just moved and it went off. It wasn't no time to point or nothing.\"\n\nDefendant denied he intended to kill either man, rob the store, or use the gun. Defendant had been drinking and smoking some marijuana but was not drunk. Gonzales was pretty high or \"zombie like.\"\n\nDefendant additionally denied any involvement in the New York Cafe robbery which took place on July 24, 1980. He testified that on that date he was in Miami working for a company called International Fleet Lines.\n\nDr. Peter Ladefoged, a professor of phonetics at UCLA, was called as a witness by codefendant Gonzales. Dr. Ladefoged analyzed the mini-market videotape and the sound track which was lifted from the tape. He testified he heard the following: \"This is a holdup, man . . . give me all your money in a bag . . . right now, I'll shoot . . . fast.\" He then heard gunshots. At no time did he hear the words \"shoot him.\"\n\nThe jury found defendant and codefendant Gonzales guilty of first degree murder (§ 187), assault with intent to commit murder (former § 217), and burglary (§ 459). Defendant was found not guilty of the New York Cafe robbery. (§ 211.) The jury additionally made a number of special findings. It found the killing of Gary Black was wilful, deliberate and premeditated and that the killing occurred as a result of the attempt to commit the crime of\n\nrobbery. It also found that codefendant Gonzales was both a conspirator and an aider and abettor of defendant.\n\nB. Guilt Phase Issues\n\n1. Pretrial Motions\n\na) Faretta\n\nOn March 16, 1981, defendant was arraigned in superior court and a private attorney was appointed. At a hearing conducted three weeks later, the following exchange occurred between defendant and the trial judge:\n\n\"Mr. Ingber [defense counsel]: Mr. Miranda has asked me to place him in -- what is that?\n\n\"Defendant Miranda: Pro. per. counsel.\n\n\"The Court: The motion is denied. Perhaps I should inquire why, before I deny it. Why? Why do you want to be pro. per.\n\n\"Defendant Miranda: To assist cocounsel.\n\n\"The Court: You have adequate counsel. I don't think he needs any legal help. Any other reason?\n\n\"Defendant Miranda: That's the reason.\n\n\"Mr. Ingber: I will prepare a more formal one, Your Honor.\n\n\"The Court: We will deny it without prejudice.\"\n\nRelying on Faretta v. State of California (1975) 422 U.S. 806 [45 L.Ed.2d 562, 95 S.Ct. 2525], defendant contends he was denied his constitutional right to act as cocounsel. Defendant's reliance on Faretta, however, is misplaced.\n\nFaretta held only that an accused has the right to present his own defense and did not reach the question of dual representation. (People v. Wheeler (1977) 68 Cal. App. 3d 1056, 1059 [137 Cal. Rptr. 791].) In pre- Faretta cases we held that a \"'defendant is not entitled to have his case presented in court both by himself and by counsel acting at the same time or alternating at defendant's pleasure.'\" (People v. Hill (1969) 70 Cal. 2d 678, 692 [76 Cal. Rptr. 225, 452 P.2d 329], italics omitted; People v. Darling (1962) 58 Cal. 2d 15, 19 [22 Cal. Rptr. 484, 372 P.2d 316]; People v. Mattson (1959) 51 Cal. 2d 777, 789 [336 P.2d 937].) We explained that whether a party who is\n\nrepresented by counsel may participate in the presentation of the case is a matter within the sound discretion of the trial judge. (Hill, supra, at p. 692.) We find nothing in Faretta, supra, 422 U.S. 806, which would require us to alter our earlier rule. (People v. Wheeler, supra, 68 Cal. App. 3d 1056, 1059; People v. Davis (1984) 161 Cal. App. 3d 796, 802, fn. 2 [207 Cal. Rptr. 846]; see People v. McDaniel (1976) 16 Cal. 3d 156, 168, fn. 6 [127 Cal. Rptr. 467, 545 P.2d 843], cert. den. 429 U.S. 847 [50 L.Ed.2d 119, 97 S.Ct. 131].)\n\nAccordingly, defendant did not have an absolute right to act as cocounsel in the instant case. The trial court acted within its discretion in denying defendant's request.\n\nb) Marsden\n\nAt a hearing on September 15, 1981, defendant handed his attorney a one-page document entitled \"Conflict of Interest between Attorney and Client.\" When the trial court asked defendant to explain the conflict, defendant responded, \"He don't know how to do nothing.\" The court inquired whether there was any other conflict. Defendant replied, \"No sir.\" The court then stated, \"If that's your only ground for asking for relief, I'll have to deny it Mr. Miranda. There's no showing on your part that he don't know how to do nothing.\" In response defendant asserted, \"What I want is a lawyer that knows about this kind of case that we're dealing with right here.\" The court assured defendant his attorney knew \"how to handle a [Penal Code section] 187. He's handled numerous of them . . . [ para. ] He's one of the most respected attorneys around here.\"\n\nCiting People v. Marsden (1970) 2 Cal. 3d 118 [84 Cal. Rptr. 156, 465 P.2d 44], defendant maintains the trial court improperly denied his request to substitute counsel by not adequately inquiring into the factual basis of his request. This contention is without merit.\n\n\" [The] decision to allow a substitution of attorney is within the discretion of the trial judge 'unless there is sufficient showing that the defendant's right to the assistance of counsel would be substantially impaired if his present request was denied . . . .'\" (People v. Smith (1985) 38 Cal. 3d 945, 956 [216 Cal. Rptr. 98, 702 P.2d 180] (quoting People v. Carr (1972) 8 Cal. 3d 287, 299 [104 Cal. Rptr. 705, 502 P.2d 513]).) In Marsden, supra, 2 Cal. 3d at page 124, we held it was an abuse of discretion to deny the defendant an opportunity to enumerate specific examples of inadequate representation. We determined the trial court had in fact abused its discretion by refusing to listen to the reasons for which defendant had requested substitution of counsel.\n\nHere, by contrast, the trial court specifically asked defendant to state the reason he believed a conflict existed between defendant and his attorney. Defendant failed to offer any factual or concrete grounds for his dissatisfaction. Instead, defendant's only explanation was that his appointed attorney \". . . don't know how to do nothing.\"\n\nWe think it would have been helpful had the court probed further by asking defendant to be more specific or by inquiring into general areas of dissatisfaction. (See People v. Munoz (1974) 41 Cal. App. 3d 62, 66 [115 Cal. Rptr. 726].) The failure to ask follow-up questions may make it more difficult for a trial court to thoughtfully exercise its discretion in a manner required by Marsden, supra, 2 Cal. 3d 118. Additional questioning may assist the court in assessing the merit or lack thereof of a defendant's motion.\n\nOn the record before us, however, there is nothing to indicate further inquiry would have uncovered specific examples of inadequate representation. It is additionally significant that the trial court granted defendant's subsequent motion for the appointment of second counsel. We conclude the court acted within its discretion in denying defendant's motion to substitute counsel. (See People v. Smith, supra, 38 Cal. 3d at p. 956; People v. Carr, supra, 8 Cal. 3d at p. 299; People v. Salazar (1977) 74 Cal. App. 3d 875, 887 [141 Cal. Rptr. 753].) The Marsden motion was properly denied.\n\nc) Joinder\n\nCodefendant Gonzales moved pretrial to sever the counts relating to the mini-market incident from the counts in which he was not named, including the robbery at the New York Cafe (count IV) and the attempted robbery and assault with a deadly weapon on Raymond Perez (counts V and VI). Gonzales argued joinder would substantially prejudice his case since the jury was likely to infer he was somehow connected to the other crimes.\n\nIn opposing the motion, the prosecutor indicated the charges were consolidated \"in the interest of time.\" He explained that a separate murder charge was pending against defendant and that if they proved the charges in counts IV, V, and VI in the guilt phase, they would not have to prove them again in the penalty phase of the second trial. The trial court denied Gonzales's motion, agreeing with the prosecutor that joinder would save time and result in judicial economy.\n\nAlthough defendant was present at the time Gonzales made the motion to sever, he did not join in the motion. Nor did defendant take any steps during trial to challenge the consolidation of the unrelated counts. He\n\ntherefore has waived any objection and may not now claim that there was a misjoinder resulting in prejudice to him. (People v. Van De Wouwer (1949) 91 Cal. App. 2d 633, 640 [205 P.2d 693]; see People v. Kemp (1961) 55 Cal. 2d 458, 474-475 [11 Cal. Rptr. 361, 359 P.2d 913]; People v. Lyons (1970) 4 Cal. App. 3d 662, 666 [84 Cal. Rptr. 535].)\n\nMoreover, even if defendant had joined in the motion, the denial of the severance motion was not error as to him. \"We must evaluate motions for severance . . . in light of the showings then made and the facts then known. [Citations.]\" (People v. Balderas (1985) 41 Cal. 3d 144, 171 [222 Cal. Rptr. 184, 711 P.2d 480].) There was absolutely no showing of prejudice to defendant at the time the motion was made.\n\nWe believe defendant's failure to make a motion to sever is dispositive of the issue. But, even if defendant had made such a motion and even if the trial court had erroneously denied the motion, any error was clearly harmless.\n\nAs to the attempted robbery and assault offenses (counts V and VI), the prosecutor introduced no evidence related to the charges at trial and ultimately dismissed them at the conclusion of his case-in-chief. It is, therefore, inconceivable that a result more favorable to defendant would have been reached had the trial court initially severed counts V and VI. (People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].) We are unpersuaded by defendant's assertion that substantial prejudice resulted solely from the reading of the charges to the jury prior to voir dire.\n\nNor did defendant suffer any prejudice from joinder of the New York Cafe robbery charge. The fact that the jury ultimately acquitted defendant of the robbery offense demonstrates that the jury was able to view and evaluate the evidence on each charge separately. (See People v. Stewart (1985) 165 Cal. App. 3d 1050, 1056-1057 [212 Cal. Rptr. 90].) Moreover, given the overwhelming evidence to support the jury verdict on the mini-market counts, there was no possibility that the jury relied on the New York Cafe robbery count to support its finding of guilt. We determine therefore it is not reasonably probable that a result more favorable to defendant would have been reached had the robbery count been severed from the case. (People v. Watson, supra, 46 Cal. 2d 818, 836.)\n\n2. Selection of Jury\n\na) Representative Jury\n\nDefendant contends the exclusion of prospective jurors because of their opposition to the death penalty denied him the right to a jury chosen from a\n\nrepresentative cross-section of the community. A majority of this court rejected the contention in People v. Fields (1983) 35 Cal. 3d 329, 342-353 [197 Cal. Rptr. 803, 673 P.2d 680] (plur. opn.), 374 (Kaus, J., conc.). (Accord Lockhart v. McCree (1986) 476 U.S. 162 [90 L.Ed.2d 137, 106 S.Ct. 1758].)\n\nb) Separate Juries\n\nDefendant argues that the trial court's failure to provide separate juries for the guilt and penalty phases violated his due process rights and his right to trial by an impartial jury.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e (U.S. Const., 5th, 6th and 14th Amends.; Cal. Const., art. I, §§ 7, 15 and 16.) In support of this contention, defendant asserts that the process of death qualification, as required by Witherspoon,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e resulted in a jury biased in favor of the prosecution. This contention has previously been rejected by this court in Hovey v. Superior Court (1980) 28 Cal. 3d 1 [168 Cal. Rptr. 128, 616 P.2d 1301]\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and by the United States Supreme Court in Lockhart v. McCree, supra, 476 U.S. at pp. 176-177 [90 L.Ed.2d at pp. 149-150, 106 S.Ct. at pp. 1766-1767].)\n\nc) Peremptory Challenges\n\nAlthough defendant did not exhaust the available peremptory challenges, nor did he raise the issue below, he contends that, in a capital case involving codefendants, each defendant is independently entitled to exercise 26 peremptory challenges.\n\nSection 1070, subdivision (a) provides in pertinent part: \"If the offense charged be punishable with death, or with imprisonment in the state prison for life, the defendant is entitled to 26 and the state to 26 peremptory challenges.\" Section 1070.5, subdivision (a) provides in pertinent part: \"[When] two or more defendants are jointly tried . . . , the state and the defendants shall be entitled to the number of challenges prescribed by Section 1070, which challenges on the part of the defendants must be exercised jointly.\"\n\nThe issue raised here was settled in People v. Lara (1967) 67 Cal. 2d 365 at pages 394-395 [62 Cal. Rptr. 586, 432 P.2d 202], where we stated \"Penal\n\nCode section 1070.5 carefully prescribes the number of and manner of exercising peremptory challenges by joint defendants, and that statute does not violate either defendant's right to trial by an impartial jury or any other constitutional right.\" (See People v. King (1966) 240 Cal. App. 2d 389, 398-402 [49 Cal. Rptr. 562, 21 A.L.R.3d 706].)\n\nDefendant additionally argues that the prosecutor's use of peremptory challenges on all prospective jurors with reservations about the death penalty systematically excluded jurors on the ground of group bias in violation of the California Constitution under People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748]. We have previously rejected this argument in People v. Zimmerman (1984) 36 Cal. 3d 154, 160-161 [202 Cal. Rptr. 826, 680 P.2d 776] and People v. Turner (1984) 37 Cal. 3d 302, 313-315 [208 Cal. Rptr. 196, 690 P.2d 669].\n\n3. Evidentiary Issues\n\na) Letter\n\nDefendant contends the trial court erred in admitting the letter seized at the time he was booked into jail.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e At trial defendant objected to the admission of the letter on the basis of First Amendment privacy principles and Evidence Code section 402. The trial court overruled the objection. In the trial court, defendant repeatedly denied that he was raising a Fourth Amendment issue or that his objection arose in connection with section 1538.5.\n\nOn appeal, defendant does not reassert his First Amendment or relevancy objections. Instead, he now maintains that the letter was the product of an illegal search and as such we should treat his objection as a motion made under section 1538.5. However, a motion to test the validity of a search or seizure must be raised in the superior court to preserve the point for review on appeal. (§ 1538.5, subd. (m); People v. Lilienthal (1978) 22 Cal. 3d 891, 896 [150 Cal. Rptr. 910, 587 P.2d 706]; People v. Low (1983) 148 Cal. App. 3d 89, 92 [196 Cal. Rptr. 18].) A motion made on the wrong ground in the superior court does not preserve the issue. (People v. Lopez (1978) 81 Cal. App. 3d 103, 108 [146 Cal. Rptr. 165].) Moreover, defendant failed to assert his motion prior to trial as required by section 1538.5,\n\nsubdivision (h).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e (People v. Martinez (1975) 14 Cal. 3d 533, 537 [121 Cal. Rptr. 611, 535 P.2d 739]; People v. Label (1974) 43 Cal. App. 3d 766, 772 [119 Cal. Rptr. 522].) Defendant, therefore, cannot now challenge the validity of the search since he failed to preserve the issue either by proper objection at trial or by pretrial motion. (People v. Lopez, supra, at p. 108; see People v. Easley, supra, 34 Cal. 3d at p. 869.)\n\nAlternatively, defendant contends he was denied effective assistance of counsel by counsel's failure to timely move to suppress the letter. This contention is without merit. As explained below, the letter was admissible as the product of a lawful booking search.\n\nPolice officers searched defendant outside the bowling alley shortly after his arrest. When defendant arrived at the police station, he was again pat-searched as part of the booking process. During the booking search, an officer discovered an unsealed envelope inside defendant's right rear pocket. The officer opened the envelope and found the letter written by defendant to his mother.\n\nDefendant claims that inspection of the envelope was an unlawful intrusion into a \"closed container\" (see United States v. Chadwick (1977) 433 U.S. 1 [53 L.Ed.2d 538, 97 S.Ct. 2476]) and exceeded the lawful scope of a booking search (see People v. Laiwa (1983) 34 Cal. 3d 711, 726 [195 Cal. Rptr. 503, 669 P.2d 1278]). He is mistaken. A search of the personal effects of an arrested person at the time of booking is a reasonable search under the California and federal Constitutions. (People v. Ross (1967) 67 Cal. 2d 64, 70 [60 Cal. Rptr. 254, 429 P.2d 606], revd. on other grounds sub nom. Ross v. California (1969) 391 U.S. 470 [20 L.Ed.2d 750, 88 S.Ct. 1850]; Illinois v. Lafayette (1983) 462 U.S. 640 [77 L.Ed.2d 65, 103 S.Ct. 2605].) Although variously stated in our opinions (see, e.g., People v. Maher (1976) 17 Cal. 3d 196, 200-201 [130 Cal. Rptr. 508, 550 P.2d 1044], and cases cited), the purposes of and justifications for such a search are essentially two -- to safeguard and account for the arrestee's belongings and to promote jail security. (People v. Laiwa, supra, at p. 726; see also Illinois v. Lafayette, supra, at p. 646 [77 L.Ed.2d at p. 71].) The permissible scope of a booking search is broad: it may \"involve an item-by-item examination of everything in the arrestee's pockets or otherwise on his person, including looking into his wallet or into containers on the person; it may even extend to a strip search.\" (2 LaFave, Search and Seizure (2d ed. 1987) § 5.3(a),\n\np. 482, fns. omitted; accord, Illinois v. Lafayette, supra, at pp. 646-647 [77 L.Ed.2d at p. 71].) People v. Laiwa, supra, 34 Cal. 3d 711 is not contrary. Rather, in Laiwa we recognized the \"legitimate purposes\" of the booking search (id. at p. 727) and merely determined that a so-called \"accelerated booking search\" does not promote these goals (id. at pp. 726-727).\n\nIn the instant case the removal of the letter from its unsealed envelope took place during an inventory booking search of defendant's possessions. The letter therefore was lawfully seized and its admission into evidence was proper. Consequently, defense counsel's failure to raise the search issue did not prejudice defendant. (People v. Fosselman (1983) 33 Cal. 3d 572, 584 [189 Cal. Rptr. 855, 659 P.2d 1144]; People v. Pope (1979) 23 Cal. 3d 412, 425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1].)\n\nb) 7-Eleven Incident\n\nDefendant contends the trial court erred in admitting testimony and a videotape concerning events which took place at the 7-Eleven store immediately prior to the robbery-murder. Defendant maintains the evidence should have been excluded under Evidence Code section 1101, subdivision (a) as impermissible evidence of an uncharged attempted robbery.\n\nThe challenged evidence disclosed that minutes before the killing, defendant and codefendant Gonzales were at a 7-Eleven store. After being denied the purchase of beer, defendant asked the store clerk, Bencomo, \"if I was to rob you, would you give me your money?\" Defendant then pulled up his shirt and grabbed a handle of some sort. Bencomo warned defendant that there was someone in the back of the store with a shotgun who would \"blow your head off.\" Defendant thanked him for the information. Bencomo also told defendant he might be able to buy beer at the mini-market down the street. Defendant and Gonzales then immediately drove to the mini-market where the shooting occurred.\n\nEvidence of other crimes or prior bad acts is inadmissible solely to prove an accused had the predisposition to commit the charged offense. (Evid. Code, § 1101, subd. (a); People v. Alcala (1984) 36 Cal. 3d 604, 631 [205 Cal. Rptr. 775, 685 P.2d 1126]; People v. Willoughby (1985) 164 Cal. App. 3d 1054, 1062 [210 Cal. Rptr. 880].) However, the evidence may be admitted when it is relevant to prove another issue in the case such as opportunity, intent, knowledge, identity, or absence of mistake. (Evid. Code, § 1101, subd. (b).) Because of its inflammatory impact, evidence relevant on one of these theories should be excluded when it is \"not relevant to an issue expressly in dispute [citation], . . . 'merely cumulative . . .' [citations], or . . . more prejudicial than probative under all the\n\ncircumstances. [Citations.]\" (People v. Alcala, supra, at pp. 631-632. Accord, People v. Thompson (1980) 27 Cal. 3d 303, 314-318 [165 Cal. Rptr. 289, 611 P.2d 883].)\n\nAt trial the prosecutor argued the evidence of the events at the 7-Eleven store was relevant to show codefendant Gonzales's state of mind and degree of participation in the robbery. The trial court agreed and overruled defendant's objections to the evidence. The Attorney General similarly maintains the evidence was properly introduced to establish the \"active, conscious and intentional participation\" of codefendant Gonzales in the robbery murder. He impliedly concedes that the evidence was not admissible against defendant since the evidence was entirely cumulative on the issue of defendant's identity and state of mind.\n\nThe jury, however, was never instructed on the limited admissibility of the evidence. At trial, defendant requested that the court give a limiting instruction in connection with Bencomo's testimony. After lengthy discussion, the trial court agreed that such an instruction was proper. Immediately prior to Bencomo's testimony, the court told the jury that \"the evidence which you are about to receive is offered for a limited purpose, and you will receive further instructions on that at the conclusion of the case.\" However, at the conclusion of the trial, the trial court failed to so instruct the jury.\n\nSince the 7-Eleven evidence was admissible as to only one defendant, the trial court's failure to give a requested limiting instruction constitutes error. (Evid. Code, § 355; see People v. Sweeney (1960) 55 Cal. 2d 27, 42-44 [9 Cal. Rptr. 793, 357 P.2d 1049]; 1 Witkin, Evidence (3d ed. 1986) § 313, pp. 285-286.) Such error, however, is clearly harmless in the instant case. The case against defendant was virtually airtight. Chandler's eyewitness testimony, Navarro's identification testimony, the mini-market videotape and soundtrack, and defendant's own testimony established without a doubt that defendant was guilty of the charged crimes. It is not reasonably probable that in the absence of the 7-Eleven evidence a result more favorable to the defendant would have resulted. (People v. Watson, supra, 46 Cal. 2d at p. 836.)\n\nc) Defendant's Arrest\n\nDefendant additionally contends the testimony of two police officers concerning the circumstances of his arrest constituted inadmissible evidence of an uncharged offense of assaulting a police officer. Defendant acknowledges that he failed to object to this evidence at trial. Nonetheless, he argues that the evidence should have been excluded by the trial court on its own motion\n\nor, in the alternative, that counsel's failure to object constituted ineffective assistance of counsel.\n\nDefendant's actions at the time of his arrest were clearly relevant to show his consciousness of guilt and his knowledge of the magnitude of the crime. (Cf. People v. Dabb (1948) 32 Cal. 2d 491, 500 [197 P.2d 1]; People v. Perry (1972) 7 Cal. 3d 756, 771 [103 Cal. Rptr. 161, 499 P.2d 129].) Hence, the court was not obligated to sua sponte exclude the evidence. Defendant's ineffective assistance claim must also fail since it is not reasonably probable that a determination more favorable to defendant would have resulted had counsel objected to the challenged evidence. (See People v. Fosselman, supra, 33 Cal. 3d 572, 584; People v. Pope, supra, 23 Cal. 3d 412, 425.)\n\nd) The Jail Cell Tapes\n\nFollowing his arrest, defendant was advised of his Miranda (Miranda v. Arizona, supra, 384 U.S. 436) rights and thereafter agreed to speak with Officer Kilgore of the Los Angeles Police Department Homicide Division. During the discussion, defendant denied involvement in the murder of Gary Black. Officer Kilgore had previously spoken with codefendant Gonzales for approximately two hours.\n\nDefendant was then transported to Parker Center jail where, as previously mentioned, Officer Kilgore arranged to have defendant and Gonzales placed in two separate jail cells which contained hidden microphones for the purpose of monitoring and recording conversations. Officer Kilgore testified the purpose of the tape recording was to obtain information helpful for the investigation of the case.\n\nDuring the tape-recorded conversation Gonzales repeatedly warned defendant that the \"rooms are taped.\" Defendant nevertheless discussed the circumstances of his arrest: \"They fuckin tackled me I ran after two of them they fuckin say are you Adam Miranda and I say no, I'm Robert Diaz . . . Everybody was just tripping out on me and I tried to go for my cuete [gun] and shit the mother fucker was all over me hey and when he finally threw me down . . . . He had his knee over my fuckin over the cuete [gun] . . . and I tried to put my hand in there . . .\" Defendant stated that he was about to leave for Mexico but that he \"wouldn't have been safe there . . . because . . . they were waiting for me at the border.\"\n\nDefendant also spoke about the people who informed on him to the police. He stated that he believed \"Laurie\" called the police and then he warned, \"I know I ain't getting outa [jail], but if by any chance I do . . ., I'm coming right back.\"\n\nDefendant additionally told Gonzales that the police had shown him the videotape of the shooting. Defendant stated: \"Shit it showed everything . . . it showed mostly you . . . And you remember that bitch that you say you put in front of you? . . . She came back (laughter) she came back into the store and looked over the counter . . . . Yeah, you can hear, they even have our voices, or they had mine . . . . When I told them this is a hold up. I know and he said fuck you, shoot me. He said it like that you know he said, then you hear them on the fuckin telephone yeah robbery here robbery here, at so and so place, help we've been shot we've been shot (laughter) . . . It sounds funny . . . cause . . . he was talking like he couldn't . . . (laughter) the camera didn't show them at all it was just, it was just you and I, and that lady.\"\n\nDefendant made no objection at the time the tape was played for the jury. However, at the conclusion of the evidentiary portion of the guilt phase, defendant objected to the admission of the tape based on \"First Amendment and Fifth Amendment rights.\" The trial court overruled the objection.\n\nDefendant now contends the trial court erred in permitting the jail cell tape to be introduced into evidence. Defendant claims the tape recording violated his right of privacy, the Fifth Amendment ban against self-incrimination and his Sixth Amendment right to counsel. The People counter that defendant's objection was untimely and therefore cannot be raised on appeal. (See 3 Witkin, Evidence, supra, § 2012, pp. 1971-1972.) We determine that, even assuming defendant had made a timely objection, each of his contentions lacks merit.\n\nFor his privacy argument defendant relies upon De Lancie v. Superior Court (1982) 31 Cal. 3d 865 [183 Cal. Rptr. 866, 647 P.2d 142].\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In Donaldson v. Superior Court, supra, 35 Cal. 3d at page 39, we held De Lancie does not apply to police conduct which took place before the decision was filed. Here the taping occurred on October 4, 1980. Since De Lancie was filed on July 8, 1982, defendant's privacy contention must fail.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nDefendant next argues that prior to being placed in a jail cell near Gonzales's cell he should have been given additional Miranda warnings.\n\nHowever, Miranda was concerned only with custodial police interrogation and therefore does not apply to the instant situation. (People v. Whitt (1984) 36 Cal. 3d 724, 745 [205 Cal. Rptr. 810, 685 P.2d 1161].) Miranda warnings are not required when an accused makes statements to a private citizen, absent evidence of an agency relationship between the citizen and law enforcement officials. (Ibid.) Defendant admits that Gonzales was not in any way acting as an agent for the government.\n\nDefendant lastly contends the taping violated his Sixth Amendment right to counsel. (United States v. Henry (1980) 447 U.S. 264 [65 L.Ed.2d 115, 100 S.Ct. 2183].) Defendant acknowledges that he failed to raise the Sixth Amendment claim below. He maintains, however, that his Fifth and Sixth Amendment rights are \"inextricably intertwined\" and therefore he should not be precluded from raising the issue. Alternatively, defendant argues he was denied the effective assistance of counsel by counsel's failure to preserve the Sixth Amendment claim. We conclude that counsel's failure to articulate the Sixth Amendment basis of his objection did not result in any prejudice. (See People v. Whitt, supra, 36 Cal. 3d 724, 740.) A defendant's right to counsel is not implicated where an accused voluntarily makes statements to a cellmate, who is not acting as a government agent or informant. (Id. at pp. 741-744.)\n\n4. Sufficiency of Evidence\n\nDefendant contends that there was insufficient evidence of premeditation and deliberation to support a verdict of first degree murder.\n\nIn reviewing the sufficiency of the evidence, we must draw all inferences in support of the verdict that can reasonably be deduced and must uphold the judgment if, after viewing all the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the elements of the crime beyond a reasonable doubt. (People v. Johnson (1980) 26 Cal. 3d 557, 576 [162 Cal. Rptr. 431, 606 P.2d 738, 16 A.L.R.4th 1255]; People v. Lunafelix (1985) 168 Cal. App. 3d 97, 100 [214 Cal. Rptr. 33].)\n\nIn People v. Anderson (1968) 70 Cal. 2d 15 [73 Cal. Rptr. 550, 447 P.2d 942], we set forth three categories of evidence which might sustain a finding of premeditated murder: (1) facts about a defendant's behavior before the killing that show prior planning of it; (2) facts about any prior relationship or conduct with the victim from which the jury could infer a motive; and (3) facts about the manner of the killing from which the jury could infer that the defendant intentionally killed the victim according to a preconceived plan.\n\nThe record here shows evidence of premeditation pertaining to each of the three categories. As to the first category, the fact that defendant brought his loaded gun into the store and shortly thereafter used it to kill an unarmed victim reasonably suggests that defendant considered the possibility of murder in advance. Moreover, defendant's warning that Chandler and Black should give him the money or he would shoot implies that defendant contemplated the killing. It has been recognized that premeditation can occur in a very brief period of time. (People v. Velasquez (1980) 26 Cal. 3d 425, 435 [162 Cal. Rptr. 306, 606 P.2d 341].) \"'The true test is not the duration of time as much as it is the extent of the reflection. Thoughts may follow each other with great rapidity and cold, calculated judgment may be arrived at quickly, . . .'\" (Ibid.)\n\nAs to motive, the evidence showed that immediately prior to the killing, Chandler and Black refused to sell beer to defendant. Defendant testified he became angry because he believed the men were being rude to him. Defendant requested to buy beer several more times but each time was refused. The conversation between defendant and his victims suggests that defendant acted with conscious motive and had time to reflect upon his plan to shoot the victims. \"[The] law does not require that a first degree murderer have a 'rational' motive for killing. Anger at the way the victim talked to him . . . may be sufficient.\" (People v. Lunafelix, supra, 168 Cal. App. 3d at p. 102; see People v. Jackson (1981) 121 Cal. App. 3d 862, 873-874.)\n\nThe manner of killing also suggests the shooting was conceived in advance. Defendant shot Black and Chandler, who were unarmed and standing behind the counter a few feet away. The lack of provocation by the victim leads to an inference that an attack was the result of a deliberate plan rather than a \"rash explosion of violence.\" (People v. Lunafelix, supra, 168 Cal. App. 3d at p. 102.)\n\nWe conclude the evidence, viewed in the light most favorable to the prosecution, supports a finding of premeditated and deliberate first degree murder.\n\n5. Instructional Error\n\nDefendant claims the jury was not adequately instructed on diminished capacity. In asserting this argument, defendant acknowledges that the jury was given the general diminished capacity instruction (CALJIC\n\nNo. 3.35)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and the voluntary intoxication instruction\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e (CALJIC No. 4.21). He complains, however, that the trial court did not additionally sua sponte instruct in the language of CALJIC No. 8.77, which specifically applies the general diminished capacity rule to murder and voluntary manslaughter crimes.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e (See People v. Conley (1966) 64 Cal. 2d 310 [49 Cal. Rptr. 815, 411 P.2d 911].)\n\nContrary to defendant's assertions, we believe the given instructions (CALJIC Nos. 3.35, 4.21) adequately informed the jury that evidence of diminished capacity was relevant in determining whether defendant acted with the requisite intent at the time of the shooting. Moreover, even if the\n\njury had not been so instructed, based on the evidence in this case, the trial judge was clearly not obligated to instruct the jury on its own motion.\n\nIt is settled that the trial court is under no duty to sua sponte instruct on the issue of diminished capacity unless substantial evidence is presented at trial raising such a defense. (People v. Turner, supra, 37 Cal. 3d at pp. 325-326; People v. St. Martin (1970) 1 Cal. 3d 524, 531 [83 Cal. Rptr. 166, 463 P.2d 390]; People v. Conley, supra, 64 Cal. 2d at p. 319; People v. Cram (1970) 12 Cal. App. 3d 37, 41 [90 Cal. Rptr. 393].) A defendant's mere consumption of drugs or alcohol prior to the commission of a crime is generally insufficient to warrant an instruction on diminished capacity. (People v. Turner, supra, at pp. 325-327; People v. Carr, supra, 8 Cal. 3d 287 at pp. 294-295; People v. Cram, supra, at p. 44.)\n\nA review of the record reveals that the evidence of defendant's diminished capacity was practically nonexistent. The sole evidence on this issue was defendant's own testimony that he had been \"drinking and smoking some weed\" earlier that evening, but that he was not intoxicated when he entered the mini-market. In response to a question from his attorney, defendant declined to state that his intoxication was the reason for the shooting. He testified that codefendant Gonzales, unlike himself, appeared to be \"under the influence\" during the incident. On this record, we conclude the instructions given to the jury on the issue of diminished capacity were adequate.\n\nC. Special Circumstance Issues\n\n1. Intent to Kill\n\nCiting Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862], defendant contends that the felony-murder special-circumstance finding must be vacated because the court failed to instruct the jury that it could find the allegation true only if it found that defendant acted with intent to kill. In People v. Anderson (1987) 43 Cal. 3d 1104 [240 Cal. Rptr. 585, 742 P.2d 1306] we reconsidered our Carlos decision. We concluded that the court need not instruct on intent to kill as an element of the felony-murder special circumstance unless there is evidence from which the jury could find that the defendant was an accomplice rather than the actual killer. (Id. at pp. 1138-1139.)\n\nHere all the evidence showed that defendant actually killed Gary Black. Moreover, in finding defendant guilty of first degree murder, the jury made a special finding that the killing was wilful, deliberate, and premeditated, which finding necessarily includes a finding of the intent to kill. (People v.\n\nBurgener (1986) 41 Cal. 3d 505, 536-537 [224 Cal. Rptr. 112, 714 P.2d 1251]; People v. Phillips (1985) 41 Cal. 3d 29, 59 [222 Cal. Rptr. 127, 711 P.2d 423].) Failure to instruct on intent was not error.\n\n2. Independent Felonious Purpose\n\nRelying on People v. Green (1980) 27 Cal. 3d 1 [164 Cal. Rptr. 1, 609 P.2d 468], defendant contends the jury was not adequately informed that in order to find the special circumstance to be true, it had to find the murder was committed to advance the commission of the attempted robbery. Defendant's contention is not supported by the record.\n\nIn People v. Green, supra, 27 Cal. 3d at pages 59-62, we set aside a robbery-murder special circumstance because there was no showing that the murder was committed to advance an independent felonious purpose. (See People v. Weidert (1985) 39 Cal. 3d 836, 842 [218 Cal. Rptr. 57, 705 P.2d 380]; People v. Thompson, supra, 27 Cal. 3d at pp. 321-325.) The Attorney General in Green conceded that the robbery was merely incidental to the murder since the sole object of the robbery was to conceal the identity of the murder victim. The jury, however, had been told it could find the special circumstance to be true if the murder took place during the robbery regardless of the relationship between the two crimes.\n\nBy contrast, in the instant case, the jury was expressly instructed that \"to find the special circumstance . . . is true, it must be proved 1. That the murder was committed while the defendant was engaged in the commission of a robbery, and 2. That the murder was committed in order to carry out or advance the commission of the crime of robbery, or to facilitate the escape therefrom or to avoid detection.\" (Italics added.)\n\nDefendant did not request any additional instruction on this point at trial. There is no doubt that the final sentence of the instruction effectively informed the jury that in order to find the special circumstance to be true it had to find the murder was committed in furtherance of the robbery.\n\nMoreover, in Green there was overwhelming evidence that the robbery was merely incidental to the murder. Here, unlike Green, the evidence of the robbery is compelling. Defendant points to several facts suggesting that the killing was not perpetrated pursuant to a robbery, such as the events which transpired at the 7-Eleven store, defendant's anger at Kelly Chandler, defendant's testimony that he did not intend to rob or kill, and the fact that nothing was actually taken at the robbery. However, upon a review of the record, especially the audio portion of the videotape where defendant stated \"this is a holdup, . . . give me all your money in a bag,\" we are\n\nconvinced the crime was nothing more \"than a cold blooded killing in the perpetration of a robbery.\" (People v. Sanders (1983) 145 Cal. App. 3d 218, 223 [193 Cal. Rptr. 331], disapproved on other grounds in People v. Mattson (1984) 37 Cal. 3d 85, 94, fn. 4 [207 Cal. Rptr. 278, 688 P.2d 887].)\n\n3. Section 190.4\n\nDefendant further argues that the special circumstances should be set aside because (1) \"the information was inherently confusing\" concerning the special circumstance crime (see § 190.4) and (2) \"the trial court failed to adequately instruct the jury regarding proof of the special circumstances.\" Both contentions are without merit.\n\nDefendant was charged in count I with murder, count II with assault with intent to commit murder, count III with burglary with intent to commit larceny, and count IV with robbery. Counts I, II and III relate to the mini-market incident and count IV relates to the New York Cafe incident. Although defendant was never separately charged with attempted robbery (at the mini-market), this crime was the basis for the felony-murder charge and the special circumstance allegation that the murder was committed in the course of an attempted robbery.\n\nSection 190.4, subdivision (a) provides in pertinent part: \"Whenever a special circumstance requires proof of the commission or attempted commission of a crime, such crime shall be charged and proved pursuant to the general law applying to the trial and conviction of the crime.\" Defendant maintains the prosecution did not separately charge and prove the separate offense of attempted robbery as required by this code section.\n\nIn People v. Robertson (1982) 33 Cal. 3d 21, 47-48 [188 Cal. Rptr. 77, 655 P.2d 279] and People v. Velasquez, supra, 26 Cal. 3d at page 434, footnote 6, we held that the failure to charge pursuant to section 190.4 does not require per se reversal. We asserted that no prejudice results from the failure to separately charge the underlying felony when the defendant is put on notice that he was required to defend against the underlying crime.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Defendant fully concedes he received adequate notice of the attempted robbery charge by the special circumstance allegation. He argues instead that \"the pleading . . . violated another of the purposes of section 190.4 -- that is to ensure that the jury is properly focused upon the special circumstance crime.\" Defendant cites no authority for this proposition. We find it difficult to understand how the jury here was not \"focused\" on the underlying attempted robbery\n\ncrime. The jury was specifically instructed that to find the special circumstance true it must find the murder was committed during the \"attempted commission of the crime of robbery.\"\n\nDefendant additionally contends that since the attempted robbery was not a separately charged offense, the jury was not properly told of the elements of the crime and therefore the special circumstance must be set aside. We agree that the trial court erred in failing to specifically instruct on the attempted robbery crime. However, there was no prejudice to defendant since the elements of attempted robbery were before the jury under other properly given instructions. (See People v. Sedeno, supra, 10 Cal. 3d at p. 721.) The jury was in fact separately instructed as to the elements of attempt (CALJIC No. 6.00) and robbery (CALJIC No. 9.10). Contrary to defendant's assertions, the fact that the robbery instruction was given in connection with count IV (the New York Cafe incident) is wholly immaterial.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e There is no doubt that the jury understood that the same elements of robbery were applicable to the special circumstance allegation. We therefore determine there was no reversible error.\n\nII. Penalty Phase\n\nA. Facts\n\nAt the penalty phase, the only evidence offered by the prosecution concerned defendant's killing of Robert Hosey approximately two weeks before the murder in the instant case. Joe Saucedo testified as follows: On September 12, 1980, he and Tomas Martinez bought two PCP cigarettes from Hosey. After the purchase, Saucedo and Martinez discovered the cigarettes did not contain PCP. The two men then took Hosey in Martinez's vehicle and drove around looking for the person from whom Hosey had obtained the cigarettes. They were unable to find this individual and drove to Saucedo's residence.\n\nWhen they arrived at Saucedo's house, a number of individuals, including defendant, began arguing with Hosey concerning the \"bunk\" he had sold to Martinez and Saucedo. Saucedo observed a knife in Hosey's back pocket and removed it. Defendant asked for the knife and Saucedo gave it to him. During the argument, someone pushed Hosey down to the ground. Hosey\n\ngot up and began running down the street. Defendant ran after him. Martinez and Saucedo reentered Martinez's car and began chasing Hosey. Shortly thereafter Saucedo got out of the car, ran towards Hosey, and tripped him. At this point defendant \"jumped on top of [Hosey] and started stabbing him.\" Hosey tried to stand up and begged defendant not to kill him. Defendant grabbed Hosey by the hair and continued stabbing him. Saucedo tried to separate the two men, and in the process, Saucedo \"got stabbed in the hand.\" Saucedo returned to his car and found a shirt which he put around his hand to stop the bleeding. Hosey later died as a result of multiple stab wounds to the face and neck.\n\nSaucedo also testified that when they first arrived at his house, several girls, including Patricia Torres, were standing outside. At trial, Patricia Torres did not recall the events of that evening.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e She had made a prior statement, under oath, at the district attorney's office, and portions were read into the record at trial. In the prior statement, Torres had corroborated Saucedo's version of the events. She stated that when Saucedo and Martinez brought the man (later identified as Hosey) to the apartment, she thought Hosey had \"ripped [Martinez] off.\" She noticed that defendant had a knife and was telling Hosey to give back the money. Defendant was holding the knife about two inches away from Hosey's neck. Torres saw someone push Hosey onto the ground. Hosey then ran down the street. Torres noticed defendant and \"two other guys\" following after Hosey. Martinez and Saucedo then got in the car and went down the street. Later in the evening Saucedo returned with his hand wrapped in a blood-soaked shirt.\n\nSaucedo was charged with murder with respect to the death of Hosey. In exchange for his agreement to testify, the charge was reduced to assault with a deadly weapon, and, upon a plea of guilty, he was given probation.\n\nDefendant did not testify nor did he present any mitigating evidence at the penalty phase. At the time, he had been charged but not tried for the Hosey murder.\n\nB. Penalty Phase Issues\n\n1. Witherspoon-Witt Error\n\nDefendant contends that the exclusion of two prospective jurors because of their views on the death penalty was contrary to the standards\n\nestablished in Witherspoon v. Illinois, supra, 391 U.S. 510. (See People v. Velasquez, supra, 26 Cal. 3d at pp. 436-437.) He argues that the jurors failed to make it \"unmistakably clear\" that they \"would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial . . . .\" (Witherspoon, supra, at p. 522, fn. 21 [20 L.Ed.2d at p. 785]; Hovey v. Superior Court, supra, 28 Cal. 3d at pp. 10-11; Velasquez, supra, at p. 436.)\n\nThe United States Supreme Court has recently broadened Witherspoon's requirement that a juror's bias be proved with \"unmistakable\" clarity. (Wainwright v. Witt (1985) 469 U.S. 412, 424 [83 L.Ed.2d 841, 852, 105 S.Ct. 844, 852].) The applicable standard enunciated in Witt \"is whether the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" (Ibid. [83 L.Ed.2d at pp. 851-852]) The court explained \"determinations of juror bias cannot be reduced to question-and-answer sessions which obtain results in the manner of a catechism.\" (Ibid.) Under Witt, therefore, our duty is to \"examine the context surrounding [the juror's] exclusion to determine whether the trial court's decision that [the juror's] beliefs would 'substantially impair the performance of his duties . . .' was fairly supported by the record.\" (Darden v. Wainwright (1986) 477 U.S. 168, 176 [91 L.Ed.2d 144, 154, 106 S.Ct. 2464, 2469].) In People v. Ghent (1987) 43 Cal. 3d 739, 767 [239 Cal. Rptr. 82, 739 P.2d 1250], we adopted the Witt standard. Here, however, we conclude that applying either the Witt or the stricter Witherspoon standards, the two jurors were properly excused for cause.\n\nDefendant first challenges the exclusion of prospective juror Pauline Bia. During the individual voir dire, Bia responded to a question by stating, \"I don't think I can vote for the death penalty.\" Later, the following colloquy occurred between the court and Bia:\n\n\"The Court: And my inquiry of you is whether you have such a conscientious opinion concerning the death penalty that it would not matter what the evidence was, that under no circumstances could you vote for the death penalty?\n\n\"Ms. Bia: No.\n\n\"The Court: No what?\n\n\"Ms. Bia: I don't think I can vote for the death penalty.\n\n\"The Court: The key word is automatically, and that is, would you automatically and absolutely refuse to vote for such a penalty ?\n\n\"Ms. Bia: Yes.\n\n\"The Court: Regardless of the evidence?\n\n\"Ms. Bia: Yes, I will refuse.\n\n\"The Court: [You] would automatically vote for life imprisonment without the possibility of parole and never vote for a verdict of death?\n\n\"Ms. Bia: Never vote for a verdict of death.\"\n\nThere was no ambiguity here. Even applying the stricter Witherspoon standard, Bia was properly excused for cause. While Bia did appear confused by some of the court's earlier inquiries, her answers to the later questions made her absolute opposition to voting for the death penalty \"unmistakably clear.\" Prospective juror Bia left no doubt that she would automatically vote against the imposition of the death penalty regardless of the evidence.\n\nDefendant next challenges the exclusion of prospective juror Robert Manley. At the beginning of his individual voir dire on the death penalty, Manley volunteered that: \"I have difficult problems with the capital punishment question, and at this point I don't think I could really be an unbiased or -- I am opposed to it. I will put it that way.\" The trial court then reviewed the allegations and charges in the case and asked whether he would refuse to vote for \"murder in the first degree . . . knowing that to do so would obligate the jury to get into a . . . penalty phase of the trial?\" Manley replied, \"I would have a very difficult time of it, Your Honor, I would have a very difficult time.\" The trial court then asked Manley whether he \"would . . . refuse to vote for the truthfulness of the special circumstances . . . knowing that to do so would obligate the jury to get into the penalty phase?\" Manley replied, \" Yes, Ma'am.\" The court questioned Manley as to whether he \"would automatically and absolutely refuse to vote for such a penalty in any case?\" Manley answered, \"I probably would. I probably would have to.\" When the court repeated the question, Manley replied, \"Yes Ma'am, I think I would.\" No further questions were asked of Manley prior to his excusal.\n\nAlthough he may have responded equivocally to some of the court's questions, Manley made it absolutely clear that his \"attitude toward the death penalty would prevent [him] from making an impartial decision as to the defendant's guilt.\" (Witherspoon, supra, 391 U.S. at pp. 522-523, fn. 21 [20 L.Ed.2d at p. 785], italics omitted.) Under Witherspoon, therefore, excusal was proper. Moreover, the trial court was in the best position to observe and evaluate Manley's demeanor firsthand and could have reasonably\n\nunderstood the prospective juror's responses to indicate he would never vote for the death penalty. (See Witt, supra, 469 U.S. at pp. 426-429 [83 L.Ed.2d at pp. 852-856, 105 S.Ct. at pp. 852-853]; Darden, supra, 477 U.S. at p. 178 [91 L.Ed.2d at pp. 154-155, 106 S.Ct. at p. 2470].) We are convinced that Manley would have been unable to perform his duties as required by law and therefore was properly excused for cause. (Witt, supra; Witherspoon, supra.)\n\nDefendant additionally contends that the trial court committed reversible error by failing to sua sponte inform potential jurors that it was their civic duty to sit as jurors if they could subordinate their views and obey the laws of this state. (Witherspoon, supra, 391 U.S. 510; Witt, supra, 469 U.S. 412.) We find nothing in Witherspoon which obligates a trial court to so instruct the jury. Moreover, the proposed instruction is unnecessary. A prospective juror who would refuse to vote for the death penalty under all circumstances is obviously unable or unwilling to set aside individual views concerning capital punishment.\n\n2. Pretrial Notice of Evidence to Be Introduced in the Penalty Phase\n\nDefendant maintains the prosecution violated the section 190.3 notice requirement and therefore the trial court erred in permitting evidence in aggravation to be introduced at the penalty trial. We disagree.\n\nSection 190.3 provides, in pertinent part: \"Except for evidence in proof of the offense or special circumstances which subject a defendant to the death penalty, no evidence may be presented by the prosecution in aggravation unless notice of the evidence to be introduced has been given to the defendant within a reasonable period of time as determined by the court, prior to trial.\" The purpose of the statutory notice is to advise an accused of the evidence against him so that he may have a reasonable opportunity to prepare a defense at the penalty trial. (See Keenan v. Superior Court (1981) 126 Cal. App. 3d 576, 587 [177 Cal. Rptr. 841].)\n\nIn the instant case defendant moved prior to the penalty trial to preclude the evidence in aggravation on the sole ground that the district attorney \"failed to [present] in writing. . . notice of the specific areas of aggravation which would be presented at the penalty phase.\" (Italics added.) At the hearing on the motion, defense counsel admitted that, prior to the guilt trial, the prosecutor had informed him Saucedo and Torres would be testifying at any penalty trial. He further acknowledged that he also represented defendant on the Hosey murder charge, implying that he was familiar with\n\nthe incident which would serve as the basis for the aggravating evidence presented at the penalty trial.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn our view the district attorney adequately fulfilled the statutory notice requirements. Although written notice is preferable and should be the norm, nowhere does the statute mandate that the notice be in writing. Defendant had full knowledge, prior to the start of the guilt trial, of the aggravating evidence to be introduced at a potential penalty trial. The evidence therefore was properly admitted.\n\n3. Other-crimes Evidence\n\na) Admissibility of Evidence\n\nDefendant attacks the constitutionality of section 190.3, subdivision (b), which permits the jury to consider evidence of unadjudicated criminal activity as an aggravating factor, citing State v. Bartholomew (1984) 101 Wn.2d 631 [683 P.2d 1079] and State v. McCormick (1979) 272 Ind. 272 [397 N.E.2d 276]. A majority of this court rejected an identical contention in People v. Balderas (1985) 41 Cal. 3d 144, 204-205 [222 Cal. Rptr. 184, 711 P.2d 480].\n\nb) Robertson Error\n\nDefendant correctly contends that the trial court erred in failing to instruct the jury that it could not consider the Hosey murder as an aggravating factor unless it found beyond a reasonable doubt that defendant committed the crime. (People v. Robertson, supra, 33 Cal. 3d at pp. 53-54.) We determine, however, that the error was harmless.\n\nPrior to Robertson, we held, in a long line of cases, that during the penalty phase the jury must be instructed that it \"may consider evidence of other crimes only when the commission of such other crimes is proved beyond a reasonable doubt.\" (People v. Stansworth (1969) 71 Cal. 2d 820, 840 [80 Cal. Rptr. 49, 457 P.2d 889]. See, e.g., People v. McClellan (1969) 71 Cal. 2d 793, 805 [80 Cal. Rptr. 31, 457 P.2d 871]; People v. Varnum (1969) 70 Cal. 2d 480, 485-486 [75 Cal. Rptr. 161, 450 P.2d 553]; People v. Polk (1965) 63 Cal. 2d 443, 450-451 [47 Cal. Rptr. 1, 406 P.2d 641]; People v. Terry (1964) 61 Cal. 2d 137, 149, fn. 8 [37 Cal. Rptr. 605, 390 P.2d 381].) In Robertson, supra, 33 Cal. 3d 21 we interpreted the 1977 death penalty\n\nstatute to include the requirement that the trial judge instruct on the higher standard of proof for other-crimes evidence. It was implicit in our decision that the rule is an evidentiary one and is not constitutionally mandated. The Robertson rule merely serves a foundational purpose requiring a higher standard of proof before evidence of other crimes may be considered by a jury, since such evidence is often of \"overriding importance . . . to the jury's life-or-death determination . . . .\" (Robertson, supra, 33 Cal. 3d at p. 54.)\n\nIn Robertson the \"other crimes\" evidence consisted of a rape victim's unsubstantiated testimony during the guilt phase that (1) more than a year before the charged offenses defendant committed numerous violent crimes against her, in addition to the rape for which he was convicted, and (2) defendant told her he had previously killed two other people. In a plurality opinion we determined that failure to instruct on the higher standard of proof was prejudicial. (33 Cal. 3d at pp. 54-55, 63 (Broussard, J., conc.).) We indicated \"[the] danger of prejudice was . . . most pronounced with respect to defendant's alleged confession . . . -- a confession which, but for counsel's inexplicable failure to object, never should have been before the jury.\" (Id. at p. 54.)\n\nHere, by contrast, there was ample evidence, properly admitted, establishing that defendant had killed Hosey. Saucedo testified in great detail as to defendant's conduct in the stabbing of Hosey. While Patricia Torres did not witness the actual killing, her statements to the district attorney corroborated much of Saucedo's testimony. Torres stated, for example, that it was defendant who held the knife during the argument.\n\nDuring cross-examination of Saucedo, defendant attempted to discredit Saucedo's testimony and suggested by his questioning that Saucedo was in fact responsible for Hosey's death. Nonetheless, defendant's participation in the stabbing of Hosey was not substantially controverted in the penalty phase. Defendant did not present any independent evidence to dispute Saucedo's testimony that defendant repeatedly stabbed Hosey. Neither did defendant challenge the fact of his presence at the time of the killing. On this record, we conclude that the failure to instruct on the higher standard of proof could not have affected the jury's consideration of the other crimes evidence.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nc) Unanimous Agreement\n\nIn a related argument, defendant urges us to adopt the rule that the jury must be instructed not to consider evidence of \"other crimes\" unless it unanimously agreed that the prosecution met its burden of proof on such crimes. In so asserting, defendant misunderstands the penalty determination process. Section 190.3 provides that a jury may consider a number of factors in determining the appropriate penalty. To impose a penalty of death, each juror must evaluate the evidence and then unanimously determine that the aggravating factors outweigh the mitigating factors. There is no requirement that the jury agree on which factors were used to reach the decision. It is therefore unnecessary that the entire jury find the prosecutor met his burden of proof on the \"other crimes\" evidence before a single juror may consider this evidence.\n\nMoreover, as we previously indicated, the Robertson rule is statutorily based and serves a foundational purpose. Generally, unanimous agreement is not required on a foundational matter. Instead, jury unanimity is mandated only on a final verdict or special finding. A defendant is, of course, entitled to a unanimous jury verdict in the final determination as to penalty. The jury here was so instructed. (See People v. Ghent, supra, 43 Cal. 3d at p. 739.)\n\nWe also reject defendant's contention that the trial court erred in failing to instruct sua sponte on the elements of murder applicable to the Hosey stabbing. We recently held that a trial court has no duty to instruct on the elements of the other crimes introduced at the penalty phase unless it is requested to do so by the defendant. (People v. Phillips, supra, 41 Cal. 3d at p. 72, fn. 25; People v. Davenport (1985) 41 Cal. 3d 247, 281-282 [221 Cal. Rptr. 794, 710 P.2d 861].) Defendant made no such request.\n\nd) Accomplice Instruction\n\nIn view of Saucedo's testimony, defendant contends the trial court erred by refusing to give a requested accomplice instruction pursuant to section 1111. Section 1111 provides that \"[a] conviction cannot be had upon the testimony of an accomplice unless it be corroborated by such other evidence as shall tend to connect the defendant with the commission of the offense; and the corroboration is not sufficient if it merely shows the commission of the offense or the circumstances thereof.\" The section defines an accomplice as \"one who is liable to prosecution for the identical offense charged against the defendant on trial in the cause in which the testimony of the accomplice is given.\"\n\nThe Attorney General acknowledges that the rule requiring corroboration of accomplice testimony applies at the penalty phase of a capital trial. (People v. Varnum (1967) 66 Cal. 2d 808, 814-815; People v. McClellan, supra, 71 Cal. 2d pp. 807-808; People v. Washington (1969) 71 Cal. 2d 1061, 1092 [80 Cal. Rptr. 567, 458 P.2d 479].) He contends, however, there was no error since Saucedo was not an accomplice as a matter of law. (People v. Mayberry (1975) 15 Cal. 3d 143, 159 [125 Cal. Rptr. 745, 542 P.2d 1337].) He alternatively asserts that if there was error, it was not prejudicial. Since we conclude that any error was harmless, we need not consider the question of whether Saucedo was an accomplice. (See People v. Hathcock (1973) 8 Cal. 3d 599, 617, fn. 17 [105 Cal. Rptr. 540, 504 P.2d 476].)\n\nIt has been recognized that the failure to instruct on accomplice testimony pursuant to section 1111 is harmless where there is sufficient corroborating evidence in the record. (People v. Hathcock, supra, 8 Cal. 3d at p. 617; People v. Washington, supra, 71 Cal. 2d at pp. 1092-1093.) The requisite corroboration may be established entirely by circumstantial evidence. (People v. Thurman (1972) 28 Cal. App. 3d 725, 730 [104 Cal. Rptr. 804]; People v. Mardian (1975) 47 Cal. App. 3d 16, 43 [121 Cal. Rptr. 269].) Such evidence \"may be slight and entitled to little consideration when standing alone.' [Citations.]\" (People v. Tewskbury (1976) 15 Cal. 3d 953, 969 [127 Cal. Rptr. 135, 544 P.2d 1335]; accord People v. Hathcock, supra, at p. 617.) Moreover, \"'only a portion . . . of the accomplice's testimony need be corroborated'\" (People v. Thurman, supra, at p. 729) and it is \"'not necessary that the corroborative evidence . . . establish every element of the offense charged.' [Citations.]\" (People v. Hathcock, supra, at p. 617.) It is only required that the evidence \"'\"tends to connect the defendant with the commission of the crime in such a way as may reasonably satisfy the jury that the [accomplice] is telling the truth.\"'\" (People v. Thurman, supra, at p. 729.)\n\nApplying the foregoing principles, we are satisfied that Patricia Torres's statement to the district attorney provided sufficient corroboration of Saucedo's testimony. As previously discussed, Torres's description of the events which led to the stabbing closely matched Saucedo's version of the incident. This evidence was enough to connect defendant with the killing and therefore to support the credibility of Saucedo. (Compare People v. Washington, supra, 71 Cal. 2d at pp. 1091-1093 with People v. McClellan, supra, 71 Cal. 2d at pp. 806-808.) The fact that Torres did not personally witness the stabbing is irrelevant since it has been held that eyewitness corroboration is unnecessary. (See, e.g., People v. Washington, supra, at p. 1093; People v. Thurman, supra, 28 Cal. App. 3d at pp. 728-729; People v. Mardian, supra, 47 Cal. App. 3d at pp. 43-44.)\n\nMoreover, even if there were insufficient corroboration, reversal is not required unless it is reasonably probable a result more favorable to the defendant would have been reached. (People v. Mayberry, supra, 15 Cal. 3d at p. 159.) The purpose of an instruction pursuant to section 1111 is to compel the jury to view accomplice testimony with distrust and suspicion. (People v. Tewksbury, supra, 15 Cal. 3d at p. 967.) Here, the jury had before it ample information suggesting that Saucedo's testimony may not have been completely trustworthy. For example, Saucedo testified that he earlier lied about his own involvement in the killing of Hosey and that he was given a reduced sentence with no additional jail time in exchange for his testimony. Upon a review of the entire record, we are convinced that it was harmless error to fail to instruct the jury on the requirement that accomplice testimony be corroborated.\n\n4. Jury Instructions\n\na) Instructions on Mitigation, Discretion and Sympathy\n\nAt the penalty phase the trial court instructed the jury in the former version of CALJIC No. 8.84.1 without clarifying that subdivision (k) of section 190.3 permits the jury to consider any aspect of the defendant's character or record as mitigating evidence (see People v. Easley, supra, 34 Cal. 3d 858, 878, fn. 10) and instructed it pursuant to former CALJIC No. 8.84.2 that it \"shall\" impose a sentence of death if it should find that the aggravating factors outweighed the mitigating circumstances, without clarifying the scope of its discretion pursuant to People v. Brown (1985) 40 Cal. 3d 512, 544, fn. 17 [230 Cal. Rptr. 834, 726 P.2d 516], reversed on other grounds sub nom. California v. Brown, supra, 479 U.S. 538 [93 L.Ed.2d 934]. Defendant claims the failure to give the Easley and Brown clarifying instructions constitutes reversible error. He additionally contends that the trial court was under a sua sponte duty to instruct the jury that it could consider sympathy in determining the penalty verdict. He argues that without such an instruction, the jury may have erroneously believed that CALJIC No. 1.00,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e which was given at the guilt phase, applied to the penalty phase. We disagree.\n\n(1) No-sympathy Instruction\n\nIn People v. Easley, supra, 34 Cal. 3d 858, we held that it was federal constitutional error to give an antisympathy instruction at the penalty phase of a capital trial. (34 Cal. 3d at p. 876.)\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Here no such instruction was given. Neither the trial court nor the prosecution told the jury that it could not consider sympathy. Nor is there any indication that the jury was misled into applying the antisympathy guilt phase instruction at the penalty phase. (Cf. People v. Rodriguez (1986) 42 Cal. 3d 730, 784-786 [230 Cal. Rptr. 667, 726 P.2d 113].) We conclude that the trial court did not err in failing affirmatively to instruct the jury at the penalty phase that it could consider sympathy.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n(2) Mitigating Evidence\n\nIn Easley, supra, 34 Cal. 3d 858, we also discussed the constitutional requirement that a jury be permitted to consider any mitigating evidence proffered by the defendant when it determines whether death is the appropriate penalty. (See Eddings v. Oklahoma (1982) 455 U.S. 104 [71 L.Ed.2d 1, 102 S.Ct. 869]; Lockett v. Ohio (1978) 438 U.S. 586 [57 L.Ed.2d 973, 98 S.Ct. 2954].) We observed that a jury could erroneously interpret the words of section 190.3, subdivision (k) to require consideration of only that mitigating evidence which relates to the crime itself. We therefore imposed the prospective requirement that \"trial courts . . . inform the jury that it may consider as a mitigating factor 'any other circumstance which extenuates the gravity of the crime . . .' and any other 'aspect of [the] defendant's character or record . . . that the defendant proffers as a basis for a sentence less than death.' [Citation.]\" (Easley, supra, 34 Cal. 3d at p. 878, fn. 10.)\n\nIn People v. Brown, supra, 40 Cal. 3d 512, we reaffirmed the importance of an Easley clarifying instruction in order to inform the jury that it may reject death on the basis of any relevant evidence or observation. We stated, however, that the failure of trial courts prior to Easley to give the clarifying instruction does not necessarily invalidate a death penalty verdict. Rather, we explained we would review each prior case \"on its own merits to determine\n\nwhether, in context, the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" (Id., at p. 544, fn. 17.)\n\nIt seems clear that our Brown standard, supra, comports with federal law. As we recently stated in People v. Ghent, supra, 43 Cal. 3d 739, a majority of the justices of the United States Supreme Court, upon reviewing that portion of Brown relating to the penalty phase antisympathy instruction, \"stressed the necessity of reviewing the record in each case to determine whether the jury instructions, taken as a whole, and read in conjunction with the prosecutor's arguments, adequately informed the jury of its responsibility to consider all of the mitigating evidence in the case.\" (43 Cal. 3d at p. 777, citing California v. Brown, supra, 479 U.S. 538, 546 [93 L.Ed.2d 934, 943, 107 S.Ct. 837] (conc. opn. by O'Connor, J.), [93 L.Ed.2d at p. 952] (dis. opn. by Brennan, J.), 547 [93 L.Ed.2d at p. 943] (dis. opn. by Blackmun, J.).)\n\nIn the instant case, no character or background evidence was presented in either the penalty or the guilt phase. At the conclusion of his argument, the prosecutor told the jury, \"I ask you to follow the law and find the factors in aggravation overwhelmingly outweigh whatever mitigation that [defense counsel] wants to talk about.\" During his argument, defense counsel spent very little time discussing any mitigating factors. He briefly mentioned as mitigating factors defendant's \"lack of deceit,\" the presence of an accomplice at the mini-market, and the fact that defendant is a \"young man\" and has asked the jury to send him to prison. He additionally stated, \"[Defendant is] not the same person as he was then two years ago. You can observe that. His family sat over here. He has a family. They care about him. They have been sitting right over there most of the time.\"\n\nGiven the meager mitigating evidence in the record and the absence of any misleading argument to the jury, we do not see how the court's failure to tell the jury that it could consider all aspects of the defendant's character or background could possibly have misled the jury. Accordingly, we find no error. (See People v. Ghent, supra, 43 Cal. 3d at pp. 777-778.)\n\n(3) Sentencing Discretion\n\nThe jury here was instructed, \"If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death.\" (CALJIC No. 8.84.2.) Defendant argues that this instruction precluded the jury from exercising its sentencing discretion by telling the jury that the death penalty is mandatory if no evidence in mitigation is presented. (See Lockett v. Ohio, supra, 438 U.S. 586, 604 [57 L.Ed.2d\n\n973, 989]; Woodson v. North Carolina (1976) 428 U.S. 280, 304-305 [49 L.Ed.2d 944, 961, 96 S.Ct. 2978] (plur. opn.).)\n\nIn Brown, supra, 40 Cal. 3d at page 544, we upheld the 1978 death penalty statute against a challenge that \"it withdraws constitutionally compelled sentencing discretion from the jury.\" We acknowledged that the words \"'shall impose a sentence of death'\" leave room for some confusion regarding the scope of the jury's discretion. We stated, however, that whether the jury has been misled so as to prejudice defendant depends on a case-by-case analysis. (Id. at p. 544, fn. 17.)\n\nThe prosecutor in the instant case emphasized to the jury that it was the ultimate decision maker. He stated, \"You will be told if you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death. In a sense, it's mechanical. Let's face it, we all know it isn't. At this stage, if you wish, you can say no, I'm not going to do that. I'm not going to look at the factors in aggravation and see if they outweigh the factors in mitigation . . . . No one will criticize you later if you do that. Your conscience is what determines now.\" (Italics added.)\n\nThe defense counsel similarly informed the jury that \". . . no one can compel your decision regardless of which one you come to . . . . [ para. ] It's not the mere addition of factors. Any one weight attached to any mitigative factor can outweigh any several, so don't let any preponderation or mere addition of numbers . . . cause you to make your mind up on that . . . .\"\n\nIn light of the arguments made by both the prosecutor and defense counsel, and in the absence of any indication that the jury was affirmatively misled, we believe the jury was sufficiently informed of the scope of its sentencing discretion. Accordingly, we find no prejudice to defendant. (See People v. Allen (1986) 42 Cal. 3d 1222, 1278-1280 [232 Cal. Rptr. 849, 729 P.2d 115].)\n\nb) Deletion of Nonapplicable Mitigating Factors\n\nAt the conclusion of the penalty phase, the jury was instructed that it \"shall consider . . . if applicable\" each of the statutory mitigating and aggravating factors (§ 190.3). (See CALJIC No. 8.84.1.) Defendant contends that the trial court had the sua sponte duty to delete the irrelevant mitigating factors. We rejected an identical contention in People v. Ghent, supra, 43 Cal. 3d 739, 776-777 [1977 death penalty law].) We believe the jury's knowledge of the full range of factors provides a framework for the exercise of its discretion and can assist the jury in placing the particular defendant's conduct in perspective. (See Gregg v. Georgia (1976) 428 U.S. 153, 192\n\n[49 L.Ed.2d 859, 885, 96 S.Ct. 2909].) Moreover, as is apparent from the statutory language, it is for the jury to determine which of the listed factors are applicable or \"relevant\" to the particular case. (§ 190.3, par. 6.) The trial court did not err in reading the complete list of statutory factors to the jury.\n\nc) Instruction That Jury Must Return a Verdict of Death or Life Without Possibility of Parole\n\nThe jury was instructed pursuant to CALJIC No. 8.84: \"It is the law of this state that the penalty for a defendant found guilty of murder in the first degree shall be death or confinement in the state prison for life without possibility of parole in any case in which the special circumstance charged in this case has been specially found to be true . . . . Under the law of this state, you must now determine which of said penalties will be imposed on the defendant.\"\n\nDefendant maintains that this instruction created the erroneous impression that the jury had the choice of only two alternative verdicts -- death or life without possibility of parole. Defendant argues that the instruction failed to inform the jury that it had the additional choice not to render any verdict at all. (See § 190.4;\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e People v. Gainer (1977) 19 Cal. 3d 835 [139 Cal. Rptr. 861, 566 P.2d 997, 97 A.L.R.3d 73].) A similar argument was rejected in People v. Harris (1981) 28 Cal. 3d 935, 963-964 [171 Cal. Rptr. 679, 623 P.2d 240], certiorari denied 454 U.S. 882. In Harris we concluded that where, as here, there is no jury deadlock, a court is not required to instruct the jury that it has the choice not to deliver any verdict. Although Harris involved an interpretation of the 1977 statute, its reasoning applies equally to the 1978 statute.\n\nd) Dual Use of Underlying Crimes\n\nDefendant contends the trial court erred in failing sua sponte to modify CALJIC No. 8.84.1 to make clear that section 190.3, subdivisions (b) and (c) applied only to \"other crimes.\"\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e We agree that subdivisions (b)\n\nand (c) pertain only to criminal activity other than the crimes for which the defendant was convicted in the present proceeding. It would therefore be improper for the jury to consider the underlying crimes as separate and distinct aggravating circumstances under either subdivision.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nOn this record, however, there is absolutely no indication that the jury would have understood that the guilt phase crimes came within subdivision (b) or (c). Neither the judge nor the prosecutor suggested to the jury that the guilt phase crimes were to be considered as aggravating factors under subdivision (b) or (c). The judge simply instructed the jury on the mitigating and aggravating factors in the language of section 190.3. During closing argument the prosecutor discussed each of the circumstances in aggravation without specifically referring to any of the enumerated statutory factors. Moreover, both counsel informed the jury that they were not simply to \"count\" the aggravating and mitigating factors in reaching their penalty determination. Therefore, it was the event itself, i.e., the act of violence in the killing of Robert Hosey and the circumstance of the Gary Black murder, which was presented to the jury, not its characterization under the instruction or statute as a particular subdivision.\n\ne) CALJIC No. 8.84.1(a)\n\nDefendant argues that CALJIC No. 8.84.1(a), which allows a jury to consider \"circumstances of the crime,\" unconstitutionally permits \"unchallenged discretion\" and invites imposition of the death penalty based on factors which may be common to all murders. We recently rejected an identical argument in People v. Phillips, supra, 41 Cal. 3d at pages 63-64. Defendant also objects to that portion of CALJIC No. 8.84.1(a) which permits the jury to consider \"the existence of any special [circumstances] found to be true.\" He argues that because the special circumstances have already been used to enhance a \"regular first degree murder\" into a capital offense, to allow the jury to consider them again in determining penalty invites double punishment. Defendant's argument is insupportable. Defendant relies solely upon section 1170, subdivision (b), which he acknowledges is inapplicable to death penalty cases. We believe it proper for the jury to consider the facts and nature of the special circumstances in determining what punishment shall be imposed.\n\nf) Standard of Proof\n\nDefendant contends that due process requires a jury to determine beyond a reasonable doubt that the circumstances in aggravation outweigh those in mitigation and that death is the appropriate penalty. We rejected a similar claim in People v. Rodriguez, supra, 42 Cal. 3d 730, 777-779.\n\ng) Failure to Instruct That No Inferences Are to Be Drawn From Defendant's Silence\n\nDefendant contends the trial court erred in failing to sua sponte instruct the jury that no inference may be drawn from defendant's failure to testify. (CALJIC Nos. 2.60, 2.61.)\n\nWe recently considered and rejected the identical contention in People v. Gates (1987) 43 Cal. 3d 1168, 1208-1209 [240 Cal. Rptr. 666, 743 P.2d 301]. For the reasons stated therein we conclude that the trial court did not err in failing to give the cited instructions.\n\nh) Witness Credibility Instructions\n\nRelying on People v. Rincon-Pineda (1975) 14 Cal. 3d 864 [123 Cal. Rptr. 119, 538 P.2d 247, 92 A.L.R.3d 845], defendant maintains that the trial court's failure to sua sponte instruct the jury at the penalty phase on the standards for assessing witness credibility constitutes reversible error. (CALJIC No. 2.20.)\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nDefendant's reliance on Rincon-Pineda is clearly misplaced. In Rincon-Pineda, supra, 14 Cal. 3d at page 883, we held that the credibility instructions should be given \" sua sponte by the trial court in every criminal case.\"\n\nThe jury here was in fact instructed pursuant to CALJIC No. 2.20 at the guilt phase. We believe this is all that was required. In the absence of an affirmative showing that the jury did not continue to apply the instruction at the penalty phase, we cannot assume error.\n\nMoreover, the factors relating to credibility, as identified in CALJIC No. 2.20, were amply brought to the jury's attention during closing statements. During their arguments, the district attorney and defense counsel warned the jury that Saucedo's testimony should be viewed with caution because of his previous dishonesty, his involvement in the Hosey murder, and the fact that he was given immunity and a reduced sentence in exchange for his willingness to testify.\n\n5. Prosecutorial Misconduct\n\nDefendant asserts that numerous comments made by the district attorney during closing argument constituted prejudicial misconduct. However, because he failed to object to any of the challenged statements at trial, he is precluded from raising the objections on appeal.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e (People v. Green, supra, 27 Cal. 3d at p. 27.) None of the claimed errors were of such significance that they could not have been cured by an admonition. We therefore deem any error to be waived. (Cf. Green, supra, at pp. 34-35.)\n\nDefendant attempts to overcome the waiver rule by asserting that the failure to object to the misconduct of the district attorney deprived him of the effective assistance of counsel. (See People v. Fosselman, supra, 33 Cal. 3d at p. 584.) However, a review of the record reveals that it is not reasonably probable the jury would have reached a more favorable result had defense counsel objected and requested an admonition regarding the alleged instances of misconduct:\n\na) Facts Not in Evidence\n\nDefendant initially contends that several of the prosecutor's remarks were predicated on facts not in evidence and therefore they were not within the scope of permissible comment. (See People v. Bolton (1979) 23 Cal. 3d 208, 212-213 [152 Cal. Rptr. 141, 589 P.2d 396].)\n\nThe first of these alleged improper remarks was that at the time the jailhouse tape was made, Saucedo \"had ratted not just on [defendant], but on himself.\" The prosecutor's comment, however, was based on defendant's tape-recorded conversation with codefendant Gonzales, which was properly before the jury at the penalty phase. In fact, the prosecutor urged the jury not \"to take my word for it; listen to the tapes.\" We find no error in these comments.\n\nDefendant additionally objects to the following statements made by the prosecutor: \"I will tell you that when this [Hosey] killing went down -- and we took statements -- the other [mini-market] killing had not even occurred yet. How important was it to try and get [defendant] off the street through the truth, and the truth is what we are going to talk about.\"\n\nWhen taken in context, we find the prosecutor's remarks were properly based on facts in the record. The challenged remarks occurred during the prosecutor's explanation of his reasons for offering Saucedo immunity and a reduced sentence in exchange for his testimony. The reference to the importance of getting \"[defendant] off the street through the truth\" referred to the difficulty of getting witnesses to come forward and testify against defendant. The jury could reasonably infer from the testimony of Saucedo and Torres that witnesses were not generally willing to come forward and testify against defendant. The prosecutor's remarks constituted proper comment and in any event could not have had a significant impact upon the jury's determination.\n\nDefendant also complains of the prosecutor's statement that defendant had the power to subpoena witnesses or hire an investigator.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Defendant contends this statement was intended solely to show that the prosecutor had knowledge of defendant's guilt from the beginning of the trial which caused the jury to be inflamed against defendant.\n\nWe find no merit to defendant's contention. What the prosecutor was referring to was the fact that defendant did not bring in his own witnesses to testify concerning the Hosey murder. All surviving witnesses were his friends, and since such witnesses would be logically expected, the comment was clearly proper. (See People v. Vargas (1973) 9 Cal. 3d 470, 475-476 [108 Cal. Rptr. 15, 509 P.2d 959].)\n\nIn sum we determine each of these challenged statements was based on reasonable inferences from the evidence before the jury. Moreover, even if\n\nthese comments were improper, we fail to see any possible prejudice arising from these brief remarks.\n\nb) Personal Belief\n\nDefendant also claims the prosecutor improperly argued his personal belief to the jury.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nIt is a general rule that a prosecutor may not express a personal opinion \"where there is substantial danger that jurors will interpret this as being based on information at the prosecutor's command, other than evidence adduced at trial.\" (People v. Bain (1971) 5 Cal. 3d 839, 848 [97 Cal. Rptr. 684, 489 P.2d 564].) It is not misconduct, however, to \"merely postulate what the evidence would arguably prove.\" (People v. Ryner (1985) 164 Cal. App. 3d 1075, 1086 [211 Cal. Rptr. 140].)\n\nHere we find no misconduct. The prosecutor's expressions of belief were based on the evidence in the record. There was no indication in the statements that the prosecutor's belief was in any way founded on secret information not in evidence. The prosecutor in fact several times reminded the jury that in reaching its verdict it had the duty to independently examine the evidence and follow the law.\n\nc) Predictions of Future Violence\n\nDefendant next objects to the prosecutor's assertions that if defendant was incarcerated for life he would pose a danger to other prisoners and to prison workers.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e This argument, he contends, introduced irrelevant factors into the penalty determination.\n\nWe recently held that a prosecutor's comments on a defendant's future dangerousness are \"within the proper bounds of argument to the jury.\" (People v. Davenport (1985) 41 Cal. 3d 247, 288 [221 Cal. Rptr. 794, 710 P.2d 861].) In reaching this conclusion, we distinguished People v. Murtishaw (1981) 29 Cal. 3d 733, 767-768 [175 Cal. Rptr. 738, 631 P.2d 446], where expert opinion regarding projections of future violence was held to be inadmissible. In Murtishaw, our primary concern was that expert opinion on the subject of defendant's propensity to commit violence is unreliable and frequently erroneous and often carries great weight with the jury. (Id. at pp. 767-768.) We do not believe a prosecutor's comments during closing arguments present the same potential for prejudice.\n\nMoreover, the critical question is not whether the prosecutor's comments were improper, but rather whether the comments so infected the trial with unfairness that defendant was deprived of his right to a fair trial on the issue of penalty. (Darden v. Wainwright, supra, 477 U.S. at p. 181 [91 L.Ed.2d at p. 157, 106 S.Ct. at p. 2472].) As in Darden, the prosecutor's comments here \"did not manipulate or misstate the evidence, nor did [they] implicate other specific rights of the accused . . . .\" (Id. at p. 182 [91 L.Ed.2d at pp. 157-158, 106 S.Ct. at p. 2472].) We therefore conclude that the prosecutor's statements regarding defendant's potential behavior in prison did not render the penalty trial unfair. \"'Permitting open and far-ranging argument at the penalty phase does not offend the United States Constitution.' (Gregg v. Georgia, supra, 428 U.S. 153, 203-204.)\" (Davenport, supra, 41 Cal. 3d at p. 288.)\n\nd) Lack of Mitigating Evidence\n\nDefendant next assigns as error the prosecutor's statement that \"I searched this case for factors in mitigation and I found none. I searched for elements of remorse and I found none.\"\n\nDefendant first argues that the remark infringed upon his constitutional right to remain silent. (Estelle v. Smith (1981) 451 U.S. 454 [68 L.Ed.2d 359, 101 S.Ct. 1866]; Griffin v. California, supra, 380 U.S. 609.) Griffin held that comment upon a defendant's silence constitutes a violation of the\n\naccused's right not to incriminate himself. \" Griffin forbids either direct or indirect comment upon the failure of the defendant to take the witness stand.\" (People v. Jackson, supra, 28 Cal. 3d at p. 304.) \"The rule, however, does not extend to comments on the state of the evidence or on the failure of the defense to introduce material evidence or to call logical witnesses. [Citation.]\" (Ibid.; accord, People v. Szeto (1981) 29 Cal. 3d 20, 34 [171 Cal. Rptr. 652, 623 P.2d 213].) Moreover, \"[it] is entirely proper for a jury . . . to consider logical gaps in the defense case, . . .\" (People v. Redmond (1981) 29 Cal. 3d 904, 911 [176 Cal. Rptr. 780, 633 P.2d 976]) and the prosecutor may point out these gaps in his argument to the jury. Applying these principles, we conclude the prosecutor's statement was a proper comment on the state of the record and did not call attention to defendant's failure to testify during the penalty phase.\n\nDefendant next challenges the comment as improper under People v. Coleman (1969) 71 Cal. 2d 1159 [80 Cal. Rptr. 920, 459 P.2d 248]. In Coleman, supra, at page 1168, we held that it was \"fundamentally unfair\" to comment on a defendant's lack of remorse when he has denied committing the crime. This principle is inapplicable here since defendant fully admitted shooting Black and Chandler. Under such circumstances, it is not unfair to expect defendant to show some remorse, particularly since he denies that he intended to kill either man.\n\nDefendant additionally contends that the prosecutor's comment improperly suggested to the jury that the absence of mitigating evidence may be deemed a factor in aggravation. The record, however, does not support defendant's contention. The prosecutor's remark merely reflected his view of the record which disclosed an almost complete lack of mitigating evidence. He thereafter asked the jury to compare the evidence relating to the aggravating factors with the minimal evidence of mitigating factors. At no time did the prosecutor tell the jury that it should consider the lack of mitigating evidence as an aggravating factor. The prosecutor's comment was within the scope of permissible argument. There was no misconduct.\n\ne) Reference to Victim Impact\n\nRelying on the United States Supreme Court's recent decision in Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529], defendant argues that the prosecutor's reference to the effect that defendant's crime would have upon the family of the victim constituted misconduct and a denial of due process by injecting into the deliberation process irrelevant factors which could have been viewed by the jury as aggravating circumstances.\n\nBooth, supra, 482 U.S. 496, involving introduction at the sentencing phase of an extensive victim impact statement, is patently distinguishable. In the instant case the prosecutor in closing argument merely observed that \"Gary Black's family will never be the same. Kelly Chandler will never be the same. Anyone touched by this process will never be the same. Even [codefendant] Arnie and Arnie's family will never be the same because Mr. Miranda, when his robbery failed, couldn't resist the temptation to blow away human beings.\" Unlike Booth, where the evidence specifically detailed the impact of the crime on the victim's family, these remarks did no more than refer to the obvious and nonspecific fact that Gary Black's murder would affect his family as well as Chandler and Gonzalez. Although prosecutors in the future should refrain from commenting on the impact of the murder on the victims, the prosecutor's comments here were harmless beyond a reasonable doubt. (See People v. Ghent, supra, 43 Cal. 3d at pp. 771-772.)\n\n6. Spectator Misconduct\n\nDefendant contends the trial court committed reversible error in denying his request for a mistrial after a spectator made comments to the jury.\n\nDuring the reading of the guilt verdict, one of the members of the audience told the jury that it had convicted an \"innocent man.\" Several days later, at the beginning of the penalty trial, the same spectator made a similar remark to the effect that \"you convicted the wrong man.\" Outside the presence of the jury, the court determined the spectator was codefendant Gonzales's brother. The prosecutor expressed his concern that this man was intimidating the jury. Defense counsel stated that defendant was not involved in the spectator's comments, and he requested the jury be admonished. The court agreed it would speak to the jury the next day.\n\nAt the beginning of the next day's proceedings, defendant made a motion for mistrial based on the spectator's comments to the jury. The prosecutor opposed the motion, stating, \"if the jury is intimidated at all it was intimidated in a negative sense in . . . that [it is] . . . afraid of . . . voting guilty . . . because of what might happen later.\" The court denied defendant's motion.\n\nThe jury was then brought into the courtroom and it was admonished by the court as follows: \"I will inform you that the person who had that outburst and the person who made the remark to you yesterday was the brother of the codefendant. As far as we have been able to ascertain, Mr. Miranda had nothing to do with it and we will see that he is not around\n\nthese premises any further. I think we have taken care, as I say, of seeing that you are escorted to the courtroom so you don't have any contact with anybody in the halls that might make some remarks. I assume I am correct in assuming that anything that has happened either last Friday or yesterday will in no way affect your verdict as far as this case is concerned. You can put that out of your mind and proceed with your duties as jurors in this case.\"\n\nA spectator's misconduct constitutes ground for mistrial only if the misconduct is of such a character as to prejudice or influence the jury. (People v. Slocum (1975) 52 Cal. App. 3d 867, 883 [125 Cal. Rptr. 442].) \"[The] mere fact that a spectator is guilty of some misconduct . . . does not mandate the declaration of a mistrial, . . . especially where the judge takes immediate action to avert possible juror prejudice.\" (Ibid.) Moreover, the trial court has wide discretion in determining whether the spectator's conduct is prejudicial and the court's determination will not be overturned in the absence of an abuse of discretion. (Id. at p. 884; cf. People v. Guillebeau (1980) 107 Cal. App. 3d 531, 548 [166 Cal. Rptr. 45].)\n\nThe spectator misconduct here consisted of two isolated comments by codefendant's brother expressing his dissatisfaction with the guilt verdict. The jury was promptly admonished by the court. There is absolutely no indication in the record that the remarks could have possibly affected the penalty verdict. The trial court did not abuse its discretion in denying defendant's motion for mistrial.\n\n7. Presence of Security Personnel\n\nDefendant contends that the presence of security personnel in the courtroom denied him a fair and impartial penalty trial. We do not agree.\n\nAt trial defendant objected to the presence of three security personnel who accompanied Saucedo when he entered the courtroom, claiming the security procedures implied defendant had threatened Saucedo. The court found the use of security officers was justified under the circumstances. Defendant later moved for a mistrial due to the presence of the security officers. The court denied the motion.\n\nThe United States Supreme Court has recently held that the use of identifiable security guards in the courtroom during a criminal trial is not inherently prejudicial. (Holbrook v. Flynn (1986) 475 U.S. 560 [89 L.Ed.2d 525, 106 S.Ct. 1340].) The court explained that a jury may interpret the presence of armed guards in many different ways. \"[The] presence of guards at a defendant's trial need not be interpreted as a sign that he is particularly\n\ndangerous or culpable. Jurors may just as easily believe that the officers are there to guard against disruptions emanating from outside the courtroom or to ensure that tense courtroom exchanges do not erupt into violence. Indeed, it is entirely possible that jurors will not infer anything at all from the presence of the guards . . . . Our society has become inured to the presence of armed guards in most public places; they are doubtless taken for granted so long as their numbers or weaponry do not suggest particular official concern or alarm.\" (Holbrook, supra, at p. 569 [89 L.Ed.2d at pp. 534-535, 106 S.Ct. at p. 1346].) The Holbrook court concluded that whether a defendant has been prejudiced by the presence of security officers must be determined on a case-by-case basis. (475 U.S. at p. 569 [89 L.Ed.2d at p. 535, 106 S.Ct. at p. 1346].)\n\nWe find absolutely no prejudice in the instant case. The record reflects that a large contingent of defendant's fellow gang members were present in the courtroom, particularly during the testimony of Saucedo and Torres. During this time, several jurors expressed concerns about their own safety. The court responded to these concerns by making special arrangements for the jury to enter and exit the courtroom through a private entrance. The jury may have viewed the uniformed officers as an additional security precaution to control the possible threat of violence in the courtroom. Further, the jury may have believed the added security was a routine procedure when a person in custody, such as Saucedo, takes the witness stand. It is additionally significant that Saucedo did in fact testify that he had received threats from defendant.\n\nBased on the record before us, we conclude the trial court did not abuse its discretion in permitting Saucedo to be accompanied by security officers. In fact, given the atmosphere in the courtroom, we think the court would have been derelict in its duty had it not provided such security arrangements.\n\n8. Juror Misconduct\n\nAfter the jury had rendered its penalty verdict, Ramona Escareno informed defense counsel that during the trial she had several conversations with Juror Steven Cunningham. Upon receipt of this information, defendant moved for a new trial on the basis of juror misconduct.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The evidence presented at the hearing on the motion consisted of the testimony of Escareno and Juror Cunningham.\n\nEscareno testified as follows: She was a spectator throughout the nine-week trial because she was a friend of the defendants. During the trial,\n\nCunningham approached her while they were walking down a stairway in the courthouse. She indicated she did not want to talk at the courthouse, but would meet him later at a hat shop downtown. When they subsequently met at the shop, Escareno gave Cunningham her phone number. During the trial Cunningham called Escareno five or six times. The first time he called, Cunningham asked her whether she was a friend of the defendants. He told her it did not look too good for them because it was all on film. Cunningham then asked her to go out on a date but she said no, because defendant was her boyfriend. Cunningham then called her another day, after defendant had testified. He wanted to know what the initials FRT on defendant's neck meant. Escareno told him they were the initials of a girl. Cunningham said he did not believe it, because some juror had told him it stood for \"Frogtown.\"\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e He said defendant should not have testified because he hung himself. Throughout the trial he would look at her and wink. When they first started talking, Cunningham told her he did not think it would turn out as bad as everyone thought. He also told her, prior to sentencing, there would be no death sentence. The day after the death sentence was rendered, Cunningham called her and said he was sorry to vote for the death penalty, but he did not want to delay things. He said he would call back but never did.\n\nCunningham, aged 19, testified that Escareno first approached him and handed him a note which said he could call her.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e He knew she was a friend of the defendants because he had seen her conversing with them during the trial. Cunningham admitted that he called Escareno several times, but denied that they ever discussed the case. He stated that they only talked about \"going out.\" Escareno told him she could not go out until the case was over. After the death penalty verdict Cunningham called Escareno, expecting to set up the date. She refused, and he never spoke with her again.\n\nBefore giving his courtroom testimony, Cunningham had denied that he had any conversations with Escareno. He said he lied because he did not want to be called to court and have it get as big as it did. He was also concerned that his pregnant girlfriend would find out about it.\n\nThe trial court denied the motion for new trial, stating as follows: \". . . I don't feel there has been any prejudice to the defendants in this case. I don't entirely believe the young lady's testimony. I don't believe her testimony with respect to the various places she met this young man. There is no question that there were telephone conversations. And the young man has\n\nadmitted that. I can understand why he was reluctant to admit it earlier. But he came to court and under oath he admitted that he had telephone conversations with her, two very long ones . . . . And it does appear to the court to be some kind of a romantic attachment. And I'm more inclined to believe that they did not discuss the case.\"\n\nDefendant maintains that the trial court abused its discretion in denying the motion. We disagree.\n\nJury misconduct raises a presumption of prejudice, and \"'unless the prosecution rebuts that presumption . . . , the defendant is entitled to a new trial.'\" (In re Stankewitz (1985) 40 Cal. 3d 391, 402 [220 Cal. Rptr. 382, 708 P.2d 1260]; People v. Pierce (1979) 24 Cal. 3d 199, 207 [155 Cal. Rptr. 657, 595 P.2d 91]; People v. Honeycutt (1977) 20 Cal. 3d 150, 156 [141 Cal. Rptr. 698, 570 P.2d 1050].) The presumption of prejudice \"may be rebutted by an affirmative evidentiary showing that prejudice does not exist or by a reviewing court's examination of the entire record to determine whether there is a reasonable probability of actual harm to the complaining party . . . .\" (Hasson v. Ford Motor Co. (1982) 32 Cal. 3d 388, 417 [185 Cal. Rptr. 654, 650 P.2d 1171].) Whether a defendant has been prejudiced by a juror's outside communications depends upon \"whether the jury's impartiality has been adversely affected, whether the prosecution's burden of proof has been lightened and whether any asserted defense has been contradicted.\" (People v. Martinez (1978) 82 Cal. App. 3d 1, 22 [147 Cal. Rptr. 208]; see, e.g., People v. Pierce, supra, at pp. 207-209; People v. Honeycutt, supra, 20 Cal. 3d at pp. 157-158.)\n\nIn the instant case, the trial court was in the best position to evaluate the conflicting testimony and determine the prejudicial effect of Cunningham's conduct. The court found that Escareno's testimony was not credible; that Escareno and Cunningham did not discuss defendant's case in their telephone conversations; and that Cunningham's telephone calls reflected a \"romantic attachment.\" Upon a review of the record, we find substantial evidence supports the trial court's conclusions. It appears that Cunningham's conduct involved nothing more than a 19-year-old youth flattered to receive attention from a young woman. In his testimony, he appeared to separate his responsibilities as a juror from his desire to \"go out with\" Escareno after the case was finished.\n\nThe juror misconduct here substantially differs from that in Honeycutt and Pierce. In those cases, a juror had contacted an outside individual and had received information on matters pending in the case. Here, by contrast, defendant fails to point to any disclosure by Escareno which could have possibly harmed defendant's case. \"'However strictly the decisions\n\nmay lay down the rule as to the effect of misconduct of the jury that may well have prejudiced the parties, it is settled in this state that a new trial will not be granted on that ground where the misconduct was of such a trifling nature that it could not in the nature of things have been prejudicial to the moving party, and that where it appears that the fairness of the trial has been in no way affected by such impropriety, the verdict will not be disturbed. [Citation.]' [Citation.]\" (People v. Sutter (1982) 134 Cal. App. 3d 806, 821 [184 Cal. Rptr. 829].) We conclude the trial court did not abuse its discretion in denying defendant's motion for a new trial.\n\n9. Disproportionate Penalty\n\nRelying on People v. Dillon (1983) 34 Cal. 3d 441 [194 Cal. Rptr. 390, 668 P.2d 697], defendant argues that the death penalty in the instant case constitutes cruel or unusual punishment. (Cal. Const., art. I, § 17.) He maintains that the sentence is disproportionate to his culpability because the circumstances of the crime (its nature, the method of death, the victim's race) make it likely that he is the subject of institutional and gang attitudes and mental illness and not a \"cold, calculated, premeditated murderer.\" He further asserts that the sentence is disproportionate in view of codefendant Gonzales's sentence of life without possibility of parole.\n\nDefendant's reliance on Dillon is wholly misplaced. The facts of this case bear no similarity to the circumstances in Dillon, where an immature 17-year-old defendant, who shot and killed his victim out of fear and panic, was sentenced to life in prison despite the view of the judge and jury that the sentence was excessive in relation to his true culpability. (34 Cal. 3d at p. 487.) Moreover, nothing in the record points to defendant's asserted \"mental illness\" or \"institutional attitudes.\" Nor is it disproportionate that defendant, the actual killer, was sentenced to death while his codefendant aider and abettor received a sentence of life without possibility of parole.\n\n10. Ineffective Assistance of Counsel\n\nIn a petition for habeas corpus consolidated with this appeal defendant contends that he was denied effective assistance of counsel at the guilt phase for counsel's failure to investigate a diminished capacity defense and at the penalty phase for failure to present any mitigating evidence. In addition, defendant challenges the constitutionality of his death sentence on grounds that in California, and particularly in Los Angeles County, the death penalty is charged and imposed in a discriminatory manner. We\n\nissued an order to show cause only as to the penalty phase issue of failure to present mitigating evidence.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nA defendant claiming ineffective assistance of counsel has the burden of showing that \"counsel failed to act in a manner to be expected of reasonably competent attorneys acting as diligent advocates.\" (People v. Pope, supra, 23 Cal. 3d at p. 425.) In addition, the defendant must show that counsel's acts or omissions deprived him of a potentially meritorious defense (ibid.) or that it is \"reasonably probable a determination more favorable to the defendant would have resulted in the absence of counsel's failings\" (People v. Fosselman, supra, 33 Cal. 3d at p. 584). Once the defendant has met these burdens, the appellate court must examine the record to determine whether there is any explanation for counsel's acts or omissions.\n\nAttached to defendant's petition are declarations from his mother and sister and two psychological reports dating from his childhood. The declarations state that defendant's parents were alcoholics; that there was constant fighting in the home; that defendant began getting in trouble in school at an early age; and that at age 11 he joined the Frogtown gang and began coming home drunk, at age 12 he was sniffing glue and by age 17 he was \"always high\" on PCP. Defendant's mother and sister asserted that at the time of trial they were available to testify to the foregoing facts, but were never asked to do so. The first report, a psychological evaluation of defendant at age 10, describes him as a boy of normal intelligence with a passively negativistic personality who acts out his dependency needs in antisocial ways. The second report two years later suggests that defendant had difficulty in accepting success in school, which led him to revert to his delinquent ways.\n\nIn his return to the order to show cause, the Attorney General submitted declarations from both trial counsel which set forth their reasons for not having family members testify in the penalty trial. As a partial reason for their actions trial counsel indicate defendant had instructed them not to call family members at the penalty trial, an instruction denied by defendant in his traverse. Counsel also stated they were fully aware of defendant's \"rap sheet\" which reflected defendant's extensive criminal background beginning\n\nat a very early age, as well as his longtime involvement in gang activities. Based on this knowledge, counsel decided not to put family members on the witness stand as character witnesses so as to prevent potentially damaging cross-examination testimony. As stated in the declaration filed by one of defendant's trial counsel, \"It was tactically felt that if the Pandora's box of his violent background was opened for exploration as a sympathy measure for the jury to peruse that it could have been savagely explored by the prosecution and would have done more harm than good.\"\n\nIn People v. Durham (1969) 70 Cal. 2d 171, 191-192 [74 Cal. Rptr. 262, 449 P.2d 198] we rejected the argument that the failure to introduce mitigating evidence at the penalty phase constituted ineffective assistance of counsel. We reached this conclusion based on the \"totality of the circumstances,\" especially in view of defendant's failure to point to any significant evidence in mitigation, the fact that counsel presented a well-reasoned closing argument and fully cross-examined prosecution witnesses, and counsel's concern that the scope of cross-examination would lead to damaging testimony.\n\nIn People v. Jackson, supra, 28 Cal. 3d at pages 293-296, the presence of these factors led us similarly to reject defendant's contention that he was denied the effective assistance of counsel. We emphasized that \"defendant [had] failed to establish affirmatively that his counsel's omission 'cannot be explained on the basis of any knowledgeable choice of tactics.' [Citation.]\" (Id. at p. 296.) \"'Mental straitjackets,'\" we observed, \"'should not be placed on thoughtful defense counsel who wish to selectively choose which weapon is best for a defendant or which type of advocacy . . . is best designed to reach what they believe is a satisfactory result for their client . . . .' [Citation.]\" (Ibid.)\n\nWe recently held in People v. Deere (1985) 41 Cal. 3d 353 [222 Cal. Rptr. 13, 710 P.2d 925] that \"the failure of defense counsel to present any mitigating evidence in the penalty phase of a capital trial, in obedience to his client's reguest, required that the penalty be set aside.\" (People v. Burgener, supra, 41 Cal. 3d at p. 541, italics added.) We reaffirmed, however, that a defense counsel in a capital case is not necessarily compelled to introduce \"every conceivable item of arguably mitigating evidence . . . . An appellate court will not second-guess the judgment of competent counsel. (See, e.g., People v. Jackson (1980) 28 Cal. 3d 264, 294-296 [168 Cal. Rptr. 603, 618 P.2d 149].)\" (Deere, supra, at p. 364, fn. 3.) In reversing the penalty judgment in Deere, we made it plain that it was not a case where the mitigating evidence was excluded because of an attorney's tactical decision. Instead, the evidence was excluded \"because a defendant seeking [the death] penalty barred his counsel from offering any mitigating evidence at all.\" (Ibid.)\n\nAccordingly, we see no basis in either law or reason to find defense counsel incompetent when he refrains from presenting mitigating evidence as a result of an informed tactical decision, so long as such decision is within the range of reasonable competence. (See generally Strickland v. Washington (1983) 466 U.S. 668, 699 [80 L.Ed.2d 674, 701, 104 S.Ct. 2052.)\n\nWe find that the circumstances in this case closely resemble the situation in Jackson, supra, 28 Cal. 3d 264 and in Durham, supra, 70 Cal. 2d 171. Here, counsel made a clear tactical choice not to introduce evidence at the penalty phase. This decision was based on their knowledge of defendant's background and their fear that otherwise inadmissible bad character evidence could be used by the prosecution in rebuttal. (See People v. Boyd (1985) 38 Cal. 3d 762, 776 [215 Cal. Rptr. 1, 700 P.2d 782]; Strickland v. Washington, supra, at p. 700.)\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e As stated by trial counsel, \"It was a joint tactical decision between defendant . . . and counsel to avoid bringing in material on behalf of the defendant . . . which would open the door -- wide open -- for the prosecution to introduce evidence in rebuttal, even without notice.\" In view of the circumstances of defendant's background and the extent of the impeaching evidence available to the prosecution, we believe counsel's decision was certainly a reasonable one and was well within the range of reasonable competence.\n\nSignificantly, we note that, as in Jackson, supra, 28 Cal. 3d 264, and Durham, supra, 70 Cal. 2d 171, defense counsel did not simply give up, but instead vigorously cross-examined the prosecution witnesses during the penalty phase. Counsel additionally presented a forceful and well-reasoned closing statement. They did not argue the human virtues of defendant, who was clearly shown on videotape to be a cold-blooded killer. Counsel instead focused on rebutting the prosecution's evidence and spoke about the principle of mercy, the inhumanity of executions by lethal gas, the comparison of defendant's crime with serial or sadistic killers, and the fact that defendant is now a changed person. Counsel additionally commented several times about defendant's relationship with his family. They stated, for example, as noted earlier, that defendant is \"not the same person as he was then two years ago. You can observe that. His family sat over here. He has a family. They care about him. They have been sitting right over there most of the time.\" Thus, by means of this argument, defendant's counsel was able to\n\nbring to the jury's attention an image of a caring family without the risk of devastating cross-examination.\n\nIn view of the totality of the circumstances, we conclude, as we did in Jackson, that \"counsel's representation of defendant at the penalty phase did not result in a denial of defendant's right to the effective aid of counsel.\" (28 Cal. 3d at p. 296.) In reaching this conclusion we find it unnecessary to order an evidentiary hearing. The only conflict between defendant and the Attorney General revealed in the pleadings is whether defendant instructed his trial counsel not to call his family or other witnesses at the penalty phase of trial. Assuming that defendant so instructed counsel, counsel's determination for tactical reasons to comply with that instruction does not compel a Deere (People v. Deere, supra, 41 Cal. 3d 353) reversal. Assuming on the other hand that defendant did not so instruct counsel, Deere is not an issue and our conclusion that counsel's decision was a reasonable tactical choice stands unaffected.\n\nDefendant complains that counsel's tactical determination was not an informed choice, made after investigation to determine whether defendant's background might contain mitigating evidence of value. He fails, however, to point to any evidence unknown to counsel which would have been discovered from such investigation and which would have influenced counsel's decision. The evidence defendant asserts was available was the testimony of his mother and sister and the two psychological reports. Unless we can assume that defendant's mother and sister could testify to parental alcoholism and fights and defendant's substance abuse without extensive cross-examination concerning defendant's bad character -- a highly questionable assumption -- their testimony could, as counsel feared, have opened the path to exploring defendant's violent background and in particular his gang membership, which counsel had tried successfully to keep from the jury during the guilt trial. The psychological reports would lead to the same damaging result. The first psychological evaluation confirms that defendant exhibited antisocial behavior at an early age and describes him as \"stubborn,\" \"disruptive,\" lacking empathy for others, and attracted to older boys who are \"presumably gang members.\" The second report expresses surprise that \"this soft-spoken nice-looking young man is a ring leader when it comes to minor delinquent behavior.\"\n\nConsequently, the information an investigation would have disclosed would only have confirmed counsel's tactical decision not to open the \"Pandora's Box\" of defendant's violent background.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e This decision, as we\n\nhave determined, was within the range of reasonably competent assistance. (Cf. Burger v. Kemp (1987) 483 U.S. [97 L.Ed.2d 638, 107 S.Ct. 3114]; Strickland v. Washington, supra, 466 U.S. at pp. 699-700 [80 L.Ed.2d at p. 701].) Counsel's failure to investigate therefore had no impact on the penalty phase of trial. On this record, defendant has failed to meet his burden to show that counsel's omission, if error, was prejudicial. (People v. Fosselman, supra, 33 Cal. 3d at p. 584; People v. Pope, supra, at p. 425; see also Strickland v. Washington, supra, 466 U.S. at pp. 691-692 [80 L.Ed.2d at p. 695-696].)\n\nWe thus conclude that defendant's petition for habeas corpus must be denied for failing to allege sufficient facts which either would demonstrate counsel's ineffective assistance or warrant an evidentiary hearing in the matter. (People v. Jackson, supra, 28 Cal. 3d at p. 296.)\n\nIII. Conclusion\n\nWhether viewed singly or cumulatively, no error in this case warrants reversal. Even when a defendant's life is at stake, he \"'is entitled to a fair trial but not a perfect one.'\" (Schneble v. Florida (1972) 405 U.S. 427, 432 [31 L.Ed.2d 340, 345, 92 S.Ct. 1056].) A review of the entire record convinces us that defendant did indeed receive a fair trial on the issues of guilt and penalty.\n\nThe judgment of guilt and the judgment imposing the penalty of death are affirmed. Defendant's petition for writ of habeas corpus is denied.\n\nDisposition\n\nThe judgment of guilt and the judgment imposing the penalty of death are affirmed. Defendant's petition for writ of habeas corpus is denied.\n\nBROUSSARD, J. I agree with the majority that the guilt verdicts and special circumstance finding must be affirmed.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e I dissent from the affirmance of the death judgment and the denial of the petition for writ of habeas\n\ncorpus. I cannot join the majority's hasty rejection of defendant's claim that he received ineffective assistance of counsel at the penalty trial. The majority, by deciding the matter on the pleadings without an evidentiary hearing before a referee, leaves factual issues unresolved in a case in which there is a strong probability that counsel provided ineffective assistance in failing to investigate or present a case in mitigation. I cannot believe that our judicial resources are so limited that we cannot afford to take the time to get all the facts before deciding this case.\n\nWe issued an order to show cause in this case and thus established that defendant had made out a prima facie case that he had been inadequately represented at the penalty trial. (In re Hochberg (1970) 2 Cal. 3d 870, 875, fn. 4 [87 Cal. Rptr. 681, 471 P.2d 1].) Defendant alleged that counsel had failed to contact any members of his family or to investigate background evidence adequately. He asserted that there was some evidence of his psychological defects available from his school records and records of his experiences in group therapy. In addition, he alleged that his mother and sister would have testified about his traumatic childhood with alcoholic, combative parents. He alleged that counsel were incompetent in failing to present any case in mitigation.\n\nDefendant was represented by two attorneys. Respondent sought to establish that their representation had been adequate by supplying declarations of counsel explaining their failure to put on any evidence at the penalty phase. One attorney declared that defendant had asked that no member of his family testify in mitigation, and that counsel decided not to overrule this request because of defendant's gang membership. \"It was tactically felt that if the Pandora's Box of his violent background was opened for exploration as a sympathy measure for the jury to peruse that it could have been savagely explored by the prosecution and would have done more harm than good.\"\n\nThe second attorney declared that he did not have time to review his trial file or prepare a more comprehensive declaration because he was engaged in another capital case. However, he did remember that defendant had instructed counsel not to call any witnesses, and particularly not defendant's mother, in the penalty phase. He said that both counsel were aware of defendant's rap sheet and gang involvement and thought that they \"posed an ominous double-edged sword if introduced at the penalty phase.\" He maintained that \"it was a joint tactical decision between defendant/appellant and counsel to avoid bringing in material on behalf of the defendant/appellant which would open the door -- wide open -- for the prosecution to introduce evidence in rebuttal, even without notice.\" He again emphasized that defendant had told them not to call family members during\n\nthe penalty phase, and admitted that they never talked to defendant's mother about his background because defendant did not want family members to testify. He said that he \"cannot comment on defendant/appellant's early environmental development\" and again \"is unable to comment on defendant/appellant's school years.\"\n\nDefendant's traverse contains a declaration denying that he instructed his attorneys not to call his family or any other witnesses at either the guilt or penalty phase of trial. He realleges the allegations contained in his petition.\n\nThe majority opinion finds no ineffective assistance because counsel had a tactical reason for failing to put on evidence in mitigation: \"Here, counsel made a clear tactical choice not to introduce evidence at the penalty phase. This decision was based on their knowledge of defendant's background and their fear that otherwise inadmissible bad character evidence could be used by the prosecution in rebuttal. (See People v. Boyd (1985) 38 Cal. 3d 762 [215 Cal. Rptr. 1, 700 P.2d 782].)\" (Maj. opn., ante, at p. 121, italics in original.)\n\nInvestigation of the facts and the law is one of counsel's primary duties (People v. Pope (1979) 23 Cal. 3d 412, 424-425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1]; People v. Ibarra (1963) 60 Cal. 2d 460, 464 [34 Cal. Rptr. 863, 386 P.2d 487].) Counsel may reject a defense for tactical reasons, but such a tactical choice is not a competent one unless counsel has conducted an adequate investigation. (People v. Ledesma (1987) 43 Cal. 3d 171, 215 [233 Cal. Rptr. 404, 729 P.2d 839]; People v. Frierson (1979) 25 Cal. 3d 142, 166 [158 Cal. Rptr. 281, 599 P.2d 587]; In re Saunders (1970) 2 Cal. 3d 1033, 1042, 1048-1049 [88 Cal. Rptr. 633, 472 P.2d 921]; People v. Bess (1984) 153 Cal. App. 3d 1053, 1060 [200 Cal. Rptr. 773]; see also In re Hall (1981) 30 Cal. 3d 408, 426-427 [179 Cal. Rptr. 223, 637 P.2d 690].) We have recently acknowledged the great importance of investigation of defendant's background in preparation for the penalty phase of a capital trial, holding that counsel must present mitigating evidence which counsel considers of value even over the defendant's objection. (People v. Deere (1985) 41 Cal. 3d 353, 364-368 [222 Cal. Rptr. 13, 710 P.2d 925].)\n\nThe majority cites recent decisions from the United States Supreme Court in Burger v. Kemp (1987) 483 U.S. [97 L.Ed.2d 638, 107 S.Ct. 3114] and Strickland v. Washington (1983) 466 U.S. 668 [80 L.Ed.2d 674, 104 S.Ct. 2052] to show that counsel may make a competent tactical decision to limit investigation for the penalty phase of trial. But in neither case did counsel completely forego investigation of defendant's background. Moreover, in both cases, there was an evidentiary hearing held to determine whether the decision to limit investigation was in fact competent. In Burger\n\nv. Kemp, the high court's decision turned on the record produced at this evidentiary hearing. Unfortunately, the majority here denies the defendant the benefit of such an evidentiary hearing.\n\nFrom the record available, it appears that counsel here carried out no investigation of the available evidence in mitigation before making the tactical decision not to present any evidence at the penalty phase. I question whether a total failure to investigate the case in mitigation for the purpose of the penalty trial can ever be competent representation. Even if it could be competent in light of a particular trial tactic, here, one of the two reasons upon which counsel rested their total failure to investigate was compliance with their client's request that no family members be called. But this reason for failure to investigate is not a competent one. (See People v. Deere, supra, 41 Cal. 3d 353.)\n\nThe majority relies upon an appallingly arrogant declaration to show that counsel made a competent tactical choice neither to investigate nor to present evidence in mitigation. There, counsel says that he cannot comment on defendant's allegations because he has been too busy in another capital trial to review his files in this case. Neither counsel bothers to respond to defendant's allegation that there was available evidence of his early mental problems in school records. Counsel do not deny that they did not investigate: how did they judge whether to put on a case in mitigation until they knew what it was? Under these disquieting circumstances, we simply need to know more before we can be satisfied that counsel made a competent tactical choice.\n\nEven counsel's tactical reason for failing to put on a case in mitigation is unconvincing. Their declarations show an unexamined feeling that background evidence might backfire, rather than an analysis of a point of evidence. We should not accept as tactically valid any decision to forego even investigating a case in mitigation just because defendant has a poor record. Boyd does not mean that whenever defendant puts on any background evidence, the prosecution can put in defendant's whole history in rebuttal. (See People v. Boyd (1985) 38 Cal. 3d 762, 776 [215 Cal. Rptr. 1, 700 P.2d 782].) If counsel had put in evidence that defendant's early childhood was chaotic and painful, or that he had psychological problems as a child, how would evidence of defendant's gang membership or rap sheet have been relevant in rebuttal? And anyway, how would counsel know whether the case in mitigation would open up harmful rebuttal unless they knew what was available in mitigation? As far as we can tell, these attorneys did not know what was available.\n\nOf course defendant has the burden of proving the facts on which he relies in his claim for relief on habeas corpus. (In re Saunders, supra, 2 Cal. 3d 1033, 1047-1048.)\n\nBut once the reviewing court issues its order to show cause and the issues are joined by traverse and return, if there are factual issues remaining which cannot be resolved on the pleadings, we normally order an evidentiary hearing. (See, e.g., In re Lawler (1979) 23 Cal. 3d 190, 194 [151 Cal. Rptr. 833, 588 P.2d 1257]; In re Hochberg, supra, 2 Cal. 3d 870, 873-874, fn. 2.) Given the serious factual questions remaining in this case, I cannot agree with the majority that this case can be resolved without such a hearing.\n\n\u003cspan class=\"fn\"\u003e1. Unless otherwise indicated, all further statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Chandler denied that he made this gesture or that he told defendant to shoot him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. As set forth above, the prosecution's evidence established that it was Black, and not Chandler, who was shot first.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Prior to trial codefendant Gonzales made the motion for separate juries. Defendant did not join in the motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In Hovey, we examined the available empirical evidence and determined the proof was insufficient to demonstrate that a California death-qualified jury resulted in a nonneutral jury. No new evidence was presented on the issue at the trial court in the instant case. As in Hovey, therefore, defendant's contention must fail. (See Lockhart v. McCree, supra, 476 U.S. 162; People v. Easley (1983) 34 Cal. 3d 858, 868-869 [196 Cal. Rptr. 309, 671 P.2d 813].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The letter was dated October 3, 1980, five days after the killing of Gary Black. The first sentence of the letter states: \"Mother, it's me the killer!\" A happy face is drawn next to the words. The letter explains that defendant will be leaving the state until \"the coppers give up on looking for me.\" The letter concludes: \"Mom, I am going now! You won't be hearing from me for a long long long time, I love you mom!! Don't worry!!! So long! Love, your son!! Adam.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Section 1538.5, subdivision (h) requires a defendant to bring a motion to suppress the evidence prior to trial unless \"opportunity for this motion did not exist or the defendant was not aware of the grounds for the motion, . . .\" There is no indication in the record that defendant did not have the prior opportunity to raise the issue or that he was previously unaware of the existence of the letter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In De Lancie, a civil action for declaratory relief, we held that a person in jail may have a reasonable expectation of privacy. Later, we interpreted De Lancie to mean that \"secret monitoring of conversations between detainees and visitors, 'undertaken for the purpose of gathering evidence for use in criminal proceedings, rather than to maintain the security of the jail' . . . was unlawful.\" (Donaldson v. Superior Court (1983) 35 Cal. 3d 24, 35 [196 Cal. Rptr. 704, 672 P.2d 110].) We have not yet reached the question whether violation of the De Lancie standards requires suppression of evidence in a criminal proceeding. (Id. at p. 28.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In any event, we find it difficult to believe that defendant had a reasonable expectation of privacy in his jail cell when he was repeatedly told by Gonzales that their conversations were being recorded by the police.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The instruction read as follows: \"When a defendant is charged with a crime which requires that a certain specific intent or mental state be established in order to constitute the crime or degree of crime, you must take all the evidence into consideration and determine therefrom if, at the time when the crime allegedly was committed, the defendant was suffering from some abnormal mental or physical condition, however caused, which prevented him from forming the specific intent or mental state essential to constitute the crime or degree of crime with which he is charged. \"If from all the evidence you have a reasonable doubt whether defendant was capable of forming such specific intent or mental state, you must give defendant the benefit of that doubt and find that he did not have such specific intent or mental state.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In the first sentence of this instruction, the court erroneously referred to the murder count as count II. However, the court later corrected its mistake by telling the jury that specific intent was a necessary element of the count I (murder) offense. The instruction read in pertinent part: \"In the crimes of which the defendant is accused in counts II, III and IV of the information, a necessary element is the existence in the mind of the defendant of the specific intent, A, in count II to commit murder, and B, counts II [ sic ] and IV, to permanently deprive the owner of his property. \"If the evidence shows that the defendant was intoxicated at the time of the alleged offense, the jury should consider his state of intoxication in determining if defendant had such specific intent . . . . \". . . . \". . . you may not find the defendant guilty of the offense charged in counts I, II, III and IV unless the proved circumstances not only are consistent with the theory that he had the required specific intent or mental state but cannot be reconciled with any other rational conclusion. . . .\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. At the time of trial, CALJIC No. 8.77 provided, in pertinent part: \"If you find from the evidence that at the time the alleged crime was committed, the defendant had substantially reduced mental capacity, whether caused by mental illness, mental defect, intoxication, or any other cause, you must consider what effect, if any, this diminished capacity had on the defendant's ability to form any of the specific mental states that are essential elements of murder and voluntary manslaughter. \"Thus, if you find that the defendant's mental capacity was diminished to the extent that you have a reasonable doubt whether he did, maturely and meaningfully, premeditate, deliberate, and reflect upon the gravity of his contemplated act, or form an intent to kill, you cannot find him guilty of a wilful, deliberate and premeditated murder of the first degree. \"Also, if you find that the defendant's mental capacity was diminished to the extent that you have a reasonable doubt whether he was able to form the mental states constituting either express or implied malice aforethought, you cannot find him guilty of murder of either the first or second degree.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. By contrast, in People v. McDonald (1984) 37 Cal. 3d 351, 378 [188 Cal. Rptr. 77, 655 P.2d 279], the error was found to be prejudicial where the underlying crime could not have been separately charged without violating double jeopardy protections.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The robbery instruction read in pertinent part: \"Defendant Adam Miranda is charged in Count IV of the information with the commission of the crime of robbery, a violation of Section 211 of the Penal Code. The crime of robbery is the taking of personal property in the possession of another from his person or immediate presence, and against his will accomplished by means of force or fear. In order to prove the commission of the crime of robbery, each of the following elements must be proved: . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The trial court ruled that \"it is obvious . . . that this girl is not telling the truth when she says question after question that she doesn't remember. She either doesn't want to testify, or she is afraid to testify.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The only other aggravating circumstance introduced during the penalty phase concerned threats defendant had made to Saucedo. The sole evidence on this point was Saucedo's affirmative response to the question whether defendant had ever said \"that anything would happen to you if you testified against him.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Our conclusion that the error was nonprejudicial makes it unnecessary to consider on its merits the Attorney General's request that we take judicial notice of defendant's subsequent guilty plea to the Hosey murder. Accordingly, the request for judicial notice is denied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The instruction in pertinent part read: \"As jurors you must not be influenced by pity for a defendant or by prejudice against him. You must not be biased against a defendant because he has been arrested for this offense or because he has been charged with a crime or because he has been brought to trial. None of these circumstances is evidence of his guilt. And you must not infer or assume from any or all of them that he is more likely to be guilty than innocent. [ para. ] You must not be swayed by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling. Both the People and the defendant have a right to expect that you will conscientiously consider and weigh the evidence and apply the law of the case, and that you will reach a just verdict regardless of what the consequences of such verdict may be.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We note that contrary to Easley, in California v. Brown, supra, 479 U.S. 538 [93 L.Ed.2d 934] the United States Supreme Court held that there is no federal constitutional impediment to giving the CALJIC No. 1.00 \"antisympathy\" instruction at the penalty phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We similarly reject defendant's argument that there was a prejudicial carryover effect from the final portion of CALJIC No. 1.00, which read \"you will reach a just verdict regardless of what the consequences of such verdict may be.\" (See People v. Brown, supra, 40 Cal. 3d at p. 537, fn. 7.) The record discloses that the jury was told that the issue of life or death depended upon its decision and that it was appropriate to consider the precise nature of that choice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Section 190.4, subdivision (b) provides in pertinent part: \"If the trier of fact is a jury and has been unable to reach a unanimous verdict as to what the penalty shall be, the court shall dismiss the jury and shall order a new jury impaneled to try the issue as to what the penalty shall be. If such new jury is unable to reach a unanimous verdict as to what the penalty shall be, the court in its discretion shall either order a new jury or impose a punishment of confinement in state prison for a term of life without the possibility of parole.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Subdivisions (b) and (c) of section 190.3 provide that the trier of fact shall consider: \"(b) The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence,\" and \"(c) The presence or absence of any prior felony conviction.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Although we doubt that a jury would believe that factors (b) and (c) embrace the guilt phase offenses, in order to avoid any possible confusion on this point or the application of the factors, the trial court in the future should expressly instruct that subdivisions (b) and (c) refer to crimes other than those underlying the guilt determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. CALJIC No. 2.20 provides in pertinent part: \"Every person who testifies under oath . . . is a witness. You are the sole judges of the believability of a witness and the weight to be given the testimony of each witness. \"In determining the believability of a witness you may consider anything that has a tendency in reason to prove or disprove the truthfulness of the testimony of the witness, including but not limited to any of the following: \"The extent of the opportunity or ability of the witness to see or hear or otherwise become aware of any matter about which the witness has testified; \"The ability of the witness to remember or to communicate any matter about which the witness has testified; \"The character and quality of that testimony; \"The demeanor and manner of the witness while testifying; \"The existence or nonexistence of a bias, interest, or other motive; \"Evidence of the existence or nonexistence of any fact testified to by the witness; \"The attitude of the witness toward the action in which testimony has been given by the witness or toward the giving of testimony; . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. We reject defendant's contention that the rule requiring misconduct to be assigned as error during trial should not be applied at the penalty phase. Nor can we accept defendant's argument that the \"trial court should have intervened on its own motion to curb the misconduct of the prosecutor.\" In support of this contention, defendant cites several cases, e.g., People v. Perez (1962) 58 Cal. 2d 229, 250 [23 Cal. Rptr. 569, 373 P.2d 617, 3 A.L.R.3d 946]; People v. Williams (1971) 22 Cal. App. 3d 34, 49 [99 Cal. Rptr. 103]; People v. Yuen (1939) 32 Cal. App. 2d 151, 160 [89 P.2d 438], which are clearly inapposite.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In this regard the prosecutor stated: \"The subpoena power of the County Marshall [ sic ] and Sheriff works for the defense as well as it does for us. They can say 'Please go do this,' and that subpoena would be served. They can say 'Appoint us an investigator' and that would be done, as it has been. It wasn't because it doesn't exist.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The challenged remarks include the following statements: \". . . I did not ask you to proceed against Mr. Gonzales, and . . . that I am asking you to proceed against Mr. Miranda because I believe the evidence is overwhelming as to the factors in aggravation in this case . . . .\" \"I believe, firmly believe that on the evidence presented to you and on the law that you should continue to follow your duty and follow the law in this case as given by the court. If you do, you will find that the factors in aggravation totally outweigh the factors in mitigation. I do not believe you are going to find factors in mitigation . . . .\" \"You have one man, a human being, attempting to eliminate the life of two other human beings calmly and coolly, looking them right in the eye from a close distance apart. As they stand, they are helpless with a counter between them. Bam. Bam. Focusing and refiring. Bam. Calmly walking away . . . . Just on that factor in aggravation alone, Mr. Miranda deserves the death penalty in this case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The prosecutor stated: \"Ladies and gentlemen, the prisons of this state are full of young men and old men. Some of them will serve their time, short time or long time, and they will go about their business, and they will become productive citizens, and some will not, but the prison breaks down a lot . . . There are in the prisons many people who have to work there, guards, nurses, technicians. These are people who have to be there because they are paying their price to society for what they have done. They are, everyone of them, some of them, a lot of them, rehabilitating themselves, and there are people who in the prisons become predators of other prisoners. I would suggest to you that Mr. Miranda has clearly shown you which kind of prisoner he will be in the system. Guards don't deserve to spend their working careers around him. Fellow prisoners do not . . . . You have to decide if it is appropriate for this society to provide for his care for the rest of his life or not. I know it would be inappropriate. It will be your decision. It will not be criticized, no matter which way you make it, but I know it is inappropriate and unfair to other people to have to be around him.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The motion was originally brought by codefendant Gonzales but was later joined by defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Defendant was a member of the \"Frogtown\" gang in Los Angeles. Evidence of defendant's gang membership was excluded during the trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. He testified \"she indicated that she would like to go out with me. She said I seemed nice like and was nice looking and she was attracted to me.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Our issuance of the order to show cause limited to the issue of failure to present mitigating evidence was an implicit determination that in his petition for habeas corpus defendant failed to make a prima facie case as to the other issues presented. (In re Hochberg (1970) 2 Cal. 3d 870, 875, fn. 4 [87 Cal. Rptr. 681, 471 P.2d 1].) With respect to the alleged discriminatory imposition of the death penalty, we note that in McClesky v. Kemp (1987) 481 U.S. 279 [95 L.Ed.2d 262, 107 S.Ct. 1756] the United States Supreme Court held that a statistical showing that Georgia's death penalty is applied more often to Black defendants whose victims were White than to other defendants was insufficient to establish that the death penalty was discriminatorily applied in any particular defendant's case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. In Boyd, supra, we held that the 1978 death penalty law barred the introduction of evidence of defendant's character, background or conduct which was not probative of any specific factor listed in section 190.3. (38 Cal. 3d at p. 775.) We stated, however, that \"[once] the defense has presented evidence of circumstances admissible under factor (k), . . . prosecution rebuttal evidence would be admissible as evidence tending to 'disprove any disputed fact that is of consequence to the determination of the action.' (Evid. Code, § 210.)\" (Id. at p. 776.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Trial counsel's declaration states: \"We were aware of the background of Mr. Miranda from his gang activities and the presense [ sic ] of gang members being in the courtroom who allegedly intimidated members of the jury, . . . [ para. ] It was tactically felt that if the Pandora's Box of his violent background was opened for exploration as a sympathy measure for the jury to peruse that it could have been savagely explored by the prosecution and would have done more harm than good.\" Cocounsel states: \"[I] was aware of defendant/appellant's 'Rap Sheet' and his connections with 'Frog Town Gangs' and whose repeated arrests for gang activity posed an ominous double-edged sword if introduced in the penalty phase. [ para. ] [I] was aware that Section 190.3 of the Penal Code requires notice by the prosecution before evidence in aggravation is introduced. It was a joint tactical decision between defendant/appellant and counsel to avoid bringing in material on behalf of the defendant/appellant which would open the door wide open for the prosecution to introduce evidence in rebuttal, even without notice.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The special circumstance finding must be affirmed because the jury returned a special finding that the killing was wilful, deliberate, and premeditated. This finding, of course, established intent to kill. (See People v. Burgener (1986) 41 Cal. 3d 505, 536-537 [224 Cal. Rptr. 112, 714 P.2d 1251].)\u003c/span\u003e\n\n",
    "body_length": 155822,
    "citedas": [
      "44 Cal. 3d 57",
      "241 Cal. Rptr. 594",
      "744 P.2d 1127"
    ],
    "attorneys": "William J. Owen, under appointment by the Supreme Court, and Albert W. Brodie for Defendant and Appellant and Petitioner. John K. Van de Kamp, Attorney General, William R. Weisman and Frederick Grab, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78",
      "241"
    ],
    "judges": "Opinion by Panelli, J., with Lucas, C. J., Arguelles, Eagleson and Kaufman, JJ., concurring. Separate concurring and dissenting opinion by Broussard, J., with Mosk, J., concurring.",
    "citation_count": 7
  }
}
