{
  "id": "WIOjPmYBTlTomsSBptng",
  "document": {
    "title": "United States v. Realty Multi-List Inc.",
    "full_title": "UNITED STATES OF AMERICA v. REALTY MULTI-LIST, INC.",
    "jurisdiction": "Fifth Circuit",
    "date": "1980-11-14T00:00:00.000Z",
    "docket": "No. 78-2481",
    "body": "At least since the time in 1880 when a group of Irish tenants organized and refused to work on the estate managed by Captain Charles Cunningham Boycott (who, perhaps not so willingly, loaned his name to their tactic), the concerted refusal to deal, or group boycott, has been recognized as an effective means of achieving certain types of economic and political goals. To invoke Captain Boycott's name in the context of contemporary antitrust law, however, is generally to incur legal condemnation.\n\nThis case involves an action brought by the United States under the Sherman Act, 15 U.S.C. ยง 1 et seq.,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e against Realty Multi-List, Inc. (RML), a Georgia corporation formed to operate a real estate multiple listing service. Although there are other issues raised, the basic question presented is whether the membership criteria promulgated by RML are illegal under either the per se rule or the rule of reason because they authorize RML to establish a group boycott of those real estate brokers who fail to qualify under them.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The many nuances of antitrust law presented by this case have plagued the rulemakers, the decisionmakers, and the commentators for the reason that the issues raised fit no facile categories of the jurisprudence. We therefore feel compelled, after a recital of the facts, to attempt to harmonize the sometimes discordant strains that sound in the background of this case and to reach a result in accord with the policies embodied in the Sherman Act.\n\nI.\n\nA.\n\nRML was organized in 1967 by eight state-licensed real estate brokers in Columbus (Muscogee County), Georgia.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Each broker initially paid $200 to purchase one share of stock in the corporation. All subsequent members of RML have also been state-licensed real state brokers in Muscogee County and have been required to purchase a share of RML stock at prices up to $3,000 per share. R.389.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Members pay additional fees for the maintenance of RML and for the provision of various services by RML. R.688a, 697a.\n\nRML's central function-indeed, its raison d'etre -is to provide a multiple listing service for its members. R.686. Through the agreements which form the basis for this service, see Rules and Regulations of Realty Multi-List, Inc., R.686-692a, RML members have obligated themselves to attempt to obtain from sellers \"exclusive\" rather than \"open\" listings\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e of real estate\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and to pool their exclusive listings through RML. RML itself is the hub of the multiple listing service; it acts as the \"central processing and distributing point\" for its members' listings. R.686. RML compiles the listings it receives from its members into a listing book, containing not only the listing data submitted by members, but often photographs of the property as well, and distributes copies to RML members. RML distributes a completely updated listing book each month and provides members with a daily update on new listings and new data on old listings. Using the information provided by RML, member brokers are able to cooperate in bringing together buyers and sellers. A broker may show a prospective purchaser all the properties contained in the RML listing book, identify those properties which meet the purchaser's needs and desires, and show those properties to the purchaser. If the selling broker succeeds in his efforts, he brings the purchaser, the listing broker and the seller together to consummate the transaction. R.690-691. The selling broker and the listing broker then determine, by their own agreement, how the commission on the sale shall be divided. Id.; R.686a.\n\nIn essence, a multiple listing service like RML functions as a trade exchange for the purchase and sale of real estate, an analogy that has not gone unnoticed in the cases and literature dealing with these institutions. See, e. g., Grillo v. Board of Realtors, 91 N.J.Super. 202, 219 A.2d 635, 644 (Ch.Div.1966); Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1353-1359 (1970). The benefits offered by a multiple listing service are manifest:\n\nUse of the multiple has had significant impact on the real estate industry as a whole. This impact is manifested in the reduction of the obstacles brokers must face in adjusting supply to demand: market imperfections are overcome in that information and communication barriers are reduced, along with the easing of the built-in geographical barrier confronting the buyer-seller relationship. Moreover, a realistic price structure is engendered. In effect, real estate becomes by virtue of the multiple \"a more liquid commodity.\"\n\nThe use of the multiples has, in addition, had a significant positive impact on the individual sales transaction. The transactional benefits are fairly evenly distributed among the broker, the buyer, and the seller. In the absence of the multiple, a seller has three alternatives: first, he can sell the property himself, a course of action requiring facilities and expertise which most home owners do not possess; second, he can use an open listing; third, he can give a broker the exclusive right to sell. The multiple allows him to combine the advantages of the last two alternatives and to avoid the dangers of the first. The buyer benefits from the wider selection of purchase opportunities than would be available from the office of a single broker. In addition, there is a time-saving factor: \"The buyer often has to spend only a short time in the office selecting properties to inspect, merely by carefully screening the MLS sheets.\" The broker is particularly benefited by having immediate access to a large number of listings and at the same time by being furnished with a method for quickly and expansively exposing his own listings to a broader market.\n\nId. at 1329-1330 (footnotes omitted). These factors may have a dramatic effect on the business of a member broker. One RML member testified that in the year following his admission to RML his firm's sales doubled and that approximately half of his listings are sold by other members of RML. Deposition of Donald A. Watson at 102-103.\n\nIn addition to these benefits and operational efficiencies, RML provides a number of other services to aid its members in the conduct of their business. An RML member may, for example, affix a lock box, containing a door key, to a listed property, allowing a potential selling broker easy physical access to the property without the consent or presence of the listing broker. The Government has provided a summary of other important advantages offered by RML:\n\nMany other RML services keep members abreast of the real estate market and promote the professional development of the membership. Information concerning new homes and repossessed properties being offered for sale by the United States Veterans Administration is periodically circulated ..., as are mortgage rates being offered by local lenders ..., and comparable sales data for each RML listing sold. RML issues a monthly newsletter, operates a twice-weekly bus tour of homes to familiarize members with new listings ..., and maintains a rotational referral service for customers who call to obtain a broker .... Seminars and instructional clinics are offered .... An ethics and arbitration committee insures compliance with RML's rules and constitutes a forum in which its members can resolve disputes without the necessity for resort to litigation .... An appraisal committee acts when a member questions whether a property is priced at an appropriate level .... Most importantly, RML provides a forum for closer cooperation and greater understanding among members of the same profession ....\n\nBrief for United States at 7 n.8 (citations omitted).\n\nFrom its inception as a group of eight cooperating brokers in 1967, RML had grown by 1976, at the time this suit was filed, to be a significant force in the Muscogee County real estate market. By its own admission, its members \"constitute a vast majority of the active residential real estate brokers in Muscogee County Georgia.\" R.15. In 1976, RML's membership consisted of over 45 member firms with approximately four hundred sales associates. In that same year, it had more than 4,300 listings and over $50 million in sales. Although it had faced competition in the past from other multiple listing services in Muscogee County,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e by the time suit was filed, RML stood alone as the sole multiple listing service in the county.\n\nRML's Rules and Regulations limit the ability of nonmembers to share in the benefits it provides. They prohibit members from allowing a nonmember access to the listing book, its prime resource.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Further, while RML's rules allow members to cooperate with nonmembers on an individual sale of an RML-listed property, they prohibit any member, other than the listing broker, from responding directly to a nonmember's inquiries regarding a listed property,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and the RML office may not disclose any information to nonmembers.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Finally, nonmembers are barred from access to the other services provided by RML. R.686; Deposition of Betty Meroney at 37-39, 52.\n\nB.\n\nIn August 1976, the United States filed suit against RML,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e alleging that, beginning in September 1967 and continuing to the present, RML and its members have conspired together to restrain interstate commerce unreasonably in violation of Section 1 of the Sherman Act, 15 U.S.C.A. ยง 1, as amended. (West Supp.1979).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In particular, the United States contends that RML's present and past membership criteria violate Section 1 and that various other restrictive practices, though now abandoned by RML, were also Section 1 violations. We shall briefly set these charges in context.\n\nWe begin with RML's membership criteria, the principal issue in this suit. From the formation of RML until settlement negotiations on this suit began, its by-laws required an applicant for admission to hold a real estate broker's license in the state of Georgia, to agree to abide by all RML's internal rules, to receive the favorable recommendation of RML's membership committee after it investigated his or her application, to receive an 85% affirmative vote from RML's active members,\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and to purchase a share of RML stock at a price, and subject to other conditions, set by RML's Board of Directors. R.315, 374-375. During negotiations with the United States directed toward avoidance of this suit, RML amended some of these rules. In April 1975, RML reduced the voting requirement for admission from 85% to a simple majority. In October 1975, RML abolished its stockholder voting requirement and instituted its current requirements that an applicant, to be eligible for membership, must:\n\n(b) Have an active real estate office in Muscogee County.\n\n(c) Have a favorable credit report and business reputation.\n\nBy-Laws of Realty Multi-List, Article V, Section 5, R.683a.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e It is undisputed that, to meet the first of these requirements, an applicant must have \"an office kept open during customary business hours.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e R.17. RML relies, in its application of the second requirement, on a \"special character-financial\" report supplied by Equifax Credit Bureau, which report includes personal as well as business and financial information. Although RML adopted these criteria in order to do away with its stockholder voting requirements, if any question regarding an applicant's qualifications is raised by the Equifax report, RML's Board of Directors then votes on the applicant's fitness to be an RML member.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Deposition of Betty Meroney at 94-98; 101-104; 106-107.\n\nRML's revised membership criteria also retain the requirement that the prospective member must purchase one share of stock at \"a price set by the Board of Directors.\" See note 14 supra. As already noted, RML originally charged $200 for a share of stock, but by 1973 the price had risen to $3,000 per share. R.389. During negotiations with the Government, RML lowered the per share price to $1,000, at which it has remained.\n\nThe United States sought a declaration that RML's membership criteria, both in their present and earlier versions, violate Section 1 and also sought an injunction against their enforcement. It sought similar relief relating to other restrictive rules which RML abandoned under threat of the present lawsuit. These rules have (1) prohibited members from joining any other multiple listing service or from advertising open listings; (2) prohibited an unsuccessful applicant from reapplying to RML for six months after being rejected; and (3) imposed a complete moratorium on new membership.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e R.376, 377, 379.\n\nC.\n\nIn the district court, RML moved for summary judgment, based upon affidavits and documentary evidence which, it contended, established that the issues relating to its abandoned practices were moot and that its current practices were not unreasonably restrictive of interstate commerce. After conducting its discovery, including the taking of depositions of RML members and others, the United States also moved for summary judgment. The district court denied the motion of the United States and granted that of RML.\n\nIn a terse opinion, almost entirely devoid of citation to legal authority or to the record, the district court agreed with RML's contentions. The court found that the issues relating to RML's past practices were mooted by RML's abandonment of them and found it unlikely that RML would resume them.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The court also approved all of RML's present membership criteria. First, it held that the \"favorable credit report and business reputation\" standard was reasonable since the inquiry was \"capable of objective determination\" and since the possession of a valid real estate broker's license was not \"conclusive evidence\" of a broker's present fitness to be an RML member. In addition, it held that RML's requirement that a prospective member must keep an office open during customary business hours was reasonable even though it operated to exclude parttime brokers. The court found that this rule was \"reasonably related to the purposes\" of RML since it ensured that all members would be \"readily available for contact and for negotiations and for the closing of transactions.\" The court also feared that parttime brokers might sell or give away the information furnished by RML and thought this rule would serve as valid protection against these practices. Finally, the district court upheld RML's practice of requiring a prospective member to purchase a share of RML stock at $1,000. Any other rule, it held, would be unfair to present RML members who had purchased shares of stock. It also found that the fair value of RML stock was in excess of $1,000 and that, upon the company's dissolution, RML's members could recover their investment. The court concluded that the requirement was reasonable in light of the benefits of membership and was \"hardly likely\" to impose a \"serious impediment\" to any prospective member's desire to join.\n\nThe United States appeals from the summary judgment entered for RML and also contends that summary judgment should be entered in its favor. While we cannot now agree with the latter contention, we do agree with the former and therefore reverse and remand the case to the district court.\n\nII.\n\nWe first review the district court's grant of summary judgment for RML. The Government's position in this case is, in essence, that in light of RML's competitive significance in Muscogee County, RML cannot impose any conditions upon access to its multiple listing service other than the requirements of a valid broker's license from the state of Georgia and the payment of the applicant's proportionate share of the costs of developing, maintaining and improving RML as a going concern, including the accumulation of reasonable reserves. See, e. g., Brief for United States at 34, 35, 42. In keeping with this position, it contends that RML's present membership criteria-the requirements that a prospective member be found by RML to have a \"favorable credit report and business reputation\", that he or she maintain an \"active real estate office\" which is \"open during customary business hours,\" and that he or she pay a fee for a share of stock, currently $1,000, set in the discretion of the RML Board of Directors-are violations of Section 1 of the Sherman Act. Contending that these rules give RML the power to order a group boycott of nonmembers, it advances three alternative legal theories, each of which it contends is sufficient to justify its conclusion. It argues first that RML's membership criteria are so blatantly anticompetitive on their face that the district court should have found them illegal per se and refused to consider any proffered justifications for their lawfulness. Second, it argues that, even if these criteria should be analyzed under the rule of reason, they should still have been held facially unreasonable, without elaborate inquiry into their actual effects in the market. Specifically, asserting that RML is so powerful a force in the Muscogee County market that a broker who is denied access to its listing pool cannot compete effectively with RML members, the Government argues that RML's criteria either do not have legitimate procompetitive justifications or are overbroad to accomplish any legitimate goals of the association, so that their anticompetitive effects must necessarily outweigh any benefit to competition they may produce. Finally, the Government argues that, even if RML's criteria do not warrant outright condemnation under either of these theories, their actual anticompetitive effects should have been found to outweigh their benefits to competition under full rule of reason analysis.\n\nAfter setting out our standards for review of the district court's grant of summary judgment for RML, we shall consider the Government's contentions that the district court erred in finding that RML's membership criteria are not violations of Section 1, either under the per se rule or the rule of reason. Then we shall turn to the question whether the issues as to RML's past practices are moot.\n\nA. Summary Judgment Standards\n\nSummary judgment should only be entered when the pleadings, answers to interrogatories, depositions, affidavits and admissions filed in the case \"show that there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.\" Fed.R.Civ.P. 56(c). See Poller v. Columbia Broadcasting System, 368 U.S. 464, 82 S. Ct. 486, 7 L. Ed. 2d 458 (1962). The burden lies with the movant to demonstrate that no such issue of material fact exists, Keiser v. Coliseum Properties, Inc., 614 F.2d 406, 410 (5th Cir. 1980), and any doubt must be resolved against it. Id. Moreover, the court must draw all reasonable inferences from undisputed facts in favor of the party resisting the motion in determining whether any genuine issue exists. American Telephone \u0026 Telegraph Co. v. Delta Communications Corp., 590 F.2d 100, 101-102 (5th Cir.), cert. denied, 444 U.S. 926, 100 S. Ct. 265, 62 L. Ed. 2d 182 (1979). Thus, in reviewing the grant of summary judgment for RML, we place upon RML the burden of demonstrating the absence of any genuine and material controversy and draw all reasonable inferences for the Government.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nB. Characterization of RML's Practices\n\nWe first consider the character of the restrictive practices to which the Government objects. The Government's primary concern is with the situation in which a properly licensed broker is barred from access to the multiple listing service because RML has determined that he fails to meet its membership criteria or because he cannot afford the membership fee. In this circumstance, RML's rules require it to deny him access to its pool of listings or to any other of its other services. Moreover, the rules prohibit any RML member from allowing the nonmember access to the listing pool or other RML services.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The problem presented is that addressed in cases involving concerted refusals to deal or group boycotts.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Knowledge of available listings of real estate is a broker's \"stock in trade.\" Marin County Board of Realtors, Inc. v. Palsson, 1976-1 Trade Cases P 60,898 at 68,901 (Cal.Sup.Ct. 1976); Oates v. Eastern Bergen County Multiple Listing Service, Inc., 113 N.J.Super. 371, 273 A.2d 795, 800 (Ch.Div. 1971); Grillo, supra, 219 A.2d at 646. A concerted denial of access to RML's listing service, when RML members have agreed to pool and share their listings, amounts to a group boycott of the nonmember. See, e.g., Oates, supra ; 273 A.2d at 803; Grillo, supra, 219 A.2d at 644. In Silver v. New York Stock Exchange, 373 U.S. 341, 83 S. Ct. 1246, 10 L. Ed. 2d 389 (1963), the Supreme Court, in finding a Section 1 violation when the stock exchange ordered members to remove private wire connections with a nonmember broker, stated:\n\nThe concerted action of the Exchange and its members here was, in simple terms, a group boycott depriving petitioners of a valuable business service which they needed in order to compete effectively as broker-dealers in the over-the-counter securities market.\n\nId. at 1252.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e We must therefore determine whether this group boycott offends Section 1 of the Sherman Act.\n\nC. Application of the Per Se Rule\n\nThe Government contends first that RML's membership criteria-that a prospective member be found to have \"a favorable credit report and business reputation,\" have an office \"open during customary hours of business,\" and purchase a share of RML stock at a fee set in the discretion of the Board of Directors-constitute per se violations of Section 1, and that the district court erred in holding otherwise. It argues that these rules are plainly anticompetitive on their face and, equally plainly, serve no legitimate procompetitive purpose. After careful scrutiny of the case law and the functioning of the multiple listing mechanism, however, we cannot agree that per se treatment is proper.\n\nSince the decision in Standard Oil Co. v. United States, 221 U.S. 1, 31 S. Ct. 502, 55 L. Ed. 619 (1911), the rule of reason has been the basic test for the legality of a business practice which allegedly operates to restrain trade. While application of the rule requires the courts to focus directly-even exclusively-on \"the challenged restraint's impact on competitive conditions,\" National Society of Professional Engineers v. United States, 435 U.S. 679, 98 S. Ct. 1355, 1363, 55 L. Ed. 2d 637 (1978), the scope of the analysis employed by the courts is copious indeed. In his classic formulation of the rule of reason in Chicago Board of Trade v. United States, 246 U.S. 231, 38 S. Ct. 242, 62 L. Ed. 683 (1918), Justice Brandeis adumbrated some of its contours:\n\nThe true test of legality is whether the restraint imposed is such as merely regulates and perhaps thereby promotes competition or whether it is such as may suppress or even destroy competition. To determine that question the court must ordinarily consider the facts peculiar to the business to which the restraint is applied; its condition before and after the restraint was imposed; the nature of the restraint and its effect, actual or probable. The history of the restraint, the evil believed to exist, the reason for adopting the particular remedy, the purpose or end sought to be attained, are all relevant facts. This is not because a good intention will save an otherwise objectionable regulation or the reverse; but because knowledge of intent may help the court to interpret facts and to predict consequences.\n\nId. at 244. Yet this full and searching analysis is not required in the case of every restraint alleged to violate Section 1.\n\nThe per se rule stands as a complementary form of antitrust analysis to the rule of reason. National Society of Professional Engineers, supra, 98 S. Ct. at 1365. As the Supreme Court has recently noted:\n\nIn construing and applying the Sherman Act's ban against contracts, conspiracies, and combinations in restraint of trade, the Court has held that certain agreements or practices are so \"plainly anticompetitive,\" National Society of Professional Engineers v. United States, 435 U.S. 679, 692, 98 S. Ct. 1355, 1365, 55 L. Ed. 2d 637 (1978); Continental TV, Inc. v. GTE Sylvania, Inc., 433 U.S. 36, 50, 97 S. Ct. 2549, 2558, 53 L. Ed. 2d 568 (1977), and so often \"lack ... any redeeming virtue,\" Northern Pac. R. Co. v. United States, 356 U.S. 1, 5, 78 S. Ct. 514, 518, 2 L. Ed. 2d 545 (1958), that they are conclusively presumed illegal without further examination under the rule of reason generally applied in Sherman Act cases.\n\nBroadcast Music, Inc. v. Columbia Broadcasting Co., 441 U.S. 1, 99 S. Ct. 1551, 1556, 60 L. Ed. 2d 1 (1979). (hereinafter cited as BMI) When a class of restraints is determined to fall within this category, a court's task in evaluating its legality is considerably abbreviated. A court need not then inquire whether the restraint's authors actually possess the power to inflict public injury, Klor's, Inc. v. Broadway-Hale Stores, Inc., 359 U.S. 207, 79 S. Ct. 705, 709, 3 L. Ed. 2d 741 (1959); United States v. Socony-Vacuum Oil Co., 310 U.S. 150, 60 S. Ct. 811, 845 n. 59, 84 L. Ed. 1129 (1940), nor will the court accept argument that the restraint in the circumstances is justified by any procompetitive purpose or effect. Continental T.V., Inc. v. GTE Sylvania, Inc., 433 U.S. 36, 97 S. Ct. 2549, 2557 n. 16, 53 L. Ed. 2d 568 (1977); Klor's, supra, 79 S. Ct. at 709; Northern Pacific Railway Co. v. United States, 356 U.S. 1, 78 S. Ct. 514, 518, 2 L. Ed. 2d 545 (1958). The per se rule is the trump card of antitrust law. When an antitrust plaintiff successfully plays it, he need only tally his score. Properly applied, the per se rule is \"a valid and useful tool of antitrust enforcement.\" BMI, supra, 99 S. Ct. at 1556.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIn light of the potency of the per se rule, however, the Supreme Court has recently re-emphasized that the invocation of this conversation-stopper must be limited to those situations which fairly fall within its rationale. In BMI, supra, the court held that defendants' practice of blanketing licensing of copyrighted musical compositions, though it literally involved price fixing, did not fall within the per se rule's rationale since defendants' practices, viewed in their full context, offered the potential for significant competitive advantages for buyers and sellers of rights to use the compositions. 99 S. Ct. at 1556-1557, 1561-1565.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e And in Continental T.V., supra, the Court reversed an earlier holding that some forms of vertical market division were per se illegal. The Court found that there was substantial evidence of the \"economic utility\" of such restraints, 99 S. Ct. at 2561,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and, in effect, reaffirmed the position in White Motor Co. v. United States, 372 U.S. 253, 83 S. Ct. 696, 9 L. Ed. 2d 738 (1963), that more knowledge of the competitive effects of this type of restraint was needed before per se treatment was appropriate.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See Continental T.V., supra, 97 S. Ct. at 2561. These and other recent cases make it clear that the legal characterization of a class of restraints requires \"a judgment about (its) competitive significance\" and that, in formulating their judgment, courts must pay heed to relevant \"economic conceptions.\" National Society of Professional Engineers, supra, 98 S. Ct. at 1365 \u0026 nn. 16 \u0026 17.\n\nIn light of these developments and before passing on whether RML's group boycott is to be declared per se illegal, we must examine the criteria which require a particular type of restraint to be classed within the per se rule. In BMI, supra, the Court stated that per se classification was required when the restraint was \"plainly anticompetitive\" and lacking of \"any redeeming virtue.\" 99 S. Ct. at 1556. To determine whether a restraint falls within this ban, one first must have some conception of the nature of the competition protected by the Sherman Act. This competition cannot be equated simply with business rivalry. Otherwise, the Sherman Act would require the condemnation of any partnership wherein two former rivals agree to combine their resources and cease competing against each other in order to function more efficiently, regardless of whether the two partners were thus enabled to better serve their customers. That the Sherman Act requires no such result has been settled since Judge (later Chief Justice) Taft's classic opinion in United States v. Addyston Pipe \u0026 Steel Co., 85 F. 271 (6th Cir. 1898), aff'd, 175 U.S. 211, 20 S. Ct. 96, 44 L. Ed. 136 (1899). The nature of the competition protected by the Act can perhaps best be divined by looking to the Supreme Court's statements of the Act's goals. In Northern Pacific Railway Co., supra, the Court stated:\n\nThe Sherman Act was designed to be a comprehensive character of economic liberty aimed at preserving free and unfettered competition as the rule of trade. It rests on the premise that the unrestrained interaction of competitive forces will yield the best allocation of our economic resources, the lowest prices, the highest quality and the greatest material progress, while at the same time providing an environment conducive to the preservation of our democratic political and social institutions.\n\n78 S. Ct. at 517. Similarly, in National Society of Professional Engineers, supra, it was stated:\n\nThe Sherman Act reflects a legislative judgment that ultimately competition will produce not only lower prices, but also better goods and services. \"The heart of our national economic policy long has been faith in the value of competition.\" Standard Oil Co. v. FTC, 340 U.S. 231, 248, 71 S. Ct. 240, 249, 95 L. Ed. 239. The assumption that competition is the best method of allocating resources in a free market recognizes that all elements of a bargain quality, service, safety, and durability-and not just the immediate cost, are favorably affected by the free opportunity to select among alternative offers.\n\n98 S. Ct. at 1367. See BMI, supra, 99 S. Ct. at 1562. The emphasis on the \"free opportunity to select among alternative offers\" indicates that rivalry is in fact important to the competition envisioned. In fact, where a practice has no other purpose than the elimination of a business rival, it may readily be condemned. See, e.g., Klor's, supra. On the other hand, when a practice tends to reduce competition of this type, but nevertheless operates to make the market more efficient-thereby aiding in the reduction of prices and the better allocation of resources, for example-then it may still be found, under the rule of reason, to further the Act's goal of aiding competition. See, e.g., BMI, supra; Continental T.V., supra; Chicago Board of Trade, supra. Thus, in regard to exchange of price and other information among competitors, the Supreme Court has stated:\n\nThe exchange of price data and other information among competitors does not invariably have anticompetitive effects; indeed such practices can in certain circumstances increase economic efficiency and render markets more, rather than less, competitive. For this reason, we have held that such exchanges of information do not constitute a per se violation of the Sherman Act.\n\nUnited States v. United States Gypsum Co., 438 U.S. 422, 441 n. 16, 98 S. Ct. 2864, 2875, 57 L. Ed. 2d 854, 872 n.16 (emphasis added). To evaluate the effect of a practice on competition under the Sherman Act, one must look not only to rivalry but to economic efficiency as well.\n\nA practice is \"plainly anticompetitive\" and lacking in \"any redeeming virtue\" under the Sherman Act, therefore, when it can further none of the Act's goals-when it operates to deny to consumers the opportunity to choose among alternative offers without offering the possibility of any joint, efficiency-producing economic activities. See, BMI, supra, 99 S. Ct. at 1562.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e These practices-\"naked restraints of trade,\" White Motor Company, supra, 83 S. Ct. at 702-are those condemned to per se illegality.\n\nA few concluding observations regarding per se rules are necessary. First,\n\nPer se rules ... require the Court to make broad generalizations about the social utility of particular commercial practices. The probability that anticompetitive consequences will result from a practice and the severity of those consequences must be balanced against its pro-competitive consequences. Cases that do not fit the generalization may arise, but a per se rule reflects the judgment that such cases are not sufficiently common or important to justify the time and expense necessary to identify them.\n\nContinental T.V., supra, 99 S. Ct. at 2557 n.16. Thus, when the law declares price fixing to be a per se violation, it is irrelevant that a particular agreement may be between two small firms occupying an insignificant market position: the generalization about naked price fixing retains sufficient validity to govern the legal consequences of the practice. Second, \"(i)t is only after considerable experience with certain business relationships that courts classify them as per se violations of the Sherman Act.\" United States v. Topco Associates, Inc., 405 U.S. 596, 92 S. Ct. 1126, 1133, 31 L. Ed. 2d 515 (1976). When the Courts are uncertain of the competitive significance of a particular type of restraint, they decline to apply the per se label. See Continental T.V., supra, 97 S. Ct. at 2561-2562; White Motor Co., supra, 83 S. Ct. at 702. Finally, courts must be careful not to extend the per se treatment to a type of restraint literally falling within a per se category where the rationale of the generalization is not applicable. Price fixing is perhaps the archetypal Section 1 violation, striking at the \"central nervous system of the economy.\" Socony-Vacuum Oil, supra, 60 S. Ct. 845 n.59. Nevertheless, the Supreme Court has refused to accord per se treatment to practices literally comprehended within the term when, viewed in its full context, the practice appeared potentially to be reasonably ancillary to procompetitive, efficiency-creating endeavors and therefore not a naked restraint of trade. See BMI, supra ;\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Chicago Board of Trade, supra.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nGroup boycotts are among the categories of business behavior which the courts have declared to be per se violations of Section 1. See, e. g., United States v. General Motors Corp., 384 U.S. 127, 86 S. Ct. 1321, 16 L. Ed. 2d 415 (1966); Radiant Burners v. Peoples Gas Light \u0026 Coke Co., 364 U.S. 656, 81 S. Ct. 365, 5 L. Ed. 2d 358 (1961); Klor's, supra ; Fashion Originators' Guild Association v. FTC, 312 U.S. 457, 61 S. Ct. 703, 85 L. Ed. 949 (1941); Eastern States Retail Lumber Dealers' Association v. United States, 234 U.S. 600, 34 S. Ct. 951, 58 L. Ed. 1490 (1914). We have found RML's membership rules literally to constitute a group boycott. \"But easy labels do not always supply ready answers.\" BMI, supra, 99 S. Ct. at 1556. The question we face now, therefore, is whether this type of group boycott falls within the rationale of the per se rule.\n\nWe begin our inquiry with the recognition that \"there is more confusion about the scope and operation of the per se rule against group boycotts than in reference to any other aspect of the per se doctrine.\" L. Sullivan, Antitrust 229-230 (1977). See R. Bork, The Antitrust Paradox 330 (1978). Judge Thornberry in the opinion for this court in E.A. McQuade Tours, Inc. v. Consolidated Air Tour Manual Committee, 467 F.2d 178 (5th Cir.1972), cert. denied, 409 U.S. 1109, 93 S. Ct. 912, 34 L. Ed. 2d 690 (1973), summarized the major cases dealing with this problem:\n\nCases applying per se illegality to collective refusals to deal fall into roughly three categories. The first group, exemplified by Eastern States Retail Lumber Dealers Assoc. v. United States, 234 U.S. 600, 34 S. Ct. 951, 58 L. Ed. 1490 (1914), have involved horizontal combinations among traders at one level of distribution, whose purpose was to exclude direct competitors from the market. Thus, in Eastern States, a combination of retail lumber dealers black-listed lumber wholesalers who sold directly to the retailers' customers. The obvious purpose of the combination-eliminating competition from the wholesalers-placed it \"within the prohibited class of undue and unreasonable restraints.\" 234 U.S. at 612, 34 S. Ct. at 954 ....\n\nKlor's, Inc. v. Broadway-Hale Stores, 359 U.S. 207, 79 S. Ct. 705, 3 L. Ed. 2d 741 (1959), illustrates a second category of group boycott cases, involving vertical combinations among traders at different marketing levels, designed to exclude from the market direct competitors of some members of the combination. For example, in Klor's, a large appliance dealer, Broadway-Hale, used its purchasing power to induce defendant manufacturers and wholesalers to sell only at discriminatory prices to plaintiff, a competing appliance dealer. Since the effect of the agreement was to drive Klor's out of competition with Broadway, the Court found the three-cornered agreement illegal per se, notwithstanding the fact that the manufacturers and wholesalers, not in competition with Klor's, probably had no such anti-competitive motive. See also Radiant Burners, Inc. v. Peoples Gas Light \u0026 Coke Co., 364 U.S. 656, 81 S. Ct. 365, 5 L. Ed. 2d 358 (1961); Six Twenty-Nine Productions, Inc. v. Rollins Telecasting, Inc., 5th Cir.1966, 365 F.2d 478.\n\nUnlike these first two categories, the third group of cases has concerned combinations designed to influence coercively the trade practices of boycott victims, rather than to eliminate them as competitors. The leading case in the area is Fashion Originators Guild of America v. Federal Trade Comm'n, 312 U.S. 457, 61 S. Ct. 703, 85 L. Ed. 949 (1941), in which a group of \"original\" designers refused to sell their creations to retailers who purchased and sold copies of the original designs. In holding this refusal to deal illegal per se, the Court declared that even though the object of the boycott was to prevent the retailers from dealing with manufacturers of the copies and thereby eliminate \"style piracy,\" the coercion practiced indirectly on a rival method of competition precluded application of the rule of reason. See also Kiefer-Stewart Co. v. Joseph E. Seagram \u0026 Sons, Inc., 340 U.S. 211, 71 S. Ct. 259, 95 L. Ed. 219 (1951) (liquor manufacturers' collective refusal to sell to pricecutting wholesalers).\n\nIn all of these cases, the touchstone of per se illegality has been the purpose and effect of the arrangement in question.... We conclude that resort to the per se rule is justified only when the presence of exclusionary or coercive conduct warrants the view that the arrangement in question is a \"naked restraint of trade.\"\n\nTo Judge Thornberry's cogent analysis,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e we must add the following observations. The presence of purposefully exclusionary or coercive conduct is a strong indication that the boycott is a naked restraint of trade; indeed, if no other purposes are present, this purpose will warrant outright condemnation of the practice. In light of our discussion of the per se rule, however, and particularly in light of the BMI case, it is also necessary to inquire further to determine whether the practice is at least potentially reasonably ancillary to joint, efficiency-creating economic activities. In BMI, supra, the Court held that the per se rule was inapplicable to the form of price-fixing practiced by defendants in its blanket licensing system in part because it \"accompanied the integration of sales, monitoring, and enforcement against unauthorized copyright use.\" 99 S. Ct. at 1562. The generalization supporting per se treatment lost its force in that situation, and, even though defendants purposefully \"fixed a price,\" it became necessary to assess under the rule of reason the net competitive impact of the practice when compared to the procompetitive effects of the integration. Id. at 1565. Similarly, with group boycotts, we must be cautious to determine whether conduct whose apparent purposes, standing alone, might warrant per se treatment are reasonably connected to an integration of productive activities or other efficiency-creating activity in such a manner as to require an inquiry into the net competitive effect under the rule of reason. See L. Sullivan, Antitrust ยง 89 (1977).\n\nTurning at long last to the case at hand, we find that, under the analysis set forth above, RML's membership criteria do not warrant per se treatment. \"There is good in the multiple listing system.\" Grillo, supra, 219 A.2d at 644. It is, above all, an effective response to the pervasive market imperfections in the real estate industry.\n\nIn a perfectly competitive market, \"time lags, immobility of capital and labor, ignorance on the part of producer and consumer, ... (and) irrational decisions by buyers and sellers\" are assumed not to exist. Perfect competition is a theoretical concept; all markets are subject to varying degrees of imperfections.... In the real estate industry, imperfections constitute a serious handicap to the seller, the purchaser, and the industry. A critical imperfection arises from the immobility of the product-real property is, of course, immovable. This insurmountable geographical imperfection magnifies the importance of communicating useful sales data. Unfortunately, because of the limitations of local media in areas contiguous to the situs, effective sales promotion is difficult. Moreover, most homeowners do not possess the necessary experience in the specialized field of effectively presenting to the public essential and enlightening information about property offered for sale. Imperfections also arise from the lack of knowledge by both buyer and seller regarding property values and available sources and methods of financing. Always crucial, this information is decisive in a tight money market. Operating as a knowledgeable middleman, the real estate broker can reduce the level and impact of these imperfections. He cannot, however, completely eliminate them; even with the facilities he has, the broker is still confronted with a sizable communication imperfection. One method of achieving a further reduction of imperfections is by resort to the trade exchange format of the multiple listing service.\n\nAustin, Real Estate Boards, and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1353-1354 (1970) (footnote omitted). We have shown how a multiple listing service like RML may reduce these imperfections.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e By serving as a central processing and distributing point for listings of real estate, RML helps reduce \"information and communication barriers\" and ease \"the built-in geographical barrier confronting buyer and seller.\" Id. at 1329. Further, it aids the market in its function as price-setter for properties and financing. Id. It aids the seller by allowing him to give an exclusive listing to a broker, and thus to choose the agent with whom he prefers to deal, while nevertheless enabling him to place his listing in the hands of all RML's members to attempt to procure a buyer. See id. The buyer benefits by gaining access to a wider selection of properties in a shorter time period than would be the case if he engaged a lone broker. Id. The broker himself doubly benefits: he gains a larger inventory to sell and gains broader exposure for his own listings. Id. Finally, RML's other services-such as the furnishing of lock boxes and arbitration procedures-provide clear competitive benefits to all parties.\n\nCertainly the antitrust laws must allow reasonably ancillary restraints necessary to accomplish these enormously procompetitive objectives. And restraints of the general types imposed by RML are not subject to out-of-hand condemnation.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e First, the operation of a multiple listing service is not cost free. While a fee structure could be abused to effectively deter all newcomers from entrance, the service must be allowed to recoup its costs of operation. Further, it may well be necessary to the success of a multiple listing service to establish some standards of competence, professionalism and mode of operation for admission to membership. Indeed the Government implicitly concedes as much by neglecting to challenge RML's requirement that prospective members have a valid state broker's license. More fundamentally, the sharing of listings is the essence of the multiple listing concept. The listing broker retains the primary fiduciary responsibility, with its legal and ethical ramifications, to the property owner. See Brown v. Indianapolis Board of Realtors, 1977-1 Trade Cases P 61,435, at 71,614 (S.D.Ind.1977); Iowa ex rel. Miller v. Cedar Rapids Real Estate Board, 1980-1 Trade Cases P 63,012, at 77,042 (Iowa Dist.Ct.1979). Without some insurance that the brokers who act as subagents to the listing broker through the listing service are responsible and competent, it is possible that neither brokers nor the public will utilize the service, thus forfeiting the benefits it may yield to all. Id. Cf. McQuade, supra, 467 F.2d at 188 (in case challenging exclusion from industry-wide tour guide manual, insurance of responsibility of all included tour operators found necessary to induce listing).\n\nThe purpose and effect of membership criteria of the general types employed by RML are complex. It has been observed that services like RML are \"basically self-restricting entities\" whose primary intent is \"to impose internal, not external, restraints.\" Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1326, 1340 (1970). While some restraints may in fact be basically internal,\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e membership criteria have both internal and external significance. While they limit a member's freedom to deal with nonmembers, and thus deny to the member potential sellers of his listings, they also are designed to exclude from membership those who do not meet them. See, e. g., Collins, supra, 304 A.2d at 496; Oates, supra, 273 A.2d at 803; Grillo, supra, 219 A.2d at 646-647.\n\nIn light of these complex intentions and effects and the potential connection to the achievement of significant economic efficiencies, we cannot subject RML's membership criteria to per se treatment. We need to know more about the justifications for the particular restraints imposed and their competitive significance before we can judge their legality. This type of analysis takes place under the rule of reason.\n\nD. Application of the Facial Unreasonableness Theory\n\nThe Government argues that, even if RML's current membership criteria are held not to constitute per se violations, the district court erred in holding them facially reasonable, in light of RML's power in the Muscogee County real estate market, because they lack sufficient grounding in the competitive needs of the listing service or because they are broader than is necessary to accomplish any legitimate objectives of the service. RML's market power and the competitive importance of its services, the Government claims, make it essential that its membership rules not possess the potential arbitrarily to exclude any prospective member.\n\nThis argument is, of course, a version of the rule of reason. When analysis shifts from per se to rule of reason, new factors become relevant. We may no longer completely avoid the issues of the market power of the combination or the validity of the competitive justifications given for the precise restraint imposed. But as the Supreme Court has recently stated, the rule of reason gives the Sherman Act \"both flexibility and definition.\" National Society of Professional Engineers, supra, 98 S. Ct. at 1363. It gives definition by focusing analysis solely upon the competitive significance of the restraint involved. Id. Its flexibility inheres in the fact that it requires the courts to void any restraint whose anticompetitive effects outweigh its contributions to competition. Id. at 1363-1365. As we shall show, this flexibility allows the courts to reach and void on its face any significantly restrictive rule of a combination or trade association with significant market power, which lacks competitive justification or whose reach clearly exceeds the combination's legitimate needs. Under this theory of facial unreasonableness, the Government asserts, RML's membership criteria should have been found invalid.\n\n1. Competitive Harms of Exclusion\n\nWhen a group of competitors like the members of RML join together to cooperate in the conduct of their business, there naturally arise antitrust suspicions. As Adam Smith, the archangel of the free enterprise system, observed, \"People of the same trade seldom meet, even for merriment or diversion, but the conversation ends in a conspiracy against the public or in some contrivance to raise prices.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e While, as we have shown, a trade group like a multiple listing service may create significant competitive advantages both for its members and for the general public, there exists the potential for significant competitive harms when the group, having assumed significant power in the market, also assumes the power to exclude other competitors from access to its pooled resources. One may isolate two factors whose presence indicates the greatest danger of this type. First, one can access the degree to which the association is involved in the actual business activities of its members. The more directly the association is involved in its member's business, the more likely it is that exclusion from membership will produce concrete anticompetitive effects. Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1345 (1970). Since a multiple listing service like RML \"is directly engaged in the buying and selling process, its duplicatory connection with the business interests of individual brokers is manifest.\" Id. Second, one may determine whether the association possesses sufficient economic power \"to shape and influence the economic environment of particular field involved.\" Id. at 1345-1346. This determination will, of course, turn on the facts of the case at hand. See generally Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,901; Bodner, Antitrust Restrictions on Trade Association Membership and Participation, 54 A.B.A.J. 27 (Jan. 1968).\n\nThus, when the association possesses the requisite market power, membership in the listing service becomes essential to a broker's ability to compete effectively, and the unreasonable (in competitive terms) exclusion of a broker may create unjustified harm to the broker and the public. The harm to the excluded broker is the mirror image of the benefits to members. Whereas members gain wide exposure of their listings, with numerous potential sellers, the nonmember remains dependent upon his individual efforts to find a buyer. Similarly, the nonmember will have only those listings which he has personally procured to sell. \"He has only a limited supply of \"shoes on the shelves.' \" Oates v. Eastern Bergen County Multiple Listing Service, Inc., 113 N.J.Super. 371, 273 A.2d 795, 800 (1971). Denial of access to the service may thus directly and indirectly\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e impair a nonmember broker's ability to compete effectively with members. As one court has observed, \"under these circumstances, one does not need an advanced degree in economics to predict whose services a buyer or seller of a home is likely to engage.\" Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,900.\n\nBuyers and sellers are also harmed by unjustified exclusions. Even though member brokers still compete with each other to procure listings\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e and to sell any listing in the pool, the public is denied the incentive to competition that new entry may bring. Cf. Associated Press, supra, 65 S. Ct. at 1421 (harm to competition from wire service bylaws which tended to limit new entry into newspaper field); id. at 1424 (harm created by barriers to new entry not alleviated by fact that existing papers supplied AP news to public). A new entrant into the market might, for example, be more aggressive and willing to accept a lower commission rate. Exclusion of such a broker would tend to reduce the amount of price competition in the market. See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,900-68,901. Moreover, consumer choice would be limited in another way:\n\nA person wishing to sell or buy a home may believe that a particular nonmember is more competent than available members. But if the consumer wishes to have ready access to a large market in a short period of time, he may be forced to deal with a less desirable member broker or salesman.\n\nId. Thus, where a broker is excluded from a multiple listing service with the requisite market power without an adequate justification in the competitive needs of the service, both the broker and the public are clearly harmed.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The cases show that, in these circumstances, the exclusion from the association will be found to violate Section 1. See e. g., Silver, supra, 83 S. Ct. at 1252; United States v. St. Louis Terminal Railroad Association, 224 U.S. 383, 32 S. Ct. 507, 56 L. Ed. 810 (1912);\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Gamco, Inc. v. Providence Fruit \u0026 Produce Building, Inc., 194 F.2d 484 (1st Cir.), cert. denied, 344 U.S. 817, 73 S. Ct. 11, 97 L. Ed. 636 (1952); American Federation of Tobacco Growers v. Neal, 183 F.2d 869 (4th Cir. 1950); Blalock v. Ladies Professional Golf Association, 359 F. Supp. 1260 (N.D.Ga.1973); United States v. Southwestern Greyhound Lines, Inc., 1953 Trade Cases P 67,470 (N.D.Okl.1953). Cf. Deesen v. Professional Golfers' Association of America, 358 F.2d 165 (9th Cir.), cert. denied, 358 U.S. 846, 87 S. Ct. 72, 17 L. Ed. 2d 680 (1966) (exclusion from PGA sponsored golf tours found competitively reasonable in light of necessity for some limitation of size of playing field).\n\nAfter having identified some of the competitive benefits and dangers of an association like RML, the task of antitrust law is to define judgmental standards which will, insofar as is possible, minimize the latter and not interfere with the former. It will, as we shall show, be possible in many cases to determine the reasonableness of an association's rule on its face by gauging its justification in terms of the competitive needs of the association and by examining the rule itself to determine if it is drawn in such a manner as to further that need without unnecessarily trampling competitive opportunities. It is under this analysis that we must determine whether the district court correctly upheld RML's rules.\n\n2. Market Power\n\nSince RML is directly involved in the business of its members, see p. 1370, supra, our threshold inquiry in determining its competitive significance is as to the market power of the association. Id. For purposes of reviewing the grant of summary judgment to RML, we take residential housing in Muscogee County as the relevant market.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Our inquiry then becomes whether RML possesses sufficient power in this market that an exclusion not reasonably grounded in competitive needs produces the kind of competitive harm outlined above.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nWhile \"(t)he issue of market power is inescapably present in any inquiry about impact on competition,\" L. Sullivan, Antitrust 189 (1977), the question before us is not whether RML has a monopoly in the relevant market; rather, we must determine whether RML is of \"sufficient economic importance that exclusion results in the denial of the opportunity to compete effectively on equal terms.\" Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1346 (1970) (footnote omitted); see Silver, supra, 83 S. Ct. at 1252; L. Sullivan, Antitrust 192, 255 (1977). The reason for the adoption of this standard in a case tried on the facial unreasonableness theory is not complex. As we have indicated, the rules which fall under this approach are those which lack grounding in the competitive needs of the cooperating group or those which are clearly broader than is necessary to protect those needs. These rules, then, are those whose application may create a clear loss to competition, without any compensating gain.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e For this reason, when the cooperating group possesses sufficient market power that a nonmember can no longer compete effectively with members, the restraint must be found to have sufficient adverse competitive impact to violate Section 1.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Cf. Northern Pacific Railway Co., supra, 98 S. Ct. at 521 (requiring, in order to strike down a tying arrangement on its face, a showing of \"sufficient economic power (in the tying product) to impose an appreciable restraint on free competition in the tied product\").\n\nWe do not set strict mathematical standards regarding the level of market power which must be shown; in any given case, the question whether the association has the requisite power may turn on a number of different factors relevant to the structure of the market.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e There are, however, several objective factors which may help to determine the competitive necessity of membership:\n\nThe effectiveness of the multiple listing system can be determined by three methods. The number of brokers who use the services can be ascertained. The greater the number of his rivals who can utilize the benefits of the facilities for daily trading purposes, the greater becomes the economic disadvantage of exclusion to the nonmember. Another approach is to determine the total dollar amount of annual listings sold through the multiple listing system. These figures would indicate the extent of the market that is unavailable and foreclosed to the nonmember as a consequence of exclusion. A final method is to evaluate the efficacy of the multiple as a generator of sales, i.e., the rate of sales (the percentage of actual sales out of total listings over a period of a year) under the multiple as compared with the nonmultiple rate of sales.\n\nAustin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1346 (1970) (footnotes omitted). After analyzing the structure of the market and such indices of market power as those above, the court must form its judgment as to whether the threat posed to competition by arbitrary exclusion from membership is significant enough to warrant the application of the Sherman Act. At the least, when broker participation in the listing service is high, the service itself is economically successful and competition from other listing services is lacking, rules which invite the unjustified exclusion of any broker should be found unreasonable. See id.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nDrawing our inferences from the undisputed facts favorably to the Government in reviewing the summary judgment for RML, we think the record shows that RML has sufficient market power to warrant facial review of its membership rules.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e First, RML has conceded that its members \"constitute a vast majority of the active residential real estate brokers in Muscogee County, Georgia.\" R.15. In 1976, when suit was filed, its membership consisted of over 45 member firms with approximately four hundred sales associates. In addition, in 1976 RML had more than 4,300 listings and over $50 million in sales. In absolute terms, this volume of listings and sales indicates that nonmembers were effectively foreclosed from a not insignificant segment of the market. It is also important to note in this context that RML is the only multiple listing service in Muscogee County; it has, essentially, absorbed the services that arose to compete with it.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Finally, testimony of RML's members indicates its market significance; some termed it a \"very important\" competitive advantage;\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e others deemed membership in RML a competitive necessity.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\n3. Standards for Facial Evaluation\n\nProceeding from the premise, then, that RML has the requisite power in the market, we turn to the standards for the evaluation of its membership criteria. First, the rules must be shown to be justified by the legitimate competitive needs of the association. Our analysis must focus \"directly on the challenged restraint's impact on competitive conditions,\" National Society of Professional Engineers, supra, 98 S. Ct. at 1363, for \"(t)he true test of legality is whether the restraint imposed is such as merely regulates and thereby perhaps promotes competition or whether it is such as may suppress or even destroy competition.\" Chicago Board of Trade, supra, 38 S. Ct. at 243. As we have shown, while RML creates a number of significant competitive benefits, any exclusion from membership carries the potential for competitive harm; our inquiry here, therefore, is whether the RML criteria which give it power to exclude brokers have legitimate justifications in the competitive needs of the association itself. See e.g., National Society for Professional Engineers, supra; Chicago Board of Trade, supra; Hatley, supra, 552 F.2d at 652-653; McQuade, supra, 467 F.2d at 188; Deesen, supra, 358 F.2d at 170-171; Gamco, supra, 194 F.2d at 487-488; Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,901. Second, the requirements of the rules themselves must be reasonably necessary to the accomplishment of the legitimate goals and narrowly tailored to that end.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,901. See, e.g., Hatley, supra, 552 F.2d at 652-653; McQuade, supra, 467 F.2d at 188; Gamco, supra, 194 F.2d at 487-488. See generally L. Sullivan, Antitrust 255 (1977);\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e R. Bork, The Antitrust Paradox 335-337 (1978). See also id. at 278-279; L. Sullivan, Antitrust ยง 88 (1977). When the rules fail to measure up to these standards, the justification asserted for them fails. They have, in essence, an anticompetitive effect which has no countervailing procompetitive benefit.\n\nIf this analysis indicates that the rule gives the association power to produce such harm, the rule may be condemned on its face, without proof of past effect. \"Combinations are no less unlawful because they have not as yet resulted in restraint. An agreement or combination to follow a course of conduct which will necessarily restrain or monopolize a part of trade or commerce may violate the Sherman Act, whether it be \"wholly nascent or abortive on the one hand, or successful on the other.' \" Associated Press, supra, 65 S. Ct. at 1421. Moreover, it is irrelevant that the restrictive practice may not be strictly enforced by its terms; it is the power to bring about the unjustified anticompetitive effect which the Sherman Act condemns. See, e.g., Northern Pacific Railway Co., supra, 78 S. Ct. at 521-522; St. Louis Terminal Railroad Association, supra, 32 S. Ct. at 512, 514.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\na. The Government argues that RML's \"favorable credit report and business reputation\" standard should have been held unreasonable on its face and that the district court erred in approving it. It asserts first that, in light of the comprehensive statutory scheme for the licensing and regulation of real estate brokers in Georgia, RML cannot establish itself as an extra-governmental body to impose additional standards for those entering the profession. Second, the Government contends that even if the imposition of some additional standards may be justified, the inherent subjectivity of RML's standards renders them overly broad.\n\nWe examine first the possible justifications for the \"favorable credit report and business reputation\" standards. To begin, there are no finite limitations on the size of a multiple listing service like the size limitations necessary to the operation of some sports leagues, see, e.g., Deesen, supra, 358 F.2d at 170, or inherent in the allocation of space in a market building, see, e.g., Gamco, supra, 194 F.2d at 487; indeed, a multiple listing service succeeds in its goals of creating a public market and reducing market imperfections only insofar as it brings all brokers and listings into its operation. See Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1357 (1970); note 42 supra. Thus, any claimed rationale for exclusion from a multiple listing service must be closely scrutinized in terms of the operational needs of the service.\n\nSimilarly, a multiple listing service may not validly assert a generalized concern with the competency and professionalism of real estate brokers as a rationale for exclusion. While the Supreme Court has indicated that in some circumstances an association may adopt ethical norms which \"regulate and promote ... competition,\" National Society of Professional Engineers, supra, 98 S. Ct. at 1367, it has voided restraints of this type when they produce anticompetitive effects and are not reasonable ancillary to procompetitive activity. Id.; see id., 98 S. Ct. at 1367 n.22. Here, exclusion from the multiple listing service has pronounced anticompetitive effects; unless those effects are counterbalanced by some direct benefit to competition, the regulation must fail.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Again, the adoption of any exclusionary membership criteria must be shown to be justified by the operational needs of the association.\n\nAn association's enforcement of membership criteria founded upon professional and ethical norms has sometimes been justified as necessary to induce individuals in a given business to join the association, and thus necessary to make the association's procompetitive goals a realistic possibility. See, e. g., McQuade, supra, 467 F.2d at 188. This rationale, however, is only partially applicable to a multiple listing service. The service produces its own incentives to membership by presenting the possibility of significant market efficiencies through its pooling of listings and consequent reduction of market imperfections. Membership gives a broker the potential for more efficient operation and hence larger profits by increasing the number of potential sellers for his listings and by increasing the number of listings he has to sell. Similarly, buyers and sellers are attracted to use the service by its ability to offer broader exposure for the sellers' listings and a wider selection of listings from which the buyer may choose.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nThe inducement rationale does afford a justification for some membership criteria based on professional and ethical norms in this case, however, at least in a negative sense. Before they join a listing service, brokers may require some insurance that they will not be endangered legally or ethically by the brokers with whom they enter a listing-sharing agreement. As one court has explained:\n\nAn MLS (Multiple Listing Service) listing, in effect, offers a subagency to every other MLS participant who can sell the listed property as well as the listing broker.... The subagency relationship is the keystone of MLS. Through this subagency appointment, the listing broker authorizes the other broker to show the property, and attempt to procure a ready, willing and able buyer. If the subagent is successful, the listing broker compensates him by splitting the commission according to whatever formula the two brokers deem appropriate. The subagency appointment necessarily creates significant duties and liabilities, both between the brokers themselves, and between the brokers and the public. A listing broker, by virtue of his agency appointment, owes significant legal and moral duties and responsibilities to the property owner. He bears the legal responsibility to the owner for the acts of other MLS participants who show the home. In addition, the listing broker is responsible for any false or misleading statement made by an MLS participant to a potential buyer. Thus, an essential element of the MLS is broker and public confidence that all MLS participants adhere to high and uniform professional standards.\n\nCedar Rapids Board of Realtors, supra, 1980-1 Trade Cases at 77,042. See Brown v. Indianapolis Board of Realtors, 1977-1 Trade Cases P 61,435, at 71,614 (S.D.Ind.1977). Membership criteria reasonably necessary to ensure this protection, and narrowly tailored to this end, may thus be justified in competitive terms and able to survive at least facial review.\n\nRML argues that its requirements that a prospective member have \"a favorable credit report and business reputation\" are justified under this theory and meet the requirements of facial reasonableness. The Government implicitly concedes that some insurance of a member's competence and responsibility may be required by its acceptance of RML's requirement that all prospective members must possess active brokers' licenses from the state of Georgia. The Government contends, however, that in light of Georgia's extensive regulation of the business of real estate brokering, RML's other requirements are not necessary to its operations and that these requirements are so inherently subjective that they cannot be considered narrowly tailored to accomplish any legitimate justification that might underlie them.\n\nA number of courts considering this problem have held that, where a state extensively regulates the licensing and business conduct of real estate brokers, a multiple listing service may not impose additional standards of responsibility and competence on those who seek to join. See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,901; Collins v. Main Line Board of Realtors, 452 Pa. 342, 304 A.2d 493, 497 (1973); Grillo, supra, 219 A.2d at 648. There exists a persuasive argument for this position. When a state extensively regulates a field such as this one, it provides a collective, community judgment as to the standards of professional conduct and responsibility necessary to protect the public from harm.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Moreover, it provides the remedial mechanisms necessary to insure that those standards are adhered to in practice. It thus ill-benefits the judiciary, the argument goes, to engage in its own inquiry as to what is necessary to protect individuals in their dealings with state-licensed brokers.\n\nGeorgia's licensing and regulatory scheme is indeed extensive. It provides that\n\nLicenses shall be granted only to persons who bear a good reputation for honesty, trustworthiness, integrity and competence to transact the business of broker or salesman in such manner as to safeguard the interest of the public, and only after satisfactory proof of such qualifications has been presented to the commission.\n\nGa.Code Ann. ยง 84-1410(a).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Moreover, it provides that applicants who have been convicted of certain crimes involving financial misdealings, such as forgery or embezzlement, or of crimes involving moral turpitude, may for that reason alone be denied a license, Ga.Code Ann. ยง 84-1410(b),\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e and that upon conviction of any of these crimes a broker's license may be suspended or revoked. Ga.Code Ann. ยง 84-1410(c). Applicants for a broker's license must also be at least 18 years of age, have a high school diploma or its equivalent, and have completed additional study in courses related to real estate. Ga.Code Ann. ยง 84-1411(a), (b).\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Moreover, applicants must pass a written examination \"covering generally the matters confronting real estate brokers.\" Id.\n\nLicensing is not the only form of regulation of broker conduct in Georgia. The Georgia Real Estate Commission has power to regulate the conduct of licensees by passing rules and enforcing the provisions of all state regulations. Ga.Code Ann. ยง 84-1405(d).\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Georgia law also requires that brokers maintain a separate checking account, open to inspection by the Georgia Real Estate Commission, for the deposit of all funds received on behalf of a client in a real estate transaction and mandates that a broker shall not be entitled to any part of such fund as his commission or fee \"until the transaction has been consummated or terminated.\" Ga.Code Ann. ยง 84-1419. The Commission may cause the Attorney General of the state to bring an action against any broker who fails to comply with these requirements, to enjoin such failure, or, if necessary, to appoint a receiver. Ga.Code Ann. ยง 84-1420. Finally, Ga.Code Ann. ยง 84-1421 provides that the commission \"may, upon its own motion, and shall upon the sworn complaint in writing of any person, investigate the actions of any\" real estate broker, associate broker, or sales person. After investigation, the Commission conducts a hearing to determine if the individual has violated any of the state's statutes governing the activities of real estate brokers or any rule of the real estate commission, or has committed any unfair trade practice, defined to include, inter alia, various species of fraud, incompetence, or financial misdealing. Id.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e If a broker is found guilty, the Commission has power to censure him, revoke or suspend his license, require further education, or require an independent accounting for his separate trust account. Id.\n\nIn the light of this barrage of state regulation, the Government's argument that RML may reasonably require no more of its prospective members than a valid state license has no little force. Nevertheless, we decline to hold that the presence of an extensive state regulatory scheme automatically bars RML from adopting its own standards of professional competence and responsibility. Giving due weight to the Georgia legislature's judgment as to what is reasonably necessary for the protection of the public in this field, our analysis leads us to the following conclusions: When a multiple listing service seeks to establish the reasonable necessity of membership criteria regulating areas already generally covered by state regulation, it must make a showing either that the legitimate needs of the service require protection in excess of that provided by the state or that the state does not adequately enforce its own regulations.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e If the state has no regulation comparable to that established by the multiple listing service, then the service must make the showing of its rule's justification and necessity which we have already outlined. Under this approach, due respect is given to the state's attempt to determine which individuals should be allowed to act as brokers, while the multiple listing service is allowed to vindicate those operational necessities which enable it to achieve its procompetitive goals.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nWhile neither party in this case has addressed the issue of Georgia's enforcement of its rules, and that issue is thus left open on remand, RML has conceded that its \"favorable credit report and business reputation\" criteria are covered by Georgia law. Brief for Appellee at 32. It does contend, however, that it has a right to make a current investigation into the professional competence and responsibility of a prospective member and points out that broker's licenses are automatically renewable at two year intervals. See Georgia Real Estate Commission v. Howard, 133 Ga.App. 199, 210 S.E.2d 357, 358 (1974). This argument is, in essence, that the state's regulations do not vindicate RML's need for a current assessment of the competence and responsibility of prospective members. Even though we concede the potential necessity of such a current assessment, RML's argument fails to take account of the fact that under Ga. Code Ann. ยง 84-1421, as mentioned above, any member of RML can bring a complaint to Georgia Real Estate Commission if RML's investigation shows that the prospective member is guilty of any professional derelictions. If RML is required to use this means of vindicating its needs, not only is the public interest better served, but the danger of wrongful exclusions from the service, and thus injury to competition, is lessened.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e See Collins, supra, 304 A.2d at 497. In sum, only if RML could show that the state's enforcement of its rules does not vindicate RML's needs could we conclude that it is reasonably necessary for RML to exclude licensed brokers from membership under the rules at issue here.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nEven if RML can make this showing, however, its present rules must be deemed not narrowly tailored to accomplish their legitimate goals. The problem with the requirement of a \"favorable credit report and business reputation\" as a condition of membership is that RML does not define these terms or the type of proof required. The inherent subjectivity of these standards is thus in no way limited. Under these standards, RML could conceivably exclude a broker whose business reputation was unfavorable because he was not sufficiently aggressive or because he was thought of as inefficient, even though he had never violated any relevant law or committed a serious breach of any duty. Similarly, a broker with a reputation as a \"slow pay\" but who had never actually defaulted on any financial obligation, might be excluded because he did not have a favorable credit report. Moreover, under RML's rules, these determinations might be based upon hearsay allegations or subjective impressions of an applicant's reputation or creditworthiness. In sum, RML's criteria allow it to exclude a licensed broker whom, according to RML's subjective evaluation, it determines to be generally unfit to be a member of the service.\n\nIn assessing a rule's potential for anticompetitive effects, a court is entitled to consider the purpose of the restraint because \"knowledge of intent may help the court to interpret facts and predict consequences.\" Chicago Board of Trade, supra, 38 S. Ct. at 244. See BMI, supra, 99 S. Ct. at 1562. Here, statements of RML's members regarding the intent of the criteria at issue reinforce our conclusion that they call for an inherently subjective evaluation of the applicant. One member testified, for example that an applicant meets RML's criteria if he \"has got a license and has a clean record and hasn't been in trouble and hadn't been in Bankruptcy or in lawsuits or charged with any immoral acts.\" Deposition of Charles Lowe at 31-32. In assessing the significance of the applicant's having been \"in trouble,\" this member specified that he would consider not only convictions, but also \"my personal knowledge of the facts.\" Id. Addressing the favorable business reputation requirement, this member stated:\n\nIt has been discussed many times and you get a definition from everybody, it is a different definition. I think that is something a man has to define for himself because my definition of anything and yours is (sic) probably different ..., but I think every man has to let his conscious (sic) define it.\n\nId. This broker was a member of RML's Board of Directors at the time the credit and reputation standards were adopted. R.186-187. Testimony by other brokers who were the members of the Board are of similar import.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e It is thus undisputed that these criteria call for a subjective evaluation of an applicant's fitness for membership.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\nSubjective membership criteria are generally not narrowly tailored to accomplish any legitimate goal of an association. See, e. g., Radiant Burners, Inc. v. Peoples Gas Light \u0026 Coke Co., 364 U.S. 656, 81 S. Ct. 365, 5 L. Ed. 2d 358 (1961); Blalock, supra, 359 F. Supp. at 1265-1266.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e As one commentator has observed in an analogous context:\n\nOnce it is concluded that the program is not an objective one, no further evaluation of benefits to competition which are supposed to flow from the program is appropriate. The potential for harm is so great and the potential for offsetting benefits so small when the program is not objectively run, that the courts will decline to weigh and measure the harms and benefits and will treat the program precisely as they do an explicit boycott.\n\nL. Sullivan, Antitrust 249 (1977). Because RML's \"favorable credit report and business reputation\" criteria give it the power to exclude brokers from membership on grounds not justified by its competitive needs, the district court erred in upholding them. Assuming, as we must, that RML possesses the requisite market power, we conclude that the district court should have held them facially unreasonable.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nb. The Government also argues that the district court erred in holding facially valid RML's requirement that an applicant must have an office \"open during customary hours of business.\" This requirement, the Government points out, gives RML the power to exclude from membership (1) part-time brokers who are engaged in additional lines of endeavor or who otherwise do not choose to maintain full-time real estate offices and (2) brokers who do not choose or cannot afford to hire a full-time staff to keep an office open during customary business hours.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e The Government contends that there is no legitimate justification for a rule which has these effects and that the rule is overly broad to further any other legitimate objectives of the association.\n\nRML's defense takes three lines. First, it argues that its \"customary hours\" rule serves to insure that the applicant will be in a likely position to contribute listings to RML and, since the sharing of listings is the essence of RML's operation, the requirement is justified by its operational needs. Second, RML argues that its \"customary hours\" rule insures that members will be available to conduct negotiations and to service the listings they do furnish and hence is justified. Finally, RML contends that the \"customary hours\" rule has never been applied to exclude brokers of the two classes the Government has identified and that therefore it should not be voided.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e We consider each of the contentions in turn.\n\nIt may well be justified for RML to require that a prospective member be actively engaged in the business of being a real estate broker in order that he may contribute to RML's functioning. But a rule requiring that a broker be actively engaged in the business of brokering is a far cry from one requiring that he maintain an office open during customary hours of business. If, for example, a broker holds another job during regular working hours and works in his brokering business on nights and weekends, he may still be very actively engaged as a broker. Indeed, he may find that his hours as a broker mesh well with those of many clients who also hold down jobs during normal working hours and transact their real estate business in their off-hours. In this manner, the off-hours broker may fulfill a genuine market demand. To exclude all brokers who function primarily in this off-hours market on the ground that some may not be \"actively engaged\" as brokers is clearly a response in excess of need. In such a case as this one, it is incumbent on RML to regulate those practices of its members which are necessary to its functioning, instead of needlessly excluding an entire class of brokers from membership. See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,902.\n\nSimilarly, the \"customary hours\" rule is drawn too broadly to be justified by RML's need to insure that its members be available to service listings and conduct negotiations. As RML asserts, the concept of shared listings, which forms the basis of a multiple listing service, requires that the listing broker be available for negotiations and to close the deal since the listing broker retains the primary responsibility to the seller of the property.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e This need, however, will not support the total exclusion from membership of all brokers who do not maintain customary office hours. Considering again the example of the broker who conducts his real estate business during his \"off hours,\" one cannot conclude that such a broker will not be reasonably available to carry out the duties relevant to his listings. He may for example, be able to conduct many of his servicing and negotiating duties during his off hours\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e and may be able to absent himself from his other job for those duties which cannot be postponed. In fact, it is in the self-interest of a listing broker to make sure that he is available to supply essential services for his listings. One cannot lightly presume that a broker who supplies a listing will forfeit the commission to which he is entitled by failing to service it. Again, to the extent that there exists a danger that brokers will not be reasonably available to service their listings, it is incumbent upon RML to establish rules governing the troublesome practices of its members\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e and not to exclude from membership an entire class of brokers on the basis of an overly broad generalization.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nWe thus find RML's \"customary hours\" rule to be overly broad to accomplish any legitimate goals of the association. RML's final contention is that, since it has never applied this rule to exclude any part-time brokers (even though it concedes none have applied) and does not intend to so apply it, the rule should not be found unreasonable. We cannot accept this contention. In the first place, the requirement by its own terms allows the results about which the Government complains.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e Moreover, there is record evidence to indicate that RML members believe part-time brokers should be excluded and that this rule allows such exclusion.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e Finally, as we have already pointed out,\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e the antitrust laws do not require that we wait until the restraint is accomplished before we hold invalid a rule which gives an association power to produce unjustified anticompetitive effects; the Sherman Act is offended by the power as well as the deed. See, e.g., Associated Press, supra, 65 S. Ct. at 1421; St. Louis Terminal Railroad, supra, 38 S. Ct. at 512. The district court erred in approving the rule.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nc. The Government's next contention is that the district court erred in upholding RML's stock purchase requirement. As noted, RML requires new members to purchase one share of stock \"at a price to be determined by the Board of Directors.\"\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e Noting that RML has established no objective criteria for determining a reasonable purchase price, the Government argues that this rule is invalid on the theory that, in cases such as this one, the unrestricted power to set an entrance fee which is unrelated to either the cost of the service provided or the cost of maintaining the service as a going concern is the power to exclude, and hence to destroy competition.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e We agree.\n\nDoubtlessly, RML must be allowed to establish fee schedules which allow it to recoup its costs of operation and to maintain its viability as a going concern.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e Among those costs which it must be allowed to recover are the start-up costs involved in serving a new member. In addition, it is reasonable to assess a new member a pro rata contribution toward the maintenance and development of RML, including the accumulation of reasonable reserves. To require more than this, however, is to create problems. A sizeable membership fee which bears no relation to the cost factors outlined above may not only create a significant barrier to new entry into the association, but may create \"a strong inference that the amount has been set up as a barrier against\" new applications. Grillo, supra, 219 A.2d at 640; see Austin, Real Estate Board and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1352 (1970). Since the antitrust laws reach the power to create anticompetitive effects, as well as the effects themselves, a rule which allows an association such anticompetitive potential should be held unreasonable.\n\nIn reaching our conclusion, we rely on the Supreme Court's decision in United States v. St. Louis Terminal Railroad Association, 224 U.S. 383, 32 S. Ct. 507, 56 L. Ed. 810 (1912). There a group of competing railroads formed a terminal association which acquired all available means of access across the Mississippi River at St. Louis. Other railroads were allowed to use these facilities only after they obtained the unanimous consent of all the owners and after payment of a use fee.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e The Court found this combination of competing railroads to be acting in unreasonable restraint of trade. Id. at 515.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e Noting, however, that the association served a number of useful, procompetitive purposes through its unification of the terminal systems in St. Louis, id. at 512-514, the Court refused to order dissolution, as the Government requested. Rather, the Court required the association to reform its organizational rules in such a manner as to allow all competing railroads to use its facilities on equal terms.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e Particularly pertinent here, the Court required the association to provide first\n\nfor the admission of any existing or future railroad to joint ownership and control of the combined terminal properties, upon such just and reasonable terms as shall place such applying company upon a plane of equality in respect of benefits and burdens with the present proprietary companies.\n\nSecond. Such plan of reorganization must also provide definitely for the use of the terminal facilities by any other railroad not electing to become a joint owner, upon such just and reasonable terms and regulations as will, in respect of use, character, and cost of service, place every such company upon as nearly an equal plane as may be with respect to expenses and charges as that occupied by the proprietary companies.\n\nId. at 516.\n\nThese requirements are directly relevant here. In order to avoid running afoul of the antitrust laws, RML may not assume the power to set fees at a level greater than its legitimate needs. While it may continue to allow applicants to become joint owners of the service upon \"just and reasonable terms,\" id., and may condition certain rights (such as the right to become a member of the Board of Directors) on such ownership, it must also permit applicants to become members upon the payment of a fee based on its operational needs-one representing, for example, the actual cost of starting up his service and a pro rata contribution toward the costs of the maintenance and development of RML, including the accumulation of reasonable reserves.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e See, e. g., Marin Board of Realtors, 1976-1 Trade Cases at 68,902; Grillo, supra, 219 A.2d at 640.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e Moreover, RML must be allowed to recover the actual costs of its continuing services to members, just as it does now. RML's present stock purchase rule, however, is without justification in its competitive needs, and the district court erred in approving it.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\n\nD. Mootness\n\nWe have thus concluded that the district court erred in granting RML's motion for summary judgment as to the legality of its present practices. We turn now to the district court's conclusion that the question of the legality of RML's past practices is moot.\n\nRML has, in the past, maintained various restrictive practices other than its present membership requirements. Among those practices were (1) a membership voting requirement for admission to the service;\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e (2) a prohibition against belonging to a competing multiple listing service; (3) a prohibition against the advertising of open listings; (4) a prohibition against reapplication to RML for six months after having been rejected; and (5) a complete moratorium on new membership. The Government has contested the legality of all these practices and asserts here that the district court erred in determining that, because RML had abandoned these practices and affirmed that it did not intend to reinstate them, all the issues they presented are moot. We agree.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\n\nIt is well-settled that, in a suit for injunctive relief, the voluntary cessation of allegedly illegal practices in an attempt to avoid suit does not moot the controversy they present. See, e. g., Allee v. Medrano, 416 U.S. 802, 94 S. Ct. 2191, 2198, 40 L. Ed. 2d 566 (1974); NLRB v. Raytheon Co., 398 U.S. 25, 90 S. Ct. 1547, 1549, 26 L. Ed. 2d 21 (1970); United States v. Concentrated Phosphate Export Association, 393 U.S. 199, 89 S. Ct. 361, 364, 21 L. Ed. 2d 344 (1968); United States v. W. T. Grant Co., 345 U.S. 629, 73 S. Ct. 894, 897, 97 L. Ed. 1303 (1953); Ciudadanos de San Juan v. Hidalgo County Grand Jury Commissioners, 622 F.2d 807, 824-825 (5th Cir. 1980). The Court's discussion in W. T. Grant, supra, is particularly pertinent here:\n\nBoth sides agree to the abstract proposition that voluntary cessation of allegedly illegal conduct does not deprive the tribunal of power to hear and determine the case, i. e., does not make the case moot.... A controversy may remain to be settled in such circumstances .... The defendant is free to return to his old ways. This, together with a public interest in having the legality of the practices settled, militates against a mootness conclusion .... For to say that the case has become moot means that the defendant is entitled to a dismissal as a matter of right .... The courts have rightfully refused to grant defendants such a powerful weapon against public law enforcement.\n\nThe case may nevertheless be moot if the defendant can demonstrate that \"there is no reasonable expectation that the wrong will be repeated.\" The burden is a heavy one. Here the defendants told the court that the (alleged violations) no longer existed and disclaimed any intention to revive them. Such a profession does not serve to make the case moot although it is one of the factors to be considered in determining the appropriateness of granting an injunction against the now-discontinued acts.\n\n73 S. Ct. at 897 (footnotes and citations omitted).\n\nSimilarly, in this case, RML's abandonment of the practices described above and its disclaimer of any intention to revive them cannot serve to moot the issues they present. Neither the district court nor RML has cited to any other evidence indicating that it is unlikely that RML will reinstitute these practices, nor has our research discovered any. For these reasons, the district court erred in concluding that the controversy relating to these issues is moot.\n\nWe leave to the district court on remand the question of the legality of these discontinued practices, in light of our discussion of the applicable rules. See note 18 supra. Even if that court finds these practices illegal and issues the declaratory relief that the Government seeks, however, it may still decline to enter injunctive relief unless the Government can show \"that there exists some cognizable danger of recurrent violation, something more than the mere possibility which serves to keep the case alive.\" Id. at 898. Cf. SEC v. Caterinicchia, 613 F.2d 102 (5th Cir. 1980) (refusing injunctive relief to SEC under analogous statutory standard where SEC failed to show likelihood of future violations). While the district court's discretion in this area is broad, it must always be utilized to insure that the public interest is adequately protected from any realistic threat of future injury. See United States v. Glaxo Group, Ltd., 410 U.S. 52, 93 S. Ct. 861, 868, 35 L. Ed. 2d 104 (1973); United States v. Parke, Davis and Company, 362 U.S. 29, 80 S. Ct. 503, 514, 4 L. Ed. 2d 505 (1960).\n\nIII. Conclusion\n\nThere are, in our universe of antitrust precedent, fewer lines of symmetry than we might wish. Nevertheless, with sextant in hand and competition as our lodestar, we have in this case attempted to chart a course that neither sacrifices efficiency nor unduly neglects the commerce that, while waiting upon the shore, looks for an outlet to the sea. Our looks thus commercing with the skies, we have endeavored to make free the channels of commerce here below.\n\nWe have concluded that the district court erred in granting summary judgment to RML. Assuming that RML possesses the requisite degree of economic power in its market, we have concluded that its present membership criteria on their face create restraints on commerce that are not justified by RML's competitive needs. Moreover, we have concluded that the questions presented by the restrictive practices which RML abandoned under threat of suit are not moot and that the district court should have addressed the question of their legality. Still, we cannot grant the Government's request to order the district court to enter summary judgment in its favor. In the first place, the district court did not consider, and the parties have not briefed in this court, the question whether RML's activities have sufficient connection to interstate commerce to invoke Sherman Act jurisdiction. See McLain v. Real Estate Board of New Orleans, Inc., 444 U.S. 232, 100 S. Ct. 502, 62 L. Ed. 2d 441 (1980). In addition, we are not prepared to hold, on the basis of the record and briefs before us, that RML has the degree of economic power in the relevant market which we have shown to be necessary to allow facial review of its membership criteria. Although the existence of such power is a reasonable inference from the record, we think it appropriate to allow the parties to define this issue more clearly on remand in light of our decision. Should the Government choose then to renew its motion for summary judgment, it is free to do so.\n\nAccordingly, the district court's judgment in this case is REVERSED and the case is REMANDED for further proceedings not inconsistent with this opinion.\n\nREVERSED AND REMANDED.\n\n\u003cspan class=\"fn\"\u003e1. Jurisdiction is founded on Section 4 of the Sherman Act, 15 U.S.C. ยง 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. There are no federal appellate court decisions evaluating the membership criteria for real estate multiple listing services, and only a few in the federal district courts. See, e. g., Brown v. Indianapolis Board of Realtors, 1977-1 Trade Cases P 61,435 (S.D.Ind.1977); Oglesby \u0026 Barclift, Inc. v. Metro MLS, Inc., 1976-2 Trade Cases P 61,064 (E.D.Va.1976). We have found some guidance, however, in a number of state court decisions, relying on federal antitrust precedent, which deal with this problem. See, e. g., Iowa ex rel. Miller v. Cedar Rapids Real Estate Board, 1980-1 Trade Cases P 63,012 (Iowa Dist.Ct.1979); Marin County Board of Realtors, Inc. v. Palsson, 1976-1 Trade Cases P 60,898 (Cal.Sup.Ct.1976) (en banc); Blake v. H-F Group MLS, 36 Ill.App.3d 730, 345 N.E.2d 18 (1976); Barrows v. Grand Rapids Real Estate Board, 51 Mich.App. 75, 214 N.W.2d 532 (1974); Collins v. Main Line Board of Realtors, 452 Pa. 342, 304 A.2d 493, cert. denied, 414 U.S. 979, 94 S. Ct. 291, 38 L. Ed. 2d 223 (1973); Oates v. Eastern Bergen County MLS, 113 N.J.Super. 371, 273 A.2d 795 (Ch.Div.1971); Grempler v. Multiple Listing Service, 1970 Trade Cases P 73,204 (Md.Ct.App.1970); Grillo v. Board of Realtors, 91 N.J.Super. 202, 219 A.2d 635 (Ch.Div.1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The facts relevant to the organization and growth of RML and to the promulgation of, and amendments to, its rules, regulations and by-laws are, in general, undisputed. Where there exists any dispute as to a material fact or where there is no evidence relating to such fact, it will be noted in the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The member-stockholders of RML are principal brokers. All sales agents of such member brokers are required to join as associate members. While associate members must agree to abide by RML by-laws, rules and regulations, they pay no dues, hold no stock and have no vote. R.683a. All citations to the record in this case will be in the form used above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In an \"exclusive\" listing, the seller agrees to list with only one broker. The listing broker is then guaranteed a share of the commission even if another broker eventually secures a buyer. In an \"open\" listing, any broker may list and sell the property, and only the selling broker is entitled to the commission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. RML Rules and Regulations require that all new and used single family residences located in Muscogee County for which an RML broker has obtained an exclusive listing be turned in to RML for distribution to all members. Other types of property, such as farmland or commercial property, whether located in Muscogee County or elsewhere, may be listed with RML at the member broker's option. In the event an owner refuses to allow an RML broker to list his property with RML, the listing may be taken by the broker as an office exclusive. The broker must nonetheless provide RML with listing data and cooperate with a member in connection with the sale of such property. R.686-687.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Shortly after RML was formed, a competing multiple listing service was organized under the name Multiple Selling Service, later changed to Columbus Multiple Listing Service. Although it achieved at least a modicum of success, it suffered a severe setback in the early 1970's when most of its active members left to join RML. Deposition of Earl Bowden at 27-30; 51; 73-80; Deposition of Donald Watson at 46-52; Deposition of Ezekial Carter at 10-14. After the Carter Realty Company, one of the competing service's major members and one of Columbus' largest brokerage firms, was rejected by RML, the Carter firm, along with several other brokers, attempted to revitalize the competing service. Despite its success, the effort was abandoned in 1975 when the Carter firm and most of the competing service's members were finally accepted into RML. Deposition of Earl Bowden at 51-51; 61; 80; 84-86; Deposition of Donald Watson at 62-63; 80-81; 83-93; Deposition of Beatrice Breaux at 49-52. Until October 1975, RML's rules prohibited any member from belonging to a competing multiple listing service. R.379.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. RML Rule 5(9) provides: Each member shall keep his file of RML listings confidential and shall see to it that no Broker who is not an RML Member, and no salesperson not associated with an RML Member shall ever have access to them. R.688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. RML Rule 5(8) provides: It is intended that the listing Broker only share or Co-Broker the listing with Non-RML members. Any inquiries from non-RML members must be referred to the listing Broker for information and showing of the property. R.688. See R.686a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Among the duties of RML's central office is the following: \"To maintain a confidential atmosphere in the office, giving out no information to anyone not a member of Realty-Multi-List, Inc.\" R.686.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In October 1973, the Department of Justice advised RML that its membership restrictions and high initiation fees might be in violation of the antitrust laws. R.157-158. During the negotiations which followed, RML, as discussed in the text below, amended some of its rules. On several occasions, representatives of the Department and RML met to attempt to negotiate a consent decree. When they failed to reach an accord on the terms of the decree, the United States filed suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Section 1 provides, in pertinent part: Every contract, combination in the form of trust or otherwise, or conspiracy, in restraint of trade or commerce among the several States, or with foreign nations, is declared to be illegal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The rules provide no standards whatsoever to guide the members in casting their votes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Article V, Section 5 sets forth the following criteria: MEMBERSHIP: To be eligible for membership in Realty Multi-List, Inc., a broker must: (a) Hold an active real estate Principal Broker's license in the State of Georgia. (b) Have an active real estate office in Muscogee County. (c) Have a favorable credit report and business reputation. (d) Agree to abide by the Realty Multi-List, Inc. By-Laws and Rules \u0026 Regulations. (e) Purchase one (1) share of stock in Realty Multi-List, Inc., at a price set by the Board of Directors. A prospective future member's application shall be forwarded to the President of Realty Multi-List, Inc. The President shall submit the prospective member's application to the membership committee for their investigation of the applicant. The membership committee will then report their findings to the President in writing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Although this requirement is nowhere specified in RML's rules, RML has taken the position in this appeal that it so interprets its \"active real estate office\" rule and that, as construed, the rule is valid. We thus treat the requirement as part of RML's Rules and Regulations. The language is derived from the criteria developed by the National Association of Realtors for membership in a Member Board of Realtors. R.234.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. From June 13, 1975, to December 17, 1975, RML also imposed a requirement that, before applying for admission to RML, a broker must have maintained an office of his own for at least six months. R.708-709, 713.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The relief sought by the United States, as summarized in its brief, is a declaration that RML's past and present restrictive rules are unlawful, and ... an injunction ordering that RML: (1) be required to afford access to its listings and related services to any state licensed broker requesting it; (2) be required to charge only fees and dues for access which are reasonably related to a member's pro rata share of the costs of operating defendant, including the accumulation and maintenance of reasonable reserves for developing, maintaining, or improving defendant as a going concern; (3) be prohibited from restricting or limiting the admission of new members (or affiliation of new users) through moratoria on new memberships or affiliations; (4) be prohibited from imposing any restrictions on a member's (or a user's) place of business or office hours; (5) be prohibited from restricting or preventing any member (or user) from advertising any type of real property; (6) be prohibited from preventing any member (or user) from belonging to or utilizing the services of any other multiple listing service; and (7) be restrained from continuing, or renewing any other concert of action having a similar purpose or effect. Brief for United States at 2 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Government has argued that, despite its mootness holding, the district court went on to uphold the legality of RML's past practices by stating near the end of its opinion that \"Defendant's operation has not in the past unreasonably restrained competition....\" In light of the fact that the district court expressly held the controversy regarding the past practices moot and made no inquiry as to the reasonableness vel non of these practices, the opinion cannot reasonably bear the construction the Government puts upon it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In Poller, supra, the Supreme Court observed that summary judgment procedures should be used sparingly in complex antitrust litigation. 82 S. Ct. at 491. This cautionary note does not mean, of course, that they will never appropriate in this type of litigation. See, e. g., First National Bank v. Cities Services Co., 391 U.S. 253, 88 S. Ct. 1575, 20 L. Ed. 2d 569 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The concerted action necessary to establish a Section 1 violation exists in the agreement of RML's members to adopt and apply these rules and membership criteria. See Silver v. New York Stock Exchange, 373 U.S. 341, 83 S. Ct. 1246, 1252 n. 5, 10 L. Ed. 2d 389 (1963); Associated Press v. United States, 326 U.S. 1, 65 S. Ct. 1416, 1421, 89 L. Ed. 2d 2013 (1945).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. For reasons detailed in Part D(3) infra, it is not significant that we are not called upon here specifically to review any one exclusion from RML. Only one individual has in fact been excluded from RML under its present membership criteria, and the Government has not sought an order specifically requiring that he be admitted, although it has suggested that that exclusion was unreasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The district court refused to characterize RML's practices as a group boycott because a listing broker remains free to cooperate with a nonmember on an individual basis for the sale of his listings. The Silver court rejected an analogous argument. It adhered to its characterization of the removal of Silver's private wire services as a group boycott despite \"the fact that the collective refusal to deal was only with reference to the private wires, the member firms remaining willing to deal with petitioners for the purchase and sale of securities.\" Wire service itself was \"a valuable business service germane to petitioners' business and important to their effective competition with others,\" so that concerted withdrawal of access to that service, without any justification, violated Section 1. Id. at 1252 n. 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. \"This principle of per se unreasonableness not only makes the type of restraints which are proscribed by the Sherman Act more certain to the benefit of everyone concerned, but it also avoids the necessity for an incredibly complicated and prolonged economic investigation into the entire history of the industry involved, as well as related industries, in an effort to determine at large whether a particular restraint has been unreasonable-an inquiry so often wholly fruitless when undertaken.\" Northern Pac. R. Co. v. United States, 356 U.S. 1, 5, 78 S. Ct. 514, 518, 2 L. Ed. 2d 545 (1958). See Continental TV, Inc. v. GTE Sylvania, Inc., 433 U.S. 36, 50 n. 16, 97 S. Ct. 2549, 2558 n. 16, 53 L. Ed. 2d 568 (1977); United States v. Topco Associates, Inc., 405 U.S. 596, 609 n. 10, 92 S. Ct. 1126, 1134 n. 10, 31 L. Ed. 2d 515 (1972). Id., 99 S. Ct. at 1556 n. 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Court noted that blanket licensing aided in the effectuation of rights granted under the copyright laws, id. at 1562, accompanied the integration of sales, monitoring and copyright enforcement facilities, id., was, to some extent, a \"different product\" than an individual license, id. at 1563, and did not fully eliminate the presence of price competition. Id. at 1564.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The Court noted that the market impact of these restraints was complex \"because of their potential for a simultaneous reduction of intrabrand competition and stimulation of interbrand competition.\" Id. at 2558.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We need to know more than we do about the actual impact of these arrangements on competition to decide whether they have such a \"pernicious effect on competition and lack ... any redeeming virtue\" (Northern Pac. R. Co. v. United States, supra, 356 U.S. p. 5, 78 S. Ct. 514, (p. 518)) and therefore should be classified as per se violations of the Sherman Act. Id. at 702.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. More generally, in characterizing this conduct under the per se rule, our inquiry must focus on whether the effect and, here because it tends to show effect, see United States v. United States Gypsum Co., 438 U.S. 422, 436, n. 13, 98 S. Ct. 2864, 2873 n. 13, 57 L. Ed. 2d 854 (1978), the purpose of the practice is to threaten the proper operation of our predominantly free market economy-that is, whether the practice facially appears to be one that would always or almost always tend to restrict competition and decrease output, and in what portion of the market, or instead one designed to \"increase economic efficiency and render markets more rather than less competitive.\" Id. (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The Supreme Court in BMI provided one important caveat regarding the characterization of a particular form of a restraint as within or without the per se rule: The scrutiny occasionally required must not merely subsume the burdensome analysis required under the rule of reason, see National Society of Professional Engineers v. United States, 435 U.S. 679, 690-692, 98 S. Ct. 1355, 1364-1366, 55 L. Ed. 2d 637 (1978), or else we should apply the rule of reason from the start. That is why the per se rule is not employed until after considerable experience with the type of challenged restraint. Id. 99 S. Ct. at 1562 n.33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Regardless of whether one concludes that the Court in Chicago Board of Trade reached the proper conclusion, see National Society of Professional Engineers, supra, 98 S. Ct. at 1366 n.19; L. Sullivan, Antitrust ยง 66 (1977), it is clear that its mode of analysis fit the form outlined above. See 38 S. Ct. at 244-245.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Two cases often included in a summary of the Supreme Court's per se group boycott rulings, Associated Press v. United States, 326 U.S. 1, 65 S. Ct. 1416, 89 L. Ed. 2013 (1945), and Silver v. New York Stock Exchange, 373 U.S. 341, 83 S. Ct. 1246, 10 L. Ed. 2d 389 (1963), see McQuade, supra, 467 F.2d at 186, actually do not belong there. Although some of the Court's analysis in Associated Press, supra, is directed toward the problems of group boycotts in the trade association context, see 65 S. Ct. at 1423-1424, the practice which the Court held to be per se illegal is more accurately described as horizontal territorial division. The Court struck down as per se violations the AP bylaws which gave members the right essentially to veto the admission of new members competing in their territories, but explicitly declined to void those rules prohibiting the provision of AP news to nonmembers. Id. at 1425-1426. Justice Douglas, in his concurring opinion, specifically called attention to this aspect of the Court's holding, noting that the decree \"does not direct Associated Press to serve all applicants\" and that membership restrictions, of themselves, pose \"quite different problems.\" Id. at 1427. Cf. United States v. Topco Associates, Inc., 405 U.S. 596, 92 S. Ct. 1126, 31 L. Ed. 2d 515 (1972) (voiding as per se horizontal market division analogous territorial restrictions). Although the broad language of Silver, supra, certainly invites a per se reading, this Court has interpreted it as a rule of reason holding. In Hatley v. American Quarter Horse Association, 552 F.2d 646 (5th Cir.1977), the Court noted: The termination was held to violate Section 1, but the Silver Court did not hold this particular boycott to be illegal per se as might have been expected under Fashion Originators' Guild v. FTC, 312 U.S. 457, 468, 61 S. Ct. 703, 708, 85 L. Ed. 949 (1941), and Klor's, Inc. v. Broadway-Hale Stores, 359 U.S. 207, 79 S. Ct. 705, 3 L. Ed. 2d 741 (1959). Instead it noted that \"absent any justification derived from the policy of another statute or otherwise,\" the defendant's action would have been a per se violation. 373 U.S. at 348-49, 83 S. Ct. at 1252 (emphasis added). Because the Securities Exchange Act of 1934 established a policy favoring self-regulation, the Court proceeded under the rule of reason and ultimately found the boycott illegal. The cryptic phrase \"or otherwise\" has been fastened upon as a signal that a statute is not essential to avoid per se treatment of an apparent group boycott. \"A concerted refusal to deal may, under Silver, be validated by a public policy in favor of collective action. Two types of justification may be postulated: those derived from governmental expressions of purpose, and those which result from the need for self-regulation inherent in the industry.\" Id. at 652 (citations omitted). Although this reading attributes a great deal of meaning to the Court's \"cryptic\" phrase \"or otherwise,\" there is an additional reason for construing Silver as outside the per se principle. The Silver Court focused extensively in its discussion of the exclusion of plaintiffs on the market power of the Stock Exchange and the tremendous significance of its services to plaintiffs' business. These factors, especially the emphasis on market power, are usually not directly relevant to per se analysis, see pp. 1362-1363 supra, but may be vitally important to rule of reason analysis. See pp. 1372-1374 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See p. 1356 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. As the Court explained in Continental T.V., supra, the applicability of the per se rule should be assessed in terms of the general type of restraint involved: The location restriction used by Sylvania was neither the least nor the most restrictive provision that it could have used.... But we agree with the implicit judgment in (U.S. v. Arnold ) Schwinn (\u0026 Co., 388 U.S. 365, 87 S. Ct. 1856, 18 L. Ed. 2d 1249) that a per se rule based on the nature of the restriction is, in general, undesirable. Although distinctions can be drawn among the frequently used restrictions, we are inclined to view them as differences of degree and form.... We are unable to perceive significant social gain from channeling transaction into one form or another. 97 S. Ct. at 2561 n.29 (citations omitted). Similarly, here, we look to whether membership criteria of the general type involved merit per se treatment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. An example of an almost purely internal restraint imposed by RML is its rule governing solicitation of future listings of an exclusive listing held by an RML member. Rule 5(5) of RML's Rules and Regulations provides: During the life of an RML Exclusive, no solicitations on the subject of listing changes or future listing of the property are to be made by any member of RML or his salespeople other than the listing Broker and his salespeople. R.687a. While this rule does affect the property owner, it is clearly intended to govern RML's internal operation and doubtlessly that is its principal effect. RML brokers of necessity disclose their exclusive listings to all other brokers. In order to induce them to disclose the listings, the brokers require some insurance that the disclosure will not afford competitors an opportunity to \"steal\" them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Quoted in Note, Arbitrary Exclusion from Multiple Listing: Common Law and Statutory Remedies, 52 Cornell L.Q. 570 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Indirect effects of denial of membership include, for example, the inability to attract and retain sales people, with a resulting impediment to a firm's ability to expand its operations, see Deposition of Bernard Friedman at 16; Deposition of Donald Watson at 29-30, 35-35, 102; Deposition of T. M. Lowe at 22; Deposition of Clyde Averett at 13; Deposition of Jane Wright at 12, 24; and often a stigma on a broker's professional image. See Deposition of T. M. Lowe at 14-15, 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Under RML's rules, the listing broker always gets a share of the commission no matter who sells the property. R.690-691.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. On a theoretical level, this unjustified exclusion is an example of the predatory use of an economy of scale. As one commentator has explained, The threat of boycott is likely to be particularly effective in the case of cooperating groups because a group often creates an economy of scale to which any firm must have access in order to be profitable. A trader excluded from the Chicago Board of Trade, a broker excluded from the stock exchange, or a professional football team turned out of its league is likely to have a very hard time of it. ... (T)here is no doubt that predation can succeed when the distribution pattern is so much more efficient than the alternative that those forced out of the pattern cannot compete. The technique of predation is the denial of access to an essential economy of scale. Boards of trade, for example, often control such access, and their members may often easily destroy a troublesome rival by expelling him from membership or, perhaps more commonly, may bring a rival into line with the mere threat of expulsion. R. Bork, The Antitrust Paradox 336, 158 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Although the Terminal Railroad case is sometimes read as a monopolization case, see e. g., L. Sullivan, Antitrust ยง 48 (1977), the case also involved a Section 1 charge since the Terminal Association was, in essence, a combination of competing railroads. See 32 S. Ct. at 515. If one reads Terminal Railroad as a Section 1 case, it fits squarely within the rationale of the other cases cited in text, and, in addition, this reading helps to alleviate many of the problems regarding a monopolist's duty to deal raised by the case. See, e. g., L. Sullivan, Antitrust ยง 48 (1977). Cf. Fulton v. Hecht, 580 F.2d 1243, 1248 \u0026 n. 2 (5th Cir. 1978), cert. denied, 440 U.S. 981, 99 S. Ct. 1789, 60 L. Ed. 2d 241 (1979) (making analogous point regarding the Deesen case, cited infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The assessment of the market power of the association, and its consequent potential for inflicting competitive harm, of necessity requires the definition of the relevant market. See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,900. Here, it is undisputed that the relevant product market is the market for residential real estate brokerage services. See id. It is also necessary to assess the relevant geographic market. As one commentator has observed in the context of a case similar to that before us, \"United States v. Times-Picayune Pub. Co. (105 F. Supp. 670 (E.D.La.1950), rev'd on other grounds, 345 U.S. 594, 73 S. Ct. 872, 97 L. Ed. 1277 (1953)) indicated that competitors must be foreclosed from a substantial market or part of a market for there to be restraint under the Sherman Act. If such a substantial impact on competition must be shown, it would seem to necessitate the determination of a relevant geographic market in order that the effect on competition therein may be realistically appraised.\" Note, Arbitrary Exclusion from Multiple Listing: Common Law and Statutory Remedies, 52 Cornell L.Q. 570, 576-578 (1967) (footnotes omitted). See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,900; Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1356 n.196 (1970). The Government has treated Muscogee County as the relevant geographic market in this case, and RML has not suggested otherwise. In reviewing the summary judgment for RML, therefore, we accept this area as the relevant market. Neither party has focused closely on this issue, however, and it will be left open on remand. We call the parties' attention to one important observation on this matter: Courts in rule of reason cases seldom proceed to engage in the meticulous analysis of power that is associated with monopolization cases. The issue is not whether defendants possess monopoly power, but whether they possess a substantial degree of market power. On this issue, a truncated or threshold analysis will suffice. For example, if defendants possess substantial shares of the market for a well differentiated product such as cellophane, we would assume significant power without scrupulous inquiry into cross-elasticity of substitute products. Courts are understandably loath to move into the intricacies and imponderables of thorough-going analysis of power and tend to avoid doing so where the need is not insistent. L. Sullivan, Antitrust 192 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. If an association lacks market power, it is of course unlikely that serious anticompetitive effects will result from exclusions from membership. Thus, in Associated Press, supra, the Supreme Court indicated that an exclusive dealing arrangement between a reporter and his paper or between two papers in different cities would present quite different questions than the arrangement before it. 65 S. Ct. at 1422. Cf. Northern Pacific Railway Co., supra, 78 S. Ct. at 519 (analogous point regarding tying arrangements). A significant proportion of the cases that we have found upholding the membership requirements of multiple listing services rest at least in part upon a finding that the service lacked the requisite market power. See, e. g., Iowa ex rel. Miller v. Cedar Rapids Real Estate Board, 1980-1 Trade Cases P 63,012 (Iowa Dist.Ct.1979); Brown v. Indianapolis Board of Realtors, 1977-1 Trade Cases P 61,435 (S.D.Ind.1977); Blake v. H-F Group MLS, 36 Ill. App. 3d 730, 345 N.E.2d 18 (Ill.App.Ct.1976); Grempler v. Multiple Listing Bureau, 1970 Trade Cases P 73,204 (Md.Ct.App.1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Professor Robert Bork styles restraints of this type \"disguised naked boycotts.\" R. Bork, The Antitrust Paradox 335-337 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. One may expect that, in the case of most multiple listing services, the service will strive toward market dominance. As we have shown, the primary incentive to form a multiple listing service comes from the drive to overcome the market imperfections inherent in the real estate industry. These imperfections are overcome in direct proportion to the service's ability to attract sellers and brokers to bring their listings to it. Thus, at least in theoretical terms, the larger the service, the more effectively it may operate. See Note, Arbitrary Exclusion from Multiple Listing: Common Law and Statutory Remedies, 52 Cornell L.Q. 570 (1967). And, of course, the more the service strives toward this goal, the greater the danger of anticompetitive exclusions becomes. Id. In this case, the facts reveal that RML has in fact undertaken the drive to market dominance. See note 46 infra and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Analysis might be different, for example, in a situation where the market, before the formation of the listing service, was fragmented into a large number of small firms than in an instance where the market was divided evenly between one large firm, which stays out of the service, and a number of small firms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. When these conditions are satisfied, the argument that formation of a new listing service remains a possibility is generally irrelevant. Where the existing service has already achieved significant market power, the formation of a separate competing service can only serve to perpetuate some degree of market imperfection. Moreover, \"(t)he Act does not merely guarantee the right to create markets; it also ensures the right of entry to old ones.\" Gamco, supra, 194 F.2d at 487; see American Federation of Tobacco Growers, supra, 183 F.2d at 872.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As in the case of the relevant market determination, see note 39 supra, we do not consider whether the record establishes this point conclusively, although the Government's evidence, as detailed in text, is strong. Since neither party has focused closely on the degree of RML's dominance in the market, this issue should be open to the parties on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. See note 7 supra. The Government introduced strong deposition testimony that the competing listing service initially went into eclipse and then, after having been revitalized, finally disbanded after RML members indicated that brokers who left the competing service would be admitted to RML. See Deposition of Earl Bowden at 36, 61; Deposition of Donald Watson at 51-53; 85-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See Deposition of Henry Barbian at 27; Deposition of Beatrice Breaux at 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See Deposition of Kaethey Earley at 70; Deposition of Earl Bowden at 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The mode of analysis we outline here is quite similar to that first envisioned under the rule of reason by Judge Taft in his opinion in United States v. Addyston Pipe \u0026 Steel Co., 85 F. 271 (6th Cir. 1898), aff'd, 175 U.S. 211, 20 S. Ct. 96, 44 L. Ed. 136 (1899). After identifying five classes of ancillary restraints upheld by the common law, he stated: It would be stating it too strongly to say that these five classes of covenants in restraint of trade include all of those upheld as valid at the common law; but it would certainly seem to follow from the tests laid down for determining the validity of such an agreement that no conventional restraint of trade can be enforced unless the covenant embodying it is merely ancillary to the main purpose of a lawful contract, and necessary to protect the covenantee in the enjoyment of the legitimate fruits of the contract, or to protect him from the dangers of an unjust use of those fruits by the other party. This very statement of the rule implies that the contract must be one in which there is a main purpose, to which the covenant in restraint of trade is merely ancillary. The covenant is inserted only to protect one of the parties from the injury which, in the execution of the contract or enjoyment of its fruits, he may suffer from the unrestrained competition of the other. The main purpose of the contract suggests the measure of protection needed, and furnishes a sufficiently uniform standard by which the validity of such restraints may be judicially determined. In such a case, if the restraint exceeds the necessity presented by the main purpose of the contract, it is void for two reasons: First, because it oppresses the covenantor, without any corresponding benefit to the covenantee; and, second, because it tends to a monopoly. Id. at 282.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Assume that a group of real estate brokers, through an association, exchanges listings and agrees to share commissions where one broker obtains a listing and another finds a buyer; this arrangement will reduce the incentives of members to provide listings to or to obtain them from non-members. In (this hypothetical) the venture has as a likely consequence a withdrawal of trading opportunities from non-member competitors which may be useful to those competitors in their efforts to compete. If the venture is presently or potentially so powerful that loss of access will greatly reduce the competitive effectiveness of non-member firms, and if firms which want to enter are not permitted to do so on reasonable terms, elaborate analysis is not needed to support the conclusion that any gains in efficiency are outweighed by the anticompetitive effect; indeed, it may be suspected that the stifling effect on non-members may have been a purpose for the venture. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Even if a rule survives this facial analysis, it may still be condemned upon full analysis under the rule of reason, when the court determines its actual effects in the marketplace. Moreover, an individual broker would still be allowed to challenge his exclusion under a valid rule which he alleges has been discriminatorily applied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Membership criteria for a multiple listing service present problems in this regard which are often distinct from those presented by those for a Board of Realtors. As we have already pointed out, a multiple listing service is directly involved in its members' commercial activities; its activities correspond directly with its members' buying and selling process. Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 20 Colum.L.Rev. 1325, 1345-1346 (1970). Arbitrary exclusion from membership thus possesses serious anticompetitive potential. A Board of Realtors, on the other hand, may be less directly involved with its members' business and, therefore, the enforcement of membership criteria founded upon ethical and professional norms may have a less direct impact on competition. Since RML is not affiliated with a Board of Realtors, this case presents this distinction in its starkest form. The California Supreme Court has held in a very similar case that, while a Board of Relators may exclude nonmembers from access to many of its services, it cannot exclude licensed real estate brokers from access to the Board-sponsored multiple listing service. Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,901.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. If one asserts, in support of its reasonableness, that a joint venture affords a significant potential for scale efficiencies not otherwise available, one is also asserting that the call of the venture to its participants is the rather insistent call of a potentially large increase in profits. It can then be argued that if the venturers really regard the venture as yielding significant efficiencies, they ought to be ready to proceed without the added inducement of a license to boycott nonmembers. L. Sullivan, Antitrust 254-255 (1977) (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Indeed, it has been suggested that state-licensing requirements for real estate brokers are themselves so stringent as to have serious anticompetitive effects. See Austin, Real Estate Boards and Multiple Listing Systems as Restraints of Trade, 70 Colum.L.Rev. 1325, 1351-1352 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. A corporation or partnership may be granted a license only if the stockholder or partner holding a controlling interest meets these criteria. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. This section provides in full: Where an applicant has been convicted of forgery, embezzlement, obtaining money under false pretenses, larceny, extortion, conspiracy to defraud, or other like offenses or offenses, or has been convicted of a felony or a crime involving moral turpitude, and has been convicted thereof in a court of competent jurisdiction of this or any other State, District or Territory of the United States, or of a foreign Country, such untrustworthiness of the applicant, and the conviction may, in itself, be a sufficient ground for refusal of a license.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. This additional study consists of either 60 in-class hours in a program approved by the Georgia Real Estate Commission or 15 credit hours in courses related to real estate in an accredited college or university. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Ga.Code Ann. ยง 84-1407 provides: Whenever, in the judgment of the commission, any person has engaged in any acts or practices which constitute or will constitute a violation of this Chapter, the Attorney General may maintain an action in the name of the State of Georgia in the superior court of the county wherein such violation occurred to abate and temporarily and permanently enjoin such acts and practices and to enforce compliance with this Chapter. The plaintiff shall not be required to give any bond. Ga.Code Ann. ยง 84-1408 provides: The commission shall have the full power to regulate the issuance of licenses and to revoke or suspend licenses issued under the provisions of this Chapter and to censure licensees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. \"Unfair trade practices\" include, but are not limited to, (1) refusing, because of race, color, national origin or ethnic group, to show, sell or rent any real estate for sale or rent to prospective purchasers or renters; (2) intentionally advertising material which is misleading or inaccurate or which in any way misrepresents any property, terms, values, policies or services of the business conducted; (3) failing to account for and remitting any money coming into his possession belonging to others; (4) commingling the money or other property of his principals with his own; (5) failing to maintain and deposit in a separate, noninterest-bearing checking account all money received by said broker acting in said capacity, or as escrow agent or the temporary custodian of the funds of others, in a real estate transaction unless all parties having an interest in said funds have agreed otherwise in writing; (6) accepting, giving or charging any undisclosed commission, rebate, direct profit or expenditures made for a principal; (7) representing or attempting to represent a real estate broker, other than the broker holding his license, without the express knowledge and consent of the broker holding his license; (8) accepting a commission or other valuable consideration by an associate broker or salesman from anyone other than the broker holding his license without the consent of the broker holding his license; (9) acting in the dual capacity of agent and undisclosed principal in any transaction; (10) guaranteeing or authorizing any person to guarantee future profits which may result from the resale of real property; (11) placing a sign on any property offering it for sale or rent without the written consent of the owner or his authorized agent, and failing to remove such sign within 10 days after the expiration of listing; (12) offering real estate for sale or lease with the knowledge and consent of the owner or his authorized agent or on terms other than those authorized by the owner or his authorized agent; (13) inducing any party to a contract of sale or lease to break such contract for the purpose of substituting in lieu thereof a new contract with another principal; (14) negotiating a sale, exchange or lease of real estate directly with an owner or lessor if he knows that such owner has a written outstanding contract in connection with such property granting an exclusive agency or an exclusive right to sell to another broker; (15) accepting employment or compensation for appraising real estate contingent upon the reporting of a predetermined value or issuing an appraisal report on real estate in which he has an undisclosed interest; (16) soliciting, selling or offering for sale real estate by offering free lots or conducting lotteries for the purpose of influencing a purchaser or prospective purchaser of real estate; (17) paying a commission or compensation to any person for performing the services of a real estate broker, associate broker or real estate salesman who has not first secured his license under this Chapter or is not cooperating as a nonresident who is licensed in his state of residence: Provided, that nothing contained in the subsection or any other provision of this section shall be construed so as to prohibit the payment of earned commissions to the estate or heirs of a deceased real estate broker, associate broker, associate broker or real estate salesperson when such deceased real estate broker, associate broker or real estate salesperson has a valid Georgia real estate license in effect at the time the commission was earned and at the time of such person's death; (18) failing to include a fixed date of expiration in any written listing agreement, and failing to leave a copy of said agreement with the principal; (19) failing to deliver, within a reasonable time, a completed copy of any purchase agreement or offer to buy or sell estate to the purchaser and to the seller; (20) failure by a broker to deliver to the seller in every real estate transaction, at the time said transaction is consummated, a complete, detailed closing statement showing all of the receipts and disbursements handled by such broker for the seller, or failure to deliver to the buyer a complete statement showing all money received in said transaction from such buyer and how and for what the same was disbursed; the broker shall retain true copies of such statements in his file; (21) making any substantial misrepresentations; (22) acting for more than one party in a transaction without the knowledge of all parties for whom he acts; (23) failure of an associate broker or salesman to place, as soon after receipt as is practicable possible, in the custody of the broker holding his license, any deposit money or other money for funds entrusted to him by any person dealing with him as the representative of his licensed broker; (24) filing a listing contract or any document or instrument purporting to create a lien based on a listing contract for the purpose of casting a cloud upon the title to real estate when no valid claim under said listing contract exists; (25) having demonstrated unworthiness or incompetency to act as a real estate broker of salesman in such manner as to safeguard the interest of the public; or any other conduct whether of the same or a different character than heretofore specified which constitutes dishonest dealing; (26) obtaining an exclusive listing or sales contract from any owner knowing or having reason to believe that another broker has an exclusive listing on the property, unless he has written permission from the broker having the first exclusive listing; (27) failing to keep for a period of three years a true and correct copy of all sales contracts, closing statements and other documents relating to real estate closings, or failing to produce documents at the reasonable request of the commission or any of its agents for their inspection; (28) being or becoming a party to any falsification of any portion of any contract or other document involved in any real estate transaction. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. In Barrows, supra, 214 N.W.2d at 535, 540, the court gave little weight to the presence of state regulation of brokers where there was expert testimony indicating that the state regulatory scheme was inadequate to meet the needs of the multiple listing service. Similarly in Cedar Rapids Real Estate Board, supra, 1980-1 Trade Cases at 77,040, the court accorded minimal significance to the state regulatory scheme where evidence showed that the state's real estate commission regularly referred complaints to the local board for resolution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. A court must presume that the state's legislative determination of what is necessary for public protection is correct and that the state adequately enforces its rules and regulations. Thus the burden of showing that it requires protection greater than that provided by the state or that the state does not adequately enforce its rules must rest upon the association.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Rule 15, Article 5, of RML's Rules and Regulations provides: It is the duty of the Realtor to protect the public against fraud, misrepresentation, and unethical practices in real estate transactions. He should endeavor to eliminate in his community any practices which could be damaging to the public or bring discredit to the real estate profession. The Realtor should assist the governmental agency charged with regulating the practices of brokers and salesmen in his state. R.691a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Conceivably, RML might validly establish a rule barring admission of an applicant to membership while any charges brought against him with the Commission are pending. Upon the resolution of the charges favorably to the applicant, however, the justification for exclusion would expire.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. One of these members defined the criteria as requiring an applicant to be \"a person of high moral turpitude,\" with a \"high degree of judiciary capacity\"; \"I want to be sure, before I vote for him that he is a fellow that I don't mind coming into my house.\" He added that \"a favorable credit report is just what it says it is(. I)t is a sort of a gauge of what sort of businessman this is that is asking to come in and associate with a majority of the brokers in Columbus ....\" Deposition of Robert Rowe at 25-26. Another testified that the criteria required that an applicant be \"doing business on a creditable scale\" and conceded that \"each person would have a different value and idea of what is a favorable business reputation.\" Deposition of George Adams at 37. See Deposition of Wendell Lewis at 19-20; Deposition of Charles French at 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. RML has contended in its brief on this appeal that its \"favorable credit report and business reputation\" standards are interpreted in accordance with the 8-point membership criteria of the National Association of Realtors (NAR). The NAR criteria define their \"sound credit rating\" standard in the following terms: By \"sound credit rating\" is meant that the applicant is not involved in any pending bankruptcy or insolvency proceedings or otherwise involved in financial problems which could reasonably be expected to jeopardize those persons doing business with him. The evaluation of an applicant's credit rating shall be based on objective data and not on rumor or a general reputation for being \"slow pay.\" R.235. The NAR criteria define their \"favorable business reputation in the community\" standard as follows: By \"favorable reputation in the community\" is meant that the applicant is not subject to any unresolved charges of civil rights violations, violations of consumer protection laws, violations of the real estate license laws, or other violations of law. It is not intended that \"reputation\" be evaluated on subjective impressions or hearsay. R.234. If RML did in fact adhere to these standards, a more difficult question would be presented. See note 63 supra. But as we have shown, neither the RML rules themselves nor the testimony of RML members support the contention that its rules incorporate these qualifications. Moreover, in light of the evidence mentioned, the district court's suggestion that RML's criteria are \"capable of objective determination\" (emphasis supplied) is irrelevant. Nor can we attribute any great significance, in the circumstances, to RML's use of \"special character financial\" reports from the Equifax Credit Bureau. In addition to business and financial information, these reports contain personal information, such as an evaluation of the applicant's marital status, drinking habits and neighborhood, which the Board of Directors considers in evaluating an applicant's fitness to be an RML member. Deposition of Betty Meroney at 95-96, 106-107, 166-167. Further, RML members are allowed to supply any additional information they personally possess about the applicant to the Board for its consideration. Id. at 167-169, RML does not seek to verify any of this information with the applicant himself, nor does it notify the applicant of the reasons for his rejection. Id. at 169-170; R.701-703. Procedures of this type cannot cure the subjectivity inherent in the standards themselves. Cf. Hatley, supra, 552 F.2d at 653.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. It has been suggested that in some cases the association cannot define its membership criteria in objective terms. For example, courts have pointed out that it may be impossible to establish fully objective measures of an individual's ability to play golf in a competitive manner, see Deesen, supra, 358 F.2d at 167 or of what constitutes a quarter horse. See Hatley, supra, 552 F.2d at 652-653. In this case, however, it is clear that RML can more objectively define its membership criteria than it has done in its present rules. The standards adopted by the NAR establish this point beyond cavil. See note 65 supra. In light of Georgia's regulatory scheme and the danger of anticompetitive exclusions, it is incumbent upon RML to define its criteria with more particularity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Our conclusion that these criteria are not narrowly tailored to serve any legitimate goal of RML is the only reasonable inference from the undisputed facts, as our analysis demonstrates. We leave open on remand the questions of market power and state preemption of this area of regulation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Georgia law neither requires, nor permits, the Georgia Real Estate Commission to consider a broker's office hours in granting or refusing a license or in any of its other regulatory activities. See O'Neal v. Georgia Real Estate Commission, 129 Ga.App. 211, 199 S.E.2d 362 (1973). For this reason and also because RML's attempted justifications are based on needs peculiar to a multiple listing service, we have no question of state preemption of this area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. RML has not argued, nor could it do so successfully, that this requirement is justified by reference to its need to insure the competence and responsibility of its members. The exclusion of brokers who do not maintain customary office hours on the theory that it promotes this goal would clearly be a response in excess of need. See Marin County Board of Realtors, supra, 1976-1 Trade Cases at 68,902. In addition, the district court's conclusion that this rule was justified because it prevented the excluded brokers from selling or giving away the confidential information supplied by RML is simply erroneous. There is no reason to conclude that the class of brokers excluded by this rule is more likely to commit these acts than is any other group. Moreover, RML has a specific rule prohibiting the disclosure of such information. See note 8 supra. On this appeal, RML has not defended the rule on the grounds asserted by the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. For example, RML's Rule 12(1) provides in pertinent part: All offers must be submitted to the listing Broker for presentation to the seller. Under no circumstances is the selling Broker or his agents permitted to make direct contact with the seller without permission from the listing Broker. The selling Broker or agent normally may accompany the listing Broker to present the offer as a silent party. Only by invitation of the listing Broker may the selling Broker speak during the time the offer is being submitted to the seller. The final authority whether the selling Broker accompany the listing Broker rests exclusively with the listing Broker. R.690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. RML's lockbox system, whereby a lockbox containing a house key is affixed to the listed property and every member can obtain a master key to the lockbox, alleviates some of the burdens of servicing a listing. By gaining access to the house key in this manner, the selling broker can show the property without the presence or consent of the listing broker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. RML might, for example, require that all members furnish a set of phone numbers at which they can be reached and might establish precise sanctions for brokers who fail to service their listings in a reasonable manner. In fact, RML already has some rules of this type, the violation of which could be sanctioned under existing procedures. Rule 12(1) provides in pertinent part: The listing Broker shall see that any offer is presented promptly to the seller for his consideration. If the listing agent or the listing Broker is unavailable to present the offer within a reasonable time, then the listing Broker should have an established procedure who in his firm will present offers. The offer must be presented to the seller within a reasonable time. Under no circumstances will the selling Broker or his agent without express permission from listing Broker or his agent be allowed to make direct contact with the seller. R.690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. The fact that it may be more socially convenient for a majority of RML's members to conduct all their business during customary working hours does not serve to justify RML's practices in competitive terms. See L. Sullivan, Antitrust 178-179, 186-189 (1977). As we have shown, the Sherman Act looks only to a restraint's effect upon competition. In Chicago Board of Trade, supra, where the Supreme Court upheld a trade exchange rule prohibiting the making of prices after the close of established trading hours, the Court found that the practice promoted competition by making the day market more perfect. 38 S. Ct. at 244-245. See BMI, supra, 99 S. Ct. at 1564 n.41; National Society of Professional Engineers, supra, 98 S. Ct. at 1366 n.19. Here, by contrast, the market is \"made\" when a listing is submitted to RML and circulated to its members. As long as RML members reasonably service their listings, the hours they keep is a matter best left to their own personal preference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. The district court also construed this rule to allow these results. R.1734.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. The minutes of RML's July 9, 1976, Board of Directors' Meeting, for example, indicate the RML erroneously believed that the Georgia Real Estate Commission would either refuse a license to, or would revoke the license of, a broker who intended to practice on less than a full time basis. Those same minutes indicate that RML's attorney advised RML against signing a proposed consent decree because it eliminated the customary hours rule and would permit \"a serviceman in the performance of full time duty (to) be allowed membership in RML, just as any other broker ....\" R.705. See Deposition of Earl Bowden at 98-99; Deposition of Donald Watson at 128-134; Deposition of Kaethey Earley at 48-49; Deposition of Jane Wright at 35-36; Deposition of Ezekial Carter at 46-47; Deposition of Henry Barbian at 33-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. See pp. 1375-1376 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Our conclusion that RML's \"customary hours\" rule is overly broad is the only reasonable inference from the undisputed facts; thus, assuming that RML possesses the requisite market power, the rule should be stricken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. RML's present price for a share of stock is $1,000. As noted at p. 1358 supra, the charge had risen to $3,000 per share before negotiations directed toward the settlement of this lawsuit began.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. RML has not directly met this argument; rather, it has contended only that the $1,000 charge is reasonable. As we point out infra, this argument is not responsive to the Government's contention. It is also important to note in this context that, while RML has attempted to show that many of its membership criteria are adapted from NAR criteria, it has refused to adopt the NAR's position regarding entrance fees to a multiple listing service. NAR's Interpretation No. 29 provides that an entrance fee for participation in a multiple listing service which is in excess of the approximate cost, including the accumulation and maintenance of reasonable reserves, of developing, maintaining or improving the organization as a going concern, is an inequitable limitation on membership. Exhibit 3 to Deposition of Charles Clark.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. RML currently charges members for some of the services it renders, such as the distribution of listing books, on the basis of the cost of the services to RML. R.697a. The Government does not object to this practice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Originally, the Terminal Association's fees were left completely to the owner's discretion. Id. at 511. Later, the by-laws were amended to set fees at such a level as to produce only enough revenue to cover fixed charges and operating and maintenance expenses. Id. at 512.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. See note 38 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. The Court also required the abolition of certain anticompetitive practices of the association not here relevant. See id. at 516.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. Contrary to both RML's contention and the district court's finding, limiting the membership fee to the actual cost of admission, plus a pro rata contribution toward the maintenance and development of RML, would not undermine the investment of current RML members. All members would contribute to preserve the viability of RML under a fee schedule like the one outlined here. Members who do not pay a pro rata share of the assets, however, are not entitled to equal distribution of the assets in the event of dissolution. Thus, the investment of current members would be protected. See St. Louis Terminal Railroad Ass'n, supra, 32 S. Ct. at 511.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. This type of fee schedule is essentially that contemplated by Interpretation No. 29 of the NAR. See note 79 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Again, assuming that RML has the requisite market power, this rule should be voided on its face. The market power issue is open on remand, as we have indicated. Because we conclude that the district court erred in approving RML's stock purchase rule, we do not reach the question whether the current $1,000 charge is either a \"just and reasonable\" price for an ownership share or a reasonable charge for membership. We do note, however, that there is conflicting evidence on these points.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. At one time RML required an 85% affirmative vote for admission. This requirement was later lowered to a simple majority before the present admission criteria were adopted. See p. 1358 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. It is undisputed that RML abandoned all these practices under threat of suit by the Government and in order to avoid this litigation. After doing so, RML submitted to the district court an affidavit indicating that it had passed a resolution stating that it had no intention to resume these practices. The district court relied on this action in holding that these aspects of the case were moot.\u003c/span\u003e\n\n",
    "body_length": 158479,
    "citedas": [
      "629 F.2d 1351"
    ],
    "attorneys": "Gregory J. Leonard, Asst. U.S. Atty., Macon, Ga., Andrea Limmer, Dept. of Justice, Washington, D.C., for plaintiff-appellant. Champion \u0026 Champion, Forrest L. Champion Jr., Columbus, Ga., for defendant-appellee.",
    "category": [
      "252",
      "213"
    ],
    "judges": "Before Goldberg, Charles Clark and Thomas A. Clark, Circuit Judges.",
    "citation_count": 61
  }
}
