{
  "id": "FaWQSGYBTlTomsSBGMSg",
  "document": {
    "title": "07/26/90 ROBERT M. BECKMAN v. DONALD A. FARMER",
    "full_title": "ROBERT M. BECKMAN, DAVID M. KIRSTEIN v. DONALD A. FARMER",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1990-07-26T00:00:00.000Z",
    "docket": "Nos. 88-741, 88-742",
    "body": "This is a consolidated appeal from a jury verdict in a complex civil action involving the dissolution of a three-person law practice and a dispute over a large contingent fee received by two of the three lawyers who continued to practice together. The court below trifurcated the issues and tried them separately. First, on the threshold issue of whether the joint practice was a partnership and plaintiff (Farmer) a partner in it, the court granted Farmer's cross-motion for summary judgment. The court next established the value of Farmer's interest as a partner in certain firm assets, including the disputed fee, in an accounting in equity with the aid of a special master. Finally, after directing a verdict for appellants on counts alleging civil conspiracy, fraud and conversion, the court conducted a jury trial on remaining claims of breach of fiduciary duty in the failure to wind up the partnership and account to Farmer, and specifically on appellants' defense that Farmer had waived any share in the disputed contingent fee by entering into a separation of practice agreement.\n\nOn appeal, after conducting our own independent review of the record, we hold that appellants raised genuine issues of material fact concerning the existence of a partnership, and hence summary judgment was inappropriate. With regard to the jury trial, we conclude that the trial court erred in admitting into evidence an offer of compromise made by appellants, and that the error was not harmless. We therefore remand for a trial combining the issue of partnership and the issues previously submitted to the jury. We reject all of appellants' remaining claims. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nFACTUAL BACKGROUND\n\nIn the Summer of 1981, Robert Beckman and Donald Farmer, Jr. agreed to form a joint law practice called \"Beckman \u0026 Farmer.\" Beckman had practiced civil aviation law for a number of years and was a sole practitioner at the time. Most of the clients of the new firm were his. The two men mailed out engraved notices announcing the \"formation of a partnership for the practice of law.\"\n\nWhile drafts of formal partnership agreements were exchanged during negotiations, the two men never executed a contract defining the nature of their association and respective rights and duties. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e They did, however, memorialize in writing an agreement that Farmer would receive a guaranteed \"draw\" of $85,000 annually, payable monthly, and certain percentages of firm profits if net annual profits exceeded specified amounts. The document further stated Beckman would provide financing as required, and would be reimbursed by the firm for expenses he covered. He was also to receive a monthly payment as rent for furnishings and equipment used in the joint practice but owned by him.\n\nEffective January 1, 1983, David Kirstein joined the firm. He also executed no formal agreement defining his status, but a document dated October 27, 1982, captioned \"Re: Partnership Agreement,\" set out a revised agreement on division of net profits reflecting his participation. Kirstein was to receive a \"draw\" of $80,000 annually \"guaranteed\" by Beckman and a share of profits once certain levels of net firm profits were reached. After October 1982 the firm practiced under the name of Beckman, Farmer \u0026 Kirstein.\n\nBecause firm expenses outstripped revenues from work billed in the early months of the firm's existence, Beckman \u0026 Farmer showed a loss for the four-month period from September 1 to December 31, 1981. Beckman advanced funds to cover this shortfall, and the loss was not carried over to the following year on the firm's books and tax returns. From time to time thereafter, Beckman made other similar advances, all of which the firm eventually repaid, including the 1981 advance. In various internal documents and memoranda Beckman referred to the entity as a partnership, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and from September 1, 1981 until the relationship with Farmer soured in 1984, the bank accounts, books, and records of both Beckman \u0026 Farmer and Beckman, Farmer \u0026 Kirstein were maintained as if the firm was a partnership. Similarly, the firm's accountant prepared, and until 1984 Beckman signed, partners ship tax returns, and the firm filed Schedule K-1 forms identifying Beckman, Farmer and Kirstein as partners. When the firm needed operating capital, its practice was to make loans with a bank secured by a certificate of deposit owned by Beckman and his wife of sufficient value to cover the debt in case of default by the firm. The loans were made in the firm's name, however, and Farmer signed promissory notes as a partner making him liable on the obligations if the Bank was unable to foreclose on the collateral pledged by the Beckmans.\n\nAmong Beckman's clients were Sir Freddy Laker and Laker Airways, Ltd. (Laker), a British airline offering low fare, no-frills transatlantic flights. During the early period of the Beckman-Farmer association, the firm performed substantial work for Laker payable on an hourly basis. In early 1982, Laker was placed in receivership and Christopher Morris was appointed liquidator, the British equivalent of a trustee in bankruptcy. Following the liquidation, Beckman \u0026 Farmer, in association with Metzger, Shadyac \u0026 Schwarz, another firm retained as trial specialists, brought a multi-million dollar antitrust suit in federal court against a number of international air carriers on Morris' behalf. Post-liquidation legal services were to be compensated under a contract providing for payment of fees contingent on the outcome of the suit and reimbursement of expenses as they were incurred. Shortly after suit was filed, Farmer screened himself from participating in the Laker case to avoid disqualifying the firm as a result of Farmer's former position at the Civil Aeronautics Board, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and performed no further services for Morris. After the suit was filed some of the antitrust defendants, including McDonnell-Douglas Corporation, filed a counterclaim. Beckman, Farmer \u0026 Kirstein performed substantial work on the counterclaim, which was payable on an hourly basis distinct from the contingent fee work.\n\nOne of the antitrust defendants made settlement overtures as early as late 1983 or early 1984. By March 1984 Beckman had grown dissatisfied with the way Metzger, Shadyac \u0026 Schwarz was handling the case and sought to assert control of the litigation. In December 1984 Morris became convinced that Beckman was no longer acting in the liquidator's best interest, which was primarily to see that all Laker creditors were satisfied, because of Beckman's own interest in the contingent fee and his relationship with Sir Freddy Laker. Beginning in January 1985 another lawyer, Michael Nussbaum, originally retained by Morris to monitor the progress of the litigation, assumed an active role in settlement negotiations with the antitrust defendants. Urgent settlement talks with British Airways, one of the principal antitrust defendants, opened in December 1984 after it became known in June that the airline, formerly held by the British government, sought to go public.\n\nA settlement was reached on June 12, 1985, which disposed of all claims except those of the lawyers for the Laker liquidator for the work they had done. On July 12, 1985, agreement was reached that $12.5 million would be split equally between Beckman's firm and Metzger, Shadyac \u0026 Schwarz in release of all claims arising from the fee agreement with Morris regarding the antitrust suit, and that Beckman's firm would receive an additional $340,000 in fees for work performed for Laker before liquidation. By this time, however, Farmer was no longer associated with Beckman and Kirstein.\n\nIn late Spring 1983, the firm apparently experienced cash flow problems owing to the loss of an important client and its preoccupation with the Laker contingent fee case and other non-billable work. On June 8, 1983 Beckman sent a letter to Farmer and Kirstein entitled \"Firm Finances\" which described the situation and informed them that the firm was increasing its loan obligation, which Beckman would secure by pledging his own assets. He also \"proposed\" that the firm cease leasing his and Farmer's cars and stop paying \"advance draws\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e until its cash position improved, and advised that the partners should be prepared to reimburse the firm for advance draws received since January 1 of that year. Beckman had grown dissatisfied with the manner in which Farmer was handling clients. In May 1984, he told Farmer that he wanted to terminate the association and that Farmer should begin making arrangements to practice elsewhere. In June 1984, after returning from a trip to England to meet with the Laker liquidator, Beckman confronted Farmer and insisted in sharper terms that he leave immediately. The two began negotiating the terms of Farmer's departure. Beckman proposed paying Farmer six months' compensation at the agreed annual rate of $85,000 and allowing him to use the firm's office \"with the letterhead and telephone being retained in [the firm's] name for nominal purposes.\" Under this proposal, Farmer was to cease all work and do nothing for any client without Beckman's prior approval, and the parties were to execute a mutual release of all claims. Farmer responded with a hand-delivered document dated June 26, 1984, entitled \"Re: Winding up of Partnership,\" which proposed that the firm's books be closed as of June 30, 1984, and that a final accounting be conducted by a mutually acceptable accountant. Farmer proposed that the parties enter a winding up agreement terminating the existence of Beckman, Farmer \u0026 Kirstein, authorizing Beckman and Kirstein to continue the business, and distributing to Farmer a share of various firm assets, including the Laker contingent fee not yet received.\n\nNegotiations turned from a final winding up to the immediate matter of separating Farmer's practice from Beckman's and Kirstein's. On July 2, 1984 Farmer delivered a memorandum to Beckman and Kirstein entitled \"Re: Separation of Practice,\" pointing out that Beckman had not responded to Farmer's June 26 winding up proposal and explicitly reserving winding up issues for further negotiations. To address the immediate \"crisis\", \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e it set out a proposal for directing client telephone calls and correspondence to the respective attorneys, informing clients of the separation of practices and asking them which attorneys should retain their files, billing for work performed after July 1, 1984, and treatment of Farmer's expenses and insurance premiums. Beckman, in response to a suggestion by Farmer that he might seek an injunction \"freezing\" the firm's assets, took steps to transfer all funds in the partnership bank accounts, as well as incoming funds deposited by Morris for the Laker counterclaim work, to his personal accounts and to revoke Farmer's authority to use the firm's accounts. He instructed his wife, as firm comptroller, that this was to be done without Farmer's knowledge and asked the bank to hold the matter in strictest confidence. Later Beckman opened new accounts in the name of \"Beckman \u0026 Kirstein,\" which he insisted be designated \"proprietorship\" accounts. Kirstein was in Sweden during this period but received copies of correspondence effecting the transfers and eventually signed new signature cards authorizing him to transact business on the \"proprietorship\" accounts.\n\nExtensive negotiations culminated in an agreement styled \"Separation of Practice Agreement\" signed on July 6, 1984, and discussed in Section II (B)(3), infra. Following execution of this agreement, Farmer delivered successive memos to Beckman and Kirstein making increasingly more urgent demands for a final winding up and accounting. They set out Farmer's proposed distribution of firm assets and profits, and discussed accounts receivable and payable in general and the Laker contingent fee case specifically. Later memos complained of Beckman's and Kirstein's refusal to account, and demanded a prompt winding up of partnership business.\n\nFarmer had since retained counsel, and on July 26, 1985, sometime before Beckman and Kirstein received the Laker contingent fee, he filed suit in Superior Court naming them as defendants and seeking damages, an accounting, and injunctive relief for fraud, conversion, breach of fiduciary duty and breach of partnership agreement. In essence, Farmer alleged that Beckman and Kirstein had conspired to deprive him of a rightful share of the Laker fee by forcing him out of the partnership by fraud, breach of fiduciary duty, and a refusal to acknowledge Farmer's partnership rights. During the trial, Farmer alleged that the fiduciary breach was continuing in nature, referring primarily to the defendants' persistent refusal to conduct a final accounting in the manner sought by Farmer.\n\nAfter the court granted the defendants' motion to trifurcate the issues in the case, the parties filed cross-motions for summary judgment on the existence of a partnership.\n\nDiscussion\n\nI. Summary Judgment on the Issue of Partnership\n\nAs submitted to the jury, Farmer's lawsuit consisted of the claim of breach of fiduciary duty by Beckman and Kirstein in their failure to wind up the partnership and account to Farmer for his share of the partnership property. The predicate of this claim was that a partnership had existed. Throughout the summary judgment phase, the parties took the position that the issue of partnership could be resolved as a matter of law. Neither filed a statement of material facts in dispute in opposing the other's motion, and each argued to the court that no material facts were in dispute. Farmer urged that undisputed facts demonstrated he was a partner, while Beckman argued that the same and additional facts showed Farmer was at most a profit-sharing employee.\n\nThe trial court granted summary judgment in favor of Farmer, concluding that appellants had advanced\n\nvirtually no record evidence to substantiate allegations other than the bare conclusory denials contained in [Beckman's] lengthy affidavit. In the Court's view, those denials -- unsupported as they are by facts -- cannot defeat the very substantial evidence -- based on evidence such as leases, bank accounts, tax returns, partnership announcements, etc. -- submitted by the Plaintiff to establish the existence of a partnership and co-ownership of their legal practice.\n\nCiting Matsushita Elec. Indus. Co. v. Zenith Radio, 475 U.S. 574, 586, 106 S. Ct. 1348, 89 L. Ed. 2d 538 (1986), the court concluded that appellants' case presented little more than a \"metaphysical doubt\" about material facts, and that they had failed to carry their burden under Super. Ct. Civ. R. 56 to adduce affirmative evidence of specific facts negating the Conclusion that the parties had intended \"to do thing which in law constitute a partnership.\" 68 C.J.S. Partnership § 10 at 416 (1950).\n\nWe are compelled to disagree. Farmer did indeed present very substantial evidence that the participants characterized their relationship inter se and in dealings with third parties as a partnership. We can even conjecture that it is likely a jury would find that evidence dispositive. But on summary judgment a court cannot substitute its own opinion as to likely outcome for a precise determination whether appellants, in opposing the motion, raised genuine issues of material fact requiring jury resolution. As the following Discussion reveals, appellants proffered evidence on key issues of right of control and liability for losses that raised more than a \"metaphysical doubt\" whether jurors reasonably would have to find that Farmer was a partner rather than a paid employee. In these circumstances, and on an issue as to which the intent of the parties is paramount and must be inferred from their entire conduct (there being no express partnership agreement), we conclude that summary judgment was inappropriate.\n\nA. The Applicable Law\n\n1. Summary Judgment\n\nA party moving for summary judgment bears the burden of showing an absence of disputed material facts and establishing entitlement to judgment as a matter of law. Super. Ct. Civ. R. 56 (c) (1989); Williams v. Gerstenfeld, 514 A.2d 1172, 1176 (D.C.1986). To discharge this burden the party must demonstrate that, \"if the case proceeded to trial [,] his opponent could produce no competent evidence to support a contrary position.\" Nader v. de Toledano, 408 A.2d 31, 48 (D.C.1979), cert. denied, 444 U.S. 1078, 100 S. Ct. 1028, 62 L. Ed. 2d 761 (1980). Once the movant carries this initial burden, to survive the motion the non-movant must rebut the showing with specific evidence alleging a material factual issue that requires a jury to resolve the parties' differing versions of the truth. Thompson v. Seton Inv., 533 A.2d 1255, 1257 (D.C.1987); Phenix-Georgetown, Inc. v. Chas. H. Tompkins Co., 477 A.2d 215, 221 (D.C.1984).\n\nIn reviewing a grant of summary judgment, this court applies a standard of review identical to that used by the trial court in initially ruling on the motion. Holland v. Hannan, 456 A.2d 807, 814 (D.C.1983). The court must independently review the record to determine whether genuine issues of material fact exist and whether the movant is entitled to judgment as a matter of law. District of Columbia v. Pierce Assoc., 527 A.2d 306, 312 (D.C.1987). It must \"view the record in the light most favorable to the party who opposes summary judgment and thus resolve any doubt as to the existence of a factual dispute against the moving party.\" Davis v. Gulf Oil Corp., 485 A.2d 160, 164 (D.C.1984).\n\n2. The Law of Partnership\n\nUpon review of the record for disputed facts, the substantive law of partnership defines which facts are material. United States v. Rollinson, 275 U.S.App.D.C. 345, 347, 866 F.2d 1463, 1465, cert. denied, 493 U.S. 818, 110 S. Ct. 71, 107 L. Ed. 2d 37 (1989) (quoting Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 248, 106 S. Ct. 2505, 91 L. Ed. 2d 202 (1986)). While the partnership relation has been variously defined, traditionally it is formed \"when two or more competent persons to place their money, effects, labor, and skill or some or all of them, in lawful commerce or business, and to divide profit and bear the loss in certain proportions.\" Georgia Casualty Co. v. Hoage, 61 App.D.C. 195, 197, 59 F.2d 870, 872 (1932). The District of Columbia Uniform Partnership Act, D.C. Code §§ 41-101 to -142 (1986) (Partnership Act), similarly defines a partnership as \"an association of 2 or more persons to carry on as co-owners of a business for profit.\" Id. § 41-105 (a). Thus, for a partnership to arise in law, two or more persons must intend to associate together to carry on as co-owners for profit. Gangl v. Gangl, 281 N.W.2d 574, 579 (N.D.1979). Although the rights and duties of partnership in respect to third parties can arise by law even though the parties do not intend to become partners, Robinson v. Parker, 11 App.D.C. 132, 140 (1897); see D.C. Code § 41-115 (a) (partnership by estoppel), as between partners themselves the relationship is consensual. Garner v. Garner, 31 Md.App. 641, , 358 A.2d 583, 588 (1976) (\"partnership inter sese cannot exist against the consent and intention of the parties. . . .\"). And although the manner in which the partie's themselves characterize the relationship is probative, the question ultimately is objective: did the parties intend \"to do the acts that in law constitute partnership\"? A. BROMBERG \u0026 L. RIBSTEIN, BROMBERG AND RIBSTEIN ON PARTNERSHIP § 2.05 (c), at 2:36 (1988) (citations omitted). \"In general, the courts, in determining objective partnership intent, look for the presence or absence of the attributes of co-ownership, including profit and loss sharing, control, and capital contributions.\" Id.; see also 68 C.J.S. Partnership § 10 (1950).\n\nThe customary attributes of partnership such as profit and loss sharing and joint control of decisionmaking are necessary guidepoints of inquiry, but none is conclusive. For example, D.C. Code § 41-106 (4) creates, in effect, a statutory presumption of partnership from evidence that a party shared in the profits of the business. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e An exception is made, however, if -- for instance -- the profits are received \"in payment . . . s wages of an employee . . . .\" Id. § 41-106 (4)(B). See also Farrow v. Cahill, 214 U.S.App.D.C. 24, 28 \u0026 n.17, 663 F.2d 201, 205 \u0026 n.17 (1980). Similarly, while a right of joint control is ordinarily key to partnership, \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the statute recognizes that one partner may cede the power to manage and control the business to one or more of his associates. See D.C. Code § 41-117. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e \"A person may be a partner even though he has entrusted control of the business exclusively to his associates. The question then becomes whether or not the participant had the right to exercise control in the management of the business.\" Gangl v. Gangl, supra, 281 N.W.2d at 580 (emphasis in original).\n\nFinally, a partner \"must contribute toward the losses, whether of capital or but again the parties may agree to the contrary, D.C. Code § 41-117 (1); A. BROMBERG \u0026 L. RIBSTEIN, supra, § 2.07 (d), at 2:67-68 (partnership may exist if the purported partners expressly so agree, even if some of the parties guaranteed the others against loss). As these authors recognize, loss sharing -- like profit sharing and control -- \"takes on greater or lesser importance as an independent element of partnership depending on the extent to which there is other evidence supporting partnership.\" Id. at 2:68-69. Ultimately, then, whether a partnership exists is an issue of fact, Jonathan Woodner Co. v. Laufer, 531 A.2d 280, 285 \u0026 n.7 (D.C.1987), turning less on the presence or absence of legal essentials than on the intent of the parties gathered from their agreement, conduct, and the circumstances surrounding their transactions. In re Washington Communications Group, 18 Bankr. 437, 442 \u0026 n.6 (Bankr. D.C. 1982).\n\nB. Farmer's Entitlement to Summary Judgment\n\n1. Farmer's Prima Facie Case\n\nWe conclude that Farmer satisfied his initial burden to show undisputed material facts demonstrating the existence of a partnership. In support of his motion, Farmer submitted a statement of material facts not in dispute demonstrating that: (a) Beckman and Farmer shared profits after a certain level of firm income was reached; (b) in internal correspondence, documents and memoranda Beckman consistently referred to the firm as a \"partnership\", to Farmer and Kirstein as \"partners\", and to the agreement among them as the \"partnership agreement\"; and (c) the firm held itself out to tax authorities, lessors, creditors, banks, clients and even its own accountant as a partnership. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nFarmer also advanced sufficient evidence to establish that he shared the right of ultimate control. For example, internal correspondence from Beckman to the other attorneys discussing management matters, including acquisition of operating capital, invariably used verbs such as \"propose\" and indicated that the lawyers had \"agreed\" on certain courses of action -- terms incompatible with unshared control rights. Appellants do not dispute that until Beckman transferred the bank accounts after relations with Farmer soured, each of the three attorneys had the right to transact business on the firm's bank accounts on his own signature. The undisputed fact that the lease on office space, see note 3, (supra) , was entered on behalf of the firm after Beckman proposed it be held by a corporation and leased back to the firm indicates that Farmer and Kirstein had veto authority in important matters. Indeed, throughout his depositions Beckman conceded that decisions were made in consultation with Farmer and Kirstein.\n\nFinally, to demonstrate that he bore a share of firm liabilities, Farmer referred to the lease and certain promissory notes securing bank loans to the firm, both of which he executed. Beckman conceded in his deposition that Farmer was \"technically\" liable on the bank loans. As the trial court pointed out, moreover, Beckman did not dispute that Farmer would be liable as a partner to third party creditors of the firm because of the manner in which he was held out. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nWe conclude Farmer's proffer of undisputed facts was sufficient as a matter of law to establish that the parties associated together with the intent to carry on the business as co-owners for profit. Farmer carried his initial burden under Super. Ct. Civ. R. 56 (c).\n\n2. Appellants' Rebuttal\n\nBecause lack of control rights and sharing in losses and liabilities are probative of non-partnership, see Section I (A)(2), supra, if appellants' rebuttal showing raised any factual disputes on these issues, it necessarily raised material issues of fact bearing on the ultimate question which preclude summary judgment. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e We conclude that it did.\n\nGenerally, \"the court may assume that facts as claimed by the moving party are admitted to exist without controversy except as and to the extent that such facts are asserted to be actually in good faith controverted in a statement filed in opposition to the motion.\" Super. Ct. Civ. R. 12-I (k). The non-movant's failure to assert issues of fact as provided in Rule 12-I (k) or to support contentions of factual disputes as provided in Rule 56 \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e will result in acceptance of a movant's statement as undisputed unless there is clear support for such contentions in the record. Vessels v. District of Columbia, 531 A.2d 1016, 1018 (D.C.1987); Williams v. Gerstenfeld, supra, 514 A.2d at 1176-77 (citations omitted). Appellants filed no Rule 12-I (k) statement opposing Farmer's motion, but did submit a statement of undisputed material facts in support of their own cross-motion which referred to an affidavit of Beckman and included citations to the record. This procedural posture led Judge Kessler to write that, \"aving argued vigorously for a decision on the basis of the motions, it is assumed that the losing party has waived any further arguments (either to this Court, or to the Court of Appeals) that existing disputes over material facts preclude Disposition via summary judgment.\" She characterized the issue before her as \"centered on the legal Conclusions to be drawn from facts which were already well established in the record.\"\n\nOur decisions do indicate that presentation of an issue on cross-motions for summary judgment may signal that there acre no material facts in dispute, allowing the Judge to resolve the question as a matter of law. See Read v. Legg, 493 A.2d 1013, 1016 (D.C.1985); Holland v. Hannan, supra, 456 A.2d at 814 n.9. This Disposition is appropriate, however, only in narrow circumstances when the motions \"are based on the same material facts and address the same legal issues.\" Read, supra, 493 A.2d at 1016, quoting Holland, 456 A.2d at 814 n.9. It is not appropriate when, as here, the parties rely on the same primary facts but argue critically different inferences from them. Warrior Tombigbee Trans. Co. v. M/V Nan Fung, 695 F.2d 1294, 1296 (11th Cir. 1983); Turnbull v. Andrew Crowe \u0026 Sons, 572 F. Supp. 1254, 1255 (D.Mich.1983). \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The trial court correctly recognized the central issue as whether the parties, despite the absence of an express partnership agreement, intended to carry on the business as co-owners for profit, D.C. Code § 41-105 (a), and that their intent must be inferred from their conduct and dealings with each other. See Cooper v. Saunders-Hunt, 365 A.2d 626, 628 (D.C.1976) (\"partnership contract may be oral and may be inferred from the conduct of the parties\"). Our decisions have repeatedly expressed a preference for trial on the merits when interpretation of an ambiguous agreement \"depends on the credibility of extrinsic evidence or on a choice among reasonable inferences to be drawn from extrinsic evidence.\" Jessamy Fort \u0026 Ogletree v. Lenkin, 551 A.2d 830, 831 (D.C. 1988) (citation omitted); see also Dodek v. CF 16 Corp., 537 A.2d 1086, 1093 (D.C.1988); Kurth v. Dobricky, 487 A.2d 220, 223 (D.C.1985). These contract interpretation cases reflect the general principal that summary judgment is likely to be inappropriate and should be used sparingly in cases where motive or intent are material. See Spellman, supra note 14, 504 A.2d at 1122; Wyman v. Roesner, 439 A.2d 516, 519 (D.C.1981); International Bhd. of Painters \u0026 Allied Trades v. Hartford Accident \u0026 Indemnity Co., 388 A.2d 36, 42-44 (D.C.1978).\n\nThe legal relationship between the parties in this case turns on their intent, as reflected partly in written agreements among Beckman, Farmer and Kirstein. These documents are susceptible of varying interpretations on the central issue. See Dodek, supra, 537 A.2d at 1092.\n\nThey clearly provide for profit-sharing, which is prima facie evidence of partnerships. Yet they also provide for payment of guaranteed compensation in the nature of a monthly salary, and that Beckman would meet all firm expenses and capitalization requirements -- evidence of non-partnership. Because of this ambiguity, the court must resort to inferences from extrinsic evidence of the parties' conduct and course of dealings to determine their legal relationship inter se. In these circumstances, the trial court's Conclusion that the issue of partnership vel non could be resolved as a matter of law bears a heavy burden of justification.\n\nIn concluding that appellants had failed to raise a genuine issue of material fact, the court relied on \"the bare conclusory denials contained in [Beckman's] lengthy affidavit.\" It is true that materials lodged in opposition to a summary judgment motion must contain more than \"bare conclusory denials,\" and must cite specific facts of record showing a genuine issue for trial. Press v. Howard Univ., 540 A.2d 733, 735 n.4 (D.C.1988); Miller v. American Coalition of Citizens with Disabilities, 485 A.2d 186, 191 (D.C.1984). But while we agree that Beckman's affidavit is rife with denials and Conclusions, our review reveals that it contains some specific factual allegations lending credence to his more Conclusionary statements, and that these assertions are supported in material respects by his and Kirstein's deposition testimony. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nIn the category of conclusory assertions fall Beckman's general averments that he and Farmer agreed to form an employer/employee relationship, that at no time did Farmer share in losses or liabilities, and that Beckman had absolute authority over all business and professional decisions. But Beckman also described some specific incidents and events supporting these allegations. As to risk of loss, for example, he alleged that Farmer in early negotiations had expressed inability to assume any joint liability for firm obligations, that Beckman alone bore the entire operating loss incurred in 1981, and that Beckman alone agreed to assume full responsibility for the lease obligation, which he avers the landlord entered on the basis of Beckman's personal solvency alone. With regard to control rights, Beckman asserted that the lease was entered by Kirstein on Beckman's behalf and at Beckman's direction.\n\nMoreover, after Beckman alleged in his affidavit that he had sole control and management authority, the court propounded five questions concerning the allocation of management responsibility and directed Farmer to supply supplemental record citations in response. Beckman also filed a response and proffered deposition citations of his own. In addition to general and conclusory allegations consistent with those in his affidavit, the testimony he cited identified specific instances where Beckman alleged he had exercised sole authority.\n\nFor example, he and Kirstein testified that Beckman had unilaterally decided not to invoice clients for certain hours billed by Farmer which Beckman thought to be excessive or unjustified. Regarding personnel matters, Beckman testified that he alone had decided to bring Kirstein and a Janet L. Kuhn into the firm. Beckman and Kirstein testified that Beckman decided to fire Farmer's secretary to conserve firm resources, and that Beckman decided to increase Kirstein's guaranteed compensation in 1983. Beckman also testified that, in general, all decisions concerning work for clients were subject to his approval, and that Farmer was obliged to report to him in performing services for clients. He further stated that nearly all of the firm's clients were his and that neither Farmer nor Kirstein had any responsibility to generate business. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nOn the issue of who controlled the practice on a day-to-day basis, Judge Kessler wrote: \"he only finding that the Court can make is a negative one, namely, that the record is not clear enough to support Mr. Beckman's assertions of total and complete control over all aspects of the firm's operations.\" Because the issue was presented on cross-motions, the Judge may have confused appellants' failure to establish that Beckman alone controlled the practice (necessary to sustain his own motion for summary judgment) with their lesser burden of raising an issue whether Farmer had a joint right of control. On cross-motions for summary judgment, \"he fact that one party fails to satisfy burden on his own Rule 56 motion does not automatically indicate that the opposing party. . . should be granted summary judgment on the other motion.\" 10A C. WRIGHT, A. MILLER, M. KANE, FEDERAL PRACTICE AND PROCEDURE: CIVIL 2d § 2720 \u0026 n.11 (1983).\n\nOn the issue of responsibility for firm losses and liabilities, Beckman asserted by affidavit that Farmer contributed nothing but his personal services to the firm, bore no risk of partnership losses, received guaranteed compensation whether the firm showed a profit or not, and had no ownership interest in property used by the firm even though Beckman had afforded him an opportunity to acquire such an interest. If certain documents cited by Beckman are viewed in a light favorable to him, they lend support to these assertions. For example, partnership tax returns and the profit-sharing agreements support Beckman's contention that Farmer was guaranteed compensation for his services, whether the firm showed a profit or not. Promissory notes in the name of the partnership secured by Beckman's personal assets \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and the profit-sharing agreement provisions obliging Beckman to pay all firm expenses and to provide operating capital bolster the contention that Farmer would not be liable for operating losses or to firm creditors. Tax returns and internal correspondence showing that Beckman leased furnishings and equipment to the firm over a long period are consistent with Beckman's assertion that Farmer declined an opportunity to purchase an ownership interest in these physical assets. While not necessarily incompatible with the existence of a partnership, these documented facts weigh against Farmer's co-ownership interest in the enterprise, if inferences and doubt are resolved in Beckman's favor as they must be. See Phenix-Georgetown, supra, 477 A.2d at 221; Murphy v. Army Distaff Found., 458 A.2d 61, 62 (D.C.1983). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nAlthough Beckman did not dispute that Farmer would be liable as a partner to third party creditors of the firm because of the manner in which Farmer was held out to such persons, this does not preclude the existence of an agreement between the attorneys inter se by which Beckman assumed all risk of operating losses and liabilities. All told, inferences from the documentary evidence, deposition testimony and Beckman's affidavit adequately, though far from overwhelmingly, support appellants' contention that the parties agreed that Farmer would bear no losses or liabilities, thereby raising a genuine issue of material fact.\n\n3. Conclusion\n\n\" party . . . is not entitled to a judgment merely because the facts he offers appear more plausible than those tendered in opposition, or because it appears that the adversary is unlikely to prevail at trial. This is true even though both parties move for summary judgment.\" 10A C. WRIGHT, A. MILLER, M. KANE, (supra) , § 2725 \u0026 nn.36, 37. Accord, Robinson v. Evans, supra note 15, 554 A.2d at 337. Appellants' case for summary judgment raised genuine issues of material fact concerning control rights and risk of loss, and thus summary judgment in Farmer's favor was inappropriate.\n\nII. The Accounting\n\nAppellants mount a multi-pronged attack on the accounting procedure followed by the trial court (employing a special master) after concluding that Farmer was a partner entitled to an accounting in equity of his share in the partnership's assets. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Appellants assert, first, that the court erred in awarding Farmer a full share of fees received after the partnership had dissolved and the parties had agreed on a division of firm assets in the July 1984 Separation of Practice Agreement, and in failing to reduce the Laker contingent fee to its value as of the date of dissolution. Because we conclude that this argument is based upon a faulty interpretation of partnership law as applied to the facts of this case, we reject it. Also relying on the July 6 agreement, and on the manner in which the partners' accounts were settled prior to dissolution, appellants further argue that the parties intended to conduct the final partnership accounting using a cash method, and not the accrual method used by the master. We conclude the Judge did not err in adopting the master's findings, which reflected inclusion of accounts receivable in its calculations.\n\nA. Proceedings Below\n\nFollowing summary judgment in Farmer's favor on the existence of the partnership, the parties agreed that the next phase of the case -- the accounting -- would require appointment of a special master. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The court instructed the parties to reach agreement on a qualified professional to conduct the accounting, but if unable to do so, to identify four individuals one of whom the Judge would appoint. The parties were encouraged to submit a mutually agreeable order detailing the master's powers.\n\nThe parties submitted a proposed consent order but were unable to agree on the special master and on three other issues. Hence they submitted four names as requested and alternative provisions of the order stating their positions on the matters they could not resolve. On February 9 the court appointed an accountant as special master and, after resolving each of the controverted provisions in the defendants' favor, adopted the parties' consent order. The order directed the master to perform a number of detailed calculations, and authorized him to order parties and trial witnesses to testify and produce books, records and documents. The order contained a general disclaimer:\n\nIt is understood by the parties that by consenting to this Order no party agrees that the calculations are appropriate or waives his right to challenge the basis in law and fact as to the calculations, and the parties reserve the right to disagree that any of the calculations reflect what the plaintiff is entitled to receive in an accounting.\n\nThe parties submitted documents to the master, who conducted hearings in March 1988, taking testimony from Beckman Kirstein, Farmer, accountant Stanley Tralins, and Mrs. Beckman. Following submission of his report, the parties filed exceptions upon which Judge Weisberg conducted three days of hearings, taking testimony and hearing extensive oral argument. Adopting the findings of the master, the court concluded that: (a) Farmer's share of the firm's profits as of May 31, 1984 was $107,873; (b) his share of the Laker fee received after May 31, 1984, and after deducting Beckman's and Kirstein's expenses incurred in collecting the fee but not compensation for the attorneys' own time, was $2,451,581, which included $80,177 for work for Laker Airways before the airline went into receivership; and (c) Farmer's share of the Manson estate fee, after deducting collection expenses but not compensation for the collecting partners, was $7,385.\n\nDuring the trial, and in written special instructions and interrogatories at the close of the trial, the Judge instructed the jury that he had determined these amounts as findings of fact in the accounting, and that the jury was required to accept them in its deliberations. The jury was further instructed that Farmer would receive his share of pre-dissolution profits ($107,873) and his share of the Manson estate fee ($7,385) as part of the accounting, but that he would be awarded the share of the Laker fees ($2,371,404 antitrust contingent fee + $80,177 pre-liquidation fee) determined in the accounting only if the jury concluded that he had not agreed to forego his share of those fees in the July 6, 1984 Separation of Practice Agreement. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Following the jury verdict in Farmer's favor on these issues, the court entered judgment in the accounting in accordance with the jury instructions.\n\nB. Post-Dissolution Earnings as Partnership Assets\n\nAppellants assert that Farmer was not entitled to receive a full share of the Laker contingent fee, invoking the rule that when the partnership business is continued by others after dissolution, a partner who contributed only personal services which ceased upon dissolution should not share in profits earned by the post-dissolution entity. Annotation, Rights in Profits Earned by Partnership or Joint Adventure after Death or Dissolution, 55 A.L.R.2d 1391, 1418 (1957). See also Hilgendorf v. Denson, 341 So.2d 549, 551 (Fla. App. 1977); Griffeth v. Fehsel, 61 Cal.App.2d 600, , 143 P.2d 522, 524-25 (1943). We conclude that this rule does not apply to fees earned or received for winding up unfinished business of the dissolved partnership when one partner has exercised his right to compel liquidation and distribution of surplus, as Farmer did here. Application of the rule is properly limited to situations where the outgoing partner elects not to exercise his right to force a liquidation, but instead permits continuation of the business by the other partner(s), or when the partners agree to settle their accounts contemporaneously with dissolution with the understanding that one or more will continue the business. In these instances, unfinished business loses its character as partnership property, and the outgoing partner severs the fiduciary association that binds him to the post-dissolution entity. To apply the rule urged by appellants in circumstances where, while some partners wish to carry on the partnership's business, an outgoing partner seeks to wind up the business, would defeat the right of each partner, conferred by the Partnership Act, to require liquidation and distribution of surplus upon rightful dissolution.\n\nUnder the Act, dissolution of a partnership \"is the change in the relation of the partners caused by any partner ceasing to be associated in the carrying on as distinguished from the winding up of the business.\" D.C. Code § 41-128; Warren v. Chapman, 535 A.2d 856, 858 (D.C.1987). Farmer contends that he was \"expelled\" from the partnership, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e but we conclude the association was terminated by the express will of Beckman. See D.C. Code § 41-130 (1)(B) (absent contrary agreement, partnership terminable at will of any partner). Because the dissolution was not wrongful in the sense that it violated the partnership agreement, the partners' rights in partnership property are governed by D.C. Code § 41-137 (a), which provides:\n\nWhen dissolution is caused in any way, except in contravention of the partnership agreement, each partner, as against his co-partner and all persons claiming through them in respect to their interests in the partnership, unless otherwise agreed, may have the partnership property applied to discharge its liabilities, and the surplus applied to pay in cash the net amount owing to the respective partners.\n\nWe must determine whether Farmer was entitled to a share of fees received after dissolution of the partnership as part of \"the net amount owing\" to him.\n\n1. Unfinished Business Under an Agreement to Wind Up Contemporaneously With Dissolution or an Election to Waive Liquidation\n\nAbsent a contrary agreement, the general rule is that \"ll of the partners of the dissolved firm . . . are . . . entitled to share in fees for pre-dissolution work in process paid after dissolution to the dissolved partnership or to withdrawing partners.\" A. BROMBERG \u0026 L. RIBSTEIN, (supra) § 7.08 (e), at 7:81-82 (citations omitted). Such fees, however, may lose their status as assets subject to distribution by an agreement of the partners to divide them upon dissolution when one or more partners wants to continue the business. See, e.g., Hudson v. Kemper, 153 A.2d 316, 318 (D.C.1959). Winding up can be contemporaneous with dissolution when the partners expressly or impliedly agree to transfer their shares of the business to the continuing partner. Gibson v. Deuth, 270 N.W.2d 632, 635 (Iowa1978), citing Wolf v. Murrane, 199 N.W.2d 90 (Iowa 1972). The transfer is for a sum which may include the out-going partner's percentage of profits from unfinished business earned before the date of dissolution, id., at 635, and can take the form of an agreed-upon accounting concurrent with dissolution. The sole case from the District of Columbia cited by appellants is in harmony with this approach. In Hudson v. Kemper, supra, this court recognized:\n\nGenerally, it is the rule that a partner, who, after dissolution of the firm, makes profits from continued operations shall be accountable to his coadventurer . . . . Here, we have, however, an agreement in which a settlement or balance was struck disposing of the partnership assets, such as the trade name, money in the bank, office furniture, catalogs, etc. . . . Apparently the parties intended, with the dissolution agreement, a complete severance of their relationship, for appellant had knowledge of the contingent building contracts and made no provision for them.\n\n153 A.2d at 318. Accord, Griffeth, supra, 61 Cal. App. at , 143 P.2d at 525 (\"n the instant action there was . . . a dissolution proved and an accounting agreed upon\").\n\nBesides assigning his rights in partnership property to the continuing partners for an agreed-upon compensation, a partner may consent, affirmatively or by acquiescence, to their continuation of the business without formal assignment. D.C. Code §§ 41-140 (a), (c), 41-141. In this case the Partnership Act entitles him to an election. He may receive, at his option, either the value of his interest at the date of dissolution (with interest) or the profits attributable to the use of his right in the property of the dissolved partnership as an ordinary creditor of the partnership, subordinated to other creditors. Id. § 41-141.\n\nBut the \"continuation of the business\" cases just discussed do not deal with the case where one partner insists on a winding up. and liquidation of the partnership on dissolution, and no settlement of accounts including unfinished business takes place. When a partnership is dissolved without violating the partnership agreement, each partner has an absolute right to demand liquidation and distribution of surplus, unless otherwise agreed. See D.C. Code § 41-137 (a). That one or more partners wants to continue the business does not affect this right. Absent wrongful dissolution, or expulsion of a partner under a provision in the partnership agreement, see note 22, (supra) , if one partner elects to liquidate upon dissolution, the others cannot continue the partnership business. A. BROMBERG \u0026 L. RIBSTEIN, (supra) , § 7.13, at 7:118 (business may be continued \"when all of the partners elect to permit continuation rather than to exercise the liquidation right\" (emphasis added)). Accord, J. CRANE \u0026 A. BROMBERG, LAW OF PARTNERSHIP § 86 (c) (1968) (non-continuing partner can elect to force a liquidation of business or permit it to continue and claim as creditor the value of his interest at dissolution). \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n2. Unfinished Business Under Election to Liquidate Partnership\n\nIf a partner insists on liquidation, then the line of demarcation for determining \"the amount owing to the respective partners,\" D.C. Code § 41-137 (a), is not dissolution but completion of winding up the partnership's business. Between dissolution and that point, the fiduciary obligation of each partner to \"account to the partnership for any benefit, and hold as a trustee for it any profits derived by him without the consent of the other partners from any transaction connected with the . . . conduct, or liquidation of the partnership,\" continues in force. Id. § 41-120 (emphasis added). The Partnership Act specifically grants a winding up partner the power to bind the partnership after dissolution by \"any act appropriate for . . . completing transactions unfinished at dissolution.\" Id. § 41-134 (a)(1). It follows that any profits derived from completion of such unfinished business inure to the partnership's benefit, even if received after dissolution.\n\nOn the basis of these principles, other courts confronted with dissolution of law partnerships have held that pending cases are uncompleted transactions requiring winding up after dissolution, and are therefore assets of the partnership subject to post-dissolution distribution. See, e.g., Ellerby v. Spiezer, 138 Ill.App.3d 77, , 92 Ill.Dec. 602, 485 N.E.2d 413, 416 (1985); Jewel v. Boxer, 156 Cal.App.3d 171, 178-79, 203 Cal.Rptr. 13, 18 (1984); Rosenfeld, Meyer \u0026 Susman v. Cohen, 146 Cal.App.3d 200, 216-17, 194 Cal.Rptr. 180, 189-90 (1983); Resnick v. Kaplan, 49 Md.App. 499, 508, 434 A.2d 582, 587 (1981); In re Mondale \u0026 Johnson, 150 Mont. 534, 437 P.2d 636 (1968); Frates v. Nichols, 167 So.2d 77, 81 (Fla.Dist.Ct.App.1964). The reason is that dissolution does not terminate or discharge pre-existing contracts between the partnership and its clients, and ex-partners who perform under such contracts do so as fiduciaries for the benefit of the dissolved partnership. See Ellerby, supra, 138 Ill.App.3d at , 485 N.E.2d at 416; Resnick, supra, 119 Md.App. at , 434 A.2d at 587; Rosenfeld, supra, 146 Cal.App.3d at 216-17, 194 Cal.Rptr. at 190-91. Fees received are to be shared regardless of which former partner provides services in the case after dissolution. Jewel, supra, 156 Cal.App.3d at 174, 203 Cal.Rptr. at 15.\n\n3. Effect of Separation of Practice Agreement\n\nTo apply these principles, it is necessary to decide whether Farmer agreed to a winding up contemporaneously with dissolution in the July 6 Separation of Practice Agreement, as suggested by appellants, or otherwise waived his right to compel liquidation by acquiescing in the continuation of partnership business by Beckman and Kirstein. If so, he would have no right to fees earned after dissolution, and would only be entitled to the value of his interest in the Laker antitrust and Manson estate fee ascertained as of the dissolution date. See D.C. Code § 41-141. Conversely, if Farmer exercised his right to compel liquidation by seeking a winding up of partnership business and a final accounting, Beckman and Kirstein, in performing post-dissolution work on the Laker antitrust case and collecting the fee, acted as fiduciaries for the benefit of all the partners. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e See id. § 41-137 (a).\n\nJudge Weisberg in essence submitted this issue to the jury by instructing it to decide whether, under all the circumstances, Farmer had waived his rights to the Laker contingent fee by executing the Separation of Practice Agreement on July 6, 1984. It is true the jury was not asked specifically to find whether Farmer had waived his right to compel liquidation of the partnership, or whether the Separation of Practice Agreement constituted a winding up contemporaneous with dissolution. We conclude, however, that the jury's ultimate finding that Farmer did not agree to give up his interest in the Laker fee in the agreement encompassed these basic facts. We further conclude there was evidence sufficient to support the jury's determination. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nTrial exhibits reveal that Farmer wrote Beckman and Kirstein letters requesting performance of an accounting by a neutral professional on June 26, July 31, August 17, and September 11, 1984. All of these letters were entitled \"Winding Up of Partnership.\" These letters set out Farmer's position on distribution of profits, and discussed accounts receivable and payable generally, and the Laker case specifically. Later letters objected to Beckman's and Kirstein's refusal to account and demanded a prompt winding up. Notably, earlier letters proposed amounts Farmer would accept in settlement of the partnership accounts, including the Laker fee, which, had they been acted upon, would have constituted a final accounting and termination of the partnership.\n\nAppellants rely on the Separation of Practice Agreement itself, but this agreement, on its face and in the context of the parties' dealings, does not compel a Conclusion that Farmer intended to waive his right to a final accounting. On July 2, four days before the agreement was executed, Farmer wrote Beckman and Kirstein a letter entitled \"Separation of Practice\" in which he referred to his June 26 memo regarding winding up of the partnership and noted, \"I still believe we must come to grips with winding up the partnership as soon as possible. . . . You should not take this letter as an indication that a response to my June 26, 1984 letter is any less urgent.\" The letter was occasioned by what Farmer described as \"another crisis\" that had arisen when Beckman informed him he \"planned to effect a unilateral separation of practices\" by giving instructions that firm telephones were to be answered \"Beckman and Kirstein\" and by using \"Beckman \u0026 Kirstein\" stationery. In an attempt to \"provide a mutually agreeable basis for dealing with the situation that was created by Bob's decision to dissolve the partnership, and his decision to force an immediate separation of our practices,\" Farmer's letter proposed \"specific solutions\" to the problems created by the dissolution, but clearly distinguished between what Farmer called \"separation of practice issues\" and \"winding up issues.\"\n\nOn July 6, 1984, the parties executed the Separation of Practice Agreement. Its first paragraph said:\n\nRMB, DF and DMK agree to attempt to reach agreement on the terms for winding up their practice as Beckman, Farmer \u0026 Kirstein as soon as possible. Without prejudice to anyone's position with respect to the winding up of Beckman, Farmer and Kirstein, RMB, DF, and DMK agree to operate their practices according to the terms of this agreement.\n\nAs this paragraph reflects the parties' intent that the agreement was to have no effect on the winding up of the partnership, it cannot be said to show Farmer's acquiescence in the continuation of the partnership's business.\n\nNeither does the document evidence a final accounting among the partners. It distinguishes between details surrounding separation of the practices and the ultimate winding up of the business, over which the parties had not reached agreement when the document was signed. Also, an agreement to finally settle accounts as of the date of dissolution would be inconsistent with Farmer's continued demands for a winding up and final accounting thereafter. The jury adopted this view, finding that by entering the agreement, Farmer did not intend to relinquish any rights in the Laker case or other accounts receivable at dissolution.\n\nSome provisions of the document, to be sure, lend support to appellants' theory that the parties agreed to treat the firm's clients as assets, and to divide those assets as of the date of dissolution. The parties agreed that, while Farmer was holding over on the premises of the former partnership, Farmer would not \"solicit\" or perform services for certain listed clients (including Morris, the Laker liquidator) and Beckman and Kirstein would not \"solicit\" or perform services for others. This provision acknowledged that Farmer could perform services for clients on Beckman's side of the list if \"expressly requested to do so by the client or RMB ,\" and vice versa. Listed clients' files and mail were to go to the designated parties. Paragraph 12 of the document stated that \"ork and bills from July 1, 1984, on shall be for the separate accounts of RMB and DMK, or DF.\"\n\nThe duty to wind up partnership business does not disable the former partners in a law firm from accepting employment from former clients of the dissolved partnership, provided the new employment does not relate to work in progress at the time of dissolution. See Rosenfeld, supra, 146 Cal.App.3d at 221, 194 Cal.Rptr. at 192. Thus, to the extent the references in the agreement to \"work and bills\" and the client lists related to future work, as opposed to work in progress, the agreement was consistent with Farmer's position that the Laker fee was still negotiable as part of the winding up and accounting. Paragraph 8 of the document, however, addressed past services -- certain work Farmer performed in June 1984 for Princess Casinos, Inc. -- by providing that Farmer was to bill Princess for his services in that month and keep the revenues. All other work performed by Farmer during June 1984 was to be billed on Beckman \u0026 Kirstein stationery, and Beckman and Kirstein were to keep the revenues. Farmer explained this provision as \"related to the interim draw problem. This was a means of just splitting up the income we made from the work done during the month of June.\"\n\nThe \"work and bills\" provision, Farmer's \"interim draw\" remarks, and the Princess Casinos provision reflect an understanding that certain work done during June of 1984 and thereafter would be billed, and fees retained, for the separate accounts of the partners. Appellants seize on this, arguing that it would be inequitable -- and contrary to the parties' understanding -- to allow Farmer to keep fees received for work performed for Princess Casinos and other clients while requiring Beckman and Kirstein to account to Farmer for a full share of the Laker contingent fee.\n\nFarmer's trial testimony illuminated the circumstances surrounding the \"work and bills\" and \"Princess Casinos\" provisions. He testified that after July 6, 1984, he performed work for and billed some of the clients listed in the addendum, and kept the revenues, without accounting to Beckman and Kirstein. He indicated he had performed a substantial amount of work billed on an hourly basis before June 1984, representing the firm's principal source of revenue for that period. Among this work was what he characterized as \"a very hefty bill\" to Princess. Princess, he acknowledged, was in a sense \"unfinished business\" of the partnership. When pressed to explain the difference between the Laker fee and the Princess fee, Farmer said the parties understood that the \"work and bills\" provisions related solely to work performed on an hourly basis after July 6, 1984, but not to the large contingent fee case or other accounts receivable, which would still be the subject of negotiations for the final winding up and accounting. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e In contrast, Beckman testified that the parties had agreed that the \"work and bills\" provision and the client lists amounted to a final accounting and division Of assets, and in particular that Farmer was agreeing to give up any interest in the Laker fee in exchange for the arrangement on Princess and other clients.\n\nFaced with this conflicting testimony, the jury accepted Farmer's version and rejected Beckman's. While, as observed earlier, the jury did not specifically find that Farmer did not waive his right to compel liquidation, Or that the Separation of Practice Agreement did not constitute a final accounting contemporaneous with dissolution, its ultimate finding that Farmer did not waive his interest in the Laker fee or the Manson estate implicitly resolved these issues. Consistent with the jury's finding, we conclude that by the Separation of Practice Agreement the parties agreed to only one aspect of the winding up -- Disposition of hourly fees billed and received by or after June 1984 -- thus removing that issue alone from the accounting. In seeking a winding up and a final accounting, for which he eventually had to resort to court, Farmer exercised his right to compel liquidation of the partnership. Thus all work performed on partnership business unfinished at the date of dissolution and unaddressed by the Separation of Practice Agreement, including the Laker contingent fee case and administration of the Manson estate, was done for the benefit of the dissolved partnership. See Ellerby, (supra) , 138 Ill.App.3d at , 485 N.E.2d at 416; Resnick, supra, 49 Md.App. at , 434 A.2d at 587; Rosenfeld, supra, 146 Cal.App.3d at 219, 194 Cal.Rptr. at 191. The trial court did not err in awarding Farmer a share of fees received after dissolution, or in failing to calculate Farmer's interest based on the value of assets as of the date of dissolution.\n\n4. Application of the No-Compensation Rule\n\nAppellants further argue that they were entitled to compensation beyond their distributive share of surplus for their services in completing the Laker case. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e They argue that it would be inequitable to deny them that compensation while giving Farmer a share of the Laker fee even though he did no work for the partnership's benefit in winding up unfinished business. The trial court ordered the accountant to reduce the Laker fee by an amount representing Beckman \u0026 Kirstein's overhead expenses incurred in collecting the fee, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and adopted the resulting figure. We conclude this is the limit of appellants' right to reimbursement.\n\nD.C. Code § 41-117 (6) states unambiguously:\n\nNo partner is entitled to remuneration for acting in the partnership business, except that a surviving partner is entitled to reasonable compensation for his services in winding up the partnership affairs.\n\nAuthorities that have focused upon this language are in accord that a partner winding up the business of a partnership rightfully dissolved for any reason other than the death of a partner cannot recover compensation for completing unfinished business above his distributive share. Ellerby, supra, 138 Ill.App.3d at , 485 N.E.2d at 417; Berkson v. Berryman, 62 Md.App. 79, , 488 A.2d 504, 511-12 (1985); Resnick, supra, 49 Md.App. at , 434 A.2d at 587; Jewel, supra, 156 Cal.App.3d at 176-77, 203 Cal.Rptr. at 17; Frates, supra, 167 So.2d at 81. But see Cofer v. Hearne, 459 S.W.2d 877, 879 (Tex.Civ.App.1970). Indeed, in Jonathan Woodner Co. v. Laufer, supra, 531 A.2d at 286, this court read § 41-117 (6) to foreclose entirely a joint venturer's entitlement to quantum meruit damages upon dissolution.\n\nCommentators have recognized that the rule may yield harsh results in some applications. E.g., Comment, Winding Up Dissolved Partnerships: The No-Compensation Rule and Client Choice, 73 CALIF. L. REV. 1597, 1610-11 (1987). Even these critics recognize, however, that the rule is a creature of statute and that attempts by courts to evade it are inappropriate. Id. at 1641. Moreover, as the court noted in Jewel v. Boxer, supra, \"If there is any disproportionate burden of completing unfinished business here, it results from the parties' failure to have entered a partnership agreement which could have assured that such a result would not occur.\" 156 Cal. App. at 180, 203 Cal. Rptr. at 19. Finally, we perceive no inequity in the application of the rule here. Farmer testified, without serious contradiction, that before June 1984 his work represented the firm's principal source of revenue and allowed Beckman to concentrate on the as-yet unpaid Laker work.\n\nC. Use of the Accrual Method in the Accounting\n\nAppellants contend that the in-court accounting should have been performed on a cash basis, and that if it had been, Farmer would have been found to have received everything to which he was entitled. Because the Laker fee was not actually received until 1985, some time after dissolution of the firm on May 31, 1984, under a cash method it could not be counted as an asset of the firm subject to distribution under the accounting order. Appellants base this contention upon two arguments, neither of which is persuasive.\n\n1. Operation of Firm on Cash Method\n\nAppellants first point out that the partnership, during the course of its existence, maintained its accounts on a cash basis and that partners' distributions were based upon net annual profits. It seems apparent, at the outset, that the reasons why a firm operates on a cash or accrual basis during its life may bear no relation to fixing the relative interests of the partners on dissolution. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e As previously explained, the general rule is that fees for predissolution work in progress paid after dissolution are treated as assets of the firm subject to distribution on liquidation. A BROMBERG \u0026 L. RIBSTEIN, supra, § 7.08 (e). Does the manner in which the firm treated the fees for accounting purposes while in operation affect their treatment as firms assets? Although the issue has not been addressed in the District of Columbia, case law from other jurisdictions persuades us that, ordinarily, a firm's accounting method is not dispositive in deciding whether accounts receivable, including contingent fees, are assets subject to distribution after dissolution.\n\nIn Bader v. Cox, 701 S.W.2d 677 (Tex.Ct.App.1985), the widow of a deceased partner sued for her husband's interest in partnership income received after his death on contingent fee cases pending at the time of dissolution. Faced with contentions remarkably similar to those in the case at bar, the Court of Appeals of Texas held:\n\nending contingent-fee cases are partnership property which may or may not have value, depending upon the evidence. Thus, we cannot agree with Bader and Cox's contention that because the partnership operated on a cash-basis accounting system and because the value of the contingent-fee files at the time of decedent's death is not readily or easily ascertainable, the files are not assets of the partnership. The fact that fees are not earned until a case is concluded by settlement or judgment does not compel the Conclusion that the files lose their characterization as partnership assets. . . .\n\nId. at 682. In reaching this result, the court noted that, as here, the pending cases were \"undergirded\" with binding contracts, and that the surviving partners' duty to wind up included a duty to complete all the firm's executory contracts and to conclude unfinished partnership business. Id.\n\nSimilarly, in Seale v. Sledge, 430 So.2d 1028 (La.Ct.App.), writ refused, 437 So.2d 1155 (La.1983), the Court of Appeal of Louisiana concluded that former partners had an interest in a contingent fee received on settlement of a personal injury suit when the partnership agreement contained no specific language concerning dissolution, despite the fact that the firm maintained its accounts on a cash basis. The court rejected a per se rule from an earlier Louisiana case \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e that, when the accounting is on that basis, work in progress does not become an asset until the work is completed and the fee received. Id. at 1030-31. In deciding that the contingent fee should have been considered a partnership asset on dissolution, the court rejected the trial Judge's finding that the partnership had no interest in the fee even though one partner had obtained the client and filed the suit prior to joining the firm, and devoted more time to it than any other lawyer after joining the firm.\n\nIn Bailey \u0026 Williams v. Westfall, 727 S.W.2d 86 (Tex.Ct.App.1987), the court refused to set aside an arbitrator's Conclusion that a withdrawing partner in a law partnership had no interest in accounts receivable because the firm operated on a cash accounting system. There, however, the partnership agreement expressly provided for payments to a withdrawing partner: \"Within 90 days after the effective date of withdrawal, an amount of cash shall be paid to the partner who is withdrawing, equal to the amount to which he is entitled under normal bookkeeping procedures utilized by the firm on the effective date of his withdrawal, less any charges against his account which have been made.\" Id. at 88 (emphasis added). In Bader and Seale, supra, as in the instant case, the partnership agreement was either inconclusive or silent on distributions after dissolution, a point stressed by the Bailey court:\n\nIn Bader, we held that under the Texas Uniform Partnership Act, absent a partnership agreement, the widow of a deceased partner was entitled to her husband's share of his law firm's accounts receivable at his death, even though the firm used a cash basis accounting system. Where there is a partnership agreement, however, as there is in the present case, the rights of a withdrawing partner are governed by that agreement and not by statute.\n\n727 S.W.2d at 90 (citations omitted; emphasis added).\n\nWe adopt as sound the Bader/Bailey rule: absent a contrary agreement specifically governing post-dissolution accounting, pending contingent fee cases are partnership property and, therefore, assets subject to distribution on dissolution regardless of the fact that the firm operated under a cash method of accounting. As discussed below, since Farmer did not agree to forego an interest in accounts receivable for partnership work performed before dissolution, it was not error to treat certain fees as accruals on the date of dissolution.\n\n2. Paragraph 13 of the Separation of Practice Agreement\n\nAppellants contend that the handwritten amended paragraph 13 in the July 6, 1984 Separation of Practice Agreement embodied an agreement by all parties to conduct the post-dissolution accounting on a cash basis. They argue that, because the agreement for an out-of-court accounting provided for a cash basis methodology, it was error to conduct the in-court accounting using the accrual method. This contention lacks merit.\n\nThe master was appointed by consent of the parties to determine the respective interests of each of the partners as of the date of dissolution, according to a profit-sharing formula set out in the partnership agreements and repeated in the reference order. The order appointing the master prescribed in detail the methodology for this accounting, and expressly provided for the use of accruals for some component items. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Appellants, in essence, would disregard the clear provisions of the consent order, which the parties drafted, and hold that the accounting should have been conducted pursuant to a prior agreement of the parties. We conclude that the consent order, not the agreement, should govern the in-court equitable proceeding.\n\nThis is so not because the consent order constituted a waiver of any objection as to the methodology used in the accounting, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e but because the Separation of Practice Agreement is not nearly as conclusive as appellants urge Their assertions that \"the Superior Court ignored new paragraph 13 of the parties Separation of Practice Agreement which the parties wrote out in handwriting as their agreed accounting in lieu of 'winding up',\" and that \"there is no dispute that this accounting was to be performed on a cash basis,\" are but variations of the same argument eventually resolved against them by the jury: that Farmer agreed to waive his rights in certain accounts receivable when he signed the agreement.\n\nJudge Weisberg did not err in declining to accept Beckman's interpretation of Paragraph 13. In relevant part it said no more than: \"Revenues and expenses will be accounted for with a closing date of May 31, 1984 . . . .\" Although Beckman read this clause to mean that the partners intended the accounting to be \"limited to determining cash revenues received in the period January 1 through May 31, 1984, and cash expenses paid in that period,\" the trial Judge was not obliged to accept that interpretation. When an accounting has been referred to a special master, the trial court is required to adopt the master's findings of fact unless clearly erroneous. See Rosendorf v. Toomey, 349 A.2d 694, 699 (D.C.1975); Super. Ct. Civ. R. 53 (e)(2). The master's findings are presumptively correct, Case v. Morrisette, 155 U.S. App. D.C. 31, 38, 475 F.2d 1300, 1307 (1973), and the party excepting to them bears the burden of showing clear error. See Oil, Chemical \u0026 Atomic Workers Int'l Union, AFL-CIO v. NLRB, 178 U.S.App.D.C. 278, 283, 547 F.2d 575, 580 (1976), cert. denied, 431 U.S. 966, 97 S. Ct. 2923, 53 L. Ed. 2d 1062 (1977). Once the trial court adopts the master's findings, moreover, they become those of the court, Super. Ct. Civ. R. 52 (a); 9 C. WRIGHT \u0026 A. MILLER, FEDERAL PRACTICE AND PROCEDURE, § 2615 (1983), reversible on appeal only if clearly erroneous. Rosendorf v. Toomey, supra, 349 A.2d at 699. Because Judge Weisberg was not clearly wrong in adopting the master's findings, which reflected the accrual method set out in the consent order, there is no basis on which to disturb the results of the accounting. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIII. Fair Trial Issues\n\nAppellants contend that the trial court committed reversible error in admitting unfairly prejudicial evidence concerning events post-dating the Separation of Practice Agreement that had minimal probative value. They assert that any evidence concerning events that occurred after the parties negotiated and executed the agreement was essentially irrelevant on the central issue of the intended scope of the agreement at the time it was entered. In this category appellants place three items: repeated references at trial to the size of the Laker fee and its receipt more than a year after the July 6 agreement; Farmer's testimony that Beckman told him he would use the Laker fee to litigate until he saw \"the Farmer children starve\"; and testimony concerning a September 19, 1984 letter from Beckman to Farmer offering to compromise on the Laker fee.\n\nWhile we find no error in the admission of evidence related to the size and receipt of the Laker fee or the alleged remark concerning Farmer's children, we agree with appellants that the trial Judge erred in admitting the September 19, 1984 letter and in allowing plaintiff's counsel to use it in closing argument. Moreover, the error was not harmless. We must, therefore, remand for a retrial of the issues previously submitted to the jury.\n\nA. References to the Laker Fee\n\nAppellants filed a motion in limine for an order prohibiting any references to the Laker litigation fee, arguing that it was irrelevant to the issues at trial and that any probative value it had would be outweighed by its potential for prejudice. After Judge Kessler denied the motion, appellants renewed the issue before Judge Weisberg, who stated:\n\nI think it is really essential to the plaintiff's case that the jury be told that there was an amount that was speculated about in June of '84 and an amount that was received in October '85[;] to the extent that any of that forms the jury assessment of what the parties intended in June of '84 or July of '84 they are entitled to know that. And also the motives of the parties in acting the way they did. [Emphasis added.]\n\nFarmer defends the latter basis for admission, arguing that a central question before the jury was whether Beckman and Kirstein had breached their fiduciary duties to him, and that evidence of the fee -- particularly its size -- tended to show their motive to breach those duties. We agree.\n\nBy the time Farmer's cause of action went to the jury, directed verdicts had reduced it to the claim that Beckman and Kirstein wrongfully denied him his share of the Laker fee, thus breaching their fiduciary duties, and that Beckman's conduct was aggravated so as to warrant punitive damages. Farmer's evidence of the fiduciary breach spanned a time period both before and after the Separation of Practice Agreement was executed. Testimony and documents concerning receipt of the fee and its amount offered an explanation why appellants resisted his demand that they wind up and account. Beckman argues that even if the evidence was relevant on this ground, Farmer used it to argue improperly to the jury that he could not have intended to surrender his share of so large a fee in the July 6 agreement in exchange for so little. We need not decide whether the jury could have properly considered it for that purpose, because Judge Weisberg specifically instructed the jury that it was not to let the fact that a large fee was ultimately received affect its decision whether Farmer had waived a share of the fee. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e He also instructed the jury that arguments of counsel were not evidence, and were not to be used as a basis for its findings. We presume that these instructions were followed \"unless the contrary appears, or the circumstances are very unusual.\" Weeda v. District of Columbia, 521 A.2d 1156, 1163 (D.C.1987) (citation omitted). There was no error in the admission of this evidence.\n\nB. The \"See the Farmer Children Starve\" Comment\n\nIn response to an interrogatory from the defendants, Farmer stated that Beckman told him he \"would see the Farmer children starve\" before giving Farmer any portion of the Laker fee. During Farmer's deposition, he stated that Beckman had made the comment on or about July 2, 1984 at the firm's offices, with no one else present. Farmer also stated that Beckman might have repeated the remark on later occasions, perhaps in Kirstein's presence.\n\nBeckman's position was that he did not make the comment. Accordingly, the defendants moved in limine to bar testimony on the comment, claiming it was irrelevant and inflammatory. The Judge indicated he would rule on its admissibility before Farmer's opening statement. While the record on the day of opening statement does not contain the Judge's express ruling, it is clear from the record that he decided to admit the evidence.\n\nAgain we find no error. The comment, if the jury found it had been made, was probative on whether punitive damages were appropriate, since it tended to prove malice by Beckman toward Farmer, a necessary element of a claim for punitive damages. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e While the remark undoubtedly was prejudicial, it was not unfairly so given the likely -- and permissible -- use the jury would make of it. Beckman took the stand and denied having made the statement, and Kirstein testified that he had never heard it. The jury could weigh this against Farmer's uncorroborated testimony and decide whom to believe. The Judge did not abuse his discretion in admitting the evidence.\n\nC. The September 19, 1984 Letter\n\n1. The Facts\n\nSeveral months after the parties executed the Separation of Practice Agreement, following several letters from Farmer demanding that Beckman cooperate in a final winding up and accounting, Beckman signed and sent a letter to Farmer dated September 19, 1984. In pertinent part, the letter read:\n\nDear Don:\n\nDavid Kirstein and I have carefully considered your demands. As we have both informed you, we fundamentally disagree with your views and we believe you have no right, title or interests in any assets of our former practice. . . .\n\nEntirely without prejudice to our position that you are entitled to nothing, we propose the following as a full settlement of all claims:\n\n1. You will desist from making defamatory statements about me, David Kirstein or our firm.\n\n2. We will release you from all claims we may have against you.\n\n3. We will give you the choice of either (a) $5,000 payable on October 1, 1984, or (b) $200,000 from the first $2 million received by Beckman \u0026 Kirstein as fees in the Laker Antitrust Litigation.\n\n4. You will give us a full release and relinquishment of all claims, right, title or interest in any assets of our former practice.\n\nThis offer will remain open until 10:00 A.M., September 27, 1984. It is contingent on you 'making 'no defamatory statements about me, David Kirstein or the firm.\n\nDuring his case in chief, counsel for Farmer offered the letter into evidence. Counsel for Beckman objected, arguing that the letter was a settlement offer. After reviewing the document, the trial Judge overruled the objection without explanation and admitted the letter. Farmer then red it aloud to the jury. In \"friendly\" cross-examination of Beckman, counsel for Kirstein used the letter and references to the 'settlement offer it contained. Beckman explained the relationship of the settlement offer to the Separation of Practice Agreement. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nWhen counsel for Farmer objected to attempts by Kirstein's counsel to have Beckman discuss the letter's reference to defamatory conduct by Farmer, the Judge elaborated on his decision to admit the letter, which he acknowledged contained a settlement offer:\n\nTHE COURT: Part of the problem, frankly, Mr. Schwartz, when we -- when I ruled earlier that what might otherwise be considered an offer of settlement and, therefore, inadmissible in evidence, would be admitted in the context of this case because it was relevant to the intention of the parties when they entered the separation of practice agreement, what is sauce for the goose is for the gander. If offers of settlement by Mr. Beckman have to come in, they have to be entitled to show why he made such an offer. [Emphasis added.]\n\nCounsel for Farmer used the letter in closing argument to contend it was implausible that appellants would offer Farmer a share of the fee in the September letter if they believed he had given up any interest in it in the July separation of practice agreement. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Following closing argument, Kirstein moved for a mistrial arguing that the inference Farmer's counsel had suggested was so damaging he did not know how to address it in his own closing. Beckman concurred, calling the argument \"the kiss of death.\" The cart denied the motion, concluding that the jury was not prejudiced by the argument.\n\nIn denying the defendants' post-trial motion for a new trial, the Judge stated that the objection to the letter as a settlement offer misconceived the grounds of its admissibility. After noting that the defendants contended Farmer had given up a share of the Laker fee in the Separation of Practice Agreement, while Farmer argued that the agreement did not even address fees expected from completion of unfinished partnership business, the Judge explained:\n\nA central piece of Farmer's argument was that Beckman would stop at nothing to prevent him from sharing any part of [the Laker] recovery, and that the \"separation-of-practice-agreement\" defense was just another stumbling block erected by Beckman shortly before trial when his primary barricade -- the claim that Farmer was not even a partner -- was struck down by Judge Kessler's ruling on defendant's motion for summary judgment. It was therefore important for Farmer to show that on September 19, 1984, two and a half months after the Separation of Practice Agreement, while denying that Farmer was entitled to anything, Beckman was not saying that Farmer had contracted away his rights in the earlier agreement. The fact that Beckman also offered a settlement in that letter was purely incidental, and it was not at all prejudicial to Beckman when coupled with an express denial of liability in the same letter. [Emphasis by court.]\n\n2. Offers of Compromise To Show Liability\n\nThe law of evidence, reflecting a policy to promote private resolution of civil disputes, disfavors the use of an offer to compromise a disputed claim against the party making it as an admission of liability. This rule also recognizes the minimal probative value of a settlement offer as an admission against interest. See Fed. R. Evid. 408 (1988); C. McCORMICK, McCORMICK ON EVIDENCE § 274 (f) (3d ed. 1984). Hence this court has repeatedly held that an offer to compromise a claim is inadmissible on the issue of liability. See, e.g., Goon v. Gee Kung Tong, Inc., 544 A.2d 277, 280 (D.C.1988); Wayne Insulation Co. v. Hex Corp., 534 A.2d 1279, 1281 (D.C.1987); Pyne v. Jamaica Nutrition Holdings, 497 A.2d 118, 126-27 (D.C.1985).\n\nBeyond question the September 19 letter was, in substance, an offer by Beckman to compromise Farmer's claim. It occurred at a time when the parties were in clear dispute as to the validity of Farmer's claim, and when relations were so acrimonious as to make litigation almost inevitable. Cf. Goon, supra, 544 A.2d at 281; 1010 Potomac Assoc. v. Grocery Mfrs., 485 A.2d 199, 211 (D.C.1984); Crain v. Allison, 443 A.2d 558, 565-66 (D.C.1982) (for exclusionary rule to apply, parties must be in apparent dispute as to amount or validity of claim). Moreover, the letter wears a characteristic badge of an offer to compromise a disputed claim: an express disclaimer of liability. See Harrison v. District of Columbia, 95 A.2d 332, 334 (D.C.1953).\n\nFarmer, however, mirroring the trial Judge's reasoning in denying defendants' motions for a new trial, argues that the offer to compromise was not admitted against Beckman as an admission of liability; indeed, it was not offered for any purpose at all but rather was -- as the trial Judge opined -- a \"purely incidental\" part of a letter whose legitimate significance lay elsewhere, viz., in Beckman's failure to assert that Farmer had contracted away his rights in the earlier agreement. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e That aspect of the letter, Farmer maintains, was relevant to the parties' intent in executing the July 1984 agreement.\n\nThere are several difficulties with this argument. First, assuming the trial Judge had this distinction in mind, he issued no instruction to the jury, contemporaneously or at any time, charging them to disregard the settlement offer and consider only Beckman's failure in the letter to mention the earlier separation of practice agreement. Second, Farmer's counsel made no such distinction in arguing the contents of the letter to the jury, but rather directed the jury's attention precisely to its mention of the Laker anti-trust litigation and proposal of \"$200,000 from litigation.\" See note 37, supra. Third, asking the jury to consider what the letter did not say but not to consider the settlement offer would have been impractical in any event. The centerpiece of the letter was its \"propos[al of] the following as a full settlement of all claims. . . .\" It then listed four terms of settlement which included alternative dollar amounts, one for $200,000 of the Laker fee. If the settlement offer is removed from the letter, almost nothing remains. Moreover, consistent with the purpose of the exclusionary rule to promote settlement of disputes, Fed. R. Evid. 408 bars admission of \"vidence of conduct or statements made in compromise negotiations . . .\" (emphasis added). Beckman's failure to mention the separation practice agreement was assuredly \"conduct\" in the course of compromise negotiations, and its admission would be equally forbidden under the federal rule. We conclude that the trial court should have excluded the letter entirely as an inadmissible offer to compromise.\n\n3. Harmless Error\n\nThe remaining issue is whether admission of the letter was harmless error. To answer that question we must decide whether we can say \"with fair assurance, after pondering all that happened without stripping the erroneous action from the whole, that the judgment was not substantially swayed by the error . . . .\" Garvey v. O'Donoghue, 530 A.2d 1141, 1148 (D.C.1987), quoting Kotteakos v. United States, 328 U.S. 750, 765, 66 S. Ct. 1239, 90 L. Ed. 1557 (1946). Before the advent of the Federal Rules of Evidence, Judge Learned Hand observed that \"questions [concerning a settlement offer] are especially apt to deflect the minds of a jury from the issues,\" and, because no jury instruction would cure the damage, \"it would seem that the only relief would be a mistrial . . . .\" Paster v. Pennsylvania. R.R., 43 F.2d 908, 911 (2d Cir.1930). Since the adoption of Fed. R. Evid. 408 (\"Compromise and Offers to Compromise\"), however, federal courts have employed a more flexible standard of assessing prejudice, reflecting the fact that not only formal offers to compromise are inadmissible but also \"vidence of conduct or statements made in compromise negotiations . . . .\" See McInnis v. A.M.F., Inc., 765 F.2d 240, 251 (1st Cir.1985). Thus, as Judge Weinstein has pointed out, \"specially in long and hotly contested trials, a revelation about a aspect of the negotiations, or indirect references to an offer or agreement of compromise, may fade into insignificance, particularly if the court adequately instructs the jury.\" 2 J. WEINSTEIN, WEINSTEIN'S EVIDENCE para. 408[06] (1989).\n\nIn the present case, however, we deal with an explicit and formal offer to compromise read fully to the jury and argued strongly by Farmer as an admission by Beckman and Kirstein that Farmer had not waived his right to the Laker fee. Moreover, as pointed out, the trial court gave no instruction to the jury about possible permissible uses of the compromise letter. It is true that the trial lasted three weeks and there was plentiful other properly admitted evidence as to what the parties understood the Separation of Practice Agreement to mean in regard to the Laker fee. In particular, Farmer had submitted written proposals for a winding up after execution of the agreement which discussed the Laker fee, and the failure of Beckman and Kirstein to raise the agreement in response to these enabled Farmer's counsel to argue that they recognized Farmer had not waived any rights to the fee. But, as we have seen, the Separation of Practice Agreement -- especially its provision that \"work and bills from July 1, 1984\" were to be \"for the separate accounts of RMB and DMK\" and the client list reserving the Laker liquidator to Beckman and Kirstein -- is ambiguous and admits of contrary interpretations. Beckman's argument that Farmer gave up the still-contingent Laker fee in return for a \"very hefty bill\" submitted to Princess Casinos and other client fees, while rejected by the jury, was not frivolous. In these circumstances, we cannot be satisfied with the facts that the compromise offer was coupled with a denial of liability and that Beckman testified that it was only \"a price of peace.\" In part, it is precisely because a settlement offer includes denial of liability that it risks \"deflect the minds of a jury from the issues.\" Paster, supra, 43 F.2d at 911. And, although the jury knew that the Laker fee received exceeded $6 million, an offer to pay \"$200,000 from the first $2 million\" (when the actual fee was still unknown) could well have impressed the jury as revealing more than a desire to avoid litigation.\n\nWithout doubt the trial Judge, in ruling on a motion for new trial, is in a better position than this court to gauge the effect of erroneously admitted evidence or improper comment on the jury. Meyer v. Capital Transit Co., 32 A.2d 392, 393-94 (D.C.1943) (applying rule to comment on defendant's policy of settling claims). We cannot read Judge Weisberg's opinion, however, as concluding that the settlement offer -- even if central rather than \"incidental\" to the letter -- was of no significance in the context of the entire trial. Had the Judge, \"having the opportunity to observe the trial as it unfolds\" and \"to weigh and reconcile the evidence,\" Davis v. United States, 564 A.2d 31, 41 (D.C.1989) (en banc), concluded the evidence overwhelmingly favored Farmer's construction of the agreement, we would owe substantial deference to that appraisal. But the court made no such determination and our own examination of the record likewise does not persuade us the issue was one-sided. Admission of an offer to compromise implicates the basic fairness of a trial. See Hiltpold v. Stern, 82 A.2d 123, 126 (D.C.1951) (\"A mere offer of compromise is to be protected because a party to a controversy is permitted in the interest of peace to tender such terms as to him shall seem proper, and if rejected by the other party it would be unfair to make use of it as an admission of liability.\"). Since we cannot say with fair assurance that the letter, coupled with Farmer's argument to the jury, did not affect the verdict, the case must be retried without admission of the letter.\n\nIV. Breach of Fiduciary Duty\n\nAppellants, together and individually, challenge the finding of breach of fiduciary duty on several scores.\n\nA. Exclusivity of the Accounting Remedy\n\nBoth argue that the wrongful withholding of one partner's share of a dissolved partnership's assets is compensable only by an equitable action for an accounting. Beckman argues that the trial court erred in \"creating a new tort\" which lacked the essential element of proof of harm. He maintains that, because the District of Columbia Uniform Partnership Act afforded Farmer the remedy of an accounting for the alleged wrongful withholding of his share, Farmer could demonstrate no legal injury from a breach of fiduciary duty necessary to support a cause of action in tort. Kirstein argues, relatedly, that an action for an accounting under the Partnership Act has entirely \"subsumed and replaced\" any cause of action for breach of fiduciary duty arising from the withholding of a former partner's share after dissolution\n\nThe trial Judge framed this issue in his order denying Defendants' post-trial motions as follows:\n\nWhere a breach of fiduciary duty is proven, but the essence of the tort is the wrongful withholding of a partner's share on the dissolution of the partnership, does the statutory equitable remedy of an accounting preempt the common law tort remedy of a suit for damages? This appears to be a question of first impression in this jurisdiction, and this court answers it in the negative.\n\nFor the reasons discussed below, we agree with the trial court.\n\n1. Accounting As Prerequisite to Action at Law\n\nThe District of Columbia has long followed the traditional rule that ordinarily a partner may not sue a co-partner in an action at law with respect to partnership transactions until an accounting in equity, a settlement, or a promise to pay has been obtained. See Wright v. Armwood, 107 A.2d 702, 703 (D.C.1954); Boyle v. Smith, 64 A.2d 428, 429 (D.C.1949). To some extent the rule is a vestigial reflection of the historical division between courts of law and equity, hut it also serves a function arising from characteristics of the partnership relation. It recognizes that partners hold partnership property in undivided interests, and that no contractual debtor/creditor relationship can arise between partners until there has been an accounting or its equivalent. Boyle, supra, 64 A.2d at 429. Aside from the problem presented by the undifferentiated manner in which partnership property is held while the enterprise exists, practical difficulties commend the settlement of accounts before an action at law between partners can be maintained. The value of partners' respective interests cannot be determined while accounts are in flux, but only after partnership liabilities are satisfied, all assets are marshalled, the partners' capital accounts adjusted, and the amount of any surplus ascertained. Bromberg and Ribstein explain:\n\nThe practical reasons for the exclusivity rule focus on the type of claim involved and the necessity of resolving it together with all other claims of the partners in a single proceeding. First, no rights of the partners can accurately be determined until a balance is struck . . . Second, without regard to the need for a balance, it is most efficient to resolve multiple claims dealing with related facts in a single proceeding.\n\nA. BROMBERG \u0026 L. RIBSTEIN, (supra) , § 6.08, at 6:100-01.\n\nThe general rule is subject to several exceptions reflecting its basic rationale. If the partnership's business involves a single completed transaction or only one or a few items, and no complicated accounts are involved such that no accounting or appraisal is necessary to fix the amount due the plaintiff, a partner may sue at law for a share of partnership assets. Boyle, supra, 64 A.2d at 429. Also, resort to equity may not be necessary when breach of the partnership agreement, wrongful dissolution, fraudulent breach of trust, or misappropriation of money clearly belonging to another partner is charged. Id. This exception envisions tortious behavior by the defendant partner beyond the scope of rightful partnership activity. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nIn this case, the applicability of these exceptions is not clear cut. The trial Judge took Farmer's claims of fraud, conversion, and wrongful dissolution away from the jury, leaving only the breach of fiduciary duty count. Yet we recognize that the essence of Farmer's claim was that his rights as a partner were denied for the purpose of depriving him of a share of the Laker fee. The facts of this case thus approach situations in which courts have recognized an exception for tortious acts by one partner against another.\n\nIt is not necessary, however, to decide whether Farmer's cause of action falls within the scope of any of the exceptions to the rule. That is because the Judge determined the final state of partnership accounts before trying the remaining legal issues to the jury. By adopting the special master's report settling the partnership's accounts and establishing the relative shares of the partners in the surplus, the Judge fulfilled the purposes of the common law prerequisite to an action at law: a balance was struck, in that the jury was charged that the accounting established Farmer's shares of partnership assets as conclusive facts for purposes of trial of the legal issues; and sequential trial of Farmer's equitable and legal claims served the goal of efficiency by resolving all claims and defenses in a single action before final judgment was entered. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nAppellants contend, however, for separate reasons, that the determination of Farmer's interest in the accounting barred his tort claims of breach of fiduciary duty based upon failure to wind up and render an account. We treat these arguments in turn.\n\n2. Beckman Failure of Proof of Injury\n\nBeckman contends that the remedy of an accounting nullifies a legal claim for fiduciary breach by canceling out any special damages: the plaintiff can prove no injury in fact when he has a right to recover in equity. We reject this contention. First, contrary to Beckman's claim, a breach of fiduciary duty arising from a failure to render an account is not a novel theory of tort recovery. The Partnership Act recognizes a partner's duty to account as a trustee to the partnership for any profits derived without the consent of the other partners in any transaction connected with the conduct or liquidation of the partnership. D.C. Code § 41-120 (a). Considering this statutory scheme, it is not startling that a refusal to wind up and to account for profits received during the liquidation phase should be treated as a fiduciary breach.\n\nCases cited earlier involving retention of legal fees received by former partners after dissolution for unfinished business of the partnership follow the sound rule that each partner has a clear duty to wind up unfinished business for the partnership's benefit. E.g., Ellerby, supra, 138 Ill.App.3d at , 485 N.E.2d at 416; Rosenfeld, supra, 146 Cal.App.3d at 216-17, 194 Cal.Rptr. at 189-90. In completing unfinished business, each partner remains accountable as a fiduciary to the former partners, Resnick, supra, 49 Md.App. at , 434 A.2d at 587, and any diversion of benefits for the former partner's own personal or professional gain is also a breach of fiduciary duty. See Rosenfeld, supra, 146 Cal.App.3d at 217, 194 Cal.Rptr. at 190. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e The present case thus involves no unheard-of \"new tort,\" but rather a failure to observe the duties of loyalty and fair dealing that partners have been recognized to owe one another for centuries. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nSecond, Beckman is incorrect in assuming that the availability of equitable remedies renders it impossible to make out a prima facie case in tort. Once some injury for which the law provides a remedy has been pleaded and proven, tort damages quantify and compensate the harm suffered by the plaintiff. W. PROSSER \u0026 W. KEETON, THE LAW OF TORTS, § 1, at 5-6 (5th ed. 1984). Beckman correctly notes that a \"breach of fiduciary duty is not actionable unless injury accrues to the beneficiary or the fiduciary profits thereby.\" Day v. Avery, 179 U.S.App.D.C. 63, 74 n.56, 548 F.2d 1018, 1029 n.56 (1976), cert. denied, 431 U.S. 908, 97 S. Ct. 1706, 52 L. Ed. 2d 394 (1977). The trial court here concluded that compensatory damages in tort were \"co-extensive\" with the amount to which it found Farmer entitled in the accounting. Injury quantified as damages flowing from a breach of a fiduciary duty to wind up and account may equal the amount determined to be due in an accounting, but it hardly follows that no injury in fact occurred just because it is redressable in equity.\n\nIt is basic that the same set of facts can support claims for legal and equitable relief, and that these claims may be tried in the same action. Indeed, Boyle and Wright appear to contemplate and encourage trial of legal causes in the same action as the accounting. Boyle, supra, 64 A.2d at 430 (rule that accounting must precede trial of legal claims is no ground for dismissing suit for wrongful conversion of partnership funds and fraudulent breach of duty; \"separate action for accounting was not necessary; it could have been had in the same cause\"); Wright, supra, 107 A.2d at 704 (even if partner's suit against co-partner for contribution for payment of partnership debt did not fall within \"single transaction\" exception to exclusivity rule, claim should not have been dismissed because accounting and legal claims could be tried in same action). Moreover, it is not difficult to conceive of situations where harm flowing from a breach of a partner's duty to wind up and account results in damages that would go unredressed solely in an equitable action for an accounting. As the jury found in this case, harm may be willful or malicious enough to provide a basis for punitive damages. And while punishment and deterrence may be proper goals of civil damages in certain limited circumstances, Harris v. Wagshal, 343 A.2d 283, 288 n.13 (D.C.1975), it is not the role of courts of equity to punish wrongful conduct. See Stern v. Lucy Webb Hayes Training School for Deaconesses \u0026 Missionaries, 381 F. Supp. 1003, 1018 (D.D.C. 1974); SCRAP v. United States, 353 F. Supp. 317, 322 (D.D.C.), vacated on other grounds, Aberdeen \u0026 Rockfish R. Co. v. SCRAP, 414 U.S. 1035, 94 S. Ct. 532, 38 L. Ed. 2d 326, 94 S. Ct. 533 (1973). \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\n3. Kirstein Statutory Preemption\n\nKirstein, relying on a related preemption theory, contends that adoption of the Partnership Act -- specifically the right to an account under § 41-121 -- abrogated any common law right to seek damages in tort for breach of a partner's duty to wind up unfinished business and render an account. However, he points to nothing in the Act or its history demonstrating that the drafters intended a formal accounting under § 41-121 to be the exclusive remedy for a breach of the duties imposed by § 41-120. Not only is the Act silent on the issue of exclusivity of remedies, but the history of the Uniform Partnership Act, which our statute replicates, suggests that the provision for an accounting was meant to expand, not restrict, remedies available to a partner aggrieved by a fiduciary breach. Before the Act recognized a partner's right to demand a formal accounting when a co-partner breached the duty to account, it was necessary to formally dissolve the partnership, with the consequence of liquidation and destruction of the business. See Commissioner's note to UNIFORM PARTNERSHIP ACT § 22, 6 U.L.A. 284 (1969) (\"ordinarily, a partner is not entitled to a formal account, except on dissolution\"). \"To relieve the dilemma of the partner who seeks a pre-dissolution account, the drafters of the U.P.A. broadened the grounds for an accounting so that it is not contingent on dissolution.\" A. BROMRERG \u0026 L. RIBSTEIN, (supra) , § 6.08, at 6:97. Provision for a pre-dissolution accenting is weak evidence of an intent to \"subsume and replace\" a common law right of action for failure to wind up and account in good faith.\n\nMoreover, anticipating situations where Its language is silent, our statute declares: \"in any case not provided for in this chapter the rules of law and equity, including the law merchant, shall govern.\" D.C. Code § 41-104. As discussed earlier, our decisions suggest that a determination of the partners' respective rights in an equitable action for accounting is (subject to exceptions) a prerequisite but not a bar to an action at law. Wright, supra, 107 A.2d at 703-04; Boyle, supra, 64 A.2d at 429-30. Accord, Weil v. Markowitz, 264 U.S.App.D.C. 381, 388 \u0026 n.13, 829 F.2d 166, 173 \u0026 n.13 (1987) (accounting \"condition precedent\" to action at law between partners; construing District of Columbia and New York law). This rule is particularly sound where, as in the present case, legal disputes affecting the partners' entitlements established in the accounting remained unresolved after that proceeding. Kirstein cites authority from other jurisdictions construing their Partnership Acts as having abolished common law remedies. E.g., Jennison v. Bierer, 601 F. Supp. 1167, 1178 (D.Vt.1984) (Vermont Partnership Act \"establishes the right and provides the remedy\" for breach of fiduciary duty). But since our statute is silent on the issue of exclusivity and implies that matters unaddressed therein are controlled by common law rules, we see no reason to interpret the statute in a manner inconsistent with Boyle and Wright.\n\nB. Sufficiency of the Evidence\n\nBoth Beckman and Kirstein contend that the evidence was insufficient to show that either breached the duty to wind up and render an account. We deal with this issue summarily. Appellants' emphasis on the Judge's grant of directed verdicts in their favor on Farmer's intentional tort claims of fraud, conversion and civil conspiracy is misplaced. The absence of sufficient proof of one or more elements of those claims clearly does not mean, as a matter of law, that appellants committed no breach of the duties of good faith and fair dealing that partners owe one another. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Although there was much conflicting testimony, the jury could fairly find breach of fiduciary duty by both appellants. Besides evidence of appellants' ongoing refusal, despite Farmer's written and oral requests to both, to conduct a winding up and final accounting, the record contains ample evidence of an effort by Beckman, with Kirstein's acquiescence and participation, to deny Farmer his rights as a partner and exclude him from sharing in the Laker fee settlement. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e This court will not weigh the evidence or pass upon the credibility of witnesses. Queen v. Postell, 513 A.2d 812, 816 (D.C.1986), quoting V.E.M. Hotel Serv. v. Uline, 190 A.2d 812, 813 (D.C.1963). Where a \"jury performs its function under proper instruction, we are without authority to set aside its resolution of factual issues, or to substitute our own views,\" Dollak v. Educational Aids Co., 214 A.2d 481, 483 (D.C.1965); American Marietta Co. v. Griffin, 203 A.2d 710, 712 (D.C.1964). The jury was correctly instructed that partners occupy a position of trust and good faith toward one another, and have a duty both to disclose all pertinent information relating to the partnership and to account to the partnership for any fee received from a transaction connected with the winding up. The jury could properly find that Beckman and Kirstein had failed to discharge their fiduciary duties toward Farmer.\n\nC. Kirstein's Joint and Several Liability on the Accounting\n\nJudge Weisberg entered judgment against Kirstein for nearly the full amount found to be due Farmer in the accounting, \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e holding Kirstein jointly and severally liable to the extent of Farmer's injury. Because Kirstein assumed a relatively \"passive\" role in the conduct in derogation of Farmer's rights as a partner, however, the Judge required Farmer to attempt to execute the judgment against Beckman before seeking to enforce it against Kirstein.\n\nKirstein contends that he committed no acts amounting to a breach of trust which harmed Farmer, and thus cannot be held liable for the judgment on a theory of direct tort liability. We hold there was sufficient evidence to support a finding that Kirstein breached his fiduciary duties independently, and so reject this contention. While Kirstein's breach of duty clearly renders him liable for some part of the judgment, however, this Conclusion does not anger the question framed by Judge Weisberg as one of first impression in this jurisdiction: whether both Kirstein and Beckman can be held jointly and severally liable to the full extent of Farmer's injury resulting from a concerted course of disloyal conduct, where Kirstein \"was a relatively passive participant in Beckman's scheme to prevent Farmer from collecting his share of the expected Laker fee.\"\n\nKirstein reasons that the Judge \"apparently concluded that Farmer was in the same position as a third party creditor\" in holding Kirstein jointly and severally liable. Farmer argues that, as an \"expelled\" partner, he had the status of a creditor against the partners continuing the business, see D.C. Code § § 41-140 (f), -141, allowing him to proceed against both of them. We agree with Kirstein that these sections are inapposite, and afford no basis for the imposition of joint and several liability in the circumstances of this case.\n\nAs we have previously concluded, dissolution was not caused by Farmer's \"explusion\" within the meaning of the Partnership Act, id. § 41-130 (1)(D), but rather by Beckman's exercise of his right to dissolve the partnership at will. Id. § 41-130 (1)(C). The partnership agreement made no provision for expulsion of a partner, see § 41-137 (a), nor for continuation of the business following dissolution. Thus, whether Farmer was a partnership creditor depends on whether he elected to allow Beckman and Kirstein to continue the business, thereby invoking the scheme for compensating him for his interest set out in § 41-141. To the contrary, as we held in Section II (B)(3), (supra) , Farmer elected to compel liquidation, and the collection of the Laker fee was part of the winding up of unfinished partnership business. Indeed, Beckman's and Kirstein's fiduciary duties to Farmer in completing work on the Laker fee settlement continued after dissolution because their acts occurred in the legal context of winding up, as opposed to continuing, the partnership business. Thus, sections of the Act dealing with the continuation of the business following expulsion of a partner are inapplicable.\n\nAs the trial court recognized, however, the fiduciary nature of Kirstein's relationship with Farmer, and the jury's finding that he abused his position of trust and confidence, provide an independent legal basis for holding him liable for Farmer's entire injury. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e When two or more tortfeasors contribute to produce a single injury, each may be held severally liable for the full amount of the judgment. Leiken v. Wilson, 445 A.2d 993, 999 (D.C.1982). In this situation, compensatory damages in tort are non-apportionable, regardless of whether the tortfeasors act separately or in conjunction with one another. Hill v. McDonald, 442 A.2d 133, 137-38 \u0026 n.3 (D.C.1982); Remeikis v. Boss \u0026 Phelps, Inc., 419 A.2d 986, 991-92 note (D.C.1980). As Judge Rutledge stated in a seminal decision:\n\nhether [joint tortfeasors] act independently or in concert, the nexus between them and the person their acts combine to injure is not and has not been entire. Each is bound to him separately and for the full injury. . . . It is no defense for wrongdoers that others aided in causing the harm. Each is responsible for the whole.\n\nMcKenna v. Austin, 77 U.S. App. D.C. 228, 233, 134 F.2d 659, 664 (1943). Here, the jury concluded that Beckman and Kirstein breached a legal duty owed to Farmer, thereby causing him an injury compensable by damages which the Judge established to be equal to the amount due in the accounting. In entering judgment following trial of the legal claims, the Judge correctly refused to apportion the judgment between the defendants. Recognizing that Kirstein's conduct may have been less culpable than Beckman's, however, he exercised his equitable powers to subordinate Kirstein's liability to Beckman's. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nKirstein further argues that he should escape liability because Beckman, not he, controlled dealings with Farmer and the Disposition of the Laker fee. The record, however, shows that Kirstein acquiesced in Beckman's actions with full knowledge of the latter's intentions toward Farmer, that Kirstein had direct dealings with Farmer in which Farmer's demands for an accounting and the financial status of the firm were discussed, \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e and that Kirstein participated in the collection of the Laker fee settlement and in acts necessary to complete the transfer of the bank accounts. Each partner, including Kirstein, had a right to jointly control the business, as well as to compel an accounting and force a winding up in court after Beckman refused Farmer's repeated demands to do so. Breaches of fiduciary duty are not limited to affirmative acts; a failure to exercise rights, where there is a duty to do so, can constitute a violation. See Stern v. Lucy Webb Hayes Training School, supra, 381 F.Supp at 1014 (corporate director breaches fiduciary duty by failing to inform himself sufficiently to permit exercise of management authority, and by permitting negligent mismanagement by others).\n\nAlthough developed in the context of other fiduciary relations, the rule that a fiduciary is liable for the wrongful acts or omissions of a co-fiduciary when he connives at, participates in, or is negligent in failing to act to prevent them is properly applied to partners, who also owe one another special duties of loyalty and care. See 3A S. FLANAGAN \u0026 C. KEATING, FLETCHER CYCLOPEDIA OF THE LAW OF PRIVATE CORPORATIONS § 1089, at 146 (rev. perm. ed. 1986) (liability of corporate directors); Ralston v. Easter, 43 App. D.C. 513, 522-23 (1915) (trustee jointly liable for negligently allowing another to dissipate assets of trust); Lansburgh v. Parker, 41 App.D.C. 549, 553 (1914), quoting Colburn v. Grant, 16 App.D.C. 107, 113, aff'd, 181 U.S. 601, 21 S. Ct. 737, 45 L. Ed. 1021 (1900) (trustees liable for act of another if they, \"by their own voluntary co-operation or connivance, enabled some one or more of them to violate the trust\"). Under these circumstances, the \"passive\" tortfeasor is directly liable, and \"not merely an accessory under an attenuated theory of respondeat superior or constructive notice.\" Stern, supra, 381 F. Supp. at 1014. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nFinally, relying principally on Langness v. \"O\" Street Carpet Shop, 217 Neb. 569, 353 N.W.2d 709 (1984), Kirstein contends that even if he is properly found severally liable, his liability should be limited to the amount that came into his hands in excess of the partnership share to which he was entitled. Because he received no more than the amount to which the partnership agreement entitled him, he argues, he should not be held liable for any of Farmer's damages.\n\nIn Langness, the Supreme Court of Nebraska upheld the imposition of several liability against partners in a case involving a deficient distribution following winding up, but ruled that each partner's liability \"should be no more than the excess he received over his proper share.\" Id. at , 353 N.W.2d at 714. The court noted that \"while it is true that partners are in a fiduciary relationship . . . that proposition does not lead to the imposition of automatic joint liability of the defendant partners to the plaintiff partner for debts owing by the partnership to the plaintiff partner.\" Construing the counterpart to our Partnership Act's § 41-120, the court held that \"upon dissolution, each partner impliedly consents that his co-partners receive their appropriate shares of the partnership assets. Anything one partner receives over his appropriate share is obtained without the consent of the other partners.\" Id. While Langness recognized that full joint liability was not an automatic consequence of retention of excess profits by certain partners, it by no means forecloses that result in appropriate circumstances.\n\nThe excess profits held by the defendant partners in Langness were the product of good faith errors in the out-of-court accounting duly conducted after the business was wound up. Unlike the present case, there was no allegation of a complete refusal to wind up or account, nor any suggestion of bad faith or a concerted effort to deprive one partner of his rights. Indeed, in limiting the liability of each partner, the court specifically noted that \"this is not a case where it was pled or proved that Friedman and 'O' Street Carpet engaged in a concerted fraud upon their partner Langness.\" Id. Although Judge Weisberg directed a verdict in Beckman's and Kirstein's favor on the fraud and civil conspiracy counts, we do not read Langness, or any other decision, \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e to hold that joint and several liability is only appropriate in the narrow circumstances where a technical conspiracy to defraud a partner is proven. As the Judge noted, the gravamen of Farmer's claim was that \"a pattern of conduct by [Beckman and Kirstein], including alleged acts of deceit and wrongful refusal to account to Farmer for his partnership share, constituted a breach of their fiduciary duty to him.\" Given the jury's finding of Kirstein's knowing acquiescence and participation in Beckman's campaign to thwart Farmer's partnership rights, we conclude that imposition of joint and several liability was appropriate as a matter of law.\n\nV. Jury Instructions\n\nBeckman and Kirstein argue that because the Judge told the jury that the court had concluded Farmer was entitled to certain amounts in the accounting, including the Laker fee and the Manson estate fee, and then instructed the jury that a failure to account for fees received in winding up unfinished business was a breach of fiduciary duty, it dictated the jury's findings that Beckman and Kirstein breached their duty and that Farmer was injured thereby. We conclude, to the contrary, that the Judge's instructions fully informed the jury that the liability aspect of the tort claim -- including injury and causation -- was solely within their province, and that only the damages issue was bound up with the accounting.\n\nAfter leaving the subject of the accounting, the Judge told the jury that they should consider the tort claim \"separately and independently\". \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e In instructing the jury that a failure to account after dissolution was a breach of fiduciary duty, the Judge also took care to point out that this would not be so if the parties agreed to a division of property. He then explained the defendants' position that there was no breach of duty because the parties had agreed to divide the assets in the July 6 agreement. He emphasized that the burden of proving a breach and injury by a preponderance of the evidence was on Farmer, and that if he failed to carry it, a verdict must be returned for Beckman and Kirstein we find no error in the instructions underlying the jury's rejection of the contractual waiver defense.\n\nFinally, Kirstein contends that the Judge, in instructing the jury that tort damages were coextensive with the amount found due in the accounting, violated his Seventh Amendment right to have the \"jury determine the amount of quantifiable damage resulting from the breach of fiduciary duty, if any.\" Kirstein has failed to preserve this issue for appeal. First, he never objected to the instructions on this ground before the jury retired. See Super. Ct. Civ. R. 51; Manes v. Dowling, 375 A.2d 221, 224 (D.C.1977) (failure to timely object to jury instruction treated as waiver). Indeed, he failed to object on this basis during the Judge's numerous expressions of intent to so instruct the jury during the course of the trial. Kirstein objected to the fiduciary breach instruction because, he contended, there was no evidence of breach of duty and because he was not the winding up partner and had no duty to account -- issues concerning liability -- but not because of constitutional infirmity in the instructions on damages.\n\nFurthermore, his consent to remove the issue of compensatory tort damages from the jury is shown affirmatively by the record. After the directed verdicts reduced Farmer's claims to breach of fiduciary duty against Beckman and Kirstein and punitive damages against Beckman alone, the Judge addressed the consequences of the absence of a punitive damages claim against Kirstein:\n\nIs it your position [Mr. Schwartz, counsel for Farmer], that [with respect to the claim of fiduciary breach against Kirstein] I should instruct the jury if they find Plaintiff has proven that claim by a preponderance, then the damages to be awarded to Mr. Farmer are to be awarded as part of the accounting and, therefore, no separate award of damages is appropriate? [Emphasis added].\n\nAfter Farmer's counsel answered yes, Kirstein's counsel responded:\n\nI don't know what damages you have in mind in the accounting for the breach of fiduciary duty. See, that is my problem. understand where your honor is at and it seems to me that as long as you tell the jury that if they find a breach of . . . fiduciary duty, you will handle the damages, if any. Is that all right? And it is not for them to decide, that is all right with us. [Emphasis added].\n\nThis court does not consider an issue not raised before the trial court except in cases where an inJustice would result Chase v. Gilbert, 499 A.2d 1203, 1209 (D.C.1985). We perceive no such inJustice here, and accordingly reject Kirstein's Seventh Amendment claim.\n\nVI. Conclusion\n\nThe judgments against appellants are reversed and the case is remanded for retrial in accordance with this opinion.\n\nSo ordered.\n\nSTEADMAN, Associate Judge: I concur in the result. Although the indication is, in understatement, very strong that a partnership existed, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and although the motions Judge may well have felt she was dealing with the matter pursuant to the posture presented by counsel for both parties, cf. Vessels v. District of Columbia, 531 A.2d 1016, 1019 (D.C.1987) (trial court may review record \"in the context of the legal and factual issues as framed by the parties at summary judgment\"); Cloverleaf Standardbred Owners Ass'n v. National Bank of Washington, 512 A.2d 299, 300 (D.C. 1986) (\"not the burden of the trial court to search the record, unaided by counsel, to determine whether summary judgment is proper\"), \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e I cannot assert with confidence that the result of Part I of the majority opinion is an unwarranted application of our perhaps somewhat cramped doctrine governing summary judgment. Cf. Vessels, supra, 531 A.2d at 1019 (\"ummary judgment is a valuable tool; it facilitates just, speedy and inexpensive determination\" of lawsuits (citing Celotex Corp. v. Catrett, 477 U.S. 317, 106 S. Ct. 2548, 91 L. Ed. 2d 265 (1986)). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e I also entirely agree with the Discussion and result in Part III dealing with claimed evidentiary errors in the jury trial.\n\nBeyond that, I believe we should refrain at this time from further review of the proceeding to date. The course that events will take upon remand is not entirely predictable. The full content and shape of a new record is uncertain. Any legal issues that may remain disputed \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e could be dealt with in the context of precise actual facts which squarely present the issues for determination Resolution of the issues in Parts I and III seems to represent an effective Disposition of this particular appeal, without venturing -- perhaps entirely unnecessarily -- into areas of functional dicta.\n\n\u003cspan class=\"fn\"\u003e1. Our reversal of the judgment does not diminish our respect for the manner in which the trial court -- Judges Kessler and Weisberg -- handled the numerous and complex issues of partnership law presented by this case. Resolution of those issues, two of which Judge Weisberg identified as of first impression in this jurisdiction, has been aided by the incisive analysis which the trial court brought to bear upon them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In that peccatum originale lay the genesis of this entire litigation, which one can only hope will serve as an object lesson to lawyers to practice what they counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Most significantly, in March 1983, while the firm was negotiating for leased space in a newly constructed building at 1400 Eye Street, Beckman wrote a memorandum to Farmer and Kirstein suggesting the three form a corporation to acquire the leasehold, and then sublease the premises to the partnership. He cited \"problems of personal gain or loss in a partnership with changing partners\" and the fact that \"very time a partner leaves, it is my understanding of the law of partnership that it is a dissolution of the partnership.\" Farmer and Kirstein apparently disagreed with the proposal, and on May 18, 1983 Kirstein signed the lease naming \"Beckman, Farmer \u0026 Kirstein, a partnership\" as tenant; Farmer attested as a witness. Beckman did not sign the lease.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The antitrust defendants moved to disqualify Beckman \u0026 Farmer, alleging that Farmer had acquired information concerning the defendants in government service and private practice. District Judge Harold Greene denied the motion, concluding that it was ill-founded and interposed to \"harass\" the liquidator. See Laker Airways v. Pan American World Airways, 103 F.R.D. 22, 41, 42 (D.D.C. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The reference to \"advance draws\" pertained to an understanding among the attorneys that expenses billed to or reimbursed by the firm for personal purposes would be deducted from the \"draw\" of the appropriate attorney.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. According to the memo, Beckman had precipitated this \"crisis\" by advising Farmer that Beckman planned to instruct the staff to answer the telephones in the name \"Beckman and Kirstein\" and to substitute \"Beckman and Kirstein\" stationery for the \"Beckman, Farmer \u0026 Kirstein\" letterhead effective July 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Section 41-106 (4) states in part: \"The receipt by a person of a share of the profits of a business is prima facie evidence that he is a partner in the business . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. As the Official Comment to § 6 of the Uniform Partnership Act (D.C. Code § 41-105) states: \"Ownership involves the power of ultimate control. To state that partners are co-owners of a business is to state that they each have the power of ultimate control.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Section 41-117 states in part: \"The rights and duties of the partners in relation to the partnership shall be determined, subject to any agreement between them, by the following rules: . . . (5) All partners have equal rights in the management and conduct of the partnership business\" (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Stanley Tralins, the firm's accountant, testified in deposition that he believed the enterprise was a partnership until April of 1985, when Beckman instructed him not to file a 1984 partnership tax return. Prior to this date, Tralins maintained the firm's books and records, and prepared and filed its tax returns, as if it was a partnership.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Contrary to appellants' argument, how the parties held themselves out to the public is not without probative significance as to the parties' intent as between themselves. See Johnson v. Weinberg, 434 A.2d 404, 407 (D.C.1981) (claim that business conducted by husband and wife was implied partnership rejected in part by reference to manner in which they held themselves out to creditors and licensing and tax authorities).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Thus, while we reject appellants' argument that the proof regarding control and loss sharing established the absence of a partnership as a matter of law, it remains true, for example, that an agreement \"not to share losses weighs heavily against partnership because it is so inconsistent with the standard partnership form.\" A. BROMBERG \u0026 L. RIBSTEIN, (supra) , § 2.07 (d), at 2:67-68.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The non-movant \"may not merely rest on the allegations and denials of his pleadings, but his response, by affidavits or as otherwise provided in [Rule 56], must set forth specific facts showing that there is a genuine issue for trial.\" Super. Ct. Civ. R. 56 (e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. While it is not the trial court's task to make the non-movant's case, the court is under an affirmative duty to conduct an independent review of the record to determine whether a disputed issue of fact exists. See Spellman v. American Security Bank, 504 A.2d 1119, 1122 (D.C.1986); Hunt v. Dental Capital Corp., 503 A.2d 205, 206 (D.C.1985) (unopposed motion). We do not expect the trial court to ferret out disputed facts from a voluminous record without the assistance of counsel. Cloverleaf Standard Owners Ass'n v. National Bank of Washington, 512 A.2d 299, 300 (D.C. 1986). It must, nevertheless, review the record within the framework of the issues identified by the parties to determine whether material facts are in dispute. Vessels v. District of Columbia, supra, 531 A.2d at 1019. In Vessels, we acknowledged that this court may reverse when the trial court \"should have reasonably recognized, in light of all the other claims, moving papers, and record references, that the non-movant did in some way dispute pertinent issue.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Sworn affidavits may be accorded as much weight as any other form of record evidence in opposing a summary judgment motion, provided they clearly allege specific facts admissible in evidence at trial. See Thompson v. Seton Inv., supra, 533 A.2d at 1256-57 (sworn allegations in verified complaint sufficient to create genuine issues of material fact). Allegations of fact in deposition testimony may also suffice to create material issues of fact. See, e.g., Robinson v. Evans, 554 A.2d 332, 337 (D.C.1989) (deposition testimony sufficient to raise issue as to continuing existence of marriage, precluding summary judgment in favor of movant who asserted no impediment to later common law marriage).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Regarding the firm's fiscal affairs, Beckman testified that he alone exercised final authority to decide to borrow money when the firm needed operating capital, and that he unilaterally decided not to allow Farmer to continue to treat his automobile lease payments as a firm expense. As to Farmer's claim that Beckman made management decisions in consultation with Farmer and Kirstein, Beckman conceded that most such decisions were made in this manner, but cited his depositions in which he testified that, notwithstanding this \"collegiality\", ultimate decisionmaking authority was vested in him alone, a proposition for which there was some support in the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In his supplemental citations responding to those submitted by Farmer, Beckman points to deposition testimony where he conceded that Farmer, as signatory on behalf of the \"partnership\", would \"technically\" have been liable on certain promissory notes but that, as a practical matter, Farmer bore no risk of loss because the notes were fully secured by Beckman's personal certificates of deposit. This very type of \"point/counterpoint\" exchange between Farmer and Beckman indicates that the record supports opposing inferences on a material issue of fact.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In addition, Beckman testified in deposition that an earlier draft agreement, which Beckman conceded would have created a partnership if executed, provided that losses would be borne 90% Beckman, 10% Farmer. Beckman alleged that this agreement was never entered because of Farmer's desire to avoid any liability for firm debts and losses. Beckman testified that he and Farmer accordingly entered into an alternate agreement, which was not a partnership, in which Beckman agreed to assume all risks of operating losses and liabilities. The final written agreement between Beckman and Farmer provided: \"Beckman has agreed to provide financing as required. Beckman will be reimbursed for expenses as agreed.\" These documents and testimony, and inferences from them, if taken in a light most favorable to Beckman, support his contention that he and Farmer had agreed that Farmer would bear no share of firm losses or liabilities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Although we recognize the hypothetical possibility that these challenges -- and, indeed, all of appellants' remaining claims -- will become moot if a jury finds that no partnership existed, we elect to consider them at this time in the interest of limiting as much as possible the issues remaining to be resolved. Moreover, as will become apparent, we conclude that the issues already tried to a jury must be retried as well, and the interest of judicial economy dictates that they be retried in a single proceeding along with the issue of partnership vel non.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe sympathize with our Concurring colleague's desire to avoid \"functional dicta,\" but we do not feel at liberty to set the trial court and parties on the course of retrial without resolving issues preserved for our review that may affect the trial, including, e.g., the basic question whether there exists a cause of action for breach of fiduciary duty for failure to wind up and render an account. See pages 64-73, infra. Moreover we think the parties are entitled to know the legal consequences -- in respect of partnership law -- of the factual issues the jury will be called upon to decide in the retrial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A backlog in the office of the Auditor-Master of the Superior Court would have delayed the accounting by months.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. With regard to the firm's tangible assets, including the library and leasehold, the Judge adopted the master's valuations and acknowledged that Farmer's share would be $11,354, but instructed the jury that Farmer would receive that amount only if it found that he was entitled to a one-third share of those assets.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. While this may be true in the ordinary sense, D.C. Code § 41-130 (1) ascribes a technical meaning to \"expulsion\" inapplicable in this case. Dissolution occurs without violation of the partnership agreement \"y the expulsion of any partner from the business bona fide in accordance with such a power conferred by the agreement between the partners.\" Id. § 41-130 (1)(D). If a partner is rightfully expelled in this manner, and is discharged from all partnership liabilities by payment or agreement with the other partners who are continuing the business, he receives, \"in cash, only the net amount due him from the partnership.\" Id. § 41-137 (a). He does not, however, have the power to compel a winding up and liquidation. Id. Because Farmer was not expelled in accordance with a power reserved to other partners in the partnership agreement, this section of the statute is inapposite.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See also Weisbrod v. Ely, 767 P.2d 171, 174 (Wyo.1989); Oliker v. Gershunoff, 195 Cal.App.3d 1288, 1295-96, 241 Cal.Rptr. 415, 419 (Cal.App. 1987); Prange v. Prange, 755 S.W.2d 581, 589 (Mo.App. 1987); Turner v. Kaplan, 602 S.W.2d 460, 464 (Mo.App. 1980); Timmermann v. Timmermann, 272 Or. 613, , 538 P.2d 1254, 1261 (1975) (en banc); Cauble v. Handler, 503 S.W.2d 362, 365-66 (Tex.Civ.App.1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As of the date of dissolution, the Laker case clearly was unfinished business of Beckman, Farmer \u0026 Kirstein. The firm of Beckman \u0026 Farmer and Christopher Morris, the Laker liquidator, entered the contingent fee contract at issue in November 1982. The antitrust suit contemplated in the fee agreement was filed on November 22, 1982. While Farmer was \"screened\" from the case in early 1983, he attended to the firm's other clients, leaving Beckman and Kirstein free to concentrate their efforts on the Laker matter. Morris testified at trial that serious settlement negotiations began prior to dissolution. Finally, the waiver of claims for legal fees executed by Beckman and Kirstein, under which they received the disputed sum, acknowledged that the release was to cover both pre- and post-dissolution entities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Appellants argue that the Separation of Practice Agreement was unambiguous in showing that Farmer gave up his rights in future fees received in the Laker case, and hence the court erred in submitting the issue of waiver to the jury. As our following Discussion in text makes clear, however, the provisions of the agreement are reasonably susceptible of different constructions, and so the issue became one of fact for the jury. 1901 Wyoming Avenue Coop. Ass'n v. Lee, 345 A.2d 456, 561 \u0026 n.7 (D.C.1975). Accord, Morgan v. American Univ., 534 A.2d 323, 329 (D.C.1987). When interpretation of a contract depends on a choice between equally plausible inferences, the contract is ambiguous and its meaning is a question of fact for the jury. Jessamy Fort \u0026 Ogletree v. Lenkin, supra, 551 A.2d at 831.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Farmer noted that Beckman and Kirstein continued to do hourly work for Morris on the Laker counterclaim and for other clients, that they kept those fees, and that he was not claiming any share of them. He explained that in early July, the firm still had not sent out June billings, and that these were the subject of a great deal of controversy in negotiations concerning the separation of practices. This controversy was resolved with an agreement that all further work billable on an hourly basis was to be for the separate accounts of the partners, that Farmer would keep the June billings to Princess for the hourly work he performed, and that Beckman \u0026 Kirstein would keep Farmer's and their own other hourly billings for that month. He emphasized that the parties agreed the arrangement as to hourly fees was expressly not intended to prejudice or otherwise affect his claim to a share of the Laker fees and the Manson estate, and that a final winding up and accounting was yet to be completed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We reject the argument that, in being required to account to Farmer for post-dissolution profits, appellants were compelled to carry on the dissolved partnership's business, i.e. complete work on the Laker settlement, for Farmer's benefit. Appellants confuse completion of unfinished partnership business with \"carrying on\" of the partnership's business. As we have seen, completion of unfinished partnership business is a necessary part of the winding up process. See D.C. Code § 41-134 (a)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAppellants argue that the \"unfinished business\" cases discussed above should be narrowly limited to the equitable context in which they arose and that no rule of law can be extracted from them. We disagree. Two of the issues central to this case are whether a pending contingent fee case is an asset of a dissolved law partnership, and whether fees collected upon completion of such work after dissolution are subject to distribution to the former partners. Both were also squarely presented and answered in the affirmative in those cases. Those answers turned less on the particular facts of each case than on the legal status of a dissolved, but not liquidated, partnership and the fiduciary duties of partners inter se. The cases provide instructive authority in interpreting our own Partnership Act, and represent the majority rule. A. BROMBERG \u0026 L. RIBSTEIN, (supra) , § 7.08 (e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAppellants further contend that those cases should be distinguished because the partners involved in them had \"undisputed ownership\" or \"equity\" interests in the partnerships, and Farmer had no equity interest in the firm. However, the cases did not rely on the extent of the partners' \"equity\" in fixing their distributive shares of fees collected after dissolution, but, as in the instant case, adhered to the profit sharing formula agreed to by the parties. E.g., Jewel v. Boxer, supra, 156 Cal.App. 3d at , 203 Cal.Rptr. at 15 (\"attorneys fees received on cases in progress upon dissolution of a law partnership are to be shared by the former partners according to their right to fees in the former partnership\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Because partners are jointly and severally liable for partnership debts and obligations, D.C. Code § 41-114 (2), \"former partners entitled to reimbursement for reasonable overhead expenses attributable to the production of post-dissolution partnership income.\" Jewel, supra, 156 Cal.App. 3d at 180, 203 Cal. Rptr. at 19; accord, Ellerby, supra, 138 Ill.App. 3d at , 485 N.E.2d at 417. Here, the deduction of such expenses reduced the net amount of the Laker fee subject to distribution by $401,243.90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Beckman testified during his direct examination that the firm operated on a cash system of accounting. Farmer, during cross-examination, agreed that the fees were not counted as income until actually received, but qualified his response: \"for tax purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Donald v. Glazer, 194 So.2d 176 (La.Ct.App.), writ refused, 250 La. 467, 196 So. 2d 533 (1967), on remand, 208 So.2d 4 (La. Ct. App. 1968), rev'd, 253 La. 811, 220 So.2d 84 (1969). In reviewing the appeal after remand, the Louisiana Supreme Court discredited the Donald court's \"cash basis\" holding:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court of Appeal held, in effect, that when this personal service partnership operating on a cash basis was dissolved, with no special agreement governing liquidation, the withdrawing partners lost their interests in the uncollected accounts receivable owed to the partnership on the date of dissolution. In so holding, we think the Court of Appeal erred. 253 La. at , 220 So. 2d at 85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. For example, to arrive at the ultimate figures, the master was to, inter alia: \"calculate the partnership's intangible or financial assets and liabilities (such as accounts receivables, accounts payable, deposits in financial institutions, and loans outstanding) and the excess of assets over liabilities or vice versa as of May 31, 1984; . . . calculate the net profit or net loss plus the excess of financial assets over liabilities (or vice versa) as of May 31, 1984, (emphases added).\" To the number derived from these calculations, which took cognizance of accounts receivable, but not received, as of May 31, 1984, the master then applied the profit-sharing formula to determine the distributions to which the respective partners were entitled. The master was also to \"ascertain the amounts collected after May 31, 1984, if any, on 'past due' or 'noncurrent' accounts receivable which were unpaid but were not listed in the partnership's accounts receivable as of May 31, 1984; ascertain which of such collections relate to accounts receivable relating to the 'B\u0026F' [Beckman \u0026 Farmer] period, September 1, 1981 through December 31, 1982; calculate a one-half share of these 'B\u0026F' collections; ascertain which of such collections relate to the 'BF\u0026K' period January 1, 1983 through May 31, 1984; and calculate a forty percent share of these 'BF\u0026K' collections.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The parties insured that they did not waive the right to object to the \"basis in law or fact as to the calculations\" by including a catch-all provision in the order reserving their rights. See pages 27-28, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. While Judge Weisberg failed to find specifically that the manner in which profits were divided during the life of the partnership and the Separation of Practice Agreement did not mandate a cash basis for the post-dissolution accounting, this is no reason to reverse his adoption of the accounting methodology. The function of Super. Ct. Civ. R. 52 (a)'s \"specific findings\" requirement is to ensure the existence of an adequate record upon which an appellate court can determine whether the Judge committed clear error. See United States Fidelity \u0026 Guarantee Co. v. Kaftarian, 520 A.2d 297, 299-300 (D.C.1987) (case remanded because Judge's conclusory findings rendered it impossible for appeals court to determine whether findings were clearly erroneous). This court will not disturb the trial court's ultimate finding where the record as a whole reveals the finding's basis and the court's reasoning supporting it, even when the Judge has failed specifically to set forth subsidiary findings used to arrive at the ultimate fact. See Simpson v. Lee, 499 A.2d 889, 893 (D.C.1985) Wisconsin Avenue Assoc. v. 2720 Wisconsin Avenue Coop. Ass'n, 385 A.2d 20, 23 (D.C.1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe path of Judge Weisberg's reasoning in adopting the master's report can be discerned through an examination of the documents cited by Beckman in support of his argument, and from the Judge's express oral findings following extensive dialogue with counsel and witnesses made on the record. The record is therefore sufficiently complete to facilitate our review. See Wisconsin Ave. Assoc., supra, 385 A.2d at 23 (on-record colloquy between Judge and counsel may disclose basis of finding). Moreover, the \"specific finding\" requirement must be read together with Rule 52 (a)'s command that master's findings adopted by the court should he considered those of the court itself. When the master has properly performed his task, and the trial court adopts the findings, the \"court is not required to indicate in a lengthy opinion all its reasons for following the master's report.\" 5A J. MOORE \u0026 J. LUCAS, MOORE'S FEDERAL PRACTICE, 53.12 [3] (2d ed. 1989) (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The Judge apparently rethought his earlier position that the receipt and size of the fee were relevant on the issue of the parties' intent in executing the separation of practice agreement, and instructed the jury:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe fact that a large legal fee from the Laker anti-trust case was received by the firm in October of 1985, must not control or influence your decision in any way as to the issue of what the parties intended with respect to that fee. Where, as in this case, it is contended that a partner agreed to give up a share in any fees later received, it is the intention of the parties that controls.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The jury may award punitive damages only if it finds that the defendant's acts were malicious and in willful, wanton, or reckless disregard of the plaintiff's rights. Parker v. Stein, 557 A.2d 1319, 1322 (D.C.1989), quoting Franklin Inv. Co. v. Homburg, 252 A.2d 95, 98 (D.C.1969). Malice, or wrongful motive, is a state of mind which the jury may infer not only from circumstantial evidence, or acts of the defendant, but also from direct evidence, including the oral statements of the defendant. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The transcript reads.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMR. HELLER: Now, Mr. Beckman, you have testified, I believe, that Mr. Farmer, you and Mr. Kirstein agree that Mr. Farmer, in return for clients and other benefits, had agreed to give up an interest in the Laker fee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMR. BECKMAN: That's right, sir.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMR. HELLER: Why did you then offer him $200,000 of the Laker contingent fee at that time if and when a fee came in?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMR. BECKMAN: It's a price of peace.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Farmer's counsel argued:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWell, when they say $200,000 from the Laker anti-trust litigation, isn't it interesting that they're still talking about the Laker antitrust litigation? . . . Now, if on July 6th, Mr. Farmer had, as they're asking you to believe here today, given up his right to that fee, and you as a lawyer were writing this letter, what would you have said here? \"Well, as you know, Don, in the separation of practice agreement, you agreed to give that up. But I'll tell you what, we'll give you the first $200,000 of the first $2 million.\" Is that what they said here, careful lawyers responding in writing the first time they do? You draw your own Conclusion. Did Don Farmer give up the fee in the separation of practice? Have they proved it to you by a preponderance of the evidence?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The factual premise of this argument is doubtful. The letter stated, inter alia, that \"we believe you have no right, title or interests in any assets of your former practice,\" and that the offer to compromise was being made \"ntirely without prejudice to our position that you are entitled to nothing . . . .\" The fact that it did not also say explicitly that Farmer had contracted away his rights in the earlier agreement has the quality of a distinction without a difference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Bromberg and Ribstein concede that courts have recognized \"wrongful dissolution, exclusion of a partner from the partnership by diversion of the partnership assets from the partnership, or other such tortious activities\" as situations warranting an exception to the exclusivity rule, but they observe:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is not clear why these cases are excepted . . . . These are situations in which accounting is not only explicitly permitted under U.P.A. § 22 (a) and (c) [D.C. Code § 41-121 (1) (wrongful exclusion of partner from partnership business) and (3) (failure to account)] but is also particularly necessary, as in settlement of accounts after any dissolution. Perhaps the courts are giving maximum flexibility because of the wrongful conduct of the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. BROMBERG \u0026 L. RIBSTEIN, (supra) , § 6.08 (c), at 6:107 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. While the accounting fixed Farmer's distributive share, the Judge denied Farmer's motion for immediate entry of judgment on the accounting for pre-dissolution profits, because whether Farmer was entitled to receive any of the determined sums depended on the jury's resolution of issues concerning the effect of the Separation of Practice Agreement. Final judgment on the accounting and the legal claims was not entered until the Conclusion of the jury trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. In this context, the Rosenfeld court spoke of two distinct fiduciary duties: the duty to wind up and complete unfinished business, and the duty not to take any action with respect to unfinished business which leads purely to personal gain. Id. at 216-17, 194 Cal. Rptr. at 189-90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. English courts of equity began enforcing partners' fiduciary duties inter se around the fifteenth century when they began taking jurisdiction over partnership cases arising under the law merchant. See J. CRANE \u0026 A. BROMBERG, (supra) , § 2, at 11-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We reject Beckman's claim that the evidence in this case furnished no basis for an award of punitive damages. Further, we find no merit in his argument that the contractual source of partnership duties precludes punitive damages for breach of those duties. See Wagman v. Lee, 457 A.2d 401, 404 (D.C.), cert. denied, 464 U.S. 849, 104 S. Ct. 158, 78 L. Ed. 2d 145 (1983) (punitive damages will lie for fiduciary breach despite contractual underpinnings of duties). We also reject his arguments that the damages awarded were \"beyond all reason\" or so great as to \"shock the conscience\" of the court, Phillips v. District of Columbia, 458 A.2d 722, 724 (D.C. 1983), and that the court's instructions on punitive damages were inadequate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Fraud requires proof by clear and convincing evidence, and the Judge was unpersuaded that a reasonable juror could find by this measure that Farmer had relied on Beckman's or Kirstein's statements. With regard to conversion, the Judge expressed doubt as to whether a juror could find that Beckman or Kirstein converted Farmer's property, because individual ownership of the fees was unclear or unestablished at the time the fees came in. With regard to civil conspiracy, the Judge found insufficient evidence of any affirmative acts by Kirstein in furtherance of a conspiracy to defraud Farmer which would warrant imputing Beckman's acts and declarations to Kirstein. The underlying factual bases of these torts are very different than the facts constituting abuse of a fiduciary relationship.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. For example, Farmer testified that both Beckman and Kirstein misrepresented the firm's solvency in June or July 1984. He testified that Beckman also withheld information about the firm's finances to induce Farmer to waive his rights or agree to separate the practice. When financial reports were finally produced in mid-July, Farmer asserted, his own analysis (and later comparison with the special master's report) revealed the accounts payable figure to be inflated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurther, Farmer testified that, although Beckman and Kirstein both assured him that no assets would be \"grabbed\", Beckman secretly transferred the partnership bank accounts to new \"proprietorship\" accounts during the last week of June 1984. While no direct evidence showed that Kirstein knew about the transfer at the time Beckman initiated it, Farmer's theory at trial was that the jury could infer it from evidence showing that Kirstein was in close contact with Beckman while in Sweden, and that Kirstein received copies of confidential correspondence related to the transfer. In any event, it is undisputed that Kirstein was aware of the transfer by July 2, and that in September he executed signature cards excluding Farmer, thereby participating in acts necessary to perfect the transfer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eActions taken in connection with collection of the Laker fee settlement also evidence appellants' denial of Farmer's partnership rights. Farmer contends Kirstein falsely represented to the Judge presiding in the Laker antitrust suit that Beckman and Kirstein \"had every intention\" of working something out with Farmer to \"take care\" of his interest in the fee. The jury could fairly infer that Kirstein's representations were untrue, but made to prevent the Judge from depositing the settlement in the registry of the court pending the outcome of the dispute with Farmer, as Nussbaum suggested, rather than releasing it to Beckman and Kirstein. Nussbaum also testified that Beckman and Kirstein wanted to amend the draft release to delete references to Beckman, Farmer \u0026 Kirstein and its successor firm as a partnership to preserve their position that Farmer had no rights as a partner, and that Kirstein edited the release accordingly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The judgment entered against Kirstein did not include an amount attributable to Beckman \u0026 Farmer's pre-liquidation work for Laker performed before Kirstein joined the firm.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. While assuming arguendo that Kirstein was correct in his interpretation of partnership law with regard to Farmer's status as a creditor, the Judge in an order denying defendants' post-trial motions noted:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eit is at this point that the fiduciary violation intersects, at least as a matter of equity. The jury found that Kirstein himself acted wrongfully by breaching the fiduciary duty he owed to Farmer. Under the circumstances, it is not unfair to Kirstein to hold him in, and it would be entirely unfair to Farmer to let him out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. A court of equity may, of course, \"mould the decree to the necessities of the particular case,\" District of Columbia v. Keyes, 362 A.2d 729, 734 (D.C.1976), and \"administer such relief as the exigencies of the case demand after trial.\" Chapman v. Sheridan-Wyoming Coal Co., 338 U.S. 621, 630, 70 S. Ct. 392, 94 L. Ed. 393 (1950). We have no occasion, however, to decide whether the Judge's \"subordination\" remedy was a proper exercise of his equitable powers because Beckman does not challenge this aspect of the judgment on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Farmer testified to a number of specific conversations with Kirstein. In early July, Kirstein told Farmer that he would cooperate in a winding up, try to get Beckman to be reasonable and cooperate, and see that nothing unfair was done. Farmer testified that Kirstein's attitude changed sometime after the July 31 memo, when Farmer began to make demands for specific dollar amounts. Kirstein at that time said that he was not going to help, and in August, in response to Farmer's observation that Beckman and Kirstein were not dealing honorably, said that he \"just wasn't going to do anything about that.\" The tenor of Kirstein's testimony was that he acquiesced in Beckman's activities all along, because he felt that Backman alone had the authority to deal with Farmer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The trial Judge found insufficient evidence of affirmative wrongdoing by Kirstein in furtherance of Beckman's scheme to exclude Farmer from sharing in the Laker fee to warrant imputing Beckman's acts and declarations to Kirstein on a civil conspiracy theory, and directed a verdict in Kirstein's favor on the conspiracy count. We emphasize the distinction between this theory of vicarious liability and the independent breach of fiduciary duty that the type of failure to act discussed in the text constitutes. Judge Weisberg recognized the principle in directing a verdict in Kirstein's favor on punitive damages:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003emay not have affirmatively taken the steps that perhaps he should have in connection with his fiduciary duty to Mr. Farmer. . . for a juror could find that it was incumbent on him to withdraw from Mr. Beckman and join forces with Mr. Farmer; but to apologize for not doing so, or to treat Mr. Farmer with more courtesy, perhaps, is not the kind of conduct above and beyond the conduct that would support the claim for fiduciary breach that would even come close to supporting a claim for punitie damages against Mr. Kirstein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Kirstein's reliance on Moseley v. Moseley, 196 F.2d 663 (9th Cir. 1952), is similarly unpersuasive. Moseley involved a suit for an accounting based on an agreement between two brothers, Clarence and Lawrence, whereby Clarence held a 50% interest in Lawrence's one-half share of a partnership. Without a winding up or final accounting, Lawrence informed Clarence that the partnership's assets were being transferred to a corporation, which would carry on the dissolved partnership's business of selling soap and sanitation chemicals. Clarence sued Lawrence for an in-court accounting for profits earned by the corporation, and named as defendants three others who had interests in the newly formed corporation. The court of appeals held the corporate defendants secondarily liable for Clarence's partnership earnings \"to the extent that assets constituting a portion of [Clarence's] share may have come into their hands,\" in the event that Lawrence, whom it held principally liable for the judgment, was unable to satisfy it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court based this holding not on the successor corporate defendants' former or continuing fiduciary relationship with Clarence, but on the fact that they \"would be chargeable with notice such that they would take the property transferred to them subject to the claims of Clarence\" since one of them, Lawrence's former partner, \"had knowledge of the arrangement between Lawrence and Clarence Moseley.\" Quite unlike the instant case, there was no claim that any of the defendants except Lawrence had breached fiduciary duties toward Clarence. Moseley's \"constructive notice\" rationale offers little guidance on the issue of joint and several liability when both defendants are partners who have independently breached fiduciary duties toward the plaintiff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. In addition to the instructions issued before the jury retired, in the middle of the plaintiff's case in chief the Judge advised the jury that he had made certain findings of fact in the accounting that were \"settled and must be accepted by you in your deliberations.\" The Judge went on to emphasize:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThese findings were made for the purpose of simplifying some of the complex financial issues in this case. They should not influence you in any way in deciding the issues that are before you in this case. . . . Liability in this case is whether Mr. Beckman or Mr. Kirstein, or either of them owes Mr. Farmer anything. Damages in the context of this case is if they owe him something, what do they owe him. On the second question, you will be able to use these findings I have made in deciding what if anything you feel Mr. Farmer is owed as a result of what you find the defendants' obligations to be. But they should not in any way determine whether or not anything is owed to Mr. Farmer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile at this point in the trial the Judge appeared to be ready to submit the issue of tort damages to the jury instead of instructing it, as he ultimately did, that these damages were coextensive with the amount found due in the accounting, it is clear that he took pains consistently to assure that the amount found due Farmer in the accounting did not influence the jury's determination of the liability issues before it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Cf. Code of Professional Responsibility Disciplinary Rule (DR) 2-102(C): \"A lawyer shall not hold himself out as having a partnership with one or more other lawyers or professional corporations unless they are in fact partners.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 In its order granting summary judgment, the trial court indicated that \"both parties argued vigorously (and ably) that no actual facts which were material were in dispute, but rather that the disagreement between the parties centered on the legal Conclusions to be drawn from facts which were already well established in the record.\" The trial court went on to note: \"Having argued vigorously for a decision on the basis of the [cross-motions for summary judgment], it is assumed that the losing party has waived any further arguments (either to this Court or the Court of Appeals) that existing disputes over material facts preclude Disposition via summary judgment.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Of course, the issue whether a partnership existed inter se is not a Conclusion in itself but simply a pigeon-holing means of determining an applicable legal principle governing Farmer's interest in the firm's profits. However, even if in fact no true partnership existed, it is not immediately obvious to me that Farmer may not have some rights under an analogous theory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 It appears that most, if not all, of such issues could be resolved on a subsequent appeal without the need of any further retrial.\u003c/span\u003e\n\n",
    "body_length": 164805,
    "citedas": [
      "579 A.2d 618"
    ],
    "attorneys": "Jacob A. Stein, with whom Wiley A. Branton was on the brief, for appellant Robert M. Beckman. Milton Heller for appellant David M. Kirstein. John E. Heintz, with whom Stephanie E. Humbert was on the brief, for appellee Donald A. Farmer.",
    "category": [
      "124",
      "252",
      "213"
    ],
    "judges": "Rogers, Chief Judge, and Steadman and Farrell, Associate Judges. Opinion for the court by Associate Judge Farrell. Concurring opinion by Associate Judge Steadman, at p. 87.",
    "citation_count": 50
  }
}
