{
  "id": "KLVcTWYBTlTomsSBzbxp",
  "document": {
    "title": "08/27/85 STATE MISSOURI v. ROBERT J. GARRETTE",
    "full_title": "STATE OF MISSOURI v. ROBERT J. GARRETTE .",
    "jurisdiction": "Missouri Court of Appeals",
    "date": "1985-08-27T00:00:00.000Z",
    "docket": "No. 13617",
    "body": "Robert J. Garrette (\"defendant\"), tried as a persistent offender, §§ 558.016, 558.021, Laws 1981, pp. 636-37, was found guilty by a jury of five counts of fraud in the sale of a security, in violation of § 409.101, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and one count of offering an unregistered security for sale, in violation of § 409.301. The trial court sentenced defendant to 5 years' imprisonment on each count and ordered all sentences to run concurrently. Defendant appeals, briefing 28 assignments of error.\n\nThe issues we must decide are easier stated after a synopsis of the case.\n\nAll charges against defendant were based on conduct allegedly engaged in by him in connection with an enterprise in Wayne County, Missouri, in which Buffs Minks, Inc., and sundry allied companies raised and sold fur-bearing animals. The concept of the operation is illustrated by an advertisement that appeared in a newspaper circulated in Palos Park, Illinois (a Chicago suburb), in February, 1974.\n\nThe advertisement outlined five different investment plans, each of which called for a down payment followed by monthly installments over a specified number of years. \"Plan 4,\" a representative example, carried a total cost of $2,800, payable by a down payment of $400 and monthly installments of either $100 for 24 months or $50 for 48 months.\n\nThe funds were to be used to purchase five minks -- four females and one male -- and to pay for their feed and care.\n\nDuring the first year, the minks were expected to produce, in the aggregate, 16 offspring (\"kits\"). Four females would be kept from the offspring and the remaining offspring would be sold, the proceeds going into the investor's account to provide feed and care for the herd in the upcoming year, during which the herd would have, of course, the four original females and the four new females.\n\nDuring this second year, the minks were expected to produce 32 kits, with 8 females to be retained from this new generation and the remaining offspring sold. The proceeds would again go into the investor's account to provide feed and care. At this point, the herd would have 16 females.\n\nBy the tenth year, following the same procedure and assuming the annual reproduction remained constant, the herd would contain 2,048 females which would, in that year, produce 8,192 kits. At the end of the tenth year, all kits would be sold, but the basic herd would remain intact. Proceeds from the sale of the kits (projected at $185,958.40) would be disbursed by paying the investor $23,600 and placing the remainder in his account for feed and care of the herd. Each year thereafter the investor would receive $23,600 as long as he left his basic herd intact.\n\nThe name \"Breeders United Fur Farm \u0026 Services\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e appears at the foot of the advertisement, followed by this: \"for more information Call Collect Mr. Garrette.\" A telephone number was supplied.\n\nThe advertisement lists the following features:\n\n\"NO SELLING: Our marketing secures the sales of all your animals and or pelts with a minimum average to you, by contract agreement.\n\n\"NO LABOR: We do all the work involved in raising your mink for you. On the job training for those who wish to learn how to raise mink.\n\n\"COVERED BY INSURANCE: All mink are covered by insurance to avoid any loss of your mink herd.\n\n\"SECURED INVESTMENT: Your money secured by Inventory of mink.\"\n\nAlthough the record does not indicate when or where the investment plans were first offered for sale, the Securities Commissioner of Indiana, on April 30, 1974, entered an order styled, \"In the Matter of: R. J. Garrette and Breeders United Fur Farm and Services.\" The order recited, among other things, that the Commissioner had reason to believe that the \"named persons\" may be offering or may be about to offer to residents of Indiana, securities in the form of investment contracts, that said securities were not registered for sale in Indiana, that none of the named persons were registered as broker/dealers with the Indiana Securities Division, that none of the named persons were registered as agents with the Indiana Securities Division, and that \"the respondent has made untrue statements of a material fact or has omitted to state a material fact necessary in order to make the statements made in the light of circumstances under which they were made, not misleading.\"\n\nThe order prohibited defendant and Breeders United Fur Farm and Services, their officers, agents and employees from selling, causing to be sold, offering, or causing to be offered for sale, any such securities in Indiana.\n\nThe Indiana order did not stymie the enlistment of investors, however, as illustrated by the testimony of Gail Turner.\n\nMs. Turner explained that she became acquainted with defendant and his wife, Bonnie, in 1975, and was hired by Bonnie in September or October of that year for [\"typing] and answering the phone\" at a mink farm at Clubb, Missouri. Appearing on a printed letterhead used by the business was this:\n\n\"Breeders United Fur Farms \u0026 Services\n\nHighway 34\n\nClubb, Missouri 63934\n\nPhone: (314) 495 2312\".\n\nDuring Ms. Turner's tenure at the farm, her duties increased. She began keeping records, working on publications issued by the business, and handling payments received from \"associates.\" She explained that an \"associate\" was a person who bought a \"mink plan\" in one of \"the different corporations.\" A journal was maintained for each corporation and an entry was made reflecting the date, amount and payor of each check received. A file was opened for each newly recruited associate.\n\nAssociates were kept informed about activities on the farm by newsletters. A newsletter headed \"Breeders United Fur Farms \u0026 Services\" and dated November, 1975, carried a picture of defendant, identifying him as \"General Manager.\" Describing defendant's role in the operation, the newsletter stated:\n\n\"He controls the finances on all the corporations. He is President of Buffs Minks, Inc. Buffs Minks, Inc. handles the caring for all the mink belonging to all the corporations. The other corporations pay Buffs Minks, Inc. for all these services. Mr. \u0026 Mrs. R.J. Garrette own about 90 percent of Buffs Minks, Inc.\"\n\nMs. Turner testified that defendant continued to perform such duties in ensuing years, up through most of 1979. By then, investors were not confined to investing only in mink plans; fox plans were also available.\n\nOn February 6, 1980, Buffs Minks, Inc., filed a voluntary petition \"for relief under Chapter 11 of the Bankruptcy Code\" in the United States Bankruptcy Court, Eastern District of Missouri. A schedule accompanying the petition revealed that bank accounts had been maintained in the names of numerous companies including the following 14: Elgin Mink Breekers, Inc.; Brookfield Mink Breeders, Inc.; South Elgin Mink Breeders, Inc.; Blue Island Mink Breeders, Inc.; Oak Lawn Mink Breeders, Inc.; Park Forest Mink Breeders, Inc.; Earl Park Mink Breeders, Inc.; Bartlett Mink Breeders, Inc.; Orland Park Mink Breeders, Inc.; Lakeland Mink Breeders, Inc.; Silver Lake Fox Farms, Inc.; Bridgeview Fox Farms, Inc.; Black Oak Fox Farms, Inc.; and Highland Mink Breeders, Inc. The accounts were in banks in Piedmont, Fredericktown, Greenville, Marble Hill, Lutesville and Poplar Bluff.\n\nRecords in the office of the Commissioner of Securities of Missouri show that neither Breeders United Fur Farms \u0026 Services nor any of the 14 companies listed above were ever registered in Missouri to sell securities. Records in the office of the Secretary of State of Missouri show that the following companies were never registered as foreign or domestic corporations or under the \"Fictitious Name Act\" \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e: Bartlett Mink Breeders, Inc.; Black Oak Fox Farms, Inc.; Bridgeview Fox Farms, Inc.; Highalnd Mink Breeders, Inc.; Lakeland Mink Breeders, Inc.; Orland Park Mink Breeders, Inc.; and Silver Lake Fox Farms, Inc.\n\nThe original information was filed against defendant December 14, 1981, in the Circuit Court of Wayne County. It contained counts numbered I through IX. It was superseded by an amended information filed August 29, 1983. The first seven counts of the amended information charged the same offenses, respectively, as the first seven counts of the original information. Count VIII of the original information was not carried forward in the amended information. Count IX of the original information was carried forward, with minor changes, as Count VII in the amended information.\n\nDuring the instruction conference, which was conducted after completion of the evidence, the State announced it was entering a \"nolle pros\" as to Count IV of the amended information. The trial court thereupon announced that for the purpose of instructing the jury, Count V of the amended information would be designated Count IV. The State also announced it was entering a \"nolle pros\" as to Count VI of the amended information. Consequently, the trial court designated Count VII of the amended information as Count V for instruction purposes. This resulted in Count VIII of the amended information being submitted to the jury as Count VI in the instructions.\n\nWhat has just been explained is charted thusly:\n\nCount Number in Count Number in Count Number\n\nOriginal Information Amended Information for Instructions\n\nI I I\n\nII II II\n\nIII III III\n\nIV IV\n\nV V IV\n\nVI VI\n\nVII VII V\n\nVIII\n\nIX VIII VI\n\nDefendant was found guilty of all six counts submitted to the jury. The first five of those charged defendant with fraud in the sale of a security, in violation of § 409.101. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e All fraudulent conduct was alleged to have occurred in Wayne County.\n\nCount I of the amended information alleged, in substance, that defendant, on or about April 2, 1979, sold a security -- a fox contract -- to Alice Sweeney, and in doing so willfully employed a device, scheme and artifice to defraud her, and willfully made untrue statements of material facts and willfully omitted to state material facts necessary in order to make his statements not misleading, and willfully engaged in an act, practice and course of business which operated as a fraud upon Alice Sweeney, by (1) misrepresenting that the fox herd subject to the security in which she had invested would numerically double each year and produce a guaranteed rate of return on her investment when, in fact, the herd was not doubling each year, (2) failing to disclose that he was using previous investment funds for his own personal use and for payments of principal and interest to earlier investors, (3) failing to disclose that the foxes subject to the security were covered by a mortgage, and (4) providing Alice Sweeney with stock certificates showing that animals subject to her previous security purchases were numerically doubling each year when in fact they were not and a sufficient number of animals did not exist to satisfy ownership rights reflected in all investors' stock certificates.\n\nCount II of the amended information alleged, in substance, that defendant, on or about October 10, 1979, sold a security -a promissory note -- to Alice Sweeney. Defendant's alleged fraudulent conduct in connection with this sale was the same as the conduct described in allegation \"(2)\" of Count I.\n\nCount III of the amended information alleged, in substance, that defendant, on or about August 1, 1979, sold a security -- a fox contract -- to Pearl Thiel. Defendant's alleged fraudulent conduct in connection with this sale was the same as the conduct described in allegations \"(1),\" \"(2)\" and \"(3)\" of Count I.\n\nCount V of the amended information (submitted as Count IV in the instructions) alleged, in substance, that defendant, on or about April 27, 1979, sold a security -- a fox contract -- to James Kirby. Defendant's alleged fraudulent conduct in connection with this sale was the same as the conduct described in allegations \"(1),\" \"(2),\" \"(3)\" and \"(4)\" of Count I.\n\nCount VII of the amended information (submitted as Count V in the instructions) alleged, in substance, that defendant, on or about April 28, 1979, sold a security -- a fox contract -- to Gerald Bonnevier. Defendant's alleged fraudulent conduct in connection with this sale was the same as the conduct described in allegations \"(1),\" \"(2)\" and \"(3)\" of Count I.\n\nCount VIII of the amended information (submitted as Count VI in the instructions) alleged, in substance, that defendant, in violation of § 409.301, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e did, on or about October 8, 1979, offer to sell securities to Pearl Thiel, James Kirby and Gerald Bonnevier, said securities being shares of common stock in \"Breeders United Fur Farms,\" when said securities were not registered with the Commissioner of Securities of Missouri.\n\nThe two counts of the amended information which were not submitted to the jury (Counts IV and VI) charged defendant with selling unregistered securities, i.e., investment contracts, in violation of § 409.301.\n\nIn his first assignment of error, defendant maintains that §§ 409.101 \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and 409.301 \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e are unconstitutional in that \"they are not sufficiently explicit in their descriptions of the acts, conduct or conditions required or forbidden, to describe the elements of the offense with reasonable certainty, to fix an ascertainable standard of guilt, and to make known to those to whom they are addressed what conduct on their part will render them liable for their penalty, and not be so vague that men of common intelligence must necessarily guess at their meaning and differ as to their application.\" Defendant makes the same attack on § 409.410(a), \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the section which establishes the range of punishment for violations of §§ 409.101 and 409.301.\n\nIn his second assignment of error, defendant maintains that § 409.301 is unconstitutional in that it places the burden of proof on one who offers to sell an unregistered security to show that the security is \"exempt\" under § 409.402. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn his third assignment of error, defendant contends the trial court was without jurisdiction over Count VIII of the amended information because Count VIII \"did not allege the non-exempt status\" of defendant. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Furthermore, says defendant, the State failed to make a prima facie case under Count VIII in that the State failed to prove defendant \"was not exempt under Section 409.402.\" Defendant complains that the trial court \"placed the burden of proof of non-exemption under Section 409.402\" on him.\n\nIn the argument that follows his third assignment of error, defendant asserts that by requiring him \"to prove he is exempt under Section 409.402 RSMo. 1978 from punishment under Section 409.301 RSMo. 1978, the burden of proof is unconstitutionally shifted from the State to Appellant.\" This latter contention requires us to take note of § 409.402(f), which states:\n\n\"In any proceeding under this act, the burden of proving an exemption or an exception from a definition is upon the person claiming it.\"\n\nObviously, if an appellate court were to agree with defendant's argument that the trial court unconstitutionally shifted to him the burden of proving that the securities he allegedly offered for sale, as outlined in Count VIII of the amended information, were exempted from registration, the appellate court would necessarily have to declare § 409.402(f) unconstitutional.\n\nIn his eighteenth assignment of error, defendant insists that § 494.060, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e under which the county sheriff -- at the direction of the trial court -- summoned extra veniremen after several original veniremen had been removed by challenges for cause, is unconstitutional in that it violates an accused's right to an impartial jury under Mo. Const. art. I, § 18(a).\n\nHaving noted the constitutional attacks on the various statutes in defendant's first, second, third and eighteenth assignments of error, we must determine whether any have been preserved for appellate review because, if so, jurisdiction of this appeal lies in the Supreme Court of Missouri under Mo. Const. art. V, § 3. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e However, if none have been preserved, transfer to that court is not required. State v. Perkins, 680 S.W.2d 331, 334-35 (Mo. App. 1984); State v. Tygart, 673 S.W.2d 83, 87 (Mo. App. 1984).\n\nTo preserve a constitutional question for appellate review, the question must be raised at the earliest opportunity consistent with good pleading and orderly procedure, the sections of the constitution claimed to have been violated must be specified, the point must be presented in the motion for a new trial, if any, and the point must be adequately covered in the briefs. State v. Brookshire, 325 S.W.2d 497, 500 (Mo. 1959); Ingle v. City of Fulton, 260 S.W.2d 666, 667[1] (Mo. 1953); State ex rel. Barnett v. Sappington, 260 S.W.2d 669, 671[6] (Mo. 1953).\n\nRegarding defendant's first and second assignments of error, the record before us contains a written motion to dismiss that was directed toward the original nine-count information. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe first paragraph of the motion states that all nine counts should be dismissed because \"Sections 409.101 et seq are unconstitutionally void for vagueness for the reason that they do not give persons of ordinary sensibilities the opportunity to know what conduct is prohibited.\" Nowhere is that a hint whether defendant was relying on the Constitution of the United States or the Constitution of the State of Missouri, nor is there any specification of the constitutional provisions which the statutes allegedly violate.\n\nThe fourth paragraph of the motion asserts that § 409.301 \"is unconstitutional in that it places the burden on the defendant to prove that he is exempt under other sections of the statute.\" Again, there is no citation of any provision of the Constitution of the United States or the Constitution of the State of Missouri.\n\nWe find no ruling on the motion to dismiss prior to trial. The docket sheet does, however, show the following on the day before trial: \"Motions were presented to the Court, and the Court made rulings on some Motions and carried the rulings on other Motions with the cause.\"\n\nAt the Conclusion of the State's evidence, defendant's attorney moved for a judgment of acquittal. The trial court denied the motion. Defendant's attorney then asked the court to \"rule on my Motion which I believe is pending in front of this Court on the exemption.\" The trial court noted defendant's motion to dismiss and observed that the fourth paragraph sought dismissal of Counts IV, VI and IX of the original information for the reason that § 409.301 \"is unconstitutional in that it places the burden on the defendant to prove that he is exempt under other sections of statute.\" At that point, defendant's attorney apparently argued the issue to the trial court, but there is no record of what was said. Consequently, there is no showing which, if any, constitutional provision defendant's attorney cited to the trial court. Moreover, defendant's attorney, at that juncture, made no mention in the record of the first paragraph in the motion to dismiss, the paragraph that challenged the constitutionality of § 409.101 \"et seq.\"\n\nThe trial court denied the motion to dismiss.\n\nIn paragraph 1 of his motion for new trial, defendant challenges the constitutionality of §§ 409.101, 409.301 and 409.410, but again fails to specify any constitutional provision which those section allegedly offend. In paragraph 2 of his motion for new trial, defendant repeats his challenge of the constitutionality of § 409.301, but likewise fails to specify any constitutional provision which that section allegedly violates.\n\nInasmuch as there is no record that defendant ever informed the trial court of any constitutional provision on which he based his attacks on §§ 409.101, 409.301 and 409.410(a), we hold that defendant's first two assignments of error have not been preserved for appellate review.\n\nAs to defendant's third assignment of error, in connection with which he argues that the trial court unconstitutionally placed on him the burden or proving that the securities referred to in Count VIII of the amended information were exempt from registration, we have already pointed out that § 409.402(f) provides that in any proceeding under the Missouri Uniform Securities Act, the burden of proving an exemption is upon the person claiming it. We have, consequently, searched the record to see whether the constitutionality of § 409.402(f) was ever called into question before the trial court. We find nothing except the first paragraph of the motion to dismiss, which paragraph challenged the constitutionality of \"Sections 409.101 et seq.\" We find no mention of § 409.402(f), nor do we find any reference to a constitutional provision which said section allegedly violates. Moreover, even if we assume that the reference to \"Sections 409.101 et seq\" includes § 409.402(f), the constitutional attack which the first paragraph of the motion to dismiss sought to make was that the statutes toward which it was directed were void for vagueness. Nothing in that paragraph complained about placing the burden of proving an exemption on the person claiming it.\n\nWith the record in this posture, we hold that no issue as to the constitutionality of § 409.402(f) has been preserved for appellate review.\n\nAs to defendant's eighteenth assignment of error -- the constitutional attack on § 494.060 -- the record shows that after voir dire, the trial court granted challenges for cause against certain veniremen, as a result of which the panel of potential jurors was reduced to 21. Defendant, as was his right, insisted on \"my full amount of challenges, peremptory challenges.\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The trial court thereupon called the sheriff to the courtroom and issued this directive: \"Sheriff, you are instructed to bring into this Court twelve special veniremen from the various townships of this county and advise the Court when you have summoned them and they are present in the Court.\"\n\nSome two and a half hours later, 13 persons, none of whom were members of the original venire, appeared and were sworn as veniremen. The State and defendant conducted voir dire examination of the 13, following which a jury was selected that included 3 members from the 13. Defendant voiced no objection while these events unfolded, and the trial proceeded to the end of that day and throughout the 2 days that followed.\n\nAt the end of the third day, defendant's attorney stated that there may have been \"irregularities\" in the summoning of the \"bystander jurors,\" and requested a hearing on the matter. No complaint was made that § 494.060 was unconstitutional.\n\nA hearing was held the following day. At the outset, defense counsel stated:\n\n\"At this time I would ask that there be a mistrial called of the case because of the irregularity of the selection of bystander jurors, that this selection of bystander jurors pursuant to the statute in this case is a violation of the fundamental fairness rights afforded my client by the constitution and that the statute authorizing the Sheriff to go forth and select members to be on a jury panel would be violating the constitutional right of a fair and impartial jury for the reason that he would personally be able to have input into the selection of the panel members who appeared here at the beginning of this trial. Therefore I would move that a mistrial be called and my client be allowed to be tried with a panel of jury members that have been selected pursuant to the regular selection process outlined in the Missouri revised statutes.\"\n\nThis was the first mention of any alleged constitutional infirmity in § 494.060.\n\nDefendant and his attorney had been present, of course, when the trial court directed the sheriff to summon the additional veniremen. That was the earliest opportunity to challenge § 494.060 on constitutional grounds. As we have observed, however, defendant made no objection at that time, or even when the additional veniremen appeared in court. Instead, defendant conducted voir dire examination of the additional veniremen, following which a jury containing three of them was selected and sworn. Trial then proceeded through that day and the next two before defendant registered his first protest.\n\nAn objection or challenge to the array of petit jurors must be made before the jury is sworn, where the grounds of the objection are known. State v. Robinson, 484 S.W.2d 186, 188[4] (Mo. 1972); State v. Smith, 240 S.W.2d 671, 675[10] (Mo. 1951). In the instant case, the basis of a constitutional objection to § 494.060 obviously became known the moment the trial court gave the sheriff the order to summon the extra veniremen.\n\nWe hold that defendant waited too long to challenge § 494.060 on constitutional grounds. In so ruling, we do not, at this point, reject defendant's other complaints about the summoning of the additional veniremen. Those complaints raise issues apart from the constitutionality of § 494.060. All we hold at this point is that defendant failed to preserve any issue as to the constitutionality of § 494.060.\n\nHaving concluded that defendant failed to preserve for appellate review any of the constitutional attacks he seeks to make on the various statutes heretofore mentioned, we hold that jurisdiction of this appeal lies in this court and not in the Supreme Court of Missouri.\n\nThe next item we consider is defendant's fourth assignment of error, which asserts the trial court erred in failing to dismiss the amended information in that it was not signed by the Prosecuting Attorney of Wayne County. Defendant maintains that Rule 23.01(a), Missouri Rules of Criminal Procedure (14th ed. 1983) makes no provision for anyone other than the prosecuting attorney to sign informations. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe amended information was signed: \"John Ashcroft, Attorney General, State of Missouri, By: Henry T. Herschel . . . Assistant Attorney General.\"\n\nSection 409.410(b) provides, in pertinent part:\n\n\"The commissioner [of securities] may refer such evidence as is available concerning violations of this act . . . to the attorney general . . . who may, with or without such a reference, institute the appropriate criminal proceedings under this act.\"\n\nRule 19.05, Missouri Rules of Criminal Procedure (14th ed. 1983) provides, in pertinent part:\n\n\"As used in Rules 19 to 36, inclusive, the term . . . 'prosecuting attorney' includes . . . the Attorney General of the State of Missouri, and . . . assistant attorneys general where, by law, they are authorized and permitted to act.\"\n\nDefendant concedes that Mr. Herschel was an assistant attorney general when he signed the information for the Attorney General. See § 27.020.1. In view of § 409.410(b) and Rule 19.05, defendant's fourth assignment of error is without merit.\n\nBefore addressing any further points, it is necessary to take note of more of the evidence.\n\nJames Kirby of Palos Park, Illinois, (toward whom defendant allegedly directed the fraudulent conduct described in Count V of the amended information and to whom defendant allegedly offered to sell unregistered securities as charged in Count VIII of the amended information) testified that he (Kirby) telephoned defendant in 1974 after seeing the newspaper advertisement referred to earlier in this opinion. Defendant, according to Kirby, came to Kirby's home and explained the investment program in detail. Kirby purchased a $3,800 mink plan designed to provide him an annual income of $29,500 at the end of 10 years.\n\nKirby recalled visiting the mink farm at Clubb around 1975 and, at some unspecified point in time, bought two more mink plans. Kirby identified three \"stock certificates\" dated January 1, 1979, issued to him by Park Forest Mink Breeders, Inc., of Clubb, Missouri. The documents bore the signature \"R. J. Garrette\" and certified that Kirby owned 200 minks (160 female, 40 male) under one plan, 640 minks (512 female, 128 male) under another plan, and 640 minks (512 female, 128 male) under a third plan. Kirby testified he received similar certificates \"from time to time\" on each contract he owned.\n\nKirby explained that in 1979 he purchased a fox plan in Bridgeview Fox Farms, Inc. He described that company as \"the fox division of Buffs.\" This plan was offered to Kirby by defendant, initially by letter and thereafter at a meeting \"in the Chicago area.\" The terms of the fox plan, said Kirby, were the same as those in the newspaper advertisement except that he was to begin with 6 females and 2 males and the plan was to mature in 5 years, at which time there would be 1,536 females and 32 males. Kirby paid $2,075 down, to be followed by monthly installments of $125 until the total purchase price, $7,200, was paid. After 5 years, the \"guaranteed\" income was to be $42,000 per year.\n\nKirby remembered defendant's explaining that he (Kirby) would not receive a written contract evidencing the fox plan until there were 25 people \"in the corporation.\"\n\nKirby made, in all, three visits to the farm at Clubb, the last visit being in October, 1979. The purpose of that visit, according to Kirby, was to look the farm over with the possibility of making a $10,000 loan to defendant. Kirby quoted defendant as saying that \"the investment was secure\" and \"the time table was on schedule.\"\n\nKirby saw \"many mink\" in cages at the farm and asked defendant about the number. Kirby quoted defendant as replying that \"what we don't have here we have on our other farm, we have fox and mink at our other location.\" Kirby understood that the latter facility was \"east of the Clubb mink farm somewhere.\"\n\nAsked whether he knew that the animals were \"mortgaged\" to the Bank of Piedmont, Kirby replied, \"I did not.\" He gave the same answer when asked whether he had ever authorized defendant to mortgage his (Kirby's) animals.\n\nAccording to Kirby, defendant never disclosed that the herd was not doubling or that he (defendant) was using \"previous\" investors' funds to pay off \"present\" investors.\n\nKirby identified a letter he received from \"Breeders United Fur Farms,\" Clubb, Missouri, dated October 8, 1979. It was a form letter and is set out verbatim (infra) in connection with the testimony of Gerald Bonnevier.\n\nAlice Sweeney of Oak Lawn, Illinois (toward whom defendant allegedly directed the fraudulent conduct described in Counts I and II of the amended information) identified a document captioned \"Sales and Guarantee Agreements\" dated February 1, 1973. The document names \"Breeders United Fur Farms \u0026 Services and/or B.U.F.F.S.\" of Clubb, Missouri, as the party of the first part, and Alice Sweeney and Fred Sweeney (Alice's son) as the parties of the second part.\n\nThe document calls for the sale of 20 minks (16 female, 4 male) by the party of the first part to the parties of the second part for a price of $2,800, payable $1,100 down and $50 per month for 34 months. The party of the first part guarantees, among other things, to replace any breeder minks that die at no cost to the parties of the second part, to double the breeder herd each year for 10 years, and to sell each \"excess\" animal each year for a minimum of $30. Commencing on January 1 of the eleventh year of the agreement, the party of the first part agrees to pay the parties of the second part a guaranteed annual income of $72,000.\n\nThe document is signed \"R. J. Garrette\" on behalf of \"Breeders United Fur Farms \u0026 Services.\"\n\nMrs. Sweeney subsequently invested in four other \"mink plans\" and two \"fox plans.\" Her other mink plans were with Brookfield Mink Breeders, Inc.; Elgin Mink Breeders, Inc.; and Oak Lawn Mink Breeders, Inc.\n\nIn some, but not all, years, Mrs. Sweeney received certificates stating the number of minks she owned in the various plans. These certificates, which bore defendant's signature, indicated that her minks in the various plans were doubling annually. The last certificates she received were dated January 1, 1979. They showed she owned, in the aggregate, 2,642 minks.\n\nMrs. Sweeney visited the Clubb facility in 1975 and on other occasions thereafter, the last being in July, 1979. At that time, according to Mrs. Sweeney, defendant stated everything \"was going along fine.\"\n\nThe fox contract that was the subject of Count I of the amended information was purchased by Mrs. Sweeney and her husband, William, in 1979. They made a \"down payment\" of $2,075, which was to be followed by 56 monthly payments of $125 each. Mrs. Sweeney quoted defendant as saying that the terms were \"to be the same as the mink plans were.\" She never received a written contract regarding this transaction.\n\nPertinent to Count II of the amended information, Mrs. Sweeney identified a promissory note for $20,000 dated October 12, 1979, payable 9 months after date \"with Interest at 25 percent.\" The maker of the note is shown as \"Breeders United Fur Farms \u0026 Services,\" and the note is signed \"R. J. Garrette, President.\" Payees are Alice Sweeney and her husband, William.\n\nMrs. Sweeney testified she originally loaned defendant $5,000 in 1975. When payment became due, she \"rolled it over,\" allowing defendant to retain the principal and the interest owed her, thereby increasing the amount of the debt. Interest then began accruing on the new account. By repeating this process, Mrs. Sweeney allowed the debt, including principal and interest, to reach $23,000.\n\nIn July, 1979, Mrs. Sweeney received a check for that amount. She thereupon telephoned the Clubb facility and talked with Gail Turner and Bonnie Garrette. Mrs. Sweeney advised them she wanted only $3,000 and desired the remaining $20,000 to be reinvested. Pursuant to this understanding, Mrs. Sweeney returned the $23,000 check and received (1) the $20,000 note mentioned above and (2) a check for \"three thousand some odd dollars.\"\n\nAsked whether defendant ever indicated that the minks were mortgaged, Mrs. Sweeney replied: \"No. He told me he couldn't get a loan on the minks. That's part of the reason of the loan.\"\n\nMrs. Sweeney's testimony included this:\n\n\"Q Did he ever tell you he was loaning money to himself?\n\nA No.\n\nQ Did he ever tell you he had loans in the company?\n\nA Not that I recall.\n\nQ Did he ever tell you that he was using investor's funds to pay interest on those loans?\n\nA No.\n\nQ Did you know the mink were not doubling?\n\nA No.\n\nQ What did he say your investment monies were going to, the money you invested?\n\nA To improve the farm and the mink.\"\n\nPearl Thiel of Schneider, Indiana, (toward whom defendant allegedly directed the fraudulent conduct described in Count III of the amended information and to whom defendant allegedly offered to sell unregistered securities as charged in Count VIII of the amended information) testified she first became acquainted with defendant July 27, 1979, when she and her husband \"went down to Clubb, Missouri, to see the mink and fox farm.\" Asked why they went, Mrs. Thiel replied, \"Because we were going to invest in the fox farm.\"\n\nMrs. Thiel and her husband purchased a fox plan with Black Oak Fox Farms, Inc. Under this plan, they were to begin with 4 foxes, which were to increase to 64 in 5 years. The Thiels paid $2,075 down and were to make 41 monthly payments of $125 each. Mrs. Thiel quoted defendant as saying that after 5 years she and her husband would receive $42,000 per year.\n\nDefendant, according to Mrs. Thiel, stated there were about 280 foxes and between 10,000 and 12,000 minks at the Clubb facility. He added that there were about 5,000 minks at another farm \"at Thompson Hollow,\" but that the Thiels could not go there because \"the road was washed out.\"\n\nMrs. Thiel's testimony included this:\n\n\"Q Was it your understanding that the fox were to double each year?\n\nA Right, he said that in so many years it would be such a big herd that wouldn't have any problem, because my husband questioned him about having enough money to pay people. He said he didn't have any worries. It was going to increase and be so big there would be all the money in the bank that anyone needs.\n\nQ Did he indicate to you that that's what was happening with the mink herd?\n\nA That's right.\"\n\nMrs. Thiel identified a letter dated October 8, 1979, offering investors an opportunity to \"purchase stock in the company again.\" Although the letter has not been furnished us, it is inferable from Mrs. Thiel's testimony that it was a form letter identical tothe one received by James Kirby dated October 8, 1979, which is quoted (infra) in connection with the testimony of Gerald Bonnevier.\n\nGerald Bonnevier of LaGrange Park, Illinois, (toward whom defendant allegedly directed the fraudulent conduct described in Count VII of the amended information and to whom defendant allegedly offered to sell unregistered securities as charged in Count VIII of the amended information) testified he met defendant April 8, 1979, at the Holiday Inn in Oak Lawn, Illinois, near Chicago. Bonnevier explained:\n\n\"When I arrived at that meeting there were some hundred people in the room and I was watching two or three TV monitors. On these monitors there were animals running around. And Mr. Garrette was conducting the meeting.\n\nQ What was Mr. Garrette saying concerning these animals?\n\nA The longer I watched, the gist of it was the ranch and I assumed and learned that all these people were investors in the ranch and he was explaining how the ranch operates, how many animals were in Missouri at the ranch and that there were opportunities for investment.\"\n\nAccording to Bonnevier, he and his wife subsequently decided to purchase a fox plan for $7,200, which, at the end of the fifth year, guaranteed them $2,000 per year for life. Around the end of April, 1979, Bonnevier telephoned the Clubb facility and discussed the puurchase with defendant. Bonnevier quoted defendant as saying there were only 22 or 23 people in the plan (Bridgeview Fox Farms, Inc.) and there had to be 25 before he could issue a signed contract.\n\nBonnevier sent two checks payable to \"Bridgeview Fox Farm,\" one in April, 1979, for the $2,075 down payment, and one in June, 1979, for the aggregate of the first year's payments, $1,500.\n\nBonnevier later received a \"sample\" contract which provided that he owned the animals and that \"Buffs guaranteed the health and welfare and the keep of my animals.\" Another provision in the agreement guaranteed the breeder herd would double each year for a period of 5 years.\n\nBonnevier testified he was unaware that defendant was using investors' funds for his own personal use and was likewise unaware that the animals were mortgaged.\n\nBonnevier identified a letter (Exhibit 49) he received on the letterhead \"Breeders United Fur Farms \u0026 Services.\" It was a form letter dated October 8, 1979, and was evidently identical to the letters of like date received by James Kirby and Pearl Thiel, mentioned earlier.\n\nExhibit 49 stated:\n\n\"Dear Associates:\n\n\"This is to inform you that each Associate has the opportunity to purchase shares of common stock in B.U.F.F.S.\n\n\"Any Associate wishing to purchase stock in Buffs at this time may write a letter stating the amount of common stock they wish to purchase. The cost of the stock can be purchased with 25 percent down and monthly payments to be made within one year. The cost of this stock is $10.00 per share. No dividend will be paid on any stock that is not paid in full by December 31, 1979. The Associate will not receive a Stock Certificate until the stock is paid in full. Beside the voting rights, you will also receive a dividend of at least $1.00 per share at the end of the year.\n\n\"Each corporation will have money left over in profits at the end of each year, after the plans are paid. The extra money will be used to pay a dividend to Associate holding common stock in Buffs.\n\n\"If you have any questions, please do not hesitate to call or write.\n\nSincerely Yours,\n\ns/ R. J. Garrette\"\n\nGail Turner, heretofore identified as a clerical employee at the Clubb facility, testified that defendant and his wife controlled the finances of all the corporations. Asked how many there were, Ms. Turner replied: \"There was fifteen all together. Fifteen different corporations at the end. But some of them hadn't been incorporated yet.\" Asked whether there were different locations for the various corporations, Ms. Turner answered, \"No, they were all at Breeders United.\"\n\nMs. Turner explained that checks received from investors would be deposited in the bank account of the appropriate corporation. Each corporation had its own checkbook and ledger. According to Ms. Turner, defendant could not issue a contract to an investor \"until they had twenty-five people in a corporation, and then have it incorporated.\"\n\nAfter incorporation, each company had a board of directors and a slate of officers but, said Ms. Turner, \"they were figureheads, they never did anything.\" She described \"Buffs Minks\" as the \"mother corporation.\" In her words, \"It handled all the business for the other corporations.\"\n\nMs. Turner explained that a firm of certified public accountants -- Kraft, Miles and Tatum -- prepared a separate financial statement for each corporation each year, except the \"new\" companies that had never been incorporated. The Kraft firm was furnished \"all the bank statements and they got the stock book and the ledger books and all the checks and check stubs.\"\n\nMs. Turner testified that defendant got \"divorced\" from Bonnie in August, 1979, and left the farm. Thereafter, he was at the farm intermittently, but he left toward the end of November and did not return.\n\nAccording to Ms. Turner, \"Breeders United\" had borrowed money from many of those who invested in the breeding plans. When defendant departed the final time, there was about $100,000 on hand, but the loans owed to investors totaled over $400,000. Checks from investors continued to arrive, but on November 23, 1979, Ms. Turner ceased depositing them because defendant \"was supposed to be back that week and he did not show up.\"\n\nEventually, Ms. Turner and others issued a newsletter to all of the associates stating there would be a meeting in Chicago \"with more information about Breeders United.\" That meeting was held, and the investors were informed that defendant had not returned to the farm. The result of the meeting was that the investors \"decided to hire a lawyer.\" That led to the filing of the petition in the Bankruptcy Court.\n\nWilliam M. Luna, president of the Bank of Piedmont, identified a promissory note evidencing a $45,000 loan made by the Bank to Buffs Minks, Inc., on January 25, 1977, and another note evidencing a $60,000 loan by the Bank to Buffs Minks, Inc., on January 27, 1978. The notes were signed by defendant as president of Buffs Minks, Inc., and were secured by security agreements on personal property of Buffs Minks, Inc., including:\n\n\"All machinery and equipment, furniture and fixtures, livestock, inventory and accounts receivable now held, purchased with loan proceeds or hereafter acquired and all additions and accessions thereto, including but not limited to 6,000 wire mink cages, 3,000 mixed colors mink, metal office building, mixers and grinders.\"\n\nLuna testified that the loan became delinquent and the Bank, with permission of the Bankruptcy Court, foreclosed on the collateral in 1980. Luna recalled that \"around 2300\" minks and \"around 105\" foxes were sold at auction.\n\nJ. Mark Decker, a certified public accountant with the Kraft firm, testified that he was hired by defendant to prepare tax returns and unaudited financial statements for various companies \"through the period of 1977 through 1979.\" Defendant furnished Decker journal sheets, check registers, ledger sheets, bank statements, cancelled checks and deposit tickets of the following companies: \"Blue Island Mink; Elgin Mink Breeders, Inc.; Brookfield Mink Breeders, Inc.; Park Forest Mink Breeders; Overland Park Mink Breeders, Inc.; Lakeland Mink Breeders, Inc.; South Elgin Mink Breeders, Inc.; Earl Park Mink Breeders, Inc.; Oaklawn Mink Breeders; and Breeders United Fur Farms and Services.\"\n\nProfessor Rick Elam, a certified public accountant and Director of the School of Accountancy at the University of Missouri, was retained by the Attorney General to review the financial records of \"Breeders United Fur Farms and its associated companies.\" Elam examined \"several boxes full of records\" at the Attorney General's office. The records had evidently been obtained from the trustee in bankruptcy of Buffs Minks, Inc., pursuant to a subpoena duces tecum. Elam also looked at financial statements and work papers supplied by the Kraft firm.\n\nElam's examination revealed that money would flow into the \"little companies\" and then \"right back into Breeders United Fur Farms for feed and care of animals immediately.\" He found no organized method of record keeping for the number of animals in the pens, nor did he find a sales journal for animals sold. The financial statements of the various companies indicated that the minks and foxes were owned by the respective companies, not by anyone else.\n\nGloria Rodick, an investigator in the Attorney General's office, examined the list of claims in bankruptcy against \"Breeders United Fur Farms \u0026 Services.\" These included loans, mink contracts and fox contracts. Loan claims totaled $391,898.56.\n\nMs. Rodick also prepared a graph showing the total yearly \"pay out\" due investors on mink and fox contracts as they matured. For the year 1981, that total was $3,546,000. Thereafter, it would have been $6,020,500 for 1982, $9,951,440 for 1983, and $15,379,744 by 1988. According to Ms. Rodick, 106,931 minks would have been required to fulfill all of the mink contracts at the time of the bankruptcy, and 667 foxes would have been required for the fox contracts.\n\nThe bankruptcy inventory listed 2,430 minks and 106 foxes.\n\nRecords in the office of the Secretary of State of Missouri show defendant as the secretary and Highway 34, Clubb, Missouri, as the address of the following corporations: Blue Island Mink Breeders, Inc.; Brookfield Mink Breeders, Inc.; Earl Park Mink Breeders, Inc.; Elgin Mink Breeders, Inc.; Oaklawn Mink Breeders, Inc.; Park Forest Mink Breeders, Inc.; and South Elgin Mink Breeders, Inc.\n\nSimilar records show defendant as president of Buffs Minks, Inc., and Highway 34, Clubb, Missouri, as its address.\n\nJohn Robert Perkins, an assistant attorney general of Missouri, questioned defendant on February 26, 1981, following defendant's arrest. Perkins quoted defendant as saying that he had repaid an investor for a loan using money received from other investors. Perkins also quoted defendant as saying that he knew he was going to the penitentiary.\n\nWe now return to the assignments of error.\n\nWe earlier dealt with an argument by defendant under his third assignment of error that it was unconstitutional to place upon him the burden of proving that the unregistered securities he allegedly offered for sale under Count VIII of the amended information were exempt from registration. We pointed out that § 409.402(f) placed that burden on defendant and that no issue as to the constitutionality of that section had been preserved for appellate review. That ruling, however, did not dispose of all of the contentions by defendant under his third point.\n\nDefendant, in that point, maintains that Count VIII of the amended information did not state an offense in that it failed to allege that the unregistered securities were not exempt from registration. Consistent with that position, defendant also asserts the State failed to make a prima facie case on Count VIII in that the State failed to prove said securities were not exempt from registration. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nDefendant's theory is that offering to sell an unregistered security is not a crime under § 409.301 if the security is exempt from registration and that the State was consequently required to allege and prove that the unregistered securities described in Count VIII were not exempt from registration.\n\nAlthough no Missouri appellate court has addressed this issue, it was considered in Nelson v. State, 355 P.2d 413 (Okla. Crim. App. 1960). The Oklahoma statute, like the Missouri statute, makes it unlawful for any person to offer or sell any security unless the security is registered or the security or transaction is statutorily exempted. The accused in Nelson asserted that the prosecution failed by neglecting to establish that the unregistered security he sold did not fall within any of the exemptions. Rejecting that contention, the court stated:\n\n\"Hence, it is apparent that the purpose of the act herein involved is to protect the public against blue-sky promotions and promoters, and other stock transactions not otherwise covered by law. The burden is placed upon the offeror or seller of stock to ascertain if the security may be sold lawfully. The law thus requires registration of the security and the seller to guarantee protection of the public against blue-sky transactions. The presumption necessarily follows that having ascertained that the stock offered or sold falls within the exempt class of securities that matter is peculiarly within the personal knowledge of the offeror or seller. Such being the case, the State is not required to prove a negative which it is the duty of the seller to ascertain before he sells or offers the security for sale. Under these conditions the matter of proving that the security is exempt is an affirmative defense and the burden is upon the defendant to bring himself within the terms of the exemption claimed under the statute.\" Id. at 419[8.]\n\nA similar result was reached in State v. Frost, 57 OhioSt.2d 121, 387 N.E.2d 235 (1979), in which the accused was convicted of several counts of selling unregistered securities. The Ohio securities statutes contained a provision that the burden of proof shall be upon the party claiming the benefits of any exemption. Frost held that this provision placed the burden on the accused to prove that the securities he sold were exempt from registration. 387 N.E.2d at 238[4.]\n\nThe same rule was applied in State v. Buchman, 361 So.2d 692 (Fla. 1978). Florida statutes forbade the sale of unregistered securities unless they were exempt or the transaction was exempt. The statutes included a provision that exemptions need not be negatived in informations or indictments and that the burden of establishing the right to an exemption is on the party claiming its benefit. The accused characterized the lack of an exemption as an element of the offense of sale of an unregistered security, but the Supreme Court of Florida disagreed, holding that the lack of an exemption is not an element of the offense; rather, the existence of an exemption is a defense available to an accused. Id. at 694-95[2.] Consequently, the prosecution was not required to allege or prove that the security or the transaction was exempt.\n\nAlthough not a securities case, State v. Achter, 514 S.W.2d 825 (Mo. App. 1974), is helpful by analogy. There, the accused was convicted of carrying a concealed weapon. The statute proscribing that conduct (§ 564.610, RSMo 1969) excepted two classes of persons from its operation. The accused contended the State was required to negative the exceptions in the information and to prove that he was not within either class of excepted persons.\n\nDisagreeing with that contention, the opinion pointed out that the State must negative an exception whenever it is contained in the section defining an offense and constitutes a part of the description of the offense sought to be charged; otherwise, no offense is charged. Id. at 829[11.] However, where the exception is found in a separate and distinct clause or part of the statute, disconnected from that which describes the offense, no such negative averment is necessary in the information, and if the accused is within the terms of the exception, he must show it in his defense. Id. at 830. The opinion concluded that the exception of the two classes of persons from the operation of the statute is not descriptive of the offense of carrying a concealed weapon. The excepted persons are merely those not within the operation and effect of the law denouncing the crime. Id.\n\nAlso instructive by analogy are Williams v. State, 437 S.W.2d 82 (Mo. 1969), and State v. Dixon, 546 S.W.2d 774 (Mo. App. 1977). In Williams, the accused was charged with illegal sale of a stimulant drug in violation of § 195.240, RSMo 1959. His contention that the information was defective because it failed to negative the exceptions in that section was rejected. Williams, 437 S.W.2d at 86[8.] In Dixon, the accused was charged with selling marihuana. He argued that the indictment was defective for failing to negative the exceptions to the definition of marihuana in § 195.010(20), RSMo Supp. 1975. Section 195.180, RSMo 1969, provided: \"In any . . . indictment . . . it shall not be necessary to negative any exception, excuse, proviso, or exemption, contained in this law, and the burden of proof of any such exception, excuse, proviso or exemption, shall be upon the defendant.\" Dixon held it was unnecessary for the State to plead or prove the exceptions. 546 S.W.2d at 776-77.\n\nIn the instant case, Count VIII of the amended information alleged -- and the State's evidence showed -- that the securities described in that count were not registered in Missouri. On the basis of the authorities cited and § 409.402(f), we hold that the State was not required to allege or prove that such securities were not exempt from registration. Defendant's third assignment of error is denied.\n\nDefendant's eighth assignment of error is related to the third assignment. The eighth assignment asserts that the trial court erred in failing to dismiss Counts IV, VI and VIII of the amended information at the close of all the evidence in that the respective securities which were the subjects of those counts were exempt per § 409.402(b)(9). \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Inasmuch as Counts IV and VI were not submitted to the jury, the case proceeded from the close of the evidence exactly as it would have if the trial court had dismissed those two counts at that juncture. We therefore confine our attention to Count VIII. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nAs noted, (supra) , the securities described in Count VIII were shares of common stock in \"Breeders United Fur Farms.\" \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The evidence on which defendant bases his eighth point is the testimony of Gail Turner that no one was sold \"stock\" in a particular corporation if there were already 25 people in such corporation. Asked how many people were \"involved\" in \"Breeders United,\" Ms. Turner replied: \"There was twelve people in there.\"\n\nWith certain exceptions not material here, under § 409.402(b)(9), one of the transactions exempted from § 409.301 is:\n\n\"any transaction by an issuer in a security of its own issue if immediately thereafter the total number of persons who are known to the issuer to have any direct or indirect record or beneficial interest in any of its securities . . . does not exceed twenty-five and if no commission or other remuneration is paid or given to anyone for procuring or soliciting the transaction[.\"]\n\nDefendant maintains that as a matter of law, the number of persons having an interest in any of the securities of \"Breeders United Fur Farms, Inc.\" did not exceed 25; therefore, the transaction on which Count VIII was based (the offer in Exhibit 49 to sell shares of common stock in \"B.U.F.F.S.\") was exempt from § 409.301.\n\nWe disagree. Even if the number of persons who owned shares in Buffs Minks, Inc., did not exceed 25, and even if the number of persons who purchased investment contracts in any one of the 14 satellite companies for which Buffs Minks, Inc., ostensibly performed animal care and breeding services did not exceed 25, a finder of fact could reasonably conclude that Buffs Minks, Inc., under defendant's management, treated the assets of the satellite companies as its own and that in fact the satellite companies existed in name only. There was evidence that monies received from persons investing in contracts with the satellite companies were deposited in bank accounts carrying the names of such companies but were immediately transferred to an account for Buffs Minks, Inc. Additionally, all livestock on hand was pledged by Buffs Minks, Inc., to the Bank of Piedmont as collateral to secure the 1977 and 1978 promissory notes mentioned earlier. This was done despite the fact that, according to Professor Elam, the financial statements of the satellite companies showed that those companies owned the livestock. Pledging livestock presumably owned by the satellite companies as security for notes made by Buffs Minks, Inc., was inconsistent with the notion that Buff Minks, Inc., and the satellite companies were separate entities.\n\nGail Turner testified that by 1978, defendant \"had gotten big where he was selling a lot of mink and fox all over the United States.\" Mink sales in 1978 totaled $31,222; fox sales that year totaled $29,750. Mink sales in 1979 totaled $68,313; fox sales that year totaled $61,960.\n\nAsked how payment was received for the animals sold, Ms. Turner explained:\n\n\"A Well we took cash, cashier's check or money order. We took no checks.\n\nQ Did you handle the cash?\n\nA No.\n\nQ Who handled the cash?\n\nA Bob got the cash.\n\nQ Did you ever handle the cash?\n\nA Ever handled it? I've counted it and made sure it was all there, but Bob got the cash.\n\nQ Did you deposit it in the corporate account?\n\nA No.\n\nQ Did you ever deposit it in the corporate account?\n\nA After Bob Garrette left we did.\"\n\nThere was no evidence that any of the animals sold were designated as belonging to any particular satellite company or individual investor, nor was there evidence that any of the sale proceeds were credited to any such company or investor.\n\nJames Kirby, who, as noted earlier, invested in contracts with Park Forest Mink Breeders, Inc., and Bridgeview Fox Farms, Inc., testified that when an investor loaned money to Buffs Minks, Inc., \"a year would come off of your contract.\" That is, the maturity date of an animal investment plan would be accelerated one year. According to Kirby, defendant said he would use the loan proceeds \"to purchase new equipment, upgrade the farm and new pens.\"\n\nGail Turner confirmed that the holder of an investment contract with a satellite company who made a loan to Buffs Minks, Inc., received a year's acceleration of the contract maturity date.\n\nAccelerating the maturity date of a contract with a satellite company as an inducement for a loan to Buffs Minks, Inc., the proceeds of which were used for the benefit of the latter, was obviously repugnant to the concept that Buffs Minks, Inc., and the satellite companies were each distinct and independent entities.\n\nAdditionally, Exhibit 49, the form letter of October 8, 1979, offering to sell shares of common stock in \"B.U.F.F.S.,\" stated that the profits of the satellite companies would be used to pay dividends to persons \"holding common stock in Buffs.\" Payment of dividends to shareholders of Buffs Minks, Inc., from the profits of the satellite companies is antithetical to the idea that each is a separate entity.\n\nIn Central Cooling \u0026 Supply Co. v. Director of Revenue, 648 S.W.2d 546 (Mo. 1982), the Supreme Court of Missouri faced the issue whether the transfer of goods to a parent corporation from its wholly owned subsidiary corporation constituted a taxable sale. The Director of Revenue had determined that the companies were separate corporate entities and that the transaction was therefore taxable. On the subject of disregarding the separate corporate entities, the Supreme Court observed that cases had recognized instances where one corporation is so controlled and its affairs so conducted as to transform it into the adjunct or alter ego of another corporation, and the question arises whether to retain or disregard the corporate fiction in order to obtain the correct result. Id. at 548[2.] In such a case, the test is whether the arrangement between the two corporations is being employed for a proper purpose. Id. If the purpose served by the arrangement is fair and lawful, then legal forms and relationships are to be observed and the case determined upon the basis of separate and individual corporate existence. Id. If an intercorporate affiliation is devised for or is being used to accomplish an improper or unlawful purpose, equity has the authority to tear down technical legal barriers and reach beyond them to impose liability or grant proper relief. Phelps v. Missouri-Kansas-Texas Railroad Co., 438 S.W.2d 181, 186[4] (Mo. 1968), cert. dismissed, 394 U.S. 955, 89 S.Ct. 1298, 22 L.Ed.2d 494 (1969).\n\nAlthough neither Central Cooling nor Phelps is a criminal case, we see no reason why the principles concerning the disregard of separate corporate entities should not apply here.\n\nIn our opinion, a finder of fact could reasonably determine from the evidence in the instant case that Buffs Minks, Inc., and each of the satellite companies were carefully structured so that none would have more than 25 investors in its securities, and that the purpose of this was to bring the transactions in the securities of each company within the exemption of § 409.402(b)(9), thereby avoiding the scrutiny inherent in registration.\n\nA finder of fact could also reasonably determine that Buffs Minks, Inc. -- contrary to its advertisied purpose -- did not merely charge fees for the care, breeding and sale of animals owned by the satellite companies and their investors, but instead handled the investors' funds and the animals as its own and carried on the entire operation at Clubb as one integrated enterprise, flagrantly disregarding the separate identifies of the satellite companies. By doing so, Buffs Minks, Inc., inextricably tied the fortunes of the satellite companies to itself, so that when it failed, so did they. There were, of course, far more than 25 persons, in the aggregate, who had purchased investment contracts in the various satellite companies. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThe evidence is thus sufficient to support a finding that the purpose in organizing Buffs Minks, Inc., and the satellite companies as individual corporations was not for the legitimate aim of each conducting its own separate business, but rather to avoid the registration of any transaction in any of the securities of any company. Compare, State on Inf. of McKittrick v. Koon, 356 Mo. 284, 201 S.W.2d 446, 455[14] (banc 1947). The evidence is likewise sufficient to support a finding that Buffs Minks, Inc., so controlled the affairs of the satellite corporations that they were adjuncts or alter egos of Buffs Minks, Inc. Consequently, defendant cannot successfully contend that as a matter of law the number of persons having any direct or indirect record or beneficial interest in any of the securities of Buffs Minks, Inc., did not exceed 25.\n\nDefendant's eighth assignment of error is denied.\n\nWe next address defendant's seventeenth assignment of error, which complains that the trial court wrongly denied a pretrial motion in which defendant sought an order that Counts IV, VI and VIII of the amended information (the \"unregistered securities\" counts) be tried at a different trial than the one at which Counts I, II, III, V and VII (the \"fraud\" counts) were tried. In the same assignment of error, defendant asserts the trial court should not have allowed the State to present evidence pertaining to the \"mink corporations,\" as all of the \"fraud\" counts were based on the sale of \"fox contracts.\" Defendant maintains that the evidence concerning the \"mink plans\" constituted proof of \"other alleged bad acts\" for which he was not charged.\n\nRule 23.05, Missouri Rules of Criminal Procedure (14th ed. 1983), which was in effect when the amended information was filed and which was remained unchanged, states:\n\n\"All offenses that are based on the same act or on two or more acts that are part of the same transaction or on two or more acts or transactions that constitute parts of a common scheme or plan may be charged in the same indictment or information in separate counts.\"\n\nRule 24.07, Missouri Rules of Criminal Procedure (14th ed. 1983), which was in effect when defendant was tried and which has remained unchanged, states:\n\n\"When a defendant is charged with more than one offense in the same indictment or information, such offenses may be tried jointly or separately in the discretion of the court.\"\n\nThe meaning of the words \"a common scheme or plan,\" as used in Rule 23.05, was considered in State v. McCrary, 621 S.W.2d 266 (Mo. band 1981), which dealt with former Rule 24.04(b) (effective January 1, 1979, to December 31, 1979), a predecessor of present Rule 23.05. McCrary states that the essential test in determining whether a common scheme or plan exists, in a case involving a single defendant acting alone, is the requirement that all the offenses charged must be products of a single or continuing motive. Id. at 271[2.]\n\nIn McCrary, the accused was charged with assault with intent to kill with malice aforethought in connection with a shooting on November 13, 1978, arson in the first degree in connection with the firebombing of a house on March 8, 1979, assault in the first degree in connection with the firebombing, and carrying a concealed weapon in connection with an incident on March 12, 1979. All four offenses were charged in the same indictment, the accused was tried by jury for all four offenses at the same time, and the jury found him guilty of all four. In upholding the judgment, the Supreme Court found that the State's evidence showed that the accused's actions were the product of the single, continuing motive of revenge by harassment for the loss of his paramour and children. All of the acts were directed toward the paramour and her family. Id. at 271-72[6.]\n\nAs to whether offenses properly joined in one indictment should nonetheless be severed for trial, McCrary, citing State v. Duren, 556 S.W.2d 11 (Mo. banc 1977), rev'd on other grounds sub nom. Duren v. Missouri, 439 U.S. 357, 99 S.Ct. 664, 58 L.Ed.2d 579 (1979), states that severance is a matter within the sound discretion of the trial court directed toward achieving a fair determination of the accused's guilt or innocence of each offense charged. McCrary, 621 S.W.2d at 272. The trial court should consider, among other relevant factors, the number of offenses charged, the complexity of the evidence to be offered, and whether the trier of fact will be able to distinguish the evidence and apply the law intelligently as to each offense. Id. Applying that criteria, the Supreme Court found no abuse of discretion in McCrary. Id.\n\nIn State v. Burroughs, 673 S.W.2d 474 (Mo. App. 1984), the accused was found guilty by a jury of 7 counts of rape, 16 counts of sodomy, 4 counts of incest and 2 counts of promoting prostitution. All counts involved one or the other of his two children, a daughter and a son, and the offenses were alleged to have occurred over a period of 22 months. The accused co-intended that the trial court erred in refusing to sever the charges. Rejecting that contention, the Court of Appeals, citing Rule 24.07, held that where an accused is charged with more than one offense, the offenses may be tried jointly or separately, in the discretion of the trial court. Id. at 476[2.] A denial of a motion to sever will be disturbed only upon a clear showing of abuse of discretion. Id. at [3.] The Court of Appeals concluded that the accused was involved in a common scheme and plan to pervert his children's morals and to use them for his own enjoyment and profit. The court added that broad joinder is to be encouraged and that the case before it was the kind that lent itself to the more efficient administration of Justice by trial of all counts together. Id. at 476.\n\nApplying McCrary and Burroughs to the instant case, we find no error in the trial court's denial of the severance requested by defendant. The State's evidence \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e is sufficient to support a finding that all of the offenses charged in the amended information were parts of a common scheme or plan by which defendant induced investors to purchase contracts with the various satellite companies and by which he induced investors to make loans to, and purchase stock in, Buffs Minks, Inc. It is readily inferable that all offenses were products of a single and continuing motive by defendant to utilize the operation at Clubb as a vehicle for obtaining funds from existing and new investors as long as he could. Although the evidence was voluminous, the jury was called upon to decide only 6 counts, far fewer than the 31 submitted in Burroughs, 673 S.W.2d at 476. The six counts involved offenses alleged to have been committed during a period slightly exceeding 6 months, as compared to 22 months in Burroughs. Additionally, in view of the mass of evidence in the instant case, the efficient administration of Justice was served by trying all counts of the amended information at one time.\n\nAs to defendant's contention that evidence regarding the \"mink corporations\" should not have been received, we note that one of the fraudulent acts charged in Count I and also in Count V of the amended information was that defendant furnished Alice Sweeney and James Kirby, respectively, certificates showing that minks they ostensibly owned by virtue of contracts with certain \"mink corporations\" were numerically doubling each year, when, in fact, that was not occurring and a sufficient number of minks did not exist to satisfy the ownership rights of the several investors. Obviously, evidence regarding the \"mink plans\" of Alice Sweeney and James Kirby was relevant to Counts I and V, respectively.\n\nMoreover, as we have seen in the Discussion of defendant's eighth assignment of error, evidence regarding the \"mink corporations\" was relevant to the issue whether the offer to sell the securities that formed the basis of Count VIII of the amended information was exempt from registration as a matter of law by virtue of § 409.402(b)(9), which exempts any transaction by an issuer in a security of its own issue if immediately thereafter the total number of persons who are known to the issuer to have any direct or indirect record or beneficial interest in any of its securities does not exceed 25 and if no commission or other remuneration is paid or given to anyone for procuring or soliciting the transaction.\n\nFurthermore, in view of the evidence that the operation at Clubb was carried on as one enterprise, with the separate identities of the satellite companies being disregarded by Buffs Minks, Inc., it would have been impossible to present an accurate picture of defendant's conduct had evidence regarding the \"mink corporations\" been excluded.\n\nDefendant's seventeenth assignment of error is denied.\n\nWe now return to defendant's eighteenth assignment of error, in which he complains about the manner in which the 13 additional veniremen were summoned. We earlier ruled that defendant's constitutional attack on § 494.060 \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e had not been preserved for appellate review, but we noted that defendant made other complaints besides the constitutional challenge.\n\nDefendant maintains that the additional veniremen were \"selected personally by the Sheriff of Wayne County and members of his staff\" and that defendant was prejudiced thereby because the Sheriff and his staff, as law enforcement officers, had vested interests in defendant's criminal conviction.\n\nAs observed (supra) , a hearing was held on the fourth day of trial regarding the summoning of the additional veniremen. At this hearing (conducted outside the presence of the jury), Deputy Sheriff Sheryl Ann McDonough of Wayne County testified that she was informed of the need for additional veniremen between 10:30 and 10:45 a.m., on the first day of trial. Deputy McDonough explained that she and court bailiff Albert Berwell \"went to the juror list to see if we knew, possibly there were some alternates that we could get hold of, which we couldn't.\" Then, said Deputy McDonough, [\"The] Sheriff got at one telephone and I got on another telephone and more or less tried to go through the telephone book according to township.\"\n\nAsked about \"the process of selecting names\" for those who were called, Deputy McDonough stated, \"Mainly the process was just trying to locate people that we knew possibly would be home at that time of day.\"\n\nOf the additional veniremen who appeared at the courthouse, 2 or 3 were contacted by Deputy McDonough, 8 or 9 were contacted by the Sheriff, and 3 were brought in by \"Deputy Davidson.\"\n\nAsked whether the Sheriff chose any of the additional veniremen for any reason except that there was \"a better chance of their being home,\" Deputy McDonough replied: \"That's correct. He knew that they had served before on juries and that they were readily available.\"\n\nJames S. Cable, Clerk of the Circuit Court of Wayne County, testified that the population of the county was approximately 10,000.\n\nDefendant relies on three federal cases in support of his attack on the selection of the additional veniremen: Henson v. Wyrick, 634 F.2d 1080 (8th Cir. 1980), cert. denied, 450 U.S. 958, 101 S.Ct. 1417, 67 L.Ed.2d 383 (1981); Thompson v. White, 680 F.2d 1173 (8th Cir. 1982), cert. denied, 459 U.S. 1177, 103 S.Ct. 830, 74 L.Ed.2d 1024 (1983); and Anderson v. Frey, 715 F.2d 1304 (8th Cir. 1983), cert. denied, U.S. , 104 S.Ct. 739, 79 L.Ed.2d 198 (1984). Each of those cases, however, is factually different than the instant case.\n\nIn Henson, the sheriff and a deputy decided whom to summon as bystander jurors, calling only \"solid citizens\" and excluding anyone who would not be a \"good juror.\" The sheriff's subordinates had investigated the crime and had arrested the accused. Two deputy sheriffs testified at the trial.\n\nIn Thompson, a prosecution for the murder of a police officer, the sheriff personally selected the entire panel of potential jurors on the basis of people he knew whom he thought would make good jurors.\n\nIn Anderson, the sheriff ordered 5 of his deputies and a city marshal to summon a total of 13 bystander jurors. The sheriff was slightly acquainted with all 13, but did not know any of them well. The sheriff's department had conducted the investigation of the crime for which the accused was convicted. The sheriff served as bailiff during the trial, and the deputy who had conducted the investigation testified as a witness.\n\nThe instant case, in our opinion, is unlike Henson, Thompson and Anderson, and is instead akin to Holt v. Wyrick, 649 F.2d 543 (8th Cir. 1981), cert. denied, 454 U.S. 1143, 102 S.Ct. 1002, 71 L.Ed.2d 295 (1982). There, a homicide occurred in one county, but the trial took place in an adjoining county after a change of venue. Because of partial depletion of the regular panel of veniremen, the trial Judge ordered the sheriff to select additional veniremen. In affirming the denial of federal relief, \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e the United States Court of Appeals for the Eighth Circuit noted that neither the sheriff who selected the supplemental veniremen nor his deputies were involved in the case prior to trial, and there was no question of the sheriff's acting out of loyalty to his deputies or on the basis of special knowledge of the facts of the case. 649 F.2d at 546 [1.] Equally important, there was no evidence that the sheriff selected only his acquaintances for the jury. Id.\n\nIn the instant case, the investigation was conducted by the office of the Attorney General, not the Wayne County sheriff's office. No deputy sheriff appeared before the jury as a witness, and there was no showing that any additional venireman was chosen because of friendship with the Sheriff or any deputy.\n\nThese facts compare favorably with State v. Sloan, 666 S.W.2d 787 (Mo. App. 1984), and McGrath v. State, 671 S.W.2d 420 (Mo. App. 1984), two cases decided since Henson, Thompson and Anderson.\n\nIn Sloan, the offense occurred in one county but the trial was held in another on change of venue. The accused complained that the sheriff and a deputy summoned persons known to them to serve as \"talesman jurors.\" Noting that the sheriff and the deputy had no professional involvement in the investigation or arrest of the accused, Sloan held that the mere fact of their acquaintance with the jurors selected did not render the sheriff and the deputy ineligible to participate in the selection process. Sloan, 666 S.W.2d at 791[4.]\n\nIn McGrath, the jury panel was reduced through challenges to fewer veniremen than the statutory requirement, and the trial Judge ordered the bailiff, a deputy sheriff, to procure additional jurors. The deputy went to a nearby restaurant and ordered five customers to report to the courthouse, making no effort to single out any particular type of person. Noting that the bailiff exercised no discretion and did not select the bystander jurors only from among his acquaintances, McGrath held that the accused was entitled no relief. McGrath, 671 S.W.2d at 423[4.]\n\nOn the basis of Holt, Sloan and McGrath, we hold that defendant's eighteenth assignment of error (exclusive of his constitutional attack on § 494.060 which was not preserved for review) is without merit.\n\nDefendant's ninth assignment of error complains about the receipt in evidence of his statements of February 26, 1981, to John Robert Perkins, then an assistant attorney general of Missouri. Perkins questioned defendant after he \"had been apprehended and extradicted back to Wayne County.\" The questioning took place while defendant was in custody.\n\nDefendant filed a pretrial motion to suppress, alleging that his statements to Perkins were inadmissible in that he was not represented by counsel when he made them and the statements were not voluntary and were \"not given with a clear showing of a waiver of rights.\"\n\nThe transcript furnished us does not contain any record of an evidentiary hearing on the motion to suppress, and we find no ruling thereon in the legal file. No such hearing is mentioned in the briefs.\n\nAt trial, Perkins identified a document (Exhibit 78) which he used in advising defendant of his Miranda rights. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Exhibit 78 contains all of the rights in the Miranda ritual, and defendant does not contend otherwise. Perkins testified he read Exhibit 78 aloud to defendant, and then inquired whether defendant was willing to answer questions or make a statement without consulting a lawyer or without having a lawyer present during questioning.\n\nAsked about defendant's response, Perkins testified: \"He indicated that he did not want to sign the document but that he wished to talk to me, that he wished to go ahead, that he understood the rights, that he understood them and wanted to waive them and would continue talking to me but did not want to sign that piece of paper.\"\n\nPerkins explained that defendant did not appear to be intoxicated or under the influence of drugs or alcohol. Perkins added that he made no promises to defendant, did not threaten defendant, and did not use any type of coercion on him.\n\nPerkins' trial testimony is the only evidence before us regarding the interrogation.\n\nAfter testifying as recounted above, Perkins was handed a \"mink 10 years sales and guarantee agreement\" and a \"fox 5 year sales and guarantee agreement\" and was asked what statements defendant made about those documents.\n\nDefense counsel thereupon made the following objection: \"Your Honor, I will object to any statement that he might make for the reason that it has not been shown that he voluntarily waived his rights for the reason that he did not sign the waiver which has been read into evidence and introduced into evidence. The jury can see that it has not been signed and the witness has testified that he did not wish to sign it.\"\n\nThe trial court responded: \"Yes, but the witness also stated that he understood. Overruled.\"\n\nPerkins then testified that defendant stated the mink contract was a \"standard mink contract that was used by him.\" Perkins quoted defendant as saying that he (defendant) was the only person authorized to issue a fox contract and that the fox contracts he issued were identical to the mink contracts except that they dealt with fox.\n\nPerkins subsequently testified without objection that defendant stated he had paid off one of the contracts with money from the \"general account\" and that this was investors' money which was used to pay back previous investors.\n\nPerkins was then asked whether defendant said anything indicating that he understood the possible consequences of his action.\n\nDefense counsel stated: \"I object your Honor, as being speculative.\"\n\nThe objection was overruled, and Perkins testified defendant indicated he knew he was going to the penitentiary. Defense counsel's request that the question and answer be stricken and that the jury be instructed to disregard them was overruled.\n\nWith the record in this posture, we begin our consideration of defendant's ninth assignment of error by noting that defendant does not complain that the trial court failed to hold a hearing on the voluntariness issue and make findings thereon as required by Jackson v. Denno, 378 U.S. 368, 84 S.Ct. 1774, 12 L.Ed.2d 908 (1964), and Sims v. Georgia, 385 U.S. 538, 87 S.Ct. 639, 17 L.Ed.2d 593 (1967). Consequently, we need not speculate whether such a hearing was held or whether such findings were made. We next observe that in order to preserve a challenge to the voluntariness of a confession or statement, an accused must timely object to its voluntariness when the statement is offered at trial. State v. Sisler, 654 S.W.2d 220, 221[2] (Mo. App. 1983); State v. Wade, 535 S.W.2d 492, 495 (Mo. App. 1976). We further point out that the only objection at trial regarding \"voluntariness\" was defense counsel's assertion that there was no showing that defendant voluntarily waived his Miranda rights, in that defendant refused to sign a written waiver. There was no objection that the proper warnings were not given or that any of defendant's statements were induced by threats, force or promises. Inasmuch as specific objections are required as to admissibility of evidence and a point on appeal must be based upon the theory of the objection as made at trial, State v. Lang, 515 S.W.2d 507, 511[8] (Mo. 1974), our review is limited to whether the trial court erred in receiving defendant's statements in evidence absent a written waiver by defendant of his Miranda rights.\n\nOn that issue, we are mindful that a waiver of the right to remain silent need not take any particular form; it need not be in writing, nor is it necessary that it be expressed in words specifically stating that the right to remain silent is being waived. State v. Clark, 592 S.W.2d 709, 715-16[3] (Mo. banc 1979), cert. denied, 449 U.S. 847, 101 S.Ct. 132, 66 L.Ed.2d 57 (1980). A waiver of such right or the right to counsel can be determined from all of the surrounding circumstances. Id. A defendant who refuses to sign a written waiver may nonetheless voluntarily waive the exercise of his Miranda rights by orally indicating his willingness to cooperate with the police questioning. State v. Groves, 646 S.W.2d 82, 85 (Mo. banc 1983). For a Discussion of cases in which a finding of waiver of Miranda rights has been upheld absent a signed waiver, see State v. Hull, 595 S.W.2d 49, 51-52[4] (Mo. App. 1980).\n\nIn the instant case, the only evidence on the issue whether defendant waived his Miranda rights was Perkins' testimony that after he (Perkins) read Exhibit 78 aloud, defendant said he understood his rights and wanted to waive them and wished to talk to Perkins. That testimony was sufficient to support a finding by the trial court that defendant did understand his Miranda rights and voluntarily waived them before answering Perkins' questions. See: Hull, 595 S.W.2d 49, and cases cited therein at 51-52.\n\nThat being so, we must determine whether the trial court, in connection with the admission in evidence of the statements to which defense counsel objected on Miranda grounds, made a finding that such statements were freely and voluntarily given. See: Sims, 385 U.S. at 543-44, 87 S.Ct. at 643[2,] 17 L.Ed.2d at 598[2.] Though the Judge need not make formal findings of fact or write an opinion, his Conclusion that an incriminatory statement is voluntary must appear from the record with unmistakable clarity. Sims, 385 U.S. at 544, 87 S.Ct. at 643[4,] 17 L.Ed.2d at 598[2.]\n\nIn the instant case, as emphasized earlier, the objection at trial was that no voluntary waiver of Miranda rights was shown because defendant refused to sign a written waiver. In overruling that objection, the trial court noted that, according to Perkins, defendant had stated that he understood his rights.\n\nHull, 595 S.W.2d at 52-54, contains a scholarly Discussion of how specific a trial court's findings must be on voluntariness issues, analyzing several cases in which rulings more succinct than the one here have been held adequate. Given the narrow ground of the objection in the instant case and the trial court's response thereto, we are persuaded by Hull that the trial court's response was sufficient to constitute a finding that defendant understood his Miranda rights and voluntarily waived them before answering Perkins' questions. Defendant's ninth assignment of error is consequently denied.\n\nIn his eleventh assignment of error, defendant complains about the receipt in evidence of a mass of documents that, according to defendant's brief, \"were apparently in court as a result of a subpoena duces tecum served upon the trustee in bankruptcy.\" These documents included cancelled checks and bank statements of \"Breeders United Fur Farms \u0026 Services\" and several of the satellite companies, the \"beginning cash receipt book for Breeders United, 1974,\" check registers for \"Breeders United\" and other satellite companies, \"ledger sheets\" that were \"kept on all of the stock,\" breeding records, a ledger showing the associates who owed money for mink and fox contracts, checkbooks and check registers for \"Buffs Ltd.\" and various satellite companies, checks received from investors that were not cashed, the individual files of the \"associates,\" and the check ledgers listing checks received which were payable to the various satellite companies.\n\nDefendant, citing Rakas v. Illinois, 439 U.S. 128, 99 S.Ct. 421, 58 L.Ed.2d 387 (1978), and McCrary, 621 S.W.2d 266, states he had \"a legitimate expectation of privacy that his papers of bankruptcy will be free from unreasonable government intrusion.\" As we understand it, defendant's theory is that the State should have obtained a search warrant authorizing the subpoena of the records from the trustee. It must be noted, however, that defendant does not maintain that the records came into the possession of the trustee as the result of an unlawful search and seizure. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nRakas dealt with whether passengers in an automobile who owned neither the automobile nor the firearm and shells seized by police during a search of the automobile could successfully object to the use of the firearm and shells as evidence against them in a prosecution for armed robbery. Upholding the admissibility of the rifle and the shells, the Supreme Court of the United States held that the passengers had made no showing that they had any legitimate expectation of privacy in the glove compartment (where the shells were found) or in the area beneath the front passenger seat (where the firearm was found). 439 U.S. at 148, 99 S.Ct. at 433, 58 L.Ed.2d at 404. Consequently, the search and seizure violated no rights of the passengers under Amendments IV and XIV of the Constitution of the United States. 439 U.S. at 150, 99 S.Ct. at 434, 58 L.Ed.2d at 405.\n\nMcCrary dealt with whether the accused had a legitimate expectation of privacy in a cardboard box from which police removed a rifle, shells and a homemade silencer. In McCrary, the Supreme Court of Missouri applied Rakas, stating that before one can complain that a search and seizure violated his rights under Amendments IV and XIV of the Constitution of the United States, one has to have a legitimate expectation of privacy in the place or thing searched. McCrary, 621 S.W.2d at 272. Rakas, according to the Supreme Court of Missouri, created a two-part test for determining whether an accused has a legitimate expectation of privacy in the thing or place searched. First, the accused must have an actual, subjective expectation of privacy in the place or thing searched. Second, the expectation of privacy must be reasonable or legitimate. McCrary, 621 S.W.2d at 273. The legitimacy or reasonableness of the expectation is measured by reference to concepts of real or personal property law or to understandings that are recognized and permitted by society. Id. In McCrary, the accused had dropped the box and had walked away from it upon realizing that he was being observed by a police officer. During a hearing on his motion to suppress, the accused made no claim that he had either an actual, subjective expectation of privacy in the box or that his expectation of privacy was legitimate. The items removed from the box by police were held admissible.\n\nBearing in mind that defendant raises no issue about the manner in which the records initially came into the hands of the trustee, we fail to see how Rakas or McCrary supports defendant's eleventh assignment of error. Rakas and McCrary were search and seizure cases. Here, the records were obtained from the trustee by subpoena for use at defendant's trial. We know of no authority, and defendant cites none, creating any privilege on his part that would preclude the use of the records of Buffs Minks, Inc., and the satellite companies as evidence against him. Indeed, corporate, as distinguished from private, records must be produced by any person in possession of the same, and such production cannot be resisted on the ground of either self-incrimination or any alleged right under Amendment IV to the Constitution of the United States, even if such production may reveal a violation of law by an officer or former officer of the corporation. United States v. Silvio, 317 F.Supp. 1108, 1109[2] (W.D. Mo. 1970), citing Wilson v. United States, 221 U.S. 361, 31 S.Ct. 538, 55 L.Ed. 771 (1911). Consequently, the records of Buffs Minks, Inc., and the satellite corporations would have been obtainable by subpoena even if they had been in defendant's possession.\n\nDefendant's eleventh assignment of error is denied.\n\nDefendant's seventh point asserts the trial court erred in allowing Professor Elam to state his opinion on whether the various corporations operated by defendant were \"separate and distinct entities,\" in that (a) Elam did not have the expertise to express such an opinion, and (b) the subject was not a proper one for expert testimony, as the jury could have examined the records and made its own determination whether the corporations were separate entities.\n\nElam, it will be recalled, examined several boxes of records at the Attorney General's office. Those records, as best we can determine from the transcript, were the ones obtained by subpoena from the trustee in bankruptcy of Buffs Minks, Inc. What the records included is described (supra) in our Discussion of defendant's eleventh assignment of error. At trial, the records which Elam had examined were identified by Gail Turner as business records of Buffs Minks, Inc., and the satellite companies.\n\nElam, as noted earlier, also examined financial statements and work papers supplied by the Kraft firm.\n\nElam's testimony is summarized (supra) , and we need not repeat what has already been said. Pertinent to defendant's seventh point, Elam's testimony included this:\n\n\"Q In the accounting sense were these companies separate and distinct?\n\nA No, they only dealt with Breeders United Fur Farms except for some very minor exceptions.\n\nQ In other words if Buffs went broke would they all go broke?\n\nA Effectively they were all broke anyway because they had no cash and whatever mink -- if the mink were there they weren't broke but if there was no mink they had nothing else.\"\n\nIn order for a witness to be qualified as an expert, it must appear that by reason of education or specialized experience he possesses superior knowledge respecting a subject about which persons having no particular training are incapable of forming an accurate opinion or drawing correct Conclusions. State v. Stevens, 467 S.W.2d 10, 23 (Mo. 1971), cert. denied, 404 U.S. 994, 92 S.Ct. 531, 30 L.Ed.2d 546 (1971). The determination whether a witness meets the qualifications of an expert so that he may express an opinion rests largely in the discretion of the trial court, although such determination is reviewable on appeal on the issue of abuse of that discretion. 467 S.W.2d at 23[12.]\n\nElam, in addition to being a certified public accountant and Director of the School of Accountancy at the University of Missouri, had published articles in accounting journals, had been employed by an accounting firm, and had taught accounting for 10 years. He possessed a bachelor's master's and doctor's degree in accounting. He was unquestionably qualified to express an opinion on subjects requiring the expertise of an accountant.\n\nIn Chicago \u0026 Northwestern Transportation Co. v. Barclay-Moore Co., 688 S.W.2d 805 (Mo. App. 1985), the plaintiff offered in evidence two summaries of voluminous business records already in evidence. The summaries had been prepared under the direction of a witness who identified them at trial and testified as to how they were prepared. The trial court refused to admit the summaries. In overturning that ruling, the Court of Appeals cited Thompson v. Arthur L. Hardin Associates, 219 S.W.2d 860, 864 (Mo. App. 1949), as authority for the proposition that the use of summaries by the preparer is the only practical way for a jury to be properly advised of the contents of voluminous records. Chicago \u0026 Northwestern, 688 S.W.2d at 807. As to what is required in order to qualify a summary for admission in evidence, Chicago \u0026 Northwestern holds that when the competency of the underlying records has been established and they are made available to the opposite party for cross-examination, the summary prepared by an expert of voluminous records is admissible. 688 S.W.2d at 808[2.]\n\nIn the instant case, the records and financial statements upon which Elam based his Conclusions were voluminous. All were in court and available to defense counsel for use in cross-examining Elam.\n\nElam summarized the records by explaining that money received from investors in mink and fox contracts was deposited in the account of the appropriate satellite company but immediately transferred to Buffs Minks, Inc. Even if we assume the jurors had the expertise to examine the records and trace the funds as Elam did, such a task would obviously have required countless hours, as the records covered several years and listed untold transactions. Additionally, contrary to defendant's assertion, Elam did not express an opinion on whether the various corporations were separate and distinct entities. Elam testified only that they were not separate and distinct in the \"accounting sense.\" In view of his explanation that the money received by the satellite companies went immediately to Buffs Minks, Inc., one can hardly quarrel with that Conclusion.\n\nDefendant's seventh point is denied.\n\nDefendant's thirteenth point charges error in the receipt in evidence of the 1974 newspaper advertisement referred to at the start of this opinion. Defendant's objection at trial was that the advertisement was \"hearsay and highly prejudicial\" and that there had been no showing that he was \"directly responsible\" for placing the advertisement. On appeal, defendant offers some additional arguments against admissibility, but we need not consider them, as a point on appeal must be based upon the theory of the objection as made at trial. Lang, 515 S.W.2d at 511[8.]\n\nAs to whether there was evidence to support a finding that defendant caused the advertisement to appear in the newspaper, it will be recalled that defendant was identified by the advertisement as the person to call for further information. Additionally, we have previously noted the testimony of James Kirby that he telephoned defendant after seeing the advertisement and that defendant came to his (Kirby's) home and explained the investment program in detail. This evidence amply supports a finding that defendant caused the advertisement to be placed in the newspaper.\n\nAs to the hearsay element of the objection, it has been held that any statements made by a defendant which tend to incriminate him and connect him with the crime charged are admissible when voluntarily made. State v. Thresher, 350 S.W.2d 1, 9[18] (Mo. 1961); State v. Sinovich, 329 Mo. 909, 46 S.W.2d 877, 881[15] (1931). The advertisement tended to incriminate defendant and connect him with the crimes charged, in that it identified him as the person to call for information about the investment plans and clearly explained how the breeder herds would double each year, ultimately providing a source of perpetual income for the investors. Inasmuch as there was sufficient evidence to support a finding that defendant caused the advertisement to appear in the newspaper, we see no reason for treating the advertisement any differently than any other statement by a defendant that connects him with a crime.\n\nDefendant's thirteenth point is denied.\n\nDefendant's fourteenth point predicates error in the receipt in evidence of the three certificates issued to James Kirby by Park Forest Mink Breeders, Inc., on January 1, 1979. Those certificates, as noted (supra) , showed that Kirby owned 200 minks under one plan, 640 under another, and 640 under a third. Defendant maintains that the certificates were irrelevant and immaterial in that the security that formed the basis of Count V of the amended information was a \"fox plan.\" Defendant argues that evidence regarding a \"mink security\" has no probative value on whether he illegally sold Kirby a \"fox plan.\"\n\nWe disagree. One of the allegations of fraudulent conduct in Count V of the amended information was that defendant provided Kirby certificates showing that animals subject to his earlier contracts were numerically doubling each year when in fact they were not and a sufficient number of animals did not exist to satisfy ownership rights reflected in all investors' stock certificates. The three certificates of January 1, 1979, were obviously relevant to that allegation.\n\nDefendant's fourteenth point is denied.\n\nDefendant's fifteenth point insists the trial court erred in receiving in evidence the agreement dated February 1, 1973, between \"Breeders United Fur Farms \u0026 Services and/or B.U.F.F.S.\" and Alice and Fred Sweeney. Some of the provisions of that document are recounted (supra) in connection with the testimony of Mrs. Sweeney. Defendant argues the document was irrelevant, immaterial and \"too remote in time.\"\n\nDefendant's argument is without merit. Count I of the amended information charged defendant with fraud in the sale of a fox contract to Mrs. Sweeney on or about April 27, 1979. Mrs. Sweeney testified that she never received a written contract regarding that transaction, but that the terms were to have been the same as the \"mink plans.\" The agreement of February 1, 1973, a mink contract, was consequently relevant in establishing the terms of the contract that formed the basis of Count I.\n\nDefendant's fifteenth point is denied.\n\nDefendant's sixteenth point asserts the trial court erred in receiving in evidence the newsletter of November, 1975, described (supra) in connection with our initial reference to the testimony of Gail Turner. This was the document that carried a picture of defendant, identifying him as president of Buffs Minks, Inc., and describing his role in the operation at Clubb. Defendant contends the newsletter was irrelevant and immaterial to any offense charged in the amended information.\n\nWe hold otherwise. Ms. Turner testified that defendant's duties in 1979 (the year in which all offenses charged in the amended information were alleged to have occurred) were the same as described in the newsletter. Inasmuch as all offenses were based on the sale of, or the offer to sell, securities of Buffs Minks, Inc., or the satellite companies, evidence describing defendant's role in the operation of those companies was pertinent to the crimes charged.\n\nDefendant's sixteenth point is denied.\n\nDefendant's tenth point maintains the trial court erred in receiving in evidence a copy of the \"bankruptcy petition and assorted papers\" of Buffs Minks, Inc., over his objections of \"irrelevant, immaterial and the lack of proper foundation.\" For brevity, we refer to those documents as \"Exhibit 71A,\" their designation at trial. Defendant argues that \"filing bankruptcy\" was not an element of any crime charged against him and that the jury was prejudiced by learning he was unable to operate his business in a financially successful manner. Additionally, says defendant, because the dates of the offenses charged were \"relatively close\" to the filing of the \"petition of bankruptcy,\" the jury could have concluded that his business was suffering when the securities described in Counts I, II, III, V and VII of the amended information were sold.\n\nWe find Exhibit 71A relevant and material for at least three reasons. First, it listed the persons who had invested in mink plans or fox plans with the various satellite companies, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e which was pertinent to the issue whether the number of persons having any direct or indirect record or beneficial interest in any of the securities of Buffs Minks, Inc., exceeded 25, as discussed (supra) in connection with defendant's eighth point. Second, Exhibit 71A identified the bank accounts maintained in the names of the satellite companies and showed the banks in which those accounts were carried. Third, Exhibit 71A showed that 2,430 minks and 106 foxes were on hand when the petition was filed in the Bankruptcy Court on February 6, 1980. This was slightly over 2 months after defendant departed the Clubb facility the final time. As there was no evidence that any significant number of minks or foxes were sold after defendant departed, the jury could reasonably infer that the number of minks and foxes on hand at the time of the filing of the petition in the Bankruptcy Court was essentially the same as when defendant disappeared.\n\nDefendant does not explain how Exhibit 71A lacked a \"proper foundation,\" and we fail to espy such a defect.\n\nDefendant's tenth point is denied.\n\nDefendant's twenty-seventh point assigns error in the receipt in evidence of Exhibit 72 and Exhibit 73. Exhibit 72 was a copy of the order of April 30, 1974, issued by the Securities Commissioner of Indiana and referred to near the beginning of this opinion. Exhibit 73 consisted of (a) a copy of an order issued November 15, 1977, by the Secretary of State of Illinois temporarily prohibiting defendant, along with \"Breeders United Fur Farms and Services,\" \"B.U.F.F.S.,\" and Brookfield Mink Breeders, Inc., from selling or offering for sale securities issued or issuable by \"Breeders Fur Farms and Services\" and \"B.U.F.F.S.,\" and (b) a copy of an order issued March 9, 1978, by the same official, permenently prohibiting the same parties from selling or offering for sale the same securities \"or any other securities except in compliance with the Illinois Securities Law of 1953.\"\n\nExhibits 72 and 73 were offered on the third day of trial near the end of the State's evidence. Defendant objected that the exhibits were \"immaterial and irrelevant in this case and they are prior in time.\"\n\nWhatever merit, if any, may have inhered in that objection need not be determined because of what had occurred earlier in the trial.\n\nJoseph W. Schoeberl, Commissioner of Securities of Missouri, testifying for the State, identified a copy of a letter of May 20, 1974, sent to defendant by John R. Short, who, at that time, was Commissioner of Securities of Missouri. Without objection, Schoeberl was permitted to read aloud certain portions of the letter. Those portions pertinent to defendant's twenty-seventh point are set out marginally. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nSchoeberl was also, without objection, permitted to read aloud certain portions of a letter of December 2, 1977, sent to defendant by Marion F. Thurston, Jr., who, at that time, was Commissioner of Securities of Missouri. Those portions pertinent to defendant's twenty-seventh point are set out marginally. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nIf evidence is improperly admitted, but other evidence before the court establishes essentially the same facts, there is no prejudice and no reversible error. State v. Zagorski, 632 S.W.2d 475, 478 n.2 (Mo. banc 1982); State v. Corona, 685 S.W.2d 931, 938[5] (Mo. App. 1985). Here, the essentials of what was shown in Exhibits 72 and 73 were already before the jury as a result of Schoeberl's reading from the letters of May 20, 1974, and December 2, 1977. Therefore, even if the admission in evidence of Exhibits 72 and 73 was error -- an issue we need not decide -- there was no prejudice, hence no reversible error.\n\nDefendant's twenty-seventh point is denied.\n\nDefendant's twelfth point asserts the trial court erred in finding that defendant was a persistent offender, in that the State neither pleaded nor proved that he was placed on probation, paroled, fined or imprisoned as a consequence of either of the two earlier felony convictions established by the State's evidence.\n\nUnder the Second Offender Act, § 556.280, RSMo 1969 (now repealed), the State was required to prove that an accused had previously been convicted of an offense punishable by imprisonment in the penitentiary, that he had been sentenced for that offense, and that he had been placed on probation, paroled, fined or imprisoned therefor. State v. Quinn, 594 S.W.2d 599, 601[1] (Mo. banc 1980). Defendant, however, was not tried under the Second Offender Act, but was instead tried as a persistent offender, as defined by § 558.016.3, Laws 1981, p. 636. It was consequently unnecessary for the State to allege or prove that defendant was placed on probation, paroled, fined or imprisoned as a result of either of his two earlier felony convictions. State v. Jackson, 627 S.W.2d 880, 882[4] (Mo. App. 1981).\n\nDefendant's twelfth point is without merit.\n\nDefendant's sixth point alleges the trial court erred in failing to dismiss Count II of the amended information at the close of all the evidence, as the State failed to present sufficient evidence to support a finding of guilty of that count. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nCount II, it will be recalled, charged defendant with violating § 409.101, \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e alleging that he sold a promissory note to Alice Sweeney on or about October 10, 1979. Mrs. Sweeney, as explained (supra) , had originally loaned defendant $5,000 in 1975 and had thereafter \"rolled it over\" several times so that by July, 1979, the amount due her had reached approximately $23,000. Upon receiving a check for that amount, she instructed Gail Turner and Bonnie Garrette by phone that she wanted only $3,000 and that she wished to leave the remaining $20,000 on loan. As a result, Mrs. Sweeney received the note and a check for some $3,000. The maker of the note was shown as \"Breeders United Fur Farms \u0026 Services,\" and the note bore the signature \"R. J. Garrette, President.\"\n\nSection 409.101 makes it unlawful for any person, in connection with the offer, sale or purchase of any security, to directly or indirectly engage in certain conduct described in paragraphs \"(1),\" \"(2) and \"(3)\" of that section. The unlawful conduct allegedly engaged in by defendant in connection with the $20,000 note issued to Mrs. Sweeney was failing to disclose that he \"was using previous investment funds for his own personal use and for principal and interest payments for earlier investors.\"\n\nOur search of the record has turned up no evidence that defendant had any contact with Mrs. Sweeney at the time she made the decision to reject the $23,000 payment in July, 1979, and to accept in lieu thereof the $20,000 note and the $3,000 payment. There is likewise no evidence that anyone, at defendant's direction, told or neglected to tell Mrs. Sweeney anything in connection therewith. Additionally, there is no evidence that defendant had any contact with Mrs. Sweeney at the time the $20,000 note was issued, October 12, 1979. Defendant's only involvement in the issuance of the note was his signature thereon. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe lone indication that defendant ever did or failed to do anything that had any bearing on Mrs. Sweeney's decision regarding the $20,000 note was her testimony that her decision was based on [\"partially,] what Bob had said at the meetings.\" There was, however, no hint as to when or where these meetings had occurred, no showing of what defendant had said, and nothing to establish that anything he had said was untrue at the time he had said it or that he had omitted to state anything necessary in order to make whatever he had said, in the light of the circumstances under which he had said it, not misleading. See: § 409.101(2).\n\nIn sum, assuming for the purpose of defendant's sixth point that the issuance of the $20,000 note to Mrs. Sweeney was a \"sale\" within the meaning of § 409.101, there was no evidence that defendant, in connection with that transaction, had engaged in the conduct alleged in Count II of the amended information. Accordingly, we hold that the evidence failed to support a finding of guilty of that count and that defendant's motion for judgment of acquittal at the close of all the evidence should have been granted as to that count.\n\nThis Conclusion makes it unnecessary to decide defendant's fifth point, which theorizes that the promissory note issued to Mrs. Sweeney was not a \"security\" within the meaning of § 409.101, and it also renders moot defendant's twenty-first point, which attacks instruction 7, the verdict directing instruction on Count II.\n\nDefendant's nineteenth point alleges the trial court erred in giving instruction 5, the verdict directing instruction on Count I of the amended information, and in refusing to give instruction D, a verdict directing instruction on Count I requested by defendant.\n\nCount I, it will be remembered, charged defendant with fraudulent conduct in connection with the sale of a fox contract to Alice Sweeney on or about April 27, 1979. As recounted (supra) , Count I specified four instances of fraudulent conduct by defendant in connection with that transction. Instruction 5, however, submitted only one of the four, i.e., that defendant provided Mrs. Sweeney a stock certificate which indicated that the animals sold her in conjunction with her previous security purchases were numerically doubling each year, which was untrue. This was the conduct described in allegation \"(4)\" of Count I, set out (supra) in that portion of the opinion outlining the offenses charged in the amended information. Instruction 5 hypothesized that supplying the certificate was as act, practice or course of business by defendant which operated, or would operate, as a fraud or deceit upon Mrs. Sweeney.\n\nInstruction D, requested by defendant, submitted three of the four alleged instances of fraudulent conduct charged in Count I. One of the three instances submitted in instruction D was the same one submitted by instruction 5. The other two instances submitted by instruction D were those in allegations numbered \"(1)\" and \"(3)\" of Count I.\n\nDefendant's contention, as we comprehend it from his nineteenth point and the argument thereunder, is that the verdict directing instruction on Count I should have required the jury \"to find all of [defendant's] acts or his entire course of conduct, was a fraud.\" Defendant assails instruction 5 because it \"singles out only one act.\"\n\nThe point is without merit. Section 409.101 \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e specifies sundry ways in which one may be guilty of fraudulent conduct in connection with the sale of a security. Where a statute denounces an offense that may be committed in different ways, the commission of the offense may be charged in a single count, with the conjunctive \"and\" being substituted in the charge for the disjunctive statutory word \"or,\" and proof of the offense by any of the acts by which it may be committed will sustain the charge. State v. Church, 636 S.W.2d 703, 704[1] (Mo. App. 1982); State v. Hulett, 595 S.W.2d 767, 769[3] (Mo. App. 1980). No fatal variance arises from a failure to prove all of the several ways in which the offense is charged. Church, 636 S.W.2d at 704[2;] Hulett, 595 S.W.2d at 769[3.] When a crime may be committed by any of several methods, the information must charge one or more of the methods, and the method or methods submitted in the verdict directing instruction must be among those alleged in the information. State v. Shepard, 442 S.W.2d 58, 60[4] (Mo. banc 1969); Church, 636 S.W.2d at 704-05[3.]\n\nHere, instruction 5 submitted that defendant committed the offense charged in Count I by one of the four methods alleged in that count. It was unnecessary that the State prove every method alleged. Church, 636 S.W.2d at 704-05[4.]\n\nDefendant's nineteenth point is denied.\n\nDefendant's twentieth point asserts the trial court erred in failing to give two instructions requested by defendant, instructions E and F. Instruction E, set out marginally, \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e was requested by defendant in connection with the submission of Count I of the amended information. Instruction F pertained to Count VIII of the amended information (submitted to the jury as Count VI). We defer consideration of instruction F until we reach the instructions pertinent to Count VIII of the amended information.\n\nAs to instruction E, we note it was evidently intended by defendant as a converse (MAI-CR 2d 3.04) to instruction 5, the verdict directing instruction on Count I of the amended information. It will be observed, however, that one of the hypotheses in instruction E is that defendant \"operated his business in good faith.\" Nothing in instruction 5 hypothesized that defendant operated his business in bad faith; consequently, the submission in instruction E that defendant \"operated his business in good faith\" did not constitute the converse of any element submitted in the verdict directing instruction. Moreover, a submission that defendant \"operated his business in good faith\" is argumentative, as it does not isolate the transaction on which Count I was based, but instead encompasses all of defendant's actions and conduct in the countless transactions in which he was engaged during the years that he operated the enterprise at Clubb.\n\nInasmuch as instruction E contained a hypothesis that did not constitute the converse of any submission in the verdict directing instruction toward which it was directed, and instruction E was argumentative, the trial court did not err in refusing to give it. State v. Smith, 515 S.W.2d 761-62[2,3] (Mo. App. 1974). That portion of defendant's twentieth point regarding instruction E is therefore denied. Before moving on, however, we note that defendant was not deprived of a converse instruction in regard to Count I of the amended information. At defendant's request, the trial court gave instruction 6, which told the jurors that if they found that at the time Alice Sweeney bought a security, defendant did not willfully practice fraud in the sale thereof, they must find defendant not guilty of Count I.\n\nDefendant's twenty-second point assigns error in the giving of instruction 9, the verdict directing instruction on Count III of the amended information. Count III, as noted earlier, was based on the alleged sale of a fox contract to Pearl Thiel. Defendant's contention, as we understand it, is that instruction 9 was erroneous in that it required the jury to find that defendant engaged in only one of the three instances of unlawful conduct alleged in Count III, i.e., allegation \"(3),\" failure to disclose that the foxes subject to the contract purchased by Mrs. Thiel were covered by a \"mortgage.\" Count III alleged two other instances of fraudulent conduct by defendant in connection with the sale of the fox contract to Mrs. Thiel. Those allegations were numbered \"(1)\" and \"(2),\" and are recited (supra) in that portion of the opinion outlining the offenses charged in the amended information. Defendant maintains that instruction 9 should have submitted all of the fraudulent conduct ascribed to him in Count III. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe attack on instruction 9 is obviously the same as the attack on instruction 5 in defendant's nineteenth point. For the reasons that we denied defendant's nineteenth point, we likewise deny his twenty-second point.\n\nDefendant's twenty-third point assigns error in the giving of instruction 11, the verdict directing instruction on Count V of the amended information (submitted to the jury as Count IV). That count, as explained (supra) , was based on the sale of a fox contract to James Kirby on or about April 27, 1979. Defendant was alleged to have engaged in four instances of fraudulent conduct in connection with that sale. One of the four -- allegation \"(3)\" of Count V -- was that defendant failed to disclose to Kirby that the foxes subject to Kirby's contract were covered by a \"mortgage.\"\n\nInstruction 11, however, did not submit that alleged instance of fraudulent conduct or any of the other three. Instead, instruction 11 submitted that defendant, in connection with the sale to Kirby, \"had mortgaged the animals sold in conjunction with the security,\" and that \"this act of mortgaging the animals\" sold in conjunction with the security to Kirby constituted an act, practice, or course of business employed by defendant which operated, or would operate, as a fraud or deceit upon Kirby.\n\nIt is readily apparent, of course, that the act of \"mortgaging\" animals submitted in instruction 11 is not the same conduct as failure to disclose the existence of the \"mortgage\" alleged in allegation \"(3)\" of Count V of the amended information. Additionally, the sale of the fox contract to Kirby was alleged to have occurred on or about April 27, 1979, and all four instances of fraudulent conduct by defendant charged in Count V were alleged to have occurred in connection with the sale. The act of \"mortgaging\" the animals, however, took place, according to the testimony of William M. Luna, president of the Bank of Piedmont (the putative lienholder), when the notes of January 25, 1977, and January 27, 1978, were made.\n\nThe original information was filed December 14, 1981. If the act of \"mortgaging\" the animals, rather than the failure to disclose the existence of the \"mortgage,\" was to have been the basis of Count V of the amended information, an issue as to whether the information was filed within the time allowed by the statute of limitations, § 556.036, would have been apparent, as the original information was filed more than 3 years after defendant signed the second of the two security agreements in favor of the Bank of Piedmont.\n\nWe are mindful, of course, that the security agreements in favor of the Bank purported to cover, among other things, all livestock thereafter acquired. The State may have thus theorized that the act of \"mortgaging\" Kirby's foxes occurred when those particular animals were acquired, instead of when defendant signed the last security agreement. There was, however, no showing as to when, if ever, any foxes were acquired in connection with Kirby's fox contract of April 27, 1979.\n\nThe result of all this was a variance between the conduct submitted in instruction 11 and the conduct charged in Count V of the amended information. Generally, an instruction at variance with the charge is improper, but the error may be harmless when an accused's cause is not prejudiced. State v. Terry, 625 S.W.2d 189, 191[1] (Mo. App. 1981); State v. Scott, 534 S.W.2d 537, 540[4] (Mo. App. 1976). Here, however, for the reasons heretofore stated, we are convinced that defendant was prejudiced by the variance. It was more egregious than the variance in State v. Lassley, 351 Mo. 1024, 174 S.W.2d 795 (1943), in which the conviction was reversed because the information charged that the offense had been committed by one method while the verdict directing instruction submitted it had been committed by another.\n\nAlthough the basis on which we have found instruction 11 prejudicially erroneous was, arguably, not articulated by defendant in his twenty-third point, we are not precluded from granting relief where the error affects substantial rights of the defendant and manifest inJustice results therefrom. Rule 30.20, Missouri Rules of Criminal Procedure (16th ed. 1985). In view of the uncertainty as to what act the State was relying on in the submission in instruction 11 that defendant \"had mortgaged the animals sold in conjunction with\" Kirby's fox contract, we find the error manifestly unjust. Accordingly, defendant's conviction of Count V of the amended information msut be reversed, and that count must be remanded for a new trial.\n\nDefendant's twenty-fourth point assigns error in the giving of instruction 13, the verdict directing instruction on Count VII of the amended information (submitted to the jury as Count V). That count was based on the sale of a fox contract to Gerald Bonnevier on or about April 28, 1979. The three instances of fraudulent conduct charged against defendant in that count (allegations \"(1),\" \"(2)\" and \"(3)\") were identical to the first three instances of fraudulent conduct charged against defendant in Count V of the amended information. Except for the date of the offense and the name of the victim, instruction 13 was the same as instruction 11, the verdict directing instruction on Count V of the amended information. For the reasons that we found instruction 11 reversibly erroneous, we likewise find instruction 13 reversibly erroneous. Accordingly, defendant's conviction of Count VII of the amended information must be reversed, and that count must be remanded for a new trial.\n\nDefendant's twenty-fifth point avers that the trial court erred in giving instruction 15, the verdict directing instruction on Count VIII of the amended information (submitted to the jury as Count VI), and in refusing to give instruction G, a verdict directing instruction on that count requested by defendant. Count VIII of the amended information, it will be remembered, alleged that defendant, on or about October 8, 1979, offered to sell shares of common stock in \"Breeders United Fur Farms\" to Pearl Thiel, James Kirby and Gerald Bonnevier, when said securities were not registered with the Commissioner of Securities of Missouri. The charge was based on the letter (Exhibit 49) dated October 8, 1979, set out verbatim (supra) in connection with the testimony of Gerald Bonnevier. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nDefendant bases his twenty-fifth point on two arguments, one of which is that instruction 15 failed to include all elements of the offense in that it failed to require a finding that common stock in \"Breeders United Fur Farms\" was \"not exempt from registration.\" Instruction G, requested by defendant, would have required the jury, in order to find defendant guilty, to have found, among other things, that such stock was not exempt from registration.\n\nWe earlier decided, in considering defendant's third assignment of error, that it was unnecessary for the State, in connection with Count VIII of the amended information, to allege or prove that common stock of \"Breeders United Fur Farms\" was not exempt from registration. That being so, we are aware of no rule requiring that the verdict directing instruction require the jury to find that such stock was not exempt from registration in order to find defendant guilty.\n\nSection 409.402(f), as noted earlier, provides that in any proceeding under the Missouri Uniform Securities Act, the burden of proving an exemption is upon the person claiming it. That statute is analogous to the one dealing with the burden of proof of mental disease or defect excluding responsibility, § 552.030.7, RSMo Cum. Supp. 1984, which provides that the burden rests upon the accused to show by a preponderance or greater weight of the credible evidence that he was suffering from a mental disease or defect excluding responsibility at the time of the conduct charged against him.\n\nIn providing for the submission of the issue of mental disease or defect excluding responsibility to the jury, MAI-CR 2d does not require that the verdict directing instruction include a provision requiring the jury to find that the accused was free of such a defect at the time of the alleged offense. MAI-CR 2d 2.04 [1983 Revision] and para. \"Seventh,\" Notes on Use thereunder. Instead, the verdict directing instruction (MAI-CR 2d 2.30), after submitting all elements of the offense charged, directs the jury to find the accused guilty unless the jury finds and believes from the greater weight of the evidence that the accused is not guilty by reason of a mental disease or defect excluding responsibility as submitted in a separate instruction (MAI-CR 2d 2.33).\n\nWe see no reason why the verdict directing instruction on Count VIII of the amended information in the instant case should have been structured any differently than a verdict directing instruction in a case where mental disease or defect excluding responsibility is an issue. Here, defendant bore the burden of proof that the common stock of \"Breeders United Fur Farms\" was exempt from registration, just as an accused who relies on the defense of not guilty by reason of mental disease or defect excluding responsibility bears the burden of proof on that issue. Accordingly, we find no merit in defendant's contention that instruction 15 was defective in failing to require a finding that the common stock of \"Breeders United Fur Farms\" was not exempt from registration.\n\nDefendant's other attack on instruction 15 is that it submitted that he \"intentionally\" made the offer to sell the stock, whereas, according to defendant, the \"requisite mental state\" for a violation of § 409.301, \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e on which Count VIII of the amended information was based, is \"willfully.\" Defendant bases this assertion on the fact that § 409.410(a) \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e provides, with certain exceptions immaterial here, that any person who \"willfully\" violates any provision of the Missouri Uniform Securities Act shall, upon conviction, be punished as specified therein. Defendant insists that instruction 15 should have submitted that he \"willfully\" offered to sell the stock.\n\nAssuming, without deciding, that the crime defined by § 409.301, read in conjunction with § 409.410(a), is \"willfully\" offering or selling an unregistered security, we nonetheless find defendant's argument unpersuasive. The word \"willfully,\" in defining a criminal offense, has been held to mean \"intentionally\" or \"knowingly.\" State v. Marston, 479 S.W.2d 481, 484 (Mo. 1972); State v. Foster, 355 Mo. 577, 197 S.W.2d 313, 321 (1946). Said another way, the term \"willful\" as used in criminal statutes simply means intentional. State v. Adams, 532 S.W.2d 524, 527[2] (Mo. App. 1976). Defendant fails to explain how the use of the adverb \"intentionally\" instead of the adverb \"willfully\" in instruction 15 prejudiced him, and no prejudice is apparent to us.\n\nDefendant's twenty-fifth point is denied.\n\nDefendant's twenty-sixth point asserts the trial court erred in refusing to give instruction H requested by defendant in connection with the submission of Count VIII of the amended information. By instruction H, defendant sought to submit that the transaction on which Count VIII was based was exempt from registration by virtue of § 409.402(b)(9), quoted (supra) in our Discussion of defendant's eighth point.\n\nInstruction H began: \"If you find and believe beyond a reasonable doubt that defendant sold a security of his own issue . . .\"\n\nIt is readily apparent, from this alone, that instruction H was improper. First, it submitted the defendant sold a security, whereas Count VIII charged defendant with offering to sell common stock in \"Breeders United Fur Farms.\" Second, instruction H referred to a security of \"his own issue,\" whereas the stock on which Count VIII was based was common stock issued by \"Breeders United Fur Farms,\" not defendant. Third, instruction H referred to \"a security\" instead of the specific securities on which Count VIII was based. The jurors could have therefore been led to believe that if defendant sold any security, at any time, and the total number of persons known to have any direct or indirect record or beneficial interest in the securities of the issuer did not exceed 25, defendant would have to be found not guilty of Count VIII.\n\nWhen a requested instruction is incorrect, refusal to give it is not error. State v. Cameron, 604 S.W.2d 653, 661[27] (Mo. App. 1980); State v. McCoy, 530 S.W.2d 8, 10[1] (Mo. App. 1975). We are mindful, however, that it has been held in some circumstances that even though a requested instruction on an issue is defective, and is therefore properly rejected, the trial court is nonetheless under a duty to instruct on all of the law of the case and, consequently, is obliged to give a proper instruction on the issue. State v. Burnett, 354 Mo. 45, 188 S.W.2d 51, 54[6] (1945); State v. Ford, 344 Mo. 1219, 130 S.W.2d 635, 640[6] (1939); State v. Gibilterra, 342 Mo. 577, 116 S.W.2d 88, 95[9] (1938). However, the failure of the trial court to instruct on all of the law of the case is required to be specifically called to the court's attention in the motion for new trial, setting forth in detail and with particularity the grounds therefor so that the trial court may grant a new trial if the complaint is well founded, without the delay or expense incident to an appeal. State v. Jones, 386 S.W.2d 111, 113-14[2,3] (Mo. 1964). Where an accused does not specifically assign this failure to instruct as a ground for new trial, the alleged error is not preserved for appellate review. Id.\n\nHere, defendant's motion for new trial assigns error in the trial court's refusal to give instruction H, but it does not, as we read it, assign error in the trial court's failure, sua sponte, to give a correct instruction submitting the theory that the transaction on which Count VIII of the amended information was based was exempt from registration by § 409.402(b)(9). However, even if the motion for new trial were construed as assigning such failure as error, defendant's twenty-sixth point, in our judgment, fails to do so. Consequently, the issue is not before us for review. State v. Myers, 538 S.W.2d 892, 896[9] (Mo. App. 1976).\n\nFinding no error in the trial court's refusal to give instruction H, we deny defendant's twenty-sixth point.\n\nDefendant's twenty-eighth point assigns error in the trial court's failure to give instruction I, requested by defendant. Instruction I, patterned on MAI-CR 2d 2.38, hypothesized that if defendant reasonably believed that his conduct submitted in instruction 15 (the verdict directing instruction on Count VIII of the amended information) was not criminal, and if he acted in reasonable reliance upon a statement contained in an official interpretation, made by a public official, of the statute defining the offense then he must be acquitted of Count VIII.\n\nMAI-CR 2d 2.38 is used in cases where a good faith belief by an accused in the legality of his conduct would relieve him of criminal liability under § 562.031.2. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nAssuming, without deciding, that § 562.031, a part of The Criminal Code, Laws 1977, S. B. No. 60, is made applicable to § 409.301 (the statute defendant was charged with violating in Count VIII of the amended information, which is not part of The Criminal Code) by § 556.031.2, \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e we nonetheless find defendant's twenty-eighth point without merit.\n\nThe evidence upon which defendant relies to support his assertion that instruction I should have been given was testimony by Gail Turner that defendant made a trip to Jefferson City in 1977 that \"had something to do with the corporation.\" Ms. Turner recalled that after defendant returned, he \"was not allowed to sell anything.\" Later, according to Ms. Turner, defendant went to Chicago and returned with a \"subscription agreement.\" She explained that he could sell \"under the subscription agreement\" as long as there were not more than 25 people. Ms. Turner also recalled that at one time defendant stopped giving bonuses for \"referrals.\" She believe this was after he had gone to Jefferson City.\n\nMs. Turner's testimony falls far short of evidence that defendant, in offering for sale the unregistered common stock in \"Breeders United Fur Farms,\" acted in reasonable reliance upon an official interpretation of §§ 409.301 and 409.402(b)(9) that said stock was exempt from registration. There was no hint as to the identify of the person or persons, if any, contacted by defendant in Jefferson City or Chicago, nor was there any indication that said person or persons occupied any public office legally authorized to make an \"official interpretation\" of the pertinent statutes.\n\nDefendant's twenty-eighth point is denied.\n\nThe final item for consideration is that segment of defendant's twentieth point assigning error in the trial court's refusal to give instruction F. That instruction, set out marginally, \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e was requested by defendant in connection with the submission of Count VIII of the amended information (submitted to the jury as Count VI).\n\nWe need not list all the defects in instruction F. The assignment of error is disposed of by pointing out, as we did in denying defendant's twenty-eighth point, that there was insufficient evidence to support an instruction absolving defendant of Count VIII if he believed in good faith that the securities described in that count were exempt from registration.\n\nThe trial court did not err in rejecting instruction F.\n\nThe judgment, in adjudicating defendant guilty of the six counts submitted to the jury, identifies the counts by the numerals assigned them in the instructions, rather than by the numerals assigned them in the amended information. In setting forth the Disposition hereunder, we refer to the counts by the numerals utilized in the judgment.\n\nThat portion of the judgment adjudicating defendant guilty of Counts I, III and VI and sentencing him therefor is affirmed. That portion of the judgment adjudicating defendant guilty of Count II and sentencing him therefor is reversed, and defendant is discharged from Count II. That portion of the judgment adjudicating defendant guilty of Counts IV and V and sentencing him therefor is reversed, and those counts, only, are remanded for a new trial. If those counts are tried anew, the parties should not assume that in affirming the judgment in part, we imply that the verdict directing instructions on the affirmed counts are models that can be safely followed henceforth. In denying defendant's challenges to those instructions, our rulings were limited to the attacks made. Whether the instructions might have been vulnerable to other attacks was not considered.\n\nPrewitt, C.J., and Titus, Flanigan and Maus, JJ., concur.\n\n\u003cspan class=\"fn\"\u003e1. Henceforth, all references beginning with \"§ \" are to RSMo 1978 unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Whether by coincidence or otherwise, the first letters of the words \"Breeders United Fur Farm \u0026 Services\" spell \"BUFFS,\" the first word in the name of the primary company, Buffs Minks, Inc.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Evidently §§ 417.200-.230, RSMo 1978.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 409.101 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is unlawful for any person, in connection with the offer, sale or purchase of any security, directly or indirectly\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) to employ any device, scheme, or artifice to defraud,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) to make any untrue statement of a material fact or to omit to state a material fact necessary in order to make the statements made, in the light of the circumstances under which they are made, not misleading, or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) to engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Section 409.301 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is unlawful for any person to offer or sell any security in this state unless (1) it is registered under this act or (2) the security or transaction is exempted under section 409.402.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Footnote 4, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Footnote 5, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Section 409.410(a) provides, in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who willfully violates any provision of this act, except section 409.404, . . . shall upon conviction be fined not more than five hundred thousand dollars or imprisoned not more than ten years, or both.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Section 409.402 is a lengthy statute which describes various types of securities and transactions exempted from §§ 409.301 and 409.403.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant's third assignment of error makes the same contention regarding Counts IV and VI of the amended information. Those counts, however, were not submitted to the jury, as heretofore explained. Count VIII of the amended information did, as observed earlier, allege that the securities offered for sale by defendant had not been registered with the Commissioner of Securities of Missouri. Count VIII did not, however, allege that the securities were not exempt from registration under § 409.402.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Section 494.060 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In all cases, if a panel be exhausted by challenge or otherwise before the jury is sworn, the court shall order the sheriff or other officer to summon a sufficient number of other persons to complete the jury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Mo. Const. art. V, § 3 (1945, amended 1982), provides, in pertinent part: \"The supreme court shall have exclusive appellate jurisdiction in all cases involving the validity . . . of a statute . . . of this state . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The motion was filed by the attorney who represented defendant at trial. That attorney does not represent defendant on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Under § 546.180.1(2), Laws 1979, p. 627, the State and defendant each had the right to six peremptory challenges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Rule 23.01(a) provides, in pertinent part: \"The . . . information shall be in writing signed by the prosecuting attorney . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Defendant makes the same arguments regarding Counts IV and VI of the amended information; however, as noted (supra) , those counts were not submitted to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The eighth assignment of error also states that the trial court erred in failing to grant a motion in limine which sought, among other things, a finding by the trial court that the securities which were the subjects of Counts IV, VI and VIII of the amended information were exempt per § 409.402(b)(9). Paragraph 6 of defendant's motion for new trial, on which his eighth assignment of error on appeal is based, did not mention the trial court's failure to make the finding sought by the motion in limine. Consequently, we need not address that issue, as an allegation of error in a motion for new trial may not be changed or broadened on appeal. State v. Blair, 631 S.W.2d 91, 94[9] (Mo. App. 1982). The eighth assignment of error further argues that the trial court should have dismissed Counts IV, VI and VIII at the close of the State's case. Defendant moved the trial court for judgment of acquittal when the State rested, but his motion was denied. Defendant thereafter introduced evidence in his own behalf, thereby waiving any error with respect to the denial of that motion. State v. Green, 476 S.W.2d 567, 569[2] (Mo. 1972); State v. Campbell, 655 S.W.2d 96, 97[1] (Mo. App. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Defendant insists in his eighth assignment of error that he was prejudiced because the jury heard evidence regarding Counts IV and VI prior to their dismissal. That contention, however, does not appear in paragraph 6 of his motion for new trial. See footnote 17, (supra) . We therefore need not address it. Blair, 631 S.W.2d at 94[9.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. As should be apparent by now, the corporate entity Buffs Minks, Inc., was indiscriminately referred to throughout its history and the proceedings below by various appellations including \"Buffs,\" \"Buffs Minks,\" \"Breeders United,\" \"Breeders United Fur Farms\" and others. In this opinion, we quote the record as we find it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A cursory examination of the list of creditors in the Bankruptcy Court proceeding reveals that upwards of 300 persons invested in mink plans or fox plans with the various satellite companies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In deciding whether there was a misjoinder of offenses, the Supreme Court of Missouri in McCrary examined only the State's evidence. McCrary, 621 S.W.2d at 271 n.8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Footnote 11, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Federal relief was sought after the conviction was affirmed by the Supreme Court of Missouri. State v. Holt, 592 S.W.2d 759 (Mo. banc 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Miranda v. Arizona, 384 U.S. 436, 86 S.Ct. 1602, 16 L.Ed.2d 694 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. How the trustee acquired the records is not disclosed. We observe, however, that defendant was apparently removed as president of Buffs Minks, Inc., before the petition was filed in the Bankruptcy Court, as the petition is verified by one Al Hancock as president of Buffs Minks, Inc. An attachment to the petition refers to defendant as \"past president\" of Buffs Minks, Inc., and states that his current address is unknown. It adds that defendant may have possession of certain assets of Buffs Minks, Inc., and if so, such assets are being held without authorization of Buffs Minks, Inc.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Footnote 20, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. \"We are in receipt of information that on April 30, 1974 the Securities Commissioner of the State of Indiana entered an order prohibiting your further offer for sale and sale of securities described as being in the nature of an investment contract to residents of that state. The order is understood to have recited that you may be offering, may be about to offer, such securities in Indiana. That said securities are not registered for sale in that state and that no persons are registered as broker/dealer or as agent and that you have violated the antifraud provisions of the Indiana Securities Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\". . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The activities in which you appear to have been engaged or to be engaging which gave rise to the Indiana order are also similarily subject to regulation under the Missouri Uniform Securities Act, Chapter 409 RSMo. 1969.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. \"We are in receipt of information that on November 15, 1977 the Illinois Secretary of State entered a temporary order prohibiting your further offer for sale and sale of securities described as being mink 10 year sales and guarantee agreements and promissory notes made by Breeders United Fur Farms \u0026 Services and shares or interest in Brookfield Mink Breeders, Inc. to residents of that state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\". . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The activities in which you appear to be engaged or to be engaging giving rise to the Illinois order are also similiarly subject to regulation under the Missouri Uniform Securities Act, Chapter 409 RSMo., 1969 as amended (The Act).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Defendant's sixth point also argues that the trial court erred in denying defendant's motion for judgment of acquittal of Count II at the close of the State's case. Upon the denial of that motion, defendant introduced evidence in his own behalf, thereby waiving any error with respect to that ruling. Green, 476 S.W.2d at 569[2;] Campbell, 655 S.W.2d at 97[1.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Section 409.101 is set out verbatim in footnote 4, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. At trial, defense counsel endeavored to establish on cross-examination of Mrs. Sweeney that the signature on the note was the imprint of a rubber stamp. Mrs. Sweeney, however, refused to concede that.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Section 409.101 is set out verbatim in footnote 4, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Instruction E provided: \"If you find and believe from the evidence beyond a reasonable doubt that at the time Alice Sweeney bought a security, defendant did not intend to practice fraud in the sale of a security, but rather operated his business in good faith, you must find the defendant not guilty under Count I.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Defendant also argues in his twenty-second point that instruction 9, in one respect, lacked evidentiary support. That contention, however, was neither made on the record at time of trial nor included in defendant's motion for new trial. Consequently, it was not preserved for appellate review. State v. Coleman, 660 S.W.2d 201, 210[3] (Mo. App. 1983); State v. Martin, 620 S.W.2d 54[1,] 55[2] (Mo. App. 1981); Rule 28.03, Missouri Rules of Criminal Procedure (14th ed. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Inasmuch as Mrs. Thiel resided in Indiana, and Kirby and Bonnevier in Illinois, and the offer was made to them by letter rather than in person by defendant at Clubb, one might wonder whether venue of the offense charged in Count VIII of the amended information lay in Wayne County, Missouri. No such issue was raised, however, and we note that under § 541.033(2), if the elements of a crime occur in more than one county, the accused may be prosecuted in any of the counties where any element of the offense occurred. The evidence was sufficient to support a finding that Exhibit 49, which carried defendant's signature, was prepared at his instance in Wayne County, Missouri, and mailed there.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Section 409.301 is set out verbatim in footnote 5, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Section 409.410(a) is set out in pertinent part in footnote 8, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Section 562.031.2 provides, in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A person is not relieved of criminal liability for conduct because he believes his conduct does not constitute an offense unless his belief is reasonable and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\". . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(2) He acts in reasonable reliance upon an official statement of the law, afterward determined to be invalid or erroneous, contained in\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\". . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) An official interpretation of the statute . . . defining the offense made by a public official . . . legally authorized to interpret such statute . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Section 556.031.2 provides: \"Offenses defined outside of this code and not repealed shall remain in effect, but unless otherwise expressly provided or unless the context otherwise requires, the provisions of this code shall govern the construction of any such offenses committed after January 1, 1979, as well as the construction and application of any defense to a prosecution for such offenses.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Instruction F provided: \"If you find and believe from the evidence beyond a reasonable doubt that at the time defendant offered for sale a security, defendant believed he was exempt from the statute and sold the security in good faith, you must find the defendant not guilty under Count VI.\"\u003c/span\u003e\n\n",
    "body_length": 149007,
    "citedas": [
      "699 S.W.2d 468"
    ],
    "attorneys": "David E. Woods, Poplar Bluff, Missouri, Attorney for Appellant; William L. Webster, Henry T. Herschel, Jefferson City, Missouri, Attorneys for Respondent.",
    "category": [
      "252",
      "75"
    ],
    "judges": "Before Crow, P.j., Prewitt, C.j., Flanigan, Titus, Maus, JJ.",
    "citation_count": 1
  }
}
