{
  "id": "DYgcQGYBTlTomsSB9f96",
  "document": {
    "title": "In re Ellis",
    "full_title": "IN RE: MARCIANO ELLIS, MARCIANO ELLIS v. UNITED STATES DISTRICT COURT FOR THE WESTERN DISTRICT OF WASHINGTON (TACOMA) UNITED STATES OF AMERICA, REAL PARTY IN INTEREST.",
    "jurisdiction": "Ninth Circuit",
    "date": "2004-02-04T00:00:00.000Z",
    "docket": "No. 01-70724",
    "body": "FOR PUBLICATION\n\nRehearing En Banc Granted December 5, 2002\n\nArgued and Submitted En Banc March 25, 2003-San Francisco, California\n\nOpinion by Judge Wardlaw; Concurrence by Judge Kozinski; Partial Concurrence and Partial Dissent by Judge Trott; Dissent by Judge Kleinfeld; Concurrence in Dissent by Judge Gould\n\nOPINION\n\nWe write en banc to clarify that the acceptance of a criminal defendant's guilty plea is a judicial act distinct from the acceptance of the plea agreement itself. Once the district court accepts a guilty plea, the conditions under which the plea may be withdrawn are governed exclusively by Rule 11 of the Federal Rules of Criminal Procedure.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Where a district court accepts a plea of guilty pursuant to a plea agreement, defers acceptance of the agreement itself, and later rejects the terms of the plea agreement, it must, according to the plain language of Rule 11, \"give the defendant an opportunity to withdraw the plea.\" Fed. R. Crim. P. 11(c)(5)(B).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Because Rule 11 contains no provision permitting the district court itself to determine that the plea should be vacated following its rejection of the plea agreement, the district court's choice to do so here was error. We therefore issue the writ of mandamus.\n\nI. Background.\n\nThis appeal arises because, as is commonly the case, Ellis pleaded guilty to lesser charges than those set forth in the original indictment. His plea was entered pursuant to a plea agreement governed by both Rule 11(c)(1)(A) and (C).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The agreement specifically provided that (i) the government would not prosecute Ellis for any additional offenses known to it, i.e., the pending first degree murder charge; and (ii) if the court imposed any term of incarceration other than that agreed upon, either party could withdraw from the plea agreement.\n\nThe factual basis for Ellis's plea, as set forth in the plea agreement,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e is as follows: At approximately 7:45 p.m. on March 5, 1999, sixteen-year-old Marciano Ellis called Tacoma Yellow Cab from a payphone outside Winchell's Donut Shop in Spanaway, Washington, and requested a pick-up at a nearby tavern. Cabdriver Donald Ray Barker arrived some fifteen minutes later to pick up Ellis. As they headed through Fort Lewis, a United States Army reservation,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Ellis, the lone passenger, shot Barker three times in the back of the head. At approximately 8:20 p.m., a passerby discovered Barker's taxicab with its headlights on in a shallow ditch alongside North Gate Road in Fort Lewis. Finding the taxicab's engine running, the passerby investigated further and discovered Barker lying on the front seat with a head wound. He summoned medical assistance. Barker was taken to the Madigan Army Hospital. The Pierce County Medical Examiner determined that Barker was killed by three gunshot wounds to the back of the head.\n\nThe government originally charged Ellis with first degree murder and moved to have him tried as an adult due to his prior state court conviction for residential burglary. See United States v. M.C.E., 232 F.3d 1252, 1257 (9th Cir. 2000) (holding that Ellis's transfer to adult status was mandatory).\n\nOver one and one-half years after the shooting, and after what both defense counsel and the prosecutor later characterized as \"considerable\" discussion, the government and Ellis entered into a plea agreement providing that Ellis would plead guilty to a Superseding Information charging him with second degree murder. The agreement recognized that the court could impose any sentence authorized by law, but provided that either party had the right to withdraw from it if the court pronounced a sentence of incarceration other than 132 months. The parties also agreed that Ellis would not be allowed to withdraw his plea of guilty to the second degree murder charge in the Superseding Information \"unless that sentence is other than 132 months of imprisonment.\"\n\nOn December 8, 2000, Ellis, having waived indictment by a grand jury, entered a plea of guilty to the second degree murder charge set forth in the Superseding Information. During the Rule 11 plea colloquy, the district court inquired of Ellis whether he understood that the court could depart upward or downward upon consideration of all applicable sentencing guidelines. When Ellis hesitated in his response, his attorney attempted to explain to the court that a specific sentence had been provided in the plea agreement, which would be binding once accepted by the court pursuant to Rule 11. The court responded, \"Well, I haven't accepted anything yet.\" The court proceeded with the remainder of the colloquy, took Ellis's plea, set a sentencing date, and ordered a presentence report.\n\nAt the outset of the April 17 sentencing hearing, the district court announced that it would not accept the plea agreement:\n\nI think I should tell you now, I'm not going to accept it. I've read the government's Sentencing Memorandum and the [probation officer's] recommendation. I can't accept it.\n\nThe presentence report had disclosed three prior juvenile adjudications and seven other arrests and charges for serious crimes. It also revealed that the FBI had developed a somewhat solid case against Ellis for premeditated murder, proof of which would support a first degree murder charge. This evidence included a wire-tapped conversation with an informant in which Ellis admitted the planning and murder of the taxicab driver. The United States Probation Officer recommended 151 months' incarceration, the maximum sentence for second degree murder under the Sentencing Guidelines. The Officer acknowledged that if the court were to impose 151 months' custody, Ellis would be allowed to withdraw from the plea agreement, but felt that \"given the circumstances of this case\" he could recommend no less.\n\nThe district court allowed argument, during which the government urged it to accept the plea agreement. The government specifically noted that the victim's family supported the plea agreement and that it was concerned about the evidence available to prove beyond a reasonable doubt the elements of the first degree charge.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The court nevertheless concluded:\n\nI have read the government's Sentencing Memorandum, together with the Defendant's Sentencing Memorandum, and I have listened to the government and the Defendant. I must tell you, justice in my opinion hasn't been done in this case, the way it stands now. I think the matter should go to a jury. I think the matter should go to a jury, period. So the ball is back in the government's court.\n\nThe court immediately arraigned Ellis on the still pending first degree murder indictment.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Ellis pleaded \"not guilty\" to that charge, and the court set the date for jury trial.\n\nEllis then moved to compel the district court to afford him the opportunity to withdraw his second degree murder guilty plea or to allow him to persist in that plea, citing former Rule 11(e)(4) and United States v. Hyde, 520 U.S. 670 (1997). He asserted his absolute right to persist in that plea and indicated his intent to do so. In response, the government indicated it remained \"willing to proceed with the second degree murder disposition.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAttempting to glean from the transcript of the hearing on Ellis's motion an understanding of what actually transpired next is a bit like peering into an ever-shifting kaleidoscope. The district court first treated the government's position that Ellis had the right to persist in his guilty plea as a \"motion to ask the court to reconsider the court's denial of the plea in this case.\" The court denied that motion. Next, asking the government attorney \"do you represent the defendant,\" the district court refused to follow the government's suggestion to inquire of Ellis whether, if given the opportunity, he would persist in his plea of guilty, stating:\n\n[W]hat we know now from the record is this court has rejected the defendant's attempt to plea.\n\nThe district court next refused to hear argument on Ellis's motion (the very reason for the hearing in the first place), stating:\n\nI assume your motion, then, is as to . . . rejection of the plea agreement. . . . It is the court's position, and the record reflects, that I never intended to accept the plea agreement in this case, nor did I accept the plea in this case.\n\nAs far as this court is concerned, the question of the rejection of the plea agreement is not an issue. I never accepted it.\n\nIn a last-ditch effort to salvage the proceedings, the Assistant United States Attorney (\"AUSA\") asked the court to \"put aside what occurred on December 8 [entry of the plea] and to start anew\" by allowing the parties to enter into a new plea agreement pursuant to Rule 11 under which Ellis would plead guilty anew to second degree murder charges. In response, the district court stated:\n\nYour offer, the defendant and defendant's counsel, for this court to proceed in any way under any circumstances in any plea agreements or any pleas is rejected and denied by this court.\n\nNor would the court allow defense counsel to state for the record whether Ellis desired to enter the new plea pursuant to the newly proposed plea agreement or to allow the parties to file the new plea agreement.\n\nWith his only alternative being proceeding to trial on a first degree murder charge - a case even the government no longer desired to charge and was not sure it could prove - Ellis filed this petition for writ of mandamus, which the government did not oppose. Respondent, the district court, opposed the petition, asserting that it had never accepted Ellis's guilty plea because it did not find a factual basis for the second degree murder charge. A three-judge panel concluded that (i) Ellis in fact had entered a plea of guilty to second degree murder, and (ii) the district court had vacated the guilty plea upon rejecting the plea agreement. It held this procedure to be proper under Rule 11. See Ellis v. United States Dist. Court (In re Ellis), 294 F.3d 1094, 1099-1100 (9th Cir. 2002), withdrawn, 313 F.3d 1094 (9th Cir. 2002).\n\nII. Rejection of the Plea Agreement.\n\nWhen the district court rejected the plea agreement, having previously accepted Ellis's plea, a number of options became available. The option the district court chose - injecting itself into the charging decision by vacating the plea and requiring Ellis to plead to higher charges - was not one of them.\n\nA. Acceptance of the second degree guilty plea.\n\nThere can be no dispute that the district court accepted Ellis's guilty plea to second degree murder and deferred acceptance of the plea agreement. At the plea colloquy, the district court made the necessary Rule 11 inquiries and took Ellis's plea:\n\nTHE COURT: Mr. Ellis, what is your plea, guilty or not guilty?\n\nTHE DEFENDANT: I plead guilty, Your Honor.\n\nTHE COURT: Okay. I find that you knowingly and intelligently waived your rights to have this matter presented to a Grand Jury. And you know your rights to a jury trial. And you know your rights to appeal. You know the maximum possible punishment.\n\nTHE COURT: What is the sentencing date?\n\nMADAM CLERK: March 16th, 2001.\n\nTHE COURT: March 16th, 2001.\n\nMADAM CLERK: 9:30.\n\nTHE COURT: 9:30 a.m. or as soon thereafter as the Court may be heard. And there will be a presentence report by a probation officer.\n\nThe Criminal Minutes of the December 8, 2000 proceedings accurately reflect that Ellis entered a guilty plea to the Superseding Information that day, and that the plea agreement was filed:\n\nProceedings: PLEA TO SS INFO:\n\nCourt signs WAIVER OF INDICT. Def sworn, ent plea of GUILTY to SS info. Sent set for 3/16/01 at 9:30. Plea agreement filed. File UNSEALED\n\nAt sentencing, which had been continued to April 17, 2001, the district court indicated that it had reviewed the Ellis presentence report, which it would not have been entitled to do, absent Ellis's written consent, unless Ellis's plea had been accepted. Rule 32 provides that\n\n[u]nless the defendant has consented in writing, the probation officer must not submit a presentence report to the court or disclose its contents to anyone until the defendant has pleaded guilty or nolo contendere, or has been found guilty.\n\nFed. R. Crim. P. 32(e)(1).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Disclosure of the presentence report \"to the judge who will pronounce the defendant's guilt or innocence or who will preside over a jury trial would seriously contravene [Rule 32's] purpose of preventing possible prejudice from premature submission of the presentence report.\" Gregg v. United States, 394 U.S. 489, 492 (1969); see also United States v. Cordova-Perez, 65 F.3d 1552, 1555 (9th Cir. 1995); United States v. Park, 521 F.2d 1381, 1382-83 (9th Cir. 1975) (per curiam) (holding that violation of Rule 32 compels reversal).\n\nOur conclusion that the district court accepted Ellis's guilty plea on December 8, 2000, accords with that of the threejudge panel that previously reviewed the record. That panel also found that Ellis's guilty plea to second degree murder had been accepted.\n\n[1] Respondent maintains that because it did not explicitly make a factual basis determination on the record during the plea colloquy pursuant to Rule 11(b)(3), the plea itself was not accepted. Rule 11(b)(3) \"requires the court to explore the factual basis in order to determine the accuracy of the plea\" but \"prescribes no specific method\" for doing so. United States v. Rivera-Ramirez, 715 F.2d 453, 457 (9th Cir. 1983) (construing former Rule 11(f)'s factual basis requirement). There is no requirement of an express finding of a factual basis during the plea colloquy, in contrast to the requirements of Rule 11(b)(1). Rather, \"it must be established on the record that there is sufficient evidence to support the conclusion that the defendant is guilty,\" id., and the court must make the determination \"[b]efore entering judgment.\" Fed. R. Crim. P. 11(b)(3). The plain language of this subdivision does not speak to acceptance of the plea.\n\nIn any event, reviewing the plea colloquy de novo, see United States v. Gaither, 245 F.3d 1064, 1068 (9th Cir. 2001), we have no doubt that a factual basis supported Ellis's plea, and conclude that the district court implicitly so found at the time. During the plea colloquy the court asked the AUSA to \"make a factual recitation to the Court\" and instructed Ellis to \"listen real closely.\" The AUSA then recited the stipulated statement of facts from the plea agreement, which provided the factual basis for the plea. The court next explored at length the factual statement, asking Ellis, among other things, whether he \"d[id] those things\" of his own free and voluntary will. The court requested a copy of the plea agreement and asked Ellis to review the stipulated statement of facts, instructing him to read the precise statement again. After Ellis read the specified paragraphs, the court asked, \"Do you hereby accept and agree that it's your statement here today?\" to which Ellis responded, \"Yes, your Honor, I do.\"\n\n[2] The stipulated statement of facts, in which Ellis admitted he was the sole passenger in Mr. Barker's taxicab and killed him \"with malice aforethought\" by shooting him three times in the head, is ample evidence of Ellis's guilt. The district court did everything required of it under our precedent. Indeed, immediately upon completion of its examination of Ellis concerning his admissions in the statement of facts, the court asked, \"Mr. Ellis, what is your plea, guilty or not guilty?\" The conclusion is inescapable that the district court implicitly found a factual basis and then proceeded toward acceptance of the plea.\n\n[3] We reject the pre-Hyde view espoused in cases such as Cordova-Perez, 65 F.3d at 1555, that an acceptance of a guilty plea is \"impliedly contingent\" on the district court's review of the presentence report. In Cordova-Perez, as here, the defendant pleaded guilty to lesser charges in a separate information and, in a change of plea hearing, the court accepted the guilty plea, ordered a presentence report, and set the sentencing date. Following review of the presentence report, the court concluded that the terms of the agreement inadequately reflected the seriousness of the actual offense conduct and was contrary to the public interest. It then did exactly what the district court did here - it rejected the plea agreement, reinstated the original indictment and set the matter for trial.\n\n[4] Reasoning that \"[t]he plea agreement and the plea are 'inextricably bound up together' such that deferment of the decision whether to accept the plea agreement carried with it postponement of the decision whether to accept the plea,\" we held that by \"necessary implication\" the acceptance of the guilty plea was contingent upon acceptance of the plea agreement. Id. at 1556. Because the Supreme Court expressly rejected this rationale in Hyde, 520 U.S. at 677-78, CordovaPerez is no longer good law.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nB. Rejection of the plea agreement.\n\n[5] Although it accepted Ellis's guilty plea, the district court remained free to reject the plea agreement, including the provision for a 132-month sentence. The plain text of Rule 11 compels distinct treatment of the plea agreement and the plea itself, as the Supreme Court concluded in Hyde, 520 U.S. at 674.\n\nWhile it is true that the precise rule examined in Hyde was former Rule 32(e), the Court's holding was predicated on its analysis of Rule 11, as the \"principal provision in the Federal Rules of Criminal Procedure dealing with the subject of guilty pleas and plea agreements.\" Id. at 673-74. Hyde, like Ellis, had pleaded guilty pursuant to a plea agreement. The district court accepted the plea, but deferred decision on the plea agreement. We relied on the \"inextricably bound\" rationale of Cordova-Perez to conclude that if the court defers acceptance of the plea agreement, the defendant could withdraw his plea \"for any reason or for no reason,\" United States v. Hyde, 82 F.3d 319, 321 (9th Cir. 1996), rev'd, 520 U.S. 670 (1997), until both the plea and the agreement are accepted.\n\nThe Supreme Court rejected our equation of \"acceptance of the guilty plea with acceptance of the plea agreement, and deferral of the plea agreement with deferral of the guilty plea\":\n\nNothing in the text of Rule 11 supports these conclusions. In fact, the text shows that the opposite is true: Guilty pleas can be accepted while plea agreements are deferred, and the acceptance of the two can be separated in time.\n\nHyde, 520 U.S. at 674.\n\nOnce the district court rejects a plea agreement, Rule 11 sets forth the procedure that the court must follow. As the Hyde Court recognized, \"[i]f the court had decided to reject the plea agreement, it would have turned to [former] subdivision (e)(4) of Rule 11.\" Id. at 675.\n\n[6] It is worth stepping back to examine the structure of Rule 11 as an aid to understanding its orderly application to the plea and plea agreement procedures. The process entails entering a plea, governed by subsection (a). Next, as set forth in subsection (b), there exist certain prerequisites with which the court must comply during the process of considering and accepting a plea of guilty or nolo contendere. Rule 11(c) \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e then describes the procedures governing plea agreements, including the procedure for reaching a plea agreement, the types of agreements that the government may make\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and disclosure of the agreement. Most important, for our purposes, are the provisions contained in subsections (c)(3)(A) and (c)(5). The former provides that when considering a Rule 11(c)(1)(A) or (C) type plea agreement, the court has three options: it may \"accept the agreement, reject it, or defer a decision until the court has reviewed the presentence report.\" Fed. R. Crim. P. 11(c)(3)(A). If, however, the court rejects a Rule 11(c)(1)(A) or (C) plea agreement, Rule 11(c)(5) dictates the procedures to be followed:\n\n[T]he court must do the following on the record and in open court (or, for good cause, in camera):\n\n(A) inform the parties that the court rejects the plea agreement;\n\n(B) advise the defendant personally that the court is not required to follow the plea agreement and give the defendant an opportunity to withdraw the plea; and\n\n(C) advise the defendant personally that if the plea is not withdrawn, the court may dispose of the case less favorably toward the defendant than the plea agreement contemplated.\n\nFed. R. Crim. P. 11(c)(5). Rule 11 thus contemplates that the district court's rejection of a plea agreement allows the defendant, not the court, to make the next decision with respect to the status of the plea - i.e., whether to withdraw the plea and proceed to trial, or persist in the plea and risk a more severe sentence under the Sentencing Guidelines.\n\n[7] \"Plea agreements are contractual by nature and are measured by contract law standards.\" United States v. FrancoLopez, 312 F.3d 984, 989 (9th Cir. 2002). The Rules of Criminal Procedure\n\nexplicitly envision a situation in which the defendant performs his side of the bargain (the guilty plea) before the Government is required to perform its side . . . . If the court accepts the agreement and thus the Government's promised performance, then the contemplated agreement is complete and the defendant gets the benefit of his bargain. But if the court rejects the Government's promised performance, then the [plea] agreement is terminated and the defendant has the right to back out of his promised performance (the guilty plea), just as a binding contractual duty may be extinguished by the nonoccurrence of a condition subsequent.\n\nHyde, 520 U.S. at 677-78.\n\n[8] Consistent with these contractual principles, Rule 11 states that upon rejection of the plea agreement, the defendant may withdraw his plea. The only course available for the district court, upon rejecting the plea agreement, is to advise the defendant of his rights, including the right to withdraw the guilty plea. See United States v. Reyes, 313 F.3d 1152, 1156 (9th Cir. 2002) (\"[T]he options for the district court were either to accept the plea agreements and sentence the defendants accordingly or to reject the agreements and allow the defendants to withdraw their pleas.\"); United States v. Fernandez, 960 F.2d 771, 773 (9th Cir. 1992) (holding that the \"district court erred by failing to either accept the plea agreement and sentence [the defendant] accordingly or to reject the plea agreement and allow [him] to withdraw his guilty plea\"). And should the defendant decide to maintain his plea of guilty, the court \"may dispose of the case less favorably toward the defendant than the plea agreement contemplated.\" Fed. R. Crim. P. 11(c)(5)(C); see also United States v. Serrano, 938 F.2d 1058, 1061 (9th Cir. 1991) (\"[I]f the district court accepted the sentence term, it must resentence [the defendant] in accordance with the plea agreement. . . . If, on the other hand, the court rejected the sentence term, it should have informed [the defendant] of its decision and afforded him an opportunity to withdraw his plea.\"); 5 Wayne R. LaFave et al., Criminal Procedure § 21.4(g) (1999) (recognizing that if district court imposes sentence higher than that contemplated in type (C) plea agreement, defendant must be given opportunity to withdraw plea).\n\nWhen his plea agreement was rejected, it became Ellis's choice whether to: (i) stand by his plea and face a sentence at the highest end of the applicable guidelines range (151 months) or an upward departure to as much as a life term; \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e (ii) withdraw his plea and attempt to renegotiate a new plea agreement without a stipulated sentence ceiling; or (iii) withdraw his plea and take his chances at trial on the first degree murder charge. Nowhere does Rule 11 provide that the district court may dictate this choice.\n\nThe Kleinfeld dissent asserts that in so holding we create a conflict with two cases from other circuits, each of which predates the Supreme Court's decision in Hyde where the Court clearly rejected the notion that the plea and the plea agreement were bound up together. See Hyde, 520 U.S. at 674. Both the Fifth Circuit's decision in United States v. Foy, 28 F.3d 464 (5th Cir. 1994), and the Tenth's in United States v. Carrigan, 778 F.2d 1454 (10th Cir. 1985), could not have taken Hyde's teachings into account, given that they predate that opinion. In any event, both are readily distinguishable.\n\nThe Foy court expressly declined to decide the issue that is before us, finding only that \"if the district court erred at all [with regard to its initial acceptance and later rejection of the plea] the error was not 'plain.' \" Foy, 28 F.3d at 471. Moreover, Foy explicitly acknowledged that the approach that we advance today is \"the better practice\" for district courts to follow when accepting pleas. Id.\n\nNor does our holding present a conflict with Carrigan. That, of course, would be impossible because in Carrigan, the defendant never entered and the district court never accepted a guilty plea. 778 F.2d at 1459. Thus, the Rule 11 provisions that we address here were not implicated in Carrigan.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAgain, the Kleinfeld dissent's persistence in seeing a conflict where none exists is a result of its refusal to distinguish the plea from the plea bargain. Nor does Carrigan's ratio decidendi, as described by the Kleinfeld dissent in support of a socalled \"conflict\" - that the \"ultimate effect of the dismissal of charges . . . under the plea bargain was to restrict the district court's ability to impose what it considered an appropriate sentence,\" id. at 1464, - present itself in this case. The district court here was free to, and in fact did, reject the proposed plea agreement because it did not believe the guidelines sentence supported by the negotiated charge was adequate to serve the public interest. Even if Ellis had persisted in his plea to the second degree charge, the district court's discretion to depart upward to a life sentence was unrestricted. Thus, under our analysis the court's sentencing function is unrestricted what is precluded is the court's participation in the plea negotiations themselves, see Rule 11(c)(1),\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and, as discussed below, the district court's intrusion into the function of the executive branch.\n\nC. Separation of powers.\n\n[9] While the district court did not violate Rule 11's proscription against participating in plea negotiations, it effectively and improperly inserted itself into the charging decision by vacating Ellis's plea and reinstating the first degree murder indictment. The procedures contemplated by Rule 11 guard against an intrusion of this nature into the separate powers of the executive branch. See United States v. Miller, 722 F.2d 562, 565 (9th Cir. 1983). As we explained in Miller:\n\nWhen a prosecutor selects a charge, he has made an executive choice. When a judge sentences a defendant, he has made a judicial choice. When a plea bargain is placed before a court, the necessary interplay between charging and sentencing decisions becomes manifest.\n\nId. at 564. The plea agreement placed before the district court here specified both a reduced charge and the sentence, thus implicating both judicial and executive decisionmaking.\n\n[10] The district court viewed the sentence resulting from Ellis's plea bargain as not in the best interest of society, given Ellis's criminal history and the circumstances of the offense charged. This was a judgment properly within the judicial function. It is also a function protected by Rule 11's provision for the rejection of a negotiated plea agreement when the court believes a sentence is too lenient or otherwise not in the public interest. Id. at 563 . But when the district court made the further decision that the second degree murder charge itself was too lenient, it intruded into the charging decision, a function \"generally within the prosecutor's exclusive domain.\" Id. at 565. Because the prosecutor represents the executive branch, the district court's reinstatement of the first degree murder charge over the government's objection disregarded the traditional requirement of separation of powers that the \"judiciary remain independent of executive affairs.\" Id. The district court's decision forced the government to prepare to try Ellis on a charge it did not want to bring, on evidence it considered problematic, and in a procedural posture questionable due to Ellis's prior juvenile status and transfer proceedings.\n\n[11] Rule 48 also recognizes the traditional balance between judicial and executive power by limiting the district court's supervisory powers over prosecutorial charging decisions. Under Rule 48, courts must grant leave to the government to dismiss an indictment, information, or complaint unless dismissal is \"clearly contrary to manifest public interest.\" Rinaldi v. United States, 434 U.S. 22, 30 (1977) (per curiam); United States v. Garcia-Valenzuela, 232 F.3d 1003, 1008 (9th Cir. 2000) (discussing the \"clearly contrary to manifest public interest\" standard). \"The decision to dismiss an indictment implicates concerns that the Executive is uniquely suited to evaluate, and a district court should be reluctant to deny its request.\" United States v. Gonzalez, 58 F.3d 459, 462 (9th Cir. 1995).\n\n[12] In Miller, we noted that \"[m]any of the policies underlying Rule 48 are equally applicable to judicial consideration of charge bargains.\" 722 F.2d at 566. \"[C]courts should be wary of second-guessing prosecutorial choices\" because \"[c]courts do not know which charges are best initiated at which time, which allocation of prosecutorial resources is most efficient, or the relative strengths of various cases and charges.\" Id. at 565; see also United States v. Ammidown, 497 F.2d 615, 622 (D.C. Cir. 1973) (\"In ordinary circumstances, the change in grading of an offense presents no question of the kind of action that is reserved for the judiciary.\"). By requiring the reinstatement of the first degree murder charge, the district court overstepped its judicial bounds.\n\nIII. Mandamus.\n\n[13] Mandamus is the appropriate remedy. The district court clearly erred in vacating Ellis's plea. Substantial prejudice would result to him, the government, and the judicial system by requiring all to proceed through trial on first degree murder charges before the district court's error could be remedied on direct appeal. We have authority to issue writs of mandamus under the All Writs Act, 28 U.S.C. § 1651, which provides that \"[t]he Supreme Court and all courts established by Act of Congress may issue all writs necessary or appropriate in aid of their respective jurisdictions and agreeable to the usages and principles of law.\"\n\nThe writ of mandamus is \"an extraordinary remedy that may be obtained only to confine an inferior court to a lawful exercise of its prescribed jurisdiction or to compel it to exercise its authority when it is its duty to do so.\" Cordoza v. Pac. States Steel Corp., 320 F.3d 989, 998 (9th Cir. 2003); see also Bauman v. United States Dist. Court, 557 F.2d 650, 654-55 (9th Cir. 1977) (identifying five factors for exercise of discretion to grant mandamus). Three of the five Bauman factors lack of alternative adequate means of redress, prejudice uncorrectable on appeal, and a clearly erroneous district court order - are present here, and weigh heavily in favor of granting the petition. See Cordoza, 320 F.3d at 998 (\"We address the [clear error] factor first, because the others are irrelevant if the district court's conclusions were legally correct.\"); Credit Suisse v. United States Dist. Court, 130 F.3d 1342, 1345-46 (9th Cir. 1997) (granting writ because district court's decision was not \"immediately reviewable,\" was prejudicial in a manner not correctable on appeal, and constituted clear error); In re Cement Antitrust Litig., 688 F.2d 1297, 1301 (9th Cir. 1982) (noting that first two Bauman factors, lack of adequate means of redress and uncorrectable prejudice, \"are designed to insure that mandamus, rather than some other form of relief, is the appropriate remedy\").\n\nThe uncorrectable prejudice arising from the district court's refusal to proceed on the second degree murder charge is evident from a consideration of the possible outcome of a trial on the first degree charge, were we to deny mandamus relief. If the jury acquitted the defendant, a result the government has determined is reasonably possible, Ellis would go free because he would not, under the district court's ruling, have pleaded guilty to the second degree charge, and could not be tried on that charge. See, e.g., Brown v. Ohio, 432 U.S. 161, 169 (1977) (\"[T]he Fifth Amendment forbids successive prosecution and cumulative punishment for a greater and lesser included offense.\"). Had the jury, instead, returned a verdict of guilt on the first degree charge, Ellis would have irreparably suffered the prejudice of the additional, and unnecessary, financial and emotional burden of having to stand trial. See Arizona v. Washington, 434 U.S. 497, 503-05 (1978).\n\nIV. Remand.\n\nEllis has requested that the case be assigned to a different judge on remand. We make two inquiries when deciding whether to reassign a case. \"First, we ask whether the district court has exhibited personal bias requiring recusal from a case.\" United Nat'l Ins. Co. v. R\u0026D Latex Corp., 242 F.3d 1102, 1118 (9th Cir. 2001) (citing United States v. Sears, Roebuck \u0026 Co., 785 F.2d 777, 779-80 (9th Cir. 1986)). Nothing in the record reflects such personal bias.\n\nSecond, in the absence of a showing of personal bias, we look to whether \"unusual circumstances\" warrant reassignment. Id. (citing Sears, Roebuck, 785 F.2d at 780). This inquiry focuses on three factors: \"(1) whether the original judge would reasonably be expected upon remand to have substantial difficulty in putting out of his or her mind previously expressed views or findings determined to be erroneous or based on evidence that must be rejected, (2) whether reassignment is advisable to preserve the appearance of justice, and (3) whether reassignment would entail waste and duplication out of proportion to any gain in preserving the appearance of fairness.\" Id. at 1118-19. Only one of the first two factors must be present to support reassignment. See United States v. Mikaelian, 168 F.3d 380, 388 (9th Cir. 1999).\n\nThe district judge has read the presentence report and has expressed strong views on its contents. Whether or not he would reasonably be expected to put out of his mind the information previously disclosed or the conclusions previously drawn, and without ourselves reaching any determination as to his ability to proceed impartially, to preserve the appearance of justice, and consistent with the purposes of Rule 32, we conclude reassignment is appropriate. See Gregg v. United States, 394 U.S. 489, 492 (1969) (noting that to allow submission of a presentence report \"to the judge who will . . . preside over a jury trial would seriously contravene . . . [Rule 32's] purpose of preventing possible prejudice from premature submission of the presentence report\"). Given the preliminary nature of the plea proceedings, the minimal potential for waste or duplication of judicial resources is outweighed by the need to proceed in a manner that preserves the appearance of justice. Therefore, on remand, the case shall be reassigned to a different district judge within the Western District of Washington.\n\nV. Conclusion.\n\nWe GRANT the petition for mandamus and REMAND to the Chief Judge of the Western District of Washington for further proceedings consistent with this opinion.\n\nKOZINSKI, Circuit Judge, concurring:\n\nI join Judge Wardlaw's excellent opinion in full and parts III, IV and V of Judge Trott's fine concurrence. I write separately to confess my befuddlement that we're not unanimous.\n\nI can't help scratching my head at my dissenting colleagues' dogged insistence that they've found a plausible way to reach the result they prefer. (Befuddlement and head-scratching often cause me to be melodramatic and use heated rhetoric, so delicate souls are cautioned to continue reading only under strict medical supervision.)\n\nWhile the dissent tries to swaddle the case in all sorts of meta-considerations about the titanic struggle between the judicial and executive branches over the soul of the criminal justice process, see, e.g., Kleinfeld Dissent at 1534, 1539-40, 1540, 1541, 1548, 1551, 1553, 1556-57, the question presented is narrow: Does a district court have sua sponte authority to vacate a previously entered and accepted guilty plea? The dissent points to nothing that confers such authority on district courts-not in the Federal Rules of Criminal Procedure, not anywhere else.\n\nYet, this is precisely the kind of authority one would expect to be granted expressly, if at all. A guilty plea is a singular event in the course of a criminal prosecution, quite different from routine matters such as the setting of a trial date or a briefing schedule. A guilty plea is an adjudication of guilt, a waiver of defendant's rights to a trial, to a jury, to stand mute and to have the prosecution prove its case beyond a reasonable doubt. See Kercheval v. United States, 274 U.S. 220, 223 (1927) (\"A plea of guilty differs in purpose and effect from a mere admission or an extra-judicial confession; it is itself a conviction. Like a verdict of a jury it is conclusive. More is not required; the court has nothing to do but give judgment and sentence.\"). Not surprisingly, the Federal Rules of Criminal Procedure devote considerable attention to the process, specifying how the plea is to be taken, when and under what circumstances it may be withdrawn and what use may be made of the various communications relating to pleas and plea bargains. Fed. R. Crim. P. 11. Conspicuously absent from these comprehensive procedures is anything authorizing the district court to vacate a properly accepted guilty plea without defendant's consent. See United States v. PartidaParra, 859 F.2d 629, 631-33 (9th Cir. 1988).\n\nThe dissent concedes this absence of express authority, but argues that we must infer such authority in order to harmonize Rule 11 with Rule 32 and United States Sentencing Commission Guidelines Manual § 6B1. The argument holds no water. The interplay between Rule 11 and Rule 32 leads to precisely the opposite result from that urged by the dissent. Rule 32 provides that the district court may not, absent defendant's written consent, review the presentence report before defendant has pleaded guilty (or nolo) or been convicted at trial. Fed. R. Crim. P. 32(e)(1). This means that, unless defendant agrees, the district court may not consider the contents of the report in deciding whether to accept the plea. Yet, if the district court reviews the presentence report and then vacates the plea based on information in the report, it will have done precisely what Rule 32(e)(1) prohibits-seen the presentence report of a defendant whose guilt has not yet been adjudicated. Based on this straight-forward logic, three circuits, including our own, have held that the district court may not vacate a guilty plea based on information in the presentence report. See Partida-Parra, 859 F.2d at 632-33; United States v. Cruz, 709 F.2d 111, 114-15 (1st Cir. 1983), overruled in irrelevant part by United States v. Santiago-Soto, 825 F.2d 616 (1st Cir. 1987); United States v. Blackwell, 694 F.2d 1325, 1339 (D.C. Cir. 1982). Far from supporting the dissent's argument, the interplay between Rules 11 and 32 sinks it.\n\nIn a paragraph unencumbered by citation of authority, the dissent offers three reasons we needn't worry about Rule 32's categorical prohibition. First, in the dissent's view, \"defendant's protection is not so absolute,\" because, if defendant chooses to withdraw his plea after the district court rejects the plea bargain, defendant will then be tried before a judge who has read the report. Kleinfeld Dissent at 1545. Nice try. That the judge may preside over a criminal trial after he has read the presentence report in circumstances authorized by the rule is no argument whatsoever for ignoring the rule's prohibition in circumstances where it is expressly applicable. That the rule treats the two situations differently calls on us to respect the distinction, not ignore it.\n\nThe dissent's other reasons are less persuasive still: \"Second, most criminal cases are tried to juries, and the jury does not see the presentence report. Third, if the judge feels that his ability to be impartial has been compromised by his knowledge of the presentence report, he must recuse himself.\" Id. at 1545. These so-called reasons run smack-dab into the Supreme Court's ruling in Gregg v. United States, 394 U.S. 489 (1969). The Court there said:\n\nRule 32 is explicit. It asserts that the \"report shall not be submitted to the court . . . unless the defendant has pleaded guilty or has been found guilty.\" This language clearly permits the preparation of a presentence report before guilty plea or conviction but it is equally clear that the report must not, under any circumstances, be \"submitted to the court\" before the defendant pleads guilty or is convicted. Submission of the report to the court before that point constitutes error of the clearest kind.\n\nMoreover, the rule must not be taken lightly. Presentence reports are documents which the rule does not make available to the defendant as a matter of right. There are no formal limitations on their contents, and they may rest on hearsay and contain information bearing no relation whatever to the crime with which the defendant is charged. To permit the ex parte introduction of this sort of material to the judge who will pronounce the defendant's guilt or innocence or who will preside over a jury trial would seriously contravene the rule's purpose of preventing possible prejudice from premature submission of the presentence report. No trial judge, therefore, should examine the report while the jury is deliberating since he may be called upon to give further instructions or answer inquiries from the jury, in which event there would be the possibility of prejudice which Rule 32 intended to avoid. Although the judge may have that information at his disposal in order to give a defendant a sentence suited to his particular character and potential for rehabilitation, there is no reason for him to see the document until the occasion to sentence arises, and under the rule he must not do so.\n\nId. at 491-92 (footnote omitted) (emphasis added). Gregg holds quite clearly that Rule 32's prohibition applies even when the case is tried to a jury and explains precisely why. Moreover, the Court emphasized that non-compliance with Rule 32 is \"error of the clearest kind,\" id. at 492; it did not rely, as does the dissent, on some nonspecific duty of the judge to recuse himself if he no longer feels impartial.\n\nNor does Guidelines Manual § 6B1 help the dissent. This is so for three independent reasons, each sufficient to refute the dissent's position. The dissent's Guidelines Manual argument goes like this: Section 6B1 directs district courts to withhold approval of charge bargains-plea bargains where the prosecution agrees to drop certain charges in exchange for defendant's guilty plea on other charges-unless \"the remaining charges adequately reflect the seriousness of the actual offense behavior,\" id., which the district judge might only know for sure after he reads the presentence report. But Rule 32 precludes the district court from seeing the report, unless defendant first pleads guilty. According to the dissent, this creates a catch-22: The judge must first accept a guilty plea in order to see the report (to satisfy Rule 32), but he then can't reject the charge bargain based on what he reads in the report (as instructed by Guidelines Manual § 6B1)-unless he can vacate the plea.\n\nThe first fallacy of this reasoning should be apparent from the text of Rule 32. As the dissent recognizes, accepting a guilty plea is not the only way the district court can see the presentence report; the court may also see it with defendant's written consent. Fed. R. Crim. P. 32(e)(1). Nothing precludes the court from withholding its approval of the plea, and the plea bargain, until it first sees the presentence report. Defendant has no right to have the plea accepted. Santobello v. New York, 404 U.S. 257, 262 (1971). If the district court insists on seeing the presentence report before accepting the plea, defendant can choose whether to agree in writing or have the court reject it outright. If defendant doesn't agree, the court can reject the plea and the plea bargain; if he agrees, the court can then satisfy Rules 11 and 32, as well as Guidelines Manual § 6B1. The district court can also insist that, as part of its recitation supporting the plea, the government disclose the nuts and bolts of its case. Based on this information, the district court can decide whether to accept the plea at once or defer it until after the presentence report is prepared. The short of it is that there's no conflict between these provisions, no catch-22 and no need to arrogate the power to vacate a plea that the dissent agitates for.\n\nBut even if there were a conflict between the Federal Rules of Criminal Procedure and Guidelines Manual § 6B1, the Rules of Criminal Procedure would trump. As the dissent grudgingly recognizes, section 6B1 is not a sentencing guideline; it is a free-standing policy statement. Only actual guidelines, and their applicable commentary and policy statements, are binding. See Stinson v. United States, 508 U.S. 36, 42-43 (1993); Williams v. United States, 503 U.S. 193, 201 (1992). Section 6B1 is in Chapter Six of the Guidelines Manual. That chapter is made up entirely of policy statements and their commentary; it contains no guidelines. While there is no case law dealing with the status of Chapter Six policy statements, no fewer than ten circuits, including our own, have held that the highly analogous policy statements in Chapter Seven (dealing with violations of probation and supervised release) were not guidelines and therefore were not binding. See United States v. Forrester, 19 F.3d 482, 484 (9th Cir. 1994), superseded by statute; United States v. Sparks, 19 F.3d 1099, 1101-02 \u0026 n.3 (6th Cir. 1994); United States v. Anderson, 15 F.3d 278, 283-84 (2d Cir. 1994); United States v. O'Neil, 11 F.3d 292, 301 n.11 (1st Cir. 1993); United States v. Levi, 2 F.3d 842, 845 (8th Cir. 1993); United States v. Hooker, 993 F.2d 898, 900-01 (D.C. Cir. 1993); United States v. Thompson, 976 F.2d 1380, 1381 (11th Cir. 1992) (per curiam); United States v. Headrick, 963 F.2d 777, 782 (5th Cir. 1992); United States v. Lee, 957 F.2d 770, 773 (10th Cir. 1992); United States v. Blackston, 940 F.2d 877, 893 (3d Cir. 1991); see also United States v. Cade, 279 F.3d 265, 270 n.2 (5th Cir. 2002) (\"We have held . . . that some policy statements are advisory only.\"). There is no plausible argument that Chapter Six policy statements are binding, and the dissent doesn't even try to make one. Because section 6B1 is hortatory, while Rules 11 and 32 are mandatory, any conflict between the rules and 6B1 would have to be resolved in favor of the rules.\n\nFinally, Guidelines Manual § 6B1 can't even be used as an aid to interpreting Rule 11 for the obvious reason that it came along many years after the rule, and was drafted by a wholly different body. Interpretation, to be worthy of the name, must be a sincere effort to ascertain the meaning that the drafters of the text were seeking to capture, not an expense-paid shopping-spree through the bazaar of all conceivable meanings, rummaging for the one we like best. Our inquiry is generally limited to the document's language though, on occasion, we do take a peek at drafting history and other such contemporaneous materials. Under no stretch of the imagination, however, can we figure out what the document means by looking at things said and written by a different entity many years later. To allow for this possibility would mean that Rule 11 would have had one meaning from 1974 to 1987, and then changed meanings abruptly upon adoption of Guidelines Manual § 6B1, as if by induction. Strict construction this ain't. The most one could say about the interplay between Rule 11 and Policy Statement 6B1 is that, when the Sentencing Commission drafted its Manual, it may not have focused on Rule 32 as interpreted by Gregg, and thus encouraged district courts to do something that's a bit awkward under the Rules of Criminal Procedure. Certainly, no one can claim with a straight face that Rules 11 and 32 were drafted to conform with the not-yet-in-existence Guidelines Manual § 6B1.\n\nIt is thus perfectly clear that section 6B1 cannot do the heavy lifting the dissent asks of it, first because it does not contradict Rules 11 and 32 and, even if it did, because it would have to yield to the logic of those provisions, which (for reasons already explained) precludes the district court from vacating a guilty plea based on a presentence report it was not authorized to see before approving the plea.\n\nIn the end, nothing is left of the dissent except strongly voiced policy preferences that judges, not prosecutors, have the final say in charge bargains. In explicating this view, the dissent unfairly impugns the prosecutor's courage and professionalism by insinuating he was too chicken or lazy to go to trial. Kleinfeld Dissent at 1556-57. The government's sentencing memorandum paints the very different picture of a realistic prosecutor, aware of the strengths and weaknesses of his own case and alive to the subtle nuances of a tragic and difficult situation:\n\nIn fact, there is much about the crime that is abhorrent. The victim, Donald Ray Barker, is the epitome of the unfortunate soul in the wrong place at the wrong time. As far as anyone knows, he did nothing more on March 5, 1999, than pick up the defendant as the last fare of his life. Minutes later, he was shot three times in the back of the head.\n\nOn the other hand, there is much about the defendant that also is fairly characterized as most unfortunate. At the time that he shot Mr. Barker, he was approximately 16-1/2 years old. He lived in an environment with minimal, if any, structure. For many years before the murder, he had had no meaningful contact with his father who lives in the East Coast. Moreover, he received virtually no supervision from his mother who, it appears, was aware of his drug use, and, indeed, aware of his possession of the handgun that was used in the shooting.\n\nNeither the defendant nor any of his associates attended school regularly and most didn't attend at all. Their days were indistinguishable, one from the next, and consisted primarily of sleeping, eating junk food, hanging out at one apartment or another, playing video games, using alcohol and drugs, engaging in sexual activities, and, perhaps most significantly, attempting to be \"tough\" or \"cool.\" Thus, for weeks before the shooting, the defendant carried in his jacket pocket, and proudly displayed to one and all, the handgun which his friend Deborah Galvan had purchased for him. To add to his \"mystique,\" the defendant repeatedly bragged about his criminal prowess, often claiming to have committed crimes for which he was not responsible.\n\nMurder is a heinous crime, and this one is, in many ways, particularly troubling. Even acknowledging this, however, there are logical reasons for the Court to accept the Plea Agreement in this instance and to sentence the defendant to the stipulated term of imprisonment agreed to by the parties. First, the defendant was quite young at the time of the offense and his criminal record before this act was limited to a single violent crime, a residential burglary committed approximately 1-1/2 years earlier. Many other second degree murder convictions involve defendants who are significantly older with substantially more serious criminal records. Thus, a sentence in the middle of the range is not unreasonable under the circumstances.\n\nSecond, the evidence is consistent with the crime of second degree murder. There are no eye witnesses to the actual shooting and no clear picture of what occurred inside the taxicab. Nor is there clear evidence that on the day of the shooting, the defendant was actually planning the criminal conduct.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Instead, witnesses recalled talking to the defendant during the day about a birthday party which they urged him to attend at a Lakewood house in the neighborhood from which the defendant and his mother had recently moved away. When the defendant eventually arrived at the party that night, his accounts of the shooting were quite varied. For example, he told one friend that he had panicked when he thought the driver had locked him in the taxicab. If believed, this explanation is arguably inconsistent with the concept of premeditation. On another occasion, the defendant claimed that he shot the taxicab driver after the driver had laughed at him. Perhaps all that can be said about the various accounts of the shooting is that they show a very mixed up youth, perhaps influenced by drugs.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThird, the defendant has demonstrated great remorse for his conduct. In the letter which he wrote to the Court, he stated in part, \"from the bottom of my heart I want to apologize to Mr. Barkers family for taking apart (sic) of their life.\" In the same letter, the defendant expressed hope that because he is still quite young, he may have the opportunity to turn his life around, avoid drugs, and get on the right track. Although the stipulated sentence would result in the defendant spending a number of years in prison, it gives him the opportunity to someday walk out and make something of his life.\n\nGov't Sentencing Mem. at 2-3 (No. CR99-5386).\n\nIn arguing the matter in open court, the Assistant United States Attorney shows, once again, what a Mensch he is:\n\nThe Plea Agreement, Your Honor, is one that was arrived at after considerable discussion between the defense and the United States. The interest of both parties was to arrive at a fair, just result. We recognize that the plea was a plea to second degree murder. We recognize that within the state system a plea to second degree murder would result in a sentence that approximates the sentence that is the subject of this Plea Agreement. Within the federal system the sentence that we have proposed in the Plea Agreement is above the guideline range for second degree murder without any adjustments. That range would be 97 to 121 months. This Plea Agreement calls for a sentence of 132 months. It is in the approximate middle of the range with the adjustment for vulnerable victim. The Plea Agreement takes into account the various circumstances and evidentiary matters that are present in the case. They're part of the fabric of this case. We have to accept that and work within those parameters in attempting to structure the Plea Agreement. And we've done so. Both sides have.\n\nThe Defendant has accepted responsibility for the crime. He's written the Court a moving letter, a letter that certainly appears to be a genuine statement of remorse, a genuine acknowledgment that he has committed the most serious of crimes. And that . . . he wishes that he could go back and undo it.\n\nHe was a 16-and-a-half year old young man at the time of the shooting. This Plea Agreement gives him some hope. The alternative, if the Court does not accept the plea, if the matter proceeds to trial and he's convicted, is a mandatory life sentence. The Court has no discretion. A mandatory life sentence, if the Court doesn't accept the plea.\n\nThe Plea Agreement brings some finality to this matter. The family of the victim has had to live with this uncertainty for more than two years because it has taken that extended period of time to work through the juvenile process in the federal court system. Not only have they had to live through that period of uncertainty, but they have had to exist in a state of unknowing frustration during the bulk of that time because the United States was not able to share with them much of the information as to what was going on. They were not able to attend court sessions. They were not able to know the basics about the Defendant and the charge against the Defendant. Now they have some certainty. We have met with them. We have reviewed the facts and circumstances with them. Some of them are here in Court today. And I believe that I can speak for them in saying that they too share the government's view that this Plea Agreement is under the circumstances fair and just in part because it brings finality to this matter.\n\nRep. Tr. at 4-6 (No. CR99-5386) (Apr. 17, 2001).\n\nThe dissent works hard to create the illusion that the presentence report brings to light all manner of telling details omitted by the plea agreement: \"About all the stipulation in the plea bargain resolved was that Ellis got a ride in the cab, and the driver turned up dead a few minutes later.\" Kleinfeld Dissent at 1551. This is far from the truth. The agreement states quite clearly that defendant shot and killed the victim: \"The defendant, who was the sole passenger in Mr. Barker's taxi cab at the time of the shooting, did, with malice aforethought, unlawfully kill Donald Ray Barker by shooting him three times in the back of the head with a firearm.\" Presentence Rep. at 4 (No. CR99-05386JET-001) (quoting Plea Agreement). Thus, the plea agreement discloses all of the observable facts that would support either first- or seconddegree murder-in particular that defendant killed victim by shooting him in the head. Most of what the dissent culls from the presentence report, though inflammatory, proves nothing more than what defendant already confessed to. The facts that matter, the facts that differentiate first- from second-degree murder, are those bearing on defendant's mens rea-whether he deliberated about the killing before pulling the trigger, or acted from impulse or intoxication. On that point, the presentence report discloses nothing conclusive. See pages 1513-14 infra.\n\nThe dissent ruminates that \"[s]ometimes a lawyer offers a good deal because crucial evidence (or a crucial witness) disappears. The prosecutor has never suggested that anything like that happened in this case.\" Kleinfeld Dissent at 1557. But surely a prosecutor need not lose a key witness in order to doubt whether he can prove his case to the satisfaction of a jury. The prosecutor here repeatedly alluded to the problems he would face in proving premeditation and deliberation. In his sentencing memorandum, quoted above, the prosecutor states: \"There are no eye witnesses to the actual shooting and no clear picture of what occurred inside the taxicab. Nor is there clear evidence that on the day of the shooting, the defendant was actually planning the criminal conduct.\" Sentencing Mem. at 2-3 (footnote omitted). In his statement in open court, also quoted above, the prosecutor says: \"The Plea Agreement takes into account the various circumstances and evidentiary matters that are present in the case. They're part of the fabric of this case. We have to accept that and work within those parameters in attempting to structure the Plea Agreement.\" Rep. Tr. at 4 (Apr. 17, 2001). Later during the same hearing, the prosecutor expresses very clearly his concern about the strength of his evidence:\n\nWe have looked at a variety of cases in preparation for this hearing, and we understand the seriousness of this offense. We also are aware of certain evidentiary problems that exist. They are real. They won't go away.\n\nWe need to view the case, the entire mosaic of this process, in light of those evidentiary concerns, and we have done so.\n\nRep. Tr. at 4 (No. CR99-5386JET) (Apr. 27, 2001). And, again:\n\nWe don't disagree with the court. This is a heinous crime. We don't disagree with the court that under some view of the evidence, first degree murder could in fact be the appropriate finding of the trier of fact. But there are many other facts which the court and the trier of fact will ultimately have to hear, which may not support that ultimate conclusion.\n\nId. at 10-11. And yet again:\n\nWe also have the obligation to the public to evaluate the evidence and determine whether, in the final analysis, that result is reasonably certain, reasonably uncertain, or lies somewhere between those two extremes.\n\nWe have done that. Based upon that analysis, we have concluded that the second degree disposition is appropriate.\n\nId. at 11-12.\n\nThe dissent brushes aside these concerns, quoting selected portions of the presentence report. The point of this is unclear: No one claims the prosecutor had no evidence whatever of premeditation; he must have had some, else defendant would have had no incentive to cop a plea to second-degree murder. The question is whether the government's case was so openand-shut that the prosecutor must have been a coward or a laggard to accept a plea to a lesser charge, so the district court had to step in to prevent an injustice-as the dissent vehemently argues. It was not.\n\nThe dissent quotes with fanfare a taped conversation between defendant and one of his friends, where Ellis admits the killing and claims to have taken $2300, which he used to buy drugs. Kleinfeld Dissent at 1550. But the taped conversation is hardly conclusive of premeditation; defendant says nothing about planning the crime in advance. The part about robbing the victim appears to be a lie. The presentence report does not list robbery as part of the offense conduct, and the probation officer admits there is no proof of robbery: \"It should be noted that there is no evidence that [defendant] actually robbed, or attempted to rob the murdered victim. Therefore, the motive for the murder is known only to the defendant.\" Sentencing Rec. at 2.\n\nMoreover, the taped conversation is only one of several inconsistent accounts defendant gave as to why he committed the murder: He panicked when he thought the taxi driver had locked him in the cab; he shot the driver because the latter laughed at him. There is also solid evidence that defendant was a daily drug user, and was picked up by the cab outside a bar. At trial, the jury would have to decide, based on all this evidence, whether defendant committed the murder with deliberation and premeditation, as a result of an impulse or because of alcohol- or drug-induced diminished capacity. See Kane v. United States, 399 F.2d 730, 736 (9th Cir. 1968).\n\nLooking at the full texture of the evidence, considering the prosecution's heavy burden in a criminal case and taking into account the sympathy a jury might feel for defendant because of his youth and tough life, conviction of first-degree murder was far from a foregone conclusion, and voluntary manslaughter, if the jury believed defendant acted \"[u]pon a sudden quarrel or heat of passion,\" 18 U.S.C. § 1112(a), was a risk. Even an outright acquittal on grounds of self-defenseif the jury believed defendant's \"the-taxi-driver-locked-me-inthe-cab\" story-was at least a theoretical possibility. These are the kinds of considerations the prosecutor, who knew the strengths and weaknesses of his own case much better than the district court ever could, clearly took into account.\n\nFar from providing a vivid example of why judges need to have a veto over prosecutorial decisions to accept a guilty plea to a lesser charge, as the dissent argues, this is the poster case for why judges should probably not have that power. We have here a splendid example of cooperation between a meticulous and thoughtful prosecutor-a model of what prosecutors should be-and experienced and dedicated defense counsel. Working together, they forged an agreement that avoided the risk, delay and cost of a trial, comported with the wishes of the victim's family, and gave a troubled and misguided youth who committed this heinous crime when barely old enough to get a driver's license, the hope of salvaging a piece of his life.\n\nInto this carefully arranged glass menagerie burst the district judge with the force and finesse of a cannon ball. Armed only with information summarized in a few paragraphs of a report prepared by non-lawyers; having seen or heard none of the witnesses; having talked to no member of the victim's family; betraying no appreciation of the evidentiary objections and defenses that could be interposed to the prosecution's case, the judge forced the United States to go to trial on a crime it did not believe it should or could prove. As Judge Trott correctly observes, the district judge was \"defensive, inflexible, and intractable, not to mention uninformed and obdurate.\" Trott Concurrence at 1533. If this is what judicial supervision over charge bargains looks like, count me out.\n\nA final note about the dissent's policy argument. The dissent refers repeatedly to an alleged injustice in this case, Kleinfeld Dissent at 1535, 1548, 1551; it quotes the district court's statement that \"justice . . . hasn't been done in this case,\" and adds, emphatically, \"He was right.\" Id. at 1551. But what is this terrible injustice the dissent is complaining about? Putting aside the government's risk that it might not be able to prove first- or even second-degree murder, what exactly does the public gain by forcing an unwilling prosecutor and defendant to trial on first-degree murder?\n\nIf convicted of first-degree murder, defendant would be subject to a mandatory life sentence. 18 U.S.C. § 1111(b). The maximum sentence for second-degree murder is also life, though not mandatory, id., so it's subject to the Sentencing Guidelines regime. Yet, even under the Sentencing Guidelines, the district judge could consider un-charged conduct, see U.S.S.G. § 1B1.3, to wit, premeditation and deliberation, which need not even be proven beyond a reasonable doubt, see United States v. Johansson, 249 F.3d 848, 853-54 (9th Cir. 2001). If the district judge were to find that defendant acted with premeditation and deliberation, that would easily take the case out of the heartland of second-degree murder cases. In such circumstances, the Supreme Court has instructed that we must defer to departures by district judges, Koon v. United States, 518 U.S. 81, 98 (1996); if the judge here chose to give a life sentence as an exercise of his sentencing discretion, he would most likely be upheld. Thus, the only practical effect of the charge bargain is that defendant is spared the often harsh effects of a mandatory minimum life sentence for a crime he committed as a teenager.\n\nWhile reasonable minds differ on the merits of the Sentencing Guidelines, compare G. Thomas Eisele, The Sentencing Guidelines System? No. Sentencing Guidelines? Yes., 55 Fed. Probation 16, 16 (1991) (opposing Guidelines), with Andrew J. Kleinfeld, The Sentencing Guidelines Promote Truth and Justice, 55 Fed. Probation 16, 17 (1991) (\"I have sometimes felt compelled by the guidelines to impose a sentence which seemed much too long, and this has been a very painful event.\"), I am aware of no respectable support for mandatory minimums, and certainly none for mandatory life sentences for crimes committed by children. In fact, our most distinguished jurists and commentators have spoken out against the Procrustean regime of mandatory minimum sentences, and in favor of sentences that reflect the informed discretion of the trial judge. See, e.g., The Honorable Anthony M. Kennedy, Speech at the American Bar Association Annual Meeting (Aug. 9, 2003); Harris v. United States, 122 S. Ct. 2406, 2420 (2002) (Breyer, J., concurring in part and concurring in the judgment); Judicial Conference of the United States, Long Range Plan for the Federal Courts, at 60 (Dec. 1995) (expressing official position of federal judiciary that \"Congress should be encouraged not to prescribe mandatory minimum sentences\"); Stephen J. Schulhofer, Rethinking Mandatory Minimums, 28 Wake Forest L. Rev. 199 (1993). Can we really say that a grave injustice has been committed, that the public was denied its pound of flesh, because the district judge would have to exercise informed discretion before it could cast defendant into the slammer and throw away the key? My dissenting colleagues seem to think so, but I just don't get it.\n\nOf course, this is all beside the point because the Federal Rules of Criminal Procedure provide an easy means for district courts to do precisely what the dissent wishes them to do: They can refuse to accept a plea until and unless defendant consents in writing to the preparation of a presentence report, to be reviewed by the district court prior to acceptance of the plea. Moreover, if it really turns out to be a big problem that district courts lack authority to vacate guilty pleas, the Federal Rules of Criminal Procedure can be tweaked to give them such power. Since its adoption in 1944, Rule 11 has been amended in each of the following years: 1966, 1974, 1975, 1979, 1982, 1983, 1985, 1987, 1988, 1989, 1999 and 2002; Rule 32 has been amended even more frequently. The Sentencing Commission, too, can alter the process easily enough by changing the Chapter Six policy statements into guidelines. And, of course, Congress can always act to make the Chapter Six policy statements binding, as it did with respect to those in Chapter Seven. See Pub. L. No. 103-322, § 280001, 108 Stat. 1796, 2096 (1994); see also United States v. Plunkett, 94 F.3d 517, 519 (9th Cir. 1996). The dissent's cataclysmic predictions about a seismic shift of power from the judiciary to the executive branch are greatly overstated. This is a single mistake by a single judge in a single case, not the sacking of Rome by the Visigoths.\n\nBut there is a more fundamental issue here, one having to do with our own responsibility in interpreting and applying the law. Are we to be driven by our policy preferences to twist and bend the rules of construction in order to achieve the result that pleases us-and gives judges more power? Or are we to interpret rules and precedents according to neutral principles, following our policy preferences only where these principles do not yield a clear result? My understanding of judicial restraint is that we must do the latter, not the former, and if neutral application of the rule of law leads to a result we don't much like, we must trust the relevant political or administrative processes to make a change. I am sorry to learn that my dissenting colleagues' view as to the proper role of the judiciary differs so markedly from my own.\n\nTROTT, Circuit Judge, concurring in part and dissenting in part, with whom KOZINSKI, Circuit Judge, joins in parts III, IV, and V:\n\nI respectfully disagree with my colleagues' understanding of this case because I read the record differently than they do, starting with the first issue of whether the district court ever accepted Ellis's proffered plea of guilty. Judge Wardlaw, Judge Kozinski, and Judge Kleinfeld in dissent adopt as a premise for their conclusions the notion that the district court accepted Ellis's plea on December 8, 2000. Although the record is not free from arguable ambiguity on this issue, I disagree. The record does not demonstrate - implicitly or otherwise - that the district court ever accepted Ellis's plea to second degree murder. Thus, my colleagues see this case as involving what it takes to vacate a plea once that plea has been accepted. I do not, for two reasons. First, on this record I am not prepared to accept the proposition that a district court judge has misrepresented to us what he did; and second, and more importantly, that same record - read in the light of the governing rules and caselaw - does provide ample support for the judge's explanation and characterization of his actions. The record shows that the district court, confronted with a Rule 11(c)(1)(A) and (C) plea agreement containing a charge bargain as well as a sentencing agreement, did exactly what the law \"required.\" Rule 11(c)(3)(A) says,\n\nTo the extent the plea agreement is of the type specified in Rule 11(c)(1)(A) or (C), the court may accept the agreement, reject it, or defer a decision until the court has reviewed the presentence report.\n\nAs the Supreme Court noted in Hyde, 520 U.S. 670, 675 n.2 (1997), more than two years before Ellis's proffered plea,\n\nUnder the Sentencing Guidelines, a district court is required to defer its decision about whether to accept a type A or type C agreement until after it has reviewed the presentence report, unless the court believes that a presentence report is not required. United States Sentencing Commission, Guidelines Manual § 6B1.1(c) (Nov. 1995) (USSG).\n\nGranted, it would have been better practice for the district court to have said when Ellis offered his plea as part of the plea bargain that it was deferring acceptance of both the plea and the plea bargain until later, but it didn't. The court simply put the case over pending the preparation of a PSR; but deferral is not acceptance. United States v. Shaker, 279 F.3d 494 (7th Cir. 2002).\n\nI.\n\nJudge Wardlaw asserts that \"[t]here can be no dispute that the district court accepted Ellis's guilty plea to second degree murder and deferred acceptance of the plea agreement.\" No dispute? To begin with, the judge himself says that he never accepted Ellis's plea. He says so in his Response to the Petition for a Writ of Mandamus filed on December 12, 2002, and he said it definitively on April 17, 2000, in a hearing on this very issue in the district court.\n\nLet me begin with the judge's explanation in his Response of what happened on December 8, 2000, to Ellis's proffered plea, which was embedded in the Rule 11(e)(1)(A) and (C) plea agreement tendered to the court. In his Response, the judge categorically denies ever accepting the proffered plea.\n\nThe judge points out in this regard (1) that a defendant does not have a constitutional right to have his guilty plea accepted by the court, citing Lynch v. Overholser, 369 U.S. 705, 719 (1962) and North Carolina v. Alford, 400 U.S. 25, 38 at n.11(1970); (2) that a district court has discretion to accept or reject proffered pleas, citing United States v. Miller, 722 F.2d 562 (9th Cir. 1983); and (3) that he did not find that the plea was supported by a factual basis or say that he had accepted it, ever. What he did do on December 8, 2000, he represents, was to put everything regarding the plea agreement, which included the plea, over to April 17, 2001, when he would be in a position to decide - based on consideration of the PSR - whether (1) to accept the plea, and (2) to accept the plea agreement with respect to sentencing. In footnote #1 of his Response, he offers the PSR itself as an exhibit in support of his position, which he says he relied upon in rejecting both the plea and the sentencing agreement.\n\nTurning to April 17, 2001, and the cold record, the session opened with a statement by Ellis's counsel that \"the defendant has previously appeared before this court and entered a plea of guilty pursuant to a plea agreement. This is the time for sentencing.\" The court responded to counsel as follows: \"I think I should tell you now, I'm not going to accept it.\" \"It\" clearly means both the plea and the plea agreement of which, and I repeat, the plea to a lesser offense was an integral part. We find this meaning of \"it\" in the court's explanatory statement, \"I think the matter should go to a jury, period. So the ball is back in the government's court.\" At this point, both the plea and the sentencing agreement were dust, and Ellis's counsel immediately responded by saying, \"Your Honor, we are prepared to proceed. The court must arraign the defendant. He has not been arraigned on the indictment and that is step number one. Step number two, I believe is the trial.\" As requested by counsel, the court then arraigned Ellis on the charge in the indictment of first degree murder and set the matter for trial. Ellis's counsel said nothing about withdrawing his plea pursuant to Rule 11(e)(4). Why? Because he understood that the court had never accepted it.\n\nThis understanding of counsel's understanding becomes manifest ten days later on April 27, 2001, when counsel presented a new motion to the court pursuant to Rule 11(e)(4) in an attempt to resurrect for his client - with the support of the government - the benefit of the failed bargain:\n\nMR. WESTINGHOUSE: Your Honor, the court began the proceedings on April 17th with the statement, \"I think I should tell you now, I am not going to accept it. I have read the government's sentencing memorandum and the probation's recommendation, I can't accept it.\"\n\nThe court, I suspect, is saying that it did not accept the plea, as contrasted to saying it did not accept the plea agreement.\n\n(emphasis added).\n\nCounsel then argued from our unpublished holding in United States v. Nelson, No. 99-30368, 2001 WL 50701 (9th Cir. Jan. 18, 2001), that whether the court recognized it or not, he was stuck with the plea because the court's handling of the preliminary Rule 11 proceedings on December 8, 2000, was tantamount to accepting it. The court disagreed saying:\n\nTHE COURT: It is the court's position, and the record reflects, that I never intended to accept the plea agreement in this case, nor did I accept the plea in this case.\n\nAs far as this court is concerned, the question of the rejection of the plea agreement is not an issue. I never accepted it.\n\n(emphasis added).\n\nGiven the Supreme Court's statements in Hyde in 1997 (1) that a district court has discretion to accept a plea or not, and (2) that the court is required to defer a decision on a Rule 11 plea agreement until after reviewing the PSR, I do not understand how the majority can finesse this aspect of the record and claim there can be \"no dispute\" that the district court \"impliedly\" accepted Ellis's plea. Based on this flawed understanding of what happened, the majority then embark on an irrelevant inquiry: what it takes to unravel or to vacate a plea already accepted. Unfortunately, both Judge Kleinfeld, writing first for the panel and now in dissent, and Judge Kozinski make the same mistake.\n\nI see no grounds here to disregard what the district court said, either here or in the district court, with respect to how it treated Ellis's proffered plea of guilty. Counsel understood what the court was doing, and so did the government. Both disagreed with the court's decisions, but both understood: the plea as well as the plea agreement had not been accepted.\n\nWhen I say that the government understood that the court had refused to accept Ellis's plea, as contrasted with my colleagues' view that he first accepted and then rejected it, I need look no deeper than the government's response to Ellis's petition for a writ of mandamus. Here is what the government says:\n\nIt is the position of the United States that the district court erred in refusing to accept the defendant's guilty plea to murder in the second degree, and that . . . the district court should be directed to formally accept the defendant's guilty plea . . . .\n\n(emphasis added).\n\nLater in its brief, the government pointedly disagrees with Ellis's contention in his petition that the district court in fact accepted his guilty plea on December 8, 2000:\n\nThe United States disagrees with defendant's characterization of [the Rule 11] events. The district court made it abundantly clear during the sentencing proceeding and again during the defendant's motion to comply with Rule 11(e)(4) that it never intended to accept the guilty plea because it fundamentally disagreed with the proposed disposition.\n\nThe government goes on to argue not that the district court erred in rejecting the plea after having accepted it, but that the district court abused its discretion in refusing to accept the plea in the first place:\n\nIt is the position of the United States that the district court's discretion to accept or reject a guilty plea once the requirements of Rule 11 have been satisfied is quite narrow, and that under the circumstances presented in this case, the district court abused its limited discretion to reject the defendant's guilty plea.\n\nThe government then cites a whole host of cases limiting a district court's discretion in this area. In this regard, the government directs our attention primarily to United States v. Miller, 722 F.2d 562 (9th Cir. 1983) and the following langauge:\n\n. . . Charging decisions are generally with the prosecutor's exclusive domain. . . . Prosecutorsrepresentatives of the executive branch of the government-are not mere servants of the judiciary. The tradition of prosecutorial independence is recognized both by case law . . . and the Federal Rules of Criminal Procedure, see Fed.R.Crim.P. 48(a).\n\nAlthough courts are free to accept or reject individual charge bargains, they should avoid creating broad rules that limit traditional prosecutorial independence. Generally, courts should be wary of second-guessing prosecutorial choices.\n\nId. 722 F.2d at 565-66 (footnotes and internal citations omitted).\n\nWhy do we now say the district court did something it says it did not do? The court never said, as Ellis admits, \"I accept the plea,\" or, \"I find the defendant guilty,\" or even, \"I find as required by Rule 11(b)(3) that there is a factual basis for the plea.\" Ellis's attempt to brush this lacuna off as a simple failure by the court \"to utter the formula\" is unpersuasive. The court said it had not accepted the plea, period. When the court said so, neither the prosecution nor the defense argued that it had already accepted the plea. The defense said, okay, set the matter for trial. It was not until 10 days later that the defense claimed the court had accepted the plea without realizing it, a claim now disputed by the government. I'm afraid we have locked into an issue that is not presented by the record, and we seem intent on addressing that issue whether it is part of this case, or not. At no point did the court indicate it was vacating a plea already accepted.\n\nThe cases and the Federal Rules of Criminal Procedure make it clear that there are two basic and separate parts to the conversion of a plea of guilty into a judgment of guilty. The first step is for the defendant to enter his plea in compliance with the requirements of Rule 11. The second step is for the court to accept, or to reject, the plea. Confirmation of the need for the district court independently to accept the defendant's plea of guilty appears over and over in the Rule itself. Rule 11(b) is entitled \"Considering and Accepting a Guilty or Nolo Contendere Plea.\" Rule 11(b)(1) says, \"Before the court accepts a plea of guilty . . . .\" Rule 11(b)(2) repeats the same \"before accepting\" language; and Rule 11(b)(3) says, \"Before entering judgment on a guilty plea, the court must determine that there is a factual basis for the plea. Moreover, the Supreme Court said in Santabello v. New York, 404 U.S. 257, 262 (1971),\n\nThere is, of course, no absolute right to have a guilty plea accepted. Lynch v. Overholser, 369 U.S. 705 . . . (1962); Fed. Rule Crim. Proc. 11. A court may reject a plea in exercise of sound discretion.\n\nAn example of the application of this principle appears in Maxwell v. United States, 368 F.2d 735 (9th Cir. 1966) where a defendant indicted for first degree murder claimed a right to plead guilty to murder in the second degree. After discussing the matter with the defendant, the court rejected this attempt, and the jury returned a verdict of guilty of murder in the first degree. Maxwell's sentence was to imprisonment for life. He appealed, claiming he had a right to plead guilty to a lesser charge authorized by the statute under which he was charged. We disagreed with Maxwell's argument, and what we said, although probably in dicta, supports the district court's conduct in this case:\n\nIn our opinion the district court did not abuse its discretion in refusing to accept the plea of guilty. This is especially true since Maxwell did not offer to plead guilty to the crime charged - first degree murder - but to the lesser charge of second degree murder. Even if the Government had consented to accept a plea of guilty to a lesser charge, the court would still not have been obliged to accept it.\n\nId. at 739 (emphasis added).\n\nFootnote #3 in Maxwell is equally on point in connection with Ellis's mistaken assertion that the court found a factual basis for his plea:\n\n. . . We do not hold, however, that because Maxwell was unable to recollect the transaction and so could not personally vouch for his guilt, the trial court was obliged to reject his plea of guilty to second degree murder. The offer to plead guilty came at the close of the Government's case, when a factual basis for a plea of guilty to at least second degree murder had been established, or so the trial court might have found. Under these circumstances, the court, if it saw fit, could have accepted Maxwell's plea.\n\nIn this connection it may be noted that Rule 11, Federal Rules of Criminal Procedure has recently been amended to add, among other things, a sentence at the end reading: \"The court shall not enter a judgment upon a plea of guilty unless it is satisfied that there is a factual basis for the plea.\"\n\nId. at n.3.\n\nThis is precisely what the court identifies as a critical step he had not yet taken: find that there was a factual basis for the plea.\n\nIn addition, we have the Supreme Court's statement in Hyde that a court has discretion when it comes to whether or not to accept a plea. Id. 520 U.S. at 674.\n\nThe Seventh Circuit has approved the deferral by a court of the acceptance of a plea of guilty offered during a thorough Rule 11 proceeding until after the PSR is reviewed: \"In United States v. Ellison, 835 F.2d 687, 689-908 nn, 4-5 (7th Cir. 1987), . . . we explicitly encouraged district courts to defer acceptance of a guilty plea pending review of the PSR.\" United States v. Shaker, 279 F.3d 497:\n\nWe view a guilty plea as a process involving both the defendant and the district court, and culminating in the court's acceptance of the plea. The tenor of the Supreme Court's opinion in United States v. Hyde, 520 U.S. 670, 117 S.Ct. 1630, 137 L.Ed.2d 935 (1997), supports our understanding that acceptance is a crucial part of this process. See id. at 674, 117 S.Ct. 1630 (Rule 11 lists \"steps a district court must take '[b]efore accepting a plea of guilty,' and without which it 'shall not accept a plea of guilty.' Based on this language, we conclude that once the court has taken these steps, it may, in its discretion, accept a defendant's guilty plea.\").\n\nId.\n\nFinally, Sentencing Guideline § 6B1.1(c) (2000) states that a district court \"shall defer\" a decision to accept or reject a plea agreement pursuant to Rule 11(c)(1)(A) or (C) \"until there has been an opportunity to consider the presentence report.\"\n\nII.\n\nThe real mischief that might emerge from this case stems from Judge Kozinski's view that a district court somehow is precluded from reading the PSR before deciding whether to accept a defendant's Rule 11 plea. Judge Kozinski claims that\n\nRule 32 provides that the district court may not, absent defendant's written consent, review the presentence report before defendant has pleaded guilty (or nolo) or been convicted at trial. Fed. R. Crim. P. 32(e)(1). This means that, unless defendant agrees, the district court may not consider the contents of the report in deciding whether to accept the plea.\n\nWith all respect to Judge Kozinski, his view of Rule 32(e) as it applies to this Rule 11 case, is mistaken. First, Ellis did plead guilty. Therefore, it was perfectly appropriate for the court to have read the PSR. Second, the plea was part of a Rule 11(c)(1)(A) and (C) plea agreement which Ellis asked the court to approve. Rule 11(c)(3) says that \"[t]o the extent that the plea agreement is of the type specified in Rule 11(c)(1)(A) or (C), the court may accept the agreement, reject it, or defer a decision until the court has reviewed the presentence report. (emphasis added).\n\nWhat sense does it make to give a district court discretion to accept or to reject an offered plea of guilty but at the same time to tell the court, you cannot have access to the best source for rendering such a decision - the PSR - until after you make the decision to accept it. As Judge Kleinfeld recognizes, Rule 11(c)(1)(A) agreements are always charge bargains. Formal consent here is inapposite; consent is implied in the submission of the agreement to the court for approval and from the controlling rules of the Rule 11 process. Judge Kozinski's first-the-decision, then-the-evidence analysis is unconvincing, and thus, I conclude he is wrong in his Rule 32 claim. Once a defendant has done his part in a Rule 11 proceeding and entered a plea of guilty, it is pointless to tell a district court judge it is improper to look at the PSR, especially when looking at the PSR is called for under Rule 11(c)(3), and especially in a case like this where the plea is an unseverable part of a plea agreement which requires the court's approval. I repeat what I said earlier: Rule 11(c)(3)(A) says, \"[t]o the extent the plea agreement is of the type specified in Rule 11(c)(1)(A) or (C), the court may accept the agreement, reject it, or defer a decision until after the court has reviewed the presentence report.\" (emphasis added).\n\nIII.\n\nIn my view, the real question presented by Ellis's petition boils down to whether the district court abused its discretion in refusing to accept his plea, either (1) independently, or (2) pursuant to Rule 11(e)(4), which permits a defendant to persist in his plea in the face of a rejected plea agreement of which the plea is part. The law on this issue is clear: a district court is empowered with discretion to reject charge bargains that are part of Rule 11 plea bargains, but because this power \"implicates executive discretion with respect to charging decisions,\" a court must be hesitant \"before second-guessing prosecutorial choices.\" United States v. Robertson, 45 F.3d 1423, 1438 (10th Cir. 1995). As we said in United States v. Miller,\n\nGenerally, courts should be wary of second-guessing prosecutorial choices. Courts do not know which charges are best initiated at which time, United States v. Lovasco, 431 U.S. 783, 793-94, 97 S.Ct. 2044, 2050-51, 52 L.Ed.2d 752 (1977), which allocation of prosecutorial resources is most efficient, United States v. Ammidown, 497 F.2d 615 621 (D.C. Cir. 1973), or the relative strengths of various cases and charges. See Vorenberg, Decent Restraint of Prosecutorial Power, 94 Harv.L.Rev. 1521, 1547 (1981).\n\n722 F.2d at 565.\n\nAccordingly, we established a protocol a district court must follow in making a decision to reject a charge bargain:\n\n. . . Although the general rule governing plea bargaining grants courts broad discretion, Fed.R.Crim.P. 11, the specific rule governing prosecutorial charging decisions gives courts only a limited supervisory power over such decisions. Fed.R.Crim.P. 48(a). That rule requires courts to grant prosecutors leave to dismiss charges unless dismissal is \"clearly contrary to manifest public interest.\" Rinaldi v. United States, 434 U.S. 22, 30, 98 S.Ct. 81, 85, 54 L.Ed.2d 207 (1977) (per curiam). Many of the policies underlying Rule 48 are equally applicable to judicial consideration of charge bargains. Although Rule 48 antedates Rule 11, we should not refuse its guidance when we interpret the Federal Rules.\n\nTo assure that judicial discretion is exercised with due regard for prosecutorial independence, we hold that courts must review individually every charge bargain placed before them. They must set forth, on the record, both the prosecutor's reasons for framing the bargain as he did and the court's justification for rejecting the bargain. See United States v. Ammidown, 497 F.2d 615, 623 (D.C. Cir. 1973) (trial judge must state reasons on the record for rejecting plea bargain).\n\nBy requiring that rejection of a charge bargain be accompanied by a more complete trial court record, we uphold the separation of powers in two ways. First, we guarantee that the trial court is aware of and gives due deference to the prosecutorial choices reflected in a particular plea bargain. Second, we facilitate appellate review of rejected plea bargains. If the prosecutorial decisions reflected in specific charge bargains deserve broad deference, the discretion of the trial court to reject these bargains is fairly narrow. By requiring a more complete statement of the trial court's basis for rejecting a bargain, we make it possible to apply more careful appellate review.\n\n722 F.2d at 565-66.\n\nIV.\n\nSo now we get to the end game. Did the court fully comply with Miller in refusing, once the plea agreement was out of the way, to accept Ellis's plea to second degree murder, a plea urged by the prosecutor, and a plea with no sentencing strings attached? After reviewing the record and rereading Miller, I answer this question in the negative. All the court said was, \"justice in my opinion hasn't been done in this case.\" The court made no attempt to distinguish between the sentence agreement and the plea itself. Although the record, as arrayed by Judge Kleinfeld, might provide general support for the court's conclusion, and although the government admitted to the court that a first degree conviction might well be appropriate, the court failed to explain itself in a manner sufficient for us to review the decision in any meaningful way. The court's unelaborated \"opinion\" per se is not enough to resolve an issue that has its roots in the constitutional doctrine of separation of powers. I note here that both the government and Ellis's attorney pleaded with the court to make a record on this issue, but it refused to do so. Consequently, as we did in Miller, ordinarily I would remand this case to the district court from whence it came with orders to comply with Miller and to set forth on the record the reasons for its decision.\n\nV.\n\nOrdinarily, as I said, I would not hesitate to return a matter such as this to the same judge from whence it came. However, I have read and reread Judge Tanner's strong-arm responses to Ellis's counsel's entreaties during the post-plea agreement rejection proceedings and to the government's eloquent and well-grounded request to accept Ellis's proffered straight up plea to second-degree murder and to make an adequate record, and I find the court's responses - even when read in a light most favorable and respectful to the court - to be defensive, inflexible, and intractable, not to mention uninformed and obdurate. It is nothing short of ironic that Judge Tanner now relies on our opinion in Miller to justify his handling of the post-plea agreement rejection proceedings. Had he followed Miller in the first place, we probably would not be in this unfortunate hole, a hole that has unnecessarily delayed justice for more than two years. Therefore, recognizing that such a move will erase most of what we have been debating, I concur in the majority's decision to remand this case to a new judge for a fresh start. Justice and the rule of law so require.\n\nKLEINFELD, Circuit Judge, with whom Circuit Judge GOULD joins, dissenting:\n\nI agree with the majority's holding that the judge in this case accepted Ellis's plea. Where we differ is that I would hold that after reading the presentence report, a judge has the authority to strike the plea because he has rejected the plea bargain of which the plea to a lesser offense was an essential part. The Federal Rules of Criminal Procedure are silent on whether the judge can do so. The Sentencing Guidelines suggest that he can and must. For these reasons, and those elaborated below, I respectfully dissent.\n\nToday's decision marks a substantial shift from judicial to executive control over much of the criminal law process. Traditionally, plea bargains have been subject to judicial approval. Plea bargains include sentence bargains and charge bargains. In sentence bargains, the prosecution and defense agree both on a guilty plea to the initial charges and on a sentence or sentence recommendation. In charge bargains, the parties may agree on a guilty plea to new, lesser charges rather than the original charges. Both have customarily been subject to judicial approval. Today we have cut the judiciary out of the charge-bargaining process. In so doing, we have put ourselves in conflict with the Fifth Circuit decision of United States v. Foy,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and we have created a novel judicial gloss that requires judges to disregard one of the policy statements in the Sentencing Guidelines concerning the acceptance of a plea agreement.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nPlea bargaining has gone on for a long time and follows a well-established pattern. Often, pursuant to a plea agreement, the defendant pleads to lesser charges, and the judge orders a presentence report. Then, after the court pronounces judgment at the end of sentencing, the prosecutor moves in open court pursuant to Rule 48(a) to dismiss the original charges, and the judge grants the motion. The prosecutor may, but rarely does, file a Rule 48(a) motion earlier in the process to dismiss the original charges. More often, the prosecutor keeps the original indictment available in case the defendant backs out of the plea agreement.\n\nEllis was indicted for first-degree murder, but he entered into a charge bargain to plead guilty to second-degree murder. The judge accepted the plea and ordered a presentence report. But after reviewing the report, he determined that justice would not be served in this case if he accepted the charge bargain. The majority claims that allowing the judge to vacate Ellis's plea after the court has accepted the plea, but before the plea agreement had been accepted, usurps the prosecutor's power to make the charging decision. This is incorrect. The prosecutor retains charging power, should he choose to exercise it. If he believes he cannot prove the greater charge, or that it is excessive for any reason, he can file a Rule 48(a) motion to dismiss the first-degree murder indictment at any time. The district court's discretion to deny the motion to dismiss would be narrow (though extant).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The case would then proceed as though the grand jury had never indicted Ellis for first-degree murder.\n\nHere the prosecutor seeks the power without the responsibility. He never stepped up to the plate and moved to dismiss the first-degree murder indictment. Had the prosecutor chosen to take responsibility for prosecuting this killing (which appears in the presentence report to be a premeditated, coldblooded thrill killing) as nothing more than second-degree murder, he could have done so, by filing a motion under Rule 48(a) to dismiss the first-degree murder indictment. That way he would have avoided the judge's broad discretion to reject plea bargains and shifted the case over to the judge's very constricted discretion to reject Rule 48(a) dismissals. This case would have gone the way the prosecutor wanted in district court, and the way the majority opinion today makes it go, without gutting judicial control over charge bargaining. But the prosecutor did not make the Rule 48(a) motion. Because the grand jury indicted Ellis for first-degree murder and the charge was not dismissed, the district court had a responsibility to the public to assure that the grand jury's determination was not bargained away in a manner that disserved the public interest.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nRule 11(c)(1)(A) speaks to a charge bargain, part of the plea agreement made in this case. It says, \"If the defendant pleads guilty or nolo contendere to either a charged offense or a lesser or related offense, the plea agreement may specify that an attorney for the government (A) will not bring or will move to dismiss other charges.\" Rule 11(c)(5) speaks to what happens if the court rejects a plea of guilty to lesser or related charges. It says that if the court rejects a plea agreement containing provisions of the type specified in Rule 11(c)(1)(A) or (C), the court must do the following: inform the parties that the court rejects the plea agreement; advise the defendant personally that the court is not required to follow the plea agreement and give the defendant an opportunity to withdraw the plea; and advise the defendant personally that if the plea is not withdrawn the court may dispose of the case less favorably toward the defendant than the plea agreement contemplated.\n\nSeveral things are plain from these provisions. First, plea agreements include both charge bargains and sentence bargains. Rule 11(c)(1)(A) agreements are always charge bargains, because they are agreements that the government will not bring or will move to dismiss other charges, and the introductory language refers to plea agreements for pleading guilty to a lesser or related offense. Second, the court has the authority to reject such a charge bargain. Subsections (c)(1) and (c)(5) contemplate a situation where a judge accepts a plea and then subsequently rejects the charge bargain. But, under the majority's reading of Rule 11, a judge's authority to reject a plea agreement containing a charge bargain loses all practical meaning because he is unable to vacate a plea. Third, the defendant may withdraw his plea upon a court's rejection of a charge bargain.\n\nThe majority infers from the language stating that the court has to \"give the defendant an opportunity to withdraw his plea\" that his plea stands if he doesn't withdraw it. That is not a literal interpretation of the rule. It is an inference treating the express provision for the defendant to withdraw his plea as an implication that the court cannot strike his plea. The majority cannot construe Rule 11 literally to reach its result because the rule does not say one way or the other what to do with the plea if the defendant doesn't withdraw it, but the judge disapproves of the charge bargain. Neither the vigorous attacks in the majority nor the melodramatic rhetoric of Judge Kozinski's concurring opinion can substitute for words in the rule. The words are not there. Our task is to fill the gap left by silence in Rule 11.\n\nThough from a purely grammatical point of view, the inference the majority makes from Rule 11's silence is permissible, it is not compelling. In the overall context of Rule 11, Rule 32, and § 6B1.2 of the Sentencing Guidelines, the majority's inference of a negative pregnant is not reasonable. Reasonableness here is not a matter of wrenching the rule into a judicial policy preference. It is a matter of reading Rule 11 so that it is coherent and consistent with other rules and so that our interpretation is consistent with the better-reasoned views of our sister circuits.\n\nBoth the majority and we in the minority are interpreting a silence in the rules. There is language in the majority opinion suggesting that the rules command its result, and overheated rhetoric in Judge Kozinski's concurring opinion suggesting that no one but a fool could think otherwise. But in fact, the rules do not say whether a judge can strike a plea to a lesser charge made as part of a charge bargain that the judge, in his discretion, chooses to reject. Rule 11 says only that the defendant can withdraw his plea. We are disagreeing, with more heat than makes any sense to me, about whether there is a negative pregnant in that provision.\n\nThe Rule 11(d) limitations speak to when the defendant can withdraw a plea, not to when the court can strike it. Rule 11(c)(5) states what the defendant's rights are-that the court must \"give the defendant an opportunity to withdraw the plea\"-not what the court's authority is if the defendant does not exercise that right. Although this speaks to the defendant's rights, the majority infers that it restricts the court's authority to set aside the plea if the defendant does not withdraw the plea. Rather than draw this inference from silence in Rule 11(c)(5), it would be more reasonable to draw an inference as to judicial authority from the subsection that speaks to judicial authority, Rule 11(e).\n\nRule 11(e) controls \"Finality of a Guilty or Nolo Contendere Plea.\" Unlike Rule 11(c)(5), it speaks to both a defendant's rights and the court's authority. It says that a plea may be set aside \"only on direct appeal or collateral attack,\" but conditions this restriction to the time \"[a]fter the court imposes sentence.\" The condition in 11(e), \"[a]fter the court imposes sentence,\" implies that the court's authority to set aside the plea before the court imposes sentence is not so restricted. My inference, like the majority's, is from a silence, and like the majority's, reads a negative pregnant into the silence, but we differ in that I am looking at the subsection of the rule speaking to judicial authority and the majority is not. My inference, as is explained below, provides coherence and consistency with Rule 32 and the Sentencing Guidelines, requiring the district court to obtain a presentence report after taking the plea and to review the presentence report before accepting the plea agreement and settling upon a sentence.\n\nThose of us who have done criminal defense have long been familiar with courts striking pleas where charge bargains were rejected. Though initially it may be puzzling that the long-established practice is not reflected in the authorities, that is probably explained by the tremendous change in the legitimacy accorded to the plea bargaining process in the last thirty years. When many of us began practice, plea bargaining was done in the shadows and created awkward moments when the judge asked the defendant, \"Have you been promised anything in return for your plea?\" The Task Force on the Administration of Justice in the 1960's criticized, not plea bargaining itself, but the shadowy way in which it was done:\n\nFew practices in the system of criminal justice created a greater sense of unease and suspicion than the negotiated plea of guilty . . . . The system usually operates in an informal invisible manner. There is ordinarily no formal recognition that the defendant has been offered an inducement to plead guilty. Although the participants and frequently the judge know that negotiation is taking place, the prosecutor and defendant must ordinarily go through a courtroom ritual in which they deny that the guilty plea is the result of any threat or promise. As a result, there is no judicial review of the propriety of the bargain -no check on the amount of pressure put on the defendant to plead guilty. The judge, the public, and sometimes the defendant himself cannot know for certain who got what from whom in exchange for what. The process comes to look less rational, more subject to chance factors, to undue pressures, and sometimes to the hint of corruption.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe commission recommended bringing the plea bargaining process out into the open and assuring among other things that \"the prosecutor did not agree to an inadequate sentence for a serious offender.\"\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nGradually, Rule 11 and comparable state rule reforms implemented the recommendations of the commission, so what we have is a relatively new (as law goes) judicial recognition and supervision of plea bargaining, superimposed on a very old criminal-law system. What we run across in this case is an instance where the traditional and well-established practices of the courts operate in the context of silence in the rules, and our court has now decided to turn away from its prior precedent and from our sister circuits to interpret that silence in a way that reduces judicial authority to supervise the plea bargaining process.\n\nThe majority misreads Rule 11 as denying a judge the power to revisit acceptance of a plea to a lesser charge when, after reading the presentence report, the judge determines that the charge bargain contained in the plea agreement does not reflect the seriousness of the charged behavior. Rule 11 does not say that the district court is stuck with the plea to a lesser charge if the defendant elects. The majority infers this proposition because the rule says that the defendant is entitled to withdraw his plea and is silent about whether the judge can strike it if the defendant elects not to withdraw it. In so interpreting the silence in Rule 11, the majority impermissibly isolates Rule 11 from the context of the judge's role in the plea bargain process as governed by Rule 32 and the Sentencing Guidelines. Rule 11 is not the only rule; it is but part of a coherent set of rules. That's why it's called \"11.\" And Rule 32 and the Guidelines fill in the silence.\n\nThe majority holds that if the defendant chooses not to withdraw his plea to a lesser offense, the judge cannot reject his charge bargain.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Once the judge rejected the charge bargain, the majority claims that \"it became Ellis's choice\" whether to take a sentence limited to what the court had available for second-degree murder, or to withdraw his plea. First, this is an ipse dixit based on an inference from silence. The majority can cite to no prohibition on the judge's authority to vacate a plea. Second, this \"choice\" is inconsistent with § 6B1.2(a) of the Sentencing Guidelines which directs a judge to reject a charge bargain unless \"the remaining charges adequately reflect the seriousness of the actual offense behavior.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe majority's misreading of Rule 11 enables the parties to force the charge bargain down the judge's throat against the court's judgment. This misreading conflicts with the Sentencing Guidelines, and it makes no sense. Why have a judge independently review the charge bargain to assure that it adequately reflects the seriousness of the crime, if the judge is just a rubber stamp without the power to do anything if the deal is too lenient?\n\nRule 32 requires, generally, that a probation officer conduct a presentence investigation and submit a presentence report to the court.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e A report cannot be submitted to the court until the defendant has pleaded guilty or been found guilty, unless the defendant consents in writing.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Thus the judge cannot read the presentence report and learn about the details until after the plea has been accepted. Under § 6B1.2 of the Sentencing Guidelines, a court \"may accept the agreement [involving a charge bargain under Rule 11(c)(1)(A)] if the court determines, for reasons stated on the record, that the remaining charges adequately reflect the seriousness of the actual offense behavior.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The Commentary on that provision states: \"[W]hen the dismissal of charges or agreement not to pursue potential charges is contingent on acceptance of a plea agreement, the court's authority to adjudicate guilt and impose sentence is implicated, and the court is to determine whether or not dismissal of charges will undermine the sentencing guidelines.\"\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe Guidelines also recognize that the presentence report has to be obtained before the court can accept a plea agreement, which includes both charge and sentence bargains. Sentencing Guideline § 6B1.1(c) states that a court \"shall defer\" a decision to accept or reject a plea agreement pursuant to Rule 11(c)(1)(A) or 11(c)(1)(C) \"until there has been an opportunity to consider the presentence report.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The Commentary to § 6B1.1 explains that \"[s]ince a presentence report normally will be prepared, the court must defer acceptance of the plea agreement until the court has had an opportunity to consider the presentence report.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nIt is logically absurd, and unjust, to bind a court to a plea to lesser charges under Rule 11, in the face of the § 6B1.1(c) policy that the court's acceptance of the charge bargain not take place when the plea is accepted, and the § 6B1.2(a) requirement that the charge bargain be accepted only if the remaining charges adequately reflect the seriousness of the actual offense behavior. The public interest is put at risk, because the judge cannot, when the plea is taken, know enough to evaluate the charge bargain. Adequate knowledge requires the presentence report, which is why the Guidelines provide that the court has to defer decision until after reading the presentence report.\n\nJudge Kozinski would have us disregard these provisions of the Sentencing Guidelines because, as policy statements, they are arguably not binding. We need not decide whether § 6B1.2 is binding to use it as part of the context in which to construe Rule 11. Of course if it is binding, the majority's construction is impermissible.\n\nJudge Kozinski also appears to suggest, amidst all the heated rhetoric, that the district judge somehow violated Rule 32 by looking at the presentence report, and would have us lard up change of plea proceedings by requiring a defendant's consent to examine the presentence report where the court might reject a charge bargain after reading it. There is no problem needing a solution. The district judge complied with the Rule 32(e)1) requirement that the court not obtain the presentence report, in the absence of consent, \"until the defendant has pleaded guilty or nolo contendere.\" Ellis pleaded guilty to second-degree murder, and then the court obtained the presentence report and decided to set aside the plea because second-degree murder charge did not comprehend the vileness of the crime. Judge Kozinski, on policy grounds (drawn in part from cases preceding the Sentencing Guidelines and current policies on judicial evaluation of plea bargains) would have the judge remain blind to the facts and accept a pig in a poke until the plea could not be withdrawn. That argument runs contrary to 18 U.S.C. § 3553(a)(2)(A), which requires a judge to consider whether the sentence imposed reflects the seriousness of the offense, and § 6B1.2 of the Sentencing Guidelines, which directs a judge to defer acceptance of a plea agreement until after reviewing the presentence report.\n\nJudge Kozinski also suggests that if the district judge has doubts about a charge bargain, the judge should defer acceptance of the plea until reading the presentence report and condition going forward with the plea bargain on the defendant's consent to a presentence report in the absence of a plea. That may work when the judge knows enough to have doubts and the defendant's bargaining position is weak enough so that he consents. But ordinarily, at the time of the plea, the judge does not know anything but what the prosecutor and defendant disclose-not enough to know at that time whether to disapprove. That is why the Guidelines provide that the court has to defer decision until after reading the presentence report.\n\nJudge Kozinski bolsters his argument with the contention that striking a plea after reading the presentence report, and setting the case for trial, is inconsistent with the defendant's Rule 32 protection against the judge seeing the presentence report in a case that will go to trial. The argument errs for three reasons. First, the defendant's protection is not so absolute as Judge Kozinski suggests. If the court rejects an 11(c)(1)(C) agreement and the defendant withdraws his plea, the defendant ordinarily goes to trial before the judge who has read the presentence report, so there is no reason why the same result should not follow when the court rejects a charge bargain and strikes a guilty plea. Second, most criminal cases are tried to juries, and the jury does not see the presentence report. Third, if the judge feels that his ability to be impartial has been compromised by his knowledge of the presentence report, he must recuse himself.\n\nWe held in United States v. Cordova-Perez \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e that a judge has the authority that the majority takes away from him today. In that case, we held that a judge who had accepted a guilty plea to a lesser offense, and then, after reading the presentence report, decided that the plea agreement was too lenient, properly struck the plea and set the case for trial.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Obviously Cordova-Perez controls the case at bar unless it is overruled. The majority does not purport to overrule Cordova-Perez itself, but says that Cordova-Perez is \"no longer good law\" after United States v. Hyde,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e and suggests that under Hyde, Rule 11 is the only rule that matters to the outcome.\n\nHyde cannot carry the weight the majority gives it. True, it says we were mistaken in holding that acceptance of the plea and acceptance of the plea bargain were \"inextricably bound up together.\" But the Supreme Court said this in the context of rejecting our holding that a defendant could withdraw a plea \"for any reason or for no reason\" if the plea was entered pursuant to a plea bargain that the judge had not yet accepted.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nHyde held that we had mistakenly construed Rule 11 to enable a defendant to withdraw his plea \"simply on a lark\" up until the point when the court accepted the plea agreement.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Our mistake, the Court explained, was in not reconciling Rule 11 with the \"fair and just reason\" requirement in what is now Rule 11(d)(4).\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Today's majority makes a similar mistake in reading Rule 11 in isolation without reconciling it with Rule 32 and the Guidelines.\n\nThe better reading of Hyde is that it leaves intact the basic Cordova-Perez principle.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e This principle is that, while under Hyde the defendant is bound by his accepted plea, the court is not bound by it when it is part of a plea agreement that the court has not yet accepted (and cannot accept until the presentence report is submitted to the court). The district court in Hyde had not yet decided whether to approve the plea bargain when the defendant moved to withdraw his plea. Had the judge rejected the plea agreement, then, as the Court explained, the defendant would have been able to \"back out of his promised performance (the guilty plea), just as a binding contractual duty may be extinguished by the nonoccurrence of a condition subsequent.\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Guilty pleas both before and after the \"fair and just reason\" was added to what is now Rule 11(d) \"were [ ] already subject to this sort of condition subsequent.\"\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nThe majority takes Hyde's holding that a defendant's plea is not so bound up with the plea agreement that he can withdraw his plea \"on a lark\" and runs away with it. The majority treats Hyde as though it held that the plea and plea agreement are entirely independent, so that a prosecutor and defendant can hold the court to a defendant's plea to a lesser charge despite the court's disapproval of the plea bargain. That does not follow from Hyde. In fact, in Hyde, the Court noted that our Cordova-Perez statement that \" '[t]he plea agreement and the [guilty] plea are inextricably bound up together' . . . on its own, is not necessarily incorrect.\"\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nHyde does not overrule Cordova-Perez, and nothing in Hyde suggests that it does. The majority's decision today is inconsistent with Cordova-Perez. Instead of expressly overruling it and giving a justification for doing so, the majority misreads Hyde to say that the Supreme Court had done what it carefully avoided doing. The consequence is to take a decision that strengthened the district court's hand in plea bargaining, Hyde, and misread it as a decision that eliminated judicial control over one important kind of plea bargaining. The judge's proper and heretofore well-understood role in plea bargaining is as a neutral stranger to the agreement, not a party to it, whose task it is to make sure that the agreement adequately reflects the public interest in sufficient punishment for the crimes committed.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nEllis's plea to second-degree murder was part of the plea agreement, an exchange of a guilty plea to a lesser charge for dismissal of the greater charge in the indictment. As characterized in Hyde, the agreement was subject to a condition subsequent, judicial approval, which condition failed to materialize, terminating the agreement and extinguishing all duties thereunder. Thus Ellis was no longer bound to plead guilty to anything. The prosecution was no longer bound to recommend anything. And the court certainly should not have been bound. The court had before it an unresolved criminal case ready to be set for trial (which is what the court quite properly did).\n\nBecause the court could not approve the plea agreement until obtaining the presentence report and evaluating whether a second-degree murder conviction would \"adequately reflect the seriousness of the actual offense behavior,\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e yet the plea to a lesser offense is held to bind the court, the majority effectively deprives the court of the power to disapprove charge bargains. A judge's authority to reject a plea agreement with a charge bargain for a plea to a lesser offense is emptied of all meaning if the defendant and prosecutor can force the lesser charge on the court.\n\nThe facts of this case highlight the injustice that may be perpetrated on the public because the majority denies a judge the ability to vacate the plea after determining that the plea agreement is improper.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e In this case, the judge accepted Ellis's plea to second-degree murder, ordered a presentence report, and set a date for sentencing. The facts in the presentence report, which the judge properly relied upon in his evaluation of the plea agreement,\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e tell a story that the judge could not have known from the plea agreement.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nMarciano Ellis asked a high-school friend to come over to Ellis's mother's apartment to \"help him plan the robbery and killing of a cab driver.\" His friend came over, and Ellis showed off his new gun (which his older girlfriend had bought for him illegally). Although his friend wanted nothing to do with it, Ellis went ahead with the murder.\n\nOn the evening of March 5, 1999, Ellis called a taxicab from a payphone in front of a doughnut shop, and was picked up a few minutes later by Donald Ray Barker, a 46-year-old cabdriver. Ellis directed the taxi driver to take him to Fort Lewis, a nearby military reservation, and then shot Barker three times in the back of the head.\n\nAfter the murder, Ellis bragged about it to the friend he'd tried to enlist. He showed the friend the cab driver's taxi license card on a chain, and he told the friend that he stole $2,300 in cash, which he later used to buy drugs. The friend called the FBI, and agreed to wear a wire. The friend met with Ellis and asked him about the murder of the cab driver, and Ellis said \"Yeah, that was me.\" Ellis went on, in the recording, to explain in detail just how he had done it. A search of Ellis's home turned up a receipt for the murder weapon and a brass shell casing matching the ballistics of the bullets buried in the cabdriver's skull. The FBI later bought the gun for $1,000 from another hoodlum to whom it had been given, and it matched the brass in Ellis's home and the bullet in the taxi driver's skull.\n\nWith these facts before him, the judge plainly had reason to exercise his discretion and prevent this case from being \"pleaded down.\" About all the stipulation in the plea bargain resolved was that Ellis got a ride in the cab, and the driver turned up dead a few minutes later. The judge said, with respect to the second-degree murder charge, that \"justice in my opinion hasn't been done in this case.\"\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e He was right.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nJudges, not prosecutors, are supposed to decide whether to accept the terms of the plea agreement. The court cannot be a mere rubber stamp for contractual agreements between prosecutors and defense attorneys. Sometimes a neutral judge has to say \"No!\" to an injustice that would be perpetrated on the public by a plea bargain, as this judge did.\n\nIn United States v. Foy,\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e as here, the district court accepted a plea to a lesser charge, and then, after getting a presentence report, vacated the plea because of inadequacy of the plea agreement. On appeal, the Fifth Circuit held that it was not reversible error for a judge who had already accepted the defendant's guilty plea to reject the plea agreement after he reviewed the presentence report.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Like the judge here, the judge in Foy determined that \"the circumstances in the presentence investigation justified one heck of a lot more sentence than the maximum [under the plea agreement].\"\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The Fifth Circuit held that because § 6B1.1 of the Sentencing Guidelines requires a judge to defer acceptance of the plea agreement until after he reviews the presentence report, a plea accepted pursuant to a Rule 11 plea agreement is contingent upon that review.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nSimilarly, United States v. Carrigan \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e was a petition to the Tenth Circuit Court of Appeals for a writ of mandamus commanding a district court to accept a charge bargain. The government had charged a corporation and its employee with submitting false claims to the government, and the prosecutor agreed to settle a related civil action against the corporation, take a guilty plea from the corporation, and dismiss the charges against the employee. The district judge rejected the deal because \"every individual . . . connected with this fraud will walk free.\"\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Though Carrigan differs from this case in that the corporation had not yet entered a plea (the corporation refused to enter its plea unless the charges against its employee were dismissed), that difference was not material to the ratio decidendi of the issue of judicial authority to reject a charge bargain. As in the case at bar, the prosecution argued that executive discretion over charging required the court to accept the charge bargain. Following Fifth Circuit authority, the Tenth Circuit reasoned that limiting the judge's discretion to reject a charge bargain improperly limited judicial control over sentencing, and that Rule 48(a), governing dismissals, did not apply where the prosecution did not move for dismissal under Rule 48(a).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Moreover, since \"the authority to accept or reject a plea bargain agreement under [Rule 11(c)] is confined almost entirely to the trial court's discretion,\"\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e a litigant's claimed right to force the charge bargain on the court could not justify a writ of mandamus because it was not \" 'clear and indisputable.' \"\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nJudge Kozinski cites to another panel opinion of ours, and to cases from two other circuits, in his critique of this dissent. The citations are inapposite. The other panel opinion of ours, United States v. Partida-Parra,\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e holds that the rules \"cannot be read to authorize the court to vacate a plea on the basis of a discrepancy in the parties' understanding of the plea agreement,\"\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e where the government (not the court, as here) had moved to vacate the plea because the prosecutor who made the plea bargain should not have done so on the terms the defendant agreed to. That case does not speak to the court's authority to vacate a plea to ensure the adequacy of the plea agreement.\n\nThe First Circuit case, United States v. Cruz \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e is distinguishable in at least two respects. First, the court notes that \"the judge unqualifiedly accepted the plea bargain,\" \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e while here, the judge made it quite clear that he accepted the plea, because it was voluntary, the defendant was satisfactorily counseled, there was a basis in fact, and so forth, but that he was not yet prepared to accept the plea bargain. Second, Cruz came down in 1983, four years before the Sentencing Guidelines came into effect and established the policy that the court \"shall\" defer a decision on whether to accept a plea agreement \"until there has been an opportunity to consider the presentence report.\"\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nScrounging even further for authority, Judge Kozinski cites another pre-Guidelines case from the District of Columbia Circuit, United States v. Blackwell.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e In Blackwell, the court held that the district judge had erred by warning the codefendant (Blackwell's girlfriend who pleaded guilty and was not an appellant) that she could be prosecuted on the charges dismissed pursuant to her plea agreement if her testimony at Blackwell's trial established that she was guilty of them.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nBut, unlike the case here, the judge had accepted the plea bargain as well as the plea,\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e and, in any event, he did not rescind acceptance of either. Therefore, the question not only was distinguishable from the one in this case because the Guidelines did not yet exist, but also because the court did not strike the plea.\n\nThus, none of the cases cited in Judge Kozinski's concurring opinion contradict a reading of Rule 11 that allows a judge who has accepted a guilty plea, but not yet accepted the plea agreement, to vacate the plea upon rejection of the plea agreement. Only the Fifth Circuit, in Foy, addressed the same issue of how to interpret Rule 11's silence when a judge is presented with material in the presentence report that persuades him that he cannot accept the plea agreement after he has accepted the plea. And Foy resolved the issue as I think we should.\n\nBecause the judge did not err in vacating Ellis's plea, mandamus is unjustifiable in the case at bar. The district court acted in compliance with § 6B1.1(c) and followed our holding in Cordova-Perez. Not only was the judge's decision in Ellis's case not the sort of plain and irremediable error required for mandamus,\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e it was not error at all. Because today's opinion is novel, contrary to our previous precedent in Cordova-Perez, unsupported by the literal application of the rules and guidelines, and surprising in light of the established customs of plea bargaining and judicial acceptance, the case cannot possibly satisfy the Bauman factor that it be \"clearly erroneous.\"\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e It also does not satisfy the Bauman factor that the harm be not correctable on an appeal from a final judgment.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\n\nAs for assignment to a different district judge, the law of recusal is plain that a judge need not recuse himself because of what he has learned from judicial proceedings in the same case,\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e and no ground for bias is claimed except for what the district judge learned from this very case. That the district judge developed a plainly stated opinion that a second-degree murder charge did not \"adequately reflect the seriousness of the actual offense behavior\" is merely to say that he performed a judgment in accord with his duty, not that he is biased. Rule 11(d)(2)(A) expressly contemplates a case where a judge accepts a plea, reviews the presentence report, rejects the plea agreement, and the defendant withdraws his plea and goes to trial before the very same judge. There is no justification for taking this case away from the district judge to whom it was assigned.\n\nThere is a reason courts need to retain control over plea bargains. A court is not a mere market for guilty pleas and sentences, to be dispensed solely according to the market judgments of defense counsel and prosecutors. \"Plea bargaining is not a private contractual arrangement unaffected by the public interest. The public interest does not favor fictional minimization of crimes actually committed for purposes of sentencing. Under the guidelines, a strong judicial hand is necessary to protect the public interest.\"\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e The individual participants in a governmental process sometimes have individual interests and incentives that differ from the purported missions of their agencies. It is a myth that prosecutors and police are always overzealous. They may be overzealous, underzealous, or just-right zealous. For a good lawyer, a jury trial, though extremely exciting and punctuated with moments of great pleasure and satisfaction, is also tremendously stressful, time consuming, physically and mentally exhausting, and risky. One does not always feel up to a gunfight at the O.K. Corral, which is what a jury trial may feel like to a lawyer. Life is much easier, though duller, for prosecutors and defense attorneys, if cases can be bargained to a judgment without the need for a jury trial.\n\nWe simply cannot know why the prosecutor was so lenient in this case. Sometimes a lawyer offers a good deal because crucial evidence (or a crucial witness) disappears. The prosecutor has never suggested that anything like that happened in this case, but a prosecutor may be reluctant to disclose this information out of concern that a lenient plea bargain will have to become even more lenient. The likelihood of such things happening is why judges are restrained in rejecting plea agreements. But the reasons for prosecutorial leniency are not always this good. Sometimes prosecutors take lenient pleas to avoid the work and stress of trial. Though second-degree murder with a long sentence may look adequate to a prosecutor despite his having a plain and simple first-degree murder case, the public interest requires that judges retain final authority to approve or disapprove.\n\nBy depriving the judge of power to reject charge bargains that are inadequate in light of the seriousness of the crime committed, today's opinion deregulates the market between prosecutors and defendants. We cannot and should not allow this kind of market, which has the potential to set the value of innocent human life too low.\n\nGOULD, Circuit Judge, concurring in dissent:\n\nI join Judge Kleinfeld's excellent dissent. I write only to express disagreement with that part of my colleague Judge Kozinski's concurrence which I view as rhetoric unrelated to the substantive issue in contest. Judge Kozinski seeks to portray the dissenters as having a \"dogged insistence that they've found a plausible way to reach the result they prefer.\" With this I respectfully disagree. Whether the majority's reasoning or the dissent's reasoning is more plausible, let others in academia or in the courts decide. For myself, I venture that there is no \"result\" in this case that I \"prefer.\" More precisely, there is a serious dispute about the proper interpretation of Rule 11. In simple terms the majority applies one reasonable reading of Rule 11, that Rule 11 should be interpreted by implication to preclude a district court from striking a previously accepted plea after a plea agreement has been rejected; Judge Kleinfeld in his dissent, in which I concur, urges another reasonable reading, that Rule 11 should be interpreted by implication to permit the district court to reassess its initial acceptance of the plea in light of its later rejection of the plea agreement. While recognizing the many good and reasoned points enlisted by the majority in aid of its opinion, I have concluded that the dissent's interpretation is permissible and in my view more appropriate in light of prior precedent and the traditional role of an Article III judge presiding over a criminal case. A disagreement on this interpretation does not signal, as my colleague and good friend Judge Kozinski argues in his peroration, that Judge Kozinski applies \"neutral principles\" where the dissent would not. Despite their vigorous disagreement in this case, I do not discern significant differences in judicial philosophy between my colleagues Kozinski and Kleinfeld on the general approach to interpreting law and rules, just a disagreement on how to interpret Rule 11 in the particular context presented.\n\nThere is, as I see it, an important disagreement between the majority and dissent that cannot fully be put to rest unless clarification of Rule 11 is provided by the United States Supreme Court or by the amendment of the rule to be explicit on the point in contest. Following our study of the issues, judicial reasoning and arguments with \"thought and fire\"\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e can help us find the best statement of law to interpret the rule in dispute. But we should take care that the fire of argument not be so hot as to obscure thought.\n\n\u003cspan class=\"fn\"\u003e1. The current version of Rule 11 became effective on December 1, 2002, as part of a general restyling of the Federal Rules of Criminal Procedure \"to make them more easily understood and to make style and terminology consistent throughout the rules.\" Fed. R. Crim. P. 11 note. Although most changes were intended to be \"stylistic only,\" the changes to Rule 11(d) and (e) were made \"to more clearly spell out . . . the ability of the defendant to withdraw a plea.\" Id. The former version of Rule 32(e) considered in United States v. Hyde, 520 U.S. 670 (1997), governing withdrawal of pleas after acceptance of the plea agreement but before sentencing is currently codified as Rule 11(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The version of Rule 11 in effect at the time of Ellis's proceedings similarly required the district court, upon rejecting a plea agreement, to \"afford the defendant the opportunity to then withdraw the plea.\" Fed. R. Crim. P. 11(e)(4) (2001). For ease of reference, the current version of Rule 11 is cited throughout this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This type of plea agreement previously fell under Rule 11(e)(1)(A) and (C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The factual predicate in the plea agreement, as admitted under oath in open court by Ellis, is the sole set of facts upon which we are permitted to rely at this stage of the proceedings. The Kleinfeld dissent adduces other \"facts,\" derived from the probation officer's sentencing recommendation and the presentence report, which have never been proven, and which may not be provable beyond a reasonable doubt - one reason for the government's participation in, and continued support for, the plea agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We have jurisdiction because the crime occurred on United States military property. See 18 U.S.C. § 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The government's reasons for questioning its ability to secure a first degree murder conviction were manifest before and during the proceeding. In its Sentencing Memorandum urging the court to accept the plea agreement, the government cited several concerns about proving the element of premeditation required for first degree murder, including the lack of an eyewitness to the shooting and a statement from a witness who would testify that Ellis had claimed he shot Barker in a panic after he thought Barker had locked him in the taxicab. In addition, the probation officer's Sentencing Recommendation noted that reports that Ellis joked and bragged about the murder were \"not from sources which can be considered reliable.\" The government stated during the proceeding that the plea agreement on the second degree murder charge took \"into account the various circumstances and evidentiary matters that [were] present in the case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Because the court refused to acknowledge its prior acceptance of Ellis's guilty plea, the government did not have the customary opportunity to move for dismissal of the first degree murder charge pursuant to Rule 48, before the district court forced arraignment on the first degree charge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The government reiterated its concerns about proving a first degree murder charge during its argument, stating that \"there is a question about what the evidence will allow the government realistically to prove.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Former Rule 32(b)(3) similarly provided that the presentence \"report must not be submitted to the court or its contents disclosed to anyone unless the defendant has consented in writing, has pleaded guilty or nolo contendere, or has been found guilty.\" Fed. R. Crim. P. 32(b)(3) (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Judge Kleinfeld's dissenting opinion perpetuates the same misconception that the plea is part and parcel of the plea agreement, merging the two together under the term \"plea bargain.\" It is not, as the Supreme Court made clear in Hyde and as evidenced by the individualized treatment of the two by Congress in Rule 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Advisory Committee notes for the 2002 Amendments to Rule 11 clarify that Rule 11(c)(3) to (5) addresses the topics of consideration, acceptance, and rejection of the plea agreement only, noting that \"in the past there has been some question about the possible interplay between the court's consideration of the guilty plea in conjunction with a plea agreement and sentencing and the ability of the defendant to withdraw a plea.\" Fed. R. Crim. P. 11 note (citing Hyde).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Rule 11(c)(1) authorizes three types of plea agreements. In a subsection (A) agreement, the government promises it will not bring, or will move to dismiss, other charges. Under subsection (B), the government agrees to recommend, or not to oppose the defendant's request for a particular sentence or sentencing range, or the application or non-application of a Sentencing Guidelines provision, policy statement, or sentencing factor. Under this type of plea agreement, the defendant may not withdraw his plea of guilty in the event the court does not adopt the government's recommendation or grant the defendant's request. Pursuant to subsection (C) the government may agree that a specific sentence or sentencing range should apply, or that a particular Sentencing Guidelines provision, policy statement, or sentencing factor does or does not apply. The agreement here contained both (A) and (C) elements. Had the district court accepted it, the agreed-upon disposition would have been included in the judgment of conviction. The district court rejected the plea agreement, however, triggering subsection (c)(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Judge Kleinfeld's dissent flatly mischaracterizes this holding as stating \"that if the defendant chooses not to withdraw his plea to a lesser offense, the judge cannot reject his charge bargain.\" Post, at 1541. Rule 11(c)(5) does not so provide; nor do we so hold. Rather, if the district court rejects the plea agreement, \"the court may dispose of the case less favorably toward the defendant than the plea agreement contemplated.\" Fed. R. Crim. P. 11(c)(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Although the Kleinfeld dissent acknowledges that the corporation never entered a plea, it fails to see how critical this fact is to the decision. The court in Carrigan rejected the plea agreement and did not vacate a plea, as was done here. And, to further illustrate the lack of conflict with the Tenth Circuit, under our holding, had the corporate defendant in Carrigan actually pleaded guilty pursuant to a plea agreement, and the district court later rejected that agreement by declining to dismiss the charges against the individual defendant, the corporation would have been entitled to withdraw its plea. Thus, at that point, the corporate defendant would have faced the same choices it faced at the time of the appeal and petition in Carrigan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. An attorney for the government and the defendant's attorney, or the defendant when proceeding pro se, may discuss and reach a plea agreement. The court must not participate in these discussions.\" Fed. R. Crim. P. 11(c)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. To support a first degree murder charge the United States must prove the defendant acted with premeditation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. On the other hand, there is some limited evidence that defendant had talked about robbing taxicab drivers before this crime was committed. For example, on one earlier occasion, defendant supposedly invited a friend to join him in a taxicab robbery, and promised to call him later. However, defendant never called and nothing apparently came from this conversation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. U.S. v. Foy, 28 F.3d 464 (5th Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. U.S. Sentencing Guideline Manual § 6B1.2(a) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A district court may deny a Rule 48(a) motion to dismiss an indictment only when \"the motion was clearly contrary to manifest public interest.\" United States v. Garcia-Valenzuela, 232 F.3d 1003, 1008 (9th Cir. 2000) (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See U.S. Sentencing Guidelines Manual § 6B1.2(a) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Task Force on Administration of Justice, The President's Commission on Law Enforcement and Administration of Justice, Task Force Report: The Courts 9-10 (1967) (internal citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Id. at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The majority states that the dissent \"flatly mischaracterizes\" the majority's holding because the judge may still \"dispose of the case less favorably toward the defendant than the plea agreement contemplated\" under Rule 11(c)(5). Maj. Op. at 1493 n.13. I wish that were so. If a defendant pleads to lesser charges with a lesser maximum but open sentencing, and the judge disapproves of the charge bargain after reading the presentence report, the judge is limited, under the majority opinion, to the inadequate conviction, and, if the maximum is too low, the inadequate sentence. Under the majority opinion, if the prosecutor and defense agreed to plead first-degree murder down to a misdemeanor such as careless use of firearms, and, knowing nothing but the stipulation of facts in the plea bargain, the court accepted the plea, there would be nothing the court could do about it when the presentence report revealed what had occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. U.S. Sentencing Guidelines Manual § 6B1.2(a) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Fed. R. Crim. P. 32(c)(1)(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Fed. R. Crim. P. 32(e)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. U.S. Sentencing Guidelines Manual § 6B1.2(a) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The full paragraph of Commentary for § 6B1.2 lays out the heretofore well understood balancing of executive charging and judicial control over sentencing: The court may accept an agreement calling for dismissal of charges or an agreement not to pursue potential charges if the remaining charges reflect the seriousness of the actual offense behavior. This requirement does not authorize judges to intrude upon the charging discretion of the prosecutor. If the government's motion to dismiss charges or statement that potential charges will not be pursued is not contingent on the disposition of the remaining charges, the judge should defer to the government's position except under extraordinary circumstances. Rule 48(a), Fed. R. Crim. P. However, when the dismissal of charges or agreement not to pursue potential charges is contingent on acceptance of a plea agreement, the court's authority to adjudicate guilt and impose sentence is implicated, and the court is to determine whether or not dismissal of charges will undermine the sentencing guidelines.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. U.S. Sentencing Guidelines Manual § 6B1.1(c) (2000) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. U.S. Sentencing Guidelines Manual § 6B1.1, cmt. ¶ 2 (2000) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. U.S. v. Cordova-Perez, 65 F.3d 1552 (9th Cir. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Id. at 1557.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. United States v. Hyde, 520 U.S. 670 (1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Hyde, 520 U.S. at 677.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Id. at 676.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Id. at 673-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. LaFave sets out, consistently with my view, what was, before today's decision, the general understanding of Hyde's rejection of the \"bound up together\" concept: Although such reasoning was rejected by the Supreme Court when used to support a quite different contention, namely, that the defendant may withdraw his plea as a matter of right any time prior to the judge's decision as to the plea agreement, see the Hyde case, . . . that does not put into question the balance of the Cordova-Perez analysis in the text immediately following. 5 Wayne R. LaFave, et al., Criminal Procedure § 21.4(g) n.201 (2d ed. 1999). The \"text immediately following\" is our holding that the \"deferment of the decision whether to accept the plea agreement carried with it postponement of the decision whether to accept the plea . . . even though the court explicitly stated it accepted Cordova-Perez's plea.\" Cordova-Perez, 65 F.3d at 1556.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Hyde, 520 U.S. at 677-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Id. at 679.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Id. at 677 (alteration in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See U.S. v. Lewis, 979 F.2d 1372, 1375 (9th Cir. 1992) (\"Although both the government and the defendant are expected to comply with the terms of the plea agreement, the court is not a party to the agreement and may reject it.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. U.S. Sentencing Guidelines Manual § 6B1.2(a) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The majority points out that these \"facts\" have not been proved. Of course not. A trial is needed to find out whether the facts are this egre gious. That is what the district court correctly provided for. Under Sentencing Guidelines § 6B1.2, the facts as described in the presentence report, not just those stipulated to in the plea agreement, are supposed to furnish the predicate for judicial approval or disapproval.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See Rule 11(c)(3)(A); U.S. Sentencing Guidelines Manual § 6B1.1(c) (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The plea agreement included this sparse record of facts: 8. Statement of Facts. The parties stipulate and agree that the following facts, which defendant admits, provide the factual basis for defendant's plea of guilty to the Superseding Information: a. Defendant was born on September 9, 1982. On March 5, 1999, the defendant resided with his mother at The Palisades Apartment Complex, 14701 South C Street, #61, Tacoma, (Spanaway) Washington, located directly behind the shopping center where a Winchell's Donut Shop and the Strap Tavern are located. b. On Friday, March 5, 1999, at approximately 7:45 p.m., the defendant called Tacoma Yellow Cab from a pay telephone outside the Winchell's Donut Shop located at 15012 Pacific Avenue South, Spanaway, Washington, requesting a pick-up at the Strap Tavern located nearby. Donald Ray Barker, a 46-year old male who was driving Tacoma Yellow Cab number 60 that night, was dispatched to the Strap Tavern where he picked up the defendant shortly after 8:00 p.m. c. At approximately 8:20 p.m., a passerby was driving southbound on North Gate Road on Fort Lewis when he saw cab 60 pulled off to the right side of the road with the lights on, in a shallow ditch. The passerby stopped, noticed that the engine was running, and found the driver, Donald Ray Barker, laying [sic] on the front seat. Mr. Barker had been shot in the back of the head. Emergency medical assistance was summoned and Mr. Barker was transported to the Madigan Army Hospital where he was treated for multiple gunshot wounds to the back of his head. d. An autopsy was performed by the Pierce County Medical Examiner who determined that Mr. Barker was killed by three gunshot wounds to the back of his head. e. The location of Mr. Barker's cab, when it was found by the passerby to the side of the road with its lights on and its engine running, was approximately one-half mile inside the perimeter of Fort Lewis, which is within the special maritime and territorial jurisdiction of the United States, as defined by Title 18, United States Code, Section 7(3). f. The defendant, who was the sole passenger in Mr. Barker's taxi cab at the time of the shooting, did, with malice aforethought, unlawfully kill Donald Ray Barker by shooting him three times in the back of the head with a firearm. g. The events described above occurred within the Western District of Washington.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Judge Trott relies on United States v. Miller, 722 F.2d 562, 565-66 (9th Cir. 1983), for the proposition that the district judge did not adequately set forth its justifications for rejecting the charge bargain. Miller is a 1983 case, pre-Guidelines. In light of the subsequent changes in the Rules and Sentencing Guidelines, it is questionable authority. In the context of this case where the judge's remarks must be read in light of the presentence report to which the prosecutor and defendant, as well as the court, were responding, the court's justification is sufficiently set out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Judge Kozinski is evidently impressed with what he calls Ellis's \"tragic and difficult situation,\" e.g., that, as the prosecutor characterized it, Ellis's \"days were indistinguishable, one from the next, and consisted primarily of sleeping, eating junk food, hanging out at one apartment or another, playing video games, using alcohol and drugs, engaging in sexual activities, and, perhaps most significantly, attempting to be 'tough' or 'cool.' \" The district judge had the discretion to decide whether this \"tragic and difficult situation\" justified lenience, and was well within his discretion in deciding that it did not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. United States v. Foy, 28 F.3d 464, 468 (5th Cir. 1994) (remanding for reconsideration of the plea agreement on other grounds).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Id. at 471.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Id. at 468.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Id. at 471 (\"We conclude that section 6B1.1(c) makes a district court's acceptance of a guilty plea contingent upon the court's review of the PSR [presentence report].\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. United States v. Carrigan, 778 F.2d 1454 (10th Cir. 1985); see also United States v. Martin, 287 F.3d 609, 623 (7th Cir. 2002) (holding that a district court's rejection at sentencing of a plea agreement involving a charge bargain did not usurp executive power, explaining that had the U.S. Attorney been so inclined, he could have effectuated the same result the plea agreement sought by moving to dismiss the other counts with prejudice under Rule 48, which the district court would have had to grant, absent a specific finding that the dismissal would be manifestly against the public interest).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Carrigan, 778 F.2d at 1458.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See United States v. Bean, 564 F.2d 700 (5th Cir. 1977), cited by Carrigan, 778 F.2d at 1463-64.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Carrigan, 778 F.2d at 1467.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Id. (quoting Allied Chem. Corp. v. Daiflon, Inc., 449 U.S. 33, 36 (1980) (per curiam)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. United States v. Partida-Parra, 859 F.2d 629 (9th Cir. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Id. at 631.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. United States v. Cruz, 709 F.2d 111 (1st Cir. 1983). Cruz says that under the facts of that case jeopardy attached when the plea was accepted. The majority and concurring opinions do not argue that double jeopardy bars Ellis's trial for first degree murder, no doubt because the Cruz position could no longer be maintained in the face of the Supreme Court decision a year later in Ohio v. Johnson, 467 U.S. 493, 501 (1984). In cases that end by a guilty plea, jeopardy does not attach where no judgment of conviction has been entered. 5 Wayne R. LaFave, et al., Criminal Procedure § 25.1(d) (2d ed. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Cruz, 709 at 112.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. U.S. Sentencing Guidelines Manual § 6B1.1(c) (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. United States v. Blackwell, 694 F.2d 1325 (D.C. Cir. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Id. at 1337.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Id. at 1338.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. \"[I]t is clear that only exceptional circumstances amounting to a judicial usurpation of power will justify the invocation of this extraordinary remedy.\" Will v. United States, 389 U.S. 90, 95 (1967) (citations and internal quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Bauman v. United States District Court, 557 F.2d 650, 654 (9th Cir. 1977)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. \" 'Impartiality is not gullibility. Disinterestedness does not mean child-like innocence. If the judge did not form judgments of the actors in these court-house dramas called trials, he could never render decisions.' \" Liteky v. United States, 510 U.S. 540, 551 (1994) (quoting In re J.P. Linahan, Inc., 138 F.2d 650, 654 (2d Cir. 1943)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. United States v. Fine, 975 F.2d 596, 604 (9th Cir. 1992) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. I borrow this phrase from Professor, later President, Woodrow Wilson who, in considering colonial leaders instrumental in the movement for independence, said of the young Patrick Henry that his \"speech was so singularly compounded of thought and fire.\" WOODROW WILSON, 2 A HISTORY OF THE AMERICAN PEOPLE 194 (1902).\u003c/span\u003e\n\n",
    "body_length": 158508,
    "citedas": [
      "356 F.3d 1198",
      "2004 Daily Journal D.A.R. 1305",
      "4 Cal. Daily Op. Serv. 1029"
    ],
    "attorneys": "Counsel Robert Gombiner, Federal Public Defender, Seattle, Washington, for the petitioner. Peter B. Gonick, McKay Chadwell, Pllc, Seattle, Washington, for the respondent. Robert H. Westinghouse, Assistant United States Attorney,for the real party in interest.",
    "category": [
      "242",
      "36",
      "75"
    ],
    "judges": "Before: Mary M. Schroeder, Chief Judge, Harry Pregerson,Stephen Reinhardt, Alex Kozinski, Stephen S. Trott,Andrew J. Kleinfeld, Sidney R. Thomas,Kim McLane Wardlaw, Raymond C. Fisher,Ronald M. Gould, and Marsha S. Berzon, Circuit Judges.",
    "citation_count": 46
  }
}
