{
  "id": "xYqMQGYBTlTomsSBs4Kr",
  "document": {
    "title": "Moore v. Kemp",
    "full_title": "CARZELL MOORE -APPELLANT, v. RALPH KEMP, WARDEN, GEORGIA DIAGNOSTIC AND CLASSIFICATION CENTER -APPELLEE",
    "jurisdiction": "Eleventh Circuit",
    "date": "1987-01-21T00:00:00.000Z",
    "docket": "No. 82-8683",
    "body": "TJOFLAT, Circuit Judge:\n\nI.\n\nA.\n\nShortly before 7:00 p.m. on December 12, 1976, several patrons of the Majik Market convenience store in Cochran, Georgia, found the store open and unattended. The store's cash register and safe were open and empty, and the store's cashier, eighteen-year-old Teresa Carol Allen, was missing. Her automobile had also vanished. Two days later, Ms. Allen's body was discovered over seventy miles northwest of Cochran in Monroe County, Georgia. Found near her body were footprints, two 30.06 caliber cartridge hulls, a 30.06 caliber metal jacket of a bullet, tire tracks, a nylon stocking, a pair of leather work gloves, and parts of Ms. Allen's flesh, teeth, and bone.\n\nPolice immediately began a search for Ms. Allen's automobile. Approximately one month later, the automobile was discovered in South Carolina in the possession of an escaped convict, twenty-year-old Roosevelt Green; Green had been arrested for an unrelated convenience store robbery. From jail Green made a telephone call to the mother of an acquaintance, Thomas Pasby, and stated, \"Tell Carzell Moore I'm in jail in South Carolina.\" The Georgia law enforcement officials investigating Ms. Allen's murder learned of this telephone call and questioned a number of persons in Cochran about possible links between Green and Moore. They discovered that Green and Moore met and became friends while they were in prison in Alabama, that on December 11, 1976, after escaping from prison in late 1975, Green arrived in Cochran asking for Moore, and that Moore had introduced Green to a number of friends in Cochran, among them Thomas Pasby. On January 10, 1977, Carzell Moore was arrested and was placed in the Bleckley County jail, located in Cochran. Five days later, authorities obtained a search warrant for Moore's home and seized several items, including one pair of brown \"Hush Puppy\" shoes and a gold towel. These items were submitted to the Georgia crime lab for analysis.\n\nOn February 15, 1977, a grand jury in Monroe County, Georgia, returned an indictment charging Moore and Green with the rape and first-degree murder of Ms. Allen. Green escaped from the Monroe County jail prior to trial and was not recaptured for several years. As a result, in June 1977, Moore was tried separately before a jury in the Superior Court of Monroe County, Georgia. The key witness for the State was thirty-year-old Thomas Pasby. Pasby was a resident of Cochran and was employed as a cement finisher in Hawkinsville, Georgia. He testified that he had known Carzell Moore for fifteen years and that since his return to Cochran in 1974, after serving in the Army for eight years, he had \"spent a lot of time\" with Moore. According to Pasby, in late November 1976, he drove Moore to a location in Cochran near a flower shop. Moore asked Pasby to park and to wait for him to return. After a few minutes had passed, Moore returned to the car carrying a 30.06 caliber hunting rifle similar to the murder weapon. A few weeks later, Pasby accompanied Moore to an abandoned schoolhouse where Moore kept the rifle. Pasby examined the rifle and noticed that its serial number had been obliterated.\n\nPasby also testified that on January 1, 1977, during a trip to Hawkinsville, Moore confessed to him that he had raped and murdered Ms. Allen and described how the crimes were committed. Pasby related Moore's description of the events of December 12, 1976, as follows. Roosevelt Green entered the Majik Market and distracted Ms. Allen so that Moore could enter the store without the rifle being noticed. After robbing the store, the two men abducted Ms. Allen and drove away in her car. With Moore driving the car, Green raped Ms. Allen. The two men then exchanged places, and Moore raped Ms. Allen. Some time later Moore told Green to stop the car. He got out of the car with Ms. Allen and told Green to go to a gas station to get gas for the car. After Green left, Moore pointed the rifle at Ms. Allen. She reacted by crossing her arms over her stomach. Moore then fired the rifle into her abdomen. He fired a second shot into her face in an attempt to make identification difficult. When Green returned, the two men picked up the body and threw it into the bushes by the side of the road. Moore told Pasby that his first rifle shot had so mangled one of the victim's hands that he thought it was going to fall off.\n\nDuring his direct examination, Pasby testified that he had been arrested on January 4, 1977, for theft by taking. Pasby said that the arrest took place in Hawkinsville and that shortly after he was taken into custody he was transferred to the Bleckley County jail in Cochran. Pasby testified that Moore was placed in the jail with him following Moore's arrest on January 10. Pasby stated that, while he was in the jail with Moore, he learned that Roosevelt Green had been arrested and told Moore about the arrest.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Moore exclaimed, \"Damn, I told Green to get rid of that car and rifle.\"\n\nThe remainder of the State's case consisted of evidence corroborating Pasby's testimony. Terry Kilgore, the owner of a flower shop in Cochran, testified that his 30.06 hunting rifle was stolen from his truck some time after Thanksgiving 1976. The rifle, registered in Kilgore's name, was determined in a ballistics test to have been the murder weapon. Green had the rifle in his possession the morning after the Majik Market robbery. Charles Livingston testified that, on that morning, Green arrived at his home in South Carolina driving an automobile similar to Ms. Allen's car. In Green's possession were a roll of bills, a \"bank bag,\" a large amount of coins (all of which were consistent with the items taken from the Majik Market), and a 30.06 caliber rifle. Green traded the 30.06 caliber rifle for Livingston's .25 caliber automatic pistol. The police subsequently confiscated the rifle, and Kilgore identified it during his testimony.\n\nJohnny Johnson, an acquaintance of Moore's, testified that on December 9, 1976, three days before the robbery, Moore asked him and a friend if they knew of a place to \"hit.\" Moore told them that he had a high-powered rifle and ammunition that would be useful in a robbery. Three other witnesses testified that on the afternoon of December 12 they saw Moore and Green at Moore's home, approximately four blocks from the Majik Market.\n\nA gas station attendant who worked at an Amoco station near the murder site testified that on the night of the murder a car matching the description of Ms. Allen's automobile stopped for gas. Two persons were in the car, and the attendant remembered that the passenger, a black male, paid for the gas and used the restroom. Although he was unsure of the sex or race of the driver, the attendant testified that he thought the driver was also a black male.\n\nThe State utilized a number of experts to inform the jury about the physical evidence found at the murder site and in the search of Moore's home. The pathologist who performed the autopsy on Ms. Allen testified that her injuries were consistent with Moore's description to Pasby of the rape and murder. His examination of the body revealed bullet wounds in each arm, the abdomen, and the head. From the location and nature of the bullet wounds, the pathologist theorized that Ms. Allen's arms had been crossed over her stomach when she was shot, allowing one bullet to pass through both arms before entering her abdomen. He noted that the right arm was \"almost completely torn in two\" by the bullet, with the right hand remaining attached to the body only by soft tissue. He also stated that a separate bullet entered the left side of the victim's head over her ear. His examination also revealed bruises on the inner thigh and vaginal injuries indicating that Ms. Allen had been raped prior to being killed.\n\nA ballistics expert testified that bullets fired from the 30.06 caliber rifle confiscated from Livingston and registered to Terry Kilgore matched the 30.06 caliber slug retrieved at the murder site. Warren Tillman, a microanalyst from the state crime lab, testified that a plaster cast of a footprint found near the body was similar in size and in its treadless design to the pair of \"Hush Puppy\" shoes seized in the search of Moore's home. His examination of plaster casts of tire tracks found near the murder site revealed that the tracks were similar in size and tread design to the tires on Ms. Allen's automobile. Tillman also testified that in his opinion a Caucasian pubic hair and Negroid head hair removed from the gold towel seized in the search of Moore's home could have come from Ms. Allen and Mr. Moore respectively. In addition, he stated that the Negroid head hair found on the towel did not come from Roosevelt Green or Thomas Pasby. Finally, Linda Barton, a crime lab serologist, testified that vaginal swabbings taken from the victim revealed seminal fluids from an individual with type A blood. She concluded that the seminal fluid could not have come from Roosevelt Green, because he had type B blood. Although the serologist found that both Moore and Pasby had type A blood, she testified that in her opinion the seminal fluid could have come from Moore because he was a \"strong secretor\" and could not have come from Pasby, because he was a \"weak secretor.\"\n\nCarzell Moore testified in his defense. He stated that he was twenty-four years old and that he was employed by a lumber company in Cochran. Moore admitted that he met Green in a penitentiary in Alabama, that Green had escaped from that penitentiary in late 1975, and that Green had arrived in Cochran looking for him on December 11, 1976. Moore also admitted that he had allowed Green to stay in his home and had introduced Green to many of his friends in Cochran. He stated that on the afternoon of the robbery he and Green had been drinking. Moore testified that after Green left his home on foot headed toward town, he passed out on a couch. He denied participating in the robbery and denied making any statements to Pasby about the incident. The jury rejected Moore's testimony and returned a verdict of guilty on both the rape and the first-degree murder counts.\n\nDuring the sentencing phase of the trial, the State presented documentary evidence of Moore's prior convictions for burglary and for possession of marijuana. Moore then testified, asking the jury for mercy and repeating his denial of any involvement in the incident. His mother, Catherine Moore, also testified, asking the jury to spare her son's life. In rebuttal, the State called Joseph Allen, the victim's father. He testified that his daughter would have been nineteen on December 25, 1976, had been an honor student in high school, was attending Middle Georgia College on a partial scholarship studying to become a nurse, and had been working part time at the Majik Market to help pay for her education. After deliberating, the jury recommended the death penalty on both the rape and the first-degree murder counts and found the following statutory aggravating circumstances: first, each crime was committed during the commission of additional capital felonies, i.e., the murder was committed during the commission of the rape, kidnapping, and armed robbery, and the rape was committed during the commission of the murder, kidnapping, and armed robbery, see O.C.G.A. ยง 17-10-30(b)(2) (1982); and, second, each crime was outrageously and wantonly vile, horrible, and inhuman in that it involved torture of the victim and depravity of mind on the part of the defendant, see O.C.G.A. ยง 17-10-30(b)(7) (1982). As required by Georgia law, the trial judge adopted the jury's recommendation and entered a sentence of death on both counts.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nB.\n\nOn direct appeal, the Supreme Court of Georgia affirmed Moore's convictions and sentences. Moore v. State, 240 Ga. 807, 243 S.E.2d 1, cert. denied, 439 U.S. 903, 99 S. Ct. 268, 58 L. Ed. 2d 249 (1978). Moore subsequently petitioned the Superior Court of Butts County for a writ of habeas corpus. After conducting an evidentiary hearing, the court denied Moore's petition. The Supreme Court of Georgia denied Moore's application for a certificate of probable cause to appeal, and the United States Supreme Court denied his petition for a writ of certiorari to review the state habeas corpus decision. Moore v. Zant, 446 U.S. 947, 100 S. Ct. 2176, 64 L. Ed. 2d 803 (1980). Thereafter, Moore filed a second habeas corpus petition in the Superior Court of Butts County in an effort to exhaust those issues he had failed to raise in any of the previous judicial proceedings. The court summarily dismissed the petition without holding a hearing. In response, Moore filed an application for a certificate of probable cause to appeal, which the Supreme Court of Georgia denied.\n\nHaving exhausted his state remedies, Moore filed the instant petition for a writ of habeas corpus in the district court on April 7, 1981. Moore raised sixteen claims of error.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The petition was referred to a magistrate who made findings of fact and conclusions of law and recommended that the district court deny the petition without an evidentiary hearing. On September 20, 1982, the district court entered an order adopting the magistrate's recommendation and denying the petition. Moore appealed, contesting the district court's disposition as to five of his claims.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In addition, Moore contended that the district court erred in refusing to hold an evidentiary hearing as to four of his claims.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e A panel of this court rejected Moore's arguments and affirmed the district court's denial of relief. Moore v. Zant, 722 F.2d 640 (11th Cir. 1983). We vacated the panel opinion and granted Moore's petition for rehearing en banc on March 15, 1984. During oral argument, the parties informed us that a recent Supreme Court of Georgia decision, Stynchcombe v. Floyd, 252 Ga. 113, 311 S.E.2d 828 (1984), appeared to represent a change in Georgia law directly related to an issue Moore raised in his appeal. In Floyd, the court held that a jury instruction virtually identical to one challenged in Moore's case was erroneous because it failed to inform the jury of its option to recommend a life sentence in spite of the presence of a statutory aggravating circumstance. Id. at 114, 311 S.E.2d at 830. Accordingly, we held Moore's appeal in abeyance so that he could resubmit his jury instruction claim to the Georgia courts.\n\nMoore immediately filed a petition for habeas corpus relief in the Superior Court of Butts County. After an evidentiary hearing, the court dismissed Moore's petition as successive. The Supreme Court of Georgia affirmed on April 24, 1985. Moore v. Kemp, 254 Ga. 279, 328 S.E.2d 725 (1985). After being notified of this disposition and receiving supplemental briefs, we heard further oral argument in this case on October 21, 1985.\n\nWe now proceed to a discussion of the four claims that prompted us to rehear this case en banc: (1) that the trial court's denial of Moore's pretrial request for an independent expert to assist his attorney in confronting the physical evidence the State introduced against him at trial denied him due process of law; (2) that the district court erred in refusing to hold an evidentiary hearing to determine whether the prosecutor withheld portions of Thomas Pasby's criminal record from the defense and whether Pasby testified against Moore pursuant to an undisclosed agreement with the State; (3) that the trial court's sentencing instructions to the jury did not adequately inform it of its option to return a life sentence, even if it found a statutory aggravating circumstance; and (4) that the testimony of the victim's father during the sentencing phase of the trial deprived Moore of his right to a sentencing hearing free from passion and prejudice. As to the remaining claims Moore raises on appeal, we reinstate the panel opinion.\n\nII.\n\nPetitioner was indigent at the time of his prosecution. Prior to trial, he moved the court to provide a \"criminologist or other expert witness\" to assist his attorney in the preparation and presentation of his defense. The court denied the motion. Petitioner claims that this denial deprived him of the right to a fundamentally fair trial guaranteed by the due process clause of the fourteenth amendment;\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e he cites two reasons. First, without the assistance of an expert, his attorney was unable adequately to cross-examine the State's experts, Warren Tillman, a microanalyst, and Linda Barton, a serologist, and thus could not challenge the validity of the conclusions they derived from their tests. Second, petitioner asserts that an expert appointed to assist counsel might have conducted different and more conclusive tests, the results of which might have supported his alibi defense.\n\nA.\n\nSupreme Court precedent establishes the principle that the due process clause of the fourteenth amendment requires that the state, upon request, provide indigent defendants with the \"basic tools of an adequate defense . . . when those tools are available for a price to other prisoners.\" Britt v. North Carolina, 404 U.S. 226, 227, 92 S. Ct. 431, 433, 30 L. Ed. 2d 400 (1971); see also Ake v. Oklahoma, 470 U.S. 68, 77, 83, 105 S. Ct. 1087, 1094, 1097, 84 L. Ed. 2d 53 (1985); Ross v. Moffitt, 417 U.S. 600, 94 S. Ct. 2437, 41 L. Ed. 2d 341 (1974); Griffin v. Illinois, 351 U.S. 12, 76 S. Ct. 585, 100 L. Ed. 891 (1956) (plurality). The state need not provide indigent defendants all the assistance their wealthier counterparts might buy; rather, fundamental fairness requires that the state not deny them \"an adequate opportunity to present their claims fairly within the adversary system.\" Ross, 417 U.S. at 612, 94 S. Ct. at 2444-45; see also Ake, 470 U.S. at, 105 S. Ct. at 1094.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In the case at hand, petitioner contends that the state trial court, in denying his request for the appointment of a \"criminologist or other expert witness,\" deprived him of a basic tool of an adequate defense and therefore rendered his trial fundamentally unfair.\n\nAn expert can assist a criminal defendant in marshaling his defense in two essential ways. First, he can gather facts, inspect tangible evidence, or conduct tests or examinations that may aid defense counsel in confronting the prosecution's case, including its expert witnesses, or in fashioning a theory of defense. Second, the expert can provide opinion testimony to rebut prosecution evidence or to establish an affirmative defense, such as insanity. In a given case, the assistance of an expert could be so important to the defense that without it an innocent defendant could be convicted or, at the very least, the public's confidence in the fairness of his trial and its outcome could be undermined. Even so, an indigent defendant who did not have the assistance of an expert in preparing and presenting his case cannot be heard to complain about his conviction on due process grounds unless he made a timely request to the trial court for the provision of expert assistance, the court improperly denied the request, and the denial rendered the defendant's trial fundamentally unfair.\n\nIn the case before us, a timely request for the appointment of an expert was made. The question we must decide next is whether the trial court erred in denying it. Specifically, we must assess the reasonableness of the trial judge's action at the time he took it. This assessment necessarily turns on the sufficiency of the petitioner's explanation as to why he needed an expert. That is, having heard petitioner's explanation, should the trial judge have concluded that unless he granted his request petitioner would likely be denied an adequate opportunity fairly to confront the State's case and to present his defense?\n\nB.\n\nThe Supreme Court adopted the approach described above in Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 1097, 84 L. Ed. 2d 53 (1985), and in Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 2637 n.1, 86 L. Ed. 2d 231 (1985) (plurality). In Ake, the Court concluded that the due process clause's guarantee of fundamental fairness is implicated \"when [an indigent] defendant demonstrates to the trial judge that his sanity at the time of the offense is to be a significant factor at trial\" and that \"the State must, at a minimum, assure the defendant access to a competent psychiatrist who will conduct an appropriate examination and assist in evaluation, preparation, and presentation of the defense.\" Ake, 470 U.S. at, 105 S. Ct. at 1097.\n\nAke was arrested and charged with murdering a couple and wounding their two children. At his arraignment, and while in jail, his behavior was so bizarre that the trial judge, sua sponte, ordered him examined by a psychiatrist. As a result of that examination, Ake was committed to a state hospital for a determination of his competency to stand trial. A few weeks later, the chief forensic psychiatrist at the state hospital told the court that Ake was not competent to stand trial. After a competency hearing, the court found Ake to be a \"mentally ill person in need of care and treatment,\" id. at, 105 S. Ct. at 1091, and incompetent to stand trial. The court ordered him committed to the state mental hospital. Six weeks later, the chief forensic psychiatrist advised the court that Ake, who was being treated with an antipsychotic drug, had become competent to stand trial. The court thereafter found Ake to be competent, and the criminal prosecution resumed. See id. at, 105 S. Ct. at 1090-91.\n\nAt a pretrial conference, defense counsel informed the court that his client would raise an insanity defense at trial. The attorney further stated that in order to prepare and present that defense a psychiatrist would have to examine Ake with respect to his mental condition at the time of the murders. Because during his stay at the state hospital Ake was not examined to determine his sanity at the time of the offenses and, as an indigent, could not afford to pay a psychiatrist, counsel asked the court either to arrange or provide the necessary funds for such an examination. The court denied counsel's motion. See id. at, 105 S. Ct. at 1091.\n\nAt trial, defense counsel did not dispute Ake's involvement in the charged crimes; his sole argument was that Ake was not guilty by reason of insanity. To support his argument, counsel called the psychiatrists who had examined Ake at the state hospital and questioned them about his mental condition at the time of the offenses. They were unable to render an opinion on the point, however, because they had not examined Ake for that purpose. As a result, no one testified as to his sanity at the time of the offenses, and, having failed to carry his burden of proof on the insanity defense, he received guilty verdicts. The State then sought the death penalty. Following a sentencing hearing, in which the parties presented no additional expert testimony, the jury recommended that Ake be sentenced to death for each of the two murders, and he was sentenced accordingly.\n\nAke appealed to the Oklahoma Court of Criminal Appeals, claiming, among other things, that his convictions and death sentences were invalid because the trial court's failure to provide psychiatric assistance denied him a fair trial. The court of criminal appeals rejected that claim on a procedural ground, holding that he had waived it by not challenging the trial court's ruling in his motion for a new trial. The Supreme Court of the United States, on certiorari, reversed Ake's conviction and remanded the case for a new trial because the failure to provide psychiatric assistance operated to deny Ake due process of law.\n\nIn reaching this conclusion, the Supreme Court focused on the information available to the trial judge when defense counsel requested psychiatric assistance and on the effect the denial of such assistance had on the presentation of Ake's defense at trial. The Court observed that when Ake's counsel requested the provision of a psychiatrist, the trial judge knew that insanity would be Ake's sole defense, that his case rested on his ability to prove that he was insane when he committed the crimes, and that none of the state psychiatrists who had examined and treated Ake had undertaken to assess his mental condition at that time. In addition, the trial judge had determined previously that Ake was suffering from a mental illness that may have affected him at the time of the shootings and had rendered him incompetent to stand trial for a six-week period. Finally, the trial judge knew that Ake could stand trial only if he remained under medication. The Supreme Court concluded that, given the facts before the trial judge and defense counsel's explanation for requesting expert assistance, it was unreasonable for the trial judge to have denied the request; he should have known that to refuse the request would be to deny the defendant an adequate opportunity to prepare and present his insanity defense. The Court further concluded, on the basis of what took place at trial, that the denial of expert assistance precluded Ake from presenting an effective defense.\n\nIn Caldwell, also a capital case, the Supreme Court was faced again with a claim that a trial court's refusal to provide a defendant with expert assistance denied the defendant a fair trial. Caldwell asked for the appointment of a criminal investigator, a fingerprint expert, and a ballistics expert. His requests were denied. The state supreme court affirmed the denials \"because the requests were accompanied by no showing as to their reasonableness.\" Caldwell, U.S. at n.1, 105 S. Ct. at 2637 n.1. For example, the motion requesting the ballistics expert included only the general statement that the expert was necessary; the motion failed to explain in specific terms why the expert was needed. See Caldwell v. State, 443 So. 2d 806, 812 (Miss. 1983), rev'd on other grounds sub nom. Caldwell v. Mississippi, 472 U.S. 320,, 105 S. Ct. 2633, 86 L. Ed. 2d 231 (1985) (plurality). The Supreme Court concluded that because \"petitioner offered little more than undeveloped assertions that the requested assistance would be beneficial, [there was] no deprivation of due process.\" Caldwell, U.S. at n.1, 105 S. Ct. at 2637 n.1 (citation omitted).\n\nThe Supreme Court's statement in Caldwell implies that the government's refusal to provide nonpsychiatric expert assistance could, in a given case, deny a defendant a fair trial. The implication is questionable, however, in light of the Court's subsequent statement that it had \"no need to determine as a matter of federal constitutional law what if any showing would have entitled a defendant to assistance of the type [Caldwell] sought.\" Id. (emphasis added). We nonetheless assume, for sake of argument, that the due process clause could require the government, both state and federal, to provide nonpsychiatric expert assistance to an indigent defendant upon a sufficient showing of need.\n\nAke and Caldwell, taken together, hold that a defendant must demonstrate something more than a mere possibility of assistance from a requested expert;\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e due process does not require the government automatically to provide indigent defendants with expert assistance upon demand. Rather, a fair reading of these precedents is that a defendant must show the trial court that there exists a reasonable probability both that an expert would be of assistance to the defense\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and that denial of expert assistance would result in a fundamentally unfair trial. Thus, if a defendant wants an expert to assist his attorney in confronting the prosecution's proof -- by preparing counsel to cross-examine the prosecution's experts or by providing rebuttal testimony -- he must inform the court of the nature of the prosecution's case and how the requested expert would be useful. At the very least, he must inform the trial court about the nature of the crime and the evidence linking him to the crime. By the same token, if the defendant desires the appointment of an expert so that he can present an affirmative defense, such as insanity, he must demonstrate a substantial basis for the defense, as the defendant did in Ake. In each instance, the defendant's showing must also include a specific description of the expert or experts desired; without this basic information, the court would be unable to grant the defendant's motion, because the court would not know what type of expert was needed. In addition, the defendant should inform the court why the particular expert is necessary. We recognize that defense counsel may be unfamiliar with the specific scientific theories implicated in a case and therefore cannot be expected to provide the court with a detailed analysis of the assistance an appointed expert might provide. We do believe, however, that defense counsel is obligated to inform himself about the specific scientific area in question and to provide the court with as much information as possible concerning the usefulness of the requested expert to the defense's case.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWith the foregoing principles in mind, we address the merits of petitioner's claim. We begin by examining the information before the trial court when it ruled on petitioner's motion.\n\nC.\n\nOn January 10, 1977, petitioner was arrested and charged with the murder of Ms. Allen. Two weeks later, on January 24, attorneys A. J. Welch, Jr. and Rod Meadows were appointed to defend petitioner by the Honorable Hugh D. Sosebee, the superior court judge who was assigned to the case and who later presided over petitioner's trial. Later that day, a \"committal hearing\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e was held before another superior court judge, the Honorable Sam C. Whitmire.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e On February 9, 1977, a transcript of the committal hearing was filed and placed in the record. Attached to this document was the portion of the transcript from the committal hearing held for Roosevelt Green containing the testimony of the Monroe County sheriff, L.C. Bittick. In his testimony, Sheriff Bittick described the results of tests conducted by Linda Barton, the crime lab serologist, on some seminal fluid found in the body of the victim and on samples of Green's blood and saliva. According to the sheriff, Barton had determined from these tests that the seminal fluid was produced by an individual who had type A blood and was also a \"secretor.\" Barton had determined that Green had type B blood, thus eliminating him as a possible source of the seminal fluid.\n\nOn February 15, 1977, Judge Whitmire presided over a hearing on discovery motions filed by petitioner's counsel. At the conclusion of the hearing, defense attorney Welch advised the court that the State had agreed to provide the defense with copies of \"all the physical evidence . . . including the Crime Lab reports, chemical analysis, and so forth conducted on the physical evidence.\" Welch then made the following motion:\n\nWe would like to make a motion to the Court that an independent research analysis [sic] be appointed by this Court that is not employed by the State of Georgia to examine this evidence to find his own conclusions on behalf of the defendant, to reach his own conclusions, in order that we can first of all, have someone to advise us as to the expertise of the Georgia Crime Lab, whether or not they performed the correct tests, whether or not there could be any variances in the findings of the Georgia Crime Lab, in order that we would have this knowledge available to us.\n\nThe court did not rule on the motion but instead asked Welch to submit the motion in writing.\n\nPetitioner was indicted by the grand jury later that day, thereby eliminating the need for a committal hearing and terminating Judge Whitmire's jurisdiction over the case. See Douglas v. State, 132 Ga. App. 694, 209 S.E.2d 114 (1974). All subsequent proceedings in petitioner's case were handled by Judge Sosebee.\n\nOn February 24, 1977, petitioner's appointed counsel asked the court's permission to withdraw, and the court appointed a new attorney, W. Franklin Freeman, Jr., to represent petitioner. Freeman continued to press the State for copies of any written reports from the crime lab, and he requested the State to provide him with a list of witnesses the State would call at trial. On April 6, 1977, at the request of counsel for each side, the court continued a scheduled pretrial hearing so that both parties could examine the reports of the crime lab. The crime lab issued ten reports, including the reports of Warren Tillman and Linda Barton. On April 15, three days after Freeman received the reports, the State gave him a list of witnesses who would testify at trial.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Tillman and Barton were named as witnesses in that document.\n\nOn the same day, Freeman filed a written motion styled \"Motion to Request the Court to Appoint Criminologist or Other Expert Witness to Assist Defense Counsel and Plea in Abatement.\" The motion alleged the following:\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e (1) petitioner was indigent; (2) petitioner had been indicted for rape and murder; (3) the State had assembled various items of physical evidence including a gun, shoes, clothing, hosiery, foot castings, and had taken from the defendant samples of his blood, saliva, and hair that may have been examined by the Georgia crime lab; (4) some of these items of physical evidence tended to connect petitioner, or a person with physical characteristics similar to his, with the commission of the charged crimes; (5) defense counsel could not determine without the assistance of an expert whether any tests performed by the crime lab were complete or conclusive; and (6) defense counsel believed that a test could be performed on hair samples that \"might conclusively prove whether or not the hair samples found [by the police at the scene of the murder] are those from defendant.\"\n\nAt a motions hearing, also held on April 15, defense counsel called the court's attention to his motion for the appointment of an expert and, when asked by the court if he had anything to say in support of the motion, responded: \"I think everything that I have relative to this would be contained in the motion.\" Shortly thereafter, the court recessed the hearing to give defense counsel further time to prepare a motion to suppress evidence the State had obtained during the search of petitioner's residence on January 15, 1977, five weeks after the murder. Because the court desired to rule on the motion to suppress before it ruled on petitioner's motion for an expert, the court did not at that time rule on the motion for an expert.\n\nAt the next hearing, held on May 4, 1977, the State called Sheriff Bittick to rebut the defense's claim that the warrant issued for the search of petitioner's home was not supported by probable cause. From the sheriff's testimony, Judge Sosebee learned that footprints found near the victim's body appeared to have been made by shoes with a molded, treadless sole, such as a \"Hush Puppy\" brand shoe, and that a pair of \"Hush Puppy\" shoes matching the size of the footprints discovered at the murder scene had been found in petitioner's home five weeks later. Following the sheriff's testimony, the court denied the motion to suppress. The following discussion then ensued.\n\nBY MR. FREEMAN: I think my next motion was a motion to request the Court to appoint an expert witness and incorporated in that was the plea in abatement.\n\nBY THE COURT: Plea in abatement on what grounds?\n\nBY MR. FREEMAN: Well, it's generally stated. I think in trying to paraphrase the motion, we contend that we're entitled because of the peculiar circumstances of this case, we're entitled to an expert witness to assist us in deciphering evaluations made by the Crime Lab or possibly conducting other tests on their own. We recognize, apparently, that there's no statutory right for this, but argue to the Court that an absence of such a statutory right to obtain an expert witness or procedure where we can have this made available to us, constitutes a procedural and due process violations and that the absence of this is a constitutional question and that the indictment should be abated because there's no statutory arrangement where this can be granted.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nBY THE COURT: Is that all on that motion?\n\nBY MR. FREEMAN: Yes, sir, it's all pretty well set out in the motion, I believe, Your Honor.\n\nBY THE COURT: Does the State have anything else that you want to say in response to this particular motion?\n\nBY MR. WALDREP: No, sir, Your Honor. Of course, the State has expert witnesses or people that are expert in these fields employed to do these investigations. They don't actually represent -- work for us or work for the defendant, they just analyze these items when they're sent to them at the State Crime Laboratory and whatever the results are, that's what they are. We say, of course, that he doesn't have any right to have someone else appointed and actually, when you really look to the substance of it, I don't know who the Court would appoint to do something like that and the only people that the State to do those type things are the people at the Crime Laboratory.\n\nBY THE COURT: The Court will overrule that motion in its entirety.\n\nSeveral minutes after this discussion the court took a brief recess. When the court was reconvened, defense counsel made the following statement:\n\nBY MR. FREEMAN: Your Honor, could I put something else in the record before we get on to the Brady motion? In connection with the motion to appoint a criminologist which the Court has already overruled, I didn't have this letter with me, didn't have it in front of me at the time but the District Attorney was stating that there wasn't anybody available that could be appointed. I just wanted to state in our place that we do have somebody that's available, is Dr. W. L. Woodford, 585 Lakeshore Drive, N. E., Atlanta, and who, we think, would charge approximately $1500.00 to make some of these tests and perform some of this analyses, so we do have someone that's available, if the Court had seen fit to appropriate the money for it. I just wanted to put that in the record.\n\nPetitioner never renewed his motion for the appointment of an expert either prior to or during his trial. In determining the merits of petitioner's request for expert assistance, therefore, we consider only the facts available to Judge Sosebee on May 4, when he ruled on petitioner's motion for the appointment of an expert.\n\nThe facts available to Judge Sosebee came from four sources: the transcript of petitioner's January 24, 1977 committal hearing before Judge Whitmire; the transcript of the testimony Sheriff Bittick gave at Roosevelt Green's committal hearing held the same day;\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e the evidence presented at the May 4, 1977 suppression hearing before Judge Sosebee; and petitioner's written motion for the appointment of a criminologist or other expert. The transcript of petitioner's committal hearing described the murder scene and how Ms. Allen died. It also contained the testimony of the key prosecution witness, Thomas Pasby, who related what petitioner had told him about the robbery of the Majik Market and the kidnapping, rape, and murder of Ms. Allen. The transcript of Sheriff Bittick's testimony disclosed that Linda Barton, the serologist, had tested seminal fluid removed from the victim's body, that the fluid had come from a person possessing type A blood, and that Roosevelt Green had type B blood. It also revealed that Barton had determined that Roosevelt Green's hair was present on some gloves the police found at the murder scene.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The May 4 suppression hearing informed Judge Sosebee that footprints found near the victim's body appeared to have been made by shoes similar to those found in petitioner's bedroom when the police searched his residence.\n\nPetitioner's motion and the statements his lawyer made in support of the motion\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e provided Judge Sosebee with little additional information about the State's case and petitioner's need for expert assistance. Liberally read, the motion informed the court that the State had collected various items of evidence from the crime scene, the petitioner's home, and the petitioner's body (blood, saliva, hair) and that some of this evidence may have been examined at the state crime lab. The motion also informed the court that certain undescribed tests performed by experts at the crime lab may have buttressed the State's claim that petitioner was present when the rape and murder took place.\n\nIn sum, the information before Judge Sosebee from these four sources indicated the following: first, that the State, on the basis of petitioner's admissions to Thomas Pasby, could establish that petitioner and Roosevelt Green robbed the Majik Market and kidnapped, raped, and murdered Ms. Allen; second, that the hair tests performed by Linda Barton placed Green at the scene of the murder, but that the tests she performed on seminal fluid taken from the victim's body cast some doubt on whether he had raped the victim;\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e third, that someone at the state crime lab, comparing plaster casts of footprints at the murder scene with shoes later found in petitioner's bedroom, could testify that a person wearing shoes like petitioner's may have been present when Ms. Allen was murdered. The information did not disclose, and petitioner's counsel did not speculate about, any connection between petitioner's blood, saliva, and hair and the crimes in question; nor did counsel indicate what tests the state crime lab may have conducted on those samples. All Judge Sosebee knew was that petitioner's lawyer wanted an expert of some kind to review any tests the state crime lab may have performed and to conduct an unspecified number of tests that counsel declined to describe.\n\nWe do note that, on April 12, 1977, three days before petitioner's attorney presented his motion for the appointment of an expert to Judge Sosebee, the prosecutor gave him copies of the reports he had received from the state crime lab and the names of the experts who had authored the reports and would testify for the prosecution. Inexplicably, petitioner's counsel never informed Judge Sosebee what those reports disclosed or the areas of expertise of the persons who had made them and, presumably, would testify at trial. Counsel also failed to inform Judge Sosebee whether he had interviewed the State's experts about any tests they may have performed and, if not, whether they would be amenable to such interviews. A thorough study of the crime lab reports and interviews with the authors of the reports may have eliminated any need for expert assistance. At the very least, if defense counsel had been more diligent in his study and more specific in his motion, Judge Sosebee would have been more fully apprised of the prosecution's case and of the defense's need, if any, for expert assistance.\n\nWe also observe that petitioner did not advise the court about the kind of expert he desired or the role the expert would play. The motion merely requested the court to appoint a \"criminologist or other expert witness.\" It is clear, however, that petitioner did not desire a \"criminologist\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e but instead wanted an expert or experts whose expertise matched that of each of the State's experts. Of course, because petitioner did not inform the court about the expertise of any of the State's witnesses, the court could not have known exactly what type of expert petitioner needed or requested. On May 4, after the court had heard argument of counsel and ruled on petitioner's motion, defense counsel did offer the name of an expert who \"was available to be appointed,\" but he did not inform the court of that person's expertise or what he could have contributed to the defense.\n\nPetitioner's motion, considered in the light of the record before Judge Sosebee when he made his dispositive ruling, failed to create a reasonable probability that expert assistance was necessary to the defense and that without such assistance petitioner's trial would be rendered unfair. We accordingly hold that the trial court did not err in denying petitioner's motion.\n\nHaving concluded that the trial court did not err in denying petitioner's motion for the appointment of an expert, we need not determine whether at trial petitioner's failure to obtain the requested assistance in fact deprived him of the ability to present his defense.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Thus, we affirm the district court's rejection of petitioner's due process claim.\n\nIII.\n\nAs we have indicated in Part I.A., supra, the State's key witness was Thomas Pasby. In fact, without Pasby's testimony, it is doubtful whether the case would have gone to the jury. There were no eyewitnesses to the robbery of the Majik Market or to the kidnapping, rape, and murder of Ms. Allen, and the physical evidence and expert opinion testimony the prosecution presented merely suggested that petitioner could have been a perpetrator of these crimes.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe State had a much stronger case against Roosevelt Green; he had been caught red-handed in South Carolina with the murder weapon and the victim's car, and several witnesses placed him in Cochran on the day the crimes were committed. Green could have explained how he obtained possession of the murder weapon and Ms. Allen's car, why he was in Cochran on the day of the crime, why he had petitioner's and Pasby's telephone numbers in his possession, and why he called Pasby's home after he was arrested in an effort to inform petitioner that he was in jail in South Carolina. But Green was unavailable as a prosecution witness; he was a fugitive, having escaped from the Monroe County jail prior to his indictment. Green's availability as a witness depended on his being apprehended and on his willingness to testify.\n\nPasby was the only witness the State had who could explain how the crimes were committed. Relating the admissions petitioner made to him on January 1, 1977, Pasby told the jury about petitioner's past association with Green, how petitioner and Green robbed the Majik Market and kidnapped Ms. Allen, and about the rape and murder. The remainder of the prosecution's case was principally devoted to corroborating Pasby's testimony; none of it, independently or circumstantially, placed petitioner with the victim at any time during the robbery, kidnapping, rape, or murder with the certainty required by the criminal law.\n\nTo obtain petitioner's conviction, the prosecutor obviously had to convince the jury to accept Pasby's testimony. To accomplish this task, the prosecutor had to confront Pasby's criminal record, which posed a substantial threat to his credibility if fully comprehended and exploited by defense counsel. The basis of the claim we now consider is the prosecutor's handling of Pasby's criminal record, especially prior to petitioner's trial when the court, in response to petitioner's Brady and Giglio motions, instructed him to disclose that record and any promises the State may have made to Pasby for his testimony.\n\nA prosecutor has a duty to provide an accused with all evidence in the state's possession materially favorable to the accused's defense. Brady v. Maryland, 373 U.S. 83, 87, 83 S. Ct. 1194, 1196-97, 10 L. Ed. 2d 215 (1963). A prosecutor's failure to produce such evidence may necessitate a retrial \"irrespective of the good faith or bad faith of the prosecution.\" Id. at 87, 83 S. Ct. at 1197. When the defendant's guilt or innocence may turn on the reliability of a witness, the prosecutor's nondisclosure of evidence affecting the credibility of the witness falls within this general rule. See Napue v. Illinois, 360 U.S. 264, 269, 79 S. Ct. 1173, 1177, 3 L. Ed. 2d 1217 (1959). Promises made by the state to a witness in exchange for his testimony relate directly to the credibility of the witness. A prosecutor has a duty to disclose evidence of any promises made by the state to a prosecution witness in exchange for his testimony. Giglio v. United States, 405 U.S. 150, 92 S. Ct. 763, 31 L. Ed. 2d 104 (1972). This is especially true when the testimony of the witness is essential to the state's case. See Haber v. Wainwright, 756 F.2d 1520, 1523 (11th Cir. 1985).\n\nPetitioner claims that the prosecutor breached his Brady/Giglio duty by deliberately withholding from the defense material portions of Thomas Pasby's criminal record which, if considered in light of the portions of Pasby's criminal record the prosecutor did disclose, suggest that Pasby had either been given immunity from prosecution by the State for his testimony or thought he had been given such immunity. The district court rejected petitioner's claim without an evidentiary hearing. The court concluded that an evidentiary hearing was unnecessary because the state habeas court had already given petitioner a full, fair, and adequate hearing on his claim and found that the State had made no promises to Pasby for his testimony. That finding, according to the district court, was entitled to a presumption of correctness under 28 U.S.C. ยง 2254(d) (1982) and foreclosed petitioner's claim. We conclude that petitioner did not receive a full, fair, and adequate hearing in the state habeas court; accordingly, its findings of fact carry no presumption of correctness.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e As the following discussion makes clear, in order to resolve the merits of petitioner's Brady/Giglio claim, an evidentiary hearing must be held.\n\nThe importance of Pasby's criminal record to petitioner's defense first became apparent at petitioner's \"committal hearing\" held on January 24, 1977.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The Superior Court of Monroe County convened the hearing to determine whether there was probable cause to bind petitioner over to the Monroe County grand jury on charges that he participated in the rape and murder of Ms. Allen. Because Monroe County is in the Flint Judicial Circuit, the district attorney of that circuit,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e E. Byron Smith, and his assistant, Kenneth Waldrep, presented the State's case. Two court-appointed attorneys, A. J. Welch, Jr., and Rod Meadows, represented petitioner.\n\nPasby was the State's principal witness at the committal hearing. Pasby began his testimony by explaining that he had been transported to the hearing (which was being held in Forsyth, the Monroe County seat) from the Bleckley County jail (in Cochran) where he had been held for some twenty days on a charge of theft by taking (involving a 30.06 caliber hunting rifle, the same type of rifle used to murder Ms. Allen).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See O.C.G.A. ยง 16-8-2 (1982); see also infra note 43. Pasby then proceeded to tell the court that, on January 1, while he and petitioner were driving from Cochran to Hawkinsville so that petitioner could examine an automobile he was thinking of purchasing, petitioner confessed to him that on December 12, 1976, he and Green robbed the Majik Market, kidnapped and raped Ms. Allen, and that he shot her to death with a 30.06 rifle. At the conclusion of Pasby's direct examination, the district attorney asked Pasby whether he had been induced to testify by promise or threat, and he replied that he had not.\n\nOn cross-examination, Pasby revealed that since his arrest and confinement in the Bleckley County jail on January 4, he had been questioned extensively by the Bleckley County sheriff's office (in whose jurisdiction the Majik Market robbery and the Allen kidnapping had occurred), the Monroe County sheriff's office (in whose jurisdiction the rape and murder had occurred), and the Georgia Bureau of Investigation (GBI) (which had jurisdiction over all of the crimes) about the December 12 events, and that the questioning had been tape recorded. Pasby admitted that when the officers initially questioned him he denied having any knowledge of those events. He did not break down and tell them of petitioner's confession to him on January 1, he said, until a subsequent interrogation, after he concluded that it would be in his best interest to cooperate.\n\nIn an effort to learn more about the circumstances surrounding Pasby's decision to cooperate with the police, the defense called the Bleckley County sheriff to the stand. He confirmed that his office, the Monroe County sheriff's office, and the GBI had interrogated Pasby about the Allen murder on several occasions, perhaps as many as six, and had tape recorded each session. He added that Pasby did not disclose petitioner's and Green's involvement in the crimes until the second or third interrogation. At the conclusion of the committal hearing, the court, principally on the basis of Pasby's testimony, found probable cause to hold petitioner in custody for the rape and murder of Ms. Allen pending the grand jury's investigation.\n\nPetitioner's attorneys were concerned that Pasby had testified against petitioner at the committal hearing because he had made a deal with the prosecutor: the State would drop the pending theft by taking charge in Bleckley County and withhold the prosecution of any other crimes Pasby may have committed if Pasby testified against petitioner at his committal hearing and then at trial. Counsel consequently moved the Superior Court of Monroe County for an order directing the district attorney to divulge Pasby's complete criminal record and any promises he or any other state prosecutor or law enforcement official may have made to Pasby to induce him to testify against petitioner.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The superior court heard the motion on February 11 and 15, 1977. Petitioner's lawyers argued that they were entitled to such information under Giglio v. United States, 405 U.S. 150, 92 S. Ct. 763, 31 L. Ed. 2d 104 (1972), and that, depending on the prosecutor's disclosures, they might ask the court to reconvene the committal hearing. They suggested that the prosecutor run Pasby's name through the \"law enforcement computer.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The prosecutor, in response, argued that he was not required to conduct a record search to determine Pasby's criminal record, adding that to his knowledge Pasby had no record other than the theft by taking charge Pasby alluded to at petitioner's committal hearing. The court ruled that the prosecutor did not have to search for Pasby's criminal record; rather, it would be sufficient if he simply gave defense counsel copies of any documents he had in his possession indicating that Pasby had been arrested or convicted. The prosecutor produced none.\n\nOn February 15, 1977, the Monroe County grand jury indicted petitioner and Green for the rape and murder of Ms. Allen. A few days later, petitioner's attorneys moved the court for leave to withdraw for personal reasons. The court granted their motion and appointed W. Franklin Freeman, Jr. to represent petitioner.\n\nOn April 15, 1977, Freeman renewed petitioner's previous motion to require the district attorney to disclose Pasby's full criminal record and any deals the State may have made with Pasby to obtain his testimony. Freeman also moved the court to require the prosecutor to produce the tape recordings, and the transcripts thereof, of all interviews the sheriff's offices of Monroe and Bleckley Counties and the GBI had conducted with Pasby or any other prosecution witness, contending that they constituted Brady material. The superior court heard argument on the motion the same day.\n\nIn presenting his motions, Freeman asked the court to require the district attorney, Smith, in carrying out his Brady/Giglio duty, to disclose whether the State had granted Pasby immunity from prosecution for any offense. The court, agreeing that petitioner was entitled to the requested disclosure, asked the district attorney whether the State had made any promises to Pasby for his cooperation. Smith responded that his office had made none. Freeman was dissatisfied with Smith's response and asked the court to require Smith to disclose any promises made to Pasby by any other prosecutor or by any law enforcement official. Freeman reminded the court that in Bleckley County, Pasby was facing a felony charge, theft by taking, which was being prosecuted by the district attorney for the Oconee Judicial Circuit, and that he was concerned that Pasby's cooperation with Smith's office might have an effect on the disposition of that charge. Smith told the court that he could not speak for the district attorney of the Oconee Judicial Circuit. Smith did say that he had spoken to the Bleckley County sheriff and that the sheriff had assured him that Pasby had not been granted immunity from prosecution on the theft by taking charge. The court agreed with Smith that he did not have to consult with the district attorney for the Oconee Judicial Circuit, concluding that Smith would be in compliance with the Brady and Giglio holdings if, upon learning of any promises to Pasby, he disclosed them to petitioner's counsel. The court and the prosecutor ended the discussion concerning the status of Pasby's criminal record with the following colloquy:\n\nBY THE COURT: All right, let me ask Mr. Smith, does the State have any information of a criminal record of any witness that you expect to use, including any and all charges which may be pending and which have not been officially disposed of by plea, trial or otherwise?\n\nBY MR. SMITH: Your Honor please, the only one that I can think of is the crime that's charged against Thomas Pasby [i.e., the rifle theft charge pending in Bleckley County]. I'm aware of that.\n\nBY THE COURT: Is that the only --\n\nBY MR. SMITH: That's the only one I know about.\n\nBY THE COURT: Is that the only person that you might use? Mr. Freeman, are you familiar with what he's talking about, the charge against Mr. Pasby?\n\nBY MR. FREEMAN: I'm familiar that there is a charge. I'm not familiar with --\n\nBY THE COURT: Do you know where it's pending?\n\nBY MR. FREEMAN: I understand that it's pending in the Oconee Judicial Circuit.\n\nBY THE COURT: Bleckley County?\n\nBY MR. FREEMAN: I assume that it's in Bleckley County but I couldn't state that affirmatively.\n\nBY THE COURT: Mr. Smith, do you know what county it's in?\n\nBY MR. SMITH: Your Honor, I was under the impression that it was in Hawkinsville but I'm not -- [the Bleckley County sheriff] is in Court. I can't keep those counties in my mind.\n\nBY THE COURT: If it's in Hawkinsville, that's Pulaski County. Well, it seems to me that this particular request as to this witness can be resolved and Mr. Smith says he's not aware of any record against any other person, so I will consider that as having been answered.\n\nThe court then turned to the defense request that the prosecutor produce the tape recordings and transcripts of the State's interrogation of prosecution witnesses. It advised the prosecutor that the defendant was entitled under Brady to all evidence in the State's possession materially favorable to his defense. Petitioner's counsel asked the court to listen to the tapes in camera and to make this determination. The court deferred its ruling on counsel's request to allow the prosecutor to examine his file for Brady material, and the hearing concluded.\n\nOn May 4, 1977, the district attorney filed a formal response to petitioner's Brady request, asserting that\n\ncounsel for the State has no tape recordings or transcripts of recordings of interviews [with various persons concerning the investigation of the Allen murder] in its file. We have reason to believe that some interviews were taped. However, these tapes are most probably in the possession of the various law enforcement agencies.\n\nThe response also stated that the prosecutor had provided defense counsel with a description of the theft by taking charge, involving the theft of a 30.06 caliber rifle, pending against Pasby in Bleckley County, and would provide any additional information the State received concerning the criminal record of any prosecution witness. That same day, the court resumed the hearing on defense counsel's request that the court listen to the tapes in camera to determine whether they contained information favorable to the accused. The prosecutor informed the court that he could not produce the tapes, because he did not have them. All that he had, he said, were summaries of some of the tapes.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e He further represented that only one of them constituted Brady material and that he had given a copy of that summary to defense counsel.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe court agreed with the prosecutor that Brady did not require him to produce material that was not in his actual possession. At this point, the court announced that it would examine in camera the material the prosecutor did have in his possession, his \"file,\" and took a brief recess for that purpose. At the conclusion of its examination, the court ordered the prosecutor to provide the defense with seven additional summaries of interviews conducted during the murder investigation.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The court also ordered the prosecutor to provide defense counsel with a statement Pasby had given to a special agent of the GBI. The court ruled that, although the statement incriminated petitioner, it constituted impeachment evidence because Pasby made the statement only after the agent warned him that he could be viewed as aiding and abetting the murder of Ms. Allen if he concealed information about it from the authorities.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nPetitioner went to trial on June 6, 1977. The trial lasted four days. Pasby testified for the prosecution, relating what we have recited in Part I.A., supra. Shortly after calling Pasby to the witness stand, the district attorney asked Pasby about his arrest and confinement in the Bleckley County jail on January 4, 1977, for stealing a 30.06 caliber rifle, and inquired as to the disposition of that charge. Pasby said that the charge had been dropped, and that he had been released from the Bleckley County jail because the State could not prove its case.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nAfter examining Pasby about the stolen rifle charge, the prosecutor had Pasby relate in detail what petitioner told him on January 1, 1977, concerning the robbery of the Majik Market and the kidnapping, rape, and murder of Ms. Allen. Then, at the conclusion of his direct examination, the prosecutor returned to the matter of Pasby's criminal record, asking Pasby whether he had ever been convicted of a felony. Pasby replied: \"I went to court twice; once I went for DUI and driving without a license. . . . I went once for theft by taking . . . a case involving three people and some rings [worth] $300 and something.\" When the prosecutor asked him whether he went to trial or pled guilty to the theft offense, Pasby stated: \"I entered a plea of guilty.\" Precisely what Pasby said immediately thereafter is not disclosed by the record, because the remainder of Pasby's testimony on direct examination, consisting of one page, is missing from the transcript of petitioner's trial. According to petitioner's habeas attorney, Pasby told the jury that he received a one-year probation sentence as a result of that guilty plea.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn his cross-examination, petitioner's attorney made no attempt to impeach Pasby with his criminal record. Instead, he sought to discredit Pasby's story about petitioner's confession to him by getting Pasby to admit that when the police initially questioned him he denied any knowledge of the Allen murder and by suggesting that Pasby concocted petitioner's confession after the GBI agent threatened him with prosecution for aiding and abetting the murder if he refused to cooperate. Counsel pursued the same theme in his closing argument to the jury, arguing that Pasby or Green committed the murder while petitioner was at home sleeping off a drinking spree. The jury was not persuaded, however, and apparently giving Pasby's testimony full credence, found petitioner guilty as charged.\n\nIn his direct appeal to the Supreme Court of Georgia, petitioner argued that he was entitled to a new trial because the State made a bargain with Pasby for his testimony and failed to disclose that fact to his attorney. The court rejected his argument because the record contained no evidence of such an agreement; all that it contained was counsel's bald allegation that a deal had been made. Moore v. State, 240 Ga. 807, 812, 243 S.E.2d 1, 6, cert. denied, 439 U.S. 903, 99 S. Ct. 268, 58 L. Ed. 2d 249 (1978).\n\nHaving lost his argument in the supreme court, petitioner, represented by a new attorney, Robert K. Kates, turned to the Superior Court of Butts County for habeas corpus relief.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e On March 26, 1979, the court held an evidentiary hearing on his claims.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Prior to the hearing, Kates learned that Pasby was on probation at the time of petitioner's trial, having been sentenced on a plea of guilty by the Superior Court of Bleckley County on November 10, 1977, to the felony of theft by taking, a charge involving the theft of $300 worth of rings. Kates located Pasby's probation officer, Robert E. Baker, who had left the probation service prior to petitioner's trial and moved to Florida. From Baker, Kates discovered that on January 5, 1977, the day after Pasby's arrest and confinement in the Bleckley County jail on the stolen rifle charge, Baker made out a \"delinquency report,\" recommending that Pasby's probation be revoked and requesting his sentencing judge to initiate the revocation proceeding by issuing a warrant for his arrest. Armed with this information, Kates amended petitioner's habeas petition to allege that this information was material to the issue of Pasby's credibility and that the district attorney's failure to disclose it prior to petitioner's trial violated the principles of Brady. Kates further alleged that Pasby had testified under a grant of immunity, whereby the State agreed not to prosecute him on the stolen rifle charge or to revoke his probation if Pasby incriminated petitioner at trial.\n\nWhen the March 26 evidentiary hearing began, petitioner's counsel informed the court that he had subpoenaed Alan Marchant, chief probation officer of the Oconee Judicial Circuit, along with Pasby's probation file, and that he intended to ask Marchant to disclose the contents of the file. The State, now being represented by an assistant state attorney general, objected to the procedure, contending that Pasby's probation file was confidential because Pasby had been sentenced under Georgia's first offender act, O.C.G.A. ยง 42-8-60 (1985),\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e and that the act prohibited the disclosure of the file's contents to petitioner's attorney. See O.C.G.A. ยง 42-8-65 (1985).\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The court agreed that Pasby's probation file was confidential and sustained the State's objection to the wholesale disclosure proposed by petitioner's counsel. At the same time, the court recognized that the State could not use the confidentiality requirement of the first offender act as a means of avoiding its duties under the Constitution -- specifically, those defined by Brady and Giglio -- and ruled that petitioner was entitled to be informed of anything in the file material to Pasby's credibility or indicating that the State had made a deal with Pasby for his testimony against petitioner. The State suggested that the court examine the file in camera. The court did so and announced that nothing in the file indicated that the State made any promises to Pasby for his testimony.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Counsel then asked the court whether anything in the file revealed the disposition of Pasby's probation revocation proceeding, which had been initiated when the Superior Court of Bleckley County issued the warrant for Pasby's arrest on January 5, 1977. The court refused to answer the question, implying that the first offender act's confidentiality provision prohibited it from revealing that information. The court placed Pasby's probation file under seal and made it a part of the record of the habeas proceeding. At the conclusion of the hearing, the court denied petitioner's Brady/Giglio claim. The Supreme Court of Georgia, in denying petitioner's application for a certificate of probable cause to appeal, declined to review that ruling.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nPetitioner thereafter brought this habeas corpus action in the district court. In his petition, he again alleged that the state prosecutor breached his Brady/Giglio duty by withholding from defense counsel material portions of Pasby's criminal record and that Pasby received prosecutorial concessions from the State in return for his testimony. He asked for an evidentiary hearing so that he could prove his allegations. The state attorney general, in answering the petition, contended that an evidentiary hearing was unnecessary because the state habeas court had given petitioner a full, fair, and adequate hearing, and its finding that the State made no promises to Pasby for his testimony was presumptively correct. See 28 U.S.C. ยง 2254(d) (1982). Based on the State's answer, to which the records of petitioner's criminal trial and state habeas corpus proceedings -- with the exception of Pasby's sealed probation file -- were annexed as exhibits,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e the magistrate to whom the case had been referred concluded that the state habeas court accorded petitioner a full, fair, and adequate hearing on his claim. Acting pursuant to section 2254(d), the magistrate adopted the state court's finding that no promises had been made to Pasby for his testimony. The magistrate accordingly recommended in his report to the district court that it deny petitioner's Brady/Giglio claim on the basis of the state court habeas record, without an evidentiary hearing. Petitioner objected to the magistrate's report and recommendation, attaching to his objection what he represented to be a copy of Pasby's probation file. Petitioner asked the district court to examine the file and to convene an evidentiary hearing on his Brady/Giglio claim. The district court denied petitioner's request for an evidentiary hearing and, without alluding to petitioner's objection or to the attached probation file, adopted the magistrate's report and denied relief.\n\nPasby's probation file, which for purposes of this appeal we assume to be genuine,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e viewed against the background of petitioner's criminal prosecution, suggests that when the State called Pasby to the witness stand at petitioner's trial, the prosecutor was withholding from the defense critical information concerning Pasby's criminal record. Such information, if fully comprehended and exploited by defense counsel, might have led the jury to conclude that Pasby testified against petitioner because the State had given him immunity from all prosecution or because he thought the State had given him such immunity, and that his testimony implicating petitioner in the Allen murder was thus not worthy of belief.\n\nAccording to the documents contained in the probation file, Pasby was arrested on November 1, 1976, for committing the felony of theft by taking, see O.C.G.A. ยง 16-8-2 (1982);\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e he had allegedly stolen some rings valued at $300. On November 10, 1976, Pasby, using the name Thomas Moss, presumably his true surname,\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e pled guilty to the charge in the Superior Court of Bleckley County and, because it was his first felony offense, the court sentenced him under the first offender act, O.C.G.A. ยง 42-8-60 (1985).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e This act authorized the court, without adjudicating Pasby's guilt, to \"defer further proceedings and place [Pasby] on probation . . . or [to] sentence [him] to a term of confinement as provided by law,\" i.e., for a prison term of up to ten years, the maximum penalty provided by law for committing the offense of theft by taking. The court sentenced Pasby, as Thomas Moss, to twelve months in prison, suspended the execution of that sentence, and placed him on probation for a term of one year, until November 10, 1977. The conditions of Pasby's probation required, among other things, that he violate no penal laws, that he avoid \"persons . . . of disreputable character,\" and that he maintain \"general good behavior.\"\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e If Pasby failed to abide by any of the conditions of his probation, the court could revoke it, adjudge him guilty of the theft offense to which he had pled guilty, and \"proceed as otherwise provided by law.\" O.C.G.A. ยง 42-8-60(b) (1985).\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e In addition, if he committed a new crime, Pasby could lose the benefit of his first offender status, and his unadjudicated guilty plea to theft by taking would be considered a prior conviction for purposes of the habitual offender act. See O.C.G.A. ยง 17-10-7(a) (Supp. 1985).\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nOn December 13, 1976, the day after the Majik Market robbery and Ms. Allen's disappearance, the GBI's Crime Information Center in Atlanta issued two reports \"for official use only\": one on \"Thomas Pasby Moss,\" \"SID number GA00521109;\" the other on Thomas Pasby. The reports were based on information furnished to the Center by \"FBI and/or Georgia Fingerprint Contributors\"\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e and indicated respectively that Moss and Pasby had been placed on probation for one year as the result of an arrest on November 1 and a subsequent conviction for theft by taking. Pasby's probation file does not reveal who requested these reports or when they were placed in the file. Nor does the file indicate the existence of any relationship between the reports and the Majik Market robbery and Ms. Allen's disappearance, beyond the simple fact that the reports were issued one day later.\n\nOn January 5, 1977, the day after Pasby was arrested and confined in the Bleckley County jail for stealing a 30.06 caliber hunting rifle, Pasby's probation officer, Robert E. Baker, submitted a \"delinquency report\" to the sentencing judge, requesting that he issue a warrant for Pasby's (i.e., Moss') arrest for failing to comply with the conditions of his probation. The warrant issued immediately, directing the Bleckley County sheriff to take Thomas Moss into custody; the sheriff executed the warrant the next day, January 6. At this time, Pasby was being held in the county jail for two reasons: for allegedly stealing a rifle, a felony, and for allegedly violating the conditions of his probation. His probation file does not indicate how long Pasby was detained for either reason. We do know, with respect to the probation revocation matter, that Georgia law required the sheriff, on executing the arrest warrant issued by Pasby's sentencing judge, to bring Pasby before the judge \"forthwith,\" O.C.G.A. ยง 42-8-38(a) (1985), and authorized the judge to \"commit him or release him with or without bail to await further hearing or [to] dismiss the charge.\" O.C.G.A. ยง 42-8-38(b) (1985).\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Pasby testified at trial that he was released from the Bleckley County jail in late March, when the State decided not to prosecute him on the stolen rifle charge, but he said nothing, and the record contains nothing, about the sentencing judge's disposition of the probation revocation proceeding which began with the issuance of the warrant for his arrest on January 5. Nor does the probation file indicate what happened to the stolen rifle charge that triggered the revocation proceeding. Pasby's probation file does indicate, though, that he satisfactorily terminated his probation on November 10, 1977, five months after testifying at petitioner's trial.\n\nBetween Pasby's confinement in the Bleckley County jail on January 4, 1977, and petitioner's indictment forty-two days later, Baker paid several visits to Pasby and also conferred with the Bleckley County sheriff. On occasion, Baker made notes of these contacts and placed them in Pasby's probation file. For example, the file reflects that on January 13, after Pasby had been in custody for nine days, Baker spoke to an investigator in the Bleckley County sheriff's office, who stated that they had a \"good\" case against Pasby but added that Pasby had been \"very cooperative . . . in a wide ranging investigation of stolen firearms, one of which may be [the] murder weapon in the Theresa [sic] Allen case.\" Baker made a note on February 8, apparently after discussing Pasby's situation with the Bleckley County sheriff, that he had informed Pasby that the sheriff \"said he would put in a good word for him when his case comes up because of his cooperation.\"\n\nThe information contained in Pasby's probation file, considered in the light of what was known to defense counsel when petitioner's trial began, raises several questions -- none of which petitioner's jury or attorney could have recognized -- about Pasby's status in Georgia's criminal justice system at the time he testified. The most obvious question is whether Pasby was still awaiting a probation revocation hearing. If he was, his testimony at petitioner's trial provided ample evidence that he had violated two of the conditions of his probation.\n\nFirst, Pasby had engaged in conduct proscribed by the criminal laws of Georgia. Pasby's probation could have been revoked if the State had decided to prosecute him on the stolen rifle charge and obtained a conviction.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e Even in the absence of a conviction, Pasby's sentencing judge could have revoked his probation if satisfied that Pasby had, in fact, stolen the rifle. Pasby's conduct on two other occasions may have warranted revocation of his probation for violating the criminal law. Pasby testified that he was with petitioner the night petitioner stole the 30.06 caliber rifle that eventually became the murder weapon. Arguably, Pasby aided and abetted the theft. At the very least, he was an accessory after the fact. Pasby also admitted that for several days following his arrest on January 4, 1977, he refused to tell the police what he knew about the Allen murder. The police considered Pasby's recalcitrance potentially criminal and so advised him.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nSecond, Pasby had associated with \"persons . . . of disreputable character.\" Pasby provided evidence of his failure to comply with this condition of probation when he admitted that he had associated with petitioner, an ex-convict, and Roosevelt Green, an escaped convict, both before and after the Allen murder.\n\nAnother question the record does not answer is the total prison sentence Pasby faced if he refused to testify for the prosecution at petitioner's trial. Petitioner's attorney knew that Pasby could receive a ten-year sentence if convicted of the stolen rifle charge, see O.C.G.A. ยง 16-8-12 (1) (1982);\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e counsel did not pursue this point in cross-examining Pasby, however, because he had been told that the State could not prove Pasby's guilt. What petitioner's attorney did not know was that Pasby was on probation at the time he was testifying, that probation revocation proceedings had been instituted against him, and that he faced a possible ten-year prison sentence if his probation was revoked.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nFinally, the question still remains whether Pasby testified under a formal or informal grant of immunity and, if so, the extent of that immunity, or whether, absent such a grant, Pasby thought he had immunity. Pasby freely admitted engaging in conduct which, at the very least, warranted the revocation of his probation; yet, the conduct went unpunished. Petitioner is entitled to inquire whether the State promised Pasby that it would go unpunished. He is also entitled to pursue the answers to the other questions the record poses.\n\nIn sum, our review of Pasby's probation file, in the context of the entire record, convinces us that it contained information highly relevant to petitioner's Brady/Giglio claim. The state habeas court, in denying petitioner's counsel access to that information, denied petitioner the opportunity to prove his claim. It follows that the state habeas hearing was not full, fair, and adequate; therefore, the findings produced by that hearing regarding the Brady/Giglio claim are not entitled to deference under 28 U.S.C. ยง 2254(d) (1982). The district court erred in adopting them and in denying petitioner an evidentiary hearing. This case must be remanded for that purpose.\n\nIV.\n\nPetitioner contends that the court's instructions to the jury at the sentencing phase of his trial did not clearly and explicitly inform it of its option to impose a life sentence even if it found the existence of a statutory aggravating circumstance. Under Georgia's death sentencing scheme, the jury must first decide whether a statutory aggravating circumstance is present. If such a circumstance exists, the jury may impose a sentence of death. The presence of a statutory aggravating circumstance thus defines the class of persons eligible for the death penalty in Georgia. See generally Zant v. Stephens, 462 U.S. 862, 870-80, 103 S. Ct. 2733, 2739-44, 77 L. Ed. 2d 235 (1983) (referring to Supreme Court of Georgia's answer to certified question).\n\nOnce a statutory aggravating circumstance is found, the jury has the absolute discretion to impose a sentence of life imprisonment or one of death. Id. In exercising this discretion, the jury must consider all evidence in mitigation, extenuation, and aggravation. The jury is not required to \"give any special weight to any aggravating circumstance, to consider multiple aggravating circumstances any more significant than a single such circumstance, or to balance aggravating against mitigating circumstances pursuant to any special standard.\" Id. at 873-74, 103 S. Ct. at 2741. In sum, the finding of any statutory aggravating circumstance makes the defendant eligible for a sentence of death, and the jury must, considering all the evidence, determine whether to impose such a sentence or to impose a life sentence instead.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nGiven Georgia's sentencing scheme, this circuit's case law has established that the eighth and fourteenth amendments require that the trial judge \"clearly and explicitly instruct the jury about mitigating circumstances and the option to recommend against death.\" Spivey v. Zant, 661 F.2d 464, 471 (5th Cir. Unit B 1981), cert. denied, 458 U.S. 1111, 102 S. Ct. 3495, 73 L. Ed. 2d 1374 (1982);\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e see Goodwin v. Balkcom, 684 F.2d 794, 801-02 (11th Cir. 1982), cert. denied, 460 U.S. 1098, 103 S. Ct. 1798, 76 L. Ed. 2d 364 (1983); see also Peek v. Kemp, 784 F.2d 1479 (11th Cir. 1986) (en banc) (instruction upheld where no reasonable juror could have misunderstood his option to impose a sentence of life imprisonment). Similarly, Georgia case law mandates that a death sentence cannot be imposed unless the trial court makes it \"clear to the jury that they could recommend a life sentence even if they found the existence of a statutory aggravating circumstance.\" Fleming v. State, 240 Ga. 142, 146, 240 S.E.2d 37, 40 (1977); see Stynchcombe v. Floyd, 252 Ga. 113, 114, 311 S.E.2d 828, 830 (1984).\n\nPetitioner initially raised the claim that the jury had not been adequately instructed on its option to recommend a life sentence in his first petition for habeas relief filed in state court. The state court denied the petition, holding that the charge to the jury, viewed as a whole, would have informed the jury of its ability to recommend a life sentence even if aggravating circumstances were present. The court focused on language in the instruction telling the jury that, if it found a statutory aggravating circumstance, it would be \"authorized to consider\" whether to impose a death penalty. The court reasoned that the \"authorization\" to consider a death sentence implied the ability not to impose the death penalty. The Supreme Court of Georgia denied a certificate of probable cause to appeal.\n\nPetitioner next raised his jury instruction claim in the instant petition for habeas relief filed in the district court. The district court concluded that the jury instruction met the requirements enunciated in Spivey and Goodwin and denied the petition. As we have indicated in Part I.B., supra, the panel affirmed the district court on this issue. Following the panel's decision and before the initial argument to the en banc court, the Supreme Court of Georgia decided Stynchcombe v. Floyd, 252 Ga. 113, 114, 311 S.E.2d 828, 830 (1984), which held that a jury instruction very similar to the one in this case did not \"include language explaining to the jury that they could recommend a life sentence even if they found the existence of a statutory aggravating circumstance.\" The jury in Floyd, like the jury at petitioner's trial, had been instructed that upon finding an aggravating circumstance it was \"authorized to consider\" imposing a sentence of death. The Supreme Court of Georgia's decision in Floyd therefore made it appear that petitioner's jury instruction claim had been erroneously decided in his initial state habeas proceeding. We held this case in abeyance so that petitioner could present to the Georgia courts any claims he might have arising out of Stynchcombe v. Floyd.\n\nPetitioner then filed a new petition in state court seeking habeas relief. The state habeas court refused to reconsider the merits of petitioner's jury instruction claim because the identical issue had been raised in a previous petition. The court held that Floyd did not represent a change in the law that would warrant the consideration of a subsequent petition but was merely an application of the same law under which petitioner's claim was adjudicated in his first state habeas petition. The petition was therefore dismissed as successive despite the fact that the state trial court had, in the first habeas proceeding, applied the law in a manner inconsistent with the Supreme Court of Georgia's holding in Floyd.\n\nThe Supreme Court of Georgia granted a certificate of probable cause to appeal. The court, agreeing with the trial court's analysis, held that Floyd did not represent new law and that petitioner had not presented grounds sufficient to mandate reconsideration of a claim that had been raised in a previous petition. Accordingly, the Supreme Court of Georgia dismissed the petition as successive. We then received supplemental briefing and heard additional argument from counsel.\n\nWe must determine whether the trial judge's charge, taken as a whole, see Cupp v. Naughten, 414 U.S. 141, 146-47, 94 S. Ct. 396, 400, 38 L. Ed. 2d 368 (1973), adequately informed the jury that it had the option to recommend against death, notwithstanding the presence of a statutory aggravating circumstance. See Goodwin, 684 F.2d at 801-02; Spivey, 661 F.2d at 471. We conclude that it did not.\n\nThe court instructed the jury on certain statutory aggravating circumstances posited by the State. The court then instructed the jury as follows:\n\nIf you find that such statutory aggravating circumstances existed beyond a reasonable doubt . . . then, in that event, you would be authorized to consider imposing a sentence of death.\n\nIf you do not find that such statutory aggravating circumstances existed beyond a reasonable doubt, then you would not be authorized to consider the penalty of death. In that event, the sentence would be imprisonment for life.\n\nIn arriving at your determination as to what sentence is appropriate in each count, you are authorized to consider all of the evidence received here in Court presented by the State and by the defendant throughout the trial before you and the statements made and evidence offered in the pre-sentence hearing that has just been completed in your presence. You are authorized to consider any previous history of criminal activity, if any; you are authorized to include in your consideration, the facts and circumstances, if any, in mitigation and aggravation. Mitigating circumstances are those which do not constitute a justification or excuse for the offenses in question but which in fairness and mercy may be considered as extenuating or reducing the degree of moral culpability or blame.\n\nIn considering mitigating circumstances, you would consider the age of the defendant at the time of the offense, if that has been shown to you, and if it has not, you can form your own opinion as to his age from your observation.\n\nAggravating circumstances are those which increase the guilt or the enormity of the offense and add to those injurious consequences.\n\nIf you find the statutory aggravating circumstances which the Court has enumerated to you which the State contends exist, which the defendant denies, the form of your verdict would be, \"We, the Jury, fix punishment of the defendant, Carzell Moore, on Count I at death and we find the following statutory aggravating circumstances:\"\n\nIf, on the other hand, upon considering this case and all of the facts and circumstances, you impose a life sentence, the form of your verdict would be, on Count I, \"We, the Jury, fix punishment of the defendant, Carzell Moore, on Count I, at life imprisonment.\"\n\nAs to Count II, if you find one or more of the statutory aggravating circumstances which the State contends to exist, existed in this case, and if you have occasion to consider the death penalty, the form of your verdict as to Count II would read: \"We, the Jury, fix punishment of the defendant, Carzell Moore, on Count II at death and we find the following statutory aggravating circumstances:\"\n\nThe instruction told the jury that upon finding an aggravating circumstance it was \"authorized\" to impose a death sentence and that, absent an aggravating circumstance, it was not authorized to consider the penalty of death. The jury was then instructed that if an aggravating circumstance was found \"the form of your verdict would be. . . death.\" This instruction, in mandatory language, informed the jury that it was required to return a sentence of death if it found an aggravating circumstance.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nIt is true that the instruction elsewhere described mitigating circumstances and allowed the jury to consider all of the evidence presented. The fact that the instruction made reference to mitigating circumstances distinguishes it from the instructions employed in Spivey and Goodwin, which omitted any reference to mitigating circumstances. We also agree that the \"authorization to consider\" imposing a sentence of death if the jury found an aggravating circumstance could imply the ability not to impose such a sentence. It is not the same, however, as explaining to the jurors that even upon finding an aggravating circumstance they had the option to recommend a life sentence.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nThe instruction, taken as a whole, at best was contradictory and confusing as to the jury's function if it determined that an aggravating circumstance was present. The jury was told that upon finding an aggravating circumstance its verdict would be death. That portion of the instruction was plainly erroneous and directly contradicted any option to consider a life sentence. It is possible, of course, to lift isolated phrases from the jury instruction and find in those phrases an indication that a death sentence need not have inexorably flowed from a finding of an aggravated circumstance. On the whole, however, the instruction falls far short of providing clear and explicit information to the jury that it had the option not to recommend a sentence of death. An average juror could easily have gotten the impression that the existence of an aggravating circumstance necessitated a death sentence. The court instructed the jury to that effect. The instruction failed to provide clearly and explicitly the constitutionally required guidance. Petitioner's death sentences must therefore be set aside.\n\nV.\n\nPetitioner has also contended that the admission of the testimony of Ms. Allen's father in rebuttal during the sentencing phase of petitioner's trial encouraged the jury to base its decision on a comparison of the characters of Ms. Allen and petitioner, thereby rendering his death sentence unconstitutional because it was based on arbitrary factors. Because we hold, in Part IV, supra, that the trial court's instruction to the jury at the sentencing hearing was constitutionally defective and that petitioner's death sentence must be set aside, we need not address the merits of petitioner's alternate argument. The State may wish to pursue the death penalty, however, thus requiring a new sentencing hearing before a jury, and we therefore feel obligated to comment briefly on one aspect of Mr. Allen's testimony. The State called Mr. Allen in rebuttal as a \"witness to show aggravating circumstances\"; he was the last witness to testify at the sentencing hearing. Mr. Allen testified, over the defense's objection, that at the time of her death, Ms. Allen was almost nineteen years old, had been an honor student in high school, was attending Middle Georgia College on a partial scholarship, had been working part time at the Majik Market to help pay for her education, and desired to become a nurse.\n\nOn direct appeal, petitioner challenged the admissibility of Mr. Allen's testimony. The Supreme Court of Georgia found that his testimony was admissible to rebut an inference that could have been drawn from evidence presented during the guilt phase of the trial that Ms. Allen had participated in the robbery; during the guilt phase of the trial, the defense elicited testimony from Joyce Brown, the assistant manager of the Majik Market, who said that when she arrived at the Majik Market shortly after Ms. Allen was abducted, she discovered the safe unlocked and undamaged. According to the Supreme Court of Georgia, Ms. Allen's participation in the robbery would have constituted a mitigating factor that the State was entitled to rebut.\n\nIn this appeal, the State has also raised an alternative justification, not considered by the Supreme Court of Georgia, for the admissibility of Mr. Allen's testimony. The State now argues that it was seeking to prove the statutory aggravating circumstance that the crimes charged (rape and murder) were committed while the defendant was engaged in the commission of an additional capital felony or aggravated battery (armed robbery or kidnapping as well as rape or murder). See O.C.G.A. ยง 17-10-30(b)(2) (1982). The State contends that the defense could have argued that Ms. Allen participated in the robbery and willingly departed with those who committed it, thus diminishing the State's showing as to this aggravating factor. Thus, the State urges that it permissibly introduced Mr. Allen's testimony to rebut any inference that his daughter was involved in the robbery or willingly accompanied the perpetrators.\n\nAfter reviewing the entire record, we find these arguments unconvincing. In the first instance, under either the rationale advanced by the Supreme Court of Georgia or the alternative justification now advanced by the State, there was no reason to introduce the testimony of Mr. Allen in rebuttal after the defendant had put on his evidence at the sentencing hearing. The defense's case at sentencing consisted of petitioner's reiteration of his innocence, his plea for mercy, and his mother's plea for mercy. Mr. Allen's testimony, purportedly aimed at demonstrating his daughter's lack of involvement in the crime, did not \"rebut\" any evidence the defense adduced at sentencing on that point. Furthermore, the entire thrust of petitioner's defense was his contention that he was not present when the crimes took place. He testified that on the afternoon in question, after drinking a large amount of alcohol, he passed out at his home and was therefore asleep at the time the crimes occurred. At the sentencing hearing, petitioner reasserted his innocence and denied any involvement in the crimes. Given this testimony, it would have been impossible for him to contend that, although he was present at the Majik Market, no armed robbery or kidnapping occurred because Ms. Allen willingly opened the safe and left with him. Such an argument would have been totally inconsistent with petitioner's testimony at trial and at sentencing and was never advanced by the defense. Because it was clear that this argument could not have been made to the jury, Mr. Allen's testimony was not necessary to rebut it, and his testimony could not have been admitted for that purpose. Whether the substance of Mr. Allen's testimony would have been admissible for any other sentencing purpose is an issue that we leave for another day.\n\nVI.\n\nIn conclusion, we affirm the district court's disposition of petitioner's Ake claim for the reasons set forth in Part II and reinstate the panel's disposition of the claims not discussed in this opinion. For the reasons stated in Part III, we remand the case to the district court for an evidentiary hearing on petitioner's Brady/Giglio claim. After disposing of that claim, and depending on its ruling thereon, the district court shall issue a writ of habeas corpus directing the State either to grant petitioner a new trial or to grant him a new sentencing proceeding.\n\nAFFIRMED in part; REVERSED in part; and REMANDED, with instructions.\n\nRONEY, Chief Judge, concurring in part, specially concurring in part, and dissenting in part, in which FAY, Circuit Judge, joins:\n\nI concur in the judgment which reverses the denial of habeas corpus relief on the instruction issue, for the reasons set forth in Judge Tjoflat's opinion.\n\nI concur in reinstating the panel opinion on all other claims not discussed in Judge Tjoflat's opinion.\n\nI specially concur in the denial of relief on the Ake ground for the reasons set forth in both Judge Tjoflat's opinion and Judge Hill's opinion.\n\nI dissent from the grant denial of relief on the Brady/Giglio issue for the reasons set forth in Judge Hill's dissent.\n\nI would not grant relief on the issue concerning the father's testimony for the reasons set forth in Judge Hill's opinion for the panel, in which the discussion was concluded with:\n\nThus, it appears that the prosecution properly presented evidence of characteristics of the victim to the jury. In the brief evidence taken, the prosecution did not undertake to demonstrate the racial, ethnic, or other forbidden characteristic of any party. We cannot say that the trial judge's balancing of the relevancy of Mr. Allen's testimony against its prejudice was constitutionally faulty. We are not prepared to hold that it violates the constitution for the jury to know who it was that was the victim of murder.\n\nMoore v. Zant, 722 F.2d 640, 646 (11th Cir. 1983). To the extent the judgment of the Court denies relief on this issue, I concur; to the extent it grants relief, I dissent.\n\nIn sum, I would reverse the district court's judgment and remand with instructions to grant relief on the instruction issue, but deny relief on all other claims.\n\nGODBOLD, Circuit Judge, dissenting in part and concurring in part:\n\nOn the Ake issue, I respectfully dissent from the opinion and holding of the court (Part II of the opinion by Judge Tjoflat) and I join in Part I of the dissenting opinion by Judge Johnson.\n\nOn the Giglio issue, I concur in the opinion and holding of the court (Part III of the opinion by Judge Tjoflat).\n\nOn the jury instruction issue, I concur in the opinion and holding of the court (Part IV of the opinion by Judge Tjoflat).\n\nOn the comparable worth issue, I concur in Part II of the dissenting opinion by Judge Johnson except the part thereof regarding the jury argument concerning deterrence.\n\nHILL, Circuit Judge, concurring in part and dissenting in part, in which RONEY, Chief Judge, FAY and EDMONDSON, Circuit Judges, and HENDERSON, Senior Circuit Judge, joins:\n\nI concur in the judgment of the court, insofar as the sentence of death is concerned. Without reaching the constitutionality of the instructions given in this case had the judge not misspoke and instructed the jury that if they found an aggravating circumstance their verdict \"would be\" death, I agree that the instructions that were given do not pass constitutional muster. I also agree that petitioner has not shown that, under the Supreme Court's recent decision in Ake v. Oklahoma, 470 U.S. 68, 84 L. Ed. 2d 53, 105 S. Ct. 1087 (1985), he was constitutionally entitled to the assistance of non-psychiatric experts to aid him in his defense. I write separately on that issue because my analysis of that question differs somewhat from that of the majority opinion. I must respectfully dissent, however, from the majority's holding that petitioner is entitled to an evidentiary hearing on the Brady/Giglio claim he presents. I address petitioner's Ake claim in Part I and the Brady/Giglio claim in Part II.\n\nI. NON-PSYCHIATRIC EXPERT ASSISTANCE UNDER AKE v. OKLAHOMA\n\nThe majority opinion concludes that petitioner's due process rights were not violated by the trial court's refusal to appoint experts to assist him in the presentation of his defense because he failed to make the requisite showing that an expert would aid the defense or that the denial of such assistance would result in a fundamentally unfair trial. See Ake v. Oklahoma, 470 U.S. 68, 82-83, 84 L. Ed. 2d 53, 105 S. Ct. 1087 (1985); see also Caldwell v. Mississippi, 472 U.S. 320, n.1, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985). I would not turn the analysis of this issue on that conclusion. Petitioner has probably shown that expert assistance would have aided his defense. I would thus proceed to an analysis of whether, under Ake, petitioner was constitutionally entitled to the expert assistance he sought.\n\nAt the outset I observe that the holding in Ake is simply that where the defendant makes a pre-trial showing that his sanity is likely to be a significant issue in the case he is entitled to the assistance of an independent psychiatrist at state expense if he cannot afford one. The issue of sanity vel non is a peculiar issue in criminal law, and the holding in Ake was principally motivated by the Court's recognition that to prove a valid insanity defense one must necessarily present the testimony of psychiatrists. Analyzing the probable value of the psychiatric assistance sought in Ake and the risk of error in the proceeding if the assistance were not offered, the Supreme Court obviously considered essential to its decision the \"reality that we recognize today, namely, that when the State has made the defendant's mental condition relevant to his criminal culpability and to the punishment he might suffer, the assistance of a psychiatrist may well be crucial to the defendant's ability to marshal his defense.\" Ake, 470 U.S. at 80. The court commented at length upon the arcane nature of the inquiry into whether one is legally insane, noting in particular the indispensable nature of psychiatric testimony in presenting an insanity defense. The issues involved \"inevitably are complex and foreign\" to the common knowledge of jurors, so that \"the testimony of psychiatrists can be crucial and 'a virtual necessity if the insanity plea is to have any chance of success.'\" Id. at 81. The Court therefore held that the state's financial interests must, as a matter of constitutional law, yield to the interests of the state and the defendant in the accuracy of the criminal proceedings in those cases in which the defendant can demonstrate to the trial court before trial that his sanity is likely to be a significant factor in his defense. Id. at 83-84.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThis, of course, is not a case involving the issue of sanity vel non. The defendant interposed a plea of not guilty based on the facts of the offense, not on the condition of his mind. In Ake, the denial of the indigent defendant's request for psychiatric assistance had the necessary effect of almost completely precluding him from presenting any claim of insanity to the jury, regardless of the validity of the defense. In this case, although it appears that appellant might have been aided at trial by the assistance of experts of his own, his inability to obtain their services did not have the necessary effect of preventing him from asserting and supporting his defense.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e A valid claim by the defendant that he was not at the scene of the crime ordinarily may be supported effectively at trial in a wide variety of ways. Regardless of the nature of the prosecution's proof on such an issue, expert testimony constituted but one of the many effective means by which such a claim might be substantiated. In this case, appellant offered little but his own testimony to rebut the evidence presented by the prosecution to show that he was at the scene of the crime when it occurred and had committed it. I certainly would not hold, however, that simply because appellant's defense was weak on the facts and methods of proof otherwise available to him, he was constitutionally entitled to the assistance of experts to help him develop and support his theory of the case before the jury. Further, appellant was not entitled to the assistance of his own experts simply because the state relied in part upon expert testimony to prove its case. The purpose of providing expert assistance to the defendant is not to even the score. The accuracy-enhancing value of affording expert assistance to the defendant and the risk of an erroneous determination of guilt if such assistance is not provided are not increased significantly in a case like appellant's by the extensive use of experts by the state or by the defendant's inability to present any other evidence in support of the defense he chooses to assert. Those circumstances might render expert assistance to such a defense helpful, but they do not render such assistance significantly more essential to the accurate determination of whether the defendant committed the crimes with which he was charged.\n\nTo extend Ake as appellant suggests would impose an extraordinarily far-reaching and costly burden on the states and their taxpayers. There are obviously many important issues in criminal trials whose presentations could conceivably be enhanced by expert testimony. Ake however, is a narrow holding premised upon the peculiar role psychiatric testimony necessarily plays in the assertion of an insanity defense or, in a capital sentencing proceeding, evaluating mental condition as an aggravating or mitigating circumstance. Absent further direction from the Supreme Court, I am convinced that unless non-psychiatric expert assistance is, because of the nature of the issue on which it is sought, as vital to resolution of the issue as psychiatric assistance was in Ake, the Constitution does not require that it be provided in a criminal trial. I therefore agree with the majority that petitioner is not entitled to an evidentiary hearing in the district court on his claim that his constitutional rights were violated when he was tried following the trial court's refusal to provide him with funds to hire experts to aid him in the formulation and presentation of his defense.\n\nII. THE BRADY/GIGLIO CLAIM\n\nMoore claims that his rights under Brady v. Maryland, 373 U.S. 83, 10 L. Ed. 2d 215, 83 S. Ct. 1194 (1963), and Giglio v. United States, 405 U.S. 150, 31 L. Ed. 2d 104, 92 S. Ct. 763 (1972), were violated when the prosecutor failed to reveal certain information that would have aided the defense in its attempts to undermine the credibility of Thomas Pasby. This claim was litigated in the state courts, but in those proceedings Pasby's probation file was not made available to petitioner or his counsel. For that reason, the majority finds that Moore's claim was not fully and fairly litigated in the state proceedings and that the state court's findings are therefore not entitled to the statutory presumption of correctness. The court further holds that an evidentiary hearing is warranted on the claim and remands the case to the district court for that purpose.\n\nThe probation file would have revealed the following facts that the prosecution, according to petitioner, should have disclosed to the defense in a timely manner: (1) that Pasby had been sentenced on November 10, 1976 to serve 12 months in custody and placed on probation, with a condition of probation being that, if he violated the terms thereof, he could be required to serve the balance of the 12 months; (2) that on January 6, 1977 Pasby was arrested for violating the terms of his probation; and (3) that his probation officer had told him that the sheriff of Bleckley County would \"put in a good word for him when his case comes up because of his cooperation\" in some unspecified matter, presumably a \"wide ranging investigation of other stolen firearms, one of which may be [the] murder weapon in the Theresa [sic] Allen case\" mentioned in a previous entry in the report. This information could have been useful to the defense in two respects: (1) It arguably suggests that Pasby may have been led to believe that he would receive special consideration in the probation revocation proceedings in exchange for his cooperation in the Moore case. (2) It could have been used to undermine his credibility by suggesting that perhaps he reasonably believed such consideration might be forthcoming, even if no assurances had been made.\n\nI agree with the majority's conclusion that petitioner has not received a full and fair hearing in the Georgia courts on the Brady/Giglio claim he seeks to raise in this court now.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The question before this court then becomes whether the allegations of Moore's complaint, supported as they are by the probation file, warrant an evidentiary hearing in the district court. The majority opinion holds that they do, relying heavily on inferences that might be drawn from the information contained in the probation report. In my view, the bare allegations of petitioner's complaint, supported by the copy of the probation file that we have been able to examine, are clearly insufficient to warrant an evidentiary hearing. I reach this conclusion not because I believe the prosecutor acted correctly in failing to discover and turn over the file, but because I find it clear beyond question that there is no \"reasonable probability that, had the evidence [petitioner claims was improperly withheld] been disclosed to the defense, the result of the proceeding would have been different.\" United States v. Bagley, 473 U.S. 667, 105 S. Ct. 3375, 3384, 87 L. Ed. 2d 481 (1985) (Blackmun, J., joined by O'Connor, J.); id. at 3385 (White, J., joined by Burger, C.J., and Rehnquist, J.).\n\nTaking the probation file to establish all that it suggests, the only arguably material facts bearing on Pasby's credibility that were not revealed in a manner that would have permitted their effective use at trial are (1) the fact that Pasby was on probation when he testified and (2) the fact that he had been told by his probation officer that because of his cooperation in the Teresa Allen murder investigation, the sheriff of Bleckley County would \"put in a good word for him when his case [came] up.\" This could have been exploited by defense counsel at trial to suggest at most that Pasby's testimony was motivated in part by a desire to avoid serving the remainder of the one year sentence of imprisonment that had been suspended when he was placed on probation.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe possible effect of this sort of impeachment on the jury's assessment of Pasby's credibility may only be evaluated in the context of the impeachment of Pasby with material turned over to the defense by the state that the jury found unconvincing. On cross-examination, defense counsel brought out the fact that Pasby had made several statements to investigating officers soon after he was arrested to the effect that he knew nothing about the crime. His story changed, however, when he found himself threatened with prosecution for the murder that was under investigation. Defense counsel completed his cross-examination of Pasby as follows:\n\nQ. Do you remember being interviewed by GBI Agent Roy Olinger?\n\nA. Yes, sir.\n\nQ. Had you told it like it was before you talked to Officer Olinger?\n\nA. No, sir.\n\nQ. You hadn't told it like it was then?\n\nA. No, sir.\n\nQ. Do you remember Officer Olinger asking you this question: \"This is what we want. I realize it may incriminate you in some way. I'm not out after you for the rifle. I'm not trying to hang you in any way, shape or form. I'm wanting to know about that rifle. I'm wanting to know if you had any knowledge with reference to where it was stolen. I know you know about the rifle but I'd like to know if you knew where it was stolen. I'd also like to know anything else you have in reference to this. That's all I'm asking of you. I'm not going to -- to try to put pressure on you. I'm not wanting to sit here trying to bullshit you, I'm wanting nothing but the truth. I can get hardnosed. You know what an accessory is? That is aiding and abetting. That is, according to Georgia law, is called aiding and abetting. You have an accessory before the fact, you have an accessory during, and you have an accessory after. You could fall into one of these categories. Refusing to give information that we can prove that you had prior to this questioning makes you an accessory. If you want to go that route, that's called aiding and abetting. That makes you liable to receive the same punishment as the person who actually pulls the trigger or who actually raped the girl or who kidnapped the girl. Now, that's strictly up to you. I'm not wanting to be hardnosed that way. All I'm doing is trying to sit down with you, Thomas, and ask you to tell me the truth and give me the information, that's all, maybe clean the rest of it right here.\" Do you remember him telling you that?\n\nA. Yes, sir.\n\nQ. And then you got it down right then after that?\n\nA. Yes, sir.\n\nBY MR. FREEMAN: That's all.\n\nDefense counsel then made reference to this cross-examination of Pasby in his closing argument:\n\nPasby says that he didn't talk about this case until after he'd been in jail several weeks or several days, some period of time, and in any case, he was a suspect while he was in jail, and that when he talked about it, he talked about it after Roy Olinger -- you remember when I read that statement from Olinger, what he told Pasby, that unless he told what they wanted him to tell, told the truth, told something, that he was going to get the same punishment as everybody else did. He didn't change his story; up until that point, he had told them he didn't know anything about it. He didn't say he knew anything about it until after they told him they were going to put pressure on him. Roy Olinger was on the witness stand yesterday, I called him for direct examination. There was not a single question asked him by the State to show -- there was no effort made to deny that he actually told Pasby that. If he didn't tell him that, the State could -- he could have told them. I think the only conclusion is that he actually did tell Pasby, threatened him that he was going to be punished for it himself unless he told about it.\n\nThus Pasby was heavily impeached with the fact that he was a suspect in this very murder and had failed to implicate petitioner until he was threatened with prosecution himself. The prosecutor did not address directly the challenge posed by defense counsel's impeachment of Pasby in that manner, focussing instead on the physical and testimonial evidence tending to corroborate Pasby's testimony. Yet the jury obviously believed Pasby. Thus defense counsel was unable to influence the jury's assessment of Pasby's credibility with the unchallenged assertion that Pasby's testimony was motivated at least in part by the fear that he, himself, might be prosecuted for the Allen murder. In light of that fact, I cannot believe that the jury might have been moved by the argument that Pasby's testimony was somehow influenced by his probationary status at the time he testified or by any expectation of favorable treatment on any other charge. In short, if the jury did not believe Pasby was lying to avoid a murder prosecution, they surely would not have believed he was lying for any of the reasons petitioner suggests.\n\nIt is important to me that prosecutors respect their obligations under Brady and Giglio, and I am willing to assume with the majority that the prosecutor in this case was under an obligation to turn over to the defense any information found in Pasby's probation file that might have been useful to the defense in impeaching the witness at trial. I am deeply disturbed, however, by the prospect of a federal district court ordering the release of a convicted murderer subject to retrial at this late date on the basis of circumstances as unlikely to have had anything to do with his confinement as those that have been alleged in this case. Because I cannot find there to exist a reasonable probability that the outcome of petitioner's trial would have been affected by any of the information petitioner alleged was wrongfully withheld, I cannot agree with the majority that an evidentiary hearing is warranted on petitioner's Brady/Giglio claim. From this portion of the majority's holding I therefore respectfully dissent.\n\nJOHNSON, Circuit Judge, concurring in part and dissenting in part, in which KRAVITCH and HATCHETT, Circuit Judges, join, and in which GODBOLD, Circuit Judge, joins Part I and Part II in part, and in which ANDERSON and CLARK, Circuit Judges, join Part I:\n\nI join the majority's opinion as to Sections I, III, and IV. With deference, I disagree with its disposition of the Ake issue in Section II, and I would more squarely address the problems raised by certain testimony and by the prosecutor's comments that the majority discusses in its Section V.\n\nI. The Ake Issue:\n\nIn Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 84 L. Ed. 2d 53 (1985), the Supreme Court considered whether the state in a capital case is required, by the constitutional guarantee of due process of law, to provide an indigent defendant with a psychological expert when insanity is offered as a defense. Eight of the Justices so held. They gave express recognition to the tremendous effect that uncontested expert testimony generally has upon the fact finder, id. at, n.7, 105 S. Ct. at 1096, n.7, and then held that \"when the defendant is able to make an ex parte threshold showing to the trial court that his sanity is likely to be a significant factor in his defense, the need for the assistance of a psychiatrist is readily apparent. It is in such cases that a defense may be devastated by the absence of a psychiatric examination and testimony. . . .\" Id. at, 105 S. Ct. at 1097.\n\nIn identifying this constitutionally protected right, the Court set forth a three-pronged test to be considered in determining if an indigent capital defendant is entitled to state-paid expert assistance: 1) \"the private interest that will be affected by the action of the State\"; 2) \"the governmental interest that will be affected if the safeguard is to be provided\"; and 3) \"the probable value of the additional or substitute procedural safeguards that are sought, and the risk of an erroneous deprivation of the affected interest if those safeguards are not provided.\" U.S. at, 105 S. Ct. at 1094. It is clear from the Court's analysis, however, that in capital cases prongs one and two will always yield identic results: the private interest \"is almost uniquely compelling,\" \"obvious and weighs heavily in our analysis;\" the state's interest is coincident with that of the individual -- in an accurate and fair verdict. Id. at -, 105 S. Ct. at 1094-95.\n\nThus it is solely upon the third factor, the probable value of the expert assistance and the risk of error attendant upon its denial, that courts will focus in deciding these questions. In Ake the Supreme Court noted six factual criteria that dictated the need for state appointed assistance in Ake's case. Id. at -, 105 S. Ct. at 1098-99. But the Court was careful to note, in identifying these factors, that it was setting forth neither a touchstone nor a catechism. Id. at, n.12, 105 S. Ct. at 1099, n.12. The Court reaffirmed its unwillingness to state a precise test in that same term in Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 2637, n.1, 86 L. Ed. 2d 231 (1985) (rejecting request for criminal investigator, fingerprint expert and ballistics expert because petitioner \"offered little more than undeveloped assertions that the requested assistance would be beneficial. . . .\").\n\nCaldwell, read in conjunction with Ake, teaches us several things. First, it reaffirms that the obvious object of the Court's reticence in Ake was the need for flexible decision-making tailored to the facts of a given case. Capital cases do not lend themselves to rigid, ritualistic formulae. Second, it belies the state's suggestion that Ake must be read narrowly and confined to its facts. Caldwell's footnote 1 suggests that the Court was willing to entertain extending Ake in the fashion Moore requests today. Rather than rejecting the claim out of hand as inappropriately stretching Ake to a different question, the Court refused to grant relief only because Caldwell failed to make a showing of sufficient need under Ake 's flexible standard.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe majority opinion today accepts, for the sake of argument, the proposition of extending Ake to non-psychiatric experts. Thus I believe that our query today is not whether Ake may be logically and appropriately extended to such experts. Rather we must decide two questions: A) how should courts decide whether a defendant is entitled to such assistance given the elastic rule that Ake molded; and B) whether Moore made a showing before the trial court of his need for such assistance sufficient to meet the measure of this test. The majority crafts such a test in its Section II, and then answers the second question in the negative. Because I believe that the majority's reading of Ake creates a proverbial \"Catch-22,\" making it impossible for all but the most nimble (and prescient) defendant to obtain expert assistance under Ake, I would restructure the majority's test and then answer the second question affirmatively, based upon the record before us.\n\nA.\n\nThe majority today attempts to bring this case under the aegis of Caldwell, arguing that Moore failed to make a showing of need for an expert that went beyond mere ipse dixit. The majority correctly views Ake and Caldwell as requiring a defendant seeking the assistance of an appointed expert to show that a reasonable probability exists both that such an expert would be of assistance to his defense and that denial of expert assistance would result in a fundamentally unfair trial. However, the majority engrafts upon that standard strict requirements that make relief unobtainable. The majority demands, as the price for a favorable ruling upon a request for assistance, that the defendant provide a specific description of the expert desired and why the assistance of that expert is necessary. If assistance is needed to confront the prosecution's case, the majority requires the defendant to detail both the nature of the prosecution's case and how the requested expert would be useful in challenging that case.\n\nI cannot agree with this approach for two reasons.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e First, the standards the majority creates actually contravene the flexible approach announced in Ake and Caldwell. By mandating essential elements in applying Ake's third prong, the majority does precisely what the Supreme Court declined to do: it determines which \"of these factors, alone or in combination, is necessary to make [a] finding [that a defendant is entitled to state-provided expert assistance].\" 105 S. Ct. at 1099, n.12. The majority thus impermissibly limits the interplay of factual considerations, unique to each case, that the Supreme Court sought to preserve in deciding this question.\n\nSecond, even accepting the legitimacy of any formal set of points for decision, the majority's standards are too exacting because they require the defendant to possess already the knowledge of the expert he seeks. The Court in Caldwell required no more than that the defendant make a threshold showing of reasonableness. That standard requires only that the defendant make something more than \"undeveloped assertions that the requested assistance would be beneficial. . . .\" U.S. at, n.1, 105 S. Ct. at 2637, n.1. But the majority goes beyond this and requires a defendant to make a full-fledged showing of an expert opinion that rebuts the state's case. I have grave doubts whether a defendant can make the sort of particularized showing that the majority demands.\n\nFor example, in this case Moore's counsel may well have known that in order to contest evidence regarding vaginal swabbings from the victim he needed an expert. But how could he know if he needed a microbiologist, an organic chemist, a urologist, a hematologist, or that which the state used, a serologist? How further could he specify the type of testing he needed without first hiring an expert to make that determination? In this case one important question is whether Moore's and Pasby's semen has a high or low \"secretion\" content. How could Moore's attorney both know of and show to the court the existence of, as well as the need for, such tests without first obtaining the very advice he seeks the court provide. This is, I submit, a Catch-22 that few will surmount.\n\nA court should not deny relief summarily simply because the defendant cannot specify the type of expert he needs. If physical evidence constitutes the bulk of the prosecution's case, the need for expert assistance to confront the prosecution's evidence is manifest. However, the defendant genuinely may not know what type of expert he needs to mount an effective challenge. The majority would foreclose any inquiry into the defendant's need for assistance simply because the defendant cannot state up front the specific assistance he requires. When a defendant asks for assistance and the need for assistance is obvious, it is fundamentally unfair for the court to deny assistance merely because the defendant lacks scientific knowledge. After reviewing the physical evidence the prosecution possesses, the court, with its experience in criminal cases, may itself be able to determine what type of expert the defendant needs.\n\nFurthermore, lawyers often lack either the time or the ability to learn whole areas of forensic science. Experts can acquaint defense counsel with the scientific principles involved, point out weaknesses in the prosecution's tests, and recommend tests that the defense might find useful. The majority would preclude a defendant from ever receiving such assistance from appointed experts. This is not to say that a defendant is entitled to an appointed expert upon demand whenever the prosecution's case involves physical evidence. However, the standard in Ake is sufficiently flexible to allow appointed experts to provide such preliminary assistance in certain instances.\n\nThe majority also places on the defendant the burden of prescience: of knowing (or really guessing) that the state intends to use certain testimony in certain ways.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Despite the limits of discovery and the scope of the work product rule, Moore's counsel undoubtedly knew that the state had and would present expert interpretations of physical evidence. He may even have known the gist of the testimony to be offered. However, how could any defendant ever have more than an inkling as to how the prosecution intended to use such evidence? In this case the prosecutor relied heavily upon it, telling the jury that it was \"very incriminating.\" But a prudent prosecutor could only make effective use of such flabby testimony if he knew that the defendant could not rebut it with his own experts. Consequently, the majority's test is circular. The evidence will only play an important role if the defendant has no expert, and the defendant needs no expert if the evidence plays no important role. To the extent that this factor is retained at all, the burden of proof ought to be placed upon the government to show that the information at issue is not critical to its case. Then that showing ought to be made a binding commitment by the government to use the evidence only in that fashion.\n\nI reiterate that the Supreme Court has required only that the defendant make a bona fide showing of reasonableness. That is a showing that the defense could, if the request has merit, and ought to make in order to justify appointment of assistance. My objection is that the majority's opinion engrafts upon this requirement unnecessary and improper burdens that, I fear, will almost always prove fatal to the defendant's request.\n\nB.\n\nBenjamin Cardozo, with characteristic grace, once noted that \"a defendant may be at an unfair disadvantage[] if he is unable because of poverty to parry by his own witnesses the thrust of those against him.\" Reilly v. Berry, 250 N.Y. 456, 461, 166 N.E. 165, 167 (1929) (per Cardozo, C.J.). The Supreme Court has noted that which any experienced trial judge or lawyer could confirm: that \"'testimony emanating from the depth and scope of specialized knowledge is very impressive to a jury. The same testimony from another source can have less effect.'\" Ake, U.S. at, n.7, 105 S. Ct. at 1096 n.7 (quoting F. Bailey \u0026 H. Rothblatt, Investigation and Preparation of Criminal Cases ยง 175 (1970)). A defendant's inability to rebut expert testimony, coming before the jury with what is effectively a presumption of correctness, is \"devastating\" to the unassisted defendant's chances of persuading the jury to reject such evidence. U.S. at, 105 S. Ct. at 1097.\n\nThe case against Moore was, to be charitable, weak. There was no direct evidence linking him to the crime and he claimed that at the time of the murder he was passed out on his sofa at home. No one at trial offered an eye witness account of any episodes in the crime. The prosecution's case was built solely upon a two-part foundation: the testimony of Pasby as to Moore's supposed admissions to him, and the testimony of several expert witnesses as to physical evidence found at the scene of the crime and in Moore's house one month later. The jury convicted Moore based upon these two elements.\n\nThis Court today finds that Pasby's testimony may have been given in exchange for lenity in regard to charges pending against him -- a fact the jury did not know. Upon remand it may well be that Pasby's testimony will be found incredible, given his own likely biases. The physical evidence thus assumes an even more critical role in the question of Carzell Moore's guilt or innocence because half of the foundation for the prosecution's case may well have been undermined by constitutional error. Under such circumstances, it is not unfair to say that in large part the determination of Carzell Moore's guilt will hinge upon the testimony of state experts that the majority would leave him powerless to contradict with any degree of effectiveness.\n\nAke requires \"an ex parte threshold showing to the trial court\" that the matter subject to expert testimony is \"likely to be a significant factor\" in the defense. U.S. at, 105 S. Ct. at 1097. By Caldwell's language, Moore must show that his need for expert assistance to interpret physical evidence is based upon a developed assertion of reasonable necessity. The majority would require a description of the assistance needed and the type of testing, an explanation of the importance of the physical evidence to the state's case, and an explanation of how the expert would assist Moore in defending himself. Under all three rubrics I believe that Moore made an adequate showing of need for and entitlement to state-paid expert assistance.\n\nAt the pre-trial hearing, Moore's attorney addressed the court orally on the subject.\n\nWe would like to make a motion to the Court that an independent research analysis [sic] be appointed by this Court that is not employed by the State of Georgia to examine this evidence to find his own conclusions on behalf of the defendant, to reach his own conclusions, in order that we can first of all, have someone to advise us as to the expertise of the Georgia Crime Lab, whether or not they performed the correct tests, whether or not there could be any variances in the findings of the Georgia Crime Lab, in order that we would have this knowledge available to us.\n\nR. Exh. 2-40. This, standing alone, is no more than an \"undeveloped assertion[] that the requested assistance would be beneficial. . . .\" Caldwell, U.S. at, n.1, 105 S. Ct. at 2637, n.1. But the defense attorney supplemented this oral statement with a written request:\n\nDefendant has been informed that the various items of physical evidence tend to connect him to a commission of the crime for which he is charged, even though defendant understands that a number of the tests performed by the State Crime Lab do not conclusively prove the presence of defendant, but rather prove the presence of someone similar to defendant.\n\nNeither the defendant nor his counsel are [sic] sufficiently knowledgeable to determine whether the test and examinations performed by the State Crime Lab on the various pieces of physical evidence are complete, conclusive, or exhaustive.\n\nThis, coupled with the oral statement, goes to the requirements of Ake, of Caldwell, and of the majority's opinion. It sets forth a reasonable need for expert assistance in order both to impeach state witness credibility and credentials and to attack the factual conclusions that those witnesses will likely draw -- in short the probable value of such assistance and the risk of error if denied. The statement goes on, however:\n\nDefendant understands that there are certain tests which can be run which might conclusively prove whether or not the hair samples found are those from defendant, but neither defendant nor his counsel have the necessary funds or expertise to perform said tests.\n\nThis bolsters the reasonableness of the request and further meets the majority's requirement that the defendant specify the tests he seeks to have performed. Moore's attorney continued:\n\nAppointed counsel cannot effectively prepare the defense for Defendant without the services of an expert witness to advise him concerning the tests and examinations run by the law enforcement and judicial agencies and no provision has been made for the Defendant to have available to him the kind of resources which are available to the State through the State Crime Laboratory in order that the Defendant can test the validity of and accuracy of any tests which have been run by the State and the results of which may be introduced into evidence against the defendant at trial.\n\nR.Exh. 1-87. Again, the defendant offered evidence of reasonableness and a showing sufficient to describe the type of expert assistance needed. Moore's attorney even went on to offer the trial court the name of his proposed expert and the fee for his services: $1500.\n\nAdmittedly, Moore's lawyer did not affirmatively allege that the state would rely upon the evidence here at issue.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e But as Moore's counsel noted in his motion for expert assistance, he could not do so because:\n\nthere is no statute in the law of Georgia giving the Defendant the right to compulsory legal process which will require the State to advise the Defendant of the basis on which the State intends to attempt to prove that the defendant is guilty of the crime for which he has been indicted.\n\nR.Exh. 1-88. Thus the majority today imposes a burden on all indigent defendants which the law of Georgia makes impossible to meet. Moreover, given the lack of any eye witness to this crime, and the fact that aside from the physical evidence the state's only witness was a cellmate with a criminal record of his own, I believe it was so patently obvious as to go without saying that the physical evidence, and expert interpretation of that evidence, would be critical, even absent an express guess by the defendant to that effect.\n\nThe physical evidence in this case was, standing alone, weak. As the state's witnesses themselves conceded, there were major questions as to the validity and accuracy of the tests performed. The majority's recitation of the facts does not mention that the Hushpuppy shoe prints found at the scene of the crime were not congruent in size with those seized from Moore's house, yet Moore was unable to counter this damaging circumstantial evidence with testimony as to whether the soil could have produced a print longer and wider than the shoe. The semen sample could be identified as coming from any of the two-fifths of the country's male population sharing Moore's blood type.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The two hairs seized from a towel in Moore's bathroom, one month after the crime, could likewise only be shown to be consistent with those of Allen and not inconsistent with those of Moore, Green or Pasby. In essence, the state's \"expert\" could only say with certainty that which any layman could also have observed: that he viewed a blond pubic hair and a Negro head hair.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Yet the prosecutor was able to characterize this evidence as \"very incriminating\" in large part because he was assured that Moore could not offer a witness of equal stature to question these assertions. It is precisely in cases of this sort where failure to provide expert assistance to the defendant becomes crucial. When physical evidence is itself weak it may well be that the persuasiveness of that evidence derives entirely from the enhancing effect caused by \"expert\" testimony prodding the jury toward a particular conclusion.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFor all of the reasons foregoing, I believe that the majority errs in its disposition of this question, both as a theoretical matter and as applied within the confines of this case. Moore has established a reasonable need for the assistance of experts under Ake, and I would grant him relief.\n\nII. Comparable Worth:\n\nThe majority notes that it need not and will not pass upon Moore's claim of constitutional error resulting from the testimony of Allen's father. Surprisingly, the majority then goes on to offer a \"comment\" for the benefit of the state court on remand that this was improper, although the majority claims that it makes no holding on this point. The question posed by Moore is an important one; this Court has found that considerations of judicial economy in habeas cases involving the death penalty permit us to pass on all possible bases for relief,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the Ashwander doctrine to the contrary notwithstanding.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e I would do so today and, having squarely reached the question of error flowing from Mr. Allen's testimony, as well as from the prosecutor's comments on that testimony during closing argument, would hold that Moore has stated a claim of constitutional deprivation.\n\nIn this case, after both the prosecution and defense had rested in the sentencing phase, but before closing arguments, the prosecution requested and the trial court permitted the victim's father to take the stand to \"rebut\" certain testimony and to provide evidence of \"aggravating circumstances.\" He was the last witness the jury heard. Over defense objections, Mr. Allen testified that his daughter was nineteen years of age, had been a high school honor student, was attending college in part on a scholarship and in part on her earnings from work at the Majik Market, and hoped to become a nurse.\n\nAs the majority notes, this testimony was admitted ostensibly to rebut any suggestion that Ms. Allen had voluntarily participated in the robbery, although Moore never raised this allegation and indeed would have undermined his entire defense had he done so. The state now argues also that this evidence was admissible in order to show additional aggravation -- armed robbery or kidnapping -- in addition to the already claimed rape and murder.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Thereafter, as will be explained more fully below, the prosecutor invited the jury to weigh the relative worth or value to society of the two lives at issue: Mr. Moore and Ms. Allen. Moore argues that it is constitutionally impermissible for the state to inject into the sentencing process information of such inflammatory nature as class and worth, especially by means of tactics designed to leave that testimony as the last evidence on the jury's mind.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe whole thrust of American jurisprudence in the capital punishment area has been an attempt to excise from the sentencing process any traces of bias or caprice by channeling and cabining discretion. Furman v. Georgia, 408 U.S. 238, 242, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972) (Douglas, J., concurring) (capital punishment is unconstitutional if it discriminates \"by reason of . . . race, religion, wealth, social position, or class, or if it is imposed under a procedure that gives room for the play of such prejudices\"); Gregg v. Georgia, 428 U.S. 153, 189, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976) (opinion of Stewart, Powell, \u0026 Stevens, JJ.) (\"Where discretion is afforded a sentencing body on a matter so grave as the determination of whether a human life should be taken or spared, that discretion must be suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action\"); Gardner v. Florida, 430 U.S. 349, 358, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977) (\"It is of vital importance to the defendant and to the community that any decision to impose the death sentence be, and appear to be, based on reason rather than caprice or emotion\"); cf. C. Black, Capital Punishment: The Inevitability of Caprice and Mistake 100 (2d ed. 1981) (the great weakness of the capital punishment system is that it \"is riddled and saturated with uncontrolled discretion, however disguised\"). When discretion is unchained, the Eighth Amendment is at peril. Furman, 408 U.S. at 309-10 (Stewart, J., concurring).\n\nThis Court recently considered the question whether it is error to argue personal characteristics of the victim to the jury. Brooks v. Kemp, 762 F.2d 1383, 1409-10 (11th Cir. 1985) (en banc), makes clear that while it is not per se improper to do so, the introduction of such information is problematical and must be carefully controlled to prevent \"excessive focus\" on prejudicial or irrelevant matters. Brooks, and the panel decision below, make clear that the propriety of each episode turns on the totality of the circumstances.\n\nThe decision to admit Mr. Allen's testimony, and the prosecutor's suggestion to the jury that it weigh the relative values of the two persons to society is, I think, error of the grossest sort. While it is not per se unconstitutional to admit testimony \"not directly related to either statutory aggravating or statutory mitigating factors,\" Barclay v. Florida, 463 U.S. 939, 967, 77 L. Ed. 2d 1134, 103 S. Ct. 3418 (1983) (Stevens \u0026 Powell, JJ., concurring in plurality judgment), the Supreme Court has made clear that at the sentencing stage it is of paramount importance that the decision be individualized and based upon 1) the character of the individual defendant, and 2) the circumstances of the crime. Stephens, 462 U.S. at 879 (citing cases). If a state permits, under the rubric of aggravating circumstances, \"factors that are constitutionally impermissible or totally irrelevant to the sentencing process, such as . . . race, religion, or political affiliation of the defendant. . . . due process of law would require that the jury's decision to impose death be set aside.\" Id. at 885.\n\nHere there can be no question but that the testimony was a calculated attempt, under the guise of permissible evidence of rebuttal or aggravation, Stephens, 462 U.S. at 878-79, to import into the deliberative process precisely the class-based biases Justice Douglas decried in Furman.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e There was nothing in Mr. Allen's testimony that in any way elucidated the already well-developed circumstances of the crime.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The testimony thus fails to meet Stephens' requirement that it further an individualized determination of the appropriate sentence in light of the facts of the crime.\n\nOn the other hand, it could not but help inflame the prejudices and emotions of the jury to be confronted with a father's testimony of the virtuous life of his white daughter violated and then mercilessly snuffed out by this black defendant. The prosecutor's decision to sandbag this testimony until just prior to closing arguments, so that Mr. Allen was the last witness the jury heard, exacerbated the prejudice. The prosecutor sought, as Judge Kravitch so aptly put it in her dissent from the panel opinion, \"not merely to let the jury know who the victim was, but rather to urge the jury to return a sentence of death because of who the victim was.\" Moore v. Zant, 722 F.2d 640, 651 (11th Cir. 1983) (emphasis in original). The result was based not upon reason, as the Supreme Court and the Constitution demand, but upon emotion.\n\nThe trial court justified admitting this information as relevant based upon testimony of one witness that the safe at the Majik Market did not appear to have been forced open suggesting, sotto voce, possible complicity in the crime by Teresa Allen. The court reasoned it was appropriate to have Mr. Allen testify as to his daughter's character so as to rebut this possible defense. The panel opinion accepted this rationale. It noted that, while ordinarily \"the peculiar characteristics of persons involved\" is not a permissible basis for imposing the death penalty because it is \"fraught with constitutional danger,\" \"where such characteristics are material to resolving a genuine issue in the case\" such testimony may come before the fact finder. Moore, 722 F.2d at 646; accord Brooks, 762 F.2d at 1409 (\"Any reference to such potentially prejudicial characteristics must be undertaken only with the greatest of care and only when the reference is relevant to some legitimate issue in the case.\").\n\nThe problem is that Moore never argued this defense in any way; thus it was not a genuine issue in the case. His defense was to maintain his innocence and lack of knowledge of the deed. He never suggested that Teresa Allen was in any way an accomplice with a crime that somehow went awry. The panel majority conceded that not only was the evidence for such a defense \"slim,\" id. at 645, but that \"defense counsel did not make such an argument to the jury.\" Id. at 645 n.2. The panel majority held that though it was perhaps error, \"we cannot say that the trial judge's balancing of the relevancy of Mr. Allen's testimony against its prejudice was constitutionally faulty.\" Id. at 646. I can and I do. It was clear error.\n\nSubsumed in this claim is another issue: whether the prosecutor's plea to the jury to impose the penalty of death as a deterrent to others\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e constitutes reversible error. This too violates Stephens because it introduces questions of general applicability not related to the proper task of the jury: to render an individualized determination in the case at hand. 462 U.S. at 879. The prosecuter here sought to induce the jury to strike a blow against crime and for deterrence by making an example of Moore. This is impermissible and unfair; it rises to the level of reversible error. Donnelly v. DeChristoforo, 416 U.S. 637, 643, 40 L. Ed. 2d 431, 94 S. Ct. 1868 (1974); Berger v. United States, 295 U.S. 78, 79 L. Ed. 1314, 55 S. Ct. 629 (1935); Brooks, 762 F.2d at 1399.\n\nI believe Moore has stated three further bases for relief. It was clear error to introduce the testimony of Ms. Allen's father because it was completely irrelevant and extraordinarily prejudicial. It was a grave, gross error for the prosecutor to invite the jury to weigh the comparable worth of the two lives. The error was compounded by the prosecutor's invitation to the jurors to make the streets safe again by putting Carzell Moore to death.\n\nFor the reasons foregoing, I must enter a partial dissent from the majority's disposition of this appeal.\n\n\u003cspan class=\"fn\"\u003e* EDMONDSON, Circuit Judge, became a member of the court after this appeal had been orally argued but has participated in this decision after listening to a recording of oral argument. See 11th Cir. R. 24(g).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Honorable Albert J. HENDERSON, Senior Circuit Judge, has elected to participate in the consideration and disposition of this case. 28 U.S.C. ยง 46(c). *** RONEY, Chief Judge, and HILL, FAY, VANCE, EDMONDSON, Circuit Judges, and HENDERSON, Senior Circuit Judge, concur in Part II. GODBOLD, VANCE, KRAVITCH, JOHNSON, HATCHETT, ANDERSON, and CLARK, Circuit Judges, concur in Part III. RONEY, Chief Judge, and HILL, FAY, VANCE, ANDERSON, CLARK, and EDMONDSON, Circuit Judges, and HENDERSON, Senior Circuit Judge, concur in Part V.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The Bleckley County jail consists of a large enclosure which is divided into several smaller cells. According to Pasby, the doors to the cells remained open, allowing prisoners to move freely from cell to cell. Pasby testified that he heard the news of Green's arrest on television and that he went to Moore's cell to notify him of the arrest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Coker v. Georgia, 433 U.S. 584, 97 S. Ct. 2861, 53 L. Ed. 2d 982 (1977), decided 20 days after petitioner's sentencing, precludes the imposition of the death penalty for the crime of rape. Petitioner challenged his death sentence on the rape count in his direct appeal to the Supreme Court of Georgia. Moore v. State, 240 Ga. 807, 243 S.E.2d 1, cert. denied, 439 U.S. 903, 99 S. Ct. 268, 58 L. Ed. 2d 249 (1978). The court read Coker as allowing a death sentence in a rape case if the victim is murdered immediately following the rape and thus affirmed petitioner's sentence. Id. at 822, 243 S.E.2d at 11. In his habeas petition in the district court, petitioner claimed that Coker precluded his death sentence on the rape count. The district court rejected his claim without stating any reason for its decision. Petitioner has not questioned this ruling in this appeal; therefore, we do not pass on it. Petitioner does attack his death sentence on the rape count, as well as on the murder count, on the ground that the trial judge failed adequately to instruct the sentencing jury on its option to impose a life sentence despite the presence of a statutory aggravating circumstance. We address this claim in Part IV, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Although the petition listed 33 claims, we conclude, after a careful reading, that the petition contained 16 cognizable constitutional claims. These claims were that: (1) the exclusion of young adults and women from the venires from which petitioner's grand jury and petit jury were chosen denied him due process in violation of the fourteenth amendment; (2) the trial court's denial of petitioner's motion for a change in venue based on prejudicial pretrial publicity denied him a fair trial in violation of the fifth, sixth, and fourteenth amendments; (3) the trial court's denial of petitioner's request for an independent expert to assist his attorney in confronting the physical evidence the State introduced against him at trial violated his rights under the fifth, sixth, and fourteenth amendments; (4) petitioner was denied the effective assistance of counsel at all stages of his criminal prosecution -- pretrial, trial, sentencing, and direct appeal -- and in his state habeas proceedings in violation of the sixth and fourteenth amendments; (5) the prosecution's failure to reveal promises made to Thomas Pasby, the State's key witness, violated petitioner's due process rights under the fourteenth amendment; (6) petitioner's convictions were based on false testimony in violation of the fourteenth amendment due process clause; (7) petitioner's convictions were based upon evidence resulting from an illegal search of his home in violation of the fourth and fourteenth amendments; (8) the trial court improperly instructed the jury on the issues of reasonable doubt and conspiracy at the guilt phase of petitioner's trial in violation of the eighth and fourteenth amendments; (9) the admission of inflammatory exhibits and hearsay evidence denied petitioner a fair hearing at both phases of his trial in violation of the sixth and fourteenth amendments; (10) the prosecutor made improper and prejudicial remarks to the jury at the sentencing phase of petitioner's trial, thus denying him due process of law in violation of the fourteenth amendment; (11) the trial court's sentencing instructions to the jury did not adequately inform it of its option, under Georgia law, to return a life sentence even if it found the existence of a statutory aggravating circumstance in violation of the eighth and fourteenth amendments; (12) the testimony of the victim's father at the sentencing hearing deprived petitioner of his right to a sentencing hearing free from passion and prejudice in violation of the sixth, eighth, and fourteenth amendments; (13) petitioner was deprived of his right to the guided exercise of jury sentencing discretion in violation of the eighth and fourteenth amendments because (a) the trial court permitted the State to present to the jury evidence of petitioner's prior criminal history, (b) the trial court instructed the jury to consider constitutionally defective statutory aggravating circumstances under O.C.G.A. ยง 17-10-30(b)(2), (b)(7) (1982), (c) the trial court's instruction on mitigating circumstances precluded the jury from considering mitigating circumstances other than petitioner's age by specifically noting only that factor, and (d) the trial court failed to require the jury to make findings of fact as to the existence of mitigating factors; (14) a death sentence for the crime of rape deprived petitioner of a sentence proportionate to his crime in violation of the eighth and fourteenth amendments; (15) the Supreme Court of Georgia denied petitioner adequate review of his convictions and sentences in violation of the eighth and fourteenth amendments; and (16) Georgia administers the death penalty in a discriminatory fashion in violation of the eighth and fourteenth amendments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. These claims are described supra, note 3, as claims 3, 10, 11, 12 \u0026 13(a)-(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. These claims are described supra, note 3, as claims 4, 5, 6 \u0026 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Petitioner asserts in his brief to the en banc court that the trial court's denial of his motion for the appointment of an expert denied him a fair trial, in violation of the due process and equal protection clauses of the fourteenth amendment, rendered his attorney ineffective within the meaning of the sixth and fourteenth amendments, and subjected petitioner to cruel and unusual punishment in violation of the eighth and fourteenth amendments. Because petitioner's discussion of the alleged error is in terms of the fairness of the trial he received, we utilize a due process analysis in addressing his claim. This is the same approach the Supreme Court employed in Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 1099 n.13, 84 L. Ed. 2d 53 (1985), in which it examined a claim for psychiatric assistance under the due process clause and declined to consider the applicability of the equal protection clause or the sixth amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Among the tools the state must not deny an indigent defendant in a criminal proceeding are the assistance of counsel at trial, Gideon v. Wainwright, 372 U.S. 335, 83 S. Ct. 792, 9 L. Ed. 2d 799 (1963), and on the defendant's first direct appeal as of right, Douglas v. California, 372 U.S. 353, 83 S. Ct. 814, 9 L. Ed. 2d 811 (1963), and a trial transcript, if it is necessary to a decision on the merits of the appeal, Griffin v. Illinois, 351 U.S. 12, 76 S. Ct. 585, 100 L. Ed. 891 (1956). These tools are necessary to ensure that an indigent defendant's access to justice is meaningful. See Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 1093-94, 84 L. Ed. 2d 53 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Requiring trial courts, both state and federal, to provide for expert assistance -- through direct appointment or a grant of funds -- would place a substantial, if not onerous, burden on the administration of criminal justice. For example, the trial court would have to (1) appoint a defense expert for every expert available to the government; (2) provide for expert assistance whether or not such assistance turned out to be needed; and (3) provide for any additional experts the appointed experts might need to explore theories that could aid the defense in cross-examining prosecution witnesses or in presenting the defense's case. We question the wisdom of such due process requirements absent a substantial showing, such as the one made in Ake, of a significant benefit to the truth-seeking function of a trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. This required showing is analogous to the requirement that an indigent defendant wishing to obtain the issuance of a subpoena at government expense make \"a satisfactory showing . . . that the presence of the witness is necessary to an adequate defense.\" Fed. R. Crim. P. 17(b). See United States v. Abshire, 471 F.2d 116, 119 (5th Cir. 1972) (\"[A] Rule 17(b) motion must state facts that show the relevancy and necessity of the requested witnesses', testimony.\") (citation omitted) (In Bonner v. City of Prichard, 661 F.2d 1206, 1209 (11th Cir. 1981) (en banc), this court adopted as binding precedent all decisions of the former Fifth Circuit handed down prior to October 1, 1981.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In a jurisdiction like Florida, which accords the defendant substantial discovery rights, see Fla. R. Crim. P. 3.220 (requiring prosecution to disclose, among other things, written statements of persons having relevant information and reports or statements of experts, including results of scientific tests, and allowing defendant to depose any person having relevant information), the defendant should have no difficulty in demonstrating the theory of the government's case and outlining the evidence the prosecutor will probably present at trial. The difficulty of the defendant's task will vary depending on the scope of the jurisdiction's discovery rules. In a jurisdiction still employing \"trial by ambush,\" the defendant might have to ask the court to make the prosecutor disclose the theory of his case and the results of any tests that may have been performed by government experts or at the government's request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Under Georgia law, an accused being held in custody can demand a preliminary hearing, often termed a \"committal hearing,\" for the purpose of determining whether there exists probable cause to believe that the accused perpetrated the charged crime and, if so, whether to bind the accused over to the grand jury. See O.C.G.A. ยง 17-7-23(a) (1982); Fleming v. Kemp, 748 F.2d 1435, 1439 n.14 (11th Cir. 1984), cert. denied, 475 U.S. 1058, 106 S. Ct. 1286, 89 L. Ed. 2d 593 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Judge Sosebee did not preside over the committal hearing, because under Georgia law the judge who has been assigned to try the case cannot preside over the committal hearing. See O.C.G.A. ยง 17-7-23(b) (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The State was required by statute, upon timely motion, to produce copies of \"any written scientific reports in the possession of the prosecution which will be introduced in whole or in part against the defendant by the prosecution in its case-in-chief or in rebuttal.\" O.C.G.A. ยง 17-7-211(b) (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The complete text of the motion is set out below: MOTION TO REQUEST THE COURT TO APPOINT CRIMINOLOGIST OR OTHER EXPERT WITNESS TO ASSIST DEFENSE COUNSEL AND PLEA IN ABATEMENT Now comes CARZELL MOORE, Defendant above named, and moves the Court to appoint a criminologist or other expert witness to assist defense counsel by showing to the Court the following: 1. Movant was arrested by the Bleckley County Sheriff's Department in January of 1977 on a charge of Murder of Teresa Allen. 2. The undersigned counsel has been appointed to represent Defendant. 3. Defendant has been indicted for murder and rape by the Monroe County Grand Jury. 4. Approximately ninety-four items of physical evidence have been assembled by the District Attorney of the Flint Judicial Circuit [sic]; Bleckley, County Sheriff's Department, Monroe County Sheriff's Department; Cochran City Police; the Georgia Bureau of Investigation; the Georgia State Crime Lab; the Honree County Police Department; [sic] Honree, South Carolina; Conway City Police Department, Conway, South Carolina; the District Attorney of the Oconee Judicial Circuit; and the officers, agents, and employees of all the above (hereinafter referred to as Law Enforcement and Judicial Agencies). Among the items assembled are blood samples, saliva specimens, and hair specimens from the defendant. Additionally, the gun, shoes, clothing, hosiery, foot castings, and other types of physical evidence have been assembled by said law enforcement and judicial agencies. 5. Defendant is indigent, and cannot afford to procure the services of a private, independent expert to assist and advise him on the scientific analysis of this evidence. 6. Defendant has been informed that the various items of physical evidence tend to connect him to a commission of the crime for which he is charged, even though defendant understands that a number of the tests performed by the State Crime Lab do not conclusively prove the presence of defendant, but rather prove the presence of someone similar to defendant. 7. Neither defendant nor his counsel are sufficiently knowledgeable to determine whether the test and examinations performed by the State Crime Lab on the various pieces of physical evidence are complete, conclusive, or exhaustive. Defendant understands that there are certain tests which can be run which might conclusively prove whether or not the hair samples found are those from defendant, but neither defendant nor his counsel have the necessary funds or expertise to perform said tests. 8. Appointed Counsel cannot effectively prepare the defense for Defendant without the services of an expert witness to advise him concerning the tests and examinations run by the law enforcement and judicial agencies and no provision has been made for the Defendant to have available to him the kind of resources which are available to the State through the State Crime Laboratory in order that the Defendant can test the validity of and the accuracy of any tests which have been run by the State and the results of which may be introduced into evidence against the defendant at trial. 9. Under the laws of Georgia, Defendant has no right to any pre-trial or pre-arraignment discovery except to the extent that the state is obligated to produce information which might tend to exculpate the defendant or mitigate his alleged involvement in the crime for which he has been indicted. There is no statute in the law of Georgia giving the Defendant the right to compulsory legal process which will require the State to advise the Defendant of the basis on which the State intends to attempt to prove that the defendant is guilty of the crime for which he has been indicted. The absence of any such statutory or other law in Georgia, together with the indigency of the Defendant and the failure of the Court to provide the Defendant with resources to make his own independent investigation into certain scientific evaluations which form the basis of the State's case, make it impossible for the Defendant and his counsel to adequately prepare a defense to the charges against the Defendant. 10. The absence of any such statutory or other law in the State of Georgia and the absence of any procedure whereby the Court can be required to make available to an indigent defendant the same basic resources which are available to the State for the purpose of scientific evaluation an expert testimony constitute a violation of Defendant's right to procedural due process of law under the Fifth and Fourteenth Amendments to the Constitution of the United States. A fundamental fairness required by the Fifth and Fourteenth Amendments to the Constitution are impossible to fulfill in Defendant's case for the reasons hereinabove set forth and any trial of the Defendant on this indictment will, for these reasons, violate his rights under the due process clause of the Fifth and Fourteenth Amendments to the Constitution and will deny him equal protection of the laws under the Fourteenth Amendment of the Constitution of the United States. WHEREFORE, Defendant moves the Court to appoint a private, independent criminologist to advise and assist the Court appointed Attorney in the conduct of his defense, and in the absence of such appointment, Defendant prays that the Court inquire into this his plea in abatement, taking evidence on the questions raised herein if necessary, and that the indictment against the defendant be quashed and the charges against the Defendant be dismissed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. It is apparent from this colloquy and petitioner's motion for the appointment of a criminologist or other expert, see supra note 14, that defense counsel was under the impression that Georgia law precluded the court from granting his motion even if the due process clause of the fourteenth amendment required that it be granted. This may explain counsel's failure to make the sort of showing we find necessary. We are not convinced that the trial judge would have denied petitioner the provision of expert assistance had counsel made a more substantial demonstration of need. Although Georgia statutory law does not give indigent defendants a right to obtain expert witnesses at government expense, we find nothing in Georgia case law, and have been cited to nothing, that would have precluded the trial judge from granting such assistance had he concluded that not to do so would create a reasonable probability that petitioner would not receive a fair trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Although Judge Whitmire held both petitioner's and Roosevelt Green's committal hearings, as we have indicated, see supra note 12 and accompanying text, the transcript of petitioner's hearing and the transcript of Sheriff Bittick's testimony at Green's hearing were made a part of the record before Judge Sosebee. We therefore assume, although the record is silent on the point, that Judge Sosebee had read these transcripts by the time he ruled on petitioner's request for expert assistance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Sheriff Bittick may have been mistaken when he testified at Green's committal hearing that Barton had made this determination. At trial, she gave no such testimony; rather, Warren Tillman, the microanalyst, explained the results of the tests performed on the various hair samples in the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Petitioner's attorney had two opportunities prior to Judge Sosebee's ruling at the conclusion of the May 4 hearing -- the May 4 hearing itself and the April 15 hearing -- to inform the court about these matters and to urge the court to appoint an expert; yet, he remained silent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Linda Barton's test of the seminal fluid taken from the victim's body indicated that the fluid came from a male with type A blood. Green had type B blood; thus, the fluid she examined could not have come from him. Green, however, could still have raped the victim; the record does not show whether seminal fluid existed that Barton did not test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A criminologist is a person who specializes in criminology. Criminology is defined as \"the scientific study of crime as a social phenomenon, of criminal investigation, of criminals, and of penal treatment.\" Webster's Third New International Dictionary 537 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. At trial, petitioner's attorney said nothing to the court indicating that he needed expert assistance to cross-examine the State's experts, Warren Tillman and Linda Barton. See supra note 15. In fact, he effectively and comprehensively cross-examined these experts at length. It can be inferred from counsel's conduct that the trial court's refusal to appoint an expert did not deny petitioner a reasonable opportunity to present his case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Without Pasby's testimony, the State's case was purely circumstantial: petitioner made an incriminating statement to Johnny Johnson three days prior to the robbery, petitioner and Green were friends, and petitioner was seen in Cochran with Green on the afternoon of the robbery. The expert testimony relating to the physical evidence recovered from petitioner's home and from the crime scene did not prove that petitioner was a participant in the crimes. The testimony of Warren Tillman established that shoes similar in size and tread design to the \"Hush Puppy\" shoes found in petitioner's home were worn at the crime scene. Tillman's testimony, concerning hairs found on a towel seized in the search of petitioner's home, added little to the State's case and his testimony relating to this evidence was substantially discredited. The testimony of Linda Barton, the serologist, established that a male \"secretor\" with type A blood produced the semen found in the body of Ms. Allen. Petitioner was shown to be a secretor with type A blood, but Barton admitted on cross-examination that approximately 40% of the population has type A blood and approximately 90% of these individuals are secretors. Thus, Barton's testimony did not conclusively prove that petitioner raped Ms. Allen.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. State court fact findings cannot be presumed to be correct if it appears that the petitioner \"did not receive a full, fair, and adequate hearing in the State court proceeding. 28 U.S.C. ยง 2254(d)(6) (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. There are 45 judicial circuits in Georgia; each circuit is composed of one or more counties. Each judicial circuit has an elected district attorney who prosecutes all felony cases brought within the circuit. Similarly, each circuit has one or more judges who sit in the superior courts of the counties that make up the judicial circuit. Petitioner was tried in the Superior Court of Monroe County because the Allen rape and murder occurred in Monroe County. Monroe County is in the Flint Judicial Circuit, and therefore the district attorney and assistant district attorney who prosecuted the case and the judge who presided at trial were from the Flint Judicial Circuit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. No one at the hearing, including Pasby, disclosed that a rifle was the object of the alleged theft. The record suggests, however, that prior to trial defense counsel learned that the object was a 30.06 caliber hunting rifle, like the one used to commit the Allen murder, and that the police initially thought that the rifle was the murder weapon. Subsequent investigation disclosed that the rifle seized following Green's arrest, not the rifle Pasby, was charged with stealing, was used to kill the victim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Counsel made this request in the context of a written motion seeking the State's production of various information in its possession. The request for criminal records and Giglio material was made in general terms and encompassed everyone the prosecutor intended to call at petitioner's trial. At hearings held on February 11 and 15 and on April 15, 1977, however, petitioner's counsel stressed that he was particularly interested in obtaining Pasby's criminal record and any evidence of a deal between the State and Pasby. We therefore focus on the requests as they relate to Pasby.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Presumably, counsel was referring to the GBI's Crime Information Center which maintains records of arrests and convictions. The information is provided to the Center by the Federal Bureau of Investigation and \"Georgia Fingerprint Contributors,\" which includes Georgia police departments and sheriff's offices. These records are available to state prosecutors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The record does not disclose the exact number of these summaries or, with the exception noted in the text, what interviews were involved. Further, the prosecutor stated that it was possible that not all of the taped conversations had been summarized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. This consisted of a statement made by Mrs. Beverly Ann Mays to a special agent of the GBI on January 18, 1977. The substance of the statement is not disclosed in the record. It is unclear whether the statement was tape recorded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The record reveals the names of only two of the persons whose interview summaries were produced pursuant to the court's directive. It is unclear from the record what information the summaries contained or in what manner they were beneficial to the defendant. This, however, is not relevant to petitioner's Brady/Giglio claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The statement reads as follows: This is what we want. I realize it may incriminate you in some way. I'm not out after you for the rifle. I'm not trying to hang you in any way, shape or form. I'm wanting to know about that rifle. I'm wanting to know if you had any knowledge with reference to where it was stolen. I know you know about the rifle but I'd like to know if you knew where it was stolen. I'd also like to know anything else you have in reference to this. That's all I'm asking of you. I'm not going to -- to try to put pressure on you. I'm not wanting to sit here trying to bullshit you, I'm wanting nothing but the truth. I can get hardnosed. You know what an accessory is? That is aiding and abbetting [sic]. That is, according to Georgia law, is called aiding and abetting. You have an accessory before the fact, you have an accessory during, and you have an accessory after. You could fall into one of these categories, refusing to give information that we can prove that you had prior to this questioning makes you an accessory. If you want to go that route, that's called aiding and abbetting [sic]. That makes you liable to receive the same punishment as the person who actually pulls the trigger or who actually raped the girl or who kidnapped the girl. Now, that's strictly up to you. I'm not wanting to be hardnosed that way. All I'm doing is trying to sit down with you, Thomas, and ask you to tell me the truth and give me the information, that's all, maybe clean the rest of it right here. It appears from this statement that the summary of Pasby's interview was actually a transcript of the interview. Thus, the State's assertion in its response to petitioner's motion for Brady material that its file did not contain any transcripts of recorded interviews might not have been accurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Bleckley County sheriff's testimony at petitioner's trial corroborated Pasby's statement. The sheriff testified that around January 1, 1977, police learned from an informant that Pasby had the murder weapon, a 30.06 rifle, and that Pasby had sold it to a man at a junkyard in Macon, Georgia. After retrieving the rifle, which he then believed to be the murder weapon, see supra note 26, the sheriff arrested Pasby on January 4. According to the sheriff, Pasby insisted that he was innocent and requested that the sheriff take him to the junkyard in Macon to see if the purported buyer could identify him. The sheriff eventually sent a deputy to Macon with photographs of Pasby. Although his testimony is unclear, the sheriff indicated that the State decided not to prosecute Pasby, because of the purported buyer's inability to identify him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Counsel made this statement during a hearing before the Superior Court of Butts County on petitioner's first habeas petition in arguing that the prosecutor had deliberately withheld Brady/Giglio information from the defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Actually, another attorney filed the habeas petition. That attorney subsequently withdrew from the case, and Kates filed his appearance as petitioner's attorney.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Moore presented 23 claims in his amended petition. They questioned the validity of both his convictions and death sentences.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. O.C.G.A. ยง 42-8-60 (1985) provides as follows: 42-8-60. Probation of first offenders prior to adjudication of guilt; effect of violation of terms of probation or conviction for another crime. (a) Upon a verdict or plea of guilty or a plea of nolo contendere, but before an adjudication of guilt, in the case of a defendant who has not been previously convicted of a felony, the court may, without entering a judgment of guilt and with the consent of the defendant: (1) Defer further proceedings and place the defendant on probation as provided by law; or (2) Sentence the defendant to a term of confinement as provided by law. (b) Upon violation by the defendant of the terms of probation or upon a conviction for another crime during the period of probation, the court may enter an adjudication of guilt and proceed as otherwise provided by law. No person may avail himself of this article on more than one occasion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. O.C.G.A. ยง 42-8-65(a) (1985) provides in relevant part: The record of discharge [of a probation sentence imposed under the first offender act] shall be released solely to the Attorney General, a district attorney, a solicitor of a state court, the Department of Corrections, the office of a county probation system or of a state or county probation system of another state or of the United States, an office of the State Board of Pardons and Paroles, an office of the pardons and paroles division of another state or of the United States, or a prosecuting attorney of another state or of the United States, upon certification by such probation system or prosecuting attorney that there are pending in a court of competent jurisdiction criminal charges against any person discharged under this article. No such agency, law enforcement agency, or court may release any information regarding an adjudication of guilt under this article except to disclose the fact that the defendant has exercised his or her right to first offender treatment under Georgia law and that such person has been discharged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The court did not address whether the probation file otherwise contained information that might have affected Pasby's credibility before petitioner's jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The supreme court's decision is unreported. The State makes no claim that the supreme court refused to issue a certificate of probable cause on the ground that petitioner, having raised his Brady/Giglio claim on direct appeal, was precluded from presenting it to the habeas court on collateral attack.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The State should have included Pasby's probation file in the exhibits filed with its answer because the file was part of the record of the state court habeas proceeding and was obviously relevant to petitioner's Brady/Giglio claim. See Rule 5, Answer; Contents, Rules Governing Section 2254 Cases, 28 U.S.C. fol. ยง 2254 (1982). The district court, in reviewing the record of the state habeas proceedings (upon which it based its decision to reject petitioner's Brady/Giglio claim), should have noted the absence of Pasby's probation file and, pursuant to Rule 5, ordered that the sealed file be produced and made a part of the record in the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. We assume that the probation file is genuine because the State did not object to its authenticity in the district court. We do not, however, assume that the file is complete. Among other things, it does not contain any evidence of the Superior Court of Bleckley County's disposition of the probation revocation proceeding the court initiated on January 5, 1977, when it issued a warrant for Pasby's arrest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. At the time of Pasby's arrest, the crime of theft by taking was considered a felony when the property stolen exceeded $100 in value. Ga. Code Ann. 26-1812(a) (1977). This statute subsequently was amended to raise the minimum value to $200 and recodified as O.C.G.A. ยง 16-8-12 (1) (1982 \u0026 Supp. 1986). If convicted of the crime, Pasby faced a prison sentence of not less than one year and not more than ten years. Ga. Code Ann. 26-1812(a) (1977) (amended and recodified as O.C.G.A. ยง 16-8-12 (1) (1982 \u0026 Supp. 1986)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. We presume that Pasby's true surname is Moss because he was arrested under that surname, said he was Thomas Moss when he pled guilty, and the superior court sentenced him as Thomas Moss. We refer to him in this opinion as Pasby because that is how he is referred to in the record, with the exception of the probation file.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Under this statutory scheme, once the offender completes his sentence -- whether on probation or in prison -- he is \"discharged without court adjudication of guilt,\" O.C.G.A. ยง 42-8-62 (1985), and consequently does not suffer the civil disabilities normally suffered by those who have been adjudged guilty of an offense under Georgia law. \"The discharge . . . completely exonerate[s] the defendant of any criminal purpose and [does] not affect any of his civil rights or liberties; and the defendant shall not be considered to have a criminal conviction.\" O.C.G.A. ยง 42-8-62 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. These are among the conditions a Georgia court may impose in sentencing an offender to probation. See O.C.G.A. ยง 42-8-35 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See supra note 37 for the text of the first offender act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. O.C.G.A. ยง 17-10-7(a) (Supp. 1985) provides as follows: Any person convicted of a felony offense in this state . . . and sentenced to confinement in a penal institution, who shall afterwards commit a felony punishable by confinement in a penal institution, shall be sentenced to undergo the longest period of time prescribed for the punishment of the subsequent offense of which he stands convicted, provided that, unless otherwise provided by law, the trial judge may, in his discretion, probate or suspend the maximum sentence prescribed for the offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See supra note 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. We assume that the Bleckley County sheriff brought Pasby before his sentencing judge after he executed the warrant for Pasby's arrest. The record does not indicate whether the judge ordered Pasby \"committed\" for violating the conditions of his probation or released him \"with or without bail to await further hearing,\" e.g., a probation revocation hearing, or dismissed the charge by dissolving the arrest warrant. All that the record shows is that Pasby remained in the Bleckley County jail for about three months.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Nothing in the record suggests that the State was somehow barred, e.g., under the double jeopardy clause, from prosecuting Pasby for this offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. A GBI special agent, in interrogating Pasby in January 1977, told Pasby that if he did not cooperate he would be considered an accessory to the Allen murder. For the full text of the agent's statement to Pasby, see supra note 32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Ten years was the maximum penalty for theft by taking. If sentenced under the habitual offender act, see supra note 48 and accompanying text, Pasby faced a mandatory 10-year prison sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The first offender act, under which Pasby had been sentenced, authorized the court, on a plea of guilty to the charged offense but without an adjudication of the offender's guilt, to sentence him to a period of confinement (up to 10 years for theft by taking) or to place him on probation. See O.C.G.A. ยง 42-8-60(a) (1985). The act also authorized the court, upon revoking the offender's probation, to adjudicate him guilty of the offense to which he had pled guilty and to impose up to the maximum sentence provided for that offense, see O.C.G.A. ยง 42-8-60(b) (1985), which, in Pasby's case, was 10 years. See supra note 43. In sentencing Pasby on November 10, 1976, the court deviated from the statute by imposing a one-year term of imprisonment, and suspending it, before placing Pasby on probation. Although this sentence did not conform to the statute, Georgia courts have upheld similar sentences imposed under the act. See Griffin v. State, 163 Ga. App. 871, 295 S.E.2d 863 (1982) (five-year term of imprisonment suspended and defendant placed on probation under the act); Johnson v. State, 161 Ga. App. 506, 288 S.E.2d 366 (1982) (ten-year term of imprisonment suspended and defendant placed on probation under the act). These cases indicate, however, that a suspended sentence can affect the court's ability, upon revoking probation, to impose a term of imprisonment greater than the suspended sentence unless the court, at the time it places the offender on probation, either informs him in person or in its written sentencing order that he could receive the maximum term of imprisonment allowed by law if he violates the terms of his probation. See Griffin, 163 Ga. App. at 871, 295 S.E.2d at 864. In Pasby's case, the court's written sentencing order did not inform Pasby that, upon the revocation of his probation, he could be sentenced to a prison term of up to 10 years. Therefore, Pasby could not have been subjected to the maximum prison term (his maximum exposure being limited to the unexpired portion of his 12-month suspended sentence) upon the revocation of his probation unless the court informed him in person at sentencing that he remained subject to the maximum prison term. Because the transcript of Pasby's sentencing hearing is not in the record, we do not know whether Pasby was so informed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The final aspect of the Georgia death sentencing scheme involves automatic and mandatory appellate review of every death sentence. See Zant v. Stephens, 462 U.S. 862, 871-80, 103 S. Ct. 2733, 2740-44, 77 L. Ed. 2d 235 (1983); O.C.G.A. ยง 17-10-35(a) (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. In Stein v. Reynolds Securities, Inc., 667 F.2d 33 (11th Cir. 1982), this court adopted as binding precedent all decisions of Unit B of the former Fifth Circuit handed down after September 30, 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. We must assume, of course, that a reasonable juror would discharge his duty under the law and faithfully execute the court's instructions. In this case the instruction required the jury to \"fix punishment . . . at death\" if any statutory aggravating circumstance was found to exist.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. In Stynchcombe v. Floyd, 252 Ga. 113, 114, 311 S.E.2d 828, 830 (1984), the Supreme Court of Georgia held that a jury instruction informing the jury that upon finding one or more aggravating circumstances it was \"authorized to consider imposing a sentence of death\" was not sufficient to explain to the jury that it could also recommend a life sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The Court was careful to note, however, that such a defendant is not constitutionally entitled to choose a psychiatrist of his own personal liking or receive funds to hire his own. Rather the Court required only that he be provided access to a competent, independent psychiatrist to assist him in proving his defense. Ake, 470 U.S. at 83; see also Martin v. Wainwright, 770 F.2d 918, 933-35 (11th Cir. 1985). This is because the constitutionally cognizable objective served by the provision of a psychiatrist's assistance is greater accuracy in the judicial proceedings, not a greater likelihood that the defendant will succeed with his defense. See Ake, 470 U.S. at 77-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Whether the defendant in fact would have benefitted substantially from the assistance of experts of his own is not free from doubt. Indeed, such expert testimony as was offered was less than conclusive, and both direct and cross-examination of the state's expert witnesses amply demonstrated the limited and qualified nature of their opinions. A reading of this record persuades me that experts who might have been available to the defendant would have done little more to limit the force of the testimony of the state's experts than the latter, in candor, did themselves. As my analysis indicates, however, I am willing to assume for the purposes of determining appellant's constitutional claim that the assistance to which he now claims he was entitled in fact would have done him some good.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In the state habeas proceeding on which the state relies in support of its argument that Moore has already received a full and fair hearing on the Brady/Giglio claim only the following version of the claim was presented to the state habeas court: \"The trial court by overruling Petitioner's motion to disclose to whom immunity had been disclosed [sic], and the prosecution by failing to disclose prior to trial to Petitioner that the crucial prosecution witness PASBY, had been promised or granted immunity from a previously suspended trial under the Georgia First Offender Act, deprived Petitioner of due process of law under the Fourteenth Amendment.\" Count Six of petitioner's amended state habeas petition (citations omitted). Thus the state habeas court was not presented with the claim that even if no deal was made, the probation report and information contained therein should have been disclosed under Giglio because it might have aided the defense in its impeachment of Pasby. As a result, it seems clear that Moore has not had a full and fair hearing on the Brady/Giglio claim he seeks to make here. The state habeas court could be said to have found that no deals were made, but could not reasonably be said to have found that no information favorable to the defense was withheld.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority opinion assumes for the purpose of its analysis that Pasby could have been required to serve up to ten years in prison if his probation was revoked. See ante at n.54. The court order placing Pasby on probation stated unequivocally that if he violated the terms of his probation he could be made to serve the remainder of his one year sentence that had been imposed. If the transcript of Pasby's sentencing hearing would have indicated that Pasby was told he might be exposed to ten years of imprisonment upon violation of his probation rather than the remaining part of one, petitioner could have and presumably would have at least alleged as much. I see no reason to assume, for the purposes of determining whether petitioner has made out an entitlement to an evidentiary hearing, facts that are not even alleged. 1 Other circuit courts have considered favorably the question of constitutional entitlement to non-psychiatric experts in capital cases. Williams v. Martin, 618 F.2d 1021, 1025-26 (4th Cir. 1980) (\"There can be no doubt that an effective defense sometimes requires the assistance of an expert witness. . . . Moreover, provision for experts reasonably necessary to assist indigents is now considered essential to the operation of a just judicial system.\"); Mason v. Arizona, 504 F.2d 1345, 1351 (9th Cir. 1974) (\"The effective assistance of counsel guarantee of the Due Process Clause requires, when necessary, the . . . appointment of investigative assistance for indigent defendants in order to insure effective preparation of their defense by their attorneys.\"), cert. denied, 420 U.S. 936, 43 L. Ed. 2d 412, 95 S. Ct. 1145 (1975); cf. Westbrook v. Zant, 704 F.2d 1487, 1494-97 (11th Cir. 1983) (state must furnish psychiatric or psychological experts to indigent capital defendant if evidence not available from other sources is necessary to prove mitigating circumstances); Knott v. Mabry, 671 F.2d 1208, 1212-13 (8th Cir. 1982) (failure of counsel to obtain expert to contradict government witness may constitute \"constitutional flaw in the representation of a defendant. . . .\"). The former Fifth Circuit considered this question in Hoback v. Alabama, 607 F.2d 680, 682 \u0026 n.1 (5th Cir. 1979), and said that, while there might be some situations where states could be required to furnish experts, that question need not be decided in that case. 2 Nor can I accept the state's assertion that in order to justify appointment of experts the defendant must present \"concrete evidence . . . as to specifically what other information he could have obtained by the use of an independent expert, that was not available to him by an examination of the state's expert's [sic]. . . .\" Supplemental Brief of Appellee at 19-20. First, the Court in Ake imposed no such requirement of proof. Second, the state's crabbed reading belies the tone and spirit of the Supreme Court's holding. There was no evidence in Ake to suggest that the expert the defendant sought would necessarily contradict state experts. Nor was there evidence that his witness would provide evidence that was not available from other sources or from cross-examining state witnesses. Experts are the \"basic tools\" necessary for the defendant to marshal his defenses. Experts assist, inter alia, in gathering and interpreting facts and drawing conclusions from them, in formulating strategies for cross-examining the state's experts, and in translating scientific jargon into terms understandable to the fact finder. Ake, U.S. at -, 105 S. Ct. at 1094-96. The Supreme Court's concern was clearly more expansive than the state here admits. 3 I note that the majority places upon the defendant the burden of informing the court whether the physical evidence and the related expert testimony would play an important role in the State's case. This marks a significant modification of the Supreme Court's holding in Ake, which merely required the defendant to demonstrate \"to the trial court that his sanity is likely to be a significant factor in his defense. . . .\" U.S. at, 105 S. Ct. at 1097 (emphasis supplied). Ake is properly read as requiring the defendant to show that from his perspective a given issue will be critical. Accord Bowden v. Kemp, 767 F.2d 761, 764 (11th Cir. 1985). The majority requires him to offer evidence from the perspective of the prosecutor -- an infinitely more difficult burden. 4 Moore's attorney did ask for assistance, in part, \"in order that the defendant can test the validity of and accuracy of any tests which have been run by the State and the results of which may be introduced into evidence against the defendant at trial. . . .\" (emphasis supplied). This is at least suggestive that Moore's attorney recognized that the physical evidence would be important to the state's case and that he needed to be able to respond to it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The expert who examined the semen could only show that it came from someone of Moore's blood group, a trait he shared with forty per cent of the male population.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The microanalyst of the hair samples admitted on cross examination that \"as to whether or not they [the two hairs from the towel] actually come from [a particular person] is impossible to determine in forensic science.\" He further confessed that his attempts to match a hair sample with a particular individual are at best \"right fifty-one percent of the time and wrong forty-nine percent of the time.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority intimates at the end of its discussion of this issue that any prejudice suffered by Moore through failure to appoint an expert to assist him was, in effect, harmless given that his attorney comprehensively cross-examined the state's witnesses and that he did not renew his motion at trial. It is doubtful whether an adequate defense could be had simply by impeaching the witnesses and their findings during cross-examination. As the Supreme Court noted in Ake, expert testimony is often of exceptional persuasiveness to a jury. Even presentation of a contrary witness not billed as an \"expert\" is less effective. U.S. at, n.7, 105 S. Ct. at 1096, n.7. Of course, the average juror would give even less credence to the naturally biased observations of defense counsel in cross-examining state witnesses or in making closing arguments. It is not enough to say that the defendant has the opportunity to respond. Rather, he must be assured of \"a fair opportunity to present his defense.\" Id. at, 105 S. Ct. at 1093 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See, e.g., Brooks v. Kemp, 762 F.2d 1383, 1394 n.15 (11th Cir. 1985) (en banc). Thus, for example, the Court today resolves both the Brady-Giglio claim and the Spivey error, granting relief on both grounds even though it could have remanded this case on either ground alone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Ashwander v. Tennessee Valley Authority, 297 U.S. 288, 341, 346-48, 80 L. Ed. 688, 56 S. Ct. 466 (1936) (Brandeis, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The majority's \" dicta \" rejects both of these claimed justifications.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This presents a mixed question of law and fact. Factual determinations attendant on a habeas petition are presumed correct under 28 U.S.C.A. ยง 2254(d) (1985). But the \"presumption of correctness does not apply to legal findings or to mixed questions of law and fact,\" that is, \"'the application of legal principles to the historical facts of [the] case.'\" Hance v. Zant, 696 F.2d 940, 946-47 (11th Cir.) (brackets in Hance) (quoting Cuyler v. Sullivan, 446 U.S. 335, 342, 64 L. Ed. 2d 333, 100 S. Ct. 1708 (1980)), cert. denied, 463 U.S. 1210, 103 S. Ct. 3544, 77 L. Ed. 2d 1393 (1983), modified on other grounds, Brooks v. Zant, 762 F.2d 1383 (11th Cir. 1985) (en banc). In such cases, the \"Judge must exercise his own judgment on this blend of facts and their legal values.\" Brown v. Allen, 344 U.S. 443, 507, 97 L. Ed. 469, 73 S. Ct. 397 (1953) (opinion of Frankfurter, J.). In a capital case \"the severity of the sentence mandates careful scrutiny in the review of any colorable claim of error.\" Zant v. Stephens, 462 U.S. 862, 885, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In his closing, the prosecutor argued as follows: Now, I sympathize with someone that's [sic] lacked a father; I was fortunate enough to have one and I sympathize as far as Mrs. Moore is concerned about her son, but there is no way that parents today can predict how their children are going to come out, all they can do is the best they can. And I certainly don't think that Carzell Moore is due any sympathy from you Lady and Gentlemen for having a good mother. . . . Now, on the other hand, you've got the Allens. The family is here, all of them. You've seen them in Court, the Courtroom has been full of them. They've come up here in the interest of their loved one just like Mrs. Moore comes in the interest of her loved one. So, the reason for putting up to Mr. Allen, I wanted you to find out something about Teresa just as Carzell related something about himself. Now, when you talk about useless killings, and I think this killing was absolutely useless, there is absolutely no mitigation, no mitigating circumstances whatsoever. . . . There was absolutely no reason in the world for this young girl to have been killed, and I think if you're going to discuss sympathy for Carzell Moore, then you ought to certainly think about what Mr. Allen said about the girl having been an honor graduate in high school, helping her parents by working, trying to earn a living and getting a decent education, better herself, help her folks and here her life is ended at age eighteen, by someone who displays no more emotion and no more feeling, than to come in here to Court and just absolutely deny one hundred percent something that you, Lady and Gentlemen, know that he did and know full well that he did. R.Exh. 5-808--09, 811.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The trial court's ruling that Mr. Allen's testimony could be admitted was also premised on the belief that it would be limited to cumulative information that had come in at trial. In this way it would be a mild rebuttal of sorts to Mrs. Moore's testimony on behalf of her son and the hardships of his life. But in fact the testimony elicited went far beyond what came in before. Here, as elsewhere, the state trial judge seemed to have difficulty controlling the prosecutor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The prosecutor argued as follows: They talk about it not being a deterrent in crimes like this and they talk about it being a deterrent; factors that play a part as to whether or not people will commit crimes of this nature if they knew the punishment that would naturally follow the consequences of their act, and that is, if people knew at the time, would they do senseless crimes of this nature where there is absolutely no reason and no justification, no mitigation whatsoever and if the death penalty is not imposed in cases like this, then what is the reason -- [objection] Well, I submit to you then, Lady and Gentlemen, in this particular case that if the death penalty is not imposed, then it is not a deterrent and that you might as well just kill the witnesses, that you can just get by with it because there's nothing else going to happen to [you], but you get a life sentence and you might as well just kill them all. [objection] R.Exh. 5-814, 816.\u003c/span\u003e\n\n",
    "body_length": 203118,
    "citedas": [
      "809 F.2d 702"
    ],
    "attorneys": "Robert E. Morin, Stephen B. Bright, for Appellant. Daryl A. Robinson, Assistant Attorney General, Susan Boleyn, AAG, William B. Hill, Jr., for Appellee.",
    "category": [
      "36"
    ],
    "judges": "Roney, Chief Judge, Godbold, Tjoflat, Hill, Fay, Vance, Kravitch, Johnson, Hatchett, Anderson, Clark, and Edmondson, * Circuit Judges, and Henderson, ** Senior Circuit Judge. Roney, Chief Judge, concurring in part, specially concurring in part and dissenting in part, in which Fay, Circuit Judge, joins. Godbold, Circuit Judge, dissenting in part and concurring in part. Hill, Circuit Judge, concurring in part and dissenting in part, in which Roney, Chief Judge, Fay and Edmondson, Circuit Judges, and Henderson, Senior Circuit Judge, joins. Johnson, Circuit Judge concurring in part and dissenting in part, in which Kravitch and Hatchett, Circuit Judges, join, and in which Godbold, Circuit Judge, joins Part I and III in part, and in which Anderson and Clark, Circuit Judges, join Part I. ***",
    "citation_count": 102
  }
}
