{
  "id": "CITNPmYBTlTomsSBhG-L",
  "document": {
    "title": "Nichols v. Scott",
    "full_title": "JOSEPH BENNARD NICHOLS -APPELLEE, CROSS-APPELLANT, v. WAYNE SCOTT, DIRECTOR, TEXAS DEPARTMENT OF CRIMINAL JUSTICE, INSTITUTIONAL DIVISION -APPELLANT, CROSS-APPELLEE.",
    "jurisdiction": "Fifth Circuit",
    "date": "1995-11-20T00:00:00.000Z",
    "docket": "No. 92-2720",
    "body": "GARWOOD, Circuit Judge:\n\nPetitioner-appellee, cross-appellant Joseph Bennard Nichols (Nichols) was convicted of capital murder and sentenced to death. After exhausting his Texas state court remedies, Nichols sought a writ of habeas corpus in the district court below and the court granted relief. Respondent-appellant (Respondent), the director of the Texas Department of Criminal Justice, now appeals to this Court. Nichols cross-appeals the district court's denial of certain of the remainder of his claims. We affirm in part and reverse the district court's grant of habeas corpus relief.\n\nFacts and Proceedings Below\n\nAbout 9:00 a.m. on the morning of October 13, 1980, Nichols, Willie Ray Williams (Williams), Charlotte Parker (Parker), and Evelyn Harvey (Harvey) drove to a spot in front of an apartment building near Joseph's Delicatessen and Grocery in Houston, Texas. Nichols and Williams mutually intended to rob this establishment, Nichols having suggested it as a target. Williams was armed with a .380 semi-automatic pistol; Nichols had a snub-nosed .38 revolver. Parker parked the car and Nichols and Williams got out and entered the deli. After entering, Nichols and Williams first went to the back of the store, and then approached the counter. Nichols got a corndog. Williams set a quart of beer on the counter near the cash register. Behind the counter was deli employee Claude Shaffer, Jr. (Shaffer). Nichols, and then Williams, each drew their respective pistols and pointed them at Shaffer.\n\nWhen Shaffer saw the guns he began to bend over or squat down. Nichols then said something to the effect of \"don't go for the gun\" or \"don't be doing it.\" Nichols then shot at Shaffer, and immediately thereafter Williams pulled the trigger on his gun, but it is unclear whether it then discharged.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Shaffer then either fell or squatted down behind the counter. Nichols and Williams ran to the door. Nichols exited. Williams either exited or partially exited and then, according to his testimony at Nichols' trial, turned and fired once at Shaffer, who was still squatting behind the counter. Williams testified that Shaffer fell back, that he (Williams) went behind the counter to Shaffer, turned him over, grabbed the deli's cash box, and ran out of the deli, carrying his gun and the cash box.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e He was picked up by Parker and Harvey, got into the car with them, and they drove around the side of the deli building where they saw Nichols, who then got in the car with them. Harvey testified that Nichols told them \"he had shot the man\" and \"he thought he shot him in the chest,\" and that Williams said he had run back into the deli and shot the man. Parker testified that Nichols said \"I think I hit him in the chest,\" and that Williams said \"he [Williams] shot the man in the shoulder.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e A few days later, Williams, Nichols, Parker, and Harvey were arrested.\n\nThe testimony of the Harris County Medical Examiner, Dr. Espinola, established without contradiction that Shaffer died from a single gunshot wound that entered his \"left upper back about seven and three fourths [inches] to the left of the midline and three and one half inches below the top of the shoulder\" and exited -- without hitting any bones or \"hard objects\" within the body -- \"on the right side of the chest, 18 and one half inches from the right of the midline and 11 inches below the top of the shoulder.\" The wound would have caused \"almost immediate disability\" or \"collapse.\" Shaffer also had a superficial two and a quarter inch slanting laceration on the right side of his head, which was \"consistent with a grazing type of gunshot wound\" and \"could also be consistent with a person that hit their head on the corner of an object or anything like that in a fall.\" The head wound was not disabling. No bullet or bullet fragment was found in or on Shaffer's body. Two empty .380 cartridge cases--ejected from Williams' pistol--were found in the deli, as was also a whole .380 brass-jacketed projectile or bullet, which had been fired from Williams' weapon. A whole, unfired .380 brass-jacketed bullet and cartridge (with firing pin indentation on the cartridge rim) was found just outside the deli door. Lead bullet fragments were found on the inside of the deli door and near there on the floor along with brass jacket fragments. Also found in the deli--in a stack of comic books behind the counter--was a whole lead bullet that had been fired from a .38-caliber weapon. This was a revolver-type bullet that had never been jacketed.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn January 1981, Williams pleaded guilty to a charge of capital murder of Shaffer,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and, accordingly, the trial court directed the jury to return a verdict of guilty at the guilt/innocence phase of his trial. As evidence of his guilt, the state presented Williams' written confession, as well as the testimony of several witnesses including Dr. Espinola. Pursuant to the court's direction, the jury returned a verdict of guilty. At the subsequent punishment phase of Williams' trial, the defense presented Williams' testimony and the testimony of five witnesses concerning Williams' nonviolent character. The defense also called Nichols during the punishment phase, but Nichols asserted his Fifth Amendment privilege and declined to testify. The punishment charge included no instruction respecting the law of parties. The jury returned a verdict at the punishment phase of Williams' trial answering in the affirmative each of the three special issues then provided for by Tex. Code Crim. Proc. art. 37.071(b).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Pursuant to art. 37.071(e), Williams was accordingly sentenced to death. His conviction and sentence were affirmed on appeal. Williams v. State, 674 S.W.2d 315 (Tex. Crim. App. 1984).\n\nNichols was also indicted for the capital murder of Shaffer.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In July 1981, Nichols was tried before a jury on his plea of not guilty. Williams testified as a defense witness at the guilt/innocence stage of this trial, and his testimony was generally consistent with his prior testimony and statement.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The jury charge at the guilt/innocence stage included instructions on the Texas law of parties.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Based in large part on Williams' testimony, the defense argued that the fatal shot was fired by Williams from the deli door when he came back in and got the cash box, and that Nichols was not guilty under the law of parties because the planned robbery was over and Williams was acting independently. The state argued that Williams' testimony that he shot Shaffer from the door when he came back in was not worthy of belief \"because he's got to shoot through the cash register and all that junk to get here.\" The state also argued that Nichols told Harvey that \"he shot first, that he shot the man in the chest, in the chest area, the body, not in the head, not in the leg, not in the arm, but in the chest area, the body. That's what the defendant did.\" However, the main thrust of the state's argument was that regardless of who fired the fatal shot, and regardless of whether Williams' testimony was credited, Nichols was guilty under the law of parties. The jury returned a verdict finding Nichols guilty of capital murder. The punishment stage of the trial then ensued, testimony was presented by the state and the defense, and the case was submitted to the jury on the three statutory special issues (see note 6, supra). The punishment charge included no instruction on the law of parties. After considerable deliberation, the jury foreman announced that the jury had arrived at a verdict on two of the special issues, and tendered to the court a verdict form in which the first and third special issues were each answered \"yes,\" and the second special issue (future dangerousness) was not answered. The court ruled the verdict was incomplete, refused to accept it, and returned the jury for further deliberations. The jury eventually sent a note stating \"the jury is still unable to reach a verdict on the remaining special issue.\" Thereafter, defense counsel moved for a mistrial because the jury could not reach a verdict. The court explained to Nichols personally that if a mistrial were declared then the matter would be retried before another jury. After ascertaining that Nichols understood and that he personally requested and moved for a mistrial, the court, on July 31, 1981, called the jury back in, announced that a mistrial had been declared, and formally discharged the jury.\n\nThe assistant district attorney trying the case thereafter interviewed some of the jurors and, as the district court below found, \"learned from those jurors that whether or not Nichols was the 'triggerman' had caused problems for the jury in considering the death penalty.\" Nichols v. Collins, 802 F. Supp. 66, 75 (S.D. Tex. 1992).\n\nIn February 1982, Nichols was tried before another jury on the same indictment. Generally the same evidence was presented as at his first trial in July 1981. The prosecutor was the same as in that first trial. In the guilt/innocence phase, Williams was called as a defense witness but claimed his Fifth Amendment privilege and refused to testify. The defense then put in evidence Williams' testimony as given at Nichols' first trial.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e At the close of the evidence on the guilt/innocence stage of the trial, the trial court extensively instructed the jury on the Texas law of parties (see note 9, supra) such that the jury could, depending on what else it found, find Nichols guilty as charged either for personally having fired the fatal shot or for the fatal shot fired by Williams, if that was done pursuant to and in furtherance of their conspiracy to rob the deli and should have been anticipated by Nichols as a result of carrying out the conspiracy.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The defense argued, as it had at Nichols' first trial, that Williams fired the fatal shot from the deli door as he exited and came back in, and that this was, in the words of the charge, \"the separate act of Willie Ray Williams, acting independently,\" for which Nichols would not be responsible. The state primarily argued that Nichols fired the fatal shot. But, it also argued extensively, in the alternative, that even if Williams had fired the fatal shot, Nichols was guilty of capital murder under the law of parties.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The jury returned its verdict finding Nichols guilty of capital murder.\n\nAt the subsequent punishment phase the state submitted evidence that Nichols had been convicted of theft in 1979, and had pleaded guilty in May 1980 to an April 1980 robbery for which he was sentenced in July 1980 to nine years' felony probation, which he was serving when he committed the instant offense. Additionally, it was shown that on August 13, 1980, Nichols committed an armed robbery of a convenience store, shooting the clerk in the shoulder when he did not respond speedily enough to Nichols' demand for more money. Nichols continued to demand more money as the clerk was bleeding from his wound. Further, on October 11, 1980, two days before the present offense, Nichols committed another robbery of a convenience store, aiming his pistol at the clerks. There was also evidence that when booked into jail following his arrest for the instant offense, Nichols had stated he would \"shoot any deputy that got in his way.\" Finally, there was evidence that in June 1981, while in jail awaiting trial, Nichols conspired with others to engage in an escape involving the use of a firearm and other weapons. The defense called fifteen witnesses. Many testified they thought Nichols could be rehabilitated, that he was nineteen at the time of the offense, and that at school he had had average grades, had been an excellent athlete, and had presented no disciplinary problems. His parents divorced when he was seven, but both maintained a good relationship with him. He married, and dropped out of school, at about age seventeen to support his young child. His parents thought he had gotten into trouble due to the pressure he was under to support his young child and because he got in with a bad crowd.\n\nThe court submitted the three punishment special issues to the jury (see note 6, supra). No instruction was given respecting the law of parties. The defense argued, among other things, that the fatal shot was fired by Williams, and that any shooting was in reaction to Shaffer's having grabbed his gun. Emphasis was put on Nichols' youth, his family, his character witnesses, and his potential for rehabilitation. The state argued that Nichols fired the fatal shot, but did not argue any of the special issues solely on that theory.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e It stressed Nichols' prior offenses and conduct in jail. Neither side argued that the verdict of guilty established or meant that Nichols fired the fatal shot, or that any of the special issues were to be answered by reference to Williams', rather than Nichols', state of mind or conduct or the like. On February 26, 1982, the jury returned its verdict answering all three special issues in the affirmative, and the court sentenced Nichols to death.\n\nOne of Nichols' trial attorneys, E. Neil Lane (Lane), was appointed to represent Nichols on direct appeal. After receiving leave from the court, attorney Brian Wice was allowed to substitute as Nichols' appellate counsel. Wice filed a supplemental brief that raised twenty points of error. After considering each of the issues raised in the original brief filed by Lane and each of the issues raised in the Wice supplemental brief, the Texas Court of Criminal Appeals affirmed the conviction and sentence. Nichols' conviction became final on January 9, 1989, when the United States Supreme Court denied certiorari. See Nichols v. State, 754 S.W.2d 185 (Tex. Crim. App. 1988), cert. denied, 488 U.S. 1019, 109 S. Ct. 819, 102 L. Ed. 2d 808 (1989).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn May 1989, Nichols, now represented by new counsel, two attorneys of a leading Houston law firm, filed an 86-page application for habeas corpus in the Texas trial court. Amended applications were filed on June 9, 1989, January 8, 1990, and June 6, 1990, the latter being some 123 pages long. The state filed an answer and amended answer supported by affidavits. On October 19 and November 2, 1990, the Texas trial court conducted an evidentiary hearing on Nichols' claims of ineffective assistance of counsel and his statistical challenge to the Texas death penalty statute as unconstitutional in its application. The trial court on June 28, 1991, entered an order recommending denial of all relief and adopting verbatim the state's amended proposed findings of fact and Conclusions of law. On December 12, 1991, the Texas Court of Criminal Appeals denied all relief in an order stating in relevant part: \"The trial court, after holding an evidentiary hearing, has entered findings of fact and Conclusions of law and recommended the relief sought be denied. This Court has reviewed the record with respect to the allegations now made by applicant and finds that the findings and Conclusions entered by the trial court are supported by the record. The relief sought is denied.\"\n\nNichols, represented by the same counsel who represented him in his state habeas proceedings, in January 1992 filed the instant petition under 28 U.S.C. ยง 2254 in the district court below. Nichols asserted numerous claims before the district court, including (1) that the punishment special issues precluded the jury from considering or giving effect to mitigating character evidence and to evidence that Nichols did not kill Shaffer; (2) that the prosecutor's use of contradictory theories at the trials of Williams and Nichols violated the doctrines of judicial estoppel, collateral estoppel, due process, and the duty to seek Justice; (3) that Williams should have been compelled by the court to testify for the defense because he waived his right to remain silent when he testified at the first Nichols trial; (4) that retrial of Nichols constituted double jeopardy; (5) that the prosecutor knowingly failed to correct perjured testimony given by Parker about her cooperation agreement with the state and created the false impression in his summation that she was unaware of a promise of leniency that her attorney received in exchange for her testimony; (6) that the Texas death penalty statute and its consistent interpretation by the Court of Criminal Appeals operated to deny Nichols his rights under the Sixth, Eighth, and Fourteenth Amendments; (7) that Nichols was denied effective assistance of both trial and appellate counsel; (8) that Nichols was denied a meaningful direct appeal; and (9) that various instances of claimed prosecutorial misconduct occurred. The state answered and moved for summary judgment.\n\nThe district court held an evidentiary hearing in March 1992.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e On August 31, 1992, the district court granted habeas relief and ordered Nichols released or retried within 120 days.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The district court based its decision to grant relief on its Conclusions that (1) the major mitigating thrust of Nichols' claimed nontriggerman role in the offense was beyond the scope of any of the punishment special issues; (2) by arguing that Nichols fired the shot that killed Shaffer after obtaining a death sentence against Williams for killing Shaffer, the state violated principles of constitutional collateral estoppel; and (3) the foregoing two Conclusions, taken in combination with certain aspects of the state habeas proceedings, resulted in denial of Nichols' due process rights. Nichols, 802 F. Supp. at 71-79. The district court determined, however, that the referenced aspects of the state habeas proceeding did not preclude the state habeas court's findings from being accorded the presumption of correctness called for by 28 U.S.C. ยง 2254(d), id. at 70, except the district court declined to accord that presumption to the finding that \"'the jury was presented with overwhelming evidence that both applicant [Nichols] and Williams shot Shaffer,'\" \"because the record, as a whole, does not fairly support such factual determination\" in that \"the only Conclusion which the record supports is that both Williams and Nichols shot at Shaffer but that either Williams or Nichols actually shot Shaffer.\" Id. at 75 (original emphasis).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe district court denied the remainder of Nichols' claims,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e except a claim, raised for the first time in briefing following the March 1992 federal evidentiary hearing,\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e concerning the state's alleged suppression of exculpatory evidence contrary to Brady v. Maryland, 373 U.S. 83, 10 L. Ed. 2d 215, 83 S. Ct. 1194 (1963), which Brady claim the district court found unexhausted and \"denied without prejudice to refiling after exhausting state remedies.\" 802 F. Supp. at 79.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nRespondent now appeals the district court's grant of habeas relief. Nichols cross-appeals the court's denial of some (but not all) of his other claims.\n\nDiscussion\n\nI. Respondent's Appeal\n\nA. Mitigating Effect of Nichols' Role in the Offense Beyond Scope of Special Issues\n\nRespondent argues that the district court erred in concluding that the mitigating effect of Nichols' claimed nontriggerman status was beyond the scope of the special issues. Respondent asserts that the district court's Conclusion is contrary to Fifth Circuit precedent and that, even if it were not, the court ignored a state procedural bar based on Nichols' failure to object to the charge on this basis or to request an anti-parties instruction at the sentencing phase of his state trial.\n\nThe Court of Criminal Appeals on direct appeal rejected Nichols' point of error complaining of the failure to give an \"anti-parties\" charge at the punishment phase of the trial because Nichols failed to request or object to the absence of such a charge. Nichols, 754 S.W.2d at 198-199. The Court recognized that the law of parties did not apply at the punishment stage, but held that the punishment special issues adequately covered the requirements of Enmund v. Florida, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140 (1982),\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and Green v. State, 682 S.W.2d 271 (Tex. Crim. App. 1984), cert. denied, 470 U.S. 1034, 105 S. Ct. 1407, 84 L. Ed. 2d 794 (1985).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The Court found that\n\n\". . . appellant was not egregiously harmed by the lack of such a charge. Although the jury was charged on the law of parties at the guilt stage, it cannot be presumed that they considered the same during punishment. To the contrary, the careful trial court, while not having the benefit of the Green decision at the time of trial, voir dired the jury on the fact that the law of parties, while applicable at guilt, was not applicable to the punishment special issues. Moreover, the special issues themselves incorporate the Enmund-Green requirements by directly focusing upon solely the defendant's culpability.\n\nWhile a prophylactic 'anti-parties' instruction should be given at punishment, upon request, the absence of such an instruction in the instant case did not constitute egregious error or harm.\" Nichols at 199 (footnote omitted).\n\nThe state habeas court specifically rejected Nichols' claim that the punishment special issues, combined with the failure to give an \"anti-parties\" instruction at the punishment phase, unconstitutionally prevented the jury from adequately considering and giving favorable effect to his claimed nontriggerman status, on the basis that such claim was procedurally barred by Nichols' failure to object to the punishment charge on that basis or to request an \"anti-parties\" or other special punishment instruction in that respect.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The Court of Criminal Appeals determined that the state habeas court's findings were proper and denied relief on that basis.\n\nWe conclude that Nichols has not shown cause for his procedural default in this respect, and further has not demonstrated prejudice, so his claim in this regard is procedurally barred, as respondent asserted below. This holding is plainly mandated by our holding in Buxton v. Collins, 925 F.2d 816, 820-822 (5th Cir.), cert. denied, 498 U.S. 1128, 111 S. Ct. 1095, 112 L. Ed. 2d 1197 (1991), as well as by the principles of Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977), and Engle v. Isaac, 456 U.S. 107, 102 S. Ct. 1558, 71 L. Ed. 2d 783 (1982), and their progeny.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nMoreover, and apart from any procedural bar, Nichols' claim fails on the merits. In Harris v. Collins, 990 F.2d 185, 189 (5th Cir.), cert. denied, 125 L. Ed. 2d 746, 113 S. Ct. 3069 (1993), a case where a capital defendant's conviction may have rested on the law of parties, we specifically held that if the jury believed the defendant did not strike the fatal blow this was a matter they could consider as favorable to a negative answer to both the first and second punishment issues. See also Bridge v. Collins, 963 F.2d 767, 770 (5th Cir. 1992), and Drew v. Collins, 964 F.2d 411, 421 (5th Cir. 1992).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Further, in Stewart v. Collins, 978 F.2d 199, 201 (5th Cir. 1992), cert. denied, 123 L. Ed. 2d 656, 113 S. Ct. 1951 (1993), we held that the jury at the punishment stage could adequately consider the defendant's asserted \"nontriggerman\" role in the capital murder and his lack of intent to kill as supportive of negative answers to each of the first and second punishment special issues. More recently, in Jacobs v. Scott, 31 F.3d 1319, 1326 \u0026 n.13 (5th Cir. 1994), cert. denied, 115 S. Ct. 771 (1995), we again held that the first and second punishment special issues adequately allowed the jury to give mitigating effect to claimed \"nontriggerman\" status, notwithstanding the absence of an \"anti-parties\" instruction at sentencing.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See also, e.g., Skillern v. Estelle, 720 F.2d 839, 843 (5th Cir. 1983), cert. denied, 105 S. Ct. 224 (1984); Johnson v. McCotter, 804 F.2d 300 (5th Cir. 1986), cert. denied, 107 S. Ct. 1262 (1987); Andrews v. Collins, 21 F.3d 612, 630-31 (5th Cir. 1994).\n\nWe further note that no law of parties instruction was given at the punishment phase, and that neither the prosecution nor the defense ever argued or asserted that the law of parties applied at the punishment phase or that the finding of guilty meant that the jury in answering any of the punishment issues had to assume that Nichols fired the fatal shot or that Williams' conduct and state of mind, rather than Nichols', was the relevant consideration in answering any of the punishment issues. The defense stressed in argument at the punishment phase that Williams, not Nichols, fired the fatal shot. It is apparent, considering the entire record, from voir dire through sentencing, that all concerned operated on the assumption that the law of parties did not apply at sentencing. Moreover, as the court below found, some jurors in Nichols' first trial did take into account in voting for a negative answer to the second special issue their belief that Nichols was not the triggerman, notwithstanding that the law of parties was instructed on at the guilt/innocence stage and no \"anti-parties\" instruction was given at the punishment phase. We are convinced that there is no \"reasonable likelihood,\" Estelle v. McGuire, 502 U.S. 62, 112 S. Ct. 475, 482, 116 L. Ed. 2d 385 (1991); Johnson v. Texas, 125 L. Ed. 2d 290, 113 S. Ct. 2658, 2669 (1993), that the punishment phase jury in Nichols' February 1982 trial applied or understood the punishment phase instructions or special issues as other than allowing them to consider Nichols' claimed \"nontriggerman\" status as a factor that could favor a negative answer to the first and second sentencing issues. The mitigating aspect of the evidence of Nichols' claimed \"nontriggerman\" status was \"within 'the effective reach of the sentencer.'\" Johnson at 2669 (quoting Graham v. Collins, 506 U.S. 461, 113 S. Ct. 892, 901, 122 L. Ed. 2d 260 (1993)).\n\nWe hold that Nichols is entitled to no relief on his claim that the instructions and special issues at the punishment phase precluded the jury from adequately considering or giving mitigating effect to his claimed nontriggerman status, and that the district court erred in holding to the contrary.\n\nB. Estoppel -- Due Process\n\nRespondent next argues that the district court improperly granted relief on the basis of its Conclusion that the prosecutor violated principles of estoppel and due process by arguing for and obtaining a conviction and death sentence against two men for firing a single bullet. Respondent contends that the district court in this respect granted Nichols the benefit of a new rule not compelled by existing precedent when Nichols' conviction became final, contrary to Teague v. Lane, 489 U.S. 288, 109 S. Ct. 1060, 103 L. Ed. 2d 334 (1989), and that in any event the district court erred because collateral estoppel is not applicable in criminal cases lacking common defendants, and even if it were, the question of who fired the fatal bullet is not an issue to which estoppel would apply.\n\nThe district court concluded that \"the due process boundary upon prosecutorial conduct and the appearance of basic fairness derived from that boundary commands a determination that, in a criminal prosecution, the State is constitutionally estopped from obtaining a fact finding in one trial and seeking and obtaining an inconsistent fact finding in another trial.\" Nichols, 802 F. Supp. at 74 (emphasis added). The court also noted that while \"Williams and Nichols can both be guilty of capital murder because the state of Texas has determined, by law, that both are equally culpable without regard to who fired the bullet which killed Shaffer. . . . William and Nichols cannot both be guilty of firing the same bullet because physics will not permit it.\" Id. (emphasis in original). The district court did not conclude that Williams had in fact fired the fatal bullet, or that any of the prosecutor's evidence and argument in Nichols' trial was factually false. With respect to the state's arguments in Nichols' second trial that Nichols fired the fatal shot and its arguments in Williams' case that Williams did, the court stated \"this Court acknowledges the State's argument that the above are merely different interpretations of the same evidence,\" id. at 74, and the court never suggested that this characterization was factually inaccurate. Nor did the district court with respect to what the evidence showed at any of the three trials ever state anything in this respect more definite or precise than \"the only Conclusion which the record supports is that both Williams and Nichols shot at Shaffer but that either Williams or Nichols actually shot Shaffer.\" Id. at 73 (original emphasis).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e What the district court did determine was that, regardless of what the actual facts were or what the evidence showed, the Williams trial legally or judicially established that Williams, not Nichols, fired the fatal shot. Thus, the district court stated:\n\n\". . . the State argued, the jury found, and the court accepted the determination in the Williams trial that Williams was the triggerman, not just a party to the offense. That fact was established as the truth. This Court has also concluded that the prosecutor in charge of Nichols II offered evidence and argued to the jury and court that Nichols was the triggerman. By prior judicial determination, the evidence submitted was necessarily false. Accordingly, this Court finds that the prosecutor in charge of Nichols II knowingly used false evidence to obtain the conviction and sentence in Nichols II.\" Id. at 75.\n\nThe district court, citing Rogers v. Lynaugh, 848 F.2d 606 (5th Cir. 1988), noted that due process violations could either be specific, where particular protections of the Bill of Rights incorporated into the Fourteenth Amendment were transgressed, or \"generic.\" Nichols, 802 F. Supp. at 72. As no particular Bill of Rights provision was cited by the district court, it appears to have relied on the concept of a \"generic\" due process violation. But such a concept generally focuses on the reliability or fairness of the fact finding process in the particular trial the result of which is being challenged. Cf. Rogers at 610 (noting that prosecutor's injecting into the challenged trial \"issues broader than the guilt or innocence of the accused under the controlling law\" could constitute a generic due process violation). What happened in Williams' trial -- which the Nichols defense team was clearly aware of -- did not affect the reliability or fairness of the fact finding process in either of Nichols' trials.\n\nWhat the district court in substance did here was to hold that the state was collaterally estopped from taking in Nichols' case a different position as to who fired the fatal bullet than that which it took in Williams' prosecution. As the Supreme Court observed in Schiro v. Farley, 127 L. Ed. 2d 47, 114 S. Ct. 783, 790 (1994):\n\n\"In Ashe v. Swenson, 397 U.S. 436, 90 S. Ct. 1189, 25 L. Ed. 2d 469 (1970), we held that the Double Jeopardy Clause incorporates the doctrine of collateral estoppel in criminal proceedings. . . . Collateral estoppel, or, in modern usage, issue preclusion, 'means simply that when an issue of ultimate fact has once been determined by a valid and final judgment, that issue cannot again be litigated between the same parties in any future lawsuit.' Ashe, 397 U.S. at 443, 90 S. Ct. at 1194.\" (Emphasis added).\n\nIt is apparent from this that Ashe, which was a state prosecution, rests not on \"generic\" due process, but rather on the double jeopardy clause of the Fifth Amendment, which Benton v. Maryland, 395 U.S. 784, 89 S. Ct. 2056, 23 L. Ed. 2d 707 (1960), had previously held was incorporated into the Fourteenth Amendment's due process clause. We have rejected \"attempts to erect a due process basis, independent of the double jeopardy clause, for the application of collateral estoppel.\" Showery v. Samaniego, 814 F.2d 200, 203 (5th Cir. 1987).\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nBecause Nichols was not in jeopardy in Williams' trial, the results of that trial do not bind the state in its prosecution of Nichols. Moreover, the rule of \"collateral estoppel\" described in Ashe as having been applied in federal criminal cases for \"more than 50 years\" -- and which it ultimately held mandated by the double jeopardy clause -- required that the two actions be between \"the same parties.\" Ashe, 90 S. Ct. at 1194. Thus, because Nichols was not a party in Williams' trial, the result in that trial could not collaterally estop the state in its prosecution of Nichols even under the federal common law rule of collateral estoppel in criminal cases. We have declined to apply collateral estoppel against the United States in a criminal prosecution on the basis of an earlier determination in the United States' criminal prosecution of a different defendant. United States v. Mollier, 853 F.2d 1169, 1176 (5th Cir. 1988) (where defendants are different \"collateral estoppel has no application in criminal cases\"); United States v. Montes, 976 F.2d 235, 239 (5th Cir. 1992) (same), cert. denied, 123 L. Ed. 2d 459, 113 S. Ct. 1831 (1993).\n\nWe recognize, as we did in Mollier and Montes, that in civil cases collateral estoppel is now applied even where the parties are not the same, so that if a suitor has fully and fairly litigated an issue and it is determined against him in an action against one party, then third parties unrelated to the original action can generally bar that suitor from relitigating that same issue in a subsequent action again them. See Mollier at 1175 n.7; Montes at 239. However, as we pointed out in Mollier, citing Standefer v. United States, 447 U.S. 10, 100 S. Ct. 1999, 64 L. Ed. 2d 689 (1980), the \"efficiency concerns that drive the collateral estoppel policy on the civil side are not nearly so important in criminal cases.\" Mollier at 1176. We also observe that even in the civil context the modern broad rule of collateral estoppel is frequently not applied against the government acting in its sovereign capacity. See United States v. Mendoza, 464 U.S. 154, 104 S. Ct. 568, 78 L. Ed. 2d 379 (1984) (holding in an immigration context that the government could not be collaterally estopped from litigating a constitutional issue concerning its administration of the Nationality Act, adjudicated against it in a prior action brought by a different party). Moreover, we observe that \"until relatively recently, however, the scope of collateral estoppel was limited by the doctrine of mutuality of parties.\" Parklane Hosiery Co., Inc. v. Shore, 439 U.S. 322, 99 S. Ct. 645, 649, 58 L. Ed. 2d 552 (1979). See also Restatement of Judgments ยง 93 (1942) (\"[A] person who is not a party . . . is not bound by or entitled to claim the benefits of an adjudication\"). Consequently, allowing persons to claim collateral estoppel benefits of an adjudication to which they were strangers can hardly be considered as mandated by historic concepts of fundamental fairness or due process.\n\nMoreover, the district court clearly erred in its Conclusion that in the Williams trial the jury found that Williams fired the fatal shot. The jury made no such finding. Williams pleaded guilty and the jury was instructed to return a verdict of guilty. It did so, merely signing and returning the verdict form finding Williams \"guilty of the offense of capital murder, as charged in the indictment.\" The jury charge said nothing about the elements of the offense or about whether Williams fired the fatal bullet (or personally killed Shaffer) or whether the jury had to so find.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Nor is it relevant that the indictment (see note 5, supra) alleged that Williams killed Shaffer by shooting him, for under Texas law the indictment was clearly sufficient to support a conviction based on the law of parties with the fatal shot being fired by Nichols (see cases cited in the last paragraph of note 9, supra). Moreover, the evidence at the guilt/innocence stage of Williams' trial showed that both Williams and Nichols were acting together to commit armed robbery of Shaffer, that both fired at Shaffer, and that one of these shots was fatal, but it was not clearly established which. While the evidence would support the Conclusion that Williams fired the fatal shot, a jury could have had a reasonable doubt of this and still found Williams guilty as charged under the law of parties. In any event, under Texas law when a defendant pleads guilty before the jury, as Williams did, the plea itself establishes his guilt and the evidence is unnecessary and immaterial unless it affirmatively demonstrates his innocence. Williams, 674 S.W.2d at 318, 320.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e And, the punishment phase verdict contained no finding that Williams fired the fatal shot. Further, neither the form of the punishment issues, nor the court's charge, nor the evidence, required such a finding in order to return an affirmative answer to the three punishment special issues.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Although the Court of Criminal Appeals in reciting the evidence on Williams' direct appeal stated that he fired the fatal shot, Williams at 317, nothing in its opinion suggests that this was a necessary predicate for its affirmance of the sentence (or the conviction). In finding the evidence sufficient to support the affirmative answers to the punishment special issues, the Court of Criminal Appeals in Williams relied on Smith v. State, 540 S.W.2d 693 (1976), a case in which it sustained a death sentence for a nontriggerman (there, the defendant's \"gun misfired. The co-defendant shot and killed the attendant\"). Williams at 321. In Nichols' case, the Court of Criminal Appeals held the evidence sufficient to support the affirmative answers to the three special issues although it concluded it was \"factually unknown and evidentiarily improvable who fired the fatal shot.\" Nichols, 754 S.W.2d at 202 n.18.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nIn Dowling v. United States, 493 U.S. 342, 110 S. Ct. 668, 672, 107 L. Ed. 2d 708 (1990), the Court noted that the rule of Ashe was that \"'when an issue of ultimate fact has once been determined by a valid and final judgment, that issue cannot again be litigated between the same parties in any future lawsuit.'\" Id. (quoting Ashe at 1194). Dowling refused to give the defendant's prior acquittal in another case preclusive effect because \"the prior acquittal did not determine an ultimate issue in the present case.\" Dowling at 672. In Schiro, the Court rejected a claim of double jeopardy based on the jury verdict in the defendant's first trial, because the defendant \"has not met his burden of establishing . . . that an 'issue of ultimate fact has once been determined' in his favor.\" Id., 114 S. Ct. at 790. Here Nichols has failed to demonstrate that Williams' trial determined that Williams, rather than Nichols, fired the fatal shot. Nichols has likewise failed to demonstrate that whether Williams, rather than Nichols, fired the fatal shot was an \"ultimate issue\" in either his own trial or in Williams' trial. Hence Nichols fails to meet the requirements of collateral estoppel on these additional bases, as well as because he was not a party to the Williams case.\n\nNichols also contends in this connection that the state was barred by the doctrine of judicial estoppel from taking a position in his trial inconsistent with that it had taken in Williams', a view which the district court appears to likewise have adopted.\n\nCommon law judicial estoppel has been referred to as an \"obscure doctrine,\" United States v. McCaskey, 9 F.3d 368, 378 (5th Cir. 1993), cert. denied, 128 L. Ed. 2d 211, 114 S. Ct. 1565 (1994); United States v. Kattar, 840 F.2d 118, 129-130 n.7 (1st Cir. 1988), lacking \"defined principles\" and subject to criticism as \"basically an 'ad hoc' decision in each case.\" Jackson Jordan, Inc. v. Plasser American Corp., 747 F.2d 1567, 1579 (Fed. Cir. 1984). See also Morris v. State of California, 966 F.2d 448, 453 (9th Cir. 1991) (\"the doctrine of judicial estoppel 'is an equitable doctrine invoked by the court at its discretion'\"), cert. denied, 121 L. Ed. 2d 57, 113 S. Ct. 96 (1992). \"The doctrine has not been uniformly adopted by federal courts.\" Bates v. Long Island Ry. Co., 997 F.2d 1028, 1037 (2d Cir.), cert. denied, 126 L. Ed. 2d 452, 114 S. Ct. 550 (1993). \"The Tenth Circuit, however, has rejected the doctrine of judicial estoppel.\" United States v. 49.01 Acres of Land, 802 F.2d 387, 390 (10th Cir. 1986). In Konstantinidis v. Chen, 200 U.S. App. D.C. 69, 626 F.2d 933, 938 (D.C. Cir. 1980), the court held that \"the judicial estoppel doctrine has no validity in this jurisdiction,\" referring to local District of Columbia law, and stated that \"judicial estoppel has not been followed by anything approaching a majority of jurisdictions, nor is there a discernible modern trend in that direction.\" In UMWA 1974 Pension v. Pittston Co., 299 U.S. App. D.C. 339, 984 F.2d 469 (D.C. Cir.), cert. denied, 113 S. Ct. 3069 (1993), the Court observed \"we have not previously embraced the doctrine of judicial estoppel in this circuit and we decline to do so in this case.\" Id. at 477 (footnote omitted). In Bates the Second Circuit stated that judicial estoppel's \"elements have never been clearly defined in this Circuit.\" 997 F.2d at 1037 (footnote omitted). See also Morris at 452 (\"Although this circuit has adopted the doctrine of judicial estoppel, we have not yet determined the circumstances under which it will be applied\").\n\nTwo things, however, may be said about the rather amorphous doctrine of judicial estoppel. First, there is no indication in the authorities that it is constitutionally mandated. Second, it has apparently never been applied against the government in a criminal case. See McCaskey at 378 (\"an obscure doctrine that has apparently never been applied in a criminal case\"); Kattar at 129-30 n.7 (\"as far as we can tell, this obscure doctrine has never been applied against the government in a criminal proceeding\"). See also, e.g., State v. Abbott, 64 N.J. Super. 191, 165 A.2d 537, 543 (App. Div. 1960) (\"the application of estoppel against the State is particularly inappropriate in areas such as criminal prosecution\"), rev'd on other grounds, aff'd in this respect, 36 N.J. 63, 174 A.2d 881, 889 (N.J. 1961); 28 Am.Jur.2d, Estoppel and Waiver, ยง 126 at 788 (same). Cf. Office of Personnel Management v. Richmond, 496 U.S. 414, 110 S. Ct. 2465, 2470, 110 L. Ed. 2d 387 (\"we have reversed every finding of estoppel [against the government] that we have reviewed\"), 2471 (\"we leave for another day whether an estoppel claim could ever succeed against the Government\") (1990).\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn the present circumstances, to hold that the state was constitutionally barred by any form of estoppel -- whether under the rubric of collateral estoppel or some variety of judicial or other estoppel -- from taking the position in Nichols' case that the shot he fired was the fatal shot because it had previously taken the position in Williams' case, in which Williams received the death sentence, that the fatal shot was the one fired by Williams, would be to apply \"a new rule\" of constitutional law \"not dictated by precedent existing at the time\" Nichols' \"conviction became final\" -- January 9, 1989 -- contrary to Teague v. Lane, 489 U.S. 288, 109 S. Ct. 1060 at 1061, 1070, 103 L. Ed. 2d 334 (1989) (original emphasis). The two Teague exceptions are inapplicable. The rule contended for by Nichols plainly is not one which \"places 'certain kinds of primary, private individual conduct beyond the power of the criminal law-making authority to proscribe.'\" Teague at 1075. Certainly, Nichols was properly eligible for the death penalty whether or not the shot he fired at Shaffer -- as opposed to that fired by his co-actor Williams -- was the cause of Shaffer's death. Nor is the other Teague exception available here, as it applies only to \"those new procedures without which the likelihood of an accurate conviction is seriously diminished.\" Id. at 1077 (emphasis added). What the prosecution argued in the Williams case, and the result there, has nothing to do with the likely accuracy of any determinations made in the subsequent Nichols case.\n\nAs noted, a rule is \"new\" for Teague purposes unless \" dictated \" by prior precedent. Id. at 1070 (original emphasis); Butler v. McKellar, 494 U.S. 407, 110 S. Ct. 1212, 1216, 108 L. Ed. 2d 347 (1990). The prior precedent must be such that it would have \"compelled\" the result; Saffle v. Parks, 494 U.S. 484, 110 S. Ct. 1257, 1260, 108 L. Ed. 2d 415 (1990), and it is not enough that the contended for rule merely \"is within the 'logical compass' of an earlier decision, or indeed that it is 'controlled' by a prior decision.\" Butler at 1217. The authority relied on by Nichols does not come even close to meeting this standard.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Nor can this result be avoided by invoking longstanding judicial pronouncements that due process concerns itself with fundamental fairness and similar concepts. Such \"a level of generality . . . is far too great to provide any meaningful guidance for purpose of our Teague inquiry.\" Gilmore v. Taylor, 124 L. Ed. 2d 306, 113 S. Ct. 2112, 2119 (1993). See also Sawyer v. Smith, 497 U.S. 227, 110 S. Ct. 2822, 2828, 111 L. Ed. 2d 193 (1990) (Teague \"test would be meaningless if applied at this level of generality\").\n\nIn Jacobs v. Scott, 31 F.3d 1319, 1326 (5th Cir. 1994), cert. denied, 130 L. Ed. 2d 618, 115 S. Ct. 711 (1995), we held that a similar contention to that advanced by Nichols here was barred by Teague.\n\nWe accordingly hold that the district court erred in granting Nichols relief on the basis that the state was in some manner estopped or barred by its arguments and the result in the Williams trial from taking the position in the subsequent Nichols trial that the shot fired by Nichols was the fatal shot. Relief on any such basis was barred by Teague.\n\nC. Cumulative Due Process\n\nThe district court, relying on the panel opinion in Derden v. McNeel, 938 F.2d 605 (5th Cir. 1991),\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e held that the combination of the two above-noted grounds on which it granted relief -- that the punishment issues did not allow mitigating consideration of Nichols' alleged non-triggerman status and that the state was estopped to argue that the shot fired by Nichols was the fatal shot -- plus certain aspects of the state trial court's habeas proceedings,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e amounted to \"cumulative error\" which \"resulted in a denial of due process.\" Nichols, 802 F. Supp. at 78-79. Our en banc opinion in Derden states:\n\n\"federal habeas corpus relief may only be granted for cumulative errors in the conduct of a state trial where (1) the individual errors involved matters of constitutional dimension rather than mere violations of state law; (2) the errors were not procedurally defaulted for habeas purposes; and (3) the errors 'so infected the entire trial that the resulting conviction violates due process.'\" Derden v. McNeel, 978 F.2d 1453, 1454 (5th Cir. 1992) (en banc) (quoting Cupp v. Naughten, 414 U.S. 141, 94 S. Ct. 396, 400-01, 38 L. Ed. 2d 368 (1973)), cert. denied, 113 S. Ct. 2928 (1993).\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nSince, as we have held, the jury was not unconstitutionally prevented from taking into account Nichols' claimed non-triggerman status in answering the punishment special issues, and the state was not constitutionally barred or estopped from arguing that the shot fired by Nichols was the fatal shot, therefore neither of these matters can form the basis for a proper claim of constitutional cumulative error. That leaves only the matter of the state habeas proceedings. However, errors in a state habeas proceeding cannot serve as a basis for setting aside a valid original conviction. An attack on a state habeas proceeding does not entitle the petitioner to habeas relief in respect to his conviction, as it \"is an attack on a proceeding collateral to the detention and not the detention itself.\" Millard v. Lynaugh, 810 F.2d 1403, 1410 (5th Cir.), cert. denied, 484 U.S. 838, 108 S. Ct. 122, 98 L. Ed. 2d 81 (1987); Duff-Smith v. Collins, 973 F.2d 1175, 1182 (5th Cir. 1992) (\"infirmities in state habeas proceedings do not constitute grounds for federal habeas relief\"), cert. denied, 123 L. Ed. 2d 661, 113 S. Ct. 1958 (1993); Vail v. Procunier, 747 F.2d 277 (5th Cir. 1984) (same). See also Franzen v. Brinkman, 877 F.2d 26 (9th Cir. 1989); Hopkinson v. Shillinger, 866 F.2d 1185, 1218-1220 (10th Cir. 1989); Bryant v. State of Md., 848 F.2d 492 (4th Cir. 1988); Kirby v. Dutton, 794 F.2d 245, 247 (6th Cir. 1986); Williams v. Missouri, 640 F.2d 140, 143 (8th Cir.), cert. denied, 451 U.S. 990, 101 S. Ct. 2328, 68 L. Ed. 2d 849 (1981).\n\nAccordingly, the district court erred in its holding that Nichols was entitled to relief on the court's cumulative error theory.\n\nHaving rejected each of the bases on which the district court granted habeas relief, we sustain the state's appeal and reverse the judgment of the district court insofar as it granted Nichols habeas relief. We turn now to consider Nichols' cross-appeal.\n\nII. Nichols' Cross-Appeal\n\nA. Presumption of Correctness of State Court Findings\n\nNichols complains that the district court erred in affording the section 2254(d) presumption of correctness to the state habeas court fact findings, contending that the following three circumstances precluded application of the presumption, namely: (1) the failure of the state habeas trial Judge -- Judge Harmon (who did not preside at either of Nichols' trials) -- to sua sponte recuse himself on account of having been the prosecuting attorney in Nichols' May 1980 guilty plea conviction for robbery, which conviction had been put in evidence by the state at the punishment stage of Nichols' trial; (2) an inappropriate remark made by Judge Harmon at the state habeas evidentiary hearing; (3) Judge Harmon's having adopted verbatim the state's proposed findings of fact and Conclusions of law on the state habeas proceeding. While the district court found that these matters had occurred (see note 36, supra), it concluded that they did not justify denying the presumption of correctness to the state court findings, and further concluded that it would evaluate each state finding individually in the light of the entire record, including that of the federal habeas proceedings. Nichols, 802 F. Supp. at 70.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The only state habeas fact finding which the district court ultimately determined not to be entitled to the presumption of correctness was the finding that \"the jury was presented with overwhelming evidence that both the applicant and Williams shot Shaffer,\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e the district court instead determining \"that the only Conclusion which the record supports is that both Williams and Nichols shot at Shaffer but that either Williams or Nichols actually shot Shaffer.\" Id. at 75 (original emphasis).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nNichols has not demonstrated error in the district court's failing to reject the other state court habeas factfindings. We conclude that the above-mentioned three circumstances relied on by Nichols do not, singly or collectively, mandate a contrary determination. We consider these seriatim.\n\nWith respect to Judge Harmon's having been prosecutor in Nichols' May 1980 guilty plea to robbery, which prior conviction had been put in evidence at the punishment stage of Nichols' trial, we observe that neither the validity of that conviction (and the related sentence) nor its use at Nichols' sentencing was in any way at issue in either Nichols' trial (or direct appeal) or in his state habeas proceeding (which commenced in 1989), or in this federal habeas. As a matter of Texas law, Judge Harmon clearly was not disqualified from serving as the habeas trial Judge. See, e.g., Hathorne v. State, 459 S.W.2d 826, 829, 833 (Tex. Crim. App. 1970), cert. denied, 402 U.S. 914, 91 S. Ct. 1398, 28 L. Ed. 2d 657 (1971).\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e We have previously indicated that in a comparable position, a federal Judge would not be disqualified under 28 U.S.C. ยง 455. United States v. Outler, 659 F.2d 1306, 1312-13 (5th Cir. 1981), cert. denied, 455 U.S. 950, 102 S. Ct. 1453, 71 L. Ed. 2d 665 (1982). See also Adams v. United States, 302 F.2d 307 (5th Cir. 1962). And, it is settled that \"section 455 establishes a statutory disqualification standard more demanding than that required by the Due Process Clause.\" United States v. Couch, 896 F.2d 78, 81 (5th Cir. 1990).\n\nThe complained of remark of Judge Harmon came at a portion of the state habeas evidentiary hearing dealing with Nichols' effort to mount a statistical challenge to the Texas capital sentencing scheme, when \"in response to a witness' suggestion that Nichols' counsel could obtain statistical data regarding habeas corpus cases by issuing a bench warrant to bring each Harris County inmate in for a hearing, Judge Harmon responded 'Could we arrange for a van to blow up the bus on the way down here?'\" Nichols, 802 F. Supp. at 79. We are unable to conclude that this clearly inappropriate remark was anything more than an ill-considered, off-the-cuff attempt to inject humor into the proceeding. Though the remark was plainly tasteless and out of place, it does not establish bias and prejudice. Certainly, there is no indication that Nichols or either of his counsel so understood the remark at the time. Cf. Lowenfield v. Phelps, 484 U.S. 231, 108 S. Ct. 546, 552, 98 L. Ed. 2d 568 (1988). Moreover, these remarks were made near the Conclusion of a full evidentiary hearing fairly and impartially conducted with due regard for Nichols' rights. Cf. United States v. Wade, 931 F.2d 300, 302-305 (5th Cir.), cert. denied, 502 U.S. 888, 112 S. Ct. 247, 116 L. Ed. 2d 202 (1991); Pomeroy v. Merritt Plaza Nursing Home, 760 F.2d 654, 657-659 (5th Cir. 1985). \"Judicial remarks during the course of a trial that are . . . disapproving of, or even hostile to, . . . the parties, or their cases, ordinarily do not support a bias or partiality challenge\" unless \"they reveal such a high degree of favoritism or antagonism as to make fair judgment impossible.\" Liteky v. United States, 127 L. Ed. 2d 474, 114 S. Ct. 1147, 1157 (1994). No such showing is even approached here.\n\nAs for the complaint that Judge Harmon adopted the state's proposed findings and Conclusions, that is fully answered by Anderson v. City of Bessemer City, N.C., 470 U.S. 564, 105 S. Ct. 1504, 1511, 84 L. Ed. 2d 518 (1985) (\"even when the trial Judge adopts proposed findings verbatim, the findings . . . may be reversed only if clearly erroneous\").\n\nSection 2254(d) requires that state court findings be afforded a presumption of correctness unless it is shown that one or more of eight specified exceptions are applicable. The three circumstances relied on by Nichols are potentially relevant only to the sixth and seventh exceptions: \"(6) that the applicant did not receive a full, fair, and adequate hearing in the State court proceeding; or (7) that the applicant was otherwise denied due process of law in the State court proceedings; . . . .\" The state habeas court afforded Nichols -- represented by two competent lawyers -- every opportunity to present his contentions, allowing the filing of an original and three amended habeas petitions over a period of more than a year, and conducting an evidentiary hearing with full opportunity to present evidence, even continuing the hearing in order for Nichols' counsel to locate an additional witness. Nichols clearly had a \"fair\" hearing,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e and was not denied due process in connection with the state court habeas proceedings.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nWe reject Nichols' contention that the district court erred by according the section 2254(d) presumption of correctness to the state habeas factfindings.\n\nB. Mitigating Effect of Nichols' Character Evidence Beyond Scope of Special Issues\n\nNichols argues that the district court erred by failing to find that the punishment phase special issues (see note 6, supra) did not allow the jury to give effect to Nichols' mitigating character evidence. We reject this contention. At the least, the second special issue concerning future dangerousness provided an adequate vehicle for the jury to give effect to this mitigating evidence, placing it within the effective reach of the sentencer, and there is no reasonable likelihood that the jury would have found itself foreclosed from thus considering it. The Supreme Court and this Court have many times so held. See Johnson, 113 S. Ct. at 2669; Crank v. Collins, 19 F.3d 172, 175 (5th Cir.), cert. denied, 114 S. Ct. 2699 (1994); James v. Collins, 987 F.2d 1116, 1122 (5th Cir.), cert. denied, 113 S. Ct. 990 (1993); Barnard v. Collins, 958 F.2d 634, 640 (5th Cir. 1992), cert. denied, 122 L. Ed. 2d 142, 113 S. Ct. 990 (1993); Graham v. Collins, 950 F.2d 1009, 1030-1033 (5th Cir. 1992) (en banc), aff'd on other grounds, 113 S. Ct. 2658 (1993). Cf. Jurek v. Texas, 428 U.S. 262, 96 S. Ct. 2950, 2954, 49 L. Ed. 2d 929 (1976). No Penry -type evidence was presented. See Penry v. Lynaugh, 492 U.S. 302, 109 S. Ct. 2934, 106 L. Ed. 2d 256 (1989).\n\nC. Complaints of the Prosecutor's Jury Argument\n\nNichols complains of various instances of allegedly improper argument by the prosecution, mostly at sentencing, asserting that he was thereby denied a fair trial and deprived of due process of law. We reject this contention, and find no error in the district court's denial of relief in this connection.\n\nWhere improper prosecutorial argument is asserted as a basis for habeas relief, \"'it is not enough that the prosecutors' remarks were undesirable or even universally condemned,'\" rather \"the relevant question is whether the prosecutors' comments 'so infected the trial with unfairness as to make the resulting conviction a denial of due process.'\" Darden v. Wainwright, 477 U.S. 168, 106 S. Ct. 2464, 2471, 91 L. Ed. 2d 144 (1986). In order to constitute a denial of due process \"'the acts complained of must be of such quality as necessarily prevent a fair trial,'\" Derden, 978 F.2d at 1457. Moreover, the burden is on the habeas petitioner to also show a reasonable probability \"that but for these remarks\" the result would have been different. See Felde v. Blackburn, 795 F.2d 400, 403 (5th Cir. 1986). Further, failure to object to an argument -- wholly apart from questions of procedural bar -- is an indication that it was not perceived as having a substantial adverse effect, Derden at 1458, or would not naturally and necessarily be understood as advancing improper considerations. Milton v. Procunier, 744 F.2d 1091, 1095 (5th Cir. 1984), cert. denied, 471 U.S. 1030, 85 L. Ed. 2d 323, 105 S. Ct. 2050 (1985). See also Lowenfield, 108 S. Ct. at 552.\n\nWe now turn to the specific instances complained of by Nichols.\n\n(i) Nichols initially complains that in argument at the punishment stage the prosecutor improperly injected religion. No objection was made to this argument, and on direct appeal the Court of Criminal Appeals held that complaint in this respect was accordingly waived. Nichols, 754 S.W.2d at 199-200. The same holding was made on the state habeas (together with the alternative holding that on the merits relief was not warranted). No cause being shown for the failure to object, the claim is procedurally barred under the principles of Wainwright v. Sykes and Engle v. Isaac and their progeny. See Andrews v. Collins, 21 F.3d 612, 628 (5th Cir. 1994), cert. denied, 113 S. Ct. 2405 (1993).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nMoreover, the claim is lacking in merit even if it were not barred. At the punishment stage the defense introduced testimony of a priest who, at Nichols' request, visited him several times while he was in jail awaiting trial. The priest testified on direct that he had \"first met\" Nichols ten years earlier, but had never visited in his home or seen him at church, that while in jail Nichols' attitude changed from one of depression to remorse and contrition, and that if given a chance Nichols could become a constructive citizen. On cross, he admitted that he did not know what Nichols was doing in the some ten years after he first met him and when he saw him in jail. The defense, near the end of its punishment argument, called attention to the priest's testimony. The now complained of prosecution argument\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e was in response. The natural understanding of the thrust of this argument is that the jury could reasonably infer that the priest did not really know Nichols and that Nichols' supposed change to remorse and contrition was not genuine. Such a contention is essentially proper. There is absolutely no reasonable likelihood that these brief passages of argument (or anything else in the trial) created a meaningful risk that the jury verdict was to any extent based on Nichols' religious beliefs (or lack thereof, or on any inference in that regard from the priest's failure to testify in regard thereto).\n\n(ii) Complaint is also made of prosecution arguments at sentencing concerning the victim's character, which are also asserted to have been outside the record. Again, there was no objection to these arguments, and the state habeas court held them for that reason barred (and, alternatively, not to justify relief on the merits). This claim is hence foreclosed by the procedural bar.\n\nIt also fails on the merits. The prosecutor's reference to the grief and loss of the victim's family and his asking the jury to consider the victim were essentially within the range of argument held not to offend the Eighth Amendment in Payne v. Tennessee, 501 U.S. 808, 111 S. Ct. 2597, 115 L. Ed. 2d 720 (1991). This is also the case with respect to the brief reference to Shaffer's employment and being killed while at work. There was no argument (or evidence) as to \"opinions of the victim's family about the crime, the defendant, and the appropriate sentence.\" 111 S. Ct. at 2612 (O'Connor, J., Concurring). There was nothing so inflammatory about the argument as to render the entire sentencing proceeding unfair. Id. at 2612 (O'Connor, J., Concurring), 2614 (Souter, J., Concurring). Moreover -- and also dispositive of the contention that the argument went beyond the evidence\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e -- defense counsel in his argument had already raised these matters, arguing that \"my heart goes out to his [Shaffer's] family\" and \"they [Shaffer's family] have had a terrible tragedy in their family.\"\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Defense counsel further argued \"I doubt very seriously if the Shaffer family would get any satisfaction from\" imposition of the death sentence on Nichols, and stated \"I feel for them but taking Joe's life is not going to help them a bit\" but could \"hurt a lot of other folks.\" Defense counsel also referred in this connection to the testimony of a defense sentencing witness who stated he was willing to do \"whatever it takes\" (or \"whatever needs to be done\") for Shaffer. Suffering by the Shaffer family was a premise the defense had already explicitly raised and accepted in its sentencing phase argument. The prosecutor reminded the jury \"to look solely at the evidence and not cry for either side.\" There was no deprivation of due process or fundamental unfairness in the prosecution's response.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\n(iii) Nichols next complains of two prosecutorial arguments at the guilt/innocence stage of the trial which he contends were \"incorrect statements of the legal principles applicable.\" No objection was made to either argument at trial, on direct appeal, or in the state habeas proceedings. It is clear that the Texas contemporaneous objection rule would bar relief in state court, and the claims are accordingly procedurally barred on federal habeas. Teague, 109 S. Ct. at 1068-69. See also Weaver v. McKaskle, 733 F.2d 1103, 1104-5 (5th Cir. 1984); Marks v. Estelle, 691 F.2d 730, 734-35 (5th Cir. 1982). Cf. Bates v. Blackburn, 805 F.2d 569, 574-75 (5th Cir. 1986); Webb v. Blackburn, 773 F.2d 646, 650-651 (5th Cir. 1985). We also note that these claims were not raised in the federal habeas petition below, and, although the arguments were quoted in Nichols' post-evidentiary hearing brief below, Nichols never sought to amend his petition and these particular claims were not addressed by the district court. See United States v. Smith, 915 F.2d 959, 964 (5th Cir. 1990).\n\nIn any event, these claims have no merit. The first complained of argument\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e was a proper plea to the jury to use its common sense in evaluating the defense's contentions as to what had actually happened. See Williams v. Florida, 399 U.S. 78, 100, 26 L. Ed. 2d 446, 90 S. Ct. 1893 (1970) (jury trial calls for \"the commonsense judgment of a group of laymen\"). Nichols' appellant's brief does not explain why he thinks this argument was improper nor cite any supporting authority. We note that the prosecutor had explained at length to the jury that they were obligated to follow the court's charge, as did the charge itself. This contention is frivolous. The second challenged argument\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e was in substance a correct statement of the law that, under the charge, Nichols could only be found guilty of capital murder or of murder, or found not guilty. Moreover, defense counsel did not request a charge on any form of robbery as a lesser included offense, and no such charge was given. Yet defense counsel had argued that Nichols was guilty of aggravated robbery.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The state's argument was a proper response and a correct statement of the law. Nichols cites no authority in support of his contention. We reject it as frivolous.\n\n(iv) The next complained of argument is the state's reference at sentencing to Nichols' having been indicted for the unadjudicated offenses, evidence of which had been put before the jury.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e On direct appeal this argument was challenged as being outside the record (here it is challenged only as an improper inference of guilt from an indictment), and the Court of Criminal Appeals held that the contention was barred because no trial objection to the argument had been made. Nichols, 754 S.W.2d at 199-200. Hence this claim is procedurally barred. Moreover, although this argument of the prosecutor was presented in Nichols' post-evidentiary hearing brief below,\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e it was never included in his federal habeas petition or addressed by the district court.\n\nIn any event, the claim is without merit. The argument was in response to defense counsel's argument criticizing the state for not having taken action on the unadjudicated offenses, arguing \"there has been no action taken by any other group of individuals or by the state.\"\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The state responded that another group of individuals had acted, by indictment. Moreover, defense counsel had previously expressly acknowledged in argument that Nichols had been charged with attempted escape. The evidence as to the other unadjudicated offenses -- the August 13 and October 11, 1980, armed robberies -- was undisputed, and substantial evidence was presented as to the planned escape. There is no reasonable likelihood that the jury was improperly influenced by this passing rebuttal remark of the prosecution.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\n(v) Three other prosecutorial arguments, two at the guilt/innocence stage and one at sentencing, are attacked as having \"improperly struck at Nichols over the shoulders of his trial counsel.\"\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Apart from this general and uninformative characterization, Nichols' appellant's brief does not explain the basis for the challenge and contains no supporting argument. The complaint is not adequately presented for review. Fed. R. App. P. 28(a)(6); United States v. Beaumont, 972 F.2d 553, 563 (5th Cir. 1992). Nor was it in the district court.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e In any event, the complaints present no basis for relief. To begin with, no objection was made at trial (or on appeal) to these arguments (and they were not a grounds of complaint in the state habeas). They are hence procedurally barred. Even if they were not, the present no basis for relief. The brief references at the guilt/innocence stage to \"the door game\" and \"physical evidence caught them\" are nothing more than argument that the inferences as to what happened urged by defense counsel were not consistent with the physical evidence. The sentencing argument referred to the fact that at the guilt/innocence stage defense counsel argued that Williams fired the fatal shot from the door as he went back in, while at sentencing defense counsel appeared to argue that Williams fired the fatal shot from \"in front of the counter.\" And, the prosecution's argument was in response to defense counsel's criticism of the prosecution for its asserted inconsistency in the Williams and Nichols cases.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e These unobjected to prosecution arguments did not deprive Nichols of due process or deny him a fair trial or sentencing, and there is no reasonable likelihood that they caused the verdict to be to any extent improperly based.\n\n(vi) Quoting a single sentence from the state's argument at each phase of his trial, Nichols asserts that each \"improperly injected the personal beliefs of the prosecutor into its argument.\"\n\nNichols' appellant's brief makes no argument in support of this assertion, and the complained of sentences are not mentioned in his federal habeas petition or in the district court's opinion. Assuming the matter is properly before us, it is procedurally barred as no objection was made at trial (or on appeal) to either argument (and neither was raised as a ground for relief in the state habeas proceeding).\n\nIn any event, neither argument presents a basis for relief on the merits. The first statement Nichols challenges was made by the prosecutor during the punishment phase of the trial. Referring to James Paul Martin, an inmate at the Harris County Jail who testified that he and Nichols had been involved in an escape plot while in jail, the prosecutor stated: \"I wouldn't come to court to you and say convict a man on the word of a criminal without corroboration.\" Although a prosecutor \"may not express his personal opinion as to the credibility of witnesses, or his own belief regarding a defendant's guilt,\" United States v. Walker, 613 F.2d 1349, 1355 (5th Cir.), cert. denied, 446 U.S. 944, 100 S. Ct. 2172, 64 L. Ed. 2d 800 (1980), he may properly comment on the weight of the evidence. See Casel, 995 F.2d 1299 at 1309. Here, it is clear from the context in which the statement was made that the prosecutor was not expressing his personal opinion about the credibility of Martin. Rather, he was directing the jury to look to other evidence that supported Martin's testimony, which, because it was the testimony of a convicted felon, would be suspect standing alone.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e This type of argument \"is permissible to the extent that it draws a Conclusion based solely on the evidence presented.\" Id. (citing United States v. Enstam, 622 F.2d 857, 869 (5th Cir. 1980), cert. denied, 450 U.S. 912, 101 S. Ct. 1351, 67 L. Ed. 2d 336 (1981); United States v. Bright, 630 F.2d 804, 824 (5th Cir. 1980), and United States v. Binker, 795 F.2d 1218, 1223 (5th Cir. 1986)). Such is the case here.\n\nThe second statement which Nichols objects to was made during the state's argument at the close of the guilt/innocence phase of the trial. In arguing that Nichols fired the shot that killed Shaffer, the prosecutor stated: \"And I'll tell you it was his hand that did the killing.\" Once again, however, Nichols gives an incomplete picture. Immediately after the prosecutor made the above-quoted statement, he asked \"How do you know that?\" and then proceeded to summarize the evidence presented at trial which would tend to support the theory that Nichols fired the fatal shot. In United States v. Morris, 568 F.2d 396 (5th Cir. 1978), this Court explained that a prosecutor may state his own opinion or knowledge of the case as long as he makes it clear that \"the Conclusions he is urging are Conclusions to be drawn from the evidence.\" Id. at 401. Here, the prosecutor argued the admitted evidence in support of the challenged statement. Hence, in the context of the prosecution's argument the statement was not improper.\n\n(vii) Lastly, Nichols asserts that at sentencing the prosecution \"improperly commented on Nichols' failure to call witnesses or present evidence.\" Again, without citation to authority or meaningful argument, Nichols quotes four sentences which he contends are thus improper. First, during the state's argument at the end of the punishment phase of the trial, the prosecutor stated:\n\n\"Why is it that not one, not one employer except a family friend, Mr. Creal, came and sat here and told you what a nice worker he was. Not one. Not even a co-worker came here to verify to you that he actually worked or that he was a good worker, not one.\"\n\nLater, the prosecutor commented that \"Not one employer, not one co-worker, not one school mate, not one neighbor has come here.\"\n\nAgain, these portions of the argument were not complained of in Nichols' federal habeas petition. Moreover, they are procedurally barred. No objection was made at trial (or on appeal) to the first argument (and it was not raised as a ground for relief in the state habeas proceedings). The second argument was objected to at trial on the ground it was \"not a correct statement of the evidence.\"\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e On direct appeal, Nichols complained that the statement was improper as \"comment on his failure to call punishment witnesses,\" and the Court of Criminal Appeals held that \"because the challenge on appeal does not comport with the objection at trial, nothing is presented for review.\" Nichols, 754 S.W.2d at 200.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nAt all events, the claims lack merit. As a matter of Texas law, the prosecutor may comment on \"the defendant's failure to call a material witness, and he may draw an inference from that failure that the testimony would have been unfavorable.\" O'Bryan v. Estelle, 714 F.2d 365, 388 (5th Cir. 1983), cert. denied, 104 S. Ct. 1015 (1984); see also O'Bryan v. State, 591 S.W.2d 464, 479 (Tex. Crim. App. 1979) (en banc), cert. denied, 100 S. Ct. 2975 (1980). Moreover, in federal trials, although a party's failure to call a witness equally available to both sides may not be properly commented on, if the defendant fails to call a witness peculiarly within his control, the prosecutor may properly comment on that failure. United States v. MMR Corp., 907 F.2d 489, 501-02 (5th Cir. 1990), cert. denied, 111 S. Ct. 1388 (1991). \"That the potential witness is . . . accessible to service of subpoena by the court does not make the witness equally available to both parties.\" Id. at 502. The relationship of the witness to a party may make him or her more available to that party. Id. Such is the case sub judice. Here, the prosecutor was commenting on Nichols' failure to call certain types of witnesses during the punishment phase to establish mitigating circumstances. These types of witnesses are generally more available to the defense. And, because \"the option of producing and coming forward with mitigating circumstances is upon the capital defendant,\" O'Bryan, 591 S.W.2d at 479, they are more likely to be called by the defense. The prosecutor's brief comment on Nichols' failure to call certain types of good character witnesses was not clearly improper; certainly it did not render the sentencing fundamentally unfair or deprive Nichols of due process.\n\nNichols asks that we view all the complained of prosecution arguments together. However, even when all are viewed cumulatively -- and even without considering that counsel did not think the vast majority of them worth complaining of at trial, or on appeal, or in any of the lengthy and frequently amended state habeas petitions, or, for the most part, in the federal petition -- it is entirely clear to us that they did not operate to deprive Nichols of a fundamentally fair trial at any stage of the proceedings or to deny him due process, and that there is no reasonable likelihood that the jury's verdict at either stage was improperly affected thereby.\n\nD. Ineffective Assistance of Counsel\n\nNichols complains of ineffective assistance of trial counsel, listing in three pages of his brief nine different claims in this respect. After evidentiary hearings in both the state habeas court and the district court below, all claims of ineffective assistance of counsel were rejected by the state habeas trial court, the Court of Criminal Appeals, and the district court below.\n\nUnder Strickland v. Washington, 466 U.S. 668, 104 S. Ct. 2052, 80 L. Ed. 2d 674 (1984), a habeas petitioner claiming ineffective assistance of counsel has the burden to demonstrate both deficient performance and prejudice. 104 S. Ct. at 2064. As to the former, judicial scrutiny of counsel's conduct \"must be highly deferential,\" id. at 2065, \"the distorting effect of hindsight\" is to be avoided, id. at 2065-66, and courts must \"indulge a strong presumption that counsel's conduct falls within the wide range of reasonable professional assistance.\" Id. \"It is not enough to show that some, or even most, defense lawyers would have handled the case differently.\" Green v. Lynaugh, 868 F.2d 176, 178 (5th Cir.), cert. denied, 493 U.S. 831, 110 S. Ct. 102, 107 L. Ed. 2d 66 (1989). To establish prejudice, \"it is not enough for the defendant to show that the errors had some conceivable effect on the outcome of the proceeding,\" Strickland at 2067; rather, he must demonstrate a \"reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different.\" Id. at 2068. \"A reasonable probability is a probability sufficient to undermine confidence in the outcome.\" Id.\n\nOur examination of the record, including that of the habeas proceedings, reflects that Nichols was represented vigorously and effectively at trial by his two counsel Lane and Scott, each of whom had likewise so represented him throughout his first trial. These attorneys were familiar with the facts of the case, made and procured hearings and rulings on appropriate pretrial motions and motions to suppress, investigated and presented testimony, made objections, presented appropriate jury arguments, and subjected the state's case to rigorous adversarial testing and opposition at trial. Many of the instances of alleged ineffectiveness which Nichols raises on appeal were not adequately raised below, and hence are not properly before us. United States v. Smith, 915 F.2d 959, 964 (5th Cir. 1990). But even considering all the claims of ineffective assistance of counsel raised on appeal, we are convinced that Nichols has neither overcome the strong presumption that counsel's conduct fell within the wide range of reasonable professional assistance nor demonstrated any reasonable probability that but for the claimed deficiencies the result of the proceedings would have been different. No such probability sufficient to undermine confidence in the outcome has been shown. We now briefly address the particular assertions of ineffectiveness raised by Nichols on this appeal.\n\n(i) Complaint is made that Nichols' attorneys failed to attempt to delay entry of the July 31, 1981, mistrial order in Nichols' first trial until August 31, 1981, when the 1981 amendment to Tex. Code Crim. Proc. art. 37.071(e) came into effect providing that if the jury is unable to answer any punishment special issue the defendant shall be sentenced to life imprisonment. This contention materially differs from the only claim made below respecting this subject, which was that counsel was ineffective for failing to ask the trial court \"to set aside the interlocutory order of mistrial and to sentence\" Nichols to life imprisonment \"in accordance with\" amended article 37.071(e). In any event, the present contention, as well as that made below, is without merit, and under neither theory has either deficient performance or prejudice been demonstrated. On direct appeal, the Court of Criminal Appeals specifically rejected Nichols' attempt to invoke amended article 37.071(e), stating \"because appellant's first trial was held prior to the effective date of the amendment to subsection (e), the amendment has no application.\" Nichols, 754 S.W.2d at 204. Nichols cites no authority and makes no meaningful argument, in support of his contention on appeal.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e Nor are we aware of any such authority. So far as we are able to ascertain, nothing in Texas law would authorize the trial court to discharge the jury without declaring a mistrial. And, it would be patently unreasonable for defense counsel to have urged, or for the trial court to have ordered, that the jury continue bound to the case for another month.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Moreover, continued deliberations would risk a \"yes\" answer to the single special issue which the jury had not then unanimously answered in the affirmative.\n\n(ii) Nichols next complains that his counsel failed to present Williams' testimony as given at his own trial -- instead of that given at Nichols' first trial -- and failed to utilize the transcript of Williams' trial on cross-examination of Williams' prosecutor to force the latter \"to admit that Williams was convicted as the lone triggerman.\" These contentions were not raised below and are not properly before us. In any event, they are wholly without merit. Williams' testimony at his own trial was not more favorable to Nichols then his testimony at Nichols' first trial. Indeed, Williams' testimony at his own trial indicated that when he shot (or shot at) Shaffer from the door, he did so in response to Nichols telling him \"shoot-shoot\" (see note 2, supra). Williams did not mention this in his testimony at Nichols' first trial. Had this testimony been before the jury, it would have wholly undercut Nichols' defensive theory that he was not guilty even under the law of parties because when Williams fired what the defense contended was the fatal shot, Nichols had already completely left and Williams' shot was \"the separate act of Willie Ray Williams, acting independently\" for which, under the wording of the court's jury charge, Nichols would not be responsible. As to the cross-examination of Williams' prosecutor, what Williams was convicted of was determinable from, and only from, the record in that case. We have held that that does not reflect a determination that Williams was \"the lone triggerman.\" Nor is there any showing that Williams' prosecutor could possibly shed any other light on the matter. The jury had before it the undisputed fact of Williams' conviction for Shaffer's murder, as well as his testimony that he shot Shaffer from the door, causing him to fall back. Nichols makes no showing of deficient performance or prejudice in regard to these matters.\n\n(iii) On the basis of April 1992 affidavits submitted after the evidentiary hearing below to the district court with Nichols' motion to expand the record, which the district court denied, Nichols contends that defense counsel failed to interview witness Teresa Ishman, a deli employee, and failed to examine deli employee Johnson \"on the 'triggerman' issue.\" This issue is not properly before us. The affidavits are not a part of the record (and no complaint has been made of the ruling denying the motion to expand the record); and they were tendered to the district court in respect to a Brady claim. Further, the issue was not adequately raised below. The habeas petition only alleged in the most Conclusional form that \"Counsel's overall performance, including the general lack of any investigation, denied petitioner effective assistance of counsel at both stages of the trial. Counsel's trial strategy was unreasonable and it was not based on an adequate investigation.\" There was no allegation concerning Johnson or Ishman or the subject matter to which their affidavits are now alleged to be relevant. These allegations in the petition are plainly inadequate to raise a constitutional issue in the respect now asserted on appeal. See Ross v. Estelle, 694 F.2d 1008, 1011-1012 (5th Cir. 1983); Alexander v. McCotter, 775 F.2d 595, 602-603 (5th Cir. 1985). The allegations may not be supplemented on appeal. Alexander at 603.\n\nMoreover, there is no adequate showing or allegation that counsel was deficient in this respect. Present counsel, who had been representing Nichols since sometime before May 1989, took the position below that they did not find out the information in the affidavits until early 1992. Nichols suggests no basis on which trial counsel can be faulted for not producing this information while excusing habeas counsel for not producing it in the state habeas or earlier in the federal habeas. Cf. Keeney v. Tamayo-Reyes, 504 U.S. 1, 112 S. Ct. 1715, 118 L. Ed. 2d 318 (1992). Further, the Ishman affidavit states that she initially told the police that she saw nothing.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e This was consistent with Johnson's testimony that when Nichols and Williams shot at Shaffer, the other deli employee there -- Ishman (then known as McGee, which was not her true name) -- was back in the kitchen or bathroom and did not come out. As to Johnson, defense counsel had already reviewed -- and at trial succeeded in getting before the jury -- her written, sworn statement to the police, and there was nothing to indicate that she had ever said anything else, much less anything favorable to the defense. Nor do the April 1992 affidavits show a probability of a different result sufficient to undermine confidence in the outcome. Johnson's affidavit reflects that just after Nichols shot, and before either Nichols or Williams left, she saw Williams \"leaning across the counter and firing the shot that killed Mr. Shaeffer (sic).\" This entirely contradicts the defense theory that the fatal shot was fired by Williams from the door after Nichols left and was thus \"the separate act of\" Williams \"acting independently\" for which under the charge Nichols would not be responsible. Ishman's affidavit mentions only an initial set of shots fired from the counter area (after which she ran into the restroom, where Johnson \"was already locked in\"). Ishman does state Shaffer \"went down and reached under the counter for his gun,\" but this is just what Johnson's October 13, 1980, statement -- which was before the jury without limitation -- said. In Johnson's trial testimony, she admitted making the October 13, 1980, statement, but said that although Shaffer \"went down in a squat position\" she \"didn't see him reach for anything.\"\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Nichols' statement and Williams' testimony, both before the jury, were that Shaffer came up with a gun in his hand.\n\n(iv) Nichols next complains of counsel's failure to object to the trial court's grant to juror Pearson of an exemption from jury service for child care under Tex. Govt. Code Ann. ยง 62.106(2). Nichols does not explain why the exclusion was erroneous, but it may possibly have been in that although Pearson had custody of her two-year-old child, the statute speaks to exclusion for those having custody of children under ten where the jury service \"requires leaving the child or children without adequate supervision,\" and Pearson had said she had \"a sitter.\" It is questionable that constitutionally deficient performance is shown. Whether a juror is desirable is inherently a matter of judgment, particularly when, as in Pearson's case, a strong antipathy to service is expressed.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e In any event, prejudice is not demonstrated. Although the state did not request or suggest Pearson's exclusion, and Pearson clearly said she wanted the exemption, Nichols asserts prejudice because Pearson had indicated reluctance to impose the death penalty and the state eventually used all its peremptory challenges. However, at the time Pearson was excused, the state had used only two of its peremptory challenges. It cannot be shown that but for her exclusion Pearson would have served. And, nothing in the record tends to establish \"that, in the absence of defense counsel's errors, a different factfinder . . . would have been reasonably likely to arrive at a different outcome.\" Green v. Lynaugh, 868 F.2d 176, 178 (5th Cir.) (original emphasis), cert. denied, 110 S. Ct. 102 (1989). Moreover, in United States v. Prati, 861 F.2d 82 (5th Cir. 1988), we concluded that the Supreme Court, in Ross v. Oklahoma, 487 U.S. 81, 108 S. Ct. 2273, 101 L. Ed. 2d 80 (1988), \"rejected 'the notion that the loss of a peremptory challenge constitutes a violation of a constitutional right to an impartial jury.'\" Id. at 87 (quoting Ross, 108 S. Ct. at 2278). Instead, \"the pertinent inquiry is whether the jurors that actually sat were impartial as required by the sixth amendment.\" Id. Because Nichols does not assert that his jury was not impartial, he has failed to demonstrate that his counsel's failure to object to the exclusion of Pearson was prejudicial.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\n(v) Complaint is next made of defense counsel's failure to object to an allegedly \"improper\" shuffle of three venire members. Nichols does not explain why or in what respect the \"shuffle\" was improper and cites no authority indicating that it was. Hence, nothing is presented for review. Fed. R. App. P. 28(a)(6); Beaumont at 563. In any event, neither deficient performance nor prejudice has been shown. Nichols claims that absent the shuffle alternate juror Walker, \"who would have been reluctant to impose capital punishment,\" would have been the twelfth juror.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e However, when the three jurors were shuffled, none of them, including Walker, had been voir-dired, so the record reflects no basis on which to conclude that defense counsel should have known or believed that Walker would be favorable to the defense (or more so than any other of the three). Additionally, Nichols' assertion that, absent the shuffle, Walker would serve as the twelfth juror rather than as an alternate is purely speculative and is insufficient to establish prejudice.\n\n(vi) Nichols next contends that trial counsel was inadequate for failing to request an \"anti-parties\" instruction at the punishment stage of trial. We reject this contention. At the time of trial, it was not clearly established Texas or federal law that such an instruction, if requested, was required.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e While the law was not so clear that a request for such a charge could be said to be plainly futile, this does not mean that counsel was constitutionally deficient for failing to request such a charge. See Smith v. Collins, 977 F.2d 951, 960 (5th Cir. 1992), cert. denied, 126 L. Ed. 2d 64, 114 S. Ct. 97 (1993); Selvage v. Collins, 975 F.2d 131 (5th Cir. 1992), cert. denied, 124 L. Ed. 2d 663, 113 S. Ct. 2445 (1993); Buxton. Moreover, a law of parties instruction was not given at sentencing, and it appears clear that all concerned operated on the assumption that the law of parties did not apply at sentencing. We conclude that under the circumstances counsel was not constitutionally deficient for failing to request an affirmative \"anti-parties\" instruction at sentencing. Further, for the reasons and authorities previously recited in connection with the state's appeal (see Part IA, supra), we also conclude that Nichols has failed to demonstrate prejudice from the failure to give an anti-parties instruction. There is no reasonable probability that the giving of such an instruction would have altered the outcome. See also, e.g., Belyeu v. Scott, 67 F.3d 535, No. 94-50805, slip op. at 391 (5th Cir. Oct. 11, 1995). Finally, this asserted ground of ineffective assistance of counsel was not raised below.\n\n(vii) Nichols next complains that counsel was deficient for failing to request a \" Penry -type\" instruction concerning mitigating evidence. This contention was not raised below. Moreover, it is wholly without merit. The case was tried seven years before Penry. In any event, the state habeas court did not apply the procedural bar to this claim, but rather rejected it on the merits. And, we have held that federal law did not entitle Nichols to such an instruction (see part IIB, supra). Consequently, neither a deficiency on the part of counsel nor prejudice is shown.\n\n(viii) Complaint is made in general terms that \"counsel failed to object to repeated improper jury argument by the state,\" but the arguments in question are not identified other than by a general reference to the section of Nichols' brief complaining of improper argument, and which particular arguments were not objected to is not identified. No authorities are cited and no explanation or meaningful argument is made in the three brief sentences dealing with this complaint. It is not properly presented to us. Moreover, it was not raised below except as to those few instances of prosecutorial argument as to which complaint was made below (see Part IIC, supra). The other instances are not properly before us. In any event, for the reasons stated in Part IIC above, the arguments in question, singly and collectively, were not so improper and prejudicial that the failure to object to any or all of them can properly be characterized as constitutionally deficient performance by counsel, or as rendering Nichols' trial as a whole fundamentally unfair, or as giving rise to any reasonable probability that had objections been made the result would have been different. Nothing in connection with these complaints serves to undermine confidence in the trial's outcome.\n\n(ix) Lastly, Nichols makes the conclusory assertion that trial counsel were ineffective in failing to move for a new trial on the grounds of their own ineffectiveness at trial. This contention is frivolous. No procedural bar has been prevented Nichols from raising ineffectiveness of trial counsel. Moreover, we have held, as did the district court and the state habeas court, that Nichols was not denied the effective assistance of counsel at trial.\n\nIn sum, we reject all Nichols' claims on appeal that the district court erred in denying him relief on his claim of ineffective assistance of trial counsel.\n\nE. Cumulative Error\n\nNichols' sole remaining claim on appeal is a three-sentence argument that the matters of which he complains on appeal (Part IIA-D), plus those on which the district court granted him relief and which are the subject of the state's appeal (Part IA-C), amount to cumulative error under our decisions in Derden and Kirkpatrick v. Whitley, 992 F.2d 491 (5th Cir. 1993),\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e and denied Nichols a fair trial. For the reasons previously noted in addressing these contentions severally, we find no merit in Nichols' argument. Reviewing the entire record, we conclude that Nichols has not made out a case of cumulative error under Derden, and that the matters complained of did not, singly or in combination, operate to deny him a fundamentally fair trial, deprive him of due process, or undermine confidence in the outcome. We accordingly reject Nichols' contention in this respect.\n\nHaving specifically addressed and rejected all of Nichols' points in his cross-appeal, we reject Nichols' cross-appeal and affirm so much of the district court's judgment as denies Nichols habeas relief.\n\nConclusion\n\nSo far as it denied Nichols habeas relief, the district court's judgment is affirmed. So far as the judgment below granted Nichols habeas relief, it is reversed and the case is remanded with instructions to enter judgment denying relief.\n\nAFFIRMED in part; REVERSED in part.\n\n\u003cspan class=\"fn\"\u003e1. Nichols' statement (Nichols did not testify) says \"we\"--he and Williams--then shot at Shaffer. Nichols' and Williams' statements were given October 17, 1980, after their arrests earlier that day. Williams' statement mentions only Nichols shooting at this time. Williams' testimony at Nichols' trial is that Nichols drew his gun first, that Williams then drew his, each pointing them at Shaffer; that Nichols fired his gun; that Williams then pulled the trigger on his gun, but nothing happened and it did not discharge (Williams' testimony at his own trial does not mention his pulling the trigger on his gun at this time). Williams testified at Nichols' trial that Nichols fired only once and that \"he [Nichols] was aiming at the man [Shaffer]\" and \"wasn't aiming it behind him or somewhere else or aiming it at the floor or anything\" but \"was aiming at that man.\" However, Williams testified that he thought Nichols missed Shaffer because Shaffer, who was squatting, did not go down and Williams saw no blood. Cindy Johnson (Johnson), one of the two other deli employees then on duty, testified that at this time Nichols shot first, but that Williams also then shot, and that in all three, or possibly two, shots were fired at that time. She said that after these shots Shaffer collapsed and there was blood on his head. James Rivera (Rivera), standing at a nearby bus stop, saw Nichols and Williams enter the deli, shortly thereafter heard two or three noises like \"backfires,\" turned, and then saw Nichols and Williams run out of the deli. Nichols' statement says \"We pulled our guns on the dude behind the cash register and told him to put the money in the sak [sic]. The man behind the counter started bending over behind the counter . . . and then he came up with a pistol . . . so we reacted and shot.\" Williams' testimony at Nichols' trial was that after Nichols and he pulled their guns on Shaffer, Shaffer bent down and came up with a gun from under the counter, pointed it at Williams, whereupon Nichols fired; Shaffer, according to Williams' testimony, never fired (and there is no evidence that he did). At his own trial, Williams testified that \"before he [Shaffer] got it [the gun] all the way up, Joe [Nichols] fired\" and then Shaffer \"went down\" in \"a squatting position.\" Johnson testified that she was watching Shaffer, who was looking at her, after Nichols and Williams had pointed their guns at him and that Shaffer never touched a gun and did not reach for a gun; she admitted, however, that in an earlier sworn statement she had said that after \"one of the men pulled a gun\" Shaffer, who kept a gun under the counter, \"reached for his gun and both of the black men shot Claude.\" Other evidence showed that the gun, a .45 semi-automatic pistol, belonged to another deli employee, and was found just after the robbery in its accustomed place on a shelf under the counter, with a fully-loaded clip in the handle but no shell in the chamber; there were no fingerprints on it (Williams testified that when he went back in and got the cash box, he looked for Shaffer's gun but did not see it). No .45 caliber fired bullets or empty shell casings were found.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. At his trial Williams testified that when he and Nichols ran into each other exiting the deli: \"I attempted to go out the door, coming behind Joe [Nichols], and he [Nichols] turned to me and said shoot--shoot.\" Williams, being then asked \"And what did you do, sir?\", replied \"I just turned and shot.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Rivera (see note 1, supra) testified that after he saw Nichols and Williams run out of the deli, Williams then, gun in hand, just in front of the deli door, \"looked like he raised his hand and aimed the gun at me\"; Rivera turned away in fright, and when he looked back both Nichols and Williams were gone; he then heard another shot and saw Williams run out of the deli with \"a strong box\" in his hand; Williams dropped the box, picked it up, and ran off.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Nichols' gun was apparently never recovered. His statement says that after the robbery and before his arrest he had given it back to the individual--neither whose name nor address he knew--from whom he had borrowed it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The indictment alleged that Williams \"did while in the course of committing and attempting to commit the robbery of Claude Shaffer, Jr., hereafter styled the Complainant, intentionally cause the death of the Complainant by shooting the Complainant with a gun.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Article 37.071(b) then provided: \"(b) On Conclusion of the presentation of the evidence, the court shall submit the following issues to the jury: (1) whether the conduct of the defendant that caused the death of the deceased was committed deliberately and with the reasonable expectation that the death of the deceased or another would result; (2) whether there is a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society; and (3) if raised by the evidence, whether the conduct of the defendant in killing the deceased was unreasonable in response to the provocation, if any, by the deceased.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The indictment alleged that Nichols \"did while in the course of committing and attempting to commit robbery, intentionally cause the death of Claude Shaffer, Jr., hereafter styled the Complainant, by shooting the Complainant with a gun.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Williams' testimony at Nichols' first trial did not, however, include that referenced in note 2, supra. Nichols did not testify during either phase of the July 1981 trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Texas Penal Code art. 7.01 provides: \" ยง 7.01. Parties to Offenses (a) A person is criminally responsible as a party to an offense if the offense is committed by his own conduct, by the conduct of another for which he is criminal responsible, or by both. (b) Each party to an offense may be charged with commission of the offense. (c) All traditional distinctions between accomplices and principals are abolished by this section, and each party to an offense may be charged and convicted without alleging that he acted as a principal or accomplice.\" Tex. Penal Code art. 7.02 provides: \" ยง 7.02. Criminal Responsibility for Conduct of Another (a) A person is criminally responsible for an offense committed by the conduct of another if: (2) acting with intent to promote or assist the commission of the offense, he solicits, encourages, directs, aids, or attempts to aid the other person to commit the offense; (b) If, in the attempt to carry out a conspiracy to commit one felony, another felony is committed by one of the conspirators, all conspirators are guilty of the felony actually committed, though having no intent to commit it, if the offense was committed in furtherance of the unlawful purpose and was one that should have been anticipated as a result of the carrying out of the conspiracy.\" Texas law has long recognized that the law of parties is applicable to a case and may be properly charged on if raised by the evidence even if not alleged in the indictment. Pitts v. State, 569 S.W.2d 898, 900 (Tex. Crim. App. 1978); Crank v. State, 761 S.W.2d 328, 351 (Tex. Crim. App. 1988); Montoya v. State, 810 S.W.2d 160, 165 (Tex. Crim. App.), cert. denied, 502 U.S. 961, 112 S. Ct. 426, 116 L. Ed. 2d 446 (1991). Indeed, this was the Texas law well prior to the enactment (in 1973) of arts. 7.01 and 7.02. See Pitts at 900; Frias v. State, 376 S.W.2d 764, 765 (Tex. Crim. App. 1964) (\"'The acts which make the defendant a principal need not be alleged in the indictment. A principal offender may be charged directly with the commission of the offense although it may not have actually been committed by him . . .'\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Nichols did not testify at either stage of his February 1982 trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The charge also submitted the lesser included offense of murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Thus, for example, the prosecutor argued: \"This lawsuit, if you really boil it down, concerns itself with parties, the law of parties given to you in number five and number six of this charge. Note that in parties to be guilty of capital murder as a party to it, a defendant does not have to fire the fatal shot that killed somebody.\" (Emphasis added). The prosecutor further argued: \"The Judge has instructed you to find the defendant guilty of capital murder if you believe from the evidence, number one, that he's involved in a conspiracy to rob, number two, that at the time of the robbery he was doing something to help or make that robbery successful, that there was a murder and that somebody had the specific intent to kill somebody, either Jojo had it or Willie had it, either one. It doesn't matter. That the murder was done in furtherance of the original plan of the robbery, to help it in some way or to get away, immediate flight therefrom. And you must believe that this murder was an offense that the defendant should have anticipated. If you believe those five things from the evidence it will be your duty to find that man guilty of capital murder.\" (Emphasis added). Additionally, the prosecutor argued: \"The defense is saying that what you really have here is a situation where there are cracks in the law and we want you to let Jojo Nichols slip through these cracks and get away. Well, the legislature thought about that. They're not completely dumb up there. Somebody told them what to do. And they have the law of parties. It fills in the cracks. It's like the mortar in a brick wall. You guys are all responsible when you go in there with loaded guns under certain conditions. Was there a conspiracy to rob, rob them of anything, money, guns, anything else. Was there a conspiracy to rob. The defense admits that, yes, there was. When the robbery occurred, was Jojo doing anything to promote or assist that robbery? The defense admits, yes, he was pointing a gun, telling you to put money in the sack and fired a gun. The defense admits it. He fired a gun before he ran out that door. Was there a murder? You bet. And it doesn't matter who killed him under our law, under this rule of parties. Was it reasonable to expect that this could happen? Of course.\" (Emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. For example, in respect to the first special issue, dealing with deliberateness, the prosecutor argued: \"Was his conduct deliberate. He doesn't have to fire the fatal shot. But was his conduct deliberate. You bet it was deliberate. It was even more than that. He planned that robbery. He picked that store. It was a premeditated robbery. He thought about the fact that he's going to need a gun when he went in there. You know that he meant to use it because it was loaded and you know he fired that gun into an innocent man.\" (Emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Affirmance by the Court of Criminal Appeals was unanimous except for one Judge who noted, without elaboration, that he would have sustained Lane's point of error concerning the trial court's sua sponte excuse of a prospective juror; two Judges concurred in the result without opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. On February 3, 1992, the district court had denied the state's motion to dismiss on the basis that the scheduled evidentiary hearing embraced unexhausted claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. We subsequently stayed the district court's order pending this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We would agree with this latter Conclusion of the district court had it said that \"either Williams or Nichols actually fired the shot that killed Shaffer.\" The record not only clearly shows, without contradiction, that both Nichols and Williams fired at Shaffer -- indeed, the instant habeas petition avers that \"it was undisputed that all of the shots were fired with intent to kill\" -- but also allows the reasonable inference that both hit him (though only one bullet, that which went through Shaffer's body, was fatal, while the other, the superficial, glancing wound on the side of his head, was neither fatal nor disabling).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The district court denied all the claims concerning: (1) improper prosecutorial voir dire and other statements and argument (apart from the argument that Nichols, rather than Williams, fired the fatal shot, which, as above noted, the court found improperly inconsistent with the prosecution position in Williams' trial); (2) the prosecutor's failure to correct Parker's testimony about the agreement concerning her testimony and creating the false impression in argument that she was unaware of this; (3) Nichols' denial of counsel at two line-ups; (4) all claims of denial of effective assistance of counsel, in preparation, at guilt/innocence, at sentencing, and on appeal; (5) the state court erroneously failing to compel Williams to testify at Nichols' second trial; (6) that Nichols' second trial violated double jeopardy, particularly as had the first trial concluded on or after August 31, 1981 (instead of July 31, 1981) the amended version of Tex. Code Crim. Proc. art. 37.071(e) would have been in effect under which the inability of the jury to answer any of the three punishment issues would have resulted in a sentence of life imprisonment; (7) the unconstitutionality of the Texas capital sentencing statutory provisions, both facially and as applied in this case (including the alleged inability of the jury to give mitigating effect to Nichols' youth and character evidence and potential, but unpresented, evidence of drug and/or alcohol use, the failure to define both reasonable doubt and certain terms in the special issues, and the failure to adequately narrow the class of those exposed to the death penalty); and (8) excusing of certain potential jurors. Id. at 69-70, 75, 76-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The mentioned post-hearing briefing referred to the allegedly exculpatory information contained in \"documents obtained just prior to the [March 1992] hearing.\" Id. at 79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The district court for the same reason denied Nichols' motion \"to expand the record in this cause or to reconvene the evidentiary hearing in order to consider evidence relating to this [ Brady ] issue.\" Id. The motion to expand the record referred, inter alia, to an April 9, 1992, affidavit of Johnson stating, among other things, that just after Nichols shot at Shaffer she \"saw the taller guy (Williams) lean across over the counter, and shoot his gun down at Mr. Shaffer. This is the shot that went through Mr. Shaffer's chest and killed him,\" that \"I just stood there frozen until the men left the store,\" and that she then hid in the restroom and while there \"heard someone come back into the store and then immediately leave again after firing another shot.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In Enmund, the Court held that the Eighth Amendment prohibits imposition of the death penalty on one \"who aids and abets a felony in the course of which a murder is committed by others but who does not himself kill, attempt to kill, or intend that a killing take place or that lethal force will be employed.\" 102 S. Ct. at 3376 (emphasis added). In Tison v. Arizona, 481 U.S. 137, 107 S. Ct. 1676, 1688, 95 L. Ed. 2d 127 (1987), the Court held that \"major participation in the felony committed, combined with reckless indifference to human life, is sufficient to satisfy the Enmund culpability requirement.\" See also Schad v. Arizona, 501 U.S. 624, 111 S. Ct. 2491, 115 L. Ed. 2d 555 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In Green, the Court of Criminal Appeals affirmed the death sentence of a nontriggerman, but stated that the law of parties did not apply at sentencing to authorize affirmative answers to the special issues based on the state of mind or conduct of others, and overruled Wilder and Armour v. State, 583 S.W.2d 349 (Tex. Crim. App. 1979), \"as far as it is inconsistent with this opinion.\" Green at 287. Green further states that \"upon request by a capital murder defendant or the State, the jury is to be instructed at the punishment phase that only the conduct of the defendant can be considered at the punishment phase, and that the instructions pertaining to the law of parties given at the guilt stage cannot be considered. Appellant did not request any such charge in this case.\" Id. at 287 n.4. Wilder and Armour arguably, though neither expressly nor clearly, held that the law of parties could be applied in reviewing the sufficiency of the evidence to sustain affirmative answers to the punishment special issues (it did not involve or consider any instructional issue, and there is no indication that there was any instruction at the punishment phase concerning the law of parties).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Alternatively, the court held that the jury was not precluded by the special issues and the absence of an anti-parties instruction from considering and giving favorable effect to Nichols' asserted nontriggerman status.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The district court did not address the procedural bar issue. Nichols argues that Selvage v. Collins, 816 S.W.2d 390 (Tex. Crim. App. 1991), and Black v. State, 816 S.W.2d 350, 364, 374 (Tex. Crim. App. 1991), demonstrate that Texas does not apply the procedural bar to certain Penry v. Lynaugh, 492 U.S. 302, 109 S. Ct. 2934, 106 L. Ed. 2d 256 (1989), claims in cases tried before the Supreme Court's decision in Penry. However, the Court of Criminal Appeals decisions in Selvage and Black were handed down May 29, 1991, and the habeas procedural bar ruling by the state trial court in Nichols' case was rendered June 28, 1991, and that of the Court of Criminal Appeals applying the procedural bar was rendered December 12, 1991. Moreover, in Buxton we expressly declined to withhold decision awaiting the Court of Criminal Appeals decision in Selvage, noting the differences between the \"nontriggerman\" issue there and the type of Penry issue involved in Selvage. See Buxton at 821-822. That \"cause\" is not established as a matter of federal habeas law is also clear from Selvage v. Collins, 975 F.2d 131 (5th Cir. 1992), cert. denied, 124 L. Ed. 2d 663, 113 S. Ct. 2445 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In Bridge we stated: \"If the jury members believed that Bridge's accomplice killed the victim, then they could have answered 'no' to the first question . . . . If the jury members believed that Bridge did not shoot the victim, then they could have concluded that Bridge would not be a future threat.\" 963 F.2d at 770. We quoted the above language with approval in Harris and likewise there pointed out that in both Bridge and Drew a law of parties charge had been given at the guilt/innocence stage. Harris at 189. There is nothing to suggest that an \"anti-parties\" instruction was given at sentencing in either Bridge or Drew. An \"anti-parties\" charge was not given at sentencing in Harris.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We likewise held that this was so despite the failure to define \"deliberately\" in the first special issue. 31 F.3d at 1326 n.13. See also Nethery v. Collins, 993 F.2d 1154, 1162 \u0026 n.28 (5th Cir. 1993), cert. denied, 128 L. Ed. 2d 87, 114 S. Ct. 1416 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As previously observed, we would agree with this assessment if \"actually shot Shaffer\" read \"actually fired the shot that killed Shaffer\" (see note 17, supra). The Court of Criminal Appeals was essentially correct in its statement -- never disputed by the district court -- that \"it is factually unknowable and evidentiarily improvable who fired the fatal shot.\" Nichols v. State 754 S.W.2d at 202, n.18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. As we also stated in Showery, \" Ashe thus makes it clear that collateral estoppel applies insofar as it is necessary to safeguard against the risk of double jeopardy.\" Id. Showery further points out that prior to Benton the Court in Hoag v. New Jersey, 356 U.S. 464, 78 S. Ct. 829, 2 L. Ed. 2d 913 (1958), in a factual setting almost identical to that of Ashe, had rejected a due process challenge to the defendant's second trial. Showery at 203.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The court charged the Williams jury: \"The Defendant, WILLIE RAY WILLIAMS, stands charged by indictment with the offense of capital murder, alleged to have been committed in Harris County, Texas on or about the 13th day of October, 1980. To this charge the defendant has pleaded 'guilty', and he has persisted in entering such plea, notwithstanding the Court, as required by law, has admonished him of the consequences of the same; and it plainly appearing to the Court that the defendant is sane, and that he is not influenced to make this plea by any consideration of fear, nor by any persuasive or delusive hope of pardon prompting him to confess his guilt, said plea is by the Court received, and the jury are instructed to find the defendant guilty as charged in the indictment.\" (Emphasis added). After the charge was read, the court instructed the jury: \"You unanimously sign this verdict as I have instructed you and come back out, and we will receive the verdict.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See also, e.g., Darden v. State, 430 S.W.2d 494, 495 (Tex. Crim. App. 1968) (\"a plea of guilty to a felony charge before a jury admits the existence of all facts necessary to establish guilt\"); Miller v. State, 412 S.W.2d 650, 651 (Tex. Crim. App. 1967) (same); Anderson v. State, 118 Tex. Crim. 194, 42 S.W.2d 1012 (Tex. Crim. App. 1931) (\"the entry of the plea, after due admonition, is conclusive of guilt, unless the evidence introduced upon the trial makes manifest the innocence of the accused\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. We note that Williams was twenty-four years old; during the three months prior to his arrest, he had committed five other robberies, two of which were after the instant offense. At sentencing, Williams' counsel argued that the evidence did not clearly show whether the fatal shot was that fired by Williams or that fired by Nichols: \"You had JoJo [Nichols], a man who suggested the place we are going to rob. The man who went up to the cash register first. The man who fired the first shot. And possibly, the fatal shot. We don't know. The District Attorney is going to come up with a lot of conjecture about where the casings and so forth were found. That's merely conjecture. We don't know which shot did it. They were both a party to it. You heard JoJo sit there and plead the Fifth Amendment.\" However, defense counsel never argued that any of the issues could not be answered affirmatively unless the jury concluded that Williams fired the fatal shot. The main thrust of defense counsel's argument was that Williams shot without reflection in a frightened reaction to Shaffer's pointing a gun at him, so all three issues should be answered in the negative. The prosection argued that Williams' shot was the fatal shot, but never conceded that such a Conclusion was necessary to answer any of the issues affirmatively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Nor is there any basis on which to conclude that the jury in the second Nichols trial, either in its verdict of guilty or in its answer to the punishment special issues, found that Nichols, rather than Williams, fired the fatal shot. See text accompanying note 11, supra, and notes 12 and 13, supra, and accompanying text. The verdicts and the judgments of conviction and sentences in Williams' and Nichols' cases are not inconsistent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. There is considerable authority that judicial estoppel does not apply in favor of one who was not a party to the prior proceeding in which the inconsistent position was taken. See, e.g., Colonial Refrigerated Transportation, Inc. v. Mitchell, 403 F.2d 541, 550 (5th Cir. 1968) (Rubin, J.) (\"judicial estoppel may be invoked only by a party to the prior litigation or someone privy to a party\"); Jackson Jordan, Inc. at 1579 (\"No case is cited where the doctrine was applied in favor of a total stranger to the first phase of the dispute\"); Reno v. Beckett, 555 F.2d 757, 770 (10th Cir. 1977) (\"Kansas law is clear that a position taken by a party in one suit cannot be claimed as working an estoppel in another suit in favor of a party who was a stranger to the first suit\"). See also Sinclair Refining Co. v. Jenkins Petroleum Process Co., 99 F.2d 9, 13 (5th Cir. 1938), cert. denied, 305 U.S. 659, 59 S. Ct. 362, 83 L. Ed. 427 (1939) (\"The general rule is that one may not to the prejudice of the other deny any position taken in a prior judicial proceeding between the same parties or their privies involving the same subject matter, if successfully maintained\"); Scarano v. Central Ry. Co. of New Jersey, 203 F.2d 510, 513 (3d Cir. 1953) (\"A plaintiff who has obtained relief from an adversary by asserting and offering proof to support one position may not be heard later in the same court to contradict himself in an effort to establish against the same adversary a second claim inconsistent with his earlier contention\"); Chemical Bank v. Aetna Insurance Company, 99 Misc. 2d 803, 417 N.Y.S.2d 382, 384-85 (N.Y. Sup. Ct. 1979) (\"Defendant in this action, being a legal 'stranger' to the prior action, it may not avail itself of the defense of judicial estoppel based upon plaintiff's alleged inconsistent legal position in that action\"); 28 Am. Jur. 2d, Estoppel and Waiver, ยง 70 at 698. Cf. Guidry v. Sheet Metal Workers, 10 F.3d 700, 716 (10th Cir. 1993) (\"judicial estoppel . . . recognized by some circuits, prevents a party from relying on inconsistent arguments in successive stages of litigation when the party was victorious on the point in a prior phase of the case\"); In re Double D Dredging Company, 467 F.2d 468, 469 (5th Cir. 1972) (Brown, C.J.) (\"Our research discloses no case in this Circuit in which pleadings in identifiably separate actions were made the basis of such an estoppel. The consolidation order of the District Court, however, created what is in essence a single lawsuit . . . and we hold that when identity of parties and a single transaction encompass both actions a party making such an allegation is bound by it\"). There is also, however, authority that the party invoking the estoppel need not have been a party to the prior proceeding. See Allen v. Zurich Ins. Co., 667 F.2d 1162, 1166-68 (4th Cir. 1982); 1B Moore's Federal Practice P 0.405[8] at III-57 (\"it is not always essential that the party asserting the estoppel have been a party to the litigation in which the first position was asserted\"). Moreover, most courts refuse to invoke judicial estoppel where it is not shown that the prior inconsistent position was successfully maintained. See U.S. for Use of American Bank v. C.I.T. Const., 944 F.2d 253, 258-59 (5th Cir. 1991) (described as \"majority\" position); Merrill Lynch v. Georgiadis, 903 F.2d 109, 114 (2d Cir. 1990); Sinclair Refining Co. at 13; Guidry at 716; 28 Am. Jur. 2d, Estoppel and Waiver, ยง 70 at 698.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Nichols cites no supporting Supreme Court or Fifth Circuit authority. He relies primarily on the Concurring opinion of Judge T. Clark in Drake v. Kemp, 762 F.2d 1449, 1470-1479 (11th Cir. 1985) (en banc). No other Judge of the en banc Eleventh Circuit joined that opinion. We do not view it as compelling authority. Nichols also relies on Troedel v. Wainwright, 667 F. Supp. 1456, 1458-60 (S.D. Fla. 1986), aff'd 828 F.2d 670 (11th Cir. 1987). In Troedel, the district court granted habeas corpus on several grounds, including that the prosecutor had put in evidence testimony by an expert \"that, based upon the test analyses coupled with his education, training and experience, in his opinion, Troedel had fired the murder weapon,\" id. at 1458, but \"the opinion Troedel had fired the weapon was known by the prosecution not to be based on the results of the neutron activation analysis tests, or on any scientific certainty or even probability. Thus, the subject testimony was not only misleading, but also was used by the State knowing it to be misleading.\" Id. at 1460. While the Troedel district court looked to the expert's testimony at a prior trial, it also relied on the expert's testimony at the federal habeas, in concluding that his testimony at Troedel's trial was factually misleading (and known by the prosecutor to be so). No form of estoppel or \"constructive\" falsity was involved. Troedel is plainly distinguishable and is in any event not controlling authority. Nichols also relies on Pettaway v. Plummer, 943 F.2d 1041 (9th Cir. 1991), cert. denied, 121 L. Ed. 2d 220, 113 S. Ct. 296 (1992). But Pettaway was decided after Nichols' conviction became final. It is not on point in any event. It held that an express jury special verdict -- mandated by state statute -- that the defendant did not personally fire the fatal shot prevented the state, on retrial of the same defendant, from taking the position that the defendant did personally fire the fatal shot. Pettaway relied on Ashe and Grady v. Corbin, 495 U.S. 508, 110 S. Ct. 2084, 109 L. Ed. 2d 548 (1990 -- since overruled by United States v. Dixon, 125 L. Ed. 2d 556, 113 S. Ct. 2849 (1993) -- and the panel there noted \"we must, however, emphasize the limits of our holding.\" Pettaway at 1048. Nichols' invocation of Miller v. Pate, 386 U.S. 1, 17 L. Ed. 2d 690, 87 S. Ct. 785 (1967), is wholly wide of the mark. Miller condemned a prosecutor's use of evidence and argument that stains on the defendant's undershorts were blood when they were in fact paint, as the prosecutor then well knew. That was a case of factual, actual falsity, not \"constructive\" falsity or falsity by estoppel as contended for here. To rely on Miller as an escape from Teague requires compelling pre-1989 authority both that falsity by estoppel is constitutionally the same as actual, factual falsity and also that constitutionally mandated estoppel applies here. There simply is no such authority in either respect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. At the time of the district court's opinion, the panel opinion in Derden had been vacated for nearly a year and the case ordered reheard en banc. Derden v. McNeel, 947 F.2d 147 (5th Cir. 1991). The en banc court subsequently reversed the panel decision and adopted a significantly narrower articulation of the habeas cumulative error doctrine. Derden v. McNeel, 978 F.2d 1453 (5th Cir. 1992), cert. denied, 124 L. Ed. 2d 679, 113 S. Ct. 2928 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The district court made the following findings regarding Judge William Harmon, the state court Judge to whom Nichols' habeas petition was assigned: Judge Harmon did not preside over any part of either of Nichols' trials for Shaffer's murder, nor over Williams' trial. The district court concluded that notwithstanding his above findings, the state court's habeas findings were (with one exception unrelated to those district court findings) entitled to the presumption of correctness. Nichols, 802 F. Supp. at 70. We agree with this Conclusion for the reasons stated in the text infra in our Discussion of Nichols' cross-appeal claim that the district court erred in this respect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The en banc court further stated in Derden that \"the conduct of a trial Judge can violate due process only if the Judge so favors the prosecution that he appears to predispose the jury toward a finding of guilt or to take over the prosecutorial role.\" 978 F.2d at 1459 (citing United States v. Middlebrooks, 618 F.2d 273, 277 (5th Cir.), cert. denied, 449 U.S. 984, 101 S. Ct. 401, 66 L. Ed. 2d 246 (1980), and United States v. Sheldon, 544 F.2d 213, 219 (5th Cir. 1976)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The district court stated: \"This Court determines that the irregularities [cited by Nichols] neither fall within the statutory provisions which authorize this Court to disregard fact findings nor do they amount to convincing evidence that all fact findings were erroneous. Therefore, upon a review of the entire record, along with this Court's supplemental evidentiary hearing, the Court will evaluate each finding of fact individually to determine the proper application of the presumption of correctness.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The district court rejected this finding \"because the record, as a whole, does not fairly support such factual determination and because Nichols has established by convincing evidence that . . . [it] was erroneous.\" Id. at 75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As previously observed (see note 17, supra), we conclude that the record allows the reasonable inference that bullets fired by both Williams and Nichols struck Shaffer, although only one was fatal (or disabling).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Construing Tex. Const. Art. V, ยง 11 (\"No Judge shall sit in any case wherein . . . he shall have been counsel in the case\") and Tex. Code Crim. Proc. Art. 30.01 (\"No Judge . . . shall sit in any case . . . where he has been of counsel for the State or the accused\"). See also Ex parte Miller, 696 S.W.2d 908, 909 (Tex. Crim. App. 1985) (these provisions not violated unless \"the Judge actually acted as counsel in the very case before him\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The three matters Nichols points to have no meaningful relevance to whether the hearing was \"full\" or \"adequate,\" as distinguished from \"fair.\" In any event, we also conclude that the hearing was \"full\" and \"adequate.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We also observe that the Court of Criminal Appeals on December 12, 1991, based on its own review of the record, determined that the habeas trial court's June 28, 1991, findings and Conclusions were appropriate and denied relief on the basis thereof. No challenge has been made to the Court of Criminal Appeals habeas proceedings. Cf. Briddle v. Scott, 63 F.3d 364, 375 (5th Cir. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. As we have recognized many times, most recently in Amos v. Scott, 61 F.3d 333, 339-345 (5th Cir. 1995), the Texas contemporaneous objection rule is an adequate state procedural ground on which to base denial of federal habeas review of a claim denied under Texas law for failure to object.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. \"Well, better roll out the priest. A man he had not seen in ten years. All of a sudden we have a jailhouse Christian. I submit to you that this Harris County jail has converted more sinners than all of the churches in Houston, Texas, right up until just after their trials. It's interesting for you to note that the priest never said one word to you about the sacrament of confession. He said not one word to you about conversion to Christianity.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The part of the argument now so challenged was: \"You ought to be thankful that the State did not choose to show you the grief or misery of the other family involved in this. The Schaeffer [sic] family. We could have put Mrs. Schaeffer [sic] right there on the stand and let you watch her cry. We could have ask [sic] her what JoJo Nichols has done to her life forever . . . I could have asked . . . who is going to take care of you in your old age. Surely it's not going to be Joseph Nichols.\" This was immediately followed by the statement \"We chose to spare you that because it is our duty and your duty to look solely at the evidence and not cry for either side.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Similarly, a defense sentencing witness testified on direct \"my heart goes out to the Shaffer family.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Complaint is also made that the following two sentencing arguments were not supported by the evidence: \"And he'll gun you down if he gets the slightest opportunity,\" and \"That's a lifestyle. Ever since the man has been able to walk he's been stealing and running wild.\" We note to begin with that no objection was made to either argument. No complaint was made on direct appeal or in the state habeas in regard thereto. It is clear that the Texas contemporaneous objection rule would bar relief on these claims, as it did on all Nichols' claims respecting unobjected to arguments which were raised in state court. Accordingly, these claims are subject to procedural bar in federal habeas. Teague, 109 S. Ct. at 1068-69. We also note that these claims were not raised in the federal habeas petition below, and, although the arguments were quoted in Nichols' post-evidentiary hearing brief below, Nichols never sought to amend his petition and these particular claims were not addressed by the district court. In any event, the claims are without merit. The first statement is a reasonable deduction from the evidence, which showed that Nichols shot at Shaffer, less than two months previously had shot a convenience store clerk who did not respond fast enough to his demand for money (which he then continued to demand as the clerk bled), and on being jailed for the present offense threatened to \"shoot any deputy that got in his way.\" The second statement -- facially obvious hyperbole not intended to be taken literally -- was preceded by references to Nichols' February 1979 theft, his April 1980 robbery, his August 1980 robbery where he shot the clerk, his October 11, 1980, armed robbery, his instant October 13, 1980, offense, and his June 1981 planned armed jail break. The sentences immediately following the \"since the man has been able to walk\" comment are as follows: \"That's almost three years [1979-1981]. It's not just a few bad months.\" It was clear what was intended, and that was entirely proper.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. This now complained of argument was: \"In our duty to answer the arguments of the defense attorney, I ask you, if you will, just take one step back from their defense and look at it, apply the law of common sense that you brought into this courtroom, that's why juries are chosen.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. This now challenged argument was: \"Under our law he is either guilty of capital murder, he is guilty of murder, or he is not guilty of anything. He walks right out that door. We can never convict him of robbery or anything else . . . . The defense is saying that what you really have here is a situation where there are cracks in the law and we want you to let JoJo Nichols slip through these cracks and get away.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Defense counsel argued: \"You know, I'm going to say something that I very, very seldom say as a defense attorney. Joseph Bernard Nichols . . . . He's guilty of an aggravated robbery. And had the State charged him with aggravated robbery, you could have retired to the jury room based upon the facts that you heard from the witness stand and in about two minutes found him guilty of a first degree felony. But they elected to do something other than that. You know, they already had their pound of flesh. . . . . . . . So Joseph Bernard [sic] Nichols is guilty of aggravated robbery. But when you look at this charge, you're not authorized to find him guilty of aggravated robbery because he is not charged with aggravated robbery. He is charged with capital murder. And in my estimation, the State misJudged . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The argument was: \"Now they want you to pretend that all his other crimes are just fantasies, those really didn't happen. Grand juries have indicted them just as he was indicted in this case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. There Nichols contended that the argument went beyond the law and the facts and was hence improper under Texas law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Defense counsel had argued: \". . . there was at some time later a robbery that he entered a plea of guilty on and was given probation. You know that fact. From that point on though, the only additional thing that you now know is that he is guilty of this offense because a jury has not had the opportunity to pass on those other issues even though those cases have been pending as the record shows for a long time. There has been no action taken by any other group of individuals or by the State that would help you resolve those issues. Never a motion to revoke been executed on him. It's never been revoked for that matter. None of the other cases have been brought to trial . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. We also observe that defense counsel had argued at sentencing that under the law indictments were not evidence. At the guilt/innocence stage the court had instructed the jury, \"A grand jury indictment is the means whereby a defendant is brought to trial in a felony prosecution. It is not evidence of guilt . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The complained of arguments at the guilt/innocence stage are: \"If the defense wanted to play this game and would have been clever, they would have said this is the bullet that got him. But, no, they want to play the door game.\" And, \"The defense wants you to believe Willie ejected that bullet right here in the front door. Uh huh. Physical evidence caught them again.\" The challenged sentencing argument is: \"You recall on the question of guilt he sincerely argued to you that the bullet came from the door. They had themselves twisted sideways just to where it would come from the door. Now they have shifted gears that you don't believe that and now they want the shot to come over here from the counter from Willie Ray Williams. Aren't you offended by that? Wouldn't you be offended for a State's attorney to stand up here and shift and twist and blatantly change the proof around? There is something very wrong with that. I submit to you that you should be offended by that. Does it ever end?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. The referenced guilt/innocence arguments were not complained of in the federal habeas petition, and the referenced sentencing argument was mentioned only in the portion of the petition dealing with the claim that the Williams trial estopped the state from arguing that Nichols fired the fatal shot. None of the challenged arguments were addressed by the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Defense counsel had argued, among other things: \"You've obviously got the testimony of Willie Ray Williams. I think Willie Ray would have liked to have heard the testimony in this case before he was in the posture he was earlier where he got death for this same transaction because according to the argument in this case earlier, Willie didn't do anything. Willie couldn't have killed the man even though he said he did and even though his testimony was consistent with the injuries to the man.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The now challenged statement closely followed the prosecutor's statements that at the guilt/innocence stage the jury had been instructed to require corroboration of accomplice testimony but had not been so instructed as to the punishment phase, and that the prosecutor nevertheless would not ask the jury to believe Martin absent corroboration, which the prosecutor urged was afforded by the testimony of the guard Garrett and the hidden gun and knife found in the area of Nichols' cell and Martin's prior statement. The prosecutor was also responding to defense counsel's argument that only Nichols and one other were charged in the escape, though more were involved. The prosecutor stated: \"we only have corroboration as to two others. I wouldn't come to court to you and say convict a man on the word of a criminal without corroboration. We had corroboration as to two others.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. The trial court then ruled: \"The jury will use their own recollection concerning the evidence. The objection is overruled.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. The Court of Criminal Appeals also stated, \"Further, any possible error raised by the trial objection was cured by the [trial] court's admonishment.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. In support of his contention made in the district court, Nichols cited Rodriguez v. State, 852 S.W.2d 516, 520 (1993), which held that a trial court had authority to withdraw an order of mistrial. But that decision -- rendered more than a decade after Nichols' second trial -- was expressly predicated on the fact that the mistrial (which was declared out of the presence of the jury during the course of trial and before the case had been submitted to the jury) was promptly withdrawn before the jury was discharged and without the jury's ever having been informed of it. Here the jury was expressly informed of the mistrial and was completely discharged by the court on July 31, 1981. The state habeas court determined -- and the Court of Criminal Appeals implicitly agreed -- that \"the trial court's declaration of a mistrial in the applicant's first trial is not an interlocutory order which the trial court could later withdraw in order to apply the subsequent amendment to Article 37.071(3).\" Nothing presented suggests any basis for us to find this an incorrect statement of Texas law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. And, in light of the opinion of the Court of Criminal Appeals on direct appeal, it is at the best highly doubtful that amended article 37.071(e) would have applied even if the jury had not been discharged until September 1, 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Her affidavit states that several days later she was interviewed by \"someone from the district attorney's office\" and told him what she did see and he took notes, but apparently no statement was presented to her to review or sign. She had been \"in trouble with the law in Louisiana.\" Her affidavit indicates that not long after the offense she moved back to Louisiana, where she apparently had no telephone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. There is nothing to suggest that defense counsel knew or should have known that Johnson's testimony would (or would likely) deviate from this aspect of her statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Pearson had stated \"I really don't want to do this\" (serve on the jury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. In a single sentence of his appellant's brief, Nichols also conclusorily asserts that defense counsel inadequately attempted to rehabilitate and failed to specifically object to limitations on voir dire and exclusion of veniremen Day and Joseph Lewis. No explanation, argument, or citation of authority is given, so nothing is presented for review. As to Lewis, counsel objected to his exclusion and to not being allowed to attempt to rehabilitate (as to which nothing suggests possible success), and the Court of Criminal Appeals on direct appeal fully reviewed Lewis's exclusion and found it proper, noting that \"Lewis repeatedly stated that he could not follow the law of parties and find a nontriggerman guilty of capital murder, regardless of the evidence\" and that after some interim confusion, which proper explanation by the trial court cleared up, \"Lewis consistently stated that he could not find guilt in any case where the defendant did not pull the trigger.\" Nichols, 754 S.W.2d at 196, 197. Plainly, no constitutional error is presented by this ruling. See Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1988). More to the point, however, there is no challenge to the underlying rulings and it is plain there was no failure on the part of trial counsel to preserve any claim of error in this respect. As to Day, no complaint was made on appeal regarding her exclusion, and the state habeas court held that was a procedural bar. Trial counsel \"excepted\" to the exclusion -- which was sufficient to preserve review as to Lewis -- but the state habeas trial court stated that was also insufficient. However, the state habeas court further held Day was properly excluded. We agree. Questioning by the state and then by the careful trial court clearly reflected that she unequivocally would not under any circumstances, and regardless of the evidence, consider the death penalty for a non-triggerman. Wainwright v. Witt. Neither deficient performance nor prejudice is established by defense counsel's not attempting rehabilitation. Nothing suggests rehabilitation would have had any reasonable likelihood of success. As to Lewis and Day, Nichols has not preserved in this Court any complaint and in any event has not shown either deficient performance or that but for the claimed deficiency there is a reasonable probability the outcome would have been different.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Nichols says nothing about the actual twelfth juror. We also note that at the time of the shuffle the state still had one peremptory strike left.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. See notes 21 and 22, supra, and accompanying text. Trial here was completed in February 1982. Enmund v. Florida was not handed down until July 1982. Green v. State was decided in 1984. Indeed, Nichols argues that requesting an anti-parties instruction \"would have been futile at the March [sic] 1982 Nichols II proceedings.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. We note that Kirkpatrick is wholly inapposite to this case.\u003c/span\u003e\n\n",
    "body_length": 145855,
    "citedas": [
      "69 F.3d 1255"
    ],
    "attorneys": "ATTORNEYS FOR APPELLANT: Dan Morales, AG, John Jacks, Austin, TX. ATTORNEYS FOR APPELLEE: BRACEWELL \u0026 PATTERSON, Michael Kuhn, Houston, TX. WYNNE \u0026 MANEY, Mark Maney, Houston, TX.",
    "category": [
      "78",
      "75"
    ],
    "judges": "Before Garwood, Jones and Emilio M. Garza, Circuit Judges.",
    "citation_count": 282
  }
}
