{
  "id": "RZtPRWYBTlTomsSB6SHf",
  "document": {
    "title": "AT\u0026T v. DELTA COMMUNS. CORP.",
    "full_title": "AMERICAN TELEPHONE AND TELEGRAPH COMPANY, Plaintiff and Counter-Defendant, v. DELTA COMMUNICATIONS CORPORATION, Defendant and Counterclaimant, v. AMERICAN TELEPHONE AND TELEGRAPH COMPANY et al., Counter-Defendants",
    "jurisdiction": "S.D. Mississippi",
    "date": "1976-02-25T00:00:00.000Z",
    "docket": "1564(C)",
    "body": "CLARK, Circuit Judge.\n\nAfter sifting every bushel of speculative chaff suggested by the claimant, the court finds not a single grain of antitrust wheat to sustain the claims asserted. The thousands of pages of depositions and affidavits presented and the hundreds upon hundreds of pages of memoranda, motions, replies, and answers do not show any genuine issue of fact as to any claim which will support any antitrust violation. Summary judgment is clearly proper as to every possible antitrust issue.\n\nThe massive proof adduced shows this television broadcaster's failure was due to technological limitations and operational problems encountered in commencing its business life that were not the fault of any party sued. The station never had a viewing audience to sell that was worth more than the networks offered at various times to pay. The antitrust statutes do not require networks to subsidize the entry of a television station into the broadcast market. Similarly, no antitrust violation was committed by the carrier of the television signal nor by the existing local broadcaster either singularly or in combination with the networks. Enforcement of the carrier's authorized tariffs was free from antitrust violation. The established broadcaster was not shown to have taken any action in furtherance of its local-area monopoly and the claims against it based on that status are unfounded. Alleged Communications Act violations are dismissed as matters within the primary jurisdiction of the regulatory agency. In the exercise of its discretion the court dismisses the pendent state antitrust claims.\n\nAmerican Telephone \u0026 Telegraph Company (AT\u0026T) originally brought this action against Delta Communications Corporation (Delta) to recover 19,524.31 dollars, an alleged indebtedness for television audio and visual local-channel communications service to Delta's television station WHTV-TV in Meridian, Mississippi. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" Delta denied this liability asserting illegality of the tariffs covering these particular services. Delta also filed a counterclaim against AT\u0026T; Columbia Broadcasting System, Inc., later changed to CBS, Inc. (CBS); American Broadcasting Company, Inc. (ABC); RCA Corporation, later changed to National Broadcasting Company, Inc. (NBC); and Southern Television Corporation, WTOK-TV (Southern), charging these counterdefendants with anticompetitive practices aimed at the destruction of Delta specifically and ultrahigh frequency (UHF) television stations generally. This cause is now before this court on separate motions for summary judgment by the original plaintiff and each of the counterdefendants.\n\nTo reduce the complex matrix of facts, inferences, and suspicions that complicate this proceeding, the court waived its local rule so as to allow extended discovery before requiring each of the parties to file a memorandum which specified the legal theories and the supporting facts upon which they would rely in this litigation. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" Delta's initial and responsive memoranda have failed to delineate any precise theories supporting its counterclaim assertions. Instead, it presented numerous general accusations supported by legal citations which are not consistently apposite. To give the respondent the benefit of the doubt in ruling on the pending motions for summary judgment, this court has constructed the strongest tenable delineations of antitrust violations which can be combed from the documents presented. In addition to giving Delta the advantage of structuring for it the best possible legal theories, this court, as required in summary judgment actions, has resolved every issue of disputed material fact in favor of Delta and has drawn every reasonable inference from those facts in Delta's favor on each of the theories constructed. Poller v. CBS, 368 U.S. 464, 82 S. Ct. 486, 7 L. Ed. 2d 458 (1962).\n\nThe intricate development of this opinion is intended to provide a judicial blueprint which will detail the basis for the court's decision on every portion of the extensive legal and factual development produced by industrious counsel on both sides of the multiplex issues in this difficult cause. The court has explicated the reasons for rejecting every contention advanced, both to fully inform the parties of the processes followed and thereby subject its reasons to their most intimate and arduous testing for error and to reassure itself of the independent soundness of each disposition individually.\n\nI. FACTS\n\nA. The History of Delta's WHTV Television Station\n\nThe television industry has a peculiar competitive history. Competition in the industry has been limited both by regulation of applicants and by the technology of television broadcasting. Not only must applicants be well financed, but only a few stations can be allowed to broadcast in each coverage area. Use of the VHF spectrum, which was initially the only band used, has always been restricted by the Federal Communications Commission (FCC) in every broadcast area. Often in small municipalities like Meridian only one VHF station will be allowed. In an effort to promote competition in the television industry, the FCC has been more liberal in licensing UHF television stations. For quite some time, however, these UHF stations suffered in their competitive efforts because then existing television receivers had to be supplementally equipped with a special channel receiver to enable the set to pick up signals in the UHF band. In addition, special antennae are often required for UHF reception. In 1964 Congress passed an act requiring that all new television receivers have the capability to pick up UHF signals. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" This legislation directly led to a flood of applications and to a great influx of new UHF stations. Thirty-seven of those new stations, including WHTV, however, \"went dark\" between 1966 and 1972.\n\nAmong those who became excited by the increased development which liberal licensing of UHF television produced was Weyman Walker. Although he had extremely limited experience in television broadcasting, Walker was able to attract significant investors and decided to incorporate and operate a UHF station in one of three markets. He contracted with a television expert to survey and report on the Meridian television market. This report was prepared in the summer or fall of 1966. It ranked Meridian 159th in the national television market. The report estimated that any new television station going into this market would probably suffer losses for the first 2 years. It warned of the possibility of no immediate network affiliation and recommended that any entry be based on a limited operating day. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\"\n\nIn 1968, at the time Walker and his associates were considering the development of a UHF television station in Meridian, Mississippi, the Meridian television market was monopolized by Southern, a very profitable television station with the call letters of WTOK. Southern was then affiliated with CBS, and had been since 1954. Its rate of payment from the network at that time was 500 dollars per hour which provided it with income approximating 6,000 dollars per week. In addition, the CBS network was paying the substantial signal delivery charges of AT\u0026T in connection with its programming. The physical monopoly which Southern enjoyed because of the inherent technical limitations of the television industry was electronically shared with at least two other VHF television stations -- WDAM in Hattiesburg, Mississippi and WLBT in Jackson, Mississippi, both NBC affiliates -- which encroached upon the Meridian market. These stations overlapped 24% of the projected Delta market.\n\nAugust 28, 1967, Walker, as station manager of the newly-founded corporation, Delta, visited with officials of ABC to inquire about affiliation with his new television station. On that occasion Walker was told \"Build it and we will look at it.\" Then too he became aware of ABC's policy not to affiliate a television station which has an average prime-time audience of less than 5,000 viewing households. ABC did not pay a station rate to stations having an average prime-time audience less than 7,000 nor did they pay program delivery charges for stations having an average prime-time viewing audience less than 10,000. The minimum station rate which would be paid if this level of viewership could be attained was 100 dollars per hour.\n\nIn July of 1967 Delta obtained a construction permit from the FCC to build television station WHTV in Meridian. Sometime between August and December of 1967 Delta's Walker made an offer to ABC to build a translator facility in Laurel which would increase circulation and also to build a microwave delivery system which would decrease the cost of transporting ABC's television signal. In connection with these promised improvements, Walker requested a 100 dollar per-hour station rate. Sometime late in 1967 Delta purchased the site for its Meridian television station and began making substantial plans for going on the air. On December 6, 1967 ABC granted Delta the right to televise all ABC programs which were not being shown by Southern. This offer included neither an agreement to pay a network rate nor an agreement to pay AT\u0026T delivery charges.\n\nAT\u0026T charges for the delivery of a television signal comprise a substantial part of the operating expenses for new television stations. In Delta's case these charges amounted to approximately 7,000 dollars per month. Once a certain average prime-time viewership has been established an affiliated network will usually absorb these expenses as part of the compensation to the station for the service of delivering the network's programs.\n\nIn December of 1967 Delta contacted NBC seeking to broadcast its programs. No affiliation request was made at this time as Delta was still attempting to obtain an ABC affiliation. In fact, all correspondence with NBC by Delta during this period was on stationery which indicated by a printed logo that the station had an ABC affiliation.\n\nIn May of 1968 CBS agreed to allow Delta to use certain programs which were not \"cleared,\" i.e., requested for showing by Southern, its Meridian affiliate. Under this agreement, these CBS programs carried no payment of a network rate and CBS paid no part of AT\u0026T charges for delivery of the signal.\n\nIn June of 1968 Delta's WHTV station finally went on the air. The only network programs it was able to present were the ABC and CBS programs which Southern did not wish to show. In August of 1968 several Delta officials visited the FCC to discuss the problems they were having affiliating with one of the national networks. They were told by Commission personnel that it had no authority to regulate networks concerning the arrangements they made with various stations.\n\nIn September of 1968, coinciding with the beginning of the new television season, NBC gave Delta the right to broadcast seven programs. In May of 1969 Delta was given a first-call affiliation by NBC. This meant that Delta was given the opportunity to broadcast any NBC programming it desired. However, this affiliation agreement did not provide for the payment of a network rate and Delta was required to pay all AT\u0026T charges incurred for delivery of the programs. As soon as it was granted the first-call NBC affiliation, Delta cancelled all of its ABC programming. On July 1, 1969 the NBC affiliation became effective.\n\nCBS was the first network to offer Delta a fee for broadcasting its programs. In September of 1969 it offered Delta a 35 dollar per-hour program rate. In April of 1970 NBC gave Delta a 50 dollar per-hour program rate. In August of 1970 , Delta's WHTV-TV station went dark. In January of 1971, a petition in bankruptcy was filed by Delta. Its facilities and equipment were subsequently sold to a Tupelo television station.\n\nSimultaneous with negotiations for network affiliation and for fees, Delta was also involved in dealings with AT\u0026T concerning the various signal delivery charges which television stations or the networks must pay. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" On September 20, 1967, AT\u0026T advised Delta that its longline charges from Jackson to Meridian (8 hours per-day minimum) would amount to approximately 4,744.25 dollars per month. On June 4, just prior to Delta's WHTV television station going on the air, AT\u0026T revised its quoted price to 5,524 dollars per month. Delta was billed 6,839.25 dollars for its first month of 16 consecutive hours of service per day. During the time it was broadcasting with full AT\u0026T services, Delta incurred monthly AT\u0026T tariff charges of approximately 7,000 dollars.\n\nIn an effort to minimize its AT\u0026T signal delivery expense Delta, in April of 1969, constructed a microwave transmitter to transfer television signals from Jackson to Meridian. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" This reduced the AT\u0026T services required and cut Delta's cost to approximately 1,800 dollars per month. At this time Delta was in debt to AT\u0026T for unpaid signal delivery charges of approximately 67,000 dollars. This included charges for long-lines, local-channel and station-connection services performed prior to the use of the private microwave.\n\nOn October 2, 1969 AT\u0026T filed new tariffs which increased the station-connection and local-channel service charges still required to supplement the microwave service, to approximately 4,000 dollars per month. On February 28, 1970, Delta again changed its operating format to use a precontrol-room feed of its signal from WLBT-TV, an NBC affiliate, in Jackson. This service cost Delta 400 dollars per month but avoided all AT\u0026T charges. The drawback to this arrangement was that Delta was limited to airing programs carried simultaneously by WLBT. Delta ceased broadcasting in August of 1970. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nAT\u0026T's original complaint in this cause sought recovery for the cumulative charges incurred between October 1969 and April 1970 for station-connection and local-channel services used subsequent to Delta's April 1969 employment of the microwave transmitter.\n\nB. Television Industry Economic Organization\n\nPrerequisite to any analysis of antitrust violations in this industry is an understanding of how this economic milieu operates. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" The television networks essentially serve the industry as intermediaries that collect, produce, and distribute. To generate income, networks sell broadcast time to national advertisers. This time is packaged around programs produced by the networks which are designed to attract viewers. To distribute the packaged product to the consumer of the advertising the networks purchase from local television stations the service of broadcasting both the programs and advertisements to persons living within the station's range.\n\nThe price a network pays a local station for the service of broadcasting the package of programs and advertisements is tailored to the size of the audience which polling estimates that station attracts. In turn, the network's sales price to the national advertisers for airing their advertisements is based upon the total audience which that network's affiliated stations and the independent stations with which it has made agreements to broadcast the particular package are predicted to attract. The relevant consideration in fixing both the price to be charged the advertiser and paid to the local broadcaster is the size of the audience delivered. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nThe networks usually compensate local television stations through a complicated combination of payments. If the television station's audience is substantial, the network will agree to pay a network rate. This network rate is computed on what is called a per-hour prime-time basis. For example, during most of the time relevant to this litigation, Southern was being paid a 500 dollar per-hour prime-time network rate. That rate meant the network paid the television station a percentage of that 500 dollars for every prime-time hour of that network's shows run by the station. In addition, the station was compensated a decreasing percentage of that rate for every television show run during less favorable hour categories. As an additional element of compensation, the television networks usually absorb the AT\u0026T delivery charges necessary to bring the network signal to the local television station. The most expensive of these categories of charges are those for long-line or IXC services. That the total of these charges could be substantial, is shown by Delta's 7,000 dollar per-month bill from AT\u0026T for its first months of operation.\n\nNetwork compensation to a successful television station, then, involves a combination of payments to the station of the network rate and absorption of the AT\u0026T delivery charges. Subtracted from these benefits is an \"affiliation fee\" or a \"waived hours\" provision. This is charged to the affiliate by the network to partially reimburse the network for the expenses incurred in delivering these programs to the local television stations. During most of the time relevant to this litigation, the monthly CBS \"affiliation fee\" or \"waived hours\" provision was calculated at 205% of its per-hour station rate, or 1,025 dollars. The sum of these three factors make up the net compensation paid to television stations.\n\nAn overview of the network's income and payments to local stations makes it obvious that the amount of the station network rate paid to and AT\u0026T delivery charges absorbed for a television station are a function of the amount of money that a national advertiser would be willing to pay to the network for the addition to that network's total audience of the number of people the local television station's broadcast service would add.\n\nABC's policy was that unless a television station could deliver 5,000 average prime-time viewing households, it would not affiliate. ABC required 7,000 average prime-time homes before it paid a station rate and 10,000 before it would pay AT\u0026T delivery charges. The policy of NBC prohibited compensation below the level of 6,000 prime-time homes. These policies evinced an economic judgment that unless the network's respective 6,000 or 7,000 household figure was met, national advertisers would not be willing to increase their overall compensation to the networks for the addition of the television stations.\n\nSince the price paid for the service rendered is determined by the size of the audience, it is apparent that estimations of the size of that audience are extremely relevant to any litigation which questions the legality of the functioning of the industry. ABC's research to determine whether it would affiliate with Delta predicted 2,476 homes could be added to the network's total viewer audience by Delta's broadcast signal. October 25, 1967 NBC research showed Delta would only add 500 unduplicated homes. In November 1968 the American Research Bureau (ARB), an independent audience polling organization which makes its results known to all subscribers (who may be advertisers, networks, or broadcasters), estimated that Delta's WHTV-TV station reached 2,200 average prime-time viewing households; in February of 1969 it showed 2,700; in November of 1969 ARB showed less than 1,000; and in February of 1970 it showed 4,000. In April of 1970 Nielsen's survey, another similarly operated independent group which predicts television audiences, showed 3,400 average prime-time viewing households for Delta.\n\nThe regular ARB and Nielsen surveys were conducted by the use of statistical sampling techniques in which a random sample of the audience accounted for each program it viewed in a diary. The telephone coincidental surveys were conducted by telephone inquiry asking each person called which program he or she was watching at the time. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" The industry regarded the telephone coincidental surveys as the less reliable of the two measures of station audiences.\n\nIn addition to the above, two surveys were taken by ARB at the behest of Delta. These were done by the telephone coincidental survey method. The first showed that Delta had a 68 percent share of the viewing audience in Meridian compared with Southern's 16 percent. After a complaint by Southern, this survey was rescinded as having been computed incorrectly and corrected results were published which showed Southern with 62 percent of the viewing audience and Delta with only 18 percent. Since a mistake had been made on this survey, an additional telephone coincidental survey was taken by ARB which showed that Delta had a 23 percent share of the audience and Southern with 64 percent. Both of these telephone coincidental surveys were done between the February 1969 and November 1969 regular ARB surveys. During this same period, surveys of the Southern audience indicated an average of from 29,000 to 35,000 viewing households. Both the use and the validity of these surveys are particularly relevant to most of the antitrust violations herein asserted.\n\nIn First National Bank v. Cities Service Co., 391 U.S. 253, 279, 88 S. Ct. 1575, 1588, 20 L. Ed. 2d 569 (1968) the Court in the course of discussing the appropriateness of summary judgment in an antitrust action (a matter discussed in detail in part II, infra), stated:\n\nObviously it would not have been evidence of conspiracy if Cities refused to deal with Waldren because the price at which he proposed to sell oil was in excess of that at which oil could be obtained from others. Therefore, it is only the attractiveness of petitioner's offer that makes failure to take it up suggestive of improper motives. (emphasis added).\n\nIn Cities Service the Court held that even the defendants' failure to conclude the attractive bargain was insufficient, standing alone, to withstand a summary judgment motion. In the instant case the bargain is demonstrably unattractive. The service of delivering a network's signal to Delta's predicted audience was not worth purchasing. The quoted passage from Cities Service clearly indicates that no inference of anticompetitive conspiracy would be reasonable from the facts here which show no more than the failure to conclude an unattractive bargain.\n\nIn the absence of any purpose to create or maintain a monopoly, the [Sherman] act does not restrict the long recognized right of trader or manufacturer engaged in an entirely private business, freely to exercise his own independent discretion as to parties with whom he will deal.\n\nUnited States v. Colgate \u0026 Co., 250 U.S. 300, 307, 39 S. Ct. 465, 468, 63 L. Ed. 992 (1918); accord, e.g., Weather Wise Co. v. Aeroquip Corp., 468 F.2d 716 (5th Cir. 1972), cert. denied, 410 U.S. 990, 93 S. Ct. 1505, 36 L. Ed. 2d 188 (1973); Bushie v. Stenocord Corp., 460 F.2d 116 (9th Cir. 1972); Anaya v. Las Cruces Sun News, 455 F.2d 670 (10th Cir. 1972); Daily Press, Inc. v. United Press Int'l, 412 F.2d 126 (6th Cir.), cert. denied, 396 U.S. 990, 90 S. Ct. 480, 24 L. Ed. 2d 453 (1969).\n\nII. IS SUMMARY JUDGMENT PROPER IN THIS TYPE OF ACTION?\n\nDelta places a doctrinaire sort of reliance on Poller v. CBS, 368 U.S. 464, 82 S. Ct. 486, 7 L. Ed. 2d 458 (1962) to support its repeated assertions that summary judgment may not be granted in any phase of a complicated antitrust case. Poller will not support such broad assertions. It decided no more than that summary judgment is improper where substantial factual evidence \"tended to show the existence of a conspiracy\" against an eliminated competitor notwithstanding the fact that substantial evidence also tended to show the nonexistence of conspiratorial behavior. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" Clearly, summary judgment has not been discarded as wholly inappropriate in the field of antitrust law. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" Although summary judgment is an available judicial tool in the antitrust area, Poller does warn that it should be cautiously used. Poller, however, is inapplicable to the instant situation because Delta has failed to respond to motions for summary judgment against it by supplying \"substantial factual evidence tending to show the existence of a conspiracy.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\"\n\nThe standard to be used in determining the appropriateness of summary judgment in complicated antitrust cases is defined in First National Bank v. Cities Service Co., 391 U.S. 253, 88 S. Ct. 1575, 20 L. Ed. 2d 569 (1968). In that case the plaintiff alleged that Cities Service Company was involved in a conspiracy to boycott the purchase of his oil. The only fact the plaintiff was able to show in support of his allegation was the abrupt decision by Cities Service Company to halt negotiations with him for the purchase of Iranian oil. The court concluded that this one fact, if not met by any contrary evidence, might well be sufficient to require that the case be presented to the jury to determine the motives of Cities Service Company for not dealing with the plaintiff. But most important to today's decision, the court went on to state that the record in the case before it contained such an overwhelming amount of contrary evidence as to Cities Service Company motives that summary judgment was proper.\n\nNot only is the inference that Cities' failure to deal was the product of factors other than conspiracy at least equal to the inference that it was due to conspiracy, thus negating the probative force of the evidence showing such a failure, but the former inference is more probable.\n\nId. at 280, 88 S. Ct. at 1588. In an apparent response to Poller dicta which required cautious use of summary judgments in complicated antitrust litigation, the Supreme Court in Cities Service stated:\n\nWhile we recognize the importance of preserving litigants' rights to a trial on their claims, we are not prepared to extend those rights to the point of requiring that anyone who files an antitrust complaint setting forth a valid cause of action be entitled to a full-dress trial notwithstanding the absence of any significant probative evidence tending to support the complaint.\n\nId. at 291, 88 S. Ct. at 1593.\n\nDelta alleges almost the same conspiratorial web as did the plaintiff in Cities Service. The only factual underpinning to Delta's major antitrust claim is that the three major networks refused to deal with it on terms it considered fair. Absent \"substantial factual evidence tending to show the existence of a conspiracy\" Cities Service teaches that summary judgment is proper when an inference of nonconspiracy is more probable than the plaintiff's asserted inference of conspiracy.\n\nDelta shows a variety of dealings with the networks which it alleges are tantamount to a refusal to deal. It requests we make a quantum leap from these \"refusals\" to the inference of a network conspiracy to restrain the development of UHF television stations. Delta's claim fails to meet the Cities Service summary judgment test in that the mass of discovery developed in this case clearly points to the much more plausible inference that the network dealings with Delta grew not from any conspiratorial plan but from independent business decisions which concurred in no more than the separate conclusions that Delta was unable to deliver a sufficient television audience to make more favorable dealing with Delta economically sound.\n\n\"The Sherman Act is . . . [not] a panacea for all business affronts which seem to fit no where else.\" Scranton Construction v. Litton Industries Leasing Corp., 494 F.2d 778, 783 (5th Cir. 1974), cert. denied, 419 U.S. 1105, 95 S. Ct. 774, 42 L. Ed. 2d 800 (1975). In this case, Delta, the opponent to motions for summary judgment which were soundly supported by massive factual development, failed to adduce any substantial facts showing conspiracy and failed to develop facts from which the most probable inference to be drawn was conspiracy. Under Cities Service, summary judgment should be granted.\n\nIII. FEDERAL ANTITRUST CLAIMS\n\nDelta's antitrust assertions cover a broad spectrum of separate antitrust allegations. Often various claims are lumped together accompanied by the assertion that a particular antitrust \"label\" is not significant. But it is. The antitrust laws are designed to prevent specific types of actions which Congress and the courts have found to be anticompetitive. Notwithstanding this defect in presentation, we have examined the general claims as though they were particularized. Delta has failed to show any material facts which will support a specific antitrust violation.\n\nDelta's claims, read in the light most favorable to it, assert the following antitrust violations: (A) conspiracies in restraint of trade in violation of the Sherman Act § 1; (B) actions which are per se violations of § 1; (C) acts of monopolization or attempts to monopolize in violation of the Sherman Act § 2; and (D) violations of the Clayton Act and Robinson-Patman Act.\n\nA. Claims of Conspiracy Under Sherman Act § 1\n\nDelta alleges two major conspiracies which unreasonably restrained its entrance into the television market: (1) NBC, CBS, ABC, AT\u0026T, and Southern all conspired to prevent it and other UHF stations from receiving fair remuneration from the television networks for its service of delivering their signal, and (2) NBC, CBS, ABC and AT\u0026T conspired to establish, maintain and apply AT\u0026T tariffs for the delivery of network signals which discriminated against Delta and other UHF stations.\n\n1. Market Entry Conspiracy\n\nDelta claims that ABC, CBS, and NBC, along with AT\u0026T and Southern's television station WTOK in Meridian, conspired to restrict the entry of Delta into the Meridian market and to restrict the entry of UHF stations generally into the television market throughout the nation in violation of § 1 of the Sherman Act. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" Delta claims the major networks' motivation for this conspiracy is twofold: first, should UHF stations be allowed to develop, the end result would be the creation of an independent television network which would be in direct competition with the existing major networks; second, the development of such stations would eventuate in UHF stations which would compete with the five broadcasting stations each major network is allowed to own by FCC regulations. The motive claimed for AT\u0026T's participation is the ease of dealing with only three major networks as compared to more networks or additional numbers of independent television stations. The motive assigned for Southern is that the failure of Delta would preserve its monopoly in the Meridian market. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" Delta asserts that the following conclusory facts show the existence of a conspiracy by the three major networks. Each is said to have denied Delta a) the right to broadcast their programs \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" and b) a true affiliation agreement; and, each network refused c) to pay AT\u0026T delivery charges and d) to pay Delta an adequate rate for the services rendered.\n\nThe prerequisites for a violation of § 1 of the Sherman Antitrust Act are twofold. First, there must be a conspiracy, i.e., an agreement between at least two parties. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" Second, the conspiracy must unreasonably restrain trade. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Delta has failed to prove both prerequisites. It does not point to a single fact to show the existence of a conspiracy between the networks. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" In effect, the numerous pleadings presented by Delta admit there is no direct evidence of conspiracy. Lacking direct evidence, Delta must rely on circumstantial proof of the existence of such a conspiracy. For this proof to be sufficient it must show that the activities of the networks were consciously parallel. Conscious parallelism, however, has not read conspiracy out of the Sherman Act. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" Therefore, Delta not only must show that the networks' actions were consciously parallel, but also that they were contrary to the economic self-interest of the networks. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" Since each of the major networks dealt differently with Delta, no direct or circumstantial evidence is shown from which parallel actions can be inferred.\n\nThe first approach NBC received from Delta was as a station, indicating affiliation with ABC, seeking programs that might be used to fill in or round out its schedule. The station went on the air in July of 1968 and in September of 1968 when the new fall season began NBC offered seven programs to Delta. In December of 1968 Delta initiated an active quest for an NBC first-call affiliation. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" In May of 1969 that affiliation was awarded effective in July of 1969. The delay was due to the giving of a required 28-day notice to Southern. In March of 1970 NBC helped arrange a precontrol-room feed from an NBC affiliate in Jackson which saved Delta approximately 3,500 dollars a month in AT\u0026T tariffs. In April of 1970 NBC paid Delta a 50-dollar-per-hour program rate even though Delta was unable to meet NBC's policy of not offering any station rate until the station could produce 6,000 average prime-time homes (the normal rate for 6,000 homes was 100 dollars). In addition, there was no \"waived hours\" deduction provision in the 50-dollar fee paid by NBC. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\"\n\nABC on December 6, 1967, made available to Delta all of the ABC programs which were not being used by Southern. This policy was continued on a no-pay no-delivery-charge basis throughout Delta's career.\n\nCBS's first-call contract with Southern had been in existence since 1954. Late in 1967 Delta requested CBS to allow the telecast of all CBS programs which were not being used by Southern. This request was promptly granted and CBS offered to allow Delta to pick up the signal from the Meridian AT\u0026T switchboard which would have saved Delta the AT\u0026T long-lines delivery charges. The reason why Delta chose not to accept this offer does not appear in the proof developed. Early in 1969 CBS offered a 35-dollar-per-week network rate to Delta.\n\nFrom these recitals of uncontroverted fact it can be seen that the networks did not treat Delta in any fashion even remotely resembling conscious parallelism. Delta claims, however, that since none of the networks ever paid delivery charges for the delivery of the programs and since none of the networks ever offered an \"adequate\" network rate, there was to that extent parallel action. In addition, Delta claims that these same parallel acts were endured by all UHF stations and that they resulted in the failure of Delta and the 36 other UHF stations which have gone dark between the years of 1966 through 1972. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" This assertion by Delta, however, completely misconceives the point of the conscious parallelism test in a circumstantial evidence case. It is not enough for a plaintiff to show conclusory parallelisms which are indicative of the harm suffered, it is necessary to allege specific parallelism probative of conspiracy or joint action. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" The record developed here after voluminous discovery belies conspiratorial or joint activity. Each of the networks contracted with Delta for different amounts of programs at different times. Although only two were willing to pay a network fee, each of them reached their decisions at different times and paid different amounts. Only one network ever awarded a first-call affiliation.\n\nJudged by the standard applicable to summary judgments, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" it is clear that Delta has failed to show any material facts from which a jury could conclude that there was conscious parallelism in the activities of the major networks, and therefore could infer there was a network conspiracy.\n\nThe court's conclusion does not fail to consider Delta's questions, such as: Why was NBC's original program grant limited to only seven programs? Why did NBC wait until September of 1968 to allow NBC programs to be broadcast by Delta? These questions are typical and are expressed only to demonstrate that they are irrelevant. The facts suggest a host of different justifications. Indeed, the detailed proof of independent and normal operating policies, which indicate completely innocent and nonconspiratorial activity, obliterates the inference of unlawful action Delta suggests. In the face of this sort of factual record, these tenuous insinuations will not substitute for proof that a conspiracy existed between the networks to hinder Delta in particular or UHF stations in general.\n\nEven if some genuine issue of fact existed as to parallel activity, the record is insufficient to resist a motion for summary judgment on the claim of a § 1 Sherman Act violation. The uncontradicted proof shows that the actions of the major networks at all times were taken in response to sound economic considerations. To show conspiracy in a circumstantial evidence case, Delta must demonstrate not only parallel activity, but that the actions were in apparent contradiction to the networks' economic self-interest. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" To prevail on its claim of a § 1 Sherman Act violation, Delta must additionally show that these actions, in furtherance of the conspiracy, were an unreasonable restraint on trade. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nIn the case sub judice, these showings include the weighing of the same considerations and, therefore, will be discussed together. The relevant \"actions\" are the networks' decisions to deny an \"adequate\" network rate and to refuse to absorb the cost for the delivery of the television signals to the stations or, in other words, the networks' decisions not to pay or not to pay enough for the service which they were purchasing from Delta. Any network decision not to pay what Delta's services were worth would have been contrary to the networks' self-interest. The uncontradicted proof is that the service was not worth buying for a price higher than that paid. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nAs discussed above, the worth of a television stations' service to a network is determined by the size of the audience which the station is able to deliver. The nature of the industry is such that the measurement of this audience is never capable of exactness. It is always estimated on the basis of surveys and predictions. At no time did any of the research which regularly formed the basis for network action show that the Delta audience met, or might in the near future reasonably meet, the minimum network requirements for affiliation. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" The most telling fact is found in the total lack of contradiction to statements by two network officers who swore that no surveys, either independent or network-conducted, ever showed Delta broadcast to an average prime-time audience large enough to attract any additional revenue from national advertisers for the addition of Delta to a network. Since the research showed that the service Delta was attempting to sell was not worth buying, the only possible way to make out a § 1 violation would be a) to show that the measurements used were invalid, or b) to show that the standards used by the networks for determining compensation were unreasonable.\n\nDelta repeatedly asserts that if ABC or NBC had used a more reasonable assumption to calculate the number of viewer television sets capable of receiving a UHF signal (a percentage designated as the UHF conversion figure) and had accounted for the cable television audience, the 6 or 7 thousand figure required would have been reached as early as June of 1968 when the station first signed on. The mass of discovery evidence presented, however, fails to suggest that any facts exist to support these assertions. To receive a UHF signal, a television must have the appropriate tuning apparatus and often must have a special antenna. Delta claims that the conversion factor used in the research to determine its audience was too low; however, the census reports for 1970 and the expert report prepared by the station prior to its operation show that the figures used were reasonable. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" This summary judgment decision does not rest in anywise upon resolution of this apparent factual issue. Rather, Delta has presented no facts which show the UHF conversion figure used was incorrect. More importantly, Delta has failed to show any facts which would raise an inference, if the UHF conversion figures were incorrect, that the error resulted from any network's conspiratorial act to purposefully restrain trade.\n\nThe record does not disclose any facts which would prove that the networks acted wrongly in refusing to include cable television audience statistics in determining Delta's potential audience. A network's direct interest in a broadcast station's capability is in increasing the total of homes which can view that network's program and advertising package if the station broadcasts its signal. Adding the cable homes which would receive Delta's signal, if those homes were already receiving the relevant network's signal via another station through the cable, would not add viewers to the overall audience of the network. For this reason it was reasonable or at least not unreasonable to refuse to include them in the computations.\n\nThe final and telling consideration is that Delta has failed to point to a single fact which would allow a reasonable inference that the networks have purposefully misdirected their research so as to restrain trade by unreasonably barring the entry of Delta or UHF stations into the television industry. There was a reasonable correlation between the private network research and the independent survey research which, absent any indication of conspiracy between the networks and the ARB and Nielsen survey organizations, buttresses the conclusion the networks did not conspire in relying on the research of these independents as well as on their own private surveys in predicting Delta's capability.\n\nDelta claims that the 6 or 7 thousand household-viewers figure used by the networks was an improper standard upon which to base payment to television stations. The station claims that the use of this standard restrains trade by preventing Delta and other UHF stations from receiving network revenue. Delta points to the statements of two network personnel as supporting the conclusion that the networks acted in apparent contradiction to their self-interest and unreasonably by not paying more for Delta's service regardless of the circulation figure. Delta's assertions, however, completely misconstrue the import of each of these individual statements. Both men clearly indicate that they consider it not to be economically profitable to pay for Delta's service, but that the station's future potential is such that it might develop a profitable audience. The statements indicate no more than that it might be advantageous to the network in the future to subsidize the station at the present time. In fact, one even said that if it were up to him, he would make the decision in favor of subsidy. It would be unfair to leave this issue without noting the network spokesmen's statements that Delta's circulation was so poor that its addition to any network system would not produce a single additional dollar in income to the network from national advertisers is undisputed. Clearly, any station rate or payment of delivery fees by a network to Delta, based on the then known survey figures, would have been a gift. The Sherman Act does not command gratuitous compensation. Even though CBS and NBC both later made independent business decisions to award a station rate to Delta before the available research indicated that it would be profitable, a decision to make such a contribution in hopes of long term profitable return is a speculative risk within the business judgment of the individual networks and not one compelled by the antitrust laws. Any support for Delta from this action would have to be culled from a sort of they-should-have-speculated-sooner approach which will not suffice to prevent summary disposition.\n\nDelta is unable to show that it could present any material fact which would allow an inference that the networks purposefully mismeasured Delta's audience or that the networks improperly set their compensation standards. To the contrary, the proof is clear that Delta was unable to reach present, broadly applied standards. The hard but unequivocal facts reveal their service was not worth buying and this was the reason that the networks did not buy it. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" That action is not in apparent contradiction of economic self-interest nor is it an unreasonable restraint of trade.\n\nDelta has failed to show it could produce any facts probative of conspiracy; it has been unable to make a circumstantial showing of conspiracy in that it can neither show conscious parallelism nor actions in apparent contradiction of economic self-interest. It has also not been able to show an unreasonable restraint of trade. Summary judgment is proper in favor of the defendant networks as to the § 1 Sherman Act claim alleged.\n\nCBS is able to take advantage of an additional defense relative to this antitrust allegation. When Delta came on the scene in June of 1968, CBS was affiliated with Southern and had been so associated continuously since 1954. When requested by Delta to allow it to broadcast programs not being broadcast by Southern, CBS immediately complied with the request. CBS was also the first network to pay Delta a station rate for the broadcast of its programs. It is altogether unreasonable to assert that the actions of CBS toward Delta were unfair. The legal first-call affiliation agreement \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" between CBS and Southern fully justifies the extent of its activity. In Paramount Film Distributing Corp. v. Applebaum, 217 F.2d 101 (5th Cir. 1954), the court ordered a party dismissed from an antitrust action when that party was prevented from dealing more fully with the plaintiff because of a pre-existing valid affiliation agreement with another company. CBS' situation in this case is identical to the dismissed party's in Applebaum ; therefore, for this additional reason, summary judgment is proper as to CBS. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" In addition, because of the existing agreement with Southern, Delta never requested affiliation with CBS.\n\nDelta claims the network's motive for this conspiracy was to forestall the development of UHF stations in general so a) they could not become viable competitors to the five stations directly owned by each of the three major networks, and b) they could not form a fourth major network which would be in direct competition with the current networks. These alleged motives are completely unreasonable. The only plausible inference to be drawn from the undisputed facts is that the networks were motivated in their dealings with Delta solely by their interest in purchasing a distribution service for their programs and advertisements. In Delta's case the offered audience was so small that the networks concluded no national advertiser would pay them for its addition to the system.\n\nIn the first place, only two of the 37 UHF stations which went dark were in any markets which were in competition with the directly owned stations of the networks, and those two were successor stations in the same city. Success by Delta or the other UHF stations would not have provided any competition to these stations. Additionally, many of the unsuccessful UHF stations were in communities which previously had only one or two television outlets. While a second or a third station in such markets would provide an outlet for one or both of the existing networks not then being shown, it is altogether implausible that this situation could precipitate the formation of a fourth major network. Both asserted motives for the alleged refusal by the networks to deal fairly with Delta and other UHF stations are less believable than is the motivating factor of sound business judgment which resulted in each network offering no more to Delta for its service of distributing programs than that service was worth. Clearly, § 1 of the Sherman Act has not been shown to have been breached.\n\nDelta claims that Southern was an actor in the alleged conspiracy in that: 1) it influenced the ARB surveys to show a lower than accurate reflection of Delta's viewing audience; 2) it conspired with WDAM in Hattiesburg and WLBT in Jackson to keep NBC from affiliating with Delta; 3) it increased its scheduled ABC programs to prevent Delta's access to those programs; and 4) it had knowledge of, and acquiesced in, the conspiracy above.\n\nEach of the first three substantive assertions is further discussed in Section III(C)(3) of this opinion. However, in addition to Delta's failure to allege material facts to support any of them, summary judgment is proper here because none of these asserted elements in any way supports a conspiracy between the networks and Southern to harm either Delta or UHF stations generally. Each assertion constitutes no more than an independent action or act in concert with other stations. No allegation of concerted action involving the defendant networks is presented. There is no need to examine claim (4) -- that WTOK acquiesced in this conspiracy \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\" -- in light of the conclusion that Delta is unable to show that there exists an illegal conspiracy in which to acquiesce.\n\nDelta claims that AT\u0026T took part in this conspiracy by: 1) giving automated answers to inquiries regarding tariffs; 2) misquoting tariff amounts prior to the operation of the station; 3) refusing to intercede with the networks to arrange network payments of tariffs or with the FCC to provide some relief from the tariffs; and 4) by refusing ETV service \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\" when it was requested.\n\nAT\u0026T is bound by law to charge and collect the fee fixed by the tariffs for its services, \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" so to the extent that its responses to tariff inquiries are properly classed as wooden, they had to be. No facts are claimed to exist which would support any claim of intentional misdirection regarding the misquoted tariffs. As a regulated carrier in interstate commerce, AT\u0026T had to negotiate neither with the networks nor with the FCC because Delta was unhappy with the tariff which the law required AT\u0026T to charge.\n\nThere appears to be a factual dispute regarding the refusal of the ETV service. If it was material, it would prevent summary judgment. Delta claims it was denied ETV service; AT\u0026T claims that no request for it was made. However, as with the other three claims asserted against AT\u0026T, whether ETV service was denied is immaterial. Each of these claims alleges only independent wrong-doing on the part of AT\u0026T toward Delta. These wrongs do not tend to establish a conspiracy with the networks to hinder market entry by Delta or UHF stations in general.\n\nAT\u0026T's asserted motive for involvement in this conspiracy is to preserve the ease of dealing with only three network customers and to avoid the \"burden\" of dealing with numerous independent stations. This inferred motive would be logically inconsistent with the motive Delta assigns to the networks' \"conspiracy\" -- to prevent the development of a fourth major network. Preventing the development of a viable fourth network would cost AT\u0026T substantial income from additional traffic. Any conceivable greater ease in dealing with only three as opposed to four networks would be an insubstantial deterrent to receipt of such a benefit. Even if Delta should not be held to consistency in the various motives it implies, and assuming successful UHF stations would be absorbed by the existing networks, no motive either reasonable or unreasonable to suppress UHF development would exist because increased UHF broadcasting would simply increase AT\u0026T income. If the assumption is made that new stations would remain independent, there would then be an additional burden on AT\u0026T in dealing with such independent stations. However, the inference that this burden, offset by its accompanying increase in income, would motivate involvement in a conspiracy to restrain the entry of Delta and UHF stations into the television market approaches being ridiculous. After all, AT\u0026T exists to do business, not to avoid doing it. In sum, Delta has not asserted a single reasonable motive for AT\u0026T's involvement in its suggested conspiracy.\n\nDelta also asserts that AT\u0026T had knowledge of the networks' conspiracy and acquiesced in it. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" This claim must also fail. There are no facts to support the existence of an illegal conspiracy nor facts to support any motive for AT\u0026T's acquiescence in such a conspiracy.\n\n2. Tariff Conspiracy\n\nDelta makes an additional broad conspiratorial allegation. It claims that the networks and AT\u0026T in furtherance of an illegal conspiracy, established and/or applied a tariff structure which operated to restrain the entry of Delta and other UHF television stations into the television market. Delta points to two aspects of the tariff structure which operated unfairly against it and other UHF stations.\n\nFirst, Delta objects to the way in which AT\u0026T applies the requirement of the tariff that charges be based upon the lowest possible combination of air mileage between all points to which a customer orders service. The tariff characterizes the difference in charges to networks and individual stations as multi-point vs. dual-point charges. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" The operation of this system is most easily understood through the use of the following illustration:\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nA network purchaser from AT\u0026T would normally order the same signal delivered to many different points. If it should order service from Point A to Point B, a distance of 100 miles, the applicable increment of its overall charge will be based upon the tariff's per-mile rate times 100. If the network were to add the same service to Point C which falls exactly on this line of shortest air mileage between Point A and Point B, there would be no additional long-line service cost to the network because the total mileage ordered by the same customer would remain at 100 miles. If the network were to add to its order service at Point D instead of Point C the shortest air line service distance between Points A, B and D will be 120 miles. The incremental increase, therefore, for ordering the service extended to Point D will be calculated on only the 20 mile difference. On the other hand, if an independent station located at Point D should place an order for delivery of the same network's signal from Point A to Point D, it would be billed for the tariff rate times 60 miles, even though the network might still be paying AT\u0026T for delivery of service between Points A and B.\n\nUnder this application of the tariff AT\u0026T calculates the tariff charge for taking the signal from the point ordered to the point of delivery on a customer by customer basis. This is a wholly reasonable, if not the only practicable, method of application. The fact that Delta and other single service customers could achieve a savings if calculations of their costs could include the service rendered to another customer fails to demonstrate conspiratorial activity.\n\nDelta's second tariff allegation charges discrimination in the creation, continuation, and application of occasional-use vs. regular-use tariff rates. The FCC has previously determined that this portion of the tariff structure which authorizes charges at one rate per hour, per mile for monthly service (8 or more consecutive hours per day, per month) and a much higher rate per mile, per hour for occasional service (anything less than 8 consecutive hours per day) can operate in a discriminatory manner. Hughes' Sports Network, Inc. v. AT\u0026T, 25 FCC 2d 550 (1970). Delta asserts that AT\u0026T's rate structure forced it to pay for regular-use monthly service (which would entitle it to use 15-16 hours per day), which it could not fully use, because the fee for that service was less than occasional-use service for the 7 nonconsecutive hours per day it actually needed. The result was, Delta asserts, that it had to pay for 2 hours of AT\u0026T service for every one which it actually used. In addition, Delta contends that it would not have used as many hours of long-lines service if it had not been forced by the rate structure to pay for the service on the monthly service basis. Although this tariff structure has been held illegal as applied to a part-time network user, the Commission has never declared the tariff unfair as it affected an individual broadcaster such as Delta. Nevertheless, for purposes of assessing this antitrust allegation the court assumes the tariff structures discriminate against Delta in the manner alleged.\n\nDelta's antitrust claim here, as elsewhere, is not specific. In an effort to construct the case most strongly in Delta's favor, we construe it to have alleged four tariff-related activities in furtherance of an overall conspiracy to restrain the development of UHF television.\n\ni. Conspiracy to establish tariffs.\n\nDelta contends that the three major networks and AT\u0026T conspired to establish these tariff structures to prevent the development of UHF television stations. The motives alleged for this conspiratorial behavior are those discussed and discounted above. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" A meticulous review of the entire bulk of discovery reveals not a single fact which directly supports an inference of such a conspiracy. Instead, Delta is forced once again to rely on no more than its assertion of conscious parallelism between the networks and AT\u0026T and on actions in apparent contradiction of the economic self-interest of all conspirators. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\" Three things show this reliance is misplaced.\n\nFirst, the mere existence of the tariff cannot be said to indicate parallelism. The applicable TV tariff structure, which included both of these alleged discriminatory items, was established in 1948 before UHF television was a practical reality and long before Delta was conceived. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\" Moreover, both of these structural elements were present in other AT\u0026T communications tariffs created before 1948. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\" Chronologically, the tariff could not have been established as part of a conspiracy to restrain the development of an industry which did not exist at the time the tariff was created. Delta is unable to point to any fact indicating parallel activity in the tariff's establishment.\n\nSecond, Delta has been unable to show any facts which would indicate these tariffs were established contrary to the economic self-interest of the networks. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\" In fact, Delta's claim is just the opposite -- it asserts that the established tariffs operate disproportionately to the benefit of the economic interests of the networks.\n\nThird, Delta is unable to show any direct facts pointing to conspiracy.\n\nThis circumstantial evidence attempt fails because Delta is unable to show either conscious parallelism or actions contrary to economic self-interest. Such lack of proof to oppose the well-supported motions for summary judgment leaves Delta's attempt to support its assertions of conspiracy far short of the mark.\n\nii. Conspiracy to maintain tariffs.\n\nDelta also contends that AT\u0026T's failure to change the tariff once UHF television became a viable industry was an action, or more appropriately an inaction, in furtherance of its conspiracy with the networks to restrain the development of UHF television. Once again Delta completely failed to show a single fact indicative of conspiracy. In addition, the only parallel activity \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\" demonstrated is that neither the networks nor AT\u0026T sought to change the tariff structure. The conclusion that this inaction alone will not support an inference that a conspiracy existed between AT\u0026T and the networks is bolstered by the lack of any showing that Delta or any other broadcaster instituted proceedings to have the FCC relieve them from the tariff structure. Finally, we note that Delta does not even assert that such inaction contradicted any economic self-interest of any alleged conspirator. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\" The asserted motives for this conspiracy have been completely discussed and discounted above. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\"\n\niii. Noer-Pennington\n\nDelta claims the networks actively supported the existence of this tariff structure during various proceedings before the FCC. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" Delta asserts that this activity was in furtherance of the conspiracy to restrain the development of UHF television. Insofar as Delta's allegations seek to base recovery on the networks' efforts to continue the existing tariff structure or even to gain from the FCC a structure they considered more beneficial, they are not well taken. The right to petition administrative agencies for favorable action is outside the perimeter of activity proscribed by antitrust laws. United Mine Workers v. Pennington, 381 U.S. 657, 85 S. Ct. 1585, 14 L. Ed. 2d 626 (1965); Eastern Railroad Presidents Conference v. Noerr Motor Freight, Inc., 365 U.S. 127, 81 S. Ct. 523, 5 L. Ed. 2d 464 (1965).\n\nReading this claim most favorably to Delta, it apparently asserts that the networks appeared before and urged the FCC to continue or to adopt tariffs which favored the networks to the detriment of Delta. The fact that such actions were taken by all of the networks does not subject the activity to antitrust scrutiny. Clearly each individual network would have had the right to petition the administrative agency for action which it hoped would be favorable to its interest. In view of the common self-interest shared by the networks in the tariff provisions, it would render the right meaningless if the fact that all of the networks rather than only one sought to exercise the right of petition should cause the protected activity to lose its shelter.\n\nThe alleged supportive activity before the FCC is immune from antitrust scrutiny.\n\niv. Application of the Tariffs\n\nDelta finally claims that AT\u0026T furthered the conspiracy by the manner in which it applied these tariffs. This alleged action is also beyond the scope of antitrust examination. The statutory scheme which governs communications common carriers requires the tariffs to be filed with the FCC and notice to be given which allows time for objection. 47 U.S.C. §§ 201-09. Following this procedure and absent any decision by the FCC to the contrary, the tariffs have the effect of law; AT\u0026T is required by law to collect these tariffs once they become effective. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\" To hold that the application of these tariffs is violative of the antitrust laws, absent any factually supportable allegation that they were illegally established, would be to hold that federal law proscribes that very action which it prescribes. Therefore, this court holds that AT\u0026T is immune from an antitrust violation which depends upon AT\u0026T actions in charging and attempting to collect tariffs approved by the FCC. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\"\n\nv. Summary\n\nIn essence these claims amount to no more than extrapolations of the same allegation -- that AT\u0026T and the networks conspired to establish, keep, and apply tariffs which Delta claims operated to hamper its entry into the television industry. The problem for the assertion is that Delta is unable to demonstrate any fact which would suggest a conspiracy to establish or continue these tariffs except for proving that the tariff existed. This does not constitute a sufficient opposition to the motions for summary judgment. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" In addition, the networks are immune from antitrust scrutiny for their efforts before the Commission to continue or to adopt new tariffs which are favorable to their interests. Finally, AT\u0026T is immune from any allegation that its application of these tariffs, alone, can be proscribed by the antitrust laws. Therefore, summary judgment as to this allegation is proper.\n\nWere this court to have found some evidence of conspiracy sufficient to prevent a grant of summary judgment, however, this issue would still not be ripe for trial. The resolution of the factual controversy regarding whether the criticized elements of the tariff structure actually harmed Delta would then be at the center of such litigation. Carter v. AT\u0026T, 365 F.2d 486 (5th Cir. 1966), cert. denied, 385 U.S. 1008, 87 S. Ct. 714, 17 L. Ed. 2d 546 (1967) firmly establishes that \"all questions relating to the justness, reasonableness, validity and effect\" of tariffs are more properly within the primary jurisdiction of the FCC. 365 F.2d at 492.\n\nDelta claims that it does not question the lawfulness of the tariffs, but only questions their application as part of a conspiracy to restrain trade. Acknowledgment of this argument would subvert both Carter and this court's pretrial orders \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\" excluding issues as to the validity of tariffs in this law suit. Carter dealt with this very same approach and rejected it. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" Delta is foreclosed from this argument for an additional reason. Delta must be alleging either (1) that it was harmed by AT\u0026T's establishment or maintenance of an illegal tariff in conspiracy with others or (2) that it was harmed by AT\u0026T's application of this particular tariff structure. As discussed in (iv) above, AT\u0026T is required to apply these tariffs by law; therefore, they are immune from antitrust scrutiny for a claim alleging no more than that AT\u0026T applied the tariffs it was required to apply.\n\nIf, on the other hand, Delta is alleging that AT\u0026T was involved in a conspiracy to establish or maintain illegal tariffs -- an antitrust claim for which AT\u0026T might not be immune -- the FCC imprimatur of validity and legality lies upon the tariffs which are at the heart of the antitrust issue. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\"\n\nDelta would avoid the doctrine of primary jurisdiction by claiming that one of the elements of the alleged anticompetitive tariff, occasional-use vs. regular-use, already has been held both unreasonable and discriminatory in Hughes Sports Network. As is more fully discussed in Section IV(B) of this opinion, Delta reads Hughes Sports Network much too broadly. That case only decided that this tariff structure was unreasonable and discriminatory as it applied to Hughes. There are significant factual differences between Hughes' use of the tariffs and Delta's. It is quite possible that the FCC would determine that the tariff is also unreasonable and discriminatory to Delta; it is at least equally possible that the FCC might hold otherwise. In addition, no antitrust claims were presented in Hughes Sports Network.\n\nIf the court be in error in concluding that Delta has been unable to show any material facts indicating the existence of a conspiracy, thus making summary judgment improper, this court would dismiss this particular antitrust claim because the FCC has not been given an opportunity to determine whether these tariffs were either unreasonable as to or discriminated against Delta.\n\nB. Per Se Violations of Sherman Act § 1\n\nThere are certain agreements or practices which because of their pernicious effect on competition and lack of any redeeming virtue are conclusively presumed to be unreasonable and therefore illegal without elaborate inquiry as to the precise harm they have caused or the business excuse for their use.\n\nNorthern Pacific Ry. v. United States, 356 U.S. 1, 5, 78 S. Ct. 514, 518, 2 L. Ed. 2d 545 (1958).\n\nDelta alleges the following per se violations of § 1 of the Sherman Act: (1) the networks were involved in a group boycott, (2) each individual network engaged in an Otter Tail boycott, \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\" (3) the networks and AT\u0026T enforced a tying arrangement, (4) the networks, Southern, and two other broadcasters divided the Meridian broadcast market and (5) the networks and Southern were guilty of price fixing.\n\n1. Group Boycott\n\nDelta claims that the facts discussed in section III(A) of this opinion are sufficient to allow the jury to conclude that the networks were involved in a group boycott or a concerted refusal to deal which is a per se violation of § 1 of the Sherman Act. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\" The essence of the allegation is that the networks did not deal with Delta in terms Delta considered fair. The extensive discussion above has demonstrated no facts were suggested that could make even the minimal showing required to substantiate the existence of concerted action on the part of the networks.\n\nSuch concerted action, however, may be inferred from similar action when a per se violation is claimed. Here, though, the proof shows without conflict that the separate actions of the networks were not similar, but different. Each of the networks dealt with Delta and each dealt with it differently. This lack of sameness prohibits any inference of concerted action. Delta concedes this but asserts that since no network ever paid an adequate station rate to it and none ever paid the AT\u0026T delivery charge for the programs, these refusals were so economically destructive that they were tantamount to a common refusal to deal. In addition, Delta contends the common refusals authorize an inference of concert.\n\nWithout deciding whether a concerted refusal-to-deal can ever be found to be a per se violation when the refusal claimed is a refusal to buy, such a per se violation does not exist unless the product or service which is the subject of the refusal to buy can affirmatively be shown to be worth buying. This is especially so when, as here, the refusal to deal is defined by the plaintiff as a refusal to buy at an \"adequate\" price. Where the concert asserted is predicated on a failure to buy a service worth money for a money's-worth price, the plaintiff has the burden of demonstrating that his product has some value above the price paid or offered. In the case at bar the undisputed material facts show that the service Delta was attempting to sell was not worth buying. Irrespective of whether reasonableness under the \"rule of reason\" should be considered when examining a claimed per se violation or whether a refusal to deal violation is inherently limited to refusal-to-sell situations, a refusal to buy a product for more than it is worth simply cannot be a violation of the antitrust laws.\n\n2. Otter Tail Boycott\n\nDelta cites Otter Tail Power Co. v. United States, 410 U.S. 366, 93 S. Ct. 1022, 35 L. Ed. 2d 359 (1973), as creating a new § 1 per se violation category -- individual refusal to deal. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\" Delta claims that Otter Tail allows the finding of a per se violation even though there be no finding of concert. Otter Tail cannot be read to reach such a proposition. Otter Tail Power Company monopolized 91% of the relevant market. The domineering activities of a monopolist have always been subject to special antitrust scrutiny. None of the networks is a monopoly. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\" A refusal to deal by any of them individually would not be a per se violation of § 1. Even if it is assumed that the per se category of violations will be expanded to cover asserted individual refusals to deal, no such refusals were involved in this case. The absence of Otter Tail facts make that decision inapposite.\n\nDelta claims that the payment of tariff charges by the networks for their affiliated stations results in an illegal tying arrangement which is a per se violation of § 1 of the Sherman Act. The classic tying arrangement involves a seller in a dominant market position relative to one product, A, requiring the purchaser to buy an additional product, B, in order to be permitted to purchase A. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\"\n\nThe tie alleged by Delta is one by a network in which a station broadcasting a network program also receives payment by the network of the tariffs incurred in the delivery of that program. Delta claims this tie results in a greater expense to networks when they affiliate with stations and, therefore, a disincentive to affiliate which directly harms Delta. It also asserts that the tariffs would not be discriminatory against individual stations if all individual stations were required to pay them.\n\nThis tying arrangement allegation almost defies conventional analysis. The one alleged to have created the tie is not the party possessing market dominance. The alleged tied product is one sold by a third party. Delta confuses the roles of buyer and seller in this particular broadcast transaction.\n\nThe only pathway to resolution of the issue lies in the same distillation of the economics of the television industry as explained above. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\" In capsule, the network purchases service from local television stations -- the service of distributing programs and advertisements to the station's audience. The price paid for the service is negotiated between the networks and the station with the primary determinant being the size of the station's audience. The price is usually a combination of two elements: (1) direct payment to stations, gauged by the size of the station's audience; and (2) fixed payments to AT\u0026T to cover the cost of delivering the programs to the stations. Delta's assertion must then be viewed in this light: the networks, which are purchasing a service, have tied to their purchases an additional obligation on their part to pay to a third party a related cost. The \"tied-in\" payment is for a necessity to the purchase transaction -- the transportation of the signal to be broadcast from its source to the station selling the broadcast service. If this can be called tying at all, it ties the purchase of a service from a station to the gift of a related service that otherwise would have to be bought by the seller to make the sale effective. This sort of purchase has never been held to be an antitrust violation, and it seems doubtful such has ever before been alleged. In any event, this is not a tying arrangement which is a per se violation of § 1 of the Sherman Act. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\"\n\nDelta has moderated its initial claim in this regard to urge that while not a classical tie, the arrangement is analogous to one and, therefore, should be considered a violation of Sherman § 1. Generally, Delta is saying that the entire economic scheme of the industry is designed to create a barrier to entry. This argument breaks down into two points: (1) that the networks should have paid Delta's AT\u0026T delivery charges, and (2) that those charges were unfair as to independent stations. In section III(A)(1) of this opinion (refusal to deal conspiracy) the first specific is discussed and in section III(A)(2) of the opinion (tariff conspiracy) the second is discussed -- this court held that neither violates § 1 of the Sherman Act. Not all barriers to market entry are violative of the antitrust laws. Even considered in the best perspective for Delta, these are not.\n\n4. Division of Markets\n\nDelta claims that Southern and stations WDAM in Hattiesburg, and WLBT in Jackson horizontally divided the relevant market and that this division resulted in the exclusion of Delta. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\" The product involved is television advertising time. The relevant market which was allegedly divided, though never clearly defined by Delta, could only have been an area comprising 24% of the Meridian market. This 24% is situated where the signals of the broadcasters overlap. It is the only area in which the stations alleged to be dividing the market technologically could compete. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\"\n\nThere are two basic types of advertising time sold by television stations: time sold to the networks which, in turn, has been sold to advertisers, and time directly sold to advertisers by the station. This claim cannot involve a division of the Meridian market as to time directly sold to advertisers. Furthermore no party could \"divide the market\" as to time sold to networks which the networks have sold to firms who have made common purchases from all three networks. The allegation must be limited to a division of the market of advertising time sold to networks which have sold it to advertisers who buy time on only one network. In all other advertising markets there is no division of territory because there will be competition among either the stations or the networks for that advertiser's purchases of time for broadcasting into the overlap area.\n\nDelta has presented no probative evidence that this narrow classification of advertisers even exists, and if it does, whether its significance justifies antitrust examination. No reliance, however, is placed on this absence of proof in granting summary judgment. Rather, it is predicated upon undisputed facts which show that there has been no division of the market. Delta alleges that Southern, WDAM and WLBT agreed that Southern would sell its national network advertising time (i.e. time on network programs) only to ABC and CBS but not to NBC; that WDAM agreed it would broadcast only CBS and NBC advertising time and not ABC; that WLBT agreed only to broadcast national advertising time of NBC and ABC but not CBS. Even if this is true, it can be seen that Southern competes with WDAM as to CBS sales and with WLBT as to ABC sales. WLBT and WDAM compete as to NBC sales. In addition, it is an undisputed fact that Southern actually sold time to NBC, which means that there was competition among all three stations for NBC time. No division of the market has occurred here.\n\nDelta also claims a vertical division of the markets occurred, alleging the exact facts above. The undisputed facts show that no division occurred. More significantly, however, Delta does not claim or offer support in fact to indicate that any division of markets had its source in the networks. A prerequisite to the existence of a vertical division of this market is that the source of the division be the networks. Since this is not asserted or shown, summary judgment is proper.\n\nIn addition, Delta has failed to allege how either market division actually harmed it. Delta contends the market was divided so as to eliminate it from broadcasting network advertising and eventually raising its audience to receive remuneration for that service. But the only alleged division did not operate in that manner. Delta was able to broadcast programs of ABC and CBS immediately after going on the air and shortly thereafter it was authorized to broadcast NBC programs. Less than one year after it began operations, it received a firstcall NBC affiliation. Therefore, the alleged division did not keep Delta from receiving network programming.\n\nIf Delta meant to assert its harm was that it received unfairly low remuneration for the broadcast of the network programs and advertisement, that result in no logical manner could be the outgrowth of the alleged division. The division was of areas for network advertising and program distribution, not of funds received for their broadcasting.\n\nDelta is unable to demonstrate any genuine issue exists because its response failed to develop or suggest facts which would show any division of the markets or any harm suffered were that division to exist.\n\n5. Price Fixing\n\nDelta asserts that the networks fixed the prices which were paid to Southern by paying only a single common station rate. This price fixing is alleged to have reduced competition for Southern's broadcast of network programs. Had there been competition, Delta asserts that the prices paid to Southern by the networks vying for its broadcast signal would have climbed until one of the networks was priced out. The claim goes that the out-priced network would have then turned to Delta for broadcast of its signal. On this theory, it is alleged that a per se violation of § 1 of the Sherman Act has taken place. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\"\n\nDelta does not allege that there was a lack of competition for Southern's services prior to the signing of Southern to an affiliation agreement. Rather it contends that after the affiliation agreement had been negotiated, the other two networks fell into line and offered to pay the same station rate for the broadcast of their respective programs that competitive forces had caused to be negotiated with the affiliated network. The station manager of Southern admitted that this practice had been followed by the networks relative to its station.\n\nA seller has a right to establish a price for his product or service and require that all purchasers pay that price. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\" The only reasonable assumption this record indicates is that Southern, the seller here, decided upon an affiliation based upon both the compensation and the quality of the programs offered; and that, once affiliated, Southern exercised its pricing rights by demanding that the other networks either meet the affiliated network's rate or do business elsewhere. When the Meridian market is viewed in this light, it is seen that what actually happened is exactly the sort of market operation Delta asserts should be taking place. The problem, once again, is that Delta has framed its contention in a way that reverses the roles of buyer and seller and ignores the undisputed proof as to the difference in the value of the product being sold due to the great disparity in the quantity of the viewers offered by it and by Southern. Under market conditions as they truly existed in Meridian, Delta would not be able to sell its services unless and until a network believed that the price demanded by Southern was not worth the audience it promised to deliver, and that Delta's price was right.\n\nAs compared to any one of the networks, Southern was a relatively small operation, yet the fact that it offered access to the goal desired -- unreached viewers -- gave it the dominant market position in the Meridian market. Cold statistics establish that in the Meridian market Southern was 10 to 40 times more attractive than Delta, its only competition. These undisputed facts clearly establish that Southern was in a position to demand that its price be met. This analysis of undisputed facts and reasonable inferences bares the fallacy of Delta's allegation that networks set prices.\n\nThis being summary judgment testing, Delta is entitled to every favorable inference within reason. When the price fixing claim is examined solely from the standpoint of the network rates paid to Southern, an inference of a possible antitrust violation can be seen. Southern's station manager admitted that the unaffiliated networks \"fall into line\" by paying the network rate which the affiliated network has agreed to pay. Since there was no evidence of competition between networks for Southern's affiliation, \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\" even this tenuous analysis could be sufficient to make summary judgment inappropriate for the resolution of this issue. It is improper, however, to divine the existence of a price-fixing violation solely from the examination of the station rates paid because that rate is only part of the total price paid by each network to Southern. Compensation was composed of the station network rate plus payment of AT\u0026T delivery charges, minus \"waived hours.\" \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\" When these items are all considered, each network paid a substantially different amount to Southern. CBS paid a station rate and delivery charges and subtracted waived hours. NBC paid a station rate, did not subtract waived hours, but required Southern to pay its own delivery charges. ABC paid a station rate, did not subtract waived hours, and negotiated delivery charges on a per-program basis. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\" The undisputed facts clearly show each station compensated Southern in significantly different amounts for the services provided.\n\nThus, even if this industry could be characterized to permit a buyer to be a \"price fixer,\" the undisputed facts show that the buying networks here did not fix prices -- each paid different total amounts for the same service.\n\nC. Claims Under Sherman Act § 2\n\nThe essence of the monopolization offense under Section 2 is \"(1) the possession of monopoly power in the relevant market, and (2) the willful acquisition or maintenance of that power as distinguished from growth or development as a consequence of a superior product, business acumen, or historical accident.\" United States v. Grinnell Corp., 384 U.S. 563, 570-71, 86 S. Ct. 1698, 1704, 16 L. Ed. 2d 778 (1966); Woods Exploration \u0026 Pro. Co. of Aluminum Co. of Amer., 438 F.2d 1286, 1304 (5th Cir. 1971), cert. denied, 404 U.S. 1047, 92 S. Ct. 701, 30 L. Ed. 2d 736 (1972).\n\nSulmeyer v. Coca Cola Co., 515 F.2d 835, 849 (5th Cir. 1975), cert. denied, 424 U.S. 934, 96 S. Ct. 1148, 47 L. Ed. 2d 341 (1976).\n\nDelta alleges the following monopolization claims: 1) AT\u0026T actively monopolized the television signal transportation market; 2) the networks monopolized the distribution of network programs and advertisements; 3) Southern monopolized the delivery of network programs and advertising in Meridian; and 4) all of the above parties also attempted to monopolize their respective markets.\n\n1. AT\u0026T Monopoly\n\nDelta claims that AT\u0026T monopolizes the communications delivery market. This is true. The monopoly which AT\u0026T enjoys, however, is both limited and regulated. It is the result of governmental recognition that the exclusive public utility franchises and the certificates of public convenience and necessity granted to AT\u0026T are in the public interest. Such regulation, though it chooses to license only one carrier, does not cut across the Sherman Act.\n\nDelta does not assert that AT\u0026T has taken any actions pursuant to its monopoly that are not a part of its permissible ambit of furnishing services at regulated rates. There is, therefore, no § 2 Sherman Act violation here.\n\n2. Network Monopoly\n\nDelta claims that the networks together monopolize the television industry. Delta states that for anticompetitive purposes monopoly is a relative term and includes oligopolies. Delta asserts that the networks constitute an oligopoly and that their actions are subject, therefore, to examination under § 2 of the Sherman Act.\n\nThe Sherman Act neither mentions nor regulates oligopolies. The parties cite no case which has engrafted this term onto the Act. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\" To do so would be contrary to the basic thrust of the Sherman Act. The two most important phrases in the Sherman Act are \"monopoly\" and \"conspiracy.\" Section 2 regulates one with monopoly market domination; section 1 reaches two or more who conspire and therefore acquire together an anticompetitive influence. To hold that an oligopoly violates § 2 amends the Act to subject to antitrust regulation businesses which lack the § 2 required market control and the § 1 conspiracy.\n\nCourts often have struggled with what percentage of market domination constitutes monopoly influence. United States v. United States Steel Corp., 251 U.S. 417, 40 S. Ct. 293, 64 L. Ed. 343 (1920) (50% share insufficient for monopoly power); Sulmeyer v. Coca Cola Co., 515 F.2d 835 (5th Cir. 1975), cert. denied, 424 U.S. 934, 96 S. Ct. 1148, 47 L. Ed. 2d 341 (1976) (22% insufficient); United States v. Aluminum Co., 148 F.2d 416, 424 (2d Cir. 1954) (33% insufficient); United States v. United Shoe Machinery Corp., 110 F. Supp. 295, 346 (D.Mass.1953) aff'd per curiam, 347 U.S. 521, 74 S. Ct. 699, 98 L. Ed. 910 (1954) (any share less than 50% insufficient). \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\" Possessing as they do significantly less than 50% of the network business, none of the network counterdefendants has the necessary market domination to be susceptible, individually, of being found to be a monopolist.\n\nSince Delta has been unable to show the networks to be either monopolists or conspirators, labeling them oligopolists will not suffice to establish an antitrust violation under the Sherman Act.\n\n3. Meridian Market Monopoly\n\nDelta claims that Southern is a monopolist in the Meridian market and that it took various predatory actions to secure that monopoly posture which harmed Delta.\n\nMarket data showing both the relevant geographic and product market affected by the claimed monopoly is prerequisite to finding that a monopoly exists. \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\" Delta has presented no such analyses in this case. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\" In fact, only the vaguest of references have been made to the relevant markets. Under the approach taken in this opinion, it is assumed that the relevant geographic market is the area covered by the delivery of both the signals of Delta and Southern and that the relevant product market is the sale of a broadcasting service (a) to the networks to effect the distribution of national advertising time and network programs and (b) to local advertisers. Although the allegations as to the relevant markets are crepuscular, the most-favorable-analysis-possible approach prevents summary judgment and necessitates a more detailed examination of the specific claims asserted in this portion of the action.\n\nDelta contends that Southern monopolizes the Meridian television market. Since, after Delta's failure, it is the only television station operating in Meridian and since, even while Delta was operating, Southern's audience was 10 to 40 times greater than Delta's, it would seem as though Southern does monopolize the Meridian television market. However, the principal economic market involved is the sale of the service of broadcasting the networks' package of network programs and national advertisements. Southern at no time broadcast more than 41% of the available prime-time network advertisement-program packages. This is not sufficient economic market domination to make it subject to scrutiny under the Sherman Act's § 2 proscriptions.\n\nSummary judgment should not rest, however, on the conclusion that Southern was not a monopoly. In Meridian, Southern was able to exert monopoly influence because it monopolized the audience. For purposes of summary judgment examination, the court further assumes that Southern held the dominant monopoly power in the Meridian television market. Nevertheless, summary judgment is proper because Delta was unable to show a single instance where Southern used its alleged market domination to harm Delta.\n\nThe existence of a monopoly absent more is not a violation of section 2 of the Sherman Act. This is especially true where the monopoly is directly traceable to some technological advantage such as that enjoyed by Southern (i.e., the status of being the only licensed VHF station in the market). \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\" In addition to monopoly, the plaintiff must show some predatory or willful act in furtherance of that monopoly. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\" Delta alleges five such acts: i) actions to prevent network affiliations, ii) anticompetitive practices relative to advertising, iii) improper dealing by a cable television service traceable to Southern, iv) anticompetitive influence on the private rating bureaus, and v) dissuading investors to infuse needed new capital into Delta. Any one of these, if proven, could be found to violate Section 2 of the Sherman Act under our other assumptions.\n\ni. Network Affiliation\n\nDelta claims Southern, an affiliate of CBS, attempted to prevent it from receiving network programming. Southern is alleged to have increased its ABC programming so as to deny those additional hours of ABC programming to Delta (Delta was only allowed to schedule ABC hours not scheduled by Southern) and decreased its NBC hours with full knowledge that WDAM in Hattiesburg would influence NBC not to allow NBC programs on Delta. This alleged scheme is to have begun upon receipt of knowledge by Southern of Delta's application for a construction permit.\n\nDelta supported this allegation by showing the compensation which Southern was receiving from ABC increased and its compensation from NBC decreased during the relevant time. This was asserted to indicate an increase in ABC programs and a decrease in NBC programs. However, the undisputed facts show that this increase in compensation was not due to any substantial increase in programs, but instead was due primarily to an increase in the program rate which ABC paid Southern, along with other factors.\n\nIn detail, the facts show that Southern increased its total ABC hours from January 1, 1966 through December 31, 1970, by only 4 hours per week. This 4-hour increase is directly traceable to cancellations by NBC of programs Southern had previously broadcast, NBC's grant of a first-call affiliation to Delta which deprived Southern of the two remaining NBC programs it was broadcasting, and the development of ABC as a stronger network which increased both the quality and quantity of the programs offered to Southern by ABC.\n\nThe life blood of a television station flows from its \"prime-time\" programming. To develop a television audience a station must transmit its best possible programs during this 6:00-10:00 p.m. time slot. Recognizing this, the networks broadcast their best material during this time. Delta's claims, therefore, revolve around increases and decreases in prime-time programming. The proof shows, however, that Southern occasionally broadcast one of the network's prime-time offerings in a nonprime-time slot. Therefore, there are two possible groups of prime-time shows which must be examined to determine the validity of Delta's claim: 1) the programs broadcast by Southern in prime time and 2) the programs the network offered in prime time that were broadcast during any time by Southern. \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\"\n\nIn 1966, the year before any activity by Delta, ABC hours broadcast in prime time by Southern totaled 8.1 per week. In 1967, the year in which Delta received its construction permit and began its search for an ABC affiliation, total weekly ABC hours broadcast in prime time by Southern was 7. In 1968, the year in which Delta actually went on the air, total ABC weekly hours broadcast in prime time by Southern was 7.8. In 1968, the year in which Delta received its NBC affiliation, the total ABC hours broadcast in prime time by Southern was 8.4. In 1970, the year Delta went dark, the total ABC hours broadcast in prime time by Southern was 8.7 per week. The only NBC decrease during this period was 1 hour caused by NBC's cancellation of the \"Bob Hope Chrysler Hour\" program. In 1969, when the NBC affiliation was granted to Delta, Southern lost its other two NBC programs.\n\nThe alleged purpose of these actions was not to make ABC happier by increasing its hours so that it would not let Delta show any of the ABC programs; it was to tie up ABC hours so that Delta could not use those hours. Southern's first knowledge that Delta was going to begin competing in the market could only have been in 1967. This was the year in which the scheme must have been planned. During 1967, 7 hours of ABC programs were carried in prime time by Southern. In furtherance of this plan which was meant to drive Delta out of Meridian by denying ABC program hours to it, Southern only increased its total number of ABC hours.8 hour per week. This figure is.3 hour per week less than Southern scheduled before Delta ever came on the scene.\n\nThe concomitant of this ABC increase was to have been an NBC decrease, and yet the proof shows only one NBC program was cancelled. Not only is this an insubstantial decrease, the scheme would only make sense if WDAM was to keep Delta from being able to use NBC programs. Summary judgment will not countenance the resolution of the factual issue as to whether WDAM actually pressured NBC not to allow Delta to use NBC programs. Therefore, it will be assumed that WDAM did exert such pressure. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\" Notwithstanding such assumption, the efforts of the alleged schemers were a complete failure because in September 1968, only 2 months after Delta went onto the air and coinciding with the beginning of the new television season, Delta received 7 hours of NBC programming.\n\nDelta gives us no clue as to whether it contends the scheme ended with this decision by NBC to allow programs or whether it continued. If it stopped here, which seems reasonable in light of the breakdown in keeping NBC programs away from Delta, all that occurred is a.8-hour-per-week increase in ABC programs by Southern and a one-program-per-week decrease in NBC programs, accompanied by a withholding of NBC programs from Delta for only 2 months until the new television season started. In other words, the result of the scheme under this assumption was that Southern was broadcasting in prime time.8 hour of ABC programming more than it would have had the conspiracy not taken place, but.3 hour less than it would have in 1966 before any conspiracy against Delta could have existed. These insignificant changes do not create a reasonable inference of anticompetitive activity. The only reasonable inference is that since NBC cancelled a 1 hour program Southern was broadcasting, Southern replaced it with.8 hour of ABC programming.\n\nIf Delta intends to claim the above conspiracy did not stop with its September 1968 breakdown, then its contention becomes even more tenuous. Southern, in furtherance of the alleged plan to completely eliminate Delta by preventing its reception of network programs and faced with NBC's allowance of seven programs to it, only took the retaliatory action of increasing its ABC programming during prime time.6 hour per week the following year. Again, the undisputed facts will not support an inference of anticompetitive actions.\n\nThe conspiracy must have ended in 1969 because Delta then received an NBC affiliation; however, this is the same year Southern increased its ABC programming during prime time by.3 hour per week. Had the previous increase been only to rob Delta of programs, after that action had clearly failed, it would only be reasonable for Southern to unload any really unwanted programs. But they did not. The ABC hours added by Southern during prime time are insufficient to give rise to any inference that Southern was adding them to keep Delta from having these programs.\n\nSince Southern broadcast some of the network prime-time offerings during other time slots, the true measure of the number of programs Delta was prevented from broadcasting must be found by examining the total prime-time network programs broadcast by Southern during any time slot. This examination likewise shows Delta's claim to be meritless.\n\nDuring the week of June 18-24 of 1967, Southern broadcast 9 1/2 hours of ABC prime-time programs and 5 hours of NBC prime-time programs, with its CBS affiliation accounting for the remainder. This week was close to the end of the 1966-67 television season (new seasons begin in the fall) and it can reasonably be assumed that these programs were scheduled prior to any knowledge of Delta's existence. During the week of November 5-11, 1967, Southern broadcast 13 ABC prime-time hours and only 2 NBC prime-time hours. Thus, after Southern learned of Delta's existence and in furtherance of its alleged scheme to deprive Delta of network programming, Southern increased ABC programming 3 1/2 hours and decreased NBC programming 3 hours per week. At the outset it is seriously questionable whether the existence of such a grand scheme can be inferred from so negligible an ABC increase and NBC decrease by Southern. However, since Delta is entitled to all reasonable inferences from the facts, it would be fairer not to rest a decision on this lack of substantiality.\n\nDelta's claim fatally falters because it has wholly failed to contradict the rational justification given by Southern for these changes. Of the five NBC programs shown in June of 1967, two were cancelled by the network and therefore could not be shown during the new 67-68 season. NBC would not approve Southern's request to show a third prime-time program because it was to be used in a nonprime-time slot. Since Southern was unable to show three of the five NBC programs it had shown the previous year, it was reasonable for it to replace these programs with any other good choices available. Southern did just that; it replaced the 3 hours of NBC programming no longer available to it with 3 hours of ABC prime-time programming. This leaves only a 1/2 hour ABC increase unexplained.\n\nIt is unreasonable to infer from these facts that the ABC increase in programs was due to a design to keep programs from Delta in an attempt to eliminate its competition. The only plausible inference from these facts is that Southern increased ABC programming to replace NBC programming not available to it. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\"\n\nDelta's alleged scheme really becomes unreasonable when network programming for the next season is examined. During the week of December 8-14 of 1968, Southern broadcast 11 ABC prime-time hours and 2 NBC prime-time hours. Comparing 1967 programming with 1968 would show that Southern made 2 more hours of ABC programming available to Delta. This scheduling is totally inconsistent with the alleged scheme.\n\nThe only reasonable inference from the undisputed facts is that Southern rearranged its network broadcasting yearly in an attempt to schedule the best available network programming. This application of sound business principles to scheduling is not an act in furtherance of a monopoly.\n\nThe other half of the alleged conspiracy was the NBC decrease of hours coupled with WDAM's actions to prevent NBC hours from appearing on Delta. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\" As previously stated, there exists a fact question as to whether WDAM actually influenced NBC not to allow NBC programs on Delta, and it is assumed that such pressure was exerted. \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\" However, except for the existence of one common director at Southern and WDAM, nothing was suggested to show that this pressure was in any way related to Southern's attempt to keep its monopoly position in the Meridian market. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\" Standing alone, the fact that the stations shared a common director is insufficient to raise any inference of improper action on the part of Southern. Had there been some demonstration of possible proof that Southern acted in furtherance of this scheme, then the assumed pressure by WDAM and the existence of the common director could raise a reasonable enough inference of improper action to require a trial. However, Delta alleged no other facts and the undisputed facts developed on the motions for summary judgment do not support the conclusion alleged.\n\nThis final consideration is pertinent. WDAM's motive was asserted to be to help Southern maintain its monopoly position because of the common director and stockholders' interest in both stations. The facts show that any alleged improper pressure on NBC not only came from WDAM, but also from WLBT in Jackson. These stations, NBC affiliates, overlapped 24% of Delta's signal area. Approximately 10% of Delta's audience had the choice of watching NBC programs on its station or on WDAM, and approximately 14% had the alternative of viewing NBC programs on Delta or on WLBT. This competition would obviously be calculated to decrease WDAM's and WLBT's audience and, if the encroachment was significant, might result in loss of income. WLBT was alleged to be just as strenuous as, if not more insistent than, WDAM in its objections to NBC programming by Delta. WLBT shared no common director with Southern. Reason, therefore, dictates it must have been acting only out of self-interest. If WLBT perceived limited competition to it from Delta as significant enough to justify these actions, it is most reasonable to assume that WDAM was not acting because of improper influence by a common director but also out of self-interest. This common sense corroboration buttresses the ultimate conclusion that Delta failed to show any genuine issue existed as to any factual matter which would warrant the inference that Southern improperly acted to further its position in the Meridian television broadcast market.\n\nii. Advertising\n\nDelta claims that although it sold large amounts of advertising to local business men, it encountered \"considerable adversity\" attributable to the \"overly competitive and highly successful tactics\" of Southern. Neither Delta's statement of position nor its employees when deposed in the course of discovery ever would point to any specific facts which might support this claim. The paper mountain of discovery shows that not a single time, place, person, or any fact was adduced to support an inference of anticompetitive action to hinder Delta's efforts to sell advertising.\n\nIn an attempt to respond to this nebulous claim, Southern presented affidavits of numerous Meridian businessmen who had dealt with either or both stations. Each said they were unaware of any action by Southern to prevent the sale of advertisements by Delta. Neither competition nor successful selling in a competitive market is violative of the antitrust laws. In the face of the best available fact-based denials of its existence, Delta's failure to show that any fact issue exists makes summary judgment proper.\n\nSouthern also attempts to explain away Delta's advertising problems on the dual basis of poor quality of broadcast signal and advertising salesmanship. Both facts are hotly disputed by Delta, but neither is relevant now. Delta's deficit was that it did not oppose summary judgment by demonstrating the existence of facts which would show its advertising problems were caused by Southern, not that they were not caused by a poor quality signal or poor salesmanship.\n\niii. Cable Television\n\nDelta originally alleged that it was treated unfairly by the cable television business in Meridian and this was traceable to Southern because of the existence of a common stockholder. The undisputed evidence shows the alleged common stockholder owns no interest in the cable television business in Meridian.\n\nLacking the common owner nexus or any other factual basis to tie the responsibility for the actions of the cable television to Southern, this allegation is also properly disposed of by summary judgment.\n\niv. Rating\n\nAs previous portions of this opinion have indicated, \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\" the critical factor in determining station compensation is the size of the station's audience. Delta asserts that Southern purposely influenced ARB, an independent rating bureau, to misrepresent the size of Delta's audience in an effort to prevent it from receiving a network station rate which was necessary for survival. The November, 1968 and February, 1969 regular ARB survey showed Delta's average prime-time audience to be 2,200 and 2,700 households respectively. In June, 1969 Delta received its NBC affiliation and was in dire financial need of a substantial network rate. According to NBC policy, Delta needed to show at least 6,000 average viewing households to receive the network's regular minimum rate. To determine whether it was making any progress, Delta commissioned a coincidental ARB telephone survey. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\" This survey taken July 27 -- August 2, 1969, showed Delta with a surprising 68% of the Meridian audience and Southern with only 16% of the area's viewers -- practically the reverse of all prior survey results for the two stations. Delta's immediate inquiries as to whether this survey was correct were affirmatively answered by ARB.\n\nSouthern, also being concerned about the relative market shares shown by the telephone survey, contacted ARB. Delta asserts Southern's officer, Wright, \"gave them hell\"; Wright claims he just expressed his concern. \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\" In addition, the proof shows Southern subsequently rescinded its subscription to the ARB service. Nowhere in the mass of discovery does the date of this decision to stop the ARB subscription and begin a Nielson subscription appear. Delta in its position paper and numerous briefs fails to specifically allege that the decision took place during a time relevant to this litigation. Delta does discuss the survey swap, however, in conjunction with this allegation. Absent specific allegations on the part of Delta that it took place as discussed in the text, this court is not bound by summary judgment standards to presume the existence of a possible factual question. However, since it does not change this court's opinion that summary judgment is proper, the fact is treated in its most damaging light to Southern.\n\nAssuming that the disputed facts were as Delta asserts, following the announcement of this coincidental survey, Southern sternly expressed displeasure with and withdrew its subscription from ARB. These are significant facts -- indeed the only significant facts -- for Delta's alleged inference of improper action which caused ARB to later misrepresent Delta's audience in the next regular survey rests entirely upon them.\n\nWeighing against any inference of improper action by Southern are three things. One, the telephone coincidental survey which was rescinded not only showed Delta with a large audience but also showed Southern with an abnormally small one, thus Southern's call to complain of this result is altogether indicative of normal self-preservation rather than of any design to harm Delta. Two, Delta does not contest that the results first announced could not have been right. Southern established that the correct results of the July-August telephone survey should have shown Southern with 62% and Delta with 18% of the Meridian audience. In view of the mix-up, ARB conducted another coincidental telephone survey from August 11-17, 1969. It showed Southern with 64% and Delta with 23% of the audience. This survey, immediately following Southern's alleged improper pressure, showed Delta with the largest percentage of the audience which it ever received by any survey. Three, immediately following the incorrect survey results and Southern's now alleged improper response, Delta's station manager wrote a letter \"expressing appreciation\" for the way Southern had handled the survey mix up and complimenting Southern on its \"ethical and honorable\" conduct.\n\nThe next regular survey in November, 1969 is crucial. It is the survey result which Delta claims was caused to be false or misleading by Southern's reaction to ARB's telephone survey error. In this regular November survey ARB showed Delta's audience to be less than 1,000 average homes. The next regular survey in February, 1970 showed 4,000 average households. Delta's exact claim is that the court should infer improper acts by Southern caused ARB to react by misrepresenting Delta's audience in November 1969, and that this survey announcement prevented it from receiving a network rate thus resulting in the station's demise.\n\nFor support, this allegation relies on the asserted berating call, the cancellation by Southern of its ARB subscription and the aberrantly lower showing for Delta in ARB's November 1969 audience survey. On the other hand, this cause and effect speculation is contradicted by the established fact that the asserted impropriety was followed by discovery that an error had been made and by an additional telephone survey, both of which showed the most favorable survey results Delta had ever received and by a contemporaneous letter from Delta's station manager which clearly discloses that Delta did not consider the acts of Southern improper.\n\nThese facts are so telling they negate any reasonableness to inferring that Southern's action in calling ARB caused a lower survey report. If any proof could be adduced which could show Southern \"managed\" ARB survey results to Delta's detriment or if any reasonable inference of such conduct could be deduced, summary judgment would of course be improper. Given only the alleged improper causal contact and the resulting November low survey upon which to build an inference of any improper action, Delta's own compliment and the intervening excellent survey so clearly render that inference untenable that the claim approaches the frivolous. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\"\n\nv. Dissuasion of Investment\n\nDelta claims that it initiated a search for badly needed new capital in late 1969 and early 1970 and that it attracted investors who eventually declined to participate. Delta asserts that this raises an inference of improper action on the part of Southern.\n\nDelta asserts no other facts in support of this claim. In an effort to respond to this nebulous assertion, Southern extracted during depositions the names of the 12 prospective investors. In subsequent affidavits these persons testified that no influence whatsoever was exerted upon them by Southern to hinder their investment in Delta and that they had each independently decided not to invest because the station was a poor investment risk or because of personal reasons.\n\nOn these undisputed facts summary judgment is clearly appropriate.\n\nvi. Summary\n\nDelta has failed to counter the well supported motions for summary judgment on this issue with any facts or reasonable inferences from facts which would support any claim of anticompetitive action on the part of Southern. Southern has not, therefore, been shown to have violated § 2 of the Sherman Act.\n\n4. Attempted Monopolization\n\nDelta alleges that each of the above sets of facts (1-3) shows that AT\u0026T, the networks, and Southern attempted to monopolize their respective markets. To make a case of attempted monopolization it is necessary to prove that there is a dangerous probability that the defendant will monopolize the market and that he has taken an action designed to bring about that monopoly. \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\"\n\nAs can be seen from the thorough examination of these facts above, Delta has failed to show any facts to support this allegation. While AT\u0026T occupies a regulated monopoly position in the television signal transportation market, it has taken no actions in furtherance of that monopoly. None of the networks have been shown to be perilously close to monopolizing their industry or to have taken any acts to bring about that monopoly. It is assumed for purposes of this opinion that Southern does monopolize the Meridian market, but they have taken no actions in furtherance thereof. Summary judgment on this issue, therefore, is also appropriate.\n\nD. Clayton Act and Robinson-Patman Act Claims\n\nDelta alleges that the networks and AT\u0026T violated 15 U.S.C. §§ 13(a) and 13a. Both of these allegations allege that the parties discriminated against Delta in the setting of prices and delivery of products.\n\n1. Clayton Act\n\nThe section 13(a) claim is a section 2 Clayton Act as amended by the Robinson-Patman Price Discrimination Act. The statute only relates to the sale of tangible commodities and not to services. \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\" The element of commerce involved between the networks and Delta was the purchase by the networks from stations of the service of delivering their program and national advertising packages. AT\u0026T also sold only the service of transporting the network signals. No sale or purchase of any tangible commodity is involved in this litigation. Therefore, this claim is proper for summary judgment.\n\n2. Robinson-Patman Act\n\nThe section 13a claim is a § 3 Robinson-Patman Act allegation. Claims under this statute may only be raised by the federal government. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\" Summary judgment, therefore, is proper.\n\nIV. OTHER CLAIMS\n\nDelta makes two sets of claims which do not sound in federal antitrust law. It alleges that all of the above facts and allegations are violative of Mississippi antitrust statutes and that the Federal Communications Act has been violated.\n\nA. Mississippi Antitrust Statute\n\nDelta has alleged that all of the violations claimed as breaches of the federal antitrust statutes also constitute wrongs under Miss.Code Ann. §§ 75-21-3, 75-21-9. There is no showing that judicial economy, fairness, or convenience to the litigants will be served if this court should now proceed to resolve such pendent state claims. In the exercise of its discretion, the court, therefore dismisses all such claims without prejudice. United Mine Workers v. Gibbs, 383 U.S. 715, 86 S. Ct. 1130, 16 L. Ed. 2d 218 (1966); Scranton Construction Co. v. Litton Industries Leasing Corp., 494 F.2d 778, 783 (5th Cir. 1974), cert. denied, 419 U.S. 1105, 95 S. Ct. 774, 42 L. Ed. 2d 800 (1975).\n\nB. Communications Act Claims\n\nDelta alleges two violations under the Communications Act, 47 U.S.C. §§ 201-09: (1) the tariff structure applicable to AT\u0026T required Delta to pay unreasonable and discriminatory tariffs in order to receive long-lines service \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\" and (2) AT\u0026T illegally refused to provide ETV service \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\" to Delta when it was requested. Any decision regarding these two claims would require the resolution of disputed factual issues which make summary judgment improper. More significantly, their resolution also calls for decisions of a bundle of legal issues which are so interwoven with regulatory expertise as to place those matters clearly within the primary jurisdiction of the FCC. For this latter reason the claims asserted by Delta under the Communication Act are dismissed by this court.\n\nTo resolve Delta's Communications Act claims it will be necessary to decide, among other issues, the following: (1) the validity of the occasional-use v. regular-use tariff structure as applied to Delta; (2) whether damages are available if the tariff is found unlawful; (3) if applicable, the legal standard for determining those damages; (4) whether adequate facilities were available to create a duty upon AT\u0026T to furnish ETV service to Delta; and (5) the breadth of the definition of \"same service\" in the applicable statute of limitations.\n\nProfessor Davis asserts in his treatise on administrative law that the major consideration in determining whether primary jurisdiction exists in an agency is whether the issues will affect the \"need for orderly and sensible coordination of the work of agencies and of courts.\" 3 Davis, Administrative Law Treatise, § 19.01, p. 5 (1958). Each of the above issues go to the heart of coordination between the administrative and judicial bodies vested with statutory jurisdiction over such cases in this alloyed sphere of the law. In addition, each issue is one which may more properly be resolved through the use of the FCC's administrative expertise and its discretion. The agency charged with interpreting and enforcing both the law and the policy of the Communications Act must be given the first opportunity to resolve such of these issues as must be decided.\n\n1. Discriminatory and Unreasonable Tariffs\n\nDelta asserts that Hughes' Sports Network, Inc. v. AT\u0026T, 25 FCC2d 550 (1970) held unlawful the very tariff structure involved here because it requires significantly higher payments for occasional or nonconsecutive use of long-lines services than it provides for 8 or more consecutive hours per day, per month. Delta claims, therefore, it is entitled to recover damages for having paid an unlawful tariff. In making this claim, however, Delta has assumed too much.\n\nHughes Sports Network held the tariffs unlawful as they were applied to Hughes. The same result does not necessarily follow for Delta. Hughes, on the average, used only 3 hours of service per day out of the 8-10 hours for which it contracted. Delta used much more time, but now contends it would not have used as much time if the tariff structure had been such that it reasonably and nondiscriminatorily could have contracted only for the hours of service it needed. This creates two possible distinctions between Hughes' situation and the instant alleged illegality: (1) Hughes used significantly fewer hours of longlines service than was used by Delta, and (2) Delta alleges that it would not have used as much time as it did if it had been afforded a reasonable nondiscriminatory alternative, whereas Hughes established that it did not use any more of the contracted time than it needed and left unused at least 5/8ths of the time for which it contracted. If these be distinctions which make a difference, they do not change our resolve of primary FCC jurisdiction because the resolution of whether they make the unreasonable and discriminatory tariff finding of Hughes inapplicable to Delta's situation is the matter this court holds properly to fall within the expertise of the FCC. See Carter v. AT\u0026T, 365 F.2d 486 (5th Cir. 1966). This is precisely the sort of issue concerning the validity of tariffs which the court's pretrial order construed to be within the FCC's primary jurisdiction and barred from adjudication in this law suit. \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e\"\n\nIf Delta were to prove the tariffs unreasonable and/or discriminatory as they are applied to it, there remains the issue of damages. The Commission struggled with this issue in Hughes' Sports Network. The Commission Review Board first held Hughes not entitled to damages because it had failed to carry the burden of proving actual injury. 25 FCC2d at 550. The full Commission then reversed, holding that the initial ruling applied an incorrect legal standard for damage computation and that damages should be the difference between the amount Hughes paid for its 8 or 10 hour contract service and what a reasonable tariff charge would have been for the actual time used. 34 FCC2d at 691; 38 FCC2d at 1052. The Commission also held that it would presume that the reasonable charge which should have existed was equal to the appropriate proportion of the regular contract rate (i.e. if Hughes only used 3 hours of time and was forced to contract because of the unreasonable tariffs for 8-hour service, the reasonable charge should have been 3/8ths of the 8-hour contract rate) unless AT\u0026T could prove otherwise. Before AT\u0026T was able to attempt to meet this burden, the issue apparently was in some extrajudicial manner resolved because the appeal of the FCC's final order to the Second Circuit was eventually dismissed as moot. \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\"\n\nWhether damages would be available to Delta, the appropriate legal standard for computing these damages, the assignment of the burden of proving what tariff structure would have been reasonable, and the amount of evidence necessary to fulfill that burden are all complex legal issues variegated with factual determinations. The FCC, in varying degrees, has previously grappled with these exact questions without reaching a final determination. The Commission did recognize that Hughes Sports Network presented for the first time the issue of what result should obtain when a tariff was declared unlawful in an action initiated by a private customer. 34 FCC2d 691, 692. Today's case appears to present issues similar to, but perhaps even beyond those dealt with in Hughes Sports Network. The efficient administration of the statutory scheme and the need for application of the collective knowledge already acquired by the Commission indicate primary jurisdiction of this case must rest with the FCC.\n\n2. ETV Service\n\nDelta claims it requested and was denied ETV service in violation of AT\u0026T's statutory duty under 47 U.S.C. § 201 to provide such service. AT\u0026T not only responds that it did not deny such service, but also that it was under no duty to provide it. AT\u0026T's statutory duty to provide ETV service exists only when facilities to furnish and receive that service are available. AT\u0026T claims that at the time of Delta's asserted request ETV facilities were not available. AT\u0026T further contends that the request which Delta alleges it made was only for temporary ETV service until Delta was able to build its microwave transmitting unit and was not the type of request which provided sufficient prospective revenues to justify acquisition of adequate facilities. If it is determined that Delta requested and was refused ETV service, whether adequate facilities were or should have been made available is another question which clearly demands an exercise of agency know-how by the FCC.\n\n3. Statute of Limitations\n\nAT\u0026T asserts as a defense that both Communications Act claims that are discussed above are barred by the statute of limitations. 47 U.S.C. § 415. On its face, the statute has run on these claims. The dispute revolves around the interpretation of an extending clause which provides that actions can be initiated within 90 days of the carrier's collection of the charges or of the institution by it of an action to collect other charges for the \"same service.\" 47 U.S.C. § 415(d). Delta's claims for recovery based on unlawful long-lines tariffs and refusal to provide ETV service were instituted within 90 days of AT\u0026T's suit to recover charges for local-loop and station-connection charges. Delta's claims are within the extension period, therefore, if \"same service\" refers to the delivery of television audio and visual signals. On the other hand, if \"same service\" should be interpreted to mean that local-loop or station-connection charges do not involve the \"same service\" as ETV service or long-lines charges, then Delta is time-barred from raising these issues. The definition of \"same service\" could determine the outcome of both claims. The issue appears to be undecided. The impact of this definitional interpretation will obviously extend beyond Delta's claims. In fact this resolution also goes to the very policy underpinnings of the Communications Act. The FCC has never discussed it. It should be decided in the first instance by the Commission.\n\nV. CONCLUSION\n\nSummary judgment as to all federal antitrust actions is proper and must be granted in favor of AT\u0026T, ABC, CBS, NBC and Southern. The resolution of the pendent state antitrust claims against the same parties is within the discretion of this court and they, therefore, are dismissed without prejudice. The Communications Act claims against AT\u0026T are within the primary jurisdiction of the FCC and are also dismissed without prejudice.\n\nThe only defense asserted by Delta to AT\u0026T's original claim was the existence of these counterclaims. Although, fully cognizant of the possibility that the state antitrust and the Communications Act claims may be raised again in other forums, summary judgment in favor of AT\u0026T against Delta for the 19,524.31 dollars covering services rendered by AT\u0026T is proper in this proceeding.\n\n\u003cspan class=\"fn\"\u003e1. There are three types of services provided by AT\u0026T which are relevant to this litigation: Interexchange-channel service (IXC) or longlines service connects telephone company central offices in different exchanges; local channels connect the telephone company central office with a customers studio transmitter; and station connections cover the service elements associated with connecting a local channel to an interexchange channel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Poston v. Caraker, 378 F.2d 439 (5th Cir. 1967) approved the use of a similar procedure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The All-Channel Receiving Act, 47 U.S.C. §§ 303(s), 330.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. When the station finally began operating in June of 1968, it broadcast a full day instead of the suggested limited day; it employed more personnel at higher salaries than recommended; and it decided, contrary to the report's suggestion, to engage in expensive local live programming.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See note 1 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The microwave transmitter allowed Delta to pick up a network signal in Jackson and beam it to its station in Meridian. This eliminated the need for AT\u0026T long-lines service. Delta was still required to pay AT\u0026T charges for local-channel service to transport the signal from the AT\u0026T switchboard to Delta's microwave transmitter, both located in Jackson, and station-connection charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Central Television, Inc., (the assignee of Delta's license and presently the operator of WHTV as a satellite station) stated in its application to the FCC for Delta's license that Meridian \"is presently unable to sustain two viable full time television stations.\" Although, the application was signed under penalty of federal law for false statements by F. Carrington Weems as President of Delta, Weems denies having read the statement before he signed it. Because of this denial, the statement is not considered an admission on Weems' part for purposes of summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. For a general discussion see Federal Broadcasting System v. ABC, 167 F.2d 349 (2d Cir. 1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The importance of predicted audience was known to Delta at the outset. The report which was commissioned by Walker opened with the statement that \"stations must be judged in terms of circulation provided to the advertiser.\" In addition, this same report warned that the new station's audience would probably not attract a network with which to affiliate for the first 12 to 18 months. The report's affiliation warning proved accurate: Delta went on the air in June of 1968 and the NBC affiliation became effective July 1, 1969.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The results of the regular ARB surveys attached as exhibits to affidavits in this action show the stations' relative market shares in terms of an estimate of the average number of television households viewing each station. The results of the telephone coincidental surveys attached as exhibits to affidavits filed in this action, however, show the relative market shares in terms of the average percentage of television households viewing each station.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. First National Bank v. Cities Service Co., 391 U.S. 253, 285, 88 S. Ct. 1575, 1591, 20 L. Ed. 2d 569 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See, e.g., id; Modern Home Inst., Inc. v. Hartford Acc. \u0026 Ind. Co., 513 F.2d 102 (2d Cir. 1975); Scranton v. Litton Industries Leasing Corp., 494 F.2d 778 (5th Cir. 1974), cert. denied, 419 U.S. 1105, 95 S. Ct. 774, 42 L. Ed. 2d 800 (1975); Saenz v. University Interscholastic League, 487 F.2d 1026, 1028 (5th Cir. 1973); Golden v. Kentile Floors, Inc., 475 F.2d 288, 291 (5th Cir. 1973); Bushie v. Stenocord Corp., 460 F.2d 116 (9th Cir. 1972); Dahl, Inc. v. Roy Cooper Co., 448 F.2d 17 (9th Cir. 1971); Jones v. Borden Co., 430 F.2d 568, 574 (5th Cir. 1970); A\u0026M Stores, Inc. v. Hiram Walker, Inc., 427 F.2d 167, 168 (5th Cir. 1970); Tripoli Co. v. Wella Corp., 425 F.2d 932 (3d Cir.), cert. denied, 400 U.S. 831, 91 S. Ct. 62, 27 L. Ed. 2d 62 (1970); Daily Press, Inc. v. United Press Int'l, 412 F.2d 126 (6th Cir.), cert. denied, 396 U.S. 990, 90 S. Ct. 480, 24 L. Ed. 2d 453 (1969); McGuire v. CBS, 399 F.2d 902 (9th Cir. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Fed.R.Civ.P. 56(c); First Nat. Bank v. Cities Service Co., 391 U.S. 253, 285, 88 S. Ct. 1575, 1591, 20 L. Ed. 2d 569 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Delta relies on Associated Press v. United States, 326 U.S. 1, 65 S. Ct. 1416, 89 L. Ed. 2013 (1945), in making this claim. In Associated Press there was no question as to the existence of the agreement or conspiracy. This, of course, is where Delta's reliance misses the mark. Delta is unable to show any conspiracy in the instant case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Delta's monopolization claim against Southern is more fully discussed in Section III (C)(3) of the opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The FCC has subsequently dealt with the problem of new stations not receiving network programs in markets where all networks are not affiliated with local stations. The new FCC requirements make it much easier for a new station to receive network programming. 47 CFR § 73.658.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See, e.g., Interstate Circuit, Inc. v. United States, 306 U.S. 208, 59 S. Ct. 467, 83 L. Ed. 610 (1939); Six Twenty-nine Productions, Inc. v. Rollins Telecasting, Inc., 365 F.2d 478, 484 (5th Cir. 1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Standard Oil Co. v. United States, 221 U.S. 1, 31 S. Ct. 502, 55 L. Ed. 619 (1911).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. All of the major participants in the Delta venture (Walker, Weems, Ackerman, Britton, Japhet, C. Jones, Weiner, Sharp, Speir, Wilbourn) when deposed were unable to point to a single fact probative of conspiratorial activity on the part of the plaintiff and counterdefendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Theatre Enterprises, Inc. v. Paramount Film Distributing Corp., 346 U.S. 537, 74 S. Ct. 257, 98 L. Ed. 273 (1954); accord Joseph E. Seagram \u0026 Sons, Inc. v. Hawaiian Oke and Liquors Ltd., 416 F.2d 71, 85 (9th Cir. 1969), cert. denied, 396 U.S. 1062, 90 S. Ct. 752, 24 L. Ed. 2d 755 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Theatre Enterprises, Inc. v. Paramount Film Distributing Corp., 346 U.S. 537, 74 S. Ct. 257, 98 L. Ed. 273 (1954); ALB Theatre Corp. v. Loew's, Inc., 355 F.2d 495, 500 (7th Cir. 1966); Delaware Valley Marine Supply Co. v. American Tobacco Co., 297 F.2d 199, 203 (3d Cir. 1961), cert. denied, 369 U.S. 839, 82 S. Ct. 867, 7 L. Ed. 2d 843 (1962); Milgram v. Loew's, Inc., 192 F.2d 579, 583 (3d Cir. 1951), cert. denied, 343 U.S. 929, 72 S. Ct. 762, 96 L. Ed. 1339 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. A letter from Calvin Jones, the new station manager of Delta, dated January 2, 1969, to the vice president of station-relations of NBC, admitted that even this late, Delta's \"operating policy in Meridian is weighted in behalf of ABC.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. A letter from one of the Delta principals to NBC in April of 1970 stated: \"If WHTV survives in Meridian . . . it will be due in large part to the faith and assistance provided by NBC . . ..\" This is noted, not for the accuracy of the compliment, but to demonstrate the uncontradicted attitude of Delta's then management toward one network's activity now alleged to be conspiratorial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In 1969 CBS had 190 television station affiliates; of those, 26 were UHF. In 1970 ABC's UHF affiliates composed 20 percent of the total affiliates; by 1974 that percentage had risen to 27. In 1974 NBC had 43 UHF affiliates. Total UHF stations operating in 1974 were 195.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See, e.g., Theatre Enterprises, Inc. v. Paramount Film Distributing Corp., 346 U.S. 537, 74 S. Ct. 257, 98 L. Ed. 273 (1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See Section II of this opinion, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See note 21, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Standard Oil Co. v. United States, 221 U.S. 1, 31 S. Ct. 502, 55 L. Ed. 619 (1911).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In the final instance, Delta relies on an analogy drawn from Milgram v. Loew's, Inc., 192 F.2d 579 (3d Cir. 1951), cert. denied, 343 U.S. 929, 72 S. Ct. 762, 96 L. Ed. 1339 (1952), in an attempt to show that it is alleging sufficient parallel action to withstand summary judgment. But, in that very case, after holding that an antitrust violation existed, the court required that \"the distributor . . . give plaintiff an equal opportunity with the operators of conventional theaters to bid for pictures on first run.\" The court went on to say that the reason that parallel activity in Lowe's could be the basis for a finding of a conspiracy to restrain trade was that here we add that each distributor refuses to license features on first run to a drive-in even if the higher rental is offered. Each distributor has thus acted in apparent contradiction to his own self-interest. This strengthens considerably the inference of conspiracy . . .. Id. at 583 (emphasis added). The roles of the purchaser and seller in Lowe's are reversed from the case presented by Delta, but the lesson is the same. An inference of conspiracy or anticompetitive activity neither arises from a refusal to sell a product or service for less than it is worth nor from a refusal to buy a product or service for more than it is worth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Delta alleges that the second coincidental survey performed during the summer or fall of 1969 by ARB showed 6,000 average prime-time viewing homes. As discussed in Section I(B) of this opinion, supra, telephone coincidental surveys were treated by the industry as less reliable than regular surveys. No regular independent survey showed Delta over ABC's 7,000 or NBC's 6,000 average prime-time viewing homes minimum level for station compensation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In the research conducted by the networks, UHF conversion figures in the neighborhood of 30-40 percent were used. The report commissioned by Walker before the Delta venture was begun estimated a conversion figure of 30-35 percent. The 1970 United States Census reports show, depending on the market definition used, the UHF conversion percentage of total television homes to be between 27.8 and 35.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. There are considerations aside from audience level which enter into any independent business decision regarding affiliation. Affiliation carries certain costs including constant communications between the station and network -- visits by network representatives, regular monitoring and analysis of the station promotional assistance and, when justified by the station's audience, the station's hourly rate. In addition, a poorly run station also reflects badly upon the network since the network's logo is prominently displayed both by the station and in promotional campaigns. We note this not to suggest that such considerations were applied to Delta but to say that adherence to a minimum threshold for affiliation is business justified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See Federal Broadcasting System, Inc. v. ABC, 167 F.2d 349 (2d Cir. 1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The only allegation against the networks which CBS might not escape under Applebaum is the allegation that CBS and the other networks did not pay Delta an adequate station rate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See United States v. Crescent Amusement Co., 323 U.S. 173, 65 S. Ct. 254, 89 L. Ed. 160 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. ETV service is a type of television signal transporting service provided by AT\u0026T. It originally was only available to educational television stations but is now more broadly used. Its major advantage is that it is less expensive than regular service. Its major drawbacks are that no switching from one network to another is available, AT\u0026T does not monitor the signal to ensure there are no problems, and there is no auxiliary power source available in case of power failure. Most commercial stations, because of these disadvantages, opt for regular television signal transportation service.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. AT\u0026T v. Florida-Tex. Freight, Inc., 357 F. Supp. 977, 979 (S.D.Fla.), aff'd, 485 F.2d 1390 (5th Cir. 1973); accord, Compania Anonima Venezolana de Navegacion v. A. J. Perez Export Co., 303 F.2d 692, 696 n.12 (5th Cir.), cert. denied, 371 U.S. 942, 83 S. Ct. 321, 9 L. Ed. 2d 276 (1962); United States v. Associated Air Transport, Inc., 275 F.2d 827, 832-33 (5th Cir. 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See United States v. Crescent Amusement Co., 323 U.S. 173, 65 S. Ct. 254, 89 L. Ed. 160 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See AT\u0026T tariffs Nos. 155 and 160.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See section III(A)(1), supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See note 21, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Ever since the television tariff structure was established, the FCC has continually been involved in its investigation and examination. The tariffs became effective May 1, 1948. The FCC proceeding which originally examined these tariffs was docket No. 8963. That proceeding remained before the FCC until May 18, 1960 when the FCC finally terminated its investigation. The FCC adopted a policy of continuing surveillance and said that \"in the event the future developments make it desirable to investigate specific matters now encompassed herein\" the FCC would \"institute new proceedings regarding such matters.\" Hughes Sports Network, Inc. v. AT\u0026T, 25 FCC2d 560 (1970). Hughes Sports Network was an active participant in docket No. 8963 and the issue of discrimination in the occasional-use vs. regular-use tariff structure was before the FCC in that proceeding. While docket No. 8963 was before the FCC, a study commission was appointed by it to report on television networks. This report, the Barrow report, was begun in 1955 and concluded in 1957. Proceedings in docket No. 12782 were instituted in 1957 after the filing of the Barrow report. An additional study group was formed to report on television networks during this proceeding leading to the filing of the Bryant report on July 2, 1965 (an interim report was filed in 1960). Hughes filed its action assailing the tariff structure June 3, 1965. The Hearing Examiner and the FCC Review Board's affirmance ruled that the occasional-use vs. regular-use provisions of the tariff discriminated against Hughes. Hughes Sports Network, Inc. v. AT\u0026T, 25 FCC2d 550, 560 (1970). The full FCC reversed and remanded, but only on the previous holding that Hughes was not entitled to damages. 34 FCC2d at 691. This issue was appealed to the Second Circuit, Cause No. 73-1216, but prior to briefing agreement was reached between AT\u0026T and Hughes which disposed of the matter. This kind of open, continual, active examination of the tariff structure argues forcefully against any possibility that conspiratorial activity marked the establishment of the tariffs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. AT\u0026T's private line tariffs which cover telephone, telegraph, data transmission, document reproduction, and other communication services, all include the dual-point vs. multi-point \"dilemma.\" AT\u0026T asserts that it provides approximately 137,000 interexchange (long-lines) services to about 8,000 customers -- approximately 9,000 of these services to about 1,400 customers involve multi-point service. Multipoint service to ABC, CBS and NBC constitute less than 10% of the various private line services that AT\u0026T provides to all of its customers. These provisions (multi-point vs. dual-point) have been involved in private line service tariffs since at least 1934.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. E.g., Milgram v. Loew's, Inc., 192 F.2d 579 (3d Cir. 1951), cert. denied, 343 U.S. 929, 72 S. Ct. 762, 96 L. Ed. 1339 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. E.g., Milgram v. Loew's Inc., 192 F.2d 579 (3d Cir. 1951), cert. denied, 343 U.S. 929, 72 S. Ct. 762, 96 L. Ed. 1339 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. E.g., id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See section III(A)(1) of the opinion, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See note 42, supra, for a discussion of the FCC providings which examined television tariffs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. AT\u0026T v. Florida-Tex. Freight, Inc., 357 F. Supp. 977, 979 (S.D.Fla.), aff'd, 485 F.2d 1390 (5th Cir. 1973); accord, Compania Anonima Venezolana de Navegacion v. A. J. Perez Export Co., 303 F.2d 692, 696 n.12 (5th Cir.), cert. denied, 371 U.S. 942, 83 S. Ct. 321, 9 L. Ed. 2d 276 (1962); United States v. Associated Air Transport, Inc., 275 F.2d 827, 832-33 (5th Cir. 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Lamb Enterprises, Inc. v. Toledo Blade Co., 461 F.2d 506, 513 (6th Cir.), cert. denied, 409 U.S. 1001, 93 S. Ct. 325, 34 L. Ed. 2d 262 (1972); see Gordon v. New York Stock Exchange, Inc., 422 U.S. 659, 95 S. Ct. 2598, 45 L. Ed. 2d 463 (1975); United States v. National Association of Securities Dealers, Inc., 422 U.S. 694, 95 S. Ct. 2427, 45 L. Ed. 2d 486 (1975); cf. Jeffrey v. Southwestern Bell, 518 F.2d 1129, 1133 (5th Cir. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. First National Bank v. Cities Service Co., 391 U.S. 253, 88 S. Ct. 1575, 20 L. Ed. 2d 569 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. In the order of February 11, 1972, this court ruled: This issue came on to be heard on various motions filed by certain of the counter-defendants herein, and at the outset of the hearing, the Court raised on its own motion the question of the necessity of referring this case to the Federal Communications Commission (FCC) under the doctrine of primary jurisdiction, as enunciated in the case of Carter v. AT\u0026T (C.A. 5, Tex.), 365 F.2d 486 (1966). This issue had previously been raised by a motion filed by counter-defendant American Telephone and Telegraph Company (AT\u0026T) to the original Counterclaim filed herein by Delta Communications Corporation (Delta). Said Counterclaim was thereafter amended, and at a hearing held in this cause on January 14, 1972, counsel for Delta advised the Court that the Amended Counterclaim raised no issue as to the validity of AT\u0026T's interstate tariffs on file with the FCC, but raised issues only as to the application of said tariffs. The Court therefore treated the present hearing as an informal pretrial conference and discussed said question with counsel for Delta and AT\u0026T. Counsel for Delta again advised the Court that the Amended Counterclaim does not raise any issue as to the validity of said tariffs but that it does raise issues as to their applications. The Court therefore finds and adjudicates that it has been conclusively established that there is no issue involved in this case concerning the validity of said tariffs and that there is, therefore, no necessity for referring this case at this time to the FCC for preliminary determination of the validity of said tariffs, in accordance with the decision in Carter v. AT\u0026T. The Court further finds that it has jurisdiction to try the issues raised by the pleadings herein. (Emphasis added). This order of February 11, 1972, was reconfirmed by this court's orders of May 30, 1972, and March 1, 1973. Thus, in its order of March 1, 1973, this court ruled in paragraph 2(c): c. Without modifying or limiting any prior Orders of this Court, interrogation at such depositions concerning any claim or allegation of Delta Communications Corporation as to the tariffs of American Telephone and Telegraph Company shall be limited to the subject matter of any misapplication of such tariffs or application of them in a discriminatory manner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The best illustration is to accept momentarily the concession of appellants that the tariff is authoritatively held to be valid administratively for regulatory purposes, to which they add, but not valid for antitrust purposes. We can recognize, of course, that in this some time weird antitrust world, in which antitrust policies appear to have an overpowering influence in the running clash between supposedly coordinate executive agencies or departments of the same government, cf. California v. FPC, 1962, 369 U.S. 482, 82 S. Ct. 901, 8 L. Ed. 2d 54, it is possible for the Courts to hold finally that this result could occur. But that choice ought not to be made, the occasion for facing such a possibility ought not to be forced until it is inescapably necessary. The very difficulties inherent in that prospect demonstrate that. . . . If, as the law clearly permits, the monopolistic and antitrust implications of the practices compelled by the tariff were among the factors considered and evaluated by the FCC, a Court would be hard put in either contriving or thereafter verbalizing a concept which, in a sort of now-you-see-it, now-you-don't sleight of hand, would allow the tariff to be valid and yet invalid at one and the same time. Carter v. AT\u0026T, 365 F.2d 486, 495-96 (5th Cir. 1966), cert. denied, 385 U.S. 1008, 17 L. Ed. 2d 546, 87 S. Ct. 714 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Id. at 494.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Otter Tail Power Co. v. United States, 410 U.S. 366, 93 S. Ct. 1022, 35 L. Ed. 2d 359 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See, e. g., United States v. General Motors Corp., 384 U.S. 127, 86 S. Ct. 1321, 16 L. Ed. 2d 415 (1966); Klor's v. Broadway-Hale Stores, 359 U.S. 207, 79 S. Ct. 705, 3 L. Ed. 2d 741 (1959); Theatre Enterprises, Inc. v. Paramount Film Distributing Corp., 346 U.S. 537, 74 S. Ct. 257, 98 L. Ed. 273 (1954); Nelson Radio and Supply Co. v. Motorola, Inc., 200 F.2d 911 (1952), cert. denied, 345 U.S. 925, 73 S. Ct. 783, 97 L. Ed. 1356 (1953).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. See Stanton, The Demise of Traditional Antitrust Law Concepts, 44 Miss.L.J. 582 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. See section III(C)(2) of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. In Northern Pac. Ry. Co. v. United States, 356 U.S. 1 (1958), Court defined a tying arrangement as: \"an agreement by a party to sell one product but only on the condition that the buyer also purchases a different (or tied) product . . ..\" 356 U.S. at 5, 78 S. Ct. at 518. Sulmeyer v. Coca Cola Co., 515 F.2d 835, 844 (5th Cir. 1975), cert. denied, 424 U.S. 934 (1976), Fortner Enterprises, Inc. v. United States Steel Corp., 394 U.S. 495, 89 S. Ct. 1252, 22 L. Ed. 2d 495 1968); Driskill v. Dallas Cowboys Football Club, 498 F.2d 321 (5th Cir. 1974); Coniglio v. Highwood Services, Inc., 495 F.2d 1286, 1289 (2d Cir.), cert. denied, 419 U.S. 1022, 95 S. Ct. 498, 42 L. Ed. 2d 296, 43 U.S.L.W. 3295 (U.S. Nov. 19, 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. See section I(B) of this opinion, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. In Sulmeyer v. Coca Cola Co., 515 F.2d 835 (5th Cir. 1975), cert. denied, 424 U.S. 934, 96 S. Ct. 1148, 47 L. Ed. 2d 341 (197 6), The court had a similar situation. Competing soft drink bottlers alleged that Coca Cola was tying the sale of a new product to the provision of an advertising campaign for that product. In holding that this did not allege a tying violation the court stated: Coca Cola Company advertising purchases actually defrayed business expenses that the bottler might otherwise have incurred to effectively market Sprite in his area of operations. Id. at 845.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. See United States v. Addyston Pipe \u0026 Steel Co., 175 U.S. 211, 241-42, 20 S. Ct. 96, 107, 44 L. Ed. 136 (1899).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Several years ago WDAM in Hattiesburg made a conscious decision to compete in the overlapped territory by increasing its signal to the maximum allowed by the FCC. During Delta's existence WLBT aided Delta by allowing it to use a precontrol-room feed to acquire NBC programs being shown by WLBT, thus bypassing AT\u0026T local channel service charges. Neither WDAM's purposeful competition, nor certainly WLBT's aid, indicate predatory division of territory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. See United States v. Socony-Vacuum Oil Co., 310 U.S. 150, 60 S. Ct. 811, 84 L. Ed. 1129 (1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. See, Knuth v. Erie-Crawford Dairy Coop. Ass'n, 326 F. Supp. 48, 52-53 (W.D.Pa.1971); Fagan v. Sunbeam Lighting Co., 303 F. Supp. 356, 360-61 (S.D.Ill.1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. There was, however, evidence that during this period of time ABC had become very active throughout the nation in trying to \"steal\" affiliates from the other two networks by offering more advantageous rates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. See economic discussion in section I(B) of this opinion, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. This arrangement worked, in most instances, so that ABC paid delivery charges for ABC programs broadcast live by Southern.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. The term is discussed in Northern Natural Gas Co. v. FPC, 130 U.S.App.D.C. 220, 399 F.2d 953, 956-57 (1968), but it has not been used interchangeably with monopoly. See also United States v. E. I. DuPont De Nemours \u0026 Co., 118 F. Supp. 41, 49 (D.Del.1953). The activities of oligopolists are suspect because one of them might become a monopolist or attempt to monopolize the relevant market -- but oligopoly is not synonymous with monopoly for § 2 Sherman Act purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Judge Learned Hand once concluded \"it is doubtful whether sixty or sixty-four percent would be enough; and certainly thirty-three per cent is not.\" United States v. Aluminum Co., 148 F.2d 416, 424 (2d Cir. 1945) (dicta).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. See, e.g., Scranton Construction Co., Inc. v. Litton Industries Leasing Corp., 494 F.2d 778, 783 (5th Cir. 1974), cert. denied, 419 U.S. 1105, 95 S. Ct. 774, 42 L. Ed. 2d 800 (1975); Cliff Food Stores, Inc. v. Kroger, Inc., 417 F.2d 203 (5th Cir. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. Geographic and economic market data could properly be adduced at trial. The court assumes the possibility that Delta could show the relevant geographic and economic market which Southern monopolizes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. See Six Twenty-nine Productions, Inc. v. Rollins Telecasting, Inc., 365 F.2d 478 (5th Cir. 1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. United States v. Grinnell Corp., 384 U.S. 563, 570-71, 86 S. Ct. 1698, 1704, 16 L. Ed. 2d 778 (1966); Woods Exploration and Prod. Co. v. Aluminum Co., 438 F.2d 1286, 1304 (5th Cir. 1971), cert. denied, 404 U.S. 1047, 92 S. Ct. 701, 30 L. Ed. 2d 736 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. The latter group would ordinarily appear to be most relevant to Delta's claim because it would accurately reflect the number of prime-time programs Delta was unable to broadcast because Southern was preempting the best of all programming. Under the facts shown, however, the first group makes the strongest case for an increase in ABC programming by Southern.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Although summary judgment standards require the court to assume WDAM exerted the alleged pressure on NBC, that assumption does not require the inference that it did so in furtherance of a scheme to preserve Southern's Meridian monopoly. The inference is only required if it is the most plausible inference to be drawn from all the facts. See First Nat. Bank v. Cities Service Co., 391 U.S. 253, 88 S. Ct. 1575, 20 L. Ed. 2d 569 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. The fact that ABC usually paid AT\u0026T delivery charges for its programs to Southern while NBC did not accentuates this reasonableness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. In examining this assertion we note the following factors already reviewed: First, too few hours were involved in Southern's portion of the conspiracy to allow an inference that it actually existed; only three NBC programs were cancelled, two because NBC no longer produced them and one because NBC would not allow Southern to show it. Second, the effect of the asserted WDAM pressure was a failure; NBC gave Delta seven programs at the start of the new season and in less than a year it had granted Delta a first-call affiliation with the network.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. However, this court does not have to accept Delta's assumption concerning the alleged motive for the pressure, which was said to be to assist Southern in eliminating Delta as competition. See note 76, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. The common director was an officer, director and 11 1/2% stockholder of Southern and an officer, director and 43.75% stockholder in WDAM. He explicitly denied taking any part in this alleged scheme to preserve Southern's monopoly. That sworn denial was not contradicted by Delta, it only asserted that \"it may be inferred that WDAM's pressures on NBC were made at the behest of such [common] stockholder . . ..\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. See section I(B) of the opinion, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. See section I(B) of the opinion, supra, for a discussion of the differences in types of surveys. The telephone coincidental survey was treated as being inherently less reliable than the regular surveys.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. Wright denies under oath \"giving them hell.\" He contends that he was concerned about the effects this survey would have on advertising sales of both stations. The survey had been distributed to salesmen and was being used by Delta to sell ads. Wright says he stated that he wanted the survey corrected if it was wrong. We assume his remarks were most direct and demanding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. Perhaps the best illustration is to be found in Delta's own subsequent activity. After the November 1969 regular survey which showed Delta's audience to be less than 1,000, Delta had an attorney from Washington correspond with ARB objecting to Delta's poor showing. In Delta's next regular survey its audience was shown to be 4,000 average prime-time viewing households.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. See Walker Process Equip. Inc., v. Food Mac. \u0026 Chem. Corp., 382 U.S. 172, 86 S. Ct. 347, 15 L. Ed. 2d 247 (1965); American Tobacco Co. v. United States, 328 U.S. 781, 785, 66 S. Ct. 1125, 1127, 90 L. Ed. 1575 (1946); Swift \u0026 Co. v. United States, 196 U.S. 375, 396, 25 S. Ct. 276, 279, 49 L. Ed. 518 (1905).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Baum v. Investors Diversified Services, Inc., 409 F.2d 872 (7th Cir. 1969); Tri-State Broadcasting Co. v. UPI, 369 F.2d 268 (5th Cir. 1966); CBS v. Amana Refrigeration, Inc., 295 F.2d 375 (7th Cir. 1961), cert. denied, 369 U.S. 812, 82 S. Ct. 689, 7 L. Ed. 2d 612 (1962); Fleetway, Inc. v. Public Service Interstate Transp. Co., 72 F.2d 761, 763 (2d Cir. 1934), cert. denied, 293 U.S. 626, 55 S. Ct. 347, 79 L. Ed. 713 (1935).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Safeway Stores, Inc. v. Vance, 355 U.S. 389, 78 S. Ct. 358, 2 L. Ed. 2d 350 (1958); Nashville Milk Co. v. Carnation Company, 355 U.S. 373, 78 S. Ct. 352, 2 L. Ed. 2d 340 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. See note 1, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. See note 36, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. See note 52, supra, where the relevant pretrial orders are set out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Second Circuit Cause No. 73-1216.\u003c/span\u003e\n\n",
    "body_length": 158094,
    "citedas": [
      "408 F. Supp. 1075"
    ],
    "attorneys": "George H. Butler, Phineas Stevens, Lawrence J. Franck, Jackson, Mississippi, O. Winston Cameron, Meridian, Mississippi, J. G. Kilpatric, New York, New York, Guerry R. Thornton, Atlanta, Georgia, John P. Fons, New York, New York, for American Tel. \u0026 Tel. Co., a New York corporation, plaintiff and counterdefendant. , R. E. Wilbourn, T. K. Holyfield, Meridian, Mississippi, Rufus Creekmore, Jackson, Mississippi, John C. Dawson, Robbin R. Dawson, Houston, Texas, Thomas M. P. Christensen, Fairfax, Virginia, for Delta Communications Corp., a Mississippi corporation, defendant and counterclaimant. , Alex A. Alston, Jr., Jackson, Mississippi, James H. Kelley, James R. Loftis, III, Washington, District of Columbia, for American Broadcasting Companies, Inc. , Sherwood W. Wise, Thomas G. Lilly, Jackson, Mississippi, Timothy B. Dyk, James Robertson, Ronald J. Greene, Washington, District of Columbia, for CBS, Inc. , E. L. Brunini, William Timothy Jones, Jackson, Mississippi, David S. Hope, Philadelphia, Pennsylvania, for National Broadcasting Co., Inc. , Walter W. Eppes, Jr., Thomas Y. Minniece, Paul M. Neville, Meridian, Mississippi, for Southern Television Corp.",
    "category": [
      "124",
      "243",
      "252"
    ],
    "judges": "CLARK, Circuit Judge.",
    "citation_count": 0
  }
}
