{
  "id": "3c1pYWYBTlTomsSBAHuA",
  "document": {
    "title": "Washington v. J-R Distributors Inc.",
    "full_title": "THE STATE OF WASHINGTON v. J-R DISTRIBUTORS, INC., ET AL. . THE STATE OF WASHINGTON V. JESSE ALLEN COX . THE STATE OF WASHINGTON V. EUGENE ALLEN ROGOWAY . THE STATE OF WASHINGTON V. ARTHUR MONTGOMERY . THE STATE OF WASHINGTON V. THOMAS F. KELLY MICHAEL J. KRISTEK . THE STATE OF WASHINGTON V. SAMUEL KRAVITZ . THE STATE OF WASHINGTON V. ALBERT THOMAS DUANE . THE STATE OF WASHINGTON V. THOMAS F. KELLY . THE STATE OF WASHINGTON V. JAMES MICHAEL TIDYMAN",
    "jurisdiction": "Washington Supreme Court",
    "date": "1973-07-27T00:00:00.000Z",
    "docket": "Nos. 42371, 42372, 42373, 42374, 42375, 42376, 42377, 42385, 42429",
    "body": "Preface\n\nThe majority opinion was written and submitted to the members of the court in mid-April 1973. While it was still under consideration the United States Supreme Court handed down Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973); Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973) and Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973). Although the foregoing opinions of the United States Supreme Court have caused no change in the result reached herein, it has been necessary to reevaluate and revise certain language.\n\nStafford, J.\n\nThis opinion involves nine appeals consolidated under No. 42371. Eight of the appeals are from separate actions tried in King and Spokane Counties. Although there are numerous specific assignments of error in each case, they have been consolidated here because of a common constitutional attack upon RCW 9.68.010(1) and (2). In the ninth case the state appeals from the dismissal of a codefendant in one of the actions.\n\nThe large number of unique facts and resultant assignments of error do not lend themselves to a consolidated discussion of all issues. Thus, the cases will be discussed in three major divisions according to the legal and constitutional\n\nissues common to each. Division I is concerned with a dismissal of the state's case; Division II is concerned with the sale of obscene materials; and, Division III deals with the exhibition of films in a public theater.\n\nI\n\nDismissal of State's Case\n\nState v. Michael J. Kristek, No. 42375\n\nDefendant Michael Kristek and codefendant Thomas Kelly were charged in King County with two counts of selling obscene material. Each count is concerned with the sale of a magazine. The first involves the sale of \"Bedplay\" and the second a sale of \"E-Jac.\" Defendant Kristek was alleged to have aided and abetted in both.\n\nAt the conclusion of the state's case, Kristek moved to dismiss the action for lack of evidence. The trial court ordered the two counts against Kristek dismissed with prejudice because:\n\nthe state failed to present any evidence that the defendant . . . sold, or aided and abetted in selling, any magazines . . .\n\nThe state appeals.\n\n[1] The basic legal rule with which we are concerned is stated in State v. Zorich, 72 Wash. 2d 31, 34, 431 P.2d 584 (1967):\n\na challenge to the sufficiency of the evidence requires that the evidence be interpreted most strongly against the moving party and in the light most favorable to the opposing party, and whether the evidence is sufficient to submit the issue to the jury is a question of law for the court and no element of discretion is involved.\n\nThe central issue is whether, under the above rule, there was sufficient evidence that Kristek aided and abetted his codefendant in the sale of the two magazines.\n\nThe evidence most favorable to the state indicates that Kristek had been employed as a clerk and magazine wrapper at the Eros Book Store only a few days prior to arrest. His duties, however, had consisted solely of wrapping magazines\n\nin cellophane. The state concedes that codefendant Kelly was the store's manager as well as the clerk at the time of the incident here in question.\n\nOn July 13, 1971, Detective Gruber, an undercover officer, entered the store. After browsing a short time, he took \"Bedplay\" from a shelf and asked Kelly, who was standing behind the counter, whether he had an unwrapped copy to look at. Upon receiving a negative answer, Gruber replaced the magazine and continued to browse.\n\nShortly thereafter Kristek entered the room for the first time. He was seen conversing with Kelly at the counter. Although the discussion was not wholly intelligible, Gruber heard some mention of \"Bedplay\" and \"E-Jac\" and also heard Kristek tell Kelly something to the effect that they were all like the cover.\n\nUnlike the cover of \"Bedplay\", which depicted sexual activity, \"E-Jac's\" cover was a suggestive design. Gruber pointed to \"E-Jac\" and inquired generally of both Kelly and Kristek whether \"E-Jac's\" contents were like the cover. In answer to the general question, Kristek spoke to Gruber for the first time, replying \"No, they are like the cover on 'Bedplay.'\" At that point Gruber paid codefendant Kelly for \"Bedplay\", took the magazine from Kelly and left the premises.\n\nDetective Sanford, who had observed the transaction, introduced himself to Kelly and Kristek as a police officer. A short conversation ensued. During the conversation Gruber returned with \"Bedplay\" and asked Kelly and Kristek whether \"E-Jac\" was the same. Kristek said he didn't know. After Detective Sanford left, Mr. Gruber said, picking up \"E-Jac\", \"isn't this the one you said was really good before?\" Kristek acknowledged that it was, but the vice squad had been present and that he, Kristek, wasn't supposed to know what was inside the books. Gruber then purchased \"E-Jac\" from Kelly and left after a discussion with Kelly about other materials in the store.\n\nShortly thereafter Kelly and Kristek were arrested,\n\nKelly was charged with two counts of selling obscene materials and Kristek with aiding and abetting in such sales.\n\nAssuming the truth of the foregoing evidence, the state's action against Kristek was properly dismissed. There was insufficient evidence that he aided and abetted his codefendant in the sale of the two magazines.\n\n[2] In State v. Gladstone, 78 Wash. 2d 306, 312-13, 474 P.2d 274, 42 A.L.R.3d 1061 (1970), quoting from Johnson v. United States, 195 F.2d 673 (8th Cir. 1952), we set forth the prerequisites to liability as an aider and abettor as follows:\n\n[T]o find one guilty as a principal on the ground that he was an aider and abetter, it must be proven that he shared in the criminal intent of the principal and there must be a community of unlawful purpose at the time the act is committed. As the term \"aiding and abetting\" implies, it assumes some participation in the criminal act in furtherance of the common design, either before or at the time the criminal act is committed.\n\nIn short the word \"abet\" includes (1) knowledge of the perpetrator's wrongful purpose, and (2) encouragement, promotion or counsel of another in the commission of the criminal offense. State v. Hinkley, 52 Wash. 2d 415, 325 P.2d 889 (1958).\n\n[3] We find no such evidence or reasonable inference to be drawn therefrom in the facts before us. Although Kristek was employed by the bookstore, he was at the time merely a magazine wrapper; he was not a clerk. There is no evidence or reasonable inference to be drawn therefrom that he either sold, attempted to sell or assisted in delivery of the magazine during the transaction.\n\nAt best Kristek and Kelly were overheard mentioning \"Bedplay\" and \"E-Jac\" during a conversation. Kristek was heard to tell Kelly that the contents were similar to the cover. It must be recalled, however, that Detective Gruber only overheard isolated portions of an entire conversation. The record does not even disclose the instigator thereof.\n\nFinally, in answer to Detective Gruber's direct question,\n\nKristek indicated the contents of \"E-Jac\" were similar to the cover on \"Bedplay.\"\n\nOne does not aid and abet unless, in some way, he associates himself with the undertaking, participates in it as in something he desires to bring about, and seeks by his action to make it succeed. State v. Gladstone, supra; Nye \u0026 Nissen v. United States, 336 U.S. 613, 619, 93 L. Ed. 919, 69 S. Ct. 766 (1949). Mere knowledge or physical presence at the scene of a crime neither constitutes a crime nor will it support a charge of aiding and abetting a crime. State v. Gladstone, supra; State v. Dalton, 65 Wash. 663, 118 P. 829 (1911).\n\nThe trial court is affirmed.\n\nIn the cases that follow it will be necessary to describe generally the contents of the various magazines, books and films to determine whether they are legally \"obscene\" under the tripartite test of Roth v. United States, 354 U.S. 476, 489-90, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957), and Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973).\n\nNearly a decade after Roth the United States Supreme Court changed the Roth concept by articulating a new test of obscenity. A Book Named \"John Cleland's Memoirs of a Woman of Pleasure\" v. Attorney General of Massachusetts, 383 U.S. 413, 418, 16 L. Ed. 2d 1, 86 S. Ct. 975 (1966) (hereafter cited as Memoirs v. Massachusetts or Memoirs). In Memoirs a plurality held that three elements must coalesce.\n\nit must be established that (a) the dominant theme of the material taken as a whole appeals to a prurient interest in sex; (b) the material is patently offensive because it affronts contemporary community standards relating to the description or representation of sexual matters; and (c) the material is utterly without redeeming social value.\n\nWhile Roth presumed \"obscenity\" to be \"utterly without redeeming social value,\" Memoirs added a new requirement. To prove obscenity it became necessary to affirmatively establish that the material was \"utterly without redeeming social value.\" This, as pointed out in Miller, called\n\nupon the state to prove a negative which was nearly impossible under our criminal standards of proof.\n\n[4] Miller has rejected as unworkable the Memoirs test of \"utterly without redeeming social value.\" The new guidelines provided for the trier of fact are:\n\n(a) whether \"the average person, applying contemporary community standards\" would find that the work, taken as a whole, appeals to the prurient interest. . . . (b) whether the work depicts or describes, in a patently offensive way, sexual conduct specifically defined by the applicable state law; and (c) whether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value.\n\nMiller v. California, supra at 24.\n\nMiller has pointed out further that:\n\nIf a state law that regulates obscene material is thus limited, as written or [ authoritatively ] construed, the First Amendment values applicable to the States through the Fourteenth Amendment are adequately protected by the ultimate power of appellate courts to conduct an independent review of constitutional claims when necessary.\n\n(Italics ours.) Miller v. California, supra at 25.\n\n[5] The three elements of the test must coalesce before material may be proscribed as \"obscene\". If, however, it can be said that material falls within the ambit of the test, it is \"obscene\" and therefore does not come within constitutionally protected freedom of speech or press under the first and fourteenth amendments to the United States Constitution. Roth v. United States, supra; United States v. Reidel, 402 U.S. 351, 28 L. Ed. 2d 813, 91 S. Ct. 1410 (1971); Miller v. California, supra. On the other hand, if it falls outside the Roth-Miller standard it is not legally \"obscene\" and is entitled to protection of the First and Fourteenth Amendments even though it may be distasteful to some who view it. Roth v. United States, supra at 481-85; Miller v. California, supra.\n\nWe approach a description of the exhibits' contents with great reluctance. Nevertheless, it cannot be avoided if this\n\nopinion is to have any practical application. Our review of numerous cases has disclosed that a similar reluctance by other courts has led either to the use of vague generalities or to such a lack of specificity that it has been nearly impossible to apply existing cases to specific problems. The failure of courts to describe or discuss specifically those things that caused them to conclude that materials either were or were not \"obscene\" has virtually caused \"obscenity\" to be defined in terms of itself. Thus, as repugnant as it may be, we shall approach a description of the questioned materials with clarity of description in an attempt to avoid meaningless generalities.\n\nII\n\nSales Cases\n\nA. State v. Thomas F. Kelly -- No. 42385\n\nDefendant Thomas F. Kelly and codefendant Kristek were charged in King County with two counts of selling obscene material. The first count charged the sale of a magazine entitled \"Bedplay\" and the second the sale of a magazine entitled \"E-Jac.\" The charges against Kristek were dismssed at the end of the state's case (see Division I above). Kelly's motion for dismissal was denied and a jury found him guilty on both counts. He appeals.\n\nThere is evidence to support the following:\n\nAt the time defendant was hired as manager-clerk of the Eros Book Store his employer showed him around the establishment. As a result, he knew the store, magazines, books, and other merchandise were sexually oriented. Defendant noted that books and magazines were displayed both as to subject-matter and as to price. Generally prices varied from $2 to $10, with the most sexually explicit tending to be the most expensive. Defendant knew that \"Bedplay\" and \"E-Jac\" both sold for $10. He also knew there was a law against selling \"obscene\" magazines.\n\n\"Bedplay,\" the first magazine sold, contains 32 pages of color photographs. The front cover consists of the price, magazine title and a description of the contents as \"doubles\n\ntriples closeups come . . . all in this issue!\" It also shows a close-up of the genital area of an unclothed reclining male with his penis in a state of erection. The heads of two females repose on his stomach with, what appears to be, seminal fluid on the face of one. The reverse cover is an explicit photograph of an act of fellatio between an unclad male and female clothed in panties.\n\nThe interior photographs graphically depict unclothed males and females engaged in acts of masturbation, sexual intercourse, fellatio and cunnilingus. In several the acts are being performed by a male and either two or three females at once. In most cases the photographs accentuate the genital area.\n\nSixteen of the interior photographs have captions of an erotic nature, some of which have no apparent connection with the pictures. Defendant does not contend, however, that the minimal written material has any effect upon the First Amendment issue before us. Thus, we shall not discuss it.\n\n\"E-Jac,\" the second magazine sold, has a cover design which represents an ejaculating penis. The only written material contained therein is a copyright notice and two pages devoted to the advertising of sexually oriented books or magazines. The balance of \"E-Jac\" consists of 44 pages of color and black and white photographs. Each is a photograph of a penis together with what appears to be seminal fluid deposited on various areas of an unclothed female body, including the breasts, stomach, genitals, hands, face, and mouth. The act of fellatio is shown being committed under similar conditions. Graphic photographs of an unclad female using an artificial penis or dildo are also included.\n\nThe details of the two sales will not be repeated. They have been sufficiently related above in Division I, State v. Michael Kristek, No. 42375.\n\nDefendant has made ten assignments of error. He does not, however, argue the legal positions of each. There are numerous common points of law. Thus, in an effort to simplify the presentation, defendant has combined those assignments\n\nof error having common legal theories and has presented and argued each under the heading of a common legal issue.\n\nWe adopt the same format and shall discuss common legal issues rather than touch upon individual assignments of error.\n\n1. Error is assigned to the trial court's having permitted Dr. Richard Jarvis to testify about contemporary community standards regarding sexual matters.\n\nDefendant concedes Dr. Jarvis is a licensed medical doctor and a qualified specialist in psychiatry. Nevertheless, it is argued that he was not qualified to express an expert opinion that the materials in issue go beyond contemporary community standards. It is suggested that the doctor's survey of public opinion in the Everett-Seattle-Tacoma area, in which he interviewed over 100 people of various ages and backgrounds, was insufficient even though it was related to the attitude people maintained toward the display of sexual material and each interviewee's belief as to the public's attitude. It is also suggested that Dr. Jarvis is no more qualified than a layman. We do not agree.\n\nDr. Jarvis is experienced in the field of psychiatry and has held various teaching positions in that speciality. His experience includes the area of pornography. He has conducted a 5-year study of people's attitudes toward pornography. Furthermore, there is nothing to indicate that the survey was recently concocted merely for trial presentation.\n\n[6] Generally speaking, an expert is required to possess some special skill or knowledge going beyond that of the average person. Whether a witness has such special skill or knowledge and is properly qualified to express an opinion as an expert is within the sound discretion of the trial court. State v. Nelson, 72 Wash. 2d 269, 432 P.2d 857 (1967); State v. Tatum, 58 Wash. 2d 73, 360 P.2d 754 (1961). Clearly the trial court did not abuse its discretion.\n\n[7] Finally, as pointed out in Kaplan v. California, 413 U.S. 115,\n\n37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973), citing Miller v. California, supra, and Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973), the United State Supreme Court has rejected any constitutional need for \"expert\" testimony on behalf of the prosecution, or for any other ancillary evidence of obscenity, where, as here, the allegedly obscene materials have been placed in evidence. The materials are regarded as sufficient in themselves for the determination of the question.\n\n2. Error is assigned to the trial court's denial of defendant's motions to dismiss at the end of the state's case and at the end of all evidence. Similar error is assigned to its denial of defendant's motion in arrest of judgment or for new trial. All three assignments of error raise the same legal points, which shall now be discussed as a unit.\n\na. First, it is asserted that neither RCW 9.68.010(1) nor (2) prohibit a sale or exhibition of allegedly obscene material in any particular context or location. Rather, the statute prohibits the sale or exhibition of obscene material irrespective of to whom, the manner, where, or under what circumstances. Thus it is urged, guilt based upon a consideration of the context or location of the sale or exhibition of allegedly obscene materials is unconstitutional under Rabe v. Washington, 405 U.S. 313, 31 L. Ed. 2d 258, 92 S. Ct. 993 (1972).\n\nDefendant has incorrectly applied Rabe to the facts before us.\n\n[8] Rabe does not hold that a defendant's conduct or the manner of sale or exhibition may not be considered on the question of \"redeeming social value.\" Rather, it holds that when the context or manner in which a film is exhibited is made an essential element of the crime of exhibiting an obscene film, a defendant may not be convicted unless the statute gives him fair notice that the manner or location of display is a vital element of the offense. It must be noted that the holding was made in light of an earlier decision of this court in State v. Rabe, 79 Wash. 2d 254, 484 P.2d 917 (1971) (reversed in Rabe v. Washington, supra),\n\nwherein we held that although a film was obscene only under certain limited circumstances, the statute proscribed the obtrusive exhibition thereof at an improper place and time.\n\n[9, 10] Evidence of the setting in which allegedly obscene materials are purveyed, however, is relevant to the question of \"redeeming social value.\" Memoirs v. Massachusetts, 383 U.S. 413, 16 L. Ed. 2d 1, 86 S. Ct. 975 (1966); see also Ginzburg v. United States, 383 U.S. 463, 16 L. Ed. 2d 31, 86 S. Ct. 942 (1966). Although the Memoirs test of \"utterly without redeeming social value\" has been rejected, this is not to say that evidence of the setting in which allegedly obscene materials are purveyed is no longer relevant either to the question of \"redeeming social value\" or the now accepted standard of \"whether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value.\" Under either the rejected test or the one now adopted in Miller, an evidentiary inquiry into the manner of sale, exhibition or pandering is permitted to determine whether an asserted \"value\" is real or spurious. \"Fair warning\" does not require that a prospective defendant be informed in advance of every type of evidence which might be found probative in relation to a statutory crime. Further, the United States Supreme Court has commented favorably upon an evidentiary inquiry into circumstances surrounding the location of the sale or exhibition of allegedly obscene material. In Smith v. California, 361 U.S. 147, 4 L. Ed. 2d 205, 80 S. Ct. 215 (1959), the court struck down an obscenity ordinance that failed to make \"knowledge of contents\" a prerequisite to a determination of guilt. Nevertheless, it had this to say at page 154:\n\nEyewitness testimony of a bookseller's perusal of a book hardly need be a necessary element in proving his awareness of its contents. The circumstances may warrant the inference that he was aware of what a book contained, despite his denial.\n\n(Italics ours.)\n\nWe also note that in the instant case the trial court did\n\nnot give an instruction, excepted to by defendant, in which the jury was informed that the manner of sale or exhibition was significant or vital to the issue of obscenity vel non.\n\nb. Next it is asserted that RCW 9.68.010 is unconstitutional because the word \"obscene\" is not defined and thus is vague and overbroad. It is said that a man of ordinary understanding and intelligence could not divine the meaning of \"obscene\" because it is not self-defining. The argument is based principally upon a mistaken premise that Roth and its standard of obscenity are passe.\n\nTo the contrary, the import of Roth is not a thing of the past. Rather, it remains viable and basic to the recent holdings of the United States Supreme Court in Miller v. California, supra, Paris Adult Theatre I v. Slaton, supra and Kaplan v. California, supra. Further, it is important to note historically that United States v. Reidel, 402 U.S. 351, 28 L. Ed. 2d 813, 91 S. Ct. 1410 (1971), reaffirmed the vitality of Roth as follows, at page 354:\n\nRoth has not been overruled. It remains the law in this Court and governs this case. . . .\n\nStanley v. Georgia, 394 U. S. 557 (1969), compels no different result. . . . The Court [in Stanley ] made its point expressly: \" Roth and the cases following that decision are not impaired by today's holding. As we have said, the States retain broad power to regulate obscenity; that power simply does not extend to mere possession by the individual in the privacy of his own home.\" . . . Nothing in Stanley questioned the validity of Roth insofar as the distribution of obscene material was concerned.\n\n(Italics ours.)\n\n[11, 12] In Roth the United States Supreme Court considered carefully whether the word \"obscene\" is unconstitutionally vague and found that it was not. Accord, Mishkin v. New York, 383 U.S. 502, 16 L. Ed. 2d 56, 86 S. Ct. 958 (1966). According to Roth the only requirement is that the language convey a \"sufficiently definite warning as to the proscribed conduct when measured by common understanding\n\nand practices.\" Roth v. United States, 354 U.S. 476, 491, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957). See also State v. Oyen, 78 Wash. 2d 909, 480 P.2d 766 (1971) (judgment vacated and case remanded on other grounds, 408 U.S. 933 (1972)). We hold that the word \"obscene\", as used in RCW 9.68.010, is not unconstitutionally vague when considered within the light of the Roth-Miller test. According to the Roth-Miller test the scope of regulation is confined to works which depict or describe sexual conduct.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e A state offense must also be limited to works which, taken as a whole, appeal to the prurient interest in sex, portraying sexual conduct in a way that is patently offensive, and which taken as a whole does not have a serious literary, artistic, political, or scientific value.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e As thus authoritatively construed by this court, RCW 9.68.010 is sufficiently definite, when measured by common understanding and practice.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Photographs, pictures and drawings which portray\n\nin a patently offensive way sexual conduct such as ultimate sexual acts, normal or perverted, actual or simulated, or which depict acts of masturbation, fellatio, cunnilingus, lewd exhibition of the genitals and sexual relations between humans and animals are \"obscene\" if, taken as a whole, the subject matter does not have a serious literary, artistic, political, or scientific value. No such value has been demonstrated here.\n\nc. Next, defendant contends that RCW 9.68.010 is unconstitutionally overbroad when considered with the exemptions contained in RCW 9.68.015. It is said that since RCW 9.68.015 authorizes certain specified institutions to circulate materials otherwise proscribed as obscene by RCW 9.68.010, the material must have some modicum of social value. Thus, it is argued, if it has such value it may not be proscribed under Memoirs v. Massachusetts, supra. We do not agree.\n\n[13] First, the test of \"utterly without redeeming social value\" and its counterpart, the \"modicum of social value\" test, have been rejected by Miller and are no longer viable. Second, defendant's argument is a \"bootstrapping\" non sequitur. The fact that the legislature has authorized certain educationally oriented and supervised depositories, enumerated in RCW 9.68.015, to circulate materials proscribed by RCW 9.68.010 does not clothe otherwise obscene material with the status of serious literary, artistic, political or scientific value.\n\nMaterial shelved in one of the enumerated educationally oriented depositories, as an example of obscenity, is no less obscene by reason of the fact that it provides an example of that which is proscribed by law. Its value is not somehow vaguely elevated beyond obscenity merely because it may provide police officers or students with an example of material declared illegal by RCW 9.68.010.\n\nIt is clear that the legislature intended that RCW 9.68.015 does no more than exempt certain logical institutions from prosecution for the possession and circulation of material otherwise declared obscene.\n\nd. RCW 9.68.010 exempts from prosecution motion picture operators or projectionists employed to show obscene moving pictures, unless they have a financial interest in the place of employment or unless they exhibit the picture without the owner's permission. Not included within the exempted class are theater cashiers and employees of bookstores or newsstands. This, argues defendant, violates equal protection of the laws under the federal constitution and provides a class of citizens with immunities not authorized equally for all, and thus also violates article 1, section 12 of the state constitution.\n\n[14, 15] Defendant has presented an engaging argument, but we do not agree with it. We have held consistently that when a statutory classification is challenged, if any state of facts reasonably can be conceived that will sustain it, there is a presumption that such facts exist. Markham Advertising Co. v. State, 73 Wash. 2d 405, 439 P.2d 248 (1968), appeal dismissed, 393 U.S. 316 (1968); State v. Persinger, 62 Wash. 2d 362, 382 P.2d 497 (1963), cert. denied, 376 U.S. 187 (1963). We have held with equal consistency that the burden is upon one who challenges the classification of showing that it fails to rest upon any reasonable basis and is essentially arbitrary. Markham Advertising Co. v. State, supra; State v. Persinger, supra.\n\nThere are valid reasons for the classification. The following are by no means exclusive: (1) Book and magazine stores offer a wide range of materials from which both the customer and clerk may select at the time of sale. Each has an opportunity to choose that which will be sold or purchased. On the other hand, motion pictures are shown one reel at a time and the projectionist must exhibit those selected by the manager. (2) Projectionists do not decide which films to exhibit and thus should not be obliged to make a judgment as to their obscenity. Furthermore, to\n\nrequire a projectionist to decide whether the showing of a particular film would be a crime might tend to \"chill\" the dissemination of borderline, but constitutionally protected motion pictures.\n\nAs just illustrated, valid reasons for the legislative classification are evident. On the other hand, defendant has failed to establish that the classification lacks a reasonable basis and thus is essentially arbitrary. We hold that the classification is both reasonable and constitutional.\n\ne. Defendant argues that RCW 9.68.010 has been superseded and impliedly repealed by RCW 9.68.050-.120. He points out that RCW 9.68.010 was last amended in Laws of 1969, ch. 92, § 1, p. 261, whereas RCW 9.68.120 was adopted subsequently in Laws of 1969, 1st Ex. Sess., ch. 256, §§ 13-20, p. 2393. This is said to indicate a legislative intent to repeal the earlier enactment by the more recent one, although both were enacted in 1969. Thus, defendant contends, RCW 9.68.050-.120 is the exclusive method of dealing with the exhibition of materials falling within its purview, including \"obscene\" material. We disagree.\n\n[16, 17] First, there is nothing in the legislation itself to indicate that RCW 9.68.050-.120 amends or repeals RCW 9.68.010. Second, repeal by implication is not favored. Before a legislative enactment will be found to have been impliedly repealed by a subsequent act, the later legislation must clearly be intended to supersede the prior act. Copeland Lumber Co. v. Wilkins, 75 Wash. 2d 940, 454 P.2d 821 (1969). Third, if there is to be an implied repeal, the implication must be clear and necessary and the two acts must be so inconsistent with and repugnant to each other that they are irreconcilable and cannot both be given effect. State v. Cross, 22 Wash. 2d 402, 156 P.2d 416 (1945); Copeland Lumber Co. v. Wilkins, supra. Such is not the case here.\n\nClearly, RCW 9.68.050-.120 evidences no legislative intent to impliedly repeal RCW 9.68.010. Different conduct, persons and categories of materials are covered in the two legislative enactments. RCW 9.68.050-.120 specifically applies only to minors whereas RCW 9.68.010 has general\n\napplication. RCW 9.68.050-.120 recognizes that there is a difference between materials which will appeal to a minor's prurient interest in sex and those which will have a similar appeal to adults (covered by RCW 9.68.010). Application of the later enactment is not broadened by use of the language \"the provisions of RCW 9.68.050 through 9.68.120 shall be exclusive.\" RCW 9.68.120. Such language means only that the definitions and procedures set forth in RCW 9.68.050-.120 are exclusive insofar as minors are concerned, and, that the state has preempted the field in the area of material defined as \"erotic\" to minors. Thus, there is no repeal by implication here.\n\nf. Defendant points out that the purveyor of material proscribed by RCW 9.68.010(1) and (2) must have \"knowledge of the contents thereof.\" Based thereon he argues that the purveyor must not only have \"knowledge of the contents\" purveyed, but, in addition thereto, must also have a personal knowledge or belief that the subject matter of the contents is obscene. Defendant asserts that it would be possible for one to know the contents of a magazine or film without knowing that it was obscene and hence illegal.\n\nWe agree a defendant must have \"knowledge of the contents\" of that which he sells or exhibits before he can be found guilty of violating RCW 9.68.010(1), (2). It does not follow, however, that after having acquired that knowledge he must also form a subjective belief that the contents are obscene, before he can be found guilty of selling or exhibiting obscene materials.\n\n[18] The statute requires only that he have knowledge of the contents of that which he purveys. Whether the contents are obscene, and thus proscribed by RCW 9.68.010, must be resolved by resort to the Roth-Miller test. It may not, however, be resolved by the purveyor's subjective opinion on the issue of obscenity.\n\nDefendant argues that since RCW 9.68.010 does not exclude \"guilty knowledge\" or \"evil intent\", it must be read into the statute. He urges that the state not only must establish that defendant had \"knowledge of the contents\",\n\nbut that he personally believed the contents to be obscene. In support he quotes from State v. Turner, 78 Wash. 2d 276, 283, 474 P.2d 91, 41 A.L.R.3d 493 (1970):\n\nAccordingly, unless the statute expressly eliminates the element of intent or design or defines the kinds of offenses which, by their very nature, are classified judicially as mala prohibita, the ingredients of intent, design and purpose should be deemed indispensible to a proof of guilt.\n\nState v. Turner, supra, is inapposite. Turner dealt with a former statute which prohibited public mutilation and contempt of the flag. Laws of 1919, ch. 107, p. 259. As then written the enactment contained no language describing the mens rea required.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e However, RCW 9.68.010 provides that \"knowledge\" is a necessary element, thus escaping the defect at which Turner was aimed. Further, Turner does not stand for the proposition that beyond \"knowledge\" one must also possess some studied subjective belief in his wrongdoing.\n\nDefendant states that a statute which is a mala prohibita regulation of obscenity is unconstitutional, citing Smith v. California, 361 U.S. 147, 4 L. Ed. 2d 205, 80 S. Ct. 215 (1959). Thus, he argues, to be constitutional RCW 9.68.010 must define a crime malum in se. We do not agree with defendant's interpretation of Smith. Smith struck down a city ordinance which, unlike RCW 9.68.010, dispensed with \"any requirement of knowledge of the contents of the book.\" The Smith court was concerned that absent the required \"knowledge of contents\" a bookseller could be intimidated by his possible absolute criminal liability. This, it was said, would unconstitutionally impede the distribution of literature, both obscene and nonobscene. However, Smith did not pass upon the kind of mental element requisite to a constitutionally permissible prosecution or whether an honest mistake about the obscenity of the contents would be a defense. Smith v. California, supra at 154. In\n\nfact, contrary to defendant's assertion, Smith did not hold or suggest that a statute which is a mala prohibita regulation of obscenity is unconstitutional. In the case at hand it is not necessary for us to make the distinction and we do not do so.\n\nDefendant's argument on this portion of his broad assignment of error is not well taken.\n\ng. Next defendant contends that under RCW 9.68.010 proof of \"knowledge of the contents\" of allegedly obscene materials requires proof that a defendant had actual knowledge of the contents, as a whole. He contends that the state must at least prove that a defendant perused the contents of the questioned material or saw a significant portion of the challenged film. It is urged that proof a defendant was generally aware that the contents probably contained sexually explicit photographs is insufficient.\n\n[19] Defendant's position is without merit. Proof that a defendant had specific knowledge of the contents' obscenity, acquired by an actual perusal or viewing thereof, is not necessary to support a constitutional prosecution. General awareness that the contents are obscene is sufficient. It is for the trier of fact to determine, under all of the surrounding facts and circumstances, whether a defendant had knowledge that the materials were obscene. Smith v. California, supra at 154 carefully points out:\n\nEyewitness testimony of a bookseller's perusal of a book hardly need be a necessary element in proving his awareness of its contents. The circumstances may warrant the inference that he was aware of what a book contained, despite his denial.\n\n(Italics ours.)\n\nMishkin v. New York, 383 U.S. 502, 510-12, 16 L. Ed. 2d 56, 86 S. Ct. 958 (1966), also discusses the knowledge required to support a constitutional prosecution under a state obscenity statute:\n\nThe evidence of scienter in this record consists, in part, of appellant's instructions to his artists and writers; his efforts to disguise his role in the enterprise . . . the\n\ntransparency of the character of the material in question, highlighted by the titles, covers, and illustrations; the massive number of obscene books appellant published . . . and possessed for sale; the repetitive quality of the sequences and formats of the books . . . This evidence amply shows that appellant was \"aware of the character of the material\" and that his activity was \"not innocent but calculated purveyance of filth.\"\n\n(Italics ours.) Consistent with the above is People v. Finkelstein, 9 N.Y.2d 342, 174 N.E.2d 470 (1961) quoted in Mishkin at page 510:\n\n\"A reading of the statute [§ 1141] as a whole clearly indicates that only those who are in some manner aware of the character of the material they attempt to distribute should be punished. It is not innocent but calculated purveyance of filth which is exorcised . . .\"\n\n(First italics ours.) In other words, proof of awareness of the contents of allegedly obscene books, magazines and films is legally sufficient to furnish proof of \"knowledge of the contents\" required under RCW 9.68.010.\n\nThought, knowledge or awareness cannot be ascertained absent some outward manifestation. The state of a man's mind must be inferred from what he says or does. In this way courts and juries pass upon knowledge and awareness every day having before them no more than the evidence of words and conduct from which, in ordinary human experience, mental condition, knowledge or awareness may be inferred. See 2 J. Wigmore, Evidence §§ 244, 265-67 (3d ed. 1940).\n\nRCW 9.01.010(4) is a statutory manifestation of the foregoing. It permits an inference of knowledge of a fact to be derived from knowledge of such other facts as should put an ordinarily prudent man upon inquiry. It does not require actual or specific knowledge that an act is unlawful. It is sufficient if one knows of facts that exist which constitute a crime.\n\nh. It is defendant's contention that the \"contemporary community standard\" referred to in the Roth-Memoirs test\n\nmeans a community composed of the entire United States. In essence he argues, in the discussion of this legal point, that a \"contemporary community standard\" based upon anything less than the nation as a whole is error. He leaves no room for consideration of any standard less than national, despite the size or area. We disagree with his position.\n\nMiller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973), holds specifically that there is nothing in the First Amendment which requires the trier of fact to consider hypothetical and unascertainable \"national standards\" when attempting to determine whether certain materials are obscene. Miller quite logically recognizes that:\n\nIt is neither realistic nor constitutionally sound to read the First Amendment as requiring that the people of Maine or Mississippi accept public depiction of conduct found tolerable in Las Vegas, or New York City.\n\nMiller v. California, supra at 32.\n\nWe agree with the dissent of former Chief Justice Warren in Jacobellis v. Ohio, 378 U.S. 184, 200, 12 L. Ed. 2d 793, 84 S. Ct. 1676 (1964), quoted with approval in Miller v. California, supra at 32.\n\n\"It is my belief that when the Court said in Roth that obscenity is to be defined by reference to 'community standards,' it meant community standards -- not a national standard, as is sometimes argued. I believe that there is no provable 'national standard' . . .\n\n(Italics ours.)\n\n[20, 21] The position taken by Miller is both reasonable and rational. It provides the community with adequate latitude in which to function on the subject of obscenity. It recognizes that people in different states may vary in their tastes and attitudes, and this diversity should not be strangled by the absolutism of imposed uniformity. Standards of obscenity are not static. Rather, they change with the character of the community involved as well as with the time at which they are tested. There is nothing disturbing or unusual about applying a different standard based upon the\n\nstate in which the standard is considered. The primary concern with requiring a jury to apply the standard of \"'the average person, applying contemporary community standards'\" is to be certain that it will be judged by its impact on an average person, rather than on a particularly susceptible or sensitive person -- or a totally insensitive one. Miller v. California, supra at 33; Roth v. United States, 354 U.S. 476, 489, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957).\n\nThus, we hold that as used in Roth and Miller the \"contemporary community standard\" to be applied by the average person is the contemporary community standard of the state in which the question of obscenity is to be tested by the trier of fact.\n\n[22] In the instant case, as in all of the others consolidated with it on appeal, the allegedly \"obscene\" materials were admitted in evidence and available for consideration by the trier of fact. It is important to note that in each case the same exhibits were available to the members of this court on appeal and were, in fact, reviewed.\n\nInasmuch as the exhibits were before the court it was unnecessary to have expert testimony on the subject of \"obscenity.\" Hard-core pornography can and does speak for itself. Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973); Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973); accord, Roth v. United States, supra. As we said in one of the consolidated cases in Division II-C-State v. Cox and State v. Rogoway, § 2:\n\nNo amount of testimony by anthropologists, sociologists, psychiatrists, or psychologists could have added anything to the trial court's [or to this court's] ability to determine that the materials failed to comply with any contemporary community standards related to sexual matters.\n\nThe materials viewed by the triers of fact and by the members of this court are, in each of the consolidated cases hard-core pornography in every sense of the term and as that expression is more fully discussed in Division II-C-State v. Cox and State v. Rogoway, § 2. The materials go\n\nfar beyond the contemporary community standards of this state relating to sex whether one considers the view of the average man under the former Memoirs test or the current Roth-Miller test.\n\nOur own independent review of the materials leaves us with no question that they are an affront to the contemporary community standards of this state, in the area of sexual matters; that they appeal to the prurient interest of the average man; and that they go far beyond any customary limit of that which is deemed to be patently offensive in a sexual way.\n\ni. Defendant's next argument is based upon the now rejected Memoirs test that material was obscene only if it was \"utterly without redeeming social value\", if put to any conceivable use whatsoever. Using the test, rejected since his brief was written, defendant attempts to employ it as a springboard to establish that the questioned materials, in certain of the series of cases here involved, have a modicum of social value because defense witnesses have testified that certain of the materials have been used for therapeutic purposes by some undisclosed clinicians. Further it is said, on page 71 of defendant's brief, that Dr. Jarvis admitted that a few psychiatrists used sexually explicit items \"materially the same as this subject material for certain therapeutic purposes such as . . . demythologizing sexual attitudes . . .\"\n\nFirst, a review of the relevant statements of fact, with which we are concerned in this series of cases, reveals that defendant has attributed too much to the doctor's testimony. Dr. Jarvis did not admit that sexually explicit materials he discussed in general terms were the \"same as\" or \"materially the same as\" those involved in the several cases before us. In addition, defendant did not establish that any of the materials before us were used or are even usable in the manner defendant suggested. Thus, even under the rejected Memoirs test there is a fatal gap in defendant's logic. It does not follow that the specific exhibits herein have some modicum of redeeming social value merely because\n\ncertain unidentified and unspecified sexually explicit materials in general may have some modicum of redeeming social value.\n\nIt must be noted that contrary to the implication in defendant's brief, Dr. Jarvis testified generally that \"certain sexually explicit films are used for clinical purposes in some instances.\" He went on to explain, however, that he was not convinced of the technique and he was positive that the materials, about which he was testifying, could have no value in teaching medical students or in treating persons suffering from distortions of sexual impulse. In the other relevant statements of fact he testified similarly that in his opinion the materials had neither educational, therapeutic, scientific nor redeeming social value. While Dr. Jarvis did acknowledge that some psychiatrists might use sexually explicit materials (without naming or comparing the materials to those in this series of cases) he was careful to point out that he knew of none who used them and that he felt their use had no therapeutic value. Also, he classified the foregoing psychiatrists as those weighted heavily with the \"pornography type group.\"\n\nDr. Jarvis' emphatic refusal to recognize the value of any treatment that would use sexually explicit materials for therapeutic purposes plus other evidence that the specific materials herein were commercially exploited for their prurient appeal, to the exclusion of other value, if any, is important. It is relevant and clearly supportive of the fact that these specific materials are without redeeming social value and are not entitled to First Amendment protection even under the former Memoirs test. The fact that the defendant presented some testimony that the materials had some \"value\" did not require the trier of fact to accept or give weight thereto. The trier of fact has both the right and the duty to determine which witnesses are believable and to what extent.\n\nSecond, the same discussion of the relevant evidence affirmatively establishes that the materials herein, taken as a\n\nwhole, appeal to the prurient interest in sex, and lack the requisite serious literary, artistic, political, or scientific value imposed by the less stringent Miller test.\n\nFinally, it will be recalled that the materials in question were admitted as exhibits in the case. Once the allegedly obscene materials have been placed in evidence there is no constitutional need for expert testimony on behalf of the prosecution, or for any ancillary evidence of obscenity. The materials are sufficient in themselves to permit the trier of fact to resolve the question of obscenity. Paris Adult Theatre I v. Slaton, supra; Kaplan v. California, supra.\n\nDefendant's challenge is not well taken under either the former Memoirs test or the newly adopted test in Miller.\n\nj. Defendant argues that although the alleged obscene material was admitted in evidence it does not speak for itself on the question of obscenity. He argues that the state must present testimony in addition to the material to affirmatively establish the facts that would support a determination of obscenity. We do not agree.\n\nNothing will be gained by a detailed restatement of testimony and evidence before the trier of fact. It is sufficient to say that considering the totality of the record in the relevant cases there was ample evidence to meet even the former Roth-Memoirs test of obscenity relied on by defendant. More important, however, is the fact that under Miller v. California, supra, Paris Adult Theatre I v. Slaton, supra and Kaplan v. California, supra, there is no constitutional need for \"expert\" testimony on behalf of the prosecution, or for any other ancillary evidence of obscenity, once the allegedly obscene materials themselves are placed in evidence. The materials are sufficient in themselves for a determination of the question of obscenity.\n\nWe also call attention to our discussion of \"hard core pornography\" in this opinion. Division II-C-State v. Rogoway and State v. Cox, § 5. Nothing will be gained by repeating it here.\n\nOn the record in this case, the prosecution's evidence was sufficient to support defendant's conviction.\n\nk. Next defendant contends the materials involved herein are not obscene in the constitutional sense. It is argued that since Redrup v. New York, 386 U.S. 767, 18 L. Ed. 2d 515, 87 S. Ct. 1414 (1967), there has been no verbal definition of \"obscene\" acceptable to the United States Supreme Court. Defendant seems to argue that in light of Redrup the Roth test has been abolished. There being no adequate definition of \"obscenity,\" defendant says, he can be guilty of no crime. We do not agree.\n\nDefendant has disregarded the pronouncement of the United States Supreme Court in United States v. Reidel, 402 U.S. 351, 354, 28 L. Ed. 2d 813, 91 S. Ct. 1410 (1971). Reidel makes it abundantly clear that Roth \"remains the law in this Court.\" Thus, even under the Roth-Memoirs test, applicable at the time defendant's brief was written, there was a viable definition of \"obscenity.\"\n\nSubsequent to the writing of defendant's brief the United States Supreme Court rejected the Memoirs test and in Miller v. California, supra at 24, adopted a specific definition of obscenity together with basic guidelines for the trier of fact. We shall not restate them here, having set them out at length earlier in this opinion.\n\n3. Defendant assigns error to the court having instructed the jury that it was not necessary for the state to prove beyond a reasonable doubt that defendant knew the magazines were obscene, as long as the state proved he had knowledge of the contents of the magazines.\n\nThe assignment of error is not well taken. Defendant's argument and our rejection thereof have been fully covered in this opinion. See Division II-A-State v. Kelly, § 2-f. Nothing will be gained by repetition.\n\n4. Error is assigned to the trial court having instructed the jury using an adaptation of the Roth-Memoirs test defining obscenity.\n\nDefendant argues that although RCW 9.68.010 uses the term \"obscene\" it does not define the term. It is urged that\n\nthis renders the statute unconstitutional. We do not agree. Defendant's basic argument and our rejection thereof have been fully explored in this opinion, Division II-A-State v. Kelly, § 2-b. There is no need to repeat it.\n\nNext, defendant asserts that the Roth-Memoirs definition of \"obscenity\" is passe, having been relegated to obscurity by Redrup v. New York, supra. We have answered and rejected this argument previously. See Division II-A-State v. Kelly, §§ 2-b and 2-k. We will not repeat the subject matter.\n\n5. Error is assigned to the trial court's failure to give defendant's requested instructions 1, 2, and 3 and for having adjudged defendant guilty of counts 1 and 2. Inasmuch as the same argument is made supporting all four assignments of error we shall deal with them as a unit.\n\nBasically, it is argued that a defendant's \"good faith\" belief that questioned material is not obscene is a defense and it is error not to instruct the jury accordingly.\n\nDefendant's argument is presented as \"a corollary\" to that raised previously in this opinion, Division II-A-State v. Kelly, § 2-f. It is based primarily upon the earlier assertion that to convict one of a crime under RCW 9.68.010 the trier of fact must find that defendant knew or believed the subject material was obscene. Defendant's argument in this regard was rejected in Division II-A-State v. Kelly, § 2-f. There is no need to restate the matter. It is sufficient to say that we also reject the argument stated in corollary form.\n\n6. Finally, error is assigned because the trial court permitted Dr. Jarvis to opine that the material in question was utterly without redeeming social value. It is also contended that the evidence submitted on the subject of obscenity was insufficient. We do not agree.\n\nDefendant seems to assert that the state must furnish expert opinion in every field of endeavor, discipline, learning, calling or art to establish that questioned material utterly lacks redeeming social value. He has presented us with no cases so holding, and we are aware of none. Common sense, however, dictates that to so hold would have\n\nreduced the former Roth-Memoirs test to an absurdity. Further, such a limitation of expert opinion would have an adverse impact upon the present Roth-Miller test despite Miller's rejection of the \"utterly without redeeming social value\" test of Memoirs. Finally, the suggested limitation would run counter to the spirit of Paris Adult Theatre I v. Slaton, supra; Kaplan v. California, supra and Roth v. United States, 354 U.S. 476, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957), all of which hold generally that admitted materials speak for themselves on the subject of obscenity.\n\nWhether a witness possesses sufficient expertise to testify on a given subject is within the sound discretion of the trial court. Its determination will be disturbed only for manifest abuse of discretion. State v. Nelson, 72 Wash. 2d 269, 432 P.2d 857 (1967); State v. Tatum, 58 Wash. 2d 73, 360 P.2d 754 (1961).\n\n[23] Once a witness has been properly qualified in his field of expertise or experience and has been permitted to testify on the subject in question, it becomes the duty of the trier of fact to decide whether the opinion is worthy of belief and the weight to be given the opinion.\n\nWe have reviewed the relevant statements of fact in this series of cases as well as the case of State v. Kelly specifically. The qualifications of Dr. Jarvis and other evidence supportive of the trial court's actions are to be found in this opinion. Division II-State v. Kelly, §§ 1 and 2-i. We shall not repeat it. It is sufficient to say our review has convinced us that (a) the trial court did not abuse its discretion in admitting the testimony of Dr. Jarvis, and (b) testimony was sufficient to meet the former Roth-Memoirs test as well as the present, less stringent, Roth-Miller test.\n\nThe trial court is affirmed.\n\nB. State v. Arthur Montgomery -- No. 42374\n\nArthur Montgomery was charged in King County with two counts of selling obscene materials. One count charged the sale of the magazine \"Bedplay,\" the other the sale of a color motion picture film to be used off the premises. The\n\ntrial court found defendant guilty and sentenced him on both counts. He appeals.\n\nThere is evidence to support the following:\n\nDefendant is the proprietor of the Carcinogen Smoke Shop. On July 29, 1971, Detective Sanford of the Seattle Police Department went to the shop to purchase a magazine entitled \"Bedplay.\"\n\nDressed in plain clothes, Mr. Sanford browsed through the store. Failing to find the magazine displayed, he inquired of defendant whether he had \"Bedplay\" for sale. Defendant located it in a stack of other magazines and handed it to Mr. Sanford stating that he had had it on the shelf previously. Mr. Sanford paid $9.60 for \"Bedplay,\" and left the shop after some conversation.\n\nApproximately an hour later, Mr. Sanford returned to the shop and inquired about purchasing a film. Defendant told him they \"had lots of action and climaxed in the film.\" After looking at pictures on the covers of several film containers, Mr. Sanford paid defendant $40 and received the roll of color film that is the subject of count two.\n\nNothing will be gained by another description of \"Bedplay.\" It was adequately portrayed in Division II-A-State v. Kelly. The content of the film, however, must be considered to determine whether it is legally obscene.\n\nThe reel of 8-mm color film is contained in a cardboard container on the outside of which is affixed a color photograph of a nude male and female engaging in sexual activity. The enclosed moving picture shows a nude male and female engaging in fellatio, cunnilingus, fellatio and cunnilingus being committed at the same time, masturbation, sexual intercourse in various positions and ejaculation of what appears to be seminal fluid on a female body. During the course of the film there are numerous closeups of sexual organs. There is no sound, dialogue, or recognizable plot.\n\nThe record indicates that the shop sells tobacco and a wide scope of articles other than those dealing with sex. On the other hand, sex oriented magazines were located in a\n\nspecific area with covers showing nude couples or individuals. At the counter the management displayed various sexually related devices such as dildos, simulated sex organs, condoms with erotic devices on the tips, and other similar articles.\n\nDefendant does not deny the sale of \"Bedplay\" or the film. His principle defense seems to be that although he had offered the magazine for sale, he was preparing to return it to the publisher as a nonsalable item. Further, he asserts the film was a mere sample and, as with the magazine, he had not viewed the contents.\n\nThe trial court found defendant guilty as charged on both counts. Defendant's post-trial motions were denied and the trial court entered its findings of fact, conclusions of law, and judgment and sentence. Defendant appeals.\n\nDefendant makes 11 assignments of error. He has not, however, argued the legal position on each. Rather, his case has been presented in the same format as that used in this opinion, Division II-A-State v. Kelly. We have adopted the same format.\n\nInsofar as applicable, and as noted hereafter, defendant has made similar assignments of error and the same supporting arguments made in this opinion, Division II-A-State v. Kelly, §§ 1, 2-b, 2-c, 2-e, 2-f, 2-g, 2-h, 2-i, 2-j, 2-k, 4 and 6.\n\nIn the foregoing sections of Division II-A-State v. Kelly, we considered and rejected defendant's arguments. Nothing will be gained by repeating them.\n\nAll assignments of error having been considered and rejected, we affirm the trial court on both counts.\n\nC. State v. Jesse Allen Cox -- No. 42372\n\nState v. Eugene Allen Rogoway -- No. 42373\n\nJesse A. Cox was charged in King County with one count of selling obscene material and Eugene A. Rogoway was charged with two counts of the same crime. The two cases were consolidated for trial without a jury. The trial court found both defendants guilty as charged. Inasmuch as the\n\nissues on appeal are similar, their appeals have been consolidated.\n\nDefendant Rogoway owned Underground Arts, Unlimited, a bookstore located in Seattle. Defendant Cox was employed as his clerk. There is evidence to support the following:\n\nExhibits in evidence and the testimony of Detective Germann reveal that almost all items displayed in the bookstore section dealt with sex. One portion was devoted to unclad males, some with genitals exposed and in others they were embracing each other. Other sections were devoted to naked females in various poses with genitals exposed. Another section contained paperback books dealing with sex, some illustrated with photographs. In still another area were located magazines and books depicting males and females being beaten while tied with chains or ropes. Located inside the counter were sexually oriented items such as dildos, artificial vaginas, purported love potions and sexual stimulator devices.\n\nOn February 22, 1971, Detective Lamphere entered the bookstore. After looking through the books and magazines, Mr. Lamphere asked defendant Cox where the \"animal books\" were. He was directed to that portion of the store devoted to books which dealt with humans and animals. Officer Lamphere continued to browse through the store and finally selected the magazine \"Sexualia\" from the counter area behind which Mr. Cox was standing. The officer thumbed through \"Sexualia\" and while Mr. Cox looked on they talked briefly. Mr. Lamphere paid defendant Cox $7.50 for the magazine before leaving.\n\nOn February 25, 1971, Detective Habryle of the Seattle Police Department entered the store in plain clothes and browsed through the magazines. He selected a magazine from the center of the counter and asked defendant Rogoway whether he had others like it. After checking the stock behind the counter, Mr. Rogoway stated it was the last he had. Officer Habryle purchased it and another that was\n\nbeside it on the counter, paying $7.50 each for \"Color Party\" and \"Fucking Good Time.\"\n\nThe only printed material in \"Sexualia\" consists of the title on the cover with the word \"Colour-1,\" some publication information on page two, minor advertising and a description of the magazine on the front and back covers. Otherwise the magazine contains 30 pages of color photographs, 28 of which show an unclad male and two or more unclothed females. Some of the pictures, by positioning, suggest sexual activity. Sixteen, however, vividly depict sexual intercourse, fellatio and masturbation among the male and the females. In each the picture accentuates the sexual organs.\n\n\"Color Party\" contains no printed material other than the title on the front cover and what appears to be an address on the back cover. The front cover is in color. Three of the four pictures thereon show very graphically two naked women and an unclad man engaged in sexual intercourse and fellatio. The back cover, also in color, shows a naked male and female with the woman committing fellatio. The magazine contains both black and white and color photographs. Although a few depict two females and a male fully or partially clad, most photographs are of nude persons engaged in sexual intercourse, fellatio, cunnilingus, and masturbation, with closeups of the sexual organs.\n\nThe magazine \"Fucking Good Time\" is in color. Some of the printed material describes the activities depicted, in vulgar language. Defendant Rogoway does not contend the printed material brings the contents of the magazine within the protection of the First Amendment. Thus, we do not reach that issue.\n\nThe front cover contains the magazine title, the price \"$15.00 U.S.A.\" marked down to $7.50, and the picture of a nude female about to engage in fellatio on a nude male. A similar picture and title appear on the reverse cover. The contents consist of 27 photographs of a nude male and female engaging in fellatio and cunnilingus, sometimes\n\nsimultaneously, and in sexual intercourse in several different positions. In each case the pictures are designed to accentuate the sexual organs.\n\nThe assignments of error in both appeals raise substantially the same issues. Thus, unless indicated to the contrary, the court's disposition of them will apply to the appeals of both defendants, Cox and Rogoway.\n\nDefendants have made 22 assignments of error which raise several basic legal issues. They have not argued the legal position on each. Rather, their case is presented in the same format as was State v. Kelly, see Division II-A-State v. Kelly. We will use the same format here.\n\nInsofar as applicable, and as noted hereafter, defendants have made similar assignments of error and the same supporting arguments made in this opinion Division II-A-State v. Kelly, §§ 1, 2-a, 2-b, 2-d, 2-e, 2-f, 2-g, 2-k, 4 and 5.\n\nIn the foregoing sections of Division II-A-State v. Kelly we considered and rejected defendants' arguments. Nothing will be gained by repeating the assignments of error, arguments or the court's reasons for rejecting them.\n\n[24] 1. Defendants argue that the findings of fact fail to support a judgment of guilty because no finding states that the materials in question are \"obscene\". Further, it is said there is insufficient evidence to meet the Roth-Memoirs tripartite standard.\n\nFirst, findings of fact 4, 5, and 6 in State v. Rogoway and findings of fact 3, 5, and 6 in State v. Cox are clearly based upon the former, more rigorous tripartite Roth-Memoirs standard and find that each of the three elements necessary to support an ultimate finding of \"obscenity\" exist as a factual matter. Thus, the findings of fact reach and fully support an ultimate determination that the materials are \"obscene\", even under the rejected Memoirs test, by setting forth \"obscenity\" in terms of the component parts. (See Rogoway conclusion of law 2 and Cox conclusion of law 2.)\n\n[25] Second, we have reviewed the record and find substantial evidence to support the above-mentioned findings\n\nof fact. They in turn, support the related conclusions of law.\n\nFinally, findings of fact and conclusions of law that are sufficient to support a determination that materials are \"obscene\" under the \"' utterly without redeeming social value'\" or \"modicum of social value\" test of Memoirs can hardly be said to fail the less strict test substituted by Miller v. California, 413 U.S. 15, 24, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973):\n\nwhether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value.\n\nWe hold that there is no error.\n\n2. With reference to the portrayal of sexual matters, the trial court sustained defendants' objection and did not permit the state to present expert testimony as to local contemporary community standards. Since there was no testimony that any particular standard existed, the trial court also excluded expert testimony that the materials in question affronted contemporary community standards. In this, defendants led the court into error. Whether the materials viewed by an \"average person\", applying \"contemporary community standards\", would be considered \"patently offensive\" or appealing to the \"prurient interest in sex\" are essentially questions of fact. Miller v. California, supra at 4929. Thus, the issue of local contemporary community standards was a proper subject for the state's inquiry. The state was permitted to provide the trial court with an offer of proof regarding Dr. Jarvis' testimony. In the offer of proof, Dr. Jarvis testified that in his opinion each of the three magazines was patently offensive in that it went beyond contemporary community standards relating to the display of sexual matter.\n\nAlthough the trial court incorrectly sustained defendants' objection, it ruled that despite the lack of testimony on the subject of contemporary community standards it could, as a matter of law, decide whether such standards had been affronted and whether a conviction would violate the defendants'\n\nconstitutional rights. Defendants assign error to the trial court's ruling in this regard.\n\nA review of the trial court's findings of fact makes it clear that its ruling was made in light of having viewed the three magazines which the court considered patently offensive because they affronted contemporary community standards relating to the description or representation of sexual matters. In addition, the trial court's oral opinion makes it abundantly clear that it concluded the material in the three magazines went far beyond \"obscenity\" as defined by the Roth-Memoirs test. The trial court commented as follows: \"one has a hard time conceiving how anything could be more hard core pornography.\" (Italics ours.)\n\n[26] We hold that the trial court committed no error in its ultimate determination that the three exhibits were \"obscene\" and not entitled to protection of the First Amendment. The materials viewed by the trial court, and by us, go far beyond any contemporary community standard relating to sex whether one considers the former Memoirs test or the current Roth-Miller test. The materials focus upon an interest in the sexually morbid, the grossly perverse and the sexually bizarre without a modicum of redeeming value; and, most certainly evidence no serious claim of literary, artistic, political, or scientific value for justification. The materials are no more than a debauchery and insult to the sexual faculty, depicting dirt, vileness and filth for its own sake. The \"obscenity\" portrayed is a blow to sense, not merely sensibility, the obvious main purpose of which is to stimulate an erotic response.\n\nThe materials here involved are \"hard core pornography\" in every sense of the expression. Having actually viewed the exhibits in question, the trial court committed no error by considering the subject of \"obscenity\" without additional expert testimony. Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973); Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973). Such \"hard core pornography\" can and does speak for itself on the question of obscenity, according to Paris Adult Theatre\n\nI v. Slaton, supra; Kaplan v. California, supra; and Roth v. United States, 354 U.S. 476, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957). See also United States v. Wild, 422 F.2d 34, 36 (2d Cir. 1969), cert. denied, 402 U.S. 986 (1971), rehearing denied, 403 U.S. 940 (1971); Kahm v. United States, 300 F.2d 78 (5th Cir. 1962); and Donnenberg v. State, 1 Md. App. 591, 232 A.2d 264 (1967). No amount of testimony by anthropologists, sociologists, psychiatrists, or psychologists could have added anything to the trial court's ability to determine that the materials failed to comply with any contemporary community standards related to sexual matters.\n\nOur own independent review of the materials has convinced us that they appeal to the prurient interest in sex and go far beyond the customary limits of that which is deemed to be patently offensive in a sexual way.\n\n3. It is asserted that the trial court erred in finding that almost all materials displayed on the premises appealed to a prurient interest in sex and that defendants exploited the materials for the sake of prurient interest.\n\nWe have reviewed the statement of facts and exhibits involved and conclude that the assignments of error are not well taken. There is substantial evidence to support each of the challenged findings. That is sufficient.\n\n[27] 4. Assignments of error 6, 10, 13, 16, 19 and 22 have not been argued specifically under any heading in defendants' brief, thus, although we have discussed them indirectly under other subheadings, it is unnecessary to discuss them specifically at this time. Assignments of error that are not argued in the brief are waived. State v. Boggs, 80 Wash. 2d 427, 495 P.2d 321 (1972); State v. Ozanne, 75 Wash. 2d 546, 452 P.2d 745 (1969).\n\nThe trial court is affirmed in both cases consolidated for trial.\n\nD. State v. J-R Distributors, Inc. \u0026 Howard C. Frank, No. 423271.\n\nJ-R Distributors, Inc., owner of the Spokane Magazine Center, and Howard Frank, a clerk at the center, were\n\ncharged in Spokane County with two counts of selling obscene publications. A trial court found them guilty as charged. They appeal.\n\nThere is evidence to support the following:\n\nOn December 14, 1970, Officer Smith of the Spokane Police Department went to the Spokane Magazine Center. He found the store divided into two sections, one of which was posted \"No one under 21\". Upon entering that section, Mr. Smith selected the magazine \"Answers\" and took it to defendant Frank who looked at a number on the cover and obtained a copy from a storage area.\n\nOfficer Smith asked Mr. Frank whether he had an opportunity to read all of the magazines. Mr. Frank replied, \"No, but I get to see all the pictures.\" Thereafter the officer paid Frank $5.25, took the magazine and departed.\n\nOn January 15, 1971, Detective Wynne of the Spokane Police Department entered the store, went to the \"over 21\" section and selected a book entitled \"Sex Between Humans and Animals\", Volume 2. He presented its number to Mr. Frank, and received a copy from stock after paying $4.75.\n\nDuring the transaction Officer Wynne asked Mr. Frank whether he had seen the pictures in the book. Mr. Frank replied that he had and proceeded to show the officer a catalog showing a female named the \"Pork Girl\" who, according to Mr. Frank, was becoming popular in Sweden.\n\nTo aid in the consideration of one of the assignments of error, both \"Answers\" and \"Sex Between Humans and Animals\" are described hereafter. \"Answers\" contains 71 pages of written material as well as black and white and color photographs of men and women who are, for the most part, nude. The cover consists of the title, price, a photograph of a naked man and woman in an embrace, a partial list of contents and the statement: \"Educational Material For Adults Only -- Sale to minors prohibited.\"\n\n\"Answers\" begins with an editorial which states the publisher's policy on \"dealing frankly and accurately with such matters as pornography, oral sex and the law\". Its stated purpose is:\n\nto inform; to educate, to reawaken the known and forgotten; to inspire the unknown, the never learned; to illustrate and verbalize openly and with spirit . . .\n\nThe editorial policy is justified by pointing to publications authorized in Denmark, numerous publications accepted in the United States and the President's Commission on Pornography and Obscenity.\n\nThe editorial is accompanied by several black and white photographs of nude males and females committing fellatio and cunnilingus. These pictures are not reasonably and rationally related to the editorial and are not relevant to its theme. The editorial is a mere vehicle for the publication of the pictures.\n\nThe first article, entitled \"Young Girls and Sex\", discusses pitfalls that may await an uninformed young girl. The article contains nothing violative of the former Roth-Memoirs test or the present Roth-Miller test. Accompanying the article, however, is a black and white photograph of a nude boy and girl together with several photographs of the girl in various provocative poses. It is possible that these photographs might not be declared \"obscene\" under the holding of Burgin v. South Carolina, 404 U.S. 806, 30 L. Ed. 2d 39, 92 S. Ct. 46 (1971), rev'g State v. Burgin, 255 S.C. 237, 178 S.E.2d 325 (1970). The photographs are mentioned, however, because they illustrate the manner in which the magazine has been composed. These photographs, like those which appear in the editorial and most which appear elsewhere in the magazine, have no reasonable and rational relationship to the article and are not relevant to its theme. It is obvious that the article has been used as a mere vehicle to publish the photographs.\n\nThe article, \"Is the Penis Obsolete\", appears to develop a theme that human conception may become possible without participation of the male, thus leaving a world of women. The text discusses various means of artificial conception and concludes that parenthood may become purely a sociological function rather than socio-biological. Neither the past Roth-Memoirs test nor the Roth-Miller test appear to\n\nhave been violated. Nothing in the article, however, has a remote connection with the accompanying black and white photographs of naked women engaged in cunnilingus, or who are shown using dildos, singly or in pairs, or who have been photographed using mechanical devices for masturbation. The photographs have neither a reasonable nor rational relationship to the article. It is a mere vehicle for publication of the photographs.\n\nAnother article, \"Sex in Marriage,\" purports to be a review of a 2-volume work of the same title. We are not called upon to evaluate the books reviewed and do not attempt to do so. The written review contains little, if any, material violative of either the older Roth-Memoirs standard or the current Roth-Miller test.\n\nWe hold that although the review purports to discuss a 2-volume work on sex in marriage, it is actually a mere vehicle to show graphic photographs of a nude male and female engaged in sexual intercourse, cunnilingus, fellatio and masturbation by the other party, each in several positions. The photographs are not reasonably or rationally related to the review or its theme.\n\nAn article entitled, \"The Pill\", contains neither written material nor photographs that would run afoul of either the Roth-Memoirs test or the Roth-Miller test and needs not be discussed further. It is however, connected in no way with the written materials which are discussed above or which shall be discussed later.\n\n\"From the Psychologist's Casebook,\" has the same borderline literary value as the above-mentioned articles and does not run afoul of either of the above-mentioned standards. Nevertheless, the accompanying black and white photographs of naked women or naked men and women engaged in masturbation, fellatio, and cunnilingus, have absolutely no reasonable or rational relationship with the article or its theme. Clearly, it is a mere vehicle to exhibit the photographs.\n\nAn article entitled \"The Erotic Art of Japan\" purports to discuss ancient Japanese erotic art, now said to be unacceptable\n\nin its place of origin. The article refers neither to a specific picture nor to the totality thereof. Thus, we are led to the inevitable conclusion that the article is no more than a vehicle for publishing pictures of sexual intercourse in many positions, cunnilingus, masturbation of one party by another and anal sodomy.\n\nFinally, the article \"Those Sexy Scandinavians\" purports to discuss some of the moral attitudes and standards of those people. It mentions, only in passing, that Scandinavian laws relating to pornography are more lenient than those in the United States. The article is accompanied by both black and white and color photographs of unclad males and females engaged in numerous acts of cunnilingus, fellatio, sexual intercourse, penises ejaculating on the faces or in the mouths of females as well as the use of dildos by masturbating females.\n\nThere is absolutely no reasonable or rational relationship between anything in the printed portion of the article and the photographs contained therein. The photographs are not relevant to the article's theme unless logic can be tortured to make the connection relevant. A pseudo-relevance could be found only by reasoning that the article indicates pornographic pictures are legal in Denmark, although illegal here; thereafter, it would be necessary to reach the illogical conclusion that the pictures shown in the magazine, must, in this instance, be legal because they merely illustrate that which is legal in Denmark. In the legal profession this is referred to as \"boot-strapping.\"\n\nThe book \"Sex Between Humans and Animals\" has no illustration on either the front or back cover. It is said to be a photo-illustrated presentation of \"the psycho-mythic meaning of bestiality.\" The first several pages consist of a list of pictures contained in the publication. A review of the picture \"credits\" reveals that most, if not all, are from private collections or are from foreign countries. A few are attributed to draftsmen whose locality is unknown. Thus, there is nothing to indicate anything other than private acceptance.\n\nAside from the book's provocative title, the textual material presents virtually nothing violative of either the Roth-Memoirs or the Roth-Miller test. For example, the first section deals with why bestiality occurs. The text is filled with quotations from numerous authors who discuss the psychological basis for such acts. This section is accompanied by black and white and color pictures.\n\nThe next chapter is devoted to seeking a \"satisfactory answer\" in the psycho-mythic meaning of bestiality. It asserts that man is an animal with a fertile imagination and thereafter discusses the development of the brain of man and vertebrates in general. This is followed by a discussion of conscious/unconscious and symbolic behavior. Man is discussed as a symbol-manipulating animal who uses symbols both deliberately and on the unconscious level.\n\nFinally, it states that man has depicted animals in art or dreamed of them from an early age. It is asserted that man's fascination with the subject of bestiality might indicate his desire to return to the animal state, or a fear that such return may occur. Man's laws forbidding bestiality are said to express the latter fear. This section is accompanied by black and white pictures.\n\nThe book closes with a chapter which merely discusses the symbolic meaning of various animals in history and today. It is accompanied by black and white pictures.\n\nAt the back of the book a \"Legal Appendix\" defines the offense and sets forth the penalties for crimes against nature if committed in any of the states or in the military. This is also followed by black and white and color pictures.\n\nImmediately following is a \"Glossary of Terms\" defining numerous sexually oriented terms and denominating them as medical, slang, conversational or vulgar. Black and white pictures also accompany this section.\n\nThe book closes with a \"Bibliography\" and \"Recommended Reading\" as well as an index.\n\nThe textual material contains little or nothing that would violate either the Roth-Memoirs or the Roth-Miller tests of\n\nobscenity. Most of the 77 pictures (photographs, colorplates, drawings, and paintings) interspersed in the text of the book, however, have a dominant pictorial theme that graphically portrays nude women actually engaged in sexual intercourse, fellatio and cunnilingus with animals. Some, however, merely suggest these acts. Other pictures show female masturbation and an act of fellatio between a nude man and woman. It is important to note that there is absolutely no reasonable or rational relationship between any of the pictures and any part of the book or its theme. The book neither mentions the pictures nor do the pictures refer to the text. In fact, nothing contained either in the book or in the defendants' brief indicates any connection between the pictures and the book. Such lack of correlation or relevance between the textual theme and pictures in the book was particularly noted by witness Stroh. Clearly, the text is a mere vehicle to exhibit the pictures.\n\n[28] In reference to both \"Answers\" and \"Sex Between Humans and Animals\", defendants do not specifically argue that the mere presence of printed material which complies with the Roth-Memoirs test, automatically places a First Amendment protective mantle over accompanying obscene pictures. However, a vague suggestion in that vein does seem to be made. We assume that a similar argument would be made under the Roth-Miller test. Such a position is without legal sanction. Kois v. Wisconsin, 408 U.S. 229, 33 L. Ed. 2d 312, 92 S. Ct. 2245 (1972), has devised a commonsense test which generally provides that if pictures accompany text material, itself not considered obscene under the Roth test, the accompanying pictures which would otherwise violate Roth will be protected by the First Amendment (1) if they are relevant to the theme of the article, (2) have a reasonable and rational relationship to the text, and (3) the text is not a mere vehicle for publication of the pictures. The court in Miller v. California, 413 U.S. 15, 26, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973), gave an example of illustrative material that would meet the Kois test: \"For example, medical books for the education of physicians\n\nand related personnel necessarily use graphic illustrations and descriptions of human anatomy.\" The court, in Kois, also made the interesting observation, at page 231: \"A quotation from Voltaire in the flyleaf of a book will not constitutionally redeem an otherwise obscene publication . . .\"\n\nAs carefully noted in our review of \"Answers\" and \"Sex Between Humans and Animals\", the requisite reasonable and rational relationship between the printed material and pictures is nonexistent. The photographs are not relevant to the theme of the articles in which they appear. The articles and the books are merely vehicles for exhibiting the pictures.\n\nThe pictures acquire no First Amendment protection by the sole fact of being included in or interspersed through text material that itself might be protected by the First Amendment under the Roth test. Kois v. Wisconsin, supra. Logically, the same would be true under the more specific, and current, Roth-Miller test. Obscene materials are not protected by the First Amendment. Roth v. United States, 354 U.S. 476, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957); United States v. Reidel, 402 U.S. 351, 28 L. Ed. 2d 813, 91 S. Ct. 1410 (1971). Thus, the pictures will not be protected by the First Amendment if they are obscene, and are not otherwise protected by the Kois rule.\n\nThe basic question, then, is whether the pictures before us, standing alone, are obscene under the Roth-Miller test. If they are, they are not entitled to First Amendment protection.\n\nDefendants have made 14 assignments of error which raise several basic issues. They have not argued the legal position on each. Rather, their case is presented with the same format as that used in Division II-A-State v. Kelly. We will again use the same format.\n\nInsofar as applicable, and as noted hereafter, defendants have made similar assignments of error and the same supporting arguments found in this opinion Division II-A-State v. Kelly, §§ 2-a, 2-b, 2-d, 2-e, 2-g, and 5. We considered and\n\nrejected each of them. Nothing will be gained by repetition at this point. We shall discuss other contentions.\n\n[29] 1. Defendants contend that the photographs and illustrations in \"Answers\" and \"Sex Between Humans and Animals\" are not obscene because they would not appeal to the \"prurient interest\" of the average person. Their reasoning is entirely circular. They assert that the material is so sexually abhorrent that it would repulse the average man rather than create an appeal to his \"prurient interest.\" Thus, they say, the pictures are not obscene. Defendants have cited no supporting cases and we have found none to support such a spurious theory. In fact, the law is to the contrary. In Mishkin v. New York, 383 U.S. 502, 16 L. Ed. 2d 56, 86 S. Ct. 958 (1966), the United States Supreme Court was confronted with a similar argument. It had this to say at page 508:\n\nIndeed, appellant's sole contention regarding the nature of the material is that some of the books involved in this prosecution, those depicting various deviant sexual practices, such as flagellation, fetishism, and lesbianism, do not satisfy the prurient-appeal requirement because they do not appeal to a prurient interest of the \"average person\" in sex, that \"instead of stimulating the erotic, they disgust and sicken.\" We reject this argument as being founded on an unrealistic interpretation of the prurient-appeal requirement.\n\n(Footnote omitted.)\n\nLogically, defendants' argument is a virtual concession that the materials are worse than obscene. It is said that they would not appeal to the average man's \"prurient interest in sex\" because they would be sexually abhorrent to him. If this is true, the obscenity displayed in the two questioned exhibits amounts to \"hard core pornography\" in its strongest sense. See our discussion contained in this opinion. Division II-C-State v. Cox and State v. Rogoway, § 2.\n\n2. Defendants also contend that the court erred by permitting witness Stroh to state whether the two questioned exhibits meet the tripartite criteria of Roth-Memoirs. The\n\nrecord indicates that Mr. Stroh is a parent, an educator with 19 years experience who has taught social studies for nearly 15 years, and that he is a resident of the community in which the standard of obscenity was to be tested. It is defendants' position that he lacked the necessary expertise to render an opinion.\n\nMr. Stroh examined both exhibits following which he expressed, albeit in lay terms, that the dominant theme of each appealed to a prurient interest in sex; that the photographs and pictures in each were patently offensive in that they were an affront to contemporary community standards relating to sexual matters; and, the materials were utterly without redeeming social value, thus meeting the Roth-Memoirs as well as the less rigorous Roth-Miller test. His testimony appeared to relate primarily to the photographs and pictures rather than to the textual content of the exhibits. He found virtually no correlation between the text and the pictures and photographs.\n\nWhether a witness is properly qualified to render an opinion is within the sound discretion of the court. State v. Nelson, 72 Wash. 2d 269, 276, 432 P.2d 857 (1967); State v. Tatum, 58 Wash. 2d 73, 76, 360 P.2d 754 (1961). In the instant case, the court clearly expressed that it would consider Mr. Stroh's qualifications as going to the weight of the evidence. The trial court, sitting as it did without a jury, did not abuse its discretion.\n\n3. In addition to the foregoing the state did not produce any other affirmative \"expert testimony\" that the materials were \"obscene\". The exhibits were in evidence, however, and were considered by the trial court.\n\nIt was not error for the trial court to require no further \"expert\" affirmative evidence that the materials were \"obscene\" since the materials themselves had been placed in evidence. Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973) and Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973). The exhibits were the best evidence of what they represent and were sufficient in themselves for the determination of the\n\nquestion of \"obscenity\" according to both Paris and Kaplan. Thus, the trial court properly could have considered the legal impact of both exhibits either with or without Mr. Stroh's testimony.\n\nA review of the findings of fact makes it evident that the court deemed the pictures and photographs contained in both exhibits \"hard core pornography\". The same thought is expressed clearly in the court's oral opinion. We have reviewed the materials and hold that under either the Roth-Memoirs or the Roth-Miller test the materials are in fact \"hard core pornography\". The trial court committed no error.\n\n4. Defendants contend the trial court erred in finding that the material, in the two challenged exhibits, had utterly no redeeming social value. Again they assert defense experts testified that both publications had a modicum of social value. Defendants' position is indefensible for two reasons. First, the trial court was not required to, and obviously did not, believe defendants' experts or their view of \"redeeming social value\". Second, the Memoirs test that excluded from the definition of \"obscenity\" materials that have some \"modicum of social value\" is no longer the law. As previously indicated, the United States Supreme Court completely rejected the \"utterly without redeeming social value\" test in Miller v. California, supra.\n\nIn the same vein, defendants charge that the court erred by considering evidence of \"pandering\" the books in question. It is said that this subject was not properly in the case. However, as we said in Division II-A-State v. Kelly, § 2-a, evidence of the setting in which allegedly obscene materials are purveyed, or the manner in which they are purveyed is relevant to the question of \"value\" whether it is a \"modicum of social value\" under the rejected Memoirs test or whether the materials taken as a whole lack \"serious literary, artistic, political, or scientific value\" under the present Roth-Miller test. In either event, an inquiry into and a consideration of the manner of sale or exhibition or \"pandering\" is permissible to determine whether an asserted\n\n\"value\" is real or spurious. Nothing will be gained by repetition of that section of State v. Kelly. It is sufficient to say that the trial court's findings of fact and ultimate conclusion of \"obscenity\" are not in error.\n\n5. In conclusion, we hold that the pictures and photographs in \"Answers\" and \"Sex Between Humans and Animals\" are \"obscene\" whether viewed in light of the rejected Memoirs test or the newly adopted Roth-Miller standards. In fact, they are \"hard core pornography\". We also hold, as indicated above, that there is no reasonable and rational relationship between the text or theme of the publications and the pictures or photographs contained therein. The text is a mere vehicle for the exhibition of obscene pictures. Thus, the fact that the pictures and photographs are combined with nonobscene text material does not clothe them with protection of the First Amendment.\n\nThe trial court is affirmed.\n\nIII\n\nExhibition of Films\n\nA. State v. Samuel Kravitz, No. 42376.\n\nState v. Albert Thomas Duane, No. 42377.\n\nThe defendants, Samuel Kravitz and Thomas Duane, were tried jointly by the court. They were found guilty, as charged, of eight counts of exhibiting an obscene motion picture. They appeal.\n\nThere is evidence to support the following:\n\nOn June 3, 1971, Detective Germann of the Seattle Police Department visited the Adult Book Store in Seattle. He was accompanied by other officers.\n\nThe store was divided into two sections, one being a small theater and the other a bookstore devoted to the sale of sexually oriented materials. The store was so arranged that materials pertaining to homosexual activities were located in one area, those appealing to heterosexual activity in another area, and those pertaining to sadism and masochism in still a different area. The store also sold sexually oriented objects such as dildos, artificial sex organs and other sex items.\n\nThe police went to the store to film moving pictures then being exhibited in the theater. The eight pictures being shown were in color and were spliced for continuous exhibition. Two were untitled, the others were entitled: \"Intruder,\" \"Daddy,\" \"Passive Mate,\" \"Tryst,\" \"Rubber Duck\" and \"Vegetable Girl.\"\n\nIt was testified that only one of the films had an actual sound track, but it was so badly garbled that it was unintelligible. There was, however, little or no conversation among the people shown therein. The balance of the sound track was primarily devoted to music. The police officers recorded the sound, such as it was, on cassette tapes and played them at the trial.\n\nWhile in the darkened theater, Officer Smith operated the camera while Officer Germann took detailed notes of time sequences and of the action displayed on the screen. It was necessary for the officers to change film every 20 minutes during which time approximately one to three minutes of the projected picture was lost. The time was noted and during a second viewing of the film the omitted segments were filmed to provide a copy of the entire set of movies projected.\n\nThe police used sensitive black and white film instead of color film because, under the conditions encountered, color film lacked sufficient light sensitivity to reproduce the color film projected.\n\nDefendants' film was projected at 24 frames per second. However, it was copied on the black and white film at 12 frames per second to avoid \"synchronization\" and a possible loss of the pictures projected on the screen. At trial the black and white film was exhibited at 18 frames per second. The trial court found that the slight difference in timing had little or no effect upon the untrained eye other than an increase in the speed of the action.\n\nInsofar as the eight films are concerned, the trial court found that each portrayed every possible type of sexual activity between a male and female and in some sequences such activities occurred among three persons. Our own\n\nviewing of the films revealed a chained woman being raped in various ways and forced to commit fellatio; other sequences showed willing engagement in fellatio, cunnilingus, sexual intercourse in numerous positions, masturbation of females by males and vice versa and other sexual perversions.\n\nThe trial court found defendants guilty on all eight counts. They appeal.\n\nDefendants have made 19 assignments of error. They have not argued the legal position on each. Rather, their case is presented in the same format as that used in Division II-A-State v. Kelly. We have again adopted the same format.\n\nInsofar as applicable, and as noted hereafter, defendants have made similar assignments of error and the same supporting arguments made in this opinion, Division II-A-State v. Kelly, §§ 1, 2-a, 2-b, 2-c, 2-e, 2-f, 2-g, 2-h, 2-i, 2-j, 2-k, 4 and 6.\n\nIn the foregoing sections of Division II-A-State v. Kelly we considered and rejected defendants' arguments. Repetition here will serve no purpose. We shall, however, discuss several additional contentions.\n\n1. Defendants argue that the prohibition of RCW 9.68.010(2) is not limited to the exhibition of obscene films to others or even commercially. It is urged that the statute would prohibit a private showing to one's self in the privacy of one's own home in violation of Stanley v. Georgia, 394 U.S. 557, 22 L. Ed. 2d 542, 89 S. Ct. 1243 (1969). Thus, it is said, the statute is overbroad as it encompasses within its terms activity which may not constitutionally be proscribed, citing Winters v. New York, 333 U.S. 507, 92 L. Ed. 840, 68 S. Ct. 665 (1948). We do not agree with defendants' interpretation of the statute. We also disagree with their assertion that it is unconstitutionally overbroad.\n\n[30] RCW 9.68.010(2) proscribes (a) causing to be exhibited or (b) the exhibition of any motion picture which is obscene. Ordinary English usage excludes defendants' contention that the statute proscribes one's mere possession\n\nof an obscene film in the privacy of his own home. Webster's Third New International Dictionary (1966) defines exhibit as follows:\n\nvt 1 : to present to view : Show, Display . . . d : to show publicly : put on display in order to attract notice to what is interesting or instructive or for purposes of competition or demonstration . . . n -s 1 : an act or instance of exhibiting : Display, Exhibition . . . 2 : something exhibited; specif : an article or a collection of articles displayed in an exhibition . . .\n\nExhibition is defined:\n\n1 : an act or instance of showing, evincing, or showing off . . . 3 : a public show or showing . . . a display or show where the display itself is the chief object and from which the exhibitor derives or expects to derive a profit . . .\n\nAccord, Webster's Seventh New Collegiate Dictionary (1969).\n\nClearly, the act of exhibiting or causing an exhibition does not refer to the mere private possession of materials in the privacy of one's own home. Rather, it refers to the engaging of another to bring about the act, or to assist therein. It refers to a display of the materials for viewing by other persons. This was not the evil found unconstitutional by Stanley v. Georgia, supra. In striking down Georgia's statute, the high court held that mere private possession of obscene matter cannot constitutionally be made a crime. We do not disagree. Nevertheless, Stanley must be read in light of United States v. Reidel, 402 U.S. 351, 28 L. Ed. 2d 813, 91 S. Ct. 1410 (1971). At page 354, Reidel said that Stanley\n\nneither overruled nor disturbed the holding in Roth. . . . As we have said, the States retain broad power to regulate obscenity; that power simply does not extend to mere possession by the individual in the privacy of his own home.\n\nWhen the words \"exhibit\" and \"exhibition\" are defined according to common English usage, RCW 9.68.010(2) does\n\nnot violate Stanley. It does not proscribe an individual's possession of obscene materials in the privacy of his own home. Rather, as permitted by Reidel, it proscribes the sale to and the exhibiting or exhibition of obscene materials to others.\n\nThe statute, interpreted according to common English usage is not unconstitutionally overbroad. See Dombrowski v. Pfister, 380 U.S. 479, 491-92, 14 L. Ed. 2d 22, 85 S. Ct. 1116 (1959); also see Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973); Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973); The First Amendment Overbreadth Doctrine, 83 Harv. L. Rev. 844 (1970).\n\nThis state has a \"legitimate interest in regulating commerce in obscene material and in regulating exhibition of obscene material in places of public accommodation, including so-called 'adult' theatres from which minors are excluded.\" Paris Adult Theatre I v. Slaton, supra at 69.\n\n2. Defendants assert that the trial court erred by admitting a black and white reproduction of an obscene color film. It is contended that the reproduction must at least be an exact copy of the original film, having the same quality, and taken and shown at the same speed as the original.\n\nUnder the circumstances of this case we hold that the trial court committed no error.\n\nIt is important to note that defendants do not claim the state failed to lay a sufficient foundation for admission of the state's exhibits as copies of the defendants' film. Rather, the basic objection goes to the admission of the reproduced film itself.\n\n[31] The manner in which defendants' film was reproduced and the reasons for the use of black and white films have been explained above. We shall not repeat them. It is enough to say that there is substantial evidence to support the trial court's finding that differences in the speed of taking the black and white film, its reproduction, and the exhibiting thereof at trial had little or no effect on the average or untrained eye. The only effect was a slight\n\nspeeding of the action. There also is substantial evidence that the reproduction was complete. Thus, as explained by those who filmed and reproduced the film, the result was a sufficiently accurate reproduction of the original image projected on the screen. The differences, such as they were, would go to the weight not the admissibility of the exhibits.\n\n[32] Defendants suggest there was a material difference because the original was in color whereas the reproduction was in black and white. We do not agree that the difference was material. The trial court viewed the copy, as did we. We cannot and do not hold that the difference is material as a matter of law. Defendants have not furnished us with any citation to support their position and we are aware of none. We hold that the trial court did not abuse its discretion by admitting the copy under the circumstances before it.\n\nDefendants assert that the sound track produced by the police, and admitted by the court, was garbled and unintelligible. As indicated above, however, there is substantial evidence that only one of the films had a sound track, that it contained little conversation and that the original itself was garbled and unintelligible. The remaining sound tracks were devoted primarily to music. Thus, there is substantial evidence that the reproduced sound tracks were not materially different than the originals. The trial court committed no error by admitting the copy. If it was error, however, it was harmless. The copy was an unintelligible reproduction of an original which was itself unintelligible.\n\nFinally, defendants argue that the black and white copy of the color film was inadmissible under the best evidence rule, contending that only the original was properly admissible. We do not agree.\n\n[33] First, defendants have not informed us whether the defendants' own film was in fact the \"original\" -- or was a mere copy. In most cases films shown at theaters are not originals. Second, the state's reason for filming the pictures projected on defendants' screen is obvious. It did not prevent defendants from exhibiting the film, absent a prior\n\nadversary determination of obscenity. Third, as indicated in the state's brief, and the supplemental transcript, the state sought to force the defendants to produce the color film. Further demand would have been useless and beyond the trial court's power to enforce the demand. Thus, there was sufficient basis for use of the copies after laying the proper foundation. State v. Morden, 87 Wash. 465, 470-71, 151 P. 832 (1915); see State v. Beck, 56 Wash. 2d 474, 495, 349 P.2d 387 (1960).\n\nThe trial court is affirmed on all eight counts.\n\nB. State v. James Michael Tidyman, No. 42429.\n\nA jury found the defendant, James Tidyman, guilty of one count of exhibiting an obscene motion picture. He appeals.\n\nThere is evidence to support the following:\n\nOn October 25, 1971, Detectives Germann and Gruber of the Seattle Police Department went to the Flick Theater in Seattle for the purpose of filming a moving picture entitled \"The Right Way To Do It.\" They were accompanied by a police photographer equipped with a tape recorder and a 16-mm movie camera containing black and white film.\n\n\"The Right Way To Do It\" was in color with a sound track. It consisted of approximately 30 minutes' running time. The officers testified, however, that the sound track was so garbled and unintelligible that the words could not be understood.\n\nThe movie portrayed three persons, two females and a male, all unclad from the start. The movie consisted of three persons engaged in fellatio, cunnilingus, and sexual intercourse in numerous positions. The pictures were taken so as to accentuate the sexual organs of those engaged in sexual activity.\n\nThe officers proceeded to photograph the picture projected on the screen. The sound track was also recorded but, like the original, was mostly unintelligible. The procedures used for filming the moving picture were substantially the same as those used in State v. Kravitz, No. 42376, and State v. Duane, No. 42377, consolidated in Division III-A above.\n\nThe resultant copy was black and white. A very short section of the first part of the black and white film was grainy and difficult to view. The majority, however, was clear for viewing.\n\nWhile \"The Right Way To Do It\" was being filmed, defendant Tidyman was interviewed by Detective Gruber. Defendant indicated that some of his customers were displeased because the film showed some couples of mixed races. The conversation also revealed that, as manager of the theater, he hired four clerks to assist him.\n\nDefendant was tried by a jury and convicted of one count of exhibiting an obscene motion picture. He appeals.\n\nInsofar as applicable, and as noted hereafter, defendant has made similar assignments of error and the same supporting arguments made in this opinion, Division II-A-State v. Kelly, §§ 1, 2-a, 2-b, 2-c, 2-e, 2-f, 2-g, 2-h, 2-i, 2-j, 2-k, 4, 5 and 6. Defendant also made similar assignments of error and the same supporting arguments in this opinion, Division III-A-State v. Kravitz and State v. Duane, §§ 1 and 2.\n\nIn the foregoing sections of Division II-A-State v. Kelly and Division III-A-State v. Kravitz and State v. Duane we considered and rejected defendants' arguments. Nothing will be gained by repeating those discussions. Additional contentions will be considered, however.\n\n1. Dr. Jarvis was permitted to express his opinion that the moving picture, here involved, was patently offensive as going beyond contemporary community standards relating to sex and that the movie was utterly without redeeming social value. Defendant was not permitted to cross-examine Dr. Jarvis as to his awareness of the number of theaters in the area that exhibited similar pictures or to cross-examine him on the attendance at those theaters.\n\nDefendant assigns error to the trial court's ruling. He contends that he was thus prohibited from showing by cross-examination that, contrary to Dr. Jarvis' opinion, there is a community acceptance that adults should be free\n\nto view movies of their choice despite the explicit sexual nature thereof.\n\nThe trial court did not err in refusing to permit such cross-examination of Dr. Jarvis. Dr. Jarvis based his opinion of contemporary community standards upon conversations with numerous people in the Seattle-Tacoma metropolitan area, as well as on his background and experience as a psychiatrist. He did not base his opinion upon the number of theaters showing obscene movies on First Avenue in Seattle, or upon the number of people attending those theaters.\n\n[34] The scope of cross-examination is peculiarly within the province of the trial court whose determination of its boundaries will not be disturbed unless there is manifest abuse of discretion. State v. Etheridge, 74 Wash. 2d 102, 443 P.2d 536 (1968); State v. Eichman, 69 Wash. 2d 327, 418 P.2d 418 (1966). In the instant case there was no abuse of discretion. Defendant's proposed cross-examination of Dr. Jarvis would have gone far beyond the scope of the direct examination. Further, even assuming some of the public may abhor censorship, feeling that adults should be permitted to view sexually explicit movies that are exhibited commercially, cross-examination on the subject would have been wide of the mark. The issue is not whether some of the public may disapprove of or disregard censorship laws, but whether the material censored is \"obscene\" under the tripartite test of Miller. People may well oppose the thought of censorship in any form and yet agree that the material sought to be censored goes well beyond that which is acceptable under any contemporary community standards dealing with sex. As pointed out in Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973), citing Mishkin v. New York, 383 U.S. 502, 508-09, 16 L. Ed. 2d 56, 86 S. Ct. 958 (1966), the primary concern with requiring a jury to apply the standard of \"'the average person, applying contemporary community standards' is to be certain that, so far as material is not aimed at a deviant group, it will be judged by its impact on an average person, rather\n\nthan a particularly susceptible or sensitive person -- or indeed a totally insensitive one.\"\n\nThe evidence sought to be elicited from Dr. Jarvis by means of cross-examination was not material to the issue before the court. If the matter sought to be elicited is not material and has no bearing upon the credibility of the witness, it is properly excluded on cross-examination. State v. Kwan, 174 Wash. 528, 25 P.2d 104 (1933); State v. Eichman, supra.\n\n[35] 2. In the same vein, defendant attempted to establish that there was a contemporary community standard of acceptance of this kind of film in the Greater Seattle Area. He sought to do this by having a police officer testify that similar films were exhibited by 12 or 13 theaters, to a limited audience, in a very restricted area of Seattle. The trial court properly rejected the evidence. The fact that others may have exhibited obscene films and may have violated the law is not probative of the issues before the trial court here.\n\nThe trial court was correct for other reasons. First, the predicate for a conclusion that a questioned film is acceptable under contemporary community standards, by comparison with other films, must be that the questioned film and the proffered films are in fact similar. Under the circumstances of this case there was no way for the jury to have compared similarity, or lack thereof. Second, to be admissible, evidence must have some probative weight. Here, the comparison involved such a microscopic portion of over one million inhabitants of the Greater Seattle community that it could not have been relevant to establish contemporary community standards. Such a comparison, severely limited both as to area and numbers of people, would fail to show a reasonable degree of community acceptance of the questioned picture or even the films alleged to be similar. To be relevant the proffered evidence must have something more than minimal probative value. It must have some actual probative weight upon the issue of fact under consideration.\n\nIn addition to the reasons stated in the immediately preceding subsection of the instant case, the fact that other films alleged to be similar were exhibited in limited areas of Seattle is no indication that the average person, applying contemporary community standards would not consider the film obscene. United States v. Manarite, 448 F.2d 583 (2d Cir.), cert. denied, 404 U.S. 947 (1971); Womack v. United States, 294 F.2d 204, 206 (D.C. Cir.), cert. denied, 365 U.S. 859 (1961). Accord, People v. Finkelstein, 11 N.Y.2d 300, 183 N.E.2d 661 (1962).\n\nThe trial court is affirmed.\n\nConclusion\n\nI\n\nDismissal of State's Case\n\nState v. Michael J. Kristek, No. 42375. The trial court is affirmed.\n\nII\n\nSales Cases\n\nA. State v. Thomas F. Kelly, No. 42385. The trial court is affirmed on both counts.\n\nB. State v. Arthur Montgomery, No. 42374. The trial court is affirmed on both counts.\n\nC. State v. Jesse Allen Cox, No. 42372. The trial court is affirmed.\n\nState v. Eugene Allen Rogoway, No. 42373. The trial court is affirmed on both counts.\n\nD. State v. J-R Distributors, Inc. \u0026 Howard C. Frank, No. 42371. The trial court is affirmed on both counts.\n\nIII\n\nExhibition of Films\n\nA. State v. Samuel Kravitz, No. 42376. The trial court is affirmed on all eight counts.\n\nState v. Albert Thomas Duane, No. 42377. The trial court is affirmed on all eight counts.\n\nB. State v. James Michael Tidyman, No. 42429. The trial court is affirmed.\n\nDisposition\n\nAffirmed.\n\nFinley, J. (concurring)\n\nObscenity is a complex and difficult socio-legal problem not only for the legislative and executive branches, but also for the judicial branch of government. This is so largely because views, ideas, and notions concerning obscenity are not changeless or absolute. Such views, ideas, and notions may well differ significantly in the eyes of the beholder, as well as in terms of such variant factors as time, place, and circumstance, embracing among other things the context, format, and manner of presentation. Obscenity cannot be considered in the abstract or in a purely academic or philosophical reference when presented in a case before an appellate court. Attention must be given to freedom of the press and freedom of speech. In other words, social or legal restraint, restriction, and regulation of any alleged obscenity under state police power is subject to and must be tested against the constitutional rights of free press and free speech of those affected by a complaint or charge of obscenity. Judicial evaluation and decision is not only necessary, it is a proper and traditional function of the judicial branch of government. In this context, the majority opinion by Chief Justice Burger in Paris Adult Theatre I v. Slaton, 413 U.S. 49, 60 n.10, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973) observed the following:\n\n\"In this and other cases in this area of the law, which are coming to us in ever-increasing numbers, we are faced with the resolution of rights basic both to individuals and to society as a whole. Specifically, we are called upon to reconcile the right of the Nation and of the States to maintain a decent society and, on the other hand, the right of individuals to express themselves freely in accordance with the guarantees of the First and Fourteenth Amendments.\" Jacobellis v. Ohio, supra [378 U. S. 184 (1964)] at 199 (Warren, C. J., dissenting).\n\nThe United States Supreme Court attempted to evolve an understandable, workable formula relative to obscenity and First Amendment freedoms of speech and press in Roth v. United States, 354 U.S. 476, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957) and Memoirs v. Massachusetts, 383 U.S. 413, 16 L. Ed. 2d 1, 86 S. Ct. 975 (1966). The efforts in Roth and Memoirs proved to be rather disappointing in terms of clarity and amenability to application by state legislative, executive, and judicial branches of government. In this regard, Chief Justice Burger, writing for the majority in Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973), commented as follows:\n\nIt is certainly true that the absence, since Roth, of a single majority view of this Court as to proper standards for testing obscenity has placed a strain on both state and federal courts. But today, for the first time since Roth was decided in 1957, a majority of this Court has agreed on concrete guidelines to isolate \"hard core\" pornography from expression protected by the First Amendment.\n\nDespite this assurance of the majority in Miller regarding \"concrete guidelines\", the opinion written in the Miller case is somewhat confusing and disappointing at first blush. It must be read several times and subjected to close analysis and examination. Given this kind of careful study and evaluation, an understandable and workable formula relative to obscenity, in my best judgment, becomes clearly discernible and amenable to application by the respective branches of our state government. This new obscenity formula is enunciated in Miller in the following manner:\n\nThe basic guidelines for the trier of fact must be: (a) whether \"the average person, applying contemporary community standards\" would find that the work, taken as a whole appeals to the prurient interest, Kois v. Wisconsin, supra, [408 U. S. 229 (1972)], at 230, quoting Roth v. United States, supra, at 489; (b) whether the work depicts or describes, in a patently offensive way, sexual conduct specifically defined by the applicable state law; and (c) whether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value. We do not\n\nadopt as a constitutional standard the \" utterly without redeeming social value\" test of Memoirs v. Massachusetts, 383 U. S., at 419; that concept has never commanded the adherence of more than three Justices at one time. . . . If a state law that regulates obscene material is thus limited, as written or construed, the First Amendment values applicable to the States through the Fourteenth Amendment are adequately protected by the ultimate power of appellate courts to conduct an independent review of constitutional claims when necessary.\n\n(Footnote omitted.) Miller v. California, supra at 24. Just prior to the court's statement in Miller of the above test, the formula is suggested in somewhat different language. This variant language and phrasing engenders some confusion. Likewise, some of the discussion in Miller elaborating on the formula is a bit on the confusing side, but once again, a careful analysis of the majority opinion elicits a formula which I think is intelligible and susceptible to administration. Conscientious review of the dissenting opinions in Miller by Justices Douglas and Brennan sheds further light upon the nature and scope of the test announced in the majority opinion. Similarly, close scrutiny of the majority and dissenting opinions in Paris Adult Theatre I v. Slaton, supra, United States v. 12 200-Ft. Reels, 413 U.S. 123, 37 L. Ed. 2d 500, 93 S. Ct. 2665 (1973), Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973), and United States v. Orito, 413 U.S. 139, 37 L. Ed. 2d 513, 93 S. Ct. 2674 (1973), further illuminates the elements of the Miller formula, as well as its mode of application.\n\nConsidered and evaluated as indicated above, the Miller obscenity formula seems to me to have three main facets which are elucidated by the following questions: (1) Does the allegedly obscene work, material, pamphlet, book, film, or related medium, taken as a whole, appeal to the prurient interest in sex (does it produce an itching or a restless craving for the lewd, licentious, and lascivious in sexual\n\nmatters),\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e as viewed by the average person applying contemporary state-wide community standards; (2) Does the work depict or describe sexual conduct in a patently offensive way, and is the conduct thus involved specifically defined by applicable state law, i.e., does the statute or authoritative judicial decision give reasonable notice of what is proscribed; (3) Does the work have serious literary, artistic, political, or scientific value. The Miller opinion clearly indicates that the Roth-Memoirs formula has undergone significant modification. The dubious and cumbersome phrase \"utterly without redeeming social value\" has been eliminated.\n\nThe majority opinion in Miller refers to contemporary community standards a number of times. These references pertain to a discussion of so-called national standards on obscenity in contrast to state-wide standards. Nowhere in Miller, Paris Adult Theatre, 12 200-Ft. Reels, Kaplan, or Orito is there any significant or serious reference to local standards such as might be defined in terms of geographical or other county, city, and township dimensions or perimeters. In view of this and the fact that the formula refers to state legislative statutory enactments, I am convinced that the phrase \"contemporary community standards\" as used in Miller and elsewhere in the companion cases simply means state-wide standards as to obscenity -- nothing more, nothing less.\n\nThe requirement of the Miller formula that allegedly obscene sexual conduct must be specifically defined by state statute or authoritative state law (judicial decision) is clarified by reference to the majority opinion in United States v. 12 200-Ft. Reels, supra, and by an examination of the language and provisions of 19 U.S.C. § 1305(a), the federal\n\nstatute reviewed in that case, which proscribed the following conduct:\n\n\"All persons are prohibited from importing into the United States from any foreign country . . . any obscene book, pamphlet, paper, writing, advertisement, circular, print, picture, drawing, or other representation, figure, or image on or of paper or other material, or any cast, instrument, or other article which is obscene or immoral . . .\n\nUnited States v. 12 200-Ft. Reels, supra at 124. Our own Washington statute is not dissimilar:\n\nEvery person who --\n\n(1) Having knowledge of the contents thereof shall exhibit, sell, distribute, display for sale or distribution, or having knowledge of the contents thereof shall have in his possession with the intent to sell or distribute any book, magazine, pamphlet, comic book, newspaper, writing, photograph, motion picture film, phonograph record, tape or wire recording, picture, drawing, figure, image, or any object or thing which is obscene; or\n\n(2) Having knowledge of the contents thereof shall cause to be performed or exhibited, or shall engage in the performance or exhibition of any show, act, play, dance or motion picture which is obscene;\n\nShall be guilty of a gross misdemeanor.\n\nRCW 9.68.010. The Supreme Court's approval of the language of 19 U.S.C. § 1305(a) in 12 200-Ft. Reels establishes this federal statute as an example of sufficient regulatory specificity. Owing to the marked similarity in substance between that particular statute and RCW 9.68.010, the court has, in my judgment, implicity approved the Washington obscenity statute involved in the nine consolidated cases before this court. In this connection, it should be noted that the majority opinion by Stafford, J., authoritatively construes the term \"obscenity\" as used in RCW 9.68.010 to embrace hard-core pornography. Thus, I have difficulty understanding any apprehensions and criticism of our application of the Miller standard to the instant cases or our related conclusion that the Washington statute is sufficiently precise.\n\nIt is a necessary and traditional duty of appellate courts to make evaluations and determinations as to obscenity. This function is not an idle, academic one. It involves actual judicial decision making in actually litigated cases where free press and free speech constitutional claims, asserted by actual people, are involved. The function is a line-drawing one and is an essential part of the role of the judiciary in our system of government. Under the Miller formula, appellate courts should experience little difficulty in exercising this duty of identifying and distinguishing hard-core pornography. I daresay many people have been engaged for a considerable time in the apparently very broad scale and flourishing business of producing, distributing and selling pornography. In order to maintain the patronage of their paying customers interested in this type of material, they must continually distinguish and identify that which will sell as the hard-core variety. I doubt that appellate courts are significantly more naive or less discriminating than the numerous people engaged in merchandising pornography. The majority of the United States Supreme Court had no difficulty and apparently no reluctance in identifying the material involved in Miller and the four companion cases decided at the same time by the court. The majority opinion in Miller clearly states that the items themselves constituted the best evidence for evaluation by the court as to whether they were hard-core pornography -- not entitled to First and Fourteenth Amendment protection. It was upon this basis that the court was capable of making the decision it did, focusing upon \"hard-core\" pornography and its commercialization as defined in the Miller formula. This same theme is present in the cases immediately before this court. Having examined and evaluated the items involved in these nine consolidated cases, I agree with the modus operandi of the United States Supreme Court in Miller. I find no difficulty in identifying the items (graphically described in the majority opinion by Stafford, J.) as hard-core pornography -- not entitled to the protection of the First and Fourteenth Amendments either under\n\nthe Roth-Memoirs test or now under the test formulated by the court in Miller.\n\nI cannot share Justice Utter's concern that our own court may be called upon to function as a censorship board. First, I think the characterization is an extreme one. Second, it is not apt because the determination of what is entitled to First and Fourteenth Amendment protection in the area of obscenity has become well-recognized as a proper and necessary function of the judiciary, certainly as long ago as the decision of the United States Supreme Court in Roth. On this point, Chief Justice Burger stated very clearly and most positively in Miller that First Amendment values \"are adequately protected by the ultimate power of appellate courts to conduct an independent review of constitutional claims,\" observing that the duty of the judiciary \"'admits of no \"substitute for facing up to the tough individual problems of constitutional judgment involved in every obscenity case.\"'\" Miller v. California, supra at 29, 30.\n\nIt is one thing for Justices Douglas, Brennan, Stewart and Marshall to disagree with the majority and to dissent to the court's holding in Miller; state appellate judges cannot indulge in such plenary intellectual luxury. Regardless of our personal opinions as to the wisdom or merits of Miller, the decisions of the United States Supreme Court are the law of the land insofar as applicable to comparable factual and legal issues before the Washington Supreme Court. I see no way of distinguishing the factual and legal issues as treated in Miller from the closely comparable ones involved in the nine consolidated cases now before us. Any discussion of purely personal preference or matters of individual philosophy must be regarded as not controlling and actually as surplusage of an academic or pedantic variety if we are to subscribe to the rule of law which seems so explicit upon careful examination and evaluation of the Miller decision.\n\nIt should be noted that the examples of obscenity in Miller and the related cases decided by a majority of the\n\nmembers of the United States Supreme Court, as well as the examples of \"hard-core\" pornography involved in the nine consolidated cases in this appeal now before the Supreme Court of Washington should provide information, examples, and guidelines for enforcement officials charged with the duty of enforcing state law concerning obscenity. The examples should indicate what is and what is not protected by the freedom of press and speech provisions of the first and fourteenth amendments to the United States Constitution. This suggests a process of comparison to the items and material considered in these cases. Problems of interpretation are somewhat inherent to the area of obscenity; and it may be expected that from time to time additional litigated cases may arise. In my opinion, it would be very difficult to predict whether such cases will be numerous or relatively few in number. Of course, as they do arise the formula established in Miller will have to be applied on a case-by-case basis. In any event, before terminating this concurring opinion and at the risk of some repetition, it seems to me worth noting and emphasizing that close comparability to the examples of obscenity not protected by the First and Fourteenth Amendments, which are involved in the nine consolidated cases decided today, should be the standard or guideline for anyone interested and concerned, including Washington State law enforcement officials.\n\nFor the foregoing reasons, and on the basis indicated -- as well as for the reasons stated in the majority opinion by Justice Stafford -- I have signed and I concur in that opinion.\n\nRosellini, J. (dissenting)\n\nI agree with Utter, J., but I think that something more needs to be said about the impropriety of a decision which superimposes upon a statute specifications and descriptions which cannot be found\n\nin the words of the statute. We have recently reaffirmed the rule that a statute which either forbids or requires the doing of an act in terms so vague that men of common intelligence must necessarily guess at its meaning and differ as to its application, violates the first essentials of due process. State v. Reader's Digest Ass'n, 81 Wash. 2d 259, 501 P.2d 290 (1972).\n\nThe one word used by the legislature to describe the material, dissemination of which is proscribed, is the word \"obscene.\" This is a word of extremely broad meaning, and the majority does not attempt to define its scope but merely lists certain things which they are certain fall within its ambit. To perceive that its list is hardly comprehensive, it is only necessary to turn to the dictionary currently in use at the court, Webster's Third New International Dictionary (1968). Here is what the compilers of that volume have to say about the definition of the word \"obscene.\"\n\n1 a : disgusting to the senses usu. because of some filthy, grotesque, or unnatural quality ([obscene] fungi clothed the wall of that dank cavern) (dressed in [obscene] rags) b : grossly repugnant to the generally accepted notions of what is appropriate : Shocking (death under the stars is [obscene] somehow -- Infantry Jour.) 2 : offensive or revolting as countering or violating some ideal or principle : as a : abhorrent to morality or virtue : stressing or reveling in the lewd or lustful; specif : inciting or designed to incite to lust, depravity, indecency (the dance often becomes flagrantly [obscene] and definitely provocative -- Margaret Mead) (a sly and [obscene] humor, the whispering and important lecheries of an old worn-out rake -- Thomas Wolfe) b: marked by violation of accepted language inhibitions and by the use of words regarded as taboo in polite usage ([obscene] chantey -- Sinclair Lewis) c : repulsive by reason of malignance, hypocrisy, cynicism, irresponsibility, crass disregard of moral or ethical principles (the [obscene] little counterdemonstration lewdly exulting in the forthcoming deaths -- T. R. Ybarra) (the debate . . . was almost [obscene] in its irresponsibility -- New Republic) syn see Coarse\n\nIf we turn to the given synonym, \"coarse,\" we find the following further elaboration:\n\n3 a : crude or unrefined in taste, manners, or sensibilities : without cultivation of taste, politeness or civility of manner, or delicacy of feeling (many of the muckraking novels . . . were simple parables of the [coarse] businessman and the sensitive intellectual -- Bernard De Voto) b : crude and indelicate of language or idea esp. with violation of social taboos on language : Obscene, Profane 4 a dial, of the weather : Rough, Stormy b dial Brit, of persons or circumstances : Brutal, Harsh 5 : harsh, raucous, or rough in tone : not melodious or mellow (the [coarse] jangling of ordinary bells -- G. B. Shaw) -- used also of certain sounds heard in auscultation in pathological states of the chest ([coarse] rales)\n\nsyn Vulgar, Gross, Obscene, Ribald : Coarse suggests unrefined crudeness, indelicacy, or robust roughness (he was forever making eyes at me -- a coarse, puffy-faced, redmoustached young man, with his hair plastered down on each side of his forehead. I thought he was perfectly hateful . . . A. Conan Doyle) (the landlady who had tyrannized over her when ill-humoured and unpaid, or when pleased had treated her with a coarse familiarity scarcely less odious -- W. M. Thackeray) In this sense, Vulgar, a stronger term, describes what offends good taste or decency and may suggest boorishness (his passion for physical luxury nakedly revealed itself as simply the vulgar longing of the idle rich for conspicuous waste -- Granville Hicks) (her father is a . . . vulgar person, mean in his ideals and obtuse in his manners -- John Erskine + 1951) (it was, in fact, the mouth that gave his face its sensual, sly, and ugly look, for a loose and vulgar smile seemed constantly to hover about its thick coarse edges -- Thomas Wolfe) Gross stresses crude animal inclinations and lack of refinement (merely gross, a scatological rather than a pornographic impropriety -- Aldous Huxley) (Clif Clawson, at forty, was gross. His face was sweaty, and puffy with pale flesh; his voice was raw; he fancied checked Norfolk jackets, tight across his swollen shoulders and his beefy hips -- Sinclair Lewis) (a spirituelle amoureuse, she is repelled by the gross or the voluptuary -- S. N. Behrman)\n\nObscene is the strongest of this group in stressing impropriety, indecency, or nastiness (it was, of course, easy to pick out a line here and there . . . which was frank to indecency, yet certainly not obscene -- H. S. Canby) (his innate belief that human flesh is in some way obscene. In the old days artists . . . had painted decently and had draped their figures -- Ellen Glasgow) (there are depths beneath depths in what happened last night -- obscure fetid chambers of the human soul. Black hatreds, unnatural desires, hideous impulses, obscene ambitions are at the bottom of it -- W. H. Wright) Ribald suggests rough merriment or crude humor at the irreverent, scurrilous, or vulgar (they had their backs to him, shaking with the loose laughter which punctuates a ribald description -- Mary Austin) (a ribald folksong about fleas in straw -- J. L. Lowes)\n\nIt should be obvious that what is one man's obscenity may be another's art. \"Beauty in things exists in the mind which contemplates them.\" D. Hume, Essays, Moral \u0026 Political at 22 (1742).\n\nThe Supreme Court has recognized the vagueness of the word \"obscene\" and its subjective quality. The highest court of the land has nevertheless decreed that certain publications or depictions, having to do with sex, which are offensive to the \"community\" (whatever that may be) can be punished, but it has set forth three requirements which must be met before a conviction can be sustained. These all contemplate that the initial decision as to whether a given publication or depiction is punishable shall be made by the trier of the fact, and that trier of the fact must have before it a legislative act which specifically defines the sexual conduct depiction of which is punishable.\n\nIt also must be told that it should apply the community standard to determine whether the particular description or depiction of sexual conduct specifically defined by the legislature appeals to the prurient interest and it must further decide whether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value. The triers of the facts in the cases before us could not have followed the\n\nprocedure designated by the United States Supreme Court, for the simple reason that they had before them no statute which meets the requirement of \"specific definition of sexual conduct\" which was laid down by the Supreme Court in Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973).\n\nThe majority has taken upon itself the responsibility of performing the functions, not only of the legislature, but of the jury and the trial judge as well.\n\nEven without the recent decision of the United States Supreme Court, I am convinced that RCW 9.68.010 should be held invalid, for it does not meet the preexisting constitutional requirement that it should describe the act forbidden in language sufficiently definite to enable a person of ordinary understanding to know what he is forbidden to do. State v. Reader's Digest Ass'n, supra.\n\nUnder the guise of \"authoritative construction,\" the majority of the court has added to and revised a legislative enactment. It does not pretend that a person charged in the words of the statute would be adequately apprised of his alleged offense, as is ordinarily the case where a criminal statute is sufficiently definite to render it constitutional. It is obvious that a proper charge will have to include a listing of those depictions or descriptions which the court has today found to be offensive and has assumed that the legislature would, if given the chance, have concurred in.\n\nEven if it is assumed that the majority's list of horrors -- though perhaps it would not be considered exhaustive in the judgment of a connoisseur of erotica -- includes only postures and acts which the legislature would be likely to find sufficiently offensive to include them in its specification, it is still not the court's duty or prerogative to compile such a list.\n\nI seriously doubt that the morals of the community would be irretrievably shattered if the court should exercise the restraint which it properly imposes upon itself where unconstitutional statutes are brought before it and\n\nshould leave to the legislature the task of amending the statute.\n\nI would reverse the convictions.\n\nUtter, J. (dissenting)\n\nThe majority has done a masterful job in organizing the discussion of these complex cases. While I am in agreement with much of what is said by the majority, there are two areas where new guidelines are applied that cause me great concern. Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973); Paris Adult Theatre I v. Slaton, 413 U.S. 49, 37 L. Ed. 2d 446, 93 S. Ct. 2628 (1973); United States v. Orito, 413 U.S. 139, 37 L. Ed. 2d 513, 93 S. Ct. 2674 (1973); Kaplan v. California, 413 U.S. 115, 37 L. Ed. 2d 492, 93 S. Ct. 2680 (1973); United States v. 12 200-Ft. Reels, 413 U.S. 123, 37 L. Ed. 2d 500, 93 S. Ct. 2665 (1973).\n\nMy concern is derived from what I believe is the need to obtain a clear statement by the proper legislative body of what descriptions and depictions are or are not obscene, and the need to enforce these standards in such a way that inconsistent verdicts will not be rendered on the same materials under the same law in the same jurisdiction.\n\nFirst, the majority opinion fails to follow the United States Supreme Court's requirement that the applicable state law specifically define the proscribed depiction or description of the offensive sexual conduct before an obscenity prosecution may succeed. Miller v. California, supra at 23, 24. The state obscenity law here to be applied fails to comply with the court's required specificity in describing the acts that are forbidden and this court should not impose its own definition of obscenity on the statute in an effort to supply what is lacking.\n\nSecond, though the majority opinion holds the relevant \"community standard\" under the Roth-Miller guidelines (Roth v. United States, 354 U.S. 476, 1 L. Ed. 2d 1498, 77 S. Ct. 1304 (1957)) is statewide, it fails to apply it in these cases. None of the prosecutions herein was measured by a statewide community standard. Inasmuch as our state statute\n\ndoes not comply with the specificity now required, and these cases fail to employ a state community standard, I would reverse the convictions.\n\nThe United States Supreme Court recognized in these recent obscenity decisions \"the inherent dangers of undertaking to regulate any form of expression\" and thus required that \"[s]tate statutes designed to regulate obscene materials must be carefully limited.\" Miller v. California, supra at 23, 24. The Supreme Court therefore found obscenity regulation must be confined solely to the depiction or description of sexual conduct, which must, in turn, be specifically defined by the applicable state law. In so ruling, the Supreme Court did not provide the regulatory scheme by judicial pronouncement but deemed it must await the \"concrete legislative efforts\" of the states.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Miller v. California, supra at 25.\n\nThe majority of this court declines to await our state's legislative effort to provide the now necessary concrete and specific definitions of obscenity. Rather, the majority proceeds, under a claim of statutory construction, to provide the demanded specificity of what is to be obscene, to a state statute which fails to so provide.\n\nRCW 9.68.010(1) and (2),\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e by simply prohibiting anything \"which is obscene\", totally fails to provide for the\n\nspecificity and fair notice in criminal statutes the Supreme Court now requires in the obscenity regulation area.\n\nThe United States Supreme Court acknowledged that a state obscenity statute may be limited \"as written or construed.\" Miller v. California, supra at 27. Yet, the majority here does not construe the word \"obscene\", but gives it definition.\n\nOur settled rules of statutory construction state that words in a statute are to be given their usual and ordinary meaning. Bixler v. Hille, 80 Wash. 2d 668, 497 P.2d 594 (1972); Rena-Ware Distribs., Inc. v. State, 77 Wash. 2d 514, 463 P.2d 622 (1970). In defining ambiguous statutory language we must determine the legislative intent in order to give it effect. Champion v. Shoreline School Dist. 412, 81 Wash. 2d 672, 504 P.2d 304 (1972); In re Estate of Bracken, 56 Wash. 2d 17, 351 P.2d 151 (1960). However, in this area of law which the Supreme Court characterizes as \"the intractable obscenity problem\" and is seeking \"to formulate standards more concrete than those in the past\" we should recognize the futility in judicially defining the word \"obscene\" and leave this to a clear expression by the people through the legislative process. Miller v. California, supra at 20.\n\nThe majority of this court, by imposing its view of what is to be deemed obscene in this state,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e exceeds our proper judicial function. Our duty is not to draft criminal statutes but to construe them, and where precision is absent, the legislation must be returned to the legislature and not rewritten by a court.\n\nThe majority's \"construction\" is \"measured by common understanding and practice\" which assumes an agreement among the people as to what is obscene. Such assumptions should be left to the legislative process.\n\nGiven that there is no ordinary meaning to that word and the legislative intent as to any specific prohibition is unknown, for the majority decision to announce the specific acts forbidden seems to me to violate the concept of separation of powers and should be avoided.\n\nThe Supreme Court in these recent obscenity decisions rejected a \"national standard\" by which to measure obscenity and affirmed convictions based on jury instructions recognizing a state community standard. Miller v. California, supra at 30; Kaplan v. California, supra at 121. Given this ruling, the majority here holds the community is the \"state\". I agree in this holding as I believe it is the only appropriate standard where prosecution is under a state statute. Such uniformity ought to be promoted, particularly where criminal sanctions are imposed.\n\nMy disagreement with the majority is that after announcing a new state community standard by which obscenity is to be determined, it proceeds to ignore it because \"hard-core pornography can and does speak for itself\".\n\nThe effort by the Supreme Court to provide the nation with revised constitutional guidelines for determining what is and what is not \"obscene\" sought to provide concrete \"specific prerequisites\" to obscenity convictions. Miller v. California, supra at 27. The need for prosecutions to come within the guidelines established is recognized at page 594 of the majority opinion when it states: \"The three elements of the [ Miller v. California ] test must coalesce before material may be proscribed as 'obscene'\".\n\nYet, despite these efforts to announce and employ specific standards in order to avoid subjective censorship as much as is possible, the standards are apparently abandoned by the rule that the allegedly obscene materials \"are the best evidence of what they represent\" thus not requiring \"affirmative evidence that the materials were obscene . . .\" Paris Adult Theatre I v. Slaton, supra at 56.\n\nOne difficulty this rule raises for reasoned appellate review of obscenity prosecutions is illustrated by those convictions now before us which were obtained solely by the introduction of the materials into evidence, followed by judicial determination that they were \"obscene\". If a judicial finding of obscenity is sufficient from only viewing the material, how on appellate review, recognizing our rules of \"substantial evidence\" for findings of fact, are we to determine\n\nif the appropriate \"community standard\" has been properly applied? Our only recourse would be to review the materials, ourselves act as censors, and come to a majority conclusion as to their criminality.\n\nI regret it is this exact procedure which is adopted by the majority when they conclude: \" Our own independent review of the materials leaves us with no question that they are an affront to the contemporary community standards of this state, in the area of sexual matters . . .\" (Italics mine.) It is just such a censorship board review that should be avoided by application of precise standards.\n\nThe United States Supreme Court's only guidance in this regard is its statement that:\n\nThe adversary system, with lay jurors as the usual ultimate factfinders in criminal prosecutions, has historically permitted triers of fact to draw on the standards of their community, guided always by limiting instructions on the law.\n\nMiller v. California, supra at 30. Presumably, these limiting instructions of law include the appropriate community standard and its explanation. If no evidence is necessary on this question of what is the community standard, how is it possible to provide a meaningful instruction or for appellate courts to ultimately review whether the standard has been applied? In cases where jurors are not the factfinders, summary findings of obscenity without proof on the community standard, invites excessive reliance on the subjective judgment of an individual judge whose solitary views may or may not reflect community standards.\n\nWhere the true imposition of community standards is sought it would seem to me that it is necessary to have proof of what the affected community believes appeals to the prurient interest and portrays sexual conduct in an offensive way. Only in this fashion may we avoid the curious presumption that the material viewed, and not the beholder, speaks in judgment.\n\n\u003cspan class=\"fn\"\u003e1. As stated in Miller v. California, 413 U.S. 15, 37 L. Ed. 2d 419, 93 S. Ct. 2607 (1973), the conduct must be specifically defined by the applicable state law as written, or as authoritatively construed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We authoritatively construe RCW 9.68.010 in the light of, and as limited by, the Roth-Miller test. In short, quoting from Miller v. California, supra at 24, the basic guidelines for the trier of fact must be: \"(a) whether 'the average person, applying contemporary community standards' would find that the work, taken as a whole, appeals to the prurient interest, . . . (b) whether the work depicts or describes, in a patently offensive way, sexual conduct specifically defined by the applicable state law; and (c) whether the work, taken as a whole, lacks serious literary, artistic, political, or scientific value.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In this regard attention is directed to United States v. 12 200-Ft. Reels, 413 U.S. 123, 37 L. Ed. 2d 500, 93 S. Ct. 2665 (1973), in which the United States Supreme Court, commenting upon a federal statute, using many words similar to those in RCW 9.68.010, had this to say in footnote 7, page 130: We further note that, while we must leave to state courts the construction of state legislation, we do have a duty to authoritatively construe federal statutes where \"'a serious doubt of constitutionality is raised'\" and \"'a construction of the statute is fairly possible by which the question may be avoided.'\" . . . If and when such a \"serious doubt\" is raised as to the vagueness of the words \"obscene,\" \"lewd,\" \"lascivious,\" \"filthy,\" \"indecent,\" or \"immoral\" as used to describe regulated material . . . we are prepared to construe such terms as limiting regulated material to patently offensive representations or descriptions of that specific \"hard core\" sexual conduct given as examples in Miller v. California. . . (Italics ours.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The statute has since been amended by Laws of 1969, 1st Ex. Sess., ch. 110, § 1, p. 823.\u003c/span\u003e\n\n",
    "body_length": 149804,
    "citedas": [
      "512 P.2d 1049",
      "82 Wash. 2d 584"
    ],
    "attorneys": "Young \u0026 Hoff and Victor V. Hoff, for appellant-defendants. Donald C. Brockett, Prosecuting Attorney, and James B. Crum, Deputy, for respondent Spokane County. Christopher T. Bayley, Prosecuting Attorney, and Kenneth W. Sharaga, Deputy, for respondent King County. Christopher T. Bayley, Prosecuting Attorney, and Kenneth W. Sharaga, Deputy, for appellant State. Victor V. Hoff, for respondent.",
    "category": [
      "36",
      "75"
    ],
    "judges": "En Banc. Stafford, J. Hale, C.j., Finley, Hunter, Hamilton, and Wright, JJ., concur. Finley, Hamilton, Stafford, and Wright, JJ., concur by separate opinion; Rosellini and Utter, JJ., dissent by separate opinions; Brachtenbach, J., did not participate in the disposition of this case.",
    "citation_count": 14
  }
}
