{
  "id": "mIDJGJQBep42eRA9fnM7",
  "document": {
    "title": "People v. Molano",
    "full_title": "The PEOPLE, and v. Carl Edward MOLANO, and",
    "jurisdiction": "California Supreme Court",
    "date": "2019-06-27T00:00:00+0000",
    "docket": "S161399",
    "body": "Opinion of the Court by Corrigan, J.\n\n*628Carl Edward Molano was convicted by jury of first degree murder, with the special circumstance that the murder was committed during a rape.1 After he waived jury on prior conviction allegations for spousal abuse with great bodily injury and two rapes, the court found the allegations true. After the jury returned a verdict of death, the court imposed that sentence. This appeal is automatic. We affirm the judgment in full.\n\n*629I. BACKGROUND\n\nA. Guilt Phase\n\nOn June 16, 1995, friends of Suzanne McKenna had been unable to reach her by phone and went to her cottage in Hayward. Judy Luque knocked on the front door but received no response. Peering through the blinds, she saw a heavy-set man with brown hair standing in McKenna's kitchen, wearing a blue Pendleton shirt. She yelled to her husband, Jeff, as the man left through another door. Jeff ran to the side of the cottage and saw a man walking quickly away, carrying something in his arms.\n\nJeff shouted at him and the man began to run. Jeff gave chase but lost sight of him. Meanwhile, Judy entered the cottage. There was garbage all over the kitchen floor and a foul smell. The living room appeared to have been ransacked. Judy called for McKenna but heard nothing. She left and a neighbor called 911. Alameda County sheriff's deputies responded, searched unsuccessfully for the fleeing suspect, then entered the cottage. A trail of fecal matter led from the living room to the bathroom, where they found McKenna's corpse. There was a Reebok shoe print on the bathroom floor.\n\nMcKenna's face was purple. A bra, panties, and a strip of leather were wrapped around her neck. Rigor mortis had set in. There was no sign of forced entry. Some fingerprints were recovered, but none were useful. The deputies found a tin of condoms, as well as an empty condom wrapper on the couch. Two tubes of personal lubricant were found nearby. Various items of McKenna's property, along with a *9pair of Reebok shoes, were discovered in the surrounding neighborhood.\n\nThe pathologist testified that it would have taken \"a couple of minutes\" for McKenna to lose consciousness when she was strangled, and another one or two minutes before she died. The greatest pressure had been applied to the front of her neck. One breast bore abrasions that could have come from a blow or a bite. There were contusions on her face, which could have been inflicted by a fist or open hand. Abrasions on her back and buttocks were consistent with having been dragged across the floor. The vagina and anus showed no signs of trauma.2 Sperm was **863detected on a vaginal swab. A toxicology screen showed a blood alcohol level of .15 percent, with 40 micrograms per liter of methamphetamine. The latter level was considerable, and reflected illicit rather than prescribed usage. *630Biological samples were preserved. Strands of hair were found wrapped around the strip of leather used as the ligature. In 1995, the crime lab was not able to do DNA testing. When no leads developed, the investigation was put on hold.\n\nIn May 2001, defendant's wife Brenda brought their 13-year-old son Robert to the sheriff's station.3 Robert had recently told his mother about an encounter with defendant in 1995, when they lived near McKenna, and he wanted to tell the police about it. While he and some friends were playing outside, he had seen defendant jogging from the area of the cottages behind their apartment complex. He knew defendant socialized with residents at the cottages. About 20 minutes later, Robert and his friends heard a commotion at the crime scene and decided to go see what was happening. When he went to a storage unit to get his bicycle, he found defendant inside, sweating and holding a barbecue fork. Defendant said he would kill Robert if he told anyone where he was. Frightened, Robert returned to his friends.\n\nBrenda also gave a statement to the police. At 7:00 a.m. on the day of the investigation, she had been getting ready for work. Defendant came into the apartment, without his shoes and appearing nervous. He said that he had been partying with a couple in one of the cottages, when the man got into an argument with the woman and choked her to death. Brenda told defendant to go to the police, but he replied that the man had threatened to kill his family if he did so. Defendant left the apartment, wearing a blue Pendleton shirt. Brenda was upset and called in sick. That afternoon, a sheriff's deputy came to the door and told her a suspect had been seen in a neighboring apartment where someone was killed. Defendant returned about three hours later, and said he had gone back to the cottage to wipe away his fingerprints. The dead woman's brother had come in and seen him. He ran because he was anxious about being seen. He changed his clothes, cut his hair, and shaved off his mustache. He and Brenda drove to the San Leandro Marina, where defendant threw the Pendleton shirt in the water. Brenda did not then suspect he was the killer.\n\nThe investigation was reopened after Brenda and Robert came forward. Judy Luque identified defendant in a photographic lineup as the man she had seen. One of the Reebok shoes found near the cottage tested positive for Brenda's DNA. Defendant's DNA was detected on the leather ligature. The analyst was unable to *10recover a DNA profile from the sperm sample.\n\nDefendant gave a series of statements to investigating sheriff's deputies and the district attorney, as set out more fully below. He admitted having *631consensual sex with McKenna and claimed McKenna had asked him to choke her during the encounter. He tied her panties and bra around her neck but did not intend to kill her. Realizing she was dead, he panicked, dragged her body into the bathroom, and tried to clean up. He returned to McKenna's cottage the next day to make sure he hadn't left anything inside.\n\nThe prosecution introduced evidence of defendant's violence against other women. In 1982, he sexually and physically assaulted 19-year-old Anne H. Defendant visited Anne when her husband was out of town. He was friendly at first, but when Anne resisted his sexual advances, he forced himself on her, choking and threatening to kill her. He raped and sodomized her, then forced her to orally copulate him. He threatened to kill her unless she agreed he could visit again. Anne reported the assault and defendant ultimately pleaded guilty to one count of rape.\n\nIn 1987, defendant sexually assaulted 60-year-old Mabel L., whom he had known since his childhood. Late one night he appeared at her door and asked to use the bathroom. Inside, he knocked Mabel to the ground and raped her. When he drew a knife, Mabel pleaded for her life and promised not to report the attack. Defendant stabbed her in **864the back, knocked her down, and choked her. Mabel was able to get free and defendant fled. Mabel reported the assault. Defendant pleaded guilty to forcible rape and use of a knife.\n\nIn 1996, defendant physically assaulted his wife, Brenda, choking her to unconsciousness. She awoke to find her wrists and hands tied and a pillowcase shoved in her mouth. Defendant returned and again choked her. When she awoke a second time she was no longer bound and defendant was gone. It took six months for her voice to return to normal. Defendant subsequently pleaded guilty to corporal injury on a spouse, admitting to a probation officer: \" I choked my wife. I was under the influence of crack and I got paranoid. I thought she was going to call the police.\"\n\nDefendant presented no evidence in his defense at the guilt phase.\n\nB. Penalty Phase\n\n1. Prosecution Evidence\n\nMcKenna's brother, Ronald testified he and his children had been close to the victim. Her death devastated the entire family. McKenna had been very supportive of her sister, Patti Dutoit, who struggled with alcoholism and psychological problems. Dutoit was a recluse and McKenna was her lifeline to the outside world. Dutoit died in 1996. Ronald commented that he \"lost two sisters because of this clown,\" referring to defendant. McKenna was *632estranged from her sister Lori, but had a close relationship with her 10-year-old nephew, Michael. After McKenna's death, Lori had a \"breakdown\" over the estrangement. It was very painful for her to explain McKenna's death to Michael.\n\n2. Defense Evidence\n\nDefendant's single mother raised him and his siblings. His half-brother, Ernest Molano, testified that their mother spanked them with her hand, a belt, or anything else she could grab. He felt that their mother loved them and only punished them when they deserved it. They always had food, clothing, and a roof over their heads.\n\nDefendant's former girlfriend, Bonnie Alexis, testified he was good with young *11children, including his own niece and Bonnie's son. Defendant supported Bonnie and helped her during difficult times. Another friend, Evelyn Horne, said defendant was kind and had helped her leave an abusive relationship. Other family members and friends likewise described defendant as a good person and role model who was close to his family and helpful to others.\n\nSeveral correctional officers testified about defendant's behavior in prison. They reported that defendant had a good attitude and work ethic and got along well with other inmates.\n\nPsychologist Rahn Minagawa compiled defendant's social and family history. Defendant's mother had seven children by different men, and his father's identity is unknown. The mother was verbally and physically abusive. She whipped him, said she hated him, and wanted to give him up for adoption. He began drinking when he was 12 years old, and began using cocaine in high school.\n\nNeuropsychologist Myla Young assessed defendant's IQ to be 85. His previous test scores were 109 in 1982 and 94 in 1988. He has significantly impaired attention and mild impairment of verbal memory. His cognitive flexibility and executive functioning are impaired, undermining his ability to conceptualize and plan. Neuropsychological testing and brain tomography suggested damage to his hippocampus and frontal lobe. Test results showed no evidence of malingering. Young opined defendant would function well in a structured environment.\n\nFrank Agee, a chaplain at the Santa Rita Jail, met with defendant weekly for several months before his trial. He described defendant as a born-again Christian who had experienced genuine spiritual growth.\n\n*633Retired correctional officer Daniel Vasquez testified that people sentenced to life without the possibility of parole do not receive conduct credits and are not allowed outside the prison walls.\n\n**865II. DISCUSSION\n\nA. Guilt Phase Issues\n\n1. Admissibility of Defendant's Statements\n\nDefendant argued his statements to officers and the district attorney were taken in violation of his rights to remain silent and be assisted by counsel. ( Miranda v. Arizona (1966) 384 U.S. 436, 86 S.Ct. 1602, 16 L.Ed.2d 694 ( Miranda ); Edwards v. Arizona (1981) 451 U.S. 477, 101 S.Ct. 1880, 68 L.Ed.2d 378 ( Edwards ).) On appeal, he challenges the court's denial of his suppression motion. When reviewing a Miranda ruling, \"we accept the trial court's determination of disputed facts if supported by substantial evidence, but we independently decide whether the challenged statements were obtained in violation of Miranda .\" ( People v. Davis (2009) 46 Cal.4th 539, 586, 94 Cal.Rptr.3d 322, 208 P.3d 78 ; see People v. Bradford (1997) 15 Cal.4th 1229, 1311, 65 Cal.Rptr.2d 145, 939 P.2d 259 ( Bradford ).)\n\nDefendant gave three taped statements to law enforcement officers. The first was made at San Quentin State Prison. The second occurred in a patrol car while defendant was driven from prison to the sheriff's substation. The third was made the same day at the station. An audiotape of the prison interview and a videotape of the station interview were played for the jury. The conversation in the patrol car was not offered in evidence.\n\nDefendant claims he was deceived into waiving his Miranda rights at the outset of the San Quentin interview. He urges he did not reinitiate communication with the *12officers after invoking his Miranda rights, rendering subsequent statements inadmissible. He argues he invoked his right to counsel a second time during the drive to the station. He also contends his apparent waivers of Miranda rights at the station were involuntary because the officers disregarded his invocations and attempted to soften him up during the transport. We hold to the contrary.\n\na. Background\n\ni. The San Quentin Interview\n\nOn March 21, 2003, six years after the murder, Sergeant Scott Dudek and Detective Edward Chicoine went to San Quentin to interview defendant.\n\n*634They knew he was scheduled to be released from prison in about two weeks. His criminal record reflected two prior rape convictions as well as the spousal assault for which he was then incarcerated. Chicoine testified that he and Dudek concocted a \"ruse,\" planning to present themselves as \"290 investigators\" looking into defendant's past sexual offenses before he returned to the community. (See § 290 et seq. [Sex Offender Registration Act].) Although Chicoine was in fact responsible for monitoring released sex offenders, he was also a homicide investigator and his true goal was to talk about the McKenna case.\n\nThe interview was tape recorded, though there was some preliminary conversation before the recording began. Chicoine and Dudek identified themselves as deputies with the Alameda County Sheriff's Department. At the beginning of the tape, Chicoine said: \"Ok. Carl, like I've explained to you before we want to talk to you about some of your past crimes and some of the sex registration laws and things like that. Before we do that, I had mentioned to you before that we're going to read you your rights ....\" Chicoine then recited the Miranda rights. Defendant said he understood them, was willing to talk, and signed a written waiver. As he was filling out the form, he asked if his parole would be affected \"[i]f I don't answer any of these questions.\" Chicoine replied, \"No, absolutely not.\"\n\nWhen defendant asked if \"[y]ou do that for everybody now? All the sex registrants?\" Dudek replied it was \"our normal procedure.\" Chicoine explained: \"I list every single sex registrant that comes across my desk, I look at.\" \"Every single one and I'm constantly on the phone and I have two files full.\" Chicoine said, \"And here's, here's one of the things that I do just so you know, is that, you know, especially when you're out there your whole goal in life is you want to stay in my file. I mean you're going to be there for life anyhow.\" Defendant echoed that he would be \"there for life anyway.\" Chicoine said, \"Right. But you want to stay [i]n the filing cabinet.\" Defendant said \"Yeah.\" Chicoine continued, \"If you're causing a problem or if **866I'm getting called or whatever else, then it gets put in a red file and it sits on my desk and I have about 4 or 5 of them on my desk at any time. And those are the guys that I'm looking for. Those are the guys I'm going after. So, the goal ... objective is to stay in the file and stay off my desk. Correct?\"4 Defendant's response is not audible, but Chicoine followed up with \"All right.\" *13*635For about an hour, they discussed defendant's job prospects, family background, substance abuse issues, and prior offenses. After reviewing the assault on Brenda, Chicoine told defendant \"we want to look at other things to see if, you know, maybe you have an involvement in, in other situations that were out in that area.\" He asked if defendant remembered \"an incident where there was a girl that died?\" Defendant said, \"My neighbor next door.\" He did not remember her name, but said he had \"a drink at the manager's house with her and we got high at the manager's house together.\" Dudek showed defendant a picture of McKenna, and defendant recognized her as \"my neighbor.\" Chicoine gave her name \"Susan McKenna,\" and defendant acknowledged \"we called her Sue.\" He said at the time of the murder his parole officer had asked him if he knew anything, and he told her \"no.\"\n\nThey talked about defendant's use of drugs with McKenna and asked if he had a sexual relationship with her. Defendant admitted that he did, saying it was a \"hit and run,\" a single occasion a day or two before her death. He was surprised no one had come to see him after she died, \"because I know what my record looks like.\" He said they had had \"[r]egular missionary style sex,\" and answered \"No\" when asked if it was \"rough sex.\" He said \"it was just spontaneous sex.\" He denied biting her.\n\nChicoine asked if anyone had suspected him of the murder. Defendant said, \"Yes,\" even his wife \"thought so.\" When Dudek inquired what he had told his wife, defendant became reticent, and said he needed to go to the bathroom. He admitted, \"I told Brenda I know what happened,\" then again asked to use the restroom. Pressed by Chicoine for \"the gist of what you told Brenda,\" defendant said \"It was so long ago, I cannot remember. I'm not going to bullshit you.\" The tape recorder was turned off and defendant went to the restroom. When he returned, he invoked his Miranda rights. The officers turned the recorder back on, and said defendant wanted \"to tell us something specifically.\" Defendant said, \"No disrespect to both of you gentlemen. I understand where this is leading to, this conversation and I would rather not say anything else until I have a public defender of mine.\"\n\nThe officers stopped the interrogation and said they had a search warrant for blood and buccal swabs, dental casts, and his shoes. They said if he wanted to talk to them again, \"You have to initiate the contact.\" Defendant said he understood and asked if they had a card. They each gave him one, and repeated that he needed to initiate contact, telling him to \"get ahold of the guards here\" and say \"I want to talk.\" Defendant responded, \"[or] my counselor [or my captain or something].\" The tape recording ended. Chicoine testified that defendant said he wanted to tell them what happened, but would like to talk to a counselor first, which Chicoine understood to mean a religious counselor. Defendant said he would call them after he had that opportunity.\n\n*636Chicoine conceded that defendant's final statements about wanting to talk after consulting a counselor were not on the tape, or in his police report, written five days later. A supplemental report from April 3, however, includes the following summary: \"Molano had previously invoked his right to an attorney during an interview ... on 3/21/03. At that time, Molano told us that he intended to call us and tell us everything about his involvement with Suzanne McKenna's murder, but said he wanted to have a counseling session with his psychologist first. Dudek explained **867to Molano that we would not be able to contact him, and that if he wanted to tell us anything regarding *14the crime, he would have to contact us.\"\n\nThe officers finished collecting samples from defendant, and informed prison staff of his status as a suspect. Chicoine said it was understood that he would be placed in a \"more secure situation, because of the possibility of [a] criminal complaint coming down in the future.\"\n\nii. The Conversation in the Car\n\nA complaint was filed on March 27, 2003, charging defendant with murder. An arrest warrant issued, and on March 31, Dudek and Chicoine drove to San Quentin to take defendant into custody. They told him he was under arrest for the murder. Chicoine testified that when the officers first encountered defendant in a receiving area at the prison, he told them \"that he had been meaning to call us, that he had already talked to a counselor and that he intended to call us.\" There had been no contact with defendant since the last interview, but he said \"[h]e knew we'd be coming back.\" Chicoine understood defendant's statements as a reinitiation of the discussion at the end of the March 21 interview, when he had said \"he did want to talk to us, he wanted to explain what was going on.\"\n\nThe court asked if that was only what Chicoine thought defendant meant, or if defendant expressly said he wanted to talk to them. Chicoine answered, \"It sounded to me that that's exactly what he meant.\" The court commented, \"But he didn't overtly say 'I want to talk to you now.' \" Chicoine said, \"Yes, he did. He said he wanted to talk to us. He had already talk[ed] to his counselor and that he meant to call us.\" Chicoine told defendant \"to wait\" and that \"we would get an opportunity to talk to him later.\" On cross-examination, Chicoine said he could not remember defendant's exact words, \"but I know that it was very close to - he said that he wanted to - that he meant or intended to call us, and that he had just wanted to get this over *637with.\" The court asked whether defendant made this statement before or after being told he was under arrest. Chicoine could not remember the sequence of the exchange.5\n\nDudek drove from San Quentin to the station. Chicoine sat behind him and defendant was in the right rear seat. When they got into the car, Dudek turned on a tape recorder placed on the front passenger seat. At the outset of the ensuing conversation, Dudek asked defendant if he had \"any questions or anything.\" Defendant said he was \"in limbo.\" Dudek replied, \"You're in limbo?\" \"Is that, is that a good thing or a bad thing being in limbo?\" Defendant said he didn't know. Dudek asked him, \"Know what's going on or no?\" Defendant replied, \"[No,] run it down.\" Chicoine told defendant he would be arraigned, \"hopefully on Wednesday.\" After a pause, defendant asked, \"What's it look like I'm facing?\" Dudek said \"obviously we can't tell one way or the other, but, I don't know. You understand the charge, right?\" Defendant gave an affirmative response, and silence ensued.\n\nDudek resumed the conversation, saying \"I've seen better, I've seen worse. That's a pretty chicken shit answer but ....\" \"And obviously we'd like to have an explanation, but we're not in that position because of what you said the other day, but if you'd like to give an explanation then we're gonna give you another opportunity once we get to our station. That's kind of where *15we're at right now. And obviously, you know, we're a little bit more at liberty to tell you some things that we didn't tell you the other day that we can tell you now. That'll come out if you want it to, but [you kind of hold the,] you're kind of in control here right now to say yeah, go ahead and tell me or I don't give a shit, I'll find out sooner or later, so ....\"\n\nDefendant said, \"Tell me.\" Dudek replied, \"Alright. Does that mean you want to talk to us again or does that mean you just wanna, let me explain what's gonna go on now and then maybe [you'll answer] our questions.\n\n**868You're gonna go back, we're gonna put you in an interview room, we're gonna read you your rights again, we're gonna go over the fact that we were out to talk to you a week ago, ten days ago actually it is now, and at that point you talked to us a little bit and you said hey, at this point here you want to talk to your counselor, you wanted to talk to whoever, and, and, we'll go over that again ... if at that point you say I wanna know a little bit more, I wanna talk to you about it a little bit more then we'll go from there, and that's where we're at, OK?\" Defendant said, \"[All right].\"\n\nDudek continued, \"So, even if it's one sided and you say hey, I want to talk to you and you don't say nothing, you gotta tell us I want to have the *638conversation be more of a two-sided conversation. Cause I think that's only fair to us and you've been in the system, you know what I mean? I'm not here to clown you, like I told you the other day, you know. And it's only right that you say yeah, let's go ahead and I want to hear what's up, and then once you give us that, and if you decide at one point again, you know what, I'm hurting enough, and, and then we stop again, so. I think truthfully, and you know this too, and you even said it, that, you know, you, I think you did want to go on with a little bit more, and I think there's probably stuff that you do want to share with us that we may not know about, but ... [¶] ... Now ultimately ... [¶] ... You know, and the bottom line is too, is, is, is ultimately there's always a story behind everything, and unfortunately when it comes down to the charging part of it, we're, we're, this is kind of a one shot deal here. You get your [opportunity to] say this is where we're at, or let's see how it shakes out, and then that's [a decision you,] Carl Molano the, the, the, the 46, 47 year old [dude's gotta make]. I, I can't, Scott or Ed can't do that for you. You have to do it on your own, you know what I mean?\"\n\nAt this point Chicoine interjected, \"Right now, there's a story [that's being told, but it doesn't have your side].\" Dudek resumed, \"I'll be more than happy, and so would Ed, we'd [be] more than happy to share exactly, you know, how the story even started. Why are we at this point after so many years, and, and, and, you know, a lot of that has to do with, with your family and, and, and, and it's only fair that you know that cause you are gonna know and my credibility and Ed's credibility with you is gonna mean everything as far as this goes. If you think I'm a big bullshitter, horse's ass, and you think he is, there's no sense of us even going any further, you know what I mean? And you're gonna find that what we tell you is ultimately, you know, we're not bullshitting you, so.\"\n\nDefendant said, \"No, you guys been straight up.\" Dudek replied, \"I mean we're, we're trying to be that way cause this is what we do. You, you got to do what you got to do, we got to do want we got to do, you know what I mean, and, and I was up front with you when I said the other day, I said I, I mean, I know Suzy's not an angel, or wasn't an angel, you know what I mean, and, and there could be some other *16factors, but that, that's ....\" At this point Dudek evidently took a wrong turn, which interrupted the conversation briefly. He resumed with, \"like Ed said, there's two sides to every story, you know what I mean? I mean, you can tell by where we were going that we obviously talked to a bunch of people and somebody, you know, and, and, quite frankly, you know, we talked to your ex old lady who told us some stuff and we talked to some other people, so that's kind of, that's kind of where we're at.\"\n\nDefendant said, \"I ought to be arraigned Wednesday [and assigned a] (unintelligible).\" Dudek told him, \"[Nuh.] You'll probably just be arraigned, *639they'll ask you your financial status, more than likely you'll be assigned a PD your next court appearance, but you could get one right off the get go on something like this, I'm, I'm, probably you will actually.\" Defendant said, \"Can I ask you a question?\" Dudek answered, \"Sure.\" Defendant said, \"They assign me a PD, right?\" Dudek said, \"Right.\" Defendant said, \"I can sit down and talk to my PD first, then talk with you all?\" Dudek replied, \"Yeah.\" Defendant said, \"Can I do that?\" Dudek told him, \"Yeah. I mean, that's one of your options and that's why we're here, you know.\" Defendant said, \"That's, I would, I would (unintelligible).\" **869Dudek responded, \"Ok. If you're [gonna go through] that formally when we get to the tape, we're gonna say Carl Molano, you understand you're being charged with this, and then, ... and then we're gonna go through the rights thing again. It's at that time, you know, you can say hey, let me talk to my PD and I'll talk to you again, but, you know, that's entirely up to you. We're here only to do shit on the up-and-up. If we don't do it on the up-and-up then we might as well just throw it away right now, you know what I mean?\"\n\nAfter a pause, Dudek said, \"I know I read some of your letters and I know you know I read them, when you were, you were out there the other day with your other daughter, your daughter there, the 4.0 whiz kid there, you know. I, I can't think of, Regina, is that her name?\" Defendant said, \"Jasmine.\" Dudek said, \"It sounds like you're starting to, you know, at least head in the right direction there with a relationship with her. Irregardless whether you talk to us or not, when we get to our station I think it's only fair that you know that, is it Robert? Robert's your 17 year old son? Robert played a fairly key role in this as far as where we're at right now, and I just don't want it to be a, a, a mind blower from you when it comes out, ok? So, that's kind of, you know, you've got one relationship by your own admittance you're trying to get back together when you were talking to us the other day, and, and really said you hadn't talked to Robert or your other, was it son, from, from your that wife?\" Defendant said, \"Yeah.\" Dudek continued, \"But I think what I'm asking you probably, from my standpoint [as a dad and stuff,] that you've got to rebuild and don't take it out on your kids. They, they had to do what they had to do, so, you know what I mean?\"\n\nDudek continued, \"Ok. So, unfortunately, Robert's had a lot of problems over the years because of, you know, the stuff and, and Robert felt he had to do what he had to do, and you'll probably never have a relationship with Robert, but in the scheme of things hopefully you'll, you'll view it as Robert's becoming a man, that type of thing, you know what I mean? And I think the reason I'm telling you this is because when I first talked to your ex-wife, the first thing was well, of course she's coming forward because she *640can't stand your guts because, you know what I mean?\" Defendant said, \"Yeah I know.\" *17Dudek said, \"So that's something that, that the whole thing weighed on, so.\"\n\nAfter an extended pause, Dudek asked about the temperature in the back seat, then opened a new topic: \"Other thing too is, and then this is just kind of [weird], obviously this, this murder occurred in 1995. It's gonna be fairly a, a big deal in the newspapers and probably even the media and stuff because it's, you know, it's an eight year old homicide, so I'm just kind of preparing you for that. I don't know, I mean I know your mom's not around anymore, but if you think there's somebody you may want to prepare for it, you may want to let us know that so we can tell them before they hear it on the 7 o'clock news [tonight], i.e. your, your daughter, or whoever else, know what I mean?\"\n\nAfter a long pause, there was some talk about the art work defendant had done, and his life in prison. After another extended pause, Dudek asked if defendant had told anyone about their previous visit. Defendant said inmates had seen them, but Dudek said, \"I meant family or something, not inmates.\" Defendant asked, \"I can give you two numbers to call?\" Dudek said, \"I can let you call two numbers, how's that? I don't really like to tell people what's up. I'd rather have them hear it from you, or, you know, I mean if you don't want to do that I understand, but it's up to you. That's a decision you can make from now until the 150th exit, right?\" This was a reference to the freeway exit for the station. Defendant said, \"Yeah.\" After some further conversation about defendant's other son who was serving a prison term in New York, there was a long pause broken by defendant saying, \"Hey.\" Dudek replied \"[Heyo],\" and defendant said, \"[I have a question,] if I want to get this over with as soon as possible, right?\" Dudek said, \"Uh-huh.\" Defendant asked, \"Who [do I talk] to? [PD? DA?]\"\n\nDudek said, \"Yeah, you mean you just wanna plead and get, get on with your time?\" Defendant said, \"Yeah.\" He wanted to be \"sentenced, you know, or whatever.\" Dudek **870said, \"We can, we can let the DA know that that's your, your wish[es] ... I mean, they're, they're gonna go on the guidance of your PD anyway ....\" Defendant said, \"Yeah,\" and commented, \"PD doesn't (unintelligible).\" After some discussion about waiving time, Dudek told defendant, \"It's going to be up to you.\" He explained, a defense attorney would be \"[t]here to advise you, but you, you're still in the driver's seat, you know, it's your defense. I mean, he's there to advise you, but if you say hey, you know, you're still a young guy, let's just get on with this so I can ...\" Defendant said, \"I'm the only one that [holds it]. I actually, you know, it's like [at the house? I have the keys to all the doors].\" Dudek said, \"Exactly.\" *641After a pause Dudek said, \"When we get here it's a lot easier, let, let us do what we gotta do and then we can talk to you and you can talk to us [and]. I mean, I understand what you said before, but let's just, just get in here and do what we gotta do.\" After another pause he asked defendant, \"You consider yourself institutionalized? By that (unintelligible) talk to a whole bunch of people and some dudes are just kind of reserved to the fact that that's the way it's always gonna be, and sometimes ...\" \"It's easier and just do time, or do you consider yourself, I want to get over with this so I can try to make at least, have ten good years or whatever.\" Defendant's response is unintelligible. Dudek concluded the conversation with an exhortation:\n\n\"It's kind of unfortunate for you because ... it seems like you were at least heading in the right direction as far as with the religion, and the making amends with your kids, and stuff like that. What you can't do *18Carl though, is, is, is, it's, it's your heart and it's your soul, don't, don't give up on yourself, alright? It's, you know, believe it or not your, your, your daughter obviously is pissed off at you for not having a relationship [but at least] she's kind of proud of herself [and] proud of [making amends], [and] you can still do some good, you know what I'm saying, and, and you, you can't give up on yourself. Once you give up on yourself then, you know, the healing process has to start with you first, you know.\" Defendant said, \"Yeah.\"\n\nDudek continued: \"It does, so I'm not gonna jump into this Bible thumping thing or anything like that, but I'm just telling you don't give up on yourself, alright? Cause then you don't do anybody any good. Believe it or not, what families want more is, like Ed said, they want to know the why and they want to hear something from your mouth and people, even people that are victims of something terrible, they get over it too, you know what I mean? So, they mainly look at you and, you know that from your previous crimes too though, you know. Just like that lady that you see walking around.6 You know, that was one of your more powerful moments, was meeting up with her on the streets. [So, people] get over it. People realize that, you know. I told you before that before I did this I was in, you know, I, I did dope, I was a dope sergeant, you know what I mean, and believe me I know when, when crack cocaine and, and crank, and everything else does to people. People, it's the wors[t] thing that they ever had because you take people that have been clean and you could sit there and you could, and trust them and, and you'd, you'd want to have them come around and, and then I see these [fuckin'], more so the girls (unintelligible) and stuff spun out on the [crank] and shit. It's like damn, it's like how can anybody get to that point, but you understand [how they can, 'cause,] especially with the crack man, it's just so powerful and stuff you know. I mean, you gotta realize people are going to do you in one *642fashion, but only you know what, what Carl's all about inside, inside your heart. That pretty much ends my sermon here so that's where I'm coming from.\"\n\nThere was a considerable period without conversation before they arrived at the station.\n\niii. The Statements at the Station\n\nChicoine testified that at the station, defendant stopped by the rear of the car and **871said, \" 'I have a question.' \" Chicoine said, \" 'What?' \" and defendant told him that he \"wanted to get this over with ... that he had been speaking with inmates in the prison and they told him not to talk to the police. He said he knows that the public defender would tell him not to talk to the police, but he told me that he had to walk in his shoes, that they don't have to walk in his shoes. He just wants to get closure from this, and he just wants to tell the story, and get it over with.\" Chicoine told him to wait until they got into the building, where they would give him another opportunity after reading him his rights. Chicoine understood defendant to be saying that he wanted to discuss the McKenna murder.7 *19Defendant was taken to an interview room, where the conversation was video and audiotaped. Dudek began by reciting that 10 days earlier, he and Chicoine had gone to San Quentin and spoken with defendant. He said, \"You were advised of your Miranda rights prior to the interview and at some point in the interview you told us that you wanted to invoke your Miranda rights, and you wanted to consult with an attorney before you talked to us, is that correct?\" Defendant said, \"Correct.\" Dudek then said, \"at some point\" during the \"transportation from San Quentin,\" \"you then told us you wanted to talk to us, and, and hear what we had to say, and, and didn't want your attorney present anymore, correct?'' Defendant paused and replied, \"I didn't have an attorney present.\"\n\nDudek said, \"That's what I mean though, you, you said you wanted to talk to us and you understood you were now waiving your rights to have an attorney present, is what I meant to say, if I didn't make that clear. And, and that's kinda where we're at right now, if that's correct, then I want to go ahead and re-read you your rights so you understand them again, so at any point you can go ahead and invoke your rights again. You follow me?\"\n\n*643Defendant answered, \"Oh, ok, so I do want to talk to an attorney?\" Dudek repeated that defendant was read his rights on the 21st, and had said he wanted to talk to an attorney. Defendant said, \"Right.\" Dudek said, \"On the trip over here, you said now I want to talk to you for a little while, I want to make sure that's clear, and then I'm gonna read your rights again, so you know we can talk, because you approached us, to talk to us but then at a point, you can always re ..., you're not giving up your rights, I'm just gonna re-advise you that at, at this interview point you can again say no, stop.\" Defendant said, \"[Stop] if I wanted to.\" Dudek asked if what he had said was accurate, and defendant agreed it was. Dudek said, \"So you're freely giving up your rights at this point here, and then I'm gonna advise him. You approached us, is the only thing I'm getting to, is that correct?\" Defendant said, \"Uh-huh.\" Dudek said, \"Without any promises from us or anything, correct?\" Defendant said, \"Correct.\"\n\nDudek then told defendant \"at this point I'm gonna re-advise you of your rights, and then we can start talking again, okay?\" He repeated the Miranda rights; defendant acknowledged he understood each one. The officers began the interrogation by telling him they had spoken with his wife. Defendant said he knew what she had told them. They then discussed his son Robert, and the psychological issues he had been dealing with as a result of his interaction with defendant on the day of the murder. They talked about defendant's drug habit at the time. Defendant said it had been \"out of control.\"\n\nDudek brought up the importance of closure, for defendant and for \"Susie's family.\" Defendant agreed this was important. Chicoine asked, \"Carl did things just get out of hand?\" Defendant said, \"[Neh,] yeah.\" Dudek said, \"It's gonna be painful that it got out of hand, to the point where she died, correct? And you understand that, right?\" Defendant replied, \"I understand. Can I ask you a question?\" Dudek said \"Sure.\" Defendant said, \"I don't actually want to relive this.\" He affirmed Dudek's comments that \"[y]ou know where we're heading\" and \"we want to go **872over every fine detail.\" Defendant then interjected, \"my thing is, is this.\" In a series of *20statements interspersed with brief acknowledgments from the officers, he told them, \"if I choose to say what happened, all the way down the whole 411, whatever, right? I just ....\" \"I don't have to live it again after this.\" \"If I give this testimony now, I say whatever I have to say now, I don't want to live it again.\"\n\nDudek told defendant that his having admitted to things getting out of hand was \"a step in the right direction. You have to take it to at least to the part, where you have to give us some of the details. Whether it's painful or not, we don't have to sit here and harp on ya, and say, how come this and how come *644that? Go through it. Once you get it off your chest Carl, it, it's not gonna be as difficult as you think, and if it does get difficult, we're not gonna sit here and, and badger you.\" Defendant asked if what he said would be in the newspaper. He continued, \"Whatever I say I, you know it's, it's bad enough that you know like, you know I've already fucked up, and I you know, I wanna just, I don't want it to be in the paper and have my kids hurt anymore than they already are.\" Dudek said the way the information would become public was if there were a trial, and \"there's certain ways that you can get closure where it may not even go into trial, and that's a decision that you're gonna have to make.\" Defendant said \"I just want to, I want to get it over.\" He said, \"If I can ask you this question,\" and \"this is the question that concerns me, all right?\"\n\nIn another series of statements interspersed with acknowledgments from Dudek, defendant said, \"What I would like, you know I can talk to you guys. I can even talk to the DA.\" \"You know, with my Public Defender there or whatever right, and after I say what I have to say, just ask to be sentenced, if I can be sentenced.\" \"You know I'm not asking for a jury trial 'cause I don't want a jury trial.\" \"I just want you know, if I can, if what I'm saying, if I can have that, right, I can get this all over with.\" \"... I understand you thought you guys say you can't promise me that.\" Dudek told defendant he would \"be absolutely lying to you if I told you that, 'cause that's just not the way the system works, okay? But can we let 'em, can we let 'em know that that's your request? We can let them know verbally and they're gonna watch this, too.\" Defendant asked if he could \"sit down wit' you two and the DA, right?\" \"Can I sit down with the DA?\"\n\nChicoine told him, \"Carl after this it's all over.\" Defendant said, \"It's all in their hands?\" Chicoine said, \"It's all over there. Right now this is, I'm, I'm the one that has to talk to the family, man. That's, that's my concern, man. My concern is just making sure everything now is at peace. Obviously it's not like peace with you.\" Dudek said, \"Carl you've already started in the right direction here too, you've already said I killed Susan, or Susie.\" Defendant said, \"Yeah.\" Dudek said, \"Ok so no matter what you say at this point here is only gonna benefit Carl, because Carl's gonna be able to tell his side of the story.\"\n\nChicoine suggested that defendant's drug habit may have been \"the reason,\" but that \"we need to kinda hear that from you though.\" Dudek said, \"You got to tell us what you're gonna tell us. There's a way actually and they have a DA that's on stand by for murders, and when murder defendants, which you are, okay, start to talk, like you're starting to talk to us okay, they'll get a DA up here today, okay? To, to come back and they'll come in and they'll ask you questions too, from the DA, not from the cops'\n\n*645standpoint. But we got to know what you're gonna tell the DA, and that can happen today, okay? So I, within probably an hour, forty five minutes we can have a DA up here to say, 'hey the cops already told ya, what I did yeah, this *21is what I want,' okay? And that can, that can happen today okay? But you know the hardest part is, is you've already done it and you know what that is.\" Defendant said, \"Ok.\" After obtaining assurances that a district attorney would be on the way if they called for one, he said, \"You call them now,\" and, \"Come back and we'll continue.\"\n\nWhile Dudek was out calling the district attorney, Chicoine asked defendant whether he \"want[ed] to have everybody here all at once?\" Defendant said he didn't \"wanna live this whole story over,\" that \"it eats me up **873more and more and more and more,\" that he was \"tired of it,\" that he was at peace with God but had to \"live with the consequences of what I've done,\" and \"this conversation I only want to say it one time. The DA comes in, he looks [and] he listens to it, you know, I want to get over with it.\" He added, \"I've made peace with me, but I it has to come out.\" Dudek returned and said it would take the DA thirty to forty minutes to get there. He told defendant, \"You're not gonna leave here until you talk to him.\" Defendant indicated that he understood, and Dudek proceeded to question him.\n\nDefendant described a consensual sexual encounter when he and McKenna were both \"loaded.\" They drank. He used crack cocaine; she methamphetamine. It became \"rough sex\" when, during intercourse, \"she starts to like hitting me, slapping me.\" Their prior sexual encounter had been different. He said it was \"possible\" that he bit her, and answered \"Yeah\" when Dudek asked whether she asked him to choke her. He had used her panties or bra, but she said it wasn't tight enough. He could not remember what he used to exert more pressure. The officers told him she was found with a shoelace around her neck. Defendant said, \"I learned so much here.\" Asked \"Probably from what?\" he said, \"My own shoes.\" He had panicked when he realized she was dead, and dragged her into the bathroom to try to \"clean up.\"\n\nThe next day he went back to make sure he hadn't left anything in McKenna's cottage. Someone knocked on the door and saw him inside, so he ran. The only thing defendant could remember saying when Robert found him in the storage unit was not to tell anyone he was there. Dudek returned to the circumstances of the killing, asking if McKenna had asked defendant to stop. He said no, and told Dudek, \"I didn't rape her.\" But he conceded she \"may have\" asked him to stop choking, he simply didn't know.\n\nWhen Deputy District Attorney Andy Sweet arrived, he turned first to the circumstances of his statements that day. Defendant acknowledged that he had previously invoked his Miranda rights, but then wanted to talk. When *646asked, \"What changed from before to now?\" defendant said, \"I just ... I'm ... I'm tired.\" Sweet said, \"It was your decision to start talking.\" Defendant agreed, saying, \"It was my decision. I'm tired now.\" \"In my mind, they didn't press the issue, understand me?\" Sweet turned on a tape recorder, though the conversation was already being recorded, and again advised defendant of his Miranda rights, obtaining an express waiver. He returned to defendant's decision to talk, saying, \"When they came to pick you up today, some place between San Quentin and here, the Sheriff's Department in Alameda County, you started talking to the officers about your case and about what was going on. Isn't that true?\" Defendant said, \"That's correct.\" He reaffirmed that he changed his mind because he was \"tired and I just want closure,\" and that it was \"[m]y decision.\" He said the officers had not said or done anything that made him think he had to talk to them, *22adding, \"I asked them on the way here if I would be able to talk to a DA.\"\n\nSweet asked, \"Would it be a fair statement to say that you reinitiated kind of the discussion about the case?\" Defendant answered, \"Ok. I, it, that would be fair because I asked like if I will be straight up with you both like I was with them, right. I understand ok, I don't have the money for a public defender, blah blah blah. Right. But I understand my public defender said well, look you shouldn't do this you shouldn't do that because they're not here. Ok. I know what I did. All right. And I just want to get it over with.\" He agreed with Sweet's statement that \"They didn't ask you any questions, you were the one asking them questions to start the conversation going again. Correct?\" He said, \"They made me no promises or anything. My only, my main concern was that you were to come down here.\"\n\nDefendant gave Sweet essentially the same version of the crime he had just given the officers. Under the influence of drugs, he and McKenna had engaged in rough sex, and she asked him to choke her. He didn't intend that she die. He said McKenna \"was the aggressor that night,\" taking off his clothes. He twice emphasized that he did not rape her. After the intercourse ended, he noticed she wasn't breathing. He panicked and tried to clean up. The next day he returned to clean **874up more, and fled when seen. The only thing he remembered telling his son was not to tell anyone where he was.\n\niv. The Suppression Hearing\n\nDefendant moved to suppress his statements. The prosecutor said he was not going to offer the conversation in the car. Chicoine testified at length about the circumstances of the statements and the trial court listened to the conversation in the car. On cross-examination, defense counsel asked Chicoine about his April 3 supplemental police report, which did not mention defendant's statements in the San Quentin receiving area about a willingness *647to talk. Chicoine acknowledged that he had not reported the conversation, saying, \"I inadvertently left that out. At the time, I didn't realize that that was an important issue.\" He also conceded that when the taped interview began in the station, the officers did not ask defendant about any statements he made after getting out of the car. He denied that the reason defendant was brought to the station was to take a statement from him. He said a variety of procedures had to take place before defendant was taken to jail.\n\nChicoine agreed that Dudek began the station interview by summarizing the events of the day without mentioning any statements by defendant at San Quentin about wanting to talk to the officers. He further agreed that Sweet, the district attorney, made no such mention in his initial summary. Nor did Sweet mention any statements by defendant after leaving the car at the station. On redirect, the prosecutor showed that Chicoine had memorialized the unrecorded statement by the car in his supplemental police report. He also established that Chicoine's preliminary examination testimony included both that statement and defendant's earlier statements in the San Quentin receiving area. Defendant did not testify at the hearing. No direct evidence contradicted Chicoine's testimony about defendant's unrecorded statements.\n\nThe court denied the motion to suppress the statements. As to the March 21 statement, it ruled that the \"ruse\" employed by the officers did not invalidate defendant's Miranda waiver. The court noted that, in addition to mentioning the sex offender registration process, Chicoine had told defendant that \"they wanted to talk about some of your past crimes which could well *23have alerted the defendant that this event was fair game.\" The court found defendant had voluntarily reinitiated contact with the officers on March 31. It relied on \"numerous indications in subsequent statements of the defendant and the various interrogations to substantially corroborate the statement under oath of [Chicoine] of the statement that was not recorded at San Quentin, that the defendant basically communicated that he knew that they would be coming back and he meant to call them and that he wanted to talk to them and that he wanted to get the whole thing over with. And I find that most particularly in the statements ... to Andy Sweet.\"\n\nThe court further found that \"any conduct of Sergeant Dudek in his statements in the trip down from San Quentin to [the station] were not so psychologically compelling that they would have overborne Mr. Molano's free will. And [that] in fact is belied by the sheriff's officers preventing Mr. Molano from making his statement until after he had been given his Miranda rights, and he was perfectly free once given those Miranda rights to reaffirm that he wanted an attorney or that he wanted to remain silent. So under either analysis, under voluntary reinitiation or under [a] voluntariness analysis, I believe that Mr. Molano was given his Miranda rights at [the *648station] and that by continuing talking ... he impliedly waived those rights,\" making his subsequent statements to the officers and to Sweet \"legal and voluntary.\"\n\nb. Validity of Miranda Waiver on March 21st\n\nDefendant claims his initial Miranda waiver was constitutionally invalid because he was deceived into waiving his rights at the outset of the San Quentin interview. Specifically, he agreed to speak to Chicoine because Chicoine said he was a sex crime investigator conducting a routine pre-release interview of defendant, who would have to register as a sex offender under section 290. According to defendant, because of Chicoine's deliberate **875falsehood the waiver was not knowing, intelligent, and voluntary. The claim fails.\n\nThe governing principles are well established. Before subjecting suspects to custodial interrogation,8 the police must inform them of their Miranda rights and obtain a waiver that is knowing, voluntary, and intelligent. ( Miranda , supra , 384 U.S. at pp. 444, 478-479, 86 S.Ct. 1602.) The test for validity is as follows. \"First, the relinquishment of the right must have been voluntary in the sense that it was the product of a free and deliberate choice rather than intimidation, coercion, or deception. Second, the waiver must have been made with a full awareness of both the nature of the right being abandoned and the consequences of the decision to abandon it. Only if the 'totality of the circumstances surrounding the interrogation' reveals both an uncoerced choice and the requisite level of comprehension may a court properly conclude that the Miranda rights have been waived.\" ( Moran v. Burbine (1986) 475 U.S. 412, 421, 106 S.Ct. 1135, 89 L.Ed.2d 410 ( Moran ).) The prosecution must demonstrate the validity of a suspect's waiver by a preponderance of the evidence. ( Colorado v. Connelly (1986) 479 U.S. 157, 168-169, 107 S.Ct. 515, 93 L.Ed.2d 473 ( Connelly ).)\n\n*24There is no factual dispute as to the circumstances of defendant's initial waiver at San Quentin. Chicoine testified that he and Dudek came up with a \"ruse\" to make defendant think they had come to talk to him about sex offender registration matters. Chicoine told defendant that he had \"files full\" of sex registrants, and that \"the objective\" was for defendant to stay out of the \"red file\" on his desk of \"the guys I'm going after.\" Chicoine did not reveal that he was investigating McKenna's death. Nonetheless, he did say that he wanted to talk to defendant \"about some of your past crimes and some *649of the sex registration laws and things like that.\" (Italics added.) Whether Chicoine's statements about the purpose of the interrogation invalidated defendant's Miranda waiver is a legal question subject to our independent review.\n\nThe high court has made it clear that merely withholding certain information from a defendant does not invalidate a Miranda waiver. In Moran , supra , 475 U.S. 412, 106 S.Ct. 1135, a public defender called the police station where the defendant was in custody on a burglary arrest. She said she would act as his counsel if he were to be interrogated and was told he would not be. However, the defendant's cohorts in the burglary had implicated him in a murder, and police from a different jurisdiction soon began questioning him about that crime. The defendant waived his Miranda rights and gave a statement. ( Moran , at p. 417, 106 S.Ct. 1135.) The court affirmed the denial of a suppression motion, holding there was no need for the police to inform the defendant that his attorney was trying to reach him.\n\nNoting there was no question the waiver was voluntary, and that the defendant understood his rights, the Moran court said \"[e]vents occurring outside of the presence of the suspect and entirely unknown to him surely can have no bearing on the capacity to comprehend and knowingly relinquish a constitutional right.\" ( Moran , supra , 475 U.S. at p. 422, 106 S.Ct. 1135.) The court reasoned that \"we have never read the Constitution to require that the police supply a suspect with a flow of information to help him calibrate his self-interest in deciding whether to speak or stand by his rights. [Citations.] Once it is determined that a suspect's decision not to rely on his rights was uncoerced, that he at all times knew he could stand mute and request a lawyer, and that he was aware of the State's intention to use his statements to secure a conviction, the analysis is complete and the waiver is valid as a matter of law.\" ( Id . at pp. 422-423, 106 S.Ct. 1135 ; see People v. Suff (2014) 58 Cal.4th 1013, 1070, 171 Cal.Rptr.3d 130, 324 P.3d 1 [valid waiver does not require that a defendant be told of the evidence against him, the severity of his predicament, or the chances he will be **876charged]; People v. Boyette (2002) 29 Cal.4th 381, 411, 127 Cal.Rptr.2d 544, 58 P.3d 391 [valid waiver does not require that a defendant be informed of an arrest warrant].)\n\nThe court returned to the subject of withholding information in Colorado v. Spring (1987) 479 U.S. 564, 107 S.Ct. 851, 93 L.Ed.2d 954 ( Spring ). There, an informant told agents of the Bureau of Alcohol, Tobacco, and Firearms (ATF) that Spring was selling stolen firearms, and had spoken of his role in a Colorado killing. Agents arrested him when Spring tried to sell them guns during an undercover operation in Kansas City. ( Id . at p. 566, 107 S.Ct. 851.) He was given his Miranda rights and signed a waiver form. After questioning about the transactions for which he was arrested, the agents asked if he had a criminal *650record. He admitted to a juvenile record for shooting his aunt. Asked if he had ever shot anyone else, he mumbled, \" 'I shot another guy once.' \" He *25went on to deny he had ever been to Colorado and denied shooting a man there. ( Id . at p. 567, 107 S.Ct. 851.)\n\nSome two months later, Colorado officers interviewed Spring in a Kansas City jail. Given the Miranda warnings, he again signed a waiver. When they brought up the Colorado homicide, Spring indicated he was ready to talk, and confessed. ( Spring , supra , 479 U.S. at pp. 567-568, 107 S.Ct. 851.) The trial court denied a suppression motion, but the Colorado Court of Appeals and Supreme Court held the waiver invalid because the ATF agents had not told Spring he would be questioned about the Colorado homicide during his interview. ( Id . at pp. 568-570, 107 S.Ct. 851.) The high court reversed, finding the waiver voluntary, knowing, and intelligent. ( Id . at pp. 573-577, 107 S.Ct. 851.)\n\nIt was undisputed that \" 'the agents did not tell [the defendant] that they were going to ask him questions about the killing of Walker before [the defendant] made his original decision to waive his Miranda rights.' \" ( Spring , supra , 479 U.S. at p. 575, fn. 7, 107 S.Ct. 851.) Nonetheless, the court observed that, under Moran , supra , 475 U.S. at page 422, 106 S.Ct. 1135, \"a valid waiver does not require that an individual be informed of all information 'useful' in making his decision or all information that 'might ... [affect] his decision to confess.' \" ( Spring , at p. 576, 107 S.Ct. 851.) Instead, the essential requirement of Miranda is that a suspect understand \"the nature of his constitutional right-'his right to refuse to answer any question which might incriminate him.' \" ( Ibid . ) The court explained: \"This Court's holding in Miranda specifically required that the police inform a criminal suspect that he has the right to remain silent and that anything he says may be used against him. There is no qualification of this broad and explicit warning. The warning, as formulated in Miranda , conveys to a suspect the nature of his constitutional privilege and the consequences of abandoning it. Accordingly, we hold that a suspect's awareness of all the possible subjects of questioning in advance of interrogation is not relevant to determining whether the suspect voluntarily, knowingly, and intelligently waived his Fifth Amendment privilege.\" ( Ibid . )\n\nIn People v. Tate (2010) 49 Cal.4th 635, 112 Cal.Rptr.3d 156, 234 P.3d 428 ( Tate ), we applied Spring 's ruling. Tate was arrested while driving a murder victim's car on the day of the murder. ( Id . at pp. 641-642, 112 Cal.Rptr.3d 156, 234 P.3d 428.) Brought to the police department's homicide division, officers told him they were investigating the car because it was stolen and \"a lady had been 'hurt.' \" ( Id . at p. 681, 112 Cal.Rptr.3d 156, 234 P.3d 428.) They gave the Miranda admonitions and Tate agreed to talk. At the beginning of a recorded interview, he asked if he was in the homicide division. Told that he was, the defendant noted \" ' So I'm here for a car that was stolen.' \" ( Ibid . ) The interviewing officer said again that \"he was investigating an incident in *651which a car was stolen and a lady was 'hurt'; and ... stated that 'I'm not here to trick you into anything.' Defendant said, 'I know you ain't, just tell me, you just said a car was stolen.' [The officer] repeated that he was investigating 'the incident [in] which the car was taken.' Defendant responded, 'Whatever you said, okay.' [The officer] asked if everything was now clear in defendant's head, and defendant answered, 'Yeah.' \" ( Ibid . ) **877After another Miranda advisement, Tate denied any knowledge of the incident, and lied about how he obtained the car. The officers eventually told him the victim was dead. They confronted him with the implausibility of his story and the facts that he had just been arrested wearing *26bloodstained clothing and in possession of the victim's car and other property. Urged to tell the truth, the defendant responded, \" 'Why should I tell the truth? Well, what's in it for me? I'm going to jail anyway.' \" ( Tate , supra , 49 Cal.4th at p. 681, 112 Cal.Rptr.3d 156, 234 P.3d 428.) The trial court rejected his claim that he had been tricked into waiving his Miranda rights when the officers did not tell him he was suspected of a homicide, saying instead they were investigating a car theft in which a lady got hurt. The court noted that the defendant knew he was being questioned in the homicide division and must have inferred a killing was involved. ( Id . at p. 682, 112 Cal.Rptr.3d 156, 234 P.3d 428.)\n\nWe upheld the ruling. Summarizing the holding in Spring , we observed: \"The warnings required by Miranda , supra , 384 U.S. 436, 86 S.Ct. 1602 for a suspect in custody-i.e., that the suspect has the right to refuse to talk, to talk only with counsel present, and to stop talking at any time, and that criminal prosecutorial use will be made of any statements the suspect does utter-are designed fully to protect the knowing, voluntary, and intelligent exercise of the constitutional right against compelled self-incrimination in that custodial context. [Citation.] Thus, in general, a suspect in custody who, having heard and understood a full explanation of these rights, then makes an uncompelled and uncoerced decision to talk, has thereby knowingly, voluntarily, and intelligently waived them.\" ( Tate , supra , 49 Cal.4th at p. 683, 112 Cal.Rptr.3d 156, 234 P.3d 428.) The facts in Tate supported a conclusion that defendant understood the serious nature of the investigation. He did not appear to have been \"misled by any ambiguity in the officers' use of the word 'hurt' rather than 'killed.' \" ( Id . at p. 682, 112 Cal.Rptr.3d 156, 234 P.3d 428.) He had ascertained that he was in the homicide division, and \"must certainly have understood that the injury at issue was fatal.\" ( Id . at p. 683, 112 Cal.Rptr.3d 156, 234 P.3d 428.) We further observed that \"[e]ven if this evidence were not present ... we would not accept defendant's contention. We conclude the officers did nothing to invalidate defendant's two separate waivers of his Miranda rights.\" ( Ibid . ) This is because \"mere failure by law enforcement officers to advise a custodial suspect of all possible topics of interrogation is not trickery sufficient to vitiate the uncoerced waiver of one who heard and understood the warnings required by Miranda .\" ( Ibid ., citing Spring , supra , 479 U.S. at pp. 564, 576, 107 S.Ct. 851.)\n\n*652Consistent with these authorities, the court properly concluded defendant's Miranda waiver was knowing, intelligent, and voluntary. Notwithstanding Chicoine's failure to disclose that he was investigating McKenna's death, defendant was aware that he was speaking with law enforcement officers and that the scope of the interview would include his \"past crimes.\" Having received full and complete Miranda warnings, defendant was also aware that anything he said during the interview could be used against him. This \"broad and explicit warning\" conveyed to defendant \"the nature of his constitutional privilege and the consequences of abandoning it.\" ( Spring , supra , 479 U.S. at p. 577, 107 S.Ct. 851.) \"Thus, in general, a suspect in custody who, having heard and understood a full explanation of these rights, then makes an uncompelled and uncoerced decision to talk, has thereby knowingly, voluntarily, and intelligently waived them.\" ( Tate , supra , 49 Cal.4th at p. 683, 112 Cal.Rptr.3d 156, 234 P.3d 428.) As in Spring , the fact that the officers did not tell defendant they were going to ask him about McKenna's killing does not invalidate the waiver. Defendant's lack of *27\"awareness of all the possible subjects of questioning in advance of interrogation is not relevant to determining whether [he] voluntarily, knowingly, and intelligently waived his Fifth Amendment privilege.\" ( Spring , at p. 577, 107 S.Ct. 851.) The officers were not constitutionally required to \"supply [defendant] with a flow of information to help him calibrate his self-interest in deciding whether to speak or stand by his rights.\" ( Moran , supra , 475 U.S. at p. 422, 106 S.Ct. 1135.) **878Defendant attempts to distinguish Moran , Spring , and Tate because none of those cases involved affirmative deception. (See Spring , supra , 479 U.S. at p. 576 \u0026amp; fn. 8, 107 S.Ct. 851 ; Moran , supra , 475 U.S. at p. 423, 106 S.Ct. 1135 ; Tate , supra , 49 Cal.4th at pp. 682-683, 112 Cal.Rptr.3d 156, 234 P.3d 428.) Here, by contrast, defendant argues that misleading him about the purpose of the interview \"constitute[s] a form of misconduct by officers that society seeks to discourage,\" is \"likely to overbear the will of suspects and therefore produce involuntary confessions,\" and constitutes \"a kind of unfairness that shocks the conscience and brings law enforcement and the justice system into disrepute ....\"\n\nDefendant's arguments are unpersuasive. The high court has intimated that some circumstances may invalidate a waiver. The Miranda court declared: \"[A]ny evidence that the accused was threatened, tricked , or cajoled into a waiver will, of course, show that the defendant did not voluntarily waive his privilege. The requirement of warnings and waiver of rights is a fundamental with respect to the Fifth Amendment privilege and not simply a preliminary ritual ....\" ( Miranda , supra , 384 U.S. at p. 476, 86 S.Ct. 1602, italics added.) In Berkemer v. McCarty (1984) 468 U.S. 420, 104 S.Ct. 3138, 82 L.Ed.2d 317, the court said, \"The purposes of the safeguards prescribed by Miranda are to ensure that the police do not coerce or trick captive suspects into confessing ....\" ( Id . at p. 433, 104 S.Ct. 3138, italics added and deleted.) Similarly, in Moran, supra, 475 U.S. 412, 106 S.Ct. 1135, the court stated that \"the relinquishment of the right must have been voluntary in the sense that it was the *653product of a free and deliberate choice rather than intimidation, coercion, or deception .\" ( Id . at p. 421, 106 S.Ct. 1135, italics added; see Berghuis v. Thompkins (2010) 560 U.S. 370, 382-383, 130 S.Ct. 2250, 176 L.Ed.2d 1098.)\n\nThe Supreme Court has nonetheless clarified that the Constitution does not punish lack of candor for its own sake. The Moran court explained: \"Granting that the 'deliberate or reckless' withholding of information is objectionable as a matter of ethics, such conduct is only relevant to the constitutional validity of a waiver if it deprives a defendant of knowledge essential to his ability to understand the nature of his rights and the consequences of abandoning them.\" ( Moran , supra , 475 U.S. at pp. 423-424, 106 S.Ct. 1135.) Moran expressly dismissed the idea that the intent of the police to deceive might make a difference. ( Ibid . ) And in Spring , the court cited examples of \"certain circumstances\" under which the court had previously invalidated Fifth Amendment waivers; those examples all involved misrepresentations that were coercive in nature. ( Spring , supra , 479 U.S. at p. 576, fn. 8, 107 S.Ct. 851, citing Lynumn v. Illinois (1963) 372 U.S. 528, 534-535, 83 S.Ct. 917, 9 L.Ed.2d 922 [misrepresentation by police officers that suspect would be deprived of state financial aid for her dependent child unless she cooperated]; Spano v. New York (1959) 360 U.S. 315, 319, 322-324, 79 S.Ct. 1202, 3 L.Ed.2d 1265 [misrepresentation by suspect's friend that friend would lose his job if suspect failed to cooperate].)\n\nThe officers' ruse, that their purpose was to interview defendant regarding his *28sex offender registration status, was not coercive. Defendant argues that Chicoine's reference to a \"red file\" of problem offenders that sits on his desk \"plainly implied that there might be consequence for failing to cooperate.\" The record belies this assertion. The comment suggested only that defendant should stay out of trouble following his release from prison. Moreover, as he was filling out the waiver form, defendant asked if his parole would be affected \"[i]f I don't answer any of these questions.\" Chicoine replied, \"No, absolutely not.\"\n\nDefendant further maintains \"it is clear from the record that [he] would not have waived his Miranda rights if he had actually been told who the officers were and what they were investigating.\" Defendant reasons that he promptly invoked his right to an attorney when the officers actually broached the subject of McKenna's death. But the fact that he did so only reinforces the conclusion that he understood his options and his will was not overborne. (See **879People v. Williams (2010) 49 Cal.4th 405, 442, 444, 111 Cal.Rptr.3d 589, 233 P.3d 1000.) *654For these reasons, defendant's initial Miranda waiver was knowing, intelligent, and voluntary.9\n\nc. The Reinitiation of Questioning\n\nAs noted, defendant asserted his right to counsel at the end of the San Quentin interview and the officers promptly stopped their questioning. Defendant contends the officers violated his rights under Edwards , supra , 451 U.S. 477, 101 S.Ct. 1880, when, 10 days later, they resumed questioning on the car trip to the station despite his earlier invocation of Miranda rights. We reject his claim. Defendant reinitiated further communications with the officers when they arrived at San Quentin to take custody of him, thus allowing for further questioning under Edwards . ( Edwards , supra , 451 U.S. at pp. 484-485, 101 S.Ct. 1880.)\n\n\"[W]hen an accused has invoked his right to have counsel present during custodial interrogation, a valid waiver of that right cannot be established by showing only that he responded to further police-initiated custodial interrogation .... [There is to be no] further interrogation by the authorities until counsel has been made available to him, unless the accused himself initiates further communication, exchanges, or conversations with the police.\" ( Edwards , supra , 451 U.S. at pp. 484-485, 101 S.Ct. 1880 ; accord, People v. Gamache (2010) 48 Cal.4th 347, 384, 106 Cal.Rptr.3d 771, 227 P.3d 342.) \" Edwards set forth a 'bright-line rule' that all questioning must cease after an accused requests counsel. [Citation.] In the absence of such a bright-line prohibition, the authorities through '[badgering]' or 'overreaching'\n\n*29- explicit or subtle, deliberate or unintentional - might otherwise wear down the accused and persuade him to incriminate himself notwithstanding his earlier request for counsel's assistance.\" ( Smith v. Illinois (1984) 469 U.S. 91, 98, 105 S.Ct. 490, 83 L.Ed.2d 488.) \"[I]t is presumed that any subsequent waiver that has come at the authorities' behest, and not at the suspect's own instigation, is itself the product of ... 'inherently compelling pressures' and not the purely voluntary choice of the suspect.\" ( Arizona v. Roberson (1988) 486 U.S. 675, 681, 108 S.Ct. 2093, 100 L.Ed.2d 704 ; Gamache , at p. 385, 106 Cal.Rptr.3d 771, 227 P.3d 342.) \"Thus, the People must show both that the defendant reinitiated discussions and that he knowingly and intelligently waived the right he had invoked.\" ( Gamache , at p. 385, 106 Cal.Rptr.3d 771, 227 P.3d 342.)\n\n*655\"The Edwards presumption of involuntariness ensures that police will not take advantage of the mounting coercive pressures of 'prolonged police custody,' [citation] by repeatedly attempting to question a suspect who previously requested counsel until the suspect is 'badgered into submission.' [citation.]\" ( Shatzer , supra , 559 U.S. at p. 105, 130 S.Ct. 1213.) In Shatzer , the high court considered the temporal reach of the Edwards presumption, noting that without a time limit, \"every Edwards prohibition of custodial interrogation of a particular suspect would be eternal. The prohibition applies, of course, when the subsequent interrogation pertains to a different crime, [citation], when it is conducted by a different law enforcement authority, [citation], and even when the suspect has met with an attorney after the first interrogation.\" ( Id . at pp. 108-09, 130 S.Ct. 1213.)10 In the course of its discussion, **880the Shatzer court examined the underpinnings of the Edwards rule.\n\nThe court identified the benefits of the rule: \" Edwards ' presumption of involuntariness has the incidental effect of 'conserv[ing] judicial resources which would otherwise be expended in making difficult determinations of voluntariness.' [Citation.] Its fundamental purpose, however, is to '[p]reserv[e] the integrity of an accused's choice to communicate with police only through counsel,' [citation], by 'prevent[ing] police from badgering a defendant into waiving his previously asserted Miranda rights,' [citation].\" ( Shatzer , supra , 559 U.S. at p. 106, 130 S.Ct. 1213.) These benefits are typically realized in \"the paradigm Edwards case. That is a case in which the suspect has been arrested for a particular crime and is held in uninterrupted pretrial custody while that crime is being actively investigated. After the initial interrogation, and up to and including the second one, he remains cut off from his normal life and companions, 'thrust into' and isolated in an 'unfamiliar,' 'police-dominated atmosphere,' [citation], where his captors 'appear to control [his] fate.' [citation]\" ( Ibid . )\n\nWhen, however, \"a suspect has been released from his pretrial custody and has returned to his normal life for some time before the later attempted interrogation, there is little reason to think that his change of heart regarding interrogation without counsel has been coerced. He has no longer been isolated. He has likely been able to seek advice from an attorney, family members, and friends. And he knows from his earlier experience that he need only demand counsel to bring *30the interrogation to a halt; and that investigative custody does not last indefinitely. In these circumstances, it is farfetched to think that a police officer's asking the suspect whether he would like to waive his Miranda rights will any more 'wear down the accused,' [citation] than did the first such request at the original attempted interrogation - which *656is of course not deemed coercive. ... Uncritical extension of Edwards to this situation would not significantly increase the number of genuinely coerced confessions excluded.\" ( Shatzer , supra , 559 U.S. at pp. 107-108, 130 S.Ct. 1213, fn. omitted.) The court considered how long of \"a break in custody\" would be sufficient \"to dissipate its coercive effects.\" ( Id . at p. 109, 130 S.Ct. 1213.) It determined that 14 days was the appropriate period. \"That provides plenty of time for the suspect to get reacclimated to his normal life, to consult with friends and counsel, and to shake off any residual coercive effects of his prior custody.\" ( Id . at p. 110, 130 S.Ct. 1213.)\n\nHere, defendant was questioned again 10 days after his initial interview, within the Shatzer window period. During the intervening 10 days, defendant did not entirely \"return[ ] to his normal life\" while in prison. ( Shatzer , supra , 559 U.S. at p. 107, 130 S.Ct. 1213.) When the interview ended, the officers took blood and buccal swab samples, dental casts, and defendant's shoes. They told prison staff that defendant was a suspect, and he was subject to an enhanced level of prison security as a result. When defendant next saw the officers, they arrested him. Instead of anticipating a release from custody, as he had been at the time of the first interview, he faced a new prosecution on a very serious charge. Thus, he was under the \"mounting coercive pressures of 'prolonged police custody,' \" identified by the Shatzer court as the rationale for the Edwards presumption of involuntariness. ( Shatzer , at p. 105, 130 S.Ct. 1213.) \"If further conversations [were] initiated by the police ... defendant's statements are presumed involuntary and inadmissible as substantive evidence at trial. This [would be] true even [if] defendant again waive[d] his Miranda rights and his statements [were] voluntary under traditional standards.\" ( People v. Thomas (2012) 54 Cal.4th 908, 926, 144 Cal.Rptr.3d 366, 281 P.3d 361.)\n\n\"An accused 'initiates' \" further communication, when his words or conduct \"can be 'fairly said to represent a desire' on his part 'to open up a more generalized discussion relating directly or indirectly to the investigation.' \" ( People v. Mickey (1991) 54 Cal.3d 612, 648, 286 Cal.Rptr. 801, 818 P.2d 84, quoting **881Oregon v. Bradshaw (1983) 462 U.S. 1039, 1045, 103 S.Ct. 2830, 77 L.Ed.2d 405 ( Bradshaw ) (plur. opn. of Rehnquist, J.); see People v. San Nicolas (2004) 34 Cal.4th 614, 641-642, 21 Cal.Rptr.3d 612, 101 P.3d 509.) The trial court found that defendant initiated conversation with the officers in unrecorded statements he made before the car trip began. Chicoine testified that they had contacted prison staff to coordinate defendant's transfer to Alameda County custody. Defendant was in a receiving area when they arrived. Without prompting, he told them \"he had been meaning to call us, that he had already talked to a counselor.\" He said \"[h]e knew we'd be coming back\" and \"he wanted to talk to us.\" Chicoine understood these remarks as \"a continuation\" of what defendant had said at the end of his first interview, which was that he wanted to talk to them after *657he had a chance to talk to a counselor.11 Chicoine *31told defendant to wait, and \"we would get an opportunity to talk to him later.\" Chicoine also testified that while in the receiving area they told defendant he was under arrest for McKenna's murder. He could not remember whether this advisement came before or after defendant said he wanted to talk.\n\nOn appeal, defendant challenges Chicoine's veracity. He points out that the initiation of contact in the receiving area was not noted in Chicoine's police reports. He argues that the tape of the conversation in the car reflects no readiness to talk on defendant's part, and no understanding on the officers' part that he had reinitiated the conversation.\n\n\"When the facts are disputed, we must accept the trial court's resolution of disputed facts and inferences, and its evaluations of credibility, if they are substantially supported.\" ( Bradford , supra , 15 Cal.4th at p. 1311, 65 Cal.Rptr.2d 145, 939 P.2d 259.) A trial court's credibility finding will be sustained so long as the account is plausible. ( Ibid . ; People v. Waidla (2000) 22 Cal.4th 690, 731-732, 94 Cal.Rptr.2d 396, 996 P.2d 46 ; cf. People v. Lewis (2001) 26 Cal.4th 334, 384, 110 Cal.Rptr.2d 272, 28 P.3d 34.)\n\nChicoine's version of events is both plausible and corroborated by defendant's own later recorded statements. When defendant first invoked his right to counsel during the March 21 interview, the officers honored that request, stopped the interview, and told defendant that if he wanted to talk to them again, \"You have to initiate the contact.\" When the officers returned to San Quentin on March 27, they did so to execute the arrest warrant. According to Chicoine, defendant volunteered that he had spoken to his counselor and was ready to talk. The 10-day break between the first interview and the officers' return on March 31 would have given defendant ample time to seek advice. Indeed, he does not dispute that he did so.\n\nDespite defendant's repeated statements about his willingness to talk, the officers did not interview him immediately. Instead, they repeatedly told him to wait until he was re-Mirandized at the station. They explained that at the station they would take him to an interview room and read him his rights again. They explicitly told him: \"[A]t that time, you know, you can say hey, let me talk to my PD and I'll talk to you again, but, you know, that's entirely up to you.\"\n\nBack on tape at the station, Dudek clarified, \"You approached us, is the only thing I'm getting to, is that correct?\" Defendant replied, \"Uh-huh.\" In a *658subsequent interview, Deputy District Attorney Andy Sweet also explored defendant's reinitiation of contact in detail. Defendant acknowledged that he had previously invoked his Miranda rights. When asked, \"What changed from before to now?\" defendant said, \"I just ... I'm ... I'm tired.\" Sweet said, \"It was your decision to start talking.\" Defendant agreed, saying, \"It was my decision. I'm tired now,\" and, \"In my mind, they didn't press the issue, understand me?\" Sweet sought further clarification, asking, \"When they came to pick you up today, some place between San Quentin and here, the Sheriff's Department in Alameda County, you started talking to the officers about your case and about what was going on. Isn't that true?\" Defendant said, \"That's correct.\" He **882reaffirmed that he changed his mind because he was \"tired and I just want closure,\" and that it was \"[m]y decision.\" He said the officers had not said or done anything that *32made him think he had to talk to them, adding, \"I asked them on the way here if I would be able to talk to a DA.\" Sweet then asked, \"Would it be a fair statement to say that you reinitiated kind of the discussion about the case?\" Defendant answered, \"Ok. I, it, that would be fair because I asked like if I will be straight up with you both like I was with them, right. I understand ok, I don't have the money for a public defender, blah blah blah. Right. But I understand my public defender said well, look you shouldn't do this you shouldn't do that because they're not here. Ok. I know what I did. All right. And I just want to get it over with.\" He agreed with Sweet's statement that \"[t]hey didn't ask you any questions, you were the one asking them questions to start the conversation going again. Correct?\" He volunteered, \"They made me no promises or anything. My only, my main concern was that you [the DA] were to come down here.\"\n\nThis record amply supports the trial court's factual finding that defendant reinitiated conversation with the officers at San Quentin before the car trip began. Accordingly, under Edwards , the officers were permitted to resume their questioning of defendant about the McKenna homicide. ( Edwards , supra , 451 U.S. 477 at pp. 484-85, 101 S.Ct. 1880.)\n\nd. Alleged Invocation in the Car\n\nDefendant argues that even if he reinitiated conversations with the officers at San Quentin, he once again invoked his right to counsel during the drive, making any subsequent waiver at the station involuntary under Edwards . He cites the following exchange: Defendant: \"Can I ask you a question?\" Dudek: \"Sure.\" Defendant: \"They'll assign me a PD, right?\" *659Dudek: \"Right.\" Defendant: \"I can sit down and talk to my PD first, then talk with you all?\" Dudek: \"Yeah.\" Defendant: \"Can I do that?\" Dudek: \"Yeah. I mean, that's one of your options and that's why we're here, you know.\" Defendant: \"That's, I would, I would (unintelligible).\"\n\nAlthough the transcript prepared for the suppression hearing identifies the relevant portion of the tape as unintelligible, defendant now argues on appeal that he actually said, I would \"feel more comfortable .\"\n\nThe claim was forfeited. Defense counsel did not advance this interpretation of the tape during the suppression hearing or ask Chicoine about it. Nor did she secure a finding of fact from the trial court regarding this portion of the tape, or argue that it amounted to a second invocation of counsel. For his part, the Attorney General states that, because of the poor quality of the tape recording, he cannot determine whether defendant actually said he would \"feel more comfortable .\" We have independently reviewed the tape recording and did not make out the words \"feel more comfortable.\" Because the theory was never litigated and the relevant facts are subject to dispute, it is not properly raised for the first time on appeal. ( People v. Gurule (2002) 28 Cal.4th 557, 602, 123 Cal.Rptr.2d 345, 51 P.3d 224.)\n\nEven overlooking forfeiture and assuming, as defendant asserts, that he said he would \"feel more comfortable\" if he spoke to a public defender first, the comment did not amount to a \"clear assertion\" of the right to counsel under our high court's precedent. ( Davis v. United States (1994) 512 U.S. 452, 460, 114 S.Ct. 2350, 129 L.Ed.2d 362 ( Davis ).) \"The applicability *33of the ' \"rigid\" prophylactic rule' of Edwards requires courts to 'determine whether the accused actually invoked his right to counsel.' \" ( Id . at p. 458, 114 S.Ct. 2350.) Ambiguous or equivocal references to an attorney do not require cessation of questioning. ( Id . at pp. 458-459, 462, 114 S.Ct. 2350.) As the high court has emphasized, \"we are unwilling to create a third layer of prophylaxis [beyond the holdings in Miranda and Edwards ] to prevent police questioning when the suspect might want a lawyer. Unless the suspect actually requests **883an attorney, questioning may continue.\" ( Id . at p. 462, 114 S.Ct. 2350.)\n\nDefendant's first reference to an attorney was phrased in equivocal language. He asked Dudek, \"I can sit down and talk to my PD first, then talk *660with you all?\" and, \"Can I do that?\" Similar statements have been found not to be a clear request for counsel's assistance. ( Davis, supra , 512 U.S. at pp. 455, 462, 114 S.Ct. 2350 [\" 'Maybe I should talk to a lawyer' \"] ; People v. Bacon (2010) 50 Cal.4th 1082, 1105, 116 Cal.Rptr.3d 723, 240 P.3d 204 [\" 'I think it'd probably be a good idea for me to get an attorney' \"]; People v. Stitely (2005) 35 Cal.4th 514, 535, 26 Cal.Rptr.3d 1, 108 P.3d 182 [\" 'I think it's about time for me to stop talking' \"].)\n\nWhen Dudek affirmed that was one of defendant's options, defendant then allegedly said, \"That's, I would, I would [feel more comfortable].\" Although this statement was not framed in the form of a question, it was also not a clear invocation of the right to an attorney. Most people would feel more comfortable with a lawyer present during interrogation. But that reality does not establish the converse: that defendant was unwilling to speak without counsel's assistance.\n\nIn some respects, this statement is similar to that statement in People v. Sauceda-Contreras (2012) 55 Cal.4th 203, 145 Cal.Rptr.3d 271, 282 P.3d 279. There, defendant was given his Miranda rights and asked if he would like to speak with the detective. Defendant said: \" 'If you can bring me a lawyer, that way I[,] I with who ... that way I can tell you everything that I know and everything that I need to tell you and someone to represent me.' \" ( Id . at p. 216, 145 Cal.Rptr.3d 271, 282 P.3d 279.) We held that because defendant's reference to an attorney was \"conditional, ambiguous, and equivocal,\" a cessation of questioning was not required. ( Id . at p. 219, 145 Cal.Rptr.3d 271, 282 P.3d 279 ; see also Delashmit v. State (Miss. 2008) 991 So.2d 1215, 1219, 1221 [defendant's statement, \" 'I prefer a lawyer' \" was ambiguous].) A similar conclusion follows here, though in Sauceda-Contreras and Delashmit the officers asked follow-up questions. ( Sauceda-Contreras , at pp. 216, 219-220, 145 Cal.Rptr.3d 271, 282 P.3d 279 ; Delashmit , at pp. 1219-1221.) That did not happen here, at least in the car. But clarification, while advisable, is not required. ( Davis, supra , 512 U.S. at pp. 461-462, 114 S.Ct. 2350.) \"[W]e decline to adopt a rule requiring officers to ask clarifying questions. If the suspect's statement is not an unambiguous or unequivocal request for counsel, the officers have no obligation to stop questioning him.\" ( Id . at p. 461, 114 S.Ct. 2350.) Further clarification was ultimately sought by both the officers and the district attorney once defendant arrived at the police station and was formally Mirandized .\n\nBecause defendant reinitiated conversation with the officers at San Quentin, and did not clearly invoke his right to counsel en route to the station, the officers were permitted to resume their questioning of defendant about the McKenna homicide. ( Edwards , supra , 451 U.S. at pp. 484-485, 101 S.Ct. 1880.)\n\n*34*661e. Voluntariness of Miranda Waiver on March 31st\n\nEven when a suspect initiates further discussions, the burden remains on the prosecution to show by a preponderance of the evidence that the suspect knowingly, intelligently, and voluntarily waived the rights he had previously invoked. ( Connecticut v. Barrett (1987) 479 U.S. 523, 527, 107 S.Ct. 828, 93 L.Ed.2d 920 ; Connelly , supra , 479 U.S. at p. 168, 107 S.Ct. 515 ; Bradshaw, supra, 462 U.S. at p. 1044, 103 S.Ct. 2830, plur. opn. of Rehnquist, J.; People v. Davis , supra , 46 Cal.4th at p. 596, 94 Cal.Rptr.3d 322, 208 P.3d 78.) We independently review the validity of the waiver \" 'in light of the record in its entirety, including \"all the surrounding circumstances-both the characteristics of the accused and the details of the [encounter]\" ....' \" ( People v. Neal (2003) 31 Cal.4th 63, 80, 1 Cal.Rptr.3d 650, 72 P.3d 280.)\n\nAt the station, Dudek again read the Miranda rights, and defendant acknowledged that he understood them. He concedes that his willingness to talk after affirming that he understood his rights is sufficient to establish an implied waiver. (See **884Berghuis v. Thompkins , supra , 560 U.S. at pp. 383-385, 130 S.Ct. 2250 ; North Carolina v. Butler (1979) 441 U.S. 369, 373, 99 S.Ct. 1755, 60 L.Ed.2d 286.) He argues, however, that his waiver was not voluntary because the officers lied to obtain the initial waiver, disregarded his invocations of the right to counsel, and engaged in impermissible softening-up tactics. His arguments are unpersuasive.\n\nAs explained, the officers' \"ruse\" did not invalidate defendant's initial waiver. Moreover, by the time defendant was re-Mirandized on March 31, he knew that he had been arrested for McKenna's homicide. There is no colorable claim of police deception as to defendant's second waiver.\n\nNor did the officers disregard defendant's invocation of the right to counsel. When defendant asked for counsel during the San Quentin questioning, the officers immediately ended the interview. In the car ride to the station, defendant asked whether he would be assigned a public defender and be allowed to talk to that counsel before questioning. In response, Sergeant Dudek directly affirmed defendant's right to the assistance of counsel, explained just how to make such a request, and affirmed: \"[T]hat's entirely up to you.\" Defendant did not make an unequivocal request for counsel at that time.\n\nDefendant argues that the officers coerced him into waiving his Miranda rights at the station by engaging in improper softening-up techniques. Specifically, he claims the officers disparaged the victim and appealed to defendant's desire to mend his relationship with his children. He relies primarily on People v. Honeycutt (1977) 20 Cal.3d 150, 141 Cal.Rptr. 698, 570 P.2d 1050 *662( Honeycutt ). There the defendant was initially hostile to one of the interrogating officers. Without administering Miranda warnings , a different officer who had known him for about 10 years had a 30-minute unrecorded discussion with him. ( Id . at p. 158, 141 Cal.Rptr. 698, 570 P.2d 1050.) They discussed past events and former acquaintances, and the officer made disparaging comments about the victim. ( Ibid . ) The defendant \" 'soften[ed] up' \" and agreed to talk about the underlying offense, after which he was advised of and waived his Miranda rights and confessed to murdering the victim. ( Id . at p. 158, 141 Cal.Rptr. 698, 570 P.2d 1050.)\n\nHoneycutt held the defendant's Miranda waiver involuntary. ( Honeycutt , supra , 20 Cal.3d at p. 161, 141 Cal.Rptr. 698, 570 P.2d 1050.) It framed the issue as follows: \"Detective Williams had, prior to *35explaining the Miranda rights, already succeeded in persuading defendant to waive such rights. Thus the critical question is what effect failure to give a timely Miranda warning has on the voluntariness of a decision to waive which is induced prior to the Miranda admonitions.\" ( Id . at p. 159, 141 Cal.Rptr. 698, 570 P.2d 1050.) Honeycutt concluded that, \"When the waiver results from a clever softening-up of a defendant through disparagement of the victim and ingratiating conversation, the subsequent decision to waive without a Miranda warning must be deemed to be involuntary for the same reason that an incriminating statement made under police interrogation without a Miranda warning is deemed to be involuntary.\" ( Id . at pp. 160-161, 141 Cal.Rptr. 698, 570 P.2d 1050.)\n\nDefendant's reliance on Honeycutt is misplaced. First, unlike that case, defendant here was well aware of his Miranda rights, having previously and successfully invoked them. Dudek affirmed defendant's right to counsel during the very discussion defendant claims was intended to soften him up. A key predicate to the Honeycutt holding, the absence of Miranda warnings, does not exist here. Second, defendant was not hostile to the officers, and Dudek did not exploit a personal relationship to encourage his waiver of rights. Third, in his interview with Deputy District Attorney Sweet, defendant confirmed that he waived his rights voluntarily, stating that it was his decision to talk and that \"[i]n my mind, [the officers] didn't press the issue, understand me?\" He affirmed that the officers said or did nothing that made him think he had to speak with them. All of these factors weigh heavily against defendant's argument that his decision to waive his right to counsel and speak with the officers was not voluntary.\n\nDefendant argues that, as in Honeycutt , the officers here disparaged the victim in an attempt to minimize the crime and ingratiate **885themselves. He observes that the officers questioned him about McKenna's drug use and whether she favored multi-party sex. Dudek commented that he knew McKenna was not an angel. Honeycutt did cite the officer's disparaging comments about the victim before any Miranda admonition as one of several factors that *663combined to render the defendant's waiver involuntary. ( Honeycutt , supra , 20 Cal.3d at pp. 158, 160, 141 Cal.Rptr. 698, 570 P.2d 1050.) But here, as noted, the other factors were absent: defendant was not hostile or reluctant to speak; the officers did not exploit a long-standing relationship; and he was forewarned of his Miranda rights. The officers' brief comments about the victim, standing alone, did not render defendant's waiver involuntary.\n\nThe same is true of Dudek's comments to defendant about mending his relationship with his children. Dudek did not threaten defendant's children with prosecution or other harm if he failed to confess. (See Lynumn v. Illinois , supra , 372 U.S. at pp. 531-532, 83 S.Ct. 917 ; People v. Steger (1976) 16 Cal.3d 539, 550, 128 Cal.Rptr. 161, 546 P.2d 665 ; In re Shawn D . (1993) 20 Cal.App.4th 200, 212, 24 Cal.Rptr.2d 395.) As defendant's own statements indicate, he was motivated to confess because he was tired of living with the guilt of killing McKenna. He believed that officers would be coming for him, and emphasized that \"if you didn't come, I would have came to you.\" He acknowledged that his public defender would tell him not to cooperate, but commented that \"he doesn't have to wear my shoes.\" Defendant wanted an expedited resolution, perhaps to spare himself and his family the stress of a trial. He commented, \"I know what I did. All right. And I just want to get it over with.\" The Fifth Amendment is not \"concerned with moral and psychological pressures *36to confess emanating from sources other than official coercion.\" ( Oregon v. Elstad (1985) 470 U.S. 298, 304-305, 105 S.Ct. 1285, 84 L.Ed.2d 222.)\n\nIn sum, the conversation during the car ride did not improperly \"soften-up\" defendant or render his waivers involuntary. His statement at the police station was properly admitted.\n\n2. Other Crimes Evidence\n\nAs noted, the prosecutor introduced evidence of three other crimes: two rapes and the physical abuse of his wife. Defendant challenged the admissibility of this evidence below, and renews his arguments on appeal. All three incidents were properly admitted.\n\na. Crimes Against Anne H. and Mabel L. ( Evid. Code, § 1108 )\n\nUnder Evidence Code section 1108, the trial court admitted evidence that defendant raped Anne H. and Mabel L. That section carves out an exception to Evidence Code section 1101, subdivision (a)'s ban on character evidence offered to prove a person's conduct on a particular occasion. Specifically, subdivision (a) of Evidence Code section 1108 provides: \"In a *664criminal action in which the defendant is accused of a sexual offense, evidence of the defendant's commission of another sexual offense or offenses is not made inadmissible by Section 1101, if the evidence is not inadmissible pursuant to Section 352.\" Evidence Code section 352, in turn, provides that \"[t]he court in its discretion may exclude evidence if its probative value is substantially outweighed by the probability that its admission will (a) necessitate undue consumption of time or (b) create substantial danger of undue prejudice, of confusing the issues, or of misleading the jury.\" In short, if evidence satisfies section 1108, and is not excluded under section 352, admission of that evidence to prove propensity is permitted. ( People v. Daveggio and Michaud (2018) 4 Cal.5th 790, 823, 231 Cal.Rptr.3d 646, 415 P.3d 717.)\n\nDefendant's earlier rape offenses fall under the rule of Evidence Code section 1108, subdivision (a). (See id ., subd. (d)(1)(A).) Nevertheless, defendant maintains their admission violated due process under the federal Constitution. He concedes that we rejected this argument nearly two decades ago in People v. Falsetta (1999) 21 Cal.4th 903, 907, 89 Cal.Rptr.2d 847, 986 P.2d 182, but urges us to reconsider that holding. We have repeatedly declined to do so. (See People v. Daveggio and Michaud, supra, 4 Cal.5th at p. 827, 231 Cal.Rptr.3d 646, 415 P.3d 717 ;\n\n**886People v. Loy (2011) 52 Cal.4th 46, 60-61, 127 Cal.Rptr.3d 679, 254 P.3d 980 ; People v. Lewis (2009) 46 Cal.4th 1255, 1288-1289, 96 Cal.Rptr.3d 512, 210 P.3d 1119.) He offers no persuasive reason for reconsideration of this established precedent. Specifically, his argument that Evidence Code section 352 does not provide the \" 'safeguard' \" anticipated in Falsetta is unpersuasive. To the contrary, the record here demonstrates the trial court's careful attention to Evidence Code section 352 factors.\n\nb. Crimes Against Defendant's Wife, Brenda ( Evid. Code, § 1101, subd. (b) )\n\nDefendant challenges the admission of evidence that he strangled his wife, Brenda, to unconsciousness. Evidence Code section 1101, subdivision (b) allows the admission of other crime evidence relevant to prove a fact at issue, such as intent, common plan, identity, lack of mistake, or accident. There was no abuse of discretion here. (See People v. Jones (2013) 57 Cal.4th 899, 930, 161 Cal.Rptr.3d 295, 306 P.3d 1136.) Defendant's assault on Brenda was relevant to prove that he intentionally *37used deadly force on McKenna and to defeat his claim that her death was accidental. The jury was properly instructed on the limitations on how the evidence could be used.12 *665In order to be relevant, the \"least degree of similarity (between the uncharged act and the charged offense) is required in order to prove intent. [Citation.] '[T]he recurrence of a similar result ... tends (increasingly with each instance) to [negate] accident or inadvertence or self-defense or good faith or other innocent mental state, and tends to establish (provisionally, at least, though not certainly) the presence of the normal, i.e., criminal, intent accompanying such an act ....' [Citation.] In order to be admissible to prove intent, the uncharged misconduct must be sufficiently similar to support the inference that the defendant ' \"probably harbor[ed] the same intent in each instance.\" ' \" ( People v. Ewoldt (1994) 7 Cal.4th 380, 402, 27 Cal.Rptr.2d 646, 867 P.2d 757 ( Ewoldt ).)\n\nDefendant argues that his spousal abuse was so dissimilar from the McKenna strangulation that it was irrelevant to prove intent or demonstrate lack of accident. He observes that corporal injury on a spouse is a general intent crime, while the current crime was murder. He argues that the assault on McKenna occurred during a sexual encounter, while the assault on Brenda was prompted by an argument over his drug use and his fear that she would report him to his parole officer. He further contends that there could be no inference of lack of accident from \" 'the recurrence of a similar result' \" ( Ewoldt , supra , 7 Cal.4th at p. 402, 27 Cal.Rptr.2d 646, 867 P.2d 757 ), because here there was no similar result. McKenna died and Brenda did not.\n\nHis arguments miss the mark. Defendant's statements to police placed his intent at issue. He claimed that he and McKenna engaged in consensual sex, during which she asked him to strangle her. He insisted that she wanted to be strangled and her death was accidental. McKenna's death prevented her from telling her side of the story. However, the assaults on Brenda and McKenna were sufficiently similar to support several inferences related to defendant's own intent and motive. In both cases defendant strangled women with whom he was intimate. Brenda was rendered unconscious twice. The effect on McKenna was lethal. Defendant's conduct with Brenda could support an inference that he acted with conscious disregard for the danger to the lives of both women, **887and that he intended to dominate his intimate partners in that manner. The fortuity that Brenda survived the strangulation does not diminish the legitimate inference that defendant harbored a similar intent when he strangled McKenna, and that her death was not accidental. *666Defendant further argues that the trial court erroneously admitted the evidence under a theory of common design or plan. *38(See Ewoldt , supra , 7 Cal.4th at p. 393, 27 Cal.Rptr.2d 646, 867 P.2d 757.) But the jury was instructed it could consider the assault on Brenda only on the issues of intent, mistake or accident, and whether the defendant reasonably and in good faith believed that McKenna consented. The jury was expressly told: \"Do not consider this evidence for any other purpose except for the limited purposes identified above.\" Defendant cites nothing in the record to suggest that the jury was confused about the meaning of this limiting instruction. We therefore need not decide whether the evidence was also admissible to show a common design or plan.\n\nFinally, defendant argues that the trial court abused its discretion by failing to exclude evidence of the assault against Brenda under Evidence Code section 352. Not so. Defendant's denial of criminal intent and his claim of accident made his prior assaultive conduct particularly probative. The spousal assault, while certainly blameworthy, was not unduly inflammatory compared to the gruesome murder of McKenna. Moreover, the jury knew defendant had already served a prison sentence for his attack on Brenda. (See People v. Balcom (1994) 7 Cal.4th 414, 427, 27 Cal.Rptr.2d 666, 867 P.2d 777.) No abuse of discretion appears.\n\n3. Unreasonable Belief that the Victim Consented to Intercourse\n\nThe trial court instructed the jury with CALCRIM No. 1000 defining rape. The instruction, as given, stated in relevant part: \"The defendant is not guilty of rape if he actually and reasonably believed that the woman consented to the intercourse. The People have the burden of proving beyond a reasonable doubt that the defendant did not actually and reasonably believe that the woman consented. If the People have not met this burden, you must find the defendant not guilty.\" Two other instructions also referred to a reasonable and good faith belief that the victim consented to intercourse.13\n\nDefendant requested the relevant language of CALCRIM Nos. 1000 and 1194, and did not object to the language of CALCRIM No. 375, requested by *667the prosecutor. On appeal, he argues that the trial court had a sua sponte duty to modify the instructions to allow the jury to consider whether he harbored a good faith but unreasonable belief that the victim consented to intercourse. Defendant maintains that rape felony murder and the rape-murder special circumstance require specific intent, as opposed to the general intent required for rape. He reasons that the element of specific intent may be negated by an unreasonable mistake of fact, and he was entitled to an instruction that if he had a bona fide but unreasonable belief that McKenna consented, he lacked the requisite intent.\n\nDefendant is correct that rape is a general intent crime ( *39People v. Osband (1996) 13 Cal.4th 622, 685, 55 Cal.Rptr.2d 26, 919 P.2d 640 ), while we have said that rape felony murder requires a specific intent to commit rape. ( **888People v. Haley (2004) 34 Cal.4th 283, 314, 17 Cal.Rptr.3d 877, 96 P.3d 170 ; People v. Jones (2003) 29 Cal.4th 1229, 1256-1257, 131 Cal.Rptr.2d 468, 64 P.3d 762 ; People v. Hernandez (1988) 47 Cal.3d 315, 346, 253 Cal.Rptr. 199, 763 P.2d 1289.) Contrary to defendant's argument, we have also said that a felony-murder special circumstance does not require a finding of specific intent when the underlying crime is one of general intent. ( People v. Davis (1995) 10 Cal.4th 463, 518-519, 41 Cal.Rptr.2d 826, 896 P.2d 119 ; but see People v. Hughes (2002) 27 Cal.4th 287, 342-343, 116 Cal.Rptr.2d 401, 39 P.3d 432 ; People v. Clark (1993) 5 Cal.4th 950, 1021, 22 Cal.Rptr.2d 689, 857 P.2d 1099.)\n\nPeople v. Mayberry (1975) 15 Cal.3d 143, 125 Cal.Rptr. 745, 542 P.2d 1337 ( Mayberry ) held that a defendant's reasonable and good faith mistake of fact that the victim consented to sexual intercourse is a defense to rape. ( Id . at p. 155, 125 Cal.Rptr. 745, 542 P.2d 1337.) We have not considered whether the reasonableness component of the Mayberry defense applies in a case involving rape felony murder or the rape-murder special circumstance. We need not answer that question here. Defendant has forfeited his claim of instructional error, and the alleged error was harmless in any event.\n\na. Forfeiture\n\n\" ' \"It is settled that in criminal cases, even in the absence of a request, a trial court must instruct on general principles of law relevant to the issues raised by the evidence\" ' and ' \"necessary for the jury's understanding of the case.\" ' \" ( People v. Brooks (2017) 3 Cal.5th 1, 73, 219 Cal.Rptr.3d 331, 396 P.3d 480.) The court has a sua sponte duty to give a Mayberry instruction about good faith and reasonable belief in the victim's consent \" 'if it appears ... the defendant is relying on such a defense, or if there is substantial evidence supportive of such a defense and the defense is not inconsistent with the defendant's theory of the case.' \" ( Ibid. ; accord, *668People v. Maury (2003) 30 Cal.4th 342, 423-425, 133 Cal.Rptr.2d 561, 68 P.3d 1 ; People v. Lujano (2017) 15 Cal.App.5th 187, 194, 223 Cal.Rptr.3d 105 ; People v. Burnham (1986) 176 Cal.App.3d 1134, 1141-1142, 222 Cal.Rptr. 630.) Section 1127d, subdivision (a) requires that the trial court instruct on the permissible use of evidence that the victim consented to sex with the defendant on other occasions, and that such evidence is relevant to \"whether the defendant had a good faith reasonable belief that the victim consented to the [charged] act of sexual intercourse.\" The trial court instructed the jury according to these general principles.\n\nBy contrast, at the time of defendant's trial in July 2007, no California case had held that a good faith but unreasonable belief in consent would negate a specific intent to commit rape. Our closest authority at that time was People v. Stitely , supra , 35 Cal.4th 514, 26 Cal.Rptr.3d 1, 108 P.3d 182. There the defendant challenged the trial court's failure to instruct on a Mayberry defense in the context of rape felony murder. ( Id . at pp. 552-554, 26 Cal.Rptr.3d 1, 108 P.3d 182.) We recited the requirement that the defendant's subjective belief in the victim's consent be \" 'reasonable under the circumstances.' \" ( Id . at p. 554, 26 Cal.Rptr.3d 1, 108 P.3d 182.) We went on to note that the failure to instruct, if error, was harmless. ( Ibid . ) We did not consider the precise claim defendant raises here. And at the time of defendant's trial at least one appellate court had assumed that the Mayberry reasonableness standard applies when the charged sexual offense *40requires specific intent, such as assault with intent to commit rape. ( People v. Rivera (1984) 157 Cal.App.3d 736, 738, 741-742, 203 Cal.Rptr. 842.)14\n\n\"[A] legal concept that has been referred to only infrequently, and then with 'inadequate elucidation,' cannot be considered a general principle of law such that a trial court must include it within jury instructions in the absence of a request.\" ( People v. Bacigalupo (1991) 1 Cal.4th 103, 126, 2 Cal.Rptr.2d 335, 820 P.2d 559 ( Bacigalupo ), judg. vacated and remanded on other grounds sub nom .\n\n**889Bacigalupo v. California (1992) 506 U.S. 802, 113 S.Ct. 32, 121 L.Ed.2d 5, quoting People v. Flannel (1979) 25 Cal.3d 668, 681, 160 Cal.Rptr. 84, 603 P.2d 1 ( Flannel ), superseded on other grounds as stated in In re Christian S. (1994) 7 Cal.4th 768, 777, 30 Cal.Rptr.2d 33, 872 P.2d 574 ( Christian S . ).) In Flannel , we held for the first time that \"a genuine but unreasonably held belief [in the need for self-defense] negates the mental state of malice aforethought that is necessary for a murder conviction.\" ( Flannel , at p. 682, 160 Cal.Rptr. 84, 603 P.2d 1.) We also clarified that, going forward, trial courts would have a sua sponte duty to instruct on unreasonable self-defense, *669when warranted by the evidence. ( Id. at pp. 682-683, 160 Cal.Rptr. 84, 603 P.2d 1 ) But we held that the trial court's failure to instruct on that theory did not require reversal because the theory of unreasonable self-defense was not so well-established that the trial court could be faulted for failing to instruct sua sponte. ( Id. at pp. 675, 681-683, 160 Cal.Rptr. 84, 603 P.2d 1.) This was true even though several decisions from the Courts of Appeal had already recognized unreasonable self-defense - and even though we had previously \"affirmed [its] existence\" in dicta. ( Id. at p. 676, 160 Cal.Rptr. 84, 603 P.2d 1 ; see also id . at pp. 675-676, 160 Cal.Rptr. 84, 603 P.2d 1, citing People v. Lewis (1960) 186 Cal.App.2d 585, 9 Cal.Rptr. 263, People v. Best (1936) 13 Cal.App.2d 606, 57 P.2d 168, and People v. Sedeno (1974) 10 Cal.3d 703, 112 Cal.Rptr. 1, 518 P.2d 913 ). As we explained in Bacigalupo , \" Flannel does not suggest that ... acceptance of a legal rule in one intermediate appellate decision\" imposes a sua sponte duty to instruct on that rule.\" ( 1 Cal.4th at pp. 126-127, fn. 4, 2 Cal.Rptr.2d 335, 820 P.2d 559.)\n\nDefendant argues it is well established that a defendant who genuinely makes an unreasonable mistake of fact as to consent necessarily lacks the specific intent to rape. He relies by analogy on cases holding that a bona fide belief in a claim of right to property or that the property was abandoned disproves the specific intent requirement for certain theft offenses, even if that belief is unreasonable. (See, e.g., People v. Russell (2006) 144 Cal.App.4th 1415, 1425-1426, 51 Cal.Rptr.3d 263 ; People v. Navarro (1979) 99 Cal.App.3d Supp. 1, 5-6, 10-11, 160 Cal.Rptr. 692 ; see generally People v. Tufunga (1999) 21 Cal.4th 935, 938, 90 Cal.Rptr.2d 143, 987 P.2d 168.) He also relies on our recognition of a defense to malice-murder based on an actual but unreasonable belief in the need for self-defense. (See Christian S. , supra , 7 Cal.4th at pp. 778, 783, 30 Cal.Rptr.2d 33, 872 P.2d 574.) But extension of this principle to sex crimes requiring specific intent is not a foregone conclusion.\n\n*41The issue has not arisen frequently, and at the time of defendant's trial no Court of Appeal had squarely addressed the viability of an unreasonable mistake of fact defense in this context. One court has since issued a decision offering some support for defendant's position, but that decision was rendered several years after defendant's trial. (See People v. Braslaw , supra , 233 Cal.App.4th at pp. 1247-1249, 183 Cal.Rptr.3d 575.) In any event, one appellate decision in support of a legal rule does not \"transform[ ] it into a general principle of law\" ( Bacigalupo , supra , 1 Cal.4th at pp. 126-127, fn. 4, 2 Cal.Rptr.2d 335, 820 P.2d 559 ). We have never considered, let alone decided, the issue. Under the governing authority of Flannel and Baciagalupo , defendant's unreasonable mistake theory falls far short of a well-established rule that would have required a sua sponte instruction. Because defendant never requested such an instruction, he has forfeited the issue.\n\nb. Harmless Error\n\nNotwithstanding forfeiture, and even assuming the validity of defendant's unreasonable-belief-in-consent theory, the alleged error in failing to instruct *670on that defense was harmless. \"Error in failing to instruct on the mistake-of-fact defense is subject to the harmless error test set forth in People v. Watson (1956) 46 Cal.2d 818, 836, 299 P.2d 243.\" ( People v. Russell , supra , 144 Cal.App.4th at p. 1431, 51 Cal.Rptr.3d 263 ; accord, People v. Watt (2014) 229 Cal.App.4th 1215, 1219-1220, 177 Cal.Rptr.3d 871, and cases cited; People v. Givan (2015) 233 Cal.App.4th 335, 349, 182 Cal.Rptr.3d 592 ; People v. Hanna (2013) 218 Cal.App.4th 455, 462-463, 160 Cal.Rptr.3d 210 ; **890People v. Sojka , supra , 196 Cal.App.4th at p. 738, 126 Cal.Rptr.3d 400.) Under this standard, a conviction \"may be reversed in consequence of this form of error only if, 'after an examination of the entire cause, including the evidence' ( Cal. Const., art. VI, § 13 ), it appears 'reasonably probable' the defendant would have obtained a more favorable outcome had the error not occurred [citation].\" ( People v. Breverman (1998) 19 Cal.4th 142, 178, 77 Cal.Rptr.2d 870, 960 P.2d 1094, fn. omitted ( Breverman ).)15\n\nThere was compelling evidence that defendant strangled McKenna to death during an act of rape. McKenna had contusions and abrasions on her upper torso, mouth, and nose consistent with the use of force. The pathologist testified that defendant would have had to apply pressure to McKenna's neck for \"a couple of minutes\" before she lost consciousness, and then for one or two more minutes to stop her heart. This evidence strongly supported an inference of premeditated and deliberate intent to kill, and undermined any suggestion that defendant believed in good faith the victim had consented. Defendant's two attempts to clean up the crime scene and his flight from the apartment the next day also cast into doubt his description of a consensual encounter and accidental death. Finally, defendant's forcible rape and strangulation of Anne H. and Mabel L. were strong evidence that he assaulted McKenna in a similar fashion and with similar intent.\n\nThe evidence presented at trial and the defense theory of the case provided very little support for a claim that defendant mistakenly harbored a good faith but unreasonable belief in McKenna's consent.\n\n*42The defense argued actual consent : defendant and McKenna engaged in foreplay, she removed his clothes, and she willingly engaged in intercourse. Although there were elements of force involved, defendant made clear that McKenna instigated the \"rough sex,\" enjoyed it, and encouraged him to choke her.\n\nAccording to defendant, this was not their first sexual encounter. He claimed that two days before her death, he and McKenna \"got high together, we talked, we fooled around, what people call petting, and one thing led to another, we had sex ....\" He claimed it was \"[r]egular missionary style sex,\" and was not violent. \"[W]e both wanted sex and we had sex.\"\n\n*671Defendant said that, on the day of McKenna's death, she invited defendant to her apartment. The two of them used drugs and drank together. They were \"fooling around,\" she removed his clothing, and \"she was the aggressor that night.\" During intercourse, McKenna set the tone by hitting, slapping, and biting him. Then she asked him to choke her. He used her panties or bra to choke her, but she said it was not sufficient. According to defendant, she seemed to enjoy it. He choked her to unconsciousness, and at some point he realized she was dead. He did not intend to kill her.\n\nWhen asked if McKenna slapped defendant during sex to fight him off, he responded, \"She had no reason to fight me off.\" Asked if McKenna had told defendant to stop choking her at some point, defendant responded, \"she may have,\" and, \"I don't know.\" But defendant also repeatedly insisted that he did not rape McKenna. He did not contend that McKenna revoked an initial grant of consent or that he failed to appreciate that fact. Moreover, such a theory would have been substantially undermined by the length of time it would have taken to fatally strangle McKenna, and by defendant's subsequent conduct on two successive days.\n\nConsistent with defendant's description of events, defense counsel argued in closing that the critical issue before the jury was actual consent. She argued that defendant's claim of a sexual relationship with McKenna was corroborated by the testimony of Brenda and Robert Molano that they frequently saw defendant at McKenna's residence. Counsel noted several circumstances consistent with consensual intercourse. There were no signs of forced entry into McKenna's apartment. A container of condoms, an empty condom **891wrapper, personal lubricant, and empty wine and beer bottles were found inside the cottage. The autopsy revealed no injuries to McKenna's genitalia. Defense counsel argued that this circumstantial evidence, as well as defendant's own account, all pointed to consensual sex.\n\nBut the jury evidently rejected all of this, and instead believed the People's theory of the case: that defendant entered McKenna's home and forcibly raped her from the start of the encounter. Even if defendant had received an instruction permitting him to argue that he genuinely but unreasonably believed McKenna consented, it is not reasonably probable that such an instruction would have made a difference on this record.\n\nOn appeal, defendant argues that he \"has a history of unreasonably believing that women with whom he has had sex have consented to do so when in fact they have not done so, particularly when [he] is under the influence of drugs and alcohol or other altered psychological states.\" But nothing about the circumstances as defendant recounted them suggested that he actually misperceived the situation or could not form the specific intent to *672commit rape due to his intoxication. On the contrary, defendant recalled several details *43about the encounter, suggesting that his intoxication did not in fact interfere to a significant degree with his perception. Moreover, the jury was instructed that it could consider defendant's intoxication in deciding whether he intended to kill, acted with deliberation and premeditation, or intended to commit rape. Because the jury found defendant guilty of first degree murder, it was unlikely to accept a theory of intoxication that would have supported defendant's argument of a good faith but unreasonable belief in consent.\n\nConsidering the strength of the prosecution's case and the lack of evidence or argument supporting defendant's belatedly advanced theory of mistake of fact, there is no reasonable likelihood that the jury would have reached a different result had it been instructed in the manner defendant now suggests.\n\nFor much the same reasons, we reject defendant's claim that the absence of an instruction undermined his right to present a complete defense implicating due process and the prejudice standard articulated in Chapman v. California (1967) 386 U.S. 18, 24, 87 S.Ct. 824, 17 L.Ed.2d 705. As we explained in People v. Rogers (2006) 39 Cal.4th 826, 48 Cal.Rptr.3d 1, 141 P.3d 135 : \"Defendant relies on cases in which federal courts have held that a trial court's failure to give a requested instruction (whether on a lesser included offense, or on some other subject) embodying the defense theory of the case and around which the defendant had built his or her defense, violated the defendant's due process right to present a complete defense. [Citations.] [¶] In these cases, unlike the present one, the instruction at issue was requested by the defense. The cases do not support the proposition that a trial court's failure to instruct on a lesser included offense sua sponte denies due process. Further, nothing in the record suggests the trial court would not have given the express malice second degree murder instruction had the defense asked for it. Nor can it be said that the omitted instruction 'embodied the defense theory of the case.' Rather, in closing argument the only lesser-included-offense verdict that defense counsel asked the jury to return was manslaughter. Although the defense presented evidence of lack of premeditation and deliberation and argued the prosecution's evidence did not support a finding of premeditation, defense counsel did not ask the jury to return a verdict of second degree murder. Because defendant was allowed to present the defense he chose, followed by jury instructions he agreed to, he was not denied due process by being deprived of the opportunity to present a complete defense.\" ( Id . at p. 872, 48 Cal.Rptr.3d 1, 141 P.3d 135 fn.omitted; accord People v. Humphrey (1996) 13 Cal.4th 1073, 1089, 56 Cal.Rptr.2d 142, 921 P.2d 1.)\n\nHere, too, defendant did not request an instruction on unreasonable but good faith belief in consent. That theory played no role in the defense he chose. No due process violation appears.\n\n**892*673B. Penalty Phase Issues\n\n1. Victim Impact Testimony\n\nAt the penalty phase, McKenna's brother Ronald testified that his sister Patti Dutoit committed suicide after the murder, adding, \"I lost two sisters because of this clown.\" The court had earlier ruled that the cause of Dutoit's death was not to be mentioned before the jury. Consistent with this ruling, it twice admonished the jury to disregard Ronald's statement. Defendant claims that the prosecutor improperly elicited evidence in violation of the court's order and that the court abused its discretion in denying his motions for a mistrial. He argues that admission of Ronald's testimony was \"incurable error\" that violated *44the Fifth, Sixth, Eighth, and Fourteenth Amendments and deprived him of a fair trial and due process, notwithstanding the court's corrective actions. We reject these claims.\n\n\"To constitute a violation under the federal Constitution, prosecutorial misconduct must 'so infect[ ] the trial with unfairness as to make the resulting conviction a denial of due process.' [Citations.] 'But conduct by a prosecutor that does not render a criminal trial fundamentally unfair is prosecutorial misconduct under state law only if it involves the use of deceptive or reprehensible methods to attempt to persuade either the court or the jury.' [Citation.] To be cognizable on appeal, a defendant ' \"must make a timely objection at trial and request an admonition; otherwise, the [claim of prosecutorial misconduct] is reviewable only if an admonition would not have cured the harm caused by the misconduct.\" ' \" ( People v. Valdez (2004) 32 Cal.4th 73, 122, 8 Cal.Rptr.3d 271, 82 P.3d 296 ( Valdez ).)\n\nSeven months after McKenna's death, her sister, Dutoit, died as a result of respiratory failure following a drug overdose. Dutoit's family members believed her death was a suicide committed in response to McKenna's murder. The defense moved to exclude any such testimony at the penalty phase. The court ruled that family members could testify about Dutoit's death, but not that the cause of the death was suicide. The court authorized the prosecutor to \"ask surviving family members how Patt[i] reacted to Sue's murder,\" but cautioned the prosecutor to admonish the witnesses not to state that her reaction was to commit suicide.\n\nDuring the testimony of McKenna's brother, Ronald, the prosecutor asked if there was a special bond between Dutoit and McKenna. He replied, \"Yes. They hung out together a lot. They were probably closest.\" When the prosecutor asked, \"How did Patti take the news of Sue's death?\" Ron replied, \"Very bad. She committed suicide. So I lost two sisters because of this clown.\" Defense counsel objected to the answer and asked that it be stricken.\n\n*674In response, the court admonished the jury that \"you are not to consider the suicide mentioned as in any way relating to the defendant Molano.\" In a discussion outside of the jury's presence, the prosecutor stated for the record that \"I did this morning in no uncertain terms make it very clear to both Yvonne Searle and Ron McKenna that there would be no mention of Patti committing suicide. I even explained the basis of the ruling and discussed the parameters of what could be shared in court, and frankly Mr. McKenna wasn't listening very closely because we were all here when he did make the statement.\"\n\nDefendant twice moved for a mistrial on the ground that Ronald's reference to Dutoit's suicide had resulted in incurable prejudice. The court denied the motions. At the close of the penalty phase, the court again instructed the jury to disregard Ronald's testimony: \"If I ordered testimony stricken from the record, you must disregard it and must not consider that testimony for any purpose. In this regard, the opinion testimony of the witness Ron McKenna that his sister Patricia Dutoit had committed suicide in reaction to Sue McKenna's death and that Carl Molano was responsible for Patricia Dutoit's death has no basis in fact , and that testimony was ordered stricken from the record. You must not consider it for any purpose.\" (Italics added.)\n\nDefendant claims that the prosecutor committed misconduct by eliciting the testimony about suicide. Not so. A prosecutor commits misconduct by \" ' \" 'intentionally elicit[ing] inadmissible testimony.'\n\n*45[Citations.]\"\n\n**893[Citation.]' \" ( People v. Tully (2012) 54 Cal.4th 952, 1035, 145 Cal.Rptr.3d 146, 282 P.3d 173 ( Tully ).) \"However, a prosecutor cannot be faulted for a witness's nonresponsive answer that the prosecutor neither solicited nor could have anticipated.\" ( Ibid . ) Here, the prosecutor directly admonished Ronald not to mention that Dutoit had committed suicide, and further \"explained the basis of the ruling and discussed the parameters of what could be shared in court.\" The prosecutor's representation was unchallenged by defense counsel and accepted by the court. Defendant now asserts that the prosecutor's question was in fact \"designed\" to elicit inadmissible testimony, and that the prosecutor either \"failed to admonish [Ronald] at all, or failed to admonish [him] in a manner sufficient to achieve the goal.\" His argument \"is mere conjecture unsupported by the record.\" ( Tully , at p. 1041, fn. 32, 145 Cal.Rptr.3d 146, 282 P.3d 173.)\n\nCiting People v. Hill (1998) 17 Cal.4th 800, 72 Cal.Rptr.2d 656, 952 P.2d 673, defendant further counters that \"no showing of intentionality or bad faith is required\" to establish that a prosecutor committed misconduct by eliciting inadmissible evidence in violation of a court order. Hill reaffirmed that the prosecutor need not act in bad faith or with intentionality in order to commit misconduct of the type involved there. ( Id . at pp. 822-823, 72 Cal.Rptr.2d 656, 952 P.2d 673.) Hill involved allegations that the prosecutor had misstated the evidence and *675the law, referred to facts not in evidence, made derisive comments about defense counsel, intimidated witnesses, and made improper references to the Bible. ( Id . at pp. 823, 827, 829, 832, 836-838, 72 Cal.Rptr.2d 656, 952 P.2d 673.) Such behavior may be misconduct even if inadvertent. Nonetheless, after Hill , we have repeatedly reaffirmed that a claim of misconduct based on allegations that the prosecutor elicited evidence in violation of a court order requires proof that the prosecutor acted deliberately or intentionally. ( Tully , supra , 54 Cal.4th at p. 1035, 145 Cal.Rptr.3d 146, 282 P.3d 173 ; People v. Fuiava (2012) 53 Cal.4th 622, 679, 137 Cal.Rptr.3d 147, 269 P.3d 568 ; People v. Chatman (2006) 38 Cal.4th 344, 379-380, 42 Cal.Rptr.3d 621, 133 P.3d 534 ; Valdez , supra , 32 Cal.4th at p. 125, 8 Cal.Rptr.3d 271, 82 P.3d 296 ; People v. Smithey (1999) 20 Cal.4th 936, 960, 86 Cal.Rptr.2d 243, 978 P.2d 1171.) Indeed, Smithey noted that the lead case for that proposition, People v. Bonin (1988) 46 Cal.3d 659, 689, 250 Cal.Rptr. 687, 758 P.2d 1217, had been overruled by Hill on another point. ( Smithey , at p. 960, 86 Cal.Rptr.2d 243, 978 P.2d 1171, citing Hill , at p. 800, 823, fn. 1, 72 Cal.Rptr.2d 656, 952 P.2d 673 [overruling the discussion in Bonin , 46 Cal.3d at p. 702, 250 Cal.Rptr. 687, 758 P.2d 1217 of bad faith regarding the prosecutor's argument to the jury].) As noted, the prosecutor asked a question consistent with the court's direction. He also expressly admonished Ronald not to mention Dutoit's suicide. The witness's apparent willful refusal to abide by this admonishment does not establish misconduct by the prosecutor. ( Valdez , at p. 125, 8 Cal.Rptr.3d 271, 82 P.3d 296 [no misconduct where \"the prosecutor did not intentionally solicit, and could not have anticipated,\" the witness's testimony].)\n\nDefendant argues another of the prosecutor's questions contravened the court's ruling. Specifically, the prosecutor asked Ronald and Yvonne Searle (McKenna's mother), whether McKenna was a \"lifeline\" for Dutoit. There was no objection to this questioning, rendering any claim of misconduct forfeited. ( People v. Samayoa (1997) 15 Cal.4th 795, 841, 64 Cal.Rptr.2d 400, 938 P.2d 2.) Further, the question was not improper. The trial court ruled that the prosecutor could ask *46McKenna's family members about how Dutoit reacted to McKenna's murder so long as he admonished them not to say that her reaction was to commit suicide. Before questioning the two witnesses, the prosecutor so admonished them. In response to the prosecutor's question about McKenna being a \"lifeline\" for Dutoit, Ronald simply answered, \"Yes.\" He had previously explained that McKenna and Dutoit \"hung out together a lot. They were probably closest.\" In response to the same question, Searle testified that Dutoit was an alcoholic and a recluse, and that McKenna provided her with alcohol. The prosecutor's question was not designed to elicit, nor did it actually elicit, inadmissible testimony in violation of the court's order. **894We also reject defendant's claim that the court erred in not granting a mistrial based on Ronald's testimony. When a witness's volunteered statement is not attributable to either party, a mistrial is called for only if the misconduct is so inherently prejudicial as to threaten defendant's right to a *676fair trial despite admonitions from the court. ( People v. Dement (2011) 53 Cal.4th 1, 39-40, 133 Cal.Rptr.3d 496, 264 P.3d 292 ( Dement ).) \" ' \"Whether a particular incident is incurably prejudicial is by its nature a speculative matter, and the trial court is vested with considerable discretion in ruling on mistrial motions. ...\" [Citation.] A motion for a mistrial should be granted when \" ' \"a [defendant's] chances of receiving a fair trial have been irreparably damaged.\" ' \" ' \" ( Ibid . )\n\nRonald's comment was not \" 'so incurably prejudicial that a new trial was required.' \" ( Dement , supra , 53 Cal.4th at p. 40, 133 Cal.Rptr.3d 496, 264 P.3d 292.) The trial court took corrective action by admonishing the jury immediately, and again at the end of the penalty phase. The court's admonition was decisive and clear. It told the jury that the comment \"has no basis in fact , and that testimony was ordered stricken from the record. You must not consider it for any purpose.\" (Italics added.) The jurors are presumed to have followed the court's admonishment. ( People v. Montes (2014) 58 Cal.4th 809, 888, 169 Cal.Rptr.3d 279, 320 P.3d 729.)\n\nDefendant counters that Ronald's comment was so inflammatory that no admonishment could undo the damage. He is incorrect. Although defendant describes the testimony as \"factually baseless, highly improper, and grossly inflammatory,\" we have in fact held that a family member's attempted suicide as a result of the victim's death can be proper victim impact evidence. ( People v. Booker (2011) 51 Cal.4th 141, 154, 193, 119 Cal.Rptr.3d 722, 245 P.3d 366 ; People v. Wilson (2005) 36 Cal.4th 309, 356-357, 30 Cal.Rptr.3d 513, 114 P.3d 758.) Acting within the scope of its discretion, the court here ruled the evidence inadmissible. But the fact that our decisions support a broader view of admissibility \"must certainly factor into any prejudice analysis.\" ( Tully , supra , 54 Cal.4th at p. 1035, fn. 30, 145 Cal.Rptr.3d 146, 282 P.3d 173.) On that score, defendant is incorrect to suggest that there was no concrete evidence that Dutoit actually committed suicide because the death certificate did not explicitly indicate that cause of death. There was evidence before the court that the cause of death was a drug overdose, and that Dutoit had expressed a desire to take her own life after McKenna was murdered. This evidence could certainly support an inference of suicide.\n\nThe jury was likely to see Ronald's statement for what it was: an opinion by a brother grief stricken over the loss of two sisters. It is qualitatively different from the cases defendant cites, where the prosecutor *47improperly suggested that the defendant had been involved in drug sales or that there was a specific description of the assailant that matched the defendant's appearance. (See, e.g., People v. Wagner (1975) 13 Cal.3d 612, 619-621, 119 Cal.Rptr. 457, 532 P.2d 105 ; People v. Evans (1952) 39 Cal.2d 242, 248-252, 246 P.2d 636.) Moreover, both parties elicited evidence that Dutoit was a *677reclusive alcoholic and suffered from significant psychological problems predating McKenna's death. Dutoit lived with her mother, Yvonne Searle. Searle described Dutoit as a \"chronic alcoholic\" who could not leave the house and relied on McKenna to bring her alcohol. Both the prosecution and the defense questioned Ronald on these topics, and he admitted as much before the jury. Specifically, the prosecutor asked Ronald, \"In fairness, it's true, is it not, that Patti had significant psychological problems before Sue was murdered, is that correct?\" Ronald agreed. This evidence countered any suggestion by Ronald that defendant's acts were the sole or even primary reason Dutoit took her own life.\n\nGiven the manner in which the evidence was presented, and the trial court's express admonitions to the jury, Ronald's assertion that defendant was responsible for Dutoit's suicide was not incurably prejudicial. The trial court did not abuse its discretion in denying the motion for mistrial, nor was defendant deprived of a fundamentally fair trial or due process.\n\n**8952. Cumulative Error\n\nDefendant contends that the cumulative effect of the asserted guilt and penalty phase errors was prejudicial. We concluded Ronald testified at the penalty phase in contravention of a court order, but that any prejudice was cured by the trial court's admonition and by other evidence tending to undermine the significance of his assertions. We have also held that any assumed error in failing to instruct at the guilt phase on a good faith but unreasonable belief in consent to intercourse was not prejudicial. No different conclusion results from considering these two circumstances cumulatively.\n\n3. Challenges to the Death Penalty Statute\n\nDefendant raises a series of constitutional challenges to California's death penalty scheme, all of which we have considered and rejected before. Because he offers no compelling reasons to reconsider our precedent, we decline his invitation to do so.\n\n\" Section 190.2 adequately narrows the class of murderers subject to the death penalty.\" ( People v. Delgado (2017) 2 Cal.5th 544, 591, 214 Cal.Rptr.3d 223, 389 P.3d 805 ( Delgado ); accord People v. Brooks , supra , 3 Cal.5th at pp. 114-115, 219 Cal.Rptr.3d 331, 396 P.3d 480.)\n\nSection 190.3, factor (a) properly permits the jury to consider the circumstances of the crime in deciding the appropriate punishment. ( Tuilaepa v. California (1994) 512 U.S. 967, 975-976, 114 S.Ct. 2630, 129 L.Ed.2d 750.) It does not allow arbitrary and capricious imposition of the death *678penalty as applied. ( People v. Henriquez (2017) 4 Cal.5th 1, 45, 226 Cal.Rptr.3d 69, 406 P.3d 748 ( Henriquez ); People v. Winbush (2017) 2 Cal.5th 402, 489, 213 Cal.Rptr.3d 1, 387 P.3d 1187 ( Winbush ); People v. Simon (2016) 1 Cal.5th 98, 149, 204 Cal.Rptr.3d 380, 375 P.3d 1 ( Simon ).)\n\nThe death penalty statute is not unconstitutional because it \"does not require either unanimity as to the truth of aggravating circumstances or findings beyond a reasonable doubt that an aggravating circumstance (other than Pen. Code, § 190.3, factor (b) or factor (c) evidence)\n\n*48has been proved, that the aggravating factors outweighed the mitigating factors, or that death is the appropriate sentence.\" ( People v. Rangel (2016) 62 Cal.4th 1192, 1235, 200 Cal.Rptr.3d 265, 367 P.3d 649 ; accord, Henriquez , supra , 4 Cal.5th at p. 45, 226 Cal.Rptr.3d 69, 406 P.3d 748 ; Delgado , supra, 2 Cal.5th at p. 591, 214 Cal.Rptr.3d 223, 389 P.3d 805 ; Winbush , supra , 2 Cal.5th at p. 489, 213 Cal.Rptr.3d 1, 387 P.3d 1187.) Cunningham v. California (2007) 549 U.S. 270, 127 S.Ct. 856, 166 L.Ed.2d 856, Blakely v. Washington (2004) 542 U.S. 296, 124 S.Ct. 2531, 159 L.Ed.2d 403, Apprendi v. New Jersey (2000) 530 U.S. 466, 120 S.Ct. 2348, 147 L.Ed.2d 435, and Ring v. Arizona (2002) 536 U.S. 584, 122 S.Ct. 2428, 153 L.Ed.2d 556, do not compel a different conclusion. ( Henriquez , at p. 45, 226 Cal.Rptr.3d 69, 406 P.3d 748 ; Delgado , at p. 591, 214 Cal.Rptr.3d 223, 389 P.3d 805 ; Winbush , at p. 489, 213 Cal.Rptr.3d 1, 387 P.3d 1187.)\n\n\"The death penalty law is not unconstitutional for failing to require that the jury base any death sentence on written findings.\" ( People v. Elliot (2005) 37 Cal.4th 453, 488, 35 Cal.Rptr.3d 759, 122 P.3d 968 ; accord, Henriquez , supra , 4 Cal.5th at p. 46, 226 Cal.Rptr.3d 69, 406 P.3d 748 ; Winbush , supra , 2 Cal.5th at p. 490, 213 Cal.Rptr.3d 1, 387 P.3d 1187.) Nor does the federal Constitution require intercase proportionality review. ( Henriquez , at p. 46, 226 Cal.Rptr.3d 69, 406 P.3d 748 ; Winbush , at p. 490, 213 Cal.Rptr.3d 1, 387 P.3d 1187 ; Simon , supra , 1 Cal.5th at p. 149, 204 Cal.Rptr.3d 380, 375 P.3d 1.)\n\n\"Use in the sentencing factors of such adjectives as 'extreme' ( § 190.3, factors (d), (g)) and 'substantial' (id ., factor (g)) does not act as a barrier to the consideration of mitigating evidence in violation of the federal Constitution.\" ( People v. Avila (2006) 38 Cal.4th 491, 614-615, 43 Cal.Rptr.3d 1, 133 P.3d 1076 ; accord, Delgado , supra , 2 Cal.5th at pp. 591-592, 214 Cal.Rptr.3d 223, 389 P.3d 805 ; Simon , supra , 1 Cal.5th at p. 150, 204 Cal.Rptr.3d 380, 375 P.3d 1.)\n\nThe court was not required to instruct the jury that section 190.3, factors (d), (e), (f), (g), (h) and (j) are only relevant as factors in **896mitigation. ( Delgado , supra , 2 Cal.5th at p. 592, 214 Cal.Rptr.3d 223, 389 P.3d 805 ; Winbush , supra , 2 Cal.5th at p. 490, 213 Cal.Rptr.3d 1, 387 P.3d 1187 ; Simon , supra , 1 Cal.5th at p. 150, 204 Cal.Rptr.3d 380, 375 P.3d 1.)\n\nThe equal protection clause does not require California to include in its capital sentencing scheme the same procedural safeguards provided noncapital defendants. The two groups are not similarly situated. ( Henriquez , supra , 4 Cal.5th at p. 45, 226 Cal.Rptr.3d 69, 406 P.3d 748 ; People v. Sivongxxay (2017) 3 Cal.5th 151, 199, 219 Cal.Rptr.3d 265, 396 P.3d 424 ( Sivongxxay ).)\n\n*679California's use of the death penalty, as actually implemented in this state, does not violate international law and the Eighth Amendment. ( Sivongxxay , supra , 3 Cal.5th at p. 199, 219 Cal.Rptr.3d 265, 396 P.3d 424 ; People v. Trinh (2014) 59 Cal.4th 216, 255, 173 Cal.Rptr.3d 1, 326 P.3d 939.)\n\nFinally, we reject defendant's claim that \"the cumulative impact of the alleged deficiencies in California's capital sentencing scheme render California's death penalty law constitutionally infirm. We have individually rejected each of defendant's challenges to California's death penalty law, and '[s]uch claims are no more compelling ... when considered together ....' [Citation.]\" ( People v. Williams (2013) 58 Cal.4th 197, 296, 165 Cal.Rptr.3d 717, 315 P.3d 1.)\n\nIII. DISPOSITION\n\nWe affirm the judgment.\n\nWe Concur:\n\nCANTIL-SAKAUYE, C. J.\n\nCHIN, J.\n\nLIU, J.\n\nCUÉLLAR, J.\n\nKRUGER, J.\n\nGROBAN, J.\n\nPenal Code, sections 187, subdivision (a), 189, 190.2, subdivision (a)(17)(C). Further unspecified statutory references are to the Penal Code.\n\nAn expert testified that around 40 percent of rape victims show no sign of genital trauma.\n\nBoth Brenda and Robert testified at trial.\n\nWe have independently reviewed the recorded interviews. (People v. Wash (1993) 6 Cal.4th 215, 238, 24 Cal.Rptr.2d 421, 861 P.2d 1107.) Quotations are from the prosecutor's transcripts provided to the trial court. We have not corrected minor typographical and grammatical errors in the original quoted material. Bracketed words and phrases reflect statements that were deemed unintelligible in the transcripts, but that we have been able to discern from our independent review of the recordings.\n\nNo mention of the conversation in the receiving area was included in Chicoine's April 3 supplemental police report.\n\nDuring the San Quentin interview, defendant had described an encounter on a street corner with one of his prior rape victims, a family friend. He had written her to apologize, and she told him she forgave him.\n\nChicoine's supplemental report of April 3 provided a similar account. It stated that after the recorder was turned off and defendant got out of the car, \"he told Dudek and I that he wanted to tell us everything. He explained that he did not want the court procedure to be a long drawn out ordeal. Dudek reiterated that he should wait until we got into the station where we would read him his rights again.\"\n\nWe recognize that defendant's incarceration for an unrelated offense does not necessarily constitute custody for Miranda purposes. (See Howes v. Fields (2012) 565 U.S. 499, 508-516, 132 S.Ct. 1181, 182 L.Ed.2d 17 ; Maryland v. Shatzer (2010) 559 U.S. 98, 112-114, 130 S.Ct. 1213, 175 L.Ed.2d 1045 (Shatzer ).) However, the People have not contested the point, so we need not further consider it.\n\nDefendant urges us to overrule Tate , supra , 49 Cal.4th 635, 112 Cal.Rptr.3d 156, 234 P.3d 428, to the extent it can be understood to hold that only deception \" ' \" ' \"of a type reasonably likely to procure an untrue statement\" ' \" ' \" will be said to invalidate a Miranda waiver. (Tate , at p. 684, 112 Cal.Rptr.3d 156, 234 P.3d 428.)\n\nTate 's discussion on that point was in response to the defendant's argument that \"by deceptively minimizing the seriousness of the investigation, the officers induced false statements that were later used against him.\" (Tate , supra , 49 Cal.4th at p. 684, 112 Cal.Rptr.3d 156, 234 P.3d 428, italics added.) According to defendant, it is unclear whether the holding in Tate addressed only deception during the interrogation, or also applied to deception used to obtain a waiver of Miranda rights. Given our conclusion that defendant's Miranda waiver was valid without resort to the deception standard articulated in Tate , we need not address the scope of that holding.\n\nThe significant exception to the bar against resumed interrogation is the one stated Edwards : questioning is permitted when \"the accused himself initiates further communication, exchanges, or conversations with the police.\" (Edwards , supra , 451 U.S. at p. 485, 101 S.Ct. 1880.)\n\nThe tape of the first interview included a reference by defendant to his counselor. When the officers advised him to let a guard know if he decided to talk, defendant responded \"[or] my counselor [or my captain or something].\"\n\nSpecifically, the jury was told that if it found the uncharged offense to be proved by a preponderance of the evidence, \"you may, but are not required to, consider the evidence for the limited purpose of deciding in the charged offense whether or not: The defendant intended to kill; or the defendant acted with the knowledge that his acts were reckless and that they created a high risk of death or great bodily injury; or, the defendant's alleged actions were the result of mistake or accident; or, the defendant reasonably and in good faith believed that Suzanne McKenna consented. Do not consider this evidence for any other purpose except for the limited purpose[s] identified above. If you conclude that the defendant committed the uncharged offense, that conclusion is only one factor to consider along with all the other evidence. It is not sufficient by itself to prove that the defendant is guilty of the charged offense and special circumstance allegation. The People must still prove each element of the charge beyond a reasonable doubt.\"\n\nCALCRIM No. 1194, as given, stated: \"You have heard evidence that Suzanne McKenna had consensual sexual intercourse with the defendant before the act that is charged in this case. You may consider this evidence only to help you decide whether the alleged victim consented to the charged act and whether the defendant reasonably and in good faith believed that Suzanne McKenna consented to the charged act. Do not consider this evidence for any other purpose.\" Section 1127d, subdivision (a) mandates that this instruction be given when evidence is admitted that the victim consented to sexual intercourse with the defendant before the occurrence of the charged crime.\n\nCALCRIM No. 375, as given, told the jury that it could consider evidence of defendant's assault on Brenda Molano in deciding, among other things, whether or not defendant \"reasonably and in good faith believed that Suzanne McKenna consented.\"\n\nThat assumption persists. (See, e.g., People v. Andrews (2015) 234 Cal.App.4th 590, 602-603, 184 Cal.Rptr.3d 183 ; People v. Sojka (2011) 196 Cal.App.4th 733, 736-739, 126 Cal.Rptr.3d 400 ; People v. Dillon (2009) 174 Cal.App.4th 1367, 1383-1384, 95 Cal.Rptr.3d 449 ; but see People v. Braslaw (2015) 233 Cal.App.4th 1239, 1249-1250, 183 Cal.Rptr.3d 575.)\n\nMayberry , supra , 15 Cal.3d at pages 157-158, 125 Cal.Rptr. 745, 542 P.2d 1337, applied the harmless error standard articulated in People v. Modesto (1963) 59 Cal.2d 722, 730, 31 Cal.Rptr. 225, 382 P.2d 33. That standard, however, has long since been repudiated. (Breverman , supra , 19 Cal.4th at pp. 175-176, 77 Cal.Rptr.2d 870, 960 P.2d 1094.)\n\n",
    "body_length": 149388,
    "citedas": [
      "249 Cal. Rptr. 3d 1",
      "7 Cal. 5th 620",
      "443 P.3d 856"
    ],
    "attorneys": "Wesley A. Van Winkle, under appointment by the Supreme Court, for Defendant and Appellant., Kamala D. Harris and Xavier Becerra, Attorneys General, Dane R. Gillette, Chief Assistant Attorney General, Gerald A. Engler, Assistant Attorney General, Alice B. Lustre and Juliet B. Haley, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [],
    "judges": "Corrigan",
    "citation_count": 1
  }
}
