{
  "id": "0qKNR2YBTlTomsSBM6LT",
  "document": {
    "title": "People v. Millwee",
    "full_title": "THE PEOPLE AND v. DONALD RAY MILLWEE AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1998-05-18T00:00:00.000Z",
    "docket": "S014755",
    "body": "Court: Superior County: Riverside Judge: Edward D. Webster and Robert D. Macomber Super. Ct. No. CR-27404\n\nRiverside County\n\nA jury in Riverside County found defendant Donald Ray Millwee guilty of one count each of first degree murder (Pen. Code, § 187) \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with use of a rifle (§§ 12022.5, 1192.7, subd. (c)(8)), robbery (§ 211), and burglary (§ 459). Two special circumstance allegations were found true - robbery-murder and burglary-murder. (§ 190.2, subd. (a)(17)(A) \u0026 (G) [formerly subd. (a)(17)(i) \u0026 (vii)].) The victim of each crime was Esta Millwee, defendant's physically disabled mother.\n\nAn initial penalty trial in front of jurors who had decided guilt ended prematurely in mistrial. Thereafter, a second jury heard evidence concerning the appropriate penalty and returned a verdict of death. The trial court declined to modify the verdict (§ 190.4, subd. (e)), and sentenced defendant to death for the murder with special circumstances. A consecutive sentence of seven years was imposed for the non-capital crimes and enhancements. This appeal is automatic. (Cal. Const., art. VI, § 11; Pen. Code, § 1239, subd. (b).)\n\nNo prejudicial error occurred at any phase of trial. The judgment will be affirmed in its entirety.\n\nI. GUILT PHASE FACTS\n\nA. Prosecution Case\n\nIn September 1986, defendant lived on the streets of Riverside, and was not steadily employed. Although a hip condition evidently prevented him from walking comfortably without a cane, he traveled throughout town on a bicycle he got from his father. Defendant spent much of his time in and around a bar called the Hi Ho Tavern.\n\nThe bar was located three to four miles from the hillside home of defendant's parents, Donald and Esta Millwee. Defendant's father was a licensed plumbing contractor who ran his own business. From time to time, defendant earned money by working with his father.\n\nDefendant's mother was housebound to some extent. She was essentially paralyzed on one side as the result of a brain aneurysm suffered in 1981. Although she performed chores around the house, she moved with the aid of a cane. She used a wheelchair when she left home to go shopping.\n\nSeveral family members and a close friend testified that defendant and his mother did not \"get along,\" and that defendant was not allowed inside the house when his mother was there alone. Although defendant would occasionally visit his parents' home in order to wash and eat, his father was routinely present on those occasions.\n\nThere also was an arrangement whereby Debra Millwee, who was married to defendant's brother, Ronald, and lived next door, would phone Esta whenever defendant was seen in the neighborhood so that Esta could make sure the doors were locked. Defendant's father testified that he routinely locked the doors when he left for work in the morning, but indicated that Esta would unlock them during the day to let their puppy outside.\n\nDefendant and his father arranged in advance to meet at the Hi Ho Tavern on September 8, 1986, the day of the crime, in order to drive to work together. When the father arrived at 7:35 that morning, defendant was barefoot and dirty, and smelled of alcohol. He also did not have his cane. Defendant explained that his shoes and cane were burned during a party and campfire the night before. When defendant's father said he would not take defendant to work in such a disheveled state, defendant became angry. He screamed obscenities at his father and said, \"This is the last.\" The pair argued briefly. Defendant's father left for work alone.\n\nAbout two and one-half hours later, shortly before 10 a.m., defendant's sister-in-law, Debra, saw defendant sitting with his bike alongside the road leading up the hill to his parents' house. Because she was driving into town with a friend, Debra did not call and warn Esta. Debra also assumed defendant's father was still at home. Around the same time, defendant's grandmother finished speaking with Esta on the phone. This was evidently the last time anyone heard from Esta alive.\n\nDefendant's father returned home from work around 4 o'clock that afternoon. He entered through a sliding glass door which was located at the rear of the house and which provided access to the kitchen and living room. The sliding door was closed but apparently unlocked.\n\nIn the kitchen, defendant's father found Esta's body sprawled on a stool that was tipped and leaning backwards against the counter. She had been shot once in the forehead and was cold to the touch. She was wearing an apron and plastic gloves, and a mop was lying on the floor nearby. A ceramic decoration that usually hung from a kitchen cabinet was lying broken in the pathway leading past the kitchen and between the sliding glass door and the living room.\n\nAfter summoning the police, defendant's father discovered several items missing from the premises: the Lincoln Continental owned by defendant's parents; the keys to the car; Esta's cane, which she always kept within reach; and her wheelchair, which had been left folded and standing near the sliding glass door when defendant's father left for work that morning. Also gone from the house was a Remington rifle, described further below. However, other valuable items were undisturbed, including several rings Esta was wearing under her gloves, jewelry and cash in the master bedroom, and electrical tools and equipment in the spare bedroom.\n\nDefendant's father owned two .22-caliber semi-automatic rifles, the Remington and a Marlin. Both weapons were usually stored in the living room closet. The Marlin was \"useless\" because the chambering mechanism did not work properly and the sight on the front end of the barrel was missing. As a result, defendant's father had previously authorized defendant to sell the gun for \"$5, $10, [or] whatever he could get [for] it.\" Defendant never sold the Marlin, and it was still sitting in the closet after the crime.\n\nAs noted, however, the Remington rifle was missing. Defendant's father testified that the Remington was fully operable, and was stored in the closet loaded, with the safety on, at the time of the crime. A person could ensure the gun was loaded and ready to fire by pulling back on the slide and ejecting a live round from the chamber. A live round was found on the living room floor near the closet after the crime. Defendant's father testified that it had not been there when he left for work that morning. In addition, the casing of a bullet that had been fired from the Remington was found on the kitchen floor near Esta's body.\n\nThe autopsy physician, Dr. Modglin, determined that the bullet had entered Esta's forehead towards one side and broke apart in her brain. Dr. Modglin testified that particularly where, as here, there is no exit wound, the \"stellate\" (irregular and torn) condition of the skin around the point of entry is consistent with the muzzle of the gun having been held directly against the victim when fired. Black granular material found underneath the surface of the skin provided further evidence of a contact wound. Dr. Modglin indicated that while he could not conclusively determine whether Esta was shot at point-blank range, \"none of the features suggesting an intermediate [or distant] wound were present.\"\n\nBased on evidence introduced against defendant in a separate trial involving a shooting that occurred in San Diego two days after the capital crime, a stipulation to the following facts was entered and read to the jury in this proceeding: defendant drove the Lincoln Continental from Riverside to San Diego on September 8, 1986, and was arrested in San Diego on September 10. At the time of his arrest, defendant was in the possession of the car and his mother's cane. Arresting officers searched the trunk of the car and found a wheelchair and the Remington rifle. Defendant took the Remington when he left his parents' house on September 8, and was familiar with its operation, including the safety feature.\n\nB. Defense Case\n\n1. Defendant's testimony. Defendant testified in detail concerning the events of September 8, 1986. For the most part, defendant's account was consistent with his father's concerning the circumstances under which the pair met for work and argued outside the Hi Ho Tavern. Defendant offered some additional details, however, such as his father refusing a request to buy a new cane and shoes for defendant that morning. Defendant also told his father, \"I'm sick of being your nigger\" and \"It will be the last time.\" These statements were intended to express defendant's dissatisfaction over having been \"fired\" on a \"whim.\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAfter his father left for work, defendant drank a beer and then bicycled to his parents' house. He claimed to have visited the house \"two or three times a week\" over the preceding two-year period, and that the only unusual thing about this trip was his plan to retrieve the Marlin rifle that his father had previously given him. Defendant explained, \"I needed to get some cash to get some shoes and a cane so I can get around [and] make some money. So I remembered the gun that my dad had given me, and I figured I would just go up there and get it and take it and sell it.\" Defendant purportedly knocked on the sliding glass door, identified himself, and heard his mother say, \"Well, come in.\"\n\nDefendant testified that once inside, he chatted with his mother who was seated on a stool in the kitchen; she mentioned that defendant's father had left for work, and defendant announced his plan to sell the gun. Defendant demonstrated for the jury what happened next: he walked to the living room closet, lifted the gun by the trigger with his left (and nondominant) hand, pointed the barrel of the weapon towards the ceiling, and walked back towards the sliding glass door while holding onto the wall for balance with his right hand. Suddenly, just as he approached the kitchen, he felt a painful \"jolt\" in his leg. \"I went to grab a - I think the table or the chair to steady myself, while I got my other foot in position, and that's when the gun went off.\" Defendant claimed to have been standing from five to six feet away from his mother at the time.\n\nWhen defendant realized his mother \"had a bullet in her head,\" he became shocked and scared. \"[M]y old man was the first thing that came to mind, and he would start raving and ranting and start throwing all kinds of accusations around. And I figured this shit ain't never gonna stop. So I told myself, just leave.\" He then took his mother's cane, the rifle, the car keys, and the car. Defendant claimed the wheelchair was already inside the trunk of the car when he drove away. Defendant testified that he did not realize he had taken the Remington instead of the Marlin until he was arrested in San Diego two days later. Also, defendant reportedly knew where the car keys were located because he had \"used that car probably 30 or 40 times over the last two years on Sundays, taking [his] mom grocery shopping.\" He denied any intent to kill his mother.\n\nOn cross-examination, defendant claimed other witnesses had \"lied\" when they testified that he was banned from the house when his father was gone. Defendant insisted he had been alone with his mother \"many times,\" that she invited him inside \"every time\" he knocked on the door, and that she had never expressed fear of him or had any reason to do so. He last drove his mother to the store several months before her death. Defendant testified that other than disagreements with his father about work, there was no \"problem\" in his relationship with either parent for at least a year before his mother's death. When asked about the ceramic object found broken near the kitchen, defendant rejected any suggestion that it was thrown by his mother or otherwise used against him in self-defense.\n\nDefendant acknowledged on further questioning of the prosecutor that he possessed only $5 to $10 that morning and could not afford to replace his damaged cane and shoes. He knew his mother had a cane and that his father would be gone from the house all day. Defendant claimed he had never tried to sell the Marlin rifle before the crime, even though his father had given it to him for that purpose one or two years earlier. Defendant knew the Marlin was \"not 100 percent functional.\" He also knew how to operate both the Marlin and Remington, and readily distinguished between the two guns in open court based upon the Marlin's missing front barrel sight. Defendant acknowledged that the barrel, not the butt, of the gun was closest to him when he bent over and lifted it from the closet. He did not know whether the gun was loaded at the time, and he denied racking the weapon to determine that fact.\n\nWith respect to his criminal record, defendant admitted having been convicted of \"three felonies involving theft.\"\n\n2. Expert testimony. The defense called two experts in an effort to support defendant's claim that he inadvertently shot his mother while standing several feet away. Criminalist Fox described an experiment whereby he fired the Millwees' Remington rifle into white terrycloth towels that had been mounted on pieces of cardboard. The purpose of the experiment was to analyze residue deposited on the towels at various firing distances. Fox studied the surface of the cloth, while a forensic pathologist hired by the defense, Dr. Root, examined fibers inside the bullet holes.\n\nCriminalist Fox reviewed Esta's autopsy photographs and saw no \"black circular powdering\" consistent with a contact or near-contact wound, and no \"stippling\" or imbedded powder consistent with a wound inflicted only a few inches away. Although Fox could not determine the distance at which the fatal shot was fired based solely on surface conditions, he implied that a close or contact shot was unlikely since his test-firings indicated that the Remington tended to leave marks in such cases. Fox acknowledged, however, that Remington rifles typically eject spent casings to the rear of the gun, and that such an ejection pattern was inconsistent with where defendant claimed to be standing when the gun fired and where the casing was actually found. However, in Fox's view, the discrepancy could be attributed to a deflector shield that had been installed on the Millwee rifle, causing the shell to sometimes eject in a forward direction. Fox also described the circumstances under which a firearm could accidentally discharge, including a scenario in which the weight of the gun shifts while the weapon is being held by the trigger. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe other defense expert, Dr. Root, agreed with Fox that identifying a contact wound could not be based solely on the presence or absence of topical discoloration. For example, where a contact wound is of the \"loose\" or \"soft\" variety, such that the muzzle is held no more than a quarter inch from the victim when fired, Dr. Root would expect to find some surface discoloration from ignited gunpowder, unburned residue, and soot. However, with respect to contact wounds in which the muzzle of the gun is held tightly against the skin, virtually all of the combustible material and gas produced by firing the weapon enters the body. Dr. Root would not expect to see a dark ring or other mark around the outside of a \"tight\" contact wound, but would expect to see residue inside such a wound, along with an irregular tearing of skin caused when gas is trapped and expands under the skin. Dr. Root acknowledged that all such features were present in this case. However, he did not believe a small caliber gun like the Remington would cause the tearing that occurred here, even if pressed tightly against the skin. The irregular shape of the wound might have occurred when the bullet entered at a sharp angle and broke apart in the skull.\n\nDr. Root further testified that before working on this case, and based on 25 years of experience, he subscribed to the \"classic\" theory that gunpowder residue will not be deposited inside a wound inflicted by a small caliber firearm from more than 24 to 27 inches away. However, after examining the towels provided by Criminalist Fox, Dr. Root was surprised to find residue even where the Millwee rifle had been fired from a distance of 10 feet. He theorized that the particles were carried on the nose of the bullet and were not deposited by the blast. Based on this observation and the relatively modest amount of residue found inside the wound, Dr. Root opined at the close of direct examination that Esta was shot at a distance greater than the maximum 27-inch distance at which gunpowder typically travels by itself, independent of the bullet. Dr. Root conceded on cross-examination that \"99 percent\" of the forensic community would probably disagree with this conclusion. Dr. Root also observed that Esta Millwee could have lived anywhere from several minutes to several hours after the shooting and that extensive blood loss, particularly before death, could have washed at least some of the foreign particles from the wound.\n\nC. Prosecution Rebuttal\n\nCertain witnesses who had testified in the prosecution's case-in-chief were called to rebut defendant's testimony that he regularly visited the house when his father was absent, that his mother invited him inside each time (such as on the day she died), and that he routinely drove her to the store. For example, defendant's father and sister-in-law, Debra, testified that defendant never drove his mother to the store and was not welcome in the house when she was there alone. Defendant's father explained that \"problems\" with defendant visiting the house began when the father was hospitalized in 1973, and that the policy of supervised visits with his wife had been in effect since at least 1981, the year Esta suffered an aneurysm.\n\nThe same witnesses also indicated - contrary to what defendant had stated and implied at trial - that his mother had compelling reasons for not wanting to be alone with him. Hence, defendant's father testified that Esta consistently said she \"didn't trust [defendant] and she was afraid of him, and she was tired of having our possessions stolen.\" Since 1981, and especially in the last two years of her life, Esta expressed concern that defendant might \"do harm\" to one or both parents. Debra Millwee similarly testified that Esta said she did not want defendant in the house because he would \"get mad,\" \"take things,\" and \"start fights.\"\n\nA third witness who testified along the same lines was Jeannie Callen, who had known Esta for over 30 years and was her former sister-in-law. Jeannie recounted a conversation that occurred eight or nine months before the shooting, while Jeannie was styling Esta's hair. Esta reportedly said she did not want defendant in the house because she was \"frightened\" of him and he \"stole - took stuff all the time for years.\" Esta also disclosed that she carried a knife in the pocket of her apron. On cross-examination, the defense elicited that Jeannie never saw the knife, and that Esta simply \"patted her apron\" and said, \"I have a knife right here.\"\n\nOther evidence tended to undermine defendant's testimony that he went to the house the day of the capital crime in order to sell the Marlin rifle for the first time. Specifically, defendant's father testified that when he first offered defendant the Marlin two years earlier, defendant took the gun with the intention of selling it, but then brought it back.\n\nFinally, the prosecution sought to cast doubt on defendant's version of events in this trial by showing he had used a similar story to explain the shooting that occurred in San Diego two days after he shot his mother. Excerpts from the transcript of defendant's testimony in San Diego were read to the capital jury, as follows: Defendant and another man, Whalen, were talking in a parking lot alongside the Lincoln Continental. Defendant took a rifle from the trunk of the car and offered to sell it in order to buy food and \"booze.\" Defendant was holding the weapon in his left hand near the trigger, pointing it away from Whalen, when he was startled by the sound of a woman's voice. As he turned to look, the gun \"went off\" and wounded Whalen. Shocked and surprised, defendant drove away. He did not know the gun was loaded, and he did not \"use\" it between the time he took it from the closet in his parents' house and the time he shot Whalen in San Diego. The instant jury learned by stipulation that Whalen \"recovered\" from the shooting.\n\nD. Defense Rebuttal\n\nIn an apparent effort to show that defendant's relationship with his mother was not strained, a close friend of Esta's, Ina Mae Smith, testified that she saw defendant and his mother talking on the couch during a visit to the Millwee home no more than two months before the shooting. However, consistent with prosecution evidence concerning the family's policy of supervised visits, Smith acknowledged that defendant's father was home at the time.\n\nII. PENALTY PHASE FACTS\n\nAs noted earlier, the penalty phase began in front of the same jury that had decided guilt, but ended prematurely in mistrial. A new penalty jury was impaneled and ultimately returned a death verdict.\n\nA. Prosecution Case\n\nTo ensure the jury understood the circumstances of the capital crime, the prosecution introduced at the penalty retrial much of the same evidence that had been presented at the guilt phase. (§ 190.3, factor (a).) The penalty jury also learned that defendant had suffered a robbery conviction in 1977, and separate felony theft convictions in 1984 and 1986. (Id., factor (c).) Testimony about five other criminal acts involving violence or the threat of violence was also introduced, as described in the paragraphs that follow. (Id., factor (b).)\n\n1. The San Diego crimes. Two days after the capital crime, on September 10, 1986, defendant and an older gray-haired man, apparently a transient, were arguing alongside the Lincoln Continental near the beach in San Diego. Two bystanders saw blood running from a cut in the older man's arm, and one of them saw defendant holding a knife.\n\nAfter the older man hurried away, a young \"surfer\" named Whalen was seen talking with defendant while he was still holding the bloody knife. Defendant, who seemed agitated, opened the trunk of the car, placed the knife inside, and pulled out a rifle. He pointed and then fired the gun at Whalen, who may not have seen it because of where he was standing in relation to the car. Whalen fell to the ground, clutching his stomach. Defendant returned the rifle to the trunk, looked around, and drove away.\n\nA short distance from the scene, defendant rear-ended a vehicle that was stopped at an intersection. He hurriedly made a U-turn, striking the curb and almost hitting a flower stand in the process. However, defendant soon pulled over because of a flat tire. Police officers found him sitting on a front stoop near the disabled car, with his mother's cane nearby. He was arrested without further incident. The Remington rifle and bloody knife were among the items found in the car. On cross-examination by the defense, one of the arresting officers testified that defendant may have been under the influence of alcohol.\n\nA streamlined version of defendant's testimony in the San Diego trial was read at the penalty phase to the effect that defendant denied arguing with Whalen or shooting him on purpose, and that he was simply showing Whalen the gun while discussing whether to \"hock\" it.\n\n2. The assault at the lake. David Vega lived next door to defendant's parents in Riverside. About two months before the capital crime, Vega went to Lake Perris with defendant and defendant's brother, Michael. While everyone relaxed and drank alcohol in the picnic area, Vega accidentally spilled his drink on defendant, who was seated nearby. Defendant picked up a piece of firewood and, \"from out of the blue,\" hit Vega in the head, almost knocking him unconscious. Vega staggered and tried to move away, but defendant approached him and asked, \"Where's my hammer?\" Before defendant found the hammer, which was in a box with the firewood, Vega persuaded Michael to drive him home. However, defendant would not relinquish control of a portable stereo, which belonged to Vega. Defendant taunted Vega by saying, \"Come and get it, asshole.\"\n\n3. The assault in the park. In another incident that occurred about two months before the capital crime, defendant and another transient were in a park near the Hi Ho Tavern throwing a knife at a tree for fun. It was around noon, and several adults and children were nearby. At one point, a young man approached and asked various people, including defendant, about a lost cat. Defendant responded angrily by saying he had not seen the \"fucking\" cat, and thrust the knife in the man's direction. When the young man hurried away, defendant and his companion followed for several yards, while defendant still held the knife. Defendant and his companion then left the park and entered the Hi Ho bar, where they were soon approached by the police.\n\n4. The scuffle in jail. In August 1982, when defendant was in the San Bernardino County jail, he ignored the request of Deputy Palacios to stop talking and keep moving while being escorted with other inmates from the showers to the cells. When Palacios grabbed defendant's arm, defendant swung with his crutch, hitting Palacios in the upper body and knocking the keys from his hand. They struggled until another deputy helped Palacios subdue defendant.\n\n5. The fight in traffic. Dennis Marich, a parolee, testified about a violent \"run in\" he had with defendant in March 1981, in a dispute over money. Marich was driving his car when defendant approached on his bicycle. Marich got out of the car and the pair apparently started to fight. Although Marich never saw a knife, he was cut or stabbed in the upper arm. Marich grabbed a rifle from his car and fired at defendant as he either ran or rode away. Defendant apparently suffered no injury, and Marich admitted being \"under the influence\" of an unidentified substance at the time.\n\nB. Defense Case\n\nSubstantial background evidence was offered in mitigation, primarily through defendant's father. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e It appears defendant was raised in a relatively comfortable and stable home. Defendant's father was employed in the construction industry throughout his long marriage to Esta. The couple had four sons. Defendant - the oldest and \"brightest\" child - was born in 1952. He had many friends in school, and played guitar in a makeshift band. The family often vacationed at Big Bear Lake where defendant's father built a cabin.\n\nDefendant became rambunctious at age 16, after learning to drive and getting a car. (The parents apparently bought a car for each son at this age.) Defendant began associating with the \"wrong\" crowd and dropped out of high school. On cross-examination, defendant's father recalled several instances in which defendant was arrested as a teenager for failing to appear in court for traffic citations.\n\nAlthough all four sons helped their father at work, defendant initially showed particular talent and drive. He qualified as a journeyman carpenter and became a member of the union at the unusually early age of 17. He worked hard for his father and, apparently, for other contractors as well.\n\nDefendant married at age 18. Defendant's father indicated at trial that defendant and his wife, Nell, were reasonably close to the rest of the Millwee family during the early years of the marriage. The couple had three children - two girls and a boy.\n\nDefendant's life took a dramatic turn for the worse in his early 20's, during a time in which the family was experiencing other problems. For example, in 1973 and 1974, defendant's father underwent several back surgeries and was medicated and housebound as a result. Defendant apparently took advantage of his father's weakened state by stealing from his parents. The extent of the problem was revealed on cross-examination, when defendant's father testified that defendant had forged 60 or 70 checks on his parents' bank account. Around the same time, defendant's brother Brad was killed in a motorcycle accident.\n\nIn 1975, defendant's parents learned that defendant was involved with drugs. Prior to this time, they knew of only one instance in which defendant drank too much liquor as part of a youthful prank.\n\nAlthough defendant's parents were admittedly naive about drug abuse, they tried discussing it with defendant. He denied any problem. At one point, they succeeded in admitting him into a \"detox\" center. However, defendant stayed only one week, and it was not clear he successfully completed the program. In any event, defendant quickly resumed his drug habit. On cross-examination, defendant's father blamed defendant for introducing his impressionable brother Michael to drugs.\n\nIn 1977, defendant and Michael were convicted of committing a robbery together. Defendant was also responsible for a string of burglaries. Defendant was imprisoned for the next few years, and had little contact with his parents. Esta was afraid and ashamed of him. However, his father \"never stopped giving him a chance.\"\n\nWhen defendant was released from prison in 1980, he visited his wife Nell in Iowa, where she had since moved with their children. However, any hope of reconciliation soon died, and the couple divorced.\n\nIn the years between his divorce and the capital crime, defendant lived as a transient near his parents. Defendant's father hired defendant primarily to ensure he was not penniless. Defendant was a \"good helper\" who caused no problem on the job.\n\nDefendant's father acknowledged on cross-examination, however, that defendant continued to cause problems for the family during this period. On one occasion, defendant arrived on his parents' doorstep with a belt wrapped around his fist and punched his father in the face when he opened the front door. (Defendant's father returned the punch.) In another incident, defendant broke into the home of his brother and sister-in-law, Ronald and Debra. Not knowing it was defendant, Ronald shot the intruder and caused the hip injury about which defendant had complained at the guilt phase. These incidents occurred in late 1981 and early 1982, when Esta was hospitalized with a brain aneurysm and the family was under considerable strain.\n\nDefendant's father equivocated on the appropriate punishment in the present case. He was willing to defer \"to the Judge and jury,\" but he did not necessarily believe that death was warranted.\n\nDefendant's ex-wife Nell made a more direct plea for mercy. She testified that she had traveled from Alaska to help prevent defendant's execution. Nell explained that all three of defendant's children, now teenagers, were exceptional students and that the oldest child was attending college on a scholarship. Photographs of the children were introduced, and the jury learned that the youngest child was present in court. On cross-examination, Nell admitted that she had not seen defendant since his trip to Iowa 10 years earlier and that they had talked on the phone only 5 times since then. Defendant had not contacted or helped support his children during this time.\n\nThe defense presented Dr. LeRoy, an orthopedist, to examine X-rays taken of defendant near the time of trial and in prior years. Dr. LeRoy testified that the gunshot wound had fractured defendant's right hip and impaired normal motion between the femoral head and hip socket. Bullet fragments were still present at the fracture site, and there were signs of related degeneration in the cartilage and joint. While the chance of further deterioration was slight, defendant's condition would not improve if left untreated. Treatment options included total replacement of the hip with an artificial device, or hip fusion surgery in which the joint is obliterated to stimulate natural attachment of the femur and pelvis. Defendant's condition could be painful under circumstances not described by Dr. LeRoy.\n\nIII. GUILT PHASE ISSUES \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nA. Motion to Set Aside the Information\n\nDefendant argues that the trial court erred in denying his pretrial motion to set aside the information under section 995. The motion was made by Mario Valenzuela, who was appointed as lead counsel for the defense in superior court after the municipal court found probable cause to bind defendant over for trial. One of the claims raised in the section 995 motion and repeated on appeal is that appointed counsel in the municipal court - Frank Peasley - rendered ineffective assistance at the preliminary hearing. Defendant generally avers here, as below, that Peasley was inadequately prepared. Defendant specifically claims that Peasley failed to adequately cross-examine defendant's relatives and call additional family members in an effort to discover unspecified but \"possibly mitigating information\" for use at the guilt and/or penalty phases.\n\nAt the hearing on the section 995 motion, defendant introduced the testimony of Patrick McNeal, a criminal defense attorney who had reviewed the record of the preliminary hearing and obtained a general case history from trial counsel, Valenzuela. The record of the preliminary hearing revealed that while only non-capital murder and theft charges were filed in municipal court, the prosecutor told Peasley before the preliminary hearing that special circumstance charges would probably be filed if defendant was held to answer in superior court. At the preliminary hearing, the prosecutor called police officers from Riverside and San Diego to describe the investigation, and elicited testimony from defendant's father and sister-in-law concerning the crime scene and defendant's activities the day of the crime. With the exception of two police officers, Peasley cross-examined all prosecution witnesses. No defense witnesses were called.\n\nBased on these facts, and upon information that the Millwee family was \"hostile\" to the defense, McNeal opined that Peasley was ineffective insofar as he limited his examination of witnesses, particularly defendant's father, to events occurring the day of the crime. McNeal testified, for example, that he would have obtained a \"family history\" from the father and elicited information about defendant's \"behavior\" in the days preceding the crime. McNeal opined that since Peasley knew capital charges might be filed and that there might be no other opportunity to question the family before trial, failure to use the preliminary hearing as a broad discovery tool reflected a general lack of preparation, investigation, and tactical foresight on Peasley's part. McNeal conceded, however, that he had no personal knowledge of the investigation conducted by Peasley, and was not aware of particular facts or tactical concerns arising out of Peasley's interviews with defendant. McNeal further acknowledged that thorough cross-examination was \"often\" tactically ill-advised at the preliminary hearing, and that it would be \"speculative\" to conclude that a different outcome would have occurred at any stage if Peasley had performed in the suggested manner. No other testimony was introduced at the hearing or considered by the court in denying the motion. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn general, irregularities in pretrial commitment proceedings require reversal on appeal only where the defendant shows he was \"deprived of a fair trial or otherwise suffered prejudice\" as a result. (People v. Pompa-Ortiz (1980) 27 Cal.3d 519, 529.) Where the case involves an ineffective assistance claim of the sort at issue here, no prejudice typically appears unless counsel's pretrial performance resulted in the loss of material evidence and caused tangible harm to the defense at trial. (See People v. Coleman (1988) 46 Cal.3d 749, 771-773 [preliminary hearing counsel's failure to contest prosecution's scientific evidence and conduct independent forensic investigation did not impair defense of rape-murder charge at trial, including introduction of expert medical testimony]; People v. Aston (1985) 39 Cal.3d 481, 494-495 [unavailability of witness at preliminary hearing was \"cured\" when witness later testified for defendant at suppression hearing and was available at trial].)\n\nNo such showing has been made here. Defendant and his father, along with several friends and relatives, testified at the guilt phase concerning the facts surrounding the capital crimes. The jury learned about defendant's mood and behavior shortly before he shot his mother, his long-term relationship with his mother and other family members, and the transient conditions under which he lived. In addition, defendant's father served as the main witness for the defense in describing defendant's personal history and attempting to generate sympathy with jurors at the penalty phase. Defendant identifies no exculpatory or mitigating evidence overlooked at any phase of the proceedings, nor does he demonstrate that counsel's performance at the preliminary hearing \"affected the ability of trial counsel to advocate defendant's case at trial.\" (People v. Coleman, supra, 46 Cal.3d 749, 773.) We therefore reject defendant's claim of reversible error based on counsel's performance at the preliminary hearing and on denial of the pretrial motion to dismiss the case.\n\nB. Motion to Recuse the District Attorney\n\nBefore trial, defendant moved to recuse Daniel Lough, the deputy district attorney in Riverside who conducted the preliminary hearing and prosecuted defendant through trial and entry of judgment in this case. Lough allegedly harbored a strong dislike for defendant that began several years earlier when a felony conviction Lough had helped obtain against defendant in San Bernardino (where Lough then worked) was reversed on appeal. Defendant claimed in the recusal motion that prosecutorial bias could be inferred from the fact that special circumstances were not alleged in this case until after Lough became involved, and that defendant purportedly overheard Lough state at the preliminary hearing that there was insufficient evidence to support such allegations.\n\nBoth Lough and defendant testified at the recusal hearing, as discussed further below. After listening to argument by defense counsel and by the Attorney General appearing on the People's behalf, the trial court denied the motion. The court found nothing in Lough's professional contact and familiarity with defendant, including the San Bernardino case, that could or did cause disdain or resentment as alleged by defendant. As best the court could discern before trial, there was sufficient evidence to support the filing of felony-murder special circumstance allegations, and the decision to seek the death penalty appeared reasonable under the circumstances. The court found no evidence that Lough personally believed the contrary was true, or that his conduct as a prosecutor was motivated by a \"secret grudge\" against defendant.\n\nIn challenging the ruling on appeal, defendant basically repeats the claim of bias made below and alleges the same supporting facts. He insists Lough \"expressed\" animosity towards defendant when testifying at the recusal hearing. Defendant also theorizes that the San Bernardino case not only contributed to such animosity, but that Lough had \"gone out of his way to keep track\" of that case even after his participation had ended.\n\nSince its enactment in 1980, section 1424 has governed motions to disqualify the prosecuting attorney. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e First, a conflict of interest must be shown, that is, there must be a \" `reasonable possibility that the DA's office may not exercise its discretionary function in an evenhanded manner.' \" (People v. Eubanks (1996) 14 Cal.4th 580, 594, quoting People v. Conner (1983) 34 Cal.3d 141, 148.) Second, the conflict must be \" `so grave as to render it unlikely that defendant will receive fair treatment.' \" (Eubanks, supra, 14 Cal.4th at p. 594, quoting Conner, supra, 34 Cal.3d at p. 148.) In other words, \"whether the [alleged] conflict is characterized as actual or only apparent,\" recusal is not required under section 1424 unless the potential for prejudice is \"real,\" and rises \"to the level of a likelihood of unfairness.\" (Eubanks, supra, 14 Cal.4th at p. 592, italics omitted.)\n\nConsistent with these principles, a disabling conflict does not exist simply because the district attorney and the defendant have been adversaries in other legal proceedings, even where the defendant previously prevailed. Other evidence of overriding bias must be present to warrant disqualification. (E.g., People v. Turner (1994) 8 Cal.4th 137, 162-163 [recusal was properly denied absent evidence that the prosecutor who had committed reversible error at defendant's first trial would commit misconduct on retrial]; People v. Hamilton (1989) 48 Cal.3d 1142, 1155-1156 [defense counsel's complaint to the State Bar about the prosecutor's ex parte contacts with defendant did not compel recusal absent evidence of actual antagonism towards the defense].)\n\nContrary to what defendant claims, the trial court was aware of section 1424 and controlling case law, and applied these principles to evidence adduced at the hearing. Ample evidence supports the court's findings.\n\nFor example, Lough testified that there was nothing unusual or upsetting about the outcome of the San Bernardino case. He handled pretrial proceedings in that case, and another district attorney tried defendant and obtained a conviction. Lough explained that even though the conviction was reversed in part because of the prosecution's use of defendant's prior convictions under Proposition 8, the law was in a \"state of flux\" at the time, the Court of Appeal's opinion was \"well-reasoned,\" and occasional reversals are a \"fact of life.\" Lough was not concerned about defendant escaping liability or punishment, since Lough knew that defendant had served most of his sentence before the judgment was reversed and he ultimately pled guilty on retrial. Consistent with the trial court's findings, Lough adamantly denied any \"personal animosity\" towards defendant as a result of their prior legal encounter or for any other reason.\n\nThe record also reveals no improper tactics in the instant case. Lough testified that the decision to charge special circumstances and seek the death penalty was made by a team of attorneys in the office, including him. They relied on various factors commonly found in capital cases, such as defendant's long criminal history and armed robbery conviction, the brutality involved in taking his mother's life, and the violent crimes he committed in San Diego shortly after the capital crime. Lough recalled that at the preliminary hearing, he told defense counsel, Peasley, that special circumstance allegations would probably be added to the case even though they might be \"difficult\" to prove. Contrary to defendant's version of events, which the trial court explicitly declined to credit, Lough denied saying or believing that the evidence against defendant was insufficient to support felony-murder findings. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn sum, defendant presented no evidence that District Attorney Lough had formed strong negative feelings towards defendant for any reason. Based on the trial court's decision crediting Lough's testimony concerning statements made at the preliminary hearing, and based on Lough's testimony about how and why the charging decision was made, there was substantial evidence from which the court could infer that special circumstance allegations and the quest for a death sentence were brought pursuant to an impartial and legitimate exercise of prosecutorial discretion. There was no evidence this case would not have been capitally charged or would otherwise have been prosecuted differently if either a different district attorney or a different defendant were involved. The court did not abuse its discretion in denying the motion to disqualify the prosecutor.\n\nC. Defendant's Racial Slur\n\nBefore trial, defendant moved to prevent the prosecution from introducing evidence of the racial epithet he used while arguing with his father the morning of the crime, \"I'm sick of being your nigger.\" The defense claimed, among other things, that the statement would tend to inflame jurors and produce an unfavorable verdict simply because they perceived defendant as a person of low moral character. Defendant urged the court to exercise its discretion under Evidence Code section 352, and bar the prosecution from introducing this evidence at trial.\n\nIn opposition, the prosecution maintained that the statement was relevant to establishing motive and intent to kill for purposes of the first degree murder charge and the felony-murder special circumstance allegations. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The prosecutor argued that the challenged statement, viewed in context of the entire argument, tended to show that defendant became extremely angry when his father refused to take him to work and to buy a new cane and shoes; that defendant was no longer willing to tolerate the control he believed his father exercised; and that defendant decided to retaliate by stealing needed items from the family home. The prosecutor indicated that he planned to argue at trial that defendant intentionally killed his mother in an effort to facilitate the robbery and burglary and, perhaps, to inflict emotional pain upon his father as well.\n\nThe trial court found that the probative value of the evidence substantially outweighed any prejudicial impact. It therefore denied defendant's motion to bar introduction of the challenged statement in the prosecution's case.\n\nIn his opening brief, defendant contends the court abused its discretion and violated his due process rights in light of the arguments and concerns he raised at trial. However, we agree with the Attorney General's suggestion that no cognizable claim is raised. Both defendant and his father testified that they argued over defendant's suitability to work the morning of the crime, and that defendant said this was the \"last\" time he would endure such treatment. But it was defendant, and only defendant, who testified that he used the word \"nigger\" during the exchange.\n\nJust as review cannot occur in the absence of an actual evidentiary ruling (People v. Samayoa (1997) 15 Cal.4th 795, 827; People v. McPeters (1992) 2 Cal.4th 1148, 1179), a claim of error does not arise where no evidence was introduced as the result of a ruling allowing its admission. In other words, the court's exercise of discretion had no effect on defendant's trial. Any unfavorable inferences drawn from defendant's use of a racial slur are attributable solely to his own testimony, and cannot be challenged here.\n\nD. Rebuttal Evidence - Esta's State of Mind\n\nBefore trial, defendant moved to prevent the prosecution from disclosing specific reasons for defendant's strained relationship with his mother and the policy against unsupervised visits in the family home. The challenged evidence consisted of statements Esta had made to defendant's father and sister-in-law that Esta feared and mistrusted defendant because he had provoked fights and stolen from his parents many times before. Defendant also sought to bar similar testimony from Esta's close friend, Jeannie Callen, to the effect that Esta said she carried a knife because she feared defendant.\n\nFollowing extensive argument by the parties, the trial court agreed with defendant that even assuming Esta's statements were not inadmissible under the hearsay rule (see Evid. Code, § 1250), her state of mind had no direct bearing on the prosecution's case, and might impermissibly suggest that defendant was predisposed to committing acts of theft and violence (see id., § 1101, subd. (a)). The court therefore precluded the prosecution from introducing this evidence in its case-in-chief under Evidence Code section 352. The court made clear, however, that its ruling was subject to change depending on the evidence presented by the defense and any rebuttal sought as a result.\n\nConsistent with its theory of first degree murder, the prosecution sought to prove that defendant entered his parents' house knowing he was unwelcome and intending to steal their property. The prosecution abided by the court's pretrial ruling and presented a censored view of defendant's relationship with his mother. Thus, family witnesses disclosed that mother and son generally did not \"get along,\" and that special arrangements were made to ensure he did not visit when she was home alone. Outside the jury's presence, the court reminded the parties that these witnesses could not mention Esta's expressions of fear and mistrust, and warned counsel on both sides when they occasionally risked \"opening the door\" to this evidence on direct or cross-examination.\n\nAs noted, defendant admitted the shooting but denied it was intentional or committed during a robbery or burglary. He testified that he arrived at the house solely to retrieve an item that belonged to him (the Marlin rifle) and that his mother invited him inside (supposedly as a matter of routine). According to defendant, he grabbed the Remington rifle by mistake and accidentally shot his mother because a sudden pain in his leg caused him to stumble and the gun to fire. Defendant admitted taking other property that did not belong to him, but claimed he decided to do so in a state of panic and only after the shooting had occurred.\n\nOver the objection of the defense, the prosecution successfully moved to impeach defendant with the evidence that had previously been disallowed under Evidence Code section 352. The court agreed with the prosecutor that Esta's expressions of fear and mistrust towards defendant had become \"critical\" in light of his testimony concerning the amicable nature of their relationship and his consensual presence inside the house. The prosecution therefore introduced this testimony in its rebuttal case, subject to a special instruction describing the limited purpose for which the evidence was being admitted. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nOn appeal, defendant assumes the jury would necessarily find him guilty of robbery and burglary once it heard that his mother believed he had threatened and stolen from the family before. No witness, he argues, should have been allowed to testify along these lines under Evidence Code section 352. Defendant seems most concerned about Esta's conversation with Jeannie Callen, noting that it occurred several months before the capital crime and painted a \"graphic\" picture of a mother who carried a knife to protect herself from her own son.\n\nNo abuse of discretion occurred. The court could reasonably conclude that the challenged evidence was highly relevant on rebuttal for purposes of assessing defendant's credibility as a witness and his version of events leading up to the killing. Esta's statements that she was afraid of defendant, as evidenced by her possession of a knife, and that she mistrusted him, as evidenced by her accusations of theft, contradicted defendant's express testimony that she was not afraid of him and that there were no \"problems\" in their relationship. Such evidence also tended to refute defendant's testimony that he regularly spent time alone with his mother and that she welcomed him inside when he arrived the morning of the crime. With respect to Jeannie's testimony in particular, the court could find that the fear and mistrust expressed by Esta continued until the time of her death, given the many years over which Esta felt ill-will towards defendant (i.e., since at least 1981).\n\nThe record also does not support defendant's claim of undue prejudice. Although three different witnesses described Esta's fear and mistrust, their testimony was relatively brief and mild. No evidence was introduced concerning the nature or extent of any thefts or violent acts attributed to defendant. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Moreover, the jury was prohibited from using evidence of Esta's state of mind to draw any unfavorable inferences about defendant's character or propensity to commit crimes - a special instruction which defendant does not acknowledge at any point in his briefing on appeal.\n\nDefendant argues for the first time in this court that Jeannie Callen's account of her conversation with Esta lacked sufficient \"indicia of reliability,\" and that admission of this testimony violated defendant's federal constitutional rights, particularly his right to confront and cross-examine witnesses. Defendant's primary complaint seems to be that Jeannie could not be trusted to accurately recall or recount the conversation because it occurred a substantial period of time before the capital crime and trial, and because it concerned an event that was not especially memorable.\n\nDefendant has waived this claim by failing to timely raise it in the trial court. (People v. Champion (1995) 9 Cal.4th 879, 918; People v. Raley (1992) 2 Cal.4th 870, 892.) The claim lacks merit in any event. The confrontation clause is concerned with the reliability of statements made by a declarant who is not present in court or otherwise available for cross-examination. (See People v. Farmer (1989) 47 Cal.3d 888, 905, citing Ohio v. Roberts (1980) 448 U.S. 56, 65-66.) Defendant had ample opportunity to test Jeannie Callen's memory of the \"knife\" conversation at trial, and to cross-examine her about any other factor bearing on the credibility of her account. Defendant offers no specific reason to doubt the truth and accuracy of Esta's out-of-court remarks, and we find no basis on which to doubt their reliability when made. The challenged statements were admitted under the state-of-mind exception to the hearsay rule - a provision which generally satisfies the confrontation concerns raised here. (Evid. Code, § 1250, subd. (a); People v. Morales (1989) 48 Cal.3d 527, 552, and cases cited.) Also, there was virtually no risk of inaccuracy or falsehood in Esta's remarks, since she was describing an emotional state then in existence and would not have disclosed such embarrassing and painful details to her close friend if they were untrue. No constitutional violation occurred.\n\nE. Rebuttal Evidence - San Diego Testimony\n\nAs noted, the gist of defendant's testimony in the capital trial was that he went to his parents' house solely to retrieve the malfunctioning Marlin, that he grabbed the loaded and functioning Remington by mistake, and that the gun misfired and killed Esta as the result of a sudden \"jolt\" in his leg. On cross-examination, defendant was asked whether \"the same gun went off accidentally again and shot a man\" in San Diego two days later. Defendant successfully asserted the privilege against self-incrimination and declined to answer on grounds criminal charges were still pending against him in the San Diego case.\n\nWhile preparing its case-in-rebuttal, the prosecution moved to introduce excerpts from the transcript of defendant's testimony in the San Diego proceeding. The prosecutor explained that defendant's testimony about the San Diego shooting was not being offered \"for the facts\" but - like evidence of Esta's mental state discussed above - solely for impeachment. The prosecutor wanted the jury to know that defendant's versions of the two shootings were suspiciously \"similar\" in some respects and hopelessly \"inconsistent\" in other respects.\n\nDefendant objected primarily on grounds the evidence was irrelevant and unduly prejudicial under Evidence Code section 352. He argued that jurors would assume he was a violent person and guilty of the capital crime if they learned he had been involved in a second shooting two days later. After discussing the matter at length with counsel, the court overruled the objection and decided to admit the proffered evidence for the limited purpose sought by the prosecution. The court found the evidence was substantially more probative than prejudicial insofar as it suggested that defendant offered the same \"pat\" or false excuse for both shootings.\n\nThus, the instant jury heard the explanation defendant gave under oath for the shooting in San Diego, and learned that the victim recovered from his wound. No other evidence from the San Diego trial was introduced. The jury never learned that defendant was convicted of attempted voluntary manslaughter in that case or that the conviction was reversed for instructional error on appeal. The trial court ultimately told the capital jury that defendant's San Diego testimony could not be used for any purpose other than to assess his credibility as a witness in this case - a limiting instruction which defendant overlooks on appeal. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nDefendant now claims a prejudicial abuse of discretion occurred for reasons similar to those raised at trial. We disagree.\n\n\"Subdivision (a) of [Evidence Code] section 1101 prohibits admission of evidence of a person's character, including evidence of character in the form of specific instances of uncharged misconduct, to prove the conduct of that person on a specified occasion.\" (People v. Ewoldt (1994) 7 Cal.4th 380, 393.) Here, defendant implicitly concedes that evidence of the San Diego shooting was not introduced to prove he had a propensity for violence and shot his mother in Riverside two days earlier. He suggests, however, that the evidence was irrelevant and inadmissible for purposes of demonstrating a common design or plan under Evidence Code section 1101, subdivision (b), because the San Diego and capital crimes were too \"spontaneous\" and \"different\" to support such a theory. (See People v. Sam (1969) 71 Cal.2d 194, 205.)\n\nContrary to what defendant seems to claim, the prosecution was not obligated to comply with the requirements for showing a common plan under Evidence Code section 1101, subdivision (b), because the excerpts from defendant's testimony in the San Diego case were not offered or admitted for that purpose. The evidence was instead admitted, with an appropriate limiting instruction, for the far narrower purpose of showing the implausibility and untruthfulness of defendant's testimony in the capital case. (See Evid. Code, § 1101, subd. (c) [nothing in the statute \"affects the admissibility of evidence offered to support or attack the credibility of a witness\"].)\n\nIndeed, defendant's testimony in the San Diego case suggested that he was not a credible witness because of at least one critical discrepancy between the two accounts. While defendant testified in San Diego that he had not fired the gun or known it was loaded prior to the shooting charged in that case, he admitted under oath in the capital case that he shot his mother with the same weapon in Riverside two days earlier. Moreover, defendant sought to avoid responsibility for both shootings by offering the same innocent explanation in each case. He testified in each proceeding that he was thinking about selling the gun, that he was holding it oddly by the trigger, and that a sudden distraction caused the gun to shift and discharge in the direction of an unintended victim. The jury could readily find that defendant's credibility in the present case was diminished by the fact that he offered the same explanation for another shooting that occurred only 48 hours later. In light of the foregoing, the evidence was not subject to exclusion under Evidence Code section 1101.\n\nWe also reject defendant's claim that the evidence should have been excluded under Evidence Code section 352. Because disclosure of uncharged offenses can be highly prejudicial, trial courts should use particular care in performing this weighing analysis. (People v. Ewoldt, supra, 7 Cal.4th 380, 404.) For reasons we have already explained, this principle was not violated here. The trial court could properly conclude that the San Diego transcript was highly probative on the limited credibility issue for which it was offered, that defendant's credibility was a crucial issue at trial, and that the potential for undue prejudice was slight under the circumstances. Aside from brief excerpts from defendant's testimony and the fact that the victim survived, no other evidence about the San Diego shooting or trial was introduced. Also, the nonfatal San Diego incident was less inflammatory than the capital crime, and the jury was expressly told that such evidence had no bearing on defendant's character or Disposition. No abuse of discretion occurred.\n\nF. Sufficiency of the Evidence\n\nDefendant challenges the sufficiency of the evidence in two key respects. First, he claims the special circumstance findings must be set aside because the prosecution did not prove the killing occurred during the course of robbery and burglary as opposed to mere theft. In making this argument, defendant relies heavily on the lack of conclusive evidence as to when the intent to steal arose - before or after he entered the house and shot his mother. Second, defendant contends the first degree murder verdict cannot stand because evidence of premeditation was lacking. The latter claim rests primarily on the apparent lack of extensive planning activity, and the contested nature of evidence concerning the circumstances under which the fatal shot was fired.\n\nContrary to what defendant suggests, the judgment is not subject to reversal on appeal simply because the prosecution relied heavily on circumstantial evidence and because conflicting inferences on matters bearing on guilt could be drawn at trial. Although the jury is required to acquit a criminal defendant if it finds the evidence susceptible of two reasonable interpretations, one of which favors guilt and the other innocence, it is the jury, not the appellate court, which must be convinced of his guilt beyond a reasonable doubt. (People v. Bean (1988) 46 Cal.3d 919, 932-933.) We review the entire record in the light most favorable to the judgment and affirm the convictions as long as a rational trier of fact could have found guilt based on the evidence and inferences reasonably drawn therefrom. (People v. Johnson (1980) 26 Cal.3d 557, 576.) Such is the case here.\n\n1. Robbery/burglary. Ample evidence was presented that defendant entered the house intending to steal his parents' property and that he fatally shot his mother in order to accomplish this goal. (See §§ 211, 459; People v. Green (1980) 27 Cal.3d 1, 59-62.) It was undisputed that, shortly before the crime, defendant became frustrated and angry when his father refused to take him to work and to replace the cane and shoes that had been destroyed in the campfire the night before. Defendant's own vulgar account of the exchange suggested that he resented his father's control, and that this particular dispute was the proverbial \"last straw\" in a long and troubled relationship.\n\nThe jury could reasonably believe that after the argument, defendant headed directly to his parents' house in order to take his mother's cane and, perhaps, other items which he could sell or use, such as the Remington rifle and the car. Defendant admitted having no other means by which to buy needed items or to compensate for money lost by not working with his father. The jury could reject as implausible the suggestion that defendant, an ex-felon, intended to retrieve the Marlin and pedal down the hill on his bike, carrying the rifle in plain view of passersby.\n\nOther evidence tended to belie defendant's claim that he was present in the house simply as part of an innocent and first-time effort to sell the Marlin. Defendant's father testified that defendant had already taken the gun for this purpose two years earlier and returned it, unsold. Defendant denied any prior attempt to sell the gun, but offered no explanation for the delay between the time his father authorized the sale and the time defendant said he first acted on the offer.\n\nThe evidence also suggested that defendant's mother did not invite him into the house as he claimed. Several knowledgeable witnesses testified that Esta had been wary of defendant for several years and that she took special precautions to avoid being alone with him. Thus, the jury had ample reason to doubt the loving mother-son relationship described by defendant at trial, including his suggestion that she gladly welcomed him inside after his father had left for work the morning of the crime.\n\nThe jury could infer that defendant, having already decided to steal at least his mother's cane, was able to enter the house uninvited and, perhaps, undetected, because the sliding glass door was unlocked. The door was presumably left in this condition to make it easier to accommodate the family dog and because Esta had not been warned by her daughter-in-law that defendant was nearby.\n\nDefendant concedes that \"forced entry\" is not an element of the crime of burglary, but argues that the absence of such evidence suggests he lacked criminal intent at the time he entered the house. However, intent to steal sufficient to support the burglary charge could readily be inferred from evidence that defendant had an immediate need for money and a cane, that his father refused such help shortly before the crime, and that there was no other reason for defendant to visit his mother after arguing with his father. Given the apparent ease with which defendant entered the unlocked house, no reasonable juror would be concerned by the lack of exterior damage.\n\nDefendant also claims that absent any \"sign of a struggle,\" there was insufficient evidence that he stole by means of force or fear for purposes of the robbery charge, and that a reasonable juror could only conclude that he decided to take the property after shooting his mother by accident. He points to valuable property remaining in the house as additional support for this impulsive-afterthought theory.\n\nHowever, the jury could infer that Esta's disability not only impaired her ability to defend against a show of force, but that there was little opportunity to resist. A plausible scenario is that Esta was surprised by defendant's presence in the house, and that she threw the ceramic object in anger or fear either as he walked towards the living room closet or returned with the rifle in hand. It appears she was shot before she could move from the stool on which she was seated when confronted by defendant. Since property was taken, and nobody else was present, the jury could infer that defendant killed to prevent Esta from summoning the police or family members who lived next door, or from identifying defendant as the thief.\n\nFinally, as discussed in conjunction with evidence of premeditation below, the jury was not compelled to accept the defense theory, based only on defendant's testimony, that the killing was essentially a freak accident that occurred without criminal intent of any kind. Nor was the jury required to accept defendant's testimony - at odds with other evidence - that he decided to take property only after the shooting occurred.\n\nFor the foregoing reasons, the evidence is sufficient to support the special circumstance findings of murder in the course of robbery and burglary.\n\n2. Premeditation. We also find sufficient evidence that the killing occurred as the result of \"pre-existing reflection,\" rather than accident and mistake as claimed by defendant at trial. (People v. Pride (1992) 3 Cal.4th 195, 247; accord, People v. Mayfield (1997) 14 Cal.4th 668, 767 [premeditated and deliberated conduct involves thoughtful - though not necessarily protracted - consideration beforehand].) Our determination is guided by three factors typically used to assess evidence of premeditation on appeal: motive, planning, and manner of killing. (Pride, supra, 3 Cal.4th at p. 247, citing People v. Perez (1992) 2 Cal.4th 1117, 1125.)\n\nAs noted above, the evidence pointed to robbery as a motive for the murder. The jury could also infer that defendant killed his mother for the additional purpose of inflicting emotional pain upon his father, with whom he had argued earlier that morning.\n\nContrary to what defendant claims on appeal, the absence of protracted and elaborate planning activity is not \"fatal\" to finding sufficient evidence of premeditation in this case. Although he arrived at the house unarmed, defendant had ample opportunity while traveling up the hill and retrieving the gun to consider whether and how to use lethal force in order to remove property from the house.\n\nSeveral facts suggest that defendant prepared the gun for firing and \"at least briefly planned the fatal confrontation\" with his mother. (People v. Pride, supra, 3 Cal.4th 195, 247.) It was undisputed that defendant was familiar with the appearance, use, and condition of both guns. The jury could conclude that he selected the Remington on purpose, not by mistake, knowing it was the only operable weapon. He then evidently racked the rifle to see whether it was loaded before walking away from the living room closet. Nothing otherwise accounts for the live round found on the floor nearby. Defendant also must have deactivated the safety feature - a fact he did not deny at trial.\n\nFinally, the evidence, though not conclusive, indicated that defendant aimed and fired the weapon at his mother's head from close or point-blank range. Experts on both sides found similarities between this case and cases in which the muzzle of the gun is held tightly against the skin, including the irregular shape of the wound and gunshot residue found inside. The jury could reject defendant's claim of accidental discharge as implausible for various reasons, including evidence that he entered the house intending to steal, was familiar with the proper handling of firearms, and used the same odd excuse to justify the shooting that occurred a short time later in San Diego.\n\nWe therefore reject defendant's attack on the sufficiency of the evidence to support a finding of premeditation, including his assertion that \"nothing about the manner of killing suggests advance reflection or thought.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nG. Alleged Prosecutorial Misconduct\n\nDefendant claims the judgment should be reversed because the prosecutor committed misconduct at three different stages of the guilt phase. No impropriety or due process violation occurred.\n\n1. Discovery. We first reject defendant's broad claim that the prosecutor willfully impeded discovery efforts by the defense. Consistent with the Attorney General's version of events, the record does not support the position urged by defendant in his opening brief that the prosecutor repeatedly violated court orders and raised frivolous arguments in an attempt to thwart discovery.\n\nOur review of the record discloses that defendant obtained a comprehensive order granting discovery of enumerated items shortly after his arraignment in superior court. After Valenzuela replaced Peasley as counsel of record, the defense moved several times for a continuance of trial in order to review material already provided by the prosecution, and to permit additional investigation. Contrary to what defendant suggests on appeal, these motions and attached declarations indicate that compliance with court-ordered discovery was ongoing, and that the defense encountered no undue resistance from the prosecution. Indeed, in a declaration filed about one year before jury selection began, Valenzuela noted that discovery was \"almost complete,\" and that his primary complaint was the lack of formal notice of aggravating evidence to be introduced at the penalty phase. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAt other points before trial, the court and counsel discussed the manner in which physical evidence would be provided to the defense for examination and testing, including the murder weapon and photo negatives of the crime scene. The prosecutor did not question defendant's right to examine this evidence, but sought only to ensure that original, irreplaceable items were not lost or destroyed - a reasonable request. As to each of these items, the court arranged for a transmittal and testing procedure that was satisfactory to both parties.\n\nThe record also does not support defendant's claim that the prosecution \"obstruct[ed] the efforts of the defense team to obtain vital information from Millwee family members.\" Discussions between the court and counsel indicate that the prosecutor understood and complied with his duty to provide pretrial copies of investigative reports containing statements made by defendant's relatives. To the extent other discovery requests went unfulfilled, they appear to involve information which the court ruled the defense was not entitled to receive (e.g., prosecutorial standards for charging special circumstances). Defendant does not challenge such rulings here.\n\nIn sum, the record discloses only routine negotiations over the permissible range and manner of discovery in a highly nuanced, circumstantial case. Nothing suggests that access to material in the hands of the government was unreasonably delayed or denied, or that the prosecutor refused to cooperate in the process. Significantly, defendant identifies no material information that was suppressed or withheld. (Cf. Brady v. Maryland (1963) 373 U.S. 83.) We therefore reject the claim of prosecutorial misconduct during the pretrial discovery phase.\n\n2. Opening statement. Defendant claims the prosecutor committed misconduct in his opening remarks by providing a \"social history\" of the victim that was irrelevant, unduly sympathetic, and calculated to inflame the passions of the jury. The defense made a timely but unsuccessful objection on similar grounds at trial.\n\nWe reject the claim. The purpose of the opening statement is to inform the jury of the evidence the prosecution intends to present, and the manner in which the evidence and reasonable inferences relate to the prosecution's theory of the case. (People v. Harris (1989) 47 Cal.3d 1047, 1080.) Nothing prevents the statement from being presented in a story-like manner that holds the attention of lay jurors and ties the facts and governing law together in an understandable way. Although it is generally improper to ask jurors at the guilt phase to step into the victim's shoes and imagine his or her suffering (People v. Stansbury (1993) 4 Cal.4th 1017, 1057), the prosecutor is not prohibited from identifying traits that made the victim particularly vulnerable to attack where such facts bear on the charged crimes and are not otherwise inadmissible on their face. (See People v. Wrest (1992) 3 Cal.4th 1088, 1108.)\n\nThe prosecutor did not violate these principles here. The challenged remarks concerned the nature and cause of Esta's physical disability (aneurysm resulting in partial paralysis), the extent to which she had recovered and could move around (with a cane always kept within reach), and her limited ability to grasp objects (only with the left hand). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e These remarks placed Esta's possession of a cane and wheelchair in context for purposes of the robbery charge, and tended to show that at least one of the stolen items - the cane - was within her immediate presence when the shooting occurred. The same information also helped explain why Esta wanted to avoid being alone with defendant, with whom she did not get along. A reasonable inference is that she felt vulnerable and unsafe around defendant, that she would not have asked or allowed him inside the house, and that he therefore had no legitimate reason for being there, a fact significant to the burglary charge.\n\nThus, the description of Esta given in the opening statement was not an untethered and inflammatory plea for sympathy, but had some logical bearing on the prosecution's theory of murder during the course of robbery and burglary. It also accurately forecast evidence admitted without objection from the defense in the prosecution's case-in-chief. Although the challenged remarks implied that Esta was strong willed to the extent her medical recovery exceeded reasonable expectations, the prosecutor is not required to shield the jury from all favorable inferences about the victim's life or to describe relevant events in artificially drab or clinical terms. No misconduct occurred.\n\nDefendant also faults the prosecution for referring to the killing as an \"execution.\" The claim is waived for failure to object at trial. (People v. Gionis (1995) 9 Cal.4th 1196, 1215.) No misconduct occurred in any event. Here, as in other cases, the challenged term simply served as a shorthand means of describing an intentional and premeditated murder. (People v. Edwards (1991) 54 Cal.3d 787, 840; People v. Ramos (1982) 30 Cal.3d 553, 574-575.) The evidence, instructions, and argument permitted conviction of first degree murder under such a theory here.\n\n3. Cross-examination of Dr. Root. As noted, the defense called two experts in an effort to refute the prosecution's claim that defendant intentionally killed his mother by shooting her in the head at close or point-blank range. Criminalist Fox implied that Esta's wound was inflicted from a distance based on the absence of surface markings on her skin, while Dr. Root reached the same Conclusion notwithstanding the presence of gunshot residue inside the wound. Both witnesses testified that they formed their opinions after examining the terrycloth towels into which Fox had fired the Remington rifle. On cross-examination, each witness revealed that he had never used this technique before. Dr. Root also indicated that other experts would probably not find a distance wound in this case using more traditional methods and principles.\n\nUpon further questioning of the prosecutor, Dr. Root indicated that he had no personal knowledge of the manner in which the towel test was performed and that he relied solely on information provided by Criminalist Fox. Dr. Root also testified that his knowledge of Fox's background and qualifications was limited to information provided by Fox himself. The prosecutor then asked, \"Were you aware that Mr. Fox resigned from the California Association of Criminalists, pending - while he had an incompetence investigation pending?\"\n\nThe defense objected on unspecified grounds before an answer was given. A sidebar conference was called. However, the court realized moments later that it was time for a \"midmorning break,\" and excused the jury from the courtroom as a result.\n\nThe prosecutor proceeded to deny any wrongdoing. He insisted the controversial question was based on \"accurate\" information, and that it was relevant to assessing the reliability of Dr. Root because he had based his findings upon, and therefore implicitly vouched for, the \"integrity\" of Fox.\n\nThe court disagreed and sustained the objection. Consistent with arguments raised by the defense, the court observed that the issue could have been raised earlier during cross-examination of Fox, that the prosecution was assuming facts not in evidence by raising the issue with Dr. Root, and that Dr. Root could not be expected to know about Fox's disciplinary record. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The court seemed primarily concerned that the prosecutor was not exploring the basis of Dr. Root's opinion in good faith, but was attempting to raise damaging insinuations about Fox's character which could not be refuted by Fox (because he had already testified) or by Dr. Root (because he had no knowledge on the subject).\n\nThe court made clear, however, that the offending question was, at most, a \"cheap shot\" that could not have damaged the defense in light of the relatively limited and straightforward role Fox played in the case. Defense counsel did not dispute this characterization, but asked for a curative admonition in any event. The court granted the request. Hence, as soon as the jury returned from recess, the court announced that defense counsel's objection had been sustained, that the unanswered question had no evidentiary value, and that any inference raised by the question should be disregarded. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Cross-examination of Dr. Root resumed on a subject unrelated to Criminalist Fox or his background.\n\nDefendant argues that the prosecutor committed misconduct for the reasons cited by the trial court in sustaining the objection below. We need not decide the issue, however, because the incident clearly could not have been prejudicial under the circumstances. Specifically, the court intervened as soon as an objection was made. The court also admonished the jury in terms favorable to the defense at the first available opportunity - a fact not mentioned at any point in defendant's briefing on appeal. The admonition did not repeat the content of the question found objectionable by the defense, and it made clear that the incident had no bearing on the guilt determination. We can only assume that the jury followed this instruction, and that any conceivable harm was prevented as a result. (People v. Jones (1997) 15 Cal.4th 119, 168 [prosecutorial misconduct in impugning integrity of opposing counsel could not have been prejudicial since trial court sustained defense objections and instructed jury to disregard the comments].)\n\nH. Motion for New Trial - Juror Jordan\n\nDefendant contends the trial court erred in denying his motion for a new trial on the ground that Ms. Jordan, who sat as a juror at the guilt phase, was mentally incompetent. Although the motion was made after the death verdict was rendered, juror incompetence is one ground on which defendant seeks to set aside the guilt judgment. We therefore discuss the new trial motion alongside other guilt issues raised on appeal. For reasons explained below, we reject the claim.\n\n1. Background. Three weeks after the guilt verdict and one week after the start of the initial penalty trial, Juror Jordan failed to appear in court for the morning session. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e At this point in the proceedings, the prosecution had rested its case-in-chief and the defense was presenting evidence in mitigation.\n\nAfter learning that Juror Jordan could not be reached by phone, the court spoke with two other jurors about her whereabouts. All counsel and defendant were present at the time. Juror Haynes, the foreman at the guilt phase, said that Juror Jordan had been habitually late throughout trial. In other words, she usually arrived after the jury was required to report to the courthouse but before it was brought into the courtroom to hear evidence. Haynes said that Jordan's habit had \"frustrated\" the rest of the jury but had not affected guilt deliberations. Another juror, Ms. Astore, noted that Juror Jordan once said she was late \"on purpose.\"\n\nThe court and counsel then discussed the matter outside the jury's presence. Defense counsel observed that since the court and counsel were always late in bringing the jury into the courtroom, counsel had never noticed that Jordan was late \"with them outside.\" The court also was unaware of the problem. However, the court recalled that on the last regular day of testimony, Jordan arrived in the courtroom immediately after the other jurors had been seated in the box. When asked how the defense would like to proceed, counsel said that he wished to \"retain\" Juror Jordan, that she was \"valuable\" to the defense, and that he \"object[ed]\" to replacing her with an alternate juror. In light of these remarks and because another juror apparently felt sick that morning, the court declared a recess for two days.\n\nThe court began the next session by speaking with Juror Jordan in the presence of the prosecutor, defendant, and his counsel. Jordan, who appeared upset and near tears, asked to be removed from the jury. She explained that she had failed to appear two days earlier because she had \"confused\" the dates court was in session, and that she \"forgot\" to go to work for the same reason. She agreed with a suggestion by the court that her attendance problems were not wholly outside her control, and that they probably reflected a subconscious desire to avoid her responsibilities as a juror.\n\nJordan blamed her disorganized state on various factors. They included her sister's attempt to evict her from the family home, financial hardship caused by a reduction in work during trial, and a growing sense of identification with defendant on a personal level. On the latter point, Jordan explained that her father - whom she had seen by coincidence in the courthouse that morning - was a \"street person\" like defendant, and that Jordan learned through testimony at the penalty phase that her father and defendant \"lived in the same park.\"\n\nJordan mentioned other problems, but was unclear whether they were a symptom or cause of her \"lack of concentration.\" She indicated that her relationship with other jurors was strained, apparently because of her tardiness, and that she felt \"badgered\" by them in unspecified ways. Jordan also expressed frustration over the length of jury service, saying that she thought \"the penalty . . . was going to be [the court's] decision.\"\n\nThe court then asked when the foregoing problems had started. Jordan responded that they had existed for some time, but that her level of upset had \"eclipsed\" and become uncontrollable only recently, during the penalty phase. Jordan confirmed that she had been \"functioning\" at an acceptable level during the guilt phase and that she \"stand[s] behind\" the guilt verdict. She answered \"yes\" when asked whether she had reached the \"correct decision\" after \"individually applying the law to the facts.\"\n\nAfter this interview, the court solicited argument on whether to excuse Juror Jordan for \"good cause.\" \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The prosecutor favored excusal because Jordan had become distracted and sympathetic to the defense during the penalty phase. However, defense counsel objected to her discharge, saying \"we were all aware during voir dire of the situation involving her father which may have had some similarities to this.\" Counsel indicated, however, that he intended to address at a later time the question whether Jordan's participation at the guilt phase provided grounds for a mistrial.\n\nThe court ordered that Jordan be excused from further jury service. The ruling was based primarily on her distraught and distracted state, and the likelihood that her ability \"to hear, remember, evaluate, [and] concentrate\" was impaired. The court also expressed concern that Jordan's \"personal knowledge\" of facts disclosed at the penalty phase would undermine her ability to remain impartial. The court made clear, however, that Jordan could not have foreseen the similarities between defendant and her father, and that she was not guilty of misconduct. Other factors, such as the juror's own request for a discharge, were also cited in support of the ruling.\n\nThe court agreed with defense counsel that the validity of the guilt verdict was not presently under consideration. However, anticipating that the defense would ultimately raise the issue in a motion for new trial, the court observed that the circumstances justifying Jordan's discharge were not present at the guilt phase. The court seemed unwilling to credit Jordan's statement that she believed the Judge would decide penalty, since the jury's participation in both phases of trial had been thoroughly explored on voir dire. The court indicated that Jordan's confusion on the point - like her tardiness - probably reflected her impatience with the proceedings. The court was convinced that Jordan decided defendant's guilt based on a clear understanding of the facts and law.\n\nAfter the death verdict was rendered but before judgment was pronounced, defendant moved for a new trial alleging, among other things, that Juror Jordan was mentally incompetent at the guilt phase. (See § 1181, subd. 4.) At the hearing on the motion, each side presented testimony by an expert who had reviewed Jordan's jury questionnaire, the handwritten notes she made during trial, and the transcript of the hearing at which she was discharged.\n\nThe defense witness, Dr. Craig Rath, described in clinical terms the symptoms Jordan displayed at the time she was excused from jury service. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e While Dr. Rath believed she could have been similarly impaired at the guilt phase, he made clear that he could not confidently render such an opinion based on the available information. The prosecution's witness, Dr. Kaushal Sharma, agreed that Jordan was \"emotionally impaired\" at the time she was discharged, and that neither he nor Dr. Rath could reliably assess her competence at any earlier point in time. Dr. Sharma testified, however, that the deficiencies displayed by Jordan did not necessarily render her incapable of serving as a juror or making a fair and rational decision.\n\nAs noted earlier, the court refused to order a new trial. The court painstakingly reviewed the chronology of relevant events, including its observations of Juror Jordan and the transcript of the hearing at which she was excused. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The court also examined Jordan's notebook, which it found to be meticulous and consistent with the court's own notes at trial. As before, the court concluded that the factors warranting Jordan's excusal did not become problematic until the penalty phase, and that she was mentally competent at the guilt phase.\n\n2. Analysis. On appeal, defendant makes the sweeping claim that Jordan's participation in the case violated his \"statutory and constitutional rights to be tried by mentally competent jurors.\" However, defendant does not identify the statutory provision on which he relies, nor does he describe the constitutional standard of competence which jurors must meet. Defendant simply states, in conclusory terms, that Jordan was \"significantly impaired\" because of her strained relationship with other jurors, her mistaken belief that the Judge would decide penalty, and her sympathetic tendencies towards defendant.\n\nWe reject the claim. There is no evidence that Juror Jordan was incompetent under any applicable statutory standard. (See Code Civ. Proc., § 203, subd. (a)(8) [disqualifying persons who are \"the subject of conservatorship\" from jury service]; see also former § 198, subd. (a)(2) as amended by Stats. 1986, ch. 1171, § 1, p. 4165 [defining a \"competent\" juror as someone \"[i]n possession of his or her natural faculties and of ordinary intelligence\"].) \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Nor do we find a violation of defendant's due process right to a mentally sound tribunal. (Jordan v. Massachusetts (1912) 225 U.S. 167, 176; see Peters v. Kiff (1972) 407 U.S. 493, 501 (plur. opn. of Marshall, J.); id. at p. 509 (dis. opn. of Burger, C.J.).) Nothing in the record establishes that, by reason of mental disorder or developmental disability, Jordan was unable to understand the nature of the proceedings or to deliberate rationally. (United States v. Hall (4th Cir. 1993) 989 F.2d 711, 714; United States v. Vargas (1st Cir. 1979) 606 F.2d 341, 345-346; United States v. Allen (5th Cir. 1979) 588 F.2d 1100, 1106-1107 \u0026 fn. 12; United States v. Hall (10th Cir. 1976) 536 F.2d 313, 323; United States v. Dioguardi (2nd Cir. 1974) 492 F.2d 70, 78, 81; see Tanner v. United States (1987) 483 U.S. 107, 118-119.)\n\nThe record discloses only that, as the result of family and financial problems, Jordan experienced emotional stress that increased over time and ultimately threatened her ability to concentrate and retain information. Such stress evidently peaked midway during the first penalty trial, when personal information about defendant reminded Jordan of her father's unfortunate state.\n\nThere also were signs that Jordan had become increasingly frustrated and resistant in her attitude towards jury service, as evidenced by her habitual lateness and eventual failure to appear. However, such inappropriate conduct did not actually disrupt the trial until shortly before Jordan was excused for \"good cause.\" Aside from these attendance problems, no juror or other participant reported anything unusual about Jordan's behavior or appearance at any point in the proceedings.\n\nFinally, there was no indication Jordan had ever needed or received psychiatric care or counseling. No witness, including defendant's mental expert, suggested that Jordan displayed delusional or psychotic tendencies, or that she suffered from any condition that could impair her ability to rationally perceive, process, or exchange information. The court, which had witnessed the juror's demeanor throughout trial, found on two separate occasions that there was no reason to doubt her sanity or the integrity of the guilt verdict.\n\nWe therefore reject the claim of juror incompetence. Defendant was not entitled to a new trial on this ground. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIV. PENALTY PHASE ISSUES\n\nA. Jury Selection\n\n1. Denying defense challenges for cause. During voir dire at the penalty retrial, the defense moved to exclude several prospective jurors for cause. The trial court granted at least 11 of these challenges, and denied 3. Defendant maintains that the three prospective jurors whom the court refused to excuse were biased in favor of a death sentence. He claims violations of his right to a fair trial, impartial jury, and reliable penalty judgment. No reversible error occurred.\n\nTo preserve a claim of error in the denial of a challenge for cause, the defense must exhaust its peremptory challenges and object to the jury as finally constituted. (People v. Ramos (1997) 15 Cal.4th 1133, 1158-1159, citing People v. Coleman, supra, 46 Cal.3d 749, 770-771.) Defendant has not met this procedural requirement. He had eight peremptory challenges remaining at the time he accepted the jury as impaneled - far more than needed to excuse the three prospective jurors at issue here.\n\nMoreover, none of these three individuals ultimately sat on defendant's jury. Defendant could not possibly have suffered prejudice as a result of the court's refusal to excuse them at his request. (People v. Ramos, supra, 15 Cal.4th at p. 1159, citing Ross v. Oklahoma (1988) 487 U.S. 81, 86.)\n\n2. Excusing prospective jurors for cause. Defendant contends the trial court erred in excusing three prospective jurors on grounds they were biased against the death penalty and in favor of life imprisonment. The court granted the prosecutor's request to excuse two of these individuals for cause. The third prospective juror was excused by the court on its own motion, without objection from either side. Again, defendant claims violations of his right to a fair trial, impartial jury, and reliable penalty judgment. No error occurred.\n\nExcusing a prospective juror who expresses opposition to the death penalty is constitutionally permissible if the juror's views would \" ` \"prevent or substantially impair\" ' \" the performance of his or her duties in accordance with the instructions and oath. (Morgan v. Illinois (1992) 504 U.S. 719, 728; Wainright v. Witt (1985) 469 U.S. 412, 424.) Even where voir dire fails to elicit a clear answer, the trial court will sometimes be left with the \"definite impression\" that a prospective juror cannot be impartial based upon the juror's demeanor or tone. (Wainright v. Witt, supra, 469 U.S. at p. 426.) We generally defer to the trial court's assessment of the juror's state of mind on appeal, particularly where conflicting or ambiguous answers were given on voir dire. (People v. Cain (1995) 10 Cal.4th 1, 60; People v. Cummings (1993) 4 Cal.4th 1233, 1279.) Here, ample evidence supported the decision to excuse three prospective jurors - Coleman, Lopez, and Gillis.\n\nAlthough he equivocated to some extent, Mr. Coleman clearly favored life imprisonment and suggested he would never vote for death. Upon questioning by the defense, Coleman initially maintained that he was \"open-minded\" and would choose between life imprisonment and death \"based upon the facts.\" However, towards the close of defense counsel's examination, Coleman acknowledged that he might \"live to regret\" a death sentence and that such a decision could \"haunt\" him in the future. Obviously concerned about these remarks, the prosecutor asked a series of questions directed at whether Coleman could vote for death if such extreme punishment was warranted by the evidence. Coleman's first answer was equivocal (\"I don't know what I could do\"). However, all remaining responses left little doubt that he would have a \"problem\" imposing death and that life imprisonment was the \"maximum\" punishment he would consider.\n\nMs. Lopez's examination, though brief, revealed that she could not impose a death sentence under any circumstances. She announced at the start of defense counsel's examination that she was \"philosophically opposed\" to capital punishment. She explained that while she might not \"lose sleep over\" the execution of certain notorious multiple murderers such as Richard Ramirez and Ted Bundy, she did not believe the state had the \"right\" to take a life. When asked whether she could conceive of voting for death in a case involving only one murder victim, she said \"No, I can't.\"\n\nMr. Gillis demonstrated that he would have difficulty following the court's instructions and that his unconventional views would probably prevent him from imposing a death sentence. Gillis explained that he was not philosophically opposed to capital punishment, but that he would not vote for death because life imprisonment is \"much more stringent\" and serves \"Justice\" better in an aggravated case. Gillis also said that he would impose life imprisonment \"regardless\" of any instructions stating that he should impose death because it is the most severe punishment. Gillis never wavered in these views during extensive questioning from the court and counsel.\n\nIn light of the record and the deferential standard of review, we uphold the trial court's implicit finding that each of these three jurors was at least substantially impaired in their ability to apply the death penalty. We reject defendant's claim that they were erroneously excused for cause.\n\nB. Competence of Trial Counsel\n\nDefendant contends he received ineffective representation with respect to the investigation and presentation of mitigating evidence. These claims lack merit on appeal for reasons stated in many prior cases. As to each claim, either a plausible tactical basis for counsel's conduct can be inferred from the appellate record, or the record provides insufficient information from which to conclude counsel's actions were inadequate or ill advised. (People v. Mendoza Tello (1997) 15 Cal.4th 264, 266; People v. Pope (1979) 23 Cal.3d 412, 426.)\n\n1. Ex-wife's testimony. Defendant argues his ex-wife Nell was not adequately interviewed before trial, and that defense counsel did not know in advance \"what her testimony would be.\" This claim assumes Nell did more harm than good for the defense, and that no competent and informed attorney would have called her to the stand.\n\nDefendant's assertions concerning the scope of counsel's investigation are speculative only. Indeed, to the extent the record sheds any light on the issue, it appears counsel sought and obtained relevant information from Nell before trial. Before Nell took the stand at the first penalty hearing, counsel informed the court that he intended to present her testimony over the objection of defendant. Counsel explained that he had engaged Nell in an \"extensive conversation concerning the nature of potential testimony, background, and all information that she had,\" and that her testimony would be \"advantageous to the defense.\" The record does not support defendant's claim that counsel \"failed to interview\" Nell.\n\nMoreover, we cannot conclude that counsel miscalculated the risks and benefits of calling her to the stand. The jury learned through Nell that defendant's three children showed tremendous promise, and that Nell believed defendant deserved mercy. Although the prosecutor elicited on cross-examination that defendant had long been estranged from his ex-wife and children, the jury was nonetheless free to consider the feelings of these family members as a sympathetic factor warranting rejection of a death sentence. We cannot dismiss this strategy out of hand.\n\n2. Daughter's drug problem. On direct examination, Nell testified that defendant's second child, a 16-year-old daughter, had achieved a perfect grade point average in school. When defense counsel asked about an earlier \"problem\" with the daughter, the prosecutor objected on relevance grounds before an answer was given.\n\nAt a sidebar conference, counsel explained that he was attempting to generate \"sympathy\" by showing that defendant's daughter had suffered from a cocaine problem and \"chemical imbalance\" for which \"medication\" was successfully prescribed. The prosecutor responded that defendant had not been involved with his children for many years and could not take credit for his daughter's success or recovery. The prosecutor also believed the jury might speculate that because the daughter had suffered from a \"chemical imbalance\" - a foundational fact the defense was evidently not prepared to prove - her problem was genetic in nature and shared by defendant. The court sustained the objection. The information proffered about the daughter was not introduced.\n\nAccording to defendant, the foregoing exchange demonstrates that counsel failed to investigate a possible physiological basis for defendant's drug problem. The implication seems to be that counsel would not have asked about the daughter if he was fully informed about the father.\n\nWe simply have no basis on which to conclude that counsel failed to adequately investigate defendant's history of substance abuse. The record also does not establish that information about a \"chemical imbalance\" in defendant was available even upon reasonable investigation.\n\nMoreover, counsel could reasonably have chosen to explore the drug issue indirectly through defendant's father, who alluded to defendant's substance abuse and treatment history, and through defendant's ex-wife, who was asked to describe the daughter's drug problem. The defense may have been attempting to suggest that defendant suffered from physiological problems beyond his control, while avoiding the introduction of unflattering details that could have antagonized jurors and caused them to blame defendant for his drug abuse. Counsel did not deny such a strategy when confronted with the prosecutor's objections below.\n\nOn this record, no constitutionally deficient representation appears. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nC. Alleged Prosecutorial Misconduct\n\nDefendant insists the prosecutor committed misconduct and undermined the fairness and reliability of the proceedings in various ways during closing argument at the penalty phase. We agree with the Attorney General that all such claims are waived for failure to object at trial. (People v. Gionis, supra, 9 Cal.4th 1196, 1215; People v. Webb (1993) 6 Cal.4th 494, 533.) In any event, and for reasons explained further below, no prosecutorial misconduct occurred. No serious argument is presented that counsel was ineffective in failing to raise such claims at trial.\n\n1. Disputed remarks. We first summarize the prosecutor's closing argument as a whole. Disputed excerpts appear in italicized print.\n\nIn general, the jury was told that its primary task was to determine whether defendant had \"crossed over th[e] line\" and should receive a death sentence based on his criminal history and the capital crime. The prosecutor made clear that not all first degree murderers deserve the ultimate punishment, even where special circumstances are involved. The \"Adolf Hitlers or the Charles Mansons of the world,\" who clearly deserved death, were contrasted with people who had killed either in the heat of passion or accidentally during a felony and who might \"never be in a courtroom the rest of their lives.\" Referring to the court's instructions, the prosecutor told jurors to assign whatever moral or sympathetic value they deemed appropriate to the various factors, and to carefully determine whether aggravation substantially outweighed mitigation in defendant's case.\n\nThe prosecutor made clear that only three factors could be considered in aggravation - the circumstances of the capital crime (§ 190.3, factor (a)), defendant's three prior felony convictions (id., factor (c)), and the five other criminal transactions involving violence or the threat of violence (id., factor (b)). The prosecutor cautioned that even if some of the background and character evidence presented by the defense under section 190.3, factor (k) seemed \"negative,\" such facts could only be considered in mitigation and were \"not aggravating\" within the meaning of the instructions.\n\nThe prosecutor chronologically reviewed all crimes offered in aggravation and observed that defendant tended to react violently to the smallest provocation - an acquaintance seen in traffic, a deputy touching his arm, a stranger asking about a lost cat, and a friend spilling his drink. The prosecutor noted that the capital crime was motivated by the same petty concerns; defendant shot his helpless mother in the head because his father had refused to buy him a new cane and pair of shoes. Based on this destructive \"pattern,\" defendant was described as someone \"who doesn't care, has no feelings for anyone else, who's going to physically attack deputies, friends, associates, relatives.\" The prosecutor predicted that defendant would behave no differently if sentenced to life imprisonment without parole because there would be no incentive to change. \"What will provoke him [in such close quarters]? . . . [¶] Will the next weapon be a fist, a crutch, a fork, a knife, a sharpened bed spring? . . . [¶] How about the doctor, the nurse, cook, guard, [and] the other prisoners who don't deserve to be hurt by [defendant]?\"\n\nThe prosecutor then reviewed the case in mitigation. (\"I showed you prior [crimes]. What can the defense present? . . . They have to present something.\") Jurors were asked to balance defendant's good qualities as a youth - \"bright\" and \"independent\" - against misconduct revealed on cross-examination of his father. The prosecutor questioned whether defendant deserved sympathy based on his injured hip and possible need for a \"complicated operation\" since the injury occurred while he was burglarizing his brother's home and while his mother was near death in the hospital. Jurors were reminded that, aside from defendant's estranged ex-wife, no witness pled for mercy, including the father who knew him well and \"gave him chance after chance.\"\n\nThe prosecutor returned to his original theme that defendant was a violent recidivist who deserved no mercy. \"No one's going to accuse me . . . of being a bleeding heart, but not everyone who commits a murder warrants the death penalty. This defendant does. This defendant crossed that line.\" \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n2. Boyd claim. Defendant first contends the prosecutor improperly relied on character and background evidence offered in mitigation under section 190.3, factor (k) as a basis for imposing death. (People v. Edelbacher (1989) 47 Cal.3d 983, 1033, applying People v. Boyd (1985) 38 Cal.3d 762, 775-776 (Boyd).) According to defendant, the prosecutor violated this principle by commenting on defendant's personality and attitude towards others, his attributes as a young man, and the long-suffering nature of the father-son relationship.\n\nIt is true the prosecutor essentially described defendant as a heartless and dangerous person who would never change. However, this assertion was not based on the defense case-in-mitigation, but was explicitly tied to the \"pattern\" of violent crimes and felony adjudications which began in 1977, when defendant was convicted of robbery, and which continued through commission of the capital and San Diego crimes in 1986. Such negative references to a defendant's character and personality are permissible where, as here, they are based on evidence introduced in the prosecution's case-in-chief under section 190.3, factors (a), (b), and (c). (People v. Lucas (1995) 12 Cal.4th 415, 495; e.g., People v. Avena (1996) 13 Cal.4th 394, 443 [\"killing machine\"]; People v. Cummings, supra, 4 Cal.4th 1233, 1335 \u0026 fn. 72 [\"sociopath\"]; People v. Pensinger (1991) 52 Cal.3d 1210, 1251 [\"perverted maniac\"].)\n\nWith respect to all related instances of alleged misconduct, the prosecutor essentially maintained that defendant's character and background evidence was entitled to little mitigating weight either on its face or in light of unfavorable evidence adduced on cross-examination of defense witnesses. Such argument is proper. (E.g., People v. Avena, supra, 13 Cal.4th 394, 443 [prosecutor claims \" `there are no mitigating circumstances at all' \"]; People v. Arias (1996) 13 Cal.4th 92, 177 [prosecutor claims \" `mitigation doesn't really amount to much in its totality' \"]; see People v. Rodriguez (1986) 42 Cal.3d 730, 791 [discussing permissible scope of bad character evidence on rebuttal].) The prosecutor never stated or implied that evidence introduced under section 190.3, factor (k) could be used in aggravation, and instead told the jury the opposite was true. No violation of Boyd, supra, 38 Cal.3d 762, and its progeny occurred.\n\n3. Davenport claim. Defendant contends the prosecutor violated People v. Davenport (1985) 41 Cal.3d 247, 288-290 (Davenport) by implying that a deficient or absent factor in mitigation was itself an aggravating factor. However, the prosecutor's closing argument cannot reasonably be viewed in the manner defendant suggests.\n\nThe prosecutor made clear that he was relying on three circumstances in aggravation, all of which were based on statute and involved defendant's criminal background and history. This characterization of the case-in-aggravation was proper. (§ 190.3, factors (a)-(c); see People v. Keenan (1988) 46 Cal.3d 478, 510.) With respect to character and background evidence introduced by the defense under section 190.3, factor (k), the prosecutor maintained that such evidence was entitled to little mitigating weight and did not outweigh evidence offered in aggravation. Such argument was proper as well. (See People v. Scott (1997) 15 Cal.4th. 1188, 1220 [\"Although the absence of mitigation is not itself aggravating, the prosecutor may argue the evidence of mental state does not in fact mitigate.\"].) Other sentencing factors set forth in standard instructions read to the jury in this case were not mentioned by the prosecutor. Nothing in his closing argument stated or implied that the lack of evidence in such categories could be used as a factor in aggravation. (See § 190.3, factors (d)-(j); CALJIC No. 8.85.) No violation of Davenport occurred.\n\n4. Future dangerousness. Defendant suggests that the reference to future acts of violence in prison was improper because it was not based on facts \"specific\" to defendant or different from those present in any first degree murder case. Defendant seems primarily concerned about the sufficiency of the evidence to support the prosecutor's claim.\n\nNo misconduct occurred. It is settled that argument concerning a defendant's future dangerousness as a life prisoner is proper where it is based on evidence of past crimes admitted under one or more statutory factors in aggravation. (People v. Bradford (1997) 14 Cal.4th 1005, 1064; People v. Ray, supra, 13 Cal.4th 313, 353, and cases cited.) Here, the prosecutor asked the jury to infer from defendant's numerous crimes of violence, including his prior assault on a deputy in jail, that defendant was inherently dangerous and unlikely to change if incarcerated for the rest of his natural life. The assertion was reasonable, particularly since the prior crimes involved a wide range of victims, weapons, and precipitating events.\n\n5. Reference to other killers. Defendant claims the prosecutor interjected irrelevant and prejudicial matters into the sentencing determination by \"comparing\" defendant to mass and multiple murderers such as Adolf Hitler and Charles Manson, and by \"contrasting\" this case with other murder cases which the prosecutor characterized as more deserving of leniency.\n\nContrary to what defendant suggests, the prosecutor permissibly alluded to other cases and crimes in order to assist jurors in exercising their sentencing discretion. Viewed in context, the challenged remarks made clear that death was not automatically or necessarily appropriate in every first degree murder case, even those involving special circumstances, and that life imprisonment should be rejected based on the particular facts of this case. The jury could not have been misled by the prosecutor's remarks. (E.g., People v. Pinholster (1992) 1 Cal.4th 865, 964 [prosecutor responds to testimony of defendant's mother by arguing that \"Hitler [ ] probably had a mother who loved him\" too]; People v. Gonzalez (1990) 51 Cal.3d 1179, 1231, fn. 29 [prosecutor observes that death penalty is not limited to such \"atrocious\" cases as \"the Manson case\"].)\n\n6. Cost issues. Defendant insists the prosecutor \"encouraged\" penalty jurors to consider the expense of incarcerating defendant for life - a non-statutory and irrelevant factor in aggravation. (See People v. Morris (1991) 53 Cal.3d 152, 222, fn. 17.) As defendant seems to concede, however, the prosecutor never mentioned the cost of incarceration or execution, and did not discuss the cost of any special care defendant might require in prison, such as corrective hip surgery. The only allusion to taxpayer money occurred toward the end of closing argument when the prosecutor mentioned the child who had been denied an \"expensive\" life-saving operation and the unfairness of allowing defendant to live. No reasonable juror would believe that the two references to surgery were related or that defendant should be executed as a money-saving device.\n\n7. \"Bleeding heart\" remark. The final claim of misconduct concerns language to the effect that even though the prosecutor did not believe all murderers deserved death, \"[t]his defendant does.\" During the course of this statement, the prosecutor quipped, \"[n]o one's going to accuse me . . . of being a bleeding heart.\"\n\nOn appeal, defendant characterizes this passage as a \"personal recommendation\" of death based on the prosecutor's \"personal dislike\" for defendant. According to defendant, jurors would necessarily defer to the prosecutor's opinion on punishment, because they would assume it was based on special knowledge and expertise they did not have.\n\nWe have made clear that while the prosecutor \"may not state a personal belief that death is proper based on facts not in evidence, he may argue a belief that the facts of record warrant death.\" (People v. Scott, supra, 15 Cal.4th 1188, 1219-1220; accord, People v. Rowland (1992) 4 Cal.4th 238, 280-281; People v. Ghent (1987) 43 Cal.3d 739, 772.) Here, nothing in the prosecutor's argument, including the colorful reference to himself, could fairly be construed as a request for the death penalty based on factors unrelated to evidence admitted at the penalty phase. The challenged remarks were part of a broader discussion in which the prosecutor properly advised jurors of the gravity of the sentencing determination and their duty to carefully weigh the evidence in aggravation and mitigation. The prosecutor was obviously advocating a death sentence because the capital crime was particularly aggravated under the circumstances. No misconduct occurred.\n\nV. INSTRUCTIONAL CLAIMS\n\nA. Refusal to Instruct on Certain Lesser Included Offenses of Murder\n\nDefendant insists the trial court erred in finding no evidence of an unlawful and unintentional killing less serious than first degree murder, and in deciding that it had no duty to instruct on involuntary manslaughter and on forms of second degree murder not involving intent to kill. In a related vein, defendant contends counsel was ineffective insofar as he acquiesced in the court's decision and failed to request such lesser included offense instructions at trial. Under the particular circumstances, we find no basis for reversal.\n\nConsistent with the prosecution's theory that defendant entered the house and killed his mother in order to steal items his father had refused to buy, the court defined murder as an intentional and premeditated killing and, alternatively, as a killing which, even if unintentional, occurred during the commission of robbery or burglary. Instructions on second degree express malice murder were also given and approved by both parties. Thus, the jury learned that even if defendant was not guilty of first degree murder, he could be convicted of second degree murder if he shot his mother without premeditation but with the intent to kill.\n\nBecause Carlos, supra, 35 Cal.3d 131 applies in this case, special circumstance instructions setting forth the elements of robbery-murder and burglary-murder required the jury to find, among other things, that \"the defendant intended to kill Esta Millwee.\" (Italics added.) A standard charge prohibited the jury from determining the truth of the special circumstance allegations unless and until it had found defendant guilty of first degree murder. Robbery and burglary were each defined, and the jury was allowed to separately convict defendant of both felonies.\n\nIn discussing proposed instructions with the parties, the court acknowledged defendant's testimony that his mother allowed him inside the house to retrieve his own gun, and that the shooting occurred because he stumbled while carrying another gun, which he did not know was loaded, in a precarious manner. The court agreed with defense counsel that such testimony, if credited by the jury, established that defendant was guilty at most of grand theft. (See People v. Barton (1995) 12 Cal.4th 186, 194-195 \u0026 fn. 4 [lesser included offense instructions are required when there is a question whether the elements of the greater offense are present and there is substantial evidence that the offense was less than that charged]; see also People v. Flannel (1979) 25 Cal.3d 668, 684-685 \u0026 fn. 12; People v. Sedeno (1974) 10 Cal.3d 703, 715.)\n\nAs a result, the defense requested and received instructions explaining that the killing was excusable and not unlawful under any theory presented at trial as long as it occurred unintentionally through \"accident and misfortune\" and not during the commission of robbery or burglary. Special defense instructions advised the jury that grand theft was a lesser included offense of robbery and burglary, and that the timing of any intent to steal determined whether the greater or lesser offense had occurred: \"[R]obbery requires an intent to steal either prior to or during the commission of the act which resulted in the victim's death. If the evidence shows the intent to steal arose only after the victim died, then the taking will at most constitute grand theft.\"\n\nIn discussing whether any other lesser included offense instructions were required, the court observed that the evidence and instructions allowed the jury to convict defendant of murder and theft under a version of events not urged by either side - that defendant entered the house for the sole purpose of killing his mother, and that he decided to steal as an afterthought. However, the court found no evidence of an unlawful killing not involving either intent to kill or robbery and burglary, and found no reason to instruct on forms of unlawful homicide less serious than, or different from, the murder instructions ultimately given in the case.\n\nAccordingly, the court explicitly refused to instruct on involuntary manslaughter based on the theory that the killing occurred as the result of criminal negligence or during an unlawful act other than an inherently dangerous felony. (See § 192, subd. (b); People v. Prettyman (1996) 14 Cal.4th 248, 274; 1 Witkin \u0026 Epstein, Cal. Criminal Law (2d ed. 1988) Crimes Against the Person, §§ 518-523, pp. 585-593.) The court also declined to give second degree murder instructions involving either implied malice murder or felony murder. (See §§ 188, 189; People v. Nieto Benitez (1992) 4 Cal.4th 91, 111-112 [implied malice involves intentional act performed with knowledge of its life-threatening nature and with conscious disregard for life]; People v. Patterson (1989) 49 Cal.3d 615, 620-621 [second degree felony-murder rule applies to killings committed during certain inherently dangerous felonies not used to find first degree felony murder]; 1 Witkin \u0026 Epstein, supra, §§ 493-508, pp. 556-576.) When the court asked whether manslaughter or any other second degree murder instructions were necessary or requested by the defense, counsel said \"no.\"\n\nDefendant now insists there was substantial evidence that he killed his mother unintentionally, while committing an unlawful, reckless, or negligent act sufficient to support conviction of the crimes on which instruction was refused. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e He also suggests counsel had no legitimate tactical reason in failing to seek those instructions here.\n\nEssential to the foregoing claims is defendant's assumption that the omission of lesser included offense instructions \"primed\" the jury to find him guilty of murder as charged in this case. If the jury believed defendant shot his mother with no intent to kill but in the course of criminal conduct less serious than robbery or burglary, the jury supposedly had no choice but to convict him of first degree murder in order to avoid acquitting him of unlawful homicide altogether. He insists that nothing in the record precludes a finding of prejudicial instructional error on appeal. We disagree.\n\nWe have long held that erroneous failure to instruct on a lesser included offense is not prejudicial where \"the factual question posed by the omitted instruction was necessarily resolved adversely to the defendant under other, properly given instructions.\" (People v. Sedeno, supra, 10 Cal.3d 703, 721.) Here, as in prior cases involving analogous claims of error, no prejudice occurred. (People v. Prettyman, supra, 14 Cal.4th 248, 274-276 [failure to instruct on involuntary manslaughter harmless under Sedeno standard]; People v. Jackson (1996) 13 Cal.4th 1164, 1222 [same result as to failure to instruct on voluntary manslaughter].) Even assuming the evidence warranted instruction on degrees or theories of unlawful homicide other than those given, the instructions actually given and the verdicts actually rendered persuade us beyond doubt that the jury would not have adopted any such lesser degrees or theories.\n\nThe jury was fully and properly instructed on first degree murder, including the crimes of robbery, and of burglary based on entry with intent to steal, which underlay the prosecution's felony-murder theory, as well as all lesser non-homicide offenses supported by the evidence. Specifically, the court instructed on theft as a lesser included offense of robbery and burglary, making clear that if the intent to steal arose only after the victim was killed, defendant was guilty of theft, but not robbery or burglary. The jury rejected the theft option and convicted defendant on the robbery and burglary counts. In so doing, the jury necessarily rejected the defense version of events, found that defendant intended to steal when he entered the house and killed his mother, and agreed with the prosecution's theory of first degree felony-murder. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nSeparately and independently, jurors also received special circumstance instructions requiring them to determine whether the murder occurred in the commission of robbery or burglary, and prohibiting them from making this finding until they found defendant guilty of first degree murder. As noted earlier, the \"inten[t] to kill Esta Millwee\" was identified as an element of both felony-murder special circumstances. By finding the special circumstance allegations to be true, the jury necessarily and unanimously found, under proper instruction and in a context separate from the murder count, that the killing was intentional.\n\nUnder these circumstances, there is no possibility the jury would have convicted defendant of any degree or form of murder or unlawful homicide, other than first degree felony murder, which could be committed without intent to kill. The factual issue which defendant now claims was erroneously omitted from the instructions was resolved in a manner adverse to him at trial. His claims of reversible error and ineffective assistance of counsel must therefore be rejected.\n\nB. Standard Instructions and Routine Instructional Claims\n\n1. False testimony. The guilt and penalty juries received standard instructions identifying a wide range of factors bearing on credibility (CALJIC No. 2.20), and explaining that discrepancies within or between witness accounts could be the product of innocent misrecollection or honest differences in perception and do not necessarily mean such testimony should be discredited (CALJIC No. 2.21.1). With the approval of both parties, the trial court also gave the standard instruction concerning false testimony at each phase of trial. (CALJIC No. 2.21.2.) \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nDefendant claims the latter instruction is defective because it mandates wholesale rejection of a witness's testimony whenever such testimony is not fully consistent with the other evidence. Defendant theorizes that the instruction cast particular doubt on his credibility and unfairly limited the exculpatory and mitigating effect of his testimony in violation of due process and the right to effective representation. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nHowever, the challenged instruction has been repeatedly upheld as a correct statement of law. (People v. Johnson (1993) 6 Cal.4th 1, 48; People v. Beardslee (1991) 53 Cal.3d 68, 94; People v. Turner, supra, 50 Cal.3d 668, 699; People v. Lang (1989) 49 Cal.3d 991, 1023; People v. Allison (1989) 48 Cal.3d 879, 895.) By its own terms, CALJIC No. 2.21.2 permits - but does not require - a general inference of distrust where testimony is \"willfully false\" in \"material part.\" The instruction also authorizes rejection of the witness's testimony as a \"whole\" only where appropriate based on \"all the evidence.\" We decline to reconsider prior decisions permitting use of CALJIC No. 2.21.2 where supported by the evidence at the guilt or penalty phase.\n\nAs defendant seems to concede, there were significant differences between his guilt phase testimony and the prosecution's circumstantial case, which was otherwise largely uncontroverted. It does not follow, however, that the jury would conclude CALJIC No. 2.21.2 was primarily aimed at defendant. The instruction is phrased in neutral fashion and applies to witnesses called by either side. To the extent the jury could reasonably infer defendant was not testifying truthfully in whole or part, he was not entitled to a false aura of veracity. (People v. Turner, supra, 50 Cal.3d 668, 699; People v. Allison, supra, 48 Cal.3d 879, 895.) The instruction was properly given.\n\n2. Circumstantial evidence. Defendant challenges standard instructional language accepted by both parties to describe the sufficiency of circumstantial evidence at the guilt and penalty phases of his trial. (CALJIC Nos. 2.01 [guilt], 2.02 [specific intent], 8.83 \u0026 8.83.1 [special circumstance and related mental state].) As explained in prior cases, these instructions properly direct the jury to accept an interpretation of the evidence favorable to the prosecution and unfavorable to the defense only if no other \"reasonable\" interpretation can be drawn. Particularly when viewed in conjunction with other instructions giving defendant the benefit of any \"reasonable doubt,\" the circumstantial evidence instructions did not impermissibly diminish the prosecution's burden of proof. (People v. Crittenden (1994) 9 Cal.4th 83, 144, and cases cited; People v. Wilson (1992) 3 Cal.4th 926, 942-943.) No due process violation or ineffective assistance of counsel occurred.\n\n3. Unanimity. Defendant argues that aside from standard instructions requiring unanimity in order to convict him of first degree murder, the guilt jury should have been required to agree whether the underlying act was premeditated and/or committed in the course of a felony. Defendant insists felony murder is less \"culpable\" than premeditated murder, that lack of unanimity on this issue increases the likelihood of conviction even where some jurors have rejected a premeditation theory, and that the statutory scheme therefore fails to \"properly narrow\" the class of death-eligible defendants.\n\nIt is settled, however, that unanimity as to the theory under which a killing is deemed culpable is not compelled as a matter of state or federal law. Each juror need only have found defendant guilty beyond a reasonable doubt of the single offense of first degree murder as defined by statute and charged in the information. (Schad v. Arizona (1991) 501 U.S. 624, 630-645 (plur. opn. of Souter, J.); id. at p. 648-652 (conc. opn. of Scalia, J.); People v. Pride, supra, 3 Cal.4th 195, 249-250, and cases cited; People v. Chavez (1951) 37 Cal.2d 656, 670-672.) Moreover, California's capital sentencing scheme permissibly applies to persons found guilty of first degree murder with special circumstances under any applicable theory, including murder in the commission or attempted commission of certain enumerated and inherently dangerous felonies. (Pulley v. Harris (1984) 465 U.S. 37, 53; People v. Rodriguez, supra, 42 Cal.3d 730, 778, and cases cited.) Thus, the trial court did not err and trial counsel was not incompetent insofar as jurors were not told to agree on the reason for the first degree murder verdict.\n\n4. Reasonable doubt. With the approval of both parties, the guilt and penalty juries received CALJIC No. 2.90, the standard instruction establishing the presumption of innocence and requiring proof beyond a reasonable doubt. After defendant's trial, the United States Supreme Court determined that the same instruction, when read as a whole and notwithstanding certain antiquated references to morality, is not so unclear as to impermissibly dilute the prosecution's burden of proof. (Victor v. Nebraska (1994) 511 U.S. 1, 6, affirming People v. Sandoval (1992) 4 Cal.4th 155.) \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nDefendant contends Victor v. Nebraska is \"simply incorrect.\" However, here, as in other cases, we conclude the trial court did not err in giving the reasonable doubt instruction, and trial counsel was not incompetent in failing to request a modification. (People v. Ray, supra, 13 Cal.4th 313, 346-347, and cases cited; People v. Freeman (1994) 8 Cal.4th 450, 503.) No due process or other constitutional violation occurred.\n\n5. Aggravation and mitigation. The trial court gave the core penalty phase instruction directing the jury to \"weigh\" the applicable factors in aggravation and mitigation, and determine the \"appropriate\" penalty under the totality of the circumstances. (CALJIC No. 8.88.) Through a combination of standard and special instructions, the jury also learned that the prosecution was relying on three factors in aggravation: the circumstances of the capital crime, \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e prior felony convictions, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and other criminal activity involving violence or the threat of violence. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e (See § 190.3, factors (a)-(c).) Otherwise, the instructions listed all the factors which could be considered at sentencing and - like the statute upon which the factors are based - did not explicitly identify them as either \"aggravating\" or \"mitigating\" or define the quoted terms. (CALJIC No. 8.85; see § 190.3, factors (a)-(k).) The foregoing instructions were discussed by the court and counsel and accepted by both parties.\n\nDefendant first challenges CALJIC No. 8.88 insofar as it states, \"To return a judgment of death, each of you must be persuaded that the aggravating circumstances are so substantial in comparison with the mitigating circumstances that it warrants death instead of life without parole.\" Defendant contends this language \"predisposed\" the jury to choose death in violation of the right to jury trial and a reliable death judgment. The defect could have been cured, he suggests, by additional language describing when life imprisonment can be imposed, such as when aggravation is not substantial enough in comparison to mitigation.\n\nThe challenged language was taken directly from our majority opinion in People v. Brown (1985) 40 Cal.3d 512, as a substitute for the \"mandatory\" terms of the sentencing statute. (Id. at pp. 538-545 \u0026 fns. 13, 19.) We have repeatedly rejected claims that the instruction is inadequate or misleading in describing when the balance of factors warrants the more serious penalty. (People v. Arias, supra, 13 Cal.4th 92, 171, and cases cited.) \"By stating that death can be imposed in only one circumstance - where aggravation substantially outweighs mitigation - the instruction clearly implies that a sentence less than death may be imposed in all other circumstances.\" (People v. Ray, supra, 13 Cal.4th 313, 356.) The modification suggested by defendant on appeal was unnecessary at trial. (People v. Jackson, supra, 13 Cal.4th 1164, 1243; People v. Duncan, supra, 53 Cal.3d 955, 978.)\n\nDefendant next claims the trial court erred in failing to instruct, sua sponte, on the general meaning of \"aggravation\" and \"mitigation\" as reflected in language added to CALJIC No. 8.88 in 1989, after defendant's trial. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e We have made clear, however, that the quoted terms are sufficiently familiar to lay jurors and reflect matters of common understanding. Thus, whatever additional guidance it might provide (People v. Dyer (1988) 45 Cal.3d 26, 77-78), an instruction defining \"aggravation\" and \"mitigation\" is not required. (People v. Hawkins (1995) 10 Cal.4th 920, 965; People v. Malone (1988) 47 Cal.3d 1, 54-55.) There was no violation of defendant's right to due process, jury trial, and a reliable death judgment.\n\nDefendant also complains that the statutory scheme and related jury instructions are impermissibly vague because they do not explicitly state which factors are aggravating and which are mitigating. For reasons we have already explained, the aggravating and/or mitigating nature of the various factors is readily apparent without such labels, even in the face of contrary argument. (People v. Montiel (1993) 5 Cal.4th 877, 944-945; accord People v. Ray, supra, 13 Cal.4th 313, 359.) In all other respects, California's sentencing factors adequately guide the jury's discretion and convey the \" `common-sense core of meaning' \" necessary to pass constitutional muster. (Tuilaepa v. California (1994) 512 U.S. 967, 973, affirming People v. Tuilaepa (1992) 4 Cal.4th 569, 594-595.)\n\nOn a separate but related point, defendant observes that no instruction specifically defined \"circumstances of the crime\" under section 190.3, factor (a), or generally defined \"aggravation\" as a fact \"above and beyond the elements of the crime.\" According to defendant, a reasonable juror might have concluded that the bare \"elements\" required for conviction of first degree murder could be considered in aggravation as a \"circumstance\" of the crime. Defendant evidently believes that such \"double-counting\" of facts common to all first degree premeditated murders, or to all first degree felony murders, precludes any meaningful distinction between first degree murderers who receive death and those who do not.\n\nHowever, as defendant concedes, this argument has been rejected many times before given the manner in which our death penalty scheme permissibly narrows the class of death-eligible offenders and guides the sentencer's discretion. (People v. Ray, supra, 13 Cal.4th 313, 358; People v. Marshall (1990) 50 Cal.3d 907, 945-946; People v. Gates (1987) 43 Cal.3d 1168, 1188-1190; see Lowenfield v. Phelps (1988) 484 U.S. 231, 246 [\"the fact that the aggravating circumstance duplicated one of the elements of the crime does not make [the death] sentence constitutionally infirm\"].) In any event, aside from standard instructions directing the jury to consider all relevant factors in aggravation and mitigation, the defense requested and received a special instruction indicating that the mere fact that defendant \"has been found guilty of first degree murder is not itself an aggravating factor.\" Although such an instruction was not required (People v. Hawkins, supra, 10 Cal.4th 920, 966), it appears to address defendant's concern that he was sentenced to death based solely on facts or \"elements\" no different from those found in every first degree murder case. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nWe also decline defendant's request to reconsider prior decisions - too numerous to cite here - holding that the 1978 death penalty law and related instructions are not unconstitutional insofar as they fail to require explicit findings as to the aggravating factors supporting a death judgment, proof beyond a reasonable doubt of any such aggravating factors, and jury unanimity on the dispositive aggravating factors. (People v. Rodriguez, supra, 42 Cal.3d 730, 777-779.) The death penalty statute provides adequate safeguards against arbitrary death judgments and ensures guided sentencing discretion in the absence of such procedural requirements. (Ibid.)\n\n6. Lingering doubt. Defendant insists the trial court violated his constitutional right to due process, a fair trial, and a reliable penalty determination by failing to instruct, sua sponte, that the penalty jury could consider lingering doubt as to defendant's guilt of the capital crime as a mitigating factor. He also claims trial counsel was incompetent for failing to request such an instruction.\n\nAs conceded by defendant, the claim has been rejected many times before. \"It is true . . . that the jury's consideration of residual doubt is proper; defendant may assert his possible innocence to the jury as a factor in mitigation under section 190.3, factors (a) [circumstances of the capital crime] and (k) [any circumstance extenuating the gravity of the crime]. [Citations] But there is no requirement, under either state or federal law, that the court specifically instruct the jury to consider any residual doubt of defendant's guilt.\" [Citations.] (People v. Sanchez (1995) 12 Cal.4th 1, 77.) We decline to reconsider this principle here.\n\nVI. MISCELLANEOUS SENTENCING CLAIMS\n\nA. Automatic Motion to Modify the Verdict\n\nDefendant insists the trial court could not \"meaningfully\" rule on the automatic motion to modify the death verdict absent a requirement that the jury identify the aggravating and mitigating factors found to be true - findings which defendant insists must be explicit, unanimous, and without reasonable doubt. Defendant argues that the sentencing court otherwise had no basis on which to determine whether the verdict was \"contrary to law or the evidence.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nAs we have explained, there is no constitutional requirement of findings, let alone written or unanimous findings, that every aggravating factor weighed by the jury is true beyond a reasonable doubt. (People v. Rodriguez, supra, 42 Cal.3d 730, 777-779.) Nor does the absence of such a requirement impair the court's performance of its duties under section 190.4(e).\n\nIn describing these duties, we have said that the court is required to \"independently reweigh the evidence of aggravating and mitigating circumstances and then to determine whether, in the Judge's independent judgment, the weight of the evidence supports the jury verdict.\" (People v. Lang, supra, 49 Cal.3d 991, 1045, italics omitted; accord, People v. Jones, supra, 15 Cal.4th 119, 191 (plur. opn. of George, C.J.); id. at p. 203 (conc. and dis. opn. of Werdegar, J.); People v. Proctor (1992) 4 Cal.4th 499, 551.) Nothing in the statute compels or authorizes the court to parse the jury's evaluation of aggravation and mitigation, or to approve the manner in which it reached its penalty decision. In rejecting a claim similar to the one raised here, we have said that the sentencing court reviews \"the verdict of death itself and not any underlying `findings' \" subsumed therein. (People v. Berryman (1993) 6 Cal.4th 1048, 1107.)\n\nHere, the court clearly understood and complied with its obligation to review the evidence and independently determinate whether aggravation outweighed mitigation. The court emphasized two factors in aggravation - the circumstances of the capital crime under section 190.3, factor (a), and defendant's long history of assaultive behavior under factor (b). No mitigating factors were found. After \"reweighing\" the evidence, the court found that aggravation \"substantially outweigh[ed]\" mitigation and that \"the verdict of the jury was justified in this case.\"\n\nDefendant next claims the court could not properly uphold the verdict because it found insufficient evidence in aggravation. According to defendant, the court relied primarily on premeditation - an element present in many first degree murder cases, including those not eligible for the death penalty.\n\nDefendant misreads the record. The court never stated or implied that it was relying primarily on evidence of premeditation in denying the motion to modify the verdict. In describing the circumstances of the crime under section 190.3, factor (a), the court remarked, \"the crime had all the ear marks of a cold-blooded not an accidental killing. I heard no evidence to justify a belief that it was an accidental killing and would find under [factor] (a) that it was a very cold-blooded crime.\"\n\nAlthough the court's remarks were succinct, it appears to have found a \"cold-blooded\" and aggravated killing for reasons including, but not limited to, its premeditated and intentional nature. Based on the evidence and counsel's arguments at the modification hearing, such factors included the identity of the victim (defendant's mother), his exploitation of her vulnerable state (disabled and home alone), the motive (robbery), and the circumstances under which defendant fled the scene (leaving his mother to bleed to death). \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The record does not support defendant's narrow reading of the factors found by the court in applying section 190.3, factor (a) in particular, or in assessing the weight of aggravation in general. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The court did not err in denying the automatic motion to modify the verdict.\n\nB. Proportionality of the Sentence\n\nDefendant insists the death penalty is disproportionate as applied to him. To the extent defendant seeks \"comparative\" or \"intercase\" proportionality review, we adhere to the position stated many times before that such review is not constitutionally compelled. (People v. Webb, supra, 6 Cal.4th 494, 536, and cases cited.)\n\nTo the extent defendant contends the penalty is disproportionate to his individual culpability (People v. Dillon (1983) 34 Cal.3d 441), we reject the claim on the merits. Defendant murdered his mother in order to steal property from the family home, shooting her in the forehead from close range and, perhaps, while looking her in the eyes. Defendant then left his mother to bleed to death in the kitchen, where the body would be discovered by his father when he returned home from work. Defendant's claim of an accidental shooting was rejected by the jury and sentencing court. As noted by the court in denying the automatic motion to modify the death verdict, defendant's actions were \"cold-blooded.\"\n\nC. Cumulative Prejudice\n\nDefendant seeks to reverse the death judgment based on the \"cumulative effect\" of errors committed throughout trial. However, we have found no serious flaw in either the guilt or penalty phase. Our careful review of the record persuades us that the trial was fundamentally fair and its determination reliable. No grounds for reversal appear.\n\nVII. DISPOSITION\n\nThe judgment is affirmed in its entirety.\n\nBAXTER, J.\n\nWE CONCUR:\n\n[Editor's note: originally released as an unpublished opinion] Original Appeal XXX Original Proceeding Review Granted Rehearing Granted\n\nOpinion No. S014755\n\nDate Filed: May 18, 1998\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Two other witnesses were called by the defense to describe events at the Hi Ho Tavern that morning. Loretta Dumas, the bartender, testified that defendant was drinking coffee and waiting for his father when she reported to work. She saw defendant argue with his father outside, but could not hear what they were saying. Afterwards, when defendant reentered the bar, he was \"upset somewhat,\" but not \"angry.\" Brian Bradshaw, the owner of the bar, similarly testified that defendant seemed \"frustrated\" but \"not mad\" after the dispute with his father. Neither witness recalled seeing defendant drink any alcohol that morning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. On cross-examination, Criminalist Fox testified that even though he had investigated 400 gunshot cases over the course of his 24-year career, he had never before used a towel test to assess gun residue and firing distance. Fox decided \"at random\" to test-fire the Millwee rifle from three distances - ten feet, five feet, and point-blank range. He did not test the effects of firing the Remington at close range where no contact between the gun and target was involved, e.g., a distance of 12 to 18 inches. Fox also acknowledged that while the presence of residue around the outside of a bullet wound suggested a contact wound, the absence of such material did not invariably mean that the gun had been fired from a substantial distance. Fox also indicated that before learning of Dr. Root's contrary Conclusions in the case, Fox would have expected to find residue inside an entrance wound only where the gun had been fired at very close range, particularly where, as here, there was no exit wound.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Only Brian Bradshaw, the owner of the Hi Ho Tavern, was called to discuss events the day of the capital crime. He essentially repeated his guilt phase testimony that defendant did not seem particularly angry after arguing with his father outside the bar. Defendant did not testify at the penalty phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The sections of our Discussion labeled \"Guilt Phase Issues\" and \"Penalty Phase Issues\" do not include defendant's instructional claims, which appear under a separate heading near the end of the opinion. This format is preferable given the organization of the parties' briefs and the fact that many of the individual instructions challenged on appeal were given at both the guilt and penalty phases of trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Although Peasley was called to testify at the section 995 hearing, the defense withdrew him as a witness in an apparent effort to avoid disclosing sensitive or privileged information. As a result, Peasley's testimony was stricken from the record and is not cited here. In an abundance of caution, the trial court stated on the record that it saw no evidence of incompetence in Peasley's testimony about his conduct and strategy at the preliminary hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In addition to certain procedural requirements, section 1424 contained the following substantive standard at the time of defendant's trial: \"The motion shall not be granted unless it is shown by the evidence that a conflict of interest exists such as would render it unlikely that the defendant would receive a fair trial.\" Minor changes in this language, as well as expansion of the statute in other respects, occurred after defendant's trial and are not relevant here. (See Stats. 1996, ch. 91, § 1.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant's testimony at the recusal hearing was limited to describing statements Lough purportedly made at the preliminary hearing. According to defendant, Lough told Peasley something like, \"I don't think there's . . . facts for a special circumstances [sic] by the evidence presented in that case as he knows them, but he's going to shoot for them anyhow.\" Lough supposedly repeated this statement to a bailiff who was in court during the preliminary hearing. No witness corroborated defendant's account at the recusal hearing. The trial court found defendant's testimony implausible, and that it was far more likely Lough had commented on the close nature of the felony-murder issue and not on any alleged lack of evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The jury was instructed that defendant could be convicted of first degree murder on the theory that the killing was intentional and premeditated, or that it occurred in the commission of robbery and burglary. In addition, the charged crimes occurred after Carlos v. Superior Court (1983) 35 Cal.3d 131 (Carlos), and before Carlos was overruled in People v. Anderson (1987) 43 Cal.3d 1104. The jury was properly advised that intent to kill was an element of the felony-murder special circumstance allegations. (People v. Duncan (1991) 53 Cal.3d 955, 973 \u0026 fn. 4; In re Baert (1988) 205 Cal.App.3d 514.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The trial court instructed the jury in language suggested by the prosecution, as follows: \"Evidence has been introduced for the purpose of showing Esta Millwee's state of mind. Such evidence, if believed, was not received and may not be considered by you to prove that the defendant is a person of bad character or that he has a Disposition to commit crimes. Such evidence was received and may be considered by you only for the limited purpose of determining if it tends to show: (1) Whether Esta Millwee would have consented to the defendant's entering her home.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In an apparent attempt to show the unreasonableness of Esta's fear and mistrust, the defense began its cross-examination of defendant's father with a question about the most recent theft Esta blamed on defendant. The prosecution immediately requested a sidebar conference and warned that the defense was entering an \"awfully dangerous area\" in light of defendant's extensive history of theft from the family home. The trial court expressed similar concern. As a result, the court and counsel conducted a voir dire examination of defendant's father outside the jury's presence in order to assess the likely effect of continued cross-examination along these lines. As the prosecutor had predicted, defendant's father disclosed on voir dire that he and Esta believed defendant had stolen their property \"at least\" 45 times, including, most recently, a hunting rifle kept under the bed in the master bedroom. The prosecutor disclaimed any interest in presenting this evidence, and the court reiterated concern over its potential prejudicial effect. After a brief recess in which defendant and his counsel evidently discussed the tactical implications of exploring the basis for Esta's fear and mistrust, the defense abandoned this line of questioning and did not ask defendant's father or any other prosecution witness about specific bad acts Esta attributed to defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The trial court instructed the jury in a modified version of CALJIC No. 2.50, as follows: \"Evidence has been introduced of the defendant's testimony in another proceeding. Such evidence, if believed, was not received and may not be considered by you to prove that defendant is a person of bad character or that he has a Disposition to commit crimes. Such evidence was received and may be considered by you only for the limited purpose of determining if it tends to show in this case whether the defendant's testimony is truthful or untruthful. For the limited purpose for which you may consider such evidence, you must weigh it in the same manner as you do all other evidence in the case. You are not permitted to consider such evidence for any other purpose.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Defendant also argues that because instructions on first degree premeditated murder were \"not warranted by the evidence,\" they infected the factfinding process and created an \"aura of guilt easing the way for conviction\" of the charged crimes. However, the standard instruction given by the court on willful, deliberate, and premeditated murder is a correct statement of law. (CALJIC No. 8.20; People v. Perez, supra, 2 Cal.4th 1117, 1123; accord People v. Mayfield, supra, 14 Cal.4th 668, 767.) Substantial evidence supported such an instruction for the reasons stated above in the text. Hence, the trial court did not err in instructing the jury in this regard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This notice was provided a short time later and is not challenged on appeal. (See § 190.3.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Defendant challenges the prosecution's opening statement, as follows: \"Esta Millwee, in the early 1980's Esta - there was an aneurysm and she suffered a stroke. She was after that time for the first few years, she was paralyzed on her right side. She had - didn't have the use of her arm or hand or her right leg. As a matter of fact, at the time that that occurred, her husband was told - she was told, that she would never walk or talk again. That turned out not to be so, it was not an acceptable response to Esta Millwee. And over the last few years she had done quite well, she walked with the aid of a cane, and she talked fine. This is Esta Millwee's cane, which will become significant in a moment. (Indicating) [¶] Esta Millwee could take, perhaps, you know, one, two steps, and that's as much as she could manage. That cane was always within a couple of feet of her, wherever she was. She had no - she could not grip anything with her right hand. She could kind of cradle things by holding her arm across her body. Usually when she was at home, she had an apron with pockets in it where she would put cigarettes or a lighter or small objects that she - .\" Defense counsel objected at this point. Although the objection was overruled and the prosecutor resumed his opening statement, no additional information about Esta's physical condition was relayed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In response to a question asked by the court on voir dire, Dr. Root confirmed that he knew nothing about Fox's \"problems.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The instruction provided, in full: \"The question asked by [the prosecutor] as to Mr. Fox, that question was - the objection was sustained. I want to indicate that a question without an answer has no evidentiary value, and certainly anything that might be inferred from a question should not be considered. As to that particular question, the court considers it improper in the way it was asked. So, you should take no inference from that question, and I am asking you to disregard it.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The initial penalty trial began with the same jurors who had decided the guilt phase, one of whom was Juror Jordan. The initial penalty trial ended prematurely in mistrial for reasons unrelated to Juror Jordan and to any issue raised in the motion for new trial. The motion for new trial was made after a second jury heard evidence at the penalty retrial and sentenced defendant to death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The court cited section 1089, which states in part: \"If at any time, whether before or after the final submission of the case to the jury, a juror dies or becomes ill, or upon other good cause shown to the court is found to be unable to perform his duty, or if a juror requests a discharge and good cause appears therefor, the court may order him to be discharged and draw the name of an alternate . . . .\" (Italics added.) Under this provision, the court has broad discretion to investigate and remove a juror in the midst of trial where it finds that, for any reason, the juror is no longer able or qualified to serve. (People v. Ray (1996) 13 Cal.4th 313, 343-344, and cases cited.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Dr. Rath saw signs of \"anticipatory anxiety\" (apprehension about the future), \"emotional mobility\" (quick changes and free expression of mood), \"impaired attention\" (focusing on too narrow a range of issues), \"blocking\" (incomplete speech and thought patterns), \"circumstantiality\" (rambling speech and thought patterns), and \"acting out\" (carrying repressed feelings into action).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Judge Webster presided at the guilt phase through the first penalty trial and ordered Jordan discharged from the jury. Although judge Macomber handled the second penalty trial and imposed sentence, it was Judge Webster who considered and denied the motion for new trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Jury selection began in this case in 1989, shortly after Code of Civil Procedure section 198 was repealed and section 203 was enacted. (Stats. 1988, ch. 1245, §§ 1, 2, pp. 4140, 4144.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We also reject a related claim that the hearing on the new trial motion was \"inadequate\" because the court denied defendant's request to subpena Juror Jordan and subject her to examination under oath. The court had inherent authority to determine, within reasonable bounds, the information needed to rule on the motion. With Juror Jordan's consent, the court gave the defense access to her trial notebook. The court also considered expert testimony on both sides, granting continuances to enable each witness to appear. However, the court refused to compel Jordan's presence at the hearing because she had specifically complained to the court about \"harassment\" by the defense. The court also found no need for Jordan's testimony in light of the extensive, albeit unsworn, examination that occurred at the time she was excused. Under the circumstances, no manifest abuse of discretion appears.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Defendant states in an introductory section of his opening brief that the \"decision to call [defendant's father] as a mitigation witness was ineffective assistance of counsel under the circumstances of this case.\" Because this statement is not explained or substantiated elsewhere in the briefs, it is insufficient to trigger a cognizable claim. In any event, we have no basis on which to conclude that counsel was incompetent in presenting testimony through defendant's father, who evidently knew defendant well and could testify at length about his troubled life.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In arguing that a death sentence was appropriate under the particular facts, the prosecutor noted that difficult life and death choices are made on a societal level everyday. As an example, the prosecutor mentioned a recent television newscast about a child who was apparently denied a life-saving \"operation\" because it was too \"expensive.\" The prosecutor compared the innocent child, who did not deserve to die, to defendant, who deserved to pay the ultimate price for his crimes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant theorizes that an involuntary manslaughter verdict could have been based on his careless handling of a firearm or on \"stealing, trespassing,\" or the violation of unspecified \"firearms regulations.\" A second degree murder conviction could have been based, he asserts, on a finding that he killed unintentionally while committing such felonious or reckless acts as brandishing a firearm and being an ex-felon in the possession of a firearm.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The fact that the jury received instruction on the lesser included offense of theft based on after-formed intent, eliminates any possibility that the jury was presented with an improper \"all-or-nothing\" choice on the offenses of robbery and burglary. (See, e.g., People v. Turner (1990) 50 Cal.3d 668, 691-692; People v. Ramkeesoon (1985) 39 Cal.3d 346, 352-353.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. As given at defendant's trial, CALJIC No. 2.21.2 states: \"A witness who is willfully false in one material part of his or her testimony is to be distrusted in others. You may reject the whole testimony of a witness who willfully has testified falsely as to a material point, unless, from all the evidence, you believe the probability of truth favors his or her testimony in other particulars.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Defendant also argues in his opening brief that the instruction violated his right to have the sentencer consider all relevant mitigating evidence under Lockett v. Ohio (1978) 438 U.S. 586, 604, and its progeny. The Attorney General correctly observes, however, that separate guilt and penalty juries were impaneled, and that defendant's testimony at the guilt phase was not repeated at the penalty phase. Hence, CALJIC No. 2.21.2 could not have affected the penalty determination insofar as defendant's credibility as a witness was concerned. In any event, for reasons explained in the text above, the challenged instruction sets forth an appropriate test for evaluating the credibility of any witness at any phase of trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The version of CALJIC No. 2.90 given at defendant's guilt trial stated, among other things, that reasonable doubt \"is not a mere possible doubt; because everything relating to human affairs, and depending on moral evidence, is open to some possible or imaginary doubt. It is that state of the case which, after the entire comparison and consideration of all the evidence, leaves the minds of the jurors in that condition that they cannot say they feel an abiding conviction, to a moral certainty, of the truth of the charge.\" (Italics added.) The same basic instruction was given at the penalty phase, along with other language describing the sentencing facts to which the reasonable doubt standard applied. (See generally People v. Robertson (1982) 33 Cal.3d 21, 53-55 \u0026 fn. 19.) Thus, the penalty jury was instructed that any criminal act involving violence but not resulting in a felony conviction prior to the capital crime must be found true beyond a reasonable doubt before it could be considered in aggravation under section 190.3, factor (b). (CALJIC No. 8.87.) Similarly, prior felony convictions could not be considered in aggravation under factor (c) absent proof beyond a reasonable doubt that the defendant was in fact convicted of the prior crime. (CALJIC No. 8.86.) After defendant's trial, the Legislature modified the statute upon which CALJIC No. 2.90 is based to delete the phrases challenged here. (§ 1096, as amended by Stats. 1995, ch. 46, § 1.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Using language contributed by both parties, the trial court instructed the penalty jury as follows: \"For his actions on September 8, 1986, the defendant has been found guilty of murder in the first degree, robbery, burglary and auto theft. The prior jury found the murder occurred during the course of a robbery and burglary and that the killing was intentional. The circumstances of the crime may be considered as one aggravating factor. [¶] The fact that the defendant has been found guilty of first degree murder is not itself an aggravating factor. [¶] You may consider the circumstances surrounding the murder of which the defendant has been convicted in this proceeding in deciding whether death or life without the possibility of parole is the appropriate sentence. [¶] Although the jury found true the special circumstances that the defendant was engaged in the commission of a robbery and burglary at the time of the murder, for purposes of determining the penalty to be imposed, the multiple special circumstances should be considered as one if you believe that the defendant was engaged in a single act or an individual course of conduct.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The penalty jury received the following instruction based on CALJIC No. 8.86: \"Evidence has been introduced for the purpose of showing that the defendant has been convicted of the crimes of robbery and two separate convictions of petty theft with prior theft convictions prior to the offense of murder in the first degree of which he has been found guilty in this case. Before you may consider any of such alleged crimes as an aggravating circumstance in this case, you must first be satisfied beyond a reasonable doubt that the defendant was in fact convicted of such prior crimes. . . .\" Other instructions set forth the elements of robbery and petty theft with a prior theft conviction, and identified these crimes as felonies. (CALJIC Nos. 8.10, 8.21, 9.40, 9.41, 14.40.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The trial court gave an instruction based on CALJIC No. 8.87, as follows: \"Evidence has been introduced for the purpose of showing that the defendant has committed the following criminal activity: the incident[s] involving Mr. Marich, in the San Bernardino jail, in the park, in San Diego, and at the lake[,] which involved the express or implied use of force or violence or the threat of force or violence. Before you may consider any of such criminal activity as an aggravating circumstance in this case, you must first be satisfied beyond a reasonable doubt that the defendant did in fact commit such criminal activity. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The current version of CALJIC No. 8.88 states, in part, \"An aggravating factor is any fact, condition or event attending the commission of a crime which increases its guilt or enormity, or adds to its injurious consequences which is above and beyond the elements of the crime itself. A mitigating circumstance is any fact, condition or event which does not constitute a justification or excuse for the crime in question, but may be considered as an extenuating circumstance in determining the appropriateness of the death penalty.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Defendant cites People v. Melton (1988) 44 Cal.3d 713, 768 (Melton), for the proposition that the same facts cannot sustain both a special circumstance finding and an aggravating factor at the penalty phase. Defendant misstates the law. The statutory scheme explicitly authorizes the sentencer to consider the \"circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true . . . .\" (§ 190.3, factor (a), italics added.) We have also approved \"triple use\" of the same facts to sustain a first degree murder conviction under a felony-murder theory, a felony-murder special circumstance finding, and selection of a death sentence. (People v. Webster (1991) 54 Cal.3d 411, 456; People v. Marshall, supra, 50 Cal.3d 907, 945-946.) Such cases are based on the notion that the facts underlying a special circumstance finding serve distinct purposes at different phases of trial, and that a normative - not mechanical - process is used to weigh the various factors in aggravation and mitigation and to select the appropriate penalty. (People v. Ray, supra, 13 Cal.4th 313, 358.) Nothing in Melton, supra, 44 Cal.3d 713, is inconsistent with this view. Indeed, we rejected a claim in Melton that where the killing occurred during an \"indivisible\" transaction in which robbery and burglary were committed pursuant to a single criminal intent, no more than one felony surrounding the murder could be considered under section 190.3, factor (a). Disapproving contrary language in the plurality opinion in People v. Harris (1984) 36 Cal.3d 36, 63-66 (Harris), a majority of the court in Melton found it statutorily and constitutionally permissible for the sentencer \"to determine that a death-eligible murderer is more culpable, and thus more deserving of death, if he not only robbed the victim but committed an additional and separate felonious act, burglary, in order to facilitate the robbery and murder.\" (44 Cal.3d at p. 767.) Melton recognized, however, that because factor (a) literally directs the jury to consider both the \"circumstances\" of the capital crime and any attendant \"special circumstances,\" there is at least a \"theoretical\" chance that the jury might weigh the robbery and burglary \"more than once for exactly the same purpose.\" (44 Cal.3d at p. 768, italics omitted.) Melton observed that the risk of actual prejudice is remote, and that a clarifying instruction directing the jury to avoid this particular form of double-counting should be given, but only on request. (Ibid.) Here, the defendant requested and received a special instruction far more favorable than necessary under Melton. Defendant's instruction echoed the reasoning of Harris - now defunct under Melton - that the robbery-murder and burglary-murder special circumstance findings should not be given independent aggravating weight, and \"should be considered as one if you believe that the defendant was engaged in a single act or an individual course of conduct.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Section 190.4, subdivision (e) (section 190.4(e)) states in pertinent part: \"In ruling on the [automatic motion to modify the death verdict], the Judge shall review the evidence, consider, take into account, and be guided by the aggravating and mitigating circumstances referred to in Section 190.3, and shall make a determination as to whether the jury's findings and verdicts that the aggravating circumstances outweigh the mitigating circumstances are contrary to law or the evidence presented. The Judge shall state on the record the reasons for his findings.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. For example, in urging the court to deny the section 190.4(e) motion, the prosecutor noted that defendant \"went into his mother's home, and as the jury found, he intentionally murdered his mother. A person who is particularly vulnerable. He knew he had no right to be there. That he was not welcome at that location. [¶] And what did he do after he murdered his mother, after he put a bullet in his mother's forehead? He took her cane. Not 911. Not helping anyone. Not a call for help. He stole her cane and her car and left, with a gun to sell. It is very difficult to imagine a colder more callous person than Donald Millwee.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. We also reject defendant's assumption that the court cannot consider or double-count the \"bare elements\" of the capital crime as an aggravating factor in ruling on the modification motion. Section 190.4(e) directs the court to take into account \"the aggravating and mitigating circumstances referred to in Section 190.3.\" As explained earlier in the text, facts used to sustain the murder and special circumstance verdicts may be considered as a circumstance of the crime under section 190.3, factor (a). Thus, nothing prevented the court from relying on the \"element\" of premeditation in deciding whether to uphold the death verdict under section 190.4(e).\u003c/span\u003e\n\n",
    "body_length": 171275,
    "citedas": [
      "18 Cal.4th 96",
      "954 P.2d 990",
      "74 Cal.Rptr.2d 418",
      "98 Cal. Daily Op. Serv. 3757"
    ],
    "attorneys": "Attorneys for Appellant: Michael H. Shapiro and Susan A. Kerans, under appointments by the Supreme Court, for Defendant and Appellant. Attorneys for Respondent: Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Gary W. Schons, Assistant Attorney General, Garrett Beaumont and Barry J. T. Carlton, Deputy Attorneys General, for Plaintiff and Respondent. Counsel who argued in Supreme Court (not intended for publication with opinion): Michael H. Shapiro 317 South Norton Avenue Los Angeles, CA 90020 (213) 740-2562 Barry J. T. Carlton Deputy Attorney General 110 West A Street, Suite 1100 San Diego, CA 92101 (619) 645-2272",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "George, C.j. Mosk, J. Kennard, J. Werdegar, J. Chin, J. Brown, J.",
    "citation_count": 398
  }
}
